{"id": "t5_2tand_t3_qgj92e_t1_hi8gr0n", "creation": 1635334370, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ElegantConnection712", "text": "I was in a similar situation a couple of years back, after dating a lot of women.\n\nI had some immense frustrations dating some 5 years ago - women using me for hookups, one woman had fucking bedbugs and just wanted somewhere else to sleep (and didnt give a crap about giving it to me as well), another one went on a full on tirade on a different couple while we were out on a date, because she heard the man telling a joke she didnt like to his date, full on screaming like a psycho. One woman telling me to fuck off because I was dating other women, which I wasn't. Constant random ghosting. It was emotionally gruelling. I found myself slowly becoming unable to care for the women i dated, as it was the only way I could defend myself emotionally. Some of it was random luck, some if it was me needing to grow as a person. At some point I tried putting in as many dates as possible in a week, because obviously they weren't going anywhere anyway, and I might just get it over with. I grew cold, distant and and uncaring, which obviously didn't help me. I got super good at dealing with rejection nicely, because who gave a fuck about that person in the first case, right? \n\nDepressed, I installed an autoswiper on my phone, because if I was to be rejected, then at least I could skip the the part where people rejected me outright because of a picture on tinder, and at least I didn't have to even invest a swipe on them. It was the only way I could figure out to deal with the constant emotional torment I was experiencing. I just couldn't take any more emotional abuse, and by then the smallest thing just set me off. \n\nStuck between loneliness and always feeling like a used up shit sandwich, I stopped dating, and figured I might as well die alone and considered suicide. \n\nAnyway, i came to my sense and realized I had to do something to just feel better. I stopped dating entirely and took a break. After a while, I started going to events and just focused on having just fun and making friends. At home, I did meditation to try and learn how to control any emotional moodswings so I wouldn't feel as hurt anymore. I tried to hold my expectations as low as possible and just be friendly and nice to everyone around me. Roughly... 6 months after that, not only did I have a fantastic girlfriend, I somehow ended up having women throwing themselves at me whenever I just hung out with friends doing fun stuff. (Something I never acted on. I'm not that kind of guy.) Weird shit. I've never been social nor considered myself a catch, so it did poke my ego in a nice way. Now I have kids and a family.\n\nSo here's my advice: Stop dating for a while. Live life. Focus on the good stuff and try to be happy in your self.  Expect nothing. Oh, and entirely ditch dating apps. They are waste of time. They're low effort - and if youre serious about dating, the last thing you want is low effort.\n\nAlso:\n> most of them have porn addictions and do nothing but play video games all day\n\nMost men are going to be looking at porn. They are single. Single people need to express their sexuality. Make sure that you are separating addiction from just having a sexuality and being alone. Unless you're into dating mormons or amish, odds are the guy you will date will at some point look at porn.\n\nMost men are going to play video games. Video games are great hobby, it's cheap and most of them are either intellectually stimulating or socially stimulating. Hobbies are great, because after dating a while, you need to be able to do things of your own next to each other, or you will drive each other crazy. You'll have some of those truly golden moments with each other, but you can't have that all the time because it would be exhausting. So try and find a videogame you like and play it with them. Or a hobby you can do next to them while talking about whatever and just plain hanging out. People need to unwind, so make sure you are someone they can unwind with. \n\nEnd rant. Good luck.", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hi8gr0n/"}