{"id": "t5_2tand_t3_qgj92e_t1_hia8cbd", "creation": 1635361962, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rocksteady2R", "text": "Well, shit.  I just erased a comment that started with \"i think this time I'll refrain from giving advice...\" because i realized i had an option for you that i hadn't seen in the comments yet.\n\nso... I hear your story about the growing hates - and presumably fears, if i can add my own words.   It's a fair result of being misused or abused or objectified. I also hear your own fears of carrying this forward and letting it take more root in your personality than you want; you want a way out (again, my words, obviously.).\n\nso... My own bit of advice is this:  Join a women's group.   A few years ago I joined a mens group (Mankind Project), and ... shit - to say it has been transformative implies that it's only helped me change.  But I've seen other men change, I've seen other men talk about their fears, their shames, their angers.   And when I hear a man do this, more often than not, I find a parallel to my own story, and therefor their lessons, their momentary impetus for change becomes my my lesson, my impetus for change.  It has given me new beacons in the fog to light my way.  it gives me safe spaces to take a rest, and the bravery to take the next step.   Melodramatic in it's telling, perhaps, but nonetheless MKP has helped me work on becoming that better me I always dreamed of.  Am I there?  no, and I don't think it's a destination anymore - it ***is*** the path forward though - facing my fears and shames in a moment, and 'taking care of them', whatever that looks like.\n \nOur sister [organization is called Women Within](https://www.womanwithin.org/), and if you're in or near a fairly big city, there's likely a small-group near you.  the MKP does small-group meetings anywhere from 1x weekly to 1x monthly, depending on the needs of the group.  Mine meets bi-weekly.  Anyhow.  each small-group has some small 'agreements' to be made (confidentiality being the primary), and most are open to visitors, with some advanced notice.  With covid, it's likely that you can find zoom meetings, too.   Beyond that, though - I do not know how much the women's group parallels our own in form or structure, let alone methods. \n\nAnyhow.   wish you the best.", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hia8cbd/"}