{"id": "t5_2tand_t3_qgj92e_t1_hiatymi", "creation": 1635370297, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "-ThePathIsTheGoal-", "text": "First I’d just like to say that it takes a lot of courage and self awareness to admit this to yourself and to come here for help. Most people live in denial and their problems stay the same or snowball.\n\nIt’s very common and even trendy in today’s age to be anti-men. Watch almost any commercial on tv and the men are portrayed as doofuses, sleazy, incompetent, etc. The propaganda in this way is very strong. Also in terms of propaganda, men, but especially women, have been sold a lie on the Disney fairy tale life.\n\nAlmost everyone has an expectation that there is a perfect prince or princess out there for them that will love them unconditionally, and they will grow old together and die holding each other’s hands. I’m not saying that something resembling that CANT happen, but it’s much more rare than tv, movies, books, or the media in general would have you believe.\n\nIt is ok to accept that humans want something from you. It’s human nature. The nice guys always want something in return (holds door open, expects blowjob for everyday common courtesy). \n\nYou need to start becoming more ok with a more ruthless/cutthroat view of life, because unfortunately we are still very primal animals, and this is just one big jungle. We just happen to have iPhones too.\n\nMost men today are indeed porn addicted simps. You are wrong for that observation of yours.\n\nI guess the last bit of advice I will give, would be to place more importance on the quality of the guy you’re willing to settle down or be with, rather than settling down at any cost. You’ve probably witnessed many girls you know settle down with dad-bod, soft males that most likely wouldn’t have gotten a hint of ass in HS or college. This is largely due to these girls feeling the pressure of society, and the pressure of their immediate friends settling down, and they quickly pull in just about anyone to settle down with themselves. These men are just chosen to fit a role in the narrative. The narrative itself is the most important thing for these gals, not the guy himself, and paradoxically they end up completely miserable most of the time.", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hiatymi/"}