{"id": "t5_2tand_t3_qgj92e_t1_hi95f9t", "creation": 1635346548, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 11, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "throwawayskeez", "text": "Oh my gosh, I guess I shouldn't be surprised by some of these responses, but I still am.  \n\nI have been in the same spot as you.  Anyone saying 'women are just as bad,' or 'you should just find better men' are completely overlooking the issue.  It completely overlooks the fact that there is deep rooted, systemic sexism in our cultures, and men are socialized to view women a certain way.  A man would have to specifically do a lot of introspection and reflection to understand this, and that is something that is pretty hard for anyone to do. \n\nYou're response to being aware of this, and your trauma, are both valid and understandable.  The issue is more that it is making you hate half of the people in the world, and of course violence is not the answer.  In a more real way, taking this out on your younger brother is NOT the answer.  He is a child, and an individual, and should be nurtured as such. \n\nWhat worked for me is therapy, and learning to set very hard, firm boundaries.  My biggest shock, and my biggest takeaway, is how few men that left in my life. I suspect you will find the same.  Only allowing men in your life who are truly respectful of you, and not AS a woman, but in SPITE of you being a woman, or BECAUSE you are a woman, will leave you with very few men in your circle.\n\nThis is not because men are inherently evil, or even inherently sexist.  They are not.  They are just as much victims of our very very sexist, very very patriarchal society as we are.  They have been socialized to be this way, and that makes it FEEL natural and organic to them.  It's ok to understand this about them, and still hold the shitty ones accountable. \n\nAnother huge thing I did was get out of a male dominated field.  I tried my best for 10 years to advance the cause, and at the end I was just exhausted and traumatized.  If you are highly sensitive to micro aggressions, any male dominated field might not be the best fit for you. \n\nAnother thing you can do is start to lurk in male-positive spaces.  I like hanging out in r/menslib.  It gives me better insight into men who are self-reflective, and considerate, and provides me with perspective on the struggles they face that isn't framed as aLL FeMaLeS r BaD tOo\n\nBut honestly, I would look into therapy.  Not to change your mind, exactly, but because you have clearly experienced trauma, and a good therapist can help you reframe that and learn coping skills.  If I were you, I would do that not just for yourself, but also your little brother.", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hi95f9t/"}