{"id": "t5_2tand_t3_qgj92e_t1_hi8kmbl", "creation": 1635336709, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "sweetypantz", "text": "First off I can already see that a lot of these comments aren’t going to be helpful, especially if you have little to no positive experience with men. \n\nThe solution to the problem really is to have positive interactions with men but that might not be safe to try. Following good men on social media helps, I started following Justin baldoni great example. I went through a phase of really despising men, but I needed to go through it. Frankly I wasn’t seeing things clearly, and you’re not either. But it’s really hard because a lot of men really are awful.. and they go around making lots of lives miserable so it magnifies the effects. Then there’s the subtle stuff of men being socialized without emotional understanding that makes even well-intentioned men push boundaries. Basically I’m saying I understand, and you should protect yourself…\n\nBut if you keep this hatred it will eat at you, not these men. Why? Because it’s not healthy to hate half the population and more spiritually, you have masculine features within yourself that deserve to be loved. This ironically, when embraced, is what allows you to protect yourself from men who don’t embrace their feminine side and therefore lack empathy and wisdom. Masculine energies go, do and protect. Feminine are, nurture and receive. Yin and yang, not video games and makeup. Anyway, just go through this phase, with the goal of getting out eventually. I know a lot of people say not to date,  but dating men is actually what allowed me to see that men are just as fragile, broken and unloved as we can feel. They just act out differently, which is why I don’t date much anymore", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hi8kmbl/"}