{"id": "t5_2tand_t3_qgj92e_t1_hi8m8gu", "creation": 1635337611, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "emily12587", "text": "Coming from an extremely patriarchal culture ( Islamic and south Asian) I witnessed heard, experienced so many extremely disgusting and violent  behavior from my parents and just staying at that country even just for a while every time I’m there. Also they excused and made a whole religion to ensure women can be so called wife material where they get to marry children even when their silence is deemed consent. Then I realized how possessive and violent men with women all over the world, no matter th religion or culture, even in the US and UK you have to be on your gaurd in case someone tries to stalk you even your domestic abuser/ex. And then men still continue to degrade and could care less about our wellbeing but more so of how much use you can be to him but expect the same(specially men from our culture) but I have rarely seen men even among friend groups to treat your opinions , and women as equal human beings with respect. It’s probably because we have way too many house mommas spoiling their sons cuz their husband is shit but still raising a right man is possible just would be extremely hard if he’s surrounded by highly testosterone men obsessed with sex. That’s how I see it, cuz only two men in my life tht I saw to have high emotional intelligence and treats me like a person, is those who were raised with high educated mother or at least without a good school system, with alot of girls. But I still say a large majority of men still believe women exist for them and their only role in life is to get laid or settle for any girl for basic connection. When really they should be trying to strengthen their friendships with males over being scared to be labeled gay", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hi8m8gu/"}