{"id": "t5_2tand_t3_qgj92e_t1_hi9dsc2", "creation": 1635349960, "origin": "t5_2tand_t3_qgj92e", "height": 1, "replied_to": "t5_2tand_t3_qgj92e", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Zahharcen", "text": "Indeed they have been, but it is perception. If I eat shitty cakes all my life I will grow to hate cakes, I might think all cakes are bad. So then I try new cakes, or from somewhere different, but since I go in hating them cakes all the mediocre/decent ones seem irelevant and I will remember only the bad ones. Because in reality I am not starting from 0 but from negative whatever. Therefore I don't need a decent cake to be satisfied I need an exceptional one and even then, that's the exception. See how this way of thinking is flawed? And honestly this metaphore fails to mention that human beings can change, oh yes their core doesn't really change, but the way they express that does, and there is also situational stuff. Anyhow I have pretty naive nature, but if you really look most people are decent.\nSo let me be direct, she doesn't imagine anything per se, the men are shitty, but she may be ignoring the decent ones.\n\nAlso your argument to not keep trying is simply stagnation. You accept the fact that you may need a lot of time, that you are traumatised even deeply, but you don't give up. You may say I can't right now, but you try again. Plus this criticism is misplaced, she asked how to solve said issue, I responded with personal experience+keep trying. It's what helped me the most.\n\nAnd the last one about the danger of men, yes I agree men are dangerous. Just like anyone can be dangerous. But being specific men are dangerous to women. That being said, I've had people treat me like an invalid for something that is not in my power all my life. Do I now give up on humanity because I'm traumatised? I will vent, I will scream that people are shit but I will not sit and watch while the past ruins my future. Some men will hurt you, in many ways and there is nothing you can do about that honestly, all you can do is try to find the best.\n\nBut again this is what I use to justify my own way of thinking, this is honestly what I believe, if you think I am wrong let me know, I don't get much of a chance to go this indepth.", "permalink": "/r/DecidingToBeBetter/comments/qgj92e/how_do_i_stop_hating_men/hi9dsc2/"}