{"id": "t5_2tand_t3_a8xt60_t1_ecggsag", "creation": 1545660791, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "saito200", "text": "> My parents are very babying. Especially my Dad. Always did everything for me because he was convinced I couldn't do anything on my own. Made sure I never had to struggle with anything\n\nI see a big problem here\n\n> since I was still living at home I was able to leverage this and pay off all my loans and basically save my entire checks\n\nThat's something you can see as a positive, many people have debts, you don't\n\n> Everyday after work I go to my parents house where they make dinner\n\nPerhaps you stop doing that for some time, and see what happens. The worst case is that you won't change, the likely thing to happen is that you'll become more independent in habits and in personality\n\n> On the weekends I wake up and just go straight to my parents where they make breakfast, dinner, and I pretty much sit there all day because I don't really want to be sitting alone in my apartment\n\nLol dude isn't there anything else you want to do? You spend FAR TOO MUCH time with your parents, you gotta spend time around OTHER PEOPLE. That will make you grow up.\n\n> I have a lot of savings\n\nGOOD FOR YOU. Take a 6 months (or more) sabatic, learn to ride a motorcycle, go to south east asia. You WILL NOT regret doing that. If you get tired, you can always go back home before.\n\n> I worry that I am at an age now where most women are married with families. Single woman at this age are probably divorced with kids, which is something I don't want\n\nIn western Europe (where I live), most women are unmarried at 30. It's normal that you're concerned. Do something about it. Try to take an engineer mindset and approach it from a problem solving perspective, instead of being so emotional.\n\n> I tried the meetup stuff but it just hasn;t been a success really. It's always the same outcome. Show up, awkwardly sit around and maybe talk with a few people. Have an ok time but nothing ever really comes of it.\n\nYeah that's how meetup goes. Think of two things: 1/ It's \"social training\". It's better to talk to people in a meetup than not talking to people at all 1/ Are you putting on your side to have a different outcome? If you're sitting in a corner awkwardly, like 50% of the people there, do you really expect to magically acquire friends / dates? If you want something, you have to proactively work for that. That is particularly true for dating. You have to be an active subject.\n\n> I listen to morning radio shows where they do paternity tests and the crazy drama that people in relationships go through\n\nDon't pay much attention to that. Shows are shows, they need engaging content, what you see there is on the far side of the dramatic spectrum. Don't assume that relationships are what you see in the radio / tv\n\n> The only thing going for me is that I have a lot of savings, I am maxing out all my retirement accounts, etc\n\nMan that's a big thing!! Don't subestimate that achievement! You should be PROUD of that\n\n> I have this constant feeling like I should be doing something great and amazing. That I should be living my life to the fullest, but I have absolutely no idea what that means\n\nI think that is kinda new age bullshit that we've somehow got into our heads by the motivational guru talk. I understand your feeling, I have it sometimes. Life is hard on itself, every change we feel we need stems from a problem. This idea of \"living my life to the fullest\", if you look at what it does to you, it creates an expectation about your day to day experience that is just impossible to be realized. It's an idea that generates constant stress, for whatever positive outcome might produce eventually, I'm not sure that's worth it. Perhaps you should dismiss it, or at least understand what it means for you, put it into a more concrete form. \"Living life to the fullest\"? What the fuck does it mean anyway? This idea has only ever generated stress to me.\n\n> I have this constant feeling like I should be doing something great and amazing\n\nYou know what IS something great an amazing that you can be doing, and is a true challenge to yourself? To change your life so that you live in a more satisfactory way. I think that just by positing this you're on the right track. Realize that something is wrong with your life. Identify exactly what is wrong. Realize that you are the only person who can change it, by acting daily and consciously. Realize that life is going to suck for sometime, and that things will stay the same for some time, until your daily action compounds into results, and ACCEPT IT. Take it and accept it.\n\nIf you manage to change in the positive direction. THAT IS GREAT AND AMAZING. If you manage to do that, you're your own personal savior and hero, and worthy of praise and respect.\n\n> And I feel like 1 week vacations to different places wouldn't give you enough insight to make a decision like that. Property taxes where I live are just ridiculous. Some of the highest in the country.\n\nConsider the idea of relocating. Work in another country, in another company. Since you have lots of savings, you have lots of flexibility. And you have a useful skill. I'm kinda jealous of you to be honest. I'm studying programming by myself and I'm 34. I have little savings. Living with my father. Life sucks for me now. I'm working daily (time in reddit gotta be an exception :P) to find a job. You're like millions of years beyond me. You only need to find motivation.\n\nAlso look at your habits and see if something is removing useful time from you: do you waste time in videogames, ditch them. Do you waste time in youtube? Block it", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecggsag/"}