{"id": "t5_2tand_t3_a8xt60_t1_ecg1t75", "creation": 1545637146, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 28, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "r0bbitz", "text": "I'll second this. I'm just coming out on the other side of a similar issue OP... I grew up with a terribly codependent family with parents who never worked through their past so they became successful and narcissistic... building walls of protective power and influence around them. I was never good enough for them or their time so I spent a lot of time secluded. I won't go into details but I ended up with some serious trauma that left me with wicked anxiety and depression. I couldn't hold a job for the better part of my 20's and I spent 30-33 yo at a miserable cubicle job. I've been mastering my craft through the last 10 years however... so about 8 months ago I left my job to start a business and now I'm meeting lots of self-driven people... and even had a client pay for me to rent a $100,000+ camera because they trusted in my ability. In my 30's after all that suffering and depression... the struggle was worth it.\n\n&#x200B;\n\nPour yourself into your passions, find a good therapist to help you find comfort and direction (it works... trust me... just remember that you're a customer, not a patient. you can change your therapist if you aren't getting progress or rapport). Build yourself up, get out there and \\*decide\\* what your life is going to be about because you've only got one and it's not worth losing over your current state of being... but it certainly is worth gaining if you pushed consistently in a direction for a while with the right help. (Mind you, I was lonely too... a therapist is a fantastic first step for finding friends and more than that since they'll help you get out of your own head and appreciating others).\n\n&#x200B;\n\nMaybe look at it this way... this is what helped me through when I didn't want to go on... I felt at one point that if I am here, and I am not yet dead... then when I die I will lose everything I have right now... but if I press on and maybe stop caring so much about how to \\*stay\\* alive when I'm so miserable to begin with, maybe I stop worrying about all the support structures and safety nets like a job and a paycheck and a 401K and parents and whatever else... and try to kill myself with doing something really hard... like something few people would ever do... like start a business. I'm going to die anyways, right? So why not run enthusiastically towards that finish line and see how long I can last while doing good for those around me... rather than stop it early. If I stop early I lose all I've got... and maybe more (I believe in God... and that I have a soul that animates this meat skeleton I walk around in)... but if I purposely live hard and strong and fast until I lose everything I've got... well then maybe I will have done something wonderful for all the people around me going through the very same fear and doubt and pain and illness and depression and sadness and abuse and death and all the things that come along with a mortal life. And maybe if I'm right about this whole God thing... I will have something to be proud of to show for this.\n\n&#x200B;\n\nBut my parents won't do it. My boss wont give me permission to do this. God won't even answer you directly... You have to \\*decide\\* to do it. And then you have to \\*do\\* it. (queue [Shaia LaBeouf](https://www.youtube.com/watch?v=ZXsQAXx_ao0)) I think the latter option is far more worth it than giving into the pain I feel \\*now\\*. Keep this in mind... children cry when something simple happens because it is literally the worst thing that has ever happened to them up to that point in life. That doesn't go away the older we get... it continues. You'll continue to have bad things happen... but as you get on with life you start to realize that in the midst of the things you have no control over... you do have control over what you do with your time. And people can do some pretty amazing and wonderful things for each other with that time. And I like to think that choosing this path is giving a big, righteous middle finger to all the things that have hurt from my past.\n\n&#x200B;\n\nYou can PM if you need to talk, OP. :) You got this, I believe in you.", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecg1t75/"}