{"id": "t5_2tand_t3_a8xt60_t1_ecfzhtp", "creation": 1545633776, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "exodeath29", "text": "First piece of advice: as many others have said, move far away from your parents, like a different state. I love the videogame analogy someone used. Staying in the same town where you were born is such a huge detriment to growth in my opinion. Your parents seem to be huge enablers in your life and although they most definitely love, they are not helping you. This alone should be a huge new experience for you and should help you mentally. New stimuli = new experiences = better feeling of being.\n\nSecond point: finding friends. You seem to have trouble making friends. What's the easiest way to make friends? Common interests. What interests you? It sounds like videogames and music. Literally Google \"Videogame meetups\" or \"Music meetups\" or \"*anything else that interests you* meetups\". They're out there. And there will be people there that you can more easily connect with. And you connect over common interests. If you meetups with people at a bar, but you don't like going to the bar (same) then why would you be friends with them? You're already starting off on an incrediblely wrong foot. Don't be ashamed of what you enjoy, embrace it, own it.\n\nThird: relationships. I could not recommend to stay away from dating apps enough. IMO, they absolutely SUCK for finding a good partner. Sure, every now and then you'll find a couple who met on a dating app and are living happily-ever-after, but those are more so the exception than the rule. Do you know who you end up marrying and having an awesome relationship with? Someone with common interests (is this a theme?). Going to events that interest you will lead to people that you are interested in and vice versa. Sure it might not happen immediately but that's okay. Keep at it, that's all you can do. I met my current gf at a place where we both share a common interest, rock climbing. I'm pretty confident I'm going to marry this girl. A relationship based off of common interest is miles better than a relationship based off looks, which is what a dating app is trying to do. DO NOT compare those morning shows and an actual healthy relationship. All that stuff is purposely dramatized to keep people watching. A healthy relationship is next to nothing like that, and dont you dare think that you can't have one.\n\nFourth and just as important as the others: EXERCISE. Get your body moving. There are thousands (sorry no source) of studies out there that correlate happiness and mental well-being with exercise. Its the easiest form of goal setting and goal achieving (which is the key to happiness IMO, self-improvement). Do literally anything that gets you moving. Start by just walking the block. Turn that to running. If you don't like running try biking. Don't like that, weight-lifting. Don't like that? Try the most random physical workout you can think of. I was in the biggest depression of my life about a year ago and looking back, I can easily point to the turning point in my depression to the day that I tried Brazilian Jiu-Jitsu for the first time. No kind of martial arts trianing in my life. I had barely done any sports up until then either. The completely new experience of BJJ caused a huge shift in my mentality (see this theme? New experiences, moving, doing something you've never done before). The new experience COMPLETELY cleared my mind. It was wild. For the entire hour I thought of absolutely nothing besides what was in front of me. No negative thoughts, no crippling anxiety, no depression. All of my mental energy was focused on this completely novel experience. And that made me realize that I don't have to feel depressed all the time. BBJ probably saved my life. I also highly recommend rock climbing.\n\nI wish you luck my friend. You can do this.", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecfzhtp/"}