{"id": "t5_2tand_t3_a8xt60_t1_ecioq97", "creation": 1545744605, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "r33na1", "text": "I’m sorry to hear that your struggling. I also have overbearing parents so I understand the struggle, but it had the opposite effect on me. I couldn’t get wait to get away from them and live my life the way I wanted.\n\n\nLike others have said you still have a lot going for you. I think you definitely need to work on yourself before entering a relationship, if you are unhappy now a relationship isn’t going to fix your current problems. I think that while facing challenges can be difficult, overcoming challenges comes with sense of fulfillment and will build your confidence in your ability to handle new challenges that arise. \n\nStep 1: force yourself out of your comfort zone. It sounds like you have money saved up, why don’t you take some time to travel and see the world? Live life, experience new cultures, branch out. This would only be a temporary fix but maybe you will get some ideas about how to change your life at home to make you happier. Or/ and move away to another state (or at least into the city/ further away from your parents) just to force yourself out of your comfort zone.\n\nStep 2: making friends. I like hanging out at home a lot of the time too, but if you are finding that a lot of friends prefer going out, it might be fun to branch out in this way too and try something new. Maybe after you’ve hung out a few times people will be more open to a chill night in. You could also try hosting a dinner party. Have a few people over for dinner and maybe watch a movie after or play some video games. Try to hang out with people who have common interests as you. Try to talk to your co-workers more and maybe ask to hang out after work. Plan a day sooner rather than later and stick to it. \n\nStep 3: staying at one job. I think part of the problem here is that your are not feeling fulfilled in multiple aspects of your life. One option would be to try to stick it out at a job and seek fulfillment in other aspects of your life such as learning a new hobby. This way you will constantly feel like your are learning even though it might not be at work. Option 2 would be to explore a new career path.\n\nSorry for the novel! Just one more thing to add, this is the thought process I had that got me through some tough times. My thought on the meaning of life is that there isn’t one. We are just animals that live and die, but you choose the meaning of your own life (your own purpose). For me, the meaning of my life is just to experience life to the fullest that I can. There is so much out there to see and experience and we already live too short to see it all, there is no point in cutting it even shorter. Don’t get bogged down in the little things. When times are hard remember that it will pass, everyone has ups and downs. Working on yourself can be hard and it will probably take some time, just remember that overcoming these challenges will make you stronger and will help you build confidence in yourself in the end. You should also talk to a therapist. They will be able to give you the tools that you need to work on yourself and lead you to a happier life.\n\nI wish you the best of luck!", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecioq97/"}