{"id": "t5_2tand_t3_a8xt60_t1_ecg9p67", "creation": 1545650092, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "L3aBoB3a", "text": "Hey there, Chicagoan here. \n\nMy first advice would be to get out of the burbs. It’s a social wasteland. The city is full of different people your age who are just now breaking into their niche hobbies and interests. I’m a little older than you but have plenty of 30yos in my social circle. \n\nThink about linking up with a roommate through r/chicagolistings for an immediate friend or if you prefer to live alone, look into renting in a neighborhood that piques your interests. Perhaps Pilsen or Ukrainian Village? Depending on which burb you’re from maybe you want to stay in your general location so Hyde Park for the south side, Uptown or Avondale for the north/north west. Even Oak Park on the west side makes everything in the city easily accessible to you. \n\nThe r/Chicago subreddit is pretty decent for meetups and there are a lot of “computer nerds” you could potentially meet through those. The ambiance is always low key and low pressure and the people are very inclusive. \n\nOnce you’re out of the burbs you can start getting out there and enjoying the stuff you like. It’s a good thing you’re a musician bc literally every kind of musical act comes through Chicago every year. I’m personally a music junkie and got to a show basically every weekend. Sometimes it’s a band or group I’ve never heard of playing at Empty Bottle or a more well known band at the Metro. Most of my closest friends were cultivated through the music scene in this city and I don’t even play an instrument. If you have a favorite band, look into local fan groups. Sounds cheesy but it’s not at all. If you like rock, go to a Local H show and you’ll make 10 instant friends because the fandom is very laid back and open. \n\nBut I digress. \n\nI’ve been in dog rescue for over 16 yrs in Chicago and I can tell you right now, chicks love a guy who loves animals. Whether it’s cats or dogs... even birds or reptiles, it’s a good look. 85% of people in rescue are women and when a man comes around everyone is looking and inquiring. If you need more deets on that, I can help. \n\nOverall, it seems like your focus is heavily on “getting a girlfriend” but truthfully, you really need to build your inner substance and life skills up before entering a relationship so you can pull your own weight. At 30, you’re going to be dealing with women who know what they want mostly, so you need to know yourself before getting involved with someone. Getting a girlfriend won’t change anything, it’s not the end all be all despite what various incel subreddits may lead you to believe (not saying you’re an incel but this is Reddit and you can’t go 2 clicks without seeing their garbage in the comments of any given subreddit). There’s someone for everyone but that one is definitely not in the burbs. \n\nChicago is one of those places where just 30min outside of the city limits you may as well be in Kentucky with pickup trucks and trailer parks or Orange County/LA with the McMansions and BMWs. Burb people are obsessed with possessions and status or just generally do nothing but go to work and go home to shuttle their kids around from parking lot to parking lot. Ya gotta get outta there, I’m telling you. The city may be intimidating but it’s far less so than the burbs because it’s mostly people living within their means minding their own business, unlike the burbs where everyone is sticking their nose up everyone else’s butts because they’re bored and toxic. \n\nThe amount of meet ups, interest groups, and events that this city has to offer makes it impossible to not get in where you fit in. Whether you feel comfortable with yourself or not, involving yourself with things like this will help you build that social muscle. It won’t happen instantly when you move, it will happen with every interaction. Not to mention, working in the city means you’re more likely to have coworkers who are actually cool and do interesting things over the weekend unlike the burbs where people either sit at home or go eat at Friday’s once a month when they can get a babysitter. \n\nMy parents coddled me and were overbearing because we are immigrants but I gtfo after high school. We are still close but I paved my own way and they let me bc they knew it was important for my interpersonal development. That’s something you’ll have to work on, though you’ve already taken solid steps. Your parents’ house is your safety net and you’ll have to forego that to make some progress. \n\nAnyway, feel free to message me but you have to be willing to get out of the comfort zone you’ve built up for so long if you want to make any changes. You have an amazing city at arm’s reach and it can provide you with an amazing social circle, job, and potentially significant other - you just have to get to it. \n\nI’m not saying this will fix your suicidal ideation but it will definitely give you a new lease on life. Coupled with therapy, a change of surroundings will do you a world of good. I know your parents are going to potentially fill your head with doubts but you’re an adult man and you are capable of going out into the world despite their irrational fears. ", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecg9p67/"}