{"id": "t5_2tand_t3_a8xt60_t1_ech1i53", "creation": 1545679160, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "elizacandle", "text": "First things first. And you've already made a big step- moving out and exercising. These are two very important things for yourself. Next you should learn how to cook and how to keep a house clean, and running smoothly for your needs. All of this takes time and practice. Your parents did not and have not done you any favors by doing \"everything\" for you. If anything it is what has hindered you the most in my opinion. I am sorry you have gotten stuck and burnt out so much, but It looks like you've already made some improvements and posting on here IS a big step. The fist step in being better, or self improvement is to recognize that there is room to improve. It sounds like you are feeling empty- I was having issues with depression, discipline , getting out of bed  and my partner was having anger issues and we were both having too much communication. Anyway, we started reading this book \"Running on Empty\" by jonice webb, \"How to overcome your childhood emotional neglect\". She outlines some issues you might have (hygiene, discipline, anger, trouble asking for help, sleeping too much/little, etc etc) and from what you've described I feel you may resonate and learn a LOT from this book. She details how we may be failed by our parents in a way that is so subtle yet so deep that it affects our adult life- even if we are successful and making all the money. How we may be feeling empty or unfulfilled. She outlines how the first step is to identify your feelings. Then you feel your feelings (sounds dumb, but think about any times you may have distracted yourself from sadness, or anger, or whatever) if we don't *feel* our feelings we will end up numbing ourselves. And that is no good because then we end up feeling burnt out and like life is not worth living. BUT it is NOT TOO LATE. You are not a waste of space, you are capable of changing and feeling better. Please look into the book and if you'd like you can check out her free articles- or just research emotional neglect.  ", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ech1i53/"}