{"id": "t5_2tand_t3_a8xt60_t1_ecgasuh", "creation": 1545651987, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "wiztwas", "text": "I wonder if your over attachment to your parents is clouding your judgement.\n\nI was born into a very wealthy family, we had everything, multiple houses, motor boats, travelled a lot, we had sports cars, swimming pools, massive main home, all that stuff.  \n\nMy parents divorced, I felt abandoned, unwanted, out of my depth in a posh boarding school I didn't really like with a lot of other over privileged people who had as little idea as i had about life.\n\nI had everything, yet nothing.  I didn't value the huge privilege I had, I wasn't in a great place.\n\nI moved out, lived in an office, got a normal job and fumbled may way along.  Eventually I met a girl, I think we broke each others hearts, then eventually I met the girl.  She was a regular at a pub I went to she was different, she was damaged, deaf in one ear, from an abusive home, with a racists, homophobic, WW2 veteran dad, a mum who was crippled in a car accident when she was a kid, with 4 much older siblings.  An almost exact opposite of my upbringing, needless to say, my family were not hugely impressed by my choice.\n\nThe thing was she loved me, not because I came from a wealthy background, not because I had stuff (she didn't know that I owned my flat, she thought it was a normal flat share, not me getting other to help pay the mortgage.)  She loved me because, like her I was broken but in very different ways.\n\nWe got married, we had kids, my relationship with my father went south, he lost most of his money after a tax scheme his accountant did went wrong and he got a huge bill, he remarried, had a stormy unhappy relationship, died without seeing his grandchildren after the age of 6 and alienated from all but one of his children.\n\nWe stuck it out, we built a new life and are still together, we are not super-sociable, we have a few friends, we have a quiet peaceful life together.  We made a family, we have two gorgeous kids, they are grown up now and found their own relationships, we have grandchildren.  Life is fantastic.\n\nHaving grown up with \"everything\" and lost it all to have \"nothing\" all I can say is i really grew up with \"nothing\" and have made \"everything\".  We need to really question other peoples values and not just follow them, we need to find the real value we have in our lives.  There was a time when money and stuff seemed really important to me, now I see that people, friends, family, random people you meet for 30 seconds are all much more important.  Making the world a better place, smiling at others and standing up for what you believe in, following your path, not someone eases are all great ways to end up with a better life, one where you respect and love yourself and those around you.\n", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecgasuh/"}