{"id": "t5_2tand_t3_a8xt60_t1_ecgkdwk", "creation": 1545664690, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "franticshouting", "text": "1.) No more judging yourself or your situation. Just because something feels bad doesn’t mean it is bad. You are looking at the society around you (which is just a construct, it really bears no weight in terms of serving as a true reflection of what it means to be human) and saying “that is right and good and worthy” and comparing yourself to that, seeing the opposite, and saying, “I am wrong and bad and something is the matter with me.” You are here. You are alive. And you are in control. We accept the love we think we deserve. We build the life we want. Sure, we might say, “I don’t want this! That’s crazy!” But it’s so true. We have what we want to have, maybe because on some level we know that where we are is safe and so we keep choosing it again and again. To choose otherwise is terrifying. We say “I tried,” or “I’m trying.” Well don’t stop trying. If it doesn’t work, make adjustments. Go back to the start and see what you can adjust. Don’t ever, ever stop trying or believing. I can tell you I’ve gotten to a place in my life where I have exactly most of the things I’ve always dreamed of having, but when I started shooting for those things, I had absolutely NO FUCKING IDEA where to start. It was like just throwing rocks into a black hole and hoping one would hit something. I didn’t stop throwing rocks. Don’t stop throwing rocks. Don’t judge yourself when a rock doesn’t hit something: it’s not good or bad. It’s just a thing. It also helped me to remember that there are people all over the world who have the things I wanted, and they aren’t special. They aren’t. They really aren’t. I would often remind myself that “You miss 100% of the shots you don’t take” and “Luck is when preparation meets opportunity.” You make that happen by not giving up. There are certainly things we cannot control but we can control what we *do.* We can control our actions. We can prepare. And if you just keep throwing those rocks, “preparing”, “doing”, you’ll hit something. Maybe you feel like you’ve tried everything to give yourself the life you want. So don’t stop. And while you wait, while you’re throwing those rocks, be sure to take time to do the things that make you happy: gaming, music. It can take a long time to hit something but you will. It’s not that others are luckier than you. Maybe they had some kind of advantage. But that doesn’t mean you can’t still win.\n\n2.) Therapy. This is one thing you can do right now. Forget everything else. Let it go. Don’t judge the state of your life. Just let it all go. And focus on this one thing: go to therapy. Use psychology today’s therapist search engine to find one that works for you. Go on 2-3 or more therapist “interviews” and go with the one you click with or that your instincts draw you to. Focus on that one thing: just making the appointments and going. Every week or more. Don’t focus on trying to get more friends or a girlfriend or moving out. Let that go. That’s not your job right now. Go to therapy and let that therapist help you. You do not have to go through this alone. \n\nSo many good vibes to you my friend.  There is no end game here. There will always be something more that you want, no matter what you accomplish, that is okay. That is normal and healthy. You’ll find a house to move into and something will break or you’ll want to be able to afford renovations. You’ll get a girlfriend or maybe get married and then something in that relationship will change or break and you’ll have to work on that. There will always be something, and that is beautiful and safe and okay. And so normal. There will be long stretches of amazing times with bumps that come and go and you’ll overcome them and be better for them. You’ll get the things you’re wanting right now and you’ll have the gift—a gift so few people get to have—of appreciating those things with a magic that makes them better and more amazing, a magic that inspires others and makes the world a better place for it.\n\nPeople like you and I, people who had to fight so fucking hard for the things they wanted and needed in life, usually without a roadmap, have something EXTRA special we get to give to this world. It’s all packaged in that deep appreciation for accomplishing things.\n\nFinally, don’t ever let someone tell you to “not look back.” Look the fuck back so you can come back to the moment and see how you’ve changed. You can start that today. \n\nBut please please find a therapist. And once you do, don’t ever quit going. Commit to that hour or two every week. Commit to that. Even when you don’t want to. Even when you feel too busy. That’s your medicine. If you were told you needed to take a medicine every day for an indeterminate amount of time in order to save your life or cure a disease or heal something, you would take it. Even if it was an infusion of something every week for an hour at a hospital that sometimes was painful and sometimes just blah and nothing and sometimes felt really good, you’d go. Therapy is your medicine. You can do this. \n\nIn fact, by making this post, you ARE doing it. You’re throwing a rock. You are doing it. Look at yourself reading these comments. You’re here and doing it right now. Maybe it feels bad, maybe it feels good. But regardless you are doing it and you can keep doing it. You wouldn’t have spent the time making this post if you couldn’t do it. ", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecgkdwk/"}