{"id": "t5_2tand_t3_a8xt60_t1_ecgddg5", "creation": 1545656228, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ginepri", "text": "I relate to your story very much op... and I really thank you for sharing it, not only has it given a  more in depth sight on things but has also brought out a lot of helpful strangers with different ideas and coping mechanisms...\nBut said that... even tough we have a similar upbringing I kind of envy you op, because at last you have some deeply roothed passions that are keeping you strong despite the apathy and depression... I myself never enjoyed much gaming, or have a really strong opinion on music or anything else for what's the matter...\nAnd I believe that even though you might not enjoy social interactions there are communities devoted to the matter and it makes it way easier to even have a small conversation if you've got hobbies...\nSo I believe that you can totally make it out there on your own, you may want to became a little bit more independent but you can have a life.\nThe problem with me is that I'm way too comfortable alone, at this point I only do things or go out to appease my family who worries about me... and that's why I'm also a little scared about fully \"cutting the umbilical cord\", without the fright of making my family worry I would totally barricade myself inside...\nBut I believe that for you it would be different, you still have the drive to connect to people and I wouldn't let it go to waste.\nI admire the fact that you want a relationship, it would be a real commodity to have a so, people is way more welcoming towards couples, and it's inherently a driving reason to simply go out and do stuff, when you're alone it's hard to justify wanting to travel or do something...\nBut between wanting the companionship and the social security that a partner would bring and actually wanting to find someone to share your life with it's very different... and for me, I'm afraid I could offer just the first option, because I became so distant and devoid that it's sad.\nAnd from how you put it I believe there's still hope for you, so go for it, fix the things that have kept you down find the reason behind your depression and move forward. I believe in you!", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecgddg5/"}