{"id": "t5_2tand_t3_a8xt60_t1_ecfk36e", "creation": 1545617805, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Harellan_94", "text": "There's a saying that goes something along the lines of \"You are the sum of the 5 people you spend the most time with.\" And it sounds like the people you spend most of your time around maybe aren't supporting you in the way you really need them to. Not saying you should blame them for that, but maybe you should look into surrounding yourself with better influences. I say this because in a lot of ways, I'm  in the same boat as you. And right now, I dont have anyone IRL that I can really count on for positive support or reinforcement.\n\nSo what I've begun to do is surround myself with positive influences digitally. By listening to podcasts, watching videos on YouTube, only following people I admire on Instagram, trying not to listen to negative/depressing music, etc.\n\nAnd perhaps most importantly is reading books that are motivational and productive.\n\nI'd like to recommend some books, podcasts and videos that I hope you check out.\n\nPodcasts: \n\nJoe Rogan Experience: his podcast especially, has helped me out a lot. He has had some incredible guests, and he's very motivational. Just look up Joe Rogan motivation on YouTube and you'll find lots of clips. I highly recommend his David Goggins podcast! It's also worth noting that he has interviewed the hosts of all the podcasts below.\n\nThe Tim Ferriss Show\n\nImpact Theory\n\nJock Podcast\n\nRich Roll Podcast\n\n10% Happier with Dan Harris\n\nYouTube Channels:\n\nEvan Carmichael\n\nWhat I learned\n\nTom Bilyeu\n\nBooks:\n\nMan's Search for Meaning - by Viktor Frankl\n\n10% Happier - Dan Harris\n\nAtomic Habits - James Clear\n\nFour Hour Work Week - Tim Ferriss\n\nThe life changing magic of tidying up - Marie Kondo\n\nThe subtle art of not giving a fuck - Mark Manson\n\nCan't hurt me - David Goggins\n\nExtreme Ownership - Jocko Willink", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecfk36e/"}