{"id": "t5_2qh5i_t3_nurxwx_t1_h13rpi7", "creation": 1623204739, "origin": "t5_2qh5i_t3_nurxwx", "height": 1, "replied_to": "t5_2qh5i_t3_nurxwx", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "dyland6423", "text": "No, I do not regret using them one bit. I think without them, I wouldnt have been able to see myself and my behaviors from an outsiders view thus making me stay as shitty as I was back then. \n\nI will most likely use psychedelics again in the future BUT! Only in a therapeutic setting with a professional guiding me or on a retreat, and very occasionally as well. \n\nMy main problem was that I was expecting these drugs to do all of the work for me, so I would use them, seen that Im not where I want to be, and think that I just need to do more the next time. Now, i know that one must sit and reflect on the experience to truly gain all that they can from it. \n\nThe reason I stopped was because of a trip I had where I had combined 3 or 4 tabs of lsd, 30mg of thc edibles, and 60mg of DMT on the peak of the LSD. \n\nI had been convinced that I was in hell and that I was dying (I was alone in the dark, so I thought I was just in this void of nothingness). Ive had trips like this, but I was always able to let go and hust accept that i might actually be dying, but this time was waaaaay more intense. \n\nIts hard to explain, but I saw my body from above laying there. My body unzipped and started swirling away like dust and as it unzipped I was seeing my life go in reverse from now till i was born and while I saw this I just had this sensation that I was disappearing into nothingness. \n\nOnce I watched my life rewind, I was gone, literally gone. I had no idea who, what or where i was. I was just this observer, no face, no name, no \"personality\", i just existed as I watched the universe do the same thing my life did, go in reverse to the beginning until it was just this small white point. Once it was here, I could feel every single atom of my body and I could sense the space between said atoms. This FREAKED ME THE FUCK OUT and thats coming from a dude whos talked to aliens and lived in computer dimensions, this was WEIRD. I cant even explain it, but basically I started screaming, woke everyone up and they found out I had been taking copious amounts of drugs for the past 2 months (psychedelics were a part of it, but it was mostly DXM, the active ingredient in robitussin). \n\nWent to my first NA meeting that week and havent felt the need to do anything again. \n\nOh also, I think I had a psychological dependence toward psychedelics, but I notice that I am immediately addicted to anything that changes my mood or perception even the tiniest bit. So, I think its safe to say, psychedelics can be just as addictive as anything else depending on how you use drugs in general. \n\nFeel free to pm for more info 😁😁 thank you for your kind words and I love ya lots ❤❤", "permalink": "/r/happy/comments/nurxwx/finally_starting_to_love_myself_this_is_a_genuine/h13rpi7/"}