{"id": "t5_2tand_t3_p2btw4_t1_h8ki6h8", "creation": 1628709276, "origin": "t5_2tand_t3_p2btw4", "height": 1, "replied_to": "t5_2tand_t3_p2btw4", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "dsk83", "text": "I just started listening to audiobook \"atomic habits\", it talks about making very small incremental changes that might make your day 1% better, but over time those changes add up to a lot.  I suggest giving that book a shot when you have a chance.\n\nNow for my long ramble should it be helpful at all:I'm 37 and I'm not sure I have a perfect answer for you, but I'll just spew my thoughts. After college I worked multiple different jobs most which I all hated. Every day I'd dread going to work and thinking what a better job would be and that once I got that dream job I could finally feel fulfilled and be happy. Problem with that is it delayed/prohibited me from having a positive perspective on life because I was forever seeking that dream job. After a long time I was able to finally change careers, but it was almost a 10+ yr journey for that to happen. Even after getting my new current job (I don't love, but at least I don't hate, which is a big step) I still don't feel like I'm living to my potential and I don't even know what my purpose is in life or what it should be. When I compare myself to my siblings who make more than I do and many others further ahead in their careers, I feel behind and a bit like a waste of space. Then there are those less fortunate than myself, but when I think of them I don't think of them as a waste of space. I empathize with others that are doing worse than me and can think of reasons/circumstances why they haven't succeeded yet, but when I think of myself I'm not nearly that kind. It's so easy for me to think of all the time I've wasted, all the wrong choices I've made, and how I feel like I'm not living up to my potential and how it's too late to be better... Point is maybe we should afford ourselves a bit more room/empathy instead of focusing on how we're a failure when in fact it may just be our overly critical perspective.\n\nApparently 49% of Americans like their jobs: [https://www.pewresearch.org/social-trends/2016/10/06/3-how-americans-view-their-jobs/](https://www.pewresearch.org/social-trends/2016/10/06/3-how-americans-view-their-jobs/)\n\nI personally would put the number lower, I don't know who exactly they surveyed. Either way that means another 51% are unhappy with their jobs...\n\nI don't know if most people ever find their \"true calling\", maybe some people achieve their potential and find their dream job/purpose, but I don't think most people have it so easy, at least the journey usually ain't a straight line.\n\nWhenever I'm depressed and feel like life stinks I try to do things that make me feel better, the first thing I try to do is get my exercise routine going again. For me there's a strong correlation between exercise and mood. Start with the small things you can control in your life, aim to do something slightly better each day. I think focusing on finding your meaning/purpose/worth overnight is nearly impossible task and can make us feel down, but trying to be just slightly better each day can make a big difference over time. Maybe eventually after small incremental improvements when your mind is in a slightly different space you'll see things slightly differently.", "permalink": "/r/DecidingToBeBetter/comments/p2btw4/nearly_30_years_old_and_i_still_have_no_idea_what/h8ki6h8/"}