{"id": "t5_2tand_t3_p2btw4_t1_h8lmx3o", "creation": 1628726840, "origin": "t5_2tand_t3_p2btw4", "height": 1, "replied_to": "t5_2tand_t3_p2btw4", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "aam726", "text": "Life is short, but it's also long. I think we're too obsessed as culture with figuring out what to do with our lives. We are supposed to live them. It's simple. \n\nSome people have one great passion and work on that as their lives, and hey that's great, but I don't know why we have this myth that this is typical or even desirable.\n\nMaybe you will be a writer for 10 years when you are 40-50, and then maybe you'll decide you want to be a Chef and you'll do that for 5 years, and then maybe you'll decide you want to open a local bookshop and retire on that. Who knows, interests change over time, and that's ok. Lean into that, take risks, have fun. It's ok to take jobs that just pay the bills too, not everything has to be part of the grand plan!\n\nFor right now, I'd say get a job. Any job. Just get a job right now and start working to move out of your parents house. Stop with the associates degree, or finish it immediately. I mean it's a 2 year degree, there's no reason it should be causing you this much confusion. I have to assume you are close to graduating, just finish it. In ANYTHING. Just FINISH. You can always add on if you really feel drawn to something, but don't waste anymore time and money on education for topics and careers you aren't REALLY passionate about. The payoff is not worth it.\n\nGoal One: Get a Job.\nGoal Two: Finish (quickly) degree\nGoal 3/4: Get Better Paying Job/ Move Out of Parents House\nGoal 5: Figure Out Better Plan\n\nJust remember, the plan doesn't have to be forever, it doesn't even have to be for 5 years, it can be just a trial.  Just do something. Life is short, but it's also really long. There's plenty of time to do all the things you find yourself struggling to choose between - but you'll never get to them off you waste all your time just trying to decide. Do them all.", "permalink": "/r/DecidingToBeBetter/comments/p2btw4/nearly_30_years_old_and_i_still_have_no_idea_what/h8lmx3o/"}