{"id": "t5_2tand_t3_p2btw4_t1_h8j133l", "creation": 1628686152, "origin": "t5_2tand_t3_p2btw4", "height": 1, "replied_to": "t5_2tand_t3_p2btw4", "down_vote": 0, "up_vote": 95, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Hungry-Hall-1500", "text": "It’s hard to realize, or at least it was really hard for me to realize, that a job is just that - a job. As long as you come in with a good attitude, accomplish the tasks assigned to you, are friendly with your colleagues and have a genuine desire to do right by your customers then you’re killing it. That is really the high bar. When I first learned that I found it depressing.\n\nI always wanted to be on a team that was full of fire, changing the world, and building something I could me mega passionate about. But at the end of the day, in the quiet of my heart, it’s way more important to me to be able to save some money, spend time with family, and get some hobbies. \n\nA job is a piece of your life, it is not your whole life. Find a team that is full of kind people who care about their work, a product line that is at least mildly interesting, ideally in a high margin industry, and keep it to 9-5.\n\nAs for the adulting concerns, I’ll level with you, when people leave home they don’t have a clue what is going on. They figure it out as they go and their confidence grows over time. I didn’t know how to open a bank account, get a credit card, pay my water bill, haggle a new agreement for an apartment, ask for a raise, etc etc none of it. But 4 years later I feel like I’m getting the hang of things. It wasn’t always smooth, the answers weren’t always clear but I’m getting the hang of it. Don’t put pressure on yourself to “adult”. Instead understand what needs to happen next, what you need to know/get/do to do it, then execute on that single step. Over and over. You’ll wake up one day and realize you’re pretty content and that was what you were looking for the whole time.", "permalink": "/r/DecidingToBeBetter/comments/p2btw4/nearly_30_years_old_and_i_still_have_no_idea_what/h8j133l/"}