{"id": "t5_2tand_t3_idxrnv_t1_g2copcr", "creation": 1598034589, "origin": "t5_2tand_t3_idxrnv", "height": 1, "replied_to": "t5_2tand_t3_idxrnv", "down_vote": 0, "up_vote": 12, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "willowhispette", "text": "Thank you for sharing. You’ve been through and are still processing a lot. I’ve also not had the heroin or similar experience, so can’t speak to dating life in terms of that, but I am a person who is pretty sensitive and can get into my own head way too much, so coming at your post from that position.\n\nIn terms of dating stress some things I try to remind myself of when it looks like I might be getting the anxiety itchies:\n\n1. Very few things are permanent (this helps me the most and is usually step one of bringing me back to reality and out of my stress brain)\n\n2. Dating is not like finding a job. Outside of trying our best to be decent to others and ourselves (which requires being super honest with ourselves), there isn’t much we can do “right” or “wrong”—at that point it’s like do we just click\n\n3. If the other person still needs to heal/work on themselves then the healthiest thing for both of us is to give friendly space with zero expectations. This can look like staying connected on social media but not engaging in chats that make either of us vulnerable in an unhealthy way. Or, becoming actual friends (again with romantic expectations out of the picture if you’ve already figured out this person would be harmful to your progress or vice versa). Or, polite no contact. If the parties involved grow separately to the point where trying dating again makes sense, great! But no pressure for that—you deserve the freedom to say “this person is not for me” and walk away\n\n4. Sometimes I’ll ask myself, what if I took everything at face value and didn’t try to predict outcomes? In this case, this might look like: this person is expressing feelings that seem harmful to my progress/emotional safety; this person also cancelled last minute; this person was also fun to talk to. What boundaries would make me feel good about continuing to engage with this person? Would boundaries look like limiting conversations? Would boundaries look like saying I’m not ready to continue talking about serious things and walk to spend more time to getting to know them as a person separate from romantic hopes? Would boundaries look like making certain I am not this person’s primary emotional support at this time since I am not their partner or friend or know them long enough to have them rely on me in this way?\n\n\nAnyway, I wish you the best. There’s no one right answer to being a person on this planet. My main thoughts in responding here were to privilege taking care of yourself and hopefully offer ideas for how you might go about deciding what is appropriate for your mental/emotional/social safety \n\nI know it’s super hard when you invest a lot of time into getting to know someone and build up hopes.", "permalink": "/r/DecidingToBeBetter/comments/idxrnv/ive_recently_tried_to_open_myself_up_to_dating/g2copcr/"}