{"id": "t5_2tand_t3_idxrnv_t1_g2c0twi", "creation": 1598023862, "origin": "t5_2tand_t3_idxrnv", "height": 1, "replied_to": "t5_2tand_t3_idxrnv", "down_vote": 0, "up_vote": 30, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "alyssaandthedogs", "text": "Yeah, I sympathize. I was in a long term relationship through high school and college, and have been single by choice since that relationship ended. In the midst of dating him, I thought I was fine and happy and that our relationship was super healthy. It wasn’t, because I wasn’t. It took a few years of being on my own and figuring stuff out in a new, grown-up context for me to come to terms with a lot of stuff, and be in a place where I feel ready to maybe meet somebody. The thing that has helped me the most with that is...just kind of being okay if it doesn’t happen. Genuinely. If I do meet someone, I want it to enhance the quality of life that I’ve already established for myself. I don’t want to shoehorn myself into something just because I feel like I have to. I’m not big into drinking or partying either, and it is hard to find people with similar priorities and at a similar stage in life as I am. \n\nWhat I have done is started to actively pursue the things in which I am personally interested. Hobbies and outings and social events. I’ve gotten comfortable with going to things on my own (which was painstaking - I’m introverted by nature), and just tried to meet people for the sake of meeting intriguing people with similar interests, not necessarily to date. In my last relationship, I was very into long-term plans and future and marriage, and now I’m more of the “let’s see where it goes” mindset. I’ve also just adopted a pretty staunch honesty policy and given myself permission to not do something if it doesn’t feel right. If I’m not feeling it, or I’m not excited about the person, I don’t try to make it work out of guilt or obligation or fear of being alone. \n\nThere are people everywhere. Not all of them are compatible with me, I know that. And I’d rather be happy on my own than miserable with the wrong person, even if it’s not a serious relationship. I do believe that it’ll happen eventually; the coronavirus has also thrown a wrench into my grand plans too, lol. It sounds like dealing with the person you’re talking to has a greater cost on your emotional bank than a value to it. It’s okay to cut your losses. Not every twenty something copes with their baggage like that.", "permalink": "/r/DecidingToBeBetter/comments/idxrnv/ive_recently_tried_to_open_myself_up_to_dating/g2c0twi/"}