{"id": "t5_2tand_t3_idxrnv_t1_g2cnlok", "creation": 1598034046, "origin": "t5_2tand_t3_idxrnv", "height": 1, "replied_to": "t5_2tand_t3_idxrnv", "down_vote": 0, "up_vote": 24, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "oatdream", "text": "Lots to unpack here. \n\n1. Congrats on putting yourself first. That’s always step one. Sounds like you’ve done a good job. \n\n2. I hear you on doubting yourself when it comes to relationships. It’s not easy. Give yourself kudos for recognizing it *and* being aware of your shortcomings. \n\n3. Feeling stuck for the past 24 hours is nothing but stagnant energy. Put on your favorite music, dance until you run out of breath. You will no longer be stuck. \n\n4. It’s hard to know why someone cancels on us. Maybe she got her period and didn’t want to leave the house. Maybe something else came up. Often, people cancel on us because of them. \n\nE.g.: I live in Seattle and folks are notorious for canceling last minute. After I caught myself doing the same thing I realized my decision had nothing to do with the other person. Is it selfish, yes, but there’s also something to be said about owning up to how we feel and not partaking in an activity when we don’t feel 100%. But it also sucks being on the other side; I’ve considered breaking up a friendship because I got way too many cancellations. I had to remind myself it wasn’t about me, more about them. I am still working through it. \n\n5. Feeling rejected sucks! But here’s the big catch — I can’t believe it took me 40 years to learn this:\n\nThe other person doesn’t feel they are rejecting me. They just don’t feel up to hanging out. I am the one that feels rejected. So I can’t blame them for how I feel, because they have no intention in making me feel this way. \n\n6. What we see in others or feel about others is a reflection and insight into ourselves. 🤯\n\nCouple of areas I would dive deep if I were you:\n\n- How much does it mean to have this person in your life? \n- How much could that be tied to your self-worth?\n- How much sabotage would you be willing to partake if you could avoid not getting hurt?\n- Do you feel you could write narratives in your own mind to protect yourself from failing at this — or anything else in life?\n- When you question her own decisions about being involved with someone else, how much of it is observation vs projection?\n- Do you believe we can honestly see others for whom they are or does our perception of them comes tinted by our own bias, limitations, and experiences?\n\nDo you trust yourself?\n\nFurthermore:\n\n- Have you taken yourself out on a date? \n- What does the perfect date and what did that feel, looked like?\n- What does that ideal partner look like? (Not just physically, but spiritually, emotionally, etc.)\n- What does having a partner mean to you?\n- How are you without a partner?", "permalink": "/r/DecidingToBeBetter/comments/idxrnv/ive_recently_tried_to_open_myself_up_to_dating/g2cnlok/"}