{"id": "t5_2tand_t3_idxrnv_t1_g2daapp", "creation": 1598045144, "origin": "t5_2tand_t3_idxrnv", "height": 1, "replied_to": "t5_2tand_t3_idxrnv", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "harpinghawke", "text": "Some of the best romantic advice I was ever given (besides the stuff about open communication and recognizing red flags) was someone saying to me that I better be dating somebody I could also be friends with. It took me five years to start dating again after being in an abusive relationship. I took that time to work on myself, get therapy, and develop strong, close friendships instead; one of those friends is now my partner. I personally don’t see the point in dating someone who wasn’t a friend first; it gives us time to get to know each other without the pressure of dating, and it also means that we have a stronger foundation upon which to build a lasting, equal partnership. \n\nSo go invest in your friendships first. Romance will very likely come from that, whether it’s directly from the friend group, or a friend of a friend you’re introduced to and you suddenly click, or at least feel some potential there. Even if it doesn’t, there’s another reason for working on friendships over romance at first: Breakups happen. When you’re in a relationship, you either stay together or you don’t. There’s no protection from that. Bad life shit happens. It sucks, and dealing with that is never fun. But if you have a group of people surrounding you who love you and care for you, and with whom you’re in a relationship of mutual support, you’ll at least feel less alone. \n\nCongratulations on your recovery. It’s a lot of hard work, and while I know I’m just a rando on the internet, I’m excited for you and your future. Best of luck to you. <3", "permalink": "/r/DecidingToBeBetter/comments/idxrnv/ive_recently_tried_to_open_myself_up_to_dating/g2daapp/"}