{"id": "t5_2tand_t3_9k5yy8_t1_e6wpd6k", "creation": 1538316036, "origin": "t5_2tand_t3_9k5yy8", "height": 1, "replied_to": "t5_2tand_t3_9k5yy8", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "rafikGk21", "text": "**I read the whole thing.** and I'm 100% sure I can help you. Anyway, since I'm not from the U.S, please let me give you a perspective shift for a second. You'll understand what I'm talking about soon, but please bare with me.\n\nOk, so here are the things I noticed about what you just said, with a little perspective on the matter :\n\n**You said that after being in a relationship, you no longer feel inferior to your friends**\n\nI honestly think this is a big problem. Why? Because you need someone to be with you to feel you're worthy. That right there is low self-esteem. I've been there before.\n\n**You say that a relationship made you transition from being a kid to being an adult**\n\nWell, do you want to hear something crazy? In my country, it's the opposite. We consider someone who's been a virgin till he's married as someone who's mature and basically awesome. Why? Because being a virgin means you have successfully tamed your primal instincts.\n\n**Now, what should you do?**\n\nWell, I have a little idea on the topic. First of all you should build your self-esteem. Here's how :\n\n-----------------------------------------------\n\n**1. Become really good at something**\n\nIt could be anything you want. Having something that you master will immensely help you to build your self-esteem because you’ll feel like you’re someone who’s competent and skillful. You’ll see yourself as someone who knows how to handle what life throws at you because you have something to be proud of. You can say “I am good at X” and that’s really how you can shatter that belief that you’re not good at anything.\n\nBeing good at something will give you the proof you need to start seeing yourself as someone who’s worthy and competent.\n\nAction step : Master a new skill\n\n**2. Forgive yourself for past mistakes**\n\nWe all make mistakes, I’m sure you’ve heard it before but why don’t you apply it ? Think about it. We all as human beings make mistakes, why do you always beat yourself up when doing small mistakes then ?\n\nLogically speaking, after a mistake is made the best possible thing to do is to think why that mistake happened, learn the lesson, and avoid it in the future. That’s it !\n\nIt’s time for you to let go of the past mistakes you did, and here’s how. Grab a pen and paper, write all the mistakes that you’re ashamed of, one by one. Recall what happened with each mistake, and under each mistake write the lesson that you got from it.\n\nThink this to yourself “I made mistakes in the past, and I totally fogive myself for it. I am human and I make mistakes”.\n\nDon’t just think about it but really internalize the feeling. Really feel your own forgiveness towards yourself. Let it go !\n\nFor example, I let a lot of people take advantage of me in the past, I was a doormat. The lesson from that is You should always put your own comfort before anyone else’s needs. It’s me first, then other people. Not the other way around.\n\nTo sum up, make a list of your past mistakes, and under each mistake write the lesson that you got from it. Look at it very well, learn the lessons so that you won’t do it again, and then throw that paper for good.\n\nNow you got the lessons, no need to feel bad again. You did your job.\n\nAction step : forgive yourself for past mistakes.\n\n**3. Use your mistakes to guide you**\n\nBasically when you make a mistake don’t start saying “I’m worthless” “I’m useless” “I’m a piece of shit”.\n\nHere’s how you can use your mistakes to your advantage. From now on, when you make a mistake think about it this way “Ok I made a mistake. What can I learn from that and how can I improve ?” \n\nFor example, if you suffer from terrible relationships. You could ask yourself that question and maybe you’d discover that you’re terrible at social skills. The next question would be “How can I improve ?” The answer is “I’ll talk to more people and read books about it so that I can learn”\n\nDo you see the difference ? The old method says “You suck” but the second method says “How can you become a better person ?”\n\nAction step : Ask yourself “What can I improve” Instead of deprecating yourself.\n\n**4. Put your own needs first**\n\nThis means that you should never do anything because you feel pressured to do it. Maybe you’re doing something you’re uncomfortable with so that your friends think your cool, so that your family is proud of you, or so that you can be loved.\n\nYou know what ? You matter. You are human. You have opinions, feelings and plans for your life. This is your life. You are the hero of the story. And since you are a person, you have every right to put yourself and your needs as a priority. Don’t let anyone take what’s yours. They’re not better than you. Always stand up for yourself.\n\nYou matter just as much as other people.\n\nAction step : Never do anything uncomfortable for someone else.\n\n**5. Wear clothes that fit**\n\nThis will sound weird but when you wear clothes that fit you perfectly you feel really good about yourself.\n\nAction step : Wear clothes that fit you well.\n\n---------------------------------------------------\n\nNow the second thing you should dois to find a purpose. Find something you like doing (Art, sports, programming....etc). Choose ONE thing and become AWESOME at it.\n\nWhen you have something you LOVE to do, you strive for it so much that anything becomes really meaningless in comparaison.\n\nTry it.\n\nThat's all I have for you.\n\nYou can comment on my answer to tell me what you think. I'd love to see if it was helpful.\n", "permalink": "/r/DecidingToBeBetter/comments/9k5yy8/where_and_how_do_i_start/e6wpd6k/"}