{"id": "t5_2tand_t3_or6xjg_t1_h6gmm4i", "creation": 1627209481, "origin": "t5_2tand_t3_or6xjg", "height": 1, "replied_to": "t5_2tand_t3_or6xjg", "down_vote": 0, "up_vote": 123, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SubspaceSample", "text": "Anger is about control. A way to assert our wishes onto the world and other people in it because we feel powerless about the way something happened. Just like it’s impossible to directly chase happiness, it’s impossible to directly release anger. \n\nI struggled with reacting disproportionately with anger to surprising situations. When you find yourself doing this to people you care about, you end up staying awake late at night wondering why. The answer is that we were operating out of a wound. Something where we had unprocessed emotions. \n\nThis wound could have come from trauma—some situation that caused harm—and the thing that triggers us to be angry somehow re-ignites that trauma experience for us. \n\nIt could also have come from loss, if we never gave ourselves the opportunity to process our pain and grief, or even if we were far too young to do this meaningfully.\n\nUltimately, what seemed to work for me was that when I started looking inward for my wounds and processing my feelings around them, I found myself releasing my anger in many places—sometimes places that weren’t logically connected to the wound. \n\nJournaling may help considerably in this. Think of times you felt scared, powerless, hurt, etc. Anything that made you feel less than you are, vulnerable, broken or incomplete. Write down what memories flood into your mind. What messages you got as a child. So on. Then think and write about the situations objectively. Separate what happened from your interpretation of what it meant. If you could go back as the person you are now, what would you say to the person you were back then about the situation? If you could have backed yourself up back then, what would you have done or said? What boundaries would you have established for yourself? What needs could you have communicated? This process can be painful, but releasing any sting these situations have is the path to being free.\n\nYou will never stop being angry and anger itself is not the problem. There’s functional and dysfunctional anger. Functional anger is in asserting your beliefs, standing up for right and wrong, defending someone who can’t defend themselves and so on (we usually know in our hearts when an action was justified). The goal is to work on our dysfunctional anger responses so when situations inevitably happen that people decide to do things we disagree with or circumstances cause something we didn’t want, we’re acting from a place of love, security and productive intent.", "permalink": "/r/DecidingToBeBetter/comments/or6xjg/how_to_stop_being_angry/h6gmm4i/"}