{"id": "t5_2tand_t3_pbtq84_t1_hafotmr", "creation": 1629992038, "origin": "t5_2tand_t3_pbtq84", "height": 1, "replied_to": "t5_2tand_t3_pbtq84", "down_vote": 0, "up_vote": 24, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ZorroPz", "text": "Hey, I recommend the book 'the body never lies', written by Alice Miller, to you. It is a book about the effects of neglecting our bodies, with the focus being on bad parenting. \nNow the reason I'm recommending this;\nThe reason one feels the urge to do something repeatedly, something that's not in line with his/her goals is because s/he is trying to avoid something else. Some truth. For its difficulty, we tend to evade the pain by distracting ourselves with any other activity, say video games or smoking or etc.. Now you may try not to play video games for days, but in the end, it's not the video games you're trying to avoid. It's something else. Video games are just a distraction from that.\n By only trying to hold yourself back from the games, you will only feel frustrated. Actually, there's nothing wrong with playing games. But as long as you've done what you've been trying to avoid. \nBecause what's life all about? We want to enjoy life. Playing video games can be part of it, just like one may love watching movies or reading books. \nSit and think about what you're trying to avoid. Go toward what makes you anxious. Think about, notice your feelings, and find out what makes you feel anxious about it. This process is best done with the help of a psychoanalyst. I've done this. But in case you don't have the money or time to now, I shared the process with you. If you ever can, I really recommend seeing a psychoanalytical psychotetherapist. It is the best experience one can have in life.\nUntil then, read this book please. It may not be your exact problem, yet it may enlighten you and guide you to the right path.\n\nBest of wishes for you.", "permalink": "/r/DecidingToBeBetter/comments/pbtq84/small_victory_but_i_didnt_play_any_video_games/hafotmr/"}