{"id": "t5_2tand_t3_qh5sxu_t1_hicozxk", "creation": 1635403827, "origin": "t5_2tand_t3_qh5sxu", "height": 1, "replied_to": "t5_2tand_t3_qh5sxu", "down_vote": 0, "up_vote": 15, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SufficientlyConfused", "text": "As someone who “lived it up” in my teens and 20s (I’m 29 now) I partied away almost a decade of my life. I was arrested, had multiple adventures that could have gotten me killed or landed me in prison. Followed a woman to Colombia because I was so in love I was willing to risk leaving everything behind. I danced for the first time in my life in a small bar surrounded by people I didn’t speak the same language as and was cheered on for being a gringo with rhythm. I took a boat ride around Calima lake with her and fell asleep beneath iron barred windows while the breeze tried to keep us cool. I also watched my close friends end up dead or in prison the others drifted away as most people do once they have kids and careers. I did keg stands and built my Diablo so I could drive too fast for fun. I swept an ex off her feet to make out on the hood of a truck at a party because I wasn’t over her and someone else was flirting with her and somehow it worked. I lived as hard and as fast as I could because I didn’t expect to live past 24 and now here I am at 29 with nothing. I don’t have much money, I’m not particularly fit, I didn’t even end up with the only woman I ever truly loved because I drank her away in fact I only began putting my life together because she couldn’t take anymore and left. People say live it up in your twenties because someday all you’ll have is memories what they don’t tell you if you live fast and don’t die then you’ll only have memories to look back on a lot sooner. Don’t be afraid to make mistakes and chase dreams or fall in love you’re gonna be a year older come next year and you’re gonna be afraid to do things because they’re new or people say it’s a bad idea but it’s your life and only you can make it a story worth telling. Hell most of the shit I did I didn’t know it was going to work out and before the thrill of making it into a great memory I was afraid but I was more excited to feel alive than I was afraid to live. Go live your life and keep in mind your anxiety is all in your head 99% of people around you won’t remember you or what you did so enjoy yourself and feel alive and if your depression Kees you glued to your bed then remember that’s ok too as long as you are making progress to get away from whatever it is that has you feeling that way. I believe in your dreams whatever they might be and I can honestly tell you that age doesn’t matter except that when I was younger my bones didn’t ache as much after I fucked up doing something stupid like they do now. It wasn’t a waste it was just preparation for the new adventure you’re gonna start now that you’re ready.", "permalink": "/r/DecidingToBeBetter/comments/qh5sxu/how_do_you_live_up_your_20s/hicozxk/"}