{"id": "t5_2tand_t3_qfk0h3_t1_hi1ufnm", "creation": 1635205763, "origin": "t5_2tand_t3_qfk0h3", "height": 1, "replied_to": "t5_2tand_t3_qfk0h3", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "whyvswhynot12089", "text": "(1.) Stop trying to blend in. Stop apologizing for existing. You have every right to exist, participate, and flourish as everyone else. Shame is not an innate emotion. It is not organically yours. It was put there by someone else. Even though it might not be easy, you can remove that sucker from your person, over time. What is more, you should. Bullies will look at your shame, your trying to fade into the background, and see you as an easy target. \n\n(2.) Consider the underlying thought processes you currently have that are driving your actions and fight/flight response right now. \n\n(A.) Somewhere deep down, maybe you think being a wallflower, trying to \"blend in\", or \"keep your head down\" will get people to leave you alone. Let me tell you right now from firsthand experience...(this is fucking bullcrap.) \n\nBeing a wallflower, going out of your way not to bother or be the slightest burden to anybody...will not save you. And it never did. Because unfortunately, there are some real shitheads roaming this great planet we call earth. \n\n(B.) Consider two things about your inner critic and tendency to self blame: \n\n(I.) That inner critical voice inside your head is the internalized voice of your parents abuse. Not you. \n\n(II.) Your mind chose self-blame in an effort to help you survive your upbringing when you were younger. Because it beat the alternative belief...which was the idea that the people who were supposed to care for you most, abused you and you had no escape because you were reliant on their care. \n\n(3.) That same imagination that keeps you scared all the time, that imagines terrible possibilities in the future? Give it something else to do. \n\nTwo mental exercises you should try:\n\n(A.) Whenever you are faced with a predicament of bullying or needed to stand up for yourself...Stop imagining you are the person involved. Instead, imagine someone else, someone you really care about being bullied or faced with the same predicament. It could be a friend, favorite fictional character or person from history, a younger sibling...It doesn't matter who it is. It just has to be someone you wouldn't want to see get hurt. Think about what you'd do if it were someone else. \n\n(B.) Consider the person trying to bully you. I'm sure you've figured out by now that when it comes to cycles of abuse...People who don't break the cycle, tend to either become their abusers or future victims. Nobody who is well adjusted, happy, satisfied, or otherwise fulfilled bullies. Damaged people bully. Broken people bully. Maybe they've got you fooled that they're bigger and badder than they really are...but that's the truth. They wouldn't be able to carry the false bravado/ego they do, if they weren't constantly putting other people down to try and feel superior. I'm not saying people can't be unbelievably cruel...because they absolutely can, but nobody who is actually happy or \"normal\" actually has the drive to be cruel. \n\n\\*Remember that the people who bully you are more damaged than you could ever be, because they don't have the courage to be self-aware or face their demons. \n\n\\*Remember that in spite of the fact you don't feel brave, you have more courage than they could ever dream of...because it takes guts to be self-aware, to look at your problems and choose to deal with them. \n\n\\*Remember that even though there have been people who have made you feel weak and worthless, you never once used the way you were treated as an excuse to treat other people the same way. But that's what bullies do every day. \n\n\\*Remember for all these reasons and more, you have the strength to face all your obstacles. You just don't realize it yet. \n\n(4.) Less is more when it comes to verbal defense against bullies. \n\n(A.) Don't try to defend yourself too much directly. Don't make \"should\" statements, like, \"You *should* be nicer,\"...You can't appeal to a better nature someone doesn't have. If a bully did, they wouldn't be doing the crap they're doing in the first place. \n\n(B.) Put the focus off of you and onto them with questions like, \"Do you feel better now?\" \"Wait...let me write this down (followed by one of the following possible options):  \"For Posterity\", \"For HR\",  \"For my pastor/rabbi/cult leader,\" \"For your Mom\", \"For the small dick club currently accepting applications\", \"For the bald golem character in my upcoming novel\"). \n\n(Other possible questions):\n\n\"Why are you this way?\" \"Did someone drop you on your head as a baby?\" \"Did your parents hit you when you were younger?\", \"How boring and unfulfilling is your life right now, that bullying me is as good as it gets for you?, \"Do you have one of those novelty license plates that says \"Douche canoe\" or do you want me to just spread the word for you?\", \n\n(Statements): \n\n \"I can't imagine how much pain you must be in to act this way. I'm here if you want to talk about it.\"....\"Erectile dysfunction is nothing to be ashamed of. There's no sense in being angry about it. \" \n\n(C.) Make them regret whatever they say by annoying the hell out of them. \n\n(I.) Ask them over and over, \"Can you repeat that?\" Pretend like you just can't remember anything they're saying.\n\n(II.) Ask them over and over, \"Can you say that louder? I just can't hear you.\" Pretend you're basically deaf.\n\n(III.) Repeat whatever they've said verbatim once. Ask them if that's all. Then tell them, \"Glad we could clear that up\" and go back to whatever you were doing.", "permalink": "/r/DecidingToBeBetter/comments/qfk0h3/how_do_you_speak_up_for_your_self_without_causing/hi1ufnm/"}