{"id": "t5_2tand_t3_qfk0h3_t1_hi3nrw6", "creation": 1635247410, "origin": "t5_2tand_t3_qfk0h3", "height": 1, "replied_to": "t5_2tand_t3_qfk0h3", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SiwelRise", "text": "You're getting a lot of great advice here, but also please remember not to overwhelm yourself. Take one or two things you would like to work on and focus on those, rather than trying to do all at once and overwhelming yourself. Here are my two cents:\n\nYou hear a lot about boundary work in the psychological sphere. People reduce it down to something as simple as say what you will or will not expect. But I think a good thing for you to do right now is to think about what kind of reasonable expectations you can have. There are appropriate times to be vulnerable and say how you feel and what you need from another person, and times when it is not appropriate because it is not safe. Take a good look at these situations you're talking about. Would it be appropriate to state a boundary if you know that the other person is not interested in caretaking your emotions and sense of safety? If you think that it wouldn't be productive then there's absolutely no reason why you should try to do so. Actually, responding to resistance with more resistance will only increase the resistance. Some people are also looking for conflict because it's the only form of attention they can manage to get due to circumstances in their lives. That is not your responsiblity to manage for them. At this point it may be safer for you to use the [grey rock method](https://mywellbeing.com/for-therapists/grey-rock-technique) in situations that you can't simply walk away from. Pushing or fighting back will make you *more* interesting to them, not less. \n\nAs for dealing with these things, if you focus on what you don't have, you will always feel a sense of lack. So while it might be difficult to do, try focusing on the things you're grateful for. This way your mind will have to shift its focus to something that is healthy for you rather than unnhealthy. If you can even use your legs, that's already something that you can be grateful for. And the more you do this, the more things you'll find to be grateful for. It will really help with a somewhat lopsided view of what your life is like right now. I'm not saying your fears or concerns are invalid - they absolutely are. But a shift in perspective can be a huge help to start working on something that will take many years and layers to heal. It's an important first step.", "permalink": "/r/DecidingToBeBetter/comments/qfk0h3/how_do_you_speak_up_for_your_self_without_causing/hi3nrw6/"}