{"id": "t5_2tand_t3_qfk0h3_t1_hi0q0q0", "creation": 1635188678, "origin": "t5_2tand_t3_qfk0h3", "height": 1, "replied_to": "t5_2tand_t3_qfk0h3", "down_vote": 0, "up_vote": 12, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "1password23", "text": "1. Therapy to discuss the source behind your anxiety and steps to heal, and steps to take to reduce anxiety in these situations. I am not a therapist, but here is my advice based on my similar journey:\n\n2. You are not at the point where you can stand up for yourself like the movies. Do not force yourself to try to, when you have not done the foundational work of addressing your traumas, fears, anxieties, and low self-confidence.\n\n3. Focus on overcoming your mind rather than these people. You cannot change how they act toward you yet. Right now, instead change how your mind reacts to them. The fear, the anxiety— there are many coping methods to deal with these reactions when they happen in the moment. Many people recommended meditation; I think insight meditation would be the most beneficial for you. The app “waking up” has been revolutionary for me in helping to control my negative emotions.\n\nA quick and dirty version— when you are anxious it is because you are thinking about the subject of your anxiety. When you are afraid it is because you are thinking about the cause of your fear. So direct your mind instead to something else. Many people focus on their breathing. I like to also focus on bodily sensations, and go through my entire body starting at my toes. Here’s an example: “My feet are warm. I can feel the press of my shoes against my toes. My ankle is resting on this chair leg, it is cold. I can feel the roughness of the jeans I’m wearing, and my right thigh resting on my left thigh, and my left thigh feels my right thigh resting on top of it….” And so on. Now, acknowledge your fear and anxiety as sensations in your body. “I am afraid. I feel lightheaded. My hands are shaking. This is okay. This is my fear in my body. My chest feels tight. My breath is short. Here is my fear.” \n\nDelegating your mind toward these things is a way of taking control. Short term, it takes your mind off of the situation at hand. Long term, Insight/mindfulness meditation (vipassana) will teach you how to let these negative emotions pass through you, and be as dismissible as the feeling of having your legs crossed. \n\nIf you do not wish to try meditation, my therapist said doing two seconds inhale, four seconds exhale breathing help calm you. There are many other anxiety techniques to look into.\n\n4. When you have addressed your anxiety (ideally with a therapist), developed coping mechanisms, and the mental strength to not let these situations traumatize you, you will gain the self-confidence to stand up for yourself. Some people do it directly, some people do it disguised as a joke, some people ignore insults entirely. You will find your way. But first you must find the strength within yourself. It’s no short journey, but we believe in you :)", "permalink": "/r/DecidingToBeBetter/comments/qfk0h3/how_do_you_speak_up_for_your_self_without_causing/hi0q0q0/"}