{"id": "t5_2tand_t3_gi6oad_t1_fqdf8yz", "creation": 1589288351, "origin": "t5_2tand_t3_gi6oad", "height": 1, "replied_to": "t5_2tand_t3_gi6oad", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Karma-Kazze", "text": "You need to change your identity as James clear says in “Atomic Habits”.\n\nYou are not a smoker and you are not an alcoholic or alcohol drinker. \n\nDon’t think of it as “I’m not going to drink ever again” think small, day by day. Time compounds and before you know it you won’t touch it or feel the urge for it. You will laugh at how simple it actually is to resist once you’ve done so for long enough. \n\nI was hospitalized and told that sugar feeds bad bacteria in the gut which was in turn causing me severe pain. I’m better now but I see sugar as the enemy and poison for the body. It’s the same with alcohol and smoking. \n\nI struggled for a couple weeks trying to figure out what I was going to have instead. Sometimes it isn’t the change that’s hard but the lack of planning. What are you going to do if you hit a blank on what you should have? Tea is a good one! But if there’s no tea? Water and if there’s no water you need to decide to not have anything. \n\nYou can do this prior to your decision or learn along the way. After the withdrawals or cravings it’s smooth sailing and now the only muscle you need to develop is the “NO” muscle. \n\nIf someone offers to pour you soda/alcohol or give you a smoke! NO! what are you doing bro! I’m not a smoker! (Remember the identity change) I don’t drink that anymore! \n\nAt the end of the day no one is perfect and you may accidentally fail. Don’t even think of rewarding yourself with either cigs or alcohol cause that would be a really bad idea. \n\nYou love this girl and you said you want to marry her. Make her proud and stick to the change. Also think of how you’re probably damaging yourself by consuming those 2. \n\nMy grandpa told me once that anything too much is poison for the body. \n\nYou got this brother! I believe in you! It gets easy as time progresses so don’t beat yourself up over intrum and early results. Celebrate them. But remember you playing for the end game! \n\nYou got this!\n\n[Edit]\nPs: the goal is to be like a vegan who says no to meat! You want to have that same commitment to say no to a smoke or drink lol.", "permalink": "/r/DecidingToBeBetter/comments/gi6oad/i_found_the_one_i_know_i_have_to_be_a_better/fqdf8yz/"}