{"id": "t5_2tand_t3_nadfr7_t1_gxtj4x5", "creation": 1620795599, "origin": "t5_2tand_t3_nadfr7", "height": 1, "replied_to": "t5_2tand_t3_nadfr7", "down_vote": 0, "up_vote": 47, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "FreeNote_", "text": "Ex chef here for you mate. \n\nWorking under pressure: this comes with experience, once you've been through enough seas of tickets you'll be immune. I highly recommend loosening up and finding humour in ridiculous situations in kitchens. At the end of the day when you're taking your jacket off, it will be your choice whether the stressful situations leave you chuckling with the mates or fuming and burnt out.\n\nConfidence: it's not your job to know every inch of every plate and be two steps ahead. That's why there's a hierarchy, a head chef, sous chef, kitchen manager. If you communicate \"everything is under control\" when it isn't, then the chef won't know where to allocate resources or make changes. Learn to take a step back, analyze the situation, and communicate accurately. A good chef will help you out, guide you through errors, and allocate resources to help when a session gets overrun. That's their job. Knowing your limit -but pushing it when acceptable- sets you apart and helps the WHOLE team.\n\nBeyond: if you want to push past what you learn on the line, explore working every section one by one. Ask to do some prep shifts. Your goal is to learn the whole kitchen top down. At home, challenge yourself constantly. Sign up for courses, make stuff from cultures you've never experienced. KNIFE SKILLS. Buy a starter kit and your own sharpening stones. Learn how to maintain your own professional gear. Practice frequently and learn from people who have more skill from you. You improve by doing hundreds of cuts/batches/whatevers a day, but work on technique at home or when a skilled chef is around.\n\nAlso: It's not always easy for everyone to do, but I recommend learning a place top down then moving to a new kitchen with a new type of cuisine. Every kitchen will teach you new things while your core skills get honed and refined. Staying in one place gets you up the hierarchy eventually, but there's so many types of cuisine, prep methods, flavours. Having a huge and refined palette is a skill for a lifetime.\n\nHope some of this helps you out, best of luck with your kitchen journey. Cheers", "permalink": "/r/DecidingToBeBetter/comments/nadfr7/landed_a_job_as_a_line_cook_my_goal_is_to_become/gxtj4x5/"}