{"id": "t5_2tand_t3_i35wxi_t1_g1szmuq", "creation": 1597637404, "origin": "t5_2tand_t3_i35wxi", "height": 1, "replied_to": "t5_2tand_t3_i35wxi", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "nomoreH8ingmyself", "text": "Sorry for the late reply. Funny that I happened to finally remember to finish writing back on your cake day of all days. \n\nYou’re welcome! Hope they’re helpful. \n\nIt’s surprisingly common, even among kids from “normal” families (which I was too). I strongly suspect that it actually *is* the case for most people. It only seems rare because (A) many traumatized people are not consciously aware of their trauma, and (B) even for those who are, it’s a fairly taboo thing to admit. \n\nTrauma is not just individual but also multi-generational. We inherit some of our parents’ trauma, as they inherited some of their parents’ trauma, going all the way back. \n\nAnd on the individual level, the harm is not just in the harmful thing(s) that happened to us way back when but also in the pain remaining unresolved for many years afterward. As Gabor Mate (“when the body says no” author and lecturer) puts it, “the stress is not just what happens to us, it’s how we process it.” (see the couple minutes starting at 1:05:20 in that lecture). \n\nWhen the pain and issues we experienced as children haven’t been resolved, we carry them on a deep level below our conscious awareness, and they manifest in some strange ways, like addictions and neurotic behaviors. \n\nCodependency is also quite common, it even shows up in pop culture. For example love songs with lyrics like “I can’t live without you” ... Things that might sound romantic but are actually very unhealthy. \n\nAnyway one more Major recommendation that I forgot: [A Little Book on the Human Shadow](https://www.ebay.com/i/233596543455?chn=ps&norover=1&mkevt=1&mkrid=711-213727-13078-0&mkcid=2&itemid=233596543455&targetid=4580909046828879&device=m&mktype=&googleloc=&poi=&campaignid=403204617&mkgroupid=1236950796289995&rlsatarget=pla-4580909046828879&abcId=9300376&merchantid=51291&msclkid=2918f6c927cc16708cd9a9f325bba9c0) is crucial. And it’s a pretty easy read. \n\nBest of luck to you friend!", "permalink": "/r/DecidingToBeBetter/comments/i35wxi/i_want_to_stop_being_codependent/g1szmuq/"}