{"id": "t5_2tand_t3_kh4dq4_t1_ggk5zhw", "creation": 1608528515, "origin": "t5_2tand_t3_kh4dq4", "height": 1, "replied_to": "t5_2tand_t3_kh4dq4", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "VARIMAXROTATION", "text": "Try to do something new every week (or day depending on how much energy you have, )until you find something you want to do again the next day!\n\nI constantly looking for new projects and having new obsessions constantly.. besides that I'm the same my main coping skill was people pleasing going out of my way to make sure everyone else is satisfied or have the least amount of tension on any interaction.  Its draining and not good for ourselves because we also need time for ourselves. I was a stone mason for 2 years and I was feeling super down and defeated that even though I had a degree the jobs weren't great in my profession, I was motivated enough to change and everyday after work I would practice welding I did invest in a small tig machine to learn(it was a big decision because of my income,) but it was a good investment after 6 months of practice I went to an interview took the welding test and got a new job in a completely different field it is hard but not impossible especially if you motivated enough for change. \n\nJust please don't give up on yourself, we will check up on you in a few month to see how your doing see what you've been up to! \n\naccountability is a great way to remind us how far we have come, I quit smoking  months ago , then relapsed , then stopped again and I felt so bad when I relapsed because I had someone PM and ask how it's been and I stopped a week after because if the whole tolerance thing, but I really didn't except for a stranger to take some time and ask me about my life months after my post. It just felt nice someone having me on their mind hoping I'm doing better. So I will do the same to you good sir I hope that you embrace change and never give up! I'm  proud of your choice!", "permalink": "/r/DecidingToBeBetter/comments/kh4dq4/ive_wasted_the_last_10_years_of_my_life_chasing/ggk5zhw/"}