{"id": "t5_2tand_t3_kbfgwq_t1_gfmypga", "creation": 1607831209, "origin": "t5_2tand_t3_kbfgwq", "height": 1, "replied_to": "t5_2tand_t3_kbfgwq", "down_vote": 0, "up_vote": -2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "GrandmasterIncel", "text": "you guys should start retaining your semen.\n\nThis make height or anything else irrelevant, I am 5\"4 and I give zero fucks about it.\n\nWhen you think about impressing women or other people in general you are completely missing the point. Women and even people in general are just human beings, they can betray the fuck out of you and decide out of nowhere that they no longer like you for extremely superficial reasons, women in particular can jump to another Chad just because they feel like it. Men are more dependable but they can also betray you if they gain a lot from it.\n\nHeight is not a feature to hide, it is part of you and what makes you an apex male, you are already one from birth just by virtue of accepting your manly essence, retaining it and basking in it. You gain unrestrained benefits from this because literally nobody in the world retains their semen, pretty much everybody is PMO dependent and they have no drive, no spirituality and no ambitions.\n\nAll the 6 foot Chads are just other people, they have nothing over you. This is just a physical trait that while attractive to women and a mark of leadership and dominance for male is definitely just that, a trait. You do not have to make it a big deal despite other people doing it, just do your own shit and give zero fucks. You are not playing the same game other people are doing, you are an apex male, not a normie or a Chad.\n\nThese people probably have feelings, moments of weakness, insecurities etc. And to be honest Chads are basically big babies that got everything handed to them on a silver platter since they were born, none of that manly drive to succeed or anything, just pure genetic lottery being won. Boring, no hard work at all.\n\nIf you get rid of all that baby teenager shit and transcend it all through sheer will of retaining your semen for a couple years you will look back and laugh at how try hard you used to be to get accepted by other people. I mean we are talking about normies here, people that are dumb enough to fall for traditional medias and the corona chan hoax. We are talking about people who would voluntarily gets themselves vaccinated because big brother said so.\n\nWhat is left of you is no mere normie or a mere man, you are pure manly essence and nothing else.\n\nThe gods are trembling right now at your every moves. \n\nForget the gym, forget self-improvement. Retain your semen and become a demi-god.", "permalink": "/r/DecidingToBeBetter/comments/kbfgwq/i_was_a_30_year_old_virgin_and_thought_i_would_be/gfmypga/"}