{"id": "t5_2tand_t3_npxsfs_t1_h07sjyi", "creation": 1622568912, "origin": "t5_2tand_t3_npxsfs", "height": 1, "replied_to": "t5_2tand_t3_npxsfs", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "King_ChickawawAA", "text": "It’s a tough one, and one I think is men are biologically wired to find tough. Our balls make millions of sperm, women have one egg a month. \n\nI think it’s totally natural to look around and feel that attraction to beautiful women, and I think you’re being very honest with yourself to admit this. \n\nAs someone who was married early, separated by 25, I definitely made the most of being single after that. I’d have that problem of too many girls and not enough nights of the week. It’s fun for a while, but it also has its challenges. Eh I don’t even wanna go on about that anymore cos it seems like a lame humblebrag, which is not my intention, just trying to say I know what you’re talking about.\n\nAt the end of the day, it comes down to sacrifice, and building something with someone better than you could achieve alone. Sure, you could dump this amazing woman you’ve found and you love and go out and bang a whole bunch of girls, but to paraphrase the words of John Butler “the grass may be greener but it’s just as hard to mow”. That fantasy that you find yourself pining after, sure it may be fun, for a bit, but how meaningful is it? Will it last? Will it be there for you in your ups and downs? \n\nI’m now finding myself in the best relationship I’ve ever had with an amazing woman for the last 4 years. I’m thankful in that I lived that man-ho lifestyle for a long time, probably too long, and know what it’s like. If you actually care about someone, you know they love you, you get to the undeniable reality that if you left them, or if you cheated, it would crush them. \n\nAnd if they’re a good person, do they deserve that?\n\nAnd do you want to be the kind of person that does that to someone you care about?\n\nMe, I know 1000% that I do not want to be that person, or hurt someone I care about.\n\nDo I still acknowledge that it would be fun to bang a bunch of women, sure, probably... 20%. It’s only a part of me, and a small part. I may always have a small percentage of that, it may get smaller as time goes on. \n\nBut you pick a good woman and build something better.\n\nThat’s my learnings at this point of it all anyway, kudos for speaking out and seeking guidance anyway dude. Not saying I’m right or wrong, but maybe I’m just sharing from further along that path... At the end of the day, it’s all about striving to be better, and conversations like these can be powerful ones, so thanks for starting it 🙏", "permalink": "/r/DecidingToBeBetter/comments/npxsfs/how_do_i_become_a_more_faithful_partner_and/h07sjyi/"}