{"id": "t5_2tand_t3_p19f3s_t1_h8n0gle", "creation": 1628764544, "origin": "t5_2tand_t3_p19f3s", "height": 1, "replied_to": "t5_2tand_t3_p19f3s", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "berrymeow", "text": "TLDR; In the same situation right now, which led to a bad lifestyle. Trying to claw back out as well. Create pre-commitment to make it easier to start working on something. Sending a scheduled e-mail is less scary. Look for a counsellor.\n\nHi, I'm currently doing an internship and I'm having a similar problem as you.  It led me to live a really bad lifestyle where I barely moved, ate, drank water, cleaned myself, talked, etc. I also have a bad self-image and I have been beating myself up whenever I'm alone for the past few months. There were times where I tried to claw out of this but I fell back into it soon after. I felt hopeless and scared. I almost gave up on trying to better myself because I kept falling back into the same situation. I lost quite a bit of weight and my hair kept dropping because of that. I weighed myself last Sunday and found out that I was 37.45kg and my BMI had hit 16. That was the lowest weight I've even been on since I stopped growing vertically (\\~6 years ago). The next day, I finally realised that I was in a really deep shit and it's probably time to change. I love my parents (still avoiding contact, but I love them a lot), and I don't think I can let them bear the pain of losing a child. Even though I believe that I'm a useless child, they still sacrificed a lot for my education.\n\nI bought milk (my counsellor's advice) because it's easier to just drink the vitamins and minerals instead of eating, and I reported what I ate to my online friend and got compliments whenever I finished a meal. I don't have an ED, I just lost all interest in life at one point and neglected myself.\n\nWork-wise, I love what I'm doing and I can still work on my internship project if I start doing it. However, sometimes I would end up watching YouTube for a few hours before starting. \n\nThe way I would make myself work is to create a pre-commitment the night before so that I would have less hurdle I need to start working the next morning. Here's how I usually do it:\n\n1. work out what I'm going to do tomorrow (it can be just inside my mind before I go to sleep or on some random paper if it's too complicated for my small brain)\n2. a rough outline of how I'm going to do it\n3. keep my code/documents/materials open before I go to sleep\n4. I also sleep really close to my workspace so that I can get up, get my tea and start working right away (this is usually not advisable, but I sleep on the couch and work on the table close to my couch while sitting on the floor, so it works for me)\n\nIt doesn't always work, but to me, it's better than nothing.\n\nHowever, I am still avoiding everything that requires me to interact with other people, whether it's my supervisor, my teacher, family, friends, or the admin people at my job. I don't have anything against anyone, but it scares me so much to send messages and emails. It's really scary and overwhelming, but sometimes I have to do it anyway.\n\nSo, for the times where I have to do it no matter what, I would write the email the day/night before and schedule it to send at a reasonable time the next morning so that my anxiety doesn't kill me when I'm trying to press the send button. If you generally sleep well, it should be fine, but don't do this if it makes you feel anxious when you're trying to sleep.\n\nTaking calls and giving prompt replies still scares me. I have the tendency to read messages from my push notifications and tell myself that I would reply later if it's not urgent, but when it gets too long, I became more scared of replying to them. Unfortunately, I haven't figured out how to get over this one yet. Disabling push notifications doesn't seem like a feasible solution for urgent matters.\n\nI also can't ask for help for the life of me. In front of my parents, I've always kept the image of a \"dependable first child\" that can study on her own and resolve her own problems. In front of my teachers and friends, I've always kept the image of the \"cheerful and independent girl\". So, I'm not used to asking for help even as a child. However, about 2 months ago, I was crying out of nowhere everyday, so I made myself sign up for counselling. I broke down on the first session but fell back to my cheerful mask after that session.... I'm still working on this as well.\n\nI'm still going through ups and downs but the crying spell has paused for a while because I've been avoiding myself again to drown myself in work because I'll have to do my final presentation tomorrow.\n\nBy the way, I'm currently exploring stoicism and fear-setting to ease my anxiety, maybe you can also try looking into it as well.\n\nWe'll figure it out!\n\nGood luck!!", "permalink": "/r/DecidingToBeBetter/comments/p19f3s/talking_about_it_acknowledging_it_taking_action/h8n0gle/"}