{"id": "t5_2tand_t3_ncmckt_t1_gy84a9y", "creation": 1621093664, "origin": "t5_2tand_t3_ncmckt", "height": 1, "replied_to": "t5_2tand_t3_ncmckt", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "progodyssey", "text": "I do.\n\nOne:\n\nIf it feels like people are scooping up your ideas before you use them, you are very lucky. Some people spend days trying to figure out what to say/draw/write/do. You not only have lots and lots of ideas, but you have living proof that they are good ideas -- other people using them. You are 15 years old and comparing yourself and your work to people maybe twice your age, and coming out looking pretty good! You are ahead of the curve for a 15-year-old.\n\nUnderstand and accept that self-doubt is part of being a creative professional. An Olympic swimmer does not win gold without getting wet and a successful creative does not find an audience without asking themselves every once in a while, and some do it every day, \"WTF am I doing??\"\n\nThis experience is there to teach that perseverance is critical, that building self-confidence takes time and mental effort, and that you continue to improve and grow your work.\n\nTwo:\n\nThis kind of talk,\n\n\\>but never actually act on 'helping me get rid of the problem' no matter how much I remind them\n\nand\n\n\\>I can't stop comparing myself to others, since it's basically wired into my brain since the very beginning, and I can not get myself to stop it\n\nis horsefeathers.\n\nNot only can you re-wire your brain, but you are the ONLY one who can rewire your brain. You will wait a long time if you wait for somebody else to do it for you. It's not even that difficult (barring more serious mental health complications than is normal for youth; if you have serious trauma, maybe start by accepting that professional help might be the way to go -- it only works if you help it along, though).\n\nI started seeing results re-wiring some brain habits within a couple of days of trying it out some years ago. You will find lots of online resources and tips on how to re-wire your brain to think positively and cut out negativity. It's no more complicated than breaking a habit.\n\nThree:\n\nI don't know anything about the profession you're aiming for, but I know that the doubt you are having sounds completely normal, and that your efforts at creating something big are exceptional. At 15, time is NOT running out. Try flipping the digits and adding a few years!\n\nGood luck and press on. Doubt is one of the fertilizers of creativity.", "permalink": "/r/DecidingToBeBetter/comments/ncmckt/severe_creative_envy/gy84a9y/"}