{"id": "t5_2tand_t3_lj2cbc_t1_gn9mvg0", "creation": 1613242865, "origin": "t5_2tand_t3_lj2cbc", "height": 1, "replied_to": "t5_2tand_t3_lj2cbc", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Here's something. I'm late 20s M. Right now I'm a Product Mgr. Last yr I was in FP&A working closely with CFO. If someone had told me that I'd be doing what I'm doing today when I was 16, I'd have said he/she is crazy. Not cuz I dont see myself doing this but at 16 I didn't even know this field existed! I didn't know a ton when I was 16. I still don't know a ton I'm sure. So how do I make peace with that? Knowing that TODAY I'm trying the best I can to make something of myself. If that means commenting on this post so that a random 16yr old gets at peace then so be it.\n\nHere's a few things that i'm sure you've heard but that you need to apply:\n\n1. change/expertise doesn't happen overnight. It takes months of dedication, if not yrs. No more insta, no more snapchat, no more binging netflix or Fb. I'm not saying this stuff is 'bad for you', it depends on how you use it. If you use this stuff to do ad campaigns and learn click-through rates and utilize it in a way that YOU are the master of these apps then go for it. For most of us, we're the consumers of these apps. Marketing teams live in these apps and make 6-fig salaries (again, Im not saying to chase this...I'd say to help others should be the goal).  Baby steps. Consistently. Do 20m of learning a day on a topic. No day offs. You'll go far in just 3 months.\n2. Sweep+Deep dive approach, consultants do this to learn more before giving recommendation to companies. Plan a schedule out. Every Fri night and Sat morning, take 6 diff fields. Random fields. That you haven't heard of. This is called 'sweeping', so you try to find crazy fields that you weren't aware of before and see where they're going. The research part is the 'deep dive'. Do that Sat night/Sun morning. Maybe you'll like 1 of the 6 fields, maybe you'll like 0, maybe you'll like all 6 - who knows. Jot it down and if you've questions then find someone who's an expert in that field (if you need help I'm here...I did physics, medicine, business and have friends in quite a few fields - I can try to find a mentor).\n   1. This is how you'll know what you should do in your 20s. Keep in mind: World is always evolving. Fields aren't constant. The goal is to be AWARE of whats out there, not necessarily DECIDE.\n3. DOING stuff isn't productivity. Sometimes taking a pause and self-reflective. Sometimes reading your notes again. Sometimes just breathing (relaxing). Sometimes asking yourself 'how did I FEEL when I was doing this task? Was I in the moment? Did I really like what I was doing or was I doing that task just because I heard its flashy or I was waiting for the end result?' hrs after you've done something will help. Taking a step back you know.\n\nTry some of this stuff out :) and good luck! Know one thing - you're more self-aware than most of my classmates back in high school lol, so kudos! If you wanna connect more for any ideas/advice, here : [https://sites.google.com/view/qalki/home](https://sites.google.com/view/qalki/home)", "permalink": "/r/DecidingToBeBetter/comments/lj2cbc/how_to_stop_constantly_feeling_like_youre_wasting/gn9mvg0/"}