{"id": "t5_2tand_t3_2phh44_t1_cmx2z26", "creation": 1418774768, "origin": "t5_2tand_t3_2phh44", "height": 1, "replied_to": "t5_2tand_t3_2phh44", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BashfulTurtle", "text": "I think the point is that most people *have it worse off than the privileged few.* That is due to fiscal distributions, in part.\n\nIt is absolutely understandable for those stricken with poverty to covet and those that have. I was there at one point; I didn't get why some people were born with all of the perks.\n\nIf her \"difficulties\" really are so much, then why is the crowning \"difficulty\" about being ridiculed in grade school that leads to the works she listed? It's juvenile. She's trying to paint adversity in a life without, in order to try to make it accessible as well as humanize her privilege.\n\nHer endowments make it unfair for everyone else and *she cannot see how egregious that is.* \n\nShe will not and that's not a bad thing. What is a bad thing is an article that really comes across as a whining sound rather than a pensive voice. \n\nThe obese are ostracized exponentially more than the skinny. The fact she tried to equate the two is just ridiculous. \n\nIt's a nice message, but this is like how white people were generally looked at with disdain when they argued in favor of Officer Wilson. Happened all around me as well as on twitter, Facebook, TV debates, etc. The bottom line is that it's simply not her place to say this. She has NO perspective of the other end of the spectrum - and it's bad.\n\nI think I've seen the spectrum at this point and it's just awe-inducingly horrible on the lower rungs of the ladder. Cute message and good and all, but not how this world works.\n\nIf you want to say that the idyllic message here is the best part, then go for it. It's just not feasible.\n", "permalink": "/r/DecidingToBeBetter/comments/2phh44/i_am_a_thin_beautiful_privileged_woman_article/cmx2z26/"}