{"id": "t5_2tand_t3_q0h5k3_t1_hfbrn7y", "creation": 1633332775, "origin": "t5_2tand_t3_q0h5k3", "height": 1, "replied_to": "t5_2tand_t3_q0h5k3", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Zombiefood40", "text": "Wow!  I’ve never read such a situation I can relate to as yours. I have to read that again I am in shock!!! \n\nI agree weed is a medication for a lot of people. Considering it’s legal for recreation here too, if you don’t let it due you or control you which some people do it’s all good. \n\nYou have been through so fcking much and you are a survivor. You have inspired so many people with your story right her and have given so much hope. You should write a book. That’s what I’d like to do, but my grammar is shit. People like you and I @OP I truly believe are chosen to help other people. That’s why we are still alive. We still have to make that happen, but that’s up to us like tour choice to live! I don’t know you, but I am just as proud of you as anyone you know IRL. \n\nGreat job and bad choices make great stories. You put yourself through this for a reason. I’m not able to tell anyone how I finally can accept the past and now dwell on it. I think I used my fear and anxiety to fight harder and it got to the point of either giving up or fighting 100% know matter what comes my way. It took me 4 years too get on disability because anxiety was too bad to call a free lawyer. Having the dual diagnosis makes things not harder but a lot more complicated. \n\nBack to you! I know you won’t go back to drugs and you are going to do this. Can I ask how you finally reached this decision, and how many other times you’ve tried. Pm me if you get the chance to chat. Way too similar situations. \n\nI am not completely happy with my choices like long term benzo use ( as directed ) considering I’m 41 and 20 years on them. Especially with the post acute withdrawal ( Paw ) Also I take Kratom as you smoke weed. It might not be that healthy for me, but it’s more or less medication. I’m finally stable agree 20+ years of wanting to become sober. I am not where I want to be, but I will get there or die trying. Seriously bro great job and much respect !", "permalink": "/r/DecidingToBeBetter/comments/q0h5k3/today_im_quitting_cocaine/hfbrn7y/"}