{"id": "t5_2tand_t3_q0h5k3_t1_hf9z7vr", "creation": 1633297180, "origin": "t5_2tand_t3_q0h5k3", "height": 1, "replied_to": "t5_2tand_t3_q0h5k3", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "benjers27", "text": "Wall of text. Written like a true coke head lol.\n\nI'm an ex-addict myself. Not coke though surprising it was one of the few drugs I never had a problem with. A good girl/guy in your life can make a huge positive difference. But it can also lead right back to rock bottom if things go sour. Don't let your sobriety be all about that relationship. I guarantee if it does shit the bed you will fall right back into drug fueled depression. I know first hand as do many others. Unfortunately, that is usually when alot of addicts bite it for good. (After being clean a while)\n\nMake sure you have clear ideals that this sobriety is 100% for you and once you are sober you will realize how amazing life can be clean. This girl will love the sober you as well. Not the fiendish creature you were. Always remember that even just a little here and there is a recipie for disaster and looks really unattractive. \n\nWhat helped me the most after I had been sober for sometime was helping others and staying apart of a community that involved sobriety. For me, I found that in AA at first. Just being there helping others honestly helped me more than any of steps in AA.\n\nNow, I have to admit I hated the idea of AA and everything it stood for when I first joined. (As does reddit collectively it seems) I still don't do the steps like some people do or any of the religious mumbo-jumbo I found in the big book. I had beaten my heroin addiction a couple of years before I joined AA and was drinking myself to death during covid. I was losing everything I had worked hard for. My house, my wife, my kids. They were slipping through my shaky hands. I joined an online AA group reluctantly and started to love the people I met. Eventually helping some of the new ones out. I even my own beginners meeting now. It's really the main thing that keeps me sober in the times I feel like using.\n\nSo my advice to you is find a group of people or program or w.e that YOU think you could dig. Surround yourself with those people and keep at it. Once you are in a place you can help others. Do it. You will find you actually like being sober. Life flows easier. Your happier you don't stress about $ all the time or where to score. People will see it in you and give you more opportunities. I am blown away with my sober mind all the time. Things I thought I could never do suddently became possible. \n\n\nI belive in you. Message me anytime.", "permalink": "/r/DecidingToBeBetter/comments/q0h5k3/today_im_quitting_cocaine/hf9z7vr/"}