{"id": "t5_2tand_t3_2jgxsw_t1_clcathe", "creation": 1413573131, "origin": "t5_2tand_t3_2jgxsw", "height": 1, "replied_to": "t5_2tand_t3_2jgxsw", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lesspoppedthanever", "text": "I think I get what you're saying, and I agree that it's absolutely an important life skill to learn to deal with unpleasantness. I actually have found that the times when I'm getting the most worked up over things on the Internet are the times when I'm having the most trouble in terms of emotional health. That said, learning to walk away is also an important coping mechanism -- the times when I'm healthiest are the times where I just shrug and move on rather than getting into a big fight that only leaves me feeling more unhappy. Learning to recognize when I was actually just exposing myself to things I knew would get me riled up so I had an excuse to get into a fight on the Internet was a huge part of my therapy process. And that process included no longer following blogs and, yes, subs that were feeding that cycle.\n\nFor you, that might be running away, because you and I are different people (as far as I know^(Twilight Zone music)), and we have different issues and personalities. For me, though, I've found that cutting out a lot of the nastiness in my online life actually left me much better prepared for angry-making things that I just run into now as part of my offline life. When I was primed to get angry at every little thing, it meant that I...you guessed it, got angry at every little thing, because anger was the most common emotion I was used to, and it was a vicious cycle where the more I did it, the more used to it I was, and the more easily it flared up. Now that it's not something I experience regularly (at least not to that degree -- of course I still get annoyed over things, but it's not the nuclear explosion-level HOW DARE YOU, YOU ARE WORSE THAN A THOUSAND HITLERS, THAT'S RIGHT YOUR TERRIBLENESS LEVEL > 1 KILOHITLER rage that it used to be), I'm able to recognize an unusual level of anger *as* unusual, and do a little mental check-in: \"wow, self, you are really angry about this, is something else actually going on?\" And not exposing myself to stuff that I knew going in would just cause that nuclear explosion of anger also meant that I had more energy to deal in a healthy, mature way with the stuff that made me angry in everyday life. It made it much, much easier to just shrug things off, roll my eyes, and move on because it helped me get a better sense of proportion.\n\nNot to say that your way of doing reddit is wrong and mine is right! But as you say, reddit is highly customizeable, and part of the reason for that is that we all come here for something different, you know?\n\nedit: lol one day I will master superscripts on the first try", "permalink": "/r/DecidingToBeBetter/comments/2jgxsw/i_decided_to_be_better_by_unsubbing_from_many/clcathe/"}