{"id": "t5_2qh1i_t3_1at1hr_t1_c968ebc", "creation": 1364810929, "origin": "t5_2qh1i_t3_1at1hr", "height": 1, "replied_to": "t5_2qh1i_t3_1at1hr", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "To get a better idea of what goes on in someone's mind when they decide to go: \n\nThe first thing that comes over a suicidal person is a a sense of relief once they have resolved to die. They will appear well, because they are calm. The exit is their  control over the darkness they may have battled for decades. \n\nWhen I was 14 I tried to commit suicide. \nNo note. \nMy parents had gone out of town and it was my mother's intuition that saved me.  Her   unerring spidey sense told her that her weekend must be cut short because something was wrong.\nI woke up in the ER and spent 3 months in a hospital. \n\n\n\nSo, whenever things get really bad I think about \n\n1. Killing myself would kill my parents.They have had a rough life and worked very hard to keep us kids level.  If I'm a batty old cat lady spinster at 50 with no hope, or I have incurable painful cancer, then I have the right to reconsider suicide. After battling depression for my entire life, I'm allowed that much.\nBut first, I have to give it the old college try. \n\n2. Failed suicide.  If i go off my rocker and make a big old mess and fail, \nI'll lose my job, independence,  home and everything I've worked so hard for. Since my parents aren't the nurturing type, I'd probably end up homeless to boot. Worst case scenario: My poor family has to take care of a vegetable, although I have a DNR and advance medical directive in case I get really sick. \n\n3. I'm stubborn. It's defeatist to give up and land one's sword. I'm going to try my damnedest to kick the shit out out of depression just to spite it because depression is a mean bitch.  This too shall pass. I don't like making impulsive decisions, and I'd like make the world a better place for my friends and family. \n\nI've had a few people I love/care for commit suicide, and I'm not angry at them. Most of them struggled with darkness every day of their lives and just gave up. \n\nI'm sorry for your family's loss. \n \n", "permalink": "/r/AskReddit/comments/1at1hr/suicide_survivors_of_reddit_what_went_through/c968ebc/"}