{"id": "t5_2tand_t3_hc8fu9_t1_fvevofo", "creation": 1592629413, "origin": "t5_2tand_t3_hc8fu9", "height": 1, "replied_to": "t5_2tand_t3_hc8fu9", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Tea-beast", "text": "I am on a 2 week-going into 3 week journey myself, and I know it may seem difficult, but there's no real wrong way to do it! Guided mediation helps, which are all over youtube, and they guide you through on how to do exactly what it takes for a full experience. I recently answered another question about sources for a first timer going in who asked for links, so here's some from that answer as well :\n\nTo begin at step one, this channel helps break down the basics of emotional fortitude and why you feel the way you do. Do not feel shame. Feelings are nature, but how they grip us is out of out desired default state, however we CAN change them.\n\n[Therapy In A Nutshell](https://www.youtube.com/channel/UCpuqYFKLkcEryEieomiAv3Q) \\- This channel provides professional help of easy to follow guidance of why we think the way we do. Her series on re-wiring the brain is exactly the best way to break down the helplessness that often comes with not knowing the issues and feeling no power to change them.\n\nPart I of rewiring the brain - [Rewire the Anxious Brain - You can change your thought pattern](https://www.youtube.com/watch?v=zTuX_ShUrw0)\n\n[Another channel from the popular app Calm](https://www.youtube.com/user/calmdotcom), has free content to refer to.\n\nWhile some channels and each channel operator have different content and styles, I encourage you to explore and find ones that fit your style, too!\n\nWhile you learn, you may feel it best to take reference notes to track your progress or help keep yourself on top of your self study. Bullet journals are a great way to do this, I keep one for journaling and making sketches of images that are reminders of what I like most, and I also keep a notepad that I write my feelings in, my discoveries about my ego, and how to break them down to feel free from the shame and avoidance of feeling uncomfortable in my emotions. Positive mindsets are what you will have to keep reminding yourself to have.\n\n[Self-Care Awareness Journal Ideas](https://www.ourmindfullife.com/self-care-bullet-journal-ideas/)\n\n[Keeping a Meditation Journal - The Benefits](https://mindworks.org/blog/keeping-meditation-journal/)\n\nMobile apps are also a great on-the-go way to keep a few meditations in your pocket, use earbuds to fully immerse yourself in them to block out outside noises and distractions.\n\n[Meditopia - meditation and uplifting guidance app](https://play.google.com/store/apps/details?id=app.meditasyon)\n\n[Serenity - Meditation Step-by-step app](https://play.google.com/store/apps/details?id=uk.co.serenity.guided.meditation&hl=en_US)\n\n[Let's Meditate - A free app with regular updates and helpful tips](https://play.google.com/store/apps/details?id=com.meditation.elevenminute)\n\n[Headspace - a popular and thorough meditation and emotional tracker app](https://play.google.com/store/apps/details?id=com.getsomeheadspace.android)", "permalink": "/r/DecidingToBeBetter/comments/hc8fu9/ive_decided_now_what/fvevofo/"}