{"id": "t5_2tand_t3_gmrb74_t1_g54n11o", "creation": 1600014828, "origin": "t5_2tand_t3_gmrb74", "height": 1, "replied_to": "t5_2tand_t3_gmrb74", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "the-Toddfather", "text": "Not sure if anyone follows this exact post, but it has been about 3 months since, and I wanted to provide those interested with a decent update. Although 3 months is a relatively short amount of time, we have made some great strides:\n\nWe began product development about 3 weeks ago, and expect to have early published data by mid-December that confirms we have created exactly what we claimed we could. \n\nScientifically- We have had world experts in genetic and protein engineering (including CRISPR) review and approve our designs, a world leader in T- and B- cell immunology and vaccine development has been helping with our development and are both now permanently part of our team. It is possible, according to them, that some of our treatments may even be curative for their indications, but they will certainly be far more efficacious than existing treatments and for a multitude of reasons. Our initial indications have also changed a bit, as we have recognized patterns in certain disease pathologies. Psoriasis is still one, but we will also target Uveitis (3rd leading cause of blindness), Sjogren's Syndrome, and COVID-19 for this first round of product development. All with little to no side effects, while current treatments have serious side effects and have low efficacy. We will be shifting the treatment paradigm for autoimmune diseases, and we have identified at least 30 different diseases we are capable of treating using our platform, plus additional items such as wound healing and organ transplantation (vastly reducing/eliminating risk of GVHD and organ rejection), and more.\n\nFinancially, we are about 1/3 to our seed round goal and have learned the difficulties of raising at this round in biotech, due to the catch-22 that every investor wants data first and yet we need funding first to perform trials in order to collect hard data. Luckily, the quarter million in funding we have secured is enough for us to produce our minimum viable product and, as I said earlier, will allow us to collect enough early data by Dec/Jan establishing that our product exists as we described and we can also perform immunosuppressive assays to help describe potency. Once we have these in-hand it will derisk the technology and surely pave the way for more funding then, but acquiring more seed funding sooner would help so much more, as I could finally have things like health insurance again, we could move to a private office & lab instead of a shared space (we are running out of storage room), and our 3rd co-founder could finally work full time instead of half time. Everyone says that you should seek this round of funding from friends and family, and we have gotten a decent portion of our existing funding from that already; however, we are all in our early 30's and most of our friends cannot afford to invest, and those that can are typically limited to $10-25k. Angel investor groups are hesitant to invest into biotech before data is collected. We have begun reaching out to physicians, ophthalmologists, etc for interviews to gage what a competitive price point would be for our upcoming products, and we will consider approaching some of them later to see if they are interested in investing. \n\nIf anyone has suggestions for seed investor leads that maybe we haven't explored yet, please contact me. Health insurance would be real nice, as I actually got sick recently and had a scare that it might be Covid, but turned out to be strep...which instead of using the typical prescribed antibiotics, I defeated with home remedies, healthy eating and the fitness routine I maintain.\n\nLastly, in terms of updates to our team - we have very recently signed on a CFO (initially a 3 month contract to see how well he fits the team), but we are very pleased with him so far. He brings all of the business, accounting and VC firm level fundraising expertise to the team that we didn't have before. He is an older successful man from San Francisco's Financial District with experience as CFO and CEO in several success stories with a vast network of investors for Series A and beyond. He has begun personally training me in all of these aspects as well, and I welcome diversifying my own portfolio beyond science and tech. Next, each of the bio science experts we reached out to that we permitted to review our confidential slide deck have joined the team as permanent advisors: 3 of the 4 are doing it for free and the 4th is doing it for only $50/hr, because they believe in our team and in what we are doing. This part feels amazing and helps keep my fire lit every morning. I've described 2 of those experts earlier, the 3rd is specifically in the field of psoriasis for 20+ years, and the 4th is a newly retired CSO of a company that specializes in a biotech very similar to our core (but for diagnostics instead of therapeutics) and he has lots of grant acquisition experience so he is helping us work towards federal grant funding, especially in relation to our developing Covid treatment and potential wound healing for the military.", "permalink": "/r/DecidingToBeBetter/comments/gmrb74/yesterday_i_resigned_from_my_job_to_fully_devote/g54n11o/"}