{"id": "t5_2tand_t3_o4xy5z_t1_h2px5nh", "creation": 1624412128, "origin": "t5_2tand_t3_o4xy5z", "height": 1, "replied_to": "t5_2tand_t3_o4xy5z", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Empathy is only deserved if there is something genuinely stopping you and/or after the actually accomplished their goals.\n\nActually by proper definition of the word empathy, im pretty empathic to others, until they start making exucses over time, or make BS up, that empathy goes out the window, as it should. As I said, tough love.\n\n\nGiving people empathy out of spite is only going to reinforce their excuses and bad behaviour over time. I know this because I've been I  that situation and only made my state worse without me knowing.\n\n\nYou are not helping them patting them on the back when 1 year later they are still in the same position, yet... have the life and access to change that, but they rather not, because  everyone feels bad for them and tells them it oka to feel depressed, its ok to eat anoher burger, it really isnt, you are reinforcing garbage that hurts them even more.\n\n\n\nIf you are fat and live in a comfortable 1st world country and unless you genuilely have genetic disorders, you realistically have ZERO excuses apart from your own laziness which you should at least admit at the very least. \n\nSame goes for depression, you are feeling depressed because your life sucks and your brain chemicals are imbalanced because of it.\n\nI dont care if you are feeling depressed etc. Sure I understand how you are feeling completely,  but there comes a moment when  you have to change that, nobody else will for you.\n\nSUpport you? Sure but im not going to do the running for you, because I can't.\n\nI can't make you feel happy with the snap of my finger, happiness isn't even supposed to be am everyday occurrence, you have to work to be in a position of GENUINE happiness.", "permalink": "/r/DecidingToBeBetter/comments/o4xy5z/one_of_the_main_and_most_underrated_ingredients/h2px5nh/"}