{"id": "t5_2tand_t3_o4xy5z_t1_h2oyrgm", "creation": 1624394437, "origin": "t5_2tand_t3_o4xy5z", "height": 1, "replied_to": "t5_2tand_t3_o4xy5z", "down_vote": 0, "up_vote": -1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": ">I think this is the problem right here. Instead of talking to the people who are overweight and seeing what they need we make assumptions of what they need.\n\nUnless they are my close friends, I don't tell people to shed weight, because they get all emotional EVEN when they know for a fact its a detriment.\n\n''My BodY, My ChoIce'', health and disease doesn't discriminate, Diabetes ain't walking out the door because you are emotional and making shitty excuses.\n\nI still have to meet a fat person that was genuinely happy about his phsyique without lying through their teeth.\n\n&#x200B;\n\n>Respectfully you sound like someone who has never fought with their weight.\n\nI mean I dont get how you came to that assumption, I was underweight for my age/height for a few years, depression/anxiety/ Zero energy etc.\n\nI would argue I got more shit in my situation than a fat person does for their weight.\n\nEVERYDAY people would mention something about it, but I didn't make shitty excuses, I know it just made me felt bad, but I didn't use that abuse to justify my position either...\n\nI recently gained 10kg in the past 7 months, and im still on the lean side of things, but at least I don't look like a holocaust survivor.\n\nI didn't stop blatant hate from people as an excuse to not do something about it, something that most people don't understand this century it seems.\n\n&#x200B;\n\n&#x200B;\n\n>You can't solve the problem unless you know what they're struggling with.\n\nYeah,  sure you are ''struggling'' from not actually being bothered to go outside 3x a week and go for a walk/jog for 30 minutes, yeah the struggle must be so hard not eating those extra fries.\n\nJesus fck dude, people should swap their lives out for a poor African and see how much they  ''struggle'' now, its pathetic really, if you have food on the table, a roof over your head, and you live confortable compared to the majority of the population AND YOU STILL make excuses, then you deserve none of that.\n\nTheres comes a point where your excuses and ''struggles'', well aren't an excuse anymore. People are not going to feel bad and make excuses for you in the long run.I don't tolerate BS from people coming up with a platter of excuses X/Y/Z, sure theres the rare cases of medical obesity/underweight, but to pick out those expections and think you are one of those when you are not is downright pathetic.\n\n&#x200B;\n\nBut hey, if people want to defend their shitty ego on weight, then go ahead and get heart disease alongside a dish of diabetes, unfortunately most people ONLY change then, when its to late, not to mention the bill you have to pay depending on medical care, yes throw away more of your money for the neglect of what you knew was coming all along and did nothing to prevent it.", "permalink": "/r/DecidingToBeBetter/comments/o4xy5z/one_of_the_main_and_most_underrated_ingredients/h2oyrgm/"}