{"id": "t5_2tand_t3_ismrqr_t1_g5c36hp", "creation": 1600155125, "origin": "t5_2tand_t3_ismrqr", "height": 1, "replied_to": "t5_2tand_t3_ismrqr", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Reisno", "text": "Well society in this small-ish town has their own idea of what is healthy, it even has its own reputation in this country.\n\nI was put on anti-psychotics in the US though, I only took a few meds while I was in this country for a few years and since detoxed from them because they were expensive and unhelpful.\n\nTopomax in particular messed me up so badly that I couldn't get out of bed for 6 weeks, my psychiatrist laughed about this, well chuckled, and threw her hands up and said that I just have drug resistant depression. My partner looked up that med prior to her prescribing it and told her of the side effects (in their native language, I didn't catch this part of the discussion during that appointment) and she didn't take it seriously. This was aggravating, especially since I paid out of pocket for her sessions and for the meds, but she helped me get medical weed so I forgave her. We are able to negotiate and work with her when we have unusual treatment avenues we want to explore and that's very strategic.\n\nEvery time we try to get treatment in this country something like this goes down or worse, every single time. But the cost of living is very low and we have strategic things to work with here, so we make it work for us.\n\nWhat we deserve isn't the same as what we get, and we got to make the most of what we get. My in-laws are horrible, this is true, they messed up my partner on so many levels and they are incapable of understanding this.\n\nHis mother almost faced legal action for the level of neglect she had towards her kids and that's in a town that doesn't give a shit about selling minors beer, domestic violence, and weekly car accidents. If they were in the states, my partner and his sister would be removed from that home and thrown into fostercare.\n\nThey make me sick too for how they treated my partner, but over the years I'm beginning to understand that they just have really, really ridged thinking, they can barely work a microwave and they messed up even making waffles in a waffle maker.\n\nWe've tried to build that community through polyamory but this led to a lot of heartbreak on our parts, in time we'll earn that community with our art and projects, just one step at a time!\n\nThank you for your acknowledgment and encouragement!", "permalink": "/r/DecidingToBeBetter/comments/ismrqr/ive_been_sober_from_alcohol_for_over_6_years_now/g5c36hp/"}