{"id": "t5_2qh5i_t3_6l94g1_t1_dk1xxjl", "creation": 1499736774, "origin": "t5_2qh5i_t3_6l94g1", "height": 1, "replied_to": "t5_2qh5i_t3_6l94g1", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ryuk9786", "text": "Thank you for answering! You maybe didn't teach him anything explicitly, but I think giving him space to communicate with you was essential to his development.\n\nYou are talking about matters that are so interesting to me. How people become who they are now? What makes a good father? How to mantain healthy long-term relations? In long-term relations, the ones with your sons may be the most difficult and critical of all.\n\nI think communication plays a big role in such matters. I am closer to the adolescent I was than to be a father (I think), so I can remember (shamefully) what was it like to be tired of your parents (something that I believe is not universal!).\n\nBut what could make it at least slightly easier in that times? I think that just saying things directly to your children and listen to their ideas, keeping it simple. Saying to them that you find difficult communicating with them and you want to fix it, and ask them some minimum sacrifice to express what do they feel, what don't they like, what would they change about anything, what are their visions of the world, what they would want to pursue in life, what are they looking for, what do they like, what are their passions if they found any yet (This last thing I think COULD be related to the laziness thing you mentioned; I think so because my parents didn't have that specific problem with me, and I think it was because I was really interested in what I was doing in those years)\n\nAny father is most likely to receive as a response some bad ideas, useless visions about life and hurtful opinions... but isn't that more useful than to just let them try to understand your vision and methods on their own? When you start a conversation where you let them say this things you are able to respond and also explain yourself. I think they are most likely to understand your ways after that, even if they don't say it then, even if it takes some more awkward and difficult conversations. You would be (slowly) building a bridge between you and a brand new adult person that has its own views and way of thinking.\n\nWould you add or correct something to my theories? Did you do some of this with your son?\n\nAnd please excuse my broken english and the long response and the questions XD", "permalink": "/r/happy/comments/6l94g1/my_wife_and_son/dk1xxjl/"}