{"id": "t5_2tand_t3_phdv44_t1_hblof0i", "creation": 1630783152, "origin": "t5_2tand_t3_phdv44", "height": 1, "replied_to": "t5_2tand_t3_phdv44", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ll-canti-ll", "text": "I had to hear it harshly so I’m going to put it to you the same. You might be an alcoholic. An alcoholic doesn’t necessarily drink everyday, drink I’m the mornings, withdraw or develop physical addiction what have you what have you. \n\nAn alcoholic is someone who when they have one drink has a switch flipped and their brain no longer remembers that they were having one, they just want to drink more. That’s what an alcoholic is and the first step to not drinking is to kinda work towards accepting you might be an alcoholic. \n\nThe second thing I know is gunna suck to hear but ya gotta hear it is unless you change people, places, and things it’s gunna be real hard to stop drinking with consistency (as I think you’re finding out)\n\nMy advice would be to look into a drug/alcohol recovery program - whether it’s AA, a rehab, an addictions counselor, refuge recovery (Buddhist based AA), or something of the sort. \n\nEven if you aren’t an alcoholic, you drink and act like one so it’s their solutions that will help you stop that\n\nIt’s not even a commitment. No one will hunt you down if you stop going to AA or if you AMA at a rehab, there’s no harm in exploring these things\n\nIt sounds like you’re vulnerable and having a moment of clarity, seize that as soon as you can before you have to wait another who knows how long to have that again\n\nThat would be my advice, stay tuff\n\nEdit: I’ll also throw in, it turns out I wasn’t an alcoholic. I can and on occasion do drink normally now. But in order to heal it took 5 years of sobriety, a lot of treatment, a lot of AA meetings, and a lot of self reflection. It also took me living and recovering those 5 years as someone who identified as an alcoholic. They only reason I don’t now is I no longer fit the criteria. I had a lot of underlying mental health issues that needed a lot of chipping away at. \n\nI don’t say this to give you hope youll one day drink normally, but to give support that even if you aren’t truly/genetically/mentally/permanently  An alcoholic - their solutions are the ones that will help. And it will help to accept you may not ever be able to drink again.", "permalink": "/r/DecidingToBeBetter/comments/phdv44/accepting_that_i_have_a_drinking_problem/hblof0i/"}