{"id": "t5_2tand_t3_qh7pea_t1_hidofju", "creation": 1635428509, "origin": "t5_2tand_t3_qh7pea", "height": 1, "replied_to": "t5_2tand_t3_qh7pea", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "daitoshi", "text": "Hello new adult! Welcome to adulthood, where your routines are no longer built for you, friends aren't shoved into your arms due to being trapped in the same building, and no one is telling you exactly what to be doing at all times anymore. The sudden lack of structure and convenience of socialization is a shock to many, and no one fucking WARNS people about this. \n\nYou need to build yourself a routine that includes basic socialization. That's the big key. Maybe it's a once-a-week thing where you join a club, or a DND group, or a band. Join SOMETHING that expects YOU, specifically, to be in attendance every week. \n\nPursue hobbies that can be done in solitude, but *also* attend group events around that hobby. \n\nWeaving, for instance, is something you do alone in your house for hours and hours. \n\nBut it's extremely rewarding to meet up with other weavers at events and fairs, and to attend classes with experienced weavers to learn from them. You can make friends quickly that way! \n\nRemember that most people don't want to go out every single night. Clubs are often a once-or-twice-a-month meeting that lasts for a couple hours. There's also weekly hangouts with friends Compare that to the 5-6 other days per week that you're alone at home - you're still mostly in solitude. \n\nOther very-solitary hobbies that can still gain you friendships as long as you go to events that revolve around the topic:\n\n\\- Making model miniatures \n\n\\- Building naturalistic habitats for fish, amphibians, reptiles, or insects. \n\n\\- Gardening! Especially native & edible food gardening.\n\n\\- Mask or costume-making. \n\n\\- Anything to do with 3D printing \n\n\\- Restoring old antiques, like cast-iron pans or really old gaming systems. \n\n\\-  Hiking. Be alone with your thoughts and wander across some gorgeous landscapes. You don't need to pick difficult trails! There are plenty of long 'walking' trails that you don't need any special gear for - just a water bottle and some comfy shoes. \n\n\\- Join a local class for dance or gymnastics or something else fun and active. Again: You only see these people 1x per week for an hour or two, but being in an active sport is an auto-boost to health and self-confidence. \n\n\\- Make your own soaps! Hell, learn any homecraft skill and you can join a HUGE and very enthusiastic community of folks who want to be self-sustaining and also want to be friends with ppl who share their passion. \n\n\\- Learn an instrument \n\n\\- Woodworking (You can start with an inexpensive hand chisel, soft woods, and glue to learn the basic carving skills, and get power tools later when you can afford it) \n\n\\--- \n\n**TLDR;** \n\nYou're suffering from understimulation and under-enrichment. \n\nA tiger at the zoo needs someone to wave around a feather duster so it can chase after, or to bat around a pumpkin full of meat, or a big bloody ice cube to lick on, or it'll go insane and pace in circles and then flop down and just.... fade and sleep the days away. Lethargy and depression and apathy, because brains would rather be unconscious than chronically bored. \n\nFind your meat-stuffed pumpkin. Find something that excites you, thrills you into action, and makes you WANT. \n\nGive yourself some enrichment.", "permalink": "/r/DecidingToBeBetter/comments/qh7pea/i_prefer_spending_time_alone_but_i_dont_want_to/hidofju/"}