{"id": "t5_2qh5i_t3_mi6b84_t1_gtdc0og", "creation": 1617560176, "origin": "t5_2qh5i_t3_mi6b84", "height": 1, "replied_to": "t5_2qh5i_t3_mi6b84", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "LukeBomber", "text": "I got you because I empathize with you, I understand you. My own journey towards better self esteem was long... and... well... ongoing. But you will believe it a little every time someone tell you the compliment. Keep coming back to the post whenever you feel down. Something that really helped me was surrounding myself with people I could trust and that I knew trusted me.  Nice people whom lifted me up, and whom I tried to lift up.\n\nAtleast it is harder for your brain to somehow denounce the nice messages you got here, since the usual excuses are less believeable (its just 1 person, they are just saying it to be nice, they are wrong etc.) since many are saying it. I know my brain constantly tries.\n\nHang in there, you will have those awesome moments again. They say when you tell yourself something enough, you start to believe it. Thats usually said when talking about negative reinforcement and self-critism. It also goes the other way, try be positive, even if it feels fake, remind yourself that many agree on this positive viewpoint of you. You will believe it a little every time. Also I have said this to a couple of friends in the past:\n\nListen, I am calling you beautiful and kind\n\nEither:\n\n\\- I am a liar\n\n\\- I am stupid (bad judgement of character)\n\n\\- I am telling the truth\n\nI predict you cannot possibly get yourself to choose the first 2 (since you are a good person) And therefor the third options seems less hard to believe. It also seems crazy that everyone in this very positive subreddit would lie or judge you wrong. Maybe, just maybe, you are the one who is wrong about you\n\nAlternatively, if you cannot believe the compliments, instead believe that others believe them. Maybe you do not believe you are very beautiful (you are) but maybe you can believe that I believe it?\n\nAlways remember:\n\n\\- Many people are their own worst critic, and being selfcritical is the hallmark of an honest person who tries to selfimprove. Aka, a good person\n\n\\- Anyone can find flaws in themselves whether its looks or habbits, since you know yourself the best. You can be... negatively biased\n\n\\- For example, most people hate their own voices\n\n\\- You don't realise how many others feel bad about themselves because they usually hide it, and dont show it publically. Everyone (and I repeat), everyone has issues and troubles they are dealing with. Though not everyones problems are as big, you are definitly not alone in your struggles\n\n\\- Your journey may be hard, but it is never impossible until you deem it so, then you have given up. And its never too late to keep trying, take it from me (though I never had major depressive disorder, for many years I hated myself... Sometimes I still do)\n\n\\- Best regaards, Luke\n\n(For real though your smile shines like the sun and your eyes are soul-catching. It is extremely hard to believe anyone could say anything else)", "permalink": "/r/happy/comments/mi6b84/i_have_major_depressive_disorder_and_have_had/gtdc0og/"}