{"id": "t5_2tand_t3_o4i2r2_t1_h2ipgrl", "creation": 1624266663, "origin": "t5_2tand_t3_o4i2r2", "height": 1, "replied_to": "t5_2tand_t3_o4i2r2", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Curious-Neo", "text": "It is really heartening and inspiring to see you doing all the right things rather than just feeling sorry for yourself. It seems a 360 degree turn around, I know it is a journey but more power to you. The only thing I would say would be to stick on the new path.\n\nToday I received a silver award from Reddit to give and I have decided to give it to you. You inspired me with your post and the sincerity of your attempt to be better.\n\nSince you mentioned that you would like to start reading again. There are few books  I would recommend the Miracle Morning by Hal Erold, Alter Ego Effect by Todd Hermann, and The 5 Second Rule by Mel Robbins.\n\nMiracle Morning will help you to work on yourself and basically be the person who is capable of the success you desire. It will setup a daily cycle of  self-improvement.\n\nAlter  Ego would help you bring your Heroic Self, the best version of you when you need it.  As you mentioned that you are naturally feeling afraid in your new journey. This book will help you handle the fear & unknowns and discover your secret superpowers to excel when it matters.\n\nThe 5 Second Rule Book will teach you a simple but powerful cognitive tool to take action and stick to the journey you have begun. It also has tips on handling anxiety.\n\nBut the most important thing is that the books will do nothing till you apply what you read.\n\nOne App that can help in this is [ApplySelf](https://www.applyself.com). It converts the key ideas of a self-help book into actionable exercises.  It will help you apply what you read from the books. You can try one of the books and check whether it works for you.\n\nIn the end, I would leave you with one of Hal Erold's quote\n\n“You are always exactly where you are supposed to be, experiencing what you need to experience, to learn what you must learn, in order to become the person you need to be to create the life you truly want.  Always.”\n\nAll the best", "permalink": "/r/DecidingToBeBetter/comments/o4i2r2/i_know_i_can_be_the_best_version_of_myself_i_will/h2ipgrl/"}