{"id": "t5_2tand_t3_qc6sat_t1_hhgy0xx", "creation": 1634806930, "origin": "t5_2tand_t3_qc6sat", "height": 1, "replied_to": "t5_2tand_t3_qc6sat", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Abeyita", "text": "I quit weed 292 days ago. The r/leaves app has helped me tremendously. I had a though withdrawal and reading other people going through the same made me feel stronger to not start smoking again. Also simple things like not seeing myself as someone who's stopped smoking but as someone who doesn't smoke actually make quite a difference.\n\nFunny thing, I smoked for several reasons, one of them was to calm my anxiety. Turns out that after the first few months of not smoking weed my anxiety completely disappeared.\n\nI won't say it is easy to quit, I still don't think it is. 292 days sober and sometimes it is still a fight, also most people I know still smoke weed daily. The withdrawal was pretty rough and it almost made me smoke again because I couldn't sleep for almost 2 months, and if I did sleep I had terrible nightmares. It was hard because I had to keep on working and do all the normal stuff without sleep and without the comfort of weed. But things are so much better now. I'm much more productive. I'm getting to know sober me, the real me. I have smoked weed daily and all day for 18 years, since I was 15. The way you think is heavily influenced by the weed, but you just don't know better so you think it is all you. That fact blew my mind when I was about 4 months in. I'm living it right now. I never imagined I could get this far, but here I am. I don't smoke, and I hope  to never do it again. \n\nWhat also helps me is a counter on the home screen of my phone. Every time I see my phone I see how many days it has been. If I smoke it goes back to 0. It has been very motivating to see that number rise. And whenever I feel like 1 joint won't be that bad I look at the counter, what I would be throwing away. I read on r/leaves and feel strengthend to not do it. All I have to do is not smoke today. That is the challenge. No weed today.\n\nGood luck. You can do it. This isn't my first try either, just keep getting up when you fall.", "permalink": "/r/DecidingToBeBetter/comments/qc6sat/how_can_i_finally_put_an_end_to_smoking_weed/hhgy0xx/"}