{"id": "t5_2tand_t3_fuyn9z_t1_fmg0bbi", "creation": 1586038603, "origin": "t5_2tand_t3_fuyn9z", "height": 1, "replied_to": "t5_2tand_t3_fuyn9z", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "amenteco", "text": ">My goals, in generality, are: weight loss - fasting,  weight lifting, evening walks and runs.  \n>  \n>Productivity - to learn better English, because I'm awful, watch crash courses, watch Yale lectures, read books, learn russian on duolimgo.  \n>  \n>Social skills - work on social skills - watch all of charisma on command, read CBT, DBT, exposure therapy till it's ingrained.\n\nOK let me think through this:\n\nWeight loss  = Confidence, a shit to a socio-normative character, which my it's self has the appeal of romanticism, but, also makes you more likeable, genial, magnetic. Thus, I guess in turn, it's easier to attain friendships without the aspect of double consciousness i.e. that your lesser one in the relationship leading to insecurity. Attaining a sort of self-centric social circle would also reground lacking self confidence, lay the groundwork for assertiveness and allow directionnality and discretion in what happens.\n\nProductivity - Is a simple case of self advancement, both in terms of my education now and the future. This will undoubtedly be advantageous to building a good work ethic and exploring ventures and future opportunities carrier wise. As for languages and courses, it comes down to creating the image of the person I want to be.\n\nSocial skills - this society favours extroverts. The same way it favours men. Or that it's hetero normative. But extroversion is so pervasive. And, it is not simply a question of conformity, it is a question of happiness. For, social skills are simply necessary to attain friendships, at-least those which i desire. And the purpose of those friendships are either as 'means' to some end, or because they will make me happy and feel part of something and connected.\n\nI must unfortunately disappoint your exception for my reasoning in wanting to do Photoshop or write, for it is not profound, or significant. Simply, I have somewhat of a natural affinity for the two, at times they provide a welcome reprieve, sometimes I simply enjoy them.", "permalink": "/r/DecidingToBeBetter/comments/fuyn9z/soft_reboot/fmg0bbi/"}