{"id": "t5_2tand_t3_otzxdj_t1_h6z4b0e", "creation": 1627577417, "origin": "t5_2tand_t3_otzxdj", "height": 1, "replied_to": "t5_2tand_t3_otzxdj", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "cursedanne", "text": "I feel you!! If it’s a consistent problem finding motivation to work out in your home gym, and you are having the motivation to get other (more fun!) things done, then the issue may not be motivation. It might be that whatever gym set up you’ve given yourself isn’t a fun and rewarding type of workout for you, so it perpetually feels like a chore.\n\nFinding exercise that is fun and you *want* to do is key! For me, I just had to accept that I don’t like working out on machines, and I don’t like weightlifting. I can remind myself of the rewards all day long, but it still feels like a chore, so it’s never something I’d look forward to. I mean, who gets home from work pumped to do the dishes and take out the trash?\n\nI get my exercise by getting outdoors and hiking, stretching and yoga (sometimes following YT vids, sometimes I just make it up). And my favorite high-intensity is to put on funk/disco hits playlist and dance dance dance. Literally, I just dance like a kid, no shame!\n\nBut, there’s kickboxing, martial arts, HIIT, Crossfit, dance classes, body weight workouts, yoga, running, swimming, rollerblading, biking, and the list goes on! Did you play a sport you loved growing up? Join a rec league! \n\nThe starting point of exercise is merely finding ways to get your heart pumping that you have fun doing! You can add to it or make changes as time goes on.\n\nAs far as eating healthy goes, I wouldn’t focus on cutting out certain foods at first. Focus on adding in things you’re lacking! If you’re low on leafy greens, find ways of preparing them that taste good to you and eat them! Don’t worry about low fat, no fat, whatever. Just start by incorporating healthy foods into things you already like! Still want to have some popcorn after dinner? Go ahead. \n\nAs far as mental health/habits go, again just find things that are good for you that you can add. If sedentary TV watching is a concern of yours, try reading a book for a while before switching on the television. Journal, paint, draw, carve wood, learn something new, or try a guided meditation. Get out in nature, and it doesn’t have to be some big hiking trip. Literally just stop in a park and observe the sun dappling the tree’s leaves for a few moments. Watch a bee pollenating.\n\nRadical opinion…don’t worry about the scale or pant size. Like, at all. Have fun moving your body and eat more good stuff. It’s a slow process, but that’s how you make it permanent.\n\nFor reference, I was a ½ a pack a day smoker who was drinking alcoholically, not exercising at all, and eating 1-2 junk food meals a day. Not a raw vegetable in sight my friend.\n\nToday, I’m a non smoker, non drinker, healthy person. Took 3 years, but I lost 50 lbs and have kept it off for another 3 years. Best part? My exercise and diet today take no conscious effort on my part. There’s nothing I “have” to do…only things I want to do.", "permalink": "/r/DecidingToBeBetter/comments/otzxdj/at_a_turning_point_in_my_life/h6z4b0e/"}