{"id": "t5_2tand_t3_azd84u_t1_ej5314z", "creation": 1553282419, "origin": "t5_2tand_t3_azd84u", "height": 1, "replied_to": "t5_2tand_t3_azd84u", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "cactus__fruit", "text": "OP, I know I'm late to this post but it really resonated with me and I wanted to share how I coped through a similar period in my life.\n\n\\-I got roommates who were around my age and had similar interests--many of whom were single themselves. It made it easier to come home to friends rather than just myself. \n\n\\-I stayed very busy. I took classes at our community college just to get out of the house and be around people. I joined a gym a went to group classes. I found events going on in my city that I thought sounded cool and invited friends to come with me: museums, concerts, films, dance nights. I treated myself. I cooked myself amazing food. I created rituals and routines that kept me sane. I used a planner and to-do lists. I filled my life with things that I loved. I know this sounds weird, but it really helped me to talk to myself if I was alone in the car. It helped to process my feelings aloud without having to filter them for someone else. Particularly when I was getting over a past relationship. For some people journaling has the same release, but for me verbally working through feelings is more helpful.\n\n\\-I decided to pursue low-stakes dating. I got on all the dating apps and made low key plans (eg getting drinks/coffee) without a lot of investment. I went on a number of dates, most of which the chemistry was not there, but I met some nice, interesting people and it helped my confidence a lot to realize I was capable of carrying on a conversation with a stranger! I just want to say also, you don't need to be accomplished or have it all together to be loved. I felt like I didn't have a lot to show for my life or that my life was empty. But accomplishments, traveling, hobbies etc don't equal personality. It's far for interesting to engage with someone who is thoughtful, reflective, and owns the ways in which they are flawed imo. It sounds like you have goals and things you are working towards--that's perfect. You are a human being on a journey. No one is judging you as harshly as you are to yourself. You don't need to show up to a date with a resume. ", "permalink": "/r/DecidingToBeBetter/comments/azd84u/its_a_lonely_road/ej5314z/"}