{"id": "t5_2tand_t3_azd84u_t1_ei77o8s", "creation": 1552214687, "origin": "t5_2tand_t3_azd84u", "height": 1, "replied_to": "t5_2tand_t3_azd84u", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Axius", "text": "I'm probably in the same position, a lot more than I'd like to admit to be honest. I've asked a lot of different people for input and for answers over the years, largely because I felt that the reason I felt like I did was something I was not doing that others did. I'll throw a few ramblings together...\n\nThe first thing I learned is that everyone has their own journey. That includes yourself. The things about yourself and your experience that make you unhappy; you have things about yourself that you like and enjoy, and the people whose life you look at and wish you had their life; they may very well want the things you are already happy with. Comparative analysis between yourself and other people's situations has very little value as you're all looking for/heading for different things.\n\nThe second thing I learned; I made a mistake assuming that when I felt lonely, it was due to not having a relationship. It wasn't completely off the mark - the relationship I needed was, and is, meaningful friendships. I wanted someone I could sit and just talk to about anything, or someone to play games with, or someone for activities - ideally it would have been the same person/people. The journey to making meaningful friendships is definitely an easier road to traverse than the journey to some form of romantic relationship.\n\nThe third thing I learned is that, as my loneliness led me to be someone who enjoys their own time and space, I didn't understand or appreciate my own requirements and this clashed with how I felt. In the interests of my own personal happiness, rather than try give myself abuse for not being how I thought I was meant to be, I have spent time understanding myself and accepting my limitations and my strengths.\n\nWhen it comes to reinventing yourself, I'd say the above is important to remember. You cannot be perfect, nobody is perfect and nobody is everybody's friend. What you can be is the best version of yourself for yourself; and if that turns out to be incompatible with some people's journeys, that isn't your fault. It is perfectly okay to have certain needs, even if you think they're flaws.\n\nThere are a LOT of self help approaches that are all about 'not being yourself' that I've seen. When it comes to combating loneliness, and when it comes to meeting people who want to be around you, I would say being honest about who you are and what you want is best, because all the cards are on the table (and you aren't playing 4D chess with your own emotions or what someone else wants). Communication with yourself and being in tune with your own needs is important, and just as important as communication with someone else.\n\nI think, for example, that it's okay to 'want' or to 'need' physical company. It's also to okay to dislike that you want or need that. Acknowledging that you need it or want it, and understanding why you do is important to grow and develop as a person.\n\nJust remember that if things do feel unbearable and you feel it impacting your mental health, make sure that you do have people you can talk to about how you honestly feel. Don't feel ashamed for how you feel, emotions and feelings are part of who we are as humans and ignoring them is bad for you. The right person for you relationship-wise will accept everything about you, both your strengths and your weaknesses.  We all have them, and anyone who demands perfection is absolutely not worth it, and that includes the restrictions you put on yourself.\n\nTake the time to work out who you are, what you want and what you enjoy!\n\nI found travelling to see people and going to music gigs and eating new foods in new places all helped me work out some of who I am and deal with my loneliness.\n\nI hope everything works out for you!", "permalink": "/r/DecidingToBeBetter/comments/azd84u/its_a_lonely_road/ei77o8s/"}