{"id": "t5_2tand_t3_azd84u_t1_ei74ka1", "creation": 1552209080, "origin": "t5_2tand_t3_azd84u", "height": 1, "replied_to": "t5_2tand_t3_azd84u", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "EnkiiMuto", "text": "> Last year was spent working on my “insides.”\n\nThat must be gut-wrenching.\n\nSorry.\n\n> I learned how to love myself the way that I love other people\n\nThis is probably the biggest step you will ever take, not because there aren't big challenges along the way, but because it is a work in progress you always have to watch for. Congratulations on doing it, you'd be surprised how many people that seem on a better spot than you are aren't capable of it. This is already something to show for.\n\n>  I did finally leave the horrible job I’ve had for 5 years, though, and got a job at a busy bar/grill downtown, and so far I love it\n\nI'm proud of you. I remember how much my ex hated her job and how she wouldn't quit even though she could go for another one, it is something incredibly spiritually taxing, as you know. This isn't a step, it is a leap.\n\n> because I am very much one of those people who get satisfaction just from the recognition of what I “plan” to do) and have started just...doing. \n\nThis is something I'm dealing with myself. Any advice?\n\n> And it’s so. SO. lonely.\n\nI know how it is, fellow hermit.\n\nAs someone who lost twice the life partner in crime... I'd say it is a good thing that you're doing all this change in your life without one. Yes, it feels like crap, but you're still on a learning curve, you might be out of it next week, in five months or in two years... but the point is you're learning how to be yourself, and how to have this loads on both your feet, it is a step you took on your own, and there is great value in it. Often in this journey things can get quite co-dependent, and... well, learning how to function back with ghost limbs is not the best way when you're holding everything in your life by thin threads.\n\nI'm not telling you shouldn't miss it or look for it, I don't even think it is the kind of thing that appears when you're ready, an effort should be taken to find this someone. However don't bring this expectation to relationships, try see them more as a question, \"what I can be in this person's life?\" or \"What I can be in this relationship?\" the same way you take a role in non-romantic relationships. Go for experiences, not plans. Be the person who jokes when having a cute moment, be the person who would hug them when they thought nobody would.\n\nYou may not be ready for THE relationship, but you are ready for living, there is no need to postpone that, and there is less risk of it backfiring on you.\n\nIf you want to play video games, talk or vent, PM me. I truly wish you well. I'm on a similar journey and I've been there before.", "permalink": "/r/DecidingToBeBetter/comments/azd84u/its_a_lonely_road/ei74ka1/"}