{"id": "t5_2tand_t3_azd84u_t1_ei81q0f", "creation": 1552243683, "origin": "t5_2tand_t3_azd84u", "height": 1, "replied_to": "t5_2tand_t3_azd84u", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "GardenWalker", "text": "Old lady here who was where you are...30 years ago. Advice. Life can change very suddenly. In every way. Good, bad, happy and sad.  Develop resilience. You can completely change your life in a year or less! Be ready for it!\n\nI encourage you to spend as many of your moments pursuing what you what to experience in this life as possible. Get yourself in a good frame of mind. Travel, even just one tank trips or to another part of town. Be curious about other folks. You’d be surprised at what that positive energy returns to you in new connections and opportunities. \n\nTwenty-nine and thirty is still so young.  It may not feel like it when all your peers are coupled up and starting families, but trust and believe when you get to be 59, 29-30 seems like late adolescence. You have so much life ahead of you. \n\nOlder people like me love to help younger people. Seek out a mentor. \n\nIf you want your money situation to change, maybe a part-time job for a few months? And always take advantage of any 401K match at a job. Always, even if only for the minimum contribution. Always take free money. \n\nTo overcome loneliness, I volunteered at things I loved. A children’s hospital because I love kids. If that sounds like you, that could also be strategic for your career. \n\nWhen I was your age, I went to a lot of free lectures and programs at libraries and colleges and museums. I’m cheap and there were always interesting people there. \n\nI also used affirmations and visualizations to become more optimistic and visionary for my life. “Expect the best outcome possible!” And I started hanging around people who had accomplished the kind of things I wanted to. I needed to learn from them. \n\nThe one thing I didn’t do when I was that young was take really good care of my body by eating better, sleeping longer and working out regularly. It really helps reduce negative stress all through life. Treat your body like that miracle it is. \n\nHope everything works out and that you are very pleasantly surprised real soon. ", "permalink": "/r/DecidingToBeBetter/comments/azd84u/its_a_lonely_road/ei81q0f/"}