{"id": "t5_2tand_t3_azd84u_t1_ei7jt8s", "creation": 1552230125, "origin": "t5_2tand_t3_azd84u", "height": 1, "replied_to": "t5_2tand_t3_azd84u", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PM_ME_GOOD_VIBES_", "text": "First I just want to acknowledge you and the work you’ve put in. These are some huge changes, might seem like baby steps at the time but growth is exponential and you’re setting a great foundation for life. \n\nThe feeling of loneliness is profound, but I think you’re right to focus on yourself first. You attract what you put out in the world and a relationship will come when you’re ready for it. So my advice is centering less around how to fight specifically loneliness and more around how to increase positive mood in general. \n\nThere’s something to be said for keeping busy with productive or healthy activities that focus out, that take you out of your head. One thing I notice missing from this is physical fitness. What you do with your body has a large effect on your mind. You’re already moving around a lot because of your job which is great. The next step would be to add some moderate cardio. It doesn’t even have to be much, just 30 minutes a day or so. Some other commenters have suggested joining sports teams, which is also a great suggestion for the social aspect.\n\nWhich brings me to my next point: having an external commitment to follow through on. Being accountable is the opposite of lazy and irresponsible, and it’s best done by committing to something with witnesses. \n\nSome reading on the topic [here,](https://www.independent.co.uk/news/health/cardio-exercise-how-long-body-brain-benefits-fitness-health-gym-a7880886.html) [here,](https://www.apa.org/monitor/2011/12/exercise) and [here.](https://www.habitsforwellbeing.com/what-is-personal-accountability/) \n\nGood luck on your journey! In time you’ll look back and be amazed how far you’ve come. ", "permalink": "/r/DecidingToBeBetter/comments/azd84u/its_a_lonely_road/ei7jt8s/"}