{"id": "t5_2tand_t3_azd84u_t1_ei73xq6", "creation": 1552207989, "origin": "t5_2tand_t3_azd84u", "height": 1, "replied_to": "t5_2tand_t3_azd84u", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Emberwyn", "text": "I relate to this so much. I'm was and still am to some degree in the same situation. I'm 29 F, turning 30 in June.\n\nThe difference for me is that my transitional period related to my gender. Along, with making good progress with my career/stability with a lot of hard work and luck.\n\nHowever, during the point I was going through my transition and working on my career I was very lonely and couldn't understand why I hadn't found the right person like everyone else. I'm still single to this day in fact. I've done a lot of similar things as you. I worked on loving myself more like I love others, getting consistent sleep and keeping routines has been so incredibly rewarding. These last few things are things I've only just accomplished in the past 4 months to really start talking my depression and loneliness.\n\nI've worked a lot on my appearance and attractiveness as it was part of my transition. I get a lot of interest from others now but it seems hollow, when I try to move things forward with anyone it always falls flat. Something I've realized is that I shouldn't push for happiness by being with someone else. When I'm lonely I engage in hobbies and spend time with friends or work on progressing my goals. Just remember during your hard work that you should give yourself rewards, do the things you want to do. What would you do with someone if you were dating them? Go do that with yourself! Date yourself! It sounds silly but it has helped me.\n\nI know eventually I'll be at a point where I'm polished gem-ini (pun intended!) and when I find the right person it'll be incredibly easy because of how well I'm doing for myself. And I also know the right person will be doing the same for themselves, everything I'm doing and maybe more!\n\nDon't forget your mindset has a lot of power over your health and well-being. The best thing you can do is be positive and know when you need to uplift yourself. If you feel down, target the reasons. Eventually, you'll get better at uplifting yourself and moving forward. Bad days will affect you less, failed plans, no-shows and other disappointments won't be the end of your happiness. You'll always have a backup plan to uplift yourself. \n\nThe ironic part is the happier you are and more capable of uplifting yourself the easier it is to make friends and move things forward in your life. So always consider your well-being as the most important thing above everything and everyone else. It's okay to be selfish when it comes to your happiness. No one else is going to give you that love consistently, not even a significant other and expecting others to do so isn't practical. I hope things go well for you!", "permalink": "/r/DecidingToBeBetter/comments/azd84u/its_a_lonely_road/ei73xq6/"}