{"id": "t5_2tand_t3_q8l9ra_t1_hgsku5f", "creation": 1634336280, "origin": "t5_2tand_t3_q8l9ra", "height": 1, "replied_to": "t5_2tand_t3_q8l9ra", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Astrnougat", "text": "This. It sounds to me like this nanny treated this job exactly as it was: a job.  \n\nCan you imagine how difficult it is to not only live with your boss in your work environment, but then have the boss feel annoyed at you for taking your contracted PTO? It would be like if your boss passive aggressively called you every time you took a mental health day to complain about how hard work was without you that day.\n\nI doubt she was perfect - she rolled her eyes and showed annoyance at the mom - who was also her housemate. I think it’s completely normal to show annoyance at your housemates sometimes. \n\nI feel like your expectations were a little off OP - what was she supposed to do? Look happy and perfect at every moment? Being a nanny is insanely hard - because you are doing your best to care for someone else’s child - a job that you will never be able to do well enough in the mother’s eyes. And you expected her to be there for YOU, when really her job is to be there for your child.\n\nIt sounds to me like she did all the work that was contracted of her, she has strong personal boundaries about life and work, and she didn’t particularly get along with your family, but she did good work. When her contract was up, she made the smart to decision to leave a family she wasn’t getting along with. Replacing any employee is difficult for a company. That’s part of the deal that comes with being an employer.\n\nI’m sorry OP - your boundaries are all over the place. You had different expectations of the nanny than were in her job description, and you held it against her when she failed to meet your unrealistic expectations", "permalink": "/r/DecidingToBeBetter/comments/q8l9ra/regretting_not_standing_up_to_my_former_nanny/hgsku5f/"}