{"id": "t5_2tand_t3_q8l9ra_t1_hgqw4os", "creation": 1634310495, "origin": "t5_2tand_t3_q8l9ra", "height": 1, "replied_to": "t5_2tand_t3_q8l9ra", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "greebledhorse", "text": "This is clearly a complex situation, and you do not deserve for people to treat you poorly to your face or be rude to your kids. I really empathize with looking back over situations where you didn't set boundaries that you wanted to set, I've been there & it's awful. \n\nHowever, I just want to chime in to say that it's none of anyone's business what this woman did in her personal time. From what I read in your post, it seems to me that her contract gave her personal time & you then felt neglected when she took the personal time that you both agreed she would get. I really encourage you to see that \\*particular\\* slice of an upsetting experience as an example of healthy boundary setting (which doesn't mean that other stuff was okay). You've mentioned having difficulty standing up for yourself in the past. I can't help but wonder if you end up feeling sucked into other peoples' problems constantly, to the point you rarely have time for yourself but can't justify setting down 'responsibilities' because you're afraid of the consequences for people you're supporting. If that's how you've been operating, I can't help but wonder if seeing this nanny operate completely differently makes her look selfish and uncaring because you know from experience that your own pattern comes out of love. I really encourage you to value your own personal time more fiercely & to look for ways to set more boundaries, even if it feels selfish and callous at first. I know there's a lot of selflessness built into parenting, but wherever you can. Setting yourself on fire to keep other people warm isn't a way to honor both of your commitments, it only invites another person to be complicit in devaluing and hurting a valuable human being who deserves so much more (you!!).\n\nBest of luck, and I'm sorry to hear this experience left such a sour taste. I completely believe you that this nanny should have done better in many areas.", "permalink": "/r/DecidingToBeBetter/comments/q8l9ra/regretting_not_standing_up_to_my_former_nanny/hgqw4os/"}