{"id": "t5_2tand_t3_q8l9ra_t1_hgtlowx", "creation": 1634355779, "origin": "t5_2tand_t3_q8l9ra", "height": 1, "replied_to": "t5_2tand_t3_q8l9ra", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ill-Mathematician380", "text": "The 3 hours *minimum* (many times more) rest time were not in her contract. \n\n\n\"Live-in nannies usually work between 10 and 12 hours per day, five days a week. Most families will also expect two nights babysitting to be included in the salary. A live-in nanny may work a 24-hour shift or five-six day shifts for a higher salary.\"\n\n\nLet's just say her salary was high enough to cover the higher end of the job description.\nThis nanny barely ever worked 8 hours, which included the 5 hours at school having to only sit and watch my son from the back of the class and help if he needed the bathroom (which she did just fine), and 2 hours scattered of helping at home. She never took orders from me. She did only what she wanted to do. For example one day I would need her to babysit. But she wants to clean the bathroom. I would politely say I don't want the bathroom cleaned, I need her to babysit, she would start rolling her eyes and muttering things under her breath and insisting that this bathroom needs cleaning now. If she did reluctantly agree to the babysitting I would come home and find her having done a half-assed job i.e. just put my kids in front of the TV the entire time without interacting with them at all, while being completely immersed in her phone.\nI made a mistake in saying she did her work well, I meant only the cleaning part, not the child care part. She was obsessed with cleaning, but we were very clear when we hired her that the priority was child-care, especially my special needs son. She was all smiles and agreed. But I don't think she really understood or was even listening (she had just been fired and was desperate for a job).  I quickly learned that child care was not her thing. I kept her because I learned to adjust to having her job be mostly as a cleaner who attended school with my son. That would have been just fine but there was no need or reason for the constant attitude and  crabbiness. This wasn't occasional, it was all the time. \n\n\nShe never got along with my children because she was very child-like herself. She would even get into arguments with them as if she were their age. My children love to engage with their care-taker and ask questions and share stories. It broke my heart every time I would see her scoffing or shushing or snapping at them whenever they tried to connect with her about anything. She would tell them \"go away I'm busy\". Busy doing cleaning that she insisted on but I never asked her to do. She would clean things that were already clean! \n\nI was seeking a nanny who would help my son at school, and be of help around the house with occasional babysitting. This is the job description. (And with me it's never more than one task at a time. I never, ever asked her to juggle anything.) And someone who smiled from time to time. Who made my kids feel that the person who was caring for them actually cared about and valued them. How does that translate as expecting her to be there for ME and not my child?? I think it's unfair to say that these expectations are off or unrealistic and that my boundaries are all over the place.\n\n\n\nA nanny's job *is* a job. And that job includes to show care and respect and kindness towards the people you work for, as they show you. I never got that from her.", "permalink": "/r/DecidingToBeBetter/comments/q8l9ra/regretting_not_standing_up_to_my_former_nanny/hgtlowx/"}