{"id": "t5_2tand_t3_nze97x_t1_h1qb8iq", "creation": 1623678814, "origin": "t5_2tand_t3_nze97x", "height": 1, "replied_to": "t5_2tand_t3_nze97x", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MattTheMentor", "text": "Hey u/Previous_Werewolf_67 ! Honestly it sounds like you are working incredibly hard and getting really good results, I want to pat you on the back for that. I've also struggled with feeling disconnected/body dysmorphia/struggling with stress. Here's a few tips\n\n&#x200B;\n\n**Make a \"emotional troubleshooting list\" and return to it when you feel bad**\n\nI would imagine there's certain activities that can make you feel better when you're in a bad place emotionally. Maybe it's journaling, going for walks, calling a friend, listening to an audiobook, cleaning your apartment, who knows. All of those things are helpful for me.  The problem is we can often get stuck in emotional mud for a few hours or days before we remember to do the things that make us feel better. By putting them all in one list it can help you pull yourself to a good place mentally when life throws a few curveballs and we start feeling negative/dark. Then you have a list of proven things which could improve your mood.\n\n**Check out the 5 Minute Self Compassion Break by Kristin Neff, PhD**\n\nIf you google \"5 minute self compassion break krisin neff\" you'll find free resources that can really help with those moments when we're being hard on ourself. Dr. Neff is an amazing researcher who has done great work in this area (and her books are great too if you want to dig further). For people like us who work ourselves too hard, the answer usually isn't \"find a way to work harder\" as much as \"find a way to accept and embrace where we are.\" Framing more than fixing, you could say. Tara Brach has great work in this area as well.\n\n**Routines systematize progress**\n\nWhatever activites make you feel your best, do whatever you can to make them happen often. For my part I listen to positive podcasts every morning while I take a walk, do a short work out, meditate, and take 10 minutes just to stare out the window at trees while I drink my coffee. These are all things that make me happy. If you can pick a few things that put pennies in your \"happiness piggy bank\" and pick a time that you could do those every single day, I think you'll see amazing results. It's okay to give yourself a gift like this every day. I find that it makes my \"baseline happiness\" much much higher because even if I wake up feeling negative these activities can reset my mood before I let the negativity compound. Start small so you can be consistent (I know you're very busy!), but this kind of self care will also help your relationships with others and performance in other areas. If you recharge your own batteries you'll go farther in many areas.\n\nHope that helped - wishing you all the best!", "permalink": "/r/DecidingToBeBetter/comments/nze97x/general_advice_for_20_yr_old/h1qb8iq/"}