{"id": "t5_2tand_t3_c7q0gj_t1_esi5ikx", "creation": 1562007190, "origin": "t5_2tand_t3_c7q0gj", "height": 1, "replied_to": "t5_2tand_t3_c7q0gj", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Marcus_Forealius1234", "text": "This is an excellent step you're making. I commend you for your honesty with yourself and your drive to find a better way of life. \n\nI'm 330 days sober today. I first went to AA eight months before I actually gave it a legit try. I stayed for a few weeks, then thought \"this shit is for the weak and dumb\" and I left, thinking I was in no way out of control like these folks. Little did I know, I'd wake up hungover as hell eight months later after an uncontrollable spree saying, \"I'm an alcoholic, I'm can't go on like this.\" And today I can say I'm a recovered/recovering alcoholic and am quite happy I went back.\n\nMy advice to you is that you look for the similarities between yourself and others in the room who have a problem with alcohol. Our stories differ vastly, but we have some common elements that bind us together in the rooms of AA. There is no picture perfect notion of what an alcoholic looks like, although there are common traits, nor is there a picture perfect progression in sobriety. We are simply bound by a common problem of alcoholism and a common solution to that problem of alcoholism. For me, as well as for the alcoholic in general, that problem doesn't depend on any negative external circumstances. For instance, I was paying my bills (somewhat), holding down a job, was going to the gym frequently, never had a DUI and never been arrested, but several in the rooms were on their third or fourth DUI or homeless and pissing themselves whilst drunk on the side of the road. The real issue behind my alcoholism and the alcoholic in general was my romanticizing a relationship that I could one day both control and enjoy it. Once I realized my issue was that could never be the case, then I needed a solution to enjoy life again without it. AA provides this solution through the steps and the fellowship. \n\nSorry for the lengthy response, I do hope that you find your way and I hope this helped.\n\nOh and if you want to talk, just be honest with your story. I've experienced some of the most judgmental free space in those rooms. Also, if you don't wanna talk and just wanna listen, then that's fine.", "permalink": "/r/DecidingToBeBetter/comments/c7q0gj/im_going_to_my_first_aa_meeting_tomorrow/esi5ikx/"}