{"id": "t5_2tand_t3_c7q0gj_t1_eshkim6", "creation": 1561995121, "origin": "t5_2tand_t3_c7q0gj", "height": 1, "replied_to": "t5_2tand_t3_c7q0gj", "down_vote": 0, "up_vote": 12, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "naptownhayday", "text": "I was 3 years clean in may. I've been to a lot of AA meetings so heres some advice I have for maximising the experience. \n\n1. You won't like every AA meeting. AA meetings vary a lot based on who's running them and who's attending them. You might find that you dont like a meeting for one reason or another but that doesnt mean you dislike AA as a whole, you're just not a fan of that singular meeting. I'm also young like you so I really enjoyed going to a meeting that was designed for young people. I felt like the people there understood my situation more and made me a lot happier.\n\n2. You will get out of AA what you put in. I'm not saying you should start running meetings and going to 12 a day tomorrow but theres a saying in AA that you'll here a lot: \"It works if you work it\". Namely that if you give the effort, follow the suggestions given to you, and really try to make changes in your life, you will see results and it will help you.\n\n3. Dont be afraid to speak up at meetings. Generally AA meetings are structured like this: you will spend some of your time reading from the AA book (also commonly referred to as \"The Big Book\") and then you'll open it up for questions or comments about the passage. Then if you have time after that, you might pick a topic to talk about. If you ever feel like you have something youd like to say, feel free to speak up. Talking at meetings will help you work through a lot of your own feelings and experiences and it will help other people overcome the struggles you have.  (Side note: AA actually has some unwritten etiquette and this will help you avoid getting some weird looks. Dont interrupt someone. Ever. Let other people speak even if you have something you want to say. Once they are done, you are welcome and encouraged to chime in but wait until they are done. Also dont speak directly to someone else. Some places wont make a big deal about it but you're not supposed to speak directly to any one person while you talk. The idea is that the meeting is for everyone so when you talk, you should speak to everyone, not just a single individual.)\n\nI think I've written enough out for your first time but if you ever have any more questions, my inbox is always open and I'd be happy to hell you through anything you need. I wish you good luck on your journey into sobriety.", "permalink": "/r/DecidingToBeBetter/comments/c7q0gj/im_going_to_my_first_aa_meeting_tomorrow/eshkim6/"}