{"id": "t5_2tand_t3_c7q0gj_t1_esigvf5", "creation": 1562013481, "origin": "t5_2tand_t3_c7q0gj", "height": 1, "replied_to": "t5_2tand_t3_c7q0gj", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "forgive_everything_", "text": "I’m 8 years sober (also got sober when I was 24!) and there’s been a lot of wise words on here that I would only be repeating, but I would like to repeat other people’s recommendations for detox- you may be okay at the level you were drinking, but I went to detox when I was only (lol “only”) drinking 8 or so drinks a day. If you get the shakes, please please go to detox! It’ll only take 3-4 days-ish, but alcohol is one of the few drugs from which withdrawal can kill you. You can go to your nearest ER, and they’ll be able to start the detox process (most likely give you your first dose or two of Librium) and then find a detox for you stay at.\n\nThe only thing I’d add that maybe wasn’t said exactly is to take what you want and leave the rest (yep that’s a slogan lol), but my interpretation of that is that the program is different for everyone- some people are very dogmatic, others have stayed sober and lived happy lives for years/decades without doing the steps (heresy!), some people like doing Step work really slowly and cohesively and doing it over and over in their recovery, some people (like my sponsor and I) feel like you should basically just get it done thoroughly ASAP and you’re good to go with just spot-checking here and there.  Some people will actually mention Jesus (or so I’ve heard, my area wouldn’t really be cool with that) and there are meetings specifically for atheists.\n\nANYWAYS, my biggest advice is just keep showing up and if someone says something stupid, ignore them, you’ll be able to find your niche even if it’s not like your long-lost brethren; I basically only talk to my sponsor outside meetings and he’s pretty much the same. People know our face at our home groups and we know theirs, and they’ll be there if we’re in trouble and we’ll be there for them. I also got sober in a group basically exclusively made up of 65+ y.o. men with decades of sobriety and felt out-of-place in the gay and young people’s meetings where I theoretically should’ve fit in better.\n\nBut yeah, it’s a good place to be. Trust what feels right and healthy to you. And congrats on stopping drinking!! You got this!!", "permalink": "/r/DecidingToBeBetter/comments/c7q0gj/im_going_to_my_first_aa_meeting_tomorrow/esigvf5/"}