{"id": "t5_2tand_t3_omn39n_t1_h5o7tdf", "creation": 1626640076, "origin": "t5_2tand_t3_omn39n", "height": 1, "replied_to": "t5_2tand_t3_omn39n", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "writingwithmovement", "text": "I think I am in a similar place to you right now. I have (creative) work to get done, but I experience quite a bit of paralysis when it comes to actually getting things done. For context, I’m a student and freelance motion picture colorist - my schoolwork is writing and my paid work is editing in my lab (that is, my computer).\n\nI have been having trouble writing however - it’s my thesis film and I get anxious / nervous about the quality before even actually making anything, so I put it off. Then the fact that time exists and I haven’t made anything yet stresses me out quite a bit, which locks up a whole boatload of my creative energies.\n\nI haven’t really “solved” this right now, but I’ve been working on it and have seen some improvement. What has helped me relax and focus is telling myself that *it’s alright* to not be doing good right now. There are a lot of shit circumstances in the world that aren’t *my* fault, and it’s rude to myself to lament my not overcoming such obstacles with ease. Doing so sent me down a spiral of inaction this spring which led to me failing all of my courses and being forced into a medical leave of absence. \n\nSo *its alright*.\n\nI haven’t done it yet! *No, that’s alright*. There may be consequences for my present inaction! *Yes, and that’s alright.* I can deal with them when they come to me. But now I am focused on being present, and I have seen my mind open up and relief flow in much to my satisfaction.\n\nI may have not *written* my thesis yet - but I now find myself thinking about it much more casually and more often, which has given me the Avenue to address some issues it’s had in my mind. It may not be written yet - but I’m working on it both within and alongside my mind.\n\nWith “it’s alright,” I have found that I have more energy to work casually after I do the things I must to eat and pay rent. I think we often do not realize how much worrying saps us of our energy. But worry does and accomplishes nothing but to make us suffer twice - once when we worry, and once again when what we are worrying about comes to pass.\n\nSo my thesis might not be great. It might not be quite on schedule. But *thats alright*, because I am a human with a mind and I am capable of addressing problems that face me.\n\nI’m not quite out of the woods yet, but that’s alright. I’ll be out soon enough and when I am, I will be prepared - because I am not spending my time in this dark forest worrying about the trees which shall come to pass. I know now that, in my head at least, my thesis is better because of the casual worry-free thought I have put into it than if I had forced myself to type. \n\nSo even if you fail to follow whatever steps or guide you have planned for yourself, *its alright*. We are dynamic and will grow for the better because of it.", "permalink": "/r/DecidingToBeBetter/comments/omn39n/people_with_anxietydepression_what_technique/h5o7tdf/"}