{"id": "t5_2tand_t3_pno9qm_t1_hcrqs62", "creation": 1631585548, "origin": "t5_2tand_t3_pno9qm", "height": 1, "replied_to": "t5_2tand_t3_pno9qm", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "capecodkwassakwassa1", "text": "Consider this perspective: I graduated from a top public university and then enrolled at my local CC to complete some science prerequisites for graduate school (my grades in college were shit, so CC was a cheaper route to \"do them over\", and it worked out). The courses that I took at CC were by far some of my most memorable classes than at my alma mater where it was the norm for the class size to be roughly 300-400 students to 1 professor. I mean can you imagine how horrific that is for a student genuinely trying to learn? It's easy to get lost in the crowd, it's more difficult to develop rapport with the professor, and lots of times those university professors are crap at teaching. The only reason some of them have their teaching position is so that they can do research on the side. My CC professors, whom many were actually state university professors, taught waaaay better than them, if you can imagine that. Also, I made closer friends at CC than at my college because of the much smaller class size. Just like you, I bought the stigma that CC was for people who weren't able to \"make it\" to a 4-year, but that was far from the case. You meet people from all walks of life at CC - yes, people straight out of high school, but also people who are career changers and/or who have lived their lives before continuing education. Plus, just because you didn't do well in high school doesn't mean you'll be a horrible student for the rest of your life. For one, there's lots of extenuating factors as to why some people don't do well in high school; even if your head just wasn't in the game, that's ok. For another, grades certainly don't define your intelligence. I've met really smart people at CC who went onto nursing, pharmacy, and medical school, and even smarter people who took the 2-year-at-CC-then-transferred-to-a-4-year-to-save-money route. If university is ultimately your goal to obtain your bachelor's, then you're still in the running and it doesn't matter what your journey looks like to get there, as long as you get there in the end. In fact, if I had to go back, I would have gone straight to CC after high school and then transfer to save money. Future you will thank you for that, trust me. \n\nYeah, it doesn't feel too good if you frame it in your mind that you're going to community college across the street from your local Red Robin's. But if you think like that, then you're dumbing down your experience and everything else will be seemingly miserable. Consider it a temporary state. You're not there forever - you're there for a purpose. You fill that purpose and you move on. Work hard, enjoy the journey, and you will get to where you want to be. You will look back later in life and be thankful of this experience!", "permalink": "/r/DecidingToBeBetter/comments/pno9qm/i_think_i_actually_like_community_college/hcrqs62/"}