{"id": "t5_2tand_t3_ojm1vd_t1_h52rbq5", "creation": 1626207421, "origin": "t5_2tand_t3_ojm1vd", "height": 1, "replied_to": "t5_2tand_t3_ojm1vd", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bunnylovey", "text": "To me, it sounds like the biggest problem is a severely negative self monologue. Bullying ourselves constantly in our minds does not help us achieve anything especially not peace with our own lives.\n\nAddressing a few things here:\n\n>I'm from a 3rd world country and there are generally no people like me or my friends I'm talking about.\n\nI think a lot of people, regardless of the circumstnace feel this way. \"I go to a school where there's no one like me.\" \"I live in a city where I'm the only one who is <insert descriptor>.\" These are very commonly stated things about anything from liking video games, being gay, liking a specific music genre, etc. I'm not sure where you are from, of course, but I'd invite you to give people a chance more. When we're young, people are very divided over their interests and hobbies. When we get older more people are comfortable saying, \"Hey, I love football, but I also love watching Animated Disney Movies.\" \n\nI am positive no matter how small of a country you are from, there are people like you who like the things that you like. Staying online all day really makes us believe that no one understands us, but I bet there's other people staying online all day in their homes thinking what you think, too.\n\n>They've had all the experiences I want, but can't get.\n\nYou sound young to me, is there something stopping you from moving to a country where you feel like there will be more people like you? I am not trying to say it will be easy, but certainly it can be done and I'm sure it has been done in whatever country you are from.\n\n>I'm pretty much a good for nothing. Ofcourse it's not as bad as I make it sound, I'm pretty happy and all. It's the jealousy taking over me. \\[...\\] I know, my life isn't bad. I'm privileged compared to others, feels meaningless, my friends might become something but it feels like I can't. I know I can, I'm just fucking lost at this point. \n\nFirst off, you're allowed to feel whatever it is that you feel regardless of the fact that someone has it worse. It is ok to wish your circumstances were different.\n\nSecondly, as you mention here, most of what you think makes your friends so much better than you is... where they were born! It's not necessarily that they are much harder working or smarter or better, according to you it is a circumstance of where they were born.\n\nIf I was in your situation, I'd start trying to look into the stories of people from my country who have successfully moved away. How did they do it? Are there any youth centers, organizations, or groups dedicated to making a better life for yourself? Good luck.", "permalink": "/r/DecidingToBeBetter/comments/ojm1vd/jealous_of_my_friends/h52rbq5/"}