{"id": "t5_2tand_t3_lfd6fe_t1_gmmty8g", "creation": 1612824369, "origin": "t5_2tand_t3_lfd6fe", "height": 1, "replied_to": "t5_2tand_t3_lfd6fe", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "reddit3k", "text": "I only have encountered depression occasionally, but anxiety and full blown panic attacks for years and by the hundreds, if not thousands.\n  \nThis changed for me when I stumbled upon the Buteyko method and noticed that my breathing patterns/habits were essentially configured to be overbreathing/hyperventilate chronically. (Note: this is not necessarily visible as in the mental image of someone breathing in a paper bag).\n  \nI learned this when I stumbled upon the Buyteko method. I retrained my breathing habits and it improved my life sooo much. My panic attacks started to fade away and my anxiety did as well. Of course I still experience it enough (certains exams, deadlines at work, and those kind of things).. but even then knowing that my breathing is my \"always with me safety net\" is very valuable thing.\n  \nI basically can only recommend the entire website that I'm about to mention, but especially the following pages are containing some information that I'd like to pass along to you for your consideration.\n  \nhttps://www.normalbreathing.com/co2-stabilizer/\n \nhttps://www.normalbreathing.com/how-to-calm-nerves/\n\nhttps://www.normalbreathing.com/depression-natural-treat/\n\nhttps://www.normalbreathing.com/diseases-anxiety-disorders/\n\nhttps://www.normalbreathing.com/measure-cp/\n\nhttps://www.normalbreathing.com/hyperventilation-symptoms/\n\nIf this sounds like symptoms and experience that you recognize, I'd always recommend contacting a Buteyko specialist for guidance. In it's foundation, the material and skills are not difficult to learn. But every body reacts differently and especially in the beginning you might feel worse. It's simple but also powerful. Especially if you have heart/lung issues, do not start to experiment by yourself. Nowadays there are specialists all over the world. Many can also work remotely using e.g. video conferencing tools.\n\nEdit: and let me not forget to mention that 3 weeks of being sober is really an awesome job!", "permalink": "/r/DecidingToBeBetter/comments/lfd6fe/it_time_to_change/gmmty8g/"}