{"id": "t5_2tand_t3_n3dyq6_t1_gwqij33", "creation": 1620007602, "origin": "t5_2tand_t3_n3dyq6", "height": 1, "replied_to": "t5_2tand_t3_n3dyq6", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PRAYFORMYGAINS1999", "text": "For me, I've always gotten my drive to pursue the things I consider important in life (for me it's religion, education, and fitness in that order) through logical conclusions.\n\nYou will *always* make time for things if you regard them as important. Many people think they view things as important, but they don't. Or they think they want something, but they only like the idea of it. They don't actually want it.\n\nA good way to illustrate this is through pain or hunger. When you are in pain or hungry, you really feel that it's important to do something to fix that. It becomes a priority in life. To get the drive to do something, it needs to be similar in my experience.\n\nThere is a popular quote: \"He who has a why can bear almost any how,\" essentially meaning that after you have a *why*, it's relatively easy to accomplish the goal.\n\nDeciding why you want to pursue fitness is hard. If your reason isn't good, you'll fail. No one ever pursues fitness longterm because they just want to impress a girl or something like that. It's not uncommon for that to be a starting point, in fact it was for me, but that motivation will crumble under the pressure that is required to make you fit. The real reason I developed that has managed to keep me into fitness is something like: \"I care about my health, and fitness is a great way to promote health. It is better to be strong than weak. Fitness builds great amounts of physical and mental fortitude. If I cared about someone, I would want them to be fit. I should be fit.\" Etc.\n\nI've personally found that if you can't justify something to yourself you will never do it if it's difficult. Some things are self-encouraging such as the pursuit of dopamine or the curbing of hunger or pain. The valuable things in life are almost never like this, so you must mimic those feelings at a logical level.\n\nIt's not obvious that you should want to *not* coast or that you should want to run a marathon. You need a reason. A good reason.", "permalink": "/r/DecidingToBeBetter/comments/n3dyq6/how_do_you_get_that_drive/gwqij33/"}