{"id": "t5_2tand_t3_qerd43_t1_hhxu49x", "creation": 1635128640, "origin": "t5_2tand_t3_qerd43", "height": 1, "replied_to": "t5_2tand_t3_qerd43", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Nira_Re", "text": "I didn't dance.  But when my friend wanted to try out for a dance team and didn't want to go by herself, she invited me.  I said yes.  I ended up on a dance team.  (She then moved to an entirely different state two weeks later... and I stayed on the team, haha.)\n\nI learned a dance called \"zouk\", a type of Brazilian social dance, in which my instructor taught me salsa, bachata and belly dance to help me improve.  It was really hard, not having known how to dance and now dancing with complete strangers who most definitely were watching me.\n\nI think the best peice of advice given to me is to just get comfortable with yourself.  I have no issues nowadays watching myself in the mirror attempting to body roll and belly dance, or touching my hair and shoulders (if that's the style you're into, of course.  Bachata clubs in LA can get risqué lol, and I learned a style called bachata sensual.)  I truly believe being comfortable with yourself is key for any dance, regardless of the style you wanna dance in.\n\nIf you're awkward and nervous, it shows.  It's similar to trying anything for the first time- driving a car with tightly gripped fists and white knuckles to one hand open palm steering like you own the place, figuring out how to fire a gun and flinching every time it fires and now you're running around like you're in the matrix hitting within the target every time, and so forth.\n\nI'm now somehow halfway through a dance teacher certificate, in which I've learned to enjoy watching my body move fluidly, quickly or on pointe (jazz, ballet, modern, social, so forth...).  Too bad I probably won't finish it.  I unfortunately moved due to careers which did not involve dance lol.\n\nWish you the best of luck!  :)", "permalink": "/r/DecidingToBeBetter/comments/qerd43/how_do_you_learn_to_dance_without_feeling_like_an/hhxu49x/"}