{"id": "t5_2tand_t3_1tkeub_t1_ce8uxtz", "creation": 1387845168, "origin": "t5_2tand_t3_1tkeub", "height": 1, "replied_to": "t5_2tand_t3_1tkeub", "down_vote": 0, "up_vote": 27, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Lilwheezy", "text": "Honestly, I think one of the things holding me back is how comfortable my comfort zone is. Don't get me wrong, I also have worries and experience fear and self-doubt, but they call it a comfort zone for a reason.\n\n\nBut here's what I often think to be the problem: I don't believe stepping outside my comfort zone will be \"worth it\". Obviously that is a broad standard; it's comparing fear of failure, actual failure, or general discomfort, all sensations that we(people/humans) know well, with an unknown, potential reward. To someone who doesn't often take those steps \"outside\" and experience the rewards, the incentives just aren't there.\n\nThat's why I am a proponent of little steps. I've always found it great for me. They don't even always have to be \"in the right direction\". What I mean by that is, every step outside of you comfort zone doesn't need to have a larger purpose or goal you have (ex: Texting/Calling that person you think is cute and want to go on a date with). In that example, the result has a much greater weight because it's attached to a larger purpose than just, getting comfortable stepping outside your comfort zone.\n\nI'll share a nice experience I had earlier tonight to explain my point and then I'll end this comment: While decorating my house for Christmas, I was wearing a goofy santa hat (one of the springy-looking ones) and then realized I needed to go out to buy something. I hopped in my car, drove to the store, parked, and as I was getting out, realized I still had my hat on. Immediately, I thought I should take it off because I look silly and that would be embarrassing and EVERYONE would think I was weird and what if I ran into someone I knew and even worse what if they were cute!?\n\nThen I took a step back, thought about the situation, remembered that I am attempting to condition/retrain my brain, and realized that succumbing to fear over something as silly/insignificant as wearing a santa hat to the store 2 days before christmas is steps in the wrong direction.\n\nI walked into that store (Costco, mind you. Lots of people) and got what I had to get. I was uncomfortable for the moments I was thinking about the fact I was wearing my hat, but then the only other times I thought about it was when people would smile at me or say some nice comment about my hat. And I could tell I had made their day even just a little better by wearing a silly hat and not caring. It was awesome. It made me want to do other things that would brighten peoples' day. I had found the reward more than made up for the risk/discomfort.\n\nWoah, this comment really got away from me.", "permalink": "/r/DecidingToBeBetter/comments/1tkeub/what_is_holding_you_back/ce8uxtz/"}