{"id": "t5_2tand_t3_oygalt_t1_h7ux3fi", "creation": 1628198838, "origin": "t5_2tand_t3_oygalt", "height": 1, "replied_to": "t5_2tand_t3_oygalt", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Herazim", "text": "You first need to understand why you are going to therapy in the first place.\n\nFor yourself, the professional you will stand in front of is trained to help you.\n\nThe only way they can help you is if you are completely honest. To them and yourself.\n\nYou are going through though times but try and be honest with yourself enough at least to understand that if you want to get past whatever troubles you, you have to be open about it in order to receive the proper help / guidance.\n\nIt's ok to be embarrassed, you are talking to a stranger about something that's not only affecting you but it's also personal. But you will also realize the role a therapist has and that you can be open towards them.\n\nI will also stress that therapy is not like having a physical problem, you see the doctor, they fix you and boom done.\n\nIt may be that you don't find the therapist is a good match for you, or they aren't the best at their job. It's completely fine to look for other therapists until you find the right one for you.\n\nIf this is what's affecting you you should definitely tell the therapist everything. They will know what questions to ask you, what tests to give you and how to find the right way to help you but again, they can do that only if you are open about what happened, how it made or keeps making you feel and potentially what other issues came out of it.\n\nI get where you are right now, this is new and hard to open up to a stranger, you have no idea what to say or what they will say or if they will judge you. I've been there when I was 19 but just like everything in life, once you go through it you will realize that it's fine (the experience with the therapist and being open) and that you are doing it to help yourself.\n\nYou can even tell them that you feel embarrassed by what you want to say, this will also help them have an appropriate response that will make you feel more comfortable. In therapy there are no bad feelings, these people are trained to know how to deal with peoples emotions and how to create a safe space for you to not feel bad about it or judged.\n\nMy main advice besides being honest is just treat the whole thing as if you are writing \n\nI hope it all goes well and that it will be the building block for a better future for yourself !\n\n-Edit- I looked over your responses so far, if you are dealing with a therapist that judges you or denies your emotions, telling you that you have no reason to suffer or playing the victim, find another one immediately. It's not for them to decide what happened or that how you feel was over exaggerated, their job is to give an objective scientific approach in helping you deal with what you are going through. Not offer opinions about how you should feel. They should only offer guidance and the tools that can help you figure things out and heal yourself.", "permalink": "/r/DecidingToBeBetter/comments/oygalt/going_to_therapy_should_i_tell_her_about_my_csa/h7ux3fi/"}