{"id": "t5_2tand_t3_8u3y4x_t1_e1cl2ry", "creation": 1530055688, "origin": "t5_2tand_t3_8u3y4x", "height": 1, "replied_to": "t5_2tand_t3_8u3y4x", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Siryummy", "text": "Okay I'll give you some advice because I'm in the same boat as you and have been working really hard to get better about these exact issues. \n\n1. You need to accept that mistakes and failure happens. Not one fucking person in this world is perfect and chasing perfection is a fools errand. If you ever catch yourself feeling down because you weren't perfect you have to look yourself in the mirror and say it's okay and really internalize that. \n\n2. Another thing is to stop comparing yourself to others. I don't know about you but for me I kept comparing my pace of improvement to other people and sometimes others were improving faster than me. This made me feel like shit and led to me giving up on whatever it is that I was trying to accomplish. SO ONLY COMPARE YOURSELF TO THE PERSON YOU WERE YESTERDAY. \n\n3. Compliment yourself. Seriously do it. I've noticed that a lot of people who quit on things do it because of low self esteem and they constantly beat themselves up for failures and mistakes. If you can't think of anything to say just say good job on getting through another day.\n\n4. Don't let one trip up or failure stop you. If you miss waking up at 7 for one day tell your self it's okay and try again tomorrow. If you miss a day of working out tell yourself it's okay and try again tomorrow. If you miss a week of working out just pick back up when you can. IT'S OKAY TO FAIL AND MISS SOME TIME. IT'S NOT OKAY TO USE THAT FAILURE OR MISSED TIME AS AN EXCUSE TO DROP THE ACTIVITY.\n\n5. Stop regretting decisions as well. It's okay to feel bad about a bad choice but you have to accept and forgive yourself. If you don't soon you'll grow to hate yourself all the time and that's just a shitty place to be. \n\nI wish this box was a little bigger so I could proof read better but hopefully this helps. \n", "permalink": "/r/DecidingToBeBetter/comments/8u3y4x/struggling_to_understand_myself/e1cl2ry/"}