{"id": "t5_2tand_t3_q1b5ek_t1_hfh4zb1", "creation": 1633439937, "origin": "t5_2tand_t3_q1b5ek", "height": 1, "replied_to": "t5_2tand_t3_q1b5ek", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Able_Succotash_8914", "text": "I didn’t fully read the comments so this may have been said, but I try and use my good days/weeks to set myself up best as I can for the bad days/weeks that will inevitably come again. I Keep a clean space, clean clothes, stay on top of schoolwork and work, gym, etc. This way I feel much better about allowing myself to despair a bit on my sad days and not do anything at all for a day or two. I agree w everyone about therapy as well; I think everyone could benefit from a bit of therapy but as we all know mental health services are not always accessible for everyone. If you are able to see a professional, I 10000% recommend keeping some kind of journal/notes etc of days when you feel/experience something important so that when you do meet weekly or biweekly or monthly w a professional, you have a better sense of your day to day experiences. I had the same issue where I felt I always had stuff throughout the week I wanted to talk about with a therapist….until I was sitting in their office with my mind completely blank of anything to share because that particular day hadn’t actually been that bad haha. If you have an iPhone you can create notes in the note app where you can type out whatever is on your mind at that given moment, and then you can reference it later. You can also “lock” these notes with a password for extra protection. Hope this wasn’t too much rambling. Hang in there!\nEdit: On your bad days, ask yourself if you would shame your best friend/partner/child for having depression and showing symptoms. Understand that you would likely not do this to someone you love, and that you would care for them instead. Apply this concept to yourself. \n(If you’re familiar with the concept of the “inner child”, think of yourself in this way. If you were looking at the child version of yourself, hurt and upset, how would you comfort him/her/them?)\nAlso wanted to add that medication for my depression has also played a major role in helping me manage it. If you don’t have health insurance or access to healthcare there are actually pretty cheap telehealth options to get you connected with a professional. Best of luck!", "permalink": "/r/DecidingToBeBetter/comments/q1b5ek/i_want_to_stop_falling_into_depressive_slumps_and/hfh4zb1/"}