{"id": "t5_2tand_t3_q1b5ek_t1_hfffr55", "creation": 1633397568, "origin": "t5_2tand_t3_q1b5ek", "height": 1, "replied_to": "t5_2tand_t3_q1b5ek", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "elerwick", "text": "Depression and anxiety sufferer. I’m a bit older and there will be similarities and differences between people but here’s what I think. It’s amazing that you are self aware and it’s even better that you want to take action! I’m proud of you!!\n\nThere are different types of depression. Definitely go talk to a doctor and/ or a therapist. See if it’s situational, seasonal, environmental, standard depression that stays no matter what, or maybe something bigger. \n\nThere are ways to make yourself feel better if its a mild/ temporary case that doesn’t include medication. The vitamins, exercise, self care is a good place to start. \n\nMy depression is caused by a chemical imbalance. I’m not in control of chemicals and can’t will them to do my bidding and feel ok. So I take medicine to help the chemicals stay balanced. Nothing to be ashamed of. \n\nBecause I LOVE action. The act of taking as much action as possible gives me an instantaneous jolt of energy and momentum. I will take some d vitamins, my medication, self care, talk to my therapist, take a walk… all the things! Why? Because fuck you chemicals! You don’t control me!\n\nThe days you feel paralyzed and stuck in the bed because you are overwhelmed, I’ve got a trick for that too! You are only required to do 2 things. Doesn’t matter what they are as long as one of them is for you. Think brush your teeth, drink a cup of coffee out of your favorite cup, take a shower. The simpler the better on your rough days. The other task needs to be something responsible. Think go check your mailbox, clean off your night stand, take the trash out. Again something simple. The only caveat is do both of the things as soon as you wake up. Do not wait to do them at all. \n\nWhen you do your two tasks, guess what?!? Fuck you chemicals you did SOMETHING today. It wasn’t a complete waste! Ha! Jokes on you depression!\n\nI hope that life gets better and you find your groove. Don’t ever be embarrassed about something that isn’t in your control. Be proud of yourself for wanting more. Be proud of yourself for taking action, no matter how small they might be that day! You are worth it. You are strong. I believe in you! Now go kick some ass!!!", "permalink": "/r/DecidingToBeBetter/comments/q1b5ek/i_want_to_stop_falling_into_depressive_slumps_and/hfffr55/"}