{"id": "t5_2tand_t3_q1b5ek_t1_hfer0gm", "creation": 1633385354, "origin": "t5_2tand_t3_q1b5ek", "height": 1, "replied_to": "t5_2tand_t3_q1b5ek", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "stickysweetastytreat", "text": "Ok honestly, it's one of my pet peeves when people say \"Just do it\", when they have NO IDEA WHATSOEVER how debilitating mental health issues can be. As a personal trainer, it is very, very clear to me that there is shit awareness of mental health issues in the fitness world and it drives me fucking nuts when people-- other trainers & coaches!!-- insist that it's just willpower & discipline. Like.. do they not realize that \"Just do it\" isn't how-to advice, it's literally the answer that you're \\*trying\\* to get to?? Fucking hell.\n\nAre you able to access talk therapy? Finding a therapist that you genuinely feel ok talking to will help a lot (don't be afraid to interview them and/or ask for a consult appt, and if they offer sliding scale)\n\nSome other things to think about that may or may not help:\n\nI love that ocean metaphor actually. Do you identify as the ocean itself, or are you a person standing on the beach? If you are the person standing on the beach experiencing high & low tide-- is there any chance you can find any space to take a tiny step back when it's high tide?\n\nSome ideas for that:\n\nI'd think about any extra shit that's been layered on top. To be clear, this is NOT blame-- we have all been conditioned to some extent in our society: perfectionism, expecting to always be on & available, productivity is king. And NONE of that is based in reality. We literally cannot maintain the same \"perfect\" every single day. Some days WILL be bad. Again, this is NOT blame, this is examining the deeply programmed shit that's been engrained in us from birth.\n\nIf a perpetually long list of \"should-do's\" is bogging you down, throw that long list away. Make it a short list. Scale the stuff on that list down to one day, or even one hour. Like if it's been framed as \"need to start working out & get fit\".. how about \"walk around the block once today\", \"get dressed & take a shower\", or \"instead of eating that bag of chips I'm reaching for, maybe there's something in the fridge that's a little better\". There is no point in having 10 huge things on that list if you're still on that first step.\n\nAlso, just because you have high tide days, it doesn't completely invalidate what you've done on the low tide days. If you know you're having a high tide day, can it be something that washes over you and let that be done? When someone gets sick with a cold or an infection or gets an injury, no one expects them to come to work/school (I mean, they SHOULDN'T) & perform at the same level. Just because we can't see the harm, doesn't mean it's not as valid or is any easier to overcome.\n\nI hope something I've said here is helpful.. depression isn't the same for everyone, and the perspectives & approaches that work best will vary for people. Good luck!", "permalink": "/r/DecidingToBeBetter/comments/q1b5ek/i_want_to_stop_falling_into_depressive_slumps_and/hfer0gm/"}