{"id": "t5_2tand_t3_bcxk7q_t1_eku9oyp", "creation": 1555204926, "origin": "t5_2tand_t3_bcxk7q", "height": 1, "replied_to": "t5_2tand_t3_bcxk7q", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "oneispurple", "text": "Hey, I’m on a combo of Lexapro and Wellbutrin. First off, I am super happy with this combination for the most part. I’m also taking 5mg of lithium oxalate (helps with feeling emotionally in-tune) daily at the advice of my doc, as well as 2000mg of Glycine and a Valerian Root supplement to increase the effectivity of my sleep. This combo has alleviated almost all of my mood symptoms, and has super helped with the extreme drowsiness. Which is nice, because I no longer feel like a zombie most days.\n\nBut, I still have quite a lot of difficulty with memory, motivation and concentration. I seem to be missing little details often (forgetting something someone mentioned, mixing up dates, etc). And, I’m still having a difficult time getting and staying on task. Definitely improving my sleep quality was helpful in this regard; I’ve been taking the Valerian Root (which is supposed to help you get more REM) and Glycine (which is supposed to aid in the metabolic cleaning that occurs in the nighttime) for a couple of weeks now and saw a marked improvement in my alertness and mental presence within 2 days.\n\nMy doc and I recently talked about Ritalin as well, and I have taken it in the past for something called Giggle Incontinence that I had when I was an adolescent. I was taking 20mg per day for a few years and it definitely helped with these symptoms, although my depression/anxiety was not yet diagnosed. There was a pretty bumpy adjustment period of about a month until my body and brain got used to the medication. \n\nAfter that, there was not many noticeable side effects (until I tapered off...that was very uncomfortable). I will say that the hunger suppression was something to be wary of, as well as keeping careful track of your caffeine consumption. I’m not sure about it affects you, but caffeine definitely exacerbated my anxiety, and I imagine that combining that with Ritalin would not be fun.\n\nThat said, none of this is medical advice, just my own personal experience.", "permalink": "/r/DecidingToBeBetter/comments/bcxk7q/cognitive_symptoms_in_depressionanxiety_taking/eku9oyp/"}