{"id": "t5_2tand_t3_lvade1_t1_gpbx0xa", "creation": 1614626206, "origin": "t5_2tand_t3_lvade1", "height": 1, "replied_to": "t5_2tand_t3_lvade1", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Spababoongi", "text": "Hey, so I feel like I relate to a lot of your same issues, and I think what’s helped me is worrying less about what I’ve done and focusing on what I’m doing now. As someone who’s dealt with anxiety/depression for most of my life, that’s obviously easier said than done, but reaffirming that I am a good person and I am not intentionally doing harm is a big help for me. Also, reframing your thoughts. Change “I’m failed” to “this is good but I can do better” “I’m such an asshole” to “I can work on being more pleasant” things of that nature. Basically if you allow yourself negative thoughts you are falling into confirmation bias every time you meet that expectation of yourself, rather than allowing yourself to grow, you keep yourself weighed down by your doubts and thoughts. I can’t say that I always get this right, but I try and catch myself when I don’t act the way I would like to. Also, don’t compare yourself to other good people. Like you’re on social and see someone doing a good thing and you think you’re not a good person because you’re not doing the same thing. Comparisons are so toxic for your mental health, remember that people only show you what they want you to see on social media. You have to do the things that make you feel accomplished as an individual and as a good person. Do what you can, “change what you can’t accept, and accept what you can’t change”. A good book that helped me focus on myself and my actions was “The Power of Now” by Eckhart Tolle. He has a good method of getting you to focus on yourself and the present moment, and letting go of the tensions of the past and future. Highly recommend it. Hope this helps you on your journey and know that just making this post, reflecting on yourself and trying to be better are steps of a well-rounded, empathetic, mindful, good person.", "permalink": "/r/DecidingToBeBetter/comments/lvade1/realizing_my_toxic_traits/gpbx0xa/"}