{"id": "t5_2tand_t3_lvade1_t1_gpbn6er", "creation": 1614621851, "origin": "t5_2tand_t3_lvade1", "height": 1, "replied_to": "t5_2tand_t3_lvade1", "down_vote": 0, "up_vote": 12, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Heyydemonsitsyaboi", "text": "I think the fact that you’ve come to acknowledge your traits and how they can be/have been toxic proves that you’re NOT a narcissist. Or that you were a budding one. Poor behavior can almost always be curbed and replaced with better behavior with the right tactics. \n\nI think it’s actually healthy that you’re scared of what could be the real you. It shows maturity in evaluating your own perception against real world evidence. The fear will abate as you prove to yourself that you can better, because you CAN be. You need to believe in the goodness of yourself, otherwise you’ll just be emulating the emotions and actions like a lying liar who lies. \n\nOn the topic of improvement, I can only speak from personal experience. I think communicating with your partner and family that you want to improve your mindset and the ways you’ve recognized your shortcomings is a starting point. For example, giving someone the permission and even encouragement to point out when you’re being a jerk about something or being self centered and making a conversation about you or your problems - these external checkpoints can show you how often you’re doing it, and also reinforces that others notice it. As these instances become less (as is the goal), you also have validation of improved behavior. \n\nAnother thing is to make a list of the traits you know you need to be better at, and discrete actions to implement. Like a 1-to-1 battle plan. Realized you were emotionally manipulative, even 5 hours after the fact? Apologize (properly!) and lay out what you will do next time. Procrastinate at work or miss a deadline? Maybe you need to reevaluate your workload/priorities with your boss. Cross a boundary that someone had explicitly placed? Apologize and have a discussion with the person to see why you had crossed it. Don’t let it happen again. \n\nTraits aren’t erased overnight, and you need to forgive yourself for the poor actions of your past self. Don’t forget them, and the guilt is there for a reason. But let it be the guide to which a better you can be formed by, and not a stone dragging on your mind for all of eternity.", "permalink": "/r/DecidingToBeBetter/comments/lvade1/realizing_my_toxic_traits/gpbn6er/"}