{"id": "t5_2tand_t3_lvade1_t1_gpcrqo5", "creation": 1614640336, "origin": "t5_2tand_t3_lvade1", "height": 1, "replied_to": "t5_2tand_t3_lvade1", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BabyGothQ", "text": "I **completely** understand.\n\nIn my circumstance, I had created a “good girl” persona from when I was younger to help protect the “real me” from being hurt - in order to survive my childhood, and my life in general.\n\nThis quickly crumbled when I graduated HS and realized I was floating in a cloud for almost my entire life. I had a panic attack, the first of maybe 3 total I’ve had, which set off the *biggest* depression. \n\nI was in this same space for years, where I had an entire identity breakdown. It’s taken me until 26 to completely shed the fake persona. To unlearn all of the beliefs that made the persona real. To dig deep on why I created the persona in the first place.\n\nAnd honestly, I was similar to you: exploding word vomit onto others when I was emotionally distraught (I never had the opportunity to express my emotions, so when my friends or relationships allowed me to feel “safe enough” I used the opportunity to release my inner tension - but I never learned how to do that in a healthy way that’s compassionate towards myself and others.. I never learned to do it at all), I was manipulative (because my parents taught me that I couldn’t get what I need or want without tricking someone into caring about me), I developed the “gifted kid” syndrome (everyone told me I was smart and good then.. left me behind lmao you can’t tell a child they’re smart and then get mad at them for not knowing how to study for important tests or getting their homework done when they never had to put in effort to begin with - smart doesn’t equal knowing everything), I monopolized people’s time with me (because I was told to be quiet, stay out of sight, don’t bother us, play alone, so when I had friends and relationships I was on them like butter on bread - they were my lifeline), etc. etc. etc.\n\nWhat helped me was systematically rooting out all of the beliefs about myself, my life, my relationships, the world at large, money, career, etc. and getting to the core of what was holding my persona together - then uprooting them one by one, sometimes more than once (like feeling worthy of love, care, nurturing, compassion, etc., that was difficult, or allowing myself to be seen, heard, known and understood, that it’s safe to be- that’s one of my last few beliefs I’m uprooting currently). That helped me to see that most of my belief system was full of things **other people** put into my brain, told me about myself, or what I learned by watching others.", "permalink": "/r/DecidingToBeBetter/comments/lvade1/realizing_my_toxic_traits/gpcrqo5/"}