{"id": "t5_2tand_t3_lvade1_t1_gpca43f", "creation": 1614631997, "origin": "t5_2tand_t3_lvade1", "height": 1, "replied_to": "t5_2tand_t3_lvade1", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "stickysweetastytreat", "text": "Holy shit losing over 100lbs AND doing it in a way that led to a more positive headspace is AMAZING!!!!!!! Good on you, that's seriously hard fucking work. Wow.\n\nAnd, whether it's actually SAD, or all the bullshit that's been happening since last year (I mean, it's very likely a little bit of everything..)-- stress takes its toll on us. That's just how it is.\n\nBtw, you know what a common response is when we feel overwhelmed? We shut down. This is your system under stress, and you might be a little too hard on yourself if you're trying to say it's laziness.\n\nSometimes, people benefit from doing some kind of mindfulness exercise (at a time when it's appropriate to do so.. like 10min before bed or something like that). We experience our lives through our physical senses AND thoughts. Our physical senses are the ones that are necessarily anchored in the present moment; our thoughts aren't. When we take on the reality painted by our thoughts, our bodies will react accordingly (like think of that one time someone really pissed you off.. and you start FEELING pissed off, right?). You don't always have to live in your thoughts.\n\nIf we're in a moment where we objectively know there's nothing on fire right now and you have a few minutes to chill, then practicing taking on the reality painted by your senses themselves can help serve as an anchor to keep you out of your thoughts. (and mindfulness doesn't have to be meditation, it could even be something like yoga or gardening or whatever.. anything that serves as a continuous opportunity for you to check in through your senses)\n\nAnyway-- best of luck to you!! I hope you're proud of yourself of the really amazing progress you've made!", "permalink": "/r/DecidingToBeBetter/comments/lvade1/realizing_my_toxic_traits/gpca43f/"}