{"id": "t5_2tand_t3_lvade1_t1_gpax3yr", "creation": 1614609890, "origin": "t5_2tand_t3_lvade1", "height": 1, "replied_to": "t5_2tand_t3_lvade1", "down_vote": 0, "up_vote": 21, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ENFP7w6", "text": "all the feelings and experiences you described, i am going through in the same way but just adjust the details to fit my life right now. honestly, im only able to provide some advice by reading through what you wrote and comparing it to the way i am. first of all, i relate to that thing you did where you said “i was an only child” and kind of used that as a possible explanation for some traits, like “maybe it was because of this?” i do the same thing and idk if you do this too but sometimes i overestimate the validity of statements like this, and it puts me into a fixed mindset like “well thats the way i was raised, ill never grow out of it.” i think this applies to the “what if im a narcissist” thought, too. i have this thought too and i ruminate on it a lot cause im scared of the possibility, like what if im ACTUALLY a narcissist. and then THAT thought further pushes my risk of me staying in a fixed mindset LOL, cause i focus on it instead of trying to reprogram my thoughts. for one, seeing myself in you makes me feel less alone. for two, you seem to be a young adult too like me whos going thru some changes (moving out, etc) and i cant speak for you but id say right now as im experiencing all these changes ive never felt such inner turmoil and uncertainty about my personality and behavior before like this in my LIFE, because before i was just a naive teenager who reflected on different parts of myself like the music i liked LOL. i think the feelings were having right now might be normal, which in the least tells us that we CAN work through them, and theres no need to worry about it being permanent. honestly i wish i could give you advice on feeling manipulative and feeling like youre losing your old self, but im still not sure on those yet. i really feel you on both the “feeling manipulative” and the “i thought i was a good person, where are my good traits going” part. this is something that has been dominating my mind lately. i think worrying about how im becoming less funny has made me less funny. (i feel like a narcissist by how many times im using myself as an example LOL i just dont want to like tell you what to do and be like “you need to do this this this blah blah” haha) like negative thoughts have literally manifested those traits in me. so maybe we should try those thought replacement techniques, “positive self talk.” like “i AM smart” or “i AM loved” or even “i CAN figure out my problems” whatever works for you, since a lot of these things are our perceptions it might just take a little bit of adjusting to our mindsets to get us to perceive things right and not so tinted by our own anxieties. anyways, feel free to tell me more, i relate to a lot of what youre going thru and best of luck", "permalink": "/r/DecidingToBeBetter/comments/lvade1/realizing_my_toxic_traits/gpax3yr/"}