{"id": "t5_2tand_t3_lvade1_t1_gpbzkcn", "creation": 1614627341, "origin": "t5_2tand_t3_lvade1", "height": 1, "replied_to": "t5_2tand_t3_lvade1", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "stickysweetastytreat", "text": "Here's some food for thought.\n\nYou recognized that you had specific traits, actions you do that are a product of how you think and process the world & your thoughts.\n\nSo, about this part:\n\n>  I’ve always believed I was a good person and loved who I am, but now  I’m not so sure. It makes me miserable, and all I want in the world is  feel confident that I am not causing any distress or emotional/mental  harm unintentionally to those around me. \n\nYour realization was of your actions themselves. But those actions were from specific thought patterns.\n\nBecoming aware of something doesn't mean you've changed it. That's additional work.\n\nBut I hope it helps give you some space to know that it's those same thought *patterns* that are making you feel miserable, that have convinced you that you're not so sure you're not causing distress or harm unintentionally. Just because you have a thought, doesn't mean it's true. Just because you have a feeling, doesn't mean it's true or justified.\n\nThe reality is that everyone shits on everyone from time to time. None of us are saints! It is unreasonable to expect to never cause other people distress.\n\nDon't forget that we humans have another really awesome trait: longevity. We can learn to overcome things. You'll learn to overcome those thought patterns that are keeping you tied to actions that are toxic.. not just to others, but look-- it's even toxic to YOU! Feeling awful about realizing you've had toxic traits is totally normal, but you don't deserve to have it be so consuming.\n\nI would suggest practicing noticing whenever those thought patterns come up, and consciously think of a better action to do. Like \"Oh, I just caught myself going down the rabbit hole feeling miserable because I did \\_\\_\\_\\_\\_\\_\\_ and I know it's toxic to them because \\_\\_\\_\\_\\_. But going down that rabbit hole doesn't help me or the situation, so what can I do about it? .. Ok I think I'll address the situation and apologize.\" Don't construct the apology as \"this is me taking away my guilt, please alleviate it for me\", build it like \"I accept accountability, I realize the harm that it could've caused, if you're feeling upset, that is understandable, I can't change the past but here's what I can continue working on so that I can try to improve from here\"\n\nI highly recommend The Holistic Psychologist on Instagram! She posts a lot of great content, a lot of which addresses this kind of stuff.", "permalink": "/r/DecidingToBeBetter/comments/lvade1/realizing_my_toxic_traits/gpbzkcn/"}