{"id": "t5_2tand_t3_qfk0h3_t1_hi1c373", "creation": 1635197584, "origin": "t5_2tand_t3_qfk0h3", "height": 1, "replied_to": "t5_2tand_t3_qfk0h3", "down_vote": 0, "up_vote": 11, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "heylistenlady", "text": "This is a lot, friend and I'm so sorry you're going through this. Other people have fantastic advice here and I just wanted to chime in with some of my experience. \n\nI'm in my late 30s, female, tall and thick, I have been since I was 12. \n\nOver the course of my life, I couldn't tell you how many names I've been called (by peers and strangers alike), how many times people went out of their way to deliberately be cruel and awful, and how many times people just wanted me to feel terrible because of how I looked. \n\nI realized a long time ago - they have the problems, not me. They are sad little people who are so insecure they need to hurt other people just to give their egos a boost. It always sucked and of course words hurt but after awhile it was just like \"Well sounds like you're problem, not mine, and I'm actually happy with who I am whether you think I look good or not.\" Those people can judge all they want, but they are not the ultimate judges of ourselves, we are. \n\nStanding up for myself in those situations, frankly, I never really did. Cause they didn't deserve my anger or emotional energy. Whenever possible I just sighed, shook my head and walked away. Though looking back, I wish on some occasions I would have said something like \"Aw...Well, it's obvious you're a pretty sad person, but do you feel better and cheered up now that you've belittled me?\" or just offer a pitying laugh and say \"Ooookay.\"\n\nNow, the one person I had the hardest time standing up to: my mom. Really long story short...after years of those physical effects you described, I'd just had it. Went to her house, calmly told her my stance and I was prepared for her reaction, but I refused to indulge her reaction cause I knew it was just bluster again...coming from a place of sadness and insecurity. Her problem, not mine.\n\nYour situation is different, but I just want to express...there is plenty of hope, you can battle your mental issues (I'm bipolar) and you can get to a place of mental health and happiness. \n\nA good place to start building confidence...look in the mirror every day and give yourself a compliment. And mean it. Can be as simple as \"I have pretty eyes\" or \"I like my laugh\" or whatever it may be. It's an exercise to turn the focus on yourself, build confidence and be comfortable with who you are. It's HARD and like others have said, this is a journey. But as you are able to quiet your own judgements about yourself, over time, the voices of others can be blotted out, and you can choose your battles - like when to react and when to walk away. \n\nGood luck to you, you've got this! You're already much stronger than you realize!!", "permalink": "/r/DecidingToBeBetter/comments/qfk0h3/how_do_you_speak_up_for_your_self_without_causing/hi1c373/"}