{"id": "t5_2tand_t3_qfk0h3_t1_hi2p86n", "creation": 1635220702, "origin": "t5_2tand_t3_qfk0h3", "height": 1, "replied_to": "t5_2tand_t3_qfk0h3", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DonutSwitch", "text": "\\>People going in front of you in lines or once insulting you means somehow that they can continue to insult you until they get a reaction but when you stand up for your self they laugh, which makes you never stand up for your self again and take even physical abuse but it is mostly psychological like them throwing things at you. \n\nI don't understand the line part. Sometimes it isn't even worth bothering. Its better to just ignore than cause a scene.\n\nPart of having a self esteem is not caring what people think of you. That means when they insult you. You are allowed to laugh at yourself even if the joke is the expense at you and you are allowed to say something back that is funny. Fighting someone over an insult shows how insecure you are and you are the one that is going to get kicked out for starting the fight.\n\n\\> Like what do I say?\n\nAbsolutely nothing, make a joke, say \"Hey that was a funny joke man!\" You need to realize they are the negative ones. You don't hang out with those people. You hang out with people who enjoy your company and are nice to you. The best way to do that is to build a positive mindset.\n\n\\>only I can control how I can react, so how should I react? What is the correct way to react? Do you glare? Laugh? I am not witty and tend to freeze.\n\nBest way to react? Laugh, or say this is the one my therapist told me \"Yeah thanks for the advice man!\" You don't have to be witty to have people like you.\n\n[https://www.healthline.com/health/how-to-think-positive#tips](https://www.healthline.com/health/how-to-think-positive#tips)\n\nHere is a link to think more positive. Allow yourself to laugh at anything and yourself. It will lower your anxiety and depression. Have gratitude about the small things in your life. A roof over your head, being able to eat, etc. Positive people will come to you and you will go to them.", "permalink": "/r/DecidingToBeBetter/comments/qfk0h3/how_do_you_speak_up_for_your_self_without_causing/hi2p86n/"}