{"id": "t5_2tand_t3_qfk0h3_t1_hi4fjei", "creation": 1635261023, "origin": "t5_2tand_t3_qfk0h3", "height": 1, "replied_to": "t5_2tand_t3_qfk0h3", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "crazycandice", "text": "I had to learn the hard way: in the psych ward. I couldn’t eat unless I asked for food. This was a very strict ward, you had to ask to go to the bathroom and they had to watch. By the 3rd day, I finally asked for something: a toothbrush. It was SO SCARY but afterward I felt this feeling that I never felt before. Like “I did that! I needed something and I asked and they didn’t yell at me, they were happy to give me what I needed!” So slowly with exposure therapy I’d say is how I did it. But it was more sped-up than normal exposure therapy because I literally HAD to ask. I slept in the hall on the floor until I asked for a bed. I had to ask for sheets, a blanket, a pillow. The toothbrush was first, then I asked in the cafeteria if they had any vegetarian options and the women working there were so proud of me, they took me back and showed me everything! They made it a good experience, they reinforced that I am not being annoying or bad for asking for what I needed. By the end of my 2 weeks there, I was able to call down to the cafeteria (another phobia of mine) and request specific food items for lunch.\n\nSome of the therapists put it to me like this: what if it were an animal who was being hurt/needed help? Would you ask for them? Would you stand up for them? Since I am a huge animal rights activist I said of course. They told me I should treat myself with the same kindness I give to “innocents” (animals & children). If I am being treated badly, stand up for myself the way I would for someone else. That helped.\n\nDon’t get me wrong, it is terrifying at first but you do get this rush of “I did it!” energy that is awesome. Start small, keep going at it no matter what anyone says. You deserve to be treated with respect, just like everyone else. Continue practicing daily, because if you stop even for just a bit, it gets harder again. Now I am a great self-advocate. Because of my experience at the hospital, when I got out I stood up for myself at doctors appointments. I told them something is not right. I was eventually diagnosed with a rare genetic disorder and now am doing everything I can to take care of my body the right way, all because I stood up for myself.", "permalink": "/r/DecidingToBeBetter/comments/qfk0h3/how_do_you_speak_up_for_your_self_without_causing/hi4fjei/"}