{"id": "t5_2tand_t3_q5otq3_t1_hh2an7a", "creation": 1634524812, "origin": "t5_2tand_t3_q5otq3", "height": 1, "replied_to": "t5_2tand_t3_q5otq3", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BerrySensitive", "text": "Sounds exhausting? It was! I was soldiering on, trying my absolute best but it felt like we were both stuck in these patterns of behaviour. I started going to personal counselling again, hoping to get some advice on relationships. He flagged that I was being critical - and although I hated that idea, I had to admit I could see it in myself and that was something I wanted to change. I also took some advice on \"helping partners with depression\" and focused on my own hobbies & seeing my own friends to give him space. It didn't seem to change much about the situation but it did make me feel a little better. And to be honest other than the relationship, everything else in my life was pretty good. I had a job I loved in my degree field, rented a nice apartment, friends, hobbies etc..  \n\n\nThings came to a head very suddenly when I discovered explicit messages between him and another woman. Turns out he'd been cheating on me for at least three months. I immediately ended the relationship. I had to temporarily move back in with my parents as it was all very sudden (we'd been gradually rebuilding a relationship over the past year and I felt like I could safely stay with them for a couple of weeks). A few weeks later, the pandemic happened. And then I lost my job in an especially nasty way - my manager told me I wasn't good enough and he wasn't willing to invest his time in me any further the week before my probation was ending. I got let go the day we we sent home because of Covid. And all of my social contact and hobbies, and all the other stuff you're supposed to have in your life for your mental health. All gone.  \n\n\nI. Crashed. Hard.  \n\n\nIt honestly felt like everything I'd worked hard for had gone up in smoke. The life that I'd loved was gone. The person I loved and thought I knew was gone. My dream job was gone. There were days I couldn't get out of bed and was just a crying mess trying to make sense of it all. I've always been a pretty hopeful person - even after the breakup I felt like maybe it was going to be for the best and I could survive this, but getting hit with the job loss and pandemic and being stuck back home with the family that had verbally beat me up for 18 years just broke me. I had put the work in, I had done my time. I had clawed my way up, I had worked my butt off to get to where I was. And it wasn't enough. I'd failed in every way which mattered.  \n\n\nThe only good thing was that I finally had some time to think & reflect. I read up on relationships. First of all it was \"how can you prevent getting cheated on\" \"did I make him cheat\" \"how can you tell someone is going to cheat on you\" (spoiler alert: you can't) but also \"what does a healthy relationship look like\", \"what's reasonable in a relationship\".  \n\n\nFirstly, you can't make someone cheat on you. Even if I'd been an absolute nightmare to live with, my ex was perfectly free to leave at any time (when we did break up it was quick and calm even under the circumstances because I'm not the kind to kick off...if you don't want to be here don't let the door hit you on the way out). There were no kids or shared assets. He's an adult and should have ended the relationship if he was no longer happy - that's on him. Obviously if someone is cheating on you, they're definitely not creating a healthy relationship dynamic at their end because of all the sneaking, lies & dishonesty. However, what I'm about to say were patterns I'd noticed about myself & my behaviour in previous relationships too.  I also did it at the start when there weren't any issues between us (that I knew of).  \n\n\nI had been doing the best I could. I loved the guy and really wanted to make it work. I also had been as proactive as I could - I'd gone to counselling before I even met him to try and resolve the bad habits I'd learnt from my family. But a lot of stuff had come out living together with a partner for the first time, because I hadn't realised I held some very unhealthy relationship beliefs & behaviors:  \n\\- When he disagreed with me, I felt threatened. Difference was threatening to me and that's why I would criticize and pick at it - because it made ME feel uncomfortable, not because it was inherently wrong or not a valid way of doing things.  \n\\- I was very emotionally dependent on him. I struggled to calm my thoughts and relied on him to validate my feelings. If he was up, I was up. If he was down, I was also down. This meant that I would get really irritated with him if he was feeling a certain way because it would impact on me. I held him responsible for my feelings.  \n\\- I took disagreement & mistakes very personally. How could he not know that would upset me???  \n\\- I had poor conflict resolution skills. I struggled to manage my emotions in the moment. I struggled to let things go once resolved. I approached it like a fight for survival rather than calm/ collaborative problem solving.  \n\\- I blamed him. Somehow problems always ended up being his fault - and I really believed it at the time.  \n\n\nI was a good partner in other ways. I was generous and warm and loving, I had my own hobbies and friends, I was quite independent and didn't have any trust issues at the time (lol). But the things I've just described make a relationship unsustainable.Some of this stuff was a lack of skills. I just didn't have the tools to get out of negative and anxious thinking spirals myself - so of course it was going to be hard for me to manage disagreements. I approached conflict resolution as a zero-sum game - there's a winner and a loser. It's a fight, because that's all I'd ever seen before - which of course creates friction and hurt feelings and frustration and resentment.  \n\n\nMost of this stuff was fear-based. It kind of felt like I was on red-alert all the time just waiting for things to go wrong. I read about Attachment Theory and realised that it aligned a lot with Anxious Attachment style - I'd finally found a person who cared about me, and the slightest sign of disharmony sent me into threat mode, because I was hanging onto that relationship goddammit.  \n\n\nIt felt bad to realise that I'd been doing these things. I never wanted to be someone who's difficult to live with. You never want to cause anyone you love any amount of pain. But I literally wasn't consciously aware of it before, it was just an automatic pattern downloaded from my parents. All I could do now that I had realised was to work on it now by myself so it would be fixed going forwards, both for myself and for any future partners.  \n\n\nI was externally emotionally regulated & set my value by my achievements. I also realised I hadn't really fixed my anxiety and depression - I had avoided it by carefully managing my external environment. As long as my life was going well, I was fine. But even before The Great Crash, when something negative happened it would throw me into a negative loop for days, and if anything was uncertain I would get extremely anxious because I knew I'd struggle to cope if I failed. And I felt like I'd failed big time. I wanted to be someone who was more emotionally stable and less rocked by external events.Although I was better and managing overwhelming emotions now, my thinking around it was still a little screwy. For example: someone does something that inconveniences me -> they must have done it on purpose! -> I feel hurt. I realised this was an unhelpful thought pattern I had. While looking up \"changing your thinking\" I came across CBT (cognitive behavioural therapy).", "permalink": "/r/DecidingToBeBetter/comments/q5otq3/current_toxic_person_looking_for_advice_from/hh2an7a/"}