{"id": "t5_2tand_t3_q5otq3_t1_hg7v5d1", "creation": 1633952879, "origin": "t5_2tand_t3_q5otq3", "height": 1, "replied_to": "t5_2tand_t3_q5otq3", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Tenthdegree", "text": "You’ve overcome The biggest hurdle in all of this in becoming Self aware of your own obstacles and wanting to become a better person. From my experience, the people who are finding themselves lonely are ones who stubbornly sees everyone else as the problem and never self reflecting.\n\nWithout knowing you personally, Its hard to Assess and give advice true to you. However this part in your OP sticks out\n\n>I’ve lost 99% of my family for standing up for what’s right, lost most of my friends for taking things too personally, am so close to losing my bf for not meeting my (mostly unrealistic expectations)\n\nWhen you’re “standing up for what’s right”, you need to ask yourself, is this subject the hill to die on? I tend to avoid conversations around touchy topics like Politics and Religion. Everyone has their own strong opinions and no matter right you think you are in your beliefs, no one looks good at the end of the conversation. Change the subject to something more pleasant like vacation plans or the Latest restaurant you’ve been to. You may also want to change how you speak. Many times it’s not what you say that’s off putting but HOW you say it.  \nAs for taking things too personally and having unrealistic expectations, try relaxing and accept everyone else has a preference and perspective that’s different than yours. Be adaptive and compromising. Work with people, not against them. Take comments initially as jokes and be light Hearted. Be that person who looks at things half full than half empty\n\nIt May take some time and you may need to self reflect regularly with input from your BF, but I have faith that you’re on the right path on improving yourself and becoming a better you", "permalink": "/r/DecidingToBeBetter/comments/q5otq3/current_toxic_person_looking_for_advice_from/hg7v5d1/"}