{"id": "t5_2tand_t3_q5otq3_t1_hh2aqks", "creation": 1634524860, "origin": "t5_2tand_t3_q5otq3", "height": 1, "replied_to": "t5_2tand_t3_q5otq3", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BerrySensitive", "text": "The idea behind CBT is that your thoughts create your feelings. If you think your partner is deliberately doing something to upset you, of course you'd be hurt/ angry! If everyone did laugh at you, of course you'd feel embarrassed! Your feelings are a normal reaction to what your brain perceives as reality (like the Matrix - you think it's really real). This was the thing that clicked the last puzzle piece in place for me. Every single one of the cognitive biases I read about were ways that I thought - and ways my parents had reasoned with me/ spoken to me growing up.  \n\"Mind reading\" - my dad always apparently knew what we were thinking and that we thought we just owned the place and could come in here and that someone else would clean right up after us...  \n\"Emotional reasoning\" - if my dad was in a bad mood, he'd blow up about something for sure!  \n\"All or Nothing thinking\" - my mum saying you NEVER help around the house, you're ALWAYS so oversensitive!  \n\n\nI didn't even realize it wasn't normal to think like that!! I didn't realize that other people don't think like that! It still blows my mind to this day.  \n\n\nThe nice thing about CBT is that it gives you the tools to spot and then restructure the thought in a more helpful way. Because it's still true, you feel better pretty quickly & your brain is perceiving reality in a less threatening and more realistic way - and suddenly you're on an even playing field with everyone else.  \n\n\nSo where I am today nearly two years later...well I'm working again - I found a new job, nothing glamorous and it's not in my degree field but I'm financially stable again. And I'm in a new, much healthier relationship. I would not characterize my behaviour as toxic any longer. I definitely I'm still working hard on restructuring my thoughts every day & doing all my exercises for therapy, and it's not second nature yet but the progress has been noticeable which is really encouraging so far. I'm getting back to some vocational training part time in two weeks time to find a job in my degree field again next year. And my parents are still very much themselves, but they bother me a lot less even when they criticise me, because while I can't change my external environment or other people's behaviour and choices, I'm learning to manage my internal one a heck of a lot better. Finally. :)  \n\n\nThis is a long and messy narrative, because I think the way out is going to be highly personal to you. You mentioned that \"the last few years have broken your spirit\" and obviously you have a daughter and a challenging ex and a relationship that didn't work out. So maybe on some level you've feel hopeless, and like nothing you will do can make a difference. I know I certainly did. But having shared my story, I hope that you can see I mean it when I say there is a way out, however hopeless it feel and however hard life has been kicking you.", "permalink": "/r/DecidingToBeBetter/comments/q5otq3/current_toxic_person_looking_for_advice_from/hh2aqks/"}