{"id": "t5_2tand_t3_gygkxg_t1_ftal25a", "creation": 1591556575, "origin": "t5_2tand_t3_gygkxg", "height": 1, "replied_to": "t5_2tand_t3_gygkxg", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "casuallybronte", "text": "Oooh I have some many! My Saturday mornings haven't been the best so I really appreciate you posting this.  I've been trying to implement some sort of routine since the Coronavirus shut the universities down, but I'm such an extrovert and I love meeting people and going out and doing things.  I feel like my motivation has taken a downturn because I don't have a \"social life anymore (sidenote: has anyone else been struggling with this?  How y'all figured out how to overcome this?)\n\n\\--------------------------------\n\nThe One Where I'm Super Active\n\n6:30 Wake up, make some coffee, eat something light and healthy\n\n7: 30 Do something active with my bf (go to the gym, go hiking, just go somewhere)\n\n9:00 Shower, eat breakfast part 2, and skincare of course\n\n10:00 Get started on some schoolwork, grade papers\n\n12:00 Have another nice lunch\n\n\\--------------------------------\n\nThe One Where I'm Living My Fancy Life\n\n7:30 Wake up, make some coffee and get dressed (preferably in a sundress)\n\n8:30 Head over to the farmer's market and food co-op to get groceries for the week, I'll probably get another bouquet of flowers for the dining table\n\n10:00 Tidy up the house\n\n11:30 Grab lunch with a friend and catch up\n\n\\--------------------------------\n\nThe One Where I'm Still in Quarantine/Following Social Distancing\n\n7:30 Wake up, coffee (see how this is a recurring theme?)\n\n8:00 Eat some breakfast, get dressed, skincare\n\n9:30 Get started on school work, take breaks every once in a while\n\n12:00 Lunch break!\n\n1:00 Work out/mobility routine\n\n2:00 Shower/get back to work\n\n5:00 \\*No work past this point\\* eat dinner and relax with bf the rest of the night", "permalink": "/r/DecidingToBeBetter/comments/gygkxg/what_is_your_ideal_saturday/ftal25a/"}