{"id": "t5_2tand_t3_lcu54p_t1_gm4ovnk", "creation": 1612542034, "origin": "t5_2tand_t3_lcu54p", "height": 1, "replied_to": "t5_2tand_t3_lcu54p", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "keepingitform5", "text": "What worked for me: (on my fourth appointment).  Joinreflect. Its in CA if you happen to be here.  By taking a long survey (15min) and answering simple questions I was matched with two people who the site arranged intro calls for me when I finished the survey. It texted me the call times when confirmed (almost like they designed the setup process for someone who might have anxiety getting through it!)  Its more expensive than my insurance, but the first of the two therapists I was matched with felt comfortable immediately. \n\nWhat didn't work: \nLarge databases: I had never had therapy so found it hard to use the larger databases recommended above where I needed to know what type of therapy and even when I guessed still ended up with an overwhelming list that I felt too anxious to initiate calls to multiple people to have multiple anxious appointments in order to have an anxious decision point where I would then have to tell everyone else I didn't want to go with no... It felt too overwhelming and ambiguous for me to even get started. \n\nInsurance: My plan is one of the cheaper ones from a small non-tech company so mine hardly covers mental health to begin with. \n\nI tried calling Kaiser every 3-6 months when I had flare ups of anxiety for two years. Everytime I couldn't get past the initial process to get help. \n\nEven if I talked to a real person initially someone else had to call me back at an unknown time in the next two days to do their survey. I am Soo anxious for phone conversations that it was a big hurdle and I would be at work and didn't feel like I could quickly find a private place for a phone call (my work is 100% open and I'd have to step outside where there may or may not be people around) on top of that I teach classes so can't answer unless pre-coordinated to not be teaching at a time, which they wouldn't let me at least just set a time for them to call). I never got it to work through my insurance.", "permalink": "/r/DecidingToBeBetter/comments/lcu54p/tomorrow_is_my_first_day_of_therapy_ever/gm4ovnk/"}