{"id": "t5_2tand_t3_kpyb88_t1_glrxnzg", "creation": 1612297080, "origin": "t5_2tand_t3_kpyb88", "height": 1, "replied_to": "t5_2tand_t3_kpyb88", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Cat_Eyed_Goddess94", "text": "sorry for the late reply-home life has been the most  turbulent it's ever been the past few weeks(i live in a home with psychoapths, drug addicts, and narcissists lol).  if you go to my posts, ( i know there's a lot), but i would say that i think most of how i did it is in those posts since i would come on here to talk about things i learned that helped me do it. \n\ni really admire you admiring my progress-your support means the world to people in our shoes! \n\ni'll say that essentially what i did was THINK about the bad thoughts. for example, if i knew X was a negative and self destructive thought, i would think about it and then explain to myself why that thought isn't just a negative thought, but why its not logical. bc as humans, logic appeals to us most and i think that's what dissuades people from pursuing therapy..\n\nthe fact that they think therapy is some feel good form of self help. and we all know that logic appeals to us most, becasuse as humans, we only believe in things we find logically true. so changing what we believe in requires us to see the loopholes in the  current self defeating beliefs we have by understanding how those believe are NOT logical. as soon as we realize that, we begin to stop believing them. and when you get rid of negative beliefs, that's when the anxiety/depression starts fading away. \n\nA) i would notice the negative thoughts i had.\nB) i wrote them out\nC) i read it back to myself\nD) then beside it i wrote how it was illogical\nE) i started to see the flaw in my flawed belief, and started to see how such a flawed belief wasnt *helpful* to my life nor *true* about me or my life. i started to see how that false belief was a lie.\nf) i focused on doing this for a few months. i'd say at least 2. \n\npart 2:\ne) the anxiety/depression started to fade\nf) i started feeling my self identity again after i untangled the negative, false beliefs that hid my identity which occured as a result of seeing how those negative thoughts were illogical, as explained in part 1\ng) once  the power of *false negative thoughts* decreased, i had more power. as a result, i thought more positively because my voice started speaking to me, as opposed to the negative thouoghts. \nh) now, my journaling consists of a mix of dismantling negative thoughts while also thinking positively.the dismanting is way more important though, so somtimes is spend more time doing that because the negative thoughts will block positive thoughts in your mind ..so sometimes i journal out the negative thoughts and then rely on things like pinterest, reddit etc for postiive reminders..i also spend a lot of time thinking of positive thoughts too now that my brain is able to do that!\n\n----it's tough, but as long you stick to your intention of wanting to control your mind isntead of allowing it to control you and distort your reality, that is the one thing that helped see me through-the relentless interest to seek the truth, and to see reality for what it really is-not what my negative thoughts want to trick me reality is.", "permalink": "/r/DecidingToBeBetter/comments/kpyb88/i_started_getting_anxious_because_theres_a_huge/glrxnzg/"}