{"id": "t5_2tand_t3_pjv4la_t1_hc2dujy", "creation": 1631113249, "origin": "t5_2tand_t3_pjv4la", "height": 1, "replied_to": "t5_2tand_t3_pjv4la", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "crucifixioncruise", "text": "Thanks. I know. I’m so conflicted. I’ve wanted to do one since I was in high school and in many ways it feels like the only thing I can imagine myself doing. On the other hand, I know the job market is beyond dismal and there is a high probability of not becoming a professor. And I refuse to adjunct. I don’t know what other kind of career I would be good at or enjoy. I feel like I would be suited to academia, and would enjoy it, but I’ve heard so many horror stories. However when I look into other careers I hear very similar things (the job market is dismal, even if you land your “dream job” you will be miserable and underpaid and overworked). \n\nI think more than anything what I would feel sad about if I didn’t go to graduate school is the intellectual community. And the chance to continue to be a student and to devote myself to studying and writing for four more years. I guess I just feel like I’m not done. This sounds stupid but I just want a little more time as a student. Right now my thinking is that I will only go to graduate school if I manage to get pretty much full funding, and also if I’m accepted into a top program. If that doesn’t happen — there’s a good chance it won’t — I won’t go. Thinking about that feels like a resignation and a loss. And every time I mention to my parents another possible career path I’m always talked out of it, reminded that I’ll make even less money and have worse working conditions. I’m so privileged in so many ways, I feel ashamed for not setting myself up to make more money/better use of all the opportunities I could have had.", "permalink": "/r/DecidingToBeBetter/comments/pjv4la/i_have_no_ideas_of_my_own_ive_been_a_fraud/hc2dujy/"}