{"id": "t5_2tand_t3_pvn5ig_t1_hedi9mh", "creation": 1632679977, "origin": "t5_2tand_t3_pvn5ig", "height": 1, "replied_to": "t5_2tand_t3_pvn5ig", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "redubshank", "text": "I read about in a book to fix a chronic pain condition.  I suspect it might have other names but the author might have purposefully left out the word 'meditation' to keep people from scoffing at it.  I'll just type up what I do.  \n\n\n1. Get in the most comfortable position you can.  For me this is lying down with a sleeping mask on in a darkened room.  Ideally, anyway.\n2. Start at the your forehead and relax it, releasing any tension.  Take comfortable breaths while doing this.  Take your time, depending on where you carry tension it might take a minute or so until you are comfortable moving on.  If you ever reach a part that you simply can't relax, don't worry about it.  Just move on to the next thing.  We will come back to it.\n3. Focus on your eyes and relax them.\n4. Relax your jaw, which means you might end up having your mouth hanging open a bit.\n5. Relax your shoulders.\n6. Relax your upper arms\n7. Relax your lower arms\n8. Relax your fingers/hands\n9. Relax your upper back\n10. Relax your abs\n11. Relax your lower back\n12. Relax your glutes\n13. Relax your upper legs\n14. Relax your lower legs\n15. Relax your feet.\n16. If you had any problem areas then go back to them and see if oyu can relax them.  If you can't, again no big deal just sort of feel it and get curious.\n17. You can now just sort of 'exist' and you are basically doing regular meditation now.  If you feel like you are losing your way just start at stop 2 again and start relaxing everything.  While doing the body scan if you feel like you get very lost then no big deal, just start from the top again.\n\nDon't focus too heavily on the exact order, I just do a top to bottom scan.", "permalink": "/r/DecidingToBeBetter/comments/pvn5ig/starting_a_mindfulness_practice_even_though_i/hedi9mh/"}