{"id": "t5_2tand_t3_pvn5ig_t1_hedbhts", "creation": 1632677374, "origin": "t5_2tand_t3_pvn5ig", "height": 1, "replied_to": "t5_2tand_t3_pvn5ig", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "iigaijinne", "text": "Don't take this the wrong way, but perhaps this is the more \"childlike\" side of yourself looking at mindfulness--the side that might have thrown a temper tantrum because you had to wait in line for a rollercoaster (waiting in line is also boring).  \n\nFirst, you have to change your mental association away from it being \"boring\". Kind of like astrophysics--you can call it boring or you can find it amazing and you would be right because that's your opinion.  \nYour opinion isn't helping you, though. It's actually hurting you because now you can't use these very helpful exercises.  \n\nSo, like a smoker deciding to drop his bad habit, you must from this point on say \"There is something interesting about mindfulness\", like a smoker might look himself in the mirror and say \"you are now a non-smoker\".  No, it's not a magic trick, but it starts to shift your view.  \n\nNow, it is ironic that you aren't interested in mindfulness because, truly, mindfulness is the state of \"being\" interested. Being curious. Being aware.  \n\nImagine \"mindfulness\" as you acting or pretending to be a scientist (a 'be kind to everyone' sort of scientist, like a scientist-monk). Think about what it would feel like to be a scientist-monk. They are fascinated by everything and are gentle and non-judgemental in their fascination.  \n\nSo, you become blueberry-spy scientist-monk and you turn it inward.  \n\nYou are an endless world of experience. The way your legs feel right now, your breath, the air on your skin, the smell of the room you're in--I can truly go on forever. Your goal is simply to \"be\". You feel the emotions, physically, in your body and (gently, non-judgementally) you observe. Your breath, you observe. Anything that grounds you to the here-and-now world, you can watch.  \n\nWhat you watch is not going to be stationary. You're going to be observing living things, in a way, not like art on the wall.  \nAs you observe, your emotions will change, and if you're, for instance, experiencing a panic attack, it WILL subside. You simply have to wait and watch it, be interested in what it feels like, what is happening. Don't give into these feelings, don't dive into the ocean, but surf the wave.  \n\nThis is mindfulness. All exercises stem from this sort of philosophy about your place in relation to your thoughts and feelings. You are not your thoughts and feelings. They are things that happen inside you, that you can decide your relationship to.  \n\nThis is already a bit long, but: \n\nIn your brain is a monk and a monkey. The monk wants a peaceful existence, but the monkey is running around causing chaos. The monk does not hit the monkey, she does not scream at the monkey, she does not give into the chaos of the monkey's tantrums.  \nThe monk kindly gives the monkey a job.  \nThe monkey's job is to \"watch\". And the monkey, so curious and happy to be occupied, is completely absorbed in its task. The monk has peace.  \n\nThis is your brain. Peace is achieving flow state, peace is being able to allow your emotions and thoughts to pass by like clouds, because real life happens outside your head.  \n\nReal life happens once you connect your mind and body in this way and move beyond yourself to \"do\" and \"create\", rather than struggling through \"think\".  \n\nI hope this helps.", "permalink": "/r/DecidingToBeBetter/comments/pvn5ig/starting_a_mindfulness_practice_even_though_i/hedbhts/"}