{"id": "t5_2tand_t3_kih596_t1_ggrunr0", "creation": 1608703189, "origin": "t5_2tand_t3_kih596", "height": 1, "replied_to": "t5_2tand_t3_kih596", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "highapplepie", "text": "Hey you! Thanks for reaching out. Not everyone has the courage to “speak up” on the internet. \n\nI don’t know how old you are but judging from your comments about recently graduating I’d say you’re in your mid twenties. It is different to leave the school environment after being in it for YOUR WHOLE LIFE haha. But seriously, of course it will be different but that’s the same for everyone. It’s a new stage of life but you learn more about yourself here. \n\nThe pandemic for sure threw a wrench in this here for everyone! So again you’re not alone there either. I know for me, even though I’ve spent less time with loved ones they’ve grown more important to me. You don’t mention your family in your post so I’ll assume they aren’t much of a social connection for you. \n\nOne thing that helped me when I was around your age was actually online dating sites. People in their twenties are brave and don’t mind meeting new people but it’s just about HOW to meet them, really. Obviously members of a dating site wouldn’t be shocked to receive a message. Profiles of girls and guys will tell you if you have similarities or common interests. It’s not weird to message someone you’re not interested in to say “Hey I saw you liked this, I do also. I’m trying to make friends in a friggin pandemic do you ever game/etc?” I know it seems weird but if you can make one friend they have friends that you can make friends with etc. \n\nTo be real though, eventually it gets to be a where the only people you are meeting are coworkers. That’s life. \n\nGood luck! Best to you.", "permalink": "/r/DecidingToBeBetter/comments/kih596/i_cant_find_joy_in_anything_not_sure_what_i_can_do/ggrunr0/"}