{"id": "t5_2tand_t3_q5ewee_t1_hg7vmxt", "creation": 1633953204, "origin": "t5_2tand_t3_q5ewee", "height": 1, "replied_to": "t5_2tand_t3_q5ewee", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Sontotajer", "text": "Learning to love oneself is a very complicated thing today because when you try to research it you will come across tons of downright idiotic things like light a candle or make yourself a bath. It is criminal how unaware and lost we are when it comes to this.\nFirst thing is to understand what love towards oneself is and where does it come from. Isn't it natural to love oneself? Surprisingly no. Well at least not growing up in this society. \nWhen you are born you are a blank slate. You have no idea of love or worth or anything. So what does a baby do? I copies it's parents and their own styles of self love. Why does the baby do that? Well it makes sense. The baby sees two gods who obviously know everything about the world and it would be good to copy EVERYTHING from them, yes even their fears and complexes, in order to maximize our chance of survival. \nThat's all fine and dandy but the baby also copied all the bad stuff too. Seeing as the baby has no idea what self care and self love even means it looks to it's mother and father to learn and copy. \nNow if your mother was a emotionally mature person who knew how to love herself and respect herself you are golden. But for a lot of humanity that is just not true. \nThe way you feel about yourself now is directly connected with how you've felt with your parents. The same underlying issues that you've had in your family are the problem here. \nSo if your parents weren't supportive enough, or downright abusive it's the same to the baby. There is a bar that a parent must achieve to fulfill a baby's need. \nNow I can already hear you \"but I had great parents they gave me food they gave me a roof and shelter, they even paid for my schooling, I know they loved me.\" I am sure we all KNOW our parents loved us but how many of us really felt it? A mother can be dismissive and ignore you for the majority of the day and only read you a bed time story at night and you will feel that that is the exact amount of care you deserve. And if anything you should be better and deserve more of you mother's care.\nSee parents mostly aren't evil, they are just not good enough to create in us a stable emotional environment. And how could they? Just look the families they've come from. They never stood a chance.\nSo now you are 22 years old and left alone wondering why is there a gaping hole inside your body where self respect should be. You ask yourself \"Where did I go wrong?\" You didn't. That's very important to understand. You didn't do anything wrong. You are a product of the emotional states of your family. \nOk so how do we fix it? Good news is that it can be fixed, and even better news is that you do not need your parents to do so. \nFirst step is radical shit in perspective of your life. To achieve that we need an understanding of our life. To achieve understanding we need knowledge. \nLearn all you can about childhood emotional neglect.\nDevour all and every book until it is carved into your brain.\nLook at \"the school of life\" youtube channel to gently introduce yourself to these ideas.\nAnd never give up. Loving yourself comes from a shift in perspective when you look at your life. Loving yourself is more than a bath, it's more than a candle or chocolate. It is a profound journey of self discovery and discovering a whole new way of existing.\nIf you have amy further questions pm me and I'll help you the best I can.", "permalink": "/r/DecidingToBeBetter/comments/q5ewee/loving_myself_but_how/hg7vmxt/"}