{"id": "t5_2tand_t3_obgbio_t1_h3yvvie", "creation": 1625354043, "origin": "t5_2tand_t3_obgbio", "height": 1, "replied_to": "t5_2tand_t3_obgbio", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "YouveBeanReported", "text": "Everyone was new to driving once.  \n\nDriving is scary to start, but it's pretty intuitive. It's just adjusting to moving a big box.\n\n* You'll get a few how many feet from a fire hydrant can you be questions. Study those and anything new in book. The what is a speed limit sign questions you'll probably know. What does all yellow flashing light mean, less so.\n* Paper test in my experience was easy. You will likely pass if you gave it some study. \n* People fail driving test by being panicked, not for sucking. I'd say about 30% of my driver's ed class failed the driving test the first time, all for stress reasons and going slightly over speed, rolling over the stop line by a hair, hitting the curve while parallel parking... everyone I know passed the second time. You will likely pass. If not, you do it again in a week or two.\n\n\nActual driving; \n\n* Pick the chillest teacher you have access to. Even if that's asking a cousin over your parents.\n* Your first introduction should be someone driving you to a giant empty parking lot, and getting in the drivers seat. Learn where all the buttons are. Get comfortable.\n* It's good to put the car in park and have someone get out. Shoulder check. Find your blind zones and get an idea where they are and how big. You can also drive up to a line, till you can't see it and park, then get out to see how close you are.\n* You'll repeat this again, during parallel parking practice. \n* At that point, you should try slowly driving around the parking lot. Go through the lines, make a turn, get the feel for the car.\n* ( Try to use the same car during driving lessons if you can )\n* Opening the windows can help sorta get a sense of scale and feel. \n* You'll probably do this for 15-30 min. \n* Repeat 2-3 times as needed. \n* Eventually you'll have an idea of how to break smoothly, start, stop, turning radius. At that point move on,\n* Find a calm, residential street. The kind with lots of stop signs. Avoid rush hours. \n* Start making random loops around. Lots of stops and turns. Shoulder check as you go around parked cars. Check your mirrors.\n* Your driving test person will be fairly quiet, so ask driving instructor / parent to give you prompts like turn at the next right. \n* Also try to test 2-way stops, 3 way stops, 3 point and u turns, and round abouts if you can. Does not all have to be at once. But if it exists in your city, best to try it.\n* To get comfortable with speed, find a rural side road. Preferably paved but you'll also have to try gravel. Get up to speed, get the feeling of the car at each speed.\n* Find a 4+ lane city street at not rush hour. Practice driving at speed and changing lanes with shoulder checking. Avoid central downtown for a bit. \n* Actual freeways can be a bit scary, as it's very fast. Approach those when ready. \n* Eventually, you need to practice parallel parking. You'll want to find a calm side road and some pylons and give it several tries.\n* Also during all this, you want to pick up some more parking practice. Try pulling into empty ish parking lots at some points and pulling into empty spots with no one around, then once more comfortable empty spots in between cars.\n* If you have family events, like church or sports, you should pick up driving to them when you can (if rules allow passengers) It's good practice.\n\nRandom other stuff;\n\n* A good parent should teach you wtf to do when police pull you over, how to pump gas, go through car wash, jump a battery, change a tire and call a tow truck it needed. \n* ( Random note, your fuel gauge will have an arrow for which side the fuel tank is on )\n* At some point study what to do in an accident and your local rules. Your guide probably has a checklist. Having been in car accidents as a kid, modern cars look like shit after one but everyone comes out safe. It'll help to have a checklist so if worst happens, you'll be less panicked. \n* That being said, accidents are rare. In all likelihood it'll be a decade before you have one and it'll be like, backing up and scratching a bumper.\n* Also practice in rain and snow when you have some base comfort down. Learn the limits of your car. Breaking in a downpour is different then dry weather. \n* Also practice in dusk / dawn and dark once you have base comfort down. Driving at night is a bit to adjust to.\n* If your city has notoriously confusing spots, look up a map and give those a test at some point. You'll probably go around them for ages. \n* Don't use your fucking phone while driving. If you need to use Google maps, pull over. It can be a like $500+ fine and the second most dangerous thing you can do.\n* Don't drink and drive. This is the most dangerous. Also most places are 0% tolerance for 2-3 years. So keep in mind for like, drinking at Christmas family dinner if you drive home. \n* If your sleepy, you are a dangerous driver. On long road trips swap out and take breaks and get up and walk around.\n* Download offline map data for your area for your phone's map app, just in case. \n*  Dont park on wet grass. Your car will sink. If you do get stuck in snow or mud, floor mats can be used to try to get traction by rolling car onto them. Don't park on beach either for similar reasons. \n* Don't drive through water that is more then ankle height, if water gets in engine it's bad. Also flooded roads can carry a car. Generally this means if flood watch is on, try to avoid underpasses. This will almost never come up, but good to know. \n* If your area has ice roads only use them when fully open and after studying rules. Every year one dumbass loses a car and that is EXPENSIVE. \n* Any time you get a new car or borrow or rent one, take a few moments to drive around the lot and just get used to it and how it breaks and stuff. Every car is slightly different in feel.", "permalink": "/r/DecidingToBeBetter/comments/obgbio/starting_to_learn_driving_and_getting_over_my/h3yvvie/"}