{"id": "t5_2tand_t3_a9ddb2_t1_ef8klro", "creation": 1548739469, "origin": "t5_2tand_t3_a9ddb2", "height": 1, "replied_to": "t5_2tand_t3_a9ddb2", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "exoticnoodle3", "text": "I’m sure you won’t read this because it’s been a while since you posted but I thought you might appreciate this story.\n\nBoth my parents were junkies. Like every drug under the sun, steal from your parents, get arrested in Mexico (all of these examples actually happened to my parents) kind of people. They did every drug, but meth was their vice. \n\nMy mom was crazy. She was locked up in a mental hospital when she was a teenager for trying to kill herself. She had/has crippling anxiety and paranoia. She tried every drug and lived a life of crime staying at random people’s apartments to hide from the people who loved her.\n\nThen she got pregnant from her on and off again meth head boyfriend. I’m the result of that. She is 22 years clean, this year (I’m 21 and she stopped using when she decided to keep the baby).\n\nMy mom broke up with her meth head boyfriend.  She got a job at a shitty gas station, and started to TRY to be clean and sober.  We lived with her parents while she got her shit together. She got her GED. Then she got her bachelors degree while I went to class with her in a baby carrier her freshman year. I remember her 24th birthday, it was during her finals week and she couldn’t come out to play but my grandparents and I got her a cake anyway.\n\nShe graduated. We moved out of her parents house and life slowly, slowly got better. We started sharing a one bedroom apartment, in a bunk bed. I didn’t realize that was weird, I just knew it was moms first apartment and I was happy because she was happy. Eventually she got a good job and bought a little condo in the suburbs, where I spent most of my time growing up. 8 years clean. While we were there, she studied for her masters degree. It took 6 years, but she did it. I graduated high school the same year. \n\nNow, she owns a nice house by herself. She put me through college, and bought me a brand new car. Some things will never be the same because of the trauma she suffered as a young person, but she is really living her best life. Yoga in the evenings, brunch on the weekends, putting her kid through college, happy as she can be. \n\nIf she can do it, you can do it, and life is so much better CLEAN.", "permalink": "/r/DecidingToBeBetter/comments/a9ddb2/day_1_of_quitting_meth_wish_me_luck/ef8klro/"}