{"id": "t5_2tand_t3_a9ddb2_t1_ecjbqq3", "creation": 1545766370, "origin": "t5_2tand_t3_a9ddb2", "height": 1, "replied_to": "t5_2tand_t3_a9ddb2", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "theshizzler", "text": "'#14 Be kind' is the most important one in this list, but not in the way you think.\n\nIt's nice to do things for other people. Think about how it feels to do nice things for people. It could be as small as putting away a cart for an elderly person in the grocery store parking lot. It could be doing the dishes for your mom. It could be asking someone looking confused on the street if they're lost. Just think about that small little good feeling you get from doing those sorts of things.\n\nNow imagine yourself, Dave, in five years.  He's not quite a stranger, but he's also not quite you. He's a different person. Treat him like one. Treat him like the old lady in the parking lot or the confused tourist or whomever, but be kind to him. Do favors for him. Do nice things for him. Trust me, he will appreciate it.\n\nRight now think to yourself 'what is the nicest thing I could do for Future Dave each day'. For future me, it's talking my medicines. For you it could be going for a walk or preparing dinner instead of eating fast food. Whatever it is, be cheesy and basic about it.  Write it down and put it where you'll see it every day until it becomes a habit to think it at least once everyday. And when it comes to other decisions, try to ask yourself again 'what is the nicest thing, the most kind choice, the favor I could do right now for Future Dave'. One night it might be a nice thing for him if you turned in early and got some bonus sleep instead of staying at the club and rolling again. That's your call to make.\n\nThis extends to being empathetic. Be empathetic to Past Dave. Don't beat him up. Understand the circumstances that led him to start doing meth. Understand why he did it. His situation might not have been unavoidable, but give him the benefit of the doubt. He didn't know what you know now. You don't know what Future Dave will know either and that's okay. We learn by experience.\n\nHopefully, in the future, Future Dave will be able to look back at you as you were today and feel good. Maybe even gratitude. And remember then that even if things didn't turn out perfect, at least you'll be able to say 'I didn't know what I know now, but at least he was trying to help me out. I appreciate him for trying. What a good guy.'", "permalink": "/r/DecidingToBeBetter/comments/a9ddb2/day_1_of_quitting_meth_wish_me_luck/ecjbqq3/"}