{"id": "t5_2tand_t3_l9k23w_t1_glinf0w", "creation": 1612125759, "origin": "t5_2tand_t3_l9k23w", "height": 1, "replied_to": "t5_2tand_t3_l9k23w", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "nastyyynico", "text": "Well, to be clear, I'm already fat! I'm just much less fat than I was before lol... But I'm absolutely not ugly.\n\nI'm at the point where I've run the spectrum: I've been bigger, I've been smaller. I've had high self esteem, I've had low self esteem. Friends and a social life and also no friends and no social life. I do realize that this little to do with my overall appearance and more to do with my convictions and attitudes (things that I will be forever modifying and working on).\n\nMy social life/relationship with my peers has been kind of sucky and inconsistent throughout my entire 20's (my fault, but I'm woking on it). I've been unwell.\n\nThere's actually a lot of backstory I'm glossing over. I grew up being praised and rewarded for my appearance on a near constant basis, receiving special treatment by all (just as long as I stayed in shape and didn't gain a pound) - which, trained me to believe that my worth was based on my looks and my size. It went in the opposite direction too, I was criticized, nagged, and ridiculed (BY ALL) for eating certain things or having a pimple or experiencing fluctuations in weight. Then in my late teens through my mid 20's I found myself in a very intense, abusive relationship where I developed mysterious chronic illnesses. Then I got myself out of that, got the help I needed, transformed my life through therapy, diet, lifestyle, and a passion for health, wellness, and nutrition.\n\nSo here I am now: 80% a real go-getter, 20% a meek, weak, coward. I try to be impeccable in my skin care routine, my clothing/style, my social circle/friend choices... I've even made a drastic career change - from the arts/fashion to healthcare (I'm working on getting into nursing school so I can become a NP)... But this seemingly small thing... my weight...\n\nI feel like it's the key to everything else. It's the missing piece of my puzzle. It's the thing that will complete the vision of health and wellness for me. It's the qualifier.\n\nI'm scared to go to the gym to work on my weight because of my weight. I'm scared to go to nursing school with this weight. I'm scared to be a fat nurse. I'm scared to enter into a serious relationship because of my weight (but as a sex and love addict I'll happily take any emotionally unavailable partner, because I know it won't last, so there's no need to be at my peak).\n\nIt's a VERY weird dynamic, I know. I don't want to be heavy anymore, I want to be fit and have a certain lifestyle and not be afraid of anybody or anything. But I'm afraid I'll experience more emotional hurt and pain and ridicule if I publicly try or tell anybody or show anybody what I'm doing. I'm afraid of failure. If I fail at this, I feel I'll fail at everything.\n\nI'm SO sorry, I know that was a lot. I guess you just asked me the right question because all of this came out so naturally.\n\nThank you for listening.", "permalink": "/r/DecidingToBeBetter/comments/l9k23w/im_almost_there_the_discomfort_of_staying_the/glinf0w/"}