{"id": "t5_2qh5i_t3_nbatzc_t1_gxzzisw", "creation": 1620926003, "origin": "t5_2qh5i_t3_nbatzc", "height": 1, "replied_to": "t5_2qh5i_t3_nbatzc", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CaitlinH567", "text": "Aww thank you:) I have been bullied and called fat, ugly, annoying, and unattractive, but i can deal with that criticism now. I know that the word “fat” isn’t a bad word and these don’t represent me. These represent the judgmental mindset these people have towards others and themselves and their perception of me in their distorted reality is not my problem. I understand, I’ve had many people in my life criticize my body. I’ve also realized that there isn’t a normal weight or body type that fits everyone. You’re weight actually doesn’t matter it’s just a number, what actually represents your health is your lifestyle. Eating a variety of foods you enjoy and exercising how you like without shaming yourself for anything. There’s also no such thing as a “food addict”. That was just created by society and diet culture because the effects of dieting and restricting cause our bodies to just want those foods more because we’re restricting them you know? I used to feel like a “food addict” but once i started listening to what my body wants/needs and i ate those foods and everything, i slowly stopped feeling out of control around food. Healing your relationship with food has nothing to do with what you look like and your weight at all, it’s about your mentality around food and everything will fall into place eventually. It’s not easy and I’m someone who is very anti diet because the diet industry only harms peoples lives. Also, the BMI system is completely useless and wrong. I’m sorry if any of this came across as harsh, i just really get upset when i see people falling into the same harmful talk that i used to be in. But it’s so great that you are comfortable in your skin no matter what!! Your health and body size do not dictate the respect and love you inherently deserve:)", "permalink": "/r/happy/comments/nbatzc/ive_struggled_with_body_confidence_and_eating/gxzzisw/"}