{"id": "t5_2qh5i_t3_nbatzc_t1_gxzjcpx", "creation": 1620919156, "origin": "t5_2qh5i_t3_nbatzc", "height": 1, "replied_to": "t5_2qh5i_t3_nbatzc", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CaitlinH567", "text": "Just some thoughts about loving myself that were too long to fit into the post that i also think will help other people too:)\n\nSociety can tell me all it wants that something is “wrong” with me. People can tell me all they want that they think I’m unattractive or annoying. They can hit my biggest insecurities, but what they don’t know is that I’ve been able to find peace, contentment, neutrality, and love within myself. They haven’t and continue to try and stop others from doing so. I’m not going to allow these people filled with hatred towards themselves decide who i am because they have no idea who i am and they have no control over me. They don’t realize that i have accepted me for who i am and their unnecessary comments are just words that hold no meaning to me. I don’t need their acceptance, validation, or attention in order to love myself because I’ve done that on my own. They also don’t realize that I’m not on this earth to be palatable and attractive to other people or at all. My physical features do not dictate the amount of respect i inherently deserve. They can say the worst things to me but it’s all just filled with nothing but judgement towards themselves. They are the ones with a closed judgmental mind that has fallen into the trap that society has placed. Beauty standards have been made up for decades so that the diet industry can profit off of people’s insecurities. Everybody has different body types and features and there is no way that we can all fit into a tiny box labeled “beauty”. We attach our self-worth to our physical features and are told that we can’t be confident until society has “allowed” us to. There is nothing wrong with loving yourself, but there is so much wrong with listening to people telling you to hate yourself. We would all be so unconditionally beautiful inside and out if we allowed ourselves to naturally be who we are. It’s ok to be who you are.", "permalink": "/r/happy/comments/nbatzc/ive_struggled_with_body_confidence_and_eating/gxzjcpx/"}