{"id": "t5_2tand_t3_e94og9_t1_fakf0sw", "creation": 1576166007, "origin": "t5_2tand_t3_e94og9", "height": 1, "replied_to": "t5_2tand_t3_e94og9", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bontbont999", "text": "I'm Chinese and I also went through a socially awkward phase in my life. I don't think you should be so hard on yourself in this social interaction. You don't need to say the \"right\" or \"funny\" thing with your coworkers, you just need to be yourself.  If they are talking about something like how cold it is, and you can say, yeah it really is cold outside, I hope it warms up soon or something. And you guys can add on to the topic or the conversation will evolve into something else. Or if you don't want to do, you don't have to say anything, you're not obligated to join every conversation they have you know? \n\nIn terms of talking loudly or softly, take cues from your surroundings. Since you were playing pool, I'm assuming the people there were talking in a normal tone, so you can follow that. If you're in a place where people are talking loudly, then you would have to talk loudly because people can't hear you because it is so loud. \n\nFor smiling or laughing, if something makes you laugh, then laugh! Unless they say something inappropriate then I wouldn't laugh or smile.\n\nIf your words are not clear, then just repeat yourself again, it's not a big deal if you have to repeat yourself, I've done it many times. I think for this part, you just need to keep talking to people and get comfortable with talking to people and over time  you will improve your conversational skills and feel better about yourself. In the beginning, it will be uncomfortable  and there will be times when you regret what you said but that's life. Everybody has said something they regretted, I know I did. But you learn from those mistakes and you keep moving forward. When you do these things, remember that you are taking a risk and moving forward and acknowledge your progress, no matter how small they are because you moved outside your comfort zone.\n\nHope this helps!", "permalink": "/r/DecidingToBeBetter/comments/e94og9/why_i_am_so_social_inept/fakf0sw/"}