{"id": "t5_2tand_t3_qdfhgn_t1_hho6sx1", "creation": 1634938345, "origin": "t5_2tand_t3_qdfhgn", "height": 1, "replied_to": "t5_2tand_t3_qdfhgn", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Yelyn", "text": "Your parents are offering you some unspoken wisdom. After a few years, you will feel stuck in a rut with work, video games, tv shows - the work is obviously necessary for a multitude of reasons, and the other two are great diversions when you’re feeling spent and need to relax. They don’t help you to grow very much, though, since consuming entertainment is not the equivalent of discovering yourself, or bettering yourself and others, or the world around you. They want you to truly experience all the joys and sorrows of life which is gained through connection with other people and a well developed sense of self. \n\nJust start doing things! It’s so exciting to start new things, and be bad at them, and improve, and become amazing (or just okay!) Workshops at your local community college, or library; sign up for a sport at your local rec center, or join a gym and take group fitness classes. Go travel for a long weekend, visit other cities, go to museums, sign up for group tours. Go alone or with a friend. Go to open mic nights downtown, or find a comedy club. See if there’s a First Friday near you with open art gallery nights. Join a running club, or just start taking long walks daily. Open some books and try out other people’s ideas. \n\nYou’re 20! You have so much energy now, and for the next 2 decades before it starts to dwindle! You can wake up without chronic pain trying to keep you in bed! Go live and experience as much as you can. You’ll be better for it. All the experiences will start to pile up and help you to determine who you can (and can’t) be. You won’t believe what you’re capable of until you dive headfirst into something that truly captivates you!\n\nI’m hopeful and so excited for you! I think about my past two decades and all the cool adventures and amazing new talents I stoked. I’m so happy to read, play video games, and watch shows when I’m not feeling energetic enough for hobbies, but I’m so glad I did a multitude of things while I had the time and energy.", "permalink": "/r/DecidingToBeBetter/comments/qdfhgn/i_dont_have_any_useful_hobby_that_i_can_practice/hho6sx1/"}