{"id": "t5_2tand_t3_qdfhgn_t1_hhn1nsy", "creation": 1634921196, "origin": "t5_2tand_t3_qdfhgn", "height": 1, "replied_to": "t5_2tand_t3_qdfhgn", "down_vote": 0, "up_vote": 12, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NinjaKnight92", "text": ">my main hobbies rn are learning\n\nAs far as I'm concerned \"Learning is the best hobby anybody can have.\" And having a strong passion for learning is one of the best things that can help push you into new experiences, trying new things, and find joy in life.\n\n&#x200B;\n\nHey there! It's cool that you're thinking about this now, but I'm going to encourage you to pump the breaks on some of this harmful thinking.   \nFirst things first, there's nothing wrong with having a hobby for the sake of having a hobby. Not every hobby needs to be a lucrative side hustle. It's always good to be productive, but don't let the pressure of being productive stop you from slowing down to smell the roses from time to time.  \n\n\nSecond, This was mentioned by somebody else but I'd also like to iterate that now is a great time to take up a hobby involving physical fitness. I'm not saying you need to join a sports team or start hitting the gym every day, but having something that gets you out of the house and gets your blood pumping is a boon for both your physical health and mental health.  \n\n\nThird, You seem to like tinkering with electronics. This can be a useful skill to have, but obviously, the barrier to entry can be rather high as far as monetary investment is concerned.  \nYou mentioned you like video gaming, so you should take a look at [PC Building Simulator on the Steam Store](https://store.steampowered.com/app/621060/PC_Building_Simulator/). A few hours in this and you'll have the chance to familiarize yourself with the interworkings of a PC if you haven't had the chance to already. And if you decide that it's something that you want to make a career out of, It will give you a baseline knowledge to sound somewhat intelligible for an entry-level position in PC repair.  \n\n\nAnother thing you may look into is game controller repair. Gamers tend to hold on to their busted controllers, and there a plenty of tutorials online on how to fix almost any controller. Their less expensive and less complicated than both smartphones or computers So it might be an interesting way to dip your feet into the water to see if you want to take up electronics repair.\n\n  \nAnyhow. I hope you found this helpful! There seems to be a lot of kind folks willing to offer you good advice here.", "permalink": "/r/DecidingToBeBetter/comments/qdfhgn/i_dont_have_any_useful_hobby_that_i_can_practice/hhn1nsy/"}