{"id": "t5_2tand_t3_bomu9b_t1_enx29em", "creation": 1558108430, "origin": "t5_2tand_t3_bomu9b", "height": 1, "replied_to": "t5_2tand_t3_bomu9b", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Eddie-knows-wrong", "text": "i also am a daily user of an addiction but a lot worse meth. I lost my 10 year long career as a law enforcement officer because of this addiction that has ruined my marriage and people i still love .\n\n&#x200B;\n\nBefore becoming an officer  i safely finished a long 8 years to our country and core as a honorable us Marine , returned in one piece after 2 deployments , Afghanistan then Iraq.. i am just now opening up to the help from my VA benefits and admitted to my addiction for the 1st time in six long  years after struggling to get right... I   continue to use because of the way it numbs me from thinking about my daily family struggles and how i ended up this way ....at only 37 years old. . \n\n&#x200B;\n\nIf you met me on  street it would never even cross your mind that i am a daily user .... I am also  not proud to say that in any way  , because i am here for help and nothing else but your advise...today  I excepted and built up the courage inside to tell you about my addiction and how it has ruined everyone that loves me to the present day. it was about 6 months ago i verbally notified my doctor of my addiction to dope and asked to seek help for myself It has  been a struggle from the time i resigned my job because of the continuous issues I was having  of showing up late to work and stressed out with the thought that it was a possibility of getting fired for my drug addiction with  random  drug test .\n\n&#x200B;\n\n&#x200B;\n\nwell i even put myself in some small legal issues of breaking the law and now 4 years currently still attending court to get rid of the charges being pressed on me ...i have trail soon but the good thing is i am time served now.... anyways i unemployed and  living with mom,  and just hope that here i can make some sort of positive connection to help me quit and get back to being the man my mother was so proud of at one point in her life.........", "permalink": "/r/DecidingToBeBetter/comments/bomu9b/72_days_clean_found_some_coke/enx29em/"}