{"id": "t5_2tand_t3_n6y16k_t1_gxa7l5z", "creation": 1620401230, "origin": "t5_2tand_t3_n6y16k", "height": 1, "replied_to": "t5_2tand_t3_n6y16k", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NetScr1be", "text": "This is awesome.\n\nWhat we focus on becomes our reality. It just takes time.\n\nI've been clean for 30 years which allowed me to become depression-free 23 years ago.\n\nThat seven-year gap sucked. But I kept working through all the pitfalls and setbacks.\n\nOne of the ways people trip up is expectations.\n\nIn this case, the working definition of an expectation is an emotional attachment to a particular outcome.\n\nWe tie our future happiness/peace of mind to this one thing and start an internal dialogue about how that better happen or we will react negatively.\n\nIn the case of addiction, people will use a relapse as an excuse to keep using.\n\nIf we are looking for an excuse to do something it doesn't have to be a good one. Any stupid, cheap, dirty excuse will do.\n\nExpectations can be based on misconceptions.\n\nA common one is a misconception set up by the language used surrounding commitment.\n\nWe speak of commitment in the singular almost exclusively.\n\n\"I'm going to make _a_ commitment to ...\"\n\nAnything worth doing is difficult, takes longer and requires more effort and resources than we think.\n\nThere are pitfalls, setbacks, mistakes and days where we just plain old don't feel like doing it (or just don't have it in us).\n\nMaking a commitment (there's the singular again) is the _beginning_ of the process. The real work isn't even begun at that point.\n\nDoing something difficult generally entails various forms of failure. We make a commitment to a goal but don't include the commitment to recommit after the failure.\n\nI would love to tell some wonderful recovery story about the progress that got me where I am.\n\nThe reality is ugly, contains periods of darkness and misery and is simply me getting up one more time than I was knocked down.\n\nThe same fuck-everybody stubbornness that fueled my refusal to conform and enable various negative behaviours was repurposed and used to keep going (or restart) after whatever form of failure just occurred.\n\nGrowth and change **begin** at the outer limits of our comfort zone.\n\nIs it scary, strange and awkward? You're right where you need to be. Keep going.\n\nThe urge to retreat back to the familiar, sick behaviour will be strong. Take the power from that and point it in the direction of the goal.\n\nI'm not special. I'm just someone whose commitment to getting better attracted enough of the right resources needed to animism that goal then stumbled and fumbled their way across the line.\n\nThere comes a tipping point where the healthy, positive behaviours are stronger than the negative ones.\n\nThat is not to say the negative ones cease to exist. They will always be there and will happily come roaring back whenever we allow that.\n\nWith each new attempt comes ba little more knowledge, skill and experience.\n\nThat is not lost with a failure.\n\nCommit to the goal. The commit to recommit as often as necessary. Frequent reaffirmation of the goal is helpful.\n\nAt times it will seem the whole universe is against you. Rub some fuck you on that. Stand your ground. Find a way or make a way to take that next step forward.\n\nDon't quit. Don't give up.\n\nIf you do, recommit.", "permalink": "/r/DecidingToBeBetter/comments/n6y16k/where_i_want_to_be_sober_productive_and_healthy/gxa7l5z/"}