{"id": "t5_2tand_t3_nnkakj_t1_gzxlkad", "creation": 1622339510, "origin": "t5_2tand_t3_nnkakj", "height": 1, "replied_to": "t5_2tand_t3_nnkakj", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Electronic_Lychee339", "text": "I feel you 100% that story definitely is similar to mines and I’m glad you were able to recognize these patterns. I’m happy you were wise enough to understand those patterns and make a change , with the whole one foot in/one foot out lifestyle it can give us an effect of feeling badass but you and I know both know - when you’re in that lifestyle it’s already standard to know anything can happen at anytime. These things in our subconscious mind leak outward I believe and only a matter of time until you see it in real life. The things we do truly have an effect on our futures and situations around us. I always got that same sense of feeling like I was in goodfellas too lol, it was a movie but just like you said - anyone I was around in those days, they are gone. Some passed away, some are serving life in jail and they are barely a few years younger than me. One of my main contacts was an honor roll student who once wanted to be gangster so bad, he got what he wanted. He’s now facing 50 years in jail at the minimum and only 27, twice the time he’s been alive. Including one of my brothers who brought me into the lifestyle, he’s off for the long haul. Nowadays being “gangster” or a boss to me is taking care of your loved ones and taking care of yourself. The energy is definitely real and the change definitely comes from within, we get so bombarded with money and greed that we do anything we can to get it. Taking shortcuts just sets people back for the even longer haul. I’m glad you’re safe and able to share your message here with us, the simple fact you were able to recognize that shows me you have the future in your hands as many people in the lifestyle can’t break down the patterns and get stuck as I did also at a point. Sometimes we’ve got to put our pride aside and move calculated, and always reach far - even further than you think. My experience from life is be careful what you wish for because it’s likely you will get it. Stay blessed and wishing you a great and positive life.", "permalink": "/r/DecidingToBeBetter/comments/nnkakj/life_lessons_from_the_black_sheep_of_society/gzxlkad/"}