{"id": "t5_2tand_t3_nnkakj_t1_gzxgk6d", "creation": 1622336497, "origin": "t5_2tand_t3_nnkakj", "height": 1, "replied_to": "t5_2tand_t3_nnkakj", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Electronic_Lychee339", "text": "When I started off it was a lot of finesse I will tell you that, I really faked it till I made it. In the backend I was studying everyday and had this mind-state, any task I needed to do - it was possible to learn quickly if I just put a little time in and studied it. The first website I built was an e-commerce market place where multiple vendors could sell their products, with automated commissions and more and I had no idea what I was doing initially. Just determined and with trust dusty Google by my side I was going to make it happen once I knew what the client wanted. Plus Wordpress has a plug-in for just about every situation. We have everything at our disposal with the privilege of Google searches and YouTube. Nowadays I’ve become so proficient that when I get on the phone with a client, I already know I’m closing the deal. I once took a greyhound to an entire different city to have dinner with a client and close a deal, I was determined to close it & did. \n\nIf your client has a little bit of knowledge on what they want it’s great to note specific things they mention in small moments or the first call/conversation and use that to your benefit, keep notes. \n\nIf they don’t have much knowledge and don’t know what they want you get the opportunity to become their brand strategist and tell them what they need. It’s all about tools nowadays and when it comes to marketing at the core everyone just wants leads, traffic, etc. Here’s a couple of tools to look at to help you.\n\n- SEM Rush (Research/Competitor Analysis & Much More)\n- Google My Business (Powerful Local Listing Feature)\n- Envato Elements (Endless Graphic, video, template Resources And Etc - don’t have to work from scratch)\n- QuillBot (rewrite articles using AI)\n- AWS Lightsail or AWS in General (Amazon Web Services to host scalable backend server infrastructure & more instantly - def look into this on the tech side)\n\nData is powerful and when someone’s recognizes your level of expertise they will want to work with you only. Imagine showing a potential client their competitors entire marketing strategy down to their ads, keyword approach, traffic sources, back link sources & more - it holds a lot of value. It’s hard to find reliable marketing specialists who they feel they can connect with, without feeling like another number. There’s many points but essentially - either let them do the talking and tell you what they want/just listen or spoon feed it to them and let them know what they need simply put. If you have any questions I’m always here to help, trust in your expertise and/or ability.", "permalink": "/r/DecidingToBeBetter/comments/nnkakj/life_lessons_from_the_black_sheep_of_society/gzxgk6d/"}