{"id": "t5_2tand_t3_pzw9zy_t1_hf4hodq", "creation": 1633197965, "origin": "t5_2tand_t3_pzw9zy", "height": 1, "replied_to": "t5_2tand_t3_pzw9zy", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "noahbug545", "text": "Oh absolutely, I used to have a fear of failure (sometimes I still do) but for the past 2-3 years there has been a lot less. The reason why so many people fear failure is the environment we are in, there is the social stigma that if your good at something then it will be easy, which simply isn’t the case. Failure can also be seen as weakness but its not weak whatsoever, as long as you’re putting forth an honest effort, that’s what matters. I could go to the gym & not be able to lift a lot & feel like a failure around the rest of the gym-goers but at the end of the day, I’m doing it, I’m the one getting up, making the conscious decision & deciding I’m gonna go workout. You’ve already done more than someone who hasn’t done anything or taken initiative. Failure is natural, in fact, promote failure! Failure means growth, hard times means growth, falling to get back up & try again is growth. Good things don’t come easy, notice how it’s super hard to build something up but so easy to tear it down? It’s like dominoes, spending hours to set them up & if one domino goes down, your hours go down in seconds. Welcome failure, invite into your life, then you will experience true growth. Walt Disney was fired from Kansas City Star because they said he “lacked imagination & creative ideas” look at him now. Stephen King, his first book Carrie was rejected 30 times, then he threw it away but his wife told him to resubmit it & it turned into his first book deal. Everyone fails, if it has a pulse, it’s failed before. However, society doesn’t highlight that, it highlights the good thus giving everyone the preconceived notion that “oh he is a natural, it was so easy for him, why is it hard for me” when in reality that person failed many times to get where they are at today. \n\nLong long paragraph, apologies but I love stomping fear out. Keep your chin up, fear is your friend, not your enemy. Welcome it & learn from it & you’ll be unstoppable. Blessing to ya 💪🏻", "permalink": "/r/DecidingToBeBetter/comments/pzw9zy/i_think_i_might_have_identified_my_biggest_flaw/hf4hodq/"}