{"id": "t5_2qpzs_t3_px9goi", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I see my peers achieving A's here and there without even trying and it makes me envious, makes me acknowledge over and over that God really has favorites. I'm taking up asynchronous online classes, this should be a piece of cake considering I basically have google at the tip of my hands but still I managed to fail a science exam. But guess what? I decided not to depend on Google and decide to act like a goodie tooshoes. I shouldn't be. I should have cheated with my all. God! I was the only one who failed that test, and I even gave people the first impression that I was gonna be one of the overachievers.\n\nI feel so overly ashamed, and I feel the depression coming back all over again to guilt me into not killing myself sooner.\n\nMy future even feels so blurry. How can I make it to become a future electrical engineer when school has officially certified me as one of the stupidest people alive? Not only for failing a test I crammed so hard for but also for having to repeat ninth grade because I thought I could make it, I can still achieve a bright future. \n\nBut what now? I seem to be failing academically because my mood swings keep reminding me that I am a walking bipolar disaster.\n\nTo live is to suffer. I've been suffering since I got my trauma. Damn. 18 years of a neverending rollercoasting of suffering. I just want to feel like I belong somewhere, in someone. Why don't I feel like a teenager, instead I feel twice a decade older trying to fit in being an 11th grade student? If God really loves everyone and everything then why are there people suffering? Fml, no, fuck this tortorous experience called life. I hate to say this but I wish I never been born in a lower middle class family full of emotional and unambitious people at all.", "url": "https://www.reddit.com/r/SuicideWatch/comments/px9goi/k12_makes_me_lose_faith_in_humanity/", "title": "K-12 makes me lose faith in humanity", "social_network": "reddit", "user": "schizhoe", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1632844753, "permalink": "/r/SuicideWatch/comments/px9goi/k12_makes_me_lose_faith_in_humanity/", "nsfw": false, "first_save": 1635427638.204278, "replies_charged": false}