{"id": "t5_2qpzs_t3_pqxgl6", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "Hey there!\n\n&#x200B;\n\nI have a diagnosed Shizophrenia and a diagnoses chronical depressiion as well as diagnosed ADHd.\n\nAdditionally i have symtpoms of Aspergers and Borderline without actually having the entire \"thing\".\n\nAll I know since I grew up is pain, rejection and suffering. No matter what I tried, it hurt, it was painful, I suffered.\n\nSchool was horrible.\n\nAll work places i've ever been at have been horrible.\n\nI've spent months in therapy and hospitals doing local therapy  from dawn to dusk. \n\nIt all did nothing but bring me great pain and suffering. Life is an endless torture for me. Nothing works. Nothing helps. Even now I have a bunch of doctors I regularly visit around twice a month and they are incapable of helping me which is nothing new. All doctors I ever had before were never capable of helping me out. \n\nI've tried bettering myself by being the hardest for me. Daily workout. Tight schedule. No mercy. Everything planned through and through. Veggies, 8 hours of sleep every day, fruits. No softdrinks, lots of water and so on. I don't smoke, never have. I don't drink, never have. \n\nI am fit and healthy and yet I hate my doctors, nobody can help me with anything, I am unable to emotionally connect to a single human being, I feel like an alien born into a fucking torture chamber.\n\nAnd the worst is there's nobody at fault. Humans are just humans and I feel like I simply do not belong in this fucking galaxy. I've been suicidal before. \n\nBut right now i'm not suicidal at all yet I have no fcking idea where to ask for help anymore. All hope is lost for me. I am so angry all the fucking time that I'd rather completely kill myself by breaking myself down by doing too much. I am tired of sitting around. If I die, I will not be in self-pity but because my body lost to my willpower. \n\nI fkcing hate everything so much. I just want this endless torment to stop. But Nothing works. Nobody helps. Feels like living in a simulation with NPCs. \n\nOh and I moved. I moved hundreds of kilometers from city to city. 0 difference. All the people are all the same. \n\nThe pain never stops. But I will keep asking. Anything in this universe must be capable of having any idea how I can stop the endless suffering without suicide. I actually want to find love for fucking once. I'm like 25 years now I think and have never been in love before. \n\nAnd stop sending me this dumb anti-suicide bot. I've seen more psychatries and doctors in my life than fucking supermarket employees. It works for others but not for me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pqxgl6/lost_in_life_held_alive_by_pure_anger/", "title": "Lost in life- held alive by pure anger", "social_network": "reddit", "user": "Fegor224422", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1632009881, "permalink": "/r/SuicideWatch/comments/pqxgl6/lost_in_life_held_alive_by_pure_anger/", "nsfw": false, "first_save": 1635426813.9422312, "replies_charged": false}