{"id": "t5_2qpzs_t3_lcofxw", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "I'm done. Nothing works. I've been in therapy for a decade, taken all the pills the doctor shove at me and nothing fucking works. Therapy is fucking useless, I always get the same meaningless advice, \"eat vegetables!!! Go for a walk!!!!\" Like it's that fucking easy, I could get the same fucking advice from my 90 year old grandmother for free. \"Life is worth living!!!\" No it's fucking not, it's full of fucking pain and misery with brief moments of mediocrity and fleeting moments of something barely resembling happiness. \"Suicide is a permanent solution to a temporary problem!!!\" Fuck off. Fuck. Off. Is it temporary if it's lasted your entire fucking life? Is it really temporary if you've been suffering from this shit since you were a baby, like me? I started self harming at the age of 2 years old for Christ's sake. I've wasted thousands of dollars on this shit and it doesn't fucking work. I know what the solution to my problem is, I can't do this for another fucking 40 years. I can't even tell anyone about my suicidal tendencies, because they'll throw me into the fucking psych ward which is barely better than a prison. Trapped up there for 24 hours a day, surrounded by people who won't leave me the fuck alone, doctors who won't fucking listen to me, endless boredom. I pretend to be fine as soon as I get there so they'll release me ASAP, because it doesn't do fucking anything. I'm pointless, I am worthless, I don't do anything except lay in bed. I don't shower for weeks on end, I live in filth and garbage, I have no friends and don't even fucking want them at this point, because I can't stand being around other people. Even when I make a venting post online, strangers ignore it, because nobody really fucking cares about me. I fucking hate being alive.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lcofxw/i_will_never_get_better_and_i_have_accepted_that/", "title": "I will never get better and I have accepted that", "social_network": "reddit", "user": "fishdonthavefeeling", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1612468544, "permalink": "/r/SuicideWatch/comments/lcofxw/i_will_never_get_better_and_i_have_accepted_that/", "nsfw": false, "first_save": 1635427079.976541, "replies_charged": false}