{"id": "t5_2qpzs_t3_cutkd9", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "Apologies for the length of this post, but I feel that I have finally exhausted my mental resources.\n\nAll of my life I have battled against melancholy and low self-esteem. When I was 20, I succumbed to it by overindulging in alcoholism and self-pity, dropping out of university. I decided, however, that this would only destroy me and so I went back to get my degree in a humanities field. I dedicated myself utterly to my field, at the expense of social development; I had developed a monastic level of discipline. I ended up excelling; I topped my class and won an overseas scholarship. I was overjoyed. I thought I had at last built up such strength. But it was a castle built on sand. The course was something I was utterly unprepared for, and though I passed, it felt more like a lost battle than a victory. Performance anxiety and loneliness took a huge toll on me, and I lost my ability to perform in my field. One of my academic supervisors frankly told me that I didn’t have the mental toughness to succeed in my field. I returned home in a state of despair. I feel so foolish for having bought into a lie, and to a greater extent, I feel as though I have lost my identity. This was something I was supposed to excel at, and yet I have achieved nothing with it. People mock me for my past commitment, and make references to the discrepancy between my past and present. I am grateful to be employed currently, but it has nothing to do with my learning; it was blind luck that I was hired. I am still living at home at the age of 26. I feel only regret about something I was once so proud of.\n\nI have been single for the majority of my adult life. Around this time last year, I met the woman who would become my first girlfriend at age 25. She was everything I could ever want in a partner. I considered myself so fortunate to have met someone who could understand me. I confessed to her that I struggled with intimacy, but she seemed to accept it. We were both humanities students, and though I had no interest in the field any longer, I helped her with her thesis and attended any seminar at which she spoke. I bought her books related to her topic. One of my dearest wishes was to watch her walk across the stage and be awarded her doctorate. Being alone, I had simple hopes for our bond. I wanted somebody with whom I could discuss literature, watch foreign films, and cook interesting meals with. Being starved of human companionship for so long, I savoured the simple things. \n\nAt the beginning of this year, she broke up with me. She had told before she was bisexual, and she cited that she had a preference for women and wished to pursue those opportunities. She also claimed there were also other reasons. Her grandfather passed away, but she asked me to keep away the mourning process and give her space. I wanted to respect her boundaries, so I did as she asked. When she broke up with me, she cited my emotional unavailability and lack affection as one of her reasons for breaking up with me. I was shocked, as she had only met her grandfather once, and had mentioned no prior affection for him. She also stated that if I felt wronged by her thoughts, she would walk away ad never see me again. Being the only human connection I had made in half a decade, I caved. Although I was devastated, I did not feel it was right to tie her to me and despite the shedding of many tears on my part (none on hers), I let her go so she could follow her innermost feelings. \n\nToday, I discovered that she has been seeing a man, and is going on a holiday with him. The main reason she had for breaking up with me, the fact that I was not a woman, was totally false. I let her go because I believed in her bisexuality, and I loved her so much that I wanted to see her happy. I had hoped we could remain friends. If I had known she was in two minds, I would have fought so much harder to keep her. She witnessed me break down in front of her, and yet it made no impression. I feel sickened that a person I poured my most intimate thoughts out to could deceive me in such a fashion.\n\nIn my personal and professional sphere, how did I get these things so abjectly wrong? Five years of my life down the drain for nothing back. And my judgment has been so warped that I believed in someone who so blatantly lied to my face. I am such a pathetic fool, that I throw myself at the feet anybody who shows me kindness. I put in effort, but I ended up right back where I started. Both my confidence and my belief in human beings have been utterly destroyed over the past two years. After so many of my years of my adult life alone, I have no foundations on which to become a human being.\n\nI do not want to be here any longer. I have already lived far longer than I have wanted to, and there is no sign of things getting better. I just want to rest now, and it’s best to depart before things get even worse.", "url": "https://www.reddit.com/r/SuicideWatch/comments/cutkd9/shattered_and_feeling_ill_and_confused/", "title": "Shattered and feeling ill and confused.", "social_network": "reddit", "user": "BeckfordDacre", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1566654309, "permalink": "/r/SuicideWatch/comments/cutkd9/shattered_and_feeling_ill_and_confused/", "nsfw": false, "first_save": 1635427559.4292042, "replies_charged": false}