{"id": "t5_2qpzs_t3_mdqtt2", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3", "8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": " Hey. I'm in need of some help and support here. I have a friend in the USA (I'm in Englad) who has recently been saying she wants to kill herself. A few weeks back she called and said she was literally going to do it, but thank God she didn't go through with it and I successfully talked her out of it, but now she's just acting more and more...I don't know how to put it. Manic? Depressed and filled with hope at the same time? I just don't know how to deal with this.\n\nI wouldn't say her initial conversation with me about suicide completely came out of nowhere. Looking back there were signs that I missed. We've known each other now for years (but have never actually met) but over the last 6 months we've grown closer. Now she's acting more irrational and I don't know how to deal with it. First of all, we only exchanged numbers a few months back and now she's calling me A LOT. Like once every other day. And she's messaging me a lot, each time posing questions that have no answers. Like for example she says the world is broken and she wants everything to be better. She asks me questions like \"why isn't the world perfect?\" and \"why can't everyone work together and make the world better\", and when I can't give her an answer (who can?) she blames me and says I'm \"part of the system of oppression\" and that I should be doing more... She asks me to state why life is worth living, but when I try she says it isn't enough and tries to make me feel as though I'm wrong for feeling this way. She keeps suggesting I should listen to songs on YouTube that relate to her thoughts and yes, they're all grand, sweeping and yeah, they make powerful statements. But what does she expect me to do with it? It's like I always need to fix her, but in the process it's taking a toll on me. She either wants me to give the perfect answer or else feel exactly like her, suicidial. At one point she even wrote a poem about two friends killing each other in a kind of suicide pact (this was allegory, but I'm sure it was relating to death).\n\nEarlier today I gently suggested she might benefit from medication but she says they turned her friend and mother into zombies and she won't take them. Not even anti-anxiety stuff. My mother often is prescribed valium and they help her sometimes, but my friend won't take any meds. She says the pain is authentic and the meds will just make her artificially happy and...yeah what can you say to that? She says she doesn't want to think and feel this way but believes she's 100% right.\n\nFinally, she has this almost obsessive fixation on the Greek goddess Cassandra, who was cursed to always forsee the future, but no one would believe her. She really, really identifies with that and says she's 100% right but is cursed so no one will believe her. Her family tell her the same as me, focus on the little things in life and stop trying to fix the planet, but she won't. She think they're blind and only \"she can see\".\n\nI know I'm making her sound like she's nuts, but honest to God she's a very intelligent young woman and I don't think she's crazy or anything, but I still don't know how to deal with all this and it is taking a toll on me. I can't abandon her, though. But is it bad of me for thinking I should? The selfish side of me now dreads speaking with her.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mdqtt2/need_advice_on_how_to_help_a_suicidal_friend/", "title": "Need advice on how to help a suicidal friend.", "social_network": "reddit", "user": "pvhc47", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1616771662, "permalink": "/r/SuicideWatch/comments/mdqtt2/need_advice_on_how_to_help_a_suicidal_friend/", "nsfw": false, "first_save": 1635427701.2371817, "replies_charged": false}