{"id": "t5_2qpzs_t3_pm7mtk", "request": ["4162f604-29a0-4041-a85b-c249e1ca13f8"], "text": "At the beginning of this year, I [23F] finally told my family about my mental health history and that I've started going to therapy. They were somewhat sympathetic when I first told them but to them it just seems like something can be easily surpassed. I've heard it all from them. \"Just don't be depressed.\" \"You don't have anything to be depressed about. We're [my parents] the ones with problems.\" \"Stop worrying.\" I've tried to explain to them that depression and anxiety isn't like a light switch you can turn off, but they still seem to think it's something I can readily control. \n\nTo make things worse, I quit a good-paying job a month ago after barely starting it because I felt I wasn't anywhere near as prepared to take it on as I thought it was, and I increasing wanted to end my life every day that I went. It's got me rethinking careers and stressing over what I'm going to do with my life now. Obviously me quitting has upset my parents, and I feel they have even less regard for my mental health after my decision and now me being unemployed for a month. I don't blame them for how they feel. I should have planned out my future better and maybe majored in something else in college. It's got me feeling suicidal again. I just wished they realized I'm not happy with what's happened and feel like a failure. No one hates me or is more upset with me than myself. I was really hoping to be able to move out with this job and get away from them but that's obviously going to have to be put on hold.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pm7mtk/just_dont_be_depressed_parents/", "title": "\"Just don't be depressed\" parents", "social_network": "reddit", "user": "Chicana-enana", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 56, "down_vote": 0, "creation": 1631367664, "permalink": "/r/SuicideWatch/comments/pm7mtk/just_dont_be_depressed_parents/", "nsfw": false, "first_save": 1635422900.8797796, "replies_charged": false}