{"id": "t5_2qpzs_t3_puu86n", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "Fuck you all.  Fuck every single human being.\n\nI try to get help.  There literally is no help.  I go to therapy, I take medications.  It doesn’t work.  They tell me to spend $10,000 and 6+ weeks on TMS which has a sub-30% efficacy and when I suggest it isn’t worth the effort then apparently I don’t want to get better.\n\nThe psychiatrist was toxic.  The therapist is toxic.   They can hide their idiocy and cruel behavior behind “challenging your logic”.   No, when I suggest changing my environment might present a higher reward than going to TMS based on copious personal research, it isn’t “let’s make a plan”, it’s “that probably won’t work.  You’ll carry your negativity to your new job and it will fail, too.”\n\nFUCK YOU\n\nI’ve spent 18 years suicidal, the past two excruciatingly so.\n\nNow he’s taking the side of my toxic job.  I never had a problem at work and then my past two companies try to do unethical bullshit and throw me under the bus when I push back.  They call me names, kick me off projects.  I’m right - I know I’m right - the research is unequivocal.  They still didn’t fire me.  Why?  Because I’m good at my job.\n\nNow my therapist tells me it’s my fault.\n\nHow the fuck does he know?  These quacks would probably recommend TMS to people going through active abuse/torture and if they declined they’d be told “they just don’t want to get better”\n\nWhy don’t I get a new job if I’m so right?   It’s complicated for other reasons.  I wanted help charting that course.\n\nUnfortunately, as I get smarter there are fewer and fewer challenges that interest me.  There are fewer and fewer people who can help me get there.\n\nI say things like that and some therapists start thinking “personality disorder”.  But no, literally the only thing that has interested me the past 18 years was being right.   Designing and building cutting edge systems.  I have been very successful.  I keep getting stabbed in the back.  Professionally, people see my as a threat. Personally, most people (including my therapist) don’t enjoy being correct.  They enjoy being blissfully stupid.  They enjoy merging into lanes without turn signals, texting and driving, watching Netflix, and being told they’re great even if they’re mediocre.\n\nInstead, my therapist fails to accept that I am seeking fulfillment and success, not happiness.  “No one on their death bed wishes they spent more time at work” - anecdotal bullshit.   The work I’ve done has saved hundreds of lives.   I told you how toxic my family was, how they threatened to kill me growing up.  My work has brought much more fulfillment and meaning to my life.  And now you’re telling me to stop because I’m wrong?\n\nFucking ridiculous.\n\n“Find another therapist”.  “Find another psychiatrist”.   “Build a support network”.  “Go to a $500/session out of network psychiatrist”.  “Exercise more”.  “Improve your diet”.  “Get a new job”. “Do EMDR”.\n\nDecline any of these due to financial, logistical, or time limitations and “you don’t want to get better”.   When talking to doctors, failing to do all of these at once is a dealbreaker.  I planned the “perfect routine“ to account for all of these things.  It would take me 23.05 hours per day.   I would have to rearrange work schedule to work weekends so I could meet weekday appointments.  I would have 50 minutes free time every day.  If I were slightly dysfunctional, slept in, got put on hold with my insurance company, etc; 50 minutes a day is all the time I’d have left to bleed into.  I’m \n\nFuck this.  I’ve smashed three phones during quarantine.  I punched so many holes in my wall last week my hand was cut up and bleeding.  I had to lie about it at work.  It worked because it’s only the first indication something is wrong with me.\n\nI got a new phone after breaking mine two weeks ago.  Wondered how many calls and messages I missed.   None.   There’s no one left.\n\nPrioritizing my will this month.  Ive procrastinated because I have no one to leave my $500,000 cash or $75,000 personal property to.\n\nAccepting that if there is actually help or good advice out there, I won’t find it.\n\nI don’t want to leave a mess but it’d just be so much logistically easier to end it with my shotgun.", "url": "https://www.reddit.com/r/SuicideWatch/comments/puu86n/zero_options/", "title": "Zero options", "social_network": "reddit", "user": "EstExecutorThrowaway", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 15, "down_vote": 0, "creation": 1632523217, "permalink": "/r/SuicideWatch/comments/puu86n/zero_options/", "nsfw": false, "first_save": 1635425271.1397123, "replies_charged": false}