{"id": "t5_2qpzs_t3_ovfjrr", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "Hello, I am 15 (M) and my sleep is all sorts of fucked up. I've asked my mom to take me to the doctor over this because its been over a month and a half since I've had good sleep but she really just doesn't give a fuck about me. I would have to break a arm before she would even think about taking me to the doctor, she thinks she knows everything when she doesn't. Melatonin seems to have the opposite effect, it makes it easier to fall asleep but I wake up every hour or so which means I am getting somewhere around half of the sleep I should be. \n\nI just want to have 1 good night of sleep and I don't know how much longer I can put up with this before I just hang myself, this shit is just making me lose it all. I can't concentrate, I am just constantly zoned out in my thoughts of offing myself, constant headaches, my mind feels foggy this is just the worst. Even when I get sleep I wake up unrested. I've lost all interests in the things that I used to like and this just feels like hell.\n\nI have 7 siblings, 4 of which are currently living in the same house as us so its very hard for me to want to talk about emotional problems with my mom because that is a lot of vulnerability even if its my siblings I don't think I can take being judged for my emotions. I've put a front of being this joking, happy 15 year old but in the inside I am just a complete fucking mess, extremely insecure about my height, face, voice basically everything. Which really isn't helping me in the whole not wanting to die department. If I were to off myself I wouldn't care how my siblings would feel only my mother, my sibling are constant assholes to me but my mom is obviously my mom so I don't know.\n\nSelf harm is something I'm deeply ashamed about and its not helping that I have to wear a coat in 90 degree weather constantly which just makes me want to die more while I wait for cuts to heal to the point where they are unnoticeable. My mom keeps all of her knives locked up so I have to use this small razor, Which thank god for by the way. I just am not thinking straight when im in the mindset of wanting to self harm and several times I am searching for something more sharp so I can cut deeper. \n\nIts gotten so bad recently, I wouldn't mind if someone shot me in the face or ran me over. Turning 16 soon so I guess that's cool but I just wanna die if I'm being honest. It wouldn't be murder it would be a mercy kill. I would rather die then feel this pain inside that I can't show on the outside. No ambition or purpose or anything just living to live, constantly waiting for it to get better and it gets worse always. Can someone just tell me otherwise? I mean life is pretty cool on paper but I don't know how much more of this I can take before I just off myself. Ive never had any form of validation while growing up, no support, my dad is a complete asshole that left my life a long time ago but he made sure to fuck up my head before he left. Even with my family being religious I'm not even scared of hell, mainly because I just think its all horseshit because why would someone bring me here just to suffer? \n\nSorry for rambling but I am kind of just dumping my thoughts, sorry, sorry, sorry.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ovfjrr/insomnia_is_making_me_slowly_lose_my_will_to_live/", "title": "Insomnia is making me slowly lose my will to live.", "social_network": "reddit", "user": "jvno0", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1627767291, "permalink": "/r/SuicideWatch/comments/ovfjrr/insomnia_is_making_me_slowly_lose_my_will_to_live/", "nsfw": false, "first_save": 1635426508.045938, "replies_charged": false}