{"id": "t5_2qpzs_t3_k7bqe1", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I’m 24. I’ve struggled for forever. I grew up in a fucking trap house. Single mom who busted her ass. Grandpa tried to kill our whole family twice. Threatened to kill me individually. Killed our dog. Punched me in the face at like 7. Got sexually assaulted by my mom’s boyfriend and his son at the ripe ol age of 6-8. Developed an eating disorder at 12. Diagnosed with bulimia and EDNOS at 16 (but was exhibiting behaviors long before). Tried to kill myself at 16. Tried about 6 other times after that. 16 started medagedon. A slough of different meds up until now. Had a bf fell in love. Boyfriend cheated with best friend. Also realized I had been groomed bc he was 23 and I was 16. Got into an abusive relationship where I again almost got killed. He turned out to be a pedophile. Found out he raped his sisters. One of which had autism. Got pregnant at 18 (with a different guy). Had a child at 19. Had PPD horribly. Got cheated on for the first time with child’s father at 20. Should’ve left but didn’t. Now 4 years down the line got cheated on again by the same man. Ended it this time. Eating disorder is horrible at this point. Can’t even look at food. Feel like I got cheated on because I’m fat and disgusting. He swears it was a mistake. Wants to work it out. We’re going to couples counseling. Talking every other day. I’m going to kill myself tomorrow when my son is at his dads. I can’t deal with anymore pain. The world is a cruel cruel place. Treatment is bullshit. I didn’t choose to be born. I didn’t choose this pain. I can choose to leave.", "url": "https://www.reddit.com/r/SuicideWatch/comments/k7bqe1/life_has_been_an_endless_fuck_you/", "title": "life has been an endless fuck you.", "social_network": "reddit", "user": "brainlessinsaneness", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 26, "down_vote": 0, "creation": 1607189754, "permalink": "/r/SuicideWatch/comments/k7bqe1/life_has_been_an_endless_fuck_you/", "nsfw": false, "first_save": 1635422930.8042994, "replies_charged": false}