{"id": "t5_2qpzs_t3_bz2vru", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": " \n\nI am using my old throw-away account for this, even though it was meant to be used only the one time. I don't quite feel like filling up my reddit with several accounts.\n\nTLDR: teenage daughter made me promise not to inform her grandparents about her mental problems, today I learned she has a suicide pact with her best friend (aka if one kills themselves the other will too) I want to inform them because I am terrified, I live in a separate country and can't take physical action.\n\nSo, my daughter (12) lives with her paternal grandparents. I, her mother (32F) live in a different country.\n\nIt has been slightly rocky, maintaining a relationship and bond with a teenager but we've started doing quite well. She has begun reaching out to me and we talk more often, and she has started to confide in me. Without going into too much detail about the relationship we share, it's important that we have come to an understanding and are closer for it.\n\nShe struggles a lot in school and with bullying, I am there to listen and let her vent her troubles. I offer her advise if she wants any and I am always there if she needs someone who can understand how she feels. The stories are getting more and more outrageous and she has asked me to keep everything she tells me from her grandparents. This is mainly because they have \"threatened\" to have her admitted to a mental hospital. Having learned this I have made sure to let her know that a mental hospital/ward is not a punishment but a solution to a problem if she has one. If she is indeed going down a downward slope then such a place exists to help improve.\n\nI have given her my word that I would not violate her trust, on the condition that she will always tell me if something was up so I could be there for her. She agreed to this. In the meantime she has actively given up on cutting herself, which was a shocking discovery for me as a mother and I have felt extremely helpless but I am glad she has found the courage to stop with the self harm.\n\nNow this evening I received a message that her best friend had committed suicide, I told her I was there if she wanted to talk and to just contact me. Offered my support. She said she would let me know, she just wanted some time to herself and listen to music. Not long after I received another message that it was a \"prank\" someone had pulled on her (the fuck is wrong with people) and that she was close to killing herself.\n\nHer best friend and her have a bloody suicide pact running. What am I to do with this? I can't get to her with the snap of a finger and this is getting out of hand. I want to give credence to the claims of depression because the worst thing with mental health is that people too easily brush it aside or say it's not that bad. I feel like it is time for me to call the grandparents and inform them, but with doing so break my daughter's trust.\n\nThe fact she reached out to me is something I cherish and value, but I would give up everything for her well-being again and again if I had to. I do not want to just throw away the trust she placed in me, but I also do not want to get a phone call telling me my teenage daughter has killed herself. And live with the blame of inaction.\n\nAm I approaching this right? WIBTA if I call her grandparents to fill them in? Am I correct in accepting her claims as truth rather than wave them off as teenage dramatics? I am SO MUCH at a loss here, even my brilliant and insightful SO currently does not know what the right approach is here. I would very much like the most candid and honest answers from people, call me everything you want and what I may deserve.\n\nI think that's about all of it. I am reeling right now and my head is all over the place.", "url": "https://www.reddit.com/r/SuicideWatch/comments/bz2vru/daughter_12_confided_in_me_about_suicidal/", "title": "Daughter (12) confided in me about suicidal thoughts, I live in a separate country. Do I inform her grandparents with whom she lives? This would violate a promise I made her.", "social_network": "reddit", "user": "RBN-only", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1560198583, "permalink": "/r/SuicideWatch/comments/bz2vru/daughter_12_confided_in_me_about_suicidal/", "nsfw": false, "first_save": 1635427707.3463888, "replies_charged": false}