{"id": "t5_2qpzs_t3_kgldd7", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I get suicidal regularly despite trying medications, therapy (that I can’t fucking afford and am putting myself in debt for) reaching out to people tho I don’t feel like I have anyone.\n\nI work in healthcare and am so sick of my fucking workplace. They don’t give a shit if we get sick, despite 30 employees having covid and 6 outbreaks they’ve now started rationing masks more. I live alone and have no “bubble” because I’m treated like I have the fucking plague even when I’m willing to do distanced masked walks and I get tested regularly. I want to quit my job, but i know the economy is shit right now and I’m lucky to even have a job so I’d be making things worse for myself quitting.\n\nI’m addicted to otc opiates (we have them in canada) and prescribed benzos that I originally got to try to quit the opiates. I started abusing both very badly after getting cheated on by my last ex. I really wanted a family with her, but am trans and one of her motivating factors for cheating/leaving me was that I wasn’t normal like other guys. \n\nI went and spent 15k (the rest was covered) to get surgery in another country, 3 skin grafts later a lot of pain etc and now I have a penis. I’m happy with my body but still feel it will never be good enough for anyone else. \n\nI quit drugs briefly after surgery as I was happy with my body for once and had a few people reaching out to me just out of curiosity regarding the surgery. I then got really depressed about the fact that I went through it all by myself and healed by myself. \n\nThings have been getting worse day by day and the more I go to work the more I contemplate suicide. I fixate on my ex who doesn’t want me back, I fixate on the isolation I feel in general. I spend most days in bed crying until I have to go to work. \n\nI said I wouldn’t kill myself because I was afraid of becoming a vegetable and I also felt bad for my dog. He’s the only creature I feel actually loves me on this earth. It’s just too much though and now I’m at the point that I’m caring less if I end up a vegetable, I could at least leave a note to tell my parents to disconnect life support. \n\nI’m giving myself till New Year’s Day. I’ve found a spot to jump from. It’s slightly comforting to know that in less than 2 weeks I don’t have to deal with anything anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kgldd7/no_one_ever_responds_on_here_they_probably_think/", "title": "No one ever responds on here they probably think I’m a troll or just don’t care", "social_network": "reddit", "user": "TrappedInaBocks", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1608429911, "permalink": "/r/SuicideWatch/comments/kgldd7/no_one_ever_responds_on_here_they_probably_think/", "nsfw": false, "first_save": 1635428151.177292, "replies_charged": false}