{"id": "t5_2qpzs_t3_od40jy", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "I hate the fact that I have depression and suicidal ideation. Literally, it varies on how the day is going that my depression will either spike into suicidal thoughts or if it'll mean that I'll just hate myself.\nI was diagnosed with depressive mood disorder in the hospital along with some other things and it doesn't help that my life is pretty shit compared to my friends, even though we are all going through our own problems. I can never see the positive side of life, I feel that I'm wasting time and my family's time and money. I can barely pass my college classes, I'm getting interrogated about my financial spending even though I was taught to budget. I feel that my parent doesn't like me that much anymore, especially after a situation that we went through in 2020, because they had a really bad seizure that cause a psychological break. Which was just great. Ever since that event, I feel like our relationship has just gotten worse and worse. And I feel like giving up honestly. I hate talking to people about my problems because I tell them the same thing everytime, \"You can't help me, so why help me?\" \nThe whole time I've been with my parent it's been up and down. Some days they're loving, but most days they come off like they hate me or are disappointed in something that I've done. Although I've tried to do everything right. Nothing is apparently working. And when they talked to their spouse, it's almost like they love them more than me. And I don't understand what I'm doing wrong. Don't get me wrong, I love my parent to death and will do anything for them, but it's really making sad and I'm trying my best to hide my emotions and I'm starting to develop apathy towards the entire situation. \nAnd that's where the depression and suicidal thoughts linger. My depression is passive, but when something bad happens that can be fixed or if there's an altercation, my depression just plummets and I start feeling suicidal. I try not to come suicidal because then I would have to talk to my parents about it and it's no point because they'll tell me that there's nothing to be sad, angry, or depressed about. Which makes me feel worse and then I just give up and say that there's nothing wrong and try to walk away from the situation. \nEver since 2020, I feel like I can’t talk to my parent the same way like we used to and on top of that, I'm struggling in college and they're threatening to take me to a military recruiter even though I can't join because psychological reasons. And all of this is causing me really bad depression and causing me to feel suicidal almost everyday, but it's passive like I said. So I don't know what to do.\nI usually don't come on here and talk about shit that's wrong with me. I don't care about this post going on trending or getting any awards. I just want help and someone to tell me what I'm doing wrong.", "url": "https://www.reddit.com/r/SuicideWatch/comments/od40jy/i_love_how_i_have_passive_depression_and_suicidal/", "title": "I love how I have passive depression and suicidal ideation everyday, but won't actually commit", "social_network": "reddit", "user": "PurpleInBeaded", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1625338443, "permalink": "/r/SuicideWatch/comments/od40jy/i_love_how_i_have_passive_depression_and_suicidal/", "nsfw": false, "first_save": 1635427254.36188, "replies_charged": false}