{"id": "t5_2qpzs_t3_lizmdb", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "My mom screamed at me and threatened to throw me out multiple times when I came out to her, when I was 16 my therapist tried to send me to conversion therapy but instead just fucked with my prescriptions to try and “fix” me. The last time I went to the doctor (for a foot injury) a routine question about cervical cancer risk turned into the doctor interrogating me about WHY I wasn’t sexually active, she wouldn’t take any of my answers and just kept prying, my foot injury took a sideline to this, and I had to lie because I know from others that telling the truth could go on my record and effect the kind and quality of medical care I receive. I was given the advice to start dressing and acting like an evangelical Christian when I go to the doctor. The thought of this disgusts me, but I don’t have much of a choice.\n\nWhenever I talk about these traumatic experiences I get mocked and called a liar to my face, it shouldn’t hurt me, but it does. I know things will never get better for us, and we’ll always be told we’re lying about our experiences with discrimination. Sometimes I think about how maybe a public suicide with a detailed manifesto could get people to finally start helping us, no matter how little it could be.\n\nIt’s hard to separate my feelings of existential doom, invisibility, and exclusion from these thoughts of sacrificing myself to maybe bring light to the kinds of societal threats I and others like me face and maybe help people who deserve to live more than I do. I’m being vague on purpose, because I know that if people know the details they’ll call me a liar and dramatic and “just-wanna-be-oppressed” like always. I’m fucking sick of it. I don’t think things will get better anytime soon, and I know I should probably just in case start buying floor-length skirts, a cross necklace, and turtlenecks before I end up needing to visit the doctor again. I hate all of it. I wish I could magically change my sexual orientation, but obviously I can’t, trust me I’ve spent years trying to.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lizmdb/im_a_marginalized_sexual_orientation_that_nobody/", "title": "I’m a marginalized sexual orientation that nobody cares about, I’m always told I’m lying about my experiences, and I don’t think things will ever get better", "social_network": "reddit", "user": "CynderMizuki", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1613219049, "permalink": "/r/SuicideWatch/comments/lizmdb/im_a_marginalized_sexual_orientation_that_nobody/", "nsfw": false, "first_save": 1635427114.3938298, "replies_charged": false}