{"id": "t5_2qpzs_t3_q5nyfq", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "Im 19. Just call me mike. Thats a variation of one of my names, i dont wanna put my actual name.\n\nI don’t wanna live. I’ve spent more than half of my life wishing i was never born. When i was 14-16 i played football in high school. Combine that with being very tall and very overweight, i have horrible chronic pain. I don’t remember what its like to not be in pain. Im in pain 24/7/365. The doctor wants to give me opioids but I refuse to end up like my uncle. Marijuana is legal in my state, however if i get injured at work, i will get fucked out of worker’s comp and my job. Even if i get a medical card. So my last option is to shut the fuck up and try not to cry too loud.\n\nI cut myself a few days ago for the first time in a year. And yesterday i burnt myself with a lighter. Its a second degree burn, so its pretty bad and it will scar.\n\nIm tired if dealing with everything plaguing me. My chronic pain and mental state wont change no matter what i do about it. My roommate cant find work anywhere and she cant come to my company because she got fucked out of her job there by management that hates her. So ive been picking up the slack and paying the bills, helping her apply for jobs. I love her but she doesn’t have a car and the busses dont run near us. I can afford this but barely. Im addicted to smoking. I have insomnia. My car is shit and is one step away from dying, i cant afford that. \n\nThe only reason im still here is because my parents haven’t died yet. After they go, ill be going with them. I cant add a dead son to all the shit they have going on. I just cant. \n\nI just wanna die. So bad. I think about ways to make it look like an accident. I scream at whoever is out there to give me cancer or have a drunk swerve into me. But i cant do anything to myself. So i just sit here in my house typing these thoughts to whoever will listen while i smoke and sip on a coke and listen to music.\n\nHeres to hoping a drunk kills me on the road.🥂 Stay safe out there everyone.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q5nyfq/anybody_want_to_chat/", "title": "Anybody want to chat?", "social_network": "reddit", "user": "suicid3throwaway480", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1633925763, "permalink": "/r/SuicideWatch/comments/q5nyfq/anybody_want_to_chat/", "nsfw": false, "first_save": 1635426527.062178, "replies_charged": false}