{"id": "t5_2qpzs_t3_qdu9jh", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "Well shit. I am not really sure where to post it, but I need to vent a little, sorry. Also, very sorry if this jumps around a lot. \n\nI am very sorry to whom this may concern. This isn't an act of aggression or vengeance, I am just simply not well. I feel like I don't have a place here. In a matter of fact, I never had a place here. I am not getting any better despite my best efforts. Reaching out resulted in it being the reasoning of every argument now with parents. That sure as hell didn't help anything. I used to be able to handle this much easier, I was able to push the feelings of emptiness and worthlessness aside. I could smile and laugh though I'm sure they could see through the lack of effort lately. I can't fight this anymore, it's overwhelming now. Every night is a game of Russian Roulette at this point, slowly lowering the chances of survival each time. 15, as society says, \"too young to understand one's mental health. It's just an attention seeking phase\". I wonder who will be remorseful sometimes if I were to pass. I wonder all of the shitty Instagram posts there'd be fucking \"mourning\" over me. Pretend they know me to gain sympathy. Oh wow, you had a class with me. Great job. You never acknowledged me. If you fucking cared from the beginning shit wouldn't be like this. \n\nIf there is not tomorrow, so be it. I'm sorry to those who I was close with, my brother in particular.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qdu9jh/vent_i_need_to_get_this_off_of_my_chest_not_that/", "title": "Vent, I need to get this off of my chest. Not that it will help, but maybe it will allow me to sleep.", "social_network": "reddit", "user": "Joy-KL2", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1634949764, "permalink": "/r/SuicideWatch/comments/qdu9jh/vent_i_need_to_get_this_off_of_my_chest_not_that/", "nsfw": false, "first_save": 1635426734.2861235, "replies_charged": false}