{"id": "t5_2qpzs_t3_q2zslb", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "I can't easily get access to a rope, that's not an option. I certainly don't have access to a gun either. For quite a while now, the only thing I could think of would be mixing a bunch of potentially toxic chemicals together. You know, the usual cleaning liquids, maybe condensation of air freshener.\n\nA couple days ago I already started filling a bottle to get ready for tomorrow night, but I've been wondering if it will actually be enough. How much would it take to actually be fatal? I'm 5'2 and weigh 73lbs, my BMI is ~13, so I'm quite underweight, especially in my age group (19). I'm hoping that will work in my favour. It's just a regular plastic bottle that you would get buying water, 400ml. I just don't know how much of it would actually be required to be fatal. Would it need to be completely filled? Would even that not be enough? How long would it take? I would prefer to be able to make it back to my bed and fall asleep before the effects start appearing. It's been surprisingly difficult to find any information related to what I need. Filling the bottle also isn't as easy as you'd think, I'm trying to mix as many different things I find as possible. On top of that, a lot of the stuff is \"outside\" near the back of the house, and my mother is out there almost the entirety of the day since she's working from home. I can't go down at night either since my dogs will probably start barking and wake my parents up. Let's see if I can figure out a way to get this done. I'd just rather not have it instead just leave me with pain and my access to try it again cut off if it doesn't work.\n\nMaybe I should just avoid eating tomorrow too, to enhance the lethality. I guess I'm just going to try and hope for the best. Come to think of it, I don't even really know the purpose of this post. I guess it was sort of a last message to the world. This has been coming for many years now, I doubt it will be much of a surprise to anyone.\n\nGoodbye.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q2zslb/mixing_and_ingesting_household_chemicals_will_it/", "title": "Mixing and ingesting household chemicals, will it actually kill me?", "social_network": "reddit", "user": "BonziBudd-e", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1633575586, "permalink": "/r/SuicideWatch/comments/q2zslb/mixing_and_ingesting_household_chemicals_will_it/", "nsfw": false, "first_save": 1635427426.0609818, "replies_charged": false}