{"id": "t5_2qpzs_t3_72igdx", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "I feel like I've run out of gas. I've been putting so very much energy into fighting my depression and ideations while trying so hard to help myself through transitioning. Months ago I had a week long vacation with my best friend planned. We were going to gencon for the first time ever. That very first day I had of of work I attempted to kill myself and feel I came close. I was found by another suicidal friend and she with my best friend nursed me back. I didn't want to survive and have been wrestling with that since. I've been crying and stuck on the couch since yesterday. I've now cancelled plans this week and therapy appointments. Today I documented my assets and where I'm intending them to go. I ordered the second part of my suicide plan online and it arrives any day. it's been tough not being rash while I wait for the package and falling back to another method but I didn't follow my plan the first time. Suicidal friend had wanted previously to make a suicide pact with me but she doesn't know how bad off I am yet and while it's tempting to let her know, I don't want to watch her hurt herself too though I know me doing this will trigger her as well either way... Best friend had had been touched by suicide in her life before and she's an amazing and loving person but I just can't handle much longer. I'm surrounded by amazing loving supportive people: parents, suicidal friend who adores me, best friend, little brother and an older sister. The trouble is after a lifetime of suppressing my emotions and who I am, it's overwhelming to try and cope with those same emotions I've run from for so long. Running has only ever added a equal part of regret to everything as well. I'm transgender... I was raped by family... That will always be part of me and I hate myself for it and so much more. I just need to hold it together until my package arrives... Then I can try to find some self peace and I can only hope that those I hurt so much can themselves move on.", "url": "https://www.reddit.com/r/SuicideWatch/comments/72igdx/getting_ducks_in_a_row/", "title": "Getting ducks in a row", "social_network": "reddit", "user": "RanmaChan", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1506405729, "permalink": "/r/SuicideWatch/comments/72igdx/getting_ducks_in_a_row/", "nsfw": false, "first_save": 1635427729.2678528, "replies_charged": false}