{"id": "t5_2qpzs_t3_p2n4vc", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d"], "text": "Morning: I went to an art and wellbeing mental health group I go to and did some craft stuff. I painted a flower pot to plant a sunflower in and did some colouring in which I found relaxing and it was nice to talk to the other helpers and students who were there. With crying, I feel like I have to ask people if it's okay to cry and I asked at the group today if it was okay to cry and everyone said yes it's fine to cry and have emotions. I felt a bit overwhelmed because I'm usually really hard on myself about crying and showing emotions, so it was a bit overwhelming and relieving at the same time to hear from other people that it's okay to cry and feel sad. \n\n\nMidday: walked to my local supermarket. I was feeling quite optimistic and upbeat when I walked to the supermarket. On the way back from the supermarket to my house I was a bit more anxious but not really really anxious. Was on my phone most of the afternoon, looked at some LGBT stuff on YouTube which I think made me a bit more anxious because my sexuality is something which is confusing me quite a lot and I think some of that confusion is manifesting into frustration/anxiety/annoyance. Honestly I know people always say that Instagram and social media is to blame for people struggling with depression and anxiety but when I look at accounts of girls with perfect hair and make up I'm not really brainwashed by thinking that because I don't look like that, that means that I'm not good enough, I know that 60% of the time those girls probably don't wear much make up and have their hair in a messy bun and wear casual clothes, I know that social media isn't accurate.\n\nDinnertime/evening: Had two arguments with my parents. The first was about the covid vaccine, as my vaccine appointment is tomorrow morning and I  honestly don't know how to feel about having my vaccine appointment. I think it will reduce some of my health anxiety but at the same time I'm scared about side effects as I've heard a lot of people say the vaccine makes your period erratic(sorry if that's tmi) and I've experienced erratic and late periods before and it's caused me quite a bit of anxiety so I'm worried about that. My problem is that I really struggle to communicate my anxiety with my parents in a rational, calm way, my anxiety doesnt nesescarily come out at a specific time it can happen in any situation and I don't know how to control it because honestly sometimes I feel really uncomfortable talking about my anxiety with people. When my mental health is okay and I'm able to think optimistically, I like to think I'm quite a calm person it takes a lot to anger me but when I bottle everything up the only way I can describe it is like a fire in my brain. Like imagine lighting a match and every time you rub the match against the side of the matchbox it gets more fire on it? That's how it is with every anxiety I have at the moment I'm not delving into each anxiety separately and looking at why it's making me feel the way I do, instead I just pile up my anxieties on top of each other until there's no room left and then I explode and I say loads of hurtful stuff like it's scary because it's like I don't see any traces of the calm, stable version of me at all when I'm exploding at my parents because of bottling stuff up, untill afterwards and then I feel really guilty and I feel like I deserve to punish myself. Honestly a few months ago I would've self harmed but somehow so far even though I've felt guilty for not self harming because I feel like I deserve to hurt myself for hurting other people by saying stuff, I also kind of know that hurting myself won't achieve anything it's just going to make people feel even worse", "url": "https://www.reddit.com/r/SuicideWatch/comments/p2n4vc/today_has_felt_really_up_and_down_and_ive_gone/", "title": "Today has felt really up and down and I've gone from feeling like other people kind of understand me and my anxiety/ocd/mental health, to feeling like a freak and like a failure for struggling with something so much which other people must also have and just be better at coping with it than me", "social_network": "reddit", "user": "sweetlikehoney981", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1628718984, "permalink": "/r/SuicideWatch/comments/p2n4vc/today_has_felt_really_up_and_down_and_ive_gone/", "nsfw": false, "first_save": 1635426979.04201, "replies_charged": false}