{"id": "t5_2qpzs_t3_be3sn4", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "I've been thinking about posting this on 2 other subs but fuck it I'm posting it here.\n\nI'm a 14 year old girl and I'm already an anxiety ridden depressed piece of shit. I've never truly been diagnosed with anxiety or depression, but I've been recommended to go to therapy by my doctors because they say it's a huge possibility but only a therapist can diagnose me.\n\nMy mom and dad love me so much, but I'm constantly being treated less than I deserve. I just want to scream at them and let it all out. I can't even tell them my sexuality in fear of being disowned or ignored for the rest of my life. I also just heard my dad threatening to kill my rabbit in the living room.\n\n4 days ago was my birthday and only a few people acknowledged it. Didn't even get a happy birthday from most of my friends and family.\n\nI'm bullied for what I wear and how nonathletic I am. I was pulled out of school for being a bad kid and (even though I  tried to change as much as I can) am still criticized for it to this day.\n\nMy dad always brings up how spoiled, disobedient, or uneducated I am. He always drags my dreams and tells me I'll never be able to do anything more than work at fast food if I don't do my schoolwork (which I do).\n\nI'm not allowed to have any social media besides SnapChat and FaceBook (they don't know I use Reddit) and even then I had to beg to get SnapChat. I'm not allowed to date until I'm 16 and once my mom took away my phone because I wasn't showing her my texts even though she never asked to see them.\n\nWhy am I such an ungrateful little shit? Why can I not just get over myself and all the bad things that happen to me? I just got a snake yesterday but I'm still sitting here crying. I constantly have panics attacks and very often feel melancholy and empty. Everytime I see someone for some reason I just think of them dying in a horrible way and it always makes me feel like an awful person.\n\ni already cut and harm myself. My mom gets mad at me every time i bring up my mental state and wont help me look for therapists. I feel like I'm just begging for attention, maybe I am.\n\nThe few things that bring me joy I often get bullied or critisized for. It literally feels like the whole world is working against me.\n\nHonestly I feel like suicide is the only option, even though I know it isn't/ I know that I can get help but no one takes me seriouslt. I've already played out my death a million times in my head and just keep thinking about how it could all be over in an instant and I can finally rest. No more stress and no more anything.\n\nI used to think it was just teenage edge or angst, but it's so much more. Please, is anybody listening?", "url": "https://www.reddit.com/r/SuicideWatch/comments/be3sn4/my_thoughts_are_a_jumbled_mess_and_i_feel_like/", "title": "My thoughts are a jumbled mess and I feel like I'll never be truly happy again", "social_network": "reddit", "user": "MyNameIsNotMia", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1555476498, "permalink": "/r/SuicideWatch/comments/be3sn4/my_thoughts_are_a_jumbled_mess_and_i_feel_like/", "nsfw": false, "first_save": 1635427544.4690852, "replies_charged": false}