{"id": "t5_2qpzs_t3_qazokr", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I feel overwhelmed with people who pretend to understand or empathise with what it's like to be suicidal but really don't get it at all. I know it shouldn't but it makes me angry. Shut up you clearly have no idea what it's like. I feel like I was never meant to be on this planet, like an alien, like a freak  and I think soon I will have to go back home. I just don't know the easiest path there. Jumping maybe? I would shoot myself and get it over with in a flash but I have no access to guns. I've only ever felt a connection to one person but he doesn't care about me he has so many better people to pay attention to then some fat suicidal talentless loser like me. I know there is no way out of this. Cutting can help me sleep but I can only sleep for so long. I hope that death is like sleeping. I fear what's on the other side almost as much as I fear my bleak future. Can I dream that me and him are together, will there be a nightmare worse then this hell, or is there just nothing on the other side and I will rot in the ground in what is meant to be the prime of my life. I don't have an exact date but I imagine I will kill myself early next year so I will see if things get better or worse. But everyday is already so hard to get through and no one understands or cares I'm just among the millions who want to die. If God truly doesn't give us more then we can handle why do so many people kill themselves on a daily basis. Are we just the sacrifices, the scraps of the world so that those more fortunate can live their happy lives and look down on us in pity. Feeling like they're actually doing something by saying \"you have so much to be happy for :) I get sad too sometimes you just have to pick yourself up again.\" I've started falling into such ideas as fate to save me because I've given up hope on everything else. Surely all of this pain and suffering has to have a point. Right? \n\nI don't know anymore. I beg to a God I don't believe in but he left me long ago. Now I just have a demon inside of me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qazokr/can_death_be_better_than_this/", "title": "Can Death be Better than this?", "social_network": "reddit", "user": "Pkhate", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1634602763, "permalink": "/r/SuicideWatch/comments/qazokr/can_death_be_better_than_this/", "nsfw": false, "first_save": 1635428186.609026, "replies_charged": false}