{"id": "t5_2qpzs_t3_py2ruu", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d"], "text": "Pardon the rambling.\n\nThis illness has taken its toll. I feel like I’ve aged 20 years in half the time. I’m growing so very frustrated. To think of the experiences and opportunities i\nI’ve lost to this illness is like getting stabbed through my fucking skull.\n\nIt started with social anxiety and low self esteem. I couldn’t bring myself to take risks or out myself out there. I was so afraid of everything. As I spent each Friday at home alone, I became intensely aware of time, and how my time was slowly ticking away, but I remained paralyzed. \n\nI’m 22 years old now: I haven’t had a single real friend in my entire life, and I have only had one girlfriend, which I fucked up in 3 months time. \n\nThis loneliness is my greatest wound. I don’t know how to make friends. It’s embarrassing to say at 22, but it’s true. My desperation shows itself when I meet new people. \n\nIt’s just too much, thinking about lost time, and having no faith for a better future. I’m lost. I’m empty. I want so badly to connect with someone but it’s like an indecipherable puzzle that I can’t solve. \n\nIt’s all I want. I’d live in poverty and obscurity for the rest of my life if I could at least spend it with people I love, and I’ve loved many people in my life: I just never brought myself to get close with any of them.\n\n\nI feel like such a fucking loser. I hate myself. I hate my life. The only thing keeping me alive is how my death would affect my family. I just want to hold someone, to be there for them. To share my life with them. \n\nIt’s all I want.", "url": "https://www.reddit.com/r/SuicideWatch/comments/py2ruu/10_years_of_loneliness_fear_and_failure/", "title": "10 years of loneliness, fear and failure.", "social_network": "reddit", "user": "TheOfficialSanityAcc", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1632943819, "permalink": "/r/SuicideWatch/comments/py2ruu/10_years_of_loneliness_fear_and_failure/", "nsfw": false, "first_save": 1635426924.3270454, "replies_charged": false}