{"id": "t5_2qpzs_t3_ojm5gh", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "It’s probably been one of my longest fantasies. My family used to be semi religious and when I was probably 6, my mom had told me how suicide is automatically hell, but that a self sacrifice is automatically heaven. And I clung to that idea. At 6. At 6 is when I first started thinking about deliberately dying. And things only ever got worse for me. My father’s abuse continued and escalated. I worse forced to spend huge chunks of my youth in a court mandated therapists office that I was too young to benefit from. Then my father just stopped trying to see me and I was glad, but he’s my father. He should want to fight to see his daughter, right? So that one day he could walk her down the aisle. No. It was never that. It was power and control, once he no longer had that, he stopped caring. There’s a part of me that says I should never have come heard about him because then he’d still love me. I tried giving him a chance when I was graduating high school. He ignored me. I told myself that I was fine with him being gone. That I was happy. What a load of shit. In 5th grade, I had a writing prompt about a male role model. I broke down crying in class and was bullied to hell for it. Freshman year of high school, this rumor that this guy and I had sex went around, we didn’t, and I was bullied for that. Attempted suicide in sophomore year by taking a shit ton of Benadryl. What an idiotic child. Woke up with a bad case of dry mouth and a looming sense of defeat. I didn’t feel regret at all, just regret afterwards that it didn’t work. Things got better for a bit and I think I felt the closest to happy ever? I have a gap year after high school because my family is dirt poor. It makes me feel like a failure and I spiral fully into mental illness and it’s safe to say that at this point I’m no longer just depressed and anxious. Signs of bpd start rearing their ugly heads. I essentially watch myself turn into an unstable manipulative mentally abusive monster with anyone unfortunate enough to get close. I kinda come out of that but I know I can’t control myself so I just put up a wall to ensure I can’t get close enough to others to let that happen again. Enter freshman year of college. Things are alright. Crazy roommate (rich coming from me, I know) and a handful of shallow friendships. I go to a party. I get raped. That was cool. I found myself unable to talk to men for nearly a year. I get disgusted at the sight of me. I put up thicker walls. I’m constantly paranoid and scared. Is it the BPD or is it the trauma from the rape? Maybe it’s maybelline. Freshman year ends and sophomore year starts and at this point, I’m drinking nearly every night and missing classes and relying on my roommate and friend to smuggle me in and out of the communal bathroom between vomit trips. I snap myself out of it around thanksgiving. Semester ends. 4 days later, my grandma and most important person in the world is admitted to a hospital again. I start breaking down and people tell me it’ll be fine as this is routine for her. It’s not. She’s got aggressive cancer. She’s given 3-6 months to live. 2 months and 1 day later, she’s gone after spending that last week or two asleep. The last time I spoke to her, I couldn’t look at her because I didn’t want her to feel guilty and I couldn’t stop the downpour of tears. Bye Meme. I start getting sick. Have a cancer scare. Wait, nvm your thyroid is enlarged because your immune system it attacking it. Enjoy constantly feeling fluish oh and remember how you’ve always had weight issues and were anorexic? Well here’s 40 lbs and crippling dysmorphia. Junior year starts. I barely go to class. I’m struggling financially. I drop out. My grandma would be so proud. I start talking to this guy at work. He’s cute and charming and seems into me. Oh, here’s covid and lockdown. Tbh it was only a minor speed bump for us as we weren’t the most covid safe and I feel bad about it, but I’d probably not be here if I took lockdown seriously. Sorry people. Things start to go well with him and I. Except he gets scared of having people know we’re dating. We live in a smallish town and everyone knows some gossip about me. He’d be embarrassed. He starts talking about other girls he’s interested in. I cut him out. For so long, I felt disgusting and unlovable and he changed that. That change quickly was undone. It’s been about a year since then. I’ve spent the past 6 months in a near dissociative state. Things just have had this vague falseness to them and like nothing matters. For the past 4-5 years, I’ve been clinging to these reasons to live. They’re mostly gone. Some have even turned into reasons to die. I don’t really feel passion or drive to do things I once liked. I just wanna disappear. I want to stop hurting. I don’t want to feel like a burden. I only feel alive while being reckless or while drunk and it’s not enough. I feel disgusting and unlovable. I feel like a monster. I feel lesser. If someone were to fall in love with me, I think I’d be further driven to suicide to free them from the curse of me to free them of selling themselves short by going for something lesser like myself. I think I have about a month left. There’s one other thing I skipped over, but I could probably say it in DMs. I work night shift, so I’ll probably fall asleep after posting this.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ojm5gh/think_ill_be_doing_it_soon/", "title": "Think I’ll be doing it soon.", "social_network": "reddit", "user": "AliasInvstgtions", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1626202211, "permalink": "/r/SuicideWatch/comments/ojm5gh/think_ill_be_doing_it_soon/", "nsfw": true, "first_save": 1635428207.109519, "replies_charged": false}