{"id": "t5_2qpzs_t3_ovdnkd", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "\nLet me preface by saying that I’m only 14, turning 15 in august. let’s just say the people I grew up around fucked me up and so did (do) my current friends. The city that I live in, in the third world country known as the United States really doesn’t help either (cheap drugs, poverty, extremely depressing overall, a lot of people start using at my age) But really only have myself to blame\n\nWhen I was 11, I was introduced to weed by my brother. I loved it and became a daily smoker at that age. Not long after, I was introduced to shrooms.\n\nAgain, loved it and a year later, at age 12 I tried acid for the first time. I fell in love with psychedelics and took acid/shrooms almost monthly for a while. \nTook a break from psychedelics and weed after it caused hefty derealization.\n\nOnly a week ago, my ex girlfriend (15) who has recently become a massive coke addict, invited me over to do coke with her. I was hesitant about it but I wanted to see what it’s like. We binged about .5 that night, no euphoria, barely even more intense than a couple cups of coffee, loved the drip however. \n\nExtremely boring and pointless feeling, but every 10 minutes all I wanted was another line. Ended up having unprotected sex as I had zero inhibition which risks aside, made me feel like a total piece of shit as I’m currently in a very happy relationship with my girlfriend (16) and have been for 9 months.\n\nWhen the comedown hit, I felt an overwhelming wave of shame, along with wanting more coke. Lied to her and told her I missed a dose of my meds and went home because i was so ashamed of myself\n\nI spent the entirety of the next day sucking the coke residue off the post it notes that we used to snort it with. Promised myself I’d never do it again and felt like a total piece of shit, was kind of using the leftover coke to combat the shame I was feeling. Also freaked the fuck out about pregnancy and bought an ec pill for her, which she refused to take. \n\nI forgot about coke until yesterday when she texted me asking to come do more coke. I was reminded of what I felt on it (albeit barely anything at all) and accepted. \n\nGave her $50 for coke, which was all the money I had, which I was saving for a new guitar pedal. Guess what? Same exact thing happened. The exact same thing I promised I’d never do again. We did about half the bag and again realized what I had done.\n\nI went home which she literally begged me not to do, but I just couldn’t fucking stay there, it was less about the coke but more about the fact that I was with her, someone who I promised myself I would cut out of my life and once again cheated on my fucking girlfriend. It’s currently 4am and I’ve spent the whole night sucking on the post it notes and snorting random white specks off my clothes. \n\nI left the bag at her house and she’s asking me to hang out tomorrow to finish off the bag and I really don’t know if I have the willpower to decline it. \n\nThese are the only two times I’ve done coke, I had no idea how horrible this drug is. Is my life already ruined? These are the only two times I’ve done this, but am I already captured? Did I fuck everything up?\n\nWhat the fuck do I do? As I’m writing this I am having a full blown panic attack, can’t stop thinking about how I cheated on my girlfriend, wanting more coke, worrying that I got her pregnant and wondering if I’m already fucked. I don’t think I’m full on addicted yet, so there may still be time. I am a pretty promising musician, released a couple albums that people like and get decent grades. I literally don’t know how I can carry on, what am I going to do?\n\nI posted this to a sub for quitting coke but I was shamed and mocked.\n\nI really don’t care if you judge me, I know that I’m a piece of shit.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ovdnkd/i_am_14_years_old_and_believe_i_have_developed_a/", "title": "I am 14 years old and believe I have developed a cocaine addiction and fucked everything up. Suicidal", "social_network": "reddit", "user": "hddishdjsnxjd", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1627760677, "permalink": "/r/SuicideWatch/comments/ovdnkd/i_am_14_years_old_and_believe_i_have_developed_a/", "nsfw": false, "first_save": 1635426409.0657225, "replies_charged": false}