{"id": "t5_2qpzs_t3_fgwl6c", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "So, for a quick summary, I used to work for 3 years in a place where I had to interact with a man that is mentally unstable (his doctor's words, not my diagnostic) and decided to cut all ties a month ago or so. Also, I am a 30 years old woman and English is not my first language.\n\nI used to work for 3 years in a small place (about 25 persons) that had its fare share of insane people, ranging from acceptable to completely mad for two of them. I will only talk about one of the two, because I did not interact so much with the other and he left the workplace more than a year ago. We all work and worked in a place, where a lot people come and go after short period of time, usually between one and three years. The person I am going to talk about is still working there and will probably never leave that workplace.\n\nThe first time I saw that person (lets call him M) was at the birthday party of one of my ex-coworker, about two years ago. The very first 5 minutes was enough for me to understand that something was wrong with him, even though I acknowledged that he was a very smart guy.\n\nThis might be my fault, but I always had trouble with pushing away people I was not confortable with. So he kept talking to me after that, even though I wanted nothing to do with him. At some point, M though I was his friend and interacted a lot with me. And the more he talked to me about his life, the more I understood that he was crazy. There was one particular instance where I even had to talk with a friend that knows about law because what he told me was completely illegal. As a exemple, he is married with two kids, but also has a very young mistress: he is a 45-ish years old guy and his mistress was 22-ish. Nothing illegal here you will say. But then he managed to confess that they had been together for more than 9 years. Now, do the maths... M then told me he waited till she was 15 to have sex with her, witch is the legal age in my country where you can have sex with whomever you want. It is a bit more complicated than that of course. Still, when the person you sleep with is underage and if you are an adult (under 18 in my country), charges can still be pressed by the parents of the minor against the said adult, and they did. Nothing came out of that and M was not arrested. Because of the fact that the matter had already been known by the authorities, my friend advised me that it was unnecessary to go to the police. So i did not.\n\nMaybe I should not talk about that specific age difference between young mistress and M as it is not really relevant for the rest of the story, but I need you to understand the kind of conversations I had to deal with him for the past two years. The topics could be diverse, but it always had this specific one that always came back: indeed the young mistress was with him for the past 9 years, but now she wanted to see other guys and from what M told me, she was always about to break up with him. More than that, they had a non-traditional mistress-husband relationship as he was allowed to sleep with others and so does she, but he was always miserable when she had affairs with other men and always complained about it to me. According to him, he is very much in love with that mistress.\n\nMaybe it is also important to say that I am not someone who criticised extra-marital love affairs (or cheating) and somehow understand that feelings and sex are way more complicated that a ring on your finger. The polyamorous relationships M had with his mistress, wife and a lot of other girls was not something I was inconfortable with. I would probably won't feel disgusted by the whole thing if I did not know about the fact that she was still a child when M fell in love with her.\n\nThen, out of nowhere ,one year ago during a beer office party in a bar, he somehow told me that he was also in love with me. I immediately told him that he was not the kind of guy I dated. This is stupid but I was actually proud of me for rejecting him straight away, because, again, I do not know how to push people away (and it always was a problem). Since we were working together, it was impossible for me to tel M to go \"fuck himself\", but I actually really wanted to say that to him. Unfortunately, he still talked to me \"as a friend\" after that, and I was unable to refuse. From time to time after that party, M tried to invite me to concerts, movies, drinks etc., but I always answered that I was \"busy\" and to ask the week after, which was of course an excuse because I simply did not want to interact with M.\n\nA few more time during the year, he confessed \"his love to me\" again and I still said \"no\". It is also important to say that I do not consider his behavior as sexual harassment, but one of my friend told me I was wrong and I should have told my boss about it. I don't know, maybe she is right, but I still think that he continued because I am unable to express my feelings properly, especially to the people I do not like.\n\nLast November, my contract ended and I moved out of the workplace. Needless to say I was very happy to leave M behind. I still met my old coworkers during beer parties from time to time and M was sometime present. But in four months, I might have seen him maybe twice. I then decided to stop answering his messages and tried hard to avoid contact with him during the office beer parties.\n\nBecause yes, I have not talk about those messages above, but those were awful. Imagine receiving depressing texts, sometimes calls, at 4am from him, saying that \"life is agony\", \"Human is a disgusting species\", \"My mistress is killing me\", etc. So all of them were sent when M and his young mistress slept with another guy and he was not happy about it. I talk to him a lot about it, because I felt that he was actually the kind of guy that could kill himself over stuff like that.\n\nLast January, I was at a party with some of my ex-coworkers. M was not invited. Among them was one of my work friends (let's call her C). M felt closed to C and basically shared the same kind conversations with her about his sentimental life (the young mistress, the wife, etc.), except that he did not told her he was in love with her, but I think he also is. C also knew that M and I had the same problematics talks as she is. She did not like him either, but like me, could not pushed him away. Still, at this party, I already managed to distance myself from M, but since C was still working with him, my guess would be that she was unable to do it.\n\nAround midnight, C told me she wanted to talk to me privately. She then showed me a message from M, basically stating that this night, he was going to kill himself because young mistress destroyed him. We straight out panicked. We tried to call him first but since he was not answering, we called the emergencies. That was a long night, because we did not know his address. I even managed to obtain the number of his mistress (we have friend in common that are not related to M) to try to find where he lived, but she did not answer. In the end, the emergencies found the address by themselves.\n\nM then finally answered saying that we should not have sent the emergencies to his home, that he was okay and that he did not try to kill himself. But then he told me that he used some barbiturates on him but not the right dosage (?). For the infos, he really works in a field where he has access to strong drugs. In the end, he said that he was not sent to the hospital, which was weird for me because I know for sure that if he was suicidal, they would have immediately took him. Since M and his kids were alone at home, I simply concluded that they did not want to somehow traumatise the children. But something was not right.\n\nAnd then the texts messages that I worked so hard to ignore before came back the morning after. Those were just awful. It was a mix between \"I will not kill myself and seek for help\" followed by \"I have access to drugs that can kill myself and I could use it\". Basically, if I did not answered his texts in the minute, this is when the menaces were written. I was so worried that he could do it again that I actually told M that C and I \"cared about him\", which I knew was going to be interpreted a different way. After a few days, I was still receiving tons a messages and he constantly called me. I could not eat nor sleep and it was the same for C, except that for her part, she was not receiving the threats I did. I even felt bad about showing those to her, because she took it a lot worse than I.\n\nIt is worth mentioning that C and I had a past with suicide. Not ourself but people closed to us that passed away because of that. For me, it was my cousin, seven years ago. So M interactions with us had woken up some painful memories, specifically about the fact that we had not been able to detect the distress in those people we loved and they killed themselves without us having the slightest idea about it. And I guess this is why we were so committed to M for a while, even though we did not like him, because he had kids, a wife, a family and friends, we did not want them to go through the same pain C and I had experienced in the past.\n\nBut again, something was not right. Specifically because M was menacing to kill himself, I started to not trust him. I remembered in group therapy, after my relative passed away, the center of most of the talking was \"we did not know that person was suicidal\". But here, M was texting again and again about how he was going to kill himself one day in the \"maybe not today, but probably tomorrow\" kind of fashion. I tried to talk about my suspicion to C, but even if she kind of shared that suspicion, I think she felt bad even thinking about it. I did not want to stressed her out more, but I felt so bad about the whole story that I decided to see a friend who is a doctor (not a psychiatrist, but a general practitioner) and explained everything. A few months ago, way before the suicide message, Doctor Friend actually met the guy once during a party in a bar, so she knew who I was talking about. Then, Doctor friend somehow assured me, that from the messages and what she remembered about him from a few moths ago, M was not the kind of guy she classified as \"depressed\" with potentially \"suicidal behavior\". Actually, he was more was she called \"Borderline personality disorder\", but without meeting him during a proper medical appointment and without sending him to see a psychiatrist, she could not confirm anything.\n\nI told C about what my Doctor friend said and she actually confirmed that M was not hiding the fact that he was \"a bit Borderline\". That was enough for me and, since I am sure he was not going to kill himself, I decided to cut all ties with him. I blocked him on my phone and email address this time, so I will not received those messages anymore. When I am seeing my old co-workers, I specifically told them to let me know if M is around so I could avoid him. Now that I do not interact with him anymore, I do feel better. But there is still some issues.\n\nFirst problem is the young mistress. Maybe he also threatened her with the suicide stuff and he somehow controlled her with that. I know that she broke up with him now, but she might have been in a very difficult situation for a very long time, even when she was what I considered, a child.\n\nSecond, even if M is most likely not going to kill himself, he is still suffering from a mental illness that I guess requires help from a medical point of view, but maybe from others too. I might have blocked his number, but my phone still tell me he tried to contact me multiple times.\n\nThe problem is, I do not want to care about that now that I managed to let go of all of this. AITA for thinking that way ? Should I do something ?", "url": "https://www.reddit.com/r/SuicideWatch/comments/fgwl6c/aita_for_leaving_a_mentally_sick_suicidal_person/", "title": "AITA for leaving a mentally sick (suicidal ?) person on his own ?", "social_network": "reddit", "user": "IamFrofro", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1583930806, "permalink": "/r/SuicideWatch/comments/fgwl6c/aita_for_leaving_a_mentally_sick_suicidal_person/", "nsfw": false, "first_save": 1635425251.379724, "replies_charged": false}