{"id": "t5_2qpzs_t3_j8j0pp", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "Basically a short context: I commented in a facebook gaming group about some person's comment not being appropriate, he told me I had no sense of humour, then he mentioned I prolly sucked at the game and life, and I took it personally. I couldn't get it out of my head so I wrote it down to cope:\n\n\\*\\*\"\\*\\*I am young, but I have so much hate in my heart. I feel such a bitterness and stubborn feeling from a simple internet comment from a complete stranger teling me how I can't do anything right and am \"**a bot at the game and at life**\" after I forgot to tag his name in a reply.\n\nIt struck a nerve with me and triggered a series of responses including talking angrily to myself and thinking of all the murderous things I wanted to do to this stranger for making me feel disrespected. I want to make him speechless, scared. This guy doesn't even know me and has the audacity to mention anything about my life as if he was ever there. I spent a portion of my friday night also ruminating what I didn't say to him, like wishing I said a low-blow comment mentioning his choppy half beard, or calling him an insecure loser because his mirror selfie PFP had a camera flash covering half his face. Instead, I simply tried to lighten the mood and tagged his name in the next comment saying \"is that better?\"....and in my head this made it mean I was weak and he beat me.\n\nI still feel a bitterness to the situation. However, I am also aware this is not personal, but **my stubborn brain's defense mechanism**. And to be honest, it makes me feel like shite.\n\nI am currently asking myself in this moment if my reaction to the event (even if it's all in my head) is what reflects well for who I want to be in a few years, and the honest answer is no. What I do conclude from asking myself about my reaction and how it made me feel inside comes from my lacking knowledge of how to let go.\n\nWriting in this moment however DOES give me a time of peace from the anger; an emotion I associate with very well and also know not how to control.**\"**\n\nBit of a lengthy read, but I wanted to share my journal entry with you guys because it's 4am and I'd like some company to be honest. Thanks for reading!", "url": "https://www.reddit.com/r/SuicideWatch/comments/j8j0pp/i_wrote_in_my_journal_first_time_in_months/", "title": "I wrote in my journal first time in months regarding an online comment that made my suicidal thoughts worse and...it calmed me down?", "social_network": "reddit", "user": "jayy_tw", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 10, "down_vote": 0, "creation": 1602329955, "permalink": "/r/SuicideWatch/comments/j8j0pp/i_wrote_in_my_journal_first_time_in_months/", "nsfw": false, "first_save": 1635428071.9801445, "replies_charged": false}