{"id": "t5_2qpzs_t3_or6bk8", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "Im constantly crying myself to sleep over the pain of not being able to kill myself. I don’t have a horrible life but it feels so routine and it’s exhausting. I find myself wanting to just end things because it’s just SO MUCH easier. But every time I have thoughts of suicide I just think about how  my mom already lost one son and her husband, I can’t put her though that again. \n\nI can’t hurt my family and friends that I know care for me but I just don’t feel close to them anymore. I feel like the affection or compassion I show towards them are fake. All my emotions I show them feel so forced. I can’t even say “I love you” to my family without cringing. \n\nI just want to rest peacefully and the thoughts of hurting the people around pain me. How is that fair! It’s not their life, it’s mine. I should be able to do what I want. It’s selfish that people want me to say alive because they’ll miss me. \n\nThis constantly battle of wanting to die but I can’t kill myself hurts and I just bottle it up until it all comes out in tears and I’m just left sleeping of exhaustion.\n\nI’ve never attempted to kill myself but I’m afraid one day, probably when my mom goes, I’ll end up doing it. And I can’t bring myself to talk to anyone because I can never be so open with anyone, not my family and not even my girlfriend to an extent. Maybe I should try therapy but every experience I hear from people is horrible. So I’m just forced to sleep it off and when I’m asleep it all just goes away…the pain, the exhaustion, the pressure. It’s the best feeling in the world. The best drug.", "url": "https://www.reddit.com/r/SuicideWatch/comments/or6bk8/i_just_cant_stop_crying/", "title": "I just can’t stop crying", "social_network": "reddit", "user": "Ayfernie", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1627193730, "permalink": "/r/SuicideWatch/comments/or6bk8/i_just_cant_stop_crying/", "nsfw": false, "first_save": 1635423052.1317658, "replies_charged": false}