{"id": "t5_2qpzs_t3_mdb7uy", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "I have a family member who almost had the tipping point a few weeks ago and thankfully called the national suicide prevention hotline after a manic episode. The rep eventually calmed them down and suggested that maybe checking into a facility voluntarily to try to address these issues would be the next big step since current medication and therapy seems to have only gone so far. As a concerned person who has had their stepfather go into a rehab facility and seen first hand how numb it seems in such places I figured I’d reach out to those who have had similar experiences \n\n\nHow long were you in for, did you have a roommate, did the facility avoid giving you prescriptions you were taking, did they take any extra unnecessary precautions if you told them you were suicidal, and lastly how was access to the phones or visits? Above all else did it feel like it worked? Did they have you do any outpatient work? \n\nThis last question is unimportant as I feel health is worth more than money, but has your employers or interviewers asked or expected you to explain why you went in or if you have gone in?\n\nI ask this because I have wondered how the process worked? Obviously if it did work I wouldn’t expect a lurker to see this as they wouldn’t need a reason to be on this sub but it if did how did you keep away from dark thought?\n\nTL:DR anyone have experiences from voluntarily admitting themselves into a facility to treat their mental health?", "url": "https://www.reddit.com/r/SuicideWatch/comments/mdb7uy/has_anyone_tried_volunteering_themselves_to_a/", "title": "Has anyone tried volunteering themselves to a rehab facility for depression and Suicidal Ideation?", "social_network": "reddit", "user": "6AMDxGMxCrypto9", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1616714445, "permalink": "/r/SuicideWatch/comments/mdb7uy/has_anyone_tried_volunteering_themselves_to_a/", "nsfw": false, "first_save": 1635427261.222666, "replies_charged": false}