{"id": "t5_2qpzs_t3_lzpo9c", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "Typical story of an adolescent struggling with their social and sexual identity since they were 12 (although have had suicidal thoughts since I was 8 or 9 at the very minimum) and went through the tiring process of staying 6 months in a recovery ward suffering orthorexia nervosa (similar to anorexia but not quite). I had virtually no friends at this point, and the ones I had gave up on me or used my  gullibility  for their own personal aspirations.\n\nThose 6 months changed me for the better; meeting people who I could relate to, and whom I eventually called my second family (we were in 24/7 with covid restrictions on top of that) and struggling with our inner demons. One person I met there I didn't give much notice at the time, but once she had to be hospitalized again, since she refused to eat what was being offered, I started getting closer, trying to comfort and understand the pain they were going through (not being able to walk, having a tube through their nose to feed themselves). We started to talk about our past, such as how we both self harmed, and how she doubted her beauty and that she hated how she was relying off of her parents, even though they abused her in the past. I don't want to go into details for her own privacy, this is about me after all and I'd hate to break her trust even more than I have.\n\nOnce we had completed the program, we started hanging out, which is unusual for me to do, but I felt with her that I could be comfortable sharing a hug, or a moment of solace with them, but I always had at the back of my mind this feeling that I was holding back her relationship with her partner, and I am not the type to want to compete. I just felt comfortable with them, but I knew I was intruding on their \"territory\" if you will. Although I did feel an attraction at times, I wanted to keep it completely platonic, I wasn't willing to sacrifice the best friendship I could ever ask for over some instinctual slob such as romance.\n\nThe thoughts started to come back. Thoughts of slitting my throat, jumping off a high area, and although we had promised to not self harm, I broke that promise, and had to reveal it. I felt so disappointed in my self and still do. I did not go through nearly as much pain as they did, and they did not deserve to feel responsible in my own asinine act. I tried to make it through my studies, but every day I just felt less and less motivated, and although still trying my best to get results, I couldn't help but wonder if I had chosen the right course, that maybe I should do my real passions such as art, music or political action, but I knew I wasn't well engaged enough to even consider competing, and my neurological defect, although I try not to let it shape my life, constantly interferes and brings anxiety.\n\nOne day I thought, instead of thinking that you don't want to leave behind those who care about you, and perhaps cause someone to take their own life because of *my own struggles,* maybe the burden would be made easier with someone that I knew suffered from the same thoughts as me, that I could leave this world with a person that I truly could confide in, rather than just have them as a mere  \n\nacquaintance. And so, I asked them once we met up if she was willing to end her life with mine.\n\nThey said no. They weren't going to leave the people and family see had risked all her time building up to join in my selfish thinking, and got such indignation from even the mention that I'd even fathom such a choice. I then  changed the conversation because I knew I had been too idealistic in my judgement.\n\nIt's been two weeks since then, and I am struggling to see the point in me being there anymore for them. I was useful to them when she was at her lowest, but now I am taking up time she could spend with someone who truly cares for her, and I envy that my only purpose is to work for a goal that I can't even tell if I even want it. It's just pitiful for me to be crying every day and every night with the same thoughts, knowing that more people go through far worse shit than I ever could handle, and that I was so gullible to even ask someone to take their fulfilling and meaningful life with me knowing their past experiences with suicidal thinking makes me feel like I am just a negative influence all around, and that I should for once decide for myself rather than begging others to decide for or with me and just do what my mind won't simply let me stop thinking. What is the point of living in a world were your existential view of yourself is constantly changing and altering, with your mind never stopping to give you a break? I just feel discomfort in thinking that so many hours have been dedicated to nurture, to interact, to get to know someone who most probably will just take up their time as they go through the stages of grief only to move on from you. Even thinking about it makes my eyes fill with tears, it's pathetic.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lzpo9c/i_attempted_to_convince_a_friend_of_mine_to_join/", "title": "I attempted to convince a friend of mine to join a pact, and I can't forgive myself", "social_network": "reddit", "user": "staloidona", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1615119874, "permalink": "/r/SuicideWatch/comments/lzpo9c/i_attempted_to_convince_a_friend_of_mine_to_join/", "nsfw": false, "first_save": 1635428260.552159, "replies_charged": false}