{"id": "t5_2qpzs_t3_px2lww", "request": ["37248a85-36ad-4f27-afa2-d6240c3a39c2"], "text": "I don’t know if I want to die, I don’t think I will ever kill myself because I’m too comfortable in my rote of nothing, and I’m a coward. I’m too scared to live too scared to be dead. I’ve tried working out in the past, 2-3 times a week, 40-1 hour sessions, never really made me any different, maybe that’s my fault for doing nothing. \n\nI moved to another country, not going to school, don’t know anyone here. I feel like my morals have become skeletal, and my apathy absolutely obstructing. I don’t care about anyone not even my self. I have interests, sure, but that’s not the same as working out like everyone has said. I don’t want validation, I want answers on what to do with myself and how to change my horrible mind entirely. I feel trapped in a hole covered up by a massive boulder. I don’t feel sad or upset about my life until I’m called out on it by a shitty meme that makes me self conscious. Am I validation seeking? \n\nI can’t trust my mind. All my emotions feel invisible, I don’t know if my emotions are real or not or some stupid made up shit of selfishness and hedonism. \n\nI don’t trust my mind at all, it’s a fabricator that can’t get myself up to do shit for the life of it and it’s all my fault because I can’t get into it because I never really try, and I feel like it’ll stay that way until one day I actually stop being afraid of killing myself and it ends there, another failure, I only hear of the people that made it or are getting there, never of the ones that are in the pit still and can’t get started or the ones that actually are gone.\n\nPlease I don’t know if this is the right sub I just want some guidance, I’ve given up on myself, I don’t even know if I’m able to be sad about this truly.", "url": "https://www.reddit.com/r/SuicideWatch/comments/px2lww/i_dont_know_where_to_go_i_never_did_any_kind_of/", "title": "I don’t know where to go. I never did any kind of suicide attempt because I want to live my hedonistic pathetic life with no changes. I want to change but I feel paralyzed, not even imagining me wasting my life until I’m 50 doesn’t motivate me to change. I feel total apathy to all things.", "social_network": "reddit", "user": "Nerveringed", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1632821248, "permalink": "/r/SuicideWatch/comments/px2lww/i_dont_know_where_to_go_i_never_did_any_kind_of/", "nsfw": false, "first_save": 1635428526.607958, "replies_charged": false}