{"id": "t5_2qpzs_t3_k5jhg2", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "Asperger's, BPD, complex PTSD. 24, male.\n\n&#x200B;\n\nI've had too much shit happen to me, especially the last year, that I've lost all capacity for logic and empathy, but I think people just fake intelligence and empathy anyways, humans manipulate each other.\n\n&#x200B;\n\nCanada will never legalize medically-assisted suicide, so I need to take my own life before I hurt others... but why give a shit? Why give a fuck about anyone or anything other than myself.\n\n&#x200B;\n\nAlberta just privatized our healthcare system, 40,000 dollars to go to a private mental facility in BC because everything in Alberta has been gutted.\n\n&#x200B;\n\nI'm seriously thinking of going homeless again, and this time for good. Fuck all my friends and family, fuck society, fuck humanity. I'll always be stuck in a teenage edgelord phase because I'll always be surrounded by other toxic people because I'm obviously toxic.\n\n&#x200B;\n\nThere's nothing to help me grow into a proper grown man, and be stylish and charming like everyone else.\n\n&#x200B;\n\nFuck that shit.\n\n&#x200B;\n\nI'd rather be the filthiest fuck alive, and fuck all laws and taboos. This world's just a simulation anyways, I'm pretty damn sure.\n\n&#x200B;\n\nFuck shit up, die, maybe leave this holodeck if I'm not just another organic portal AI, leave a shitty review, and then go back to hiking on Mars and fucking harems of sexy femdroids on tropical beaches on Venus.\n\n&#x200B;\n\nI don't fucking care about anyone or anything anymore. I'm sick of being a therapist's guinea pig and they never help, and the meds they're giving me are making me crazier.", "url": "https://www.reddit.com/r/SuicideWatch/comments/k5jhg2/why_spend_the_rest_of_my_life_being_in_therapy/", "title": "Why spend the rest of my life being in therapy and being a psychological guinea pig?", "social_network": "reddit", "user": "no-this-is-SCP-682", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1606946353, "permalink": "/r/SuicideWatch/comments/k5jhg2/why_spend_the_rest_of_my_life_being_in_therapy/", "nsfw": false, "first_save": 1635428464.1221592, "replies_charged": false}