{"id": "t5_2qpzs_t3_1ewup9", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Dear readers,\n\nI'll start by introducing who I am. I'm a 21 year old male from a western European country. I'm 6'4'' tall, weigh 240 pounds(fat). I don't have a social life, I have never had a girlfriend, nor many friends. All I've ever done is play videogames (addictively), and play competitive (but not paid) basketball (and I'm to fat to be real good). \n\nI was bullied untill i finished high school. I dropped out of my first college, trying to find a job. I didn't find work. I went back to another college to try something else. That was 2 years ago.\n By that time my parents were already mad at me for ruining a year by doing nothing. \n\nWhen I went to the new college, I couldn't keep track of all the essays/homework I was supposed to do and failed over half my courses. \nBut my parents don't know that. I've been falsifieing my grades, lieing to them daily, telling them I'm doing great. \n\nEvery night I go to bed nervous, anxious. Thinking what I'll come up with to lie to them tomorrow. Or, thinking how I could end my life. I live in a country where there is no chance of getting a fire arm. Medications are prescription-only, and I'm to big of a coward to jump, or put myself in the path of a train. \n\nThe year after I inscribed myself again, to hide the truth from my parents that I didn't make it, again. We kept getting an amount of money that parents get here when kids to go school. I lied to them for another whole year (last year) and falsified grades, lied to them, etc.\n\nThis year, I kept lieing to them, saying that it's my final year, but I didn't enlist in the college like I did last year. But then my parents noticed that they weren't getting that money from the government like they used to, so they called the 'company' that takes care of this. Both my parents and the company were convinced of the fact that I was going to school, but they needed a signed form from the school, that I had to get myself. \n\nSo I had to bring that form, signed, to that company. I told my parents I did, which i didn't, in fear of me getting found out. I didn't want to forge a signature, so that my parents weren't gonna be suspected of fraud when it was noticed it was a fake. So I didn't bring the form to the company, but I told my parents I did.\n\nMonths went on, and now they called us, saying my case was still unfinished. Tomorrow, my parents are going to find out that I've been lieing to them, my family, my friends, for the past 3 years. \n\nI'm going to get kicked out of the house, with nowhere else to go. I don't own a car, nor do I have friends who have their own place and could/would take me in. Thinking of running away, or of following through on my thoughts, and just ending it.\n\nI made this to finally say the truth to someone, because it's been hidden from everyone for so long.\n\nTL;DR: Lieing to everyone around me for 3 years. Now, the truth is being unveiled tomorrow and my life will end as I know it.\n\napologies if the spelling isn't all that", "url": "https://www.reddit.com/r/SuicideWatch/comments/1ewup9/its_finally_over/", "title": "It's finally over", "social_network": "reddit", "user": "NoName19919", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1369327673, "permalink": "/r/SuicideWatch/comments/1ewup9/its_finally_over/", "nsfw": false, "first_save": 1635422306.7558255, "replies_charged": false}