{"id": "t5_2qpzs_t3_p22mjr", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "19M. This is despite everything I’m trying and have going for myself. I’ve struggled with pretty severe anxiety my whole life and I’ve been having increased panic attacks and rumination and it’s affecting my relationship with my girlfriend and my family. I go back to college in a few days and the change of pace is scaring me because of how depressed I was the first semester of last year. I made really good friends and they’re excited to see me again, and even though I am largely ready to be with them again, I can’t shake the feeling that something will go wrong in the future and I’ll be left with nothing. I don’t even know why, I should just be happy. I’ve even been going to the gym the past two weeks to try and stave off feelings of worthlessness and I’m happy with how I feel after these workouts. But that’s basically it. I can’t focus on creative outlets I used to enjoy because I keep thinking of shitty things I’ve done or things I might have done to hurt people. It all makes me sick. My girlfriend doesn’t really know how to help, and I know she’s trying her best and I love her so much for that. She’s dealing with her own challenges physically, we are pretty sure it’s MS but we’ll find out for sure soon. My younger sister has depression and was admitted to a facility in April, she was released and is now medicated but it made me realize something about myself. I’m scared of not being caring enough to the people I love. I don’t even know why I’m typing this, I’m just tired of feeling insane and sad all the time. I know I put too much blame on myself, but I don’t know how to stop it. I guess that’s why I’ve been having these thoughts in the first place. Thanks for your help in advance.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p22mjr/ive_been_having_suicidal_thoughts_recently/", "title": "I’ve been having suicidal thoughts recently", "social_network": "reddit", "user": "Cobsters", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1628643937, "permalink": "/r/SuicideWatch/comments/p22mjr/ive_been_having_suicidal_thoughts_recently/", "nsfw": false, "first_save": 1635428007.3091028, "replies_charged": false}