{"id": "t5_2qpzs_t3_qdsn0t", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351"], "text": "i expected i’d get more used to it, that it would maybe get easier because of that. i was wrong lol. every day is a hell, even though it’s different from when i was actively feeling like shit. now i feel like shit and can barely move and spend hours hating myself, all while working, going to college classes, and busying myself with sewing projects and thrifting and stuff. still feel like absolute shit and wish i was dead. i’ve just got people who could be hurt from it, and i actually care that i may hurt them if i did.\n\ni honestly think this is worse. the only way i get through is by hating myself to the point where i have to do something, anything, to be less disgusted with myself. especially physically. but it’s a living nightmare i see no end to. i think it makes me want to kms more, because i’m so disgusted by myself i honestly don’t believe anyone who is nice to me is doing it out of anything related to kindness or interest. just as a formality. maybe pity.\n\ni hate living this way, especially since i can’t talk to my friends about this sort of stuff. they try, but i always feel like they aren’t REALLY trying, or that they don’t think it as bad as it is. i don’t think i resent them now, but i can see it happening in the future. i just want someone to see how much pain i feel. it’s shitty i know, but so many things have built up over the years and to cope and make any of it change, i’ve always took full responsibility for whatever happened to me, because no one ever changed for me, or altered their behaviors for me. the only way to solve anything is to do it by myself. but it goddamn sucks, not having anyone to talk to, really talk to. not having parents i can talk to, or even just go to for emotional support or validation. all i’m left with is self imposed isolation and shitty coping mechanisms. at this point it doesn’t feel like my pain matters, if it’s even seen.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qdsn0t/didnt_expect_it_to_get_better/", "title": "didnt expect it to get better,", "social_network": "reddit", "user": "rottingtigerlily", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1634944038, "permalink": "/r/SuicideWatch/comments/qdsn0t/didnt_expect_it_to_get_better/", "nsfw": false, "first_save": 1635423129.4381611, "replies_charged": false}