{"id": "t5_2qpzs_t3_qeei0s", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7", "86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "Hey.. I don't know what to accomplish by writing this text, but I think that it would be nice to share my story and thoughts with some people who can relate.\n\nI don't want to encourage anyone in comitting suicide!\n\n\nWell, as said in the title, I'm 24 years old, male and I'm from germany.\nI'm from a middleclass family. In my family there is one other case of addiction. My aunt also is a heroine addict.\n\nI had big struggles in school until 8th grade. Not with the learning itself, but rather with my teachers and the other students.\nThey tried to kick me out of elementary school at the time because I was disturbing the school lessons. I had to leave the classroom everyday at least 2 to 3 times.\nI also was diagnosed with ADHD and an obsessive-compulsive disorder when I was 5 or 6 years old.\nBetween the age of 6 and 10 I had to stay 2 times in psychiatric clinics for several weeks/months beacause of all this stuff.\nAlthough I had and still have a caring and loving family, school was pretty hard for me until I was in 8th grade (I was around 14 at the time).\nMy mom had a lot of trouble with me and my dad wasn't caring (they broke up when I was 3 yrs old).\n\nI had friends in childhood but because I got kicked out of \"high school\" I had to move into a supervised residential group for youths and children. I've been living there for just a year, but stayed in the same city after I moved out. My mom moved there just to make shure I can stay on my new school.\n\nThere were a lot of \"rich kids\" at my new school and I didn't feel accepted very well. I had friends there, but I often had the feeling that they were from \"better\" families and that the other students were looking down at me.\nAt some time there came another boy into my class, who had the same struggles as me. We directly understood very well and were hanging out very often.\nI didn't smoke my first cigarette with him, but I often did smoke cigarettes with him in school breaks (I was 12-13 yrs old at that time).\nWe often didn't show up at some lessons together.\nAt one day he introduced me to smoking weed.\nI don't give him the responsibility for that, as it was my fault as well as it was his.\nHe was a very good friend at the time and when I look back, I just habe good memories when we were together.\n\nSo I've been smoking weed by the age of 13 from time to time, what went on until 16 when I started smoking weed every day.\nAt the age of 16 I tried amphetamines (Speed, what we call it here) and with 17 I did Ecstasy (MDMA) for the first time. With 18/19 I've been doing coke, ketamine, LSD, shrooms, and opioids for the first time.\nExcept from crystal meth and crack cocaine I tried out almost every legal and illegal substance, from alcohol, over synthetic cannabinoids, salvia divinorum to cocaine, ecstasy and then opioids.\n\nWeed was my biggest problem back then, but soonI began taking opioids every day.\nIt started with codeine or Tilidin (a not so strong synthetic opioid) and I was trying out everything (codeine, tilidin, tramadol, oxycodon, fentanyl, buprenorphine, morphine and so on).\nLast year I did heroine for the first time.\nI'm an opioid addict now.\n\nLast year I went the first time into rehab. I stayed there for 6 month and was clean for 2 months afterwards but I soon did a relapse.\nI went again on rehab but I did quit my stay there and went home after 2 weeks because I didn't want to get/stay clean.\n\nEvery new relapse made my situation worse than before.\nI went to university since 2018 for example, but I had to quit because of my addiction.\n\nA few years ago I developed a heavy depression because of my drug use (or maybe my drug use has developed because of depression(?)).\n\nIn germany you go into a clinic to do the withdrawal before you go into rehab. Thank god those things are paid by health- and/or rent-insurance here in germany. I know that in almost every other place on the earth you have to pay something like that yourself.\n\nI'm in a clinic for withdrawal right now and haven't consumed since over 4 weeks now, except from methadone, which I was given during withdrawal, but now my 4th day without any opioid is over and depression is growing stronger every day.\n\nSince last year I have been growing suicidal thoughts which are stronger than ever now.\nI really wish that I would be brave enough to just end my life but I'm too afraid to do so.\nAt the moment I cannot imagine to get happy anymore in my life.\nMy plan was to go into rehab once more, but I also thought about just quitting everything and starting a relapse, but I know that if I do so, I will be more depressed than if I keep on staying clean.\nBut staying clean also doesn't make me feel better.\nIt's like I cannot live with drugs (opioids/heroine in special) but I also cannot live without it.\n\nMy family is very sad about my progression and my mom also developed a very strong depression which got more worse because of me over the last years.\nAll my family members are very sad because of that and with every relapse they loose more hope, that I'm clean one time.\n\nNow I'm at a point at where I think that everyone, including me and especially my mom, would be better if I just was dead.\nSo my mom could just try to accept my death instead of loosing more hope every day.\n\nI cannot take the pain to live anymore.\nOn monday I'm changing to another station at where my depression should be therapized, but I do not think that anything or anyone can help me.\n\nI could just call someone and order enough shit to take a lethal overdose. A few weeks ago I almost took a lethal dose of oxycodon. I didn't do, but I really thought about doing so. My mom picked me up a few days later and brought me into this clinic, but she cannot take that stress with me any longer.\nThis is my last chance, but I'm not sure if I do want to take it.\n\nI really would like to end it all. I don't want ro stay in this clinic anymore.\nI don't want to stay clean any longer. But I do not want to do drugs any longer either.\nIt feels like there is only one option at the moment and I'm too afraid to do it.\n\nI don't know what to do. Everyday I'm thinking more and more about suicide. These thoughts grow stronger and I wish I would just do it.\nBut something is stopping me from doing it. Or at least it's stopping me at the moment. Hopefully I'll be brave enoigh to do it in some time.\n\nI'm just not made for life on earth.\nI know there are a lot of people with bigger problems on this planet, but I'm just too weak to take on my \"smaller\" problems.\n\nIt just feels like no one and nothing could help me.\nI would like to live, if I couldbe happy then, but I can't.\n\nI don't know what to do anymore..\n\nPlease help me..\n\nThank you for reading this. Every answer/comment is appreciated.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qeei0s/24yo_male_opioid_addict/", "title": "24yo male opioid addict", "social_network": "reddit", "user": "cloudsaswitnesses666", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1635026268, "permalink": "/r/SuicideWatch/comments/qeei0s/24yo_male_opioid_addict/", "nsfw": false, "first_save": 1635426210.9527798, "replies_charged": false}