{"id": "t5_2qpzs_t3_q1csg8", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "A summary:\n1) spent my entire childhood dedicating myself to a singular sport and academics, raise on belief of “college=success”\n2) get severely injured with reconstructive surgery, never be able to play the sport I loved again \n3) one side of family cuts my immediate family off completely, haven’t seen my grandmother/aunts/etc since I was 13 almost overnight, when she would take me to breakfast \n4) 2 teammates die traumatically in high school. I have to speak at both. \n5) grandmother dies while in college, I say my last words to her over the phone as I hear the cries when she finally does pass. I am the only one not present. \n6) aunt dies unexpectedly in June\n7) mother is diagnosed with terminal cancer. Not matter what, this disease WILL kill her.\n8) COVID happens as I start my new job in a new city. Lockdown prevents me from making connections. \n9) all of this affects me to the point where I do so poorly in my job I am now at risk of losing it.\n\nAt this point I ask, what’s left? Really. Barely any family, no friends, not even a successful career. But hey, at least I have two cats I never see due to work!\n\nI don’t know what curse was given to me, but I’m tired. Tired of fighting and losing. Tired of getting back up just to get heat back down. Tired of never being happy, or being happy just long enough for another shocking revelation. I just can’t do it anymore, and I’m on my last leg.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q1csg8/at_work_right_now_and_cant_wait_to_go_home/", "title": "At work right now, and can’t wait to go home.", "social_network": "reddit", "user": "DaddyDon217", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1633375225, "permalink": "/r/SuicideWatch/comments/q1csg8/at_work_right_now_and_cant_wait_to_go_home/", "nsfw": false, "first_save": 1635427937.271263, "replies_charged": false}