{"id": "t5_2qpzs_t3_ou8s5h", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "I'm at the end of my rope and it's scaring me. It really feels like there's no way out. \n\nSummary of life; Neglected by my mom as a child, took care of myself and was told the bullying at school is not her business. At 13 I stop going cause I can't take the torture and anxiety. I get dragged from one shrink to another, I get no help only blame for being a spoiled brat. Threatened to get taken away. My dad screaming at me daily about how useless I'll be if I don't go to school.\n\nI meet people online, old men who say I'm mature for my age, I let them masturbate to me while I sit there naked on cam. At 16 I meet my first boyfriend, he rapes me. 2 years later and we're done I meet the most abusive piece of shit ever, who does much worse for 3 years. \n\nSchool is still not a thing despite going from one school to another, it doesn't work it, makes me suicidal. At 20 I get my autism diagnosis, I wasn't just a spoiled brat. I then get something called MdDs. Horrific brain disorder. \n\nLast few years I've worked through the anxiety and ptsd. I thought I was ok, could start my life but then mdds flares up and is now making life unbearable, and it'll never go away. Just up and down. \nI can't do anything on my own any more. I need help for every single thing. \n\nI'm completely useless, I feel guilty for breathing. I'm crying daily because I shouldn't be allowed to breathe. I can't do anything. On a good day I can empty the dishwasher, that was my help for the day. I am nothing but a burden.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ou8s5h/disabled_and_useless/", "title": "Disabled and useless.", "social_network": "reddit", "user": "awdsawds", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 75, "down_vote": 0, "creation": 1627600699, "permalink": "/r/SuicideWatch/comments/ou8s5h/disabled_and_useless/", "nsfw": false, "first_save": 1635422990.205735, "replies_charged": false}