{"id": "t5_2qpzs_t3_1t5xvg", "request": ["ecd4e9a1-2551-4506-a13c-95bd305e923c"], "text": "...They will notice my absence at the local Emergency Room as I have to go home to visit family for the next 11 days...\n\n...11 days will be the longest I have managed to stay out of the hospital in the last 6 months, that is supposing I make it the next 11 days...\n\n...I have to go to the clinic and get a new prescription for Seroquel... Im going to lie to the doc to see if I can get twice as much so that I will have a supply to use to hurt myself. Sadly I cant do it sooner, I will have to wait until I come back home where I will be by myself so that I can attempt to take my life, or at least get to spend New Years in the ER/ICU...\n\n...Its sad really, but I think I know all of the staff at the local ER by name as well as most of the RCMP officers at the local detachment... Im the resident crazy person/frequent flyer.\n\n...I dont know how to do anything other than hurt myself anymore... I hurt myself so that I can feel normal ... feel something ... feel like I belong. I dont have any real friends so I actually look forward to seeing familiar nurses, doctors, paramedics and RCMP whenever I attempt suicide or get taken in for a parasuicidal gesture or threat. Its like a social outlet for me. I dont know that I can be without seeing my \"friends\" for the next eleven days, but I have no choice as I will be in a different city and staying with family so I wont have the opportunity to hurt myself, and ...\n\n...I am so scared about not being able to hurt myself and go to the safe place that is the hospital for me. I dont know what I am going to do. I am going to have to act normal like I am okay and everything is okay around my family for the next eleven days... Fuck.\n\nHelp me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/1t5xvg/do_you_think/", "title": "Do you think...", "social_network": "reddit", "user": "YaelCohen", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1387371252, "permalink": "/r/SuicideWatch/comments/1t5xvg/do_you_think/", "nsfw": false, "first_save": 1635427791.726013, "replies_charged": false}