{"id": "t5_2qpzs_t3_587xj0", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "My friends are sick of hearing this, I know from intuition.\n\nIf I don't shut up they'll all leave, my entire coalition.\n\nSo I'll just write this here so I won't be an imposition.\n\nSo here's where my heads at right now, no filter or revision:\n\n\n\nI guess right now you'd say I'm in a pretty bad position,\n\nI'm haunted by my suicidal predisposition.\n\nBeing led down a path to my own submission,\n\nLike following the Pied Piper, the spiteful musician.\n\n\n\nI've got visions of my future it's a dark premonition:\n\nI try to go to college, be an academician,\n\nBut I wasted my shot and with all this competition, \n\nI'd my lucky if my shitty GPA got past admissions.\n\n\n\nI can't start a relationship with all my inhibitions,\n\nI try my best but it just won't seem to come to fruition.\n\nI always mess it up and now it's like it's a tradition,\n\nI try, I fail, I get depressed and go into remission.\n\n\n\nI'm having trouble eating I just don't have the ambition,\n\nI don't deserve the nourishment, I don't want the nutrition.\n\n3 weeks without food will me straight to a mortician,\n\nSo now the question is whether or not that should be my mission.\n\n\n\nSo yeah, depression and anxiety are pretty shit conditions.\n\nI want to blow my brains out I just need some ammunition.\n\nI want to just be gone, just disappear like a magician.\n\nI'll leave this here so that my reason for dying will go without suspicion.", "url": "https://www.reddit.com/r/SuicideWatch/comments/587xj0/i_wrote_this_shit_poem_and_didnt_have_anywhere/", "title": "I wrote this shit poem and didn't have anywhere else to put it", "social_network": "reddit", "user": "tarmon21", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 27, "down_vote": 0, "creation": 1476843402, "permalink": "/r/SuicideWatch/comments/587xj0/i_wrote_this_shit_poem_and_didnt_have_anywhere/", "nsfw": false, "first_save": 1635426458.4266713, "replies_charged": false}