{"id": "t5_2qpzs_t3_cuoap2", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "I watched an interview with Chester Bennington today and he was talking about how his brain is a bad place to be. When he’s by himself and stuck in his own mind he drives himself crazy and the bad thoughts consume him. It’s fascinating that most people that commit suicide or have depression are the nicest people you’ll ever meet and care about others more than they care about themselves. Often times these people are very creative and artists as well. I listened back through all the tracks that I’ve produced and you can just tell I’m fucking dying inside. The vibe is so melancholy and relaxing. The only time I’m happy is when I’m channeling my emotions through music - or surrounded by other people. \n\nI’ve dug the hole too deep to climb out this time. Ive lost all motivation for life and success. I’m days away from probably losing everything I’ve ever worked for. I’m not even sure how I got this far into depression and into my thoughts. It’s such a dark and lonely place to be and to be honest, I’m scared. I’m scared that I don’t care about myself. I’m scared that I don’t care about anyone or anything. I don’t know what’s happened to me. \n\nI wish I knew what I’ve done so wrong in life to deserve this. I’ve always tried my hardest to help everyone that I can, to be there for other people, to make others laugh and feel good about themselves. Even when my life was going good I would dedicate time to offer advice on this very sub and many others to anyone who just needed someone to be there for them. I know how it feels to feel alone and I don’t want anyone to ever feel like that. \n\nThe majority of my time is spent alone - in an apartment that used to hold so much happiness but is now empty and devoid of all things positive. My mind is such a scary place to be and I fucking hate being here.\n\nPeople that used to be apart of my life have moved on. They have families of their own now and their own life. They have weekend getaways and marriage plans. They have a career and a stable income. They are surrounded by love and support. They have parents and siblings and they’re a family. They do activities with loved ones and take family photos to save the memory. \n\nI have none of that. Never have. \n\nHere I am - no job, no motivation, in debt, no money for rent or bills. Rock bottom. \n\nI wish I knew why I’m not worthy of having a family, being a father, godfather, someone’s best friend, apart of a friend group. \n\nI wish I knew why I’m incapable of being loved the way I love others. \n\nI wish I knew why every person I’ve ever loved has betrayed me and left me.\n\nI’m closer now than I’ve ever been and it’s scaring me.\n\nNights like these fucking tear me apart.\n\n This world just isn’t for me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/cuoap2/im_writing_this_for_myself_you_dont_have_to_read/", "title": "I’m writing this for myself. You don’t have to read this.", "social_network": "reddit", "user": "Conway2709", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1566616982, "permalink": "/r/SuicideWatch/comments/cuoap2/im_writing_this_for_myself_you_dont_have_to_read/", "nsfw": false, "first_save": 1635427551.5471418, "replies_charged": false}