{"id": "t5_2qpzs_t3_qazfkk", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I’ve made a plan on what to do a while back and kept it in my notes for a while. I hate that I made it but it seems like making it along with jokingly saying I want to kill myself is a way for me to ease the pain like some type of psychological self harm. \n\nIn some way I feel confident in knowing that I will kill myself so there’s some sort of defiant sure knowing that someday I will. I had the guts apparently to tell my close relatives and friends that on February I was going to go through with my plan. This is good 100% but now I might be on high alert now or maybe I’m just being self centered. Hopefully I sold it enough to make them believe that I’m cured; however, now the thoughts make it more painful and I feel guilty for lying to them that I want to die. \n\nI am sure that religion is out of this battle because I used to pray for god to kill me. perhaps god is all forgiving and maybe they’ll let it slide this time. Only deep thought and meditation helps make the road less bumpy, although sometimes I’m consumed and it brings me here or in my journal, writing about why I hate myself and why others should too. \n\nMy pride or some self righteousness could be the curse. I am considered caring and cool to others but a part of me enjoys that so I can help them over the wall and sacrifice myself. A part of me wants to not get out of the hole but help others get out so they can flourish and be someone better. And if you’re reading this or not I truly hope you know that there are always people caring for you even if you don’t know. I hope you really know that you’re not alone and that you are strong enough to take the hits and keep going. Just don’t help me, it seems like I’m a selfish brat hungry for attention, but at the same time I want to help. Isn’t this chaotic cycle my own personal hell? \n\nI don’t want to be known as someone who does this or that to help someone. I don’t want to be known at all. Just forget about me but know that I hope that my help was beneficial for you. Sometimes I wish I didn’t have a name or a title cause it gives me so much pressure. I’m scared to fail someone. I hate myself. I just want to die. But before I do, I hope I can help anyone I can before I choose end it\n\nPlease know that I hope you are safe and take a moment to step back. When you are ready take control of the wheel. It’ll fight back and Push you down but you’re still in the car you can try again. Stay safe and I hope you have a good day/night <333", "url": "https://www.reddit.com/r/SuicideWatch/comments/qazfkk/psychologically_breaking_myself_down_more/", "title": "Psychologically breaking myself down (more rambling sorry)", "social_network": "reddit", "user": "Someone_ya_used_to_j", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1634601905, "permalink": "/r/SuicideWatch/comments/qazfkk/psychologically_breaking_myself_down_more/", "nsfw": false, "first_save": 1635428185.804431, "replies_charged": false}