{"id": "t5_2qpzs_t3_qhmxrj", "request": ["56f46b9a-59d4-48f0-aed3-4247ea68706d"], "text": "Before anything i want to say this, save the “don’t do it future is bright life is long, gets well soon its not worth it ur family will suffer life will get better’ shenanigans. I’m not here to get pity and I’m not here to  get encouragement. Don’t say ur 16 so young bright future dont do it.  I’m simply here to rant.\n\nI hate myself and my life, every bit. Now i wont say why i want to off myself, there were so many factors that’s started small and everything just built up. I’m 16, the only reason why I haven’t offed myself is 2 things. My families mental health. I guess just one, that’s really all. Ive really been looking for that push u know, like that push like one last straw that would make me finally commit.  It came, 10 minutes ago. I wont get into details but, my future is crushed. I don’t see myself living really, the past year I’ve been holed up in my room and I’ve become human waste. My sister likes to say I’ve given up on myself and to be fair i did. Haha. Won’t even try to deny that when Im normally such a defensive person.\n\n\nI guess karma came for me. I bullied kids in school and done a ton of horrible things and I’ve only lived 16 years.  Ive disappointed many. Now so far and I’ve counted, its been since the end of 2019 that i first had suicidal thoughts. Hasn’t been a day since that I haven’t thought about it. I’m a guy, and i come from a fairly conservative place. We don’t share a lot around here. Ive never talked to anyone about my problems and frankly i do not want to. I needed a fresh start away from reality and this urban hellhole i live in. That fresh start has been stripped, no bueno! Call me selfish, i really dont care. I’m still finding ways to off myself. You know the most frustrating part is there isnt much on the internet. Mention anything that comes close to suicide and I’m bombed with fucking hotlines. It’s so hard to get drugs to OD here too. OD has always been my plan, painless, euphoric. I cant jump off a abuilding because i live on the third floor in a house. When i finally find a painlkes Ay to off myself, i really think ill do it. I used to be scared of the pain, not anymore. I donthave that drop in my stomach when i think about offing myself anymore. In fact I’m excited to become nothing.like before i was born i was nothing, i cant wait to be nothing again. Thats all really, thanks for the read", "url": "https://www.reddit.com/r/SuicideWatch/comments/qhmxrj/very_close_to_committing_suicide/", "title": "Very close to committing suicide", "social_network": "reddit", "user": "throwRAmovingtoSA111", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635427330, "permalink": "/r/SuicideWatch/comments/qhmxrj/very_close_to_committing_suicide/", "nsfw": false, "first_save": 1635428317.6994438, "replies_charged": false}