{"id": "t5_2qpzs_t3_owkv9x", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5", "8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I was fixated on \"getting my final affairs in order\" for so long and by golly I'm almost done (granted I cut away a lot of what I thought wasn't important anymore)\n\nI know I don't matter to anyone here (and not even to anyone who matters to me), but I'm going to briefly summarize my plight and downfall just for the fun of it (and if I list an order of events that lead to me dying at the very end and see that it's the only item left to be fulfilled, it'll be a lot easier to go through with it)\n\nFour years ago I developed a sex addiction. I also fell in love and dated a woman. One year later, my bipolar disorder and what would later be diagnosed as a dissociative fugue. This did not play well with my sex addiction (the latter of which was additionally deeply to me, as I was deeply religious until about six months later). Another six months later, we finally broke up. Her final words to me were so haunting that it changed me as a man completely (in ways that I honestly didn't think were possible? it totally felt like I was living a Hollywood-depiction of \"turn-life-around\" syndrome, but seriously, with great will, you can really do anything)\n\nSo that was two years ago that we'd broken up. Since then, I've been isolated so extremely and only hung out with one friend, who ended our friendship only after a year anyway. I used to lie a lot, now I hardly ever lie at all. I would go weeks without leaving my apartment or even speaking out loud. I just mourned and managed my Etsy store (which was very time-consuming and frankly painful but for unrelated reasons); my intention was to raise a whole lot of money and give my ex a trip to Japan with her best friend. This was the only real goal I had on my mind for the past two years.\n\nAs isolated as you might make yourself, there are certain family events you just can't avoid, right? I would attend those. It was nice to be heard and to socialize a bit before going back to my dark and squalid apartment. \n\nSeveral weeks ago, I discovered that she exposed everything that I had done back when we were dating to my entire extended family. They've all shunned me from everything. I am banned from everything. I have no friends and now no family, either. And yeah I guess I could go out and make more friends or talk to old ones, but what's the point? The woman who I held in such high adoration for two years — working my nerves off raising money to make her happy, hurting myself over and over in response to having hurt her at all — exposed a side of me that I sincerely and honestly believe wasn't me. I was completely dissociated, and she has told me before that she (begrudgingly) acknowledged that. Moreover, telling everyone this changes absolutely nothing for her. She did this because she wants to hurt me. Someone I loved so dearly... *enjoys* seeing me in pain.\n\nThat's not the woman I loved. I don't know who she is. I have reformed myself several times over and it took two years of hard work and extreme efforts (i.e. slicing the side of my penis open on one occasion to keep from masturbating) and beat the demons inside me. It took so long. It hurt so much. It was so hard. The only thing that kept me going was running that store, because if I ran it well, I might be able to make my ex so very happy.\n\nBut what makes my ex happy is to see me hurt.\n\nTwo years of hard work and arm-burning and penis-cutting and crying myself to sleep and spending months in silence and making myself a man who I was actually proud to have become... all down the drain in an instant because people believe what they want to believe, and everyone just wants to \"cancel\" and spread hate. My ex was not like that. Apparently she is now.\n\nI'll give her what she wants. What does it matter anyway. There's no one left to like me. The one person who I wanted to like me most has become someone who wants to hate me so badly that she tortures me for her amusement.\n\nI'm gonna give her what she wants. I plan to drive somewhere and shoot myself in the gut and writhe in agony until I bleed out and die after a long death. I have left her things in my will (which I can't get witnessed and notarized because again I have no fucking friends but I hope will still count), but it's nothing glamorous. I sincerely wish her the best and hope she'll return to being the perfect, loving, caring, thoughtful, and emotional woman that I once knew. \n\nIf not... \n\n...who the fuck cares? I'm about to die\n\nPeace out fuckers", "url": "https://www.reddit.com/r/SuicideWatch/comments/owkv9x/im_actually_about_to_do_it_im_kind_of_shocked/", "title": "I'm actually about to do it. I'm kind of shocked that it's all about to fade away for me.", "social_network": "reddit", "user": "gimme-friends", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1627929613, "permalink": "/r/SuicideWatch/comments/owkv9x/im_actually_about_to_do_it_im_kind_of_shocked/", "nsfw": false, "first_save": 1635426775.3984253, "replies_charged": false}