{"id": "t5_2qpzs_t3_qgz6vr", "request": ["5f7c2841-3f43-4682-8126-88825da57933", "444f139e-44b6-48f7-bc1a-53fc0ad9ead2", "514a3403-b999-41f0-a27f-7c65ea859d8e", "5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "My soul feels dead. \nI'm 24 years old. I grew up in a cold, severely religious home. Instead of given love I was taught I was worthless, instead of given physical affection I was faced in the direction of hell. Five years old I was so afraid of burning for eternity that I accepted God. \nI started having anxiety. As young as I can remember - my eyes were going to fall out, my nails were going to fall out, that I would stop breathing. Panic attacks. My mom would just get angry. I started cutting my skin - \"you don't need therapy....you need God\".\n\nI left home to live with boyfriends. I was abused. Mentally, emotionally, physically and sexually. At one point I lived in shitty motel rooms for 2 years while drinking myself to death and trying to get myself through nursing school and hoping my boyfriend wasn't going to shoot me in the face as he liked to say when he was drunk. \n\nI got myself out of this and was left with nothing but my mental illness and a new one: PTSD. Now without shoving fistful of meds down my throat I'm cowering in dark corners, avoiding doors and windows, convinced and paranoid as hell that \"someone\" is out there. Usually because of the night terrors. \n\nAnd then I got sick. A couple of autoimmune disorders. A couple of unknown disorders. A lot of crippling fatigue and pain. A lot of doctors ignoring my desperate pleas for help. So I committed suicide for the first time. I failed and was left with a huge bill and being even worse off then I was before. Now I can't work because I've been diagnosed with epilepsy and can't drive and also my doctors won't sign off on my work release. I'm at almost a perfect zero between my debts and my savings. \n\nI started looking into the group in Switzerland who will help you with assisted suicide. It is breaking my boyfriend's heart. It is breaking my heart. I don't want to be propped up again through expensive inpatient and outpatient therapy just so I can work every day of my life and die in 60 years. I've had enough of life. The world is corrupt. People are selfish and only want to help if they get something out of it themselves. I'm good, I'm ready to close my chapter. I know it's selfish but fuck you, I'm choosing the most loving thing for myself. No one else will do anything as loving for me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qgz6vr/childhood_traumauntreated_mental_illness_adult/", "title": "Childhood trauma/untreated mental illness, adult abuse, untreated medical problems and lifelong suicidal ideation...what movie am I in and how do I leave?", "social_network": "reddit", "user": "_badimpression_", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 22, "down_vote": 0, "creation": 1635348304, "permalink": "/r/SuicideWatch/comments/qgz6vr/childhood_traumauntreated_mental_illness_adult/", "nsfw": false, "first_save": 1635421094.8372114, "replies_charged": false}