{"id": "t5_2qpzs_t3_q7hpfr", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "Hi everyone, hoping I can get some advice on what to do in the next couple days.\n\nI’ve been seriously thinking of killing myself for about four/five months  (definitely had suicidal thoughts before that for many many years, but I  didn’t start thinking it through or planning anything out until now).  I’m starting to finally feel like I’m reaching the end, lol.\n\nI  genuinely believe that I do not have the capacity to harm myself in any way, significantly or even slightly. So I kind of feel like I’d be lying when I tell them I have “intent” that’s more than just thoughts,  although I do have many plans I’m hoping I can go through with when I’ve finally reached my limit (so I’m afraid they won’t admit me anyway).  I’m trying to weigh the pros/cons of trying to get myself admitted and  so far I’ve only been able to come up with cons:\n\nMy worries/concerns:\n\n* I  have no idea how much a stay or checking myself in would cost. I  believe that this worrying would leave me off a lot worse than I am now.\n* I’d also be worrying about what my friends/family are thinking while I’m gone and how I'm just causing them unnecessary stress (it'd be a shock  for them as they don't know any of this)\n* I’d also be worrying about missing my classes/assignments/a midterm and how I would catch up afterward\n* I feel like I’d be generally miserable for however long I’m there\n* I  think it might make me miserable enough to actually commit suicide after I leave, although I feel like I wouldn’t be able to effectively kill myself and then would have to go through the whole process of hospitalization over again. I just don’t see that many pro’s in checking myself in, but I don’t really know what else to do.\n\nCould anyone who’s gone through the process give some guidance?\n\nThank you.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q7hpfr/college_student_wondering_if_checking_myself_into/", "title": "College student wondering if checking myself into a hospital would be the best option— any advice? What was it like/how much did it cost financially?", "social_network": "reddit", "user": "Sea-Count704", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1634150548, "permalink": "/r/SuicideWatch/comments/q7hpfr/college_student_wondering_if_checking_myself_into/", "nsfw": false, "first_save": 1635426148.8017144, "replies_charged": false}