{"id": "t5_2qpzs_t3_q6nh8l", "request": ["fa52eed9-681b-4f68-b3d1-78c0eec9a3d2", "4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "Not in danger, suicidal but without a plan.\n\nCan I be candid about my ‘recovery’ process? I am a 31-year-old woman with Asperger’s, running three jobs but constantly underemployed. My depression sank into me when I was about 9, and I grew up in a household full of alcohol and drug addiction so it’s not entirely surprising that I was chronically abused, too. I have weekly nightmares about it and no amount of therapy seems to snap me out of it.\n\nI’ve attempted suicide around five times in my life, the worst when I was sectioned aged 15. I won’t say how I tried, but two were pretty close to being successful and times like this make me wish I had tried just a bit harder.\n\nI am hideously lonely —- even when I am surrounded by people, it feels like my lips are sealed shut with glue. Writing stories and poetry used to be my big thing, my greatest escape, but nowadays I can’t even get the mental strength to pick a pen up. Nothing is enjoyable, everything feels dull. Part of me wants to walk into a local suicide support group and just talk, but half of them are family and I am terrified of admitting just how close I feel to dying again.\n\nRecovery feels like a yo-yo farce. I have been on antidepressants from the moment I started secondary school, and doctors are constantly encouraging me to slip off them because I am in a “better place.” I respect them deeply, they are trying with me, but they’re astronomically wrong about me being better.  Day by day I am feeling worse, and I don’t need to be self-harming, overdosing or dangerously offering my body out to express and illustrate how fragile I feel.\n\nMy ‘recovery’ has pulled the wool over my loved one’s eyes for years. Part of me thinks that, because I live independently and have a couple of jobs, they think I am finally better. Well, I am not. I’m still severely depressed, bulimic, and everything other disorder I have been pinned with. \n\nI genuinely feel like I have lied to folks, because I am trying to take the steps I need to actually feel like a worthwhile person, but it blows up in my face every time abs knocks me for six. Completely riddled with guilt, shame, disgust that I haven’t broken out of this cycle after fighting for so long.\n\nI’ve tried being useful, productive. I’ve worked tirelessly to act less autistic, and the only thing that worked for was getting me a job. I want to believe I have a place here, but the constant push backs, recovery loops and rejections are making me think it’s just time to leave the stage gracefully. It’s not a plan, but I keep looking at train lines, bits of rope, knives in my kitchen. Not doing anything but thinking how lovely it would be to finally get out of my head.\n\nAll of this. It’s gnawing. Constant. It’s eating me alive and I don’t think I am going to survive it for much longer.\n\nI don’t think recovery is working for me. I can’t afford private treatment.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q6nh8l/recovery_feels_at_a_dead_end_am_i_doomed_to_feel/", "title": "Recovery feels at a dead end - Am I doomed to feel like this all the time?", "social_network": "reddit", "user": "ZelJel", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1634049062, "permalink": "/r/SuicideWatch/comments/q6nh8l/recovery_feels_at_a_dead_end_am_i_doomed_to_feel/", "nsfw": true, "first_save": 1635425430.3560836, "replies_charged": false}