{"id": "t5_2qpzs_t3_qda1uw", "request": ["5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "I’m struggling with accepting the fact that I’m single and probably will be for a while. I have been for a good time now. Tried dating a few times after I lost the love of my life and father of my child (he left me- he didn’t die)… every time it didn’t last very long. At most probably a month? Nobody wanted to actually be in a relationship with me… they just wanted the idea of me. To say that I was theirs. To post about it and get a bunch of likes and the constant “omg you’re so lucky!”. To get that share of internet “fame” (I’m sorta popular? Idk I don’t think I am compared to some people but I get recognised so idk. Maybe. Whatever it’s besides the point.)\n\nI feel like nobody’s ever gonna actually want to date me for just me and I feel like… idk that I’m not gonna also find someone who’s sexually attracted to me (one of the people I tried to date had a bunch of other issues going on with his life, and… Idk I felt like I wasn’t good enough constantly because he always rejected my advances for physical affection, even hand holding…. So it made me feel like I wasn’t good enough. But would talk about wanting to fuck strangers at the bar he would go to… so yeah. Highly insecure now to be with someone because I feel like they’re not gonna be attracted to me and I feel like shit.)\nAnyways. So… yeah. The other people who dated me didn’t want an actual relationship, and didn’t want to work on issues together that would come up, or they would flip shit about the fact that I still love my ex- not IN LOVE- but I love him as a friend because I care about him and he was my literal best friend- and they literally blocked me on everything and never talked to me again. \nI just… I want to feel like I’m good enough. I want to be able to relate to someone and have common interests. I can’t find ANYONE anywhere who’s into the same shit as me… I feel like my one ex was my crowning glory and the literal perfect match. I was just fucking toxic and had too many issues and crap I wasn’t dealing with and I wasn’t being a good person and… drove him away. To someone else…. And now I’m fucking just…. Fucked. It’s all I think about. It hurts. So much. I don’t know what to do. I’m so sad. All the time. I cry so fucking much and it’s stopped feeling better after. I’m just tired of this cycle. I want something. Anything. Even someone to flirt with that I have feelings for. Something.  \n\n(Also: I’m 27 and autistic with BPD and Bipolar and depression if that helps with the “story”)\n\nI’m sorry. Idk what to do.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qda1uw/not_really_suicidal_but_just_idk_theres_not_a_word/", "title": "Not really suicidal but just… idk there’s not a word.", "social_network": "reddit", "user": "Lewdghostgirl", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634880244, "permalink": "/r/SuicideWatch/comments/qda1uw/not_really_suicidal_but_just_idk_theres_not_a_word/", "nsfw": false, "first_save": 1635428305.316208, "replies_charged": false}