{"id": "t5_2qpzs_t3_i7jmwa", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "This emptiness. This melancholy. That deep pit feeling of feeling your whole world crashing around you and not being able to do anything to help. I don’t answer anyone anymore, i can’t bring myself to do anytime new. It’s just like, what’s the point if i know i’ll be dead soon ya know? I can’t bring myself to overdose, logically I don’t think the chances are worth it, something like 1% chance of dying from it. Nope. I’ve always liked doing things where the outcome i prefer is very probable. Soooo i can only think of one method where I would most likely be successful but it’s difficult. Sometimes when i’m driving I just think about swerving into the middle of traffic and ending it right there. Maybe then i’d feel something.\n\nI don’t really know where i went wrong. I try to pinpoint certain things in my life that happened that affected me greatly but there’s so much that I can’t even tell when and what made me start feeling this way, it’s just been so fucking long. I’m only 20. There’s so much life ahead of me but I can’t see the light. When i was a kid i used to want to fast forward to this age and be studying to become a lawyer so I could be living in a mansion with a big family. I had such big aspirations. Now i have nothing. I miss who i used to be and i don’t think i can ever become someone that could compare to that fearless, outgoing, inspiring, motivated girl I once was who had the world at her fingertips, all while being close friends with literally everyone I knew. I just don’t know how I went from being everything to being nothing. I think about death all day everyday. I yearn to feel eternal peace. My soul is fucking crying !!!!!\n\nSorry i went all over the place. My minds just been all over", "url": "https://www.reddit.com/r/SuicideWatch/comments/i7jmwa/i_cant_kick_this_feeling/", "title": "I can’t kick this feeling", "social_network": "reddit", "user": "sadgypsygirl", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1597114110, "permalink": "/r/SuicideWatch/comments/i7jmwa/i_cant_kick_this_feeling/", "nsfw": false, "first_save": 1635427530.213551, "replies_charged": false}