{"id": "t5_2qpzs_t3_o863oe", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "if people live life for money but are unhappy when they have everything they could ever want they need love. If love is what makes life worth living I am doomed. I don’t know how to care or let someone in like that because all I know is running away. I could have everything I want and still be unsatisfied and I could work until I’m at the top and still want more even when there is none. material things are not everlasting like love is. \nI do love people but the relationships I have are being destroyed by my own doing. I very guilty for not being the best person I could be for them. I am not a good friend, significant other or daughter. I am mediocre and I will never be good enough like my peers even if I keep trying. I hyper fixate on my emotions and analyze them shutting people out which generates guilt but deep self awareness. there people within myself that make up my personality and they fight with each other. The person I am at home who is quiet and drawback, conservative, fighting with the person I am with friends who is loud and doesn’t care what people will think. And then the detached me looking at myselves from above watching and concluding. I owe it to my parents to be the way they want me to be. I have a choice to be my free personality who is not held down by conservative weight, but at the expense of my comfort and freedom to live my life as that person and is now weighted by responsibilities of someone older then I am. My other choice is to continue my double life and hide but I get to at least live for a while. \nI will never be the daughter they want that perfect collage student, engineer employee changing the world climbing the ladder to corporate. instead my want for freedom peaks out and my father looks at me disappointed but his eyes are trying to understand, they are tired he just wants everything to be as it was with no change. with all he puts up with i want to be the person he wishes to look at. \nwhen I do the right thing and he says he’s proud, I know I can keep on going no matter how much I want to give up. When I look in his eyes I can see someone who is always thinking and analyzing. He’s quick to move on to the next thing and cannot sit still. I’m convinced he doesn’t know what a brake is. He cries for sad movies and all the effort at the end of the day is put forward into the kitchen, at the table, all five of us laughing at something stupid he said. I know that’s all he wants. when I look into my mother eyes, I have to look away. guilt creeps at my skin and peels it when I remember her past and the fact that I can’t tell her I love her without choking. I can only talk to her at the right times. She has had to fight all her life and that instinct has not left her. Sometimes she is soft and I see her core, the person she is inside and I melt and have to turn away. That is the right time to talk to her. I will look her in the eyes and tell her I love her one day while crying, it’s a dream of mine. Sometimes I see her sadness but it is always dulled by her doing something for me which I cannot understand but it makes up the person she is. She’s always working for others. \n\nN looking for someone who didn’t exist or at least was not me. If anything she wanted someone exactly like herself. Someone to tell her it’s alright and have an impact. She once told me I had a way with words and then another time that nothing I ever did shifted her mood as a significant other should be able to do. Because I was responsible for her happiness yet I couldn’t make her happy and whenever she’d text me at the end of the day I’d feel a weight drop on my head knocking all the thoughts out leaving me dry to respond which triggered her irritation. At one point she felt she could tell me anything but somewhere along the road she felt I didn’t care anymore. She had killed my drive and I was a zombie walking through the 2 years we spent together. Reminiscing about how fluffy the past was compared to our rotting union presently. in the end she left me because I was not giving her what she needed and then I felt free. I understand why she acted like this but I don’t know what else I could do. I was in Florida, she was in New York, all I had were words. I occasionally want to text her because it’s so satisfying and comfortable but it’s over. I just wish I could say sorry in a meaningful way. \n\nC, my best friend for life, since we were kids. \nWe played so many games together and laughed like no one was watching and then we grew up and you changed. She tried to become what people wanted her to be and I stayed the same. She became someone I didn’t know, just like everyone else which repelled people. she became suffocating to be around and when I went out with a friend one time she snapped as if I betrayed her. I let her walk away because I was not going to repeat the cycle if she wasn’t going to learn where the real problem was. Sometimes I see her walking out of class. She walks very quickly, speeding through life. I wish to be friends again and guilt tears my brain making me remember her own demons and makes me question my own faults in our relationship.  C, i don’t hate her I just want her to understand and I want to help her. I can’t hate them at all but I hate myself for the situations I create. I hate that I can’t confront my emotions. I used to think this state of mind was temporary but over the years it has only deepened and gotten more complex. If it is going to continue like this I don’t know if I can keep going for another 10, 20 years or more. \n\nif i decide to leave this world for good, to all these people mentioned and to everyone in my life and to these people reading this, thank you.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o863oe/i_dont_think_i_can_take_it_anymore/", "title": "I don’t think I can take it anymore", "social_network": "reddit", "user": "throwaway56935", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1624692395, "permalink": "/r/SuicideWatch/comments/o863oe/i_dont_think_i_can_take_it_anymore/", "nsfw": false, "first_save": 1635428110.0523407, "replies_charged": false}