{"id": "t5_2qpzs_t3_gd30p9", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "It's not a question of IF he's suicidal. So many resources are about recognising the signs. I know for a fact he's planning to die. He won't tell me when. \n\nMy friend has been suicidal for a long time. He attempted in 2017 and stayed in an institution for a few months and went back to school and the threat he'd do it seemed mostly gone. We'd joke about suicide but he really wasn't serious until recently when we got back in regular contact after a while. I'm sure it was always a little true but now he's so certain. \n\nI don't know how to help him. Every time I bring it up or try to talk about it he shuts it down and says he wants to just enjoy the present. It feels so fucking hopeless it's like I'm watching him die. And I want to show up at his house and talk to him at least but if we get caught breaking the 'quarantine' rules would be a $600 fine and even though I think his life is worth that, I can't just impose that on him. \n\nAnd I don't know if I should call the police on him. The thing is if it were anyone else, I wouldn't hesitate. But he's been through it before and STILL wants to die. I want to take away his pain but I don't know how.\n\nIt feels like I'm stuck between making his life hell to make him stay alive and giving him a happy ending and playing along and smiling like nothing's wrong. It feels like I'm forcing someone to stay alive even after they signed a Do Not Resuscitate. Like I'm making someone do chemo instead of palliative care. But I can't just let it happen and I know that it's selfish because this is not my pain but that is all I have. His family needs him. They love him so much. I need him. \n\nBut I'm the worst person to talk him out of suicide because I DON'T KNOW WHY LIFE IS WORTH LIVING. I have no idea. I can justify my own death so why shouldn't I respect his decision? It's his to make and I have no ammo to make him change his mind because I can never truly understand the real impact of his pain. I want him to go to therapy, take his medication, find better medication but I don't know if that's sentencing him to a life of being \"handled\". And one of the three he promised to not die to is planning his own death too so that pact is broken. \n\nI know I will eventually kill myself too and what I would want is for people to respect my decision too, not to talk me out of it, and let me go with dignity before I go insane. But we're 19. He's got so much potential. He welcomes everyone and makes everyone feel special. He's kind as all hell. And yet I still can't tell him what makes life worth living. There is no magic word, beautiful poetic line to name the innate value of life, why he should endure this pain just for everyone else.\n\nIt's not a beautiful ending. It's a life at stake. And I physically could stop him from dying if I sent the cops that way but it feels like a huge betrayal. I don't know what to do.", "url": "https://www.reddit.com/r/SuicideWatch/comments/gd30p9/my_friend_is_certain_hes_going_to_kill_himself/", "title": "My friend is certain he's going to kill himself and I don't know what to do, has anyone been in a similar situation? Talking down someone who's SURE.", "social_network": "reddit", "user": "b-ees", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1588558367, "permalink": "/r/SuicideWatch/comments/gd30p9/my_friend_is_certain_hes_going_to_kill_himself/", "nsfw": false, "first_save": 1635427753.0946052, "replies_charged": false}