{"id": "t5_2qpzs_t3_q25tvy", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42", "4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "Hey guys I’m a 23 yr old female who has been struggling with severe depression, anxiety, PTSD, and diagnosed bipolar since age 16. I have taken basically every antidepressant, mood stabilizer, antipsychotic you can think of and never felt any better. Talk therapy has never helped or has made me feel much worse. I’ve done 2 rounds of TMS therapy which didn’t help at all. On the outside I seem pretty high functioning and even though I’m vocal about my mental health with the people around me (family, friends, drs) no one seems to care enough to step in and really help me. Most recently I tried Ketamine treatment but had a terrible panic attack on my 7th treatment and haven’t been back since because the drs full on ignored me then and still haven’t called after I’ve missed several appts. I’m so frustrated because I really want to get help but no one gives a fuck. I don’t know what else to try. I let drs and family know I sometimes have suicidal thoughts (and have had 4 failed attempts over the past 5 years) but drs keep giving me more meds and family just looks at me like a failure who can’t buck up and grow up. I have been unemployed since February this year because my manager was sexually harassing me (I reported it and was gaslighted) so now I’m broke, traumatized to get another job, have no reason to get out of bed, moved out of my first apartment and am back with my parents. I want to disappear permanently or at the least move away or travel the world but all that seems impossible with covid restrictions and lack of job opportunities. All my friends have abandoned me or are moving ahead with good jobs etc and I’m here falling apart more and more everyday. I wonder who I could’ve been if this wasn’t my situation. It’s exhausting and the pain is never ending I want it to stop", "url": "https://www.reddit.com/r/SuicideWatch/comments/q25tvy/overwhelming_suicidal_thoughts_all_the_time/", "title": "Overwhelming suicidal thoughts all the time", "social_network": "reddit", "user": "Bipolar_femmeartist", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 18, "down_vote": 0, "creation": 1633468629, "permalink": "/r/SuicideWatch/comments/q25tvy/overwhelming_suicidal_thoughts_all_the_time/", "nsfw": false, "first_save": 1635427322.0472558, "replies_charged": false}