{"id": "t5_2qpzs_t3_oc2033", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I have been watching TiK ToKs and this song has been trending with a dance.  I realized today that the chorus of this song actually reminds me before all of this began, it’s like me asking myself if I ever remember being a completely different person - before I lost my father, before I lost my job due to my mental illness, before I wished to never wake up again after going to bed.  \n\nThe song is “Heartbreak Anniversary” by Giveon.  Below are lyrics I am referring to.  \n\n\n“Just like the day that I met you, the day I thought forever\nSaid that you love me, but that'll last for never\nIt's cold outside like when you walked out my life\nWhy you walk out my life?\n\n[Chorus]\nI get like this every time\nOn these days that feel like you and me\nHeartbreak anniversary\n'Cause I remember every time\nOn these days that feel like you and me\nHeartbreak anniversary, do you ever think of me?” \n\nAlthough the lyrics are about someone and a relationship, to me, it’s me asking my past self about those days before I was diagnosed with bipolar depression, the days I used to love myself and be proud of what I had become.  Do you ever think of me? \n\nI know this isn’t exactly a suicide note, but I posted here because I fantasize about my death every night.  Even though I don’t have a plan to actually follow through with, I have however put together a mental note of the things I would need to complete before The day I actually end my life.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oc2033/rollercoaster_of_moods_today_i_am_back_to_the/", "title": "Rollercoaster of moods, today I am back to the dark isolated room stuck with intrusive thoughts, fantasizing about wanting to end my life. This one song has been on repeat because it reminds me of when I was a happy, highly motivated person who everyone loved to be around.", "social_network": "reddit", "user": "MrOvaTinker", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1625197136, "permalink": "/r/SuicideWatch/comments/oc2033/rollercoaster_of_moods_today_i_am_back_to_the/", "nsfw": false, "first_save": 1635427610.0294611, "replies_charged": false}