{"id": "t5_2qpzs_t3_q9776l", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351"], "text": "This year I lost everything I thought I had.\nMy entire life changed and I thought it was for the better and everyone says it is but I can't move on. \nI don't see it being better.\nI can't move on from my previous life, my ex, my past friends and everything I went through until now\nI don't feel like I want to either. \nI finally thought I had a few good things in my life and everything is gone. \nEven my hobbies don't feel the same, They make me feel worse.\nI don't want to mature. I don't want to \"grow\".\nI don't want to live another month when every second alone is painful. \nEverything feels empty. Every hour is meaningless. I just prolong the pain for no reason. No one is coming back and nothing will ever be the same. Not even the things I liked.\nI'm an empty shell of a human walking around.\nI thought I was doing better but that never happens. Always more bad things pile up and nothing gets easier.\n I always find myself at the same terrible spot and have to handle with so much at once. \nIts like my life just hates me, Makes sense.\nEveryone pity me but don't help. I don't think they can even.\nNo one can.\nAnd I already reached the point of being beyond empty.\nI don't even feel emotions anymore I just feel nothing. Constantly.\nI don't care about anyone or anything really.\nI told it to my psychologist but all she does is listen,\nAnd I don't have much to say anymore other than I'm just tired. So so so tired.\nI thought my life had some meaning but its all gone and I'm tired.\nI can't do this. I'm so done.\nI'm planning to try to commit suicide. Again.\nAnd I'll start writing the letters.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q9776l/i_feel_like_an_empty_shell_and_i_will_do_it/", "title": "I feel like an empty shell and I will do it.", "social_network": "reddit", "user": "stavk6", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1634369306, "permalink": "/r/SuicideWatch/comments/q9776l/i_feel_like_an_empty_shell_and_i_will_do_it/", "nsfw": false, "first_save": 1635423158.1978314, "replies_charged": false}