{"id": "t5_2qpzs_t3_o8icdd", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "I would like to kill myself... I believe I am pathologically narcissistic. There are two or three times I wished to take my life. Twice last year, once this year. I've been to crisis four times! I have no way to self regulate anymore. Possibly for the last three years I've lost the ability to self regulate. I would like to take my pathetic life. I'm 26, female. I began suicidal as I was 12, cutting my forearms for a cry for help. I have been diagnosed schizoaffective, ptsd, acute psychosis, bpd general anxiety and, major depressive disorder. I think I am actually schizophrenic. I hear my Dad's voice telling me I am to not leave the home and find a mate and to have a child. I also hear my Mom's voice to telling me YOU ARE NOT ALLOWED TO FIND A MAN TO IMPREGNATE YOU. I come from a Dad who is a scientologist and a mom that is a Jehovah's witness. I have only one sibling she is older, though my Dad has had three other women's children who I never met. SORRY THIS IS A VENT UGHHHUUAPALLW. But my grandiosity has stopped since three years ago, when my false self somewhat slipped. My mask shattered. It was when my now ex had came on me, after pulling out, without a condom, with shattering the shared psychosis (we spoke of marriage, family, home steading, children, christian views on family, me coming to Australia to move with him as we were talking all over the long distance I'm in united states America) when he *raped* me, my ideas, my mask slid off, my face disheveled. My entire life was ruined. Am I thankful? Is \"everything happens for a reason\" apt?! Idk. I'm stuck IM SORRY I'M RANTING. I don't know.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o8icdd/hi_everyone_i_am_lethally_suicidal/", "title": "Hi everyone. I am lethally suicidal.", "social_network": "reddit", "user": "No_End_7227", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1624739015, "permalink": "/r/SuicideWatch/comments/o8icdd/hi_everyone_i_am_lethally_suicidal/", "nsfw": true, "first_save": 1635427387.508951, "replies_charged": false}