{"id": "t5_2qpzs_t3_h9u4hf", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I was told by my 5th grade teacher on the last day of school in May of 2006 that I would never amount to anything. That I was worthless and useless to society. Ever since, I’ve been indecisive when it came to major life choices. Every big decision that could’ve changed my life I turned my back on because I was afraid to take that leap of faith, whether I would succeed or flop, my teachers voice in the back of my head, repeating over and over that I wasn’t good enough; to not even bother trying. After high school, majority of my classmates either joined the military, went to college, had kids and got married. They seem to be doing pretty well and I’m happy for them. The unlucky remainder either died of gun violence or went to jail for gun or drug related crimes. An old passion of mine was cooking. I had dreams to make it after culinary school and moving to Manhattan where I’d scrape every penny I could working at a 5 star restaurant until I could own one of my own. I applied for culinary schools after graduation but I didn’t get accepted to the schools I really wanted to join so I just gave up. I began a very toxic addiction to marijuana which made things worse and my work ethic and drive to succeed went down the drain. I thought the military would be an ideal way to better my life, but I didn’t have the courage to return to the army recruitment office after flunking the ASVAB practice test. I’m now 25 years old, newly working the sandwich board at a local Burger King, with a bunch a smart-ass- mouthed teenagers; my 3rd job revolving around food. It’s not fun or something I would want a stable career out of. And because of COVID-19, it was hard enough finding work so with the Burger King position I took what was available. I made no lasting friendships during or after high school, no girlfriend, no kids, no idea where my life is going from here.. I recently moved into a double wide trailer that has no fridge, stove, a/c, furniture, washer or dryer, with my older brother-to whom we barely speak to each other and refuses to help me out financially since he has 3 kids and is paying child support for 2 of them, plus bills and rent. I ask other family members for help until I get get my shit together, but I feel like I’m coming off as a leech or a human money pit. I’m 25 fucking years old! You’d think I’d have common sense to have some sort of money management skills developed for times like this! Long enough story short, my depression has returned and has kicked into overdrive, and I’m now having suicidal thoughts and now they’re getting stronger. Ive written my suicide letter and Will in the notes app of my iPhone (spoiler-nobody’s getting anything), and I plan to buy some sleeping pills when I get paid in a few weeks. Yeah my family and everyone would miss me.. but I wouldn’t miss living like this. I wouldn’t miss living at all. I mean, what am I missing out on, right this very minute???", "url": "https://www.reddit.com/r/SuicideWatch/comments/h9u4hf/im_25_years_old_and_i_have_no_idea_of_what_to_do/", "title": "I’m 25 years old and I have no idea of what to do with my life. No girlfriend or kids. Literally no idea. Suicide is on the table.", "social_network": "reddit", "user": "ovrthkr94", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1592272656, "permalink": "/r/SuicideWatch/comments/h9u4hf/im_25_years_old_and_i_have_no_idea_of_what_to_do/", "nsfw": false, "first_save": 1635426662.0952053, "replies_charged": false}