{"id": "t5_2qpzs_t3_q1a5v4", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "The more and more I think about suicide the more that I know it is the right answer for me. Every day I wake up and I don't want to get out of bed. Nothing brings me joy any longer. Not food, or cannabis or video games.  \nI have a disability or a disorder. I don't know what to call it because it only came out when I was 31. When I got it, my anxiety and depression got much stronger overnight. I now have screaming matches in public and have had the police called on me because I now have a large amount of anxiety and I never learned how to really handle it except to vape.  \nI had never heard of this disorder but it causes me to lose all my stamina, or shake or have all sorts of sensations. 90% of the time I am a completely normal adult but I can also something be completely unable to walk.  \nMy boyfriend and I had a baby together. I was expecting it to be hard; everyone knows I have a disability so I'll get help, won't I? And I do. But it isn't enough. And they act like I'm crazy for needing help. Because it's only one baby! I am only working 1 day a week at work now and I still feel overwhelmed.  \nMy parents were hoarders. I am extremely upset by any kind of clutter and I feel like I can't keep up with everything. My boyfriend tells me I should stop freaking out about the place not being neat but I can't take it. Everywhere I try to rest is a space full of dishes I must wash, trash I must take out, clothes I must fold. I just don't feel like I can relax anywhere in my own home.  \nI no longer feel like myself. I think about dying every single day and I did not used to think this way before having a baby. She isn't even special needs or anything. She is a perfectly normal happy baby and it's too much for me.  \nMy boyfriend works from home. He complains that I always look miserable when I've got the baby, he can never have a break because he always has to deal with my breakdowns. And he, by the way, watches the baby with no help at all when I'm at work. He can handle the baby all by himself with no relief and I can't go 1 day without needing help.  \nThis week was the hardest for me, in big part because we all got sick. Not COVID or anything serious. It's like a cold. But with my disability my stamina is completely in the shitter. Lugging around this heavy baby everywhere I go - she is very clingy at this age - is absolutely exhausting. I don't want to get out of bed. I don't want to deal with another day. My boyfriend is so busy working at home, dealing with me and baby and providing for us.  \nI have been told to ask about post natal depression or whatever it's called. The last time I spoke to my psychiatrist I was telling her about everything I was going through. She did not make a change to my medicine or anything. She told me I need to be okay with how everything is.  \nI feel like I am keeping my boyfriend trapped in a shitty relationship. I can set him free if I just kill myself.  \nOnce I made the decision to kill myself I feel so much better and have so much more peace. Every plan I try to go over in my head just makes me feel better and better, knowing this is all going to come to an end soon.  \nMy baby will have her 1 year birthday party this week. I will write a note to my boyfriend and write a letter to my wonderful little girl.  \nIt kills me to know I'm not going to get to see her grow up. But my boyfriend can find a better mom. She can forget about me at this point.   \nI am also very saddened to leave one of my friends behind. His brother committed suicide a few years ago and he was the most important person in the world to him.  \nI am his only friend.  \nIt makes me cry to know I will not be there to comfort him anymore. Or that my sweet baby is going wonder why I left her.  But I can't handle it any longer. I feel better and have more energy now that I know I am going to end it all next week. I feel like maybe I can push through how bad I feel.  \nI have lived close to Mexico my entire life. I just have to leave my baby at a safe place and then cross the border. I know where the dangerous parts are. I am hoping I can be killed there. There is an extremely high murder rate in Juárez. The way I see it, perhaps if some psycho wants to murder someone he can murder me and not somebody else.  \nAs I have sat here writing this TEDtalk he has sat in the baby pen with the baby. While looking at his work computer and he folded the laundry. He so much better at this than I am. I can't understand why he wanted to make a baby with me. I do everything wrong.  \nI want to write a letter to my boyfriend and my baby. Maybe some to my friends. And leave all my information so my boyfriend can take care of our baby. What else should I do?", "url": "https://www.reddit.com/r/SuicideWatch/comments/q1a5v4/ill_kill_myself_after_my_babys_birthday/", "title": "I'll kill myself after my baby's birthday", "social_network": "reddit", "user": "WeatheredWeed", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1633368192, "permalink": "/r/SuicideWatch/comments/q1a5v4/ill_kill_myself_after_my_babys_birthday/", "nsfw": false, "first_save": 1635425568.6012225, "replies_charged": false}