{"id": "t5_2qpzs_t3_ozy800", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I said I'd give myself a 5-6, said when I'm 20 or 21 I can either move out or kill myself. Yeah, that won't happen.\n\nI may be just another teenage statistic. Sitting in front of my screen just contemplating leaving this world, finding a noose and just end it the next morning. It'd be better for everyone else, maybe even better for myself too. I may be weak, had been battling Complex-PTSD, Depression and Anxiety for most of my life. You can skip the parts in spoilers, it may be too long and messy to read lol. \n\n>!My memory fails me, can only recall to when I was just about a few years old. Hadn't even realised it 'till recently - I was already sexually, culturally, physically, religiously, emotionally and psychologically abused by my peers just as a toddler. Only a few years old, maybe even younger than just a kindergardner, had I realised my entire being was \"wrong\". That may be a reason as to why I was selectively mute for a bit. It's as if I was bullied both at home and at school.!<\n\n>!It's all my fault. My selective mutism caused me to be a target of further abuse. I never had true validation from people, I was just used and taken advantage of by everyone, nobody I truly loved (platonically or romantically) truly stayed, they only went to me for whatever they wanted and then later on disregard me. The worst part is, i never stopped it. I knew i was being taken advantage of all because I wouldn't speak up. I secretly hated them, hated the people I just grew fixated on but their conditional support felt like a DRUG. I was sexually abused by a relative for 8 years and it's still on going. My \"bestfriend\" whom I looked up to, she also sexually abused me for a couple months as well, even though we were both just 7 or 8 years old, she knew what she was doing - i knew what she was doing to me. I never stopped her, I didn't want her to leave me because I was almost OBSESSED with her, but I also hated her because of her using my selective mutism as an advantage to manipulate me. I told my parents, they of course shunned me. !<\n\n>!I was told I was autistic, my parents told me I was just a retarded child from the ages of 3-6 and even go as far as saying I'm possessed, at times pinning me down to say religious verses and scream at \"the demons\" inside of me. Because I was religious and had faith in God at the time, I believed it all. I believed that I was a horrific creation to God's eyes and that I often deserved everything that's happened to me. I'd be burned by my mother for being mute, it's my fault. I could obviously speak, but I never did speak to other people. My cousins and other relatives and EVEN some family friends...they all knew of this. They never stopped my parents, oh no, they actually encouraged them. They wanted to see me speak, they wanted me to get burned all for ENTERTAINMENT. Nobody ever realised how impactful this shit was, it still affects me. I had nobody on my side, but I was also glad because I was convinced I was some monsterous creature that God made, that I was possessed by evil. That I was impure from possession of spirits. I started self harming eventually, at first to punish myself- though I don't really know when it started, maybe almost a decade. I grew severely depressed but dismissed it. I think when I was about to turn 9 was when I both loved and hated God at the same time. I was taught he was supposed to love everyone and be merciful regardless to whoever it may be, and that if bad things happen God will save me if I prayed and believed hard enough. And so I did pray, I prayed alot especially during the ages of 6-9, when things just started to spiral terribly for me because I thought I was possessed. I loved God for his creations, but I hated that he never saved me from my traumatic childhood. !<\n\nThere's more stuff, but I dont know how to put it in, Im not stable to write. I'm tired, I'm so tired. I just wanna be at peace but I never can be.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ozy800/im_probably_not_gonna_make_it_lol_i_guess_below/", "title": "I'm probably not gonna make it lol. I guess below is just whatever fucked me over.", "social_network": "reddit", "user": "cool_angle", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1628359673, "permalink": "/r/SuicideWatch/comments/ozy800/im_probably_not_gonna_make_it_lol_i_guess_below/", "nsfw": false, "first_save": 1635428096.3044796, "replies_charged": false}