{"id": "t5_2qpzs_t3_psaic1", "request": ["5f7c2841-3f43-4682-8126-88825da57933"], "text": "I've beed depressed since I was 11 and im 17 now. About 5 m9nths ago,, i don't know what happened, but its like my brain disconnected from reality and i haven't felt the same since. I don't even know myself anymore, I haven't felt truly happy since whatever happened happened. I have thought of suicide every day for the past two months. I hasn't gotten better, only worse. With the stress of school and everything, my life is just getting worse and worse. I have a rare type of tinnitus, and my stress and depression has made it get significantly worse over the last month or so. I feel so hopeless, I literally can't feel happy anymore. Its so fucking terrible.\n\nSo why do I have to continue? Why the fuck am I still here?? I don't want to traumatize my fucking family, the family who makes me feel like shit constantly, makes fun of my mental issues, and always blames me for all their issues.\n\n I was sobbing earlier because my tinnitus is literally driving me fucking insane, and you know what my mother said? She said, \"Haha, I know exactly what you're doing! You're being an idiot, I'm not going to fall for your little show. You're just crying because you want something, you know nothing can be done about your tinnitus, so your just crying so I buy you something. Not falling for it so quit the act.\" \n\nWhy do I care if I hurt them?? I hate them, yet I can't hurt them. I don't fucking get it. I really don't understand. I hate my life, I hate everything and everyone in it, yet I'm being forced to live it. I cant fucking take this shit anymore. Im hurting so much, yet no one who matters to me cares. No one cares that every single day is fucking terrible, and excruciating to live. I just want to fucking die already, why am I still here???", "url": "https://www.reddit.com/r/SuicideWatch/comments/psaic1/why_is_everyone_so_against_suicide_why_do_i_have/", "title": "Why is everyone so against suicide? Why do I have to suffer?", "social_network": "reddit", "user": "gay_soup", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 38, "down_vote": 0, "creation": 1632194953, "permalink": "/r/SuicideWatch/comments/psaic1/why_is_everyone_so_against_suicide_why_do_i_have/", "nsfw": false, "first_save": 1635421113.0523076, "replies_charged": false}