{"id": "t5_2qpzs_t3_qdhayi", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "Hello guys, hope you are doing okay.\n\nI've had a few terrible days, selfharming and with destructive suicidal thoughts.\n\nSometimes I think I should end everything. And I say to myself that I wish I could end everything without anyone knowing I ended my life. I just don't do it because of others. What would they think? What would they think of me? Of my parents, of my family. It's not their fault, it's just my fault and no one was involved in this decision. And that's when I start feeling guilty, I feel they don't deserve someone who wants to kill herself. And this feeling makes me wanna kill myself x2. But I know I won't. Because I'm a coward.\n\nI left my hometown and started in a far new place thinking that my demons will stay where I used to live. But that's not true. You are your own demons. I thought that getting away from my family and my friends would make them forget me. I thought they would remember me 2 months, maybe 3. But in the end they will forget about me. And this would be my opportunity to kill myself. But it wasn't, cause they never stopped reaching to me. And that's something posive, of course it is! But not for someone that wanted the complete opposite: I wanted to be forgotten so I could rest in peace. \n\nI don't know if anything that I've written down has any sense. English is not my first language and I'm quite anxious and crying a bit. \n\nBut whatever guys, I don't want any response. I just wanted to address what I feel because I have never said it out loud. And I think it was about time, maybe opening about it will make me feel better?? \n\nI don't know. Keep safe, we are all doing the best that we can.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qdhayi/addressing_things_self_guilt_afraid_of_what/", "title": "Addressing things. Self guilt, afraid of what they'll think.", "social_network": "reddit", "user": "fckinglies", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634910411, "permalink": "/r/SuicideWatch/comments/qdhayi/addressing_things_self_guilt_afraid_of_what/", "nsfw": false, "first_save": 1635426171.4262044, "replies_charged": false}