{"id": "t5_2qpzs_t3_p2jof5", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": " \n\nWhy  doesn't it generate anger? Why do I need to think about how I would  leave others in sadness rather then knowing that they would be angry at  me?\n\nWhy do I need to generate  sadness and negative emotions? Why do I always just generate sorrow, and  pity and just all in problems to everyone.\n\nI  always do this. Or I make small mistakes intentionaly, or I will make  deliberate actions against someone so that they would feel sadness. My  siblings, my parents, my friends, You!  \nI make things awkward, I make  things miserable, so that everyone takes pity on me, or feels that they  wasted time energy and everything on me.\n\nI'm  a shitpile that's what I am. I don't deserve siblings, I don't deserve  parents, I don't deserve friends, I don't deserve You, not even a  community to read my sad note on a wall. Heck, I don't even deserve to  listen to myself being sad, I'm so pathetic. I literally make myself,  the one and only guy who should at least feel something positive about  myself, sorry for it. That's how pathetic I am.\n\nI  don't deserve anything. I'm just a big clump of Chaos, the living  embodiment of Entropy, the one guy who can screw up anyones sentiments  just by being near them. I don't want to make anyone feel bad because of  me. I don't want to make anyone feel awkward, or feel sad, or sorrow,  or anything negative. Anger? Yes. That can push me away from everyone.  Be angry at me, call me a rasist, a homofobe, a science-denier a  fricking pedofile! Just hate me and go away from me, so that I can die  peacefully knowing that I didn't make anyone miss me, or feel sorrow  because of me, or sad.\n\nI don't want to make anyone sad. Not my family, not my friends, not You.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p2jof5/why_does_suicide_produce_sorrow_and_not_anger/", "title": "Why does suicide produce sorrow and not anger?", "social_network": "reddit", "user": "Throwout12-03-2003", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1628708470, "permalink": "/r/SuicideWatch/comments/p2jof5/why_does_suicide_produce_sorrow_and_not_anger/", "nsfw": false, "first_save": 1635426820.0891619, "replies_charged": false}