{"id": "t5_2qpzs_t3_5v73zp", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "There is no singular real reason for posting this. It's a little bit to vent. It's a little bit to try to find people who feel the same way. It's a little bit because I'm just so fucking tired of sitting on the sidelines and watching everything happen. And one more thing. While it may seem I'm just ranting and raving on about how men have it so hard and women all have such easy lives, I don't really feel like that's the case. I realize that life can suck for anyone regardless of gender or any other factor. I'm simply trying to express how I feel at the current moment to the best of my ability.\n\n\nI feel like as a man, I am treated worse than most women and children. I see examples of this throughout all of modern society. You don't have to look hard. It's plain to see. It's crystal clear. Society cares more about women than men.\n\nFemales are by far more successful in more school than men. This is because they try to force men into a program that works well for girls. If you're a man, you're broken. That's the message that I feel like I have to swallow every time I go on the internet, every day I live, and it sucks. Hell, at the school that I personally go to, almost all of the 4.0 GPA students are female. There was literally a 1:9 ratio for male to females with 4.0 GPAs in my grade level at my school this year. That's just sad.\n\nI'm sorry, I went on a bit of a tangent there, but I felt it was needed to express my current feelings. The hardest part is that I know that I'm no exception. I know that, deep down, a part of me will always care more about the well being of any given female than any given man. Ultimately I do value females more than men, just because I feel that's like how I was programmed. I was created to fuck and then die. Therefore, it's beneficial that I care more about people that I can accomplish 50% of that goal with.\nI don't feel like I'm needed or wanted. I'm tired of dealing with these thoughts and feelings. It's tiring. Hell, even THIS post probably won't get as many replies, or people reading it,as a girl's post would. I'm just so fucking tired of dealing with these differences.\n\nI'm tired of emotionally tormenting myself every night just so I can wake up and go to school so some fucking teacher teaching the same useless bullshit can try to cram me into their inefficient and stressful curriculum. It's like trying to fit a square into a circular hole, except when they find it doesn't fit, they just fucking try harder!\nI don't feel like living in a world like this. I'm tired of being wrong for being born the way I was. I'm sorry, I didn't get born and say \"I think I'll be a man!\". No, I got born and then get taught the same things. I got taught that hugs and love are important. That understanding is important. And then reality came in and gave me a full 180. I then learned that those things only applied to half of the population. That I just didn't deserve that kind of care. That instead of being loved I had to work and hurt and suffer for everything just so that some person can be biased more easily and laugh when I fail.\n\nI feel as though there is no reason for me to be here. I don't want to be here. I don't want to be forced into this system anymore. I want to be free and understood. I don't want to be bound by this cruel reality. And until the day I die, and I'm truly free, I'm nothing more than a useless slave dancing for someones entertainment. It might not be today, it might not be tomorrow, but eventually I will die and I'll be free from this. I couldn't kill myself. I'm too much of a pussy. I couldn't do that to my family... and so I'll wait. and suffer. But someday, I'll get out of here and I'll no longer be forced to bleed for someone else's benefit.\n", "url": "https://www.reddit.com/r/SuicideWatch/comments/5v73zp/i_feel_as_though_as_a_man_i_am_valued_less_my/", "title": "I Feel As Though, As A Man, I Am Valued Less My Modern Society and I Feel No Need To Exist In Such An Unbalanced and Cruel System", "social_network": "reddit", "user": "throwaway87612434343", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 0, "down_vote": 0, "creation": 1487623993, "permalink": "/r/SuicideWatch/comments/5v73zp/i_feel_as_though_as_a_man_i_am_valued_less_my/", "nsfw": false, "first_save": 1635426354.392368, "replies_charged": false}