{"id": "t5_2qpzs_t3_pq9176", "request": ["5f7c2841-3f43-4682-8126-88825da57933", "5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "I work myself to the fucking bone every day, sacrificing the meager scraps of my dwindling energy, just to keep it inside. To not let it show. To be palatable, to have the green light around non-suicidal people.\n\nI cause myself so much additional suffering by faking it when if I didn't, it would cause them no pain - they'd just be annoyed. But God forbid I slip up and snap at someone for once. No, it all goes to hell when I don't plaster a fucking fake smile on my face.\n\nBut when you commit suicide instead of hanging in there for them, they're such victims. You've just hurt them and scarred them so badly. When were those fucks given when I was struggling all alone? Huh?\n\nAnd how about when the act doesn't do it for them anymore? When they're upset to recognise that we perform happiness around them, that it isn't genuine. As soon as it stops suiting them we can't be saved, we're tricking them, we're toxic; so much for \"it gets better\". But the fuck do you want me to do about it? It isn't my fault I feel like shit, and I'm oh-so sorry that each detail in my elaborate performance doesn't work for you anymore.\n\nBut I'm done. I'm done trying, I'm done caring, I can't take it anymore. No-one will ever be satisfied even when I give them everything I have to offer and more. I'm through with tearing myself apart for their ignorant relief.\n\nI'm done.\n\nWhy is normality always demanded of me even though I'm completely unable?", "url": "https://www.reddit.com/r/SuicideWatch/comments/pq9176/suicidal_people_are_hated_no_matter_what_we_do/", "title": "Suicidal people are hated no matter what we do.", "social_network": "reddit", "user": "Raven2303", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 236, "down_vote": 0, "creation": 1631913543, "permalink": "/r/SuicideWatch/comments/pq9176/suicidal_people_are_hated_no_matter_what_we_do/", "nsfw": false, "first_save": 1635421111.4181447, "replies_charged": false}