{"id": "t5_2qpzs_t3_hn91u0", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I'm healthy. I stay active. I'm educated. And I actually care about myself. I understand that things are hard sometimes. Things never always go the way you want them too. So why do you get tired?\n\nI've accepted death as an answer since i was 12, And till now two days before my 29th birthday, I've done a lot. I've been through a lot. I could go so much further.\n\nI view each attempt at suicide as a rest stop on my run to being who I want to be. Some attempts I get lucky and when I should have tripped, I stumbled. And kept going. Sometimes I ran faster after tripping to escape from that place, those thoughts. I distract myself with my music, my passions, because that takes my mind away from that place, keeps me moving forward. Always forward.\n\nI'm no sob story. But my story makes me sob. Don't feel bad for me, I chose to run this path.\n\nI've had no father. My mother, couldn't take care of me. I fended for myself and took care of her. My family turned their back on me for the color of my skin.\n\nI was bullied. Two years of my life I can't even remember because it hurts too much. To think people can be capable of such love and yet such cruelty. Confounds me to this day.\n\nBut from that I ran. Fast. I became successful. I was proud of myself. I felt like a father figure for the disenfranchised employees that I had.\n\nI lost that job. But I kept running. They can't stop me.\n\nI started over and rose to the occasion and in two years got back to that successful figure in my life. People relied on me, I helped an employee when he tried taking his own life.\n\nMy house burnt down. I physically had to run, from that. but we escaped. Me and my Beautiful girlfriends family. Even got the cats.\n\nAfter 7 beautiful years. I lost her. And, that's my fault. I gave her everything in my heart and head. She knew that I misplaced my heart with someone before I met her. And things came to a boil, and... I didn't want to leave. But we broke each others hearts. And she left...\n\nI lost my job again. And the job I went to school for closed in the same week.\n\nI met someone who loved me but... It's never the same. You hit a stride in your run and you know that you run the best that way. That nothing can be better than running that way away from all those demons. And with her my gait changed. I couldn't run as well anymore.\n\nBut I didn't want to stop running. I could do this.\n\nBut everyone else kept running. Faster and faster and faster and farther...and farther.\n\nAnd now i'm alone again. And I don't need love. I don't need to be loved. I need to stop running. And be happy that everyone else is continuing to run. Run for themselves, for their family... What ever keeps them going.\n\nBut why do we get tired? Why do these events make us loose our breath? Stumble and fall?\n\nBecause I finally get it, i'm not running towards anything. I never was. I could do things to run better, run faster, run farther. But what was I doing?\n\nRunning for others. Never myself.\n\nBut they are amazing people. Running towards their dreams. And If i stopped. They will slow down. But no one is running toward me. I wont be taking the hopes and dreams away from anyone. Just myself.\n\nThey might lose their breath and for that I feel the most guilty. But I've seen one losing someone does to people closest to them. They never forget it. But they won't think of it when the run into the arms of their husband or wife. Or run into the arms of their beautiful children. Or run into their work with the fire of passion and success burning within them. A fire that my death won't quell.\n\nThey will be ok. They will keep running.\n\nAnd in two days I will stop.\n\nAnd let them keep going.\n\nWhy do we get tired?\n\nWe don't. Some of us. Give up. No shame in that. I'm happy to stop running.\n\nI don't think anyone I know will read this, but on the chance they do.\n\nKeep Running.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hn91u0/you_get_tired/", "title": "You get Tired.", "social_network": "reddit", "user": "Tousalouse", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1594176812, "permalink": "/r/SuicideWatch/comments/hn91u0/you_get_tired/", "nsfw": false, "first_save": 1635422320.167727, "replies_charged": false}