{"id": "t5_2qpzs_t3_gd1rt5", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I honestly don't know what to do anymore. I really don't. I'm on my last week of classes and I am going to fail two classes and will probably get a C in the other two that I'm taking. It is a community college, but it is in a well-off area and is known for being a really nice college. I have fallen into a deep, deep depression as I have never felt before. I don't know how to cope with it. I have always gotten almost straight A's throughout high school and college. A part of me doesn't care, but I feel like a failure. I don't know what happened to me this semester. I am trying to remove myself and numb myself from the failure as much as I can (I still want to learn from it, this will hopefully make me a better student). But at the same time, I am becoming more and more depressed knowing that I may not complete my Associate's degree this semester. The worst part is that I am on a scholarship and I may have to pay back some of the classes. I can afford it, but I do not want my parents to know. I live with them, but I will soon move out in three months and make it to university. I am just trying to make it to the point where I move out so that I don't have to deal with their incredibly high standard any longer.   \nWhen I was in high school, I got a B for a six-week report card and I was yelled at for hours. Last year, during my freshman year of college, I got a C in a class and was so upset about it that my hair fell out. I am so upset about this past semester- I feel like the biggest failure.   \nI have always dealt with mild to extreme anxiety throughout my life. I was bulimic for two years, from when I was 14 to when I was 16. I cut myself on my thighs a lot, so my underwear would hide it. When I was 17, I was sexually abused by a couple of friends twice. I have come close to killing myself a couple of times. The most recent being in February. I tried to overdose on pain medication and my mother caught me and talked me out of it. An hour afterward, she was laughing about how dramatic I was being. Recently, my grandfather who I was very close to died of cancer and I was also furloughed from my job due to COVID-19.  \nI feel as if I have no support in my family, I have talked to my parents seriously many times and have been left with \"well, you should try finding a hobby\" or things like that. My two younger sisters are elite athletes, and I feel as if I am looked down upon because I do not play sports, which is big in my family. I love my boyfriend dearly, and I find myself becoming too clingy to him, which I try to prevent. I feel so happy and loved when I am with him, but I know I need to find happiness in myself. I really don't want to drag him down with my problems all of the time and bugger him all the time because I am feeling sad- that's not very enjoyable!  \nI have never had professional help. I tried making appointments this past month, but my doctors won't take me, because of COVID-19 (I don't have it, but it is not serious enough of a problem). I try really hard to get out of my ruts by myself. I overcame bulimia by myself when I was 16, which was incredibly difficult. When I find myself becoming anxious or depressed, I will confide in a friend or workout or journal. But recently, I just cannot calm myself down. I have been becoming so irrationally angry. Working out, drinking water, eating, getting out of the house and healthy amounts of sleep cannot tame this anger.   \nI have been thinking of suicide more and more. I want to kill myself right now, but I know it shouldn't be the solution to my problems. I legitimately do not know how to deal with my emotions. My head is hurting so badly and all I can think about is the sweet release of death and whether I should slit my wrists or shove a dozen pills down my throat. I don't think I'll really do it, but I just can't keep myself from thinking about it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/gd1rt5/i_do_not_know_how_to_cope_with_failure/", "title": "I Do NOT Know How to Cope with Failure", "social_network": "reddit", "user": "easternbumblebee", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1588553213, "permalink": "/r/SuicideWatch/comments/gd1rt5/i_do_not_know_how_to_cope_with_failure/", "nsfw": false, "first_save": 1635422946.9241557, "replies_charged": false}