{"id": "t5_2qpzs_t3_pznn9n", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351", "444f139e-44b6-48f7-bc1a-53fc0ad9ead2", "e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "I've got so much shit going on in my life right now. I have to deal with a DUI charge that is coming up soon in court, I'm living on a tight ass budget, and generally I am trying really hard to wake up every day and see the positive in life, to notice it's beauty, and to try to just make the best out of each day. To reach my goals. To find a purpose. But my problem is that in the midst of this struggle, I am completely devoid of love and intimacy. I feel like if I could just experience that one human need, to attain it, earn it for myself, then maybe, just maybe, all of these other struggles would feel like less of a burden. The fact is that I am plagued by romantic and sexual rejection and have been for all my life.\n\n I try very hard to improve myself and in the past year I have done a lot to become a more loving and social person. Love, intimacy, sex...these basic human needs have always eluded me, and it crushes my spirit. I try to distract myself by immersing myself in literature and the guitar, and generally trying to focus on the more practical, important goals in my life, but I can't always ignore it. The pain of my loneliness always creeps in. In fact, the only songs I've every written, were about the pain of my loneliness, the lack of love in my life. All of the women I was attracted to I fucked things up with somehow or maybe just never had a chance in the first place. It doesn't seem like it matters that there are so many women in the world. I've come to see that no matter who I meet, things are not going to work out. I am never going to be able to develop a mutual romantic or sexual connection with any woman. And it hurts. It hurts really bad. I stopped masturbating and watching porn five months ago. That just makes it hurt worse. I have this crazy desire for intimacy and sex running through my veins, through my very soul, and without fail I will try to have that connection with someone, and it just fails. Rejection every time.\n\n But what is worse, is that I see all of the other men form that connection, and it hurts. I try to be happy for them, but I feel like I'm just lying to myself when I do that. I feel inadequate and this entire aspect of the human experience has made me truly believe that perhaps some dreams were never meant to come true. It's starting to become so hard to live with. The comparing situations is just fuel to the fire. *She's not into me, but she's into him. She would never dream of having a sexual experience with me, but with that other guy they have so much fun together. She responds so coldly to my innocent flirting, but she is smiling and playing along with him.* It's not even the fact that I'm catching intense feelings for women and then getting rejected. I learned a long time ago not to emotionally invest in any woman right off the bat, but now the loneliness has become to much to bear. I can't even watch this stuff in movies or on T.V. anymore. \n\n&#x200B;\n\nSometimes I just feel like life would be so much better if I just had one mutual romantic or sexual connection with someone. All of the struggle and pain and toil would be made easier with that relief, that love, that connection, but it is eternally missing. I Think I just fuck it up somehow, and that is the painful thing about it. It is so natural for so many people. I would thing it would be natural for me too, but it is in fact only natural for me to be alone and lack any kind of love or intimacy whatsoever. I'm so tired of having to distract myself. I don't know if I could ever show anyone my first collection of songs. They are all about the same damn pitiful thing of being perpetually alone romantically and sexually, and all of the frustration and sadness that causes me. And sometimes I just want to take up the drums, just to release the pent up anger this all causes me, because you know what, it is frustrating, seeing all this shit work out for other people, having it flaunted in my face. Sometimes, I just think about taking up the drums and giving up on sex and love entirely and just becoming a social idiot savant who doesn't even bother with any kind of interpersonal relationships anymore and just bashes away on the kit to relieve myself of that pent-up anger towards what I believe to be an ultimately futile situation, frustrating because I will have to live with it for the rest of my life. Goddamn...it kind of makes my existence seem like a cruel joke. \n\nThank you for reading if you did. I have to go back to work tomorrow and try my hardest to better my life situation. Unfortunately is  is always going to be a very sad, lonely time.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pznn9n/the_lack_of_intimacy_and_love_is_too_hard_to_bear/", "title": "The lack of intimacy and love is too hard to bear", "social_network": "reddit", "user": "Potential-Double7210", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 20, "down_vote": 0, "creation": 1633145957, "permalink": "/r/SuicideWatch/comments/pznn9n/the_lack_of_intimacy_and_love_is_too_hard_to_bear/", "nsfw": false, "first_save": 1635423146.3746042, "replies_charged": false}