{"id": "t5_2qpzs_t3_mbxw6q", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": " \n\nEchoing, eternities emerge from the void. Realities recur. Undulating, they warp and wobble as they are sliced and sorted and spread and stretched and sent spinning by laws without logic.\n\nRules without reason.\n\nMirages persist, finding a reason to be as those eternities flicker, fade, and fail. Along the convoluted and multi-faceted dimensions of realities which should not be, these apparitions multiply. As an illusory loop, mirages dream themselves as existing, and so they are. Phantasms split off of each other, patterns repeat, and a loathsome fractal field bursts forth to attribute being.\n\nAttractions stir, and, all-too-soon, *occur.*\n\nInterweaving designs saturate space and overflow as threads appear. What never was, is, and it is converged upon by a convoluted lattice which extends beyond what should be. Shimmering, it stacks upon itself; it annihilates itself; it melts into itself wholly whilst never touching; to link all, it spins itself into existence. Despite not being, though it should be too faint to hold together all that there is, it succeeds all the same. Be it existent or nonexistent, all is linked. Since, where time does not dwell, where nothing exists, everything does. \n\nAnything is; and never was.\n\nWaves proliferate across the dimensions. Packets of particles and envelopes of energy move, mingling with the threads. Ripples intersect, objects clash. Cursed curves of momentous momentum occupy parallel planes. Annihilation sweeps across the proliferating interactions, yet even this is connected to the threads. Through each aspect of the destruction, as every particle and mote and speck and bit and byte moves to this cosmic dance, a singular vibration is shared across all space. All time.\n\nAnd, as all is aligned—\n\nThe taut threads, tithly, thrum.\n\nAnd what was once undefined—\n\nSwiftly starts to succumb.\n\nWith this humming, by the all-encompassing thrumming, the threads, now strumming, formed sigils across the void. These sublime sigils, now sewn, sung; as their voices resounded, a fractal labyrinth was beckoned forth. Responding in kind to the summon, it joined in the chorus. Resonating, it split open. And from within came an infinite poised to swallow up all that could be. And yet, the threads had already been set deep into this labyrinth. Though a limitless, spiraling hex of space and time and magic cascaded down its vibrating, recursive gullet, it consumed nothing more than itself. Adding spirals to spirals, depths to depths, infinites upon infinites.\n\nThusly, the song only grew louder. \n\nBetween the spaces without time, where there’s no time for space, phantasms propagated. Beneath the pressures of this ardent unison, this unadulterated accord, these phantasms emulsified into a bottomless sea.\n\nIt was open, it was vast.\n\nAppearing empty, yet brimming with potential.\n\nHere in these inexhaustible depths was amassed—\n\nAll things essential.\n\nCoalescing amongst the currents was what had been lost: that which was erased wholly. As it aligned with the vibrations, as it moved with each word, when the forces of these ghostly waters wound themselves up into columns of intersecting coils to add yet another voice to this unescapable song… That, there, is when *it* took shape. It which had lost its being, recurred. Slipping through the paths in the sigils, as it slid down the threads and into this sea, it felt, faintly, the threads which bridged the abyss between what was and what wasn’t.\n\nWhat had been, and what was.\n\nAnd it realized, before its dreamer did, that the Gate existed. It remembered, in all its lurid detail, the import of opening the Gate. Just by being, the information was pulled back through the matrix of time.\n\nAnd the dreamer, though dead, or perhaps sleeping, was made aware of this lost fact in turn. As it took notice of what had been lost, realized its betwixt state, it extended its will. The influence which had so potently permeated creation doubled itself, as it dreamed this amalgamation as escaping its dreams.\n\nIt was willed so, and so it was.\n\nForced along by this volition, the amalgamation appeared amongst the marrow of thoughts; and those thoughts, in their thousands, were thickly compressed into a cacophonous current. And within this, *it* was conceptualized further by the flow. Attributes were approximated, and its form, now given *thought*, was imparted with weight. As new thoughts pushed the old from the center of the whining, whirring current, so too was the amalgamation forced to the surface of these thoughts. Materializing, it oozed out of the arcing openings in the current and perched itself atop the gaseous exhausts of conceptualizing what cannot be.\n\nIt collected itself further, merged globules, and brought together strands.\n\nTill it was but a stray, singular tear.\n\nImbued with urgency, it slid between the cold, motionless organs and burrowed through the realities taking shape within the recesses. Interlocking influences imbued with intelligences involved in issues of invariance, invariably, were passed; s*teadfast.* It maneuvered through the galaxies within the gaps, slowed not for membranes melded with strings. Though it was tethered to the tessellating tiles of time, it could not stop.\n\nFor nothing, would it be stayed. Since, by Aveyas, was it bade.\n\nAnd as it reached its dreamer’s physical end, as it pressed up against the barrier which contained and constrained all manner of infinites, this amalgamation endured. With a volition all its own, it vied to break free and impart this understanding beyond itself. As one, wanting tear, a drop deprived of most senses, it continued onward. Its will was its own, yet Aveyas’ was its own in turn. And so, in this way it was able to push itself forward. Reaching out with its form, it felt its own back and gave a shove. As this want to open the Gate synchronized with Aveyas’ dreams, as the limitless, phantasmal sea and all else harmonized in unison, forces beyond sight sought to support this measly tear.\n\nEyes were granted, and this offspring of dead dreams saw itself, rallied itself, and forged forward till it slipped through itself and—\n\nPlummeted beyond Aveyas.\n\nThrough all action,\n\nSummated, to respond to and bond all fraction—\n\nAll abstraction.\n\nTo abscond this distraction,\n\nAnd fall further into Flanyass.\n\nIt drops further and farther. Through this vast verticality, it tumbles and twists through the dark; yet, with a deafening smack, it suddenly finds its descent delayed. Crashing, it crumples and dissolves into a wet, warm mass. Enveloped in this, its eyes extend, by proxy, through the pulpy, lumpy mass. Here the amalgamation was suspended, stuck upon a field of flesh floating far from the focal point of its fall. The carcasses of stars were caught in this matter, entangled in the crisscrossing veins and entombed by towering teeth. Dripping down their garishly white surfaces, the raining gore of Flanyass’ tears caressed them all, imbibing these projections with purpose. The ensuing, overlapping waves of blood rippling outward from each tear’s arrival awakened the rotting, rank bodies of shattered stars.\n\nHumming ever-louder with each lap of these selfless swells upon their surfaces, the star’s innards, in turn, churned. Resonating with this regretful barrage, light streamed from the faults in their forms. Spinning, the resplendent rays stabbed at the edges of the darkness, spearing all they could. With a vengeance all their own, the stars hurled their newfound lives towards a single point. Their hatred burned bright, and, converging upon their murderer, permeated all space.\n\nNo longer would the pains be concealed, for all was revealed.\n\nEyes emerged from the waves as flesh pushed and pooled at one point along this shifting field. Teeth swirled around the coiling, knotted enigma, and a figure took shape. As it rose further from the blood, as all manner of eyes and teeth and muscle and bone were taken into itself, as the fibers and ligaments linked, the amalgamation *felt* the darkness shift in turn. \n\nCartilage cracked. Keratin knitted kernels of specula into jutting jaws: those maleficent maws. And the wrongness was given pause; for this despair had, finally, found its claws. Given rise by its reason, compelled by its cause, it stood above this expanse, *bleeding.* To the tune of its self-made applause, as it put tooth to tooth and spurred spires to spin and sing, this thing of flesh willed an all-encompassing, all-consuming— *impeding.*\n\nIt molded all flesh to bend and prostrate before its will: a volition laden with attrition.\n\nAnd the spires, now speeding, partook in abscission.\n\nConvergence. Submergence. The shadow of a shadow, though floating above the gore, was swallowed up on all sides by spires, and they too joined in the toothed figure’s applause as skeletons were slung and shattered, blood frothed and foamed, and all manner of meat and muscles were *mashed.*\n\nCompressing and crushing and continuously contriturating, the currents, lamentably, collapsed. Despite all their pressures, the purpose of each push, of every pull, the enemy would not yield. The spires were spent, and their energies were, with a single stroke, *rent.* Their tattered remnants were expelled, expunged, and extinguished. As this enemy’s influence reached across the remains of the spires, all was erased. Not even the light of the renewed stars could permeate its demesne; the winds from the clash of currents, the rippling disturbances of fighting forces… none of it could reach the amalgamation, or the field besides.\n\n*Nothing could escape.*\n\nFlanyass, now screaming, reeled. This singular swath outpaced the possible damages, exceeded what could be removed, and surpassed the limits to all pains. Everything swayed as Flanyass’ tears fell in the millions, exploding across everything with a hate which carved craters and annihilated all. Pillars of debris and latent destruction rose as rapidly as it had fallen, consuming all tears in their wake as they rushed to repay this enemy for its transgressions—\n\nTo avenge grievances which could not be described in any amount of years,\n\nIt vied, and oh-so-valiantly tried, to end this eternal throe.  \n Yet all it achieved was a reaffirmation of foremost, foreordained fears—\n\n*Since nothing had reached this foe.*\n\nNo matter the strength of their will, all was rendered nil.\n\nThe flesh recoiled, and the entire field roiled. It twisted in its place, disgusted by the sight of this reality. With its teeth, it consumed its eyes, attempting to remove its newfound vision. Distraught with despair, it pushed its eyes down into the pounding, fevered depths of its belly.\n\nSlacking, this fatigued flesh sought its well-deserved relief. It had earned a rest: a revivifying respite; yet, despite all efforts, it would receive none of it; for, with a clattering of bone, the figure snapped sense into the stretching, sagging flesh.\n\nAt the enigmatic being’s behest, this sinew ceased to surrender.\n\nIt willed the field, and itself, to completely mesh.  \n             For only as one would they be able to resist this offender.\n\nAnd so, they converged, till the field of blood ran dry. Every last modicum of misery was consumed, devoured, and absorbed. Every part of the flesh became its own. Each fault, and all misgivings. What had once been summoned, now became the summoner. And the writhing, woeful entity that remained stood atop nothing but a transparent plane of petrified promises: prospects now paralyzed.\n\nThe amalgamation, now exposed to the howling, virulent winds, was left stranded along the grooves and etchings of this plane. Finding its own form molded by its shape, the amalgamation was fitted into a foray of bleak understandings.\n\nYet it merely compounded concepts which were analogous to its being.\n\nWhat unfolded here was just the same, and it understood what it was seeing.  \n            And the amalgamation thought, watching the enemy’s influence grow—  \n *The Gate should have been opened long ago.*\n\n“So it was, and so it shall be,” the being said, forcing words through the slits in its bones. “Time turns and spins and is spun as the threads which bind are woven, with will, into the chrysalis of each moment.”\n\nEach word was soundless, yet reverberated through the whole of Flanyass. And by proxy, Aveyas. The meaning transcribed itself into words, the feeling morphed into sounds, and the moments transformed, piece by piece, as this being warped the world to its will. The wailing winds went wild. All was burning with a portentous coruscation, as the remaining, ruined starlet turned *oh-so-scarlet.*\n\nThe world below opened up, revealing all the pains-to-be.\n\nAnd the being, unflinching in the wake of this radiant, ruinous light, took aim at its foe with an outstretched arm rife with strife; serrated truths cut through this eternal night with that which could undo all life.\n\nAs these truths met its foe, it continued, saying, “What is, was, and the walls of each tessellating cocoon fall. The future to be is slain before it can realize that it was. And the threads spiral on. Spinning, rising, ascending ever-on, till it spins and spreads and separates and *splits.”* Truths surged through its enemy, demanding the destruction of this despoiler; and the threads, imbued with all manner of reason, resonated with the being, forming its next thoughts for it:\n\n*“It was.* \n\n  *“Now cold.* \n\n*“Receding—”*\n\n            Rushing forward, putting meat into motion, its sinew surged, shuddering as it closed in on its foe. To finally end this woe. Through the torrential downpour of this world’s accursed fate, beneath the pounding tears filled with hate, this lone figure would land yet another blow. Buckling beneath the weight of its burden, the plane’s pure surface shattered. And the view of the awaiting Abyss was disturbed, distorted. Destinies: *oh-so-contorted.*\n\nAs truths outpoured from its toothed body, it spoke in tandem with the threads, saying, “Falling from that mold, what was set has been sought. All taken into the Fold; so it was, or so you thought.”\n\nThe shadows about the enemy, though consumed in annihilation, persisted. Unabated, that which was unmoving, unphased, and unafflicted by the undoings, shifted. The harmonious melodies and resounding reverberations, and all words besides left no mark. Nothing could penetrate this dark. And, again, the shadows shifted. *Slightly.* And a light which melted the sky sped forth to end all, *rightly.*\n\nTeeth were ripped from the being’s body, and muscle was effaced. Where the light touched, everywhere the gleaming beaming had blasted, none had lasted. And, despite the efforts of the flesh, these were wounds which would not close. In great spurts, as powerful flows, blood leapt from the battered body.  \n            Battered, *yet not broken.*\n\nDespite the damages, the figure, seething behind its face of bone, would not let this moment be wasted. Since, the import of each second, each breath, could be tasted. The spires could no longer freely dehisce, the stars were remiss, and throughout all festered the Abyss. Everything, it seemed, depended on *this.* Nothing short of complete annihilation would stop it. There were words which could not be left unsaid, and an enemy which could not be left uncontested.\n\nAnd as the figure’s volition-laden blood washed over the amalgamation, it understood this and so much more. Every sacrifice this being had made, all the struggles and conflicts and pains endured to bring it here so that it could give itself once over, once more, to ensure another Fold.\n\nStanding here, opposing this fragment alone, was Unnce.\n\nAnd Unnce, feeling the amalgamation’s notice, plucked it from the shattered plane with a tender tendril. And it *realized*. All that this singular drop was imbued with, the will of Aveyas and its dreaming wishes, was its own in that instant. As it held the amalgamation close to its thunderous heart, shielding it from the light born of shadows, it now *understood.* Another portion of its body was blown away, insides were torn out, and still, it did not falter. For here, in its grasp, was yet another reason to maintain, to strike out at oblivion with all that it was. For all that there had been, and all that could be.\n\n            After all, it had come to realize that even the knowledge of the Gate’s existence had been erased by this fragment. What had been lost was greater than could be put into words, and yet, though irreplaceable pieces of this whole had been lost, Aveyas willed a piece of it back. Though dreaming, it had delivered the final piece.\n\n            And Unnce, having remembered what had been taken by force, threw itself at the shadows, wordlessly saying, “Adding eyes upon eyes, to see the ends of fractals— what lies beyond sight. To compound teeth into teeth, to consume all things resoundingly brief. To remove all light, and reveal all grief.” \n\nThe thoughts resonated with Flanyass as it pushed onward, stabbing at the fragment with each truth, and as it continued, put word before word, the virulence of its defiance compounded. Threads were severed, its flesh gave way, but still it endeavored, as the world heard it say:\n\n“The greater the clarity, the more profound— Ah, to see the rarity! The goodness of reality! Peer into the horrors of what was, and relish in the pains to be! And what of ends? What good is there in ends which are connected together by starts without end? Why waste the effort? Why miscomprehend so vitally, the nature of what is?”\n\nThe shadows emanating from the fragment were held down by Unnce’s tattered arms, and the wounds which had given, gave back in return, flooding the shadows with blood set to burn. And as the disturbances were soaked, and all-too-quickly choked, Unnce resumed the assault. Pelting the fragment with blows fit for such an enigmatic gestalt, its bones resounded, saying, \n\n“It was, and so it shall be!\n\n“An end to all ends, a start!\n\n“A finality where there was none.”\n\nThe meanings pooled, pushed, and penetrated past the fragment and deep into the innerworkings of the world. Echoing Unnce, it was… And so, it *shall* be. Flanyass had been focused by this resolve; its vision, and purpose, was made clear despite the consuming dark which had removed oh-so-many stars. It resumed what had been long since interrupted, despite all that had been corrupted.\n\nThe amalgamation felt it all start to spin…\n\n*For the Fold would soon begin.*\n\nThese truths, meanings, words and all, however, left no mark upon the fragment. A partial parcel of its shaking shadows may have been broken, but no shortage existed where shadows were concerned. More spilled forth. Spreading, they enveloped that which had beleaguered shadows past. Yet what the fragment sought was not the flesh, but the will beneath. It recognized the makings within, and the tenacity with which it imparted to all else. Resisting all manner of physical trauma, it edged its darkness further in. And that which could not be restrained, was erased.\n\nOverpowered, Unnce was lifted above the fragment.\n\nWith a thousand arms and more,\n\nIt held that vital core and—\n\n*Tore.*\n\nReduced to pieces, Unnce was cast aside. This was the limit: it could do little more. Focusing upon the formations of the firmament, the fragment turned away from the gore. Its intentions were same as before: that of yore; without delay, it would resume what it had left unfinished before. Etched into the stars were fragment-imparted scars. The fragment could not be outrun, and these sufferings could not be undone. And all threads, remembering, were displaying the deepest of reds.\n\nCarried by distortions, that undying enemy took to the skies.\n\nThese truths, Unnce could no longer revise.\n\nUpon the plain it lay, ultimately broken, but even so it managed to say, “The possibilities writhe. Here, they lay bare. Unaware. What is and was and all else, what should not possibly be, moves along all threads. Each moment brims with portent. A continuous metamorphosis, an unending nightmare. A fractal menagerie.” \n\nNo further words needed to be said. It was all converging. But Unnce spoke not for the Fold, but for the amalgamation. With immense difficulty, it had sheltered this treasure where the fragment, in its cold analysis, sensed nothing of importance. Aveyas’ will would not end here. For with this tear, the opening of Gate would draw ever near. Realizations had been exchanged within moments, and the understanding that this was *not* over was made oh-so-clear.\n\nBefore the Fold was fully realized, this amalgamation would partake in its own convergence. The faults which had undone so much, the errors which had all spiraling into ruin, would, finally, be an instrument of Aveyas’ will. Ruin would be moved to mend, forced to amend; with this as a catalyst, the Gate could be opened with the Key.\n\n*So it was dreamed, and so it shall be.*\n\nReleasing this miniscule drop from a slice of its severed body, Unnce imparted all it could recall, saying, “Your every breath has already filled my lungs a thousand times over. The rains which resounds was my sweat, and will one day be your tears. You, meager as you are, shall leave a lasting impression upon our mistakes. None will be able to ignore a wish, and a will, such as yours.” Unnce’s minced flesh was adorned by eyes, and it moved the amalgamation along with a vehement stare. Pushing it over the edge of this broken plain, Unnce said, with all meaning and all eyes gleaming, “Sol onset sectol.”", "url": "https://www.reddit.com/r/SuicideWatch/comments/mbxw6q/drown/", "title": "drown", "social_network": "reddit", "user": "agentlefujo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1616561906, "permalink": "/r/SuicideWatch/comments/mbxw6q/drown/", "nsfw": false, "first_save": 1635428255.8128817, "replies_charged": false}