{"id": "t5_2qpzs_t3_hcb2c3", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "Why exactly is life worth living?\n\nLife is suffering. I have a hard time believing that anyone experiences more or even equal amounts of joy to pain in life, but everyone pretends as if they do. No one cares, and no one loves each other.\n\n​\n\nAs I grow older, all of the hobbies that I used to enjoy don't make me happy anymore. Hiking, Kayaking, swimming. After doing whatever activity that I'd set out to do, I'd sit and wait for my feeling of accomplishment, but nothing came. Yard work, writing, playing video games. I can see that I'm making progress in what I'm doing, but I just can't find it in myself to care. Nothing is fun anymore. The only thing that makes me feel anything anymore is certain TV shows and anime.\n\n​\n\nSure, I could probably abandon my current life and go do some instant gratification bullshit for a few weeks, but after the adrenaline and dopamine wear off, I'll come to the conclusion that \"well, that was fun, but nothing can last forever. Even if it can, it'll get old soon enough.\" and need to return to a way of living that is sustainable.\n\n​\n\nIf you try for discipline instead of hedonism, then you realize how quickly all of your efforts can be destroyed, and everything you've built over the years can be toppled down into nothing in seconds. Without amassing power, you can never leave a mark on society. You will never be remembered. If you do amass power, it can be taken away from you in an instant. \n\n​\n\nI am a man without power. Power can mean many things and is usually a combination of things. Maybe it's money. Maybe it's charisma. Maybe it's intelligence. Maybe it's physical attractiveness. Maybe it's a skill in a trade or sport. Most people have some amount of power; societal influence. How much your opinions or advice matter to your friends, family and peers. How much you exchange with, help, or interact with those around you. How much you matter. \n\n​\n\nI don't have much power. Even if I did, I doubt I'd be any happier. Sure, there are certainly things that I'd like to improve, but I feel that the more power you get, the less satisfied you are with what you have and the more you want. When I started playing League with my friends, at first I just wanted not to drag the whole team down. And then once I got to that point, then I started wanting to do even better and be as good as the best of my friends, and so forth. Nothing is ever enough, that's just part of the human condition. \n\n​\n\nI believe that the majority of humanity lives in silent suffering, this because of a large social construct. The reason that depression and mental illness is taboo is a way for society, and therefore us as a species, to protect ourselves. The more ignorant that we are to our plight, and the less we acknowledge it, the better we can continue on with our lives. Continue to breed, continue to be productive, continue to drive our species forward. If all of society as a whole truly recognized the absolute futility of life without any sort of bias, universally accepted by everyone, it would be the downfall of civilization. \n\nTLDR: We're like worker ants. No individual ant matters, just the whole. They make sacrifices and are probably never happy, this way the hive continues on.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hcb2c3/posted_this_in_a_comment_before_but_seriously/", "title": "Posted this in a comment before, but seriously", "social_network": "reddit", "user": "Stormypwns", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1592608477, "permalink": "/r/SuicideWatch/comments/hcb2c3/posted_this_in_a_comment_before_but_seriously/", "nsfw": false, "first_save": 1635428486.1366205, "replies_charged": false}