{"id": "t5_2qpzs_t3_qe1cuc", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "My name's Damont. I never felt depressed until I was a Sophomore in high school. I had my first depression episode when I realized how much I missed my stepsister, my first best friend. As high school went by, I found myself becoming more and more sad. Staying up every night for homework, not eating breakfast, not even dinner, eating too little, eating too much and not eating some days. The homework they gave us alongside the tests and projects was so much work. It was honestly the biggest pain in the ass for me. I wasn't exercising like I used to, I had more coffee in my system than actual water, didn't go to the doctor when I needed to because I wanted to finish homework, it was terrible. Me or the other students couldn't do much about it. It was either preserving your mental state with much needed breaks and time to relax or sacrifice the health you can't see in exchange for a good grade. There was probably some silver lining but I was too stupid or stubborn to do so. I thought about ending my life so many times, so many people were concerned for me because not only was I doing my work, I had to make sure quite a few friends of mine passed too. When graduation came earlier this year, I honestly worked enough for 3 more diplomas. \n\nTimes passed now since then. I'm not doing school work, taking a year or so off before I start college, but despite not being around school, my feelings never left. Even when my senior year was near an end, I still felt sad inside. It's as if all the happiness and care I had left my body and an empty shell of pain and emptiness walked on stage and accepted the diploma. Even outside of school, I had plenty of events that pained me in ways I couldn't show my friends; my friends had cars, girlfriends and even jobs before me, better grades than me, better looking than me, nearly better than me at everything. I hated everything about me and the reason I thought I felt this pain was because of high school. All the work ruined my mind and now I'm stuck like this. This however isn't the case. \n\nFeeling sad because of the all the work, wanting to die because I was killing myself for grades, this was all a lie. It wasn't until a few weeks ago that I learned the truth. High school didn't make me suicidal, it just stripped away the illusion and revealed what was already there. I'm done with school but I feel even sadder and worse. I've been sent to a mental health behavior hospital, had multiple friends talk to me, I've made plans in case I suddenly \"disappear\" and I'm contemplating making drafts for a suicide note. I want to get help, I really really want to, but being a 19 year old black kid, it's not as easy for me. I was raised with a suck it up attitude. If I talked about my feelings around my friends, I got made fun of, scolded, brushed off and laughed it. I told my best friend I was suicidal once and she literally said \"fun\" as a response. Past experiences have made it hard in the past to come out and how I was raised makes it even harder. Even typing this and sharing my story on a reddit post goes against everything I know. I wouldn't do this 5 years ago but I'm not the same person I was back then. I'm gonna feel like shit for this and it's gonna gnaw at the back of my head but it's something I need. But I shouldn't be suicidal! I have a home, a good job, great friends, loving family, everything I could want...yet it's not enough. Somehow there's an emptiness in me that can't be filled and I fear it never will. It's as if I was given all the tools to be a Nurse, the training to be a Nurse, the money, time, schedule, insurance and plans to be a Nurse, but I'm missing the passion and motivation. I think that's what it is. I have everything I want and need to have a happy life but even when what I'm given, I can't find happiness. Perhaps I never will.\n\nI am suicidal. I don't really want to die but I don't want to live either. I'm just not happy with my life and I think I want to die because I hate who I am. I hardly open up about my feelings, I don't cry about anything. Even when 2 of my friends were murdered, my great grandmother died and my dog died, I couldn't even bring myself to shed a tear. I've almost jumped off multiple buildings, damn near fell asleep on train tracks, left knife marks on my hand after pressing on a certain area for so long, almost ate all the pills in my medicine cabinet and contemplating shooting myself with my stepfathers gun. I don't even know why I'm posting this. I guess I'm too weak to handle things on my own, or maybe I'm finally maturing and realizing that I don't have to be alone anymore. Who knows.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qe1cuc/im_suicidal_but_in_a_way_i_do_not_think_makes/", "title": "I'm suicidal, but in a way I do not think makes sense. I love my life, I love what I have and what I can do, but at the same time, I'm missing the passion to live it.", "social_network": "reddit", "user": "DamontVanDerLinde", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634979948, "permalink": "/r/SuicideWatch/comments/qe1cuc/im_suicidal_but_in_a_way_i_do_not_think_makes/", "nsfw": false, "first_save": 1635428183.35602, "replies_charged": false}