{"id": "t5_2qpzs_t3_bjgh08", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "I am a severely anorexic and depressed 23 year old male, I have no appetite for food because I have no appetite for life. What's the point eating food when you don't want to live in the first place? Since food is what's keeping me alive. I really want to die but too scared to physically kill myself in case I mess it up and end up still alive but worse off physically. I'm terrified of physical pain and the sight of blood so that doesn't help lol. I'm always trying to starve myself to death, sometimes not eating for a few days up to a week but I always end up eating on the brink of starvation because food tastes so much better when ur about to starve to death. Eating food regualrly like a normal person tastes like nothing to me and is a pointless excercise when ur as depressed as I am. Also food causes u to eventually need to shit and I hate taking shits because my bathroom is disgusting and I never clean it because what's the point, I don't want to be alive anyway and don't plan on living another day. There's no hope left for me now I've been starving myself for over 10 years the damage ive done to my body is irreversible I just wanna die now. My soul is completely gone and I'm 100% dead and hollow inside, just wish I had the courage to kill myself. This post is gonna get buried and never seen by anyone because who gives a shit about me, I sure don't lol. But if anyone does happen to read this and has useful advice it would be appreciated. I'm in a bad place mentally right now, more so than usual.", "url": "https://www.reddit.com/r/SuicideWatch/comments/bjgh08/anorexia_caused_by_depression/", "title": "Anorexia caused by depression?", "social_network": "reddit", "user": "AlwaysNang", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 37, "down_vote": 0, "creation": 1556713514, "permalink": "/r/SuicideWatch/comments/bjgh08/anorexia_caused_by_depression/", "nsfw": false, "first_save": 1635422251.0402567, "replies_charged": false}