{"id": "t5_2qpzs_t3_q8757x", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb", "929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "Hi, all.\n\nOkay, so here goes.\n\n\nI'm a 23 year-old man with Asperger's Syndrome, and I've been experimenting with my sexuality since being 18, having had no prior contact in any way. Initially, after my first sexual encounter, I explored 'sexting' through the 'kinky' communities on the\nAmino app, through 'role-playing' with young adults like myself.\n\n\nI watched the tamest pornography from the age of 13 1/2 onwards till being 23, yet always had moral issues with it - I'd never fail to get emotional over recognising the humanity of the women and men in these videos - \".....This is somebody's daughter/son!\", is how I'd think, even though everybody was a consenting adult.\n\n\nI'd feel irrationally guilty every time I watched a clip, feeling as though I wasn't a 'real feminist'. This would lead me to clean obsessively around me, to feel better.\n\n\nThis is tied into - and emblematic of - my lifelong OCD, and specifically, the pure-'O' that I've experienced since mid-2019 - I'd see only moral absolutes, no nuance. \n\n\nSo, in my later teens/early twenties, I went on a few dates and enjoyed the company of the women I'd been with, yet consistently felt as if I'd prefer just being their friend, as a new friend was really what I was searching for, having not made one since the end of high-school (aged 16, in 2014).\n\n\nAlso, due to my special interests being somewhat obscure, I always found myself having no kinship with my peers, and so I found it hard to sustain even an acquaintanceship. \n\n\nThis was in spite of me trying as much as possible to ingratiate myself into the interests of my peers, so as to better understand them.\n\n\nI later made a new friend in 2019 who lives close to me, and formally abandoned dating apps then.\n\n\nLater on, after an online relationship that failed due to a lack of emotional reciprocity, I began to feel what little semblance of a labido I once had fail, to the point where I felt no longer sexually attracted to anybody. Now, I'm pretty certain that I'm asexual.\n\n\nThis conveniently fits in with my life-plans of not having children or a long-term relationship (both of which seem very stressful).\n\n\nAll of this said, I've been endlessly ruminating on what constitutes sexual harrassment since the 17th June 2021, after being mentally reminded of awkward attempts at flirting that I'd participated in.\n\n\nSince then, I've read so much about MeToo & Time's Up (as I have done since 2017), made a list of sexual misconduct behaviours to 'check-off', and looked at a dozen + forums online about sexual harrassment.\n\n\nThe instance I'm worried about specifically is a time in the summer of 2020 (before I realised that I was asexual), where I found a woman's blog on Tumblr who had been asked sexual questions by men, and had responded somewhat positively. \n\n\nI thought, \"Maybe she'll respond to me, if I send a question!\", and because I wasn't as confident as the other men, I asked a three-letter double entendre/innuendo, followed by a question mark.\n\n\nHere, I was trying to mirror the confident sexuality that women have shown me in person and online. \n\n\nA lady recently said to me on Reddit that it was the equivalent of making an awkward attempt at flirting in a bar/tavern, and as long as I backed off immediately whenever I noticed their lack of interest (as I did here, and have done prior, always), then it's not harrassment.\n\n\nMaybe she's correct, in the sense that in a real-life situation, elements that were absent on the Internet would be present, such as prosody/intonation, body language, facial expressions, etc. \n\n\nHer reply made me feel a bit better, but I still feel like a bad person who is akin to Harvey Weinstein or Bill Cosby. \n\n\nI feel awful that I might have hurt a lady, but I also wonder if this is just my OCD 'making a mountain out of a molehill'. I'm not trying to gain help on courtship, since after this long journey of self-discovery, I've unsurprisingly realised that I'm not at all 'kinky' or interested in sexual relations or romantic relationships etc. \n\n\nI'd just like to reflect on my past actions and be able to walk into the future with a clear conscience, so I can still call myself a feminist and be an ally to women and a good human being.\n\n\nMy mother agreed with my suggestion I have an 'overactive conscience' (a line from Frasier), so I don't know if I'm just worrying about literally nothing, or if I'm a dreadful human. \n\n\nI don't want to kill myself, but I feel compelled to if I'm a terrible harrasser.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q8757x/why_am_i_a_bad_person_i_feel_like_i_have_sexually/", "title": "Why am I a bad person? I feel like I have sexually harrased somebody, and I can't live with the guilt or shame.", "social_network": "reddit", "user": "Parking-Review-2297", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634240475, "permalink": "/r/SuicideWatch/comments/q8757x/why_am_i_a_bad_person_i_feel_like_i_have_sexually/", "nsfw": false, "first_save": 1635426170.2055252, "replies_charged": false}