{"id": "t5_2qpzs_t3_ast0sr", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "Edit: I forgot the TL;DR at the bottom 🙄\nEdit 2: grammar/syntax (still likely missed some)\n\nI spent my whole life (I am 39, may be “young” but still-it has been my whole life...[so far](https://youtu.be/bfpPArfDTGw). ..anyway, “forever alone” minus a couple major regrets and wasted time. Now I have someone who loves me, who MARRIED me, and if all I ever had to do was be homemaker sans kids (cause I can’t have them nor want them) I think I would be okay. I love being married, though I think everyone has a breaking point and what if my continued decline causes marital trouble?\nBut it isn’t like that. I married a janitor. I married for love after years of seeking security. \nI have PCOS which has caused nearly every physical ailment I have/had, including cancer. Now I can’t work cause I’ve become so anxiety-riddled I have attacks simply leaving the house alone. \nI am an independent fucking woman. I have had a steady job since I was 14, usually 2 plus going to school, and then college...and now I cant work??!! (I don’t even have life insurance to give my spouse that protection were I to have a fatal entanglement with a tree on that section of road people have argued over forever to have a guard rail placed).\nI don’t feel like I belong here anymore. Alive. In this time and place. Other than music, poetry, marijuana (in doses for pain and sleeping), and my spouse, I feel like I woke up in someone else’s life with no escape and these feelings have been building for years. Im afraid, as science shows time and again, pressure and time is all it ever takes to break something down. \nNo I don’t believe in any religion. Nor do I vehemently oppose the concept. I think any potential creator and all their intentions have been perverted, and strategized, to get things the way the old men wanted, protecting slavery among the myriad of reasons why I believe all religions are manmade. So, no, I don’t think prayer is the answer. I don’t believe in any hell. I am most open to our being a form of energy, that we all live on a spectrum during the time our energy is here in this place At one end, like a number line, are people lacking some necessary components for life, the vast majority are somewhere in the middle, and then there is the other end, which, despite its infinite continuation, reaches a cap on acceptable in today’s society, like athletes, child prodigies, performers of various arts, even the brave skydivers and people who join the military, all the way over to Newton, Einstein, you get it-they all have MORE than the average people, more capable, more agile, faster learners, [insert talent here]. They are survival of the fittest, literally. But outliers exists on both ends. \nIm not sad Im not +2 or +3 on life’s graph, just as I struggle between empathy and gratitude for not being on the other end where all those people matter too, because no matter where we are, we share three things in common: we are all human, we are all alive, and one day we all die and leave these bodies, maybe because as age we cannot contain the level of energy needed to sustain it. \nIm just sad to be one of the many in the middle. No clue who I am. Who I should be. I have a degree, its corresponding debt, but no one finds an undergrad degree anything more than the first step toward progress in your profession... I’ve worked so many jobs in this life trying to figure it all out and I all I know is what everyone else from middle tries to say they have the answer. \nTo what? To jump on a hamster wheel too? To only read about people who are thriving while I merely dane to exist. I dont want to “live” that way, making sure my house and my clothes and my body shape, size, tone, voice, eye or hair color, smile or height is acceptable. Really? To fill my world with social media, not for its many benefits, but to make myself appear societally acceptably happy? Guess what. \nI think we have things very wrong in this life, fueled by greed, status, and constantly being sheeple. \nIs the answer suicide? Or is it recognizing where I feel comfortable or don’t? (Mosh pit=no...on the beach with my toes in the sand, feeling the surf and smelling the salty breeze and hearing the roar and crash of the sea=yup). If I made a list of all I’d miss, they are wonderful, but they neither improve nor change the circumstance in my life that made me start typing. \nWhat makes me feel out of options is that the world today is not only regressing in every possible way, but it’s focus continues to grow into a money-hungry, litigious, overly-divided, maximally intolerant, and inescapably negative society.\nTo be clear, I am not flippant about life or that others have it way worse just like others have it way better. I just recognize that each person lives within their own reality (sometimes to the exclusion of reality, ahem POTUS) and some are lucky enough to be on the area of life’s spectrum to grant a more rewarding life, while others require round the clock care and would punch me for thinking I am taking life for granted. I’m not. But Im not sure how much longer I can live the charade in contrast to my true self, which still requires much study time even begin to understand. Maybe this world is falling apart and some of us don’t want to just be the middle-of-the-spectrum-average-sheeple pink mist, we want to go on our terms. \nThere is hope, because even without my causing it, one day will be my last morning. \n\nTL;DR what’s the point? I think I am nearing done. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/ast0sr/fuck_the_sob_story_we_all_have_one_yours_probably/", "title": "Fuck the sob story, we all have one. Yours probably kicks mine’s ass anyway. But, that doesn’t change the fact that I wake up every day disappointed that I woke up. Whatever “normal” is, this isn’t it. Sorry it’s long. But even without all the sobby details, it’s a lot. TL;DR at bottom. I’m new.", "social_network": "reddit", "user": "whomadeyouright", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1550693251, "permalink": "/r/SuicideWatch/comments/ast0sr/fuck_the_sob_story_we_all_have_one_yours_probably/", "nsfw": false, "first_save": 1635427173.9744997, "replies_charged": false}