{"id": "t5_2qpzs_t3_qh9jpy", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "I have borderline personality disorder, living in a small city. As a gay male, dealing with the gays I know I’m the problem (sort of), I don’t handle being habitually blown off by guys. It angers me. It angers me when guys then tell me they got fucked raw in the interim essentially showing and stating I’m not worth it. Over and over again.\n\nI’m sick of not being good enough for anyone. I’m sick of everyone listening to other people about me. I’m sick of all the people that can’t give me the literal fucking two minutes of their day to me. \n\nI’m super abrupt with texting and direct. \n\nToday a guy hates me because he explicitly stated four times how far I am but what a catch I am. Then why the fuck can’t you visit.\n\nI’m sick of being a downer to my friends.\n\nI’m sick of my tms sessions getting pushed back.\n\nI’m tired of being average.\n\nI’m tired of being unwanted.\n\nI know I’ll die alone. I just want to experience someone caring.\n\nI work all day. Come home home to an empty apartment. \n\nThe only thing that’s keeping me here is my dog because he would be lost with out me. My mom most likely would go catatonic because she would blame herself even though I’m just not really meant to be alive. Living.\n\nIt’s like my best friend from childhood died in a crash. He was intelligent had friends going places. I’m just some fucking disease of a person that clearly kills anything he touches in terms of a relationship perspective.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qh9jpy/just_over_it/", "title": "Just over it", "social_network": "reddit", "user": "thedemoncowboy", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1635377482, "permalink": "/r/SuicideWatch/comments/qh9jpy/just_over_it/", "nsfw": false, "first_save": 1635426889.4094234, "replies_charged": false}