{"id": "t5_2qpzs_t3_o38te6", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "\nHello. I’m not well mentally right now. I’ve decided that I’m not going to go out of my way to do anything stupid but if the chance or option comes along I feel like I just might do it. I’m so tired of feeling this way. Hurt, broken, depressed. My life has been nothing but a disappointment. Yeah there’s been good there’s been great but everything else is outweighing it. Whenever wrong occurs in my life it triggers other wrongs if that makes sense. And it seems the worst is upon me. I’m 25 and I feel like I’ve lived a lifetime. I was forced to raise myself at the age of 10 due to drug abusive parents who abused me mentally, physically, and emotionally. Moved back and forth from crack house to crack house to meth lab. Watched my father perish. Watched my mothers teeth fall out over time. As I got older I tried to get them help but it never worked out. I tried to give them chances but they just kept on. Just one more chance just one more chance. Nothing ever came of it. I overdosed on Xanax one day when I was 14 and blacked out. I walked into traffic and got hit. Broke my leg and it caused a heart condition that I still live with today. I’ve had 2 leg surgeries and 2 heart surgeries. Still not having anywhere to go but back and forth to my mother and father I dealt with it. Up until I graduated from high school. It’s 2014. Literally the day after I graduated. I thought my mother was doing good I thought she was clean. Until I found crystal meth while I was packing for a vacation I was leaving for the next day. That was it or so I thought. What was supposed to be a vacation to go visit my brother up in Tennessee for a week turned into me living with him for 6 months. Until my mother begged me to come back telling me she was clean swearing to me it would never happen again. So against my brothers judgment I went back. 2 years later. It’s 2016. It was happening all over again. Finding paraphernalia all over this one bedroom apartment. Her taking advantage of me and my paychecks. Taking my money I’m earning to go buy whatever she wanted to use that day. Why did I let that happen?? I told myself I can’t do this anymore. I don’t want to be around this anymore. I called my brother and he let me come back with the rule for me to work on myself and my future. So I moved in and immediately found a job. I met a girl a month later. 5 months later it’s 2017. I saved up enough to finally get my own place. I moved her in with me. I was falling in love. Some years passed. It’s 2019. We vowed to each other that it would be our year to do anything and everything we wanted. I took her to FL for vacation. Did the whole tourist thing. I proposed. We went to festivals and concerts. Both got new and better paying jobs. Are healthy. Had a beautiful holiday. We lived an incredible year. The best year of my life. Then 2020 hit us. Things were fine at the beginning of the year but I mean fine… that’s it. I don’t know what happened we lost something. I get a text in the middle of a summer day. From some dudes ex telling me she slept with him in my bed a few days before. I was so confused. How? Why? Wtf??!? I went home and waited for her. I confronted her. She confirmed and I kicked her out. Her stuff was gone by the end of the day. I was broken. I just spent 4 years with someone and they broke our trust. I was wrecked. Friends came and supported me trying to give the best advice they could but I didn’t listen. Something inside of me wasn’t finished with her. I was still in love with her and I wanted her back. Not even 2 weeks later she was back in our apartment. Against everyone’s advice. Lost friends over it. We talked more than ever about us. We communicated more than ever. She was showing me how sorry she was. She seemed so happy that she was back. We were going out spending as much of our free time together as we could. We were back to ourselves. Being who we were together. Friends came back around and saw I was happy and that she was the reason. We were a group again. Going out together just bonding as a group. 3 months ago I took her to downtown Atlanta. She really wanted to go to the aquarium and do the whole world of coke thing. So we did that. I got us a carriage ride around the city and I proposed again. She said yes! I was so happy. I had my girl back. She wanted to start planning immediately and we set the date. July 15th. We got everything ready. Venue paid for. Invitations sent. Food and drinks taken care of. Wedding clothes secured. During this time of us getting everything together we’re communicating and discussing us and our future together. We seemed to be on the same page. We even took a little road trip with our friends for a weekend to celebrate a month ago. 2 weeks ago I wake up to a “we need to talk text” from her. She ended it. Told me she’s been playing a part and she can no longer. Told me she didn’t want to be married. Didn’t want to be with me. Told me we’re both on different paths. Told me we shouldn’t have to make compromises for each other. None of it made sense, she wouldn’t tell me why? She wouldn’t tell me where this was coming from… 5 years of committing to her. I moved to the city with nothing. I built a foundation for myself and her. Made friends with her. So many memories with her. Had a life together all for it to end through texts. So selfish. I did nothing to her. It’s now right now. I’ve left the city. Moved 2 states away. Transferred jobs and now I’m alone. I had to leave. I was in love with her in a beautiful city I only wanted to be with her in. Everywhere I went everything I saw was a reminder of her and us. I left my friends. I left my brother. I left a city I made my home. I’m so broken. Life seems over for me or so it feels. These little breathers of happiness every few years aren’t enough to make me feel anything other than a joke. I feel disgusting. I feel worthless. I won’t go out of my way to do anything stupid but if death comes to me I’ll take it’s hand.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o38te6/figured_id_try_this_instead_of_a_hotline/", "title": "Figured I’d try this instead of a hotline…", "social_network": "reddit", "user": "AnthonyTimes", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1624079553, "permalink": "/r/SuicideWatch/comments/o38te6/figured_id_try_this_instead_of_a_hotline/", "nsfw": false, "first_save": 1635426214.9578543, "replies_charged": false}