{"id": "t5_2qpzs_t3_q0pq8u", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351", "e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "My country was torn apart by war. \n\nMy family is dysfunctional as hell. \n\nThe moment I was born my mom was chronically sick and we had to take care of her. \n\nMy brother has Down syndrome and my parents fought most of the time. \n\nMy father was absent throughout most of my childhood and even when he was physically there, he was never really 'there' , or even worse, he was there just to complain. \n\nI was forced to study and work in something I hated, and just when I was finally able to escape my country and pursue my dreams, everything came down crashing because of covid. \n\nAnd now when I am trying to just accept it return back to work, even though I hate it, the world just won't let me because I am a refugee, and my working permit keep getting declined. \n\nI have to live off on welfare support and accept pity from others, because I am not even allowed to work even though I am more than capable of. \n\nAnd people wonder why I don't want to live? They think there is some kind of 'chemical imbalance' or some bullshit, because who is in his right mind would think of killing himself?\n\nWell guess what, I believe only an insane person would not be depressed living in such a crazy world.\n\nAnd what's making me even more angry and hateful, is that people tell me my way of thinking is abnormal, even pathological, like it's some disgusting disease that needs to be eradicated. \n\nNot a single one of the so called 'helpers' tried to even understand and validate my feelings. \n\nThe stigma of having suicidal ideas is so much prevalent that everyone is just too afraid to acknowledge its legitimacy. \n\nAnd to be honest I am tired as hell and I don't think I can keep on fighting alone. \n\nI am trying to keep on pushing, keep on living, but it's just too damn heavy.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q0pq8u/a_normal_response_to_an_abnormal_world/", "title": "A normal response to an abnormal world", "social_network": "reddit", "user": "KaiBuTsu91493", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1633291942, "permalink": "/r/SuicideWatch/comments/q0pq8u/a_normal_response_to_an_abnormal_world/", "nsfw": false, "first_save": 1635423149.3383725, "replies_charged": false}