{"id": "t5_2qpzs_t3_qbsxg6", "request": ["4162f604-29a0-4041-a85b-c249e1ca13f8"], "text": "I’m 17 and a senior , a lot of shit has happened and I wouldn’t even say that has caused me to be depressed. I’ve had anxiety since I was very young and it’s basically all I can remember about anything in my childhood. The fear of failure my father drilled into me. I was burnt out by 13 I would not take showers , binge eat, watch shows in my disgusting ass room all day, literally mastrubation was my only source of happiness. Since then I haven’t been able to get rid of my depression. Last year I was the happiest I’ve ever been , I was managing some how until I lost all of my friends and was severely bullied at school emotionally and physically, I had an older boyfriend who got me into some pretty traumatic acid trips to “make me feel better” after that and it really all went downhill from there I couldn’t show up to school I hated myself so much I failed my junior year and somehow made it to senior year this year where I’ve moved to a new school not even any better I can’t make any friends because I’ve lost all parts of my personality I don’t even know who I am anymore. I’m exhausted, I hate myself, I’m back in the same boat of depression so desperate to just fucking get out for good but it feels like it will never happen. I’m so exhausted. Like even physically I can’t do anything I procrastinate any work I stay in bed and feel sorry for myself and all my parents have to say is that I’m fucking lazy and the real world is going to hit me soon and it just sucks because they haven’t noticed anything at all. They haven’t noticed how skinny I’ve gotten or how I don’t laugh anymore or how wrong it is that I’m in my bedroom in bed sleeping every day all day and all I do is feel guilty about it because they make me feel worthless. It scares me because I don’t want to die but it seems like more and more the thoughts keep coming that it would just be so easy because I don’t care about the future I don’t care about anything and I’m just scared because I’m so alone I just hate myself so much", "url": "https://www.reddit.com/r/SuicideWatch/comments/qbsxg6/im_so_depressed_i_have_no_idea_what_to_do_anymore/", "title": "I’m so depressed I have no idea what to do anymore", "social_network": "reddit", "user": "444Infinity_", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 14, "down_vote": 0, "creation": 1634704330, "permalink": "/r/SuicideWatch/comments/qbsxg6/im_so_depressed_i_have_no_idea_what_to_do_anymore/", "nsfw": false, "first_save": 1635422891.592388, "replies_charged": false}