{"id": "t5_2qpzs_t3_ou0dqz", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "I am so sick of myself. I hate being a weird, awkward nerdy man. I hate being \"introverted\". I hate that I'm terrified of simple things like most any situation where I might meet new people. I hate that I'm too standoffish to make and keep friends. I hate that I have this stupid habit of humming out loud subconsciously. I don't want to spend my life in self imposed isolation anymore.\n\nIf I didn't work a service and team oriented job then I doubt I would talk to people outside my family at all. I've always been like this. I went through school isolated even though I was surrounded by people my age. I thought college would be different, but it wasn't. I was still me and my awful personality was still there. I didn't magically transform into an outgoing ladies man when I moved into my own place like I stupidly hoped might happen.\n\nEveryday I have to remind myself that's It's not that everyone dislikes me or wants nothing to do with me. I've told myself that before and it's just not true. The problem is me, my inhibitions and my solitary routines, but it doesn't matter because I never change anything. I never do anything different. I wish having a social life would come naturally to me like it seems to do with others.\n\nI'm tired of being alone with myself. The only \"friends\" that I have are my parents. I'm tired of watching YT videos where people who do have friends play games together, so I can somewhat live vicariously through them. My life isn't terrible. Solitary hobbies are fine, going on walks is fine. Restaurants are still fun even if you're there by yourself. I know it's stupid to expect happiness from others. I'm not even really sure friends my age or a girlfriend would make me any happier. It could even make things worse. I just hate having to live as a person who is too inept, too paralyzed by fear or something to do anything about it. I'm sick of making the best of it. \n\nAfter all these years, all the improvements in other areas of my life and being more at peace with this reality than I used to be I still want to die. I'm done thinking or talking about the stuff I want to do, but never will.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ou0dqz/i_hate_the_cowardly_person_that_i_am/", "title": "I hate the cowardly person that I am", "social_network": "reddit", "user": "Agent102", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1627574658, "permalink": "/r/SuicideWatch/comments/ou0dqz/i_hate_the_cowardly_person_that_i_am/", "nsfw": false, "first_save": 1635426410.4014158, "replies_charged": false}