{"id": "t5_2qpzs_t3_o4n7xz", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "Thoughts. Some gory and gruesome. Some about envying the dead. I know that when I have these thoughts, I’m not okay. I know some people would call me crazy or insane for having these thoughts and I sometimes feel that way about myself too. I’ve been contemplating my suicide for a while now. I have a stash of pills but idk off they’ll do the trick. I want to get help so badly but o fear that whatever I tell people, they’ll be so repulsed by my thoughts, they’ll just ignore me or be scared of me and that extinguishes any thought of getting help that I had. I don’t want to be here anymore and I fear that if I do survive my attempt, it’ll be worse than if I had been successful. This subreddit is one of the reason I haven’t gone through with my attempt. I really hope the people I’ve reached out to are ok. I just told someone on this subreddit to keep hanging on. I’m being a hypocrite. There are so many things I want to talk about but that’s thoughts keep messing with my head.\n\nUpdate: it’s my birthday and I just came back from the whole birthday song and cake stuff and the whole time, I felt like throwing up and crying. The loud music and people taking over each other was something I knew I wouldn’t miss and I know my family cares for me but the thought of still being alive just kept playing over and over in my head. I wanted to off myself immediately. I kept eyeing the knife for the cake. I wanted to run back to my room and swallow all the pills I have. But I endured and tried not to show how anxious and empty I felt (through I know it was a feeble attempt). My aunt asked where we should have my birthday dinner and I just kept squirming and asking her *why ask me, the most indecisive person you’ll know?* When o finished my small piece of cake, I thanked her profusely and came to my room to write this down. I feel better away from the crowd but I still long for it", "url": "https://www.reddit.com/r/SuicideWatch/comments/o4n7xz/meaningless_ramble_pt_2/", "title": "Meaningless ramble Pt. 2", "social_network": "reddit", "user": "toni_rigatoni", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1624250482, "permalink": "/r/SuicideWatch/comments/o4n7xz/meaningless_ramble_pt_2/", "nsfw": false, "first_save": 1635426636.1930163, "replies_charged": false}