{"id": "t5_2qpzs_t3_pf3wbn", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "To put things into perspective, I'm(25F) doing fairly well now. I don't have familial problems(orphaned), I have close friends who are the most loving and understanding people, and I'm not struggling with money. So I led an decent life other than being orphaned. \n\nI do feel lonely sometimes having lived alone since young but now it's just a way of life for me. \n\nI feel like I've lost the ability to feel genuine emotions and I'm indifferent to everything. But I understand emotions and therefore know when I'm supposed to \"feel\" them and over the years faking kinda turned natural. \n\nI did suffer from depression during my teens but I overcame it and I don't think I'm depressed right now, maybe a little. \n\nFor many years now, I've always thought of the world as a place not worth living in. I've always hated humanity as a whole but I don't judge people as individuals. Reading and hearing news over the years, relating race, gender, wars, the pandemic, etc made me feel like the risk of living is not worth it. \n\nAll I want to do is to travel round the world and seeing the beauty of nature. But all the what ifs and fear of humans makes me feel so trapped. \n\nThe whole concept and system surrounding money is also a bummer. \n\nI just feel like this world is very unkind and I don't really want to be part of it? I don't see why we should force people to live if they are VERY SURE that this isn't the place for them. \n\nAnd yes it is cruel to your loved ones, but isn't the mental strain and pressure to live on that is put on the person themselves cruel as well? \n\nSorry for the long post! I just felt like I had to let something out. If you made it this far, thank you for listening to the ramblings of mine.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pf3wbn/is_suicide_really_a_bad_thing/", "title": "Is suicide really a bad thing?", "social_network": "reddit", "user": "Major_Hamster4772", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 42, "down_vote": 0, "creation": 1630409152, "permalink": "/r/SuicideWatch/comments/pf3wbn/is_suicide_really_a_bad_thing/", "nsfw": false, "first_save": 1635427933.3697789, "replies_charged": false}