{"id": "t5_2qpzs_t3_phgb7u", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "When I look at myself in the mirror, all I see is a machine made of meat and bones, programmed to do anything for survival and therefore mostly devoided of free-will.\n\nOur instincts urges us to be part of a group because being alone reduces our chances of survival.\n\nOur instincts urges us to find love in order to have offsprings and perpetuate the human race.\n\nOf course, there are certain little liberties in our lifes.\nFor example, eating a pizza reduces our lifespan, yet it makes us happy.\nWe do art, which serves no purpose in terms of survival but we still do it because it makes us feel complete in a sense.\n\nThose little things should satisfy us.\n\nYet it does not to me.\n\nWhen I eat a pizza, I just feel like shit because It's not healthy and my body makes me pay for it. \n\nWhen I draw something, I feel empty.\n\nWhen I'm surrounded by people, I see them as machines so I feel terribly alone and misunderstood.\n\nAnd the worst about it, is that if we are conditioned to survive, it means we are conditioned to not kill ourselves.\nOur instincts pushes us to keep on living no matter what.\n\nIf we try, our brain will bombard us with images of our loved ones mourning our passing; images of eternal torment in hell even if we don't believe in the afterlife; the fear of feeling pain as we cut our wrist, jump to our death etc. \n\nWe are not even free to choose to end it all without repercussions and this simple thought angers me to no end because no matter what I do, I'm stuck.\n\nI feel weak, stupid, angry at life but mostly, sad to be a machine.\n\nAnd as if it wasn't enough, this world is terribly cruel and does not forgive weaknesses.\nSo I'm fucked.", "url": "https://www.reddit.com/r/SuicideWatch/comments/phgb7u/we_all_are_machines/", "title": "We all are machines.", "social_network": "reddit", "user": "NHell97", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1630711603, "permalink": "/r/SuicideWatch/comments/phgb7u/we_all_are_machines/", "nsfw": false, "first_save": 1635426748.207516, "replies_charged": false}