{"id": "t5_2qpzs_t3_8cvo8x", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "I spent an hour writing my suicide notes, one for my boyfriend and one for everyone else, explaining everything to them.\n Now I'm going to \"clean\" my laptop from things I don't want my parents (or someone for them) to find. There isn't any creepy porn or something similar, i just want to delete my writings forever. I'm still a private person. Then my tablet and phone. This will take few hours. And then I'll just wait until I'm alone, take a couple of my dad's pills(they inhibite coagulation), a couple of painkillers and cut my wrists. Hopefully i'll bleed to death. If not, doctos will take some time to understand what i took and why i keep bleeding so I'll die even if someone tries to save me.\n\nI tried to make it clear for my boyfriend that it's not his fault at all, that I love him. He worries me more than anyone else, but I don't know how to deal with my life anymore so I'm just going to do it. I hope he will forgive me for this.\n\nYou know, I'm not that sad. I'm angry that I couldn't do what I wanted from my life because of my illness, but death makes me feel... relieved. For the first time in more than three years I know that I won't feel physical pain anymore. \n\nI'm happy to go. Things will be better for me after I did it, finally. I want the peace that I'm feeling now writing this, because I have agency again.\nI choose not to have pain anymore, to not have a life living on disability welfare or my parents (more realistically), to not being sick anymore. I choose to not let my illness rule me again. \nI choose freedom. \n\nI don't really believe in anything, but I hope to stay as a ghost with my boyfriend and follow him forever and be with him during his life.\n\n(And I've just realized that this post is better than my letter, fuck me) \n", "url": "https://www.reddit.com/r/SuicideWatch/comments/8cvo8x/wrote_my_suicide_letters_in_two_or_three_days_im/", "title": "Wrote my suicide letters, in two or three days I'm gone forever", "social_network": "reddit", "user": "OutsiderSandwich", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1523963084, "permalink": "/r/SuicideWatch/comments/8cvo8x/wrote_my_suicide_letters_in_two_or_three_days_im/", "nsfw": false, "first_save": 1635426452.526768, "replies_charged": false}