{"id": "t5_2qpzs_t3_pax4v1", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "\"Do what you want, my dear.\n\nI really don't have a say in this. Because this is your life, and this is your decision. Even if I am your parent/friend/partner/etc., I have no right to dictate what you want to do with your life. You are your own person, and your life is yours only. If you want to go, you'll have my support and my blessings. But I'm kind of curious, what is it that makes you want to leave this world?\n\nIs it because someone has said or done something that made you feel hurt? Is it because society sucks and is so judgmental and unfair? Is it because no one loves, no one cares anymore? Is it because life hurts so much you don't want to live it anymore?\n\nIs it because it feels like there is nothing you can do? Is it because it feels like whatever you do won't matter? Is it because it feels like you don't matter? Is it because it feels like you have failed yourself?\n\nIs it because you don't find anything enjoyable in this world anymore? Is it because you don't want to give anything a try because nothing in this world is exciting enough anymore? Is it because you would like to try other worlds instead because life here is getting fucking mediocre already?\n\nAny reason you say is true and valid. I can kind of understand how you feel. Like I've said, if you want to go, you'll have my support and my blessings. Not gonna lie, I will feel sad if we can't see each other anymore. And all of me wishes you wouldn't want to leave. But I respect your decision, and I will never ever blame you for how I feel.\n\nBefore you leave, I want to ask you for a favor though. First, I need you to be selfish. Today, I need you to kick everyone else out of your mind. Fuck what society thinks. Fuck what your parent/friend/partner/etc. thinks. If today is your last day on earth, then today belongs to you only. Then, I need you to make sure that you keep your best interest in mind when you make this decision. Not my interest, not anyone else's interest. Make a decision that you feel would be best for YOU, not anyone else. Make sure that this is what you, yourself, wholeheartedly want to do.\n\nFinally, let me give you a hug. And I love you, no matter what.\"", "url": "https://www.reddit.com/r/SuicideWatch/comments/pax4v1/today_marks_8_years_and_12_days_since_the_time_i/", "title": "Today marks 8 years and 12 days since the time I almost succeeded in leaving this world. This is what I wish someone had told me instead of shaming, blaming, and guilt-tripping me.", "social_network": "reddit", "user": "Bieacefully_27", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1629841687, "permalink": "/r/SuicideWatch/comments/pax4v1/today_marks_8_years_and_12_days_since_the_time_i/", "nsfw": false, "first_save": 1635426175.626785, "replies_charged": false}