{"id": "t5_2qpzs_t3_ofia4o", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "I lost 90% of both mine and my parent's life savings that took us 10+ years to save up in the span of a year shorting the stock market last year. It started with a 5k loss that I couldn't let go of and now has ballooned to more than 90k+ the equivalent of more than 2 years of my salary. Had I invested in index funds I would have made 90k+ instead of the loss. The amount of money we lost and lost out on is staggering. While the vast majority of people made a killing last year not only did i not get any gains I lost so much in the greatest bull market in history. I just saw a report saying that the average wealth of Canadian households has ballooned to over 1 million whereas our family is left with almost nothing.  it hurts so much more knowing I lost so much while everyone else got so rich. \n\nI know i was stupid in continuing to short but how does the s&p500 go up more than 80% during a worldwide pandemic is beyond me. So not only are we pretty much all out of savings, the massive inflation we have currently has caused our monthly expenses to almost double. The amount of guilt is overwhelming, i single handedly ruined our financial future for at least the next decade and my parents have to bear the brunt of the consequences of my actions. They could have been retired by now but now have to work at least a few additional years due to my fuck ups. A once in a life time opportunity to increase our wealth and what do i do? I fucking lost 90% of our current savings. It's so hard to go on but I have to stay, can't just off myself after losing all our family's money. Everyday is just so hard.\n\nSorry for the rant, had to let it out.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ofia4o/i_cant_go_on_the_guilt_is_crushing/", "title": "I can't go on, the guilt is crushing", "social_network": "reddit", "user": "ClosetPervy", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 10, "down_vote": 0, "creation": 1625662301, "permalink": "/r/SuicideWatch/comments/ofia4o/i_cant_go_on_the_guilt_is_crushing/", "nsfw": false, "first_save": 1635426183.9146297, "replies_charged": false}