{"id": "t5_2qpzs_t3_orhf2x", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "Since I can remember I have always been a sad child on the inside. I blame it on my parents. Our relationship is not that great, although I believe they never realized it because they have been to absorbed in their own opinions. I feel as if they never really loved me, because they have always been lacking emotional support. I know they try in their own way and they are not bad people but I still resent them to this day for deciding to have children if they do not know how to care for them. If I was sad or had any kind of problems my parents would always dismiss them as \"childish and irrelevant\", \"that won't matter in 5 years anyway\", \"don't be so sensitive\", \"you are such a crybaby\". So I learned from an early age to deal with any kind of emotional needs and distress on my own. \n\nIn elementary school I used to have a lot of friends and I always used to pride myself with being a good and reliable friend. So when one of my friends was cast out because of something that was out of her control I stood by her side. And I was the only one that did. When the others decided to forgive her I was stranded alone, left behind by the only friend I had. \n\nWith the beginning of puberty I developed an eating disorder that to this day has gone unnoticed to my parents. I used to skip breakfast, throw away my lunch at school and only eat one meal when I would come home. I was really skinny, kind of underweight. I would lay in my bed at night and my stomach would hurt, screaming at me to get some food and I would just lay there and enjoy it, feeling accomplished. It wasn't even about weight or looks, people always told me I was too skinny. It was simply about control. The only person I could rely on and that I trusted was my cat. I loved her very much. She would always sleep on my bed nearly every night. On the outside I was always a very happy person, that might even be something I was known for.\n\nIt took some time, a lot of third-weeling and always being put on the back-burner until I found the great friends that I now have and I am unbelievably thankful for them. They are my only support system - a support system that I build on my own. \n\nFrom then on things went good for once. I was in school nearly all day - away from by parents, could spend time with my friends, got good grades, my eating disorder got better. I was really happy those couple years of my life. The happiest I have ever been. And then my cat died. She was with me for 10 years and there has never been anyone I have loved more than her. \n\nWith 17 I got my first boyfriend and I was very happy. I honestly think if my cat hadn't died I would have stayed single but I felt so lonely after that. Things got bad pretty quickly. It started with yelling and jealousy, controlling behaviour. I noticed it, but I was too weak to break up. I was already in too deep and hoped that it would get better with time. I had a lot of compassion and understanding for him because I knew he had a rough childhood and saw some serious stuff. But of course it only got worse from there. Those 1 1/2 years where torture. I was being manipulated into feeling like the bad guy, worthless even when I was the one being insulted, held against my will, pushed, beaten, threatend and even raped. I regularly had bruises that I hid successfully from everyone else. I really tried to help him but I realised that there was nothing I could do without endangering myself. At the end of our relationship I was seriously suicidal. My eating disorder got really bad and I was critically underweight. My parents of course did not notice that either. I mustered all my strenght to break up with him and filed a report to the police (only for assault because that was the only thing I had any kind of evidence for).\n\nMy father drove me to the police. They were considerate for like a week until they acted like nothing happend after that. My mother complained that I did not want to go to a family reunion we had planned, like she did not find out her daughter was assaulted for months three days ago. After that she told me something that I will never forget. She told me how bad SHE was suffering after hearing what happend to me and how bad of a mother she felt now, all whilst never asking how I was doing or offering any help. \n\nI was doing better for a couple of months, being relieved that I am not in that relationship anymore. But it has been getting worse. I have diagnosed insomnia and anxiety, now maybe even depression. Pills haven't been helping and therapy is taking way to long to show effects. I have panic attacks that feel like I am dying. My parents are also not considerate of that or take it into account when interacting with me whatsoever. The last month I had a rough patch where I started driking alcohol and taking my medication I ways that I shouldn't. I realise now that there was one incident where I nearly could have died.\n\nI have been trying to move out because I just need to get away from here. Everything here reminds me of bad things in the past and I feel trapped. My parents want to buy an appartment for me - which sounds nice at first, but it is only in their interest. They don't want to pay money to rent, they want to earn money from the real estate and because nobody wants to sell we have been searching for months unsuccessfully. When I mentioned that a friend wanted to rent an apartment in the same city, around the same time and suggested we search together and split rents as roomates they threatend that I would need to sue them for the money that they would be legally obligated to pay me (where I live parents have to pay you money to live until you finish your degree). So as you see people in my life have always made it unnecessarily hard for me. I hope I can move out very soon or I will go insane.", "url": "https://www.reddit.com/r/SuicideWatch/comments/orhf2x/people_made_my_life_very_hard_telling_my_story/", "title": "People made my life very hard - telling my story", "social_network": "reddit", "user": "funisindysfunctional", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1627239081, "permalink": "/r/SuicideWatch/comments/orhf2x/people_made_my_life_very_hard_telling_my_story/", "nsfw": false, "first_save": 1635423049.47764, "replies_charged": false}