{"id": "t5_2qpzs_t3_b8u3fd", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "Before I start venting, let me just give some context real quick. In January of 2018, at 17, I attempted suicide on school grounds for many reasons, but one of the major ones was the stress of school, specifically my AP classes. I was admitted to a mental hospital and stayed there for about 8 or 9 days. When I came back home my mother told me that the school was very nice towards my situation until other students at my school copied my actions. After those incidents (I still don't know a lot because the school barley gave any information), they started treating me and my mother differently and focused primarily on me taking the exams as well as returning to school as soon as possible. It was believed that I made a suicide pact with a bunch of kids, whose identities I'm still not aware of, to get out of my exams. Due to these experiences with my school, I decided to do online schooling and only take regular classes. I failed one class during that period of time.\n\n&#x200B;\n\nNow it is my senior year, and I didn't fail any classes my first semester. However, a deadline for all my coursework is coming up for this semester (each semester has 2 deadlines to keep students on track), but I'm very, very far behind in almost all my classes. I cannot for the life of me concentrate, and my mind is beginning to backtrack to the mindset I had as a 17 year old. I quit going to therapy and taking my medication about a couple of months ago because I stopped feeling comfortable with my therapist and my depression was acting up. I know it seems weird to quit when you're getting worse, but I just wanted to give up on getting better. I didn't want to talk to anyone about I was going through anymore, and I didn't want to feel vulnerable again.\n\n&#x200B;\n\nI didn't really care that I was getting worse, until, of course, it started affecting my performance in school. I know I'm probably going to fail high school, and become a failure all over again. I tried reaching out to my school counselor, and she told me to go back to therapy again. I tried talking to my mother and grandmother about how I was getting worse, but they deemed it as hormones and me just being a female teenager, despite both of them knowing what has happened to me in the past.\n\n&#x200B;\n\nI know my health should be more important than school, but it’s just so fucking frustrating that my mind keeps on making school so much more difficult than it needs to be. I have some good moments, but whenever something reminds me of my old school or makes me feel the same emotions that I used to, I just drop it instantly and try to avoid it. I have no idea if that makes any sense, but yeah. It’s a really poor excuse to being such a bad student, but I don’t really know how else to explain my mindset when it comes to this situation. I have a lot of bad memories of high school and the mental hospital, which have been constantly on mind since the January of 2019. I haven't been sleeping very well either due to that fact that sometimes I have nightmares about school and/or the mental hospital.\n\n&#x200B;\n\nI'm not really sure what I'm asking for, as usual when I make a post on here. I guess I just feel so desperate, and I'm worried my failing of high school will once again throw me off the deep end.", "url": "https://www.reddit.com/r/SuicideWatch/comments/b8u3fd/going_to_fail_high_school_18f/", "title": "Going to Fail High School [18F]", "social_network": "reddit", "user": "YuffieYeah", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1554270253, "permalink": "/r/SuicideWatch/comments/b8u3fd/going_to_fail_high_school_18f/", "nsfw": false, "first_save": 1635427714.3814976, "replies_charged": false}