{"id": "t5_2qpzs_t3_a3svwp", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "# \"The Ungrateful Dead\"\n\n**by Lester Patterson**\n\n&#x200B;\n\nThe evening was cold, rainy, and damp in Sunnyside, Queens. It was mid-November. Nothing was working in Laura’s life. She was unemployed, suffering from severe chronic pain, and her seven year long - on again, off again - romance had finally come to a disappointing end.  The pain in her life had become too much. She couldn’t even sleep at night. Laura had become deeply depressed, and it was time to make it stop.\n\nEven the medications, which had worked before, were failing to give her relief. The hydrocodone was no longer effective in controlling the jabbing pain in her back. The Zoloft had become useless in healing the pain in her soul. Laura had become exhausted by it all.\n\nThey say that no one actually wants to commit suicide.  Most people who eventually do often have been considering it for quite some time. There is a survival mechanism which most of us have which causes us to want to hang on for at least one more day. Today Laura is two weeks beyond her “one more day” moment. It is another cold, lonely Friday evening and the 38-year-old has tossed in the towel.\n\nHer troubles began three years ago when she was injured while working out at her gym. It seemed like nothing at the time, but it turned out to be a debilitating injury. The pain in her back was so intense that she had no choice but to leave her $31,000 a year job working as a New York City Traffic Agent. Once upon a time Laura even had hopes of becoming a guard on Rikers Island or a police officer, but she didn’t score high enough on the test, and so those dreams died.\n\nWhat bothered Laura most about resigning from her traffic agent position was that she had been on the job for 11 years, and was only 9 years shy of her retirement. Not to mention the great healthcare benefits, which she could indeed have used in her present condition.\n\nNow she was having financial difficulties to add to all of her other woes. The things she could afford to do before are no longer available to her. What is even more painful is that Teddy, the love of her life, had abandoned her during her darkest hour. She felt jilted and jaded. “Teddy you bastard. I gave you the best years of my life,” Laura thought to herself out loud. She envisioned that by now they would have been married with at least two babies to show for it.\n\nLaura was down to her last $158 when she visited the neighborhood liquor store the night before and spent $30 on a bottle of Death’s Door brand gin. With the gin and a glass in hand, she sat down on the green faux leather loveseat situated in the middle of her relatively large living room. In front of her is a bare wall where her 43-inch television once hung. She sold it on Craigslist to afford groceries for the month.  Now she wishes that she hadn’t. It was the only friend she had in the world.\n\nReaching into the pouch of her blue hooded New York Mets sweater she withdrew a manila envelope into which she had combined 23 large white tablets of hydrocodone and 17 small blue tablets of Zoloft. Taken together with two glasses of gin, Laura knew that she would be on her way to the \"great unknown.\"\n\nLaura downed her first drink of the crystal clear spirit and then poured her second. Now she was feeling numb and relaxed. “This is gonna be easier than I thought,” she said to herself out loud as she poured all 40 tablets into the palm of her right hand.\n\nIt had begun raining again. The sound of the raindrops was exceptionally calming for some reason.  Laura felt at peace as she gradually emptied the tablets from her hand into her mouth as if they were candy. In that moment she was reminded of one Easter Sunday when she was little and had stuffed her mouth with jellybeans. The thought made her smile. Then she began swallowing the blue and white tablets two and three at a time until they were all consumed. Laura then quickly wash the cocktail down with a generous swig of gin and assumed a fetal position on one side of the couch waiting for the dark angel to arrive.\n\nSix or seven seconds passed, and her phone began ringing. She looked to see who was calling. It was Teddy. Laura smiled and answered it.\n\n“Hi Laura, it’s me, Teddy. I just wanted to tell you how sorry I am for the way I reacted to everything. I need you, and I promise to be here for you.”\n\n​All that Teddy heard back from the other side was uncontrollable laughter. Then suddenly the angel of death hung up on him.\n\n*Side Note: If you should ever wake up wanting to end your life, there is help available. Call the National Suicide Prevention Hotline at 1 (800) 273-8255. Give them time to answer and let's see if you can't discover the strength to continue at least one more day. We need you.*\n\n&#x200B;\n\n[www.lesterpattersonnewyorkflashfiction.com/new-york-stories/the-ungrateful-dead](https://www.lesterpattersonnewyorkflashfiction.com/new-york-stories/the-ungrateful-dead)", "url": "https://www.reddit.com/r/SuicideWatch/comments/a3svwp/death_be_not_proud_this_is_a_story_of_why_its/", "title": "Death be not Proud. This is a story of why it's important to hang on for just one more day. The storm could end tomorrow, but will you be there? Peace in life is possible.", "social_network": "reddit", "user": "Ipsofacto64", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1544133719, "permalink": "/r/SuicideWatch/comments/a3svwp/death_be_not_proud_this_is_a_story_of_why_its/", "nsfw": false, "first_save": 1635426298.3884733, "replies_charged": false}