{"id": "t5_2qpzs_t3_pag10b", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "This is not my main account. I could never wrote this from my main account because I'm such a hypocrite like everyone else. But I'm sick of reddit and all the mental subs. I can't stand anymore to see the same stupid advice everywhere \"find a therapist\" \"take meducation\". I get it OK? Enough! If you can't answer me or help me with anything else just tell me to die! If you can't read my posts carefully don't answer me let me in my sorrow, don't give me false hopes and then crash me down. Don't come to make me feel more guilty, to tell me that I'm spoiled, entitled, lazy, I should find a job or it's all up to me. It's better and more honest to tell me that you think that I'm a piece of shit and I must die. But then they will ban you so you can't do that. But you are so willing to make someone feel like a garbage showing tough love hah?\n\nI don't ask someone to indulge me and baby me eventhough I may have need for someone show me a little bit kindness. I want people to tell me my mistake but also show compassion and say something encouraging to help me move forward without gaslighting me. And I don't demand anything you can just ignore my post as I do. Even here I see people whining over stupid things from time to time but I don't go and answer to them things like \"you need to grow up\" \"you are an entitled brat\" etc. because I don't really know what is going on with their lives. And if I tell to someone go for therapy and answer me that he doesn't want or feel that is lost case I wouldn't tell thst he try to find excuses for self pitiness. Because even if the problem is self pitiness still this person suffers, still there is a problem. If someone is unhappy or miserable it doesn't matter if they are spoiled or ungrateful. Spoiled people don't wa t to die, they have good time using other for their own benefit. They are not whine thinking to end their lives they whine because they want attention.\n\nIt will be always like that isn't it? People always will have a certain impression for you no matter what. Actions speak louder than feelings. They oy way to convince them is to actually kill yourself. It's clear to me. I wanted to attempt and fail to have people taking care of me and treat me like a baby. Yes I know how immature I sound. I don't  want to try I just want to hide in my mom's hug and sit all day in the house doing the things that I love. This is why I deprived from myself every joy for a year now. This is why I punish me and torture me everyday. Because I know what I want it can't happen and people can't see me as likeable when I follow my own way. I want everything in my favor and it's impossible. But I never had anything in my favor.\n\nSo it's better to kill myself. Because there is no point I just keep existing without meaning, I waste resources and the oxygen from others. And I have the audacity to consider myself a better person. Yes I consider myself more smart, more compassionate, with more potentials from many others. I think that I'm good person and I had to offer a lot. But people killed my spirit before even try to make a move. Maybe they saw all these things and they felt jealous. I'm sure that I'm not the only one.\n\nThere is no solution. I'm 28 I run out of time it's over. Maybe I'm narcissist or a spoiled piece of shit or a deeply  hurted person with high empathy and sensitivity who can't take it anymore. Anyway it doesn't matter I'm done with all of this and all these people online who want to judge everyone.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pag10b/im_sick_of_this_shitty_place/", "title": "I'm sick of this shitty place", "social_network": "reddit", "user": "Street-Extension5823", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1629778385, "permalink": "/r/SuicideWatch/comments/pag10b/im_sick_of_this_shitty_place/", "nsfw": false, "first_save": 1635423025.5145097, "replies_charged": false}