{"id": "t5_2qpzs_t3_l9pvim", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I'm done. \nI had a lot of good experiences during my life and I'm happy, that I had the opportunity to meet a lot of great people and to feel a lot of love.\nNow I'm simply convinced that I don't want to fight anymore.\nI've been dealing with depression for about four years. This and multiple eating disorders make it unbelievably hard to enjoy life and it gets worse with every episode.\nSeeing close people disappointed in me hurts. I'm filled with the feeling of shame so much, that I don't wanna look in the mirror.\nI'm pretty young, but I've made some working experiences and I don't see myself working the way other people do. Wasting 8 hours a day, doing something I don't even really want just kills me. \n\nOverall it's hard for me to handle my feelings and even though I'm reflecting and overthinking all the time I couldn't find a solution.\nI've tried meditating & working out, I've bought crystals, tried making art, positive affirmations, a journal of gratefulness, focusing on my health etc. And all of this could only help short term. \nI never feel really free and when my feelings get really intense I just want to end it all. \nWhy can't i just do it without being the reason other people suffer? Can they handle the pain better than me? \nI mean eventually they will move on and maybe they will understand me a little bit. Maybe they will understand that I loved all of them, but I'm just too weak to exist.\nThinking of suicide feels so selfish, but I can't help it. I can imagine myself get way worse (failing school, eating way too much, being distant with people who love me, not going to work etc.)  And noone would want to see that. On the other hand no one could really help me. Me thinking about suicide is logical considering what I just said.\n\nSry for ranting- i really need that rn", "url": "https://www.reddit.com/r/SuicideWatch/comments/l9pvim/why_cant_you_end_your_life_wout_hurting_anyone/", "title": "Why can't you end your life w/out hurting anyone?", "social_network": "reddit", "user": "nicol0l", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1612138258, "permalink": "/r/SuicideWatch/comments/l9pvim/why_cant_you_end_your_life_wout_hurting_anyone/", "nsfw": false, "first_save": 1635426215.663923, "replies_charged": false}