{"id": "t5_2qpzs_t3_q2x3g6", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "I don’t know what’s happening to me. I’m autistic, if that matters. And ive overdosed once half intentionally, but otherwise ive never felt that i actually genuinely want to take my own life. \n\nIve just recovered from an addiction, i’m 19. I’m pretty sure i’m a hypochondriac bc of my addiction, so i’m basically having severe anxiety 24/7. \nBut this last week ive been laying awake at night just planning suicide. I don’t want to live, there’s no reason to. The only reason humans live is to work and earn money, that’s what we do from the moment we graduate from school until we die basically. And I just don’t feel like i want to breathe anymore, my anxiety is so severe, the help in the country i live is bad. They don’t take me seriously. And i feel like to go to the emergency psych ward is too much for me bc then it becomes real, and my family needs to know about it. \n\nThe only reason i’m alive is bc of my best friends and my family and my dog. I can’t for the life of me fathom the fact that they’ll never stop mourning my death. And i feel selfish for even thinking of ending it. But i just don’t see a future for myself, i don’t look forward to anything, it’s all just meaningless. \n\nAnd i’m so scared, i’m so frightened by myself. What if i do it? I have no idea what i’m capable of and it scares me. I don’t want to disappoint my closest people, but i don’t want to breathe another second.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q2x3g6/i_dont_know_what_to_do/", "title": "I don’t know what to do", "social_network": "reddit", "user": "isbalele", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1633565820, "permalink": "/r/SuicideWatch/comments/q2x3g6/i_dont_know_what_to_do/", "nsfw": false, "first_save": 1635426736.3382857, "replies_charged": false}