{"id": "t5_2qpzs_t3_qf6hym", "request": ["5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "Well throughout my life I had many reasons to be suicidal but right now the thing that wins the whole top is university. I have anxiety (even now as I write this) and dread thoughts whenever I think of it and it's a big part of my daily life, it's too overwhelming. I don't feel like I can do it anymore, I'm seriously thinking to give up but I'm forced to continue because of my abusive parents. I hate everyhting about it.\n\nI'm always buried in homeworks and I constatnly receive abuse from teachers. Last week I made a post on here where I explained how I was made to cry the third time by a teacher because she treats me like the worst thing in the whole universe - she put me to answer and just when I opened my mouth to say something she put someone else to answer and it's not the first time happening. I'm constantly ignored and pushed aside. Of course she also has favorites and she and her favorites constantly kiss each others ass.\n\nI have many severe teachers that don't care we are people with a life, outside the university one, with feelings and desires and needs and just bury us in homeworks. Every week I need to translate 10-15 pages (that's just one homework out of 6 I think) full of non sensical, outdated foreign language.\n\nLast week something embarassing happened, I stayed up the whole night to catch a class that starts at 8 am because I can't wake up too early anymore. I caught the class but somewhere in the middle I fell asleep and woke up many hours after. I want to mention I have classes online on Zoom. I'm death scared to enter in that class anymore.\n\nAll of this fucked me up even more. I'm tired of all the abuse I received throughout this wonderful ''educational'' system that this shithole has. Not to mention the abuse I received outside of it. I'm not tolerating further abuse. University should have been a rational environment full of professional and polite people, not an abusive cesspool.\n\nI don't really believe in therapy but whether I get to finish this shit or not I'm really fucking considering it because all these things really affected me.\n\nAs I write I feel a strong impulse to not enter in any class anymore and never participate in exams and wait until summer and take up other languages or just take up history. But as I said, I'm forced to continue.\n\nI feel like the rope is winking at me right now.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qf6hym/university_the_main_source_that_makes_me_suicidal/", "title": "University - the main source that makes me suicidal", "social_network": "reddit", "user": "TriiPoloskii", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1635127008, "permalink": "/r/SuicideWatch/comments/qf6hym/university_the_main_source_that_makes_me_suicidal/", "nsfw": false, "first_save": 1635428297.280232, "replies_charged": false}