{"id": "t5_2qpzs_t3_puk0zy", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42"], "text": "TLDR: I broke my gf’s trust, but I have to get it back and help my with her suicidal thoughts\n\n\nI did something really bad almost a month ago. We were baking cookies when she was talking with her parents about allergist appointment. All the available dates were really early and it made her cry. It’s because she had really poor sleep during the last week and she wanted to sleep well before school starts. Although her parents knew it, they refused to go for an appointment in  the middle of school day. When I was hearing her faltering voice, I felt pain in my chest and detached from reality (in other words, I was panicking and I started to act irrationally). She went upstairs to her room with tears in her eyes. Instead of running after her to comfort her, I just stood there and continued to make this fucking cookies. I went to check on her some time later, a can’t say how long it was. When I got to her room, she didn’t want to talk me and was mad about me not being with her, which is totally understandable. She wanted me to leave her alone, so she left the room and went somewhere. I had no idea what to do, so I kept trying to get to her. She opened her gate for me and i left as she wanted. \nShe is still devastated by this incident. She doesn’t believe me when say that I love her and brings up the described situation when I say i want to help her and she can count on me. She says she’s disappointed and sad about it. I stand by the fact I didn’t do this thing intentionally, but she doesn’t believe me. I feel so shitty about it, because I really care about her  a lot and I was the incident never happened.\nToday when we were going back home with a train I found out she is going to sign no-suicide contract with her doctor. At first I didn’t know what is it, so she told me to check it myself. I did and I felt devastated by the thought she is suicidal. I tried to talk to her about it, but she brought up my mistake again and she just left the train with a cold “bye”. I can’t bear the thought it’s so bad that the contract has to be signed. I also think I might trigger suicidal thoughts in her by my behavior. The most scary thing about the suicide part is that she was talking about some plans for the next weekend. I’m worried that it’s the date she choose to harm herself.\nI really want to overcome her disappointment and lack of trust to help her. I can’t imagine my life without her and constant guilt of her death. I texted her that even if she doesn’t want to talk about it and she doesn’t believe in my goodwill, it’s my priority to help her with going through her crisis. She didn’t respond to it yet, but I can update the post after she does it. \nHere’s the question to you guys: How can I encourage her that I care and want to make up my mistake?", "url": "https://www.reddit.com/r/SuicideWatch/comments/puk0zy/i_had_hurt_my_depressed_gf_and_then_i_would_find/", "title": "I had hurt my depressed GF and then I would find out she has suicidal thoughts", "social_network": "reddit", "user": "bugsropeswillgive", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1632490904, "permalink": "/r/SuicideWatch/comments/puk0zy/i_had_hurt_my_depressed_gf_and_then_i_would_find/", "nsfw": false, "first_save": 1635427329.634766, "replies_charged": false}