{"id": "t5_2qpzs_t3_2rty23", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "http://www.crisischat.org/chat\n\nTried using this site earlier.\n\nTook forever to connect to somebody. When I finally did, they ran through some very obviously scripted questions, transparently feigned interest in my situation, and peppered in a few generic \"caring\" statements. The person asked if I was feeling suicidal, I said 'yes I am, badly, and see no real reason to not do it tonight'. No response, they left the conversation about 3 minutes later.\n\nIt's hilarious how prettymuch every time I've (very rarely) actually tried to talk to and confide in somebody about my problems, feelings, thoughts, etc... people just spam links to sites and hotlines like this, and then leave it at that. As if it's some grand humanitarian gesture on their part, when in reality they just don't fucking remotely care to talk to me themselves. Responding to my attempts to level with you by linking shit I could have found myself with 3 seconds of googling, wow, how utterly heartfelt of you. Unsurprisingly, it turns out that the addition of a bachelors degree in psychology doesn't make strangers any more likely to care or equipped to help. *Stop advocating these services*, what a fucking joke.\n\nMy biggest mistake has been the belief that there is actually anyone out there who genuinely wants to listen and try to understand, let alone try to HELP. I need to stop hemming and hawing, and put my Remington to good use.", "url": "https://www.reddit.com/r/SuicideWatch/comments/2rty23/suicide_crisis_network_hung_up_on_me/", "title": "Suicide crisis network hung up on me.", "social_network": "reddit", "user": "adfafkjldsfoiie", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 22, "down_vote": 0, "creation": 1420783426, "permalink": "/r/SuicideWatch/comments/2rty23/suicide_crisis_network_hung_up_on_me/", "nsfw": false, "first_save": 1635426128.3413167, "replies_charged": false}