{"id": "t5_2qpzs_t3_q2bp42", "request": ["37248a85-36ad-4f27-afa2-d6240c3a39c2"], "text": "    I just felt like talking about this since I think my brain's tried to stop me from remembering this even very clearly, was suddenly reminded while talking with my friend though and i briefly mentioned it but I felt like he ended up trying to ignore me for the rest of the day so yeah probably won't mention anything related to suicide to people close to me, but I feel like maybe it was due to the fact I was living with someone that at this point I understood wasn't mentally well that I've contemplated it so much and felt like it was a solution that is valid. When I was younger I don't even remember how old I was but all I remember was my mother took a whole bottle of pain killer, that my grandma had for her leg pain after breaking it. Only details I remember from that whole period of my life it's like now I'm no longer able to remember large periods of my life now when I used to be able to recall pretty far back. I remember something about charcoal my dad gave my mother the yellow stretcher and the ambulance sirens also visiting her in the mental facility after she somewhat recovered.  I kinda just wanted to let it out and tell someone about this. I truthfully believe that maybe it may have been better for my dad and mom to have divorced there was talks about it with a lot of yelling and arguing and I remember I was really sad but it may have been for the better, but at the same time I probably would've ended up with my mom and I really don't think I would be alive today. I kinda just wanted to maybe understand how this may have effected me I think immediately we went to see a psychologists or someone but I remember not wanting to say anything at all. I think in the end maybe a lot of this build up of events had slowly caused my depression. If I end up remembering when this event was too afraid to ask my dad, if it matches up with me starting to quit all the extracurricular I was doing it would be more of a link and a direct cause. I feel like I'm just looking for some reason to explain why I feel this way and this whole thing could all be unrelated", "url": "https://www.reddit.com/r/SuicideWatch/comments/q2bp42/effects_of_mothers_suicide_attempt/", "title": "Effects of mothers suicide attempt.", "social_network": "reddit", "user": "RemarkableVictory990", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1633489119, "permalink": "/r/SuicideWatch/comments/q2bp42/effects_of_mothers_suicide_attempt/", "nsfw": false, "first_save": 1635428522.1942, "replies_charged": false}