{"id": "t5_2qpzs_t3_o0fbpg", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "hey this is my first time doing a post on reddit sooooo I'm just gonna use this opportunity to \"vent\" because I am literally about to lose it if thats ok with u\nWell where do I start I have been suicidal for a while now since I was 19 that was when I last attempted killing myself w sleeping pills, i literally wished i was dead on my birthday but it didn't happen ffs. Unfortunately I am still here at 23 being even more of a fucking mess right? I was supposed to be starting a bachelor degree at uni but I messed up because I didn't go to the classes (because social anxiety duh) and didnt keep up with the content I was overwhelmed by it because it a new experience and I wasnt sure of where to start then I spiraled out of control w pills drinks n vaping thinking that I could cope better (which is ironic because I had substance issues when I was like 15-16 ish but I'm back at it again oops) also another funny story is I got a new job this year too but got fired within 2 weeks because I didn't show up to work (well social anxiety n addictions obviously fucked that one up too)and I also got caught up in really complex financial/tax problems getting in the way too and guess what I have health problems to top it all off as well gotta take medically prescribed pills every day too. Omg how the fuck am I able to keep this up?? I am truly fucked anyway I'm still spiraling out of control as usual hoping that this brings me closer tooo my death, plus mom found out about my addictions recently and now I'm worried that this is gonna make things worse (she might hit me/ kick me out of the house soon lol she hates me and dont trust me anyway but whatever). I just want to gtfo of here its been too long I am honestly disgusted by my embarrassing presence in the world i hate myself too much to be up here pretending that everything is fine, fuck \"friends\" fuck \"family\" they dont mean shit they are dead to me they cant stop me from ending my so-called \"life\" because its gonna happen at some point ....seriously this is so annoying I know u might say i brought all these problems on myself, i guess thats true...because i have a habit of burning way too many bridges and wasting opportunities like these because of bad mental issues that I never told anyone about and it's been like this for years. I know I got issues u dont need to tell me. Sorry if I'm coming across as pessimistic here I can't seem to find a way out been in a dark place for a really long time and got sooo used to having negative shit around me that I've become a completely different person and its just a part of me now. Its always been me being in a mess w myself because I am a fucking mess you get me ?? Maybe i should just get a knife and keep scarring my arms again like i did years ago and keep the pain coming thats punishment for existing like the stupid bitch that I am, goodbye no one will miss me. I feel so fucking defeated that the only thing helping rn is vape.\n\nI'm sorry I am such a complex person I know its a lot to unpack here don't worry if u can't understand it ....i dont think anyone understands me anyway.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o0fbpg/i_am_literally_a_fucking_mess_im_sorry_that_u/", "title": "I am literally a fucking mess I'm sorry that u have to put up with me 😢", "social_network": "reddit", "user": "Package-Designer", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1623766363, "permalink": "/r/SuicideWatch/comments/o0fbpg/i_am_literally_a_fucking_mess_im_sorry_that_u/", "nsfw": false, "first_save": 1635422312.003141, "replies_charged": false}