{"id": "t5_2qpzs_t3_q5aumx", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb", "d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "Does anyone else feel conflicted about both living and dying because of the Fear Of Missing Out?\n\nLet me try and explain my story... and it feels stupid and selfish because I have had a life people would trade for in a heartbeat. It just hit me differently. \n\nI was born with OCD and it progressed to GAD, and I had a few instances of mental health struggles like IE anorexia at 12 purely for self control. At 17, I got DPDR and that's when the suicidal thoughts really started kicking in, because I was already poorly off and now I'm completely detached from reality, as well.\n\nThings were rough after that. I developed a set of physical illnesses, I lost my grandpa to parkinson's, I was in an abusive relationship... but I was highly socially functional. Graduated on my first exams, enrolled my MA degree, volunteered, and started building a career. Moved out on my own to be with my BF, earned double the average income here, and continued flying through university... it made me feel like I was something and I was worth it.\n\nMeanwhile, I missed out. Spending wee hours on my computer and with my nose stuck in a book there were weeks I didn't even shower. Eventually, it came to a head when I couldn't concentrate at all. And I felt like a waste of oxygen. I devoted 100% of me to my education and career and I started being terrible at it -- it felt so shitty. \n\nMeanwhile, my family issues continued, so I went low contact for most of the time. I lost all my friends. My physical state worsened. My insomnia came back. I started smoking 2-3 packs a day. I feel every bone in my body hurt from the moment I wake up - if I even sleep at all. So I quit my job, paused my career, and got incredibly struck by guilt because there's people around me begging for a slice of bread, and here I am giving up all I have because I couldn't handle it. \n\nMy past friends travelled the world, got kids, pursued their dream jobs, got acknowledgements and honors, and I'm the one who disappeared and spent months at home without even peaking out so much as to go to to the store. \n\nI'm only 24 yet I feel like there is no way for me to bounce back. And I know it sounds stupid because I'm so young, but I just spent 5 years studying and working and creating a career and I just threw it away. I don't even know where to start again. I could move back to my hometown and work in a store checkout- at best. I have no life skills and no social skills - at all. And worst realization was that I don't think anyone would notice I'm gone. Literally. People don't message me anymore, they no longer even bother. And I can't blame them. I still don't shower most days. I eat poorly. I smoke like a chimney. I sleep 2-3x a week and get up with a panic attack, spending my first hour awake just preparing myself to survive the day. I'm afraid I missed out, mostly in the past two years of my life. I missed out on just taking a fucking walk in the park. On enjoying a shower. On relaxing with a hot coffee and a good movie. On establishing human connections that matter. Waking up rested. The little things. The amount of times I cried on my bathroom floor with my kit of pills feeling embarrassed that I'm giving up -- I stopped counting.\n\nThen I think about what having kids would feel like. How much I love nature and enjoy spending hours just walking a trail and peeking at every flower. I notice how beautiful birds sound at dawn when I can't sleep. I forced myself to go to the beach for one day and remembered what it's like to just float in saltwater. I think about what it's like to grow old. Grow old with someone. And I put the pills down, because I'm afraid of missing out, because I know my grandpa would have given up his soul in the last few years he was bedridden to have a functional body for just one day and not miss out on going to the lake with me. \n\nSo here is my story. I'm stuck in a loop for months now - thinking about ending my life because I'm missing out, not doing it because I'm afraid I will miss out. \n\nI don't know what I want to achieve with this post. I just want to know someone will hear it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q5aumx/the_fear_of_missing_out/", "title": "The Fear of Missing Out", "social_network": "reddit", "user": "MaliSarou", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1633881746, "permalink": "/r/SuicideWatch/comments/q5aumx/the_fear_of_missing_out/", "nsfw": false, "first_save": 1635422253.7910433, "replies_charged": false}