{"id": "t5_2qpzs_t3_60ie6e", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "About a month ago I texted a suicide crisis hotline that I have used for the past 6 months and I told them I was feeling suicidal. I told them I had pills and a knife and was planning to end my life. I was very disoriented so there were a lot of gaps in between my responses, which worried the responder I was talking to. He stopped responding after a while and I texted saying \"Where did you go\" and he replied with \"Getting you the help you need\". My heart immediately sank and I had the closest thing to a panic attack I've ever experienced. I called the police myself to try to cancel the emergency intervention but they told me I'd had to speak with the officer in person once they arrived.\n\nI was terrified at the idea of police showing up to my apartment building, since I still live with my family. So I went down to the lobby to wait for them to show up so I could tell them to leave. It was around 11 pm and I told my mom I was going downstairs to check the laundry. 10 minutes later, the police car pulled up to the front and I let the officers in. I wanted to talk to them at the door but they insisted on sitting down with me in the sitting area of the lobby. There were 4 of them, 2 men and 2 women, though one of the women looked younger and wasn't in uniform, maybe a trainee or something. They told me to recount what happened and asked me about my mental state. I tried to tell them everything was okay so they'd leave, but they weren't buying it. They said they wouldn't leave until they knew I'd be safe. I knew my mom would come looking for me soon but no matter what I said, I couldn't convince the police to leave. After about 15 minutes, my mother came down to the lobby and saw me sitting with the officers. Naturally, her first reaction was fear and shock. She thought I had something​ wrong. She asked me what was happening and I thought the police might explain it for me, but they stayed quiet and let me do it. So with my voice faltering and my body shaking, I explained as best I could in broken sentences in my mom's native language, which I'm terrible at. She didn't believe what I was saying so the officers had to reiterate what I had said. It took her a while to process and she just couldn't grasp the situation. So one officer pulled her aside and talked to her in private. Meanwhile, the one female officer was telling me how common suicide calls were, how they got at least one every shift, and how there is no shame in reaching out. She was really kind but I was hardly listening though because I was trying to hear what my mom was saying across the room. She was angry.\n\nIt took a long time for everything to settle down, and at one point it seemed like they were finally about to leave. But then the police officer asked to see the texts on my phone before they left, and my heart dropped again. I had been using the textline for the past 6 months and there were 750+ back and forth texts that I never deleted. I knew what would happen if I showed them those texts. I would be hauled off to a mental ward ASAP. But even in spite of that, part of me wanted to do it. Part of me wanted somebody to see the pain I've been carrying for the past year. So after a long internal struggle, I handed the phone over and waited as they scrolled through months of backlog. And sure enough, the officers tell me that they no longer feel comfortable leaving me there.\n\nWe went upstairs so I could grab my coat. They were taking me to the hospital. The one officer told me to bring my phone charger, which I understood to mean I would be there for the night. They came into the house, and they told the rest of my family that they were here to get me help. It was embarrassing, and I wish they hadn't come inside. I went down with them alone and got into their car after being searched for weapons. While being driven in the backseat of the car, I received a text on my phone. My mom was telling me to say that nothing happened. That it was just a joke, or that I had gotten confused. In that moment I wanted to die more than ever before.\nWe rode the nearby hospital, had a quick pre-evaluation before being led into a cellar-like room. The cops left after searching my pockets one more time. It was past midnight at this point, but for the next couple of hours I would be visited by 4 consecutive psychiatrists and asked the same set of questions; what's your mood like, what hobbies do you have, sleep and eating patterns, etc. And then they asked me if I had anything left to live for. I wanted to tell them I haven't been sleeping for more than 3-4 hours a day. I wanted to tell them I wasn't eating right because my stomach rejected food. I wanted to tell them I had lost interest in all of my hobbies and that I had no reason left to live. But I couldn't do it. I just couldn't. I lied about everything. I told them I was alright and just going through a rough patch. So they left too.\n\nThere was no bed, just a chair and a desk. It was around 2am. I sat there. I couldn't fall asleep in my chair, I kept fading in and out but I remember every minute of it. It was long. Then 7am, when a nurse came in and told me I was cleared​ to go home. They offered to call a taxi but I told them I could catch the bus, until I stepped outside into the bitter cold and realized my buspass was in my other coat. So I began walking. The weather in February was brutal, the wind was cutting​ at my face and ears. It wasn't very far from the hospital to my home, but I wasn't planning on going back to face the mess I had created. I was going to run into traffic and end it all. I stood on the side of the road for what seemed like an eternity, waiting for the moment and the courage to come, like waiting to hop in a skipping rope. And I thought “this is stupid”. I was tired and hungry and freezing cold. And I turned around and kept walking. Until I got home. Predictably, my mom was waiting for me. I told her everything that happened. She asked me if I needed to go back to the hospital, if they made me schedule appointments or gave me any medicine. I said no, and she said “Thank God. I'm so relieved.” She told me she was worried the hospital was going to call us nonstop and make us pay for a bunch of medication. She said she was so happy they would leave us alone. And she didn't seem to care that I wanted to die. And she asked me “It was just a joke, right? You called them as a joke?” And I didn't have the energy to even try.\n\nI went back to my room and slunk into bed. And cried and cried and cried. Until the tears stopped and I didn't feel anything anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/60ie6e/longest_day/", "title": "Longest day", "social_network": "reddit", "user": "makkurana", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1490035811, "permalink": "/r/SuicideWatch/comments/60ie6e/longest_day/", "nsfw": false, "first_save": 1635426151.7754664, "replies_charged": false}