{"id": "t5_2qpzs_t3_kfmj39", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I spoke to the chat service on the hotline prevention site..only did it cause my “support system” I thought I had, I turned to too late and they pushed me away to get more professional help, outta love or simply for a selfish reason that they can not provide the care I need or simply don’t want too..\nI’ve felt my Connection to this individual growing weaker and in turn it’s just making my depression worse.\nYet they are laughing and getting along with others just fine when I’m not around and I have to hear about it from others..& it kills me..\nKills me cause I want to be part of the laughter I wanna hear this individual laugh, their laugh was addicting.\nTheir presence just to be around was addicting, yet as we grow we meet new people tell new jokes share new laughs..\nWell I wasn’t laughing when it came to the “stereo typing” jokes..that tho they label it as stereo typing I call it being slightly racists and exclusive if they two can laugh at a joke but soon as I give one out regarding my background I’m shut down like I ran over someone’s dog..\nThat kind of exclusive behavior pushed me a little over the edge as I’ve been have to deal with people being racist in that manner and more and not realizing how hurtful their behavior can be to others around them tho they are just trying to laugh..\nSeems like at the end of the day I’m the issues..\nSeems like at the end of the day I shouldn’t be on this planet anymore..I’m having suicidal thoughts yes..\nBut for now I’m here to stay to learn and grow even tho the one I wanna talk to doesn’t wanna talk to me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kfmj39/hotline/", "title": "Hotline", "social_network": "reddit", "user": "TxmodsxDIIII", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1608303248, "permalink": "/r/SuicideWatch/comments/kfmj39/hotline/", "nsfw": false, "first_save": 1635427156.978146, "replies_charged": false}