{"id": "t5_2qpzs_t3_5d0j4d", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I don't even know where to start. I definitely don't know where to start without sounding like a whiny bitch. \n\nTo start, I'm mid 20s, male, dad to 4 kids. Married. Unemployed. Major anxiety, don't know how to handle myself anymore.\n\nTo begin, I love my kids to death. I don't feel equipped to deal with them.\nI love my wife, I don't feel equipped to deal with her.\n\nI wish I had a job, nobody answers back. 4 months, no money, Christmas coming up, I'm getting impatient. \n\nMy last job was at a liquor store. Nothing fancy. Lost that due to a few reasons. Drinking, being on my Ativan at work hard, just to ease the anxiety a little bit.\n\nGod knows I haven't been the best husband. Don't blame her for being like this to me. I've never offered stability, or anything that would make me a good husband.\n\nNever been a drug addict or a big drinker until recently. The anxiety just got too much to bear. I don't do Street drugs. No tar, no crystal, nothing like that. \nJust went and saw a doctor for the first time in years. He has put me on so many different prescriptions in the last year to balance me out, nothing works. He finally got me on Ativan, it doesn't work but it's better than the other 7 things I've been on.\n\nWas incarcerated for a while in my younger days. They tried a lot of therapy, prescriptions, all that. Nothing worked.\n\nI dunno.\n\nMy wife works a graveyard shift. Comes home at 7am. Sleeps until 4. Gets up, goes back to take a nap at 9. I do everything. Not to mention I don't sleep, I never do. An hour here and there.\n\nI've told her so many times, I need some help with the kids, they've been screaming at me for days, i need help cleaning, ect, she gets mad at me, blames me. \n\nI'm just at my wit's end. The last month ive had constant chest pains, my stomach has been burning. I can't see the doc for a while until I pay him for a no call no show appointment. \nProbably just stress. \n\nFuck this isn't even close to everything but I guess that's all I have to say.\n\nThanks", "url": "https://www.reddit.com/r/SuicideWatch/comments/5d0j4d/at_a_loss_overwhelmed/", "title": "At a loss, overwhelmed", "social_network": "reddit", "user": "Unsureofname1991", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1479182401, "permalink": "/r/SuicideWatch/comments/5d0j4d/at_a_loss_overwhelmed/", "nsfw": false, "first_save": 1635426352.6558592, "replies_charged": false}