{"id": "t5_2qpzs_t3_lpfjja", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "Hi,\n\nI'm an 18 year old student from the UK. On the surface, I have plenty of things to optimistic of excited about. I have a place at elite university to study something I'm so passionate about this September. I get lots of attention from the opposite sex (when once of a day I was widely considered a \"ugly, fat but funny friend.\" I have tonnes of career prospects. I have tonnes of friends who love me to death. I know how to crack a hell of a joke.\n\nBut none of this makes me happy. None of it feels worth living for. I can tell you *why* I am alive.\n\nI'm alive because I have three little brothers, ages 14, 13 and 10. My 13 year old brother believes he might be gay and doesn't have a single person (especially not his parents) he can turn to. I'm his best friend. My 10 year old brother fucking loves me so much. I stay at my grandma's for a few days and he's constantly asking when I'll be home so we can cuddle under a blanket and watch cartoons or play Pokémon Showdown together. He draws me pictures of my favourite anime characters. He wants to be an artist. I'm alive because my friend who was cheated on by her ex girlfriend for a year straight told me \"I love you, I am alive today because of you\" and another friend told me \"you mean everything to me.\" I'm alive because my disabled mum and my dad who had to quit his job to care for her have never wanted for anything else except to see me succeed in life.\n\nI wish I was never born so I didn't exist in any of these people's memories. I wish nobody would care of remember me. I don't want anyone to feel pain. If I could just slowly drown and never exist and everyone whose ever known me could just forget, I would finally feel at peace.\n\nMy reasons feel laughable and ridiculous to many. When I've tried to talk to my dad or countless therapists I just get \"don't be so silly\" or \"that's not a very healthy way to think.\" Nobody takes it seriously except me.\n\nI've always wanted a house, a husband and a family. Not straight away. I want to publish books and start a career first. But eventually. I want someone to love me and sleep by me, unconditionally. I want to die in a man's arms.\n\nBut I know no matter how many books I publish or how much wealth I accumulate or how many houses I could own, l'll never be happy. Nobody will love me. So many guys have told me \"I'm in love with you\" but I'm a big believer that actions speak louder than words. They cheat or, here's the real kicker that'll turn you against me and make you probably tell me to just commit toaster bath (lol): watch porn.\n\nI used to watch porn. Quite regularly, when I was nowhere near legally old enough. That was until the realisation hit. Men watch porn, of course. They start at 12, 11, younger... This is what I need to be. I need to be flat like a plank of wood in my stomach. I need to be gorgeous, pouty and 5\"8\" (I've been 5\" since I was 11, thanks mum and dad). I developed bulimia. \n\nI had a long term relationship with a boy when I was aged 16-17. I knew he *actually* didn't watch it because he had *a lot* of his own issues but then we broke up. I've had an abundance of male attention but I'm still a virgin. I purposefully sabotage all my situationships and crushes the moment my suspicions are confirmed. Either I check what be follows and likes on social media or he slips up and reveals the ugly truth anyway \"oh I watched the hottest porno last night...\"\n\nMen reading this, I'm well aware you think I'm a crazy fucking bitch, right? I know. I know. I'm sorry. I can't pretend to be fine. So many of my female friends feel the same (well, a similar at least) way to me. \"The porn makes me feel ugly, too fat, too thin, why won't he just be happy with me?\" I've heard all the excuses: oh I just have a high libido (so do I), oh it's just a habit (so is meth, for many people), oh it's natural (cavemen didn't have cameras and liposuction but sure).  But all of my friends have this ability to just bite their tongues and tune out the pain so they don't up alone. But I can't do that for some reason. I'd rather die alone and cold than let a man who would choose some plastic pixels over me see me in such an intimate way.\n\nIt's just so normalised though. I spend hours on Reddit, TheStudentRoom and Newspapers that tell me to \"get over it.\" Well, newsflash: I can't. When I am genuinely in love all I can think about is that man. No matter how tall or short, greasy, chubby or skinny, I don't care. Because I love him. He's all I want. I truly feel heterosexual relationships have lost all their meaning. Our bodies are traded like Pokémon cards. We exist as sexual commodities. And I'm so sick and selfish that all I want is for one day, someone to love me so much that they think I'm beautiful and they don't need a prettier girl to get off.\n\nThat day isn't coming. I don't want to live. I don't sleep. I'm fucking up my good grades in school and my teachers are starting to hate me. I was clean for a year and a half but I'm bulimic again, purging once more. It just feels unfair that I have to be alive. Not a single thing makes me happy. I'll die alone anyway.\n\nIf I was up in a spaceship, looking down at the Earth, I would've never left the air.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lpfjja/bulimic_worthless_suicidal_18_and_still_a_virgin/", "title": "Bulimic, Worthless, Suicidal, 18 and still a Virgin: I can't keep doing this. There's nothing for me now.", "social_network": "reddit", "user": "conservativepink", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 10, "down_vote": 0, "creation": 1613969848, "permalink": "/r/SuicideWatch/comments/lpfjja/bulimic_worthless_suicidal_18_and_still_a_virgin/", "nsfw": false, "first_save": 1635422928.9464972, "replies_charged": false}