{"id": "t5_2qpzs_t3_opbicg", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "I used to be such an awful, selfish, horrible person. I hurt some people very, very badly when I was younger. I am basically the definition of when the victim of abuse becomes an abuser. I was fucking awful. I feel so bad for one person in particular, I did not respect their boundaries, they suffer from what I did. I didn't know I did anything wrong, I never had any idea that what I was doing to anyone was wrong. I wish someone told me how awful the way I acted was. I've put so much work into completely relearning everything and viewing every single thing in such a healthier way, but this guilt from my past that I must carry with me hurts more than words could ever describe. Just knowing that they will always see me as who I was then is terrifying.\n\nOther than the guilt of what I did to people, the way they treated me too has also left me with extreme trauma and I feel so manipulative when I say that. When I was younger everyone around me treated others like shit, so it was normal to me, hence why I didn't know I did anything wrong. I feel so manipulative when I say it, like I'm trying to find a way to excuse my shitty actions but I know I'm not. It's what I saw happening all around me everyday and the way I physically can't leave my house without having atleast two panic attacks because of what they did to me. \n\nI was selfish, exetremely mentally ill, lacked any sort of healthy communicative skills, disrespected peoples boundaries, hurt someone in a way that nobody should ever have to be hurt. Every single thing that I remember from that time just makes me feel worse and worse. \n\nI know I am a good person, I have changed for myself and my future, I don't need to prove that to anyone. I actively try to treat people well, give people the benefit of the doubt, etc. I care about others like I did before I became such a toxic human. It's just these nights that the guilt resurfaces and it majorly tests my will to live.\nI need help but I feel since I was such a disgusting person, that I don't deserve to live. I feel like I don't deserve to get better if those people still suffer from my actions. It's so hard to just accept that I will have to live and heal with the consequences for the rest of my life, they weigh me down so much. I have tried apologizing, some went well but the one I feel the most awful about will never be the same. I have tried every way that I can find to just find peace, and usually I am able to just get through each day, but fuck it's so bad right now.\n\nI don't know what to do, therapy hasn't helped cope with this guilt because I can't even admit all of my actions because of how shitty they were. I feel like the complete scum of the earth who should not deserve to breathe even though I have learned from my mistakes and believe so much in rehabilitative justice. I just can't feel this pain so intensely for so long, it's a debilitating physical pain combined with my self hatred from abuse I endured growing up. I try to look for the positives, I always do but no matter what I keep having this inner war that just circles right back to the \"if they still suffer, I must suffer.\"\n\nI want this to end. I need this to end.", "url": "https://www.reddit.com/r/SuicideWatch/comments/opbicg/i_want_end_this_constant_suffering_from_the_guilt/", "title": "I want end this constant suffering from the guilt I carry every day.", "social_network": "reddit", "user": "greenwall126", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1626951483, "permalink": "/r/SuicideWatch/comments/opbicg/i_want_end_this_constant_suffering_from_the_guilt/", "nsfw": false, "first_save": 1635426182.072714, "replies_charged": false}