{"id": "t5_2qpzs_t3_j0tg7g", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I know this is going to sound ridiculous but I have a very uncomfortable addiction to cannabis, better known as cannabis use disorder. \n\nI've been smoking weed everyday for the better part of 8 years. Whenever I don't have it, I crave it, the Cravings then turn to dwelling and ruminating. \n\nI get $20 a day from disability Monday-Friday, but not including holiday Mondays or Fridays. \n\nToday happens to be Sunday, and on Sundays I do not get paid. I have zero control over that. \n\nWhenever I don't have weedthen begin thinking about it and it's a snowball like effect of thoughts about it. \n\nThe minutes turn to hours, every single minute that goes by, it really feels like an hour. \n\nFor the past two hours now, I have been having worsening thoughts, and they will continue to get worse until I can get my next fix. \n\nI've already drank too much coffee (I drink caffeine whenever I don't have any access to cannabis as that habit is far cheaper and much more affordable). \n\nI drank probably about a liter and a half (1.5L) of coffee this morning, and I'm really jittery and can't even sit still, half a liter would have been enough (0.5L). \n\nif someone were to give me $20 right now, or say for example if someone were to give me two grams of weed to smoke, my eyes would light up like it's Christmas Morning.\n\nAnyways it would significantly help and ease the terrible and ongoing suicidal thoughts because I can't regulate anxiety and depression symptoms.", "url": "https://www.reddit.com/r/SuicideWatch/comments/j0tg7g/i_cant_go_through_with_this_shit_25m/", "title": "I can't go through with this shit 25/m.", "social_network": "reddit", "user": "cw9595cw", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 0, "down_vote": 0, "creation": 1601222176, "permalink": "/r/SuicideWatch/comments/j0tg7g/i_cant_go_through_with_this_shit_25m/", "nsfw": false, "first_save": 1635428069.9711154, "replies_charged": false}