{"id": "t5_2qpzs_t3_nwgo6g", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "I've been having growing thoughts of killing myself due to a feeling of meaninglessness. I feel as if I can't maintain a genuine relationship with anyone in my life. I either am too distanced from people, too scared to approach people, or push people away with too much attention. The other day, while thinking out potential plans (and ruling every single one out), I wrote a suicide note. I don't feel comfortable showing this to anyone I know, but I still have some sick glimmer of hope about life, so I'll post the note here.\n\nWhen I die, I don't want anyone to mourn me. This was destined to happen. We all knew it would happen eventually. That, well, I'd kill myself. I knew it myself for years. That it would be this way.\n\nMy parents never really loved me. They treated me like a fucking doll throughout all of my formative years, or saw me as a means to get more money. And now that I'm older, all they see me as is a cheap way for convenience. Whether that be a ride to the store, a quick loan, whatever may have you. My needs don't come first to them. My parents genuinely couldn't care less about me. I thought my Mom could, for a while, but her new boyfriend clearly means infinitely more to her than I do now. The fucker abused me as a child and she was a bystander to it, and now she's with him again. Ironic.\n\nI know my siblings love me, and to them, I truly apologize. I know, that this is hard, my death, but... Yeah.\n\nSisters, you two are the best gay sisters a person could ask for. I really do love both of you. I don't blame either of you for being absent in my youth. Our dad is a piece of shit, and frankly, if I was in y'all's position, I would've taken the same stance. I love you both.\n\nOlder brother, I really miss you. You've always kinda popped in and out of my life but you've always been caring for me. You've always taken care of me and watched my back, while trying to build me up. I sincerely appreciate it. You're fucking awesome. Shelby, and your whole family are going to have a sweet, wonderful life. I'm sure of it. I love you dude.\n\nLittle brother... I'm, sorry. I'm letting you down. I know I've told you to be strong and push through anything. I still mean that, even now. Which, I know, is hypocritical of me. Please, get through this. Don't make the same mistakes I did. Have fun in life, meet people. Fall in love, make great, caring friends. Get high, get drunk, really experience life Bro. Don't be a fucking stick in the mud like me. I love you bro, take care.\n\nI know I've made and lost plenty of friends in life as well. I currently have two, that I know care about me. So, I'll tell them my final messages.\n\nBest friend 1, dude, you're fucking rad. I hope you go on to achieve great things, and hell, who knows, if reincarnation is real, I might be in your therapist office one day. Whatever the afterlife holds dude, I'll see you on the other side. Take care bro, I love you.\n\nBest friend 2, hey. Our friendship is honestly a bit shortlived. I first wanna say I forgive you, for the bullying in like freshman and sophomore year. And thank you for trying to be here for me. Listen, the problems I've been dealing with are a lot harder than you could ever hope to understand, but I'm grateful that you were here for me in my final years.\n\nTo my online friends, to everyone in Server, you all are DOPE. I can't believe I got meet such a young, talented, loving group of people. Honestly, you all have made me feel safe and loved in ways I could never imagine and ways I've never experienced in real life. It's a shame that you all are only my online friends, but nevertheless, I'm glad to have met you all.\n\nEx. This isn't your fault. I was having suicidal thoughts even in our relationship. The breakup honestly was honestly a bit of a tipping over point, but it was going to happen eventually. I knew even in our relationship that one day I would kill myself. So please, don't blame yourself. Move on from me. Have a grand life. You're strong. Everything you accomplished in our short time together, you would've accomplished without me. Please, have a great life, I'm begging you. I love you.\n\nI loved everyone in my life, and am grateful for the many lessons I got to learn in my 19 years on the planet. The Earth will keep spinning though. Take care everyone.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nwgo6g/potential_suicide_note/", "title": "Potential Suicide Note", "social_network": "reddit", "user": "IDKHBUTFM", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1623305829, "permalink": "/r/SuicideWatch/comments/nwgo6g/potential_suicide_note/", "nsfw": false, "first_save": 1635426783.9425867, "replies_charged": false}