{"id": "t5_2qpzs_t3_k9d0vh", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41", "929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I'm not gonna say what the method is but yeah. I'm pretty thrilled because \"wow, a way out of my life!\" especially since the pandemic is ultra hard on everyone. I hate suffering so much and I find it so fucking stupid we have to suffer eternally in this life, which is why i want to die. Yeah, suffering doesn't end and we all should learn how to cope but I don't want to. I don't want to grow up and shit and take responsibility for a lot of things. \n\nAt the same time, I'm scared. I'm scared because of stupid survival instincts and how much pain I'll be inflicting on people who know me. I hate humanity but I love certain humans and these certain humans, I would be awfully sad to see them cry and grieve and suffer because I killed myself. But I'll be dead then, so would it actually matter?\n\nI am very selfish, as one person who used to be my best friend said. I go with my impulses and splurge on myself a lot, which makes a few people irritated at me. And lately, I am slowly cutting myself off from everyone, including my boyfriend and my current friend group (whom i really, really love but my impulses of self-sabotage are greater). Probably next year, I'll be a hikikomori since this pandemic shit ain't gonna improve soon. I'm also planning to drop out of my scholarship (and college) since I just feel like ruining my life right now.\n\nPretty much the only things that make me feel alive are playing games and rolling in gacha games. I'm not really addicted to them since I only play for 1-2 hours a day at most -- I'm probably more addicted to rumination and sleeping tbh. These games make me happy because of being able to play and use my favorite characters and watch them fight and shit is so cool. Fucking sucks though that people I know irl keep shitting on my favorite characters, so I end up just isolating myself from them more whether I'm close to them or not. God, I wish they could stop shitting on my comfort characters. Good thing the good ol' ignore/mute/unfollow/block buttons are there.\n\nLooking at this, my life seems pretty pathetic. I really want to kill myself but I'm also afraid to die for some goddamn reason. Why am I afraid to die if I have pretty much nothing to lose? All of this doesn't make sense and I just want everything to end.", "url": "https://www.reddit.com/r/SuicideWatch/comments/k9d0vh/found_a_pretty_lethal_and_probably_painless_way/", "title": "Found a pretty lethal and probably? painless way of suicide but my mind and conscience keep telling me not to do it. Advice would be nice", "social_network": "reddit", "user": "Rosie8388", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1607461511, "permalink": "/r/SuicideWatch/comments/k9d0vh/found_a_pretty_lethal_and_probably_painless_way/", "nsfw": false, "first_save": 1635427413.511163, "replies_charged": false}