{"id": "t5_2qpzs_t3_gvs92n", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I was recently promoted to a board member for my UC's writing club. Pretty much everyone unanimously thought I was the person who should have that position. The problem is that most of the memories I've made at this UC have been utter shit. Bad roommates, social isolation, constant rejection (still a virgin at 22) and being pushed away from everyone, I've hid in my dorm room the entire time. And I want out. I want to go to a different college, one where there's more emphasis on socializing and partying, if that shit even exists. But then I'd be giving up one of the few achievements I ever had; I'd be giving up a position I've earned.\n\nAnd if I DO leave the UC, my mother is INSISTENT on sending me to a state campus close to home, because she thinks having me close to home would help me. News flash, it's pretty clear it doesn't. Who exactly would want get to know, let alone date, a 22-year old who lives with his parents? I just... I truly don't know what to do. I don't want to give up something I've earned but I'm so miserable at this UC and I want out. And I'm worried that even if I go to a different UC, I'll STILL be socially isolated and graduate college a virgin with barely any experience. I know it gets even HARDER to meet people after uni, and... I honestly feel like it would just compound my failure. As a man and a human being. And if that happens... giving up on this chance for nothing, then yeah, I WILL kill myself. I’ll get some more motivation to learn how to drive, so I can drive off a fucking bridge. \n\nI want to hurt myself, just to make it stop. I'm an indecisive moron who can't decide what's best for himself, who does nothing but fuck up and drain money, and I have nothing impressive to show, no life skills that can help me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/gvs92n/my_indecisiveness_is_hurting_me_emotionally_and_i/", "title": "My indecisiveness is hurting me emotionally and I feel like eventually I can't take it anymore...", "social_network": "reddit", "user": "Blastmasterism324", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1591183745, "permalink": "/r/SuicideWatch/comments/gvs92n/my_indecisiveness_is_hurting_me_emotionally_and_i/", "nsfw": false, "first_save": 1635426609.2517605, "replies_charged": false}