{"id": "t5_2qpzs_t3_ppejjr", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "I have a shit ton of money for no reason, the world’s best therapist, education, so much privilege, and I don’t care. \n\nI do not believe this world to be inhabitable and I can no longer tolerate the triggers that unravel me on a daily basis. I have PTSD, GAD, MDD, OCD, panic disorder, cyclothymia, an attachment disorder, a substance abuse disorder, and chronic insomnia. My life is an emotional minefield. I spent my first several years in an orphanage, experienced abuse and neglect that made it nearly impossible for me to love/receive love as an adult. \n\nBecause of that, I haven’t been able to fully let go of a toxic relationship. Despite loving family and wonderful friends, being with this man is the only way I’m able to experience love that isn’t excruciating due to cognitive dissonance, shame, etc. but due to both of our histories of abuse, it’s virtually impossible for us to love each other healthily. I don’t believe we can ever stay together, but god I LOVE THIS MAN. I no longer believe I can break the addiction and I’m not sure I even want to anymore.\n\nI’m going to spend my last days with him. I’m going to book us an expensive hotel, we’ll have mind-blowing sex, talk about everything for hours the way we used to, I’ll take us to restaurants I wouldn’t otherwise think I could afford, I’ll visit my favorite places, and I’ll buy a ton of food/supplies for every homeless person I see. It’ll be short enough that things won’t become volatile, and I can have that honeymoon phase one last time. \n\nThen, after he leaves, I’m going to buy myself one last glass of Pinot Grigio, have an interesting conversation with a stranger at a bar, and jump off a skyscraper and die in my favorite city in one of my favorite outfits. I’m so excited.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ppejjr/im_so_excited_to_die/", "title": "I’m so excited to die", "social_network": "reddit", "user": "ElvitaAdams", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1631803049, "permalink": "/r/SuicideWatch/comments/ppejjr/im_so_excited_to_die/", "nsfw": false, "first_save": 1635426547.406026, "replies_charged": false}