{"id": "t5_2qpzs_t3_m7jsw9", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I have dealt with depression for nearly 12 years probably more but that is as far back as I can clearly recognize it.\n\nThe last week has been ruff to say the least. I started my Lexapro back up about a month and a half 10mg I just recently used myself to 20mg. Lexapro has worked well for me in the past.\n\n\nHonestly the last week I envision putting a fire arm to the side of my temple and pulling the trigger. \n\nI don't want to die, I don't won't to kill myself bought the visions and thoughts of doing so are just so damn pervasive.\n\nI find it so strange the smallest parts of your brain keep you breathing yet it lets you entertain thoughts of ending it and will actually let you end it if you try. \n\nI'm almost one year separated from my wife we are getting divorced, we still have a home together neither one of us live in due to storm damage. I talk to her sometimes she knows about my sight problems and I find Comfort even though deep down I also despise her, but it is nice that she will talk to me and help keep me calm with my anxiety and depression take hold.\n\nI have other romantic interest but between anxiety depression introvertedness and they lack of reciprocated feelings things have not gone very well.\n\nI just feel so alone I can be in a room with all of my closest friends and yet I am still alone.\n\nIt's all so strange to me because I feel like I have so much I make good money have great friends pretty much anything I could want within reason yet all of it feels completely meaningless, none of it matters.\n\nI know happiness comes from within but having these things doesn't seem to matter if I have no one to share with.\n\nMy alcohol intake has greatly increased even now I'm 4 shots of tequila in Jim Beam and Sprite I used to not drink like this until maybe the last six months now it seems I can't get drunk enough to numb the pain and sorrow that I feel constantly.\n\nI just really need someone to talk to someone to provide some inspiration to help me through. And I desperately want someone I can rest my head on the feel like I'm being cared. it's so hard being alone after a 5-year marriage and a total of a 10 year relationship.", "url": "https://www.reddit.com/r/SuicideWatch/comments/m7jsw9/thoughts_of_selfharm/", "title": "Thoughts of selfharm", "social_network": "reddit", "user": "mellowmelon86", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1616044654, "permalink": "/r/SuicideWatch/comments/m7jsw9/thoughts_of_selfharm/", "nsfw": false, "first_save": 1635422300.4960692, "replies_charged": false}