{"id": "t5_2qpzs_t3_mogfo6", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I honestly don’t know what to do anymore. I feel as though I don’t have the right to have emotions. I feel like I’m less than human. I’ve been told many times that I’m mature for my age and that’s been going on since I was five. Since when should five year olds be fucking mature? Five year olds shouldn’t have to put up with things to the point of them being considered mature. Despite the fact that I’m still a minor, I feel as though my childhood has already ended. I hardly have any social skills and only have around 3 friends who I would sacrifice anything to keep around. If they leave, I’ll have absolutely no purpose to life. I don’t really get along that well with my mother’s side of the family, partly due to my Nan attempting strangle me while drunk and my mother being emotionally and mentally abusive. My mother and father split up when I was 5, though I still see my dad at times, but lockdown has obviously caused an issue with this. I despise the fact that I live with my mother, though I’m glad I don’t live with my dad. I have three stepsisters who I don’t really get along with who live with my dad, so I’m glad I’m not dealing with them 24/7, though what I do have to put up with is my mothers abuse. Sometimes I wish that her abuse would get to the point of causing me to have any form of physical damage just so I can prove that my mother abuses me. I can’t go to anyone, take my father as an example, and say that she abuses me as I don’t have anything that I can show physically as evidence. She can easily turn down what I say with the excuse of me being ‘over dramatic’ and people would believe her. She has caused me to harm myself many many times. This has occurred today. As I’m still a minor, I still live with her and she can easily ground me, so she has grounded me from the play station. This likely sounds incredibly petty, though this means that I am unable to play my comfort games (minecraft, stardew valley, etc.). They are some of the only things that have kept me from killing myself in the past and I often play them to get my mind off of stuff, though that has been thrown away. She was yelling at me for forgetting to put the butter away (despite the fact that I accidentally left it out for around 15 minutes, it hardly had anything left and we have another tub of it) and began insulting me when I told her to calm down and that I’m sorry. She began insulting my physical appearance by saying stuff about my weight (her doing this in the past has sent me further down the road of developing an eating disorder), my face and just my appearance in general. Everything has began to catch up with me and I can’t handle it. I feel like I shouldn’t have emotions, so I’ve been trying to hide them the best I can but this has become a challenge as I constantly feel like I want to simultaneously scream, cry, cut myself, hit myself and kill myself. I’m stuck in a constant loop of suppressing my emotions in an attempt to stop having them, feeling annoyed at myself for doing so, getting annoyed that getting annoyed is basically an emotion and then wanting to die but then I realise that I’m too scared to die and I then realise that fear is an emotion which them sends me into a pool of guilt, anger, self-hatred, fear and dread. I hate it all so much. I hate my body, my emotions and the fact that they both exist. If you have decided to read this, I thank you thoroughly for your time and I hope you have a good day/ night.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mogfo6/my_mental_health_is_ruined/", "title": "My mental health is ruined", "social_network": "reddit", "user": "PekoPekoyamasSword", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1618100451, "permalink": "/r/SuicideWatch/comments/mogfo6/my_mental_health_is_ruined/", "nsfw": false, "first_save": 1635428250.200798, "replies_charged": false}