{"id": "t5_2qpzs_t3_jlsizb", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "Impossible thing to deal with. I’m average (too I think), but it’s an impossible illness to cure, especially when mixed with social anxiety. I’m 21 now and ever since puberty it has ruined my life. I can’t look down without wishing I died. I don’t have any friends nor have I ever had a girlfriend, and even if I did I would be too afraid to do anything sexual. This disease has festered inside of me that I truly hate being a man and feel inferior to others. I get immense euphoria when I think about cutting I off. I fear I might actually do it one day because I genuinely can’t stand it. It’s caused nothing but problems for me physically and mentally. \n\nThis is what society does to men, I know I’m not the only one who has mental anguish from their size or in function. All day and night in the media and irl, small dick jokes, small dick shaming, if you don’t pack 8 inch dick your not a real man, you cum too quick your weak and pathetic, etc, etc. All this horse shit is fed into us since birth. No wonder so many guys kill themselves, so many guys are angry. \n\nAnyways life is hell and I’ve learned to hate myself and being a man. Soon I’m going to kill myself. Nobody can help me with this unfixable problem. I will probably record my death and hopefully the news will pick it up and share it to thousands of people. I hope my suffering and sacrifice will create change in the way society and the media treats men and their bodies.", "url": "https://www.reddit.com/r/SuicideWatch/comments/jlsizb/penis_dysphoria_and_i_want_to_die/", "title": "Penis Dysphoria and I want to die. :)", "social_network": "reddit", "user": "throwaway1736381", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 41, "down_vote": 0, "creation": 1604187421, "permalink": "/r/SuicideWatch/comments/jlsizb/penis_dysphoria_and_i_want_to_die/", "nsfw": false, "first_save": 1635428251.4835315, "replies_charged": false}