{"id": "t5_2qpzs_t3_cdxfal", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "so, im impulsive today, cut my hair with a knife, digging my nails into my palms. threw my phone across the room, my mom took it, she's mad, im sad, suicide Is on my mind alot rn, ofc I have plans and a group of friends to do it with, I told my therapist that and she never threatens to send me anywhere or anything but she thinks that im not gonna do it with them, which hopefully I am going to, but whatever. she just thinks of me as an attention whore. I cant do anything right. and she says how I dont have a reason to self harm or to want to kms. which I agree with some of the time, but then again its rude. I get so annoyed by her, but she is a friend of mine rather then a therapist.. its weird. but what reason do I actually have that matters? (trauma? ha what's that Chemical disorders? never heard of them. medicine that doesn't work? lets up it. being bullied and abused? yeah right, attention whore.) - what I think she thinks. its great, love it-sarcasm. I mean everyone eats with this stuff, but idk, im just weak. I am an attention whore at its finest. I guess posting about it to have a discussion about it without getting \"attention\" in the way people see attention seeking is attention seeking. I guess having an actual convo with my therapist about something serious that isnt for attention is attention seeking. I guess being serious about this stuff and sliding in a serious topic in a laughing way \\*she knows its my coping mechanism\\* is attention seeking. id hate to actually wuss out at the last second because then it would prove im an attention seeker. but at the same time, the pact im in is voluntary, I can back out at the last second, anyone can, hell I might not even be able to go to the event or even be a part of it regardless of if I want to die.", "url": "https://www.reddit.com/r/SuicideWatch/comments/cdxfal/my_diagnosis_attention_seeker/", "title": "My diagnosis - attention seeker.", "social_network": "reddit", "user": "totallionelml", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 10, "down_vote": 0, "creation": 1563285695, "permalink": "/r/SuicideWatch/comments/cdxfal/my_diagnosis_attention_seeker/", "nsfw": false, "first_save": 1635427766.512447, "replies_charged": false}