{"id": "t5_2qpzs_t3_q3kil4", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42"], "text": "A few years ago I left my toxic, high-pressure job to help with my mental health. I got better and my suicidal thoughts and depression subsided. Fast forward to the past few months, since I left my job my wife and I started struggling financially, with how bad the economy is I've needed to pick up two jobs so we can get by. \n\nI don't hate my jobs and they're low pressure, but we're barely making it by and our debt just keeps racking up because of things like care issues and needing to get dental work done for my wife and I. I've given up as many amenities as possible to lower costs and I work all the time but we're still struggling. I rarely get to see my 3 year old daughter anymore because I'm either working or sleeping. \n\nI feel like I'm drowning in a mountain of debt I'll never be able to get out of, I feel like in idiot for leaving my well paying job, if I had just sucked it up and stayed there we wouldn't be struggling. I feel like I've failed my family and that my wife would've been better marrying someone who was successful and had something going for them.\n\nWhen I was a kid my mother struggled financially and I feel like I'm putting my daughter through the same thing. I'm working my ass off but it's not enough and I don't know what to do anymore. For the first time in years I've started having suicidal thoughts again, and my depression is back full swing. I just want to lay in bed all day and avoid the world but I don't want to waste the little time I have with my daughter. I just don't know what to do.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q3kil4/my_suicidal_thoughts_are_coming_back_and_im/", "title": "My suicidal thoughts are coming back and I'm overwhelmed.", "social_network": "reddit", "user": "sirenssixx1125", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1633646409, "permalink": "/r/SuicideWatch/comments/q3kil4/my_suicidal_thoughts_are_coming_back_and_im/", "nsfw": false, "first_save": 1635427363.312794, "replies_charged": false}