{"id": "t5_2qpzs_t3_qeic8b", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "I’ve been crying every day for over a month. I can’t stop feeling like my life is already over.\n\nI’m in so much debt and I’m leaving school because I can’t afford to put myself in more debt for a degree that might not even help me secure a better paying job.\n\nI don’t have a car because I struggled with awful driving anxiety for so long. I’m trying to get my license now, driving nearly every day. It’s not easy and I’m still so scared of hurting someone. I was able to get a job finally but I’m trying to work fuller hours since I’m leaving school but it all depends on if they can give me a schedule where my roommate can take me to work. Buses near me aren’t reliable enough to depend on and I can’t have many attendance issues or I might get fired. \n\nI’m trying so hard to be optimistic but everything just feels so heavy, and my thoughts are just getting darker everyday. I keep having thoughts of just driving a knife into myself. I know I need to get help but I can’t afford it. I tried to get help before but it just made everything worse and I had an awful breakdown that even put me on short-term disability for a month. It was terrible and I never want to feel my mind shatter like that ever again. \n\nI just want to be okay again. I haven’t felt okay in so long. I finally stopped covering it up with alcohol, but I just want to go back to being a mindless drunk. I feel like there’s nothing for me here and I’m going to be working shitty jobs just to make ends meet forever.\n\nWhat’s the point? Why keep fighting for a life I don’t want? Why keep crying every day? I don’t want to deal with anything anymore. I don’t want to keep trying. I can’t, I just can’t. I’m too tired.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qeic8b/i_cant_stop_crying/", "title": "I can’t stop crying", "social_network": "reddit", "user": "ForeverAdorable", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1635039702, "permalink": "/r/SuicideWatch/comments/qeic8b/i_cant_stop_crying/", "nsfw": true, "first_save": 1635426830.4696748, "replies_charged": false}