{"id": "t5_2qpzs_t3_x80ja", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "Disclaimer:  This is me speaking personally, without my moderator hat on.  I want to satisfy my curiosity about how my thinking lines up (or doesn't) with the SW community as a whole.   \n\nI've been seeing an increase in posts of this type lately, and I don't want to single out this particular OP for criticism, but this title really crystallized my concern.\n\n>  I thought it'd be easier to tell you i'm here to help you rather than comment on every post I see. \n\nThe thought that occurred to me in response is \"Yeah, easier for *you*.\"  \n\nI have real concerns about posts of this type.  \n\nFor one thing, as I discussed with CoriCelesti in modmail, and which she kindly summarized in the above-referenced thread for us, PMs can't be moderated, nor can the rest of the community weigh in to correct misinformation or debug misguided advice.  \n\nFor another, as far as I can see the vast majority of people doing this don't maintain that much of a presence here at SW otherwise.  That means that someone who's too scared to post has very little information to go on when they're trying to decide whether you'd be likely to offer feedback and advice and support that would be helpful to them.  If somebody really wants to play the chatroulette game to get suicide intervention, well, that's what CompassionPit (where there is absolutely no vetting of the helpers as far as I can determine) is about.  \n\nOne thing that I find incredibly frustrating is when somebody advertises that they're \"here to help\" while ignoring OPs who have posted about extremely serious situations and aren't getting many helpful comments.  That makes me distrust them right away, frankly.  \n\nAlso,  we have no reason to think that the 90/10/1 rule doesn't apply here at SW.  In fact, we quite often see in posts or PMs that people have been greatly helped simply by reading the interactions that take place here.   So a constructive conversation that takes place in post comments could be expected to potentially help 9 suicidal lurkers (on the average) in addition to the OP. \n\nI completely get that sometimes people would rather PM than post.  And in my experience most of them view the comments or posts and PM someone who appears *on the basis of their demonstrated reddit behaviour* to be the kind of person they'd find helpful to talk to.  That is what *should* happen imo, and I think it mostly does.  \n\nPlease understand that I'm not suggesting that we ought to reject anyone's help, I'm just a little worried that this might not be the best way to mobilize our collective generosity and empathy. \n\nI've had conversations of this type in private, and in general once I point out all these things people seem to understand and come to mostly agree, but those have been isolated situations.  So I want to know: what does everybody out here think?  \n\nEdit:  I accidentally repeated repeated something something.\n", "url": "https://www.reddit.com/r/SuicideWatch/comments/x80ja/what_does_sw_think_about_the_im_here_to_help_pm/", "title": "What does SW think about the \"I'm here to help, PM me!\" type of posts?  ", "social_network": "reddit", "user": "SQLwitch", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 17, "down_vote": 0, "creation": 1343351027, "permalink": "/r/SuicideWatch/comments/x80ja/what_does_sw_think_about_the_im_here_to_help_pm/", "nsfw": false, "first_save": 1635426316.5195456, "replies_charged": false}