{"id": "t5_2qpzs_t3_pw3dlt", "request": ["4162f604-29a0-4041-a85b-c249e1ca13f8"], "text": "I'm thinking about moving out of my family's house because I turn 18 in a few months. Reasons being: 1) I constantly offend my mother and family with my problems 2) my mom expects me to be able to do anything around the house and to help her, but i can barely handle my own life lately. 3) she constantly yells and berates me, leaving me to angrily do stupid things or cry for hours. 4) Recently she's been telling me how much she has to pay for bills and mortage and that I don't do anything yet I'm taking up space that I might as well get out of her house. 5) my father is practically useless in this situation. 6) I'm so, so tired. Being around her drains me so much that I simply give up on a day to day basis. 7) I don't know why I'm so messed up and sad and angry all the time. sometimes I wish I could stop existing. But some part of me does want to get better.\nReasons why I can't move out: I'm broke. I have nothing if I run away from my parents. Like I have no driver's license, no job, not even enough money to live for a week, no ID, I'm also still in Junior year of High school. I really want a solution to this situation, I can't ask my extended family for help because they'll just look down at me. It's embarrassing. I really want to make it through high school successfully but it wont be possible if I have to work from now on. I can't get CPS involved because I'm 17 and they didn't do anything last time. I neep help. Please, I don't know what to do.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pw3dlt/i_need_help_tw_depression_verbalemotional_abuse/", "title": "I need help (tw: depression, verbal/emotional abuse)", "social_network": "reddit", "user": "RedditUsrnamsRWeird", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1632693700, "permalink": "/r/SuicideWatch/comments/pw3dlt/i_need_help_tw_depression_verbalemotional_abuse/", "nsfw": false, "first_save": 1635422894.5423703, "replies_charged": false}