{"id": "t5_2qpzs_t3_ph3hki", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "It’s disgusting. Really.\nI could’ve done so fucking great If I wasn’t so fucked up. But everything just keeps getting worse and worse. And no matter who or how often I ask to get help I always get shut down and ridiculed. I have diagnoses over diagnoses, but not even those I get treated or even taken serious at all for. \n\nAnd I am so goddamn envious of my future Mother in law. She isn’t even actually in need of help, she just needs to accept her issues and be honest about them to herself to get better.\nYet she gets all the help I could ever ask for and isn’t even remotely thankful for it.\n\nAll I got were 7 different antidepressants none of which did anything good; just side effects. One of them being never ending nightmares. I haven’t slept well for years when I got them already and with the nightmares I can now sleep for 4 hours at maximum. Usually I can only do 2 though.\n\nI am so fucking tired.\nIf I had even half of the help she has, I‘d be stable right fucking now instead I am having a mental breakdown on her couch debating how to best kill myself, while she is at her Psychologist appointment which was supposed to be yesterday, but since she screamed at my fiancé for nothing (claiming the victim card as always, even though no one was even attacking her or anything) she decided she wasn’t able to go and told her psychologist that she had a mental breakdown and got another fucking appointment today.\n\nLet that sink in.\nI don’t know about you. But back when I (at least) still had a psychologist I would have to pay 50€ each time I could not get to my appointment. Sick spontaneously? That’s too bad. 50€. Had an accident?  50€ for you. Someone died? Tragic. Pay 50€.\nAnd a new appointment? Hell no. Next is in two weeks as always. No other appointments available.\nIf you need help fast go get yourself admitted to some psych ward. Who cares.\n\nAnd that was a child and adolescent psychologist.\n\nI told my Mother in law that. Nicely obviously.\nAnd her reaction was „oh I am not gonna stay long today anyway I just don’t want to.“\nLike…???\nThe audacity, the ungratefulness!\n\nI wish I could just leave and run into traffic or something, but my goddamn anxiety keeps me from even being able to leave the flat alone at all so that’s out of the question.\nI have razors, but no bathtub and bleeding out wouldn’t be fast enough. I don’t want to be found.\nI don’t want to be saveable.\nI don’t want to deal with the consequences.\nI just want out.\nI wish I was never born.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ph3hki/mourning_who_i_couldve_been_if_i_had_the_help/", "title": "Mourning who I could’ve been If I had the help everyone else in my country gets", "social_network": "reddit", "user": "Samichaan", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1630669307, "permalink": "/r/SuicideWatch/comments/ph3hki/mourning_who_i_couldve_been_if_i_had_the_help/", "nsfw": true, "first_save": 1635426715.336389, "replies_charged": false}