{"id": "t5_2qpzs_t3_od77xw", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "I try to hold my self accountable, but then end up resentful/disappointed at myself for trusting somebody or having expectations. It has self me very bitter, nihilistic and worst of all extremely introverted. Which truly hurts me the most because I use to live to help people/laugh & do all I could to make people happy. I have came to realize I basically hate myself and I showcase it by being spiteful at the very fabric of existing. I am not really depressed or anxious anymore, just numb & quiet mentally I use to be so ambitious and resilient. I have quintessentially taken a sabbatical from existence to at least avoid spreading my misery/hatred. I got major trust issues, I am broken, lost and literally stuck. Trying to move forward is impossible I am destined to be incarcerated soon, my last 6 months and next 6 months are just FUBAR. I have done everything I have ever wanted to do for my self with in reason. Nothing brings me joy like being loved,appreciated, valued.\nThe people I cared about the most, all betrayed my trust when I needed them the most. I was over worked/overwhelmed trying help to my friends and family. I feel like the people I did everything for, would of died for, neglected myself by making time for them I should spent resting/relaxing. Couldn't give me any compassion, help, or even time of day to listen to me as my world feel apart. It really, really fucked me up more then anything. This is on top of massive amounts of PTSD/bad experiences with people going back go child hood. Most them resulting from over sharing or my acts of kindness being exploited(like gave a stranger a cigarette end up robbed tortured, persecuted by land lord, ultimately loosing everything transportation and home, with no help from police because my family was collateral for my silence) one of many instances of why I went into a shell I only come out of to snap at people😔 I have lost my light and I am lost with out it plz help\nI have tried suicide before it's how I got in my current legal quagmire years ago & also prob reason I got robbed/tortured(no guns) if I had one it deff would of prevented my random home invasion.", "url": "https://www.reddit.com/r/SuicideWatch/comments/od77xw/i_lost_my_light_and_i_am_lost_with_out_it/", "title": "I lost my light, and I am lost with out it😇👿", "social_network": "reddit", "user": "PeaceComprehensive16", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1625349296, "permalink": "/r/SuicideWatch/comments/od77xw/i_lost_my_light_and_i_am_lost_with_out_it/", "nsfw": false, "first_save": 1635423058.488464, "replies_charged": false}