{"id": "t5_2qpzs_t3_q2vmdv", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "I think it’s really unfortunate that while the majority of Americans support death with dignity reforms, Only 20% of Americans live in states that allow for this, and even then it is heavily restricted to terminal physical illnesses. until you have personally experienced the utter chaos that is a chronic mental health problem to the point that you lose meaningful autonomy over your life, you have no idea of the hells many people go through on a daily basis. Once you exhaust all possible treatment options (assuming one can even afford them since healthcare is a joke in this country), I think you should be able to make the choice to be medically assisted with a dignified death. Even having the option gives people enough control to the point many would be more at peace and even delay if not suspend the decision entirely in some cases. It also stops situations where people who are desperately suffering have to choose lethal means on their own, without being able to meaningfully prepare and say goodbye to their family, often shocking those around them. If someone has not been able to meaningfully improve their life over a long time and is unable to stop the suffering, I don’t see how the situation is different from a terminal physical illness which is currently the only accepted option regarding death with dignity laws. Beyond religious and conservative detractions (whose pro life stance really only extends to pro-birth policies), I believe many do not want to be forced to reflect on the ways in which the social systems we have create mental illness and suffering in many people, and would rather force those who suffer from systemic failures to bear the burden and be blamed for being selfish for not wanting to suffer and have an extremely impoverished experience of life for decades.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q2vmdv/death_with_dignity/", "title": "Death with dignity", "social_network": "reddit", "user": "Cptsdthrowaway12", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1633561012, "permalink": "/r/SuicideWatch/comments/q2vmdv/death_with_dignity/", "nsfw": false, "first_save": 1635427433.047005, "replies_charged": false}