{"id": "t5_2qpzs_t3_p6we3q", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I apologize for the colossal amount of negativity in advance, but I have nowhere else to turn to but strangers on the internet.\n\nI'm transgender (female-to-male), mid twenties, and transitioning has been very hard for me. My insurance has made getting any kind of surgery hell on earth, and my transition has overall not been what I had hoped for. I'm extremely little even for a woman, with zero markers of masculine maturity like a consistent beard or relevant muscles. Testosterone has only changed me insofar as that I pass consistently as a male child, but nothing more. Old men talk down to me and teen boys holler at me like I'm one of them. This makes it impossible to build a peer group my age, as I'm never really taken seriously regardless of the context. In uni, I get openly snide remarks from teachers why a child is attending the course. The worst humiliation ever was when, during a legal internship at court, the defense attorney got up from his chair mid trial, pointed a finger at me and attempted to joke with the judge about child labour in the legal system. \nThis also prevents any kind of relationship from happening ever. As soon as I date a woman, she immediately signals that she's friendzoning me. I have gone on so many dates where I previously thought we had a decent connection, only to have her completely change her demeanor the moment she actually sees me. I have gotten the \"You're so interesting, but not for me\" talk so many times, at this point, I'm counting down to when it will happen and have given up on the idea of a relationship.\n\nI am also autistic, meaning mostly that I struggle with social communication and tend to escape inside my head a lot. It's gotten a lot better over the years because I really try hard and force myself to adopt a normal social persona around others. But now that I'm on testosterone, my symptoms have become extremely severe: Whereas before, I was able to keep my quirks to myself quite well and mask when in social settings, I now find that I've become way more impulsive, and whatever is going on inside will eventually find its way to the surface. Now, people can tell that I'm not normal, and I see that and it's making me feel like a complete failure. \n\nMy father also has autism, though undiagnosed and untreated since he refuses to acknowledge it. This is the reason my mother broke up with him recently. I recognize all of my own problems in him, just way more severe - he doesn't speak to anyone for days, then makes you feel like it's your fault even though you did nothing. He cannot cope with change at all, and gave me the cold shoulder ever since I came out. He flat out refuses to speak to me most of the time, I can literally meet him in the hallway and have him completely ignore my presence. When I confront him directly, he acts visibly trapped and pretends he cannot see or hear me by fixating on something else in his circumference. He also hates when I change little, insignificant things to tidy up - for example, whenever I move the toilet paper rolls inside our bathroom when I clean, he acts like I commited a war crime and \"punishes\" me by not bringing me food when he does the family shopping, or by strangely arranging my own bathroom stuff. He has so much impotent rage pent up inside him, and combined with his autism, it just creates an unpredictable volcano. He has so many unspoken \"rules\" that other people need to follow, and if they don't comply (with something they never knew was a requirement in the first place), he \"punishes\" them in his stupid ways. \nSomething that has recently tipped me over the edge was that, for some inexplicable reason, he decided to move the family fridge down inside my sister's basement apartment, without getting a replacement. Now, whenever I want food (that I mostly buy myself due to his \"punishments\"), I need to beg my pretty narcissistic sister to let me in. I have severly limited my eating because of this and actually relapsed into disordered eating. When I confronted him about this, he just said \"I don't want it in the kitchen anymore.\" He continues to make decisions that only make sense in his own head.\nMy sister is a different story. Ever since my mother broke up with my father, her survival strategy has become to baby him and treat him like you would a hurt child. I have seen her scratch his head in his room at night, and bring him dinner in that kindergardener sort of manner. She cooks for him as he is wholly unable to operate a stove. He doesn't even make his own doctor appointments. Because of all this, my father \"rewards\" my sister by throwing heaps of cash after her, in fact, she just got our basement flat for ... absolutely nothing, no rent, she even failed her studies twice and he brushed it off like a fly fart. \n\n\nMy mother is the only person I'm really close to, she has become a different person once she went away. She used to be understated and unassuming, now she has really developed on her career and is a blooming ball of joy. She even found a new partner quick. She lives in Berlin, and is the most important person in my life. But recently, I had to lie to her - due to my horrible living situation, I have failed my law degree. I kept her unknowing by saying I was still waiting for results to come in when in fact, I snatched the letters before anyone else noticed they had arrived. I can't even stomach that kind of failure myself, and the thought of telling someone else, especially her, is beyond conceivable to me. I would never be able to live with having seen her shame and disappointment. She put her entire hope in me after my sister wasted her grant and now just kinda does whatever, and my father's behaviour got unbearable. But now, I need to disappoint her too. I just can't.\n\nBecause of all this, I finally got a rope, measured the lenght I needed to break my neck, found a sizeable tree in a forest nearby, and decided to kill myself. I had finishedy goodbye letter this morning when a parcel arrived. It was a Care Package from my mom who still believed I had exams. It even had a \"Good luck\" card with a little heart on it. I just broke down and kept that card with me when I went into the forest, placed the noose around my neck. I stood on an abandoned tree for a solid hour shaking and crying and ultimately was too much of a coward to end it.\n\nI'm now back in my room and I really want to become clean with her, even though I know it will hurt her a lot. Should I be honest or is my failure too big?", "url": "https://www.reddit.com/r/SuicideWatch/comments/p6we3q/i_almost_hanged_myself_today/", "title": "I almost hanged myself today (trans/autism/university/family)", "social_network": "reddit", "user": "Konsta97", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 51, "down_vote": 0, "creation": 1629309216, "permalink": "/r/SuicideWatch/comments/p6we3q/i_almost_hanged_myself_today/", "nsfw": false, "first_save": 1635428088.8912168, "replies_charged": false}