{"id": "t5_2qpzs_t3_gxnv76", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "Self Destructive\n\nThis will be long..\nSo the beginning of 2019 I was doing great. I had goals and I was meeting them! A big one I had was my weight lose, I was so close to being under two hundred pounds! And then around February I started to get depressed. I have always gotten depressed but it would last about 1-2 weeks and then be gone. It wasn’t the case this time. I gain back 20lbs in a two months and I could feel it. My girlfriend at the time told me to go to a therapist but I didn’t want to because it always passed. \n\nSo a few more months went by, still depressed. But I was able to go to Florida with my girlfriend and hang out for a week out there! We had a great trip and it was fun! And for that week I felt amazing and no depression! Or at least it felt like it was gone, but it was just waiting for the high to wear off to come back. \n\nI was with my girlfriend for two-ish years and I thought to myself that she was the one! I bought her a beautiful ring! I asked her to marry me and she said YES!! I was feeling indestructible! All of our friends were so happy for us and it felt great! But I was still depressed and gained a little more weight and I was about 230lbs then. \n\nShe loved me so much and I her! But depression was still there scratching and screaming to be in full control. Around September my fiancée and I were talking about breaking up because she was starting to resent me. It was hard to give someone my full attention when depression was demanding so much. But I wanted to work it out and I said I would go to therapy. The lady I was talking to was really nice but I felt like it wasn’t going anywhere. And I was open to it and I was sharing everything with her. I told her I kept feeling The Call of The Void. Every time I went out on a motorcycle ride I was okay if a deer ran out in front of me and killed me. Also thought a lot about a vehicle hitting while I rode. If I saw it coming I would welcome it. The therapist said it would be best if I got started on antidepressants. My Doc put me on Wellbutrin, at first it game me lots of energy. I was way more talkative than usual. And then it started to mess with my head. Thoughts of suicide would pop up more often. But I stuck with it. \n\nThen my fiancée didn’t want to be with me anymore. She couldn’t handle my depression anymore. She told me that she wasn’t a good person and she wouldn’t be able to stay with me because she doesn’t know how to deal with it. And at this point I was completely destroyed. My heart just got broken and I felt so alone. The person I wanted to be partners with for the rest of ours abandon me. And at this point the Wellbutrin was grabbing a hold of me, I have never been so scared. I thought about killing myself 5 or more times a day for a month straight. I put my gun in my mouth several times to try and end my torment. But I always thought about my family to have me back away from that ledge. \n\nI finally talked to my Doc and she put me on Zoloft and it helped a lot. Still thought of suicide would pop up once in a while but I would never do it. So I feel my world crumble around me and I just stayed laying in the wreckage.. And then food became my help. I kept eating and eating. To the point we’re now I’m at 300lbs or probably more. I went for a check up and I’m pre diabetic, high blood pressure, and now a thyroid problem. I know what I’m doing is hurting me but down , this is just another way to commit suicide and this wouldn’t hurt my family as much as if I would put a gun in my month and let go. But I’m on medication to help with reversing what I have caused and I’m going to talk to my doc about changing my depression meds. I’m on a max dose of Zoloft and it does nothing for me. I’m just scared to try another one because of what Wellbutrin did. This is a struggle I’m going through right now and it doesn’t help that Covid is around. I just wanted to put this out. I’m usually not one to share what’s going on because it makes me feel weak but I need to change how I think. Reaching out for help is a good thing!", "url": "https://www.reddit.com/r/SuicideWatch/comments/gxnv76/self_destructive/", "title": "Self Destructive", "social_network": "reddit", "user": "ddiaz30", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1591435741, "permalink": "/r/SuicideWatch/comments/gxnv76/self_destructive/", "nsfw": false, "first_save": 1635422548.515459, "replies_charged": false}