{"id": "t5_2qpzs_t3_fh01f9", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I started my first full time, professional job last week, March 3rd. I was excited, first for a full time position, and also because it was in a professional environment; desk job and everything. If never really done IT before so I was learning the ins and outs pretty well, and was getting pretty decent at the job.\n\nFriday, day 3, was my 20th birthday. It was amazing what they did for me...a banner over my desk, signed card, and pizza lunch for everyone. I felt truly welcomed there and loved every moment of my experience there. \n\nMonday night, I had a terrible time. It was after work, so it had nothing to do with the job. I thought about past events that really had me fucked up, that were also entirely my fault, and I cried into a pillow in my bathroom for an hour. I relapsed and cut again (not really a big cutter, it was mostly more like scratching really hard but it drew blood so it was satisfying to me.) And when I get like this, for some reason I love to sleep in my apartment's walk in closet. I don't know why, but it's comforting. Because of this, I didn't hear my alarms on my phone and ended up being about an hour late to work. I didn't call in, because I wasn't thinking straight and also didn't want to go into why it happened. Got a written warning letter from my boss, but other than that, the day went well. \n\nThat night, which was last night, was so tiring and I was completely worn down from the previous night that I basically went to sleep an hour after I got home. Same story for this morning. I somehow slept through all 5 of my alarms and ended up being 15 minutes late. This was the final straw. About an hour ago I was called into the office and was handed my termination form. I didn't explain the situation to them because why would I tell anyone about my problems? I just took it, went and cleaned out my desk, and left without saying a word to my other coworkers. They said I was doing really well, but being late like this wasn't acceptable. I understand that, I'm not mad at them at all.\n\nI'm just mad with myself. Why did I have to do this to myself? Just when things were looking up for me, just when I was getting busy and bring distracted from my own problems, just when I thought I might be able to turn myself around. I get myself fired. As of writing this, there are a few more cuts on my arm from a knife I got for my birthday that needs sharpening. It hurt a lot more than a razor.\n\nIf I can't even do something as simple as wake up on time to go to a job that I actually like, what the fuck is even the point of trying anymore? I'm literally less than worthless and I'm considering finding a bridge at some point today. I just don't know what to do with myself anymore. I don't feel like it's worth it at this point.", "url": "https://www.reddit.com/r/SuicideWatch/comments/fh01f9/fired_7_days_in/", "title": "Fired 7 days in", "social_network": "reddit", "user": "FracturedArmor", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1583944751, "permalink": "/r/SuicideWatch/comments/fh01f9/fired_7_days_in/", "nsfw": false, "first_save": 1635422329.2836614, "replies_charged": false}