{"id": "t5_2qpzs_t3_owtk7m", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "I'm not really used to especially talking about my emotions, but I'm just Soul crushingly exhausted. I've attempted suicide 3 times and planned it about 4 times now but couldn't go through with it. Every time i try to commit suicide especially if I planned it, I get so nervous I fell like fainting. Unfortunately, it's not like life is getting easier, I'll be starting Uni in September but I'm so mentally exhausted I can see myself going (even if i force myself to go I'll just be crushed by the pressure). Sometime's I just feel like crying my balls out but I'm so dead inside I cant even do that. I just want everything to stop and end but I just can't get myself to commit suicide, I'm just tired of everything. Dammit, I just want everything to end.\n\nIt's not like my past was joyous, I started juggling work with school even before the age of 10 (I'm currently 20 btw). Home wasn't happy either, I mean, i would rather be in school (a military school where physical abuse is the normal form of discipline) than stay at home. Dad was an alcoholic with occasional physical abuse, while mom, sigh, selfish, inconsiderate, extremely demanding and just the worst. To top it off my memory is worse than average, so bad that sometimes I find it hard to even trust my own memory. I also hate the fact that I'm too level headed, sometimes I wish I can just make rash decisions and end my life. It'll be an understatement to say I'm a colossal mess, nowadays I just drown myself in anime and movies while being useless. Sigh, I just want it all to end.\n\nThis post is probably a mess too, sigh, I just wanted to rant, I'm not even sure if anyone will see this. Now that I think about it, this is the first time I rant without it being to myself. I just never had anyone to rely on in my life and had to do everything myself. This is soul crushing, I'm exhausted and there's no bright light ahead.", "url": "https://www.reddit.com/r/SuicideWatch/comments/owtk7m/this_is_soul_crushing_just_some_random_dudes_rant/", "title": "THIS IS SOUL CRUSHING (JUST SOME RANDOM DUDE\"S RANT)", "social_network": "reddit", "user": "G3N2BOI", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1627956592, "permalink": "/r/SuicideWatch/comments/owtk7m/this_is_soul_crushing_just_some_random_dudes_rant/", "nsfw": false, "first_save": 1635425173.0397685, "replies_charged": false}