{"id": "t5_2qpzs_t3_pvd0z6", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "I’ve always had extreme anger issues ever since I was a young child, even before my BPD diagnosis. Explosive behavior such as getting so angry that I would bite my arm until it bled, screaming (the kind that you feel internally but let out externally), saying awful things to people that hurt and I don’t mean, breaking things, slamming doors.\n\nAs a child my parents told me I wasn’t allowed to be angry or sad and often would get verbally abusive and physical with me when I did. It lead to my anger turning into explosive anger then panic attacks.\n\nNow I have taken anger management classes but have a very hard time controlling my anger when I am triggered. I no longer break things or bite myself but I do say hurtful mean awful things, slam doors, raise my voice when I have not implemented my coping skills. It has really effected my partner and our relationship. I don’t think they will ever forgive me. They hold resentment towards me in ways I’m not sure they will ever heal from. They have told me I’ve said more hurtful things to them than anyone else in their life. They have told me that they are an idiot for staying with me because they love me and I am this way.\n\nMy anger and my actions make me suicidal. No matter how much I love someone, the amount of therapy, coping skills and anger management classes I can’t change. Even if my anger is reduced it still comes back. I want to commit suicide so I don’t hurt anyone I love.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pvd0z6/anger_and_resentment/", "title": "Anger and resentment", "social_network": "reddit", "user": "plantbased26", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1632595742, "permalink": "/r/SuicideWatch/comments/pvd0z6/anger_and_resentment/", "nsfw": false, "first_save": 1635426811.7690492, "replies_charged": false}