{"id": "t5_2qpzs_t3_q9tyw4", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42"], "text": "I'm not sure where to start with this so I'm just going to do a mind dump here and hope that some of this makes sense.  I've had suicidal thoughts since I was a teenager.  At 15 I had a really painful stomach problem that dragged on for a year.  It sent me into a deep depression.  I thought about killing myself all the time during that period, I even had a place picked out in my high school where I could hang a rope.  I finally managed to get treatment for the stomach problem and my depression eased, but the suicidal thoughts stayed with me.  Whenever I ran into a situation that was tense or life got hard my thoughts always turned to suicide.  I never made a serious attempt, but it has always been there in the back of my mind.\n\nIn 2009 I had another health scare that sent me into a major panic attack.  At the same time I got laid off from my job and my pet cat died.  This all brought the thoughts of suicide that had been whispering at the back of my mind roaring back up to the front.  In many ways I found the anxiety attacks were worse than the depression.  With depression I lacked motivation and wanted to sleep all the time, with anxiety I couldn't sleep, I couldn't eat, all I could do was pace around like a nervous reck.  The only reason I didn't kill myself this time was support from a couple of friends and my parents.  Finally the health scare was somewhat resolved and the thoughts of suicide died back down to a whisper, but they were still with me.\n\nThis brings us to today.  The health problem I had in 2009 has resurfaced and with it all the anxiety I felt at that time.  I'm not sure what if anything is going to keep here this time.  Two of the three friends I leaned on last time have drifted out of my life and the third has moved an hour away to another town.  My parents are still here and are doing their best to support me, but there is only so much they can do.  Also my old family doctor seems to have closed up shop so I'm having great trouble accessing healthcare right now.  I've been using alcohol as a crutch, but what I really need is someone to assess my medical situation and either treat my problem or let me know if it is going to be as permanently disabling as I fear it will be. I also would really like to access some mental health care but unfortunately that was in short supply here even before COVID.  Now it is almost impossible to get in to see someone.  Short of walking to the ER with a razor blade and threatening to slit my wrists right their and then I'm not sure how to get into see a professional in anything approaching a reasonable time.\n\nMy parents are in their 80s now, my current plan is to try and hang on until they pass away from natural causes.  If things haven't improved for me by then, I think I will just liquidate all my assets and donate them to charity and then end it.  I'm not married and I don't have any kids so there won't be anyone who is depending on me left.  There will be some friends and extended family who will be disappointed that I'm gone, but they will manage without me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q9tyw4/chronic_suicidal_thoughts/", "title": "Chronic Suicidal Thoughts", "social_network": "reddit", "user": "loaner1195", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634455517, "permalink": "/r/SuicideWatch/comments/q9tyw4/chronic_suicidal_thoughts/", "nsfw": false, "first_save": 1635427340.9863496, "replies_charged": false}