{"id": "t5_2qpzs_t3_nln44z", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "Honestly I never thought I’d be in a place where I’d be posting here and feel at the point  of life, but life really hits you fast and circumstances can change so quickly \n\nThis time last year I was in a comfortable position, eagerly look forward to each day  with exciting prospects in my job and saving a decent amount of money. For a 18 year old I felt I was on cloud 9. \n\nTowards the end of the year, that quickly changed due to my poor choices.I developed a gambling addiction due to the constant isolation and resilience I put myself through resulting in boredom. At that point, I ended up losing all my salary, and also my mind with my mental health going downhill rapidly. I have occasional relapses to this day.\n\nThe problem I have now is I’m on a good salary in a good remote job which I do not be in at all as I am under qualified. It stresses me to the point where I’ve had many mental break downs.\n\nMy constant overthinking and procrastinating affects my workload and also my teams too when they have to pick up my work when I leave it purposely as I just cannot draw myself to think logically.\n\nHaving to remotely work is a factor I thought, the constant routine of working, eating and sleeping in my room stuck in my parents house, , but I know it’s an issue wider within myself I’m putting myself through because of the routine I’m in and I literally don’t know how much I can contain myself for.\n\nThe only options I see in sight are If I quit my job, then I’ve lost virtually everything. If I stay in my job, I feel would probably get to the point where I get fired then I find myself in the same position either way.\n\nAll in all, I just feel trapped with no way out, I’ve has visions of following through with overdosing but I’m scared of death, and just as scared of the future.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nln44z/no_way_out_rant/", "title": "No way out, rant", "social_network": "reddit", "user": "ScarAmbitious1906", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1622051624, "permalink": "/r/SuicideWatch/comments/nln44z/no_way_out_rant/", "nsfw": false, "first_save": 1635427047.2156057, "replies_charged": false}