{"id": "t5_2qpzs_t3_lkrzzd", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "i have had suicidal thoughts lately and i never thought i’d be saying that about myself. i’m turning 29 this weekend, i’m a surfer and snow sport lover, i consider myself goofy and nonsensical, and most people would agree that i’m loud in (usually) a good way. i’m also opening a comedy club with my uncle, who is my dad’s twin brother and does not have kids of his own. so i’m like a son to him in a way. it was all great until the last year. now i have no direction or purpose that i want any part of at the moment. i am just working on this comedy club at my own mental expense, which had been closed due to the pandemic. not much has changed though for me on the surface otherwise.\n\nthis time last year i was excited to be turning 28 and i felt like i had my whole life ahead of me. i was writing jokes, teaching surf and ski lessons here and there, i had a pretty good relationship with my uncle. and most of my life was on par; i’ve been happy and healthy, not much to complain about, and when there was, i would laugh about whatever it was. now\n\ni feel like my sense of humor is gone, i’m in my own head all the time, i hate where i am, i hate the direction i’m going in, i feel stuck. i don’t work out anymore (which i used to a lot), i barely eat sometimes, i can’t even wake up to surf. i have no friends that i really matter to, and idk how i got here. \n\ndepression runs in my family, my sister battles bulimia and has dealt with suicidal thoughts for a long time (so it’s hard to talk about it with her), and my dad had bipolar depression. my mom has PTSD to name one of tons of issues, though she was never around. i had some depression in high school but i believe it was environmental, because those issues i had never followed me through after moving from home. so i never felt like i battled it quite like they have. \n\ni feel like this comedy club and the way my uncle treats me has a lot to do with it. our relationship has taken a nose dive and he’s been verbally abusive and way too demanding of me. added to the fact that if i want to work for him there i am basically going to be a slave there and do what he wants for 8 hours a day 6 days a week, which is be there. i can’t even go do something else for one day on my birthday, because you know what i’m doing instead? this: he also wants me to gather comedians every sunday inside the closed comedy club, so they can film comedy sets, and i am\nsupposed to “manage them” while they’re in there, which means be in close quarters while they film. but that involves HUGE covid risks even when they all wear masks. it’s dangerous and uncomfortable, and i don’t want to do that, i just want to leave. but obviously with COVID i can’t get a job anywhere or start my own means of income, and i’m forced to do it my uncle’s way which to me is wrong, so i’m stuck doing that. and this sunday on my birthday it’ll be like the sixth straight week we are doing this. \n\ni don’t know what to do. i have nobody that can help. i know there are options for therapy and maybe i should look into those. i just hate myself now and i know i don’t have to feel like this. and i feel like if i killed myself then whatever life goes on, it’s not like i’ll get more than 40-50 good years anyway if i’m lucky. i should just end it all cause none of it matters in the end anyway, life sucks you up and spits you out because that’s the universe in a vacuum", "url": "https://www.reddit.com/r/SuicideWatch/comments/lkrzzd/tldr_used_to_be_happy_now_im_not_hate_the_lucky/", "title": "TL;DR: used to be happy, now i’m not, hate the “lucky” direction my life has gone, DON’T WANT TO BE FORCED TO BE NEAR PEOPLE, and idk what to do", "social_network": "reddit", "user": "someonepoorsays", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1613437413, "permalink": "/r/SuicideWatch/comments/lkrzzd/tldr_used_to_be_happy_now_im_not_hate_the_lucky/", "nsfw": false, "first_save": 1635422933.1383915, "replies_charged": false}