{"id": "t5_2qpzs_t3_qd61pf", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "15m Rant. I hate this fucking toxic house. When she gets treated with the same energy she acts like it is such a big deal. She’s a fucking loonitic bitch. She always escalates the situation and when people escalate wen she escalates it, she’s the one who goes fucking mad. When she is being a sassy little bitch to someone and someone treats them with the same energy, she gets all defensive. She never sees herself in the wrong. That’s what I fucking hate about her. I hate most things about that egotistical little stupid bitch.\nThat’s her main goal. A reaction. All she wants is to get a reaction out of you. Then when she gets it her ego is satisfied. All she ever does is cause drama. I’m tired of dealing with her constant bitchiness and constant drama starting. I want to fucking leave. I fucking hate this house she never shuts the fuck up. She is always fucking arguing with someone. She never chills the fuck out. I wish I had chill parents. I wish I had normal parents. I wish I had a normal fucking life.\n\nShe does the exact same shit that I am going to court with my dad over child abuse over but on a smaller scale. It’s fucking ironic because she does the stuff she complains that he does and did to her. I guess that’s how it works because victims always spread the pain to other victims. That’s why people become bullies. She is a bully.\n\nAll she wants is to cause drama and wants a fucking reaction. Yes I got into an arguement with her tonight which she escalated. I kept my cool until the very end because I got mad at how she was mistreating me even though she was the one in the wrong. So I got an attitude with her because she told me to “chill out” even though she’s the one who escalated the shit to begin with, and so I told her “you need to chill out.” Then she started laughing and I said “sorry.” For saying that. Then she walked away laughing because her ego was satisfied, and she went ironically to cause a fucking arguement witt my sisters next. I stormed to the bathroom and said “man I need a break.” Now I am here, typing this in the shower. Man I wish that my parents were my teachers from school. I love them.\n\nThe bullshit she does stresses me and everyone the fuck out.\n\nI’m sorry for all of this cursing it legit just happened a few minutes ago. And sorry if I am in the wrong or I seem like a spoiled brat. I just wish my life was normal.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qd61pf/nevermind_my_mood_has_been_brought_down_again_i/", "title": "Nevermind. My mood has been brought down again. I hate my toxic household so much.", "social_network": "reddit", "user": "Southern_Ad3032", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1634865323, "permalink": "/r/SuicideWatch/comments/qd61pf/nevermind_my_mood_has_been_brought_down_again_i/", "nsfw": false, "first_save": 1635427603.7826405, "replies_charged": false}