{"id": "t5_2qpzs_t3_lipdhb", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "It has been a tough few weeks. \n\nAbout a month ago my partner of 20 years told me that she thinks she’s gay. We have kids, a life, a hoped-for future. Now she wants to consider an open relationship initially and that long term thinks her future will be with a woman.\n\nThen a week later she quit the professional training she’s been doing. Her whole life she has only managed to get short-term low paid jobs. She was 2 1/2 years into a 3 year process to be qualified in a professional career path. She would have qualified in May and been able to start getting paid work in that specialism. We’re left with the debt of the studies without the financial opportunity of the qualification. \n\nAnd then yesterday she tried to kill herself. She researched online how to prepare a noose and bought the kit. She went for a walk to a secluded wooded area near us. She had everything in place but stopped just short of the jump. \n\nThen she went and stood by a fast moving road planned to step in front of one of the large trucks that thunder along it. But again, couldn’t do it. \n\nThen she came home, got in the bath and started cutting her wrists. Drew blood but stopped before it was fatal. \n\nI was unaware of all this until this morning when she showed me her wrist and then told me about the other two attempts. I had to unpack the belt and rope from her bag. Untie the noose and hide it somewhere. \n\nI’m devastated. Numb. Terrified. I love her deeply. We have teenage children. We have a good life. \n\nI’m upset and sad for her that she’s so ill. Mental illness has attacked her for years. She’s on meds and has a therapist. \n\nAnd I feel guilty for feeling so angry. I know that what she needs right now is kindness, compassion and support. And yet I also feel a boiling rage at the shit that has been dropped on me. I know she needs the opposite of anger right now. \n\nI don’t know what to do. \n\nI know you can’t fix it. I just wanted to be heard.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lipdhb/my_partner_tried_to_kill_herself_yesterday/", "title": "My partner tried to kill herself yesterday", "social_network": "reddit", "user": "mackaytwelve", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 526, "down_vote": 0, "creation": 1613177482, "permalink": "/r/SuicideWatch/comments/lipdhb/my_partner_tried_to_kill_herself_yesterday/", "nsfw": false, "first_save": 1635423028.377322, "replies_charged": false}