{"id": "t5_2qpzs_t3_nvmzf9", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "Suicidal Thoughts are running around again so here's my take on why I want to off myself. I'm also going to solve my problems here as well even though this is the last thing my mind is wanting rn. Truthfully my mind wants me to suffer rn. Joy? Who cares , it's fleeting? Pain...that's forever. 80% pain and 20% pleasure.\n\n&#x200B;\n\n**These are dialogues I have with myself. Take it as you will. If you struggle with negative self-talk this probably isn't for you unless you're willing to jump into hell with me.**\n\n**Here's the reason for my suicidal equation.**\n\n\\-I've failed to do anything others deem significant with my life that would garnish the adoration of my family and peers. People will judge me and call me a loser.\n\nAnswer: Who gives a shit what these people think at the end of the day? If I failed to accomplish anything it's because I didn't stick with the process and I didn't write down my failures and learn from them. Failures are just lessons and while there are lessons I'd much rather avoid these are the cards dealt to me right now.\n\n&#x200B;\n\n\\-Greed. I could quite have literally retired for the next 2 years and had working income to spare if I wasn't greedy and just secured my funds.\n\n&#x200B;\n\nAnswer: Geez that sucks but guess what. You just learned another lesson. Don't be greedy. \n\n&#x200B;\n\n\\-My physical body isn't in the shape or fitness level I want it to be and this saddens me which makes me want to eat more.\n\n&#x200B;\n\nAnswer: Pretty simple stupid, if you're going to suffer you might as well suffer towards a goal that would bring some shred of a % of happiness because at least you're in shape and depressed and not a tub of lard and depressed\n\n&#x200B;\n\n\\- Fucking kill me I don't want to go back to work for someone , the whole social system of being fake and having to wear a mask is exhausting. Being told by others that just dealing with it is part of being an adult and this is the way things are.\n\nAnswer: They're right, humanity is like this and it's not changing for you. Humanity couldn't change even if a God came down and instructed us how to act. Get over it and either off yourself or build the internal skills and external skills to be your own master. Internally there is some degree of control, externally however, that is out of my hands so there's no sense mourning over what I cannot control.\n\n&#x200B;\n\n\\- Who the fuck am I? I have no identity, my emotions feel alien to me. I feel alien to me. My emotions do one thing while my thoughts are doing another. This existence is a pit of suffering. Anytime I experience joy or pleasure. Pain and suffering is around the corner. It never stops. I don't want to exist. I never asked to exist. If I kill myself am I wrong? Will the God I believe in send me to another existence that is just suffering. Is all consciousness just suffering? Why does it even matter? Why try to fight for something that ultimately will be judged less than worthy and any efforts be discarded like trash.\n\n&#x200B;\n\nAnswer: I still don't have an answer to this one. The rest of my actions consciously seem insignificant but because I was placed in this mortal shell I have to play by the moral rules placed in this plane of existence.  \n\nThis is my main reason for being suicidal. Is life but not drink and food? What exists outside of survival? Nothing it seems....the rest seems to be a fallacy. Survival is our sole existence? Should I not construct myself into the most dangerous individual to avoid being conquered by another consciousness and how will that effect my relationship with other people if I'm so jaded and cynical. After all everyone is in it for themselves consciously or unconsciously and they'll do just about anything to you to get what they want. Life is just one giant game of manipulation.\n\n**Life is just one giant game of manipulation.**", "url": "https://www.reddit.com/r/SuicideWatch/comments/nvmzf9/the_pit_of_despair_bit_of_a_read/", "title": "The pit of despair, bit of a read.", "social_network": "reddit", "user": "Lifesjustagame", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1623212186, "permalink": "/r/SuicideWatch/comments/nvmzf9/the_pit_of_despair_bit_of_a_read/", "nsfw": true, "first_save": 1635426793.3656766, "replies_charged": false}