{"id": "t5_2qpzs_t3_nxre4h", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "When I was 14 years old my father commited suicide. It was an event that destroyed my life and completely altered my as person. It took years to heal but I did it. I came out of it okay and somewhat more aware of the world. It allowed me to look at the world in a more constructive and realistic way. The good and bad. After hearing his story I swore never to become like him, to rely on people when he didn't and talk to people when he shut himself off. I didn't want to die.\n\nThings are different now and these past 8 months I've feell into a depression that has led me to become the man he was and do the things he did. \n\nIn November 2022 I moved from South Africa to UK, leaving behind my home, my girlfriend, friends and the place that my father died on. Ever since then my mental health has spiraled out if control. \n\nEach day I feel more and more alone. I've stopped taking care of myself and my room and don't enjoy the things I used to. I don't eat and sleeping has become a mission every night as a wave of anxiety and depressive thoughts hit. I feel anxious waking up and living. I don't want the next day to come and sometimes wish I die peacefully in my sleep. \n\nI work a 9-5 daytime job I hate because I need the money and because at the time I moved this was the only job. Its a IT job where I don't know what I'm doing half the time. The only thing that keeps me going is knowing the money can fund my travel fees to visit my girlfriend and friends. \n\nI wake up dreading it and go to sleep anxious to start the next day. Each day is a struggle. Worse than the last and eventually I feel like I'm gonna crack. \n\nI have no friends and crippling social anxiety that inhibits me from making friends. I have my South African friends but even then they're busy and I'm busy.\n\nAll I have is my girlfriend and even then she feels so distant from me emotionally because of physical distance and me having so little time with this job.\n\nI was playing Mariokart today and freaked out of the stupidest thing. I hate how reacted. I sore her upside down while her mom was on call. Now I've ruined my relationship with her mother who I saw as a genuine friend.\n\nGod how stupid over a green shell. But I don't know I felt I was cracking losing at a game I love, felt like my life. Losing at that. \n\nI feel like my father, half way between dead and alive. I'm just here with nothing but a pain in my chest and a brain going haywire.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nxre4h/im_my_fathers_son/", "title": "I'm my father's son", "social_network": "reddit", "user": "sushiarousal_", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1623448756, "permalink": "/r/SuicideWatch/comments/nxre4h/im_my_fathers_son/", "nsfw": false, "first_save": 1635426413.1675198, "replies_charged": false}