{"id": "t5_2qpzs_t3_cc0of8", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "Hi we are Harvard researchers and would like to invite you to participate in our online study examining how decisions under stress might be related to mental health and suicidal thoughts. This research could help us better understand mechanisms underlying emotional issues and suicidal thoughts/behavior.\n\n&#x200B;\n\n**Eligibility: Ages 21 – 65. English fluency. No hearing difficulties. Functioning headphones.**\n\n&#x200B;\n\n**What you will do**: If you are interested in participating:\n\n•\tyou will complete an online screener to see if you qualify to participate in the study.\n\n•\tIf you qualify, you will complete a variety of questionnaires about your mental health and rate various images, some images depict suicidal behavior and aversive scenes (e.g., homes on fire, non-fatal injuries)\n\n•\tYou will also complete two computer tasks where you will be presented with words and images and make responses.\n\n•\tYou may be eligible to complete a follow-up assessment 3 months later.\n\n&#x200B;\n\n**Place**: Online\n\n&#x200B;\n\n**Duration**:\n\nScreening Assessment: 10 minutes\n\nBaseline Assessment: 60-80 minutes\n\nFollow-up assessment: 5 minutes\n\n&#x200B;\n\n**Compensation**:\n\nScreening Assessment: if *ineligible* for full study, entry into lottery to win $25 Amazon gift card\n\nBaseline assessment: $0 - $15 and entry into a lottery to win $50 Amazon gift card (see below)\n\nFollow-up assessment: $5 and entry into a lottery to win $10 Amazon gift card (if eligible; see below)\n\nCompensation in Baseline/Follow-up Assessment is based on how closely you pay attention and follow instructions in surveys and computer tasks. If you pay very close attention and follow instructions carefully, you will **easily** earn a $15 Amazon gift card AND be entered into a lottery to win an additional $50 Amazon gift card.\n\n&#x200B;\n\n**How to participate**: Please send us a private message if you are interested in participating. Once you contact us, we will send you a link to the screening questionnaire. This will tell you more about the study and determine if you qualify.\n\n&#x200B;\n\nThank you for your consideration!", "url": "https://www.reddit.com/r/SuicideWatch/comments/cc0of8/study_on_how_decisions_under_stress_relate_to/", "title": "Study on how decisions under stress relate to mental health and suicidal thoughts. 90 minutes. Online. $15 amazon gift card. $50 lottery.", "social_network": "reddit", "user": "ClinSciResearcher", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1562876089, "permalink": "/r/SuicideWatch/comments/cc0of8/study_on_how_decisions_under_stress_relate_to/", "nsfw": false, "first_save": 1635425256.9126415, "replies_charged": false}