{"id": "t5_2qpzs_t3_jakamh", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "So, I live with my mother since forever. My father died when I was six.My mother is an extremely abused person. Abused before maryring my father, abused by him after. At 26 she finally had her fredom (finantial, specially).\n\nWhen he died, she took me to her home town, and I lived there for the rest of my childhood and teenage years.She was already showing signs of mental illness. She was too afraid that I would die, or whatever, so I couldn't be out at night. That gave a big hit to my social development.At 20 we moved to a bigger city because of my college, that was 2012 (I'm 28 now). In 2013, her mental health gone down harder. Not only sh was depreed, but also having psychotic events, so I started to deal with her illness in a far more raw way, if I can call it like that.\n\nEverything adding up, I had away have problems to find jobs. Luckly, my current job (and actually first real one) is a public position that requires a test, and not interviews. It's being hard to keep it, since it involves politics in a small towm that breeds and depends on politics for money, but even being hard, I'm still having my chance to make a living.\n\nIt also made it harder to find love and companionship. I have no friends in a decade. and just LAST SEPTEMBER I was able to kiss a woman for the first time, almost at 28. And this is where the current problem starts.\n\nThis woman is being very nice, and lives in a neighbor town. It's pretty easy to go there because it's the same highway. There are many buses everyday and it's pretty cheap to go. We've seen each other 3 times, about every two weeks, sometimes 3.\n\nMy mother decided to turn this into a war. She aways claimed to want me to find a wife, to start a family, because she didn't want to die and leave me alone in the world. But when reality finally came, she is acting the opposite, saying she is a scammer, a terrible person she knows nothing about. Why? because the is not from my town. That's the \"reasoning\".So, ok. Got home today after spending two nights with said woman, it was a holiday. When I got home from work, my mother said she talked to a lawyer, threatning me to go to the police if I raised my voice or anything, claiming that it would make me lose my job.\n\nNow, she wants to take our savings and buy somewhere to live in the city I went to college in, because she made some good friends there (we moved here because of the job I've got).\n\nI have played along with her unhealthy demands my entire life, having only the internet as a distraction and social window, but now, with one thing she doesn't approve, I'm no longer good, she wants to live by her own.And of course, not only that, but offending me by calling me stupid, because the woman can ONLY be scamming me (what does she mean with that?), even though she actually pays more than me in our dates, and actually makes more money (I'm a nurse, she is a dentist).\n\nSo yeah. That's how it is. Spent all my youth having suicidal urges for absorbing her illness, and if I'm not perfect for her, not good anymore.Right now I can easily afford to live a confortable life on my own. Losing my job would be a problem, for sure. But if she leaves, I have no plans of living with her again, even if I lose everything. Considered suicide for a while, but it's not worth it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/jakamh/only_good_if_i_live_exclusively_for_my_mother/", "title": "Only good if I live exclusively for my mother.", "social_network": "reddit", "user": "xSeyoo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1602616619, "permalink": "/r/SuicideWatch/comments/jakamh/only_good_if_i_live_exclusively_for_my_mother/", "nsfw": false, "first_save": 1635427113.1528175, "replies_charged": false}