{"id": "t5_2qpzs_t3_m9oyms", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111", "c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "A guy I loved chose someone else. I’m 30F. \n\nYeah, yeah. This is pathetic and long. I’m self-aware enough to know how this sounds. And it doesn’t seem all that deep - but it’s a cumulative thing that has just further turned my heart to hamburger. I’m on mobile: excuse the typos. \n\nBut I’ve never loved anyone like him and never felt loved. Hell, I don’t feel loved by my friends half the time. My parents were abusive, I practically raised my sisters and I can’t remember one time when I haven’t felt scared or needed to be alert. To fix it. \n\nI’m 30. My only relationship was when I was 24. It was 2 months and not even enjoyable. I’ve been cut deeply before but this one hurts the most. \n\nI thought I was doing the right thing by sticking up for myself after I said upon catching feelings that I wanted our friends with bennies situation to be more - he had just gotten out of a love-fades type long-term thing, so he said that while he cared for me he could t get more serious. I said, cool, I figured; I can’t be your friend. When I said that he changed his mind pronto and we went back and forth. I stick to my guns and eventually had to block him for being disrespectful about boundaries a month later. We didn’t talk for six months but I thought of him every day. On a particularly bad day in early Feb., I reached back out and apologized for blocking him, saying that I could have stuck to my boundaries without cutting him off. I felt so low that if he wanted to chew me out, i would hear all the bad shit I was feeling about myself already; if not, I get to talk to someone I care about. We made up. Became friends. My feelings were still there. I drafted a note saying I couldn’t keep talking to him bc it still hurt - basically told him I still cared - then deleted it and rewrote it to be more general. I wish I had told him then. I didn’t know I was allowed. We then started talking again when I realized I was consistently running away from real vulnerability in therapy. \n\nAbout a week before I reached out for the first time in Feb., He met another woman he didn’t tel me about until he came to visit last week after I said we ought to meet IRL and invited him to stay at mine. We had immediate chemistry and all the work he did to see me as a friend, he said, vanished. This woman was coming this week and he was now deeply confused, so the plan was he’d take the week to decide how he was feeling after meeting her. it wasn’t me. I couldn’t change his mind. \n\nI know: you’re not an option!!! I get the prevailing wisdom. For some women, it would be harder to leave  - with him, I knew I loved him when I realized it was harder for me to stay and that he was worth it, sticking out my neck for him. I was pushing back against so many demons for this. I was learning to be vulnerable. I was viewing love as beyond my superficial beliefs and putting in the work, overtime work, outside of therapy. I was so stupid. \n\nAnd what kills me is if I had healed earlier - if I had liked myself like I knew I was supposed to, all of this wouldn’t have Happened. The things I worked overtime to hide bc I was afraid no one would like? That was what he was looking for. And has found in this woman. This younger woman. \n\nWhen he came up to visit, he swore they weren’t exclusive so we fooled around and he held me as we slept. That’s the farthest I’ve ever gotten with a man (hot tip: don’t grow up an evangelical) and it felt so good. So good. So safe. I think part of the reason I’ve been so closed off for so long, on top of everything else, is that if I started putting myself out there I’d realize how much I was missing. Have missed. Sunk cost fallacy and all that. I was right. I can’t go back to sleeping alone in my bed. I just can’t. And I’m relieved that he didn’t have condoms and we had a moral crisis about what we were doing and didn’t sleep together; I know I’d feel worse if he took my virginity and then chose her. But I still wished we had slept together. So much. \n\nAnd I can’t replicate those physical feelings with a stranger. There was some form of feeing there; the intimacy of knowing someone really well. The thought of finding a replacement person just for the feeing of someone next to me repulses me. I want *him* in my bed. Or a cutscene to the time when the right person, if they even fucking exists, finds his way there. \n\nI wish he didn’t come up here at all so I never had a taste of what I couldn’t have. \n\nHe’s not even a mean guy. Not on purpose, anyway. I usually go for the assholes and he’s not - at least in the traditional sense. And we’ve talked so much all week - even when he’s supposed to be with this woman, whom he’s picking even though he tells me he loves me and seems so meh about her - and I know he feels badly. I thought this was real because he wasn’t cruel or withholding - my usual type that codependent me just lives for - and I thought that was growth. Maybe he was just the same thing in a different package. \n\nAnd I’m alone in this. He swears the choice nearly killed him, but I’m mourning this thing alone while he’s starting a new relationship. I’ve seen the pictures she just posted tonight - he looks happy. I wish he didn’t look so happy, even though I want him to be happy. It makes me feel like he never cared for me even a little bit at all, if it only took six months to get over me and considers our past too much of a hurdle. Nothing is too much if you care enough. So he just ... doesn’t. I want to scream at him. I can’t even bring myself to block him. And I stupidly posted a friendship picture to save on insta tonight FIVE MINUTES BEFORE she posts something of the two of them. I’m a fool. GET ME OUT OF THIS LESSER EPISODE OF FLEABAG PLEASE. \n\nNo matter what he seems to imply about me leaving in August - I took so much time to explain to him why we couldn’t be friends, even after I said to leave me alone; three phone calls, countless texts - this isn’t my fault. I’m trying to make it my fault, because if it was I could have an easier chance fixing it. Control issues and all that. \n\nAll my coping mechanisms are related to him, for one reason or another. We met on Reddit, for one, nearly a year ago. And life, quarantine life, is one big coping mechanism. I can’t go anywhere; I buzzed my head in a fit of boredom and sadness and desire to have the hair off my head and know men wouldn’t like how I look right now, so I can’t start dating to replace him. I’m in horrible debt so I can’t go on vacation or get my nails done or eat something yummy beyond the basics to distract myself. Work is a slog. Therapy is trauma recovery and a new open wound every week. My life feels stolen from me bc of other people’s unresolved pain and living in a cult. I know I’m responsible for my life but I wish all my fucks ups weren’t my fault. I get up, play AC, go to bed if I can fall asleep, have nightmares if I actually do pass out, do it all again. My best friends and the only sister I have left live across the country. I feel so alone. \n\nI have felt this deep, yawning despair for so long. I’ve been itching towards snapping for ages and this ... I know rejection is a part of romantic exploration, but I’ve been rejected again and again and again - since I was born, I have never been wanted. There are no wins to balance it out. Just an empty bed and time unfolding unremarkably before me. I can’t do it.\n\nI want to be wanted. I want to be chosen. First place. I want someone to fight for me. \n\nI’ve been bleeding over this wound for a long time, this attachment disorder thing my therapist tells me I have. This situation just happened to make it worse. I trusted him and that’s why I thought things would be different; that I could heal just a little by knowing what it is to be loved. I kept opening myself wider to show him more of me so nothing was left unsaid - nothing could be wondered about - and even with my bloody heart in my hands, I wasn’t enough to change his mind. Nothing I say or do is enough. He wanted to keep moving forward after all the work he did to get over me, when hearing words like the state I live in would make him sad. Even after he told me he realized that I realized that he using me for, in some ways, emotional stability after his own breakup. Even when he seems so meh about this other person. He’d rather have meh than me. Than what am I? All he can say now is how worried he is about me. The pity. It almost hurts worse than the no. \n\nHe can’t even consistently tell me no, either. It’s “don’t have hope for us ever being a thing” and then him saying over and over, “nothing about us is 100% clear” for the rest of the conversation. DECIDE, asshole.\n\nI will never not keep hoping that I’ll wake up one morning and he’ll have changed his mind. But he wouldn’t because there’s no pain in losing me. because he has this other girl. Who I know is blameless but whom I despise. Who I feel pity for because I know her brother just died horrifically, but also resent because I know he’s the kind of person who would let that sway his choice. I’m horrible. \n\nWe tried to be friends. It was impossible. Hearing about them - picturing them fucking - her in his bed ... it’s ... \n\nI have been working on finding it within myself for my whole life. The love. My whole life has been learning how to survive totally alone. Please don’t tell me I need more time by myself. I love my friends, but all the typical post-heartbreak pep talk mumbo just doesn’t apply. I haven’t had one romantic win. One. Your worst days don’t come close to mine. You fundamentally do not understand how hard it is for me to wake up every morning and simply exist. I’ve been hearing I’ll meet my person - they’re out there! - since my heart was big enough to break. Well, where the fuck are they? Part of me is afraid they’re not coming. And that I’ve been right the whole time. \n\nI hate that my cynical defense mechanisms have never once been proven wrong. Maybe I’m a prophet. Even the tarot pulls and psychic consultations told me I was right. How lame am I? This is why keeping crushes to celebrities is easier - there’s no instability when Chris Evans doesnt know I’m alive and gets married, you know? \n\nI spent every night since I met him last summer thinking about him - even if it was just replaying something funny he said - before bed. Even when we weren’t talking. Touching myself with him in mind, knowing how hard it all was wouldn’t be in vain because I was choosing myself when he didn’t. \n\nThe only way I can fall asleep now? I’ve been taking sleeping pills every eight hours to crash every time I wake up. I’ve basically been asleep for 24 straight hours and hope to do that again until Monday evening therapy. While they do their magic, I draft suicide notes to the people in my life or picture my robe tie getting tighter and tighter around my neck. What I’d say to him. I know love means wanting the best for the other person, but he’s become such a poster child for all this deep, unsurprising despair that I want him to hurt. Burn. Deeply. \n\nI want everyone to hurt. I feel so taken for granted. My friends and sister are worried - they should be. Finally I feel like people are taking the intensity of my pain seriously. I’d be lying if I said it didn’t feel good. \n\nAnd I know that come the summer, when I’m reminded of how it felt to be in it, it will hurt all over. I’ll have to do this work all over. That’s the scary part of grief - when it isn’t fresh and your friends are over hearing about it but you’re sitting there as if it happened yesterday, only you know he’s moved way the fuck on now, and you’re more alone in this than you’ve ever been. \n\nI’m afraid of fucking up my attempt and living without a face or like a vegetable, and besides living without my dog, who’s the only good thing, that’s the only reason keeping me from doing it. I’m even past the pain part. I don’t believe in hell anymore - at least I tell myself I don’t - so I know whatever comes next can’t be worse. \n\nIt’s fascinating to watch emotional me inch closer and closer to the edge I never thought I’d reach while intellectual me take notes. The third me, the one that’s just sitting here, thinks that I’m not going to survive the week. And I hope I’m right. \n\nI want to be honest with my therapist but I don’t know about insurance coverage for in/voluntary holds and I can’t afford the medical bills or to lose my job. If I’m honest, I get locked up. I don’t know what to do. \n\nPray for me, if you pray. And please just be nice in the comments. I don’t want a lecture. And I’m tired of talking about it with therapists and friends. I want it erased. \n\nI don’t want to die but I don’t see how to make the pain of my existence stop. I’ve been trying so hard for so long. I want to rest.", "url": "https://www.reddit.com/r/SuicideWatch/comments/m9oyms/if_it_wasnt_this_it_would_have_been_something_else/", "title": "if it wasn’t this, it would have been something else", "social_network": "reddit", "user": "Rando123490", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1616303050, "permalink": "/r/SuicideWatch/comments/m9oyms/if_it_wasnt_this_it_would_have_been_something_else/", "nsfw": false, "first_save": 1635427070.041736, "replies_charged": false}