{"id": "t5_2qpzs_t3_ed5psy", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "I'd like to preface this by saying a few words. I recently just came back from a funeral, and am not taking it well. I've more or less always wanted to die, but things around me keep cropping up, chaining me down to this accused, infernal hell we call earth. The woman this torturous self reflection refers to is someone I spent my life growing up with. She lived across the street from me, and we did everything together. I genuinely just don't have a will to live anymore, save the people who still need me here. Its not for me I'm still here, but those whom I'd kill. This was made at a hotel in ney york at 345 am, during which I could no longer shut my eyes in the wake of death. I just stared into the fireplace, and set to work writing down what I felt. I texted her at four, hoping she'd come down. She never did. And I left alone. Anyways. Here's just a peak into my hellish mind. Thank you for your time.\n\n\n\nIts like I could feel the melancholic chords of her soul crying out, desperately grasping for structure and love. I wanted nothing more to embrace her then, and steal the pain away. That was never in the cards. Instead I sat there and watched, as people she didn't know passed her by unknowing of who she was. They had the gall to ask if she was his NIECE. I almost slugged the lot of them. His fathers family ostriziced them both, but I could feel the pain it brought. At a time of remembrance, they chose instead to be petty, bringing shame down upon us all in front of the deceased.\n\nHow dare they I thought, unbelieving that anyone could be so cruel. She was 22, her father having been taken away at only thirty years her senior. While it might have been his fault for the early demise, for people to not even look her way... I wish things could be so much like old times. When the two of us told each other everything, and I'm hoping against hope that she just happens to wake up, checks her phone and comes down here so that it can be the two of us alone again. But I think that time has passed. I'll never get it back, and my sister will move on without me.\n\nShe'll never know it was almost my funeral she was going to, never be able to reafirm me in the unshaking belief that I am Trans, with a family so unwilling to acknowledge it in my own home. Ones who question it because they haven't seen anything, but then haven't gone out of their way to use the title I want to be called, or gender me the way I know to be true. So why then would I try? Better to play the part of the good little boy with misguided notions, right up until he's tossed out into the cold for not having employment. Hell, enough my best friend can't stand the thought.. She'll likely never even see me again.. Never mind read my lifes work. \n\nMy best friend in the entire world. The sister from which is not my own blood, but damn it all to the seven fucking systems and back, she might as well be. How I long for the days when we would run about, her sister and my brother trailing behind us. Maybe I'm wrong, but it always felt to me that it was just the two of us, with our siblings just along for the ride. And now she's fell into love, just as I've fell out of it. Am I really the only one feeling this deep well of impossible abyssic sorrow? I shouldn't really be surprised. \n\nBy my own hands most of this is wrought. Not her plight or our fallout no, but everything else. And it shouldn't really kill me but it does. It kills me she'll never know any of it. Never see me again, never laugh or love or fight or cry or argue or embrace me again. I'll try to keep in touch, but too much time has passed, too much distance now laced between. I'm sure I'll fade back into obscurity, and hate myself all over again for not doing things the way I can so clearly see I should have now. Its times like this where I wish I could trade with the dying, or the already dead. \n\nLet them take my place, unwanting of my position and all its fucking grandeur. How joyous this life has been. For someone as unappreciative as I, I should have the right and the ability to hand it off to someone who warrents the worth of living again, like the passing of the torch if you will.  As if. I find most days to now only be marked with the passing of events. The passing of days and hours and minutes and seconds and breaths. There is joy in places, but even those are now touched with melancholy, forever stained blue when the people and the fanfare go away.\n\nI don't think it will ever go away.\n\nI would swap places with her father in a heartbeat, gladly giving my life for his, even with all his faults. He at least had something here. A grounding agent against the bastion of darkness that is this world's take on life. I have nothing, save broken dreams and shattered promises. The woman of my dreams will never return to me, and I will lament that until the day I finally die, by my hand or otherwise. She'll never know that either. My blunder. The one that started me down this road of regression and fear and hatred and depression and loneliness. She'll miss so many things.\n\nI hope she doesn't lament it the way I have when I finally die. \n\nI'll miss her like hell, knowing full well that I no longer hold a special place in her heart. She may be my sister, but I am no longer hers. Doubt creeps into my mind every second I stay here, and wonder just how much of her life I don't know... How much I wish I was privy to. Its all hushed whispers and second hand stories now, distortion settling in amongst their midst with every retelling. I doubt half of everything they've said, never having been there to witness it for myself. That's on me though. For not reaching out. For staying scared. \n\nI don't think she knows.\n\nKnows just how fragile I actually am, living glass stood in a world full of hammers, axes, and bows.  Each having slowly and steadily picked me apart piece by piece, until that beautifully flawed structure lay around my feet in pieces, with nothing but demons taking their place where the whiteness of my soul used to be. Most everything is dark now, inked black by experience and jadedness. That will never come back either. I guess I'll end it here, as melancholic as I started, and have another drink on me. To futures never lived, and paths long since lost.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ed5psy/the_somber_chord_of_a_broken_soul/", "title": "The Somber Chord Of A Broken Soul", "social_network": "reddit", "user": "shadowben666", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1576819977, "permalink": "/r/SuicideWatch/comments/ed5psy/the_somber_chord_of_a_broken_soul/", "nsfw": false, "first_save": 1635427560.2458923, "replies_charged": false}