{"id": "t5_2qpzs_t3_izhq84", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "I've overcome so much in my life...I'm not obese anymore, I'm not in an abusive relationship anymore. I'm not below the poverty line anymore. I'm not being bullied and taken advantage of by my \"friends\" anymore. I have a degree and a job I enjoy most days. I have a partner and a best friend and money to buy the food i like and go on modest vacations. So...It feels like it could be the peak of my life. \n\nMy problem is that I am experiencing intense bouts of abject suffering on an near daily basis.\n\nHere is more about me:\n\nI generally have mixed feelings about my job. It feels good enough but I want more at the same time. I work 8-9 hour days and earn a lower range salary my company is corrupt and only about half of the work I do aligns with my moral values. Yet I enjoy my job and I'm very skilled at it. I'm one of the most valued and appreciated employees. But of course I'm itching to work somewhere I believe in. Unfortunately,  I've almost eached the top of this career path, so now I'm faced with changing careers or potencially never earning more money without going back to school. There's so way I can afford more school, though,  I'm 5 figures in debt from student loans. \n\nI want to have a child one day, that's my lfielong dream. but I have only a few years until that biological window starts closing. I have a partner with a pretty lax personality who is willing to consider kids but it's not a huge life goal.  We are on a similar tier financially but they are not in debt. I'm pretty sure I'll never have the financial means or the mental stability to have a child and whenever I think about that my heart rips open and I sob. \n\nMy parents are immature narcissists who won't go out of their way for anyone and have no real interest in my well being. When I am really suffering ...I will feel angry with  my mom who refused to abort me even though she knew she was too mentally ill to have a child. My dad encouraged the abortion, he never wanted me and he's always been open about that. This family dynamic have me a core trauma, and thus i tend to feel truly unwanted and alone in this world. That's not fair to my partner I know, but it is my affliction in this life.\n\nMy partner genuinely cares and is one of the only people there for me but even they are getting burnt out. It feels like most interactions begin kindly, but I feel resistant to first to calming down. It's like I must fight my urge to defend myself against a genuine attempt from them to help me.\n\nAnd then, sensing defensiveness, my partner can turn sour with  their own defensiveness and impatience, I will become increasingly upset, and we will argue.  \n\nOther than our tendency to trigger one another in conversation, we have built  a deep valuable and healthy life together. We are working on improving  communication and have improved a lot so far.\n\nI only enjoy the company of children and a few select friends. Most adults fill me with hatred and judgement and fear as soon as I see them. I have terrible social anxiety. A good morning is enough to make me cringe. I feel like thaf kid on the playground always getting bullied except...no on is bullying me?\n\n I also give away my trust quickly but hold a grudge for life of you break it. I've been taken advantage of bc of that.\n\nHow I am coping\n\nI have been diagnosed with many things but don't want to go back on medication, I tried many types and many doctors and they never did anything but reinforce how broken I felt. \n\nThat being said \n\nIm so burnt out from breaking down. I wake up everyday like, omg not again. Is there no way out of these waves of misery? \n\nI'm so tired of crying, I cry almost every day. I fade in and out of enjoying my hobbies and passions, as well as art and music.  \n\nMy mind has no peace, my daily life has little joy or fulfillment, and when it comes it's painfully fleeting.\n\nI feel low today, today is a low day.  I have very little hope for the future and I have no will to try to fix any of it. \n\nWhen I feel low, I believe people are fundamentally flawed and selfish. I am afraid I am becoming misanthropic. I feel we are a disgusting species and I'm ashamed to be a part of it. \n\nOn low days, I wonder if I even have the capacity to feel compassion towards anyone including myself.  I wonder if I cant recognize compassion bring shown to me. Maybe I am so misanthropic as a result of my trauma that I hate all humans including myself. Maybe I feel unworthy of love bc I don't love the very thing I'm a part of. \n\nWhen I feel low, all I care about is the next time I can get fucked up enough to escape these feelings of dispair and apathy. That urge terrifies me , perhaps I'll become an addict like my parents were.\n\nThere are a lot of low days. \nI am distrubed by their prevalence.\n\nI'm like a little bruised child in an emotional flashback most of the time. Several times a month I lay in bed and wonder if I might die in my sleep at night. I feel sorry for myself and my broken suffering brain. It can feel like a sick joke to be alive. The more I think about it, the more I think perhaps I shouldn't have a child, which begets a new cycle of grief.\n\nBut enough about low days:\n \nOn good days I work on my trauma as much as I can through reading phychology, self help and spirituality books. Also by researching, meditating, doing yoga, journaling, etc.  \n\nOn good days, I forget how deep and hopeless this despair feels. That's why therapy has never worked for me. I go in fully identified with my current emotion and think of the lows as some kind of dream, simple to obercome. In reverse, when I'm upset, it feels like I'll never come out of it...It's like I can't fathom that my emotional state will ever change.  On good days, I believe I've cured it!\n\nAs you can see, I have crippling trouble validating my reality or trusting myself. \n\nI feel like even though my life is objectively much more blessed than so many peoples lives, I have recgnition and gratitude for that. Yet, I am still experiencing an undue amount of suffering... what seems to be more than other people would in my situation. I want to know why that is.\n\nI'm intrigued by many spiritual and philosophical ideas.  I hope they'll give me the keys to turning down my emotional thermostat. \n\nI do struggle with consistancy, as you might guess, because frequent days lost to despair don't really support growing new habits. \n\nI want more good days but I don't know how to control this thing...\n\nThank you with the fullness of my heart for the time devoted reading my story. I consider it an act of love and I'll do my best to recieve it as such.", "url": "https://www.reddit.com/r/SuicideWatch/comments/izhq84/my_life_a_prayer_for_attention_and_compassion/", "title": "My life - A prayer for attention and compassion", "social_network": "reddit", "user": "SorryToInturruptBut", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1601033200, "permalink": "/r/SuicideWatch/comments/izhq84/my_life_a_prayer_for_attention_and_compassion/", "nsfw": false, "first_save": 1635422994.2479904, "replies_charged": false}