{"id": "t5_2qpzs_t3_p2gl1u", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "I've really been through it the past two months. I had a panic attack at the beginning of June, which made me reach out to my psychiatrist for some help. She put me on 300mg of Trileptal, 100 mg of Vistaril, and 25 mg of Seroquel. I didn't feel great on them so she told me to quit cold turkey after 6 days. I immediately started withdrawing the next day. Insomnia, bursts of crying and sadness, dizzyness, brain zaps, disassociation, and just generally irritable. I told my doctor, and she told me it's not possible to be having withdrawals because I was on such a low dose and blew all my concerns off. I ended up going to the er after I fell over and had a hard time speaking. One side of my face went numb and I was scared I might be having a stroke. They told me I'm just tired, and did no testing on me. Sent me home with Ativan, and told me to sleep. I still didn't really.\n\n I was completely convinced I was just insane, so I checked myself into a mental hospital, where my symptoms continued. The doctor there put me zyprexa and Buspirone. I was also given vistaril and trazadone. I complained about still not being able to sleep and the doctor jacked up the zyprexa from 5mg to 15. I still felt like shit and asked if I could leave because I knew that being there was just making me feel worse. I got out the next day and took the next two days to taper off the zyprexa. I stopped taking the Buspirone a few days later and almost exactly a week later I started to feel better. I was finally sleeping again and I stopped having crying outbursts. But I had also just taken CBD that morning, so I thought that was why.\n\nI took the CBD for the next two weeks and progressively got worse again. I couldn't tell it was the cbd oil because all I heard about it was the benefits, and it was the same way I was a week before. I thought I just wasn't talking enough, so one night I took 200mg and that's when hell started. It immediately hit me, and I stayed awake in a CONSTANT state of fear, crying, shaking, confusion, and suicidal thoughts for the next 4 days. The nightmares and hallucinations were awful, and I finally went to the hospital for help because I couldn't find information on wtf was happening to me anywhere. The local dispensaries had never heard of this either.\n\nOn the way to the hospital I actually started to doze off, and I took a micro nap in the car. Checked myself into the er, had blood work done and they gave me 25mg of vistaril to help me calm down. I fell asleep and told the nurse I just needed some time to sleep and maybe just stay overnight so I could be back to myself. I got discharge, and drove around half asleep, and fell asleep while waiting for my prescription for vistaril. I woke up with another panic nightmare, and freaked out and took myself back to the hospital. This time I told them what had been happening the past week, and they admitted me and took all my stuff. They gave me Ativan and knocked me out, just to wake me up at like 4 am to take me to a mental hospital.\n\nI slept pretty much all morning, and didn't finish my assessment and get sent back until the afternoon. I started feeling better the next two days, and even started to nap again. Like I normally do, I was falling asleep even with lots of commotion and music. Yet I still couldn't sleep at night well. The room was freezing and uncomfortable and the techs were loud as fuck outside the rooms all night. No wonder I couldn't sleep at night. Night sleeping for me requires less disturbances. I told the psychiatrist there I didn't want meds and that I just needed the CBD out of my system, but he twisted it into \"insurance won't pay for your hospital stay, if you don't. And that he would get into trouble.\" He said I could do whatever I want when I leave, and I said ok because I was afraid they wouldn't let me go otherwise. Sleep was still difficult at night, and I actually passed out on the second day of taking Abilify. My brain also felt slow, which scared the shit out of me. On my last day I decided to ignore the nurse giving meds, and just not take them. She caught up with me and said she was working on my discharge paperwork, and had my meds are vitamins. I asked her if I had to take them and she didn't give me a real answer. Just that I could skip the fish oil. I contemplated spitting them out, or hiding them, but I was so close to leaving I didn't want to ruin anything. That was the first day since I got there that I didn't nap. I only took the abilify at 2mg for three days, but I realized I was already being affected. Insomnia is a HUGE side effect, and that's definitely what was happening. My body just wouldn't go to sleep. I wasn't really sleeping, but my brain was like wide awake.\n\nI'm almost two weeks out from my last dose and I'm still struggling to sleep and can't nap. I have a mutation where the enzyme specific to the break down of this medication is low, and it already takes 75-94 hours for a normal metabolizer to reach the first half life. Not only that, but CBD and abilify are not supposed to be mixed because the break down of CBD gets prioritized before the other med. Leaving it sitting in your system longer. \n\nI'm terrified I'm never going to be myself again. I'm depressed and uninterested in most things, and I just can't sleep. This really isn't like me. I usually such a sleepy happy person. And I mean sleepy, I can fall asleep playing video games and drop down for a nap at a party. Sleep is my favorite thing and I just can't do it anymore. I've been to the er and begged them to check and see if the medication built up and is still effecting me, but that's apparently not something they can do. I've seen that the test is available, but they won't do it. I'm so scared and have no idea when this is going to end. I keep getting glimpses of my normal self, and then in comes another medication to fuck me up again. I'm tired, and I don't want to do this anymore. I haven't done anything for the past two months, and I just don't see an end to this.\n\nI'm scared this is permanent. I'm scared I made all the wrong choices and this is the end. I can't live like this. I feel like an empty shell of who I was. I cry every time I look at myself because I just look so bedraggled and tired. I used to model and have goals. I can't keep this up. I'm so tired and angry at all the doctors who failed me and made me feel insane. I'm so tired. I can't do this anymore. I want to end this. I just want my life back.\n\nIf that first psychiatrist would have just assured me it was just withdrawals from the medication, and that I wasn't insane, I would have waited it out and been ok. If I hadn't taken that CBD that one last night. If I hadn't been coerced to take the abilify in the hospital. I think it ends here for me. I can't do it anymore...", "url": "https://www.reddit.com/r/SuicideWatch/comments/p2gl1u/im_so_scared/", "title": "I'm so scared", "social_network": "reddit", "user": "Hakunamitatas", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1628699444, "permalink": "/r/SuicideWatch/comments/p2gl1u/im_so_scared/", "nsfw": false, "first_save": 1635426591.2325695, "replies_charged": false}