{"id": "t5_2qpzs_t3_m4pomu", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "Growing up, my sister was diagnosed with Bipolar. She is 6 years older than me. So, I found myself to be ignored by my parents a lot because they had to care for her and her moods influenced my moods a lot. She was and still is a very rapid cycler. My dad left and my mom had to care for three kids all on her own while working full time. This allowed me to begin to self harm and form really bad habits. Kids at school began to make fun of me and I eventually did independent study until I earned my GED at the age of 16 because I was unable to cope with the social anxiety of class.  \n\nWhen I was a teenager, my days consisted of waking up, usually late in the morning or early afternoon, eating, watching TV, and then going back to bed. I would do the bare minimum of homework as to not get in trouble with the program. Most of my day was honestly spent in bed. Every single day was tedious. I wanted to do something... anything to break up my day, but I felt a mental and physical block whenever I tried to come up with any idea or motivate myself to do a new activity. \n\nAt the age of 18, I met someone online and there were finally some new emotions and experiences. I felt excited about certain aspects of life again. That was until this person broke up with me. The break up was not devastating in itself, but the idea of regressing back into the tedium was terrifying. That night, I decided to change things. I could not stand the thought of my life being the exact same for one more second, so I took a bunch of my sister's medications. Immediately, I regretted this and told my mom. I was rushed to the ER and had a traumatic experience with being admitted. I was treated like a criminal. I was stripped, searched, and put in an empty room before I passed out. I awoke what I thought was a few hours later, but it was actually days later. I was almost successful with my attempt.  \n\nThere was no follow up from the hospital after my attempt and I honestly had to work through my emotions and trauma on my own for the most part. It took me years to realize that my main goal that night was not to actually kill myself, but to just end that tedium that accompanies mental illness/depression. I still struggle with that feeling of being trapped in a loop at times, especially within the last year with quarantine. For anyone who maybe identifies with what I am describing, I wanted to give some tips on what has helped me. It really helps me when I choose to do something spontaneous. Sometimes, I will choose to take a drive to the coast or I will buy a few new plants for my garden. I find that choosing to take a spontaneous trip, hike, or starting a creative project can improve my moods almost instantly because it reminds me that I am not trapped. Therapy has also really helped in the last couple of years. Please reach out to your loved ones if you feel unsafe!", "url": "https://www.reddit.com/r/SuicideWatch/comments/m4pomu/i_am_a_survivor_but_still_struggle_with_suicidal/", "title": "I am a survivor, but still struggle with suicidal ideations often. I wanted to talk about the tedium of depression.", "social_network": "reddit", "user": "kittykat0503", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 15, "down_vote": 0, "creation": 1615703016, "permalink": "/r/SuicideWatch/comments/m4pomu/i_am_a_survivor_but_still_struggle_with_suicidal/", "nsfw": false, "first_save": 1635427281.497689, "replies_charged": false}