{"id": "t5_2qpzs_t3_qb9aui", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "No one cares about me besides my mom. I can't wait to die. I just have to get the timing right and I'll finally be free.\n\nThis world has brought me nothing but heartache.\n\nMy father died when I was 7. I never had a father figure. I became an introvert. I still am. Any friends I make leave.\n\nThe first girl I loved told our friends I drugged and molested her the day after she told me she loved me. They all told me to kill myself. I tried and failed. Our friends caught her lying and stealing from them the same month and apologized to me later. \"Friends\".\nHer sister said she regretted staying the night with me and said I did that to her to cut ties with me without having to deal with the repercussions. It destroyed me and I spent the next couple of years trying to move on. \n\nYears later, severely depressed I meet someone new. A beautiful soul. Kind, funny, attractive and she liked me! But, she was seeing someone else. He was an asshole to her. Called her names and argued with her all the time. He always talked down to her even though he was a fucking idiot. She and I were best friends and hung out everyday. She also had two mentally handicapped kids. One day, we talked about her leaving him for a hypothetical relationship with us. At this time, I could barely care for myself and felt like I wouldn't be able to help out adequately. I shot down the idea and could see tears swell in her eyes. I despise myself for that moment. Absolutely hate myself.\n\nI decided some distance would do us good. A couple of weeks went by and we barely communicated. Then one night, she texted me, saying she missed me and she hoped I was doing well. I said I missed her too and asked her how she was. She didn't respond to me. The next day at work, I found out she shot herself in the head. \n\nI haven't been the same since. It's been years. I'll never forgive myself. I can't wait to die.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qb9aui/idk_why_im_here/", "title": "Idk why I'm here", "social_network": "reddit", "user": "Turbulent_Season_688", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1634642048, "permalink": "/r/SuicideWatch/comments/qb9aui/idk_why_im_here/", "nsfw": false, "first_save": 1635425184.7236402, "replies_charged": false}