{"id": "t5_2qpzs_t3_og9gkw", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": " I have struggled with these thoughs for more than four yeas, but I was able to distract myself from them. I was helped by my friends, by my hobbies, even by studies. Anyone knew then and anyone knows now that I have these things in mind, but they used to help me to keep on going even without noticing it. Nonetheless, during last year lockdown, I started to lose the capacity of distracting. Everything became tasteless, anything had the capacity to make laugh, to make me happy even for a flashing moment. Then, when lockdown ended, I did not want to go out. I avoided my friends, my family, I went to class only because I felt like I had to, but there I did not speak to anyone, neither to my closest friends. In those times my mind also felt in anorexia. I lost a lot of pounds, I weighted myself every day and I lived each moment of the day trying to burn calories trying to feel safe, to feel that I was no getting fat. My fears locked me in a constant state of worry. \n\n Now I am not worry about these things. I have gained weight, but I have an unestoppable need to eat more and more. It is because I do not find pleasure in anything besides the infimous pleasure in sweets. My hobbies, my friends, my family, everything still being tasteless and anything deserve the effort to get me out of my bed. I do go out now, but it is because I am seeking something that awekens me from the void. Now there is no reason why I should feel bad about my life. I have a lovely friends, a lovely partner, a lovely brother, a promising future, but none of these make me feel better when I have to be alone in my room. Then I just want to feel something so I start to eat and eat looking for some kind of pleasure. I am afraid of these paterns and where will they lead me, but it is worse the fear of never being able to be alright again, to feel full filled again. It is not sadness, it is just a void. \n\n   I think that this will last as long as I breathe. I just want to feel myself alive, but it seems unreachable. Ending all is maybe the best option. I only have to seek the bravery to do it.\n\n PD: If you have read until here, thank you. I wrote because the need to tell someone is raising in me and I do not want to talk it to anyo of my near loveones. I do not want to worry them with these things as I do not hink that I will have the bravery to do it. Even though, thank you.", "url": "https://www.reddit.com/r/SuicideWatch/comments/og9gkw/seeking_sudden_bravery/", "title": "Seeking sudden bravery", "social_network": "reddit", "user": "SilenceAndNostalgy", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1625757868, "permalink": "/r/SuicideWatch/comments/og9gkw/seeking_sudden_bravery/", "nsfw": false, "first_save": 1635422269.1677115, "replies_charged": false}