{"id": "t5_2qpzs_t3_psyuu4", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I've struggled with depression and anxiety for years. I've been very close and begging for death many many times and have a habit of doing things that feel like suicide, chugging hydrogen peroxide most recent example. I finally managed to get some therapy in and have had anti anxiety and anti depressants for about 6 months. But exactly what made me so scared to get help is happening. For alittle while I felt like I was doing better. I stopped wanting death so bad, more like a I wouldn't mind kinda scenario. But lately I've felt no desire to live. And that feeling lasted for a little over a month. But toady. Today I woke up and just knew. I just simply don't desire to live. I'm not sad. I don't wanna die because my life is shit, I've been through worse then I'm at now. I just simply can't find a reason to live. My friends will miss me, that's true. But they'll move on. I wanna see my niece grow up? I'll either have to watch her be abused and become just as awful as her parents, or miserable like I was. I could get them arrested and get her out of the house but they wouldn't let me take care of her so she might just become abused in a new home not to mention my entire family/her baby daddys would hate me and honestly maybe try to harm me. I'm young and life could get better? I don't care if my life gets better. I can find the love of my life, be rich with my dream job, whatever, and I still won't wanna live. And I don't wanna waste my time waiting to see that I'm going to end up killing myself anyway. Don't think I'll kill myself tonight but it's probably soon.\n\nHighlights of my trauma:\nIve always struggled with anxiety and my family just didn't give a shit. I became anorexic when I was 10-13 I became anorexic after being bullied by my peers and dad for being chubby. Switched to bulimia when I was 13 which I continued until about 4 months ago (currently 17 nearly 18) I was born male but honestly have no idea what tf my gender is and it's been extremely obvious that I'm queer my whole life which lead to alot of issues with my family and the world around me. My cousin sexualy assaulted me when I was 11 and I didn't stop blaming myself till a month ago (pretty sure my parents knew but never brought it up) I've been sexualy harassed by multiple people in my life many of which were people I looked up to or saw as an authority figure in some way. I grew up in a moderately abusive home. I've been homeless multiple times and almost always lived with more people than just my parents and sister. My sister ran away when I was 12 and we didn't speak or see eachother for over a year. When I was 13 my mom got diagnosed with stage 5 cancer and was given a month to live (she managed to survive after 2 years of being about to die) when my mom got worse my dad left, as well as my sexuality confession destroyed my friend group and they all stopped talking to me that same month.. There's just so much shit that's happened but that where I'll stop. Basically, I've had some fucked shit happen to me throughout my life for a white boy in America.", "url": "https://www.reddit.com/r/SuicideWatch/comments/psyuu4/i_accepted_that_id_one_day_kill_myself_when_i_was/", "title": "I accepted that I'd one day kill myself when I was 11 and I think that day is coming soon", "social_network": "reddit", "user": "RegularSignificance7", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 10, "down_vote": 0, "creation": 1632280920, "permalink": "/r/SuicideWatch/comments/psyuu4/i_accepted_that_id_one_day_kill_myself_when_i_was/", "nsfw": false, "first_save": 1635422923.307352, "replies_charged": false}