{"id": "t5_2qpzs_t3_1wcpn9", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "Being depressed myself i kinda got a handle on how to speak to depressed people, what to say, what not say. Depression being a severe loss of vitality, motivation, joy, and such. Generally people like us just want to get out of our hole, suicide being the only visible option on the table. There is a certain logic to that mindset, however destructive it is, that can be understood and reasoned with. Rather than being irrational i find depressed people often hyper-rational and have very deep justifications for their thoughts and actions. They just need some help find a way out of their logic cages. They know exactly where the bars are, they need help finding the exits.\n\n\nI'm kinda weirded out on how to speak to someone who may or may not be *depressed* exactly, but is definitely threatening suicide if certain conditions aren't met. The case in point is a girl that told her boyfriend (not me) she was madly in love with him and if he left her she would off herself. If he didn't have sex with her that night, she would off herself. If he didn't call her everyday, she would off herself.\n\nIt's obvious this is a very toxic relationship and extremely volatile situation. The thing is, we're pretty sure she's serious. Even if she's not we can't take that chance. After all the famous not-so-last words of suicide witnesses is \"we didn't think they were going to do it.\"\n\nMy coworker asked me for help since I'm the resident nutcase in our shift and might know how to deal. Honestly though, i don't know how to deal with this type of suicidal behavior. I've supported other depressed individuals... but nothing like this. \n\nGotta do a few things\n#1. don't do anything or say anything that pushes her over the edge.\n#2. try to help her see how irrational and toxic her approach is\n#3. get her to some actual help from a much a more qualified professional than we are.\n\nWe're very worried about what to say since the slightest disruption to her mental security sends her into a fit of \"oh no you hate me!\" and she starts cutting herself. Suggesting she go see a therapist elicits much the same response.\n\nAny suggestions of what to say and how to defuse this?\n", "url": "https://www.reddit.com/r/SuicideWatch/comments/1wcpn9/how_do_i_speak_to_someone_who_is_mentally/", "title": "how do i speak to someone who is *mentally unstable* suicidal as opposed to *depressed* suicidal?", "social_network": "reddit", "user": "wrcmdsaul", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1390889507, "permalink": "/r/SuicideWatch/comments/1wcpn9/how_do_i_speak_to_someone_who_is_mentally/", "nsfw": false, "first_save": 1635425266.1200507, "replies_charged": false}