{"id": "t5_2qpzs_t3_n4p870", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "Let me elaborate a little.\n\nWe met on tinder (M(e)19F18) in Jan and it was magical. Cryptic stuff. If someone had told me how I'd feel in a few hours' time as I was making my way to the ice skating field I would've told them shit like that only in happens in movies. We seemed perfect for each other and I was amazed by how well I fit in with her friends, too. Here I'd like to note that I've for my entire life struggled to find likeminded company. Nothing new under the sun I guess and I know a drunken 15-minute conversation doesn't give everything away but they reallt were amazing people.\n\nAfter a few weeks she broke up with me, having started to cry a few times after we'd spent multiple days together. I couldn't believe the sh\\*t I was hearing, falling straight out of the honeymoon bliss to the dumps. I tried to explain how I realized I'd fucked up, it being my first relationship and all and how much she means to me. We talked a lot and things were actually getting a lot warmer between us until I screwed up, going to her place and almost fucking crying telling her how I love her in a very melancholic tone. After a week or so of very intensive crazying, topped with a very psychotic 30-minute video of me trying to explain how I felt she blocked me everywhere.\n\nI've been secretly very depressed, anxious and generally F'd in the head for a long time. It was only after I drove my first love away that I realized I don't deserve this shit. That maybe after a year of crying fits, talking to myself imagining I have someone to complain to, daydreaming and manically starting projects I never finish, crushing loneliness and counting seconds to my death there might be something wrong with me.\n\nThat the answer to my problems isn't to sing, drink, joke and daydream more, buy my friends more gifts, to dress sharper and smile wider.\n\nBut I only realized this afterwards. When I imagined what the last people on the Kursk felt like and really wanted my ex, a compassionate, soft and sweet girl who I'd do anything for to give me a hug and tell me everything is going to be alright, I said \" sorry for being so melancholic \". I'm (something to do with anxiety) fixated on knowing exactly what the causes and effects of everything are, how things are \"supposed to be\" and feeling and consequently seeming smart that I never admitted to myself or said a word to her about how fucking broken and confused I really feel.\n\nI wanted to just forget my problems and definitely not depress anyone else, especially her. When I told her with a big smile on my face that I had studied and sought a job I really had woken up at noon, written down one equation and stared at my CV for a few minutes before eating candy, jerking off and fantasizing about what we'll do together for the rest of the day. I barely said a word about how I really feel yet she was the only thing keeping me feeling like even half a person.\n\nThe fact I found a match like that in that mindstate is fucked up beyond all belief. How we seemed like the same person split in half and I drove her away because I was so messed up. \n\n&#x200B;\n\nAll I do is fantasize about telling my friends about how shitty everything is so they would pity me and try to grow the balls to kill myself. I have a loving family and great friends who I wouldn't want to hurt so I probably won't end up doing it but I don't feel I can live with this thought either. I'm fixated on feeling like a piece of shit, no matter how smart or funny I know I am. I ruined the best thing to happen to me after years of crushing loneliness. Life is a fuck.", "url": "https://www.reddit.com/r/SuicideWatch/comments/n4p870/drove_away_the_girl_of_my_dreams/", "title": "Drove away the girl of my dreams", "social_network": "reddit", "user": "RunninAllTheLights", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1620137379, "permalink": "/r/SuicideWatch/comments/n4p870/drove_away_the_girl_of_my_dreams/", "nsfw": false, "first_save": 1635428120.9937458, "replies_charged": false}