{"id": "t5_2qpzs_t3_krjjb1", "request": ["ee176c24-5d0b-47eb-8f0f-71f3b585684e"], "text": "Mostly I feel like they aren't trained to deal with people like me. I have failed to commit suicide 17 times in my life, since I was a young child. I sought answers through the prevention hotline hoping they might be able to give me another perspective on why it is so bad to take one's life, only to receive a resounding \"I'm not here to debate the morality of suicide\". So now, I seek perspectives from you. This is no longer a phase, not an act of spontaneity, and not the result of something terrible happening to me. Actually, I've had a very gifted life that anyone would be happy to have, which is why it bothers me the most. So many people die and I wish I could take any of their places, because they want their life. But I never have, even as a kid. I feel that I am quite rational in this decision, as it has taken many years to think upon. As a young adult, random strangers worry about you and tell you it gets better, but really the problem isnt always about things going bad. Sometimes its about not figuring out why it takes you three hours of staring at a wall to get out of bed, or crying because you have to go live in the world you don't fit in. Overall, my question is: why is taking your life so frowned upon? I feel that for many it is an act of spontaneity, and seeking help may be beneficial. But what about those who simply... Don't want to go through the motions every day? Who have suffered for years, and no reprieve comes because it is simply not who you are? Please do not reply with the \"stick around for the sake of those who love you\" bit, I have no one left. I do not feel hopeless, I love who I am and I am very grateful for the quality of life I have been given. My question overall is, why is it so horrible to give myself some relief?", "url": "https://www.reddit.com/r/SuicideWatch/comments/krjjb1/suicide_prevention_failed_me/", "title": "Suicide Prevention Failed Me", "social_network": "reddit", "user": "kristan000elise", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1609920516, "permalink": "/r/SuicideWatch/comments/krjjb1/suicide_prevention_failed_me/", "nsfw": false, "first_save": 1635427878.3805945, "replies_charged": false}