{"id": "t5_2qpzs_t3_97hlex", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "Whenever I go in the kitchen and pass by the knives on the cutting board I want to stab my heart with them. I don’t want to die so much as express grief in a strong way. Maybe I should draw or paint or something. \n\nSome stronger currents of social anxiety today. Felt heavily scrutinized in various stores and on the bus. Some people are always stern and untrusting but for some reason it begins feeling personal. \n\nI never like feeling this fragile. It’s like I have no voice for who I am. I feel a nobody. \n\nAt other times I was acceptably motivated and entertained and in a decent mood. I still have some more severe stuff going on but I was able to pull back a little today which was cool. \n\nI don’t want to feel worthless again. I’m watching Ghostbusters and cheering myself up. \n\nIn a few weeks I will probably want to post again.  There are some stressful weeks ahead. I should be more proactive now but I’ve settled into just having a good time before I have to work really hard for the year. I don’t want to waste these weeks worrying. \n\nI still have bad relationship feelings with family but am managing. \n\nUnderstanding that I’m due for some stress ahead I want to be managing my anxiety and depression more and making the best of my time. \n\nI’ve been feeling alone and I don’t think I can do that anymore. I might need to try making friends so I don’t feel isolated like I can. It’s too hard on me. I’d like sharing the burden. \n\nI like admitting what’s too hard for me and I’ve had some help as a result of admitting such. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/97hlex/checkin_not_suicidal_but_some_self_destructive/", "title": "Check-in: Not suicidal but some self destructive impulses", "social_network": "reddit", "user": "Hallelujah289", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1534333909, "permalink": "/r/SuicideWatch/comments/97hlex/checkin_not_suicidal_but_some_self_destructive/", "nsfw": false, "first_save": 1635422558.277382, "replies_charged": false}