{"id": "t5_2qpzs_t3_jqyt5f", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "Hello there. The  title really asks the big question. I am currently struggling with  complex feelings inside and I'd appreciate anybody who'd be willing to  listen to my ramblings.\n\n**Every  day, I experience very deep feelings of anxiety and insecurity that  stem from a combination of factors in my current lifestyle.** I  wake up in the morning feeling down, and it can go either way as the day  progresses. On some days I end up being productive (I'll come back to  this point later) and manage to get through my work properly, and others  I end up being completely unproductive and unable to focus on my  duties. In the nighttime, this is when I usually feel the most negative,  and I often find myself wasting time playing games or watching YouTube  all night. I'm not sure if I can even call it wasting time or not,  because some people may call that a proper wind-down from a day of work  while others may call it \"wasting\" my productivity.\n\nFor  context, I am 24 years old male, and I'm a co-founder in a startup that I helped create around  January of this year. Because of COVID happening, I  had opted to stay at home and work remotely, which is fine because code  work can be done at home and I can interview people remotely via video  or text. Because of all the shenanigans going on in the USA, I had opted  to move back into my parent's house... in South Korea.\n\nGoing  remote in a different country altogether has certain implications on my  lifestyle. I am glad that I am with my family in these troubling times,  and I don't necessarily have to worry about finances as I am currently  supported by my parents (who both work). **However,  because of this, I have started to feel rather sensitive about the  topic of living independently and financing my own lifestyle.** I  had approached my parents about this topic, but I had elicited  different reactions from my mother and father. My mother says that she's  willing to support me all the way and knows that I'm working, not just  sitting around and doing nothing. **My father on the other hand tells me to \"not make any more trouble**\" and that his support is an \"**investment**\". According to him, what he means is that he's investing in my future and that I should work hard to achieve a good future.\n\nWhile I love and appreciate both my parents for supporting me, **I am getting the impression that I am not living up to the expectations that they are putting onto me.**  Yes I am working, but because we're an early-stage startup with little  seed money and part-time founders, our funding is not high and we're  paying ourselves the bare minimum to survive. It does not help that **my father does not support my company's business idea**, claiming that he wouldn't use it and always asking me about doing something else. **He has instead pushed me to try to apply for graduate school, particularly for a PhD in Computer Science**,  arguing that with COVID spreading around it's an optimal opportunity  for me (who is a US citizen) to apply since universities in the USA  wouldn't be able to get a lot of international applicants. He has also  stated that getting a PhD can be done in 3 years and that I'd be in a  better position financially once I start getting jobs after the PhD. **I cannot fight back against this logic**,  as he's a PhD doctorate himself and he isn't wrong about the benefits  of a PhD (I don't believe getting a PhD in 3 years is viable to most  people however). However, with my primary focus being on my startup,  he's said that applying for a PhD should be a \"plan B\"...\n\n**I do not agree with certain sentiments about the PhD route**  \\- I believe that a PhD route should be a plan A and not a plan B, and  that pursuing a PhD route now would be detrimental to my focus on my  startup business, increasing the likelihood that it'll fail. **It feels like I'm giving up the business before it really takes off, and I hate this sentiment. However, I have nothing to say back against my father nor my mother.**  Compared to me, my father is a genius - he's graduated from top schools  in Korea and the USA, he's pretty big in the industry, and he's  financially supporting me at the moment. My mother too is also  financially supporting me as well, and both of them risk their lives by  going to their workplaces and interacting with people, which of course  increases the risk of contracting COVID. My mother especially, since  she's a pharmacist and talks to sick people every day. In many ways, I  feel obligated to follow or at least consider their opinions about how I  should think about my future, because I also love them and wish to not  hurt them in any way. However, **as I see it, I feel that pursuing my own interests would devastate my parents and put me in a very bad situation.**\n\nI hope I am conveying the context as best as I can. **I  want to continue trying to make the startup venture successful, yet I  cannot argue against my father's logic necessarily about pursuing a PhD.  I believe that a PhD is something that must resonate deeply with a  person's inner goals, and I am lacking that sentiment right now - I  don't think I am motivated enough to pursue a PhD, but I know that in  the future if there is a topic I'm interested in I'll definitely be  pushing towards it. That moment isn't right now though.** Yet, if  I don't at least try to apply, then I will really disappoint my father.  **Doesn't help that I am actually paranoid about whether he might actually  kill me or not. He's hit me before for misbehaving, and he's terrifying  when he's angry.**\n\n**In truth, while I do want to see my startup succeed, working with my co-workers isn't exactly the best experience either.**  I have found myself conflicting ideologically with my CEO, who operates  the business side of things (I'm the Chief Design Officer, or CDO). **This has made me feel incredibly isolated from the rest of the team,** as my CEO usually dominates the conversation and **I feel like I'm fighting a losing battle every time we discuss product changes**.  It isn't just in feeling too - I definitely know my CEO often has private conversations with our CMO (Chief Marketing Officer) and our CTO (Chief Technical  Officer) and usually leaves me out of important conversations. **I  feel very much alone in this startup, and I bury myself in code to keep  up progress at the very least so that I can improve the product in the  best way I can at that moment.**\n\nBoth the PhD route and the Startup route seem very troubling, to put it mildly. **Both  have pros and cons, and I get the distinct impression that one necessitates overwriting the other, which doesn't sit well in my brain.**  I feel very much alone and isolated despite being with my parents and  being financially okay at this moment. I know that If I communicate the  troubles with the startup to my parents, they'll see it as further  reason to pursue the PhD route, yet I don't have strong motivations to  get a PhD at this stage of my life and I know that self-motivation is a  necessary attribute to doing research dissertations in a PhD. **In  many ways, I feel inadequate compared to my father, disloyal to my  business and coworkers for even considering leaving the company for a  PhD, indecisive about what path I want my future to be, and ultimately  selfish for taking up everyone's time and resources.**\n\n**The negativity I've been building up has started to manifest in very ugly ways.**  I find myself swearing and shouting more than I have and I cannot look  at my parents in the eye when I talk to them. I find myself lying more about what's happening in my startup and my PhD application, and I find  myself escaping in video games and YouTube more often than I used to.  This of course uses up my time, and I beat myself up for not using my time effectively. I often stay in my room rather than spend time in the  living room or kitchen, and I have communicated less and less with my  friends in our FB chatroom and Whatsapp.\n\nWhenever night rolls around, I find myself thinking about **suicide**,  of all things. I think about whether my family and friends would be  better off if I suddenly disappeared, or what they'd think of me if I  really took the dip, so to speak. **I find myself fantasizing about being  in a different world, with different people and living a different life.  More of an escapism sentiment, but it usually boils back to the topic  of suicide one way or another.** I know it isn't healthy to think like  this, but I cannot help it. It is scaring me that I'll eventually do  something I'd regret.\n\nClose to  where I live in Korea is the Han River. It cuts through the middle of  Seoul, the country's capital, and many bridges span its width. I live  near one of the bridges, and in the past I often walked through it at  night. On occasion, I'd find someone attempting suicide, and I'd try to  get them off the railing and prevent them from jumping. Luckily, I've  managed to prevent 3 suicides, but something that always sticks in my  mind is the expression on these peoples' faces as they scream and kick  around. They appear terrified that everything in their lives are going  badly and that this is the only way out. They kick and scream and shout  things like \"my life is nothing now\", or \"Nobody will care if I go  away\". That stuff isn't true, I know, but what terrifies me the most is  that what they're shouting is sometimes what I hear in my own brain  during the aforementioned nights when I'm thinking about kicking the  bucket. It's not a good feeling.\n\n**What should I do? I don't know what to do.**", "url": "https://www.reddit.com/r/SuicideWatch/comments/jqyt5f/am_i_depressed_i_am_financially_safe_atm_i_am/", "title": "Am I depressed? I am financially safe atm, I am surrounded by family, but I feel inadequate and I'm not sure if I'm really okay. I'm very afraid of where my mind wanders to at night.", "social_network": "reddit", "user": "ts2036", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1604933037, "permalink": "/r/SuicideWatch/comments/jqyt5f/am_i_depressed_i_am_financially_safe_atm_i_am/", "nsfw": false, "first_save": 1635426660.0080602, "replies_charged": false}