{"id": "t5_2qpzs_t3_ma7l5a", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "I’m a married father of 3. I have a good professional job, respected member of my community. Good extended family connections. Basically one of those straight A type students that got everything we’re supposed to want in life. \n\nBut I’ve battled depression for 15+ years. It led to a divorce about 12 years ago. After the divorce my ex accused me of inappropriately touching our daughter and had my custody and visitation taken away and I’ve been dealing with the system ever since to regain visitation. \n\nIn the years after that I hit my lowest point and made two half hearted suicide attempts. In my fucked up headspace I also rationalized to myself that if everyone thought I was some sexual predator that I should peek into Pandora’s box and I searched for illegal teen porn. \n\nIn the preceding years after I felt like my depression had eased but having broken that taboo once I continued to occasionally view things I knew I shouldn’t. I justified it to myself that they were girls showing off, wanting to be seen, and I wasn’t taking photos or paying for it. And yeah the taboo of it no doubt enhanced the sexual effects. \n\nSo there is no doubt of my guilt and I expect to be judged for it. But recently my gmail account was disabled for violating terms of service, I assume because of a Google drive folder I kept that had mostly adult nudes but also a few teens I’d stupidly viewed and saved. \n\nSo now I’m living most all of everyday in fear and anticipation of the state police showing up at my work or home to arrest me. I don’t think I’m the kind of person that can mentally handle prison or the lifetime of social stigma, losing my professional license, losing my kids, and facing the shame that’s to come from my family and community. \n\nI feel like my best option is to preemptively take my life before I’m charged so my family can get a life insurance payout and maybe be spared the truth about me. \n\nWe have a scheduled Disney vacation in a month and I’m not sure it’s worth the risk to wait that long. I don’t even really know why I’m posting this. It feels just like it will just used against me somehow. But I guess I’m looking for any flaw in my logic or reason to be hopeful that I’m not completely screwed.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ma7l5a/considering_suicide_before_arrest/", "title": "Considering suicide before arrest", "social_network": "reddit", "user": "throwaway830402", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1616364885, "permalink": "/r/SuicideWatch/comments/ma7l5a/considering_suicide_before_arrest/", "nsfw": true, "first_save": 1635428437.76101, "replies_charged": false}