{"id": "t5_2qpzs_t3_68e44m", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "I long ago stopped talking about feeling suicidal and actively deny it when my psychiatrist asks because I don’t want to be involuntarily committed ever again. Even when I’m not depressed, I still struggle with suicidal thoughts and obsess about my current plan’s lethality, how to minimize trauma and ensure that the person who finds my body is someone who can deal with it, and what I still need to do to with financial obligations/personal belongings/body donation forms/etc. I know that I can be impulsive, especially when I’m trying to quit cutting (now for the third time, and the first time as an adult), and that for me, impulsive behavior usually manifests as suicidal behavior. At this point, I don’t \"really\" want to kill myself, but I feel like eventually I will slip-up and act impulsively or get depressed again and successfully kill myself. \n\n  \n\nI hate that I’m in my mid-twenties and have no friends, have never been in a relationship, and am still dealing with the same issues I had as a teenager. I want to change, but I can’t seem to do it on my own and honestly feel that potential friends are better off without me. I realize that I probably need professional help, but I feel like I can’t talk about my issues without being viewed as a suicide (liability) risk and being placed inpatient yet again. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/68e44m/i_want_help_but_cant_talk_about_my_issues_without/", "title": "I want help, but can't talk about my issues without risking being placed inpatient yet again.", "social_network": "reddit", "user": "rewritable2", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1493533236, "permalink": "/r/SuicideWatch/comments/68e44m/i_want_help_but_cant_talk_about_my_issues_without/", "nsfw": false, "first_save": 1635425265.8119955, "replies_charged": false}