{"id": "t5_2qpzs_t3_qc4apz", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf", "e90ed7cd-6d5b-453d-b307-06c2035916a8", "6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "&#x200B;\n\nI was always afraid of bullying. It was clear I was weak because I was never cruel for fun which made me stand out. I don't understand a lot of humour which is rooted in negativity and making fun of someone, for me the only humour I understand is like memes and s\\*xual jokes, like if someone says PP or ding dong, I may laugh. I however neither before the 8 years of bullying nor after them undersood why or how people bond over making someone's life hell, especially if this person has not done anything to them, but the fact that they can't fight back (or in this case be cruel and mean, it has nothing to do with physical fight) they just abuse you, and set a dynamic as if to say, look at how weak are you, you have no power and now everyone is going to disrespect you as well because you are not a human, you are trash and are below us. And people slowly start disrespecting you even if they are not your group of bullies, and that sucks because you feel helpless and fall into depression and feel like you can't do much to change their perception.\n\nAll of my life I never felt like I was allowed to show my emotions .For whatever reason I am oversensitive but not to words mostly but to sounds and physical touch. Words however bring me severe physicsl pain. I am not crying because someone told me I am ugly or said I will die forever alone. I am crying because the insult feels like intense stomachache as if someone is punching me in the stomach, emotional abuse and verbal abuse is more severe in the physical aspect than physical abuse. No punch or slap ever made me feel so horrible as a few words or psychological torture and smirking and looking me up and down, action. I don't understand people who are obsessed with being on top of the social hierchy but these same people tend to be horrible. I don't understand what about my behavior is so bad to be corrected but I honestly feel broken, which was their goal. It is as if it is extrmeely funny if I cry or am angry. And I forbid my self from feleing anger which in return, at some point, makes me lash out, and unfortunetly such people justify it, because they already dislike me for no reason, they justify it as me being a bad perso nand deserved to be bullied. Nothing I did was deserving of bullying, and unfortuentl even if I gave no reaction they made up reasons to bully me, which were ridicilous, like I drink with too much noise, I walk weirdly.\n\nAnd I don't understand how these people always find likeminded people and make a gang and bully people. I do have a problem with boundaries and didn't know what they were but now I tend to beat up my self for not defending them, because to me, conflicts make it hard for me to breathe. It is as if someone has wrapped their hand around my throat and holds it tightly. This is how I feel when I have to defend my self or my point against stupid and childish abuse. Now I am left between constantly lashing out and having a depressive episode and am overly tired of being told I am oversensitive. I am not. I hid my anger and tears when I could have reacted because this is natural for me. But honeslty whether I express my anger or not, I do feel empty. Lashing out is not a solution but hiding and supressing my emotions turns into self harm with a knife and suicidal thoughts. I am stuck but it is a bit better when I express my anger. It is as if these people are looking for specific reactions, but in my experience if I deny them these reactions, they make the abuse twice as much until I cannot help but react and break down. Supressing my anger developed into me expressing it through tears and they loved seeing me sad and depressed, or angry, it was always funny to them which is why I hide my anger in the first place.But I am impatient and angry girl, so hiding it makes me eventually lash out either way and look agressive and inadeuqate, which they use as a thing and pretend to be the victim. I am tired of my tears. I am tired of my anger.\n\nI am tired of never being taken seriously and being told I am oveesensitve. I am not at fault of someone touching me slighlty over the shoulder or pushing me or hovering above me overwhelms me and makes me overreact. A normal person would not react this way but unfortunetly people take advantage of my wekaness but I don't know much else rather than to hide it, because expressing it, makes people use it against me and control me. I have always wondered why anyone would find such pleasure in harming someone and why they did those actions but it seems they think in the moment and magically forget, or if they dont forget, always deny their actions. I am not a psychologist so I doubt the whole world is filled with narcissists and psychopaths, but honestly the fact that they act warm with others and mean to me, makes it feel like as if I am in the bad, when in reality I was always a people pleaser and strived to change my self to be plesant and nice so there is no way I could have offended them, even though saying no was always hard for me. I don't know what is giving me always and what makes me so easy to read but I am tired of being my self. My real self always brought trouble and abuse which is why I people pleased in the first place, but I honestly am so tired of being society's punching bag and ''let'' people walk all over me because resentment builds, but the other side never cares about hurting me and only cares for them selves, while I find it hard to not care about everything and put my self first and defend my boundaires. I didn't know what boundaries are until the age of 16 but now I self harm each time I can't defend them. What can you advise me?\n\nToo long didn't read? - The question is enough.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qc4apz/how_does_boredom_corelate_with_acting_bad_towards/", "title": "How does boredom corelate with acting bad towards someone, each time someone is an a-hole to me, they just say they are bored, but sometimes the insults are so specific I can't help but think they are projecting weird things on me and do to me what they are most afraid of being done to?", "social_network": "reddit", "user": "Soft-Clue-6345", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1634745958, "permalink": "/r/SuicideWatch/comments/qc4apz/how_does_boredom_corelate_with_acting_bad_towards/", "nsfw": true, "first_save": 1635425273.6585972, "replies_charged": false}