{"id": "t5_2qpzs_t3_o7395v", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "I don't know if I'm suicidal per se but the thoughts cross my mind. I'm always triggered by my daughter. She's 20 months old and has refused to fall asleep on her own since she was about 7 months old and I'm the one that has been putting her down a majority of that time. When she fights me and screams and refuses sleep that's when I go off. I yell. I scream. I cry. I hit myself. I feel urges to harm myself. And recently thoughts of how exactly I'd end my life have gone through my mind. I hate myself for doing it. I hate myself for getting angry. I hate that I'm getting angry at a baby especially. I think of what a horrible mother I am for getting mad. For the yelling and screaming and hitting and the urges and thoughts. I don't want to be like that in front of her anymore but I don't know how to stop. My husband and mother-in-law tell me I need to stop acting like a child and to grow up. My husband says he'll make me find someone to talk to if I don't first. I was talking to a behavioral therapist for a few months but she did absolutely nothing for me, just told me what might be wrong but did nothing to help me fix myself. I didn't tell her the suicidal thoughts because I wasn't having them often then. Now I think of how it could happen. I'm afraid that if I tell someone else that I'm having suicidal thoughts despite not actually wanting to act on them that they won't care and I'll be locked up and in an even worse position. Being locked up and having my daughter taken from me because they think she's in an unsafe living environment is the number one reason I don't want to talk to anyone, especially as to the depth of the issues. I love my daughter with all my heart and would never hurt her. I don't want to open up about everything because of that. I don't want to be away from my daughter and husband and I don't want to go somewhere where I'll just be shoved in a room and forgotten. I have a lot to live for, I know this. I just wish I knew why she was my trigger and that I could fix it so I wouldn't be mad anymore or have these thoughts because of it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o7395v/i_feel_like_im_mentally_ill_and_need_help_but_im/", "title": "I feel like I'm mentally ill and need help but I'm afraid to get it", "social_network": "reddit", "user": "MissMag98", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1624548667, "permalink": "/r/SuicideWatch/comments/o7395v/i_feel_like_im_mentally_ill_and_need_help_but_im/", "nsfw": false, "first_save": 1635423006.1532881, "replies_charged": false}