{"id": "t5_2qpzs_t3_pj8oqi", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846", "37248a85-36ad-4f27-afa2-d6240c3a39c2"], "text": "Well, this is going to be quite the story, so please bear with me. \n\nMy mom has always reminded me that my father stopped loving her the day that I was born, because he doesn't really love anyone, he becomes infatuated with the next best thing that comes along, that thing being me. But he started becoming cold towards me when I turned 12, started going through puberty and becoming my own person. He didn't like that, so the emotional abuse started there, it started with body shaming, leading me down the road of multiple EDs that I still suffer with today. \n\nMy mother and I started growing closer around this time, we had that best friend/mother-daughter dynamic. We did everything together. I would get physically sick if I was away from her for too long, that's how close we were. \n\nNow, fast forward a few years. I'm 17, and my father suffers a massive stroke. My mom, being the sole breadwinner in the family couldn't stop working just to take care of my dad, so this was a responsibility that I took on. I nursed him back to a 100% recovery. But, this stroke affected his medulla oblongota, any of you that have watched The Waterboy, will know that the Medulla Oblongota is the part of the brain that controls anger and aggression. So, even though he was able to make a full recovery physically, he was just a very angry person. He would regularly abuse my mother and I, emotionally and physically. I remember one instance of him choking me to the point on unconsciousness when I was 17 because he was hurting my dog and I tried to get him to stop. My mother still sided with him, though. No matter how close her and I were, she has always chosen him over my brothers and I. No matter how horrendous the abuse was, she always chose him.\n\nSo, when I was 18, I got mixed up in the wrong crowd and became addicted to cocaine and prescription drugs. I was using about 3 grams of cocaine a day, which, as you can imagine, depleted my bank account in no time and I was selling everything I could get my hands on in order to get my fix. Eventually I did get clean, but the damage that was inflicted to my brain because of the excessive drug use has triggered an array of mental illnesses. I've always had anxiety, ever since I can remember, I was hiding behind my mother whenever we were out in public because I was just so terrified of other people seeing me. \n\nI had a mental breakdown and was booked into a state owned mental health facility, which, in South Africa, is basically a glorified prison. So here I am, I have been diagnosed with a severe anxiety disorder, schizophrenia, borderline personality disorder, bipolar and clinical depression. I was given my meds and sent on my merry way, no counseling or psychiatric help, but, that's South Africa for you. \n\nTwo months ago, my father suffered another extremely severe stroke. I gave up absolutely everything to take care of him, to rehabilitate him, spent money that I didn't have in order to buy the correct therapy equipment to aid him in his recovery. My father, a 6'2\", 220lb man could not even move from one couch to the next without having me under his arm for support. The left side of his trachea was completely paralyzed so he was having difficulty drinking, I would massage massage his throught every time he needed to drink something to stop him from choking. Every day, I would make him special meals that were supposedly going to help to aid his recovery, and then at night, my mom and I (both 5'3\", overweight, not muscular) would carry this man up the stairs, but him into the hydrotherapy machine, we would massage his arms and legs so that we could get the blood flowing and the feeling would come back. And he has made a 90% recovery so far. But the abuse intensified because of even more damage to his Medulla Oblongota after this second stroke.\n\nSomething I also need to mention, which will lead to the climax of this story, is that my grandfather, my father's father, took out a policy 30 years ago, leaving a lot of money to my dad. My father, not having a bank account, named me as his sole beneficiary because I am his only child, so the money will be deposited into my bank account. But, on Saturday, my father had a change of heart and decided to create a bank account and have them deposit the money into his account, which Is completely okay, it is, after all, *HIS* money. \n\nI also need to mention that my mother has an issue when it comes to money, she is a reckless spender and the fact that she will not have control over the money that is due to be paid to my dad's account is absolutely eating at her. \n\nSo, yesterday afternoon, my father asked her if he could use her phone in order to contact the Insurance Company and confirm the change of account details and she absolutely lost her mind. She ran a bath, tried to slit her wrists with a genetic Bic razor (it's just surface cuts, no damage whatsoever), decided to take my entire bottle of sixty 2mg Xanax, my bottle of about 60 Amitryptiline (which are the meds that really help me function and get through the day) she went on the run after that, sent a long message on the family group, saying goodbye to my brothers and I. So they both came over to try and find her. Turns out she was laying in the bushes outside my house. \n\nAm I a complete asshole for being angry at her because of this? I am 22 years old... 22 years old and I've had to deal with rehabilitating my father twice while taking the abuse that was caused by his post-stroke aggression and not ONCE did I ever consider suicide because of that.\n\n She has always told me that she would never leave me behind. She has always told me that I am the only person keeping her here and that she'd never abandon me. But that's exactly what she did yesterday... I have stayed with my parents for so long because I can't stand the thought of leaving her here alone with my dad, I genuinely think they'd kill each other. But now, I'm sitting here, thinking \"Wow, I never considered abandoning her, but it wasn't even a difficult decision to make when it came time for her to think about leaving me behind\"\n\nI understand that the suicidal brain is selfish. I attempted suicide once, completely unrelated to anything I've mentioned before. But, do I have the right to be angry? Her boss has fired her because she has been consistently absent from work because she has been making really rash and selfish decisions, and I have been on the phone with him all day begging and pleading for him to reconsider. I am left picking up the broken pieces that she has left behind and trying to salvage what I can. \n\nI am just so tired. I used to be so beautiful, I would wear makeup everyday, do my hair everyday, I used to model professionally. I just feel like I've lost myself in an attempt to help my parents keep their heads above water. \n\nI am a self-harmer, always have been. I'm sitting here with a fresh razorblade, thinking, is it really worth it? Is this what the rest of my life is going to be like? Not once has anyone in the family stopped to ask if I am okay. And my mother constantly complains that I've changed and she is very hostile towards me. I'm never going to be the same person I was before all of this went down, and it is drawing me closer and closer to the blade, especially considering that she keeps complaining about how much I've changed. \n\nThank you for listening to my rant, I'm terribly sorry that it is so long. This is just my last resort, because I'm truly lost.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pj8oqi/my_mother_took_all_of_my_meds_in_a_failed_suicide/", "title": "My mother took all of my meds in a failed suicide attempt yesterday. I feel as if I am at the end of my tether.", "social_network": "reddit", "user": "Significant_Royal403", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1630962882, "permalink": "/r/SuicideWatch/comments/pj8oqi/my_mother_took_all_of_my_meds_in_a_failed_suicide/", "nsfw": false, "first_save": 1635422308.2763448, "replies_charged": false}