{"id": "t5_2qpzs_t3_q3kbwd", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "So I'll start off by saying I'm a 27 year old male, dad died in front of me when I was 8 from a heart attack, never really knew my mom. His side of the family had a no contact order against my mom and always told me that she just abandoned me...my grandparents who raised me died the year I met my mom at 19. She lived out of state with a new husband and two new little brothers....didn't really develop a relationship with them until I found out she was dying of ALS and she was unable to even speak....lots of other trauma and drug abuse in my past but I've come a long way, with zero financial or emotional support from my family. \n\nGot emancipated at 16 right before I went to residential rehab and then a halfway house until I turned 18. Spent some years fucking up but never touched h again...got into construction and moved to Maine from Virginia  at 21 with my then girlfriend of 5 years even though I'd never been to Maine in my life. We eventually broke up. Got in as an apprentice plumber and now I'm getting my masters license in December.\n\n I have a baby on the way with my now girlfriend who I met because she commented on a video of some music I played and posted on tik tok...she moved all the way from California to Maine after I flew her out for a vacation and to meet...things with her are amazing and I'm so excited to meet my son/daughter because I can't wait to be a dad\n\nSo I've come a long way and accomplished alot.\n\nGot a car loan and paid off my truck after five years\n\nMaintained the same residence for the past six years (on track to be the longest I've stayed in one place since my grandparents were raising me)\n\nMade two friends in this state that I seriously consider brothers and who I've done my best to be there for.\n \nAnd acquired a customer base in sidework that would be the beginning of my own business when I get my masters\n\nBut for as long as I can remember regardless of where I've lived or the circumstances; every single day I get to where I have free time or time to think and reflect.... It's then all I wanna do is just cease to exist and relinquish my ability to think. For so long I've just wanted to end it. Ive been medicated and lost faith in it because of trying to off myself multiple times with trasadone and Seroquel and other prescribed mood stabilizers mixed with alcohol for respiratory failure... Been resuscitated  each time\n\n I have so much hate for how society went from destigmatizing these struggles to fetishizing them.... That's made it hard for me to reach out\n\nBut I have a baby on the way and I guess at this point I'm sitting here in the driveway while my girlfriend's on the way home from work realizing that I could never leave my child like I was left and lied to. But at the same time this emptiness is still here... Music wasn't enough of an outlet, drugs made it worse, and alcohol  doesn't numb me enough anymore.... I've been  at this precipice of the void for so long and just want to finally jump in... but so excited for my son/daughter because I know In my heart I'll be there for them like nobody ever was for me I'm already so proud of them because of the life they'll endure and the obstacles they'll inevitably conquer.\n\nMy job freed me from destitution and financial struggle.. And that gave me purpose and fulfillment\n\nBut when I get home and can finally rest my body... My mind pulls me right back to that precipice and I'm so fucking scared one day I might jump and leave my kid.\n\nI don't even comprehend how some words or \"upvotes\" (this is my first ever post on Reddit) from a stranger could even help but I just had to say all this....I wish I could tell my girlfriend but I'm scared of stressing her out and hurting the baby. I'm scared of leading her to think that I feel trapped by the baby and not by my own mind. \n\nI'm sick of validation on the internet as some kind of currency of our culture. Im sick of having to talk about myself in general. I'm sick of nothing but slaving away to my employer being my only source of purpose. I'm sick of relying on my partners and friends for purpose. And I refuse to let my kid be the only reason for me to keep living...\n\nThe end, the void, the darkness, the long long sleep....just seems so inviting but now I can't go.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q3kbwd/ive_spent_the_last_5_hours_in_the_driveway/", "title": "I've spent the last 5 hours in the driveway", "social_network": "reddit", "user": "pipesnpatches", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1633645787, "permalink": "/r/SuicideWatch/comments/q3kbwd/ive_spent_the_last_5_hours_in_the_driveway/", "nsfw": false, "first_save": 1635427666.2699797, "replies_charged": false}