{"id": "t5_2qpzs_t3_hybdgj", "request": ["ee176c24-5d0b-47eb-8f0f-71f3b585684e"], "text": "Pretty much the title.\n\nEvery so often I visit the suicide prevention center (with a mask of course) and talk to someone just outside the entrance of the suicide prevention center.\n\nI typically go in the middle of the night after drinking (it's open 24 hours a day where I live). \n\nI could call them of course...but I like the in person visits. I have so many of their cards with the phone number on them (one for each visit) like a deranged collection of pokemon cards (depressed pokemon used self destruct...it was super effective!).\n\nHere's what I typically ramble to them (while drunk):\n\n\"Life is fundamentally absurd and futile.\"\n\n\"We are all born for no reason, work pointless jobs, and then fucking die!\"\n\n\"Humanity is a collection of delusional and egotistical apes..I hate being a person!\"\n\n\"I have nothing to look forward too and we are all pretty much fucked on a global scale\"\n\n\"I'm a piece of shit who was born in a middle class family in a developed nation..and I have wasted so many opportunities. I deserve to live and die in misery.\"\n\n\"I want to hit positive people in the face with my frying pan!\" \n\n\" I want to die in my sleep!!\" Or \"Fuck this shitty world!\"\n\nI say all these things with a few variations here and there.\n\nI then typically burst into tears. The person listens and talks with me a little. I feel slightly better. Then I go home and sleep. The next morning I typically feel better..not amazing..but better.\n\nThere really is no point to this story...just stating one of my habits that relates to this sub. At least it keeps these thoughts at bay.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hybdgj/i_frequent_the_suicide_prevention_center/", "title": "I frequent the suicide prevention center", "social_network": "reddit", "user": "Jida-polysavoir99", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 48, "down_vote": 0, "creation": 1595786195, "permalink": "/r/SuicideWatch/comments/hybdgj/i_frequent_the_suicide_prevention_center/", "nsfw": false, "first_save": 1635427880.3469517, "replies_charged": false}