{"id": "t5_2qpzs_t3_qcl36v", "request": ["5f7c2841-3f43-4682-8126-88825da57933", "ee176c24-5d0b-47eb-8f0f-71f3b585684e"], "text": "nsfw cuz i don't wanna trigger anyone with self harm talk \n\ni have a serious problem where if i am trying, or in the moment of attempting suicide I am just kind of in a haze? I am not really thinking straight at all, my brain feels foggy and I am just not completely aware of what's going on, my brain just becomes super focused on the act of suicide and its kind of hard to stop myself.\n\nits kind of a similar situation when I self harm, just completely zone out, I am not thinking about what I am doing and I am only really back when I have fucked up my arms, usually before i enter this state of just pure dissociation i am either pretty upset or numb.\n\ni think this just has to do with when i just hit a extreme with my emotions? my last attempt for example, I was feeling really bad and then my brain just went off in a daze, thoughts of suicide just completely overrunning my headspace and it doesn't feel bad to think about at all, it feels right somewhat, like my brain is telling me that this is the correct thing to do and that I need to do it.\n\nits hard to explain what this state of mind is, but i am just generally not thinking when i am in it, its hard to ask for help when i am in it because i am just so hyper focused on killing myself, it just feels like i am not in control over my body, i am not making my decisions anymore at that point, all i want is to die.\n\nsorry if this is sort of complicated but i dunno, hopefully someone understands. :/", "url": "https://www.reddit.com/r/SuicideWatch/comments/qcl36v/how_do_i_prevent_dissociative_suicide/", "title": "how do I prevent dissociative suicide?", "social_network": "reddit", "user": "Brave_Cake8436", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1634796378, "permalink": "/r/SuicideWatch/comments/qcl36v/how_do_i_prevent_dissociative_suicide/", "nsfw": true, "first_save": 1635421115.9146383, "replies_charged": false}