{"id": "t5_2qpzs_t3_mwt8dh", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "I'm 40.I'm done. I'm the loneliest person I've ever met. No friends, no family. All the lonely stories always include words 'friends and family'. You don't know what real loneliness is.  Being fundamentally alone means having literally zero people in your life. \nIt's not speaking to anyone *ever* except maybe at the stores. It's being so desperate that you repel people in real life, I try to hide it but it shows. I don't understand why people don't like me.. Online friends are not real in the same way than in real life. And I'm pretty, like very pretty which somehow makes it worse. Ever since I was small I knew my only use in life is to please men. Of course I've never had sexual pleasure. I hate that I'm so weak I can't even do sex work bcs I'm so naive and weak I'd probably get into a dangerous situation. I want to die, not be raped lol. I had a good family, good upbringing and I wasted it all bcs I'm human garbage. So pathetic I can only feel sorry for me even though I have everything most people want : good job, nice rental controlled place and savings. I had Hpv, w a high cancer marker. I hope I get cancer bcs I can't kill myself, but cancer can. Cancer is my friend, will be my friend my only friend. The only other thing I have. I didnt ask to be born, I am so worthless. I hope cancer doesn't reject me like everyone else. I hope every day Ill die somehow but I don't, but I have hope that displasia will turn into pre-cancer, will turn into cancer, will spread to my body and take me", "url": "https://www.reddit.com/r/SuicideWatch/comments/mwt8dh/high_risk_of_cervical_cancer_hoping_to_get_it_bcs/", "title": "High risk of cervical cancer, hoping to get it bcs I'm a waste of life. I'm done.", "social_network": "reddit", "user": "stupidpieceoffilth", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 19, "down_vote": 0, "creation": 1619177668, "permalink": "/r/SuicideWatch/comments/mwt8dh/high_risk_of_cervical_cancer_hoping_to_get_it_bcs/", "nsfw": false, "first_save": 1635427904.1092734, "replies_charged": false}