{"id": "t5_2qpzs_t3_51wqnx", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "*TD;DR: is there a drug or something similar that I can take which inhibits the survival instinct?*\n\nFor the past years I have disappointed all my relatives. I kept telling them I would take all my exams year after year. But each time I spend less and less time studying. I lost all my drive to do anything. Originally I would study 1 week before the exams, then turned that to the day before the exam, the night before the exam and now I reached the point where I would lie to myself that I would study \"the next day\" but in the end not even open the book. While I know this isn't too relevant to my question, nor is it my whole motivation for ending my life, I do feel it plays a major role and felt the need to give a bit of background before delving into the question itself.\n\nWhat I want to know is how to get the courage to end my life swiftly. I do not want to hear answers like \"It takes courage to live, not to die\" or \"The reason you are not killing yourself is because you still have the hope that things will change\". I dont care if things can change, because I WILL NEVER CHANGE THEM. I stopped taking action and I am unable to do so. I lied myself for too long that \"tomorrow I will take that step and change myself\". It never happens. I do not have that kind of strength. And even if there are friends and relatives who care about me and want to help me, they cannot. The change must happen from me...but that will never happen. I know that better than anyone else.\n\nI don't care if I am branded a coward for not wanting to face everyone after I failed them again and again. Why would I. Even if I mustered the courage to keep going, there would be no point. My life is boring and stale. Nothing good happens and nothing bad happens either. And as I mentioned above, I am unwilling to try and change that. I already know I won't.\n\nSo what I am trying to say is that I don't want comments telling me how precious life is or asking me how I would feel if a loved one died. It would hurt, yes. I would suffer. But I dont't care. I don't care if anyone suffers because of my death. I am selfish. I don't care about anything. So please tell me viable ways to quickly and painlesly end my life. I read somewhere that replacing all the air with nitrogen is one such way. The problem is that I do not know where I can buy some and how to do it properly.\n\nAlso, there is the problem of the survival instinct. Naturally, I would be afraid to do it even if I had all the means. Are there any drugs that would inhibit this obstacle? Any productive answers would be greatly appreciated.", "url": "https://www.reddit.com/r/SuicideWatch/comments/51wqnx/how_can_i_get_the_courage_to_end_my_life/", "title": "How can I get the \"courage\" to end my life?", "social_network": "reddit", "user": "ZangetsuT", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1473417338, "permalink": "/r/SuicideWatch/comments/51wqnx/how_can_i_get_the_courage_to_end_my_life/", "nsfw": false, "first_save": 1635426468.2561398, "replies_charged": false}