{"id": "t5_2qpzs_t3_l337hg", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "It’s been a while for me since I was at my lowest point. Nearly 3 years now. To be honest I shouldn’t be here right now. I attempted suicide but clearly things didn’t work out my way. \n\nThe first god damn thought I had when I hit the floor was “God are you fucking kidding me? Am I such a failure that I failed to fucking kill myself properly?”. \n\nAfter that there was no sudden change per se. But eventually I just got better at fighting the urges to do it again. That and the thoughts which still haunt me 24/7, I still struggle to sleep at night. Every. Fucking. Night. I lay there in my bed.  I plan out my suicide over and over and over, torturing myself and I can’t seem to stop it. Every note I’d write. Every precaution i’d take. I’d plan in in detail. \n\nThe day I first attempted it (and failed) the five minutes before I actually went through with it were the most peaceful i’ve ever had. No amount of drugs, no amount of alcohol has ever given me near to the same feeling of just simply being “there” and for that small moment having all my thoughts/feelings of being a burden and whatnot lifted. \n\nEven after all that and knowing (to an extent) what it’s like (I say to an extent because I know everyone’s situations are different) and I try to think back to my self at that time and figure out what someone could have said to me to help. Because I want to help others like people on here. But truth be told there was nothing. No amount of “oh your family loves you” “we care about you” blah blah blah ever changed me, I literally just didn’t fucking care. I just wanted to be not here. \nFor me it felt like there was nowhere left for me to go apart from 6ft under. \n\nIt’s hard. It is really fucking hard. Because you know on here, you could say something to someone to try and help them but you know it won’t do anything. No matter what you try to say. You know that one wrong sentence and you might actually be a cause for them to go and fucking kill themselves or try again. \n\nEven though I still don’t want to be here, a long while ago I saw a quote that went along the lines of “if depression wants to kill me it has to stop being a bitch and shut down my organs like a real fucking disease” and for the first time in a while I laughed. I had a thought as well, i’ve already seen where I go when I just give up on life. What about if I didn’t give up? What about if I just TRY as hard as I could, one step at a time, to live as if I really did die that day? Well at least “that” part of me. And yeah I know a slice of the person I once was will always be with me (for instance the self torture I can’t seem to stop) but everything else. I stopped using me feeling shit 24/7 as an excuse to do unhealthy things. Drugs, alcohol, no exercise, constantly avoiding family and friends, constantly pushing them away and repeating the same toxic cycles as well as habits in my life over and over. \n\nI said to myself if I could move my arms, I could get myself to sit up, if I could do that I could swing my legs around to the floor, if I could do that I could stand, if I could stand I can take one step, if I could take one step I could take another, and another, and another. \n\nJust because I started doing things that scientifically help people feel better doesn’t mean I felt better you know. I struggled a lot at the start. Eventually I just got better and better at re-directing my negative self talk and all that and using it for constructive purposes! I still hate my self. I am ashamed of myself. But that will forever be my motivator. \n\nNo one will be able to motivate you to do shit when you feel like shit. \n\nSo stop letting a bitch of a disorder take you over. If it wants to kill you, it’ll have to fucking shut down your god damn organs like a real fucking disease. Use your pain to fuel your fire. \n\nThat’s the only advice I know I can give from experience\n\nI apologise in advance if anyone finds anything I said offensive or hurtful/demeaning. That was not my intention. I simply want to give others another option when it comes to trying to help themselves. \n\nI know it’s hard. I know you’re in pain. I know you’re tired of hearing “other people do care about you” and all that. I’m not saying do it for them. I’m saying do it for yourself. From today on live like a part of you has died. And don’t worry, if you still really want to die, it’ll happen eventually. It happens to every person, every animal, even every star.", "url": "https://www.reddit.com/r/SuicideWatch/comments/l337hg/a_slice/", "title": "A Slice", "social_network": "reddit", "user": "DARKENED-SOULS", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1611369064, "permalink": "/r/SuicideWatch/comments/l337hg/a_slice/", "nsfw": false, "first_save": 1635422317.7110338, "replies_charged": false}