{"id": "t5_2qpzs_t3_pinp67", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351"], "text": "Okay, I've already written in this reddit, but I need to rant.  \n\n\nI am in despair. Mainly on how humanity COULD have been in a different world and how it purposefully avoids it. In russia, we don't have education, per se. We have schools, and we have universities, but not education. Fields that are reflectory are either banned or heavily moderated to curb \"russiaphobia\", which is the usual go-to line for any authoritarian rule. The problem is, I wanted to be a philosophy major, and am actively reading and writing on it. My father is a millionaire, but he is incapable of understanding it as a field of study, and talking to him sends me to despair. Plus, he is also a moron, which makes any help from him unrealistic. I went away, with some savings, and cut ties from him. However, no matter how knowledgable I can get, being 19 in Russia with no social power and no understanding from people with it means not having any impact on the broader life with any work you may put out, as there are little means to distribute it without academic circles, which are nonexistent on half of the subjects here, including philosophy.  \n\n\nYesterday I tried explaining my father how he uses his own ignorance of reality around him and actively disengaged with explanations of it to avoid reflection for ego preservation, which lets him work in the Administration and continue his life. It went nowhere, and I've tried to change him for the better for 3 years at this point. Belief in him becoming a better person was unjustified, I suppose. I blocked him, but the feeling of hopelessness inside the stomach doesn't go away. It takes strength to keep writing or reading anything under the circumstances, and twice it - to hope for something. I don't have that, and knowing the problems with myself doesn't help if there's no way to fix them in the material circumstances I am in.   \n\n\nPeople around me think they're a plot, a coherent story with a beginning and end, with a direction. But reality isn't cinema, and reality isn't a grand country rising against a cabal of conspiring enemies. Instead, it is a mass of interconnected and shifting social and physical systems beyond any individual's control, which we may change only to a little degree, and there isn't a one-on-one narrative to go with it.  \nAnd I am horrified of what people do while avoiding the realization of that.  \n\n\nRecently, after Navalny (a right-leaning centrist with nationalist vibes, but anti-administration) was imprisoned, the conflict throughout the country escalated, and our propaganda machine, usually contained within the tv network, realized how the internet can pose a threat. Now half of the ads I see here are of our party in control. While it always was a shithole to live in, it is getting worse. And no amount of knowledge I may possess can change that. If it was any at least semi-modern country, like Germany or Britain I could have gone to university and have some of my writing actually published, and maybe used. But not here.  \n\n\nAnd it is a pain to live through, seeing humanity fail to reconcile the contradictions between the systems they built themselves. It is painful to the point where the only thing preventing me from suicide is my girlbro wishing me to stay.  \n\n\nWhat a pity.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pinp67/russia_and_purposeful_ignorance/", "title": "Russia and purposeful ignorance.", "social_network": "reddit", "user": "Delicious_Round2742", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1630884208, "permalink": "/r/SuicideWatch/comments/pinp67/russia_and_purposeful_ignorance/", "nsfw": false, "first_save": 1635423175.2290447, "replies_charged": false}