{"id": "t5_2qpzs_t3_q52d05", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "I never failed in school but now in college I will need to repeat a year because I failed to answer two subjects repeatedly (because of stupid reasons). I am dumb, cowardly, ugly, short, loser at sports, conversations, awkward and asocial af. My problematic parents played a huge part in fucking me up. My parents tried years conceiving me which is funny because they don't really give a fuck about me and I realised it a year ago.  I am totally hopeless and a disappointment to literally everyone who comes across me. I do stupid mistakes all the time and I wonder why such things happen to me.. also the fact that I have some bad luck. \n\nUntil now I could do well in academics but since I started college whole thing has gone to drain. I can barely function and I don't feel any interest in college at all. I procrastinate with fanfictions and got obsessed with them to the point I create fanfics in my mind and waste time creating alternate stupid stories. I want to kill myself but I'm scared of reincarnation and failed attempts going badly. I don't feel like doing anything at all and now I'm just weeping silently that I'll have to repeat a year. Last I repeated a year was in Kindergarten when I had lot of understanding issues. I'll be lagging behind more and I just want to act on this urge to finish it once and for all. This was a course I was initially excited for but now it all became damp. \n\nI have given up all hopes of succeeding in life and I don't know what to do. The fact that I share major blame of all fukups and don't know how to act is the worst thing. Everyone else I know is stable and having it good and I just feel that I don't belong, like always. I know I have some mental illnesses and suspect adhd as one but my parents won't let me go to psychiatrist and will laugh at that suggestion, they coddle me too much and don't let go too far as well as deny accompanying me.\n\nDespite all the risks I'm really contemplating killing myself because I'm just tired of dragging it and I don't have the will to do anything at all.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q52d05/im_good_for_nothing_and_totally_useless_and_i/", "title": "I'm good for nothing and totally useless and I really don't wish to continue anymore", "social_network": "reddit", "user": "mehrunysa", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1633846096, "permalink": "/r/SuicideWatch/comments/q52d05/im_good_for_nothing_and_totally_useless_and_i/", "nsfw": false, "first_save": 1635427978.2268136, "replies_charged": false}