{"id": "t5_2qpzs_t3_c1h59j", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "\\[serious\\] (I don't know how to create that green tag!)  This is **NOT** a puerile attempt at begging for attention.   \n \n\nHi all! I'm a  newbie here, so let me jump right in with a quick background \"bio\": \n\n I have been suffering from severe clinical depression the entirety of  my life. I have learned a lot of coping mechanisms in some very good  (and very long...)  therapies. After having crashed again twice this  year, tests have shown additional personality disorders as a cause of  the fits of depression. Additional therapy  would take -again- many  years before possibly yielding results. \n\nThat's when I first got  the inkling that I didn't NEED to subject me to that torture and  heartache again. Yes, I honestly think *-and I know how incredibly hard to say and hear, and  how intensely controversial this is-* suicide IS as valid an option as any other. I really want to break through that taboo of not even being able *to discuss* considering it.\n\nI **am** of course still investigating any and all other options (I'm not *advising* suicide!) , so I have started writing a blog chronicling that journey, wherever it may lead.  I would really like to [share that blog,](https://www.demasque.me) in hopes of attracting some like-minded folks, or even -who knows!- maybe offer or learn some new insights.  \n\n\nI'm honestly not \"link whoring\", and if this is in any way against the community rules, please let me know!  \n\n\n(Please note I am NOT a therapist. I'm not selling anything. There are no ads on my site. It's a private blog, is all.)", "url": "https://www.reddit.com/r/SuicideWatch/comments/c1h59j/suicide_as_an_option_taboo/", "title": "Suicide as an option? (taboo?)", "social_network": "reddit", "user": "mavhass", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1560731920, "permalink": "/r/SuicideWatch/comments/c1h59j/suicide_as_an_option_taboo/", "nsfw": false, "first_save": 1635428432.9929087, "replies_charged": false}