{"id": "t5_2qpzs_t3_oisg9g", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "When you feel depressed, or know that you are, you can’t help it. You can’t help yourself from feeling a certain way. It changes the way you think, the way you act. When you’re depressed, people don’t usually treat you with much compassion or understanding. They do, however, become sympathetic when you die by suicide. Thats how it is. Once you take your life, people start to post your photos with captioned stories of how amazing you were when you were alive and how much they will miss you. The sad truth is, the same people who do this are the same people who saw you at your lowest and ignored it. Ive been having a difficult time to feel constant happiness. Ive been having suicide thoughts for a long time. I just dont want to live anymore. There are times that ive tried but to be honest, during the times that I tried I guess I always knew that it wasnt going to kill me I guess it was a call for help? But what if it actually does kill me. What if I went to far and actually end up dying.. Its not even the fact that I could die that scares my but what does is not knowing what happens after. What happens after I die? do I really go to hell for killing myself? Will i just be a ghost roaming around earth? Will I have another life? Will nothing happen and Ill just cease to exist? What if nobody cares that im gone? What if things will get better one day and I wouldnt know since I killed myself? At this point I dont think its a question of whether or not ill kill myself but rather its a question of when im going to kill myself. I know that things eventually get better but fucking shit its taking a hella long time.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oisg9g/thoughts/", "title": "Thoughts", "social_network": "reddit", "user": "Sweet_Love5061", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1626100353, "permalink": "/r/SuicideWatch/comments/oisg9g/thoughts/", "nsfw": false, "first_save": 1635423064.2746923, "replies_charged": false}