{"id": "t5_2qpzs_t3_pfxaf1", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "Just for context I've been previously diagnosed with chronic depression and generalized anxiety disorder as well as a tendency to addictions and suicidal behaviors as well as a record of suicide attempts, I stopped going to therapy since I moved to a smaller city because my girlfriend lives here. Before we started to live together I stopped drinking and using drugs on a daily basis, then I moved and now I've been 5 months clean.\n\nA few weeks ago my girlfriend had a suicide attempt overdosing her antidepressants along with every pill she found on our house, then she called me just after that happened. I called an ambulance and ran out of my job to my house, I had to lift her up to the ambulance since she couldn't walk on her own and spent all day at the hospital with her, I stayed home with her the first days after she was given a different medication by a psychiatrist and I've been taking care of her this whole time, I lost my previous job and had to sell some of my stuff to work it out. She tells me that she's genuinely better and I can see that, I want to believe her, I see that she's putting an effort on her process and that she wants to move on and continue but I can't say that I feel the same way, I'm always remembering her on the ambulance, or laying in the hospital bed, I'm always thinking about the way she couldn't speak or walk on her own when she overdosed, I can't sleep because when I close my eyes I start to live that day again. Last night I started crying out of nowhere when we were going to bed but I didn't told her what the reason was, I've been crying regularly since then which is pretty uncommon on me, I'm afraid of telling her that I'm feeling like this again, I'm afraid of telling her about all the times on the recent days that I thought about killing myself or all the plans I made to achieve it, I'm afraid to tell her that I can't move on, I can't just let it go, I can't pretend to forget it and it's torturing me, I feel guilty, I feel like I failed her by not paying attention on her signs or working too much we couldn't spend more time together. I want to die, I'm agonizingly stuck on that day and her previous attempts too, I don't think that drowning in alcohol or using drugs again is going to soften it enough to make it bearable this time, I just feel so tired and drained that I want to sleep and never wake up, I want to run away and get lost in the mountains or to overdose and die in the grass, I've been escaping just a few nights to go to the hills and sit on the grass but I haven't been brave enough to take the pills I hide with me, I don't know how long I can endure this situation.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pfxaf1/i_want_to_know_whats_going_on_with_me/", "title": "I want to know what's going on with me", "social_network": "reddit", "user": "xspjmo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1630513285, "permalink": "/r/SuicideWatch/comments/pfxaf1/i_want_to_know_whats_going_on_with_me/", "nsfw": false, "first_save": 1635425245.7457755, "replies_charged": false}