{"id": "t5_2qpzs_t3_pk2lqh", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": " \n\nI can't say I grew up in a bad environment. I grew up in a household of the lower middle class standing (looking back, to my knowledge). Most of my memories from back then are lost, but the bad ones have stayed with me, like when my elementary school bully threw my hat and scarf over the fence in the middle of winter with snow up to the top of my boots, and called the recess aide on me when I went to go climb the fence to get them myself to save my dignity. Or when I got called into the counselors office with my mom on the phone numerous times for not doing well and hiding grades I thought were \"bad\" (they were B and under). I also vividly remember absolutely destroying my room and throwing things all on the ground, boarding up my door, and hiding on the closet floor, crying. School was always really tough for me, up until I graduated high school. My mom was always micromanaging me, and I was an[ IEP](https://www.washington.edu/accesscomputing/what-difference-between-iep-and-504-plan) student, from middle to high school. They always thought I just had attention deficit disorder.\n\nI'm a 21 year old now, a state college dropout with nothing to my name. No credit, no car in my name, I've never had an apartment, and I've rarely hung out with anyone since leaving high school. In University, my depression plagued me. I discovered Discord from a club I was in in high school, and hadn't used it much until I discovered Disboard, and wanted to connect with people. I ended up in a large dating server, and shortly after became a moderator (back then, it was actually a great community with a defined cause). It was engaging and fun, and I did lots of fun stuff online with my newfound internet friends in VCs watching movies, playing games, and whatever else. I rarely left the apartment my mom had paid $1,000 a month for me to live in, I skipped classes, and in my second semester of my Freshman year, flunked out. I remember my mom banging on my door that fateful day she came all the way to my University to check in on me. My room was a mess, garbage everywhere, dishes, wigs from the occasional cosplay, papers scattered all over the floor and clothing in random piles. She was shocked, to say the least. Then her worries started to grow for me, and she started voicing it.\n\nI don't really remember much from late 2019 now, after I came back from uni. I do remember ending up getting an opening crew job as a line cook at a local Italian restaurant that was going to open up. I worked tirelessly for $12/hour, with 57 hour workweeks, and no defined breaks. I was becoming exhausted, and whenever I was home I would just sleep. I slept on the living room couch, because they wouldn't let me actually have my basement room back. I eventually moved in with my now ex-best friend, and that was insanity too. I don't like to talk about those times.\n\nAfter I left my ex-best friend's place, I moved in with another good friend of mine that I had met in high school. It was amazing there. His family treated me like I was part of their family, too. I had my own room, and things were looking up. A few weeks after getting there, I started a new job at a Mexican restaurant, putting together people's orders. It was fun enough. Then COVID hit, and my family was actually worried about me and offered to take me back in. I, unfortunately, agreed. It was fine for a while, and I got ANOTHER job at a pizza place that fall. It was going fine, I was putting together pizzas, I only made $10/hour, but hey, who cares? I was making money again, at least.\n\nThen, my life went to shit again. My depression had still been worsening, and I, in my typical self-sabotaging fashion, destroyed my whole Discord community and support system that I had created. I had wonderful people who were there for me, and helping support my entrepreneurial dream (that was short lived and became tiring to try to make a good community after). I missed them dearly. One night, after I got a paycheck, I decided to buy VOCALOID and Hatsune Miku v4. My parents were not happy when they saw me at the kitchen island with my fancy new program and stuff. They demanded I get a refund immediately. I refused, because ever since I was 10 or so years old, I wanted to make songs with Miku, too. My parents were now cursing me out and chasing me all around the house trying to kick me out and trying to take my laptop from me because I refused. I stubbornly sat on the floor in front of the foyer bathroom on top of my laptop, because I did not want to leave or get a refund for one of my many passions. My parents eventually outsmarted me by picking me up by my feet and under my arms and physically dragging me out of the house, despite my struggling and crying. My dad, who had my arms, stumbled outside and dropped me on my elbows. That hurt like a bitch, and he threw my laptop in the grass (or on the snow, I don't remember, it's fuzzy). I was panicking and hyperventilating, banging on the door on that cold night. I ended up calling one of my online friends and then in my freaked out state, threatened to kill myself to them. I think I told my ex-best friend this, too, because she was the only local person that was close to me that I could think to contact. I cut that short as well, and she called a Welfare check on me. She let me know she did, and not 10 minutes later, the police were at the doorstep, as well as an ambulance truck. They escorted me to the ambulance to check on my bruising from the fall, and told me I could press charges against my parents. I told them I would think about it.\n\nLater that night after they did a psychological evaluation at the hospital, I was released. In my desperation, I ended up going to my ex-best friend's house to stay the night for a few nights. The next morning, I received a call from my mom telling me to think about going to residential treatment to better my mental health. I shrugged it off and went about my day, having fun doing whatever on my laptop. I thought about it that night, and kind of understood my mom's worries. The next morning, I agreed with my mom, and talked to the admitting nurses on the phone. I would head there, the next state over, tomorrow. I was terrified, but my mom was supportive and gave me a bunch of art stuff I could bring with me to relax, along with basic necessities and clothes. I was gone for about a month and a half. Near the end of it, they did numerous psychological tests and a Rorschach test. I was finally properly diagnosed with[ BPD](https://www.mayoclinic.org/diseases-conditions/borderline-personality-disorder/symptoms-causes/syc-20370237), Major Depressive disorder, and Generalized Anxiety disorder.\n\nI came back in December 2021, and my parents allowed me to stay with them, in the basement room, again. I went back to my pizza maker job, and since I wasn't making much from it, (even though it was still just $10) they encouraged me to get another job, so I got a job at a local hardware store as a cashier. Eventually, as always, I got kicked out again. I don't remember why, this time. A month after getting kicked out, I wanted to move in with a close online friend, and quit the pizza job (the cashier job was great but I misunderstood their points system and rules about clothing, so I got fired). At the last minute, a reality check hit me, and I got cold feet, so after a short visit my friend and I went and headed back home around 9pm that night. We made it back to my state and in a safe city we could stay the night in around 1:30am. We had a fun day after we got back up, headed back to my city and went through my old university town for lunch. I couch surfed for a while after coming back. Eventually my parents' friends took me in and I got a nice job again, at a local smoke shop. That went downhill for undisclosed reasons. Cut to the present, I got an even better job offer while I was still working at the smoke shop, and took that. It's another opening crew job. All was going well and looking up again, and I thought I would be in secure hands for a while, while saving up for an apartment. I was wrong. On day 2 of our training, I got some texts saying that it's not a right fit for me to be staying at my parents' friend's house anymore. I broke down in tears in the middle of training, and sat outside. I also ended up locking my keys in \"my\" car (my parents are lending me it) and had to go get roadside assistance to help me get into the car again.\n\nAnyways, I just wish I had somewhere stable I could live. I don't want to live alone, because I'm scared I would devolve to being homeless completely. I have no one near me that I can live with at this point, I've exhausted everyone around me's resources, time, and patience. I am sick of this, I don't seem to have a place anywhere. I've been feeling depressed about everything a lot lately, but it's getting drastically worse. I rarely take my medication because I'm really bad at that (but I'm handling social interactions and arguments with my parents much better after residential regardless), and I truly have no hope at this point. I can only trust and rely on my online friends so much, and most times I hate even having to do that. I have nowhere to go, no drive to do anything, and no one who needs me around anymore. I'm tired...", "url": "https://www.reddit.com/r/SuicideWatch/comments/pk2lqh/existential_dread_long_post/", "title": "Existential Dread. [long post]", "social_network": "reddit", "user": "Neither_Parfait3921", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1631071740, "permalink": "/r/SuicideWatch/comments/pk2lqh/existential_dread_long_post/", "nsfw": false, "first_save": 1635422305.8438516, "replies_charged": false}