{"id": "t5_2qpzs_t3_qh3yx7", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "Do you think there is a point beyond redemption? Are some people pure evil? In a fit of anger I wrote down everything wrong with me. It totalled 126 reasons why I am awful and I decided that is enough for me to kill myself. But I brought up my reasoning and was suggested to share it and see if it’s really so bad before I decide to end myself. I suppose I’ll give a try to sharing my story here since I don’t have anyone to talk to and I don’t know where else to post, an *abridged* but stil too long, version of my reasoning. This is the most honest I have ever been and probably ever will.\n\nI’ll start linearly. I am in no form normal or functional. I was born rotten. I was a violent child that was threatend with police action and almost expelled from school. This made my father abandon me. The worst part is there was no reason or trauma for me to behave like that, I am just a freak of nature that should have been aborted. Starting off shitty from the very beginning.\n\nI somehow gained a sliver of sanity, but it only got worse. All my sins started dawning on me, and it started coming together. So I decided to end my life somewhere around the age of 10, being a being of that stature it obviously failed and only brought frustrations and embarrassment to my overburdened mother. I did not and still do not understand why anyone did not want to see me go after all the hell I raised (I was like fucking Lucius Wagner, seriously), but I assume it’s something about legal liabilities. In retrospect I still wish I died then and there. Failing that did not avert my problems, so I started to take it out on myself as a form of penance or something. At first, it was usual histrionics, it progressed to the point I was biting holes in myself and ramming my head down till it opened and bled, I would say this obviously did not improve my mental condition, but I did begin to think more clearly, so maybe I knocked something into place, maybe I should keep going with it.\n\nAt that point, my mother was understandably starting to give up on raising me and just left me to ram my head in peace (literally), same for other family members that tried to control me, since I could still act human in public I guess they didn’t find it much of a problem. \n\nI eventually became more stable so I continued my education at a higher level. I managed to continue life without any major drama. I tried to make friends but it only ended with me being told to fuck off, so I concluded that pursuit forever (rejection hurts). Thing is, I have a big mouth and will speak without thinking and it gets me into trouble, also I feel I will judge if someone is an idiot and will be unable to stand them. These factors prevent me from ever making friends. I want affection but I can’t give it, just sperging.\n\nI was then signed onto therapy and counselling on behalf of the school, they formally diagnosed me with: autism, clinical depression and other disorders I forgot the name of anyway, so I am subhuman. Counselling failed to bring me any resolution. I told them about wanting to die and my problems and the only solution they could provide was that I was the only one who could fix my own problems, how insightful as if I didn’t know. And that my “worldview is very warped” I see it as unfiltered. It was at this point I surmised I am beyond help.\n\nSo with my diagnosis, due to incompetence by school staff or something else, fellow pupils who were not my fans found out about my condition and other personal information like race, and they did what students do. It was infantile and didn’t bother me much, name-calling and writing “fag” all over my books but in retrospect, I think it was very important in my development and becoming more cynical, so I included it here. I did then try to impress the cool kids by, bullying students below my level. They could have been my friends but I would not and still do not accept the advances of those lesser than me. This led to a vicious circle of bullying but I think some of them deserved it anyway. Somehow despite being aware of my flaws I still have a huge ego. (I am a massive hypocrite).\n\nMy self-harm escalated to become a issue when I discovered unscrewing sharpners and other things like that. I grew restless, which led to one of my biggest problems, I ended up fucking up my face somewhat. At the time I didn’t understand what could happen, so I kept going but it later dawned on me how much of a moron I looked like when the scars showed up. I was ugly, but I could pass as generic, not anymore. With one move, I destroyed any self-esteem I had left and any chance of a close relationship (I am vain). \n\nAt that point I developed a self defeatism complex where I deliberately fail things and humiliate myself so I have an excuse to punish myself with more self harm, this is still annoying me today. I also developed crippling social anxiety that makes it impossible for anyone to take me seriously because I can’t even look at people. On top of that I have a permanent brain fog that makes it impossible for me to think clearly or with any intelligence, which is probably brain damage. School was coming to an end and I took the examinations expecting to fail because I knew I was stupid, and fail I did, terrible grades in everything which *still* stops me from being able to apply for many jobs today. Then I decided to kill myself seriously before turning 18 so my family might qualify for beverment payout and before they yell at me about my terrible scores. They do not even know in the end.\n\n**Then** being at 16 I got a proper noose then went to hang myself in a dark room where no one would find me. I gasped for a while, stars in my eyes and all that shit but no surprise I failed to even kill myself properly because the material above me broke off, landing me on my ass. I was only mildly disappointed, nothing else. Later I tried to walk in front of a speeding car and make it look like I wasn’t paying attention but they managed to stop in time and grilled me. At that point I decided to make a vow, I would not kill myself for 5 years and see if life could get better.\n\nI studied at college for some years, passed diplomas on multiple subjects, whatever. This brings me to my current point. I realised that a monke could pass the studies I was doing, and my education has zero fucking value and I might as well have done socialist gender studies. If it was not easy, how could my 70iq dumbass not just pass but achieve “distinction” grading the whole way through? I don’t even know how to use punctuation properly and passed every one of my 2000 word theses and essays, Lmao education system’s a joke.\n\nI thought the college could help me figure out where to go from there but no I was just left on my ass and I did not have good luck with work so, despite my efforts, I ended up NEET which I dreaded happening for a long time, oops. I thought about studying at university, but I have zero interests in life to pursue and I would obviously fail it anyway. They filled me with so much bullshit optimism about the future, I knew it was bullshit but I took a chance on it and they lied to me. But what is painful is that it proved the “cruel” people were just being normal and speaking the truth the whole time, that I really am a fucking loser. I never had a role model (obviously) and the closest people to it, were a bunch of fucking liars. \n\n**Now** reaching my present state, I mentioned my single mother previously, this comes into more importance. I blame myself for it, my mother who was always somewhat dull, lost a mind harder than me and became unbearable to speak to for more than seconds. Used to be a reasonable person and I ruined her by being so terrible. Any attempt at conversation just ends in shouting, anything not perfectly in accordance with nonsense doctrines turns the former adult into a screaming child.\n\nThis has left the saner me alone in the world with no positive influence. It wasn’t so bad when I could escape to school, but now there’s nowhere to stay for 8 hours a day. If it couldn’t be worse, she goes and has a bastard child at the age of like 45 or something and I’m the one to take care of it half the time. She keeps loser dad around and all they do half the day is scream at each other, and I really dread what is going to become of that child. I fucking despise her, for having not one but two children to carry on her awful subhuman genetics, for failing to raise one child and trying again to ruin another life. But at the end of the day it’s still all my fault, I could have not been a coward and killed myself already and avoided all this, this realisation *burns me every day*.\n\nI continue to cut myself to the point I have many ugly scars and it got so bad I now sometimes hear voices telling me to start doing it or to keep going, which is a new occurrence that scares me and is impossible to drown out. Thus it will be impossible for me to quit, as I will always come to believe it as my penance for past sins. I tried to speak one last time to my mother about my problems who, with the empathy of a phone book, called me a sadomasochist (if only) and told me to go kill myself if I want, then get a job, in that order, which is enough justification for me. I asked an 8ball if I should end myself, and it also said yes.\n\nI have nowhere to go, nothing to do, with dementia patients in charge of the “free world”, the economy is so fucked I would drain all my savings on travel expenses if I actually tried to get a job now. 5 years have just about lapsed since I made my vow, and my life continues to become worse so i’m ready to die. **I could** keep living but the idea that I would probably be 30+ and still neet fucking burns me to even think about.\n\nThere is however, one single, vain bucket goal that is keeping me on earth, I’ll let my egotism out *again*. I was reading a lot of literature; though I did not understand all of it, I was impressed by the level of profoundness within the narratives, and it expanded my view of the world. Since I will never contribute to society, I try to write my own novella that probably will not be very interesting or well written as you can tell from this, but maybe it will entertain someone, at least one person and I must do that before I die. Only I keep deleting what I make for it not being good enough, I fear it’s my subconscious cowardice. (I am writing this whiny bullshit instead of getting back to work!) This is very annoying as I know it’s all that’s keeping me alive and i’m stopping myself from finishing it. I do not know if I will ever finish or just kill myself anyway. \n\nFor now I decided to get a sharper shaving blade and keep penalising myself for my mistakes as much as possible and keep crawling towards my goal. Only then I’ll start going for arteries. The searing pain and wounds scratching against clothing serve as a constant reminder of my failures and limit delusions of happiness. And it is terrible that such a piece of shit like me is allowed to loaf around in relative ease while actual good people suffer so I guess it’s also the postmodern take on wearing a sackcloth.\n\nI figured I am too stupid to provide anything of value to the world: to hold down a job of any responsibility, too autistic and ugly to ever have a relationship or friend, too impudent to deserve help, too much genetic trash to start a family. And it’s the strangest thing, every day I want to die and suddenly I don’t, I am so pathetic I don’t have any control over my emotions to be sad or energetic is random when I wake up. For example I had a drunkard uncle that kinda molested me (unimportant) so I obviously did not care about him at all but a few days ago he finally drunk himself to death and it was some local drama. I did not care and you’d expect me to be happy but when they were talking about his grave I suddenly gained some strange fear of death and desire to live. It went away but I fucking hate it, not being able to control my own whims and being delusional about hope like I was for the past 5 years. I hope there is no afterlife because that would entail keeping this shitty broken brain.\n\nI guess why this is so long is, in a neo-dialectical way, you can see my whole image and try the question because it's needed for a judgement. Though it’s clear, after a lifetime of untreated mental disorders. I am a lazy bum with a low iq, Napoleon complex, huge ego, intense self centrism and neuroticism. I will never change, it is too late and I am too old to try restarting my life, I would have to relearn things I should have learned as a child. Nobody is going to waste their time educating an adult like a child. \n\nSo is there any possibility for redemption? anything that can be done? or should I follow the 8ball's advice? \n\nBut; somehow, brave reader you made it through to the end, what do you think of me and my life now? First world problems? Schizo? Is this the worst thing you ever read? Sorry. Let me know. I understand I made my own problems but please humour me for a bit. \n\nThe greatest irony, writing this, Wasted Years by Iron Maiden shuffled to my playlist, it’s not lost on me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qh3yx7/can_a_wastrel_change_their_spots_long/", "title": "Can a wastrel change their spots? (long)", "social_network": "reddit", "user": "DonttouchmyPlumbus", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635361445, "permalink": "/r/SuicideWatch/comments/qh3yx7/can_a_wastrel_change_their_spots_long/", "nsfw": false, "first_save": 1635426870.3731654, "replies_charged": false}