{"id": "t5_2qpzs_t3_kijoj5", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Even though it’s all my fault just fuck this year…   \n \n\nI’ve been at the best point of my life, after living without one parent, in poor condition with my mother being an alcoholic, and at one point in my life having moved to different cities more times than I could celebrate a birthday, I’ve finally felt really good and confident, had a job that I’ve been proud of and most of the time I’ve even liked being in it. I’ve managed to be with the best girl I could ever imagine, an intelligent, beautiful looking and genuinely loving one. Since I’ve seen her for the first time 2 years ago I knew I just wanted to hold her in my arms, but doubted that I ever could considering her then-boyfriend and obvious differences between him and myself both on physical and “prospectivity” level. Even though at the start of the year I had all could ask for.  \n \n\nThen I started to do shit so everything could fall apart because of me. I’ve been absent from work to the extent that my employer decided to fire me. I’ve never had any “money pillow” and never created one, so I started to be really stressed and that begun to play role in my relationships, not just the romantic one but even with friends, I started to avoid human contact, been cold and had tensions to erupt in a slightest argument.   \n \n\nThat led to the moment when drunk I’ve beaten my girlfriend and obviously that was the end.  \n \n\nit just all does dark. And it goes darker by the minute.  \n \n\nI’ve tried to take my life before, but it was very impulsive and of course unsuccessful. When I’ve been 16 after relocating multiple times and feeling like a failure and burden in any social or family group I just decided to end it by hanging myself on a tree on some braided cables. After being fully prepared and being in a moment of peace with my destiny, they just snapped, and that was one of the worst feelings I’ve ever experienced. Not even able to properly get out this way of all the trouble.  \n \n\nNow I’m sitting here crying writing this after researching for 2 hours on cutting my own throat. At this point I all about cutting a carotid artery, the external jugular vein, and the muscle in between them, what I should expect to feel in regards of pain and suffering, and the importance of dedication to it if I want to succeed. I have no stress about being found, I live alone, my family is several hundreds of kilometers away and even then I only communicate with my father.  \n \n\nI just wanted to write myself out of this misery and had to tell someone because the feeling of loneliness and desperation kills me even before I take the knife to my hand.  \n \n\nThank you for listening my friends.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kijoj5/man_just_fuck_2020/", "title": "Man, just fuck 2020...", "social_network": "reddit", "user": "t12lucker", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1608689100, "permalink": "/r/SuicideWatch/comments/kijoj5/man_just_fuck_2020/", "nsfw": false, "first_save": 1635422318.329812, "replies_charged": false}