{"id": "t5_2qpzs_t3_pcg2e7", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "This is how I feel. I'm 28 years old and all my life so sheltered that I feel so naive to get through reality. People say that I'm incredibly mature but I don't feel this way. I feel overwhelmed by how cruel the world is. I feel so small I don't know how to face it. I'm very fair person, I'm honest and a perfectionist. I can't handle the cynicism and the selfiness people have nowdays. Maybe I'm more romantic and dreamer for my own good. I don't consider myself the greatest person but seeing others it makes me feel like maybe I'm too good to the point of stupidity. Nobody cares for something deeper, for real feelings only fir social media and money. I don't judge them for the second one in the world we live. Nobody wants genuine discussions, nobody wants to help or support someone else, nobody can show compassion. Everyone tries to explain everything based on logic and they forget the emotions. And emotional people considered the dumb ones.\n\nNothing is gonna change. I can't feel this weight in my heart anymore. It's too painful to know that I will never find my place in this world. I don't want to fight anymore. I refuse to let people use me or make fun of me. I don't want to be the punching bag.\n\nI don't want a good and stable life. I want a life with love, with good people and justice. I can't compromise with just be fine. I don't like reality ok? I want to live in a dream. And since I can't live in a dream and as I see nobody else can't also, I prefer to die. It's better than try to convince myself to be happy in a swallow world.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pcg2e7/im_too_weak_fir_this_world/", "title": "I'm too weak fir this world", "social_network": "reddit", "user": "Miss_miserable_", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1630038262, "permalink": "/r/SuicideWatch/comments/pcg2e7/im_too_weak_fir_this_world/", "nsfw": false, "first_save": 1635423000.2271938, "replies_charged": false}