{"id": "t5_2qpzs_t3_qfbssf", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "Threats are nothing to me, it is as if everyone wanted me dead. By everyone i mean even my closest relatives, my family.   \nEveryday i get judged by them, the judge every actions whatever i do. It feels like my actions are all bad to them. I get to their nerves so bad for whatsoever.. i lived with it, lived with the pain.  \nThough i may have been a bad person but ive always shown them respect, theres just something about these people that they badly want to squeeze me.. was it pride? was it jealousy? i dont know..  \nall i know is that they make every little thing i do look bad, its what they normally do.   \nTheyre good at showing up with a nice and friendly face but behind the curtains, theyre nothing but monsters who sate their appetite by torturing you with all their painful words that they rather not say infront of you. \n\nWhen i used to work as a staff on giant company, trusted some people im not suppose to trust, coworkers make fun of me everyday, even did their best to do the things that were supposed to be my assignment just so i got nothing to work on anymore, it got worse to a point when i heard some guy planning to kill me and given that wave accross the neck gesture while looking at me, for it ive gone awol for straight two weeks. i resigned .. enough's enough\n\nJust when i thought it couldnt have gotten worse my own family and relatives would be the same. I literally never expected they'd laugh their ass when i tell them about my problem they even mocked me for it so i locked myself indoors for almost a year fighting sanity, also dealing with my mother's terrible mood swings just made it worse for me. We fought everyday for the tiniest reasons while getting judged by my relatives, made them think im an ungrateful disgrace for a son not knowing exactly whats going on, they just judge away. Relatives talking shit about me while dealing with my mom's temper i decided to leave and stay with my girlfriend for about 3 months.\n\nMy Girlfriend, she's my savior. I wouldve just gone insane if it wasnt for her. Staying with her loving family changed my life, given me a chance to overcome my problems. I went from an introverted caveman to an extroverted good doer. \n\nI returned home but i no longer have a bedroom stay, my sister moved her things to my room so i decided to stay on our cottage. I never understood the joy of being treated like a human being and a family til the time my mom recognized changes within me, it was satisfying. Although my relatives remains the same, the plastic faces they wore everyday didnt bother me anymore, i lived with it instead. From then and now i never held anything against them, but they made everyone think im holding a grudge so they look at me like an angry, unaproachable guy. No matter what i do, what kindness i show, its nothing to them.\n\nNothing's gonna change their minds, i do one thing, automatically its a bad thing to them. Ive seen them rise now i watch them fall (karma i guess? idk), but still they never realize that and now i hear some of them planning to take me out, y'know \"kill me\". So i immediately told my girlfriend about it incase something happens to me she knows who's guilty.\n\nIm not afraid to die.. i mean ive got nothing to lose, i quit my job ive got nothing to impress my girl anymore, i no longer buy her gifts. Writing this incase anything happens i'll tell my girl to check this post. \n\nIve anything wrong to upset them, everyone just love stepping on people, it completes their day im not mad about it, its their life right? who am i to even judge them?", "url": "https://www.reddit.com/r/SuicideWatch/comments/qfbssf/atleast_i_die_an_innocent_man/", "title": "Atleast i die an innocent man", "social_network": "reddit", "user": "rrd_IV", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1635148787, "permalink": "/r/SuicideWatch/comments/qfbssf/atleast_i_die_an_innocent_man/", "nsfw": false, "first_save": 1635427660.3595898, "replies_charged": false}