{"id": "t5_2qpzs_t3_od4mxy", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I've gone through too much and done too much to really ever recover but this really tipped the scales into a realm of pure darkness. I was diagnosed with ADHD so trialled dexamphetamines courtesy of a psych for two months but they ended up triggering a psychotic manic episode of sorts, maybe due to combined daily weed usage as well, but especially when the guy I was casually seeing for 6 months broke things off with me, as well as getting into a stressful situation with my best friend at the time. The episode lasted 6 months though it felt like time flew past me, so much happened during that time: I cut off the aforementioned people, had them call the cops on me because of the state I was in, deleted a bunch of people off my facebook, told people I was a psychic medium, thought I was talking to spirits and living people through a psychic link, crashed my car at 90kmh yet was miraculously unharmed, had my mother say I was possessed by demons and sprayed me in the face with a shower head, was flown to a mental health facility 4 hours away and spent a week there, lost my pet rat to illness and was so mentally ill myself that I wasn't taking care of her or spending time with her in her last months, had my mother and others raid my room - breaking things, reading private journals and throwing away stuff in the process, spent a month (including my birthday) at a friend's parent's house - haven't hung out with the friend in years since his girlfriend doesn't like that we slept together years ago, spent all my savings on overpriced crystal jewelry and dumb crap, got stuck thinking about all my past mistakes and people that I've lost over the years because of my own selfish recklessness and \"I could die any day\" attitude, told my very loving father to \"fuck off\" for the first (and only) time in my life, also had father tell me not to call him \"daddy\" and say \"who are you trying to con now?\" about something I said/did, had mother say \"you want to live, you're the sperm that won\" plus coming at me for a personality disorder I haven't been diagnosed with and calling me toxic to the family, had my little sister call the cops on me for my erratic behaviour, have been kicked out of the family home and currently living with my nana, although that might change soon and I don't know if I want it to. \n\nI have so much anger towards my mother and how she's treated me my whole life, since she has anger issues and would always yell and scream about the smallest things, stomping around the house yelling about how I'm a \"useless, lazy cunt\" and other things over the years. She also smokes weed and I used to be so avidly against it since I realised as a young child and was scared that my sister and I would be taken away from her/lose her to getting arrested but when I found out my first boyfriend was a smoker when I was 17 I begrudgingly joined the bandwagon with him and his friends back in 2014-2015. This caused problems in our relationship, plus other things, and I ended up cheating on him with his best friend in a whole mess that dragged on until 2016, when he broke up with me and his best friend ended up ghosting me... I went off rails, ended up smoking more and more, trialled mood stabilisers and got drunk at a party then ended up sleeping with a friends boyfriend so was kicked out of that friendship group. Ex-boyfriend and that friend ended up dating which was a huge stab to the heart, but I never blamed either of them for not wanting me in their lives after everything I did wrong, although my ex stayed close with his best friend and my ex-friend stayed with her boyfriend for a year after he cheated while I was no longer welcome in the group. This made me feel like extra trash in comparison since they kept the other offending people in their lives while I was kicked to the curb; thankfully I had my best friend and her boyfriend, still, even dated the both of them in 2017 but that failed and I was kicked out of their house for continuing to smoke weed, day in and day out. These are the same two people that I lost during my psychotic episode that started at the end of last year and only ended a couple months ago, since then I've felt like my brain is broken like my thoughts do not form the same and I am no longer the actually fun person I was before. I haven't smoked for a couple months, either, though I kept smoking through the episode because it was already too late and I'd fucked everything up and lost all that I held dear. I spend every day now sleeping for as long as possible, until about 2-4pm, then drag myself to work until 11pm and just watch TV like a vegetable while I try not to cry... which fails since I cry every damn day since regaining sanity. I've read that some people never recover, mentally, from such an episode as it causes actual brain damage which has left me feeling devastated because I just want to go back to the way things used to be, as I would see my best friend 2-3 times a week and also the guy I had been crushing on for 3 years, her now ex-boyfriend, but obviously none of that will ever be the same... I was so happy that he finally asked to see me, even casually, after years of hoping for another chance after the failed polyamory attempt of 2017 but now he's living with some other chick who's his new best friend, while my best friend has moved into a new house with her other boyfriend, so even that dynamic has changed after 7-8 years of knowing them, and them being together. I'm grateful they've both been talking to me a little bit but it's a drastic change from seeing them every week since I was 16, even having lived with them twice before... not to mention my brain flinging me back to 2014-2015, the only time I had a serious relationship and wishing I could go back that far in time, not just back to before this mental breakdown destroyed my friendship, family and actual brain. \n\nIt's extremely difficult to see a bright future ahead when each year things have gotten worse for me, especially with physical brain damage in the mix. I may be able to recover but the opposite is also true so I'm finding it extremely hard to want to be alive... I've told my father that I don't want to live and him saying that, if I died, he would too if making me feel forced to live... I don't want to destroy my family but my existence is honestly barely worth living and it's practically impossible to recover from the emotional and mental abuse my mother has dealt me, especially since she doesn't see her issues as anything that would have majorly impacted me, even though any personality disorder I may have could greatly be linked to the way she's treated me. \n\nI just want to reconcile those negative feelings towards my mother, since she tries to be loving, but she's also very controlling and won't even let me eat in my bedroom anymore or let the dogs inside, so if I do move back in it will honestly feel worse than before. Not to mention the majority of my property is now stored at my uncles in tubs that she organised so I don't even know where any of my stuff is which leaves me feeling angry and annoyed and upset constantly with her. Plus again the aforementioned invasion of my private journals and property including kink items that I'm not at all comfortable with her or my father having seen. It's hard to not feel responsible though since that invasion of privacy wouldn't have happened if I hadn't suffered a mental breakdown, same with the sudden rules of not eating in bedrooms or having the dogs inside, which affects my sister negatively as well. \n\nI'm thinking that if I save up $10 000 then send half to mum, half to dad, then leave my property for my sister I can just kill myself and be done with it even though I know they'd much rather have me alive, I'm sick to death of crying all the time and thinking about how great life used to be and how fucked in the head I am because of genetics/upbringing/past experiences, not to mention the loneliness of having lost my best friends. The loss of brain function after having a meltdown is, of course, the worst of it, plus being unable to ever touch weed again, as it had grown on me over the years, although it was definitely an addiction I should have fixed long ago. Just something I used to numb the pain of fucking up back in 2016, plus my best friends also smoked so was easy to do socially, even though I lost social contact with people who didn't smoke since I was constantly high and couldn't go more than a couple hours without smoking... didn't have my much of a job back then, would even smoke before work and on break, now it's gone forever. Which is probably for the best anyway but to lose the option entirely, not to mention the only way to actually treat ADHD, which I still have, and I'm feeling awfully unrepeatable for the mental shit I was already dealing with.\n\nIf you've made it through this wall of text, just know that I appreciate the time you've spent. I looked up this sub and, at the same time, received a text from one of my mum's friend's who is a psychic medium (hence where that delusion came from, I know another lady who is another friend of my mums and a medium I have seen for years with amazingly accurate advice, I'm normally more practical/sceptical but have had enough proof to believe in such things) which is always interesting... maybe I just wanted to feel special, I definitely didn't want to feel so lonely anymore, that's for sure, and if spirits actually wanted to talk to me I was overjoyed. But the lack of brain functioning really emphasises that I had a mental breakdown, even with physical evidence to tell me otherwise on some fronts, it was really hard to rip myself away from some delusions when they had some merit to them... I just wish it hadn't happened, as I was barely clinging to my will to live and dearly miss what I used to have with my friends in my life. And wish I didn't go through the extra trauma my mother provided, she didn't handle the situation well and neither did my father, really, but nobody really had experience with psychosis and I really wasn't helping myself at the time, either.", "url": "https://www.reddit.com/r/SuicideWatch/comments/od4mxy/had_a_psychotic_episode_was_already_suffering/", "title": "Had a psychotic episode, was already suffering from depression, now feeling worse than ever", "social_network": "reddit", "user": "Twijinx", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1625340464, "permalink": "/r/SuicideWatch/comments/od4mxy/had_a_psychotic_episode_was_already_suffering/", "nsfw": false, "first_save": 1635426214.2219088, "replies_charged": false}