{"id": "t5_2qpzs_t3_qbpnbx", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351"], "text": "No one really takes me seriously because I’m only 14. I don’t blame them, most of the youth suicide stories come from impulsive, depressive, psychotic, abused, or guilty backgrounds. Trust me, I’ve had a fair share of tragedy and horrors that I’ve had to deal with at a young age, but for me, it’s a little different. I’ve always had the magical theory that everybody has some sort of meaning, either major or minor. Well, nowadays, it feels like my meaning is to have no meaning. I’m average. I’m not pretty, I’m not athletic, I’m not clever or smart. I don’t keep up with trends, neither do I make a point to reject them. Etc etc. I’m just there. I’ve lost the motivation to live, because why keep on when I might just be rotting in a cubicle for the next 40 years of my life? There’s nothing important or special about me, nothing stands out, nothing about me is lovable or likable. Those who do “care” for me are obligated by biological blood, pity me, use(d) me, you get the point. I don’t want to pass on the grief, because I don’t exactly hate anyone. Life for me is just gray. If anything is interesting about me, it’s my overbearing impatience and fear. The future used to keep me going: the idea I’d be a prominent, rich figure in society if I kept working hard. But I’m afraid. I don’t want to live on the rest of these days to get to there, I can’t wait that long. I want to be forgotten, to be a fuzzy memory, and unfortunately, the only way to achieve that is to die. I’ve planned on going sometime later this week. There’s still a voice in my head that tells me to stay, that there’s a future ahead, that I do mean something and I do have purpose, but that voice has been getting quieter and quieter. Sometimes, I can’t even hear it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qbpnbx/i_dont_want_to_die_i_just_dont_want_to_exist/", "title": "I don’t want to die, I just don’t want to exist.", "social_network": "reddit", "user": "Lisumimia", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1634692449, "permalink": "/r/SuicideWatch/comments/qbpnbx/i_dont_want_to_die_i_just_dont_want_to_exist/", "nsfw": false, "first_save": 1635423154.5539954, "replies_charged": false}