{"id": "t5_2qpzs_t3_e6ms45", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "If I thought for even a second I could successfully commit suicide, I would be doing it right now. My friends and family all think I'm 100% fine. I \"used\" to be suicidal. I used to talk about how I wanted to die every single day. I used to cry for 5 hours a day; my ex boyfriend left me because I fell into such a horrible depressed death spiral that I neglected my responsibilities, stopped taking care of myself, and ruined every chance I had for him to be happy with me. Today, everyone thinks I got out of this death spiral years ago, but it isn't true. Yes, I take care of myself now. Yes, I eat, I'm not starving myself anymore. Yes, I shower sometimes and clean the house sometimes. But I'm still in just as much pain as ever. I'm still an opiate addict to self medicate, and numb this pain. I've just learned to hide both better. And even though they think my depression is gone, and that I've gotten better, it's all a lie.\n\nThe truth is, I still want to die just as much; no, so so so much more than before. I've been through years of therapy since then, 25 different therapists since then, on top of the 15 I'd had before that, and nothing helps. I've come to accept that though I want to die, and think about suicide every single day, that I am incapable of ending my own suffering. If I could go to a doctor to be euthanized, I would. In my 25 years of life, I have never once *not* been in pain. I can't get a gun or else I would shoot myself. I can't overdose, as I have no illusions about the mortality rates for drug overdose being as low as they are for suicide attempts. The point is, I would kill myself this very second if I didn't think I would fail and end up in the hospital again.\n\nMaybe, just maybe, when my fiance and I visit my grandparents for Christmas I'll search for the key to my grandfather's gun case. I've thought long and hard about it and I think I've guessed where he keeps it. I could steal one and wander out miles into the desert, and be dead before anyone noticed I was gone, with no chance that someone could get me to the hospital before I bled out. But the truth is, I'm even skeptical that that would kill me. I've attempted suicide so many times and in so many different ways, I should be dead 20 times over. So in my mind, and I know this might sound hard to believe, I'm skeptical I could kill myself with a shotgun at point blank range at this point. If you knew how many times I've attempted, and the various ways in which it's happened, you might just start to see it this way too. It's honestly almost as if the universe is playing some cruel joke on me, as though its made me immortal, while putting me through as much pain as it possibly can, watching me try and fail to die over and over again like Phil Connors in fucking Groundhog Day.\n\nI'm sitting here in front of my computer monitor, playing MMOs and listening to music, waiting around to die. Every single day I do the same thing in the same way, because in my mind it isn't worth it to do anything differently. Even when I had a job and friends I was in just as much pain. So why try to better myself if nothing will ever be different? So if I know I can't die, and boy have I tried, I might as well just smoke, drink, and take tons of drugs every day in the hopes that *that* kills me slowly over time, right? Oh, no, wait, I'm immortal, that's right. I've overdosed, bled out, been hit by cars, electrocuted, gotten alcohol poisoning, chemical asphyxiation, been knocked out by way of blunt force trauma, fell off a building or two, and I've even hung myself at least once. So it doesn't make sense to try again since none of that ever even permanently injured me, and I sure as shit don't have brain damage, right? And if it seems like it because I don't make much sense that's just because I'm high out of my mind and tired from not sleeping for 3 days.\n\nWhy am I even typing this? I haven't even mentioned my serious mental and physical disorders, have I? Autism. OCD. PTSD. ADD. Why am I alive? The memories are coming back lately. I'm remembering my ex boyfriend constantly these past few weeks, and it hurts. The abuse. My fucking abusive parents. Scott, the abusive fucking asshole who left me. God damn it I loved him. Fuck it, I'm pouring myself a drink. I need to think about this.\n\nI need to think about this...", "url": "https://www.reddit.com/r/SuicideWatch/comments/e6ms45/the_only_reason_im_not_attempting_suicide_this/", "title": "The only reason I'm not attempting suicide this very second is because I've attempted so many times and failed so many times that I'm convinced I can't die.", "social_network": "reddit", "user": "RoseTheLilly", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1575576568, "permalink": "/r/SuicideWatch/comments/e6ms45/the_only_reason_im_not_attempting_suicide_this/", "nsfw": false, "first_save": 1635427159.0393274, "replies_charged": false}