{"id": "t5_2qpzs_t3_mq91wl", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I've done barely any long form writing since I graduated high school, and I typed this whole thing out in around an hour, so forgive me if it comes off a bit disjointed. Just really needed to have a vent right now.\n\nTo start out, I was diagnosed with autism as a young child. Did ok early on but began developing depression when I hit my early teens. Since then it's been a pretty much constant struggle to find any sort of ability to function in society. I've been given more diagnosis, things like ADHD, Binge Eating Disorder, Clinical Depression, Gender Dysphoria, Social Anxiety, Generalized Anxiety, Medical Anxiety. For most of these I've tried multiple different meds, in the case of depression more than a dozen. Failure rate is nearly 100%. \n\nSo we come to today. Less than a month from my 23rd birthday. Managed to make it to my own one bedroom apartment, where I fail to keep up with basic chores when I can even remember they need to be done (I've been suffering from memory problems for about a year now). The only way I can keep myself from eating exclusively junk food is to keep as little food in the house as possible, and eat over at my parents house when I can (thankfully my stimulus payments all coming at once in my tax refund have allowed me to eat takeout a bit more, but it's unsustainable on my current wages). I have a part time retail job that I'm poorly suited for, and I struggle to connect with my coworkers as they're all much older than me and have different interests and senses of humor. Being around other people mostly creates feelings of anxiety and discomfort, the only way I've found that I can reliability feel at ease around another human being is by getting high. Just weed, nothing stronger, but obviously it's not a solution I can use all day every day. Combined with the memory and functioning issues that have been worsening since the start of the pandemic, I'm only able to hold any sort of conversation beyond the bare minimum on rare occasions, or on very specific subjects. \n\nKeeping up with friends feels more like a chore I do to prevent them from totally abandoning me, more than something I do for any sort of joy or connection. I often get into these weird fits where my autism symptoms are heightened, and my brain will kinda just berate me via swamping my headspace with the most vile, abusive insults it can think of. These used to be vanishingly rare, but lately I've been getting them around once a week. Yesterday on the tail end of one I finally got the courage to try to drive out to the suicide spot I'd picked out, but I couldn't get up the nerve and just drove to a much shorter, closer span and stared at the churning water for a bit. Rivers tend to calm my soul, at least momentarily.\n\nTrying to even approach any of my mental health problems at this point feels like trying to untie a gordian knot. The problem is too vast to tackle the whole thing at once, but it's impossible to pull on any one strand without a dozen others yanking it back in. The whole thing is an unholy tangle of internalized bigotry, self-hatred and contradictory emotions, and my brain continually tries to sabotage any progress I make. I'm seeing a therapist and a psychiatrist, have been seeing various therapists and psychiatrists for years, and for the most part they're sympathetic and try their best but most are ineffective. I've gotten to the point where I'm sluggish to accept treatment because I have no faith that there's any point to trying it again. I have more stories of medication attempts causing active harm to my mental state than I do of them helping even slightly.\n\nI won't get too much into it, because I know politics isn't the point of this subreddit, but it's also not something I can pretend is unrelated to my feelings. Between the knowledge that a significant portion of the world would probably want me killed for being trans, the stubborn defiance of this fucking country to do anything about its deeply ingrained racism and callous disregard for human life, and the fact that climate change continues to ramp up while no government or corporation is willing to take any sort of genuinely transformative action to mitigate it, I don't see how I could keep from feeling existential despair on a daily basis without sticking my head in the sand and pretending that none of the billions of people effected by these things exist. And frankly, I'd rather die than take that path. It's at the point where I've begun to resent humanity for all of this, for the pointless suffering we cause on a massive scale every day, and the way we hide it from ourselves so we can feel ok with our own complacency. How am I supposed to believe in any sort of positive view of our species when we've built an entire world where everything is subordinate to the exchange of little pieces of paper? I don't believe the average person is evil, the exact opposite really; as a species we're prone to cooperation and selfless behavior towards each other even at our own detriment. But we've built up a system, which is now nearly unanimous worldwide, where that cooperative impulse is suppressed in order for the extraction of wealth to continue as efficiently as possible. \n\nTruthfully, I'm scared of death. The idea of ceasing to exist terrifies me. And I can't kill myself, because it would emotionally destroy my family, especially my mother, probably for the rest of her life, and no matter how misanthropic I've become I'm unable to do that to her in good conscience. She doesn't deserve it, none of my family members do. But I'm completely dysfunctional, and I have no idea how to go about managing any of this, nor am I willing to give up and resign myself to a life of being cared for by other people, never making my own connections or finding any real joy besides the temporary dopamine hit of eating a bag of chips or sleeping in past noon. One way or another, I'm stuck here until my parents pass away, but honestly, I wish that I wasn't. I wouldn't mind hearing people's responses on all this, but more than anything I've written this whole thing down just to have a record of my own thoughts. I'm bad at articulating my own mental state a lot of the time, so it helps to have a broad overview of things written down.\n\nIf anyone's reading this, I hope you are able to find joy and peace in your world, and make some sort of positive difference in things, even a small one. Lord knows there are many people out there who are stronger than me, and can push through and believe in an attainable, positive future even given the amount of shit we have to wade through day to day, and most of the good things in the world flourish because of people like that. Chances are some of the fellow posters here fit into that group. I respect yall, and I'm rooting for you. I hold out hope that I'll join you someday. But it's been a while since I believed in that possibility.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mq91wl/a_summary_on_how_i_got_here/", "title": "A Summary on How I Got Here", "social_network": "reddit", "user": "tribe98reloaded", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1618340453, "permalink": "/r/SuicideWatch/comments/mq91wl/a_summary_on_how_i_got_here/", "nsfw": false, "first_save": 1635427140.5970504, "replies_charged": false}