{"id": "t5_2qpzs_t3_q62eze", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "I was gonna write about his story, but halfway through i realized what you guys would say about him, so I'm just gonna get straight to the fucking point:\n\nIf you manage to drive my dad to suicide, i will burn myself with gasoline in public. You know, Tibetan monk style. I will show you all what you have done to me, as well as him. Two absolutely pure-hearted men, that just can't accept the way you guys treat this earth, or each other. I had a complete breakdown today, and wrote a note of shit on my country's subreddit. It's because i hate this country, we claim to be the best country in the world, with \"free healthcare\" and hurrrburderhp. But if it's so fucking free, then tell me why we can't get help. Tell my why i was put into the psych ward TWICE this summer, only to be thrown back out within three days. I said i was scared that i would hurt myself, or you. And they didn't fucking care.\n\nYou might notice i am talking to all of you as one. You might think \"well that's unfair, I haven't done anything\". YET. Had our paths crossed before now, under different circumstances, you would've said just as bad shit as the rest of you. I fucking know you would, because everyone treads on us until they see how bad it really is. THEN they start to care. Fuck you all, be better. If you drive my dad to suicide with this shitty fucking behavior, i will burn myself with gasoline in front of the state buildings. I will shout a final fuck you, as i burn with my middle fingers pointing out to ALL OF YOU. And i don't want ANYONE to feel innocent. You could've ALL BEEN FUCKING BETTER.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q62eze/if_you_take_my_dad_you_will_all_see_me_burn/", "title": "If you take my dad, you will all see me burn.", "social_network": "reddit", "user": "andr813c", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1633977221, "permalink": "/r/SuicideWatch/comments/q62eze/if_you_take_my_dad_you_will_all_see_me_burn/", "nsfw": false, "first_save": 1635425274.9947639, "replies_charged": false}