{"id": "t5_2qpzs_t3_60c2dx", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "I'm sorry if this falls under 'pro-suicide post'. I tried not to. I know that these thoughts are bad but I can't come up with counterarguments to truly convince me they are.\n\n1. To me, suicide and self-harm require courage. I'm weak and a coward for being unable to face the prospect of physical pain, and I envy the strength of will of others who are able to.\n\n2. Suicide is a way for me to end my own pain at the cost of those around me, but that cost is short-term. I take a far greater toll on my friends by continuing to exist and constantly produce negative emotions. I'm the hospice patient waiting to die, and it ought to be a relief for everyone when I do.\n\n3. Ex-boyfriends, when breaking up with me, have told me I'm strong and can \"get through this\". It actually angers me. Like they're calling my bluff, daring me to kill myself and knowing I'm too much of a coward to do so. And they get to leave me without the weight of my sadness on their souls, and when I, at least as I have in the past, continue to be alive, they can pat themselves on the back for having the strength to leave me. They get away cleanly and without guilt because I did not die. I hate this.\n\nI'm afraid to tell anyone about this because I'm afraid of being sent to a mental hospital. From what I know about the psychiatric inpatient process, it seems like it would do a person like me far more harm than good. I take a daily antidepressant but have not spoken to a therapist for nearly a year (for various reasons).", "url": "https://www.reddit.com/r/SuicideWatch/comments/60c2dx/i_have_a_lot_of_unhealthy_thoughts_about/", "title": "I have a lot of unhealthy thoughts about self-destructive behaviors and I don't know how to stop thinking these thoughts.", "social_network": "reddit", "user": "UCghoststories", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1489953846, "permalink": "/r/SuicideWatch/comments/60c2dx/i_have_a_lot_of_unhealthy_thoughts_about/", "nsfw": false, "first_save": 1635422561.124616, "replies_charged": false}