{"id": "t5_2qpzs_t3_fa6lg6", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "So around 2 years ago, my oldest brother tried to overdose due to having untreated depression for 1-2 years, (as well as ADHD which might’ve partially caused the depression, idk don’t quote me on that I don’t know things). Thankfully, he had second thoughts and called 911 and he’s still here today. However I still think about that sometimes. I know I would be absolutely devastated if he succeeded, as I look up to him, however, he fell back into depression about 5 months ago, despite seeing a therapist and being on a medication for his depression, anxiety, and ADHD. And I’ve wondered if he’s hoped his attempt was successful. Though I honestly don’t blame him, despite being in a loving household, a nice house, and having plenty of food, he was still depressed. And I feel the exact same way, but the only difference is no one in my life knows about my depression. \n\nI think about his suicide attempt almost every day. Because maybe it wasn’t such a bad idea. Just when he thought he was getting better, he started having panic and anxiety attacks again, as well as feeling real depressed. So honestly, what’s the point? I feel like shit now, but if I go get help, I’ll probably just go back to feeling like shit, except x5. I’m stuck in a weird limbo. I don’t have a reason to live, I don’t have a reason to kill myself. I’m think about writing a suicide note, I’m too much of a pussy to kill myself. I want to stay in bed and sleep until I never wake up, I want to go to school and actually get an education. I want to be a normal person, I get an freeze up the moment a teacher calls on me. I want my friends to find out about my depression so I can at least talk to them about it, I push them away then get a panic attack when they start to even slightly figure it out. I fucking hate this. I wish I could just be one or the other and stop being so damn indecisive. I either kill myself or I don’t.  There’s no fucking in between.", "url": "https://www.reddit.com/r/SuicideWatch/comments/fa6lg6/not_a_bad_idea/", "title": "Not a bad idea", "social_network": "reddit", "user": "chroms-leather-belt", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1582777789, "permalink": "/r/SuicideWatch/comments/fa6lg6/not_a_bad_idea/", "nsfw": false, "first_save": 1635426678.3713555, "replies_charged": false}