{"id": "t5_2qpzs_t3_nzfwyw", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I’ve felt this way for 15yrs now I’m 38. It’s hard to keep swimming,I’ve always been barely just able to keep my head above water. I was born into a violent, sexually and mentally abusive family. Everything I have ever loved has been taken from me continuously throughout my life. If I find something that makes me happy or finally feel comfortable somewhere something happens that makes it impossible to continue or I lose a person or pet to death or my living situation changes and I have to leave it behind. I own  a car, a tv and PlayStation 4. I’ve worked hard my entire life. I don’t let myself get attached to anybody or anything. I merely exist at best and struggle to survive most of the time. I have a shrink  I have been to counseling but it never helped because I had to lie to protect my parents and brother from going to prison. In the last 8yrs all have passed so I can talk about it now, I haven’t taken the step to restart counseling yet because I have to move again, of course. I’m on kpin,duloxetine,mirtazapine and he recently added a new med but I can’t remember the name. They help manage symptoms now but my condition is worsening at an alarming rate. I’m the lowest and closest I’ve ever been. I held onto the hope that someday it would change, all the suffering would end because of my hard work. I started losing hope about 15yrs ago and now it’s completely gone. I am truly hopeless,everything logical in me tells that based on the past I should give up. Honestly at this point I don’t know why I haven’t. The urge hits me so hard now that I’m glad I don’t own a fire arm or I may be dead already. I came close to sticking a very large knife through my throat about 4 months ago.All the pain swelled and reality once again set in that breathing one more breath was pointless,I had cut some tape with it earlier in the day and had left it on my night stand. I just grabbed it rather emotionless and thrust it so hard at my self I knew it was going to sever both jugular veins I knew I was going to be dead in maybe a minute and I was so happy. The best feeling I have felt in my whole lifetime pain was over. I can’t explain why but I couldn’t force the knife to even touch my skin even though all this happened in an instant, it was like a mental block but from where I don’t know. Every fiber of my being wanted (In some way needed)it so badly. I’ve been very scared since that happened because of the happiness I felt,It was bliss. I feel like I crossed a line, I got that taste of happiness and peace and even when I’m not all that depressed I want that feeling again and I want it to last for ever or as long as my forever lasts as my neurons stop firing. This isn’t a cry for help,a threat or a fishing trip for sympathy or support. I’m just putting my feelings into writing and I really don’t know why.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nzfwyw/everything_seems_pointless/", "title": "Everything seems pointless", "social_network": "reddit", "user": "Rocon508", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1623649938, "permalink": "/r/SuicideWatch/comments/nzfwyw/everything_seems_pointless/", "nsfw": false, "first_save": 1635422300.2948241, "replies_charged": false}