{"id": "t5_2qpzs_t3_ly0k0w", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "First, please don't reply and say shit like \"move on, find someone else\" etc. I hope you can understand I DO NOT WANT TO, and these words only serve to trigger me. So please don't say that.\n\nNow you. Well, I begged you not to cut me from your life. Begged. Asked you to have a bit of heart as I was in a dark/fragile place and couldn't take it right now. All went on deaf ears. You just wanted to cut me out, and you would do it no matter what.  I know you know what it feels like to be unwanted by someone you love. We could have worked something out. You could have given a shit and said, let's talk about this later, or as a human, showed basic compassion. You promised me you'd never hurt me. But no. Okay, you threw me out like a piece of trash after 2 yrs and 5 days. I asked you to tell me what I did to deserve this. You then told me I was really good to you. I asked you to come see me and talk to me F2F, I at least deserve this. You declined.\n\nI can't sleep from this hurt and pain. I only know one way to end my suffering. Twice, I failed to succeed. Last time was an almost, but hanging makes one stupid and I didn't know what was going on/what happened. Maybe I need some alcoholic courage first, maybe that will make me less likely to \"come to\" all confused. Maybe I can drink a shit ton and put the noose behind my headboard to anchor it, and I will \"sleep\" through it. I have never been really drunk before, only tipsy. But I now realize I have to keep trying. I cannot live like this when every moment hurts.\n\nEveryone, please be kind to those who love you. You never know whose fragile heart simply cannot take the pain. And you, I realize this is my fault for not being able to take it/caring too much. But, you really could have had a heart towards a person that, all they did was love you and want to be good to you.  It's over now, no need to keep discussing, now I don't even want you to come to me but I just wanted you to know, you can't do this to innocent people. Things have a way of coming full circle. I even apologized for everything, although it wasn't my fault, I was willing to let you blame me if you needed a person to blame. Thank you for reading this.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ly0k0w/they_say_the_3rd_times_a_charm/", "title": "They say the 3rd time's a charm.", "social_network": "reddit", "user": "PlatypusInnamorata", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1614907146, "permalink": "/r/SuicideWatch/comments/ly0k0w/they_say_the_3rd_times_a_charm/", "nsfw": false, "first_save": 1635423060.1285098, "replies_charged": false}