{"id": "t5_2qpzs_t3_qc4fub", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8", "4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I'm so desperate again today. Nothing really has been right since I dropped out of uni at 19. I'm 33 now. Back then I kept thinking if I went to uni, even though all the evidence pointed to the contrary, that maybe just maybe I would be able to achieve like everyone else and be and feel worth something. But I couldn't cope and I dropped out. I've never studied anything that has lead to a qualification since then. I've just floated along, sometimes suffering from clinical depression, other times being in a slightly better place. I now work as a makeup artist and hair stylist for weddings. I find it incredibly stressful and don't believe I'm good enough to do it but I continue to do it nonetheless because my husband books in the jobs and I can't get out of them. It's a lot of pressure and I'm confused and disorganised on weddings and on the prep days because of my low mood and anxiety. I talk to my husband but how I feel clearly distresses him, especially when I mention anything to do with suicidality. \n\nI've started to spend more time volunteering this year but I still feel like a failure. I find it difficult to follow anything anyone says when I'm volunteering or connect with anyone. When anyone talks about their lives to me I just feel insanely jealous and shut down. \n\nI don't have the big career I think I need to be a success and despite my best efforts I still have suicidal thoughts every day and am plagued by fear, regret, intrusive thoughts, shame, anger, sadness and every other difficult emotion you can name. \n\nI have wasted hours every day researching ways to end my life. In the end I decided I was too ill equipped to carry off anything other than jumping from a very high place. During my last depression I tried other methods but didn't even come close to succeeding so travelling to some cliffs and jumping seems like the only option for me. \n\nIt's my husband's birthday this Sunday so I have to get through this week, I know that, but after that maybe I'll be able to pluck up the courage to end my life?", "url": "https://www.reddit.com/r/SuicideWatch/comments/qc4fub/death_is_the_only_way_out_for_me/", "title": "Death is the only way out for me", "social_network": "reddit", "user": "Responsible-Ad-6105", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1634746335, "permalink": "/r/SuicideWatch/comments/qc4fub/death_is_the_only_way_out_for_me/", "nsfw": false, "first_save": 1635426847.126127, "replies_charged": false}