{"id": "t5_2qpzs_t3_agtgz9", "request": ["9cb7ef4e-af9d-4403-b84a-be5dd3f5e75c", "e79a79ca-6f5c-44ca-b1e4-309a4afa83c2"], "text": "Throwaway, I do not want this being on my main account for various reasons.\n\nI'm not very sure where I'm going with this or what I'm aiming for exactly, but I am very slowly moving myself back into a way of thinking that I don't like and I need advice.  \nI'm a 20 year old male, if that at all affects your advice / opinion.\n\nI don't know where to go with this, I don't have anyone in person that I can actually talk to and I don't want to burden anyone I know with my thoughts and feelings that I don't believe can be helped.\n\nI don't even know where to start so I'll just explain my situation as best as I can and see where I go from there.\n\nFor the past 3 or 4 years, possibly longer, I have dealt with suicidal thoughts, sometimes they're my own thoughts and other times it feels as though I'm being forced down a train of thought unwillingly, either way it ends up in the same idea. I don't take these thoughts lightly, I know how serious this is.\n\nHowever, I managed to get myself away from actively thinking about suicide, I don't know how, I wish I did. However over the past few days, I'm having the thoughts again. \n\nFor the past few months, I have been doing nothing with my life, absolutely nothing, I would describe myself as a waste of space and oxygen honestly and this is also the way I've been described by family members, not as bluntly of course but more or less the same message. \n\nSo, I decided to give up doing nothing and try doing something with my life, and found a course to help me find employment or something so that I'm not just wasting people's money and effort. But, the closer I get to actually starting this, the worse I feel. I don't know how to describe what I'm feeling, but it leaves me physically and mentally uncomfortable. \n\nI don't want to be a burden and I don't want to be a waste of space, I really don't, but for whatever stupid reason, taking responsibility and doing something with my life is worrying me somehow and I don't know why or what to do.\n\nI'm beginning to feel like my best option is just to not be in the way anymore and it's terrifying me. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/agtgz9/i_need_advice_help_with_life/", "title": "I need advice / help with life", "social_network": "reddit", "user": "Scared_Of_Life_TA", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1547695129, "permalink": "/r/SuicideWatch/comments/agtgz9/i_need_advice_help_with_life/", "nsfw": false, "first_save": 1635425161.6630394, "replies_charged": false}