{"id": "t5_2qpzs_t3_6bbit6", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "So a month ago, My friend and I were talking about sexual exploration as kids and she brought up this memory of how this older cousin had touched her once and how traumatized she was by it. She felt lonely and isolated and she never spoke of it for 12 years.  She was around 11 at the time when this happened. This triggered the memory I had about my cousin that now is overwhelming me. I remember how I had a younger cousin who was 2 years old and (i was 14 at the time) I was potty training him and I took him to the bathroom once and I pulled down my pants and asked him to touch and kiss my penis. And he did. And that was that. It lasted 40 seconds tops. Never happened again. I think I was sexually curious. This memory has been replaying in my head constantly since I remembered it and now I can't let it out of my head. I haven't talked to my little cousin for over 8 years but I know he is doing fine and prbbly doesn't even remember it. But I feel super guilty. I know I can't bring it up to him because it'll be weird and I don't want it to come out to the family either. It'll destroy everyone. I feel trapped. \n\nI am now 25 and my cousin is 13. I know this is a very sensitive topic and I have been trying to process it. I have been having extreme anxiety and this is an obsession in my mind. I can't focus at work I can't focus in social life I just can't take it anymore. I am having thoughts of suicide and extreme remorse and self hate. I feel like my life is completely destroyed. I am worried about how this has/will affect my cousin. What if that comes out in the public? What if this destroys my life? No one will want to date me or marry me. On top of that I think I am a disgusting human being. A monster preferred monster.  I wanted to have a family and kids and now I won't be able to have those either. I feel extremely guilty I can't even go to my cousin and make amends as he might not even remember it and I don't want this to blow up in our families.  \n\nBackground about me:\n\nI was born in Pakistan and brought to the states when I was around 11. I didn't know English and I ended up failing fourth grade I come from an emotionally abusive family. I remember my father beating me when I was growing up. He would sleep with me at night in his underwear. we would cuddle up extremely tight while my sister and mom slept in the other room (my parents have never slept in the same bed ever and I would share beds with either one of them) I remember he asked me once to sleep in my underwear too and I said no (I look back at it and I actually liked this contact because this was the only way I could get close to my dad plus I am gay so it was a huge turn on). He also looked at me in the shower once and smiled at me. I know he was a father who cared about my education but at the same time he would abandon us and abuse my mom and us (physically and mentally). I remember I started watching jerry springer at the age of 11 everyday and had access to porn at age of 13. I was extremely responsible growing up even though I failed 4th grade. After that my dad started beating me and making me study hard everyday and I become studious and well mannered. I never really had parents that would guide me through out my childhood. Never had the sex talk never had a compassionate parent figure. I also remember I would pee in bed up until the age of 11 and my sister was in diapers until she was 7 years old. My mom has always been depressed as far back as I can remember and my dad is a narcissist. \n\nSexual exploration was a big part of my child hood. Ever since I had access to porn and Jerry springer. I always knew that rape is terrible and believe that rapist should be put in jail/given the death penalty depending on the severity. Basically my point is I was sexually very adventurous  but I knew not to hurt anyone emotionally or physically. Growing up I never really had any friends except for my sister and my cousins. I would always hang out with adults and uncles and aunts and fit in well with them. I am not sexually attracted to kids. Never have been never will be. And growing up in the family I did I always supported and still do support women's rights (as my mom suffers under my dad's oppression) \n\nI also remember growing up my mom would always scratch her privates in bed and I would share the bed with her because my dad would sleep separately. Basically my point being there were a lot of boundary violations. my sister and I would also take showers together up until I was 11 yo and she was 7yo. My dad would walk around the house in his underwear (I would actually jerk off to his dirty underwear). I would also fantasize about having sex with him and my uncle. I was very sexually compulsive. \n\nI have a great job and had a great future ahead of me. But now I have become severely depressed and anxious and think I have no point in living. I am a monster and I can't tell this secret to anyone. I don't want people to think I am a pedophile or I can't be around kids for something I did 15 years ago. It never bothered me up until now. I think the reason it also came up is because I have been exploring my past a lot more since I have been living with complex ptsd and I am thinking of transitioning (I think I might be trans). I was getting better and feeling better as I was going to support groups and such but now this memory has come up and i feel like there is no point to life. Please tell me how to proceed. I just started antidepressants as I couldn't handle the anxiety and will be starting therapy next week. \n\n\nSorry if my post is everywhere. I am anxious and can't think straight right now.\n\n--- \n", "url": "https://www.reddit.com/r/SuicideWatch/comments/6bbit6/taboo_sexual_stuff_i_did_and_shame/", "title": "Taboo Sexual stuff I did and shame", "social_network": "reddit", "user": "forgiveme11", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1494866792, "permalink": "/r/SuicideWatch/comments/6bbit6/taboo_sexual_stuff_i_did_and_shame/", "nsfw": false, "first_save": 1635428450.2700036, "replies_charged": false}