{"id": "t5_2qpzs_t3_q4h86j", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "Born and raised in Asia. It's a stereotype thing that parents usually compare their children to other children of other families and also wants their child to work as one of the medical occupations (mostly doctor, dentists, nurse, pharmacist).\n\n\n\nMy parents are dentists. They have their own dental clinic and also work at hospitals as dentists too, hoping that one day I will carry on the business of the family.\n\n\n\nThe thing is, that isn't who I am at all. At first I told them I wanna be something else like idk just an accountant or even labor will do just fine for me. I'm not a picky guy I just want to live to see another day. I don't need anything, if I get sick and that's lethal it's ok because one day we are going to die anyway.\n\n\n\nAnd the thing is they don't listen. They just insist me to study into this fucking dentist shit and I'm not even good at it.\nI failed to get into public university but manage to get into the private university which cost about 16,500$ per semester.\nI had to study for 6 years which cost about 198,000$. I don't want them to waste this much money on me.\n\n\n\nI'm already in 2nd years and I don't even know what the fuck I am doing. What the fuck is inclined plane? And why am I studying about the fucking Latissimus Dorsi muscle? Why do I have to know about the fucking Pseudo-stratified ciliated columnar epithelium. This isn't for me at all.\n\n\n\nWhy do I have to live my life as the second coming of my fucking parents?\nAnd now when I wanna quit they ask me \"what do you want to be other than dentist then\"? What? What the fuck I already told you like ten years ago and now that I am failing you let me choose? Why didn't you let me do that 2 or 3 years ago?\n\n\n\nWe're fighting now and I just want to end it all here. I can't bear it anymore. I just wish I had the gut to do it and if ghost were real I will be laughing my ass off at them everyday. \n\n\n\nI know I said one day we will die but I'm still scare about suiciding. What if I didn't die and have to live my whole life as a disabled person. But at the same time I just want this to end.\n\n\n\n\nPlease help me. What should I do? I have my Clorox right here. And the pistol in my dad's safe.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q4h86j/i_just_wish_i_had_the_gut_to_do_it/", "title": "I just wish I had the gut to do it", "social_network": "reddit", "user": "reddituser36061", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1633768351, "permalink": "/r/SuicideWatch/comments/q4h86j/i_just_wish_i_had_the_gut_to_do_it/", "nsfw": false, "first_save": 1635427414.3056233, "replies_charged": false}