{"id": "t5_2qpzs_t3_q5sspf", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "This has happened around 3 times before but not in the way I’m saying it right now. This is the worst thing she has ever done to me in my opinion.\n\nIt started at around 12:30am when my mom told me to go to sleep, I was in the middle of playing Call Of Duty: Cold War and so I finished the match, then turned off he tv and went to bed. My mom texted me 15 minutes later saying “I told you to go to sleep” and she called me. Which woke me up. She said that she could hear me talking in my living room, which I know I wasn’t because I was in bed and I kept on trying to tell her I was in my bed trying to sleep. She forces me to move all of my electronics upstairs and starts to yell at me.\n\nShe goes on about me trying to make her look retarded and I was calling her stupid, which I never had the intention to make her look like that. All I was trying to do was tell her I was in my bed trying to sleep when she called me. Then she changed her story from her saying I was playing games in my living room to me being on my phone in my room. I asked her “how would you even know that” and all she could say was “I shouldn’t be responding to a call that fast” I was really confused and mad because I knew I was right about what I was saying and she didn’t believe me. I went downstairs and punched my door out of anger and she heard it.\n\nShe came downstairs and started to yell at me. She said that I should be acting like the boss of everything until I got a job (keep in mind I’m 14) and I shouldn’t know what stress feels like. At this moment I was angry to the point where I started to have a panic attack. I fall to the floor and can barely breathe and I’m begging for her to help me. I tell her that I can’t breathe and she started to laugh at me and said “You are fucked up in the head to think I will help you.” I kept on asking for her to help me and she kept on laughing at me. \n\nAt this point I’ve given up and tried to ask her to leave politely and she said “it’s my house, I can be wherever the fuck I want to be.” And then said “I can’t believe this is what god gave me, you’re something special.” \n\nI’m crying on the floor while she’s still laughing at me saying I’m faking it for attention. This isn’t the first time this has happened to me. After she decided to leave she took and hid all of my chargers and my phone, all I hav is a hidden tablet right now and once it dies I can’t talk to anyone anymore. I am going to school on Tuesday and I am going to report her to cps. I do have a place to stay at if they take me away from my mom.\n\nI really wished I would never had to say this, but. My mom is a emotional abuser. She’s done this to me multiple times and expresses the fact that she doesn’t even want me. In public she will tell random people she knows that I’m being set up for adoption and it makes everyone around her uncomfortable, because she makes it seem like a harmless joke.\n\nIf anything else happens, I will keep you guys updated.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q5sspf/i_have_an_emotionally_abusive_mother/", "title": "I have An Emotionally abusive mother", "social_network": "reddit", "user": "JustOrganization3809", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 109, "down_vote": 0, "creation": 1633947571, "permalink": "/r/SuicideWatch/comments/q5sspf/i_have_an_emotionally_abusive_mother/", "nsfw": true, "first_save": 1635426829.0783997, "replies_charged": false}