{"id": "t5_2qpzs_t3_hpr70c", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "Hello.  \n...so, first thing first, I guess I should mention that my girlfriend knows about my suicidal ideation, is physically with me and will stay around me until I get home. So. I don't think I'll be able to commit suicide today. If there are posts more urgent, address those before mine.  \n\n\nThat said...  \nIt feels like there is no option for me not to suffer. Only death.  \nFor context, I have been depressive for at least three years (maybe four, because I really wasn't well before). I think I have some form of trauma due to having been bullied every year since fourth grade, after I skipped a grade. I have anxiety as well, and it feels like everything that can go wrong, will go wrong.  \nIt is very difficult for me to derive any joy from most activities nowadays. And if I \"fail\" at anything, I spiral down into suicidal ideation, parasitic thoughts that ring like I should kill myself because I am worthless and can't do a damn thing. This includes meditating (which I have been taught to use in case I feel anxious or depressed) as well as sports (not doing a push-up right), singing (which I haven't been able to do ever since puberty), drawing, painting and more. This has desincentivised me from doing anything I used to like.  \n\n\nI have seen many psychiatrists and psychologists to no avail. I am currently under venlafaxine, but I'm not sure how much it helps -- have been for two years -- and I only know that if I forget a dose, I'll feel very unwell. My dosage can't be upped anymore. I'm also at a point where I can't really talk to any professional without spiraling down because it forces me to see everything that's wrong with my life, for no solution. My current psychiatrist doesn't think I am depressive, just that I react poorly to my environment. I don't know how much I can trust him. I just know I want to die because I don't feel like there is any other solution.  \nSuicide hotlines are a mess. I'm in France, and SOS Amitiés has done nothing but fail me. I've been in contact with listeners thrice, and have been faced with a transphobe, someone who gave me the \"think of everyone you'll hurt\" talk, and someone who clearly didn't care and would only respond out of courtesy.  \nUrgencies are even worse. I've been interned once. They took away my hormones and meds. My psychiatrist was more preoccupied with me being trans than with me being suicidal, and explictly told me that it was as irrational for me to say \"I am a woman\" as it was to say \"I want to die\". I don't ever want to go back there.  \nPrivate clinics are okay, but too expensive for my family. We're poor and can't afford that for long enough for me to recover.\n\nI have talked about my suicidal ideation to my family and friends over the course of the years, and no one knew how to react to that. Most of them even harmed me with their answers :  \n\\- My mother talked about how I wouldn't commit suicide because I am a taurus and have thus life within me. When I called her out on that, she complained that no one knew how to respond to suicidal persons.  \n\\- My father told me that he would kill himself if I commited suicide and that surely I didn't want to harm the family.  \n\\- My brother doesn't know what to do anymore. Once, after I told him I had phoned the suicide hotline, he just treated my suicidal ideations as he treated the melancholy of one of his friends : by buying soda and taking me to a river (in which I contemplated drowning more than once). When I cried and told him how much I was hurting inside, he realised he had severely underestimated the situation and told me he didn't know what to do.  \n\\- My girlfriend once told me in January that she'd help me die if I really wanted to go, during a night when I was severely suicidal. I explained how wrong that was some weeks ago and she apologised. She only knows that she shouldn't leave me alone. She hugs me and tells me she loves me, but... most of the time, this leaves me feeling dead and hollow. This doesn't help me feel better.  \n\\- My ex (in a LDR) knew how to respond at first, but, after some months, she just gave up on this and told me she had no way to prevent me from doing it. Since then, I've felt like anyone who helps me will just give up on me when they see I can't get better. They expect me to recover and won't accept that I can't.  \n\\- As far as friends go, M, a FwB, laughed at the idea that there'd be a funeral march for me like there has been for other trans women who commited suicide. They told me that they realised they made a mistake, but, yesterday, when they reached me after seeing I wasn't well, they basically told me that I had four solutions: \"Wait for it to go, Go to urgencies so I can continue to fight and live, Go to Belgium so I can die with dignity, Kill myself uglily\". I blocked them and they texted me that I did that because they were taking seriously my desire to die and urged me to go to the hospital, forgetting all I told them about being traumatised about psychiatric wards.  \n\\- C (who is depressive and has been suicidal) was understanding, but in the end, she told me that I wouldn't get better if I gave up at the slightest hurdle when I told her it felt like there wasn't any solution. It felt like she was blaming me when I've done nothing but try to hang on.  \n\\- There is more, but nothing as egregiously bad. Just confused people who don't know how to react and expect me to educate them on what to do when I don't have the energy.\n\nWhen I talked to someone on a Discord about suicide, they told me the price for acquiring a way to die. It was really expensive and threw me off. I reported her to the mods, and blocked her since.\n\nI guess I can always talk to old friends who weren't too terrible and near strangers in Discord chats. But the point is, there is no one left in my life whom I can really trust to know how to help me. People on the internet won't always respond. My girlfriend is depressive too and doesn't really know how to help. I have no IRL friend left at all (apart from C), only acquaintances. Hotlines are garbage. I can't trust the hospital. Psychiatrists and psychologists are not able to help. I can't do anything I used to enjoy anymore.\n\nI can only rely on the fact that I constantly failed to commit suicide in the past (two attempts I stopped before I went through). When I try to harm myself or to die, some part of my brain blocks me. I can't cut properly. And I'm afraid that one day, I'll just short-circuit this failsafe by finding a desinhibitor so I can go through with the act.\n\nWhat scares me is that I just want to die whenever something brings me down and I don't feel well. Also, the fact that the few times I planned a way to die and set up a date, I was very much at peace and happy, which encourages me to do it again. Because then, it feels like there is no problem anymore. Things suck in the world. I won't ever be happy. But it doesn't matter, because I'll finally have peace. I don't even want happiness anymore, I want a way to cut off the pain. And being dead would do just that. (I didn't commit suicide then because I give myself three days before I go through, and usually, something makes me want to hang on for a little longer, until the next crisis).\n\n&#x200B;\n\n&#x200B;\n\nI don't know what to do anymore. I'm lost, scared, and hurt. I want a solution. And I can't find any.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hpr70c/i_cant_find_any_solution_anymore/", "title": "I can't find any solution anymore.", "social_network": "reddit", "user": "Tsiluciole", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1594543310, "permalink": "/r/SuicideWatch/comments/hpr70c/i_cant_find_any_solution_anymore/", "nsfw": false, "first_save": 1635427528.1124275, "replies_charged": false}