{"id": "t5_2qpzs_t3_81rj3t", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "What I mean by mindfully suicidal is someone who’s been contemplating suicide over an extended period of time, not just a spontaneous urge that subsides after that episode.\n\nI’m feeling pretty fucking hopeless about my future after having tried and failed for so many years. There’s really no more ways to improve my chances for anything because I’ve tried everything I realistically can and it still wasn’t enough.\n\nI’ve had suicidal thoughts for almost a decade and couldn’t talk to anyone about it because one wrong move and it will literally get me locked up somewhere and leave a permanent record to ensure that my already lost cause has no chance of redemption. Not to mention the amount of time and money that will be wasted.\n\nI also don’t think that there is a universal, logical argument to support an inherent value to life, or why one should live. Yes, people can “make the best of the present,” but why should one choose that over just quitting life? We all know that “it gets better, you have so much to live for, and think of the pain you’ll cause to others” is also just emotional bullshit that holds no real weight to people who don’t care about emotional talks and want logical reasons to keep on living. Maybe it works for people who are having an isolated, spontaneous desire to die, but not for someone like myself, who’s been thinking about suicide for almost a decade and definitely wanting to die for the last 5 years.\n\nThe thing is, I would love to talk to a professional just to see how different they would be compared to shitty internet lists with “people are having sex right now and all you can think of is suicide? Come on!” as one of their 50 reasons against suicide. Surely they’ve dealt with people who want an objective reason to not kill oneself; have they given any thought into this argument? But guess what, they’re expensive and they can call 911 against me any time they feel like I’m going to do something whether that’s true or not. There won’t be any candid conversation with that kind of pressure, and there won’t be real help (if it even exists) without a real conversation.\n\nI think the ability to call 911 for a forced admission pretty much kills all chances for meaningful help for people like me.\n\nOh also, I don’t want to “talk about” my life and don’t care if you’re “here” for me, so please save those comments to yourself. Downvote me all you want if that hurts your messiah ego.", "url": "https://www.reddit.com/r/SuicideWatch/comments/81rj3t/any_suicide_prevention_for_the_mindfully_suicidal/", "title": "Any suicide prevention for the “mindfully suicidal” is bullshit as long as forced admission to behavioral health is a thing", "social_network": "reddit", "user": "throwaway_tooclose", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 18, "down_vote": 0, "creation": 1520098048, "permalink": "/r/SuicideWatch/comments/81rj3t/any_suicide_prevention_for_the_mindfully_suicidal/", "nsfw": false, "first_save": 1635425270.5266087, "replies_charged": false}