{"id": "t5_2qpzs_t3_b0jl7q", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I Hate Myself\nI am only a human with human feelings. A human who had been their innocence taken from the 4yrs after they opened their eyes to this world. Being told that I was in trouble. That I was a bad kid and I deserved this. \nNot a single 'living soul' knew what was happening to this child. She never spoke about it because she believed whole heartedly that she had some something wrong to make this happen. Maybe it was that one time she dropped her plate? Or maybe the time she couldn't make it to the bathroom in time?\nShe hated herself because what ever she did to deserve this it must have been pretty bad for it to last years.\nThis dying soul... Is me.\nHello, My name is \"Slut\" Let give you an idea of how my family lived. My mother who was a single parent lived with her mother and father along with other siblings in a huge house on a reservation. My biological Father was living his own life for reasons I'd rather keep as it is, a mystery. As he passed away over 10yrs ago. At first I never knew my father until my mom introduced me to Darcy(rn). Say that this man is my father. As a loving a caring happy go lucky child I took it as is and accepted him as my father. A few months later he would have his first solo visit. Worst mistake. I'm told by Darcy that one night while all three of us slept, says that I grabbed him during the night. And before you ask I was 4yrs old and slept with my mother in her room as I didn't have one. And Darcy well you can guess let rest. So, being I never gotten into any real trouble before then I felt I had to accept my mistake and face the consequences as my mother and mushum(grandfather) had taught me. It led my me to jacking off a man I thought was my father. That was the first instance. Now let's explain this piece of shits family. His mother, Let's call her Grump. His father, Let's call him Rich. His Niece, Let's call her Cuntmaster 5000. Just kidding. Cunt. Grump hated me the first moment she saw me. Whereas she would treat Cunt like a queen and get her whatever she asked for. Cunt was the prime example of a spoiled brat. Rich? Well Rich isn't important to the story. \nMoving on. Like I said grump hated me since the start and I had been forced to befriend Cunt. I was treated like a problem child like I was the spoiled brat which encouraged me to feel more self hatred cause what did I do to make her hate me so much. I was only 5 at the time. I thought I would get the same \"consequences\" from her. Obviously not.\nSo let put all that in to a span of 10 years. Being molested by a man I thought was my father in various different locations. Home, workplace, friends home, rented home/apartment. I remember one instance when I was 8. He was naked pressed against me in bed when Grump walked in asking Darcy if he was going to take Cunt to hockey practice. I should have just jumped, screamed, or something right then and there. I fucking hate myself for not. Great more self hate to pile on my sea of self-loathing. I suppose the only reason I didn't was cause I knew Grump hated me. Why reside in her? She never gave me any reason to. \nI was 12 when Darcy got his first fiancé. I thought I would stop now. It didn't he would just do it when she wasn't around. It's funny too when I think about too. At this point the only reason I stuck around was cause he would promise to get me things I asked for. Alcohol, Cigarettes, Weed, Minutes for my phone (since I found refuge in the Mocospace forums.) And the reason I think this is funny was cause his fiancé was jealous of me for whatever reason she had. But in the end I was a fucking child prostitute for Darcy. \nNot fast track ahead two years. I was low. In all my years of school I never had any real friends. Only having cousins or just myself to hang out with. Cause for reasons I'll never completely understand everyone in school hated or disliked me. Ah, and then there's the rumors and drama children of today like to indulge themselves in. Just so you all know I've never actually been with anyone outside of the molestation. I felt dirty enough. \nRumors about me sleeping around started to surface. I never did find out who started it but it made me feel 'caught'. Like the secret I had with Darcy was out. That people knew and could only call me slut instead of help. \nNow let's explain the kind of Kid I was. So I was a good kid. I'm not just saying this cause I want you to like me. I'm saying this cause I thought I was a bad kid and had to be a good kid to stop this from happening with anyone else. \nBeing my mom was a single parent and working a full time job in which hours can vary from 8am-8pm or 8pm-8am. Nights and days. So at the early age of 10yrs I had to wake myself up everyday to go to school. Always returns home. Never went to any friends. Now add homework, cleaning and babysitting on top of that. I had to be responsible. I even dropped out of 7th grade to stay home and watch my sister full time. And being I had to friends It all worked perfectly. But yet even my own internal family started calling me a wild child. Saying I would go out to drink and party and do drugs. I only ever did this once. WITH PERMISSION. Everyone would always thought I would be the first out of all my cousins to have a baby underage. Honestly I thought the same thing too especially since I was being molested. So let me say this again. I was a good kid. \nI was 14 when I first attempted suicide. My mother had a boyfriend, let's call him Shame, who had brought me my little sister. He had taken $10 from my mother and asked me to go to my dealers and buy weed. I thought he has asked mom for that $10 so I agreed. One for him. One for me. Win Win. So as I sat in my room drowning in my own self-loathing. My mom calls home and asked if that $10 was still there cause she needed gas. Shame told her that I took it to buy weed. Bastard thought I didn't hear him through the floor. So after finishing my joint I slid my foot stool under the support beam in the basement. (Yes, my room was that of a basement with cement walls and cement flooring with all the woodworking just above my head.) I tied my prized jump rope up and over and tied it as tight as could and proceeded tied the noose around my neck when I hear the door to the basement swing open and heavy foot steps stomp down the stairs at the opposite side of the basement. He stops to take in what he's seeing and then charges me. He lifts me feet from the stool and untied the rope from the beam and throws me on my bed and proceed to yell at me for being so stupid. He then goes upstairs to grab his phone which gave me enough time to reach for a blade I hid in my room and cut myself. He comes back down with the phone ringing and charges me again now completely laying on top of my trying to get the blade from my hand. We both ended up being cut but he was able to get it from me and honestly looked like a murder scene on my bed. There was so much blood. I'm going to skip the details here as it's was just him on the phone with my mother and needless to say they where both frantic. And now I'm sitting in the living room in front Shame and my mother getting the earful of a lifetime. The reason I said that is because that day wasn't just any day. It's would be considered the worst day for a mother to hear her child committed suicide. Yes, it was mother's day. And what happened next I would always hate her for even if things are okay between us now this is something I would never forgive. After an onslaught or why would you do this on mothers day and other points of interest that made me sink even lower in my seemingly endless sea of self-loathing. She sends me to Darcy.\nAlthough, Nothing happened I will always hate her for this.\nWhile driving in silence for about 2 hours he parked the trunk along some random range road. I thought Fuck, HERE WE GO AGAIN!!! He turns to me, almost sad and says. \"I'll stop\" I didn't say anything. In fact I didn't say anything to anyone for the next few days until my mushum tells me exactly what he thinks of me. \nYou're a good kid. You stay home and clean and cook for your mom. Even went so far as to raise your sister for her. But you were made to grow up too fast. You're still young and you need to make mistakes. I Love You, \"Slut\".\nI cried and said thank you. It had taken me a week before I could return to school in a proper state if mind. Darcy would start leaving me peace offerings. Cigarettes here. Weed there. But nothin ever happened. \nHappy story isn't it?\nNo. Now 16, My mother ended up moving me to a small town so I could attend the high school I always wanted to go to. Mom gets a new boyfriend, Let's call him Blame. He would soon be the father of my brother. In this new town I quickly made friends cause no one knew me. Fresh slat. I found myself partying and smoking weed with my new found friends. More often then I'd like to admit. This was when that good kid in me because the bad who just wanted to have fun.\nA year later a counsellor was able to get it out of me. I was beginning to have nightmares. Some were about Darcy. Others were of me dying either by accident suicide or murder. Another about me killing Darcy myself. I would only talk about the nightmares about me but she knew there were other nightmares. One day I slip in a rage and spill the rest of my nightmares to her. So her obvious next questions. Who is he? How is he causing these nightmares for you? What did he do? She got everything you got. Not much to go on now is it?\nObviously she wasn't to tell my mother and said no. How could I tell my mom that the man she had sent me too for years just because she couldn't deal with me had been molesting me? \nI didn't want her to know. So that day I went to my friends again to smoke weed. I started talking about it without giving to much information. Not sure if they actually knew what I was talking about. But I had requested a place to stay that night. My friend, I'll call him Ham, said I could sleep in his camper if I really needed to. I only said that I'll take the offer if it comes down to it and I left. \nI return to the drive that led to my current home and say my mom in her car talking to Blame. I smile and wave and walk faster as the door to the drivers side opens. My mom climbs out with anger on her face. Obviously my smile drops and I stop in my tracks. She found out!\nShe found out and I was going to be beat over it. She didn't say anything as she walked to me. Now that she was within arms length to me she reaches for my hair and pulls my head down. Proceeds to punch and kick me to the ground yelling at me about going to my friends. Ha! I started to laugh as she kicked my ass left right and center. She still didn't know. Now me laughing was only making her more mad so she gives me an ultimatum. Smarten up or leave. \nThis was it. My friend had already offered me his camper for the night and I wasn't gunna stay there while Blame ordered me to clean this and that and call me stupid. I packed up a change of clothes and my school stuff and left. Leaving a note saying, \"Darcy has ben Molesting me since I was 4.\"\nAfter going to Hams and telling him what happened he showed me to the camper and told me what I could use and what not to touch. I was trying my best to be presentable, taking moments when I would choke on words to breath so I could proceed to talk normally. Hams grandmother absolutely loved me so she agreed with little to no hesitation. I stayed in that camper the rest of the evening crying. I work up to the sunlight and immediately jumped from the bed and got my shit together. I didn't have the time so I ran to all the bus stops from closes to furthest and all the kids where gone. I knew I was late. So I walked for almost 4 hours from my town to the town of my school and attended class like everything was normal. Teachers and students only thought I was late for the bus. There was only one friend I would trust. I'll call him Pup. Cause he loved Puppies. I had told him about what happened and asked if I could stay at his home so I could finish the last two days of school and I would go back to my home town and stay with one of the many extended families I had. I didn't just go out their, one cause drama in my family spreads faster then a fire at an oil plant. Two, Cause I would not have been able to come back for the rest of my classes.\nFast track ahead a week. Everyone knows. Everyone's talking. I'm back with my mom and she takes me to the police. I knew nothing was every going to come out if this. Emotional trauma or not. I had no evidence. I had locations but not time. I had homes but no addresses. I could have done the research. Range road 173 house 907340185 in the basement. He put his dick in me for the first time. Obviously not real but not like that information would have done anything. I was only 4 when it started and it happened multiple times in various different locations. I couldn't have remembered who's house he was living in at what time and for how long. I gave my statement and a court day was set. I will skip to that now. There were only two court dates I will speak of the first. \nFirst court date. I get sent to the stand, I notice three familiar faces near the back. Oh look, It's Cunt, Grump and Rich. I won't go into too much details but I was asked to speak about one of the many instances in their house. Yes I said Their. I spoke about the locations around the times I thought it would be trying my best to go from beginning to end but my story had holes and they burrowed into me like a mocking child. One instance when I was 11. Darcy had me on top of him in reverse as he \"ate me out\" trying to get me to suck him off. It smelled so bad and I wasn't afraid to tell him so. You want to know where that happened? Cunt's bed. So while Rich, Grump and Cunt went to dinner (as they liked to exclude me from anything fun or family oriented) He molested me in Cunts bed. Another instance. If you were paying attention this will sound familiar. He had his naked body pressed against me when Grump wanted in and asked Darcy if he was going to take Cunt to hockey practice. At this point in court Cunt has run out of the room in tears. I took gratification from it. Weather she believe it happened or not. It was going to effect her. Good. Consider it payback for all the times you Attacked me, made me starve or told rumors about me. And yet it's still too good for you, Cunt.\nSecond court date. This was the last cause, as I did and knew from the start, his lawyer found holes in my story. Poked and prodded until I exploded and told them that if they really don't believe me then they can lock me up for lying under oath and I left. I didn't care what happened I just didn't want to deal with it anymore. I was already drowning in my self-loathing I don't need some official in a suit telling me I was wrong and I was bad. \nNow that's it. That's all. That's how I grew up. That was my life. \nThe Second court date was around my second year in the new school. I was 17 I was defeated. I started slipping. I started giving up. My grades showed that as well as my actions. I ended up being caught with half an ounce or week and would have faced jail time but since the principle liked me and understood me he only asked that I sign myself out of the school entirely on the spot and no charges would be laid. I agree and my mom came to pick me up. I cried all the way home know what I did was wrong. I knew It was my fault. I did this to myself. A few weeks before my mom got me a job as a child care provider so that day she just dropped me off at work. No time for myself to comprehend what I just did to myself but forced to put on that fake smile and work with kids. just so you know, No I did not have any proper training to be working with kids and was never giving and training to deal with kids. The whole group home was shady even before my mom started working there when I was born. So all in all it was not a good place. Period.\nA few months later. No school, Didn't finish. Working under my mom in an already shady place. I was done. \nI'm finally 18 and have money of my own money. $800 every two weeks. Let's just say $400 cause my mom would take half cause I was still living with her. I started talking to this guy from onw of those chat hotlines. I think this one was called quest or some shit like that. Basically people call this place for to hear other moan and talk about their dark fantasies or whatever. This guy, I'll call him Evan, had to be the most normal sounding person out of the hundreds of calls and messages. I stated talking to him. He seemed nice. He actually worked along side prosecutors with clients who have been raped or molested. Basically they would give prosecutors pamphlets and brochures for place the victims can look for help. \nI decided to meet up with him. It was April 20th, I had made plans with a friend, let's call him Jeff, We were gunna go and celebrate 420 at the destined location. I had the money and I would take care of everything. Needless to say we were late and missed it cause my mother liked to take her slow ass time doing everything. Anyways, we went to Jeff's friends and drank til late and I left around midnight leaving Jeff with like $50 or something. I was going to meet Evan.\nI got there and he was standing at the doors to his apartment cause I had been on the phone with him most of the cab there. As soon as I seen his silhouette I froze. Evan looked like.. Darcy. I tried to shake it off as the car came to a stop and I get out and he runs over to me to gives me a big bear hug. Glad you made it! Ehehe Yeh... He looked exactly like him. I couldn't get over how similar they looked. obviously that night he expected things to happen and as we tried I stopped him while in tears. He knew about it. I ended up telling him weeks before on the phone. I cried telling him I can't cause he looked exactly like him. That this would never worked because he looked just like him, felt like him. I can't say I've ever contacted him after that night. But the next morning he walked me to the train station so I can go to a families. I didn't want to go back and kind of felt trapped that he was walking me to the train station. I boarded and got off the next stop which was known for their bars along that street. Yes, I was going to drink myself to death. At that point I didn't care what happened to me. I wanted to get drunk, I wanted to get high and I wanted to die. Called a friend I knew from high school that I knew lived in the city and could get me drugs so he meets up with me and we drink for a while til he confessed that he had no idea where to get drugs and that he only came cause I was offering drinks. Whatever. He ended up leaving after getting an angry phone call from his girlfriend.\nLet me back track here a moment. Okay so that day I went to 4 bars. The last bar I went to was a gay pub. I had no idea. I only remember this:\nI walk up to business door that was obviously closed and noticed the door next to the bar I wanted to go to was open. I started reading the signs on the door which only talked about events, not about the pub itself. I feel a tap on my shoulder. I spin around and I come face to face with three men. A white haired man that was the tallest. Let's call him Jelly. The shortest one that was balding with brownish grey hair on his face. Let's call him Jay. and the third. He had a receding light brown hair. Blueish green eyes and the holiest shirt one could ever see. Let's call him Life. I ended u Drinking with them and started to get close to Life. He wasn't gay and was there for Jelly cause he was losing his sight. Life already had history with the pub an the people in in and most not good. I won't get into that. Anyways. later that night they took me to dinner and treated me. It was really nice. Jelly Jay and Life was so damn nice. I ended up learning Life had two girls and was divorced and that we was twice my age. I really enjoyed being in his presences for the time I did. I thought that when I walked around that corner with a last glance over at them that it would be the last.\nTwo weeks later and I was still in my rut. Still allowing any predator to see me as an easy victim. Ended up making a house call so some shady random dude on the quest hotline. Hoping he would murder me or something. He was nice too. Bought me a cab back to my aunts apartment. So at my aunties while they drank and shouted, I laid in her daughters room looking through my phone until I come across a number. It's Life's number. \nYou can all question me as to why I decide to call at 4am in the morning? or Why I let some guy fuck me just cause I hoped he'd kill me or whatever. Say what you will but I called Life. \nHe answered. It was 4am in the fucking morning and he picked up. He didn't sound tired or anything. \nOne thing led to another and within a few hours of talking this man he already knew my lifes story and Darcy. We were both on the same level. I found myself falling for him and had to meet him again. \nI'm not gunna get into the crumby stuff like how I made the first move or how our first time was magical. Heh. It was though. Just sayin. \nIt was almost story book. I found someone who knew me and wanted to love me. He was willing to take care of me. All I knew was that I would not live long if this man didn't stay in my life. I needed his understanding, his experiences, his love. If I was with anyone else I would never be as happy as I am with him. \nYeh, yeh, I was 18 and I love. Say what you will. Cause now I'm 25 and still in love.\nYes he has been taking care of me and I literally have nothing to worry about. My everyday worries consist of this: What am I going to play? What am I going to watch? Who's gunna give the kitties their treats today? \nLiterally. That's it. I've even developed a phobia of going outside. All those people looking at me, judging me, thinking this or that about me like they know every hidden detail there is to know about me and judging me. I would deserve it too, eh?\nI still live everyday in my self-loathing. Life sees it all the time. We get into fights like any normal couple but more often then not come out stronger. But in most of those fights it mostly consists of me not wanting to admit I'm wrong or wanting to blame Life for topic of the fight. Usually he relents and takes the blame. I Hate Myself. I know I didn't need to do that. All it would take is for me to swallow my pride and face the consequences. But no. I selfishly make him take the blame for my stupidity and I hate myself every damn second for it. I hate myself. \nI recently started doing searches about suicide and found a list of methods by success rates, time it takes, and agony level. I have everything I ever wanted why would I want to kill myself? Do I deserve this nice life? No Do I give reasons as to why I shouldn't have it? Yes. Do take it for granted? Yes and no. Do I cause trouble for the one providing me these things? Yes Do I regret what I've done and apologize for my actions? Yes.\nThen why? I hate myself and I wish I would die because I am human. I see everyday how 'humans' treat each other. What they are capable of doing to each other. How my own family tells me on thing and does another. How they were willing to treat me when they didn't know and how they treated me after they found out. I have literally done nothing to another human compared to want others are willing to do to their own flesh and blood. This world is disgusting. And here I'm hating myself for the reasons I gave you because of my own morals. I'm literally nothing in comparison. So one to stop causing trouble to the man I love and two not wanting to see the world as it is anymore. \nI'm becoming something. Something I like but Don't like. \\I found that I've found enjoyment in seeing people who deserve it suffer. I fantasize killing Darcy myself. I want to see blood. I want to be the reason someone is bleeding. I want to see the life drain from the eyes of a murderer, a wife beater, a child molester. I even have a plan and an idea of how I want Darcy to go. \nThis is me now. \nLife is in his mid 40's and I my mid 20's. If I ever loose this man, You can sure as hell guess what I'm going to do afterwards. \nDarcy. \nI'll fucking come for you and I will fucking kill you myself. I don't care if people find out that I did it either. I'll just be that one story everyone will know as, Woman Kills Her Own Molester.\nIt'll be beautiful. :)", "url": "https://www.reddit.com/r/SuicideWatch/comments/b0jl7q/self_hating_slut/", "title": "Self Hating Slut", "social_network": "reddit", "user": "IamHanging", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 94, "down_vote": 0, "creation": 1552465899, "permalink": "/r/SuicideWatch/comments/b0jl7q/self_hating_slut/", "nsfw": true, "first_save": 1635422323.3809462, "replies_charged": false}