{"id": "t5_2qpzs_t3_or09g7", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846", "b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I have only 1 person I can somewhat open to but I've only done so to a certain extent and try to refrain from doing it at all for the most part. I feel guilty as if I’m bothering them with unfairly dumping my bullshit onto them and as if I’m doing it for attention or pity. \n\nI honestly have no clue how long this will end up being. Whether this story grosses you out, makes you hate me, or even if you choose not to read it, everything is fine with me. It doesn’t really have a point. I just felt like I’d never actually let my thoughts out properly and so this is my trashbin.\n\nWas raised in a single mother household and never knew my father. Mother divorced him for being psychotic and threatening not only her life but the lives of his children as well. This was after years of her holding out believing it was her duty to sacrifice herself to let her children have a financially stable home with 2 parents. \n\nWe ended up in a very low class town with minimal income but my mother worked herself to the bone with low paying jobs in an attempt to make sure we still had as good of a life as she could make. \n\nUnfortunately I still ended up being a weird kid. Not really sure why but I've always wondered if I had a disorder that was simply never noticed and properly diagnosed. I know now though that I have severe anxiety problems which were hereditary. She spent every last ounce of her strength just trying to provide for the family so she had very little left over to actually raise the children. \n\nOnce I got into the public elementary school my weirdness ended up with me never developing any connections. Eventually there was severe bullying. I'd never paid any attention to it till my most recent years when I started to reflect on why I am the way I am now, but I know that some of it definitely mentally changed me in very not good ways. Though all these years I never thought of it as such. \n\nFor what I believe was the reason above I ended up dropping out of the school system after at least a year of problems. The biggest was me refusing to go to school by faking epileptic seizures as a way to get out. I actually had epilepsy but all of the \"seizures\" I ever had at school were fake. The final nail in the coffin was 1 particularly violent bully beating the shit out of me and stomping my head into the concrete pavement for almost a minute like he was playing dance dance revolution at an arcade. Teacher was too scared to physically stop him I guess? \n\nStayed out of the system for like 3-4 years while the public school shut down. We live in an extremely economically dead town. Like the majority of the town’s roughly 1000 population are under the 10k annually mark (including us) and \nbarely survive solely off government benefits and the low cost of living. \n\nThat was when I first started to seclude myself off. It wasn't terrible but at the same time I had no real social connections. I did things like go on occasional outings with family members and such but I had no friends or social groups at all. Eventually I started to really dive into my playstation 2 and slowly started sticking there more and more as time went on. \n\nMy grandparents both finally fell down ill due to old age. My grandmother developed parkinsons and my grandfather went through several bad falls as well as slowly developing dementia. This was an unbearably huge amount of stress on my mother who was already being torn apart by how hard she was struggling to keep the household up. Eventually she decided to sacrifice her job in exchange for taking up the home healthcare position of taking care of my grandparents. With this she'd work literally next door to us, be able to take care of her parents when no one else in the family would, and she'd still make an income. It was shaky but things were still fine back then. \n\n\n\nAround the age of 11 or so (bad memory of things back then) she decided to pay a heavy amount of money to put me back into school. There was a VERY small little private school in town that was run by an older gentleman named Mr. G, 3 teachers, and maybe a total student body of 25 or so children in various grades split between those 3. 2 of them were very nice older women named Miss D and then my teacher named Miss N,. I guess I had problems with anxiety but eventually I managed to be somewhat happy. Unfortunately the third teacher, Miss P who was the daughter of Miss D, was a very difficult person. She had extreme anger issues, seemed to just dislike children as a whole, and had absolutely no patience for anyone who lacked. Miss N was a much more Elderly woman than the other 2 and at some point she became far too ill to continue her teaching job. The remaining kids were mostly moved to Miss P's class with the only exceptions being the much younger children in the lower grades. Every single day was a living hell for me. The simplest way to describe it is that she held extreme animosity towards the weaker kids. If you were falling behind in the pace of your work, or if you weren't producing grades that she was happy with, or if you didn't understand something, she just hated you. When you did something like this she'd threaten you, scream at you, talk to you like she was about to physically beat the shit out of you, oftentimes not so subtly threatening to actually do so. She used intimidation like standing directly above you in your seat and silently glaring you down. It'd be even worse when she'd bend down and put herself right in your face and start with her threatening. Or she'd take a heavy book and slam it in front of you. \n\nThere were at least 2 kids that definitely had learning problems, like a young little blonde boy named Tyler. The poor kid would often be the last to finish his work, or maybe it was even a group of 3 of us. She'd slam her hand down on her desk in the corner, look at us like she was about to kill us, and then tell us in the most threatening manner that she could muster \"Get it down NOW\". The school had a physical discipline policy that was based on parental permission. She'd often take Tyler somewhere to beat his ass with a belt when he wasn't performing like she wanted. The other method she used a lot was what I liken to a military \"shark attack\". She'd take the student to a separate part of the school, plop them down in a chair, and start shouting in their face. She berated them on why they can't do what she wants them to do, why they can't do it fast enough, why can't you understand this or that when you should be able to understand it, and when some poor kid can only respond with \"I don't know\" she just lays on harder. She always told us that we CAN do it how she wants but we're just lazy or don't want to do it. Or that our parents didn’t raise us properly.\n\nThe principal, Mr G, apparently knew about some of this but Miss D did her best to protect her daughter. Some of the parents would become aware of this and many different students over the years would get taken out because they couldn't handle Miss P. Miss D was honestly a nice and good hearted person but I guess she simply loved her daughter and didn't want to see her fired. I still don't know to this day how the school hadn't been hit with any legal problems but maybe what she was doing wasn't considered abuse or anything.\n\nEventually history repeated itself and I continued to miss more and more school. I'd wake up hours before it was time to leave for school because I was terrified of going and couldn't sleep. A lot of times I'd cry on the way there and beg my mother to not force me to go. I think I had a hard time explaining to her why I hated school so much. She knew the teacher was causing issues but wasn't sure of what to do. Because she was soft she'd let me skip school pretty often on days like that, but she was also pressed as she was paying the school a huge fee monthly for me to go, I was losing a lot of school work due to missing everything, and she was also legally pressed as there was a child law stating that you couldn't miss so many days of school. \n\nFinally after so long of it she mentally couldn't handle juggling my problematic school life and her other responsibilities so she pulled me out. I was labeled as being homeschooled so we were legally safe but I never touched a single bit of homeschooling work at all. \n\nSame situation as before. I hadn't managed to build any relationships with people and had no connections to social groups. I went back to my little room and continued to play video games. As the years went by I became more and more secluded and slowly degenerated as a person. Stopped interacting with even my family members, stopped leaving the house for days at a time, stopped interacting with my mother, stopped interacting with the house, ect. Then came things like neglecting my basic hygiene, neglecting my responsibility to assist with the household, ect. \n\nI'm not worried about revealing this as I can remain anonymous but I believe my hygiene and standard of living was probably far below what most people could imagine. At the worst points of it I could've gone a month or over without bathing and years without brushing my teeth. My room had become a literal vile trash heap filled with soda cans, junk, dishes, and rotting food. How I never contracted some horrific disease is beyond me, and somehow I came out with a perfectly healthy set of teeth despite horrible yellowing. \n\nThrough it all my mother destroyed herself trying to deal with me as a life sucking parasite living in the back of her house and her slowly dying parents that were succumbing to old age and terrible illnesses. \n\nI sat by staring at my computer screen, having basically no human interaction with anyone and even amongst online groups still being a weirdo that never got along with people, not paying attention to both her and the house falling apart. Even in my little computer world I wasn't satisfied though. I still don't understand a lot about myself but I believe I sought out video games as a form of fulfillment as I have nothing else. I looked towards competitive games or extremely grind heavy games as a way of feeling like I could accomplish something and feel like I had worth. Unfortunately I quickly learned that I was pretty mediocre at these things as well. Even if I could happily play a game 10, 12, 14 hours a day I still couldn't succeed how others could. I started to learn very quickly that regardless of what I dived into I was also lacking. I believe this led to my complex of believing that I'm incapable of doing anything at all. \n\nSomewhere at around the age of 18 I got some awareness and finally realized where I'd gone. Spent all of those years thinking \"No way I could end up like this. That's impossible.\" and then suddenly I open my eyes and I'm already there. Seen my husk of a mother dealing with a dysfunctional family, both from her children and her siblings. Seeing everything I'd loved as a child decayed and gone. I had a cousin named Jeff and his father named Sammy who I loved more than anyone else when I was a kid. When I was much younger Jeff died after a life fighting against cancer which left his father and mother broken. Instead of trying to connect with my uncle which could've done us both good I instead spent my time shutting myself off from my family, and eventually he also passed away from a broken heart and crippling illness. I can't tell you how much I regret that. \n\nIn 2017 my grandfather finally passed away from his problems, and then about 1 year later my grandmother followed after him. That was the end of my mothers employment and thus any income we had. Her mental state was destroyed by the years of stress and then the loss of her parents, and she was already in her 50's on top of being physically worn out so even if she wanted to try she was no longer fit for work. I was a pile of shit with mental issues who couldn't even interact with people properly anymore much less join the workforce. What little education I started out with had been completely forgotten and I forget how to even write. I can still write letters but there's almost no way I could handle anything past a few simple words. I only relearned how to write my name in cursive because I had to start filling out my own paperwork in hospitals and such. I never actually remembered or possibly even learned how to use proper grammar and punctuation. What I'm doing now is only from me copying what I see other people do and trying to figure out how it's used from there. \n\nI've tried self learning things in the past but I get overwhelmed and it feels like I can't grasp anything no matter what I try. \n\nWe spent the next several years in financial hell. Begging friends and family for money where we can just to keep utilities and internet on, of course using government programs for things like food stamps. There were plenty of times where we'd lose electricity or water anyway as there's a limit to begging and what others can do to help you when they're struggling with their own lives. Our relatives in Texas were a bit more successful and it was in large part thanks to them that we even managed at some points. Even still we've had situations where we lived without water for months before, electricity for weeks, ect. We also managed to rack up a utility debt to the town which is where we would lose the water a lot. It was due to an error on their part where they failed to shut off our gas line and thus charged us for utilities we didn't use. \n\nWe were constantly hit by struggle after struggle but life continued on. Somewhere along the way I developed a back disability. It could've been hereditary, it could've been a random occurrence, or it could've been a result of my terrible lifestyle. I don't know the answer. At first it wasn't anything major but it slowly progressed to be worse and worse as time went on. \n\nAfter so long we started to piece things back together through a few different methods. Specifically we relied on a deposit that originally belonged to my grandparents but my family handed it over to us since we needed money the most. Then my grandfather's precious car that had decayed away in his garage was also sold. This money at least helped us for a few months until we finally managed to get more government assistance and deal with the town. We managed to get a program that pays for our electricity and then got the town to ignore the debt of our water bill for the time being while we pay a small amount every month to keep it on. \n\nEventually though I started to crack. Over the years I refused to swallow the notion of depression. I had lived my entire life by having my mother take care of me, sacrificing herself to deal with me even though she shouldn't have. I hadn't changed my ways much but I started to develop a mentality that I didn't deserve anything from anyone, especially not the right to be depressed. I'd have moments where it'd creep up on me, but I'd throw it away and ignore it. However time went on and the guilt only piled up. I couldn't change my ways or do anything to change my life. I'm nothing but a burden and I can't change it. The fact that I'd always revert back to my ways and the fact that years went by without any sort of change killed me so much. \n\nThen one day about a year ago I watched a motivational video from an old man who started from a truly low position in life. He was a bright and strong old guy who tried to convince the younger generation that they can do it and that he understands that life is hard for people in these times, maybe even harder than it was in his. I watched a few of his videos and the only thing I could think was \"I'm nothing like this person. I can't be as strong as this person. I can't change my life like this person. I'm sorry for failing.\". That's when I first started hurting myself. Wasn't anything major. Was an old pocket knife and I didn't aim deep. And you know? It felt good. Not in a physical way of course. I'd been taking so many painkiller/muscle relaxer pills that I didn't feel much. However I'd always thought that I couldn't even commit suicide if I wanted to because I'd be too weak to even endure the pain or have the guts enough to cause it. But those few cuts proved me wrong. I could do it and it was pretty easy, and that made me happy. \n\nFor about a week I'd continue making cuts here and there just to continue reaffirming that feeling of accomplishment. I just passed the cuts off as my huge cat losing his marbles and attacking my arm. Since I'd never really interacted with my mother much and never allowed myself to show any sort of symptoms of depression she didn't even begin to suspect anything else. But then an argument happened. It was something stupidly simple. I had a pack of meat that I wanted to take out of the freezer to defrost, but it was 2 separate packs joined in the middle by tough plastic. I couldn't separate it and lazily threw the entire thing into the fridge to defrost. My mother stopped me and proceeded to lecture me about how I always waste so much food and I got annoyed. I just grabbed the meat and was going to chuck it back into the freezer for another time but then she got pissed at that as well and jerked it out from in front of me and started telling me how I'm always so childish, impatient, lazy, and \"I'm beginning to think that you'll never change\". \n\nThis one little line broke something. I thought to myself \"She also understands that I'm worthless and that I'll never change or become better\". It was like I knew that she knew the entire time but hearing it and thus confirming it is an entirely different thing for me. Even though I of course knew that's not what she meant I couldn't help but think about these things. I quietly slinked off into my room like I normally do but once I was behind a closed door and wasn't being bothered I silently broke down. I cried, I laughed at myself, and then I started cutting more. This time was harder. I was angry at myself with how fucking pathetic and disgusting and how much of a soul sucking worm I was. After a few larger cuts than normal I really broke down and finally started going for real deep wounds.\n\nThen I looked out of the corner of my eye and noticed an old fish fillet knife on my desk. I enjoy knives as a hobby so I had a lot of different stuff scattered around my room. I took it, thought about what sort of damage I could deal with it, and I was happy at the thought. To avoid explicit details I ended up with 4 deep gashes. \n\n\nI wasn't sure if I was necessarily thinking of committing suicide with that or not. I almost wanted it but I also avoided cutting directly on the wrist and also remained aware the entire time that I knew a better method to ensure it'd work if I committed to it. \n\nI didn’t feel much of anything, maybe not even the slightest burn. Could’ve been adrenaline, could’ve been the pain meds, could’ve been both. However as I sat there for a while breaking down further and further while I continued to bleed badly the thought crossed my mind that I could’ve actually done potentially fatal damage. I never really had a plan to begin with for hiding such massive cuts but they were far beyond the point of just wrapping them up and pretending it was nothing. That’s when my legs gave out, my vision blurred, I became ultra light headed, and my arms and hands became extremely numb while tingling super hard. I’d suddenly got scared and thought that I might’ve killed myself somehow. I stumbled to the front of the house and showed my mother what happened. Told her I loved her and was sorry for failing her and then just sat down on the kitchen floor and just kinda blurred out from there. \n\nA nearby off duty EMT rushed over and took a look. Nothing fatal as the knife had been dulled over the years without me knowing but stitches were definitely needed so she patched me up as best as she could and I was rushed to a hospital in a far off city. Closest city couldn’t accept me due to covid or something so I ended up going to a larger but further away city. Mother cried so much on the way there and she was absolutely traumatized. Ended up saying goodbye to her at the hospital entrance and then sat in a holding cell for what was probably about 3-4 hours. \n\nWent through the process of getting patched up and once day break hit I got shipped off to a mental facility nearby. I spent about a week there. I had more human interaction in that 1 week than I had in the entire 10 years leading up to that point, and most of it was me silently sitting in the corner. Despite that though the facility wasn’t worth anything at all and I’m still not sure how people are “cured” there. Maybe it was a holding facility and not an actual hospital but I don’t know and never cared to know. It was just a depressing common room where everyone just sat around in uncomfortable chairs, drank decaffeinated coffee, and tried their best to sleep through the day until they were allowed to go back to their rooms for the night. \n\n\nMet some interesting characters. The people in there ranged from people with major disorders, to people in drug remission, people coming off an alcohol trip, and even something like anger problems. Got to meet a gorgeous young hood girl named Audrey who I instantly developed a crush on and also got to experience what it was like having a roommate even if I absolutely hated it. \n\nWas picked up by my mother and uncle after my week was up and really hadn’t received any sort of help or counseling. I’d felt like an entirely different person though just finally being around people and even briefly opening up about myself to a few people around me.  \n\nHad some sort of psychiatrist call center try to “help” me afterwards but all it amounted to was a group of random people who I formed no connection to calling me up whenever they felt like it to ask me if I was “ok” and if I needed any more meds. I was probably at fault since I’d already had a hard time opening up but I felt even less inclined when it was someone I didn’t care about or know over the phone. \n\nSuddenly for a short bit I had family members swarming around and feeling like they had to somehow help me. Was given my first cellphone as I hadn’t ever needed nor wanted one previously, and not but maybe a few weeks later my cousin contacted me to tell me he wanted me to work a part time job. It’s really low hours which works in my favor with my disability and it’s a simple cleaning job so I can pick it up so easily. I thought of this as a first step that’d hopefully give me a mentality that I can do better and I can be of use to people. The money is next to nothing but for the first time in years we don’t have to ask someone for assistance the moment we need even the smallest of things. Can keep basic household items around, keep my pets fed, try to keep bills paid, ect. \n\n\nAfter about 2 or so months I turned towards fixing my back. If my legs recover from the severe muscle pains I experience when walking then I could hold a full time job with good pay and from there it’s just a slow process of building myself up. The ineptitude I feel, the lack of education that haunts me, the disability that holds me back, all of it could be fixed with some time. I felt so happy and it was such a new feeling that I hadn’t felt in so long. \n\nThat’s when everything quickly came caving in. So far my doctors and related medical procedures were all moving at a crawl. I spent several years dealing with a doctor that had to be demanded to move through several visits before they’d actually do something, and I repeatedly kept getting thrown back and forth between tests and random crap. I ended up in physical therapy several times but that never amounted to much because apparently government health insurance doesn’t afford particularly quality or motivated therapy sessions. That went nowhere fast and so I’d spent the years up until that point just hopped up on a high dose of painkiller/muscle relaxers. \n\n\nHowever all of a sudden everything sped up real damn quick. There was immediate discussion about consulting a neurosurgeon which we spent a while trying to find due to not only the limitations on what the state had available but also what we could find with our insurance. Dumb doctor seemed optimistic and told me it should be easily treatable. Finally got to meet my neurosurgeon for the first time and he was even more optimistic. He spun a tale of how so damn easy and quick it’d be to fix a busted disc and that even if the back pain wasn’t 100% cured there was no way he couldn’t fix it up so that my legs weren’t fine again. Said everything was a guaranteed easy operation. So on my very first consultation due to my naivety and stupidly thinking I could trust doctors I agreed to a surgery. \n\nShort version of that is several shady things happened with that doctor and after about a month or 2 of recovery I could safely say that not only had the surgery failed but I was not at least 2 or 3 times worse off than I was previously. \n\nNow that we’re later into 2021 I’ve been told after a follow up visit that the disc is no longer salvageable and the damage may yet get worse as there are signs that more discs will degrade and blow out in the future. A surgery to potentially stop the problem from worsening has been suggested but all of his previous enthusiasm is gone and he believes there’s a good chance the rest of my discs will go bad regardless of what happens. For now I’m taking more pain meds than before just trying to keep my little job together but who knows when that’ll start to fail as well. \n\nIn that time span of my cutting incident to now I rose up higher than I’d been in years only to fall lower than I’d ever been before mentally. Things like my hygiene have gotten to acceptable levels. I still have anxiety about so many things that eat away at me on a daily basis but I’ve gotten better at talking to people even if I can’t manage to build social connections. But I’ve completely lost hope of ever escaping poverty, ever having a body that isn’t too weak to do what I want, trying to build a normal social life and make up for all those years I wasted, or even escaping from behind my little computer screen. Any time I try to think about it, or when someone tells me what I should be doing, somewhere along in that plan that I’m cooking up I reach a roadblock that stems from something of these 3 issues. \n\nI’ve come to hate everything about myself and where I’m at now. Even if I try to explain it away I still blame myself for ending up like this. Suicide seems to be the only thing I can think about now as I’ve lost all form of motivation to even do the things that I once enjoyed. I’m simply trying to pass through each day until hopefully I hit another emotional breakdown that’ll give me the push I want to overcome everything else and just end it. Rather than wasting my time and spending my entire life self loathing and living like this I decided that if nothing changes by the time I'm 25 in 2 more years I’ll resolve myself to end it if I don’t do it sooner.", "url": "https://www.reddit.com/r/SuicideWatch/comments/or09g7/venting_and_dumping_my_story_here_if_thats_fine/", "title": "Venting and dumping my story here if that's fine. It's ok if it needs to be removed for whatever reason.", "social_network": "reddit", "user": "Individual-Self2116", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1627168193, "permalink": "/r/SuicideWatch/comments/or09g7/venting_and_dumping_my_story_here_if_thats_fine/", "nsfw": false, "first_save": 1635422310.623735, "replies_charged": false}