{"id": "t5_2qpzs_t3_onocin", "request": ["ee176c24-5d0b-47eb-8f0f-71f3b585684e"], "text": "A suicide prevention study at the University of Utah is seeking participants between the ages of 18 & 50. Your input will help us understand therapy interventions and their effect on suicidal thoughts. Eligible participants will be: 1) assessed online (for about 1.5 hour long), 2) receive an online intervention session (with a trained therapist via Zoom set up about an hour-long), 3) complete a two-week text-based assessment before and after intervention (about 6 minutes/day), and 4) a 1-month follow-up assessment (about an hour-long). If you complete all the study procedures, you receive a total of $82 in electronic gift cards. To know more about the study or to see if you are eligible, you can take the survey [here](https://educationutah.co1.qualtrics.com/jfe/form/SV_diD0yH5mVVzU4uy) or contact us at [schedule.prevent@gmail.com](mailto:schedule.prevent@gmail.com).\n\nREQUIRED IRB DISCLAIMER:\n\nThe information posted on this site is consistent with the research reviewed and approved by the University of Utah Institutional Review Board (IRB). However, the IRB has not reviewed all material posted on this site. Contact the IRB if you have questions regarding your rights as a research participant. Also contact the IRB if you have questions, complaints, or concerns which you do not feel you can discuss with the investigator. The University of Utah IRB may be reached by phone at (801) 581-3655 or by e-mail at [irb@hsc.utah.edu](mailto:irb@hsc.utah.edu).", "url": "https://www.reddit.com/r/SuicideWatch/comments/onocin/suicide_prevention_research_eligibility_survey/", "title": "Suicide Prevention Research Eligibility Survey (18-50 years old)", "social_network": "reddit", "user": "1U4UStudy", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1626732079, "permalink": "/r/SuicideWatch/comments/onocin/suicide_prevention_research_eligibility_survey/", "nsfw": false, "first_save": 1635427816.0388303, "replies_charged": false}