{"id": "t5_2qpzs_t3_1yqyyq", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "I was out all day with my friend because he has been taking care of me for two days, but I just came home to a miserable house and have been crying since I arrived.\n\nMy mother insists that she feels worse than me, that i make her life impossible, worse, and whatever, and i feel like shit. i feel like absolute shit. and i only live with my mother so she makes it worse.\n\nMy boyfriend broke up with me, mostly because of me, so obviously i see myself as the trouble, which has broken many relationships before, but also because this was the best relationship I had, and the strongest, purest, most passionate love I have ever felt,  and aside from being broken because of me, i really felt that we were great and I had started to feel truly in love, even when it lasted for fifteen months, and it leaves me alone with no best friend, no physical touch at all (I was abused, and he was the only one that could touch me) , and no company, no good side in life. \n\nAside from that, which was two days ago, I am not talking to my father because he is an abusive piece of shit, I have basically no friends since my relationships suck and no one is mature enough or likes the same things as me or understands me, I have no one I really trust, I am borderline, my date with the therapist was cancelled until thursday instead of monday, I'm out of pills, I have to start school in two weeks and I am still behind from last year (which I didn't do because depression) and fuck, I just want life to be normal again, I want my boyfriend and my will to live and I wanna get this over quickly but honestly there is no quick escape. I almost tried to kiss my friend today but realised it was a terrible idea.\n\nI have tried to kill myself a million times and will want to try again tomorrow, or the day after tomorrow, or soon, and I wanna die so badly that I am afraid I'll seriously harm me or start cutting myself again\n\nPlease help. I dont know what to do with all this sadness. I dont wanna cry anymore. Inside i'm suffering so much. i need a friend. I need to kiss someone, to hold someone, to feel close to someone. I need someone that excites me. I don't wanna be miserable. I have been miserable all my life. I thought i was doing great without my boyfriend but I realise that I'm not, and I am not doing okay at all and I wanna cry and kiss him but i guess it won't happen. it won't happen. i'm seriously so sad and even before this I had wanted to kill myself so I'm worried about me. So worried.", "url": "https://www.reddit.com/r/SuicideWatch/comments/1yqyyq/i_have_a_history_of_selfdestruction_and/", "title": "I have a history of self-destruction and depression, and now I'm at the lowest of the lowest", "social_network": "reddit", "user": "pipusu", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1393202276, "permalink": "/r/SuicideWatch/comments/1yqyyq/i_have_a_history_of_selfdestruction_and/", "nsfw": false, "first_save": 1635422545.9593155, "replies_charged": false}