{"id": "t5_2qpzs_t3_eab495", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "Self induced coma. I'm sure there is a way. Stupid I'm talking on some forums where no one really knows you . Title sounds stupid text sounds like a stupid fucking teenager begging for help. Fuck every single person who ever thought they were shit. Sucks reaching a point in life where no one else could ever hurt me again but my life is constant pain every single day I have to hear the person I love scream and scream and not be able to stop..\nBUT WHAT IS TERRIBLE IS. I can't get in her head. What if she is just weak and can stop? I have never felt many emotions. Why can't I just say something and it work? There Is no help for people with no insurance in America. Fuck the system and fuck whoever's supports it. \n\nThey want you to go to college do shit yadda yadda but If I wanted I could make 3-500 dollars a day selling but my girl can't let me even sell now because I don't have a spot to sell out of and she gets too anxious when I'm gone. \n\nFuck this I want to get OUT.A\n\nNOW MY ORGINIAL title doesn't even make sense. \n\n\nI just wish I had the BALLS to do it because every night I go to sleep I wish I stayed asleep but then I get scared like a PUSSY about dying. I'm too scared my last thoughts will be REGRETTING dying and not being able to do anything about it\n\nBut FUCK it I have to die eventually. Maybe if I get fucked up or drunk or something I'll lower my inhibitions and it'll be easier to just do IT\n\nBON VOYAGE MOTHERCUKERS HOPEFULLY IM DEAD BY 2020", "url": "https://www.reddit.com/r/SuicideWatch/comments/eab495/i_just_want_to_be_in_a_coma/", "title": "I just want to be in a coma", "social_network": "reddit", "user": "WHATisthepointheater", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1576276609, "permalink": "/r/SuicideWatch/comments/eab495/i_just_want_to_be_in_a_coma/", "nsfw": false, "first_save": 1635426431.3059552, "replies_charged": false}