{"id": "t5_2qpzs_t3_oc0z8o", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I feel like im losing my mind. I've had problems my whole life. Things I've gone through, resulting in me developing some strange behaviour. I recently decided to go to therapy, I've been struggling with \"sad thoughts\", social anxiety and paranoia that have only gotten worse. The problem is that I then understood a lot more about myself. I only went once, the therapist then had to go on a 4 weeks vacation. I now know I struggle with derealization and depersonalization. This made my paranoia almost completely disappear. Those feelings have only gotten worse though. I don't even remember how long ago the meeting was, maybe a week or two? Since then I now question absolutely everything. I've always thought of myself \"as a character\". Like my life is a show. I can't find any actual meaning behind life, but I've never needed it. All life needed was the one experiencing it being immersed in their own life. I think I lost this since my therapy-session though. I had plans on streaming for example, along other ambitions or interests I've wanted to work on for a long time. I've dropped all plans on anything now though, and stopped caring about what other people, including my family, think of me. I go up and eat breakfast at 4:30 pm. My relationship with my gf feels so strange to me now. I still love her, I think. I don't know anymore though. How would I know? I don't think it's supposed to feel like this. I hate the thought of being around her, but I want to give her the whole world. I would sacrifice anything for her, but could I choose I would shut myself in and not meet with anyone. And even just writing this makes me second-guess myself though. I can't say that I actually feel this. But it feels so much, so real. It feels like it can't be though, I am complaining for nothing.   \nI'm also sorry if this is a mess, I'm writing this while my mind is on fire. I don't know if I would do something drastic. I don't feel suicidal, but I can't actually find any reasons I had in the past for not doing something terrible. I don't want to. I really don't want to. But I could. I could spend 40 years behind a desk and always be so shut down about everything I enjoy as I am today. I'm so young, I should be excited about what the future holds. But I can't see myself in a future I like. I want to be where I am forever. Time just feels to slip out of my hands. And it's always felt like that, but before I could justify myself with how I atleast have enjoyed myself or done everything I could. Now I can't say the same anymore. What if \"not wasting my time\" would be doing something horrible? What says that that isn't the case? If nothing actually matters, what reason should \"getting better\" be the target? Can I? I never have. My life's been hard, but I've been positive the whole time. I know think that's because I just second-questioned myself. And still I know feel so much worse than I always have. So I can't find a way out. My gf always tells me that \"it *will* get better\", but that doesn't have to be true! Not everyone gets better. There are those who lose their minds. Who's to say that won't be me?   \nSo I'm scared. I can't talk to anyone about this. I can't even talk about all this with the therapist when she comes back either. It'll be the same old as always, I sit and smile and say what I think I should say. What makes me the most interesting as a character. I would be more interesting if I had struggles, right? Maybe that is why I have such an obsession with being sad. What if that goes further? What if I get violent, towards myself or anyone else I know?   \nIf I wanna go there, I've even had conversations with people that aren't there. I've heard this is normal, my brother have done the same for example. But that's the only other person I've heard about this, and it sounds an awful lot like other conditions I've heard about, like schizophrenia. That would be genetic. So it wouldn't be too far off.   \nAnd I also change whatever I think all the time! I can feel like this one minute, than think I was being stupid or even ridiculous after. I live a normal life, nothing seems off. I don't fight anymore, everything would be fine from an outside watcher. I should be fine. I know I'll hate this post tomorrow. And I know noone will read this. It's a fucking mess. Hello if u got this far! fuck me", "url": "https://www.reddit.com/r/SuicideWatch/comments/oc0z8o/therapy_ruined_me/", "title": "Therapy ruined me", "social_network": "reddit", "user": "throwracuzimscared", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1625193261, "permalink": "/r/SuicideWatch/comments/oc0z8o/therapy_ruined_me/", "nsfw": false, "first_save": 1635428211.1736724, "replies_charged": false}