{"id": "t5_2qpzs_t3_cknslb", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "I really really want to die right now. I don’t get why I feel this way. I wish I could pinpoint it but I can’t. I have friends who love me and a family who loves me but at the end of the day I can’t love myself. I went to the psych ward a couple months ago and since then I’ve been working really hard with my recovery but for some reason it seems like the efforts are futile. I’m currently in a different country where none of my friends can stop me and I’m home alone since the rest of my family is out. I don’t wanna end back up at the psych ward - I just can’t bare going again.\n\nI don’t want my family to have to find my body so maybe I’ll just walk out into traffic. It could be easier that way. My organs could go to someone more deserving of life than I. \n\nIt was my 21st birthday yesterday and yet I felt no excitement. Another year I’ve been on this dying earth. I thought I could change the world and perhaps fix the problems littered on this planet but I don’t think it’ll really make a difference. Maybe I just need someone to talk to - my friends all want to try to talk to me right now but I don’t want to talk to anyone I know. I hate having people see me like this. I’m so sorry that you, the reader, have to see me like this.\n\nBut maybe I’m just afraid to be happy. Maybe I’m afraid of my potential. Who knows - because I sure as hell don’t fucking know.", "url": "https://www.reddit.com/r/SuicideWatch/comments/cknslb/im_a_walking_time_bomb_who_will_self_destruct/", "title": "i’m a walking time bomb who will self destruct without any warning even though there’s nothing on the surface level that seems wrong", "social_network": "reddit", "user": "anonymous69420666", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1564662887, "permalink": "/r/SuicideWatch/comments/cknslb/im_a_walking_time_bomb_who_will_self_destruct/", "nsfw": false, "first_save": 1635422556.8093433, "replies_charged": false}