{"id": "t5_2qpzs_t3_n0g12i", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb", "6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I had depression since I was in high school. It's mostly because of having a bad childhood and bad parents that were emotionally and verbally abusive. I was also sexually abused when I was a child. So every year since then, I'd have depressive periods. It would usually last for a few weeks or months and because mine is high functioning depression, people don't really believe the gravity of my pain and sadness, or worse, they don't even believe that I'm depressed. It doesn't help too that my own parents would discourage me from getting therapy because they only believe in spiritual healing (my mom is a hard-core born-again believer that does not believe in mental health). I've tried seeking therapy and all kinds of help but none has worked so far. Therapy was actually triggering all the bad memories that I didn't want to deal with as a child. It would make my depression and anxiety worst. The only reason why my yearly depressive period ends is that I get distracted by work or by new relationships but it always comes back later on. (I'm diagnosed with major depression, anxiety, mild OCD, bulimia, and anorexia). I'm already 24 years old now and the cycle of feeling depressed and having all those come back each year is really weighing on me and I don't want to continue living this way if this is how it is. I'm honestly too tired. I've tried killing myself back in 2018 by overdosing on pills and when I got saved that time, I thought life was going to get better. At that time, I realized that I didn't necessarily want to die but what I wanted was for all my problems to go away but now after experiencing so many shitstorms. I take it back. I don't think there's a bigger purpose as to why we should try our hardest in trying to live. What's the point of being alive if most of the time you just hate yourself, you are haunted by nightmares & traumas, and your own family & friends who do not care for you and are basically the reason why you are often triggered and why you can't live a peaceful life. I've been contemplating how I should kill myself for a while now but I'm too scared to actually do it. I just want everything to end!. I'm not even sure if attaining happiness, peace, or healing is real. So my question to you guys is, does it actually get better? Will there be a day that I won't feel as shitty as this? Do you know of anyone who has successfully overcome his/her mental problems and is genuinely happy to be alive?", "url": "https://www.reddit.com/r/SuicideWatch/comments/n0g12i/is_there_hope_does_it_actually_get_better/", "title": "Is there hope? Does it actually get better?", "social_network": "reddit", "user": "whatsthepointofthis8", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1619620079, "permalink": "/r/SuicideWatch/comments/n0g12i/is_there_hope_does_it_actually_get_better/", "nsfw": false, "first_save": 1635422275.1874366, "replies_charged": false}