{"id": "t5_2qpzs_t3_pgwpz2", "request": ["5f7c2841-3f43-4682-8126-88825da57933", "37248a85-36ad-4f27-afa2-d6240c3a39c2"], "text": "A couple of weeks ago, I tried to end my life. It was my 6th attempt, my first one being 9 years ago. I crashed my car into a wall off the side of the highway going 70 mph with no seatbelt on. Somehow, someway, I hit the wall, yet I didn't fly out of the windshield as I intended. Instead I spun off of the wall and into a median, got flung around my car and ended up scratched up, bruised and with 4 fractured vertebrae. My car of course was totaled. At least I didn't hit anyone else, I would feel far worse if I did. \n\nI had to spend 8 hours in the emergency room in incredible pain, motionless in a neck brace, and needing to pee in a bedpan until I was determined to not have a neck injury. I had a cop stand over my bed and tell me all of the tickets and fees I would have to pay, and that my license would be taken away until I am cleared by my doctor. I then spent 2 days in the medical portion of the hospital until I was sent to the mental unit. I lied my way out and was released after the required five days. If I were honest about how I was feeling, I would still be there. \n\nI'm home now wearing a back brace, unable to drive because of the brace (and having no license or car) and am physically weakened due to my injuries. I have mobility restrictions and the spinal injury is messing with my digestive system and menstrual cycle. I feel just as suicidal as I did when I took my car to the highway that day, if not more. I had to take a leave from the side job that I loved, my dog walking service. I go back to school in a couple weeks, and go back to my other job as a teacher's aid next week.\n\nAs much as I don't want to be here, I have to keep it together for my kids. I miss them and my fellow teachers. But I don't want to be here. I didn't want to be here when I decided to leave that day. And now I have more to worry about. I have to get a new car, which there is a shortage at the moment, so it's very slim pickings where I live. I have to get medically cleared to get my license back, and getting a doctor's appointment where I live is not easy either. I have follow up appointments and physical therapy, and have to depend on other people to take me to said appointments. I just wanted to fucking die, and yet I'm still here and now dealing with the consequences. \n\nI really, really thought I was going to do it this time. I tried so many times before and I really thought this one was going to work. I'm trying to look at this as a second chance, but it really just feels like I suck at trying to die and I should find a method that's really going to work. I have a counselor but I'm scared if I am honest about still wanting to die that they'll have to report me and I'll go back to the hospital. I don't know how to look at being alive as a positive. I don't know how to stop wishing that I was better at killing myself.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pgwpz2/suicide_attempt_gone_wrong_still_want_to_die/", "title": "Suicide attempt gone wrong. Still want to die.", "social_network": "reddit", "user": "thebiggsad", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 195, "down_vote": 0, "creation": 1630638250, "permalink": "/r/SuicideWatch/comments/pgwpz2/suicide_attempt_gone_wrong_still_want_to_die/", "nsfw": false, "first_save": 1635421113.7967548, "replies_charged": false}