{"id": "t5_2qpzs_t3_qea6jz", "request": ["fa52eed9-681b-4f68-b3d1-78c0eec9a3d2", "86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "I've never had friends, cant talk to anyone no matter how nice and friendly they seem, started getting suicidal thoughts, my only \"friend\" left me all by myself after she found someone she had a crush on, I got into drugs that made me broke, that made me do things I will regret forever, I cant even afford next months rent since im on unpaid vacation, The only time im happy is when high on drugs or thinking about beeing dead, in that order\n\nAbout four months ago I was living the life, had recently moved out from my parents house got a nice car,  got alot of \"half\" friends, people you can small talk with,  and in general a happy guy.\n\nNow im a broke drug addict that has a shitbox of a car, hate myself, no friends at all and I just want to die. The reason I want to die is because of what me and my friend that left me did once that has left me with really bad anxiety, I cant sleep on a bed, im scared, paranoid and growing more suicidal every day due to a non lethal drug overdose that left me shaking, teeth shattering, sweating and in a vegetable state for about 5 hours, almost blacking out several times a minute,atleast i e been told because I barely remember and that event made me use other drugs even more.I did bad things to afford drugs, that left me with doubts of who I really am.\n\nthat made me borrow money from shady people, im afraid I will get attacked at home due to said money so I have to live with my parents that I hate and last night I had a failed suicide attempt, with a new suicide planned tonight, if that dosent work I will find a dock and drive my car into the water, tie myself to the seat with a stupid amount of rope and knots so if someone tries to rescue me they will almost certainly fail. I tried killing my self using a plastic bag and a belt over my head, but my survival instinct \"saved\" me right after you get into the grayzone between dead and alive.\n\nCan I call an ambulance and tell them I will kill myself with new attemps every night until I succeed? The only way to fix this is getting into mental hospital, as I cant take care of myself, I havent showered in a month, I hate everything and im scared of myself and my life, and I spend all day crying, and can barely speak due to what has happened\n\nPlease im lost with no one to talk to, what do I do? I want to die but is scared shitless of the though of being dead. I tried a shrink, I dont trust anyone beside that one friend that left me, and I dont want to get convicted for something drug related, as my job will be gone in a second if I test positive for any drugs. This is really my last resort. I want someone to talk to about everything but I cant because I dont have anyone.to talk to at all.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qea6jz/my_life_drasticly_turned_up_side_down_ive_done/", "title": "My life drasticly turned up side down, ive done things I will regret forever, and I'm only happy when I think about beeing dead, I'm broke and cant afford rent. Please help", "social_network": "reddit", "user": "Perfect_Candy1618", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1635012760, "permalink": "/r/SuicideWatch/comments/qea6jz/my_life_drasticly_turned_up_side_down_ive_done/", "nsfw": false, "first_save": 1635425431.6079142, "replies_charged": false}