{"id": "t5_2qpzs_t3_op4pxc", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I keep pretending I’m ok now but I’m not. When the thoughts spiral too hard I get stuck in thinking what’s the point of it all? \n\nI only ever wanted to pursue my passion in life, and I did. I made huge leaps and bounds after a lot of hard work and sacrifices. I’m a primary name in a major motion picture soon to be released. People are proud, jealous, or look up to me. Idk. \n\nI wish I could get behind the perspective that this is a huge jumping off point for me, a huge step in the right direction… but I can’t. The storm hit a few months ago and I’m broke and living at home again. The work it took for me to get where I did did a number on my health. Which wasn’t great to begin with, thanks to genetics. \n\nI still have stories I want to tell but the world is so fucked, who is it gonna help anyway? If I can even get it out there. I’ve been on the inside. It’s gross. \n\nI’ve been depressed for years but I’ve only been juggling with suicide for the past nine months, on and off. \n\nI’m medicated. I exercise twice a day. I eat healthy. I sleep. Sometimes I drink and smoke, but I’ve cut down a lot. I don’t feel any better for it? \n\nI’m single with no hope for love. I don’t care about having kids, never have. I just wanted my career. Now I don’t feel like I want anything but to die. I’m tired of all this. \n\nI dont know what to do.", "url": "https://www.reddit.com/r/SuicideWatch/comments/op4pxc/looking_for_someone_to_talk_to/", "title": "Looking for someone to talk to", "social_network": "reddit", "user": "throwmeawaytoo22", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 18, "down_vote": 0, "creation": 1626920748, "permalink": "/r/SuicideWatch/comments/op4pxc/looking_for_someone_to_talk_to/", "nsfw": false, "first_save": 1635428193.3807483, "replies_charged": false}