{"id": "t5_2qpzs_t3_k1vwt5", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I'm progressing toward my inevitable suicide so fast, you can call that shit Operation Warp Speed. Every day I get worse, in every possible way--emotionally, intellectually, morally, physically. Every day I hate myself more. Every day I distrust people more. Every day I get more bitter. Every day I feel uglier, every day I get older; I see no progress toward looking presentable, despite eating as little as possible and regularly \"purging\" after large meals. Every day I get more desperate. Nothing helps. Nothing feels good; nothing gives me any hope. I just want to die.\n\nIt's humiliating that so much of this comes down to my feeling gross and undesirable. I don't even *enjoy* sex: I'm much too dead inside to have fun connecting with another person. I just want to be wanted. But I'm not wanted. I'm a fat, disgusting freak, and even if I lost weight I'd just be a *thin* disgusting freak. Everyone finds me dull--and they should, because I'm interested almost exclusively in things no one else cares about. Although lately the problem's been less that I bore people by rambling about my interests, and more that I bring the mood down by talking about imminent societal collapse and global environmental catastrophe and other such cheerful subjects.\n\nI don't mean to be a bummer; it's just that all I can feel, and all I can think about (or even *imagine*), is suffering. I can foresee no good for myself or for anyone else. I'm a miserable person in a miserable world and I want to leave.", "url": "https://www.reddit.com/r/SuicideWatch/comments/k1vwt5/every_dayits_gettin_closergoin_faster_than_a/", "title": "\"Every day/It's gettin' closer/Goin' faster than a roller coaster...\"", "social_network": "reddit", "user": "ChazticBonoBand", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1606458437, "permalink": "/r/SuicideWatch/comments/k1vwt5/every_dayits_gettin_closergoin_faster_than_a/", "nsfw": false, "first_save": 1635427154.94578, "replies_charged": false}