{"id": "t5_2qpzs_t3_oygcdy", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "Hello. Sorry for this rant. I've got no one to talk to. This sub seemed like a nice place. I don't know where to start. \nI've been daydreaming about dying, being murdered and committing suicide constantly for the past year I think. At school, while taking a shower, while eating, before I went to sleep, when I was listening to music, when \"talking with\" someone (when someone talked   t o  me). Simply  a l l  the time. I've thought about different methods and ways. Just fantasising, dreaming. About 2 or 3 months ago I've found the solution. A realistic one that I could perform right the moment I wished to. Not some idealized and spectacular headshot in a dark theatre with me playing the main role and rose petals flying around. The idea came to me: a simple electronic device thrown into the bathtub, a lovely toaster. I've got a bathtub - check. I've got water to fill it - check. I've got a toaster - check. Bullseye.\nRecently, a few days ago (5 or something), I've listened to a podcast to stop crying and at least  t r y  to focus on something. 2 guys, they were talking about love and relationships and answered some questions from listeners, gave them advice. They said something about \"chasers\". People who don't really like the relationship itself, but the way they've gone through to \"obtain\" that relationship. I realized that I am, I was, somewhat similar to a chaser, something like a chaser. I've been dreaming about dying, desperately craving death; but when I found the solution (a toaster thrown into a bathtub full of water, me touching the mix, to get electrocuted), I was sort of disappointed, I don't really know how to put this into words. Like \"oh, the fun is over.\", but not exactly, but at the same time something like that. I still  n e e d  to die. It's just that it wouldn't be best, it would do, it would be good enough certainly, it just wouldn't be ideal. At the same time I think that perfection doesn't exist. Yet here I am, chasing after something that doesn't exist. An endless race.\nI feel like I'm playing with a toy just to throw it away once I get bored. I'm so toxic. or so I think. It makes me disgusted with myself, at the same time not caring, not having enough energy to care. \nI've got no one to talk to. Classmates and I have little to nothing in common. If they talk to me, it's only because there's no one else to talk to (I could never understand the need to talk all the time. Can't you just be quiet for once) or they need something (paired for some project, they want homework, some money, to go the bathroom together so they don't seem like a lonely loser to others in the bathroom. How come someone be this insecure?). One day, on a break, some girl's friends went somewhere and she was standing alone. She walked up to me and initiated a conversation. Somehow the topic became suicide and methods. She said how much she'd like to die, how she's so stressed out with school (despite it being almost the end of the semester where even teachers didn't care anymore). I've shared some of my ideas, ways that I know. She stared at me, quite shocked, and said \"oh my god, what are we talking about??\" and walked away. I felt somewhat abandoned. She was probably just seeking attention, but I felt like she was just a poser (with the \"i wanna die omg\" talk). \nMy parents are kind of toxic. I've seen worse, but toxicity is toxicity. It kills over time, even if provided in little doses. A few weeks, maybe months, when I was hitting my head against the wall, my father said, \"We're going to the hospital\". I said \"It wouldn't help anyway\" (I said it when I had an extremely hopeless, empty, weird time). He walked away. Yesterday, I said that I found a nice, relatively cheap psychotherapist nearby (a 40-minute walk let's say, I live in a forest so it's not a lot for a walk). Father's got all boomerness inside him and said how therapy is a waste of money, how instead of helping you they make you feel worse to get more money from more sessions etc. My mother said, quite angry, something like yeah right, I've also gone through this, everyone has, blah blah blah, you're a teen, yada yada, yada. Some of you probably know this kind of boomer stuff. She's also the kind to say how selfish suicide is and people who commit it are losers who run away from life and reality. I, on the other hand, think that suicide is okay (not like I'd encourage someone to commit it, I simply wouldn't say such lies as she does). She sometimes gaslights us to argue about it, but I've lost my strenght to do so long, long ago. When we (my parents and I) somehow happen to talk, they get all pampered up. I just wave them off \"yeah. Yeah. Right. Good. Okay. Nice\". I know it certainly isn't the best, but it's so hard to not snap, so I'd rather wait for them to say what they want and politely go to my room. I can't have a fairly normal conversation with them because I'm not into similar they are into. Dang, they can't have a conversation with each other because of how different their interests are (they have very little though, but still, nothing in common). They feel like strangers bond to me by blood and law only. I can't maintain a small talk with them. Our views differ, our senses of humour differ, our taste in everything differs, what we consider inappropiate differ. \nYesterday evening, after this small \"conversation\", I've been scrolling through my phone, looking for memes or something. Mother said to father with the most degrading voice I've ever heard, with the most despising look in the eyes \"She writes in her little writer what horrible parents she has, and they're writing back \"yes, your parents are really awful\"\", as if I wasn't there, on the couch. Before I went to my room, I said \"If I had someone to talk to, I wouldn't speak to you.\" (she called stuff like chats and discord \"writer\" i dunno why. Feels like she wanted to kinda bully me or something but didn't have the words hah)\nThat night (and a little of today's very very early morning) I spent listening to music for more than an hour, staring at the ceiling, lying in my bed, tears coming to my eyes, rolling down my face.\nNow, when I'm writing this, I sort of feel like I'm doing what she said, writing complaints in my \"little writer\". At the same time I don't care about her nor her opinions. It's a weird feeling. I either feel nothing, this never-ending emptiness with a hint of sadness and melancholy, or this rush, eerie feeling of being capable of harm (myself, rarely animals, very rarely others), or like a mix of every kind of gummie you can find, put in monster, then combined with mountain dew, then prepared with doritoes like cereal, then eaten by someone, then spitted out on the ground with disgust.\nI'm so desperate to talk to someone that I would willingly pay for it. For a conversation with another human being.\nNot like I don't like that feeling. I feel numb. At the same time I hate myself for that pitiful need, but the other part inside me needs to get it all out, get it off my chest. I don't even know anymore. I could get hit by a truck and, if I survived, not get up, just lay there, on the road. \nI sort of regret that my childhood, the wholesome, early one, is gone. \nI don't want to do something. I want to have something done. \n(my inner nihilistic procrastinator)\nI've had a few mental breakdowns, I think. One, a bit more than year ago, maybe 1.5 a year, at night. My parents (sort of lovable back then) came home late at night. I cried and cried before they were home. My mother raised her voice, told me to calm down and go to sleep. She was tired, I'm not sure whether it was because of me or because of work or because of father or because of anything else. But if it was me, then why making a child when you won't be patient with it? \nEveryone expects a bit too much. I set too overwhelming boundaries. In my country we've got these 6, 5, 4, 3, 2, 1 instead of A B C D E F grades, but it doesn't matter. When I got a good grade (meaning A), my mother would occasionally say \"nice\". When I got a B, she'd ignore it or ask \"Why not an A?\" (in a semi-sad or disappointed and semi-seemingly innocent manner). If I got a C, she'd ask \"Why? What happened?\". I somehow managed to not get any grade below C (I got like 2 C's last semester, each one ending with me having this unbearable feeling of being useless, a disappointment, a heavy piece of trash that you want to get rid of but you aren't allowed to. That overwhelming attack of crying for hours. This tightening in the chest, causing you to desperately gasp for air after a whole minute of trying to suffocate yourself.). Even when I got an A that wasn't a 100 I'd feel disappointed and disgusted by myself. And here I am. \nIn my country, we've got this subject competition. My first language teacher said like 3 years ago that I've got a talent, a gift for writing. She arranged meetings for me and a boy in our class (who also possessed this cursed blessing of being able to write freely) to prepare for that damned competition. I didn't ask for this. Everything I've ever accomplished, I was dragged in, whether I wanted it or not. Not like it isn't good and nice to be fluent in writing things, thoughts, feelings down, like I'm doing right now. It's just that, I don't even know what. This emptiness is back again. So exhausting. I just want it all to end. The being unable to find the words. To find the answer. The solution. I want it all to be gone. \nI've lost myself. There's no Me in myself. There's no me. I don't know what I want, I don't know what I don't want. It's all so dull.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oygcdy/im_done/", "title": "I'm done", "social_network": "reddit", "user": "TakumiYuka", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1628165929, "permalink": "/r/SuicideWatch/comments/oygcdy/im_done/", "nsfw": false, "first_save": 1635427499.3003697, "replies_charged": false}