{"id": "t5_2qpzs_t3_q1ow83", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "I should preface this with the fact that I don't want to die, but I'm definitely considering going up into the mountains this winter and never coming back. At this point of my life it's just brief moments of happiness and suffering sprinkled into an endless slog of gray indifference and general apathy. I feel so alone and disconnected. I'm 30 and I've never been in a relationship, I generally feel undesirable, unwanted, and unlovable. I have very few friends, and I don't really see them anymore. I feel like people are incapable of understanding me, and if they did they'd hate me with as much passion as I hate myself. I've been dealing with depression since I was 9, and it's getting worse every year. I'm terrible with social interaction, and wary of people overall. I just want everything to end, even sheer non-existance is welcome and preferred at this point. Part of me wants to stay alive to spite the part of me that hates myself, and so I'll continue to suffer, and another part of me wants to die to spite the people who love me and miss me. The main reason why I've kept going so long is because I don't want my love ones to hurt, but that is turning sour because I can't understand why other people don't want me dead as much as I do. I feel like self destruction is imminent, like it's my destiny.  I don't want to hurt the people I love, but a growing part of me hates people for loving me. At this point I'm so confused I'm like a walking contradiction, I hate myself, but I feel some compassion for myself, I love people, but I hate them, I feel more and more unstable with each passing day. I don't know what to do anymore. Therapy isn't helping anymore, and medication only makes it hurt a little less. I don't want this anymore. Sorry for the length.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q1ow83/i_feel_like_people_are_incapable_of_understanding/", "title": "I feel like people are incapable of understanding me, and I feel like a detriment to society at large. I am alone.", "social_network": "reddit", "user": "Thebestnumberispoop", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1633414724, "permalink": "/r/SuicideWatch/comments/q1ow83/i_feel_like_people_are_incapable_of_understanding/", "nsfw": false, "first_save": 1635422991.6285791, "replies_charged": false}