{"id": "t5_2qpzs_t3_qbve2y", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "Self destruction is so addictive. When there is no external source of destruction you become your own source of destruction. Why do I want to hurt myself so badly? I don’t understand how I can hate myself so much. If I like something about myself it’s definitely my self hatred. There’s something soothing about it. Something soothing to know I can end it all at any moment. Humans, we are so vulnerable, we can die just by...nothing, just by laughing while you’re eating. I feel such relief to know that and also some pride, in knowing out of all the ways to die, I get to choose how and when. I guess that’s what I like about hating myself so much, being able to control myself and my life.\n\nI spent my days ruminating of different ways I can hurt myself, ways to destroy my body by drugs, alcohol, starvation and ways to kill myself. I’ve fantasized about my death since I was a teen, even smaller I’d dare to say.\n\nI don’t know if there’s something wrong with me, sometimes I feel I’m not actually here. I feel I'm doing things on autopilot, as if someone else is doing the things for me. Who is that other person or thing? Or who am I? What if I’m the intruder? Sometimes I don’t even feel my body, I’m just...there, somewhere.\n\nI’m not even getting started on the feeling of not belonging in this world or in my family. I cannot even explain what I feel...so disconnected from everything and everyone. I wish there was a way for me to canalize these feelings into something, create something while feeling understood or heard depending on my creations. I just have this mediocre writing that no one will ever read. If I were to choose a talent it would definitely be music. Sing, play instruments, produce, song writer or whatever that will introduce me to that world. I think we are all born with potential to do something great, but if our parents didn’t push us, then we do nothing, such as.\n\nSometimes I don’t even feel sad, I just feel so out of place, it’s unbearable. I feel my mision, whatever it was, is over now and it’s time to go. The only thing that will stop me, if I decide to attach myself to something, it’ll be my mother, just wait for her to leave as well.\n\nWhen I think of killing myself I don’t feel afraid, I feel peace, I feel as if I’ve accomplished something...perhaps accomplished living, I feel ready, I feel ok with it. I do wish my death happens naturally though, just because I don’t want my mother to suffer from my suicide. I think she will suffer more knowing I’ve commited suicide than if I’d die from other causes.\n\nI feel so confused and lost that the only way out is to leave this world. I don’t think I can ever find ‘’my way’’, that has never been the case. You know when you’re a teenager and just feel so lost? You don’t know who you are, what you’re doing here, what you’re going to do, you just hope it’s something good, I feel that ten times fold and I’ve been feeling it ever since I can remember.\n\nLife is beautiful, I do think life is beautiful. All it’s little things are so magnificent, how we have everything we need to survive and more, is it a miracle or evolution?  But once you get past that visual effect of a beautiful life, you can see what life really means...nothing. I don’t think there’s a true meaning for life but to experience different ones.\n\nI feel very deeply, I experienced so much happiness that it couldn’t fit in my body, made me feel electric but I also experienced that same amount of pain, made me feel dissociated, disconnected and so utterly empty.\n\nWhatever.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qbve2y/thoughts_of_a_suicidal/", "title": "Thoughts of a suicidal", "social_network": "reddit", "user": "Lost-Abroad-9796", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634715045, "permalink": "/r/SuicideWatch/comments/qbve2y/thoughts_of_a_suicidal/", "nsfw": false, "first_save": 1635427991.3646147, "replies_charged": false}