{"id": "t5_2qpzs_t3_ogqi5u", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "I really want to die right now. I know I said on my last post here that I was gonna OD in like five days from now but I want to escape *now*. The only reason I haven’t done it yet is because i haven’t finished my note. So I guess I’ll just ramble now.\n\nOne reason for my urge to die right now is the fact that I have dance practice tomorrow. But it’s not like I hate dancing, I guess it’s the fact that I have to be active and that I have to interact with people when I’ve been trying so hard just to get away from them so my upcoming suicide won’t bother them. \n\nAnother reason is because of my mom. You might be thinking *”woah, they sound like they’re an annoying, entitled brat”*. So let me explain. I have odd and relatively unhealthy eating habits. It’s been like this forever. So when my mom suddenly starts asking me what I want to eat more and buys a bunch of food, I find it odd. She’s never done this. And I’ve never thought too much about my eating habits so when she keeps bringing up the fact that I should eat more, it doesn’t exactly feel nice. I don’t know if I have an ED but my mom seems to see it that way. I know that she’s just concerned but I don’t like feeling smothered. And of course I haven’t talked to her about this in depth because it’s kinda taboo in my culture and I’m an overall reserved person. \n\nI’m not sure how many people will read this but if you’ve made it this far, thanks I guess.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ogqi5u/meaningless_ramble_pt_5/", "title": "Meaningless ramble Pt. 5", "social_network": "reddit", "user": "toni_rigatoni", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1625815370, "permalink": "/r/SuicideWatch/comments/ogqi5u/meaningless_ramble_pt_5/", "nsfw": false, "first_save": 1635428432.37967, "replies_charged": false}