{"id": "t5_2qpzs_t3_pni2ef", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb", "6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "18F As the title says, I feel like I am out of options.\n\nWhen I started school at 5, I started to get bullied, a lot. It was about my physical appearance, my height, my teeth, weight and anything else imaginable. All this causing me to having suffered from bulimia and anorexia ever since. At 12 I switched schools, things got better, but a year later my father died unexpectedly. He was my best friend. After my father died, my brother stopped speaking to me. My mother and I never had a good relationship. I was never good enough for her, anything I did was always bad or not good enough. I was very close to my father. She would sometimes get physical, she drank a lot. She still drinks. After my fathers death, nobody really ever asked me how I was it was always “(my name), how is your mom doing?”. Whenever I tried to express my grief in front of my mother, she would brush it off and tell me she couldn’t handle my grief. She would always be telling me how it was my fault my father died and that I should burn up in hell. I began being the parent in our relationship, cleaning the home, taking care of everything, cooking and such. Things got a little better. At 15, I was at a party, when one of the guys from the my year asked me to take a shot with him. I had had two drinks prior to that, I agreed. I never should have. Everything after that is a blur. But I remember him holding me down as I woke up later that night. It was a blur. He raped me. A few days later multiple people had seen the videos of my naked body. I went to the police and took him to court. The court ruled it as “non-consensual intercourse”, as there in my country at the time were needed physical evidence of rape such as bruises, for it to be ruled rape. He did get charged for the video. They let him go with a fine of $1000, because they didn’t want to ruin his life by sending him to prison. After this I found out he and his best friend had been planning for a long time to rape me. They had planned it together. Turns out my rapist even had been stalking me for years. While the case was still ongoing and I was supposed to give my statements in front of the judge a few weeks later. He approached me at a party and told me that he would kill me if I made my statement. To this day he and his friends still harasses me and gives me death threads. This thing didn’t make my relationship to my mother better. Just worse. She thought that it was my fault, and that I should’ve at least enjoyed it. I now suffer from bad nightmares about the guy and my fathers death. \n\nAfter the rape, my mother sent me to a boarding school. I hated it there. I was severely depressed and had bad anxiety.\n\nI am still trying to get a better relationship with my mother. But every time I try, she disappoints me. I don’t actually think she wants to. But I think she wants people to think that she does. I get incredibly sad and get periods of severe depression every time I try and she disappoints me. Child protective services tried to help at one point, but because I come from a wealthy family, nothing and bout me and my mother could be done. I was kicked out at 17. \n\nNow I suffer from PTSD, depression, anxiety, sleep paralysis and severe nightmares. \n\nI have tried reaching out to professional help. My own insurance can only give me 2x45 minutes a month. Which dosen’t really help, as it’s far apart and short sessions. If I go through the gonverment, I have to wait 2 years for free psychological sessions. When I have reached out to friends, they really didn’t care. They are more focused on their own lives, which I understand. I no longer have energy or mental capacity for school, what I have of friends, eating or anything. \n\nI feel like I am running out of options and I am starting to feel like suicide is the only solution \n\nSorry for the long post\n\nEDIT: I am not going to be committing suicide in the nearest future, maybe in a week or two, but I am starting to feel like it’s the only solution to all of my problems", "url": "https://www.reddit.com/r/SuicideWatch/comments/pni2ef/i_am_running_out_of_options/", "title": "I am running out of options", "social_network": "reddit", "user": "dy1ng_1ns1d3", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1631547942, "permalink": "/r/SuicideWatch/comments/pni2ef/i_am_running_out_of_options/", "nsfw": false, "first_save": 1635422258.621108, "replies_charged": false}