{"id": "t5_2qpzs_t3_oehmhx", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "hi all <3\n\ni have brain damage and it makes me want to die. i used to be a really good writer. I went to school for it. i got close to being published a couple times.\n\nthen a horrible combination of alcoholism, anorexia, and some concussions really fucked me up.  had an mri about a year ago and was told that my brain was much further away from my skull than it's supposed to be at my age, meaning that it was shrinking--which is p typical for ppl with eating disorders and substance abuse problems, but it had happened very quickly in my case.\n\ni had in fact been having auditory and even visual hallucinations occasionally, but i chalked it up to \\~\\*\\~The Fear\\~\\*\\~ as they call it lol\n\nanyway. i quit drinking (alone and cold-turkey LMAO--i do NOT recommend XD), and i've been eating pretty normally, but over a year out from my last concussion, i still can't focus well enough to read or write much of anything. every time i try now, it just ends with me crying because i just can't /think/.\n\ni've been trying to fill the hole where all my passion for writing used to go with volunteer work and stuff. i even quit my job and went back to school in pursuit of a whole new career. but it doesn't change the fact that i feel completely useless when it comes to the one thing i care about /just for myself/ and not because i care about other people.\n\ni know it sounds so stupid, but i feel like i'm burnt out already, and i'm not even thirty. i'm afraid that it's only going to get worse as i get older. i'm already totally incapable of remembering where i parked my car without writing it down lmfao and i can't get anywhere without a GPS even though i've lived in this city for years. what's next? when am i going to start forgetting people???\n\ni don't know. i'm too scared to make a doctor's appointment. i think i'd rather die than go senile by the time i'm forty lmfao. that's all.\n\ni don't know. i just want my fucking brain back, but it's basically the one thing in your body that doesn't regenerate lol. i'll never be the same, and i don't think i'll ever really be able to write again. i'm pretty sure even this post probably makes no sense.\n\ni'm not going to kill myself /right now/ or anything. i've just found it really hard lately to motivate myself \\~back into the swing of things\\~ when i feel like... i don't know, i feel like my former reason for living is just gone.\n\ni guess i just have to live my life in a more physical way now. i can be an extra set of hands for an organization. i can cook. i can exercise. i just can't be the same person i was anymore. and that deeply, deeply upsets me.\n\nif i had more courage, i WOULD kill myself right now because i kinda feel like i'm dead already anyway. that's all.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oehmhx/_/", "title": "~", "social_network": "reddit", "user": "vixenvulture", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1625523178, "permalink": "/r/SuicideWatch/comments/oehmhx/_/", "nsfw": false, "first_save": 1635422267.1273236, "replies_charged": false}