{"id": "t5_2qpzs_t3_e4bdx4", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "I don’t know how to handle it. She told me via text. My first instinct was to text her the suicide hotline number. It has been some time since she has expressed anything related to suicide, but she used to threaten suicide if I didn’t meet certain demands of hers. We have been doing couples counseling, and I tried contacting our counselor but it is night where I am and he hasn’t responded. I called her mom who she is on good terms with to see if she could help. That is ultimately how my wife’s best friend got involved and successfully made contact with my wife.   I read the two posts linked in the “about this community” section. I want to help my wife however I can, but am really afraid of falling back into accepting ultimatums that I otherwise wouldn’t because of the crisis. I tried to get her connected with other resources but I feel a lot of shame that I chose to distance myself. I think I made mistakes, I told her that threatening to commit suicide isn’t going to change me and that I can’t control what she chooses. I told her that I hope she chooses to live and that I couldn’t be her primary support for suicidal behavior. Her responses were short, with the hotline she just said no, with the talk of threats she just said not a threat, and the last text she sent to me just said goodbye. Her mom has reached out to me and to let me know that she is safe. Now I’m on reddit crying and second guessing myself. I understand that the best place for us is professional help, and that is what I intend to pursue. Did I say anything I shouldn’t have? I feel like I don’t know how to balance guarding myself against manipulation with taking every suicidal threat seriously. I don’t even know if balance is even an appropriate way to think about that conflict. I am open to any advice or criticism about how I handled things.", "url": "https://www.reddit.com/r/SuicideWatch/comments/e4bdx4/my_wife_threatened_to_commit_suicide_after_a/", "title": "My wife threatened to commit suicide after a fight we had. She is at her best friend’s house and I believe her to be safe at this point.", "social_network": "reddit", "user": "ClosetedStraightFox", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1575178128, "permalink": "/r/SuicideWatch/comments/e4bdx4/my_wife_threatened_to_commit_suicide_after_a/", "nsfw": false, "first_save": 1635425250.5560408, "replies_charged": false}