{"id": "t5_2qpzs_t3_of1qhx", "request": ["ee176c24-5d0b-47eb-8f0f-71f3b585684e"], "text": "I'm nearly 20, Male, living in the UK. \n\nGrowing up I lived with my mum, my step dad, and my two half brothers. I was always an angry child, at 10-11 my mum called the police on me because she kicked me out and I smashed a window.\n\nI went to live with my dad as I was starting secondary school, he never made me do anything and allowed me to play video games all day long. I stopped washing as often and therefore started to get bullied for having greasy hair by a lot of the people I thought were my friends in primary school. Soon after I moved schools and over the next 5 years my confidence slowly increased and by the end of it I got along with nearly everybody. However during that time I spent pretty much all of my time, that I wasn't sleeping or in school, playing video games, to the point where I've now spent 10s of thousands of hours of my life gaming. My attendance and behavior at school gradually got worse and worse. I didn't care about revising for any of my GCSEs and therefore failed most of them. After school I didnt stay in contact with any of my friends. Then I went to the local college, but once again didn't care about the work and skipped a lot of days to play video games. After a few months I met my ex online and soon after dropped out of college. \n\nI remember the first time I met her, I saw her walking towards me and I remember thinking she was the most beautiful person I had ever seen. Also I could see she was nervous and I felt more confident than I had ever felt in my life and every time we met then on I had the same level of confidence. However I wouldn't meet her very often as she lived an hour away and her parents didn't like me. Also after dropping out of college I started to develop social anxiety as I never went out, never met any friends, stayed in my room all day playing video games and talking to her. After a year of dating her we started to argue a lot more, she would often lie to me about things that would happen because she was scared of my reaction, and then eventually when I found out I would have a go at her and end up blocking her. She was very insecure and couldn't understand why I took out all my anger on her and just wanted to spend my entire day playing video games, and on top of that i accidentally got her pregnant twice and she lost them both because of stress. Towards the end the arguments seemed to happen every week and I didn't realise it at the time but now I know her life must have been hell. She struggled at college, her parents were very strict, she had to sneak out and get a train to visit me, as I was too insecure to visit her, and on top of all that the person she loved would treat her like shit and prioritise gaming over spending time with her. \n\nAfter two years of dating her, and an argument about me getting an aquarium with my benefits money I decided to leave her. My biggest regret. I started to quit playing video games and after about a month I contacted her again and found out she had found someone new. It almost killed me, I started to drink alcohol, cut myself and spent a lot of my nights sitting on a bridge over the motorway. \n\nFor two months I tried winning her back, but she lied to me and was actually dating this other guy the whole time. Over the 6 months after I left her I spent everyday drinking and was arrested 3 times and nearly sectioned 3 other times for trying to kill myself and calling the police saying I had weapons to try and have them kill me, and everytime I was handcuffed I would try smashing my head on the ground or wall because I wanted to punish myself.\n\nIt's over a year later, I've been taking mirtazapine for the last 8 months. I think about her every single day and have tried contacting her so many times with fake accounts but every time I get angry that she hurt me and just end up trying to hurt her more. \n\nAnd if all that isn't bad enough, every time I've tried to hurt her I've used every secret thing she told me she was insecure about because I wanted to hurt her as much as possible. I know this is pure evil. \n\nI now live in a caravan outside my mums house, I don't play video games anymore, I've been going to the gym everyday for the last few months, I've started to read books. I've got a few tattoos. I've tried to move forward with life and actually become a man. But since taking mirtazapine my memory has got a lot worse and I struggle to think straight. Which is good for not obsessing over my ex but how can I have a future and live if I can't even think. And a lot of the time I don't see the point in even trying, the best case scenario is I become a man and independent but even then I know i'll end up hurting more people and I just don't want to hurt anybody ever again. \n\nI just don't know what to do and my reoccurring thought is that if I kill myself than I will spare a lot of people pain in the future, and I guess to also stop myself from being hurt again.", "url": "https://www.reddit.com/r/SuicideWatch/comments/of1qhx/no_friends_no_job_no_relationship_im_not_a_good/", "title": "No friends, No job, No relationship. I'm not a good person, I've hurt people my entire life. Is suicide righteous if it prevents more harm from being inflicted.", "social_network": "reddit", "user": "AnonymousSolitude", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 25, "down_vote": 0, "creation": 1625598440, "permalink": "/r/SuicideWatch/comments/of1qhx/no_friends_no_job_no_relationship_im_not_a_good/", "nsfw": false, "first_save": 1635427835.449357, "replies_charged": false}