{"id": "t5_2qpzs_t3_ombvn3", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "I used to be very passionate about helping people. I had so much optimism and good will in me, knowing that I'm not an expert I still hoped that I could cheer people up. I remeber trying to put words together so they wouldn't sound cheesy but also be understanding. Sometimes you don't know what to say. What could you anwser to a question like \"What's the point  of it all if we're going to die anyway?\"? At first, you get stunned. But then you say that life has it's good sides and bad times make us appreciate them more amd we should use the one shot we have at life. I remember giving such anwsers almost automatically, without really thinking about it. It seemed obvious, right?\n\n&#x200B;\n\nFlashback to now, I had a suicide attempt 3 months ago and got stuck in a psych ward for a while. I got out by not speaking about my thoughts, I guess doctors thought that if I don't talk about something, I don't think about it. But to be honest, suicide never left my mind. I think about it every day. I want it. I crave it\n\n&#x200B;\n\nI got results of my end of high school exams. I did very well, far better than I anticipated. The moment I saw the results I realised I hoped they would be awful. That way I would have an excuse and more bravery to end it all\n\n \n\nI'm not sure why I'm writing this here. To be honest, attempts at trying to comfort make me sick. I feel like puking every time I see another \"You matter ❤️❤️❤️❤️❤️❤️\". Even those of you with the best intentions will be able to write a comment like \"I know it's hard, it will be better.  Blah blah blah\" which will make me roll my eyes. Even if someone means well, how can you not get annoyed hearing the same things over and over?\n\n&#x200B;\n\nIn  a week I'm going to another psych ward. I have exactly 0 faith in it. I've been going to therapy since I was  4, my number of therapists has entered double digits. Truth be told, therapists don't have any magical recepies for fixing you. You hear from them the exactly same bullshit you'd see if you googled \"motivational quotes for depressed people\"\n\n&#x200B;\n\nI guess the only reason why I'm writing this is because I can't really talk about it to my friends. They'd mean well and tell me the same things as everyone but I really don't want them to see the type of anger those cheesy lines invoke in me. Tonight I will probably tie and untie nooses out of boredom whishing I had enough courage to try again\n\n&#x200B;\n\nIf for some crazy reason any masochist will decide to comment on that post, I'm sorry in advance. I'll be very angry and irritated because everything you can say I've heard millions of times. You're better off spending your energy on someone else", "url": "https://www.reddit.com/r/SuicideWatch/comments/ombvn3/i_used_to_be_a_supporter_like_you_guys_its_a_lie/", "title": "I used to be a supporter like you guys. It's a lie though", "social_network": "reddit", "user": "Emotional-Age-6394", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 67, "down_vote": 0, "creation": 1626553083, "permalink": "/r/SuicideWatch/comments/ombvn3/i_used_to_be_a_supporter_like_you_guys_its_a_lie/", "nsfw": false, "first_save": 1635427012.2931302, "replies_charged": false}