{"id": "t5_2qpzs_t3_q3vxo3", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "Could someone please tell me what's wrong with this logic? If you can, it will stop me from starving myself to death:\n\n1. If people with paid jobs work (and earn) less while being self-sufficient, it creates more jobs for other people. (BENEFIT 1)\n2. There are lots of people in the world who need jobs, such as all the people illegally migrating to the US from countries with a scarcity of jobs, and in this global economy everything is connected at some level.\n3. If a lot of jobs are created through #1 in many different countries, through #2 it helps people in other countries where most people are too poor to work less if they are employed at all. (BENEFIT 2)\n4. People with high incomes are the best-positioned to work less because they have the greatest influence on the cost of living, such as the cost of renting a one-bedroom apartment.\n5. People with high incomes are more likely to be on salary, instead of an hourly wage with overtime.\n6. If people on salaries were instead paid a flat amount or an hourly rate for a medium number of hours (such as 20 to 24 each week), and then a lower rate for hours above that, they would want to work less time even if their actual pay was adjusted periodically to maintain the same average compensation per unit of work done. (\"Novel economic proposal\".)\n7. If most people who were previously on salaries want to work less, on average they will work less, even if some of them are forced to work more.\n8. If lots of people who used to on salaries work less, then other people with similar education and competence who own businesses (who aren't employees) will also feel comfortable working less.\n9. If highly-paid people work less through #7 and #8, and jobs are created through #1, then the decrease in unemployment puts pressure on wages and leads to poor people having a higher wage rate, in addition to having jobs. (BENEFIT 3)\n10. The standard of living today is 10 times higher than it was 200 years ago, or something. If you define standard of living based on services, this is reasonable, since it used to be that something like 70% of an economy was from agriculture, and now agriculture is like 3% and most people in advanced economies work in the service sector (agriculture, industrial, service).\n11. If people work and earn less while still having a much higher standard of living than someone 200 years ago, they will use fewer resources and buy fewer things such as commercial plane rides.\n12. Fewer resources used means less greenhouse gases emitted. (BENEFIT 4)\n13. If there are fewer people in poverty through #9, there will be more support for environmental policies that harm the poor the most, such as banning cheap but wasteful single-use plastics. (BENEFIT 5)\n14. The more problems we fix like greenhouse gas emissions, the less we suffer from paralysis of indecision due to being overwhelmed, and the better we can deal with remaining problems. (BENEFIT 6)\n15. Getting people to choose to work and earn less is key to this entire chain of consequences and benefits.\n16. \\#6, \"Novel economic proposal\" accomplishes #15.\n\nI have not eaten in 14 days and don't intend to eat unless people use \"Novel economic proposal\". If you can show me that the above logic is wrong, I can stop caring about \"Novel economic proposal\", and will eat and avoid dying. (My BMI is around 19.4, obviously down quite a bit, but if being thin is the only thing that kills you, I have a ways to go.)\n\nThe exact reasons why I have stopped eating are a little too complicated to go into here. (I talked about it with my dad for around two hours a few days ago.) If you criticize me for choosing not to eat, instead of evaluating the chain of logic above, you are precisely why I am not eating.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q3vxo3/do_some_critical_thinking_and_save_a_life/", "title": "Do some critical thinking and save a life", "social_network": "reddit", "user": "Taemojitsu", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1633693019, "permalink": "/r/SuicideWatch/comments/q3vxo3/do_some_critical_thinking_and_save_a_life/", "nsfw": false, "first_save": 1635426608.0293083, "replies_charged": false}