{"id": "t5_2qpzs_t3_q3dy77", "request": ["37248a85-36ad-4f27-afa2-d6240c3a39c2"], "text": "Tw i guess. Sucide, self harm and alcohol. \n\nFeels like a joke. \n\nThis happend more than 2 weeks ago.\n\nI drank a lot of alcohol, like a lot. In total around 12 drinks . Not that far from a deadly A OD amount.\n\nAfter around 4-5 drinks on full stomach i just went to near my old school to just get some memories. Memories of how i was bullied and how i deserved it. \n\nI don't think i can put it into words but in 4th-6th grade i was sooooooo fucking cringe. I'm not using that word ironically i was fucking pathetic. I'm 15 years old now and realize how stupid i was.\n\nI thought people liked me and laughed with me but people where laughing at me but I'm socially stupid as hell.\n\nI was supposedly the \"funny kid\". That's what i thought tho. But people made fun of me. People would literally come to me and tell me to repeat a certain phrase and i did it. They would laugh and i though they where Being nice so i was happy and through i had friends.\n\nBut laughing my fucking ass off.  Here i am 4 years later and realize they where bullying me. How fucking stupid was i .\n\nI liked reminding myself of this to push me to kill myself. I don't blame them for bullying me. They had good time and i wasn't innocent as i was easily aggravated , anyway back to reality.\n\nI took like 3-4 more drinks went to the old super market and bought my favorite candy bar and danced in the toilet a bit to my favorite music.\n\nAfter this i knew what i had to do. Today was the planned day i thought. It was around 9 am. There was no going back \n\nI took the bus ride to the train station now. \n\nHere i was, approaching what was supposed to be my death.\n\nI was excited and happy. This was the day i will rest.\n\nBut i was sad how things could have been different.\n\nI texted my online friends and just told them goodbye. I drank 2 more drinks. ( I drank dialuted ethanol solution, 21% Strong. It tasted fucking disgusting lol).\n\nMy last memory was me sitting near the railroad. And texting a good online friend and telling them to not be cringe like me and saying\"don't take it personally if i don't respond\".\n\nBut here's the fucking plot twist \n\nI blacked out and don't remember anything else..\n\nLooking through my chat history with a online friend, i said \"I'm sorry if I don't respond, I'm laying on the train track right now\".\n\nBut this does not make any fucking sense. I would have been dead then or lost limbs.\n\nHowever, i just got cracks in my skull, really mild bleeding in the brain, broke one rib bone, my leg got Broken, and my foot ankle and knee Bones moved a bit (my foot ankle got a operation and they placed some plates Into it lol).\n\nSo apparently i was laying on the track.\n\nBut I'm alive and no limb lost but I'm injured.\n\nHow the fuck did that happen ?\n\nDid black out me change his mind and lay in a non fatal way ? \n\nI literally planned to lay on top of the track so i die but it seems i was a pussy and changed my mind and wanted to live.\n\nIf that's the case how did i get injured and break bones ?\n\nMy head got a strong injury i guess. It bleeded for some time but stabilized later  luckily. And I've been having really bad headaches since and Shitty memory .\n\nThe police found my clothes filled with blood too lmao. My right knee (Wich got Borken) had a deep fucking scar (it got stiches) and my left has 2 small ones and my right part of the lower leg has lots of scars (not cutting or self harm it's injury).\n\n\nI don't understand. Did the train hit me ? If yes i would be dead but if no how did i get injured? I told my online friend i was laying on top of the track, did blackout me lie to a person that was really nice to me, wtf ?\n\nWhat's more funny ? The police found me laying on the train track !\n\nThis is in Sweden but i literally talked with them in English. So I was unconscious. I told them \"i just want to die \" in a sad voice.\n\nI can speak Swedish. Wtf ? Why did i speak English with them ?\n\nHow did they find me on the train track/ railroad if im fucking alive and i didn't lose any limb.\n\n\n\nI really want to look through the security cameras but i have no idea if i can.\n\nThere's Only one logical explanation i can come up with .\n\n1) i texted my online friend (when blacked out) while laying on top of the train track.\n\n2) When the train strated coming i changed my mind because \"life can get better\" (lmao no ) . Or because i was afraid of the pain.\n\n3) i layed longways on my stomach so the train doesn't hit me.\n\n4) a part on the right side of the train hit my back / leg, my right rib cage and my right leg and and this made me slam my head on the floor and i got cracks in my skull.\n\n5) my head injury made me unconscious so i talked English (the language i talk in my thoughts with) with Swedish cops.\n\n6) i told them i want to die.\n\nHowever this does not line up with the final part.\n\nIf i wanted to die , why did i then try to survive the train by laying under it instead of on top of the train tracks ?\n\nHuh ? Wtf ?\n\nThis makes no sense.\n\nWhat do you guys think ? Does this logically explain how i survived ?\n\nBut why did i tell the cops i want to die if i intentionally survived.\n\nWhat if i actually did lay on top of the train track but the train hitted me in the perfect way that made me survive and not die ?\n\nBut wtf ? That's like a 0.0000000000000000001% chance and is not logical. Train literally weight hundreds of tons and are fast as fuck and those who do survive train sucides always lose a limb but i didn't.\n\nSo theory 1: i changed my way in the sucide \"attempt\" and layed longways so i live. However if i did this, why did i tell the cops i want to die ? Attention seeking? Wtf ? Why did i tell my online friend i layed on top of the track\n\nTheory 2 : i somehow got hit in the perfect position where i git injured and survived without losing a limb.\n\nI have no idea what the actual fuck is real and happened tho as i blacked out.\n\nI hope they will let me watch the security cameras tho and find out.\n\nNext Time I'll attempt sucide, i guess no alcohol since it fucks you up.\n\nIf theory 1 is True , does This even count as a suicide attempt or just a pathetic bs act ?\n\nI planned to kill myself when sober and when i was Drunk, before the blackout i was planning to die. But it seems blackout me changed his mind. Is this even a sucide attempt?\n\nThis is all a theory tho . A sucide theory. Thanks for reading.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q3dy77/i_dont_know_even_whats_real_anymore_i_think_i/", "title": "I don't know Even what's real anymore. I think i didn't really attempt sucide? It feels like a joke. Did i actually attempt or did i change my mind midway through the \"\"attempt\"\". Does this really count as a suicide attempt? Did i change my mind ? Or what the fuck happened ?", "social_network": "reddit", "user": "throwaway023829", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1633627282, "permalink": "/r/SuicideWatch/comments/q3dy77/i_dont_know_even_whats_real_anymore_i_think_i/", "nsfw": false, "first_save": 1635428518.8028681, "replies_charged": false}