{"id": "t5_2qpzs_t3_6btqj9", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "I spent an entire teenage life abstaining from drugs because I wanted to enjoy them as an adult with a fresh brain before I realized the threshold between child and adult is a hopeless blur. That and bad genes- the genes have been winning out so far. I just enjoy being altered.\n\nI'm a college dropout with no skills, retail/fast-food-level experience, and no vehicle. Day job applications are essentially the shittiest lottery ever. My hope is placed in being lucky enough to win minimum wage.\n\nI'm the same person in real life I am on the internet. There's no real mask of anonymity I can use to flatten my self-esteem into a palatable wafer. Some of that bitterness may come from my girlfriend's proliferous digital social life while I utterly failed at the same thing while we lived in the same room for years. I can be charming at best, but it feels like such a matter of luck.\n\nShe moved back to where we just came from after months of telling me she didn't know if she wanted to be with me. Then a couple of weeks of expressly wanting a baby and a family and a future. Then she moved and hasn't had a conversation with me in a week.\n\nI know what I need to do. Try harder to get a job, learn a marketable skill, open myself up to people more, and move on from her at worst.\n\nI don't need to be dragged through it. I just need friends. Somewhere to go.\n\nI'd like the beach. I'm right there. Just no car to get to it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/6btqj9/28_already_10_years_of_budding_addiction_no_job/", "title": "28 already. 10 years of: budding addiction, no job again, perpetually self-destructing family, a complete inability to make new friends, and my girlfriend of 10 on/off years just moved back to Baggageboro.", "social_network": "reddit", "user": "badluckartist", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1495078187, "permalink": "/r/SuicideWatch/comments/6btqj9/28_already_10_years_of_budding_addiction_no_job/", "nsfw": false, "first_save": 1635422558.854923, "replies_charged": false}