{"id": "t5_2qpzs_t3_isql1c", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "(English is not my first language, I'm sorry)\nMy whole life was always nuts. I'm the son of a normal couple with two kids: an absolutely genius, graduated at 19, married at 19, always hardworking and so damn smart.\nI always tried to keep up with him. Got a whole bunch of school achievement, they kinda considered me a genius, I got a few TV shows and Newspapers cover me as such smart kid I always tried to be.\nBut later, when I got older, I started to break.\nI got into one of the best universities in my country. Failed miserably on my freshman year. Dropped out of it in the half of the second year. Got into another great university in 2020, the pandemic scenario made me drop out of it and so I kept drowning.\nI always had mental problems. From anxiety to depression to bulimia to panic attacks to attention problems and a little Asperger.\nI tried a few treatments, every time loathing more and more treatments. Thinking about going to a psychologist or taking pills makes me wanna die.\nI don't have a single thing in life that makes me happy. I noticed I was way too toxic to my friends so I decided to live \"alone\"(I talk only to my parents as I live with them).\nI don't want to die. Really, thinking about suicide makes me feel sick. My half-sister tried to commit suicide when I was younger and that got into my mind. But I really don't want to be alive anymore. I'm such a burden to everybody, I'm turning 20 tomorrow and I can only see a fraud when I look in the mirror, It has been at least 3 years that I can't do anything right in my life, I'm a huge disappointment to everyone that ever met me. I'm getting fat because I don't feel like leaving my bedroom, I don't have a single person that I feel comfortable talking to, I hate myself and everything that my family has been through because of me.\nI won't change my life, I tried. Again and again. They gave me many chances. I failed every single one of them. My life is this shitty mess, I don't have the courage to suicide, I don't want to live. I wait every day for a miracle to happen, but I know that's not how life works. What do I do?", "url": "https://www.reddit.com/r/SuicideWatch/comments/isql1c/between_a_rock_and_a_hard_place/", "title": "Between a rock and a hard place", "social_network": "reddit", "user": "OldCardigan", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1600107440, "permalink": "/r/SuicideWatch/comments/isql1c/between_a_rock_and_a_hard_place/", "nsfw": false, "first_save": 1635422939.7059073, "replies_charged": false}