{"id": "t5_2qpzs_t3_pikrh3", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "\"If you don't try, you'll never be happy\" is a response I have heard a lot from therapists, support workers, doctors etc. They're not saying that trying is guaranteed to make things better, but that it is like buying a lottery ticket to happiness; if you go out and try hobbies, apply for voluntary jobs etc, you'll eventually find something which gives you a sense of self worth. At least in theory.\n\nBut, what if you simply don't have a way out. I am 27, about to turn 28. I live in a tiny village, about an hour away from a tiny town in the north of England. I have no job, no friends and no hobbies or interests. I haven't had any of those things for about a decade. In the past I have made my hour long bus journey into town, and met therapists, and they tell me to \"try things, anything\". And because deep down I used to want to be happy, I would get swept up in their advice.\n\nSo I would go for a run each day. After my run I would feel the fabled runners high. I would then eat a healthy lunch, get on a bus and walk around and take in the sights and sound of my local area. Afterwards I would come home, practice mindfulness and then go to bed at a nice healthy time. \n\nAnd I would do this for several months. Until inevitably I feel stuck. I am still unemployed. I still have no friends. There is still nothing for me to do and little self contained hobbies like cooking, watching movies, reading, they only distract me from life. So I go back to the therapist. \n\n\"Hey. I'm trying out living a more active lifestyle. I don't sit and ruminate with my negative thoughts anymore. But I'm still miserable. Life is still just distracting myself until eventually I die. And I am severely limited in regards to how much I can make positive change due to my environment and income. How do I keep going? What is the point of keeping going?\"\n\nI have asked that to multiple mental health professionals, mainly because the only people I ever talk to are mental health professionals. They never really have an answer, just variations on \"life is full of ups and downs, keep going and you'll experience ups\". Which is true, but I don't feel that's worthwhile. \n\nI'm not sure why I'm posting this vague aimless rant. I've felt lost for years and never spoken out. I probably won't end it all in the middle of the night as I can't quite cross that barrier, despite wishing I could. I guess I just want to know, how does one progress when financially and geographically, you've made the best of things but you're still alone and miserable? And what really is the point of life? If I woke up tomorrow in a new place with a career and friends, there's a good chance I'd still succumb to depression and anxiety. So why keep going when life seems to just be about distracting yourself for as long as possible? \n\nI've posted here in the past several times and had no response so I don't expect one now; the sub is so full of us miserable lot, there's only so much support out there. Hopefully someone in a similar position reads this, says \"fuck you b00perman, I'm going to find a solution\" and manages to succeed where I've failed.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pikrh3/not_everyone_has_a_way_out/", "title": "Not Everyone Has a Way Out", "social_network": "reddit", "user": "b00perman", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1630874012, "permalink": "/r/SuicideWatch/comments/pikrh3/not_everyone_has_a_way_out/", "nsfw": false, "first_save": 1635428005.1579158, "replies_charged": false}