{"id": "t5_2qpzs_t3_ez2ao7", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I hate my god damn life. I was a mistake from the beginning, my dad never wanted me and left before I was even born, and as soo as my step dad was around and my siblings were born that I wasn't really wanted by my mum.\nShe kicked me out and sent to my grandparents at 15 because she was scared I'd harm my little sister as I was harming myself. I smashed a glass and sliced open my arms in front of her but instead of try and help me she kicked me out. Never for asked if I was OK, or what's wrong.\nShe barley ever messages me, unless sit to remind me to buy my siblings something for their birthday. I'm 24 next week and I bet I won't even get a message. \nI'm married. My husband would be better off without me. He thinks he'd never find someone but I know he would. He'd the sweetest, but unlike me he has a supportive family. Who would probably be glad to see the back of me too, they much preferred the mother of his child than me, even after I joined their Mormon cult. But I left that behind years ago.\nI lost my job because I'm sick a lot recently. Flu. Migraines. Doctors even signed me off, but I still for fired. Another reason husband would be better off, less of a financial burden. There's my fur babies, but the cats would have my husband anyway to take care of them. They prefer him anyway. \nI'm a fat loser who can starve herself and still gain weight. \nI'm a waste of a life that someone else deserved.\nI don't wanna be here anymore buy I'm too much of a little bitch to do it so I wallow in my suffering more and more.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ez2ao7/i_want_to_die_but_im_too_scared/", "title": "I want to die but I'm too scared..", "social_network": "reddit", "user": "CatsloveAnimetoo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1580870828, "permalink": "/r/SuicideWatch/comments/ez2ao7/i_want_to_die_but_im_too_scared/", "nsfw": false, "first_save": 1635422332.5649421, "replies_charged": false}