{"id": "t5_2qpzs_t3_dfesbq", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "She started getting panic attacks all the time while visiting me this year and she got jealous of my other friend. She was bothered if i send the other friend a message while she was present and last time she got panic attack because of this. Strangely now she talks to other friend and not me now... I know her from ten years and I understand that she has mental problems of her own and is tilted towards suicidal behavior. When this happens she tends to cut herself off. \nBut i can't help but feel like i shouldn't have never introduced those two to begin with..  and the only friends who has wanted to stick with me are toxic ones. \nSo why stay if no healthy humanbeing wants to be near me? I had a stroke on my brain when i was 18 and survived almost completely. Meanwhile years later my dad died of similar condition and died. \nMy dad was loved by everyone while i was bullied and can't keep friends. \nI wonder if there is a some godlike thing, ect. If he was taken away because i lived? If i had died would he have lived? \nI know it sounds senseless and i am not particularly spiritual but i can't help this thought. \nThese are more reasons that popped my head today why i should do it. \nBesides... if there is a small chance i could see him again, isn't it worth it? \nI had a dream where he was holding me and we were on a carriage or such. The trees where very green and beautiful and he was showing me around and telling me tales of that place. \nMaybe he was calling me?", "url": "https://www.reddit.com/r/SuicideWatch/comments/dfesbq/my_friend_has_not_spoken_to_me_for_months_and/", "title": "My friend has not spoken to me for months and that's just another reason i am thinking of offing myself.", "social_network": "reddit", "user": "littlered2694", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1570614604, "permalink": "/r/SuicideWatch/comments/dfesbq/my_friend_has_not_spoken_to_me_for_months_and/", "nsfw": false, "first_save": 1635425256.1887944, "replies_charged": false}