{"id": "t5_2qpzs_t3_ncy099", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "What is basically the point of my living despite the fact that I was bullied and then became a bully myself?\n\nI was raised by short-tempered yet caring parents. Their love and care for me was extremely genuine. Unfortunately, I was born in a country where corporal punishment is still a thing. Whenever I am misbehaving and do something extremely stupid, I get spanked, pinched, and shouted at. One time, my mother mildly punched me in the right shoulder for forgetting to tell the real date of my graduation photo online. In a nutshell, I was raised by really flawed but really loving parents.\n\nWhen my brother came in to this world, I was excited to have someone that I could be as best friend. Unfortunately, when he was diagnosed of autism and is very hyperactive, impulsive, destructive, and could not convey his thoughts properly, I was not prepared and inheriting my parents short-temper. \n\nWhat's worse when I was 8th, 9th, and 10th grade, all of the people I thought were my friends started physically and verbally bullying me horribly almost everyday and I kept on getting myself manipulated. I was sexually harassed and about to be stabbed by one of them. Fuck, one of them tried to burn me and they prevented me from escaping. \n\nI told my parents about me being bullied but it 50% helpful, 50% unhelpful. I was hiding my pain, wanting to vent my rage on someone, and that someone was my brother. I was horribly physically and verbally abusive towards him to the point I nearly killed him by smothering him with a pillow. I realized what the fuck I had just become. I keep on apologizing to him but keep fucking up though it was not as horrible as the past years. I wanted to keep this secret along with me in the grave. I really loved my brother, but my actions are showing otherwise. I desired to move out once I enter college because it was far away from my home. Unfortunately because of this fucking pandemic, I am stuck with my brother. I don't want to hurt him anymore and be actual bros. \n\nI wanted to keep this secret along with me in the grave. Both my trauma and guilt pulled me from trying to become better.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ncy099/i_hate_to_live_because_of_my_fucking_trauma_guilt/", "title": "I hate to live because of my fucking trauma & guilt!", "social_network": "reddit", "user": "NoLove_JUNE_30_1988", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1621082470, "permalink": "/r/SuicideWatch/comments/ncy099/i_hate_to_live_because_of_my_fucking_trauma_guilt/", "nsfw": false, "first_save": 1635426192.5248003, "replies_charged": false}