{"id": "t5_2qpzs_t3_p7ebjh", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "Hello,\n\nI'm Dilan Zelsky. I'm 18 years old. I'm from Uruguay.\n\nI'm taking a year off after graduating from high school to solve several issues in my life.\n\nThings aren't going so well for me. I feel overwhelmed, with a lot of pain, and hopeless. I've attempted suicide four times, and planned a fifth but I stopped before I made the attempt. I've been dealing with suicidal thoughts for a few months now.\n\nI'm doing my best to reduce the pain and increase my coping resources. I'm making this post to try to do the latter.\n\nMultiple things led me to this point, and they are:\n\n1. Sexual identity issue\n2. Medical problems\n3. Financial problems\n4. Lack of connections\n5. Choosing a career to pursue next year\n6. Near-constant noise around my house\n\nFirst things first, I'd like to clarify what's up with this year off.\n\nI'm taking a year off because I had a rough time in my last two years in high school. My learning workflow was poor. I spent all of my time working, and no time whatsoever socializing or pursuing any hobby. I went as far as to sacrifice meals and sleep. By the end of the year, I wanted to kill myself.\n\nBut, I thought of taking this year off to make things right. While it's been a chaotic journey, it wasn't that bad. After many years of escapism followed by the last two years, I finally started to understand myself better. I've managed to solve a few issues. Also, I'm a better learner now thanks to the Zettelkasten Method, but there are a few things with it that I need to address before I can call myself a good learner.\n\nAnother reason for my year off was that I had no career in mind. I'm working towards choosing one, but because of multiple factors, the progress has been slow. I think that I can make it in time, but the uncertainty stresses me out.\n\nIn regards with my suicidal thoughts, the main cause for them above all else has been my sexual identity issue.\n\nI learned the hard way that I'm a trans woman. I always thought that there was something wrong with my body, but I didn't pay attention to the thought because escapism and work kept me \"busy\" enough to prevent me from thinking about it.\n\nBut this year was different; it allowed me to become more aware of myself. I realized a lot of things that have always been there, but that I somehow managed to ignore until now. I feel an immeasurable pain in my chest when I look at women, hear them, or see women's clothing. I envy women's bodies and clothing. I hate my body. I don't identify myself as male, nor do I like being treated as such. Also, my feelings and experiences don't match with this body.\n\nI've told no one about any of this. I'm scared of being rejected like my old best friend who was autist. He was put aside, bullied, and went through a rough time. Besides, my family is against trans, gays, lesbians, and so on.\n\nTo make matters worse, it seems that transition is expensive, so I won't be able to afford it until many years later. The idea of waiting until then to finally see myself in the mirror makes me feel miserable.\n\nThen, there are my medical problems. I have a myriad of health problems, and a long way to solve them. Because of COVID-19, the hospitals have been slow, and will likely continue to be this way for some time. Plus, I've been without an affiliation for 10 months, so I've been untreated all during all that time.\n\nAnd of course, there are the financial problems too. My economical situation is unfavorable. Only my father has a job, and what he gains is hardly enough. To make matters worse, my family wastes money on useless things. E.g.: They spend a lot of money on garbage or expensive food like barbeques, sweets, candies, etc. Just to make it clear, I eat none of that.\n\nAnother cause for my suicidal thoughts is my lack of connections. I have no friends, and I'm hardly connected to my family. Also, my mother is the only person I trust.\n\nAnd lastly, there's the noise that I have to deal with every so often. I have two dogs next to my bedroom that bark loudly frequently and for no reason, including at night. I have a hard time concentrating and sleeping thanks to them. There's also my neighbors' dogs which aren't as annoying, but still are. I could do with noise-cancelling headphones and earplugs, but I can't afford them.\n\nThank you for making it this far.\n\nKind Regards,\n\nDilan Zelsky", "url": "https://www.reddit.com/r/SuicideWatch/comments/p7ebjh/im_going_through_a_rough_time/", "title": "I'm going through a rough time", "social_network": "reddit", "user": "Rainbow-Moonshine", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1629377863, "permalink": "/r/SuicideWatch/comments/p7ebjh/im_going_through_a_rough_time/", "nsfw": false, "first_save": 1635428192.5498352, "replies_charged": false}