{"id": "t5_2qpzs_t3_pgr1vf", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "Long story short but...\n\nI signed up to do a teacher training course last year which my Dad will be funding.\n\nI did NOT wanna do it deep down. I just thought in a weak moment, 'this is what my parents want and is a 'normal' thing to do.'\n\nI kept talking about it with them and my therapist and everyone kept saying it's great idea etc..\n\nAnyway I had a lot of time to wait for the course to start so using my own intuition i started doing stuff like talking to strangers on the streets, travelling around Europe. I started really having fun and enjoying life. Before I did all this stuff, I had to deal with my mum trying to talk me out of it and always reminding me 'the course is starting soon!' and 'dont travel or you will die!' My therapist laughed at me and mocked me for my behaviour. My Dad said nothing.  \n\n\nThen I came back and thought 'well I guess I'll still do this course'\n\nEven though to do it I have to spend most of my life savings, lose my remote job which I love and not be able to pursue any of my hobbies.\n\nBut still my therapist said no it's great for the future\n\nI said no way it isn't\n\nAnd he kept persuading me it is\n\nThis is the fucking thing with therapist....they think their role is to train you not to have negative thoughts even though often times those thoughts are totally valid.\n\nBut my problem is I did not have courage\n\nI internalized the voices of my parents and I was too scared to strike out alone even though I had it all lined up\n\nthe job\n\nthe apartment\n\nways to get a visa\n\n&#x200B;\n\nI took the 'safe' choice of being a parasite from my father\n\nyou know what?  \nI fucking hate myself\n\nI have never felt this bad in my life\n\nI feel like I sold my soul and you know what? For the first time ever I am contemplating suicide.\n\nIt's weird because it is SO clear to me now what I should have done - stood up for myself. Now it all seems to clear. But then maybe because it was a 'reality' to be fair I was also playing up fears of leaving too...'what about covid...what about 3 months later or loneliness.' But that choice was ME. It was something I was driven to do through my own needs and wants.\n\n&#x200B;\n\nAnd this is just bowing down to my fucking parents and therapist. I just hate it and I am mad at them for not really caring about me. But most of all I hate myself. I could have not been in this mess if I had just had courage. The lack of courage is not forgivable.\n\n&#x200B;\n\nI ended up doing insane indecisive stuff like quitting my job, asking for it back, quitting again. Apologizing.\n\nI did NOT want to do it. But I ignored my feelings. I ignored my gut instinct. And now I am paying the price. This is sick. I hate myself. I can't sleep. I can't eat. I don't want to talk to people. I can just about act my way through work. But I want to be dead.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pgr1vf/i_have_ruined_my_life/", "title": "I have ruined my life", "social_network": "reddit", "user": "ewok989", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1630617697, "permalink": "/r/SuicideWatch/comments/pgr1vf/i_have_ruined_my_life/", "nsfw": false, "first_save": 1635426616.319632, "replies_charged": false}