{"id": "t5_2qpzs_t3_hmncnu", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "Sometimes I just lay in bed sometimes listening to meditation music, frequencies, and other things. I will not lie...at certain points over the course of the past few months I have experimented with witch craft and subliminals to see if anything can change me, my life, circumstances, etc. I wish something would happen that could return me to not being broken and provide me with the excitement and joy to live again. I'm barely hanging on most days. Do any or you feel this way? Do you ever just wish for a miracle? I haven't left the house in 4 months, given I'm in NYC and quarantine is still ongoing. The thing is I don't even have a desire to leave the house anymore. I don't have a desire to be around people anymore. I've always been broken but I'm bRoKen at this point. Ever since my girlfriend cheated on me and left me I have lost all sexual desire and I was beating the meat everyday before this big mental crash. I sometimes crave food but often have no appetite. I went one week without eating and decided that I'd have to start forcing food down if I don't want to wither away into a skeleton. Working out feels good but my muscles can't recover fast enough for it to be an all day activity. It really is one of the few things though that takes my mind off everything. My family betrayed me before and during the pandemic and I've cut off all contact with them. I have no friends in real life so all I have left is my online friends. They care about me a lot and are the majority of the reason I continue living. We talk everyday but I often find myself not answering their calls or forcing my way through conversation. I love them but my energy to participate in conversation is little to none. It's just hard. I wasn't always like this. I'm not normal anymore. Nothing has changed in my life and I'm getting scared. I'm becoming number as time goes on. I still have dreams but how long is it before those don't exist anymore. How long will it be till the only ideas in my head are literally either killing everyone who betrayed me or killing myself? I'm scared. I just want a path. A clear structured path that will allow me to slowly become human again.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hmncnu/a_wish_a_gift_would_fall_from_the_sky_to_save_me/", "title": "A wish a gift would fall from the sky to save me from myself. Just one thing to stop me from this path of self destruction.", "social_network": "reddit", "user": "locscar", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1594094532, "permalink": "/r/SuicideWatch/comments/hmncnu/a_wish_a_gift_would_fall_from_the_sky_to_save_me/", "nsfw": false, "first_save": 1635422537.3687735, "replies_charged": false}