{"id": "t5_2qpzs_t3_jchrdz", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "(M24)\nMaybe a little backstory first. Last fall I got discharged from military. After some time in hospital and a surgery I went home and started seeing a therapist. Apparently the mentions of my childhood seemed concerning to him cause he started fixating on some of the memories I had. After a few months of talking about it a lot more memories started to resurface. And at this point it turns out that my dad is a pedo. And he molested me when I was a kid. I just can't deal with those thoughts and the memories hence drinking and using. \n\nI also don't sleep, the nightmares don't let me. I can't force myself to eat. I don't shower cause I can't force myself to undress and look at myself naked. And I don't leave my apartment anymore because I'm too afraid of confronting people. I just basically rot in here and spend all my time getting drunk or high and talking to my cat or some rats that moved in recently. \n\nSometimes I feel like the main reason things are so bad in my life is the fact that I'm completely alone. I don't have any friends and my family hates me. I only have a partner, but he's currently on a deployment in Afghanistan. I haven't seen him since February. And I'm not even sure if we're in a relationship, it's more like roommates with benefits kind of thing.\n\nBecause of all that I can't even find motivation to get better and stop drinking and using. Cause no one cares whether I'm sober or wasted. Whether I'm alright or a wreck. And I just can't do it. I'm too damaged to keep going, I have no future, I'm unable to have a normal life. No one would want to stick around cause I'm too messed up.", "url": "https://www.reddit.com/r/SuicideWatch/comments/jchrdz/i_cant_live_with_the_memories_of_my_dads_sexual/", "title": "I can't live with the memories of my dad's sexual abuse.", "social_network": "reddit", "user": "lilywhite-n-poppyred", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1602880590, "permalink": "/r/SuicideWatch/comments/jchrdz/i_cant_live_with_the_memories_of_my_dads_sexual/", "nsfw": false, "first_save": 1635428149.1404712, "replies_charged": false}