{"id": "t5_2qpzs_t3_ejty9h", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I was in middle school. We had assigned seats in pods. Me and the students I sat with chatted often. One day, the question arose from one of the students who asked who at the table liked her and considered her a friend. Almost everyone at our table rose their hand. Seconds later, I asked the same question. No one raised their hand. They looked at me in silence. Some of them gave smug looks as if to say “Wow, why did you ask that? You already know the answer.” It hurt. I asked the teacher the next day to move me to a different table. I sat at a half empty table far away from my classmates.\n\nThe same year in middle school, I was trying to make friends with people in my study hall. One girl flat out told me “Shut up. Because no one cares.” I stopped trying to talk to new people. I just seem to annoy everyone. I don’t even have to open my mouth, and already people hate me. I can’t tell anyone how I feel. They’ll tell me to shut up. They’ll tell me that no one cares. They’ll just look at me with a smug look for expecting anyone to care about me or like me. I keep thinking about these memories and I keep replaying them day after day. It’s like I’m there all over again, being hated or told off. My heart is always hurting at these memories.\n\n\nThese people have probably forgotten about me. But I haven’t forgotten them. If they were in front of me, I’d apologize. And tell them they were right, and had the right idea all along. I’m annoying and unliked, and I’m better off dead.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ejty9h/i_let_two_bad_experiences_drive_me_to_this_point/", "title": "I let two bad experiences drive me to this point.", "social_network": "reddit", "user": "WertlosundUnordung", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1578125463, "permalink": "/r/SuicideWatch/comments/ejty9h/i_let_two_bad_experiences_drive_me_to_this_point/", "nsfw": false, "first_save": 1635426645.2964604, "replies_charged": false}