{"id": "t5_2qpzs_t3_q4c1p8", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "Sorry for this rant, but something horrible just repeated itself in my life and i don't really have friends or a therapist to share with. Yes i'm drunk, no i won't kill myself today, because i never had the balls to do that in the first place. Just have to keep suffering because fuck me, i guess.  \nI hate it so much that i can do everything \"right\" and still get fucked over by life. I tried everything, from simple tips as just trying to be more positive to the other end of things to help with mental health issues like years long therapy and going to a clinic. All of that doesn't matter whatsoever sometimes, the people that you trust can still betray and fuck you over. No matter how much work you put into studying for school, university, etc you can still fail, no person will ever want a relationship with you. But oh no, \"dOn'T KiLl YoUrSeLf! that's the worst thing ever, like dude it will just get better with time xdd\". No it will not. My life will get worse, day by day, no matter what i do.\n\nJust went out to \"party\" for the first time in a while after covid. Didn't feel well for multiple reasons and because i got invited by someone i consider my current best friend and noone else bothered to invite me. They all know each other because of me, they know me for the longest time and up till they knew each other pretended to be friends with me aswell. But, AS HAS HAPPENED BEFORE, they all band against me, form a group with everyone i brought together and exclude me. What horrible thing have i done to deserve this? Idk, honestly, i haven't talked to them for 2-3 days and everything seemed fine then. Last time something like that happened i was told i was imagening things and that i just should keep going and try with a friend group like that. Ended with me having to go to a clinic because i was so suicidal from the lies, the exclusion and tons of horrible stuff they did to me. Even had to move because of that.\n\nSo what now? Diagnosed with severe depression since i was 14, suicidal basicly constantly since i was 16, every day is a nightmare, horrible things keep repeating themselves in my life. Can't find therapy after i moved because lmao have fun calling 50 therapists and getting on 3 waiting lists to get one place after 6+ months. I swear to fking god i have ocd too, i never knew why my mind was my worst enemy and noone seemed to believe/listen to me, but after reading about other people talking about it, i feel understood for once in my life, even small or embarrasing things i never told my therapist seem to be ocd behaviour and i just wish i could get a diagnosis to atleast pinpoint what's wrong with me. But who knows, self diagnosing fucking sucks and i won't see a therapist in \\~half a year so i prob can't be sure for that time. \n\nTldr: my life get's worse no matter what and i wish i had the strength to off myself\n\nThanks for reading, i basicly have noone really and appreciate the time you took out of your day to read this.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q4c1p8/letting_off_steamrant_practically_doing/", "title": "Letting off steam/rant: practically doing everything right and everything still get's worse.", "social_network": "reddit", "user": "_justendmeplease", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1633745073, "permalink": "/r/SuicideWatch/comments/q4c1p8/letting_off_steamrant_practically_doing/", "nsfw": false, "first_save": 1635427095.3536844, "replies_charged": false}