{"id": "t5_2qpzs_t3_q29hdu", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "tried and failed in 2017. spent a night in icu and a week in the ward. made a lot of promises about how i’d never do it again and meant it. adrenaline and near-death optimism wore off after a while but i’d lost the motivation to follow through. started feeling the push again last month. started making some plans, setting some stuff in order, etc.\n\nmy ex killed themself about two weeks ago. stopped everything in my tracks. made a non-suicide pact with my best friend, us both often suicidal and devastated by the loss. for like a week or so i really REALLY didn’t want to kill myself. saw up close what happens to the people around you when you do.\n\nit crept back in. it always does. the day my ex blew their brains out, before i found out, i’d gotten my heart broken by someone else, much the way i broke my ex’s almost a year ago. now the only respite i get from the guilt and bereavement is the resurfacing of the heartbreak i had to shove down. \n\ni’m behind in my schoolwork towards a career i know i can’t manage because of the current turn of events. i can barely make it through a shift at work. i’m 27 and a complete fuckup. my only notable accomplishment in life is not dying despite my best efforts. my life was barely together before. i don’t want to put it back.\n\ni’ve got one round of therapy in me before i give up. i’ve been dxed with half the dsm at some point or another. been in therapy since i could barely form memories. i know how it goes. i don’t think there’s anything new anyone can tell me. i owe it to my friend to try one more time. i’ve tried for almost three decades. i don’t want to try anymore. i’m tired.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q29hdu/not_much_fight_left/", "title": "not much fight left", "social_network": "reddit", "user": "mostplaces", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1633480666, "permalink": "/r/SuicideWatch/comments/q29hdu/not_much_fight_left/", "nsfw": false, "first_save": 1635427700.0685043, "replies_charged": false}