{"id": "t5_2qpzs_t3_q94lau", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "I don't think i need to put this here given the nature of this subreddit but here it is anyway. TW: suicidal.\nThis is a long one.\n.\n.........  .............................................................................\n.\n.\nI've made up my mind. I'm going to kill myself. Nothing will stop me, gods above know i tried.\n\nI'm done with this world. It is far too unforgiving. Far too cruel. There's no place for good people anymore. There's no place for monsters like me who are trying everything to get better, trying to repair the damage I've done. \n\nI'm so tired.. of trying so hard.. every single day.. trying so hard to heal this pain... but nothing helps... nothing works... it only gets worse from here.... never better...\n\nI know what you're all going to say. It's been said before. I know that this isn't the only answer, i know that i'll only pass on the pain. I know that all my friends and family will grieve deeply for my death, and my subsequent absence.\n\nI just cant take this anymore. All this pain.. all this hatred.... where's love gone....... why cant everyone get along...\n.\n. .\n. . .\nNot even personal romantic love can be trusted anymore. Not for me. Everyone i fall in love with.. everyone that falls in love with me... i always.... every.. single.. time... i always hurt them....\n\nI'm sick of it... i'm sick of hurting others.. i've tried to stop.. but nothing works..\n\nMy heart hurts... my soul hurts...\n\nI just want it to end....\nI just want it to end.......\nI just want it all to end.............", "url": "https://www.reddit.com/r/SuicideWatch/comments/q94lau/june_15_2022_sos/", "title": "June 15, 2022. S.O.S", "social_network": "reddit", "user": "Alphantom7027", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634357413, "permalink": "/r/SuicideWatch/comments/q94lau/june_15_2022_sos/", "nsfw": false, "first_save": 1635425193.913016, "replies_charged": false}