{"id": "t5_2qpzs_t3_fbi2vh", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": " don't think I can follow through with this, obviously. I just wanted someone to read it. I feel so alone and would feel better if someone else read this.\n\n&#x200B;\n\n .... is used in place of names.\n\n&#x200B;\n\nFebruary 29th, 2020\n\nDear Reader,\n\nIf you’re reading this, I’m probably dead or in the hospital by a failed suicide attempt. The weight of the world was too much, I just couldn’t take it anymore. I cannot shake the crippling anxiety, depression, stress, fear, and guilt that I have. Every day my thoughts are plagued by everyday fears and evils, why would God want me to live like this? My home was my safe space, now I don’t even have a house anymore. It’s not mine anymore. Octobyr died in that home, and I wasn’t there for her. To some people that may just be the death of a cat but it wasn’t just that, she was my cat. She was mine, she trusted me, she loved me, and I left her. She seemed so sad, and she died when I wasn’t even there to help. I couldn’t have made her final moments any better. If I was there for her, If I stayed she would still be alive. She didn’t have to die like that. If I called Rudolph in the night he went missing, he would still be alive. If I had said more to .... , she wouldn’t have killed herself. She could still be alive. She greeted me every day, “Hey Lord of Sealand!” She made my days happier and less stressful and what did I give her? Just a hi back. Not a how are you, not a ‘let’s do something’, just… a hi. We lost such an important life and I can’t shake the responsibility of the role I played a part in or should’ve played a part in. I never sent in that letter to Mrs. Stevens. I told myself over and over again that I would send her a letter to tell her how much I appreciated her and how incredible of a teacher she was and… she died. She’ll never know how much I cared about her. All because I procrastinated. One of her favourite students didn’t do anything in her time of need. I organized a whole ceremony out of guilt, and for some reason It took me, a student, to organize and write an announcement as well as organize a banquet for her and everything. Why didn’t the school care about her life? I felt sick, everyone turned to me like I was some nice hero when In actuality I was just crippled by guilt. Massive guilt. We had a page for XXXTentacion, a rapper no one knew in the school- a rapper that beat up a gay guy and his girlfriend. He got a page for free and I had to push for our own teacher to get a page. What kind of FUCKED world is that? I’m sorry Mrs S. I’m sorry Robyn. My Grandma died when I wasn’t there, I was at band camp. Our grandma took us to concerts, shows, her house, she did so much for us. She made up for her being a bad mother by being a perfect grandma. To us at least. She was so kind and went so far out of her way to pay for things for us. If she was here, college debt wouldn’t hurt so badly. I wish I could tell her I loved her one last time, and that she could’ve seen me playing baritone saxophone just like her husband. I wish she could’ve seen me play my first solo. I wish she could’ve seen me succeed. I miss you, I’m sorry for being away when you pass Grandma. \n\nI think about my dad a lot. My dad that allegedly hit me so hard against the wall I could’ve died. I think I can feel the mark on my skull. I think about how my mum said he was a terrorist for the IRA, and I wonder if he would’ve ever accepted me if I was gay. When I think of my dad, I think of the time my mum said that If there was a man here, we wouldn’t treat her this way. Of course, it was just a heated argument that went sour since I was defending my twin since I loved him and viewed he was right, yet my opinion was invalid since I was ‘just going to his aid’. I think about that quote a lot, maybe more than dad. Was that a dig at me being gay so I would respect a man? Or did she really think I was a sexist pig? She brought up fear, how we would fear him. I don’t want to live in a world where I would suppose to fear my father. My relationship with mum was complicated. I love her, undyingly so, even if she has said some things that still cut so deeply to this day. She’s denied a lot of it, but what are you going to do. Only my twin and I heard it so its void. She shifted over a new leaf after going to England, and besides crying on our birthday about how awful we were… on our birthday… it had been better. She was nicer, calmer, she snapped less at ... and was overall just nicer to be around. Religion seemed to change her a lot, she was happier so I was happier. Her relationship with ....... seemed to be far beyond repair, even if she refused to acknowledge that she treated ..... differently in the past. ..... just seemed done with her. After her berating him, telling him how useless and evil he was, after actually attacking him a couple of times- he was done. Done with her. Just as mum had been done with Grandma after she put up with too much shit from her. I hope the circle doesn’t continue with ..... I love mum, so much. I wish she didn’t leave. I wish she didn’t leave us. I wish she didn’t leave our siblings with the burden of me and my twin. It’s so awful, it’s so awful. They have to help pay phone bills now, they have to worry about so much when still young and trying to deal with their own lives. Seeing how sad .....  was after having to cosign my loans broke me and has continued to break me. She can reassure me it’s fine all she wants, but I can see it in her eyes, her expression. I’m hurting her future, I’m hurting her chance at grad school. I’m ruining my sister's future. My future isn’t certain. If I’m a failure it’s all for nothing. If I kill myself now, maybe things will be better. \n\nI wish I could sacrifice myself for my family. I wish I could kill myself and as a result, .... music grows extremely popular as it deserves to be, .....gets the chance to work and succeed among the best artists of all, Mum gets to live her happy dream life as a nun, all family tensions are gone and everyone’s happy and most importantly, I wish I could sacrifice for .... success. I want ..... to succeed most of all. He deserves it. He has been the best twin anyone could’ve ever asked for. I hate it when people say he’s the bad twin, the evil twin, it makes me sick. It makes me absolutely sick when they say he doesn’t care or when people insult him. He has been through so much shit and he’s the nicest person I’ve ever met. Nicest person to me. He’s always been there for me, and I love him for it. I want him to be happy most of all. I also want Sebastian and Kaspyr to live long happy lives surrounded by love, what the other cats should’ve had. \n\n... is my sister, the closest person I had for the longest time. Even now I feel so locked with my sister, so connected with her. I feel like we have the same mindset. If we fail, it’s over- i’m over. The stress is too much but It’s all I’ve known. Mum told me to defend her no matter what since she counts on me, I was going to do it anyway. She’s the one that really gets me in a way of work and stress as well as animals- even if we don’t talk about it. I feel like we’ve gotten less close but I think that’s just myself, it’s hard to talk to people I feel like I’m actively hurting via my loans. She has such a big heart, especially for animals- like me. Scott is so perfect for her. Scott makes her so happy and I love Scott for it.\n\n.... is my brother, he deserves the world. Stop calling him sensitive, and mum- for the love of all that is holy… be nicer to him. You have no idea how many times he’s stood up for you, how much he’s done for you. He’s given you money, he’s paid for internet, garbage, he’s done so much to help you. When you say he doesn’t love you, that takes the most out of him since he’s the one that really does the most for you. Please be nicer to him. .... is an angel, he may be the best of us. Never have seen someone so giving and willing to sacrifice so much. Please start to respect him more and show him you love him undylingly. Stop questioning Liz, that was years ago- get over it, please. He’s done far too much good for you to be held down by that burden. He has fantastic music and really is the best of us. Erin is now, and Erin is great. She’s so kind and seeing her interact with .... makes me happy.\n\n..., my mother. Sorry if a lot of this mentions you and stuff you’ve done, I don’t mean to hold you down by your past. You’re in no way responsible for my suicide. I love you mum, more than you can ever know. I know grandma fucked you up badly, you deserved a better childhood. A much better childhood. We love you, we all do. Just please, know that, accept it, and let us know you love us too. This family has a huge issue if not letting each other know how much we care, we get too comfortable with the aspect of us being a family that we get comfortable. We aren’t that close evidently, I learned that this winter break when I got closer to .... than I had ever done before. Mum you have a big heart, don’t let it get crowded by fears and doubts and negative feelings. I can see the doubting you do of yourself cloud your own heart. You feel as if people are out to get you or that you aren’t loved which is probably because of how awful the world treated you. We love you, so much. Let us in. Let them in, let the family in. We aren’t here to attack you, we’re here to love you. I love you a lot mum, even if things have happened before but all families fight. \n\n...., my twin. I don’t know where to begin, I don’t know where to begin. I love you, more than anything else in the world. You are so much to me. Even if I’m shit at actually letting you know it. You deserve the world, I mean that. I would give anything and everything to see you smile and succeed. When you’re sad, when you doubt yourself, it hurts so badly. I can’t let you doubt yourself, your talent, your personality. Thank you for always being there for me. Thank you for always being the one closest to me. Thank you for always making those sweet breakfasts, for always comforting me when I was sad, for all the jokes that you made and continue to make. I love our past, our childhood, what we did together. Everything we made. I wouldn’t trade those memories for the world. You’re my other half. Please continue without me. I know it’s selfish for me to have done this, and I’m sorry for the great grief I’m causing you and everyone… but keep going, for me. Please. You deserve better and to keep going, I’m sorry for this large obstacle I’m giving everyone, especially to you. Keep moving forward, don’t doubt yourself. Don’t let anyone doubt you or insult you, don’t let that get to you. You are NOT useless, you are NOT evil. You’re more than everyone else is and more than all others can comprehend you. You’re my brother, and I love you.\n\nSchool is cripplingly bad. How do people get through this? They just have these hours of work? All these deadlines? They just manage it? They somehow come out on top without feeling like a shell of their former self? All I can think of even now is that If I don’t follow through with suicide, how much homework I’m gonna have. All this debt can’t be for nothing. The first semester was alright, I tried so hard and I succeeded but now… It feels like I’m somehow trying harder, giving my everything and it isn’t even close to good enough. What kind of shitty veterinarian am I going to be if I can’t do this shit second semester? What kind of student and person am I? I can’t do it, I can’t make it to vet school. If I can’t become a vet or a vet tech, I have no purpose In life. I may as well kill myself anyway, I’m going to no matter what basically with how my future is going. Every failure is just a nail in the coffin, proof I’m not good enough and never will be good enough. Proof that the pain I went through for all of high school was worth jack shit, proof that my sisters cosigning and hurt future, as a result, was all for nothing, that I’m a failure. There is no other plan, this has always been my plan since kindergarten. I’m so scared. It seems like I’m tearing chunks out of me and giving it to this school, my studies, over and over again to barely scrape by and then- what about when I have nothing left to give? What happens? Maybe I’m at that point already. I probably am if you’re reading this letter. It’s too much, too much is riding on this. I have no job, no money, and it feels like everything is coming to bite me in the ass. I can’t talk to anyone, I don’t even know where to begin. What can they offer me? What is there to offer me?\n\nWhy do I feel so sad all the time? Why do I feel so weak, so helpless? I lose the will to go on and to do everything more and more every day. I feel so alone, so sad. Every day when I’m alone, those awful thoughts push into my brain. I didn’t mind being gay at first, but every time I go out, I realize how alone I am in that regard where I am. I don’t get it. Why do I feel so apathetic to everything and yet sad at the same time? I feel like those are my only emotions most of the time. Like a robot. I don’t want to be a robot. I don’t want to be Aromatic. Sometimes I don’t even want to be gay. How far my pride has fallen. I hate seeing people discriminated against because they’re gay or killed for it, it means I’m not right or valid in so many peoples eyes. I’m by default a failure.\n\nDr. ... stared into my eyes and kept listing why the lab report was so bad. I couldn’t even succeed in Bio, the one thing I have to be good at. She looked so disappointed, I remember forcing a smile and then going into the bathroom to cry. She expected so much more from me, and I failed her. I’m such a failure, my future will be a failure. This school has really given jack shit about me. If they really cared, they would let the counselors help. The counselor I had for one meeting, Crystal, made me feel human and not crazy and recognized that I should have a stress animal, and if she was given that power, Octobyr may still be alive. She would be here, happier. With me. This school faults me for faults that aren’t mine. I get help from people and turn in projects that fail, under the guidance of helpers and professors and yet it’s still wrong, almost as if I’m being sabotaged. The fact that an advisor told me the wrong price of this school after I asked over and over again to make sure and that led for the loan I got to not be close to good enough is not fair. And for the ones in the financial office to look at me like I’m the one at fault and that I’m crazy when my advisor mysteriously disappeared from campus after he helped. What is this school? Fucking Jigsaws school for trapping and mental torture? That burns me so much on the inside. Why. Why. A part of the reason I went to this school was BECAUSE it was cheaper than ..... It literally became my biggest reason. If this school ended up being bigger than ...., I would’ve gone to .... I should’ve gone. Why lie to me?\n\nI don’t mean all of that. I do love the school here. The staff is amazing and I’ve met some great people here. The professors care so much about the students and they’re well beings and literally try so hard to be there for you and get to know you. Why does the rest of the staff feel so cold and far away? It only adds to the loneliness I feel. I can’t ask my professor to help me with my loans so I can continue to go to school or cry in front of them about all these issues. But it honestly feels like they would do more for my issues than the rest of the staff at financial aid. Fix that before you have another suicide on your hands. \n\nI thought about listing all my friends and saying something about them. What’s the point? What If I forget someone or a paragraph isn’t big enough and they internalize that forever? There really is no point in doing that. There are far too many to list anyways. All I can say is that… I’m sorry. I’m sorry it had to be like this.\n\nThank you for your time,\n\n.....", "url": "https://www.reddit.com/r/SuicideWatch/comments/fbi2vh/i_just_wrote_my_suicide_note/", "title": "I just wrote my Suicide Note", "social_network": "reddit", "user": "BigSadHours666", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 25, "down_vote": 0, "creation": 1583006221, "permalink": "/r/SuicideWatch/comments/fbi2vh/i_just_wrote_my_suicide_note/", "nsfw": false, "first_save": 1635426230.5155745, "replies_charged": false}