{"id": "t5_2qpzs_t3_o63ghn", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "Seriously, sometimes people would have to say, \"well... I guess we should have seen it coming...\". Right? I would absolutely be one of those cases. I'm struggling to find any positive. I'm not trying to succeed in life. That will never happen. I'm literally just trying to survive each day without suffering, and it's impossible\n\n-Physically and emotionally abusive childhood, at the hands of an alcoholic mother. Would hit us, lock us out in the cold. Take us places, drunk, get lost. All sorts of bizarre shit. Show up at school functions, to purposefully embarrass me. This went on for a long time. My whole life was like a secret, only everyone knew of course. \n\n-Father definitely neglected us for a couple years, before they divorced, but then he definitely became a great dad and did everything for us. But he just died brutally last year, right in front of me, from a stroke and fall. His head was split open, leaking blood and fluid onto the carpet when I found him in his room.  Then I sat next to him in the ICU for 14 days, pretty much alone the entire time, other than my brother coming a couple times.  Then me and my brother had to sign papers to take him off life support. I held his hand while he took his last breaths in the ICU. Hes gone. I didn't get to talk to him, say bye, love you, nothing. He was \"awake\" sometimes, but not there. Couldn't breathe, on a ventilator etc. He was my entire fucking world and hes gone\n\n-We had a cat together. He was so old and tired. I kept him a couple months too long probably. He was having trouble eating and using his box. So I had to take him to the vet a few months ago and put him down. My last friend on earth. He was beautiful. Sat on my chest and purred and drooled. Sat on my lap every night after the hospital.\n\n-No friends. I mean literally, none. Zero. My dad died, no one cares. No one visits. One person, from 10 years ago, somehow got my number and texted me a couple times. Thats it. Im being serious. people say they have no friends or family. No. I mean it. I have nothing. My brother, who is emotionally numb from childhood and lives a few hours away.  I live in my dads house until we sell it. \n\n-No job. Horrible employment history because of my health. No way to survive on my own... thats why I lived with my dad. Most of my jobs were physical shit labor jobs. My health killed that, and now I'm applying, and not even getting called, for the most entry level jobs you can think of. Grocery stores, \"big box\" stores, even a walmart. I don't even know how I would survive anyway. its all a joke. \n\n-Paruresis, chronic prostatitis, gastroparesis (been recovering for over a year thankfully), heart disease, currently a nasty prostate infection, two specialists for biopsies every year or two for unrelated things. Horrendous insomnia, like I hardly ever sleep. I try to explain to doctors \"are you NOT sleeping.. or sleeping a little?\".. Ive been getting 2-4 hours of sleep for I dont know how many years. After the recent trauma with my dad, I cant sleep hardly ever. Panic attack for 20 hours, fall asleep for 2-3, wake up, panic attack for 20-30 hours, fall asleep for 2-3. Over and over and over.  Serious PTSD dagnosed years ago, from all the stuff I talk about my childhood. And now with my dads horrendous death on top of it, I cant even breathe or think straight. Days go by and I have no idea what Im doing. \n\n-Health insurance through medicaid, will get fucked if I move out of state, but I cant afford to stay in the state. But I need a surgery in a couple months... so............ Then my meds for my heart, all my Drs visits, tests, etc. I could  never afford all of that. I cant afford to live here, but I even more cant afford to move and lose my insurance. This isnt one-a-year stuff. This is constant maintenance, check ups, blood work, meds etc. I dont even want to get into the healthcare rant. Just the physical. Mental health care is such a joke it doesnt even county. Ive been through the local system for years. Its like out of a dystopian movie. People just moving papers and people around, going through the motions. \"Are you thinking of hurting yourself or others? No. ok good. See you in 3-4 months\"\n\n-Literally no one, nothing. I have nothing. I talk to no one. I do nothing. I barely ear. I hardly sleep. I'm 35. thirty fucking five years old. I have no where to go. No one to live with. No family to stay with. No real way to survive a full time job with my health. I cant empty my bladder in public. I get all sorts of infections(bladder, prostate) currently on antibiotics for another prostate infection. Can't ejaculate because of the side effects of flomax. Also kills your sex drive and erections anyway. The meds for my heart disease make me sick. I wake up every day with diarrhea. I spend 2+ hours in the bathroom every morning. Every day. For years. IBS before it, now the medication its like IBS+\n\nPeople don't understand what \"chronic disease/illness\" means. It doesnt go away or get  better. it usually gets worse. Its getting worse. Theyre all getting worse. Every single day is a living hell. Physically and mentally. I see therapists and psychiatrists. This is what makes it eveb more fucked. I CANT SLEEP. IM FUCKING DYING. I will end up comitting suicide if this keeps up. If I had a reasonable method, I would already. I ASKED for a sleep aid, after years of suffering I finally broke down and asked for prescription sleep aids..., and was flat out told NO. So Ive tried tons of antidepressants/antianxiety meds. They do not help. Im coming completely unraveled. I express this and they downplay it, becuase I say \"yes, I do sleep.. but only a couple hours and sometimes up for days straight\". And they move on. As long as you're getting ANY sleep, move on. \n\nI was the classic great in school, grteat athlete. Mental health finally caught up to me around 17. I went from good student and playiung sports year-round, to failing classes, summer schoool,, staying in bed for a week straight and skipping school. And its like no one cared. I was so fucking depressed from everything that happened and its like it all hit me around 16-17. Now that im older, I realize how small the timeframe was. The trauma happening at say 8-12 years old, was still very fresh at 16. \n\nI dropped out of school. I just refused to go and theres nothing they could do. I was done. All that hard work, quit. Got my GED, tried college, quit twice. Cant sleep. Cant pee in public. Had a bunch of friends at that point. Just gave up and said Im done. They all moved on as we got older (20s) and kept going. I think they call it progression. The only progression Ive experienced is progressive disease. Ive never been out to bars, clubs, etc. Ive never traveled. I havent been on a \"vacation\" out of state in 20 years. Ive never once in my life taken a vacation as an adult. Imagine just saying \"I want to go to XXXX this summer/winter!\"... and being able to go. Not even just financially, but physically. In most cases, you can always save soem money and get there. You can give me $1M tomorrow, I would still struggle to travel anywhere. \n\nI literally shut my phone off (unplugged my land line and message machine too) and just gave up, in my early 20s. One \"friend\" came to my house a couple times to see what was wrong.. literally probably two times, and that was it. ~15 years later... here I am. A fucking wreck. I have nothing to show for it. My medical chart is fucking gigantic. I get that horrible pity look from the doctors when I joke. Its real life though. I like to try to lie to myself, but its true I got fucked. Im not feeling sorry for myself. Its just a fact. I got absolutely fucked. \n\nEvery time I put my head down to try and sleep, the last thing I say/think is \"I hope I die in my sleep tonight/today\". I mean it. I hope I die in my sleep tonight. Thats my only wish. Kill me in my sleep. I dont want to suffer tomorrow. Today was bad enough. The day before was horrible. Tomorrow will be shit. I dont have any \"plans for the weekend\". Weekends don't exist. Its 7 days of shit, followed by 7 more and more. \n\nI want to live and have a life. This isnt it. Ive suffered too much. Im approaching middle age here. Can I be done? ya know.. jesus christ. I cant eat. I cant sleep. I have zero friends. My Dad and cat are dead. They were my family. I have nothing else. I dont talk to anyone. My hobbibes are gone. I have nothing. Its hard to get that across to people. People say that if they died, no one would know. Literally.. no one would know. My brother calls/texts me a couple times per month at most. And its only ever something about the house/estate that we need to do. No one cares. I saw the most traumatic shit you can see. The only person on earth that has loved you and protected you, my dad, laying on the floor of his bedroom, leaking from his head, completely out of it, telling me hes fine and to help him up, as im waiting for 911 because hes had a stroke and split his entire fucking skill open falling. I cant handle it. I literallycant handle it. i want to check myself into the hospital but I cant pee in public and every time im there for something else, i end up holding my piss in for hours and hours. but if they keep my overnight and put me in a psych ward.. i dont know what to do. I need help. I want to live so bad but jesus fuckin christ im fucking 35 fucking  years old and I have not experienced anything that even resembles a life. I cant even go pick up my fucking cat and hug him. I have my teddy bear from when I was a little kid. I have been hugging him lately. Im 35 years old and I lay down and hug my bear on the floor. I seriously want out", "url": "https://www.reddit.com/r/SuicideWatch/comments/o63ghn/when_is_it_justified_i_think_people_would/", "title": "When is it justified? I think people would understand", "social_network": "reddit", "user": "troway0112", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1624414933, "permalink": "/r/SuicideWatch/comments/o63ghn/when_is_it_justified_i_think_people_would/", "nsfw": false, "first_save": 1635426594.018884, "replies_charged": false}