{"id": "t5_2qpzs_t3_o536es", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "I understand this is upsetting. I have tried countless times to improve myself and to take the advice that I give to other people. And it works for a while, but then I go back to being the same person. Every time I think I change for the better that old me always comes back. I don't think I really deserve any empathy, and I'm basically begging to be pushed to the point of killing myself. I want to be actively encouraged and I feel guilty.\n\nThe last time I confided this to my friends, it was heartbreaking to see their reactions. Every time I ask for help they just break more. Even the friend who normally tries to see things from a very logical standpoint and mostly seems intentionally distant was choking and holding back tears and got really genuine, even said he looked up to me. I think that's the most fucked up part, that these people want the best for me and they're believing the lie that I'm worth saving. It hurts to continue to do this to them. At least if I'm dead they can grieve and cope and then move on with their lives with maybe some nice memories. At least then they can put their compassion into someone who's worth it. \n\nI'm planning to at least make it to 23, and on my birthday I'm going to kill myself, which will be in December. Its comforting in a way, just having something to look forward to for once. With the way my family has been treating me I don't think I can depend on them to have my back anymore. I find myself more worried about my friends if anything.\n\nI don't plan on telling my friends on my plan. I have almost slipped in moments of desperation, I don't know if that's the last of the survival instincts kicking in or what. Maybe I just want them to know and make it easier to deal with when the inevitable happens. I wish there was a way I could make it easier for them at least, but I don't know if it's possible.\n\nI don't think other people should do what I do. I understand depression is an awful, awful thing and I encourage people to get help when they can. Just because I'm a lost cause doesn't mean you are.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o536es/i_am_going_to_kill_myself_and_i_do_not_wish_to_be/", "title": "I am going to kill myself and I do not wish to be stopped.", "social_network": "reddit", "user": "Head-Jeweler2797", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1624303417, "permalink": "/r/SuicideWatch/comments/o536es/i_am_going_to_kill_myself_and_i_do_not_wish_to_be/", "nsfw": false, "first_save": 1635423047.3315203, "replies_charged": false}