{"id": "t5_2qpzs_t3_k4j4o5", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "Suicide for me is a taboo theme. I don't like the way how many people react when you tell them you're not happy with your life. Most of them tell me just \"To be strong and stand tall\". I try to ignore them because I know they mean well, but I'm not strong, I don't wanna suffer anymore, I feel like I'm wasting my life.\n\nI'm 18, graduated from high school and from a English academy (here we speak spanish) this year, and I recently got a job to help my mother, we don't actually make much money between us 2 to really afford anything, but we can actually eat good with this budget (considering there is a lot people starving who eat from trash here). My salary is like 5$ worth of bolívares, and my mom's 15$ worth of bolívares. The most fucked part about this is that if you are american, you probably think I'm broke as fuck but we actually are this country rich people.\n\nThere are a lot of things I wish I could do but I can't, I feel like I'm missing my own life. I don't wanna get too political but it's all the government's fault, and things were already rough because covid-19, which only made things worse.\n\nI have a girlfriend which I haven't met since March because gas is scarce here and she lives on the other side of the city, I would go walking but I would get robbed and beaten to death, even if I had nothing to hand out.\n\nMy family isn't very supportive, and being locked at home wouldn't be so bad if we didn't have electrical outtages 6hrs a day. Water is also scarse, but we somehow manage to keep everything clean. Internet is unrealiable, it comes and goes, and when you actually have it, it takes like 10 minutes just to load a fucking google page.\n\nMost of my friends are leaving, I feel happy for them but I feel like I'm left alone here.\n\nCollege here is not cheap but is still affordable, the catch is don't expect to learn everything, and with social distancing don't expect to learn at all lol.\n\nLeaving and moving outside is not really an option since airlines are scarce here, even before covid-19, and the ones we had here charged you like 500$ for a ticket. Right now I doubt they work anymore cause the pandemic. Crossing Colombia's border is like an extreme sport, is hella risky and there is a 80% chance you get robbed and left in the middle of nowhere.\n\nI really do whatever it takes to stay alive, but I can't handle it anymore, things just keep getting worse and is because of someone who doesn't even knows about my existence, the president. I wish I could just stop existing at times but that would only make my family's life worse, I really don't know what to do\n\nYou can check what's going on here in /r/vzla", "url": "https://www.reddit.com/r/SuicideWatch/comments/k4j4o5/how_living_in_a_third_world_country_has_ruined_my/", "title": "How living in a third world country has ruined my mental health", "social_network": "reddit", "user": "LogickalFool", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1606821958, "permalink": "/r/SuicideWatch/comments/k4j4o5/how_living_in_a_third_world_country_has_ruined_my/", "nsfw": false, "first_save": 1635428458.5547698, "replies_charged": false}