{"id": "t5_2qpzs_t3_q7p5wu", "request": ["4162f604-29a0-4041-a85b-c249e1ca13f8"], "text": "I've had MDD pretty much my entire life, but something about now is different. Worse. And I've been suicidal before, & felt even darker than I do now. But something about this time makes me feel like this might really be it for me.\n\nI lost my job back in April. I was miserable there anyways, but then almost immediately after I got hospitalized for extreme high blood pressure (was stroke level at all times & I had a brain hemorrhage from it that caused vision problems (that I healed from)). And now I have meds I have to have that I can't afford, but if I don't have them I'll have a stroke &/or heart attack & die, but I can't afford them!\n\nAnd it's been downhill mentally from there. I have not been able to mentally make myself look for a job (have no car either so finding a job I can get to is even harder than normal), I'm on meds I can't afford with hospital bills I have no money for. At best, I will have a place to live until the end of November or December then I'm homeless.\n\nMy place....is disgusting. I haven't cleaned it in over a year & my depression has been.plummeting to lower realms for a while.\n\nBut I can't make myself DO anything. I need help. I need to check myself into an inpatient thing. But I can't afford to either. \n\nI don't have the time or money to actually treaty depression & mental illnesses....but I also am no longer able to function with them anymore either.\n\nI've been prescribed an anti depressant for the first time during the summer but it literally didn't do anything & the doctor wouldn't prescribe a different kind to try to see it works. \n\nI just don't know what to do or how much longer I'll be able to hold on.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q7p5wu/ive_dealt_with_severe_depression_my_whole_life/", "title": "I've dealt with severe depression my whole life, but my mental health is worse than ever & I don't know that I can or want to make it through.", "social_network": "reddit", "user": "Sheenax1031", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1634174000, "permalink": "/r/SuicideWatch/comments/q7p5wu/ive_dealt_with_severe_depression_my_whole_life/", "nsfw": false, "first_save": 1635422907.4317932, "replies_charged": false}