{"id": "t5_2qpzs_t3_ivtl1z", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": ". I made work decisions and mistakes in the last couple of years that led me down a spiral. Have not been able to recover. Marriage went to shit, it had been a struggle for years. I have a 15 year old son that I feel guilty about for not being the father that he needs now. I am depressed barely functional in daily activities and feel inept. I have someone that loves me and wants me to get better but I just don’t have the drive or motivation or just feel lost. My ego might also be a problem. Where I was and how I’ve fallen and to start at a lower place at 50. Sleep is a problem. Ruminations, constant fatigue and negativity. Lack of motivation. No goal or purpose. Have lost my passion.\nMeds don’t help. Therapy, can’t keep a constant train of thought. People that care don’t seem to understand. I don’t even understand. I am handsome, look fit. Can be helpful and joyful with others. But inside I am full of guilt, shame, apathy, low self esteem and self sabotage. And my world that I used to be in control off, used to travel and enjoy the outdoors and be very active physically and healthy...now I’m just barely hanging on. Can’t barely function one day at a time. Food shopping is extremely difficult. Any decision is difficult. Driving I’m distracted all the time. I have work opportunities that are physical that I used to enjoy. Now I feel too weak or distracted or inept.\n\nHow do I recover? How do I gain control? When I don’t even want to go outside? Or be around people? Or pay bills? Or even take care of my basic needs.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ivtl1z/i_have_constant_thoughts_of_ending_my_life/", "title": "I have constant thoughts of ending my life", "social_network": "reddit", "user": "surfndivejr", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1600525969, "permalink": "/r/SuicideWatch/comments/ivtl1z/i_have_constant_thoughts_of_ending_my_life/", "nsfw": false, "first_save": 1635428071.2223892, "replies_charged": false}