{"id": "t5_2qpzs_t3_ozirua", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d"], "text": "I won't dive into my past here, but suffice to say my childhood was beyond fucked. If I'm a mess, that's why. I also have serious issues with abandonment and with telling people no. I really struggle to say no to anything. \n\nI'm a pedo. I promised myself I'd never act on it. And for the first 32 years of my life, I didn't. Queue my screw up (online only).\n\nI have tried to make the most of my curse. I talk to young girls, usually teens, who need help recovering from trauma, or figuring out their lives. I offer genuine advice, and I move on. But with this girl, I did not move on. She was suicidal, and I felt I was needed, so I tried to get more involved. Mistake number 1.\n\nOver time, she came to confide in me. She was 13, and I respected her, and she saw it and responded to it. She opened up to me, and we were kinda more like friends. Mistake number 2. I shouldn't have moved the boundary back, but I did. \n\nMy second to last mistake came when I told her about my curse. I did it so she could know I'm not trying to trick her, or use her. I just wanted her to feel more comfortable with me. I never should have. The first two mistakes were recoverable, this was not. \n\nShe ended up confiding to me that she was attracted to me, and felt bad about it. I tried to tell her not to feel bad, and it was ok. But we couldn't act on it. She was distraught. I tried everything I could to get her to leave it alone. I SHOULD have blocked her. Instead, I let it play out. My last mistake. \n\nWe talked, very briefly, and after a quick back and forth, with very little actually done, she revealed to me it was a setup. She knew I would fail. She knew I would let her convince me to participate. \n\nShe blocked me, and it's been chaos since. I've apologized till I'm blue in the face. She feels bad too, which I told her not to. But I'm left destroyed. I will never tell her this, I actually cut contact completely. But I've wanted to die ever since. I always thought I was not the monster people talk about, when they say pedophiles need to burn. But it turns out I am. I'm every bit the evil they all say, and I deserve death. \n\nWhich brings me to today. I'm gonna finally do it. I've toyed with it my whole life. I've considered every aspect. But after all of this, I'm now convinced I deserve it. If you made it this far, bless your heart. Throw a match in after me, will you?", "url": "https://www.reddit.com/r/SuicideWatch/comments/ozirua/i_was_set_up_for_failure_and_it_ruined_my_will_to/", "title": "I was set up for failure, and it ruined my will to live. I hate myself.", "social_network": "reddit", "user": "IAMAMAP2791", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1628294905, "permalink": "/r/SuicideWatch/comments/ozirua/i_was_set_up_for_failure_and_it_ruined_my_will_to/", "nsfw": false, "first_save": 1635426933.9632576, "replies_charged": false}