{"id": "t5_2qpzs_t3_qgw6dh", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "As simple as that statement is I've struggled for so longs to accurately put that concept to words. I've been depressed for as long as I can remember and suicidal ideation isn't something I can get away from. I no longer want to actively kill myself, but I genuinely would like to die. On some days I beg for it to just happen. Realistically I just want to stop existing. There are plenty of people who enjoy my company and lament over my absences for there are many times I cannot muster the strength, energy, or willpower to weather the company of others. I will be missed and I know it, even by my co-workers when I inevitably leave my job in search of some novelty because something 'better' seems to elude me no matter where I go.\n\nThere is, however, a distinct lack of intimacy and closeness. The sort of thing I personally view as love. It needn't be strictly romantic but that seems to be where it manifests itself most often. My life is not only devoid of romance, but of romantic intent and opportunity. I don't evoke those feelings in others, regardless of how much my company is enjoyed. I make a great friend and little else. And fewer still are those willing to knowingly engage in a romance with someone who is actively battling depression and failing more often than not. I don't know what to do anymore. Talking doesn't help, medication doesn't helped. I ruminate, discuss, attempt, rinse and repeat but it seems as if naught has changed. I'm still tired. I've always been tired and I feel as though I will always be tired.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qgw6dh/i_am_likeable_not_lovable/", "title": "I am likeable, not lovable", "social_network": "reddit", "user": "idunnowhatosay", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1635339699, "permalink": "/r/SuicideWatch/comments/qgw6dh/i_am_likeable_not_lovable/", "nsfw": false, "first_save": 1635427992.0655737, "replies_charged": false}