{"id": "t5_2qpzs_t3_qeme4z", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "I don't know if this post belongs here but if not please let me know alternative subreddits/forums.\n\nI (17F) have a friend (17M) who is very depressed and doesn't want to live. He is isolated and in the past year has gone through two breakups. He acts very cheery at school and that is why it took me this long to realize something was very wrong. I called him worried last week because he wasn't at school. I eventually found out it was because he had attempted the night before. I was shocked because although he had gone though a breakup two weeks prior, he did not seem depressed. I began to call him multiple times a day and have continued to do so. \n\nI asked him to please pick up when I call and please call me after self harming since I can't stop him. So far he has complied with both. It seems to me that he is deeply depressed, constantly wants to harm himself to stop thinking, and just wants to be dead. He made it clear that it is not a whim and that there is no point to him living this life and all he wants is to die. He says life won't get better because he is a bad person and even if he could change he doesn't want to. He says even if therapy and medication could change his worldview, he doesn't see the point in all the effort. He said even if he lives on to better, different circumstances, life will not change for him. I asked him where he sees himself in a year, he said that he doesn't plan to live that long. \n\nHe is isolated, can't talk to his family or friends. He has access to knives and uses them to selfharm and used them on his last suicide attempt. I am incredibly worried and I think he is very high risk. What do I do? When I am speaking with him I feel like I am no help, but I don't want him to feel alone. We have been close school friends for over three years, but we never spoke about anything like this until now. It is no burden on me to call him all the time and talk to him, but I don't know how to help. I need support. I am starting to understand that I need to reach out to an adult, but I have no idea where to start. His parents are unhelpful, mine are kind but I don't know what they could do other than sit around and offer sympathies. I am scared that if I tell an adult the resulting pressure will push him over the edge. The way I see it playing out is I open my mouth, he initially gets bombarded by well meaning protocol and his private (very private) habits are made public. Then after things ease up a bit, he (someone who is not receptive to help) decided to end it all. I am sure that if I tell someone he will hate me. I am okay with that but I desperately don't want for him to be alone. I am okay with being the villain. My plan in that case is to get his ex to talk to him and they can talk about how I had no right to out him to an adult and she can be there for him as a peer. Right now, the only people who know he attempted are me and his two exes. Neither are really in a place to help him, and one of them has blocked him out of concern for her own mental health. \n\nI just need to know if I am doing things right. I have a lot of the pieces put together but I feel alone and I need someone who knows more than me to clarify some things. \n\nShould I tell an adult? If so who and how?\n\nWhen I speak to him, is it okay that I talk about my experiences with my mother who survived a very similar situation several times? Is it okay that I try to talk him out of it, try to explain to him why I want him around or is all that just making him feel worse? Is it ok that when he is silent on a call I just talk about my day and ramble about random things? \n\nAnd to anyone who has been suicidal and adamantly did not want help or believe that things could get better, were you right? Am I right to interfere when he is so clearly suffering being alive? Am I helping him? Is this what I should be doing? Is there anything that would have helped or supported you that I can do for him now?  \n\nThank you so much just for reading this much. I would like to do something about all this ASAP (in the next 36 hours) , so please respond with any advice, as short or long as you can.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qeme4z/urgent_friend_on_the_brink_of_suicide_please_help/", "title": "URGENT! Friend on the brink of suicide please help", "social_network": "reddit", "user": "Key_Mycologist9640", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1635056241, "permalink": "/r/SuicideWatch/comments/qeme4z/urgent_friend_on_the_brink_of_suicide_please_help/", "nsfw": false, "first_save": 1635427914.9631195, "replies_charged": false}