{"id": "t5_2qpzs_t3_nu4twr", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I just can't feel much anymore, especially when I'm alone. All I can really do now at this point is hide behind a mask when around people and try to relate, but deep down, I know that my feelings aren't real.\n\nWhenever I do actually feel happy, I have to stop myself because I know that there are people out there struggling to feel that way, and so I must stop my feelings because I just feel too guilty to do it.\n\nWhen I feel sad and close to crying, be it from grief or from a sad movie or interaction, I also need to stop myself because there are animals out there who may be going through the same thing and are toughing it out because they need to. So in turn, I feel guilty for that human emotion as well.\n\nBeing a human is not for me, because whenever my human nature hits in, it quickly goes away because of my own toxic, intrusive thoughts. \n\nAnd I can't stop them.\n\nI just want to be gone. I don't care for the people around me, especially since they have hurt so many others, be it amongst themselves or other lifeforms that never deserved harm.\n\nAfter all, life is just a twisted game. Has anyone ever felt the same.\n\nAllow me to elaborate.\n\nIn order to survive, what must we do?\n\nExactly.\n\nWe kill.\n\nWe take other lifeforms and we thieve them of their lives for our own survival.\n\nEvery lifeform is a narcissist simply because of the fact that we must barbarically sacrifice other life for our own well-being, putting ourselves as the first priority.\n\nI don't want to live.\n\nI don't want to take more lives.\n\nThe longer I live, the more organisms that die simply because I exist.\n\nWe are all ruthless killers.\n\nI just want a painless escape from this world that I had no choice to be placed in.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nu4twr/i_cant_stand_myself/", "title": "I can't stand myself.", "social_network": "reddit", "user": "CyBroOfficial", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1623043619, "permalink": "/r/SuicideWatch/comments/nu4twr/i_cant_stand_myself/", "nsfw": false, "first_save": 1635428223.4769084, "replies_charged": false}