{"id": "t5_2qpzs_t3_nkt63p", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I recently felt it was appealing, and interesting to jot down my thoughts, in regards to my thoughts, and how my mental space is as a whole. My mind, the cognition of how I think, and how I feel time to time can be misunderstood, misinterpreted, or completely disregarded because of poor perception from others. Some are from people who are close to me, but a lot of the times it’s inadvertent and I don’t personally take offense to anything they say. Somedays, I just feel very beaten down, trying to find purpose in existence and my own as a whole, and trying to not be portrayed or painted as someone who’s “edgy” and wants to garner attention. \n\nSometimes I make things worse for myself, by being hyper fixated on things that take up my time as of recent. I want to create an habitual process where I won’t get so caught up in everything everyone is doing, or get so upset and fazed, that the vague thoughts I get revolving suicidal thoughts permeating heavily; and so excessively. Realistically, it’s about assisting yourself, based on what people try to give you as support, and I try to take their suggestions as a source of benefit. Sometimes, you can’t, because it doesn’t align with your issues that’s exacerbating your will to live. It is difficult to find “common ground” and reliance in people to some extent. \n\nMental illness is sensationalized, and those who don’t understand how it is, pervade on the concept of what depression is, and how it can create so much disfigurements in the brain. There’s so much intricate context I could delve into, but it would take forever. \n\nJust somedays, with all I’ve said so far, you just simply don’t want to get up at whatever time you choose to sleep. It’s so debilitating, and distorting. Having Autism makes me think differently. I have faith, I just need to find ways to keep that stagnant.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nkt63p/have_you_had_those_days_where_you_wake_up_and/", "title": "Have you had those days where you wake up and wish you didn’t?", "social_network": "reddit", "user": "opaque777", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1621958421, "permalink": "/r/SuicideWatch/comments/nkt63p/have_you_had_those_days_where_you_wake_up_and/", "nsfw": false, "first_save": 1635428115.4845378, "replies_charged": false}