{"id": "t5_2qpzs_t3_oea9i6", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846", "c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "**WARNING** I'm unpacking the last 10 YEARS of my life here, so it will read less like a Reddit post and more like a condensed novel or a confessional. No single person in my life has every piece to the puzzle I'm about to put together for you, and I truly appreciate your time spent in reading this story.\n-------------------------------------------------------------\n\nIntroduction: Dawn\n\nLooking at my life from the outside, you'd think I had truly achieved the \"American Dream\". I'm 28, bought my first house brand-new in Southeast Phoenix, I'm married to a loving wife, and my fulfilling, lucrative career as a truck driver allows my wife to be a stay-at-home mom to our beautiful 6-month old daughter. My family is proud of all I've achieved, especially my hard-nosed, USAF veteran father, whose admiration I've wanted my whole life.\n\nSo why am I contemplating suicide if everything is seemingly going swimmingly?\n\nBecause the happiest part of my life is my job, I actually live in Utah instead of Arizona, and I settled into a marriage with a woman that was just \"good enough\". But the biggest reason of all is that the woman I should have married has moved on, and I can never get her back. Let me take you back to the beginning of what was the best 3 years of my life.\n\nChapter 1: Sunrise\n\nSpring 2012, Southern California. I was a 19-year-old kid doing 19-year-old things. Attending community college, working part-time as a Domino's pizza boy, playing video games, and having casual sex with strangers on Craigslist's Personals section (Remember that?). Like most people, I was much more charismatic online than I ever was in-person, so I was doing quite well.\n\nOne day my phone notified me to a new post by a woman in San Diego, an hour from my parents house where I lived. She was looking for a long-term FWB after getting out of a long-term relationship. Thing was, she was 25 going on 26. Despite the age difference, I sent her an email offering my company. To my surprise, she (let's call her Victoria) emailed me back and we setup a meeting at her place. Victoria would later tell me that out of 80 emails she received on that ad, she only replied back to mine because I didn't tell her \"what I was going to do to her\". Pro Tip: Men are pigs. Don't act like one and maybe you'll get the nod.\n\nAfter about a month of seeing her exclusively, I started to develop feelings for her. I couldn't believe how much we had in common, but I brushed them off because I didn't believe a 26-year-old woman would date a guy 7 years younger. To my surprise, she admitted her feelings for me after 2 months, and she became my girlfriend that summer. I had been in relationships before Victoria, but she was my first love. We had a connection that nobody I've been with has ever been able to replicate. We had our own gibberish language. We would literally finish each other's sentences. We liked all the same things and wanted all the same things. It seemed to good to be true but at the tender age of 19, I had found my soulmate. I thought it naïve to believe they existed, but I became a believer with her in my arms.\n\nVictoria changed me in countless ways but in no way more significant than my career. As I mentioned before, I was a pizza delivery driver when I met her. As our relationship became ever more serious, I realized I wanted to provide her with the life she deserved. Discontent with college, the difficulty in getting the required classes and the cost of a Bachelor's, I dropped out to pursue truck driving. I spent $6500 for a 3 week vocational school, and the day after I turned 21, I obtained my commercial driver's license. Because the field is constantly in-demand, I had a job in less than a week, and I found a lifelong career that's only gotten better as time has passed.\n\nNow that I was making real money, Victoria and I got engaged after 2 years, and were making wedding plans while concurrently planning a move to Phoenix, as San Diego was too costly for the quality of life we wanted. But one year later, because of my arrogance and selfish desires, it would all come crashing down.\n\nChapter 2: Sunset\n\nAugust 2014. I'm 2 months away from 22, engaged to Victoria, and driving for a new company that paid 50% more than the previous. On the surface, things are going well. However, underneath the shiny facade of our relationship, it would quickly crack and collapse like the Cypress Street Viaduct.\n\nFrom the beginning, I constantly gushed to my friends and family about how fulfilling my relationship with Victoria was. My mom and I are very close, and so I was most excited to tell her about the new woman I was dating. However, as soon as I told my mom that Victoria was 7 years older, she became vicious. She immediately disapproved and had explicitly forbidden any further contact with Victoria. My father had the same opinion, but because I didn't want to leave Victoria, I kept our relationship secret from my parents. They eventually learned about it, but my mother would always tell me how unhappy the relationship made her until the end.\n\nThe other main issue was with me. I met Victoria when I was 19 and promiscuous. A part of me wanted to keep being promiscuous, and so throughout our 3 year relationship, Victoria had caught me red-handed 3 separate times from text messages left on my phone. She would forgive me every time, saying \"I know you're a good person and that there's good in you\". However, I took advantage of that trust, eventually buying a burner phone to contact other women and keeping that phone in a locked box. I ended up cheating 8 different times in total, 5 times that she never discovered. There's no justification for what I did to her, and I still regret those actions every day. I guess I felt entitled to do what I wanted, as I was paying all her bills. As a result of that, I couldn't buy things I wanted like a sports car, or save money for our move to Phoenix. I felt betrayed in a way, like Victoria was sabotaging our future together by not finding employment. This coupled with my friends and family not being fond of her, compelled me to find a new relationship.\n\nI officially set one foot out the door when I started a Tinder account, looking for a new relationship. When I found a new girl I liked, I broke off our engagement with Victoria, claiming I wanted to \"take a break\", then immediately started seeing the new girl (let's call her Kristine). My 2nd week dating Kristine was when Victoria realized I was dating someone else, and that my friends, is how you obliterate someone's heart.\n\nChapter 3: Dusk\n\nMay 2015. Halfway through 22, with a new girl and another new job. This job allowed me to come home every other night instead of 4 days a month, which meant my relationship with Kristine had a flying start. She was 8 months younger than me, which pleased my parents. My friends enjoyed her company, and Kristine's family really liked me too. The problem was, it didn't take me very long to realize Kristine wasn't what I wanted. Whether fair or not, I compared Kristine to Victoria, as the latter was my most serious relationship and served as a barometer for what I thought I wanted. Kristine didn't measure up, and so I left after a couple months with the intention to get back with Victoria. The problem was, my intentions weren't necessarily pure. From the middle of 2015 to the end of 2017, I knew Victoria wanted me back, but I wasn't completely sure that I wanted her back. The events that follow are what I'm most ashamed of, what makes me feel like I'm undeserving of happiness.\n\nFrom 2015 to the end of 2017, I dated multiple women, trying to find \"the one\". In-between and sometimes during those relationships, I would see Victoria on the side. But we would never meet up unless she believed that we were potentially getting back together. So every time I wanted to spend time with her, I dangled the promise of a rekindled relationship in front of her like a parent taunting a child with the pinata at a birthday party. I would go in every time with the best of intentions, but every morning afterward, my gut would tell me to get out.\n\nAfter our relationship had ended in 2015, I had gone from living with my parents and driving a beat up Nissan to getting my own apartment in San Diego and owning a sports car and a motorcycle to boot. I was scared getting back with Victoria would undo or sabotage all of my financial progress, a repeat of the latter part of our relationship. My fears were so bad that even personal tragedy of our miscarriage in November 2015 couldn't bring me back to her.\n\nBy the closing stages of 2017, I still had Victoria's cell phone number but we lost contact, each of us trying to move on with our lives. I was now 25, and seriously looking to settle down. That's when by a stroke of good luck or bad luck, I was introduced to my wife, Amber.\n\nChapter 4: Full Moon\n\nDecember 2017. San Diego. 25 and single, as Kristine was long gone. I had spent the previous month collecting disability after spraining my wrist at work, so I spent most of my time playing video games and aimlessly scrolling through Facebook in my apartment. One day I came across an old friend (let's call her Melinda) from high school who I hadn't seen in 10 years. She had a new last name, a new husband, a new baby and lived in Salt Lake City. I reached out to her and we spent a couple hours catching up on each other's lives. In the moment, I never realized how monumental that connection ended up being.\n\nThe very next day, I saw a picture that Melinda was tagged in on Facebook, a picture posted by Amber, who was only 11 months older than me. I thought she was cute so I told Melinda. She told me Amber was single, and teased me to send her a message. We lived 700+ miles apart, but I figured \"what the hell, I have nothing to lose\" and sent her a message. It turned out that Amber and I had a lot more in common than I had expected. Despite living in Salt Lake City, we had actually grown up in the same California town not 4 miles apart! After our initial conversation, my nothing to lose mentality kicked into overdrive. I was on disability so I didn't need to report to work. I had money in the bank and time on my side. So I made the most spontaneous decision in my life. 3 days after our initial contact, I put new tires on my sports car, packed up a bag and drove the 750 mi from San Diego, California to Salt Lake City, Utah and spend a week there getting to know Amber.\n\nAfter my week in Utah, everything moved at lightspeed and felt like a blur. We started dating exclusively in February 2018, albeit long-distance. In the spring I sold my motorcycle and my sports car for a boring economy car, moved out of my apartment and back into my parents house to save money. I moved to Utah in November of that year. To appease her Amber's mom's Catholic wishes of being married prior to living together, I proposed to Amber in February 2019. I went house hunting, but couldn't afford the Salt Lake market, so we bought a new-construction house in Southeast Phoenix. Then we moved into the house in May 2019 while planning our wedding for May of 2020.\n\nThat's right about when the pile of shit collecting in the corner since 2017 started hitting the fan with anger.\n\nChapter 5: Half Moon\n\nMay 2019. Southeast Phoenix, AZ. 26, engaged to Amber, living in our new house. Only it's not the fairytale you've imagined in your head. The transition from living with a big family in a home that's always alive, to living with just her fiance in a big empty house made Amber feel lonely, despite having family living nearby. I purchased a security system, got a dog and I was even cornered into moving some of her friends into the house with us. None of it helped her \"loneliness\" or our relationship. Then she came up with the crazy idea of renting out our house and moving into a small apartment in Central Phoenix, closer to my job.\n\nI was NOT okay with the idea, but it made her happy so we signed an apartment lease. This all ended up putting us in a really bad situation anyway, because 2 months into the apartment lease and six days after buying her the new car she wanted, I got fired from my job in October 2019. With renters in our house and now unable to pay our rent, my in-laws offered to let us move back to their house in Salt Lake City. That was music to my ears, as now Amber wouldn't feel lonely in her parents house and I'd be free to try my hand at starting a trucking business. But that created a new problem.\n\nAmber wanted to get a quickie wedding in December, 5 months earlier than planned. Her reason was if I got into a trucking accident and I ended up incapacitated in a hospital, she wanted the medical rights associated with that. But she ALSO still wanted the big wedding in May. In keeping to the theme of \"anything to keep her happy\", after we returned to Utah and I started my business, we had our small wedding in December 2019.\n\nAnd then COVID happened.\n\nChapter 6: No Moon\n\nMay 2020. 27, married to Amber, life is Hell. As my professional life was crumbling, my marriage with Amber was becoming strained and the grand wedding was postponed due to the virus, I called my best man to vent and seek advice. Through his help, I realized what I should have already seen for years: I was unhappy with Amber.\n\nSurprised? Let me backtrack and add some details I previously glossed over or omitted.\n\nWhen I met Amber, I was desperately looking to settle down. I hated being single and my biggest fear in life was dying alone. That desire to settle down propelled me to Salt Lake for a week. As I got to know Amber during that week, I wasn't looking for someone special. Rather, I was looking for red flags. If she had kids or baby daddy drama, a bad outlook on life, etc. What I found is that I stuck with that \"good enough\" formula our entire relationship.\n\nShe likes food, good enough.\nShe is a good person, good enough.\nShe hates politics, but has the same political ideals, good enough.\nShe doesn't like French kissing, but at least she kisses me, good enough.\nThe sex is terrible, but at least we have it, good enough.\n\nMy best man helped me realize that I settled for Amber simply because I hated being single and alone. As people get older, they usually come with more baggage like kids, exes, divorce, etc. Because Amber didn't come with any of that at the age of 26, I disregarded the fact that she wasn't necessarily my ideal partner. In addition, everything I've done for Amber in our relationship was to make her happy, but it came at my expense. She was living the life she had always wanted, but I was living a life I didn't want with her at all. Then I reflected, with the wisdom I wish I had when I was younger, about how truly amazing Victoria was. How she made me feel alive when I was with her, and how I wished I could rekindle our relationship. Amber isn't a bad person, but my connection with her couldn't hold a candle to my connection with Victoria. I knew then what I had to do. Somehow, after being out of contact for over 2 years, I had to get Victoria back.\n\nI couldn't find her on Facebook, so I messaged a friend of hers, first just to ask about her. But what she wrote was the last thing I wanted to see.\n\nVictoria was happily married. And pregnant.\n\nChapter 7: Do I Deserve to See Another Sunrise?\n\nJune 2020. My last chance had come and gone. By the time I realized that Victoria made me the happiest I've ever been, and that I wanted to spend the rest of my life with her, she had long already vowed to spend her life with someone else. Someone who probably makes her happy in ways I never could. In the immediate aftermath, I wondered that if I still decided to divorce Amber, would I find anyone like Victoria again? A week later, I found out the answer wouldn't really matter. Amber announced to me that she was pregnant through video chat while I was working in Wisconsin. At that instant, I told myself that I had to stay. Victoria had moved on and now it's my time to move on. That my happiness was no longer important but the happiness of this child is most important.\n\nI feel like I did the best that I could. I tried working on my relationship with Amber during the pregnancy. I shut down my business in favor of cross country job, and eventually found a trucking job that got me home every day. This would allow me to be a present father and husband. I started going to therapy to iron out my problems, like my long term depression and considered getting on antidepressants. And the day our daughter was born in December 2020, I broke down in tears of joy because she became my new reason for living. I don't live for myself. I live for my daughter.\n\nNow, my daughter is 6 months old. My wife is more loving than ever before. I'm on excellent financial footing, and our plans to move back into our house in January are well in hand.\n\nBut I'm not happy. I hate myself.\n\nI think about divorcing Amber, but I can't because her family would be devastated. I would move back to Arizona by myself to a small apartment and sell the house. So under the circumstances, our daughter would live a better childhood with Amber because of the family support in Utah. Arizona is where I want to be, but I also don't want to leave Utah because I want to be a present father. Not to mention I would be destroying our little family in the process and burning Amber's dreams to the ground.\n\nIf I had caused Victoria so much pain in the past and am willing to cause Amber this kind of pain, do I deserve to live a happy life at all? If all I ever do is break people's hearts and ruin their lives, do I deserve to live?\n\nIf I end up ruining my daughter's life because I'm so good at screwing things up, should I just buy a gun and shoot myself in the head to cut her suffering short?\n\nUtah is one of the most gun friendly states in the country. It would be all too easy for me to hold back my sorrows long enough to complete the purchase of a 9 mm pistol, walk out into the parking lot, push the barrel against my temple and pull the trigger. And if I was serious about committing suicide today, there is nobody on the face of the planet who could stop me if they tried.\n\nVictoria deserved better from me, and it would have been better for her if I never existed.\n\nWhat I'm trying to figure out is whether or not Amber and our daughter would be better off too.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oea9i6/suicide_seems_like_the_only_way_out/", "title": "Suicide Seems Like The Only Way Out", "social_network": "reddit", "user": "plynnjr92", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 15, "down_vote": 0, "creation": 1625500610, "permalink": "/r/SuicideWatch/comments/oea9i6/suicide_seems_like_the_only_way_out/", "nsfw": false, "first_save": 1635422310.0243769, "replies_charged": false}