{"id": "t5_2qpzs_t3_od5f0j", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "So I wrote this thing in the assistance subreddit but it was probably a bad sub choice because the mods took it down lol I can't blame them it's a really annoying post anyway but maybe you guys can put up with it cause you will relate to it on some extent? I don't know, again, I will delete it if you tell me to\n\n>So, I am 17. I have severe anxiety which I think evolved into agoraphobia, I don't have a diagnosis because I have obviously never gone to a psychiatrist because mental health is a myth in my country (Romania, if you're curious). Also, depression and ocd probaly. I have always said I either have 7 disorders or one that's as bad as 7. I'm not self-diagnosing, just guessing because I have no other choice lol.  \n>  \n>Because of my mental health I just couldn't go to school since about november. Like, literally couldn't because my anxiety made me freeze in fear every time I thought about it. At first, it was online and i just stood there staring at the screen for hours not being able to just press the button to enter the meeting. I rarely could enter but just leaving it on and going into the other room to have my panic attack in peace. The fact that my romanian language teacher verbally abused me several times probably has something to do with it too. Then, when in-person school started, it was even worse. I never went to school but it was always on my mind. Never-stopping anxiety. I also only left the house once a month or so to go to the dentist or other doctor.  \n>  \n>Now, I SOMEHOW was able to finish the year with grades from assignments to all the subjects, but, you guessed it, romanian, because the pos abusive teacher also refused to mark my assignments as done becasue I wasn't at school. Now, they're saying I have to go to school on tuesday to have some kind of oral evaluation WITH THAT TEACHER. I just straight up said I couldn't. I physically cannot make me walk there because I will have a huge panic attack and probably feel like I'm dying on the street. I cannot do it. It feels like making a sexual abuse survivor go back and be abused one more time (I am really sorry if this is disrespectful tu sexual abuse victims, but that's how it feels, you can't compare abuse).  \n>  \n>So, now my abusive parents (I can't even go into this subjects, they're horrible people and I'm pretty sure they're narcissists, though obviously I'm not a doctor) threaten me with kicking me out of the house because, in their words, \"you're so ungrateful, have you ever thought about all the sacrifices we've made for you (they literally did nothing, they barely even gave me food, made me \"work for it\" and with shelter, well we live in a ONE ROOM APARTMENT so yeah, not blaming them for this, but for being so entitled without even a base for it), we won't let you laugh in our face and abandon school, you will get out of our house if you do this\". So, I guess it had to happen eventually, they're also raging homo/transphobes and I am both gay and non-binary, and they would have definitely kicked me out if they found out, but I guess they found another reason to do it.  \n>  \n>So I really don't know what to do. My life savings amount to about 1 thousand dollars (again, Romania, they also kept my government allowance or whatever it's called), I have no family, no friends that could ever take me in, a mental state too fragile to ever get a job, so it really feels like the only option is dying. This is the end of the road for me. Not trying to be dramatic, though I am suicidal I never thought of actually doing it, but I see no way out of this situation. So, yeah, I really don't know what to do. I am really sorry if this is not appropriate for this sub, tell me where else to put it and I'll delete it from here if it's not. Also, sorry for the rant-y and victimizing tone, that's just me i guess lol. Thank you for reading this, even if you don't know what to say, it still means A LOT. Thank you guys", "url": "https://www.reddit.com/r/SuicideWatch/comments/od5f0j/beware_a_huge_rant/", "title": "Beware, a huge rant ://", "social_network": "reddit", "user": "Vlad2344", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 10, "down_vote": 0, "creation": 1625343102, "permalink": "/r/SuicideWatch/comments/od5f0j/beware_a_huge_rant/", "nsfw": false, "first_save": 1635428212.5327623, "replies_charged": false}