{"id": "t5_2qpzs_t3_axlfem", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "Hi everyone, this is my first Reddit post and I'm only here because I don't know where else to go.  Hoping to find some commonality or understanding.  Or at least a place where there's someone else who is struggling like I am to find meaning in life.\n\n&#x200B;\n\nAs far back as I can remember, I have leaned toward the depressive side.  When I was little, I would tell my mom I felt melancholy - now, I realize it was depression.   A deep sense that something is not right.  But, I also had a sharp whit and humor and loved to laugh and see other people laugh.  Lately, I've noticed I no longer see things in my old humorous way, and I tend to hear things that used to make me laugh as monotone and matter-of-fact.  Shows I used to love hold no appeal.  I haven't listened to any of my usual music or podcasts in months.\n\n&#x200B;\n\nI guess the tipping point was January 2018.   Last year, I went through a divorce that stirred up a flood of all my old feelings of worthlessness and hopelessness.  Now, I find myself trapped in a job that I feel I suck at, because of my financial obligations to my ex.  I feel painted into a corner and the future, heck, even the present scares the hell out of me.  I wake up with a deep sense of overwhelming dread every day and it's all I can do to pull myself out of bed and go to work in the morning.   When I get off of work, the first thought on my mind is to go home and end my suffering.   I hate having these thoughts and I feel really guilty, knowing how much it would hurt my family and friends.  My mom and dad need a son.  My siblings need a brother.   My son needs a dad, even though I rarely see him and when I do, I can't help but cry the whole time.   Right now, the only reason I haven't killed myself is because I don't want to hurt anyone else.  But I also want to stop hurting.    Is there any way to find a reason to live FOR ME?   A way to escape the pit of despair and have hope for the future?    Has anyone on here been able to turn the depression/suicidality ship around?    Do med changes help?", "url": "https://www.reddit.com/r/SuicideWatch/comments/axlfem/ive_become_a_ghost_of_who_i_used_to_be/", "title": "I've become a ghost of who I used to be", "social_network": "reddit", "user": "Vincent_Van_Ghost", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1551794248, "permalink": "/r/SuicideWatch/comments/axlfem/ive_become_a_ghost_of_who_i_used_to_be/", "nsfw": false, "first_save": 1635427552.462597, "replies_charged": false}