{"id": "t5_2qpzs_t3_qhcit4", "request": ["5f7c2841-3f43-4682-8126-88825da57933"], "text": "It's a bit funny since I was having suicidal thoughts just 3 weeks earlier. I hung a noose and let myself hang for 20 seconds until I stopped. I became so concerned for myself that I didn't pay attention to my friend. He texted me last friday asking I wanted to hang out. He asked all of my friends. No of them replied. I didn't reply to anyone including him. He killed himself that weekend. I found the text on Monday when I was told he died. His parents are devastated. I went to his funeral on Tuesday. I came back today, confronted a kid who made fun of his death, spoke to the principle. I've had so many come up to me and say \"I'm sorry. You can always talk to me\". It's gotten annoying. My parents are mad at me because I haven't done my work. I feel numb at times, then I break out crying. I visted his parents house today to talk about stories to him. I tried my best. I went down to the basement where we would hang out and I started crying. Before this I haven't cried in months. My life is horrible right now. I was going to ask out a girl on the day I found out of my friend's death. I can't live normally now. I don't have a drive for suicide now, and I feel like I'm never going to return. I have a bad hope though I might fall again into my own trap. My friend always talked about how he had depression, and I never took it too seriously, nor myself. I am going to talk to my principle tomorrow because I'm doing terrible. I try to be a man. Maybe I'm not fit for this.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qhcit4/my_friend_commited_suicide/", "title": "My Friend Commited Suicide", "social_network": "reddit", "user": "TopSwampT", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 22, "down_vote": 0, "creation": 1635387138, "permalink": "/r/SuicideWatch/comments/qhcit4/my_friend_commited_suicide/", "nsfw": false, "first_save": 1635421101.789945, "replies_charged": false}