{"id": "t5_2qpzs_t3_osgzh2", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "So much shame inside my head. I was raised in a Christian household, I was raised with proper, well adjusted parents. No trauma, no abuse, no abandonment or lack. Up until high school I always had at least one best friend, literally I always had one person who would agree with me that I was their best friend. We’d play tag a recess or just walk around the playground and talk about random shit. I went to church every Sunday, went to the beach with family, got along great with my siblings, parents had no favorites and treated us all equally, I had a cat I adored though admittedly sometimes terrorized it, I had (have technically, still living in the same home) a huge backyard that I played in almost every day with my siblings, we had (again have technically) amazing neighborhood friends. I would wake up every day with legitimate joy and wonder, I was excited, even for school. \n\nI had the kind of childhood that probably makes most people on this sub seethe with envy. Those people would read my post with incredulity, how in the living fuck is this guy? Why does he belong here?? He couldn’t possibly understand what we’ve been through…and I agree. I don’t. I don’t know what the fuck is wrong with me, yet somehow I’m emotionally and psychologically stunted, I isolate myself from family, I lash out at others for the smallest things, I victimize myself quite a bit, I just have a genuine disdain for this life. \n\nI feel like I have so much to say and yet my brain is so foggy. Of course when I want to say something my brain locks up, but if I want to sleep and relax, suddenly World War III has erupted in my head. Not that anyone would pay attention anyway, I understand that I’m just another faceless person on this sub, whining about the same shit over and over and over again, just like everybody else. \n\nI was never popular, never had much attention given to me outside of family (yeah I know I sound pretty spoiled, many people on this sub couldn’t even get attention from their family). I guess my problem is that I’m just so…terribly average and normal in all kinds of ways, and very much not average in all the wrong ways, in very disgusting ways, if that makes any sense. \n\nI have all this disgusting and inhuman traits, and nothing good. I have nothing to offer, I just shouldn’t fucking be here. Why did the universe allow me to be conceptualized? Why did my biological parents, whoever they are (adopted), have to create me?? \n\nAll I ever wanted to do was be a super empathetic, compassionate, loving, safe, kind, accepting, giving, and joyful person. I am none of those. I’m quickly losing my ability to empathize with others because I hurt too much, I can’t extend compassionate or love because reality is too cold and harsh, I don’t feel safe with myself…how long until that happens with other people as well? I’m not very kind, I’m super grumpy and angry at life and everyone in it, I’m becoming very unaccepting of others because I feel like the universe or god has rejected me, I am not joyful, that’s just a big no, I cringe at happy and uppity people. The only silver lining here is that I’m sort of giving, only because I hate myself so much that I want to serve others (albeit in small ways) and forget I exist, I want to be put last. At the same time though I hate that I’m feeling so left out…so I want to be heard and acknowledged, but I can’t get any acknowledgment or attention from who it matters most..\n\nI’m a horrible person with sickening thoughts anyway, why should I get any sort of acknowledgment. I shouldn’t get to have friends, to have a girlfriend (haven’t had one ever lol), to have a family that cares about me, to have hopes or dreams, I am nothing, I am no one important or special. I am just a dirty rag, I’m the one cracked egg, the defective product, I have no purpose or use other than to be thrown away and discarded. I am understanding this and accepting this more and more…\n\nHonestly I barely care at this point whether people care anymore. I don’t care…that’s all that matters. \n\nI’m trying to think of other things to say, but that’s probably a sign that I should stop. I’ve said all I can say, I’ve said many things multiple times over. I am not unique, I am not special, I am not someone anyone wants to be friends with or someone to look up to, I have no special qualities, no good looks, no intelligence, no wit or ability to make others laugh, I don’t make anyone feel special or noticed or important, I don’t make anyone excited when I walk in the room, if anything I suck the life out of the room, everyone watches me from their peripheral view, analyzing me to see what I want or what I’m going to do, eager to see me leave. \n\nI just…don’t get it. I serve zero purpose and have no function. When people on this sub or anywhere else try and give me to stay, what is the fucking reason? Couldn’t be because I will help humanity, couldn’t be because I have some special to offer, couldn’t be because I look good, or give people the giggles, or befriend others easily, or make people feel at ease and calm, important, heard, it couldn’t be because of anything good is my damn point. \n\nWhat do you want me to just sit in the corner and merely exist for the sake of my family? What kind of fucking life is that? Clearly no one in this world needs me, so you can’t possibly imply that there’s some greater goal for me to achieve, or people to meet, or grand adventure to go on. I can’t do fucking anything that this world needs me to do, I can’t be anything this worlds need me to be, so just let me fucking go. \n\nUnfortunately society will not help me in this endeavor, so I must undergo this task alone, via hanging of the self. It should be fun. I don’t care about the pain or slow agony of suffocating anymore, if anything I look forward to it in a sick way. I know I don’t matter and don’t have any worth or use, so it’s for the best. I’m a creepy weirdo anyway, so I’m just imagining all the faces of the people who will feel at ease knowing there’s one less potentially dangerous person in the world, and I’ll be happy knowing I won’t live long enough to be one of them. \n\nSo thanks for everything I guess, reddit has been a huge life saver…until it isn’t I guess lmao. But seriously you guys helped me get through a lot of shitty moments, helped me fall under the illusion that I wasn’t alone and I actually had a “tribe,” like I had found “my people”. I know “my people” don’t exist, or if they do they’re incredibly fucked up and nasty, and I don’t want any empathy or compassion from them, I don’t want to be related to them in any way shape or form. So I’ll choose to kill myself instead. \n\nI literally cannot wait. For those of you who are leaving with me, see you on the other side (if there actually is one). Hopefully it’s a much better place than this, and we can ride on the cloud tops laughing at all the suckers stuck down here thinking it’s worthwhile. That’d be awesome haha.", "url": "https://www.reddit.com/r/SuicideWatch/comments/osgzh2/im_literally_so_excited/", "title": "I’m literally so excited", "social_network": "reddit", "user": "sOmwhereElse", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1627365035, "permalink": "/r/SuicideWatch/comments/osgzh2/im_literally_so_excited/", "nsfw": false, "first_save": 1635423003.1925097, "replies_charged": false}