{"id": "t5_2qpzs_t3_q7rt33", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351", "0c6360e0-5fd0-41bf-97f4-d870570d8b8d", "f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "Cw drug an alcohol mention, child trauma mention (I don't go into detail) \n\nWarning I'm emotionally and mentally exhausted so if this doesn't make sense anywhere that's why. I'm not the best at grammar anyways so enjoy.\n\n\n\nI've been through the worst pain I could ever experience as a child so I understand how pain is temporary and that I can get through it.\n\nI quit smoking (weed) because I'm preparing for surgery. it was the main way I coped with these feelings. Before that it was with cough syrup or alcohol as a child\n\nI'm trying to make it to my surgery at least. But when I try to imagine my goals after that and what I want to do with my life I end up laughing at myself for thinking I've done anything to deserve those things. I don't have the energy is an excuse and no matter how hard I try to do more than just survive I still end up shattered. And I blame myself for everything no matter how hard I try to let go of that type of thinking.\n\nI hate reaching out to people I care about because in the past I've burdened the people I loved with too much of my own pain. The things I've been through just make people cringe and become uncomfortable. Or even worse they tell me \"how to fix my issues\". They don't understand my brain is physicially fucked up from cPTSD and even after 3 years of therapy I feel like I've only taken one step up from where I was. \n\nI isolate which doesn't help. But I lash out at people because I'm defensive and constantly dissociating no matter how hard I try to just tell myself I'm not being harmed. \n\nI'm stuck in a situation where if I try to be close to someone again I will hurt them. And they will misunderstand my illness and think I'm using it as an excuse to hurt them for my own enjoyment. I don't. I feel awful when I make people uncomfortable or especially if I make them feel any emotional pain. I've been abused so I know how that feels and part of me wants to end it to avoid hurting people anymore than I already have. \n\nI haven't found the energy to be fully honest with my therapist even. I physically can't. I tighten up whenever I try to ask for help with this overwhelming dread. even when I start being honest my mind just breaks down and nothing makes sense and I end up rambling to the point where nothing I say makes sense. Much how I feel right now writing this. \n\nI love other people. It's not just that I'm a people pleaser, I want to be able to be the support other people need that I never had. I want to lift other people up in the hopes that maybe they'll see that I'm a person too even with my flaws. Or at least help someone else. \n\nBut the moment I make a mistake I'm told I'm an abuser. And then I isolate more. I push the people away who say I'm hurting them because the harder I try to fix it the worse it all gets. \n\nThis isn't a pity story. I just don't know what to do. I know the patterns but no matter what I do I end up running away (figuratively and sometimes literally).\n\nI know it's a symptom of me not sharing my emotions with anyone including myself. But the abuse I faced as a child led me to have volatile emotions and I'm embarrassed about it because I just need someone to be patient and understand I'm not trying to take advantage or abuse them. \n\nEven writing this I feel disgusting like I'm trying to make an excuse for my behavior. I try everyday to learn about my mental illnesses and behavioral disorders because I don't want to hurt people. I recently came to the conclusion I might be autistic too which make everything more overwhelming.\n\nTo make things short, because I don't want to explain anymore and I'm tired. I can't imagine a future for myself. And I feel like any ideas of happiness and my goals are me fantasizing and setting myself up to hurt myself and others more. \n\nLike I want to make a career out of the art I make. Or do crime scene clean up. But I can't drive so I feel like I'm a fucking joke. \n\nI'm too afraid to take my life, not because I'm afraid of pain or dying- I'm afraid of ending up at a medical facility without any body autonomy. Which is my biggest fear. \n\nBut lately I've been getting closer to taking that risk. I'm trying not to make any plans but I have been thinking about hurting myself violently. \n\nI know a million people have said this before, but I feel so alone. I want to drown it out with smoking like I used to but I know that won't help and will just postpone these feelings. \n\nWhat am I supposed to say to my therapist? Healing is a slow process but with the recent breakdowns I feel like I'm doing this wrong. But I can't find it in me to even explain how much confusion and pain I have because I'm so lost in my own head\n\n\nI'm so angry and hurt at how I dissociate and end up hurting other people with my reactive emotions but I don't know what to say to my therapist or even reach out to people in my life who I think care about me. \n\nI've had suicide ideation since I was a child because of my trauma and I know when I need to ask for help. And I need help right now. \n\nAlso I know ending my life won't really help the people around me. But it's what I believe emotionally \n\nTL:DR \n\nI don't want to kill myself but I feel completely stuck. I feel like an abusive asshole and I don't feel comfortable reaching out for help to my friends and I don't know how to ask for help from my therapist. \n\nI haven't made suicide plans, but when I hit a breaking point I can do some extreme stuff and I'm worried I'll end up hurting myself violently while dissociating like I've done in the past\n\n\nThanks for reading, and take care", "url": "https://www.reddit.com/r/SuicideWatch/comments/q7rt33/tired_and_i_dont_know_how_to_ask_for_help/", "title": "Tired and I don't know how to ask for help", "social_network": "reddit", "user": "IllInevitable7179", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634183589, "permalink": "/r/SuicideWatch/comments/q7rt33/tired_and_i_dont_know_how_to_ask_for_help/", "nsfw": false, "first_save": 1635423133.0390851, "replies_charged": false}