{"id": "t5_2qpzs_t3_ngkjxb", "request": ["ee176c24-5d0b-47eb-8f0f-71f3b585684e"], "text": "I can't think of a reason to keep living anymore. I know that my death could cause pain (I hate all of my family and friends anyway, well besides this one girl but she's only an online friend - she'll probably assume I killed myself but wouldn't know for sure), but staying alive could cause pain as well. I feel like everything in my life is out of my control and it's so fucking debilitating at this point. \n\nMy childhood was really rough, I got abused a lot - actually, I'm pretty afraid of my own mother because I'm afraid she'll try to hurt me (when I was like 3-4, she tried killing my dad in front of my brother and I). Actually some traumatic memory resurfaced a few days ago and I can't stop thinking about it, especially when none of my other traumas have really healed. I was raped, sexually harassed/assaulted, physically assaulted, bullied, etc. throughout my entire life. I hate people and I have trust issues with everyone besides my online friend, she's actually nice to me for some reason.\n\nAnd I also killed animals as a kid; not my own pets (I have a memory from when I was like 8 that only 'sick' people hurt animals, so that would validate me as being mentally ill, I never told anybody so it only validated that to me though) but I did abuse them as well. I don't do it anymore, though I don't feel remorse. It's not that I want to hurt animals but can't, I just dislike them in general now and I really hate being near them so I ignore them.\n\nI never really developed empathy - I don't know if it's possible to do it at this point and honestly I don't really want to anyway (I'm only friends with one empath, my online friend, I don't like any other empaths I've met). I do mask my mental illness and pretend to feel it but eh. My social skills are awful and I'm too scared to ask for help honestly.\n\nAlso I'm sexually attracted to necrophilia so that's always good ahah. I'm desensitized to gore and I haven't looked at it willingly in about five months (of course I've seen it but I don't go out of my way to look at it) and honestly the thoughts haven't gone away in that time. I've had thoughts about kidnapping/raping someone since I was pretty young and I don't know why. Actually, I always kind of thought that I'd kill someone someday; you know how people are 'destined' to be killers? I heard that on the TV when I was young and thought about it pretty often - if I did have the chance to kill someone and not get caught, I'd probably take it. \n\nI know that I sound edgy but I'm genuinely serious. I hate myself. I know I say that I hate animals/people/everything but most of all I fucking hate myself and my inability to be normal. I don't think I'm better than everyone - actually I'm worse than everyone. The only people who would miss me if I killed myself would be my parents - who are abusive and would make it about themselves, they genuinely see themselves as good people - and my friends who I dislike heavily. I don't even want to get therapy because I'd hate to tell a therapist this, it's so embarrassing and even with therapy could I actually be normal? Answer; no, absolutely not. Therapy can help but it can't fix. I don't want to be helped I want to be normal. \n\nAlso if I told a therapist this I'd be locked in a mental hospital so might as well kill someone and get locked in a normal prison. (/s)\n\nYou know how people ask how many school shooters there would be if nobody killed themselves? Yeah, maybe my death would prevent me from doing this. I probably should. I really do have a lot of motives to kill someone (I feel strong hatred for specific people/I have anger issues, I like planning out murders and coverups, sexual attraction to dead people, really into sadism, I feel like I wouldn't be complete without committing at least one murder), so I'm not really sure if I'm a safe person to be around in general. Yeah I should probably just fucking shoot myself.\n\nI don't know why I used to even want to get therapy, to be honest; it's easier to kill myself. Besides, I want someone to be absolutely broken over my death though I don't want them to get support (like 'oh I'm sorry for the loss of your child' no actually fuck them for abusing me). I mean, I can still try to kill myself at any time, the chance isn't going away tonight. Maybe one day my opinion will change. Probably not, but whatever. \n\nI mean, I'm not impulsive at all, if I wanted to kill someone and was genuinely about to do it, I'd plan beforehand so I could just go get mental help then. But also, if I did plan to kill someone and was genuinely set on carrying it out, would that be too late to get help? I don't want to be thrown into a fucking mental hospital, yeah maybe I should just off myself lmao. \n\nif you read this entire thing: no you didn't. this post was a figment of your imagination. \n\nalso if the fbi checking my search history after I snap is here: hi! :)", "url": "https://www.reddit.com/r/SuicideWatch/comments/ngkjxb/i_feel_like_im_too_mentally_ill_to_keep_living_im/", "title": "I feel like I'm too mentally ill to keep living - I'm also homicidal so if I were dead then that would prevent me from killing anyone important.", "social_network": "reddit", "user": "glittering-blades", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1621467027, "permalink": "/r/SuicideWatch/comments/ngkjxb/i_feel_like_im_too_mentally_ill_to_keep_living_im/", "nsfw": false, "first_save": 1635427890.054513, "replies_charged": false}