{"id": "t5_2qpzs_t3_oj33nz", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9", "ee176c24-5d0b-47eb-8f0f-71f3b585684e"], "text": "I have read many posts and have wanted to make one but never got the motivation to do so.  Today is my birthday a day I hate to celebrate as my life has always been not worth celebrating. I am 52. This year in February I had planned to take my own life with insulin/sub zero temps and alcohol. I had made plans for 3-4 years and researched an infallible processes that didn't involve a firearm. I had placed conditions to achieve before I can move forward with said plan. 1) First was for my 104 Year old Gma to pass. She watched as both of her kids die and bury them. She died last year after I was forced to put her in a nursing home due to failing health and many bad falls. 2) Pay off my house and have money in the bank.  I achieved both. 3) Encourage my wife to loose some weight and get healthily to find a new guy if she so wanted. 4) get my three sons through post high school education and started on their lives. 5) Get 100% service connection for my gulf war illnesses that makes my every day life hell. 6) All the while, to keep it all a secret. All tasks were completed until my son died.\n\nI feel Justified in my analysis that my life is not worth continuing as I have failed in many aspects of my life among many successes I have achieved. From the age of 7-8 or so I was bullied due to moving around a lot. Age 11 is when I began to fantasize about my death by jumping in front of the tires of a full grain truck. I even picked fights with upper high school kids who had bullied me while in 6th grade hoping they would kill me.  Didn't and don't make friends easily if I did they was close until they betrayed me. Now as an adult I tend to have 75% of the people I work with hate/dislike me 10% ignore me and 15% value me and appreciate my ability's as a technician. I am a hard driving person who takes the initiative to get stuff done and focus on the highest achievable result. Unfortunately many times people are made to look bad in contrast to my results so they become spiteful. They then begin a campaign to discredit sabotage or inhibit my efforts to be successful. I tend to be resourceful and clever so I usually spitefully get in the hardest licks by using the system or strait out vengeance.\n\nI constantly contemplate my success and failure to evaluate how to be more successful socially and feel that since growing up I never got to have real true friends I lost out on learning those skills is my excuse.  Now I can give a crap. Accept me or fuck off kinda deal,now. I look at myself as a broken car I have too many things broken I need to go to the Junk yard. I am also a Farm kid and I have put down many animals that were in bad shape I am no different. I get angry with people who try to convince me I am a human and that I don't work that way or I shouldn't commit suicide. Its my life, run yours.  The people who drink too much eat too much or use tobacco never get condemned they are committing slow suicide but that appears to be OK in our society.\n\nAfter the Death of my 24 year old son I told my wife about how I felt about my life and was planning to end it.  We talked and she simply said that she was ashamed she never saw it and was \"Afraid to be left alone since I was a little girl.\" That was enough for me to remove my suicide plans off the table in the form of a promise. Two weeks after I burred my son the - 20 F weather I wanted was here. But I promised my wife I would not take my own life.  I am angry as hell about that I deleted friends from FB called people and told them to fuck off as they failed me deleted a gaming clan I ran for 20+ years. I burned everyone that was close to me so I can suffer even deeper I guess. \n\nMy son suffered from Schizophrenia due to an ATV accident 7 years ago. COVID, his escalating condition, recent death of a close friend his 2 Gma's and great GMA and other factors made him feel like he had no choice but to take his own life with a gun this January. I am relieved he is no longer suffering from episodes. I am however still suffering and since I failed him I am embracing my daily neuropathic pain, chronic migraines and 20 + other autoimmune conditions and the harassment I get at work. Each day I drive to work hoping I get in an fatal accident to escape this world.  I feel my situation is for relief not to make a statement or punish anyone or get attention. This world is hell.  Death is my version of heaven.\n\nI don't know what to expect from this group.  I hope I am not griefed but also not looking for resolving my feelings.  I have no outlet for the death of my son, no one helps with my harassment and have no friends. My wife cant talk about my son with me so am trapped with no way to progress to a new stage in my life as I never expected to be alive. I get counseling at the VA but they are not helpful.\n\nIf you made it this far thanks for reading.  If you have a suggestion or solution please post it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oj33nz/a_promise_prevents_my_suicide_makes_me_angry/", "title": "A promise prevents my Suicide makes me Angry because my son committed suicide this January.", "social_network": "reddit", "user": "VilomahForever", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 55, "down_vote": 0, "creation": 1626132108, "permalink": "/r/SuicideWatch/comments/oj33nz/a_promise_prevents_my_suicide_makes_me_angry/", "nsfw": false, "first_save": 1635426409.6881976, "replies_charged": false}