{"id": "t5_2qpzs_t3_mii6zi", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I’m laying in bed as I type this— I can’t seem to sleep at appropriate times anymore. I’m still a teenager so ig I can blame it on hormones and puberty and shit but I don’t know if I can go on. I relapsed on self harm again recently. I cut on my ankle for the first time after coming to the conclusion that my mom won’t check my ankles for cuts the way she does my arms. I’m tired as fuck but I can’t sleep for some reason. I’ve been thinking of offing myself for a long time now but it’s been my fixation for the past few days. I honestly think I’m going to do it. Idk how deep I have to slit my wrists to die but i guess we’ll find out lol /j \nI’ve been hurting myself for a while and having issues in the mental department for almost a year now, but I think it’s at its worst right now. This is the first time it’s gotten to the point where I’m genuinely considering killing myself and feeling like this. I feel like I can’t be happy anymore. I can be distracted, but I don’t think that qualifies as happy. I’ve accepted that suicidal thoughts will probably follow me around for the rest of my life but they’ve gotten so bad that at this point, I don’t feel the way I used to. “I’m depressed because I feel like I’m horrible and I wanna die bc I think the world will be better without me and I’m tired of suffering,” was how it used to be. NOW, it’s “The world is shitty and I’m too tired to deal with it, I’m tired of suffering and the world isn’t worth my time or efforts.” Cringy teenager shit, I know. If my parents read this they’ll send me away to some psych ward. They’ll have a long talk with me about how by hurting myself I hurt them too and basically belittling my pain and telling me my emotions are invalid and my struggle isn’t bad enough to cause me to hurt myself. \nI’m thinking that getting sent away might help since I’m actively looking for a diagnosis. I literally just need an answer to what’s wrong with me. This got a lot longer than I wanted it to as well, e.\nI’m gonna try to sleep, goodnight", "url": "https://www.reddit.com/r/SuicideWatch/comments/mii6zi/im_so_fucking_tired/", "title": "I’m so fucking tired", "social_network": "reddit", "user": "h0mo_3rectus", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1617362020, "permalink": "/r/SuicideWatch/comments/mii6zi/im_so_fucking_tired/", "nsfw": false, "first_save": 1635428124.3908541, "replies_charged": false}