{"id": "t5_2qpzs_t3_8lgcyp", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "My home is full of people I love right now. My best friend Q is in my living room playing on her phone listening to music. My other friend B who lately has been acting as my lover is in my bed trying to go to sleep and sexting a girl she recently met. I ignored each of them and instead cleaned the house. Now, I sit here in my office alone in the darkness drinking.\n\nQ was just crying herself earlier, she's trying to make the decision to move away and try to put her life back together. B was pouring her heart out to me professing how she loves me and I'm the one she wants to be with, I instead tell her how I'm broken and can't love back.\n\nI am broken but moreso, I don't deserve any of them. I don't deserve love or compassion. I'm a broken freak with nothing in my future. If I died, Q would get money she needs. B would be free to find someone else to love. I wouldn't have to feel this pain any longer.\n\nI want to die, I've been so close so many times to it. I have the means. I push the ones I love away and it hurts to do so but I deserve the pain\n\n5/23 I slept alone on the floor of my office. I woke up earlier than normal in order to leave without attention. I went to lunch by myself because the normal lunch group didn't happen today. I'm sitting on the top floor of the parking lot alone and again crying. I've not complained about being alone because i deserve this all. I desperately want to cut myself. I want to drink until I'm unconscious. I want to drive off into the night to be alone without harming anyone else. I feel my suicide pact with B no longer matters. she has a chance at life so I'll not see her sit down to die next to me. I'm hurting so very badly and I want to rest.", "url": "https://www.reddit.com/r/SuicideWatch/comments/8lgcyp/drinking_crying/", "title": "Drinking, crying", "social_network": "reddit", "user": "CatOnEdge", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1527047331, "permalink": "/r/SuicideWatch/comments/8lgcyp/drinking_crying/", "nsfw": false, "first_save": 1635427726.2029793, "replies_charged": false}