{"id": "t5_2qpzs_t3_ohho8q", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "I can't help to feel sorry for feeling suicidal almost every day in the past 3 years. Every day I woke up, the PTSD kicks in and it will repeat my mistake vividly. It took so much of my energy just to combat that PTSD, let alone the suicidal thought. The flashback is so real, and often leaves me with an accelerated heartbeat and a wet pillow when I wake up.\n\nI am not sure if feeling suicidal is a sure sign of depression or not. But I know that in my calm mind, that whenever the PTSD or the memory flashback kicks in, I will start to plan for suicidal methods. How I wish I can enjoy a painless death.......\n\nI know, I am sick. But I lives in a very conservative society. Suicide is a taboo topic in here and nobody would really talk about that. As a man, I know I am \"not supposed to feeling suicidal\", as this will show that I am vulnerable. I know being vulnerable is a huge weakness in this market, everyone will hits your weak point to achieve maximum benefits. I know I can't afford to be vulnerable. I know I live in the stereotype image. \n\nToday, because of pure coincidence, I am forced to work with someone that happens to be the main character in my PTSD. She was kind, never mentioned any of my past mistakes. but before she left, she say something to me in private. This caused my PTSD and suicidal thought to be in peak. But since I am working (as a videographer), I need to display a professional image. I can't display my personal emotion in front of client.\n\nIt was only until when I am back to home and finally be alone. I slump into the bed, feeling no appetite to eat. The thought to end my life was the strongest I ever encounter. The only motivation is to seek death, so I open up my laptop, searching for any new drug that can be purchased discreetly to end my life painlessly. \n\nYou know, whenever you google up suicide, there will always be a hotline number. I doubt it actually works. They will eventually say that, \"in the end you still need to rely on yourself\". I am no stranger to a suicide thoughts, and I am getting tired to all these anti-suicide campaigns. I really doubt it is helpful, especially for someone likes me that couldn't talk properly about my mental issue. \n\n Today is not my first suicide attempt, and I doubt it will be the last suicide attempt in my life. The PTSD and suicide leave such a permanent disability in my mental capacity. Sometimes I wish I can be dead, and sometimes where I feel so lucky not to suicide at that point. I had been trapped into this \"tried to suicide, failed, glad I am not dead\" cycle. I feel so tired and drains out to combat with these negative thoughts. I had long lost the courage to lives on. I can only use new goals to excites myself. Quite similar in dark souls, once you finish your duty, you are bound to \"die\" (literally). \n\nI am really sorry for the negativity. I am so scared to talk about this with anyone. This had been my deepest secret that I could not share with anyone. \n\nI felt really guilty that while I am feeling suicidal, there are thousands of people in the hospital who struggle to live on. How I wish I can \"transfer\" my lifespan to them..... They can just live on with my life, while I die (happily, I hope so).", "url": "https://www.reddit.com/r/SuicideWatch/comments/ohho8q/i_am_sorry_for_feeling_suicidal_i_wish_i_can_be/", "title": "I am sorry for feeling suicidal, I wish I can be different from those that \"think too much\"", "social_network": "reddit", "user": "Shy_Death", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1625919521, "permalink": "/r/SuicideWatch/comments/ohho8q/i_am_sorry_for_feeling_suicidal_i_wish_i_can_be/", "nsfw": true, "first_save": 1635428434.013069, "replies_charged": false}