{"id": "t5_2qpzs_t3_oyyxw5", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "I’m (24F) not looking for advice or answers, I just want to know that I’m not alone. Because I can’t talk to anyone irl about any of this because it’s all too hard and painful and complex.\n\nI grew up in a loving, supportive, safe household. Even though my mom doesn’t truly believe in or accept the reality of mental illness (she didn’t believe me when I said I had anxiety in high school/early college), nevertheless I have wonderful parents. I’m newly married to a pretty amazing, loving man. I have a home, a steady job, a good income. And I think that’s what makes all of this so much more difficult and confusing. Because in spite of all this, deep inside of me, ever since I was young, I have never felt like I was meant for this world. I’ve always felt like an outsider, even with family, even with my husband. I’ve always just felt detached from everything. Never truly content or at peace. Always restless and thoughtful, sometimes melancholy, sometimes just apathetic. I haven’t felt truly happy for so long.\n\nMost times I think I’m not brave enough to do it, that I’ll never succumb to these feelings of just wanting to disappear. But in my darkest moments, it’s begun to feel plausible, and it terrifies me. The other day I found myself thinking about the gun in my husband’s safe. I’d never do anything. But the feelings over the years have gotten more frequent. I feel so terribly, horribly alone. So many nights I just cry before falling asleep, my husband sound asleep next to me, and the loneliness makes me want to scream. He knows somewhat of my struggles, he knows I SH and have thought about death. But it gets tiring of always feeling like a burden because so often I’m down and in tears or just cold. It’s a vicious cycle. I feel so guilty because I feel like I have absolutely no reason to feel this way. I have a good life. Nothing traumatic happened to me. So what’s wrong with my head???\n\nAnyway, I just needed somewhere to place these thoughts tonight so I can stop thinking about disappearing.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oyyxw5/just_need_to_know_im_not_alone/", "title": "Just Need to Know I’m Not Alone", "social_network": "reddit", "user": "blueskies951", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1628221914, "permalink": "/r/SuicideWatch/comments/oyyxw5/just_need_to_know_im_not_alone/", "nsfw": false, "first_save": 1635427495.9185143, "replies_charged": false}