{"id": "t5_2qpzs_t3_d1mjcp", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "This last fall into self pity was a long one, it was made up of initially a worry about a sick friend who I can’t get ahold of. This friend means so much to me and the thought they’re sick or hurt without me knowing even a little bit is distressing, they always said they’d be here for me, unlike the other people who just dropped me out of their lives with no closure. Which is why I cringe to her so much, she is the only person who messages me first for a conversations. To think I might lose her feels terrible. \n\nAfter that I began worrying about how much I’ve screwed up: university application, AS levels, any sport I tried, any hobby I dragged my self through to try and be a better or even happy human and the best romantic relationship I’ll ever get. I just don’t do good things no matter the effort, but I’m uncertain if I’ve put any effort into living besides the bare minimum. It all comes back to how I’m a non-human who lacks any good qualities despite every advantage and chance handed to me. I know I can’t achieve anything good without massive burdensome help from others, who try to help me as an individual be better. It all just seems like a lie to me, every time anyone says I’ve done a good thing or am a good person I get angry at their lies. They don’t know me like I know me, and I know I’m a awful person. \n\nI think I’m intrinsically broken, I’m unable to find reasons why I’m friends with the people I am or why they’re friends with me. There doesn’t feel like there is anything there of substance beside a shared proximity of about 7 years. Or how I lack anything besides a passive “like” for my parents who have given me the world and more. I want to love them but I feel such distance from them. They’re two good people who got saddled with an inept child like me and they deserve better.  \n\nI’m looking at a fucking downhill slope of a life fit for mountain bike track. I’m going to uni in a week, maybe, if I’m able to scrape together enough fucking competence to get finances in order, but the last time I did this subject I failed. If I fail university which is likely I am terrified about what the future holds, so I might cut it short or rope it short; besides being unfunny and awful, I’m also indecisive.", "url": "https://www.reddit.com/r/SuicideWatch/comments/d1mjcp/my_thoughts_spiral/", "title": "My thoughts Spiral", "social_network": "reddit", "user": "Sweetest-of-Sour", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1568006476, "permalink": "/r/SuicideWatch/comments/d1mjcp/my_thoughts_spiral/", "nsfw": false, "first_save": 1635426701.4117916, "replies_charged": false}