{"id": "t5_2qpzs_t3_na6ok9", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "&#x200B;\n\nI'm 13, nonbinary, and have over 20 diagnosed mental disorders. I was born to two parents, both mentally unstable, and my mom purposely tried to have a miscarriage without getting an abortion. I was born with major depressive disorder, persistent depressive disorder, general anxiety disorder, panic disorder, OCD, autism, and ADD. \n\nMy father touched me as a baby, small ways but whenever I was alone with him I remember him touching me in places a parent should never touch their child. I was 2 years old when I was first assaulted. My fathers friends were over and drunk and took my virginity. \"Two year old gets gangbanged by father and silver fox friends\" is what someone would name it if it was recorded.. lol. \n\nWhen I was 3, I was being prepared for baptism into the catholic church and my priest was dressing me. He was 20 minutes late, and during that time I was forced to perform oral sex on him while his hands moved far too high up my skirt.. \n\nI told my parents, and I was victim blamed. I don't know how, but apparently I lead an honorable man into sin.  They began beating me, and mental abuse became regular, I thought it was normal. \n\nMy sister was born that same year, I sheltered her from any abuse I could. \n\nI turned 6 years old, at my birthday my parents hosted a family reunion. My uncle took me to a room and locked the door... people compliment me on my blowjobs now and I joke I've been practicing on my uncle and priest since I was a kid. My parents walked in on us, and took me to their room. I was locked in that room for 4 hours and when they let me out I was beat with a hairbrush until the world spun. I kept leading honorable men into sinning, they said. When they left the room and I could sit up, I picked up the hairbrush and beat myself until every inch of my knees and wrists were purple and blue. My first taste of self harm, soon to be a lifelong comfort. \n\nI started school that same year, and as soon as I set foot in the classroom I could feel the hate.. my ADD made it hard to focus on the lessons and my teacher would scream at me to pay attention otherwise my parents would be called. Anytime my parents were called I was beaten in front of the whole class, a few kids were horrified but some even smiled. On days when I could focus in between classes I would be met outside with 3 kids, always the same ones, who would kick me down and punch me until I was sobbing. They nearly cracked my head open on the wall of the school once. That day my parents found out about the bullying and instead of helping me they took me home and locked me in my room for 2 days. I had no water except what was already there. During that time I found a pair of scissors and cut myself until my legs were covered in blood. The bullying continued after this until middle school. \n\nI was 9 when I met someone who I thought genuinely cared about me for the first time in this life of cruelty. We had known each other a little over a month before he asked if I wanted to have a sleepover on Halloween after trick or cheating. After he asked me, he began groping me when I wasn't looking and when I wouldn't want to go over to his house after school he would slap and punch me until I gave in. Halloween arrived and I was on edge the whole time we were trick or treating. We got back to his house around 12. I completely passed out while watching horror movies, but I woke up at 2 am with him sitting on my chest. I was scared because he was forcing my pants down and he was already undressed, when I tried to call for his parents he slapped me and choked me until I passed out again. He raped me twice that night, and I woke up 4 hours later completely naked. I panicked and got home before telling my mom what happened. For a second I should she would do the right thing, she got me a rape kit and calmed me down.. before locking me in the boiler room. When my dad got home that day he screamed at me and wouldn't stop punching me. \n\nMy \"friend\" stalked me until he moved away 3 weeks later. I attempted suicide for the first time after my dad stopped beating me. I was revived at the hospital 2 hours later, and my parents convinced the doctors I was delusional and accidentally took too much of my antidepressant. Because of that they didn't listen to anything I said. I attempted to run away when I was released, but the police found me and admitted me to a mental hospital. There I was raped again by a doctor while I was under tranquilizers. I was released a month later.\n\nGrade 6 comes, I fall hopelessly into anorexia and self harm. When summer of that year came I was sent to a mental hospital because I was passing out in class and losing too much weight. \n\nI was released a month later. Grade 7, this is last year 2020. I started the year being there for friends who were struggling with self harm. Then I met Jack. He was a ninth grader and heard about the hospital. He was very kind to me.. and he convinced us to date a month later. He made me feel so loved, and when he asked for nudes I wondered why not. I sent them, and he used them to blackmail me into sex. He would tell me to meet him in the washroom and if I didn't agree he would send them to all his friends. \n\nI went over to his house as he asked one day, and I didn't realize he was recording. I did what he told me to and left, to be horrified that what he recorded was released to pornhub. 20000 views... it was taken down when I requested it. \n\nI broke up with him, and he released my nudes to his friends. That was when COVID hit and we were forced online. \n\nMy parents abuse worsened. \n\nI was raped again in my sleep at a party I was at 2 months ago. There will be no charges pressed.\n\nI was raped on April 24th at the mall. He was masked and gloved. There will be no charges pressed. \n\nIM SO TIRED OF JUST BEING A FUCKING BODY I CANT FUCKING DO THIS ANYMORE. IM SCREAMING INSIDE FOR HELP BUT NOBODY CAN ANYMORE. I CANT BE HONEST OTHERWISE ILL BE SENT BACK TO A PSYCH WARD. IVE TRIED TO KILL MYSELF OVER 10 TIMES THESE PAPST FEW YEARS AND LIED ABOUT EACH TIME. IM SO FUCKING DONE. \n\nMy reason for living lied to me. I found out yesterday. I have a huge amount of trauma relating to porn and I found out he was looking at it when he told he he was going to stop. I feel completely heartbroken because I thought someone genuinely loved me and thought I was enough for once.. \n\nI can't fucking do this anymore. I'm waiting for when I can die. I just can't anymore. I just fucking can't. I'm broken. I'm shattered. I can't be helped I've tried everything to make the pain stop. Therapy, drugs, self help books, venting, nothing works anymore. Nothing helps anymore. The blade is my only therapy now.. \n\nIt doesn't get better, does it? I'm waiting until I can finally get medically assisted suicide to finally make this lifelong suffering end.", "url": "https://www.reddit.com/r/SuicideWatch/comments/na6ok9/someone_fucking_shoot_me/", "title": "Someone fucking shoot me", "social_network": "reddit", "user": "Superextrateenager", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 14, "down_vote": 0, "creation": 1620764516, "permalink": "/r/SuicideWatch/comments/na6ok9/someone_fucking_shoot_me/", "nsfw": false, "first_save": 1635422261.602257, "replies_charged": false}