{"id": "t5_2qpzs_t3_qcdps5", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a", "8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "For context, I’m an 18 year old guy in my first year of undergrad. I spend pretty much all day on my phone opening Reddit because I’m bored and have nothing to look forward too and then closing it because my feed is exhausted and I don’t want to be on my phone anymore. I hate mindlessly scrolling through apps, but anything beats being alone with these thoughts I have. I probably first thought about killing myself 6 years ago. I’ve never attempted it, but there are more times than I can count when I would have if it didn’t take so much effort.\n\nMy usual pattern is a few months of near daily suicidal thoughts and then it gets better temporarily, but the cycle inevitably continues. Currently, I am in the more unsavory half of that cycle. Where do I even start? I have so much to say but I seriously doubt I’ll be able to encapsulate it all in this post without forgetting something.\n\nFirst of all, I don’t hate myself. I don’t think I’m “worthless.” I’m worth just as much as any other human being, whatever that means. Sure, in the past I’ve thought I was completely worthless or incapable. Earlier this year I made a post about how I wanted to kill myself because I thought my league of legends performance was indicative of my worth. It sounds ridiculous, right? The post should still be up on my profile, if you’re curious. I’ve long quit that godforsaken game. \n\nSo no, I don’t think I’m worthless or incapable. I don’t think I lack potential. I don’t hate myself (I actually am quite happy with the person I’ve become). And yet, all I ever think about is ending my life. \n\nIf the post about league should tell you anything about me it’s that this isn’t my first time reaching out. I’m very open to my friends about this. That being said, a thought just occurred to me that this is an exceptionally helpless and entitled thing to do. Everyone no doubt has their own problems and concerns and here I am forcing my own upon them because I’m incapable of dealing with them myself.\n\nI failed a test yesterday, and I lamented to my one and only friend that I’ve made on campus the whole year about how I wanted to kill myself. I realized that I wasn’t helping myself by reaching out, but just being annoying and toxic. I spend so much time on my phone just scrolling through apps, waiting for some notification to show up so I can talk to someone. But it’s never enough. At least never to make me stop thinking about it for more than a few hours. The thoughts always come back.\n\nI realize that this is the source of all my problems; I just don’t have enough in person contact with people and it makes me feel incredibly isolated. I only commute to my university 3 days a week and on those days I feel significantly happier. All that entails is me going to my classes and leaving, and sometimes it has me elated. \n\nBut when I’m not there I’m deeply, deeply unhappy. I feel as if there’s no point to doing my school work because I don’t care about money and it seems like trying is not going to get me any further than just walking along. I don’t really enjoy doing anything. I don’t have anything to look forward to. I don’t have anything to be proud of. The only joy in my life comes from the little interactions I have with other people. \n\nThe problem is, every time I’ve made a new friendship it’s always crashed and burned. I become hyper fixated on one relationship at a time (whether I have other healthy ones at the time or not) and either the other person reciprocates and then I eventually abandon them out of loss of interest or they do it to me before I get the chance. I just broke up with my girlfriend of two years because I didn’t feel anything anymore. I know I made the right decision and I have no remorse. The problem is that this has happened 3 or 4 times in the last 3 years. It’s made me afraid to get close to people despite the fact that my social skills are easily better than they’ve ever been at any point in my life.\n\nWhich brings me to this: I wish I didn’t need people. I wish I could just focus entirely on my schoolwork and shut everyone out, constantly aiming for success. I wish I didn’t feel terrible every day because I never interact with anyone (in person). I wish my happiness wasn’t so dependent on everyone else. I’m starting to think that I should stop reaching out and just help myself.\n\nToday I watched a video on how to stop catastrophasizing (making everything seem like a bigger deal than it is). I thought this was super fitting considering I was resigning myself to failure after that awful test yesterday. I got a few things out of that video: don’t be afraid to be hurt because then you will have no opportunities to be happy (vulnerability) and consequently don’t be afraid to take risks.\n\nThis may sound like mental gymnastics, but all this made me think was that I should kill myself. I’m done bothering other people. I have nothing to enjoy, nothing to desire, and nothing to look forward to. I have nothing to be proud of and nothing to lose. There is a very obvious solution to this, and all I have to do to enact it is stop being afraid.\n\nToday I put a kitchen knife up to my neck. I wanted to see how the blade felt pressed against my skin. I didn’t cut myself and didn’t intend to, but being comfortable enough to do that is probably bad. I fear death less and less every day. Someone cutting me off at 70 mph on a highway and almost making me crash doesn’t feel like a terrifying event but a minor inconvenience.\n\nAnd no, before you private message me, this is not a desperate call for help to make friends. I’m sorry if that sounds callous, but I want to clarify that I’m really not looking to make friends on Reddit. I don’t want to disappoint anyone who private messages me by exchanging a few messages with them and then completely cutting them off once they try and have me add them on other social media platforms. It’s happened to many times and I feel like a dick for doing it which is why I’m saying this here. I have friends. Three of my best friends from highschool are in the same school as me, I just barely talk to them. I text the ones going to other schools but the ones in my own have new friends and clearly better things to be doing. I’d rather not bog them down with myself. I have talked to them a few times but on the rare occasion they do help it feels like they’re going out of their way to do it rather than wanting to. I have one new friend who I text and she says it’s fine but I don’t like bothering her with my shit. It’s getting on my OWN nerves at this point. People say it feels good to let it out but it never helps me. I only talk about it because it’s the only fucking thing on my mind and I need to talk to SOMEONE. \n\nI’m sorry this was so long. If anyone actually read this, thanks. \n\nTl;dr: I don’t know what to do. I don’t hate myself but I feel isolated, unhappy, and bothersome. I feel like I have no reason to keep going. What do I do?", "url": "https://www.reddit.com/r/SuicideWatch/comments/qcdps5/i_dont_hate_myself_but_i_think_about_killing/", "title": "I don’t hate myself but I think about killing myself daily", "social_network": "reddit", "user": "Thundamuffinz", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1634771801, "permalink": "/r/SuicideWatch/comments/qcdps5/i_dont_hate_myself_but_i_think_about_killing/", "nsfw": false, "first_save": 1635427952.224677, "replies_charged": false}