{"id": "t5_2qpzs_t3_i00pnk", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "18 M and feeling every second of it. I grew up in the upper middle class and feel like a waste of such luck. I remember the very day my life started to turn to shit, the day I accepted an offer to move schools. I had everything. The best friends I could’ve asked for, the best family I could’ve had, the best life an 8 year old could dream of. The following year saw the dawn of years and years of vicious bullying and family abuse which I don’t think I’ll ever escape. I’ve had ASD my whole life and more recently a diagnosis of Bipolar 2 and it’s amplified all my problems to an overclock. \n\nI just want to be included. I’ve hid behind a mask of complacency in solitude. But my own loneliness tears me apart from the inside out. I’m not an emo or any sort of gothic type but I’ve had a death wish since the age of around 12 but properly since the age of about 13 or 14. \n\nI remember the night crystal clear, Tuesday July 2nd 2016 when I tried to end my own life. I’m just as disappointed in myself now 4 years later than after that night when I knew I’d failed yet again. I can’t do anything right. I’m inept in every sector of life. I used to be a mathematics prodigy studying complicated operations and astrophysics at age 3. But now I’m doing a double degree in maths and physics yet I’m below satisfactory at best. I just want my failure to end. I just want my incompetence to stop. I just want to die. I’ve been suicidal for years now and frankly I’m getting to the end of my final tether. I don’t know what to do. I don’t know where to turn. Every night I keep having dreams about either suicide or the horrors that is failing a second attempt. \n\nIs this the point I ring a hotline? Is this the point I have to start considering hospital? I have a paralysing phobia of needles. Just thinking of them is often enough to send me into a panic attack. So going to a mental hospital would be traumatic enough with all the blood tests and things that go on. But I don’t know what else I can do. It’s ether live through my current trauma that is the hell I live daily or compound it with new trauma to amplify the last. \n\nDo I need to ring a hotline now? Should I go to hospital? I’m so stuck. I genuinely feel my days are numbered but I don’t know how long I can hold on", "url": "https://www.reddit.com/r/SuicideWatch/comments/i00pnk/10_years_ago_i_had_everything_now_im_sitting_in_a/", "title": "10 years ago I had everything, now I’m sitting in a bathtub at 3am debating whether or not to take my own life.", "social_network": "reddit", "user": "Badger_Wadger_420", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1596029352, "permalink": "/r/SuicideWatch/comments/i00pnk/10_years_ago_i_had_everything_now_im_sitting_in_a/", "nsfw": false, "first_save": 1635426226.0579848, "replies_charged": false}