{"id": "t5_2qpzs_t3_k3qqzp", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "My 'suicide kit' is nearly complete; all I need is the metoclopramide.  \n\n\nQuick tidbits:\n\nIt's honestly been a long-time coming, given I've ruminated on doing this for a while (I think I started when I was about 14; I'm 17 now). I can't stand people in generality -- yes, friends and family are too a part of that abstract.\n\nI have AD/HD-I -- which was just recently diagnosed -- and I have to do a few stupid fucking blood tests to get the medication I need for attention sustainment, but I'm honestly not motivated to get them.\n\nI realistically could commit myself to improving my life significantly -- as I am ostensibly at the bottom of the pit right now -- but the effort requires more life, and since I am currently unable to exist in a manner that I view as feasible, enduring life for my betterment is not desirable.\n\nMy (clinically diagnosed) OCD has worsened which has resultantly negatively impacted my mental health, generally speaking. I've actually gestated two new, somewhat-symbiotic-to-my-unwillingness-to-read compulsions: re-reading shit to ad-infinitum despite having comprehended whatever it is I'm reading the first time and dissecting sentences.\n\nI'm an idiot; I always have been one.\n\nI have many ideas that I will never share due to my fear of failure.\n\nKind of topical dogma:  \n>!Suicide isn't an unscrupulous means of death, in my opinion; anyone that tries to proselytize you into believing it is is doing something immoral, generally speaking.!<", "url": "https://www.reddit.com/r/SuicideWatch/comments/k3qqzp/im_leaving_the_cycle_soon/", "title": "I'm leaving the cycle soon.", "social_network": "reddit", "user": "SnoozeBuhton", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1606719113, "permalink": "/r/SuicideWatch/comments/k3qqzp/im_leaving_the_cycle_soon/", "nsfw": false, "first_save": 1635428057.591541, "replies_charged": false}