{"id": "t5_2qpzs_t3_qclwtx", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "First time I seriously considered suicide, I was a sophomore in high school. \n\nNow I'm a junior in college. Nothing has really changed. Apart from being less self-destructively nihilistic, I've reached the same point in life. \n\nIt's strange, I can go day to day distracting myself, but the minute I get time to myself and my thoughts, my motivation to continue playing this sick game plummets. \n\nYou ever feel trapped? Think of crawling through a tunnel.  You're told there's light at the end, but as you keep crawling the tunnel unpredictably shrinks and expands. Sometimes, you have a good day crawling through, got enough breathing room, feeling comfortable.  And then you get too comfortable before it's too late. You forgot how this works. The next day you struggle through a claustaphobic inducing situation where you must claw through this sickly suffocating dark grimy human rights violation. You never know what the next day holds, or how much longer the tunnel goes for. You could die before you reach the end. You'd never know. \n\nWell, what if I was at the end of the tunnel, what would that even look like? The only dream that tethers me right now is one away from society. No more school. No more work. No more anxiety and pressures from shit no one should stress about. Maybe I'd live in a small cabin and start a farm. Live off the land. But the part about dreams is that once you get them, it's not so fun. I'm scared the dream isn't real. It's too good to be true. I won't enjoy it if it arrives. Maybe it's one of those goals that make you feel nothing when you reach it. Because was the pain worth it. \n\nMaybe I'd feel different if I had more people that would compell me towards society. Friendships, relationships, family. Even though those things could be argued to be in my life, I sometimes don't feel it. I feel very alone. \n\nI'm alone in the tunnel. It sucks. A lot. Cause the steps through the tunnel seem to be meaningless work for corporate systems, and slaving away at a 9 to 5. I don't want to sell my time. I want to own my time. My time is something I can never get back. And the thought of it all going away hurts me. \n\nSometimes feeling utterly demotivated and sad, it physically hurts. I feel the pain going through my arms and my fingers. It moves through my body. It's not terrible, but it makes the glasses I see reality through just a little bit more fogged. And despite knowing my perspective is warped by my emotions, the thought that my life is just a waste of time doesn't leave my skull. \n\nI have no idea how others can crawl through tunnels. It's scary and dark and alone and soul crushing. I am more afraid of living than of dying. Dying is easy, maybe the pain is bad but it's momentary. Living is prolonged. It's uncertain and painful to go through. It can be boring and dull and meaningless. \n\nDrugs, that's what everyone flocks to first, don't they. I did. It was an escape from the tunnel.  All of a sudden, you'd grow wings, and you'd emerge from the tunnel up into the sky. You'd look at the clouds for awhile, finally feeling something. But then when you come back down to the tunnel...it's hard. I tried drowning myself in the teachings of drugs. Microdosing. Making it a spectacle. It was a special occasion. For awhile. Then after awhile, when you rose it was just a rainy day. Then after, you wouldn't be able to rise at all. Nay, you wouldn't want to rise. \"I don't want to see the sky today\" you'd say. Because the sky didn't seem real anymore. You needed to accept the tunnel, that's what the drugs kept telling you. \n\nAh, so now we're back to the beginning. The black void. I ask myself every day why I need to go through it. It's a conundrum. You could say it's a game. A gamble. Do you take the risk day after day? On the off hope that you'll get to the end?\n\nI don't know man. I keep thinking about it. Thankfully, a version of myself that was more happy decided to stash the kill kill drugs of mine somewhere I can't access very easily. What a devel she is. But maybe she saw something that I can't. I simply go through this tunnel now cause I don't have a choice.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qclwtx/im_tired_of_waiting_for_things_to_get_better/", "title": "I'm tired of waiting for things to get better", "social_network": "reddit", "user": "yeet_away_accnt", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634799676, "permalink": "/r/SuicideWatch/comments/qclwtx/im_tired_of_waiting_for_things_to_get_better/", "nsfw": false, "first_save": 1635427966.0069892, "replies_charged": false}