{"id": "t5_2qpzs_t3_9sy2p", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "So I thought it would be a good idea to post a different kind of thread here.  Perhaps as follow-up to those who have learned to deal with suicide desires, but still haven't moved as far as they like beyond it.  Plus, some probably come here and read  first - and say - \"hey I'm not as bad off as that guy, so I won't bother posting\".  I want to encourage posting.\n\nI want to also point out a few things to the new readers here:\n\n* Reading the active last few topics gives you some decent ideas of what we can and can't do.  Like much of Reddit, I expect however you will find that consistency isn't perfect.  I doubt you came here for consistency ;) This is hand-crafted stranger-connections, so sometimes it goes wonderfully [sublime](http://en.wikipedia.org/wiki/Sublime_%28philosophy%29), other times it falters and falls.  Don't be afraid to try again, post when you aren't sure, etc.  Nobody has life figured out, including those of us here helping.  We are here waiting... that clock of time goes tick tick tick for us too, we don't know the future.\n\n* Asking for help isn't always easy.  If you aren't up for posting a new topic, maybe at least post a reply on the most current/active topic.  Like \"I'm having struggles right now in my life too, I may start my own topic, maybe misery loves company\". I expect you will find in the first 12 hours of a new topic on SW, all the replies are read.  There are some issues of topics going stale/old after 24 hours, but you will notice most people here are at least used to how reddit typically works and can re-post a new topic if they aren't getting help.  And you should always feel free to do a new or restarted topic.\n\nI suspect if this subReddit ever becomes too busy or too much non-critical stuff, we will work it out with other subreddits or something.  That's the beauty here.  So don't feel like you are wasting our time, please!\n\n---------------\n\n.\n\n### Less Than Suicide\n\nMy personal observations and thoughts on this.... what was I getting at?\n\n* Drinking too much.  Bad on your body, bad on your brain.  Suicide by alcohol isn't that uncommon... and it's a way to abuse yourself and cause yourself pain less than death.\n\n* Eating too much.  Eating unhealthy.  Not a lack of self-control, more like a self-destructive compulsion... that makes you depressed and unhappy that you keep doing it...  You want to stop, but you don't want to stop.\n\n* Drugs?\n\n* Masturbation/pr0n? Is it taking over your life...\n\n* Not brushing your teeth, not giving a shit about yourself, a form of self-abuse that again is less than suicide, but not good.  Got a downward spiral going? (I revel in the \"Dove of Hope\" lines in [this song](http://www.youtube.com/watch?v=UfRfrWcPcwM))\n\n* Doing so bad in school or work that you are setting in motion (knowingly) major problems? Examples?\n\n* Risky / Attention seeking behavior.  Sex with strangers with no joy, driving your car or bike in ways you shouldn't, ?\n\n* Anyone have others to share?\n\n\nMaybe you don't feel you need to start a new topic and pull the proverbial fire alarm asking for help.  Consider the floor open on stuff that you may want advice or just to talk about....\n\nWe are here to listen and offer what we have... read the old posts, you can see it, real people here...", "url": "https://www.reddit.com/r/SuicideWatch/comments/9sy2p/less_than_suicide_lingering_self_destructive/", "title": "Less than Suicide - lingering self destructive behavior", "social_network": "reddit", "user": "RoundSparrow", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1255265820, "permalink": "/r/SuicideWatch/comments/9sy2p/less_than_suicide_lingering_self_destructive/", "nsfw": false, "first_save": 1635422561.7220533, "replies_charged": false}