{"id": "t5_2qpzs_t3_lexyl0", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I normally would starve myself on this very day,for life has been sh*t very recently. And the best thing is that I can`t even talk to my best friend since my phone is broken and maybe back tomorrow,though it has been snowing like crazy,so maybe not then. Ah,I miss talking to him...It is very lonely in quarantine. But a nice lady keeps me company through this sh*tfest. My thanks to you,if you ever read this. I was writing with her about my thoughts and got pretty negative and suicidal,said I wanted to starve to death. I didn`t even eat until we said goodbye for today. I then thought about what she and I spoke of...my mind was still in termeul. I thought about her asking me to take care of myself...at first I thought of my past and told myself that I have suffered enough and should just slowly starve,but then came to my mind the other things she said. Words,they were caring... I was only used to hear caring and kind by my best friend. I got up....nearly fainting...stumbling through my room...and made myself some dinner and tea. I felt way better after that...my mind wasn`t too focused on suicide anymore. I turned my attention to a letter I wanted to write to my best friend about the legion that is obessed with perfection and beauty. There was another one laying besides it...a more dark letter...a suicide note that I wrote months before hand. I looked at it....The wax seal was perfect...everything was perfect on the letter...The wording,the letters,even the seal...A winged golden sword...My best friend choose it as I asked him which he liked more. I use it when I write to him...It also reminds me of something else I want to talk about with him later...in another letter. This was my finest work...my final work...ready to send at a moments notice...should I want to end it. Under it was a knife...for the cut I would take to ensure death. I took the knife....and cut the letter in two. Months of work..gone in moments...perfection lost. But I was okay with it,for I would not break my promise...not now...not soon. He said what he would do when I kill myself...she would be heartbroken to know I am dead. Two so kind persons...I would hate to know them in such emotional pain because of my actions. And if I can`t be strong for myself,can`t love myself...then I will be strong for them...to spare them from such pain. Maybe I will find some meaning in life..some day...I found happyness and joy with my best friend,so one can...h-hope. 6 hours remain until dawn...I think I will make it to dawn without harming myself...writing a letter about the legion that wants to be perfect,but is now forever damned. I even know the ending that I will use...the ending of a youtuber I watched today...,,Ave Imperator. Excelus et in terra\" Have a good night.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lexyl0/in_the_mood_to_write/", "title": "In the mood to write", "social_network": "reddit", "user": "SturmReaper3188", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1612738759, "permalink": "/r/SuicideWatch/comments/lexyl0/in_the_mood_to_write/", "nsfw": false, "first_save": 1635427662.4766035, "replies_charged": false}