{"id": "t5_2qpzs_t3_oi0hhn", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7", "0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "**I know, that this Post might not got any attention at all which is fine. Consider this to be my official suicide note. Better here, than in real life.**\n\n&#x200B;\n\nI’ve got no reasons to live, a bleak atmosphere, a bleak future, no freedom, and no chance for a better future.  I’m sick of people dismissing me and my feelings and giving me feel good compliments like “you’re so intelligent” or “you’re brilliant and could make it anywhere”. I honestly don’t care, my problems are unsolvable.   I’m a slave of Society and it’s Sheeple. I have to watch others in more privileged countries get to live their lives while I’m stuck here.\n\nI can’t wait to no longer by a slave of this exploitative Society (which I hope goes extinct). I can’t wait to no longer suffer so privileged and rich people elsewhere can continue to live their comfortable lives.\n\n\"Waiting\" is not an option for me and I hate how everyone uses that as an excuse to dismiss my problems. I have waited enough, I need solutions NOW, not a million years in the future. Time is something I do not have.\n\nDistracting myself with acitivties or interests aren’t going to help me anymore. Their just distractions that neglect my issues.  That is my least favorite suggestion.  Focusing on those things is literally one of the only reasons I’ve lasted this long. Well it doesn’t work anymore. These problems demand a real solution.\n\nPeople here are just as bad as the ones irl. After all they are Society since we’re all members of jt whether we like it or not.\n\nSilly of me I know, to think that reaching out here on Reddit could helped me.\n\nEvery single person I’ve ever met or have in my life drifts away from me or turns out to actually be an asshole.  They all just execute the scripts Society gives them no matter who they are. Everyone I’ve ever met or could have potentially met falls under this category. Internet Strangers aside since I’ve never really met you guys I have no idea what your personalities are like in real life.\n\nI have no support network and zero people irl I could even reach out to. Literally no soul in this World would even care if I died, and if they did, I mean that’s just too bad. Where was this compassion when I was alive. Those people don’t get to mourn me.\n\nIf I were to die, the World would keep going, I don’t think anyone would be effected, no one would care. Even if they do, I don’t think their Mental Health is my concern. If they couldn’t treat me in a similar manner to how they would at their “mourning” of my death in life then I don’t see others as a valid excuse to keep going.  If I’m not valued or have any concern given to my emotions or mental health then I just frankly do not care about contributing to the World. Like I’d much rather be treated like a Human by others than given shallow compliments (not referring to you, just the people I’ve had in my life in general)  Nothing I ever did or could of potentially done in the future would matter since it’s not like you can transfer your memories to your non-existent state.  I don’t think I have a reason to live or to want to live.\n\nI  have like a million reasons to want to end my existence though\n\nSorry if I repated myself throughout the post, some of it was cut I'm not sure where it went lol but I think this is sufficient enough.\n\nTL;DR then I\"m not intereted in what you have to say.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oi0hhn/im_going_to_have_my_second_attempt_today_and_hope/", "title": "I'm going to have my second attempt today, and hope that it's sucessful and my last", "social_network": "reddit", "user": "DanGaming_Reddit", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1625990775, "permalink": "/r/SuicideWatch/comments/oi0hhn/im_going_to_have_my_second_attempt_today_and_hope/", "nsfw": false, "first_save": 1635423033.5166135, "replies_charged": false}