{"id": "t5_2qpzs_t3_inpadp", "request": ["9cb7ef4e-af9d-4403-b84a-be5dd3f5e75c", "e79a79ca-6f5c-44ca-b1e4-309a4afa83c2"], "text": "This will probably sound cringe, but I was always a “gifted” person; Effortlessly smart and talented at most everything I've tried or at least everything I cared to do well at. I didn’t ever do much of anything of note with those special talents. Always procrastinated and slothed around. Always felt like there was more time. Depression, addiction and anxiety all run in one side of my family. All goodies that I received in the birth lottery. \n\nAs a child I remember having a lot of strange feelings both mental and physical. In 2nd grade I started crying and begging to not go to school. I was tested, found to have a really high IQ and recommended for educational enrichment. We ended up moving to a different town/school. Things were /relatively/ normal for a bit. I was always sloppy and procrastinated, but I did what I could at that age. \n\nWhen I hit pubescent age, it was like a switch flipped. I felt an extreme predilection toward mischief and destruction, as well as an uncontrollable curiosity/desire to use drugs. As a young teen I tried DXM, opioids, inhalants, weed, etc. This period of experimentation and acting up persisted for a couple years until one day I went to a friends’ house where we drank, barely slept, and I woke up to have my first (and only, really) couple energy drinks the next morning. Then my mother picked me up and dropped me off at church. I had my first full on panic attack at said church. The next few months were plagued by anxiety attacks, derealization and general discomfort.\n\nAfter this experience, I eased up considerably on misbehavior and experimentation through high school. I got my first real girlfriend, started a metal band with my close friends, my grades went back up to A’s. I became field commander in marching band. \n\nBy the end of high school, I was with a different girlfriend and still playing shows with my friends. When it came time to go to college, I followed this girlfriend and my best friend to a local university. Within a year, she had dumped me and my best friend had a severe concussion and had to drop out of school. My anxiety was out of control. I tried smoking weed with friends to relax, but it often made my anxiety, tics and neuroses even worse. Then I slowly rediscovered alcohol. And picked up smoking cigarettes.\n\nI ended up pledging to a fraternity. This was more of a stoner/slacker/you’re-smart-but-you-don’t-apply-yourself group of people than a traditional fraternity. We did love to party, however. And that’s what I ended up doing in college. I focused on partying and doing ridiculous shit. That person that I had instantaneously become at puberty had slowly returned. \n\nI felt like shit, but I kept doing it. I skated by in school through my ability to easily ace  tests, write papers and retain info. I barely did my homework, or at least barely tried at it. At several points my anxiety was so bad while sober that I could barely make it through a class, embarrassingly hyperventilating and fidgeting in the same seats week after week. \n\nSoon enough, I was basically drinking 24/7. It was very easy to play it off and co-enable the addiction among my friends; many, if not most, of whom also had mental illnesses. We continued having parties, making excuses for constant drinking. We were, in retrospect, a very unwell and antisocial group of people. We “knew” this, and joked about it, but I don’t think we /realized/ the extent of it. It was like there was, somewhere, a core magnet attracting mental issues and addictions, drawing in all kinds of the wild characters we befriended and partied with.\n\nThen, college ended. By the end of my “academic career”, I was working alongside a couple friends at the little college bar, right across the street from an apartment shared by four of us.\n\n We worked hard, but drank almost constantly; on the clock or off. Our boss was a sweet and well-intentioned older woman whose husband had passed and left her some money, which she employed, under the sadly deluded dream of being able to make a quaint, Irish-style pub in this small but party-frenzied college town. She usually left and went to bed by around 8pm. The bar, when it did get busy, would fill up around 10 and go until 2am or later.\n\n We had many bizarre and hilarious nights; that much I can’t deny. But this was a highly toxic environment. We were entrusted with the responsibility of running this place, essentially, with little oversight or at least highly inefficient and naïve oversight. I filled my cup from the tap constantly as I worked. \n\nAfter graduation, I quit  and moved back with my parents. I got a temporary position delivering pizza (yes, while still drinking). I recognized the extent of my depression and self medication, and slowly got down to the point where I was only really having a couple beers at night. \n\nThis seemed like a good time to put the criminology degree, which I’d seemingly unintentionally purchased for 30k dollars in the midst of a sick partying streak, to use. I had no interest in criminology, by the way, I just switched my major to match a former roommate and drinking buddy’s. I did, however, like the idea of social work. And said roommate had procured a job with a private social work agency. Seemed worth a shot. \n\nI got the job. I made 10/hr plus additional pay-per-mile of transportation, and a slightly higher pay rate for some services. This was essentially a pay cut, even from delivering pizza, to do a much more complicated and socially necessary job. \n\nI was assigned maybe three cases. One of these was two boys who had been separated from their parents. They were a redneck family, and the boys often displayed signs of learned racist behaviors and tropes. The younger one, 9, literally drew a swastika on a picnic table during a visit. His older brother, 11, once boisterously accused his younger sibling of “Saying n\\*\\*\\*\\*r a lot” from halfway across the public park where the visit was taking place. \n\nThese kids lived with their grandmother, who was dying of a terminal illness. She called me one night and sobbed for an hour, told me that the parents had been illegally taking the kids from her house and threatening her if she told anyone. She wept and said she wasn’t going to make it much longer and didn’t know what to do. \n\nI was making ten dollars an hour for this. One of my paychecks never arrived and nobody offered much help. I started drinking more. I ended up drinking a little to attend the visits with the aforementioned family. Finally, I quit the job. \n\nI went back to work at the college bar again. Some of my friends were still living in my former house across from it, working there and attending school. I crashed there often. I was back to full-time drinking and heavy chain smoking. I had given up. I was unkempt and unhygienic, as I often am during my worst times. \n\nThen, somehow, a beautiful, smart and sweet girl who I had been acquainted with took an interest in me. We began seeing each other. I was still constantly drinking but over time while seeing her I grew ashamed and tired of trying to hide the extent of it, which enabled me to slowly cut down. \n\nI switched to kratom, which made the final leap out of alcoholism much easier. I was still heavily smoking cigarettes.\n\nThis was, in retrospect, one of the most amazing times of my life. Our relationship was incredible. I moved, with one of my closer friends, to a new apartment and got a job at a new bar/restaurant without such an overtly destructive atmosphere. I started making art again. I started work on an album of the highly idiosyncratic music I had always dreamt of creating, with the luckily enlisted help of a recording engineer who enjoyed and supported my niche vision. I had some friends who lived upstairs who were always up to something, be it skating or drawing, or having DIY house shows. \n\nSome other friends of mine had a plan to start a DIY music venue. We bit the bullet and did it. Bands from all over the country came and played, local bands started thriving because of having a place to play.  New bands and acts formed directly because of this place. \n\nIf only I would have just taken the fucking reins right here. If I would have been lucid enough to realize how fucking lucky I was. Instead, I slowly let my goddamn depression consume me again. \n\nThe kratom I had started to consistently take to get off alcohol just became my new vice, and my dose shot up with my tolerance. I became complacent taking kratom to do anything. I also felt like shit from continued heavy smoking for the past however many years, and I think this motivated my use of kratom a lot. It eased the discomfort in my body and mind. In reality, I think I am very sensitive to the negative effects of smoking and had even been self medicating those with my alcohol use too. \n\nGradually, work on my album slowed. The new job became ever-busier and more stress-inducing. I had cut down my days from five to two or three a week to ostensibly work on my album and to keep days open for helping with the music venue. I was barely trying at either of those things, though. I just made enough money bartending to afford to basically do nothing most days of the week. \n\nMy sex drive started to slip, too. My poor girlfriend. What was happening to this ambitious, loving diamond in the rough that she had helped me to uncover? She ended up getting a band teaching job and had her own set of extreme stressors to deal with at this point. \n\nOur lives went on like this for a year and a half maybe. Toward the beginning of this year,  I realized that I was feeling extra shitty and losing weight, so I went through the mind numbing process of getting on medicare, getting a doctor and provider, and getting checked out. They couldn’t find anything wrong.\n\nIn the meantime, my girlfriend was clearly growing disaffected with our relationship. Quarantine didn’t help matters on any front. I grew increasingly boring and anxious. I was working even less due to COVID. She, being a band teacher, was not working due to it. She had zoom meetings and lesson plans, but was home almost always. She ended up picking up shifts at the bar again to supplement her income. We worked together one day a week.\n\nWe had several conversations where we both unbottled our feelings and cried, but nothing would change and we’d end up having the same conversation a month or two later. In retrospect, these were the final warnings I should have heeded and tried to change the direction everything was headed in.  \n\nI increasingly had started experiencing tingling in my extremities with the slightest bit of pressure, a symptom I should have paid more attention to. I chalked it up to wear and tear at first. \n\nI got a CT scan done of my pelvis due to unrelated issues, and the arm where they put the IV in had lasting sensation of numbness for about a month. \n\nOne day, as work was somewhat returning to normal (which, with COVID, didn’t help my anxiety) I lazily laid around working on xenharmonic music for fun on my laptop as I normally would before work. When I got up and started walking to work, however, I noticed that my feet felt kind of off. Then as  got to work I noticed that my thinking felt slow and deliberate. As I took orders from customers on our iPad systems, both of my thumbs felt sluggish. I feared I was having a stroke or something, so I sat in the back and tried to decide what to do. I ended up chalking it up to anxiety and powering through work alongside my girlfriend that night.\n\nApparently, I was unnecessarily grouchy and short at work. This was the last straw for my girlfriend, who, that night when we returned from work, said she wanted to break up and move out. I sounded like an idiot trying to explain that something was wrong with me, as if that changed the whole long-term situation. \n\nShe kind of went back on this, but over the course of our discussions we came to the agreement that it would be best for her to move out. This would give me time and space to “work on myself”. \n\nOver the next week the symptoms became unbearable, and have mostly remained so. My limbs are all significantly numb and uncoordinated. Not to the point of complete disability but I fear they are progressing toward that end. I am physically unable to do things I was able to do a couple months ago. I feel weak.\n\nMy brain feels like it’s working at half speed all the fucking time now. Two months ago I was writing cool and innovative little sketches of xenharmonic music and talking political philosophy online effortlessly. Now I can barely follow what’s going on in a fucking TV show. Writing something like this is very difficult and,  even for all the effort I'm putting in, I lack my usual eloquence and varied grammar.  \n\nMy mouth became excruciatingly dry, especially at night while I sleep. I am also a mouth breather in my sleep so my teeth feel disgusting each night. I broke off a piece of my wisdom tooth while brushing and so I went to the dentist, who told me I have 15 fucking cavities and periodontal bone loss. I didn’t think my teeth or oral hygiene were perfect, but holy shit. I almost just drove my filthy car into a tree right then. \n\nStrangely enough, I came home from this to get a facebook message from an internet friend’s girlfriend inquiring about a niche shared interest regarding religion. I said I wasn’t doing too well at the moment to talk. She asked if I was suicidal, and when I said yes, she immediately facetimed me and explained that she had lost a brother and a husband to suicide and begged me to reconsider. We had a good conversation, at least as good as I could hold in my state. \n\nMy girlfriend/ex moved out. Now it’s just me and my buddy, who also struggles with depression. I’ve stayed over at my grandparents’ a lot during all this. My grandma is sweet but caring to the point of being neurotic, so I sometimes have to get away. She’s been a godsend taking me to various doctor’s appointments where I am told the results of this or that test are normal. She’s been making sure I eat and keeping track of my schedule of appointments. I feel like a fucking child. I basically am. \n\nI’m not working at all due to these health and cognitive issues. I am hardly doing anything. No one understands. People love me and want to help, but they don’t understand. I’m only 27 and look relatively healthy, or maybe the people who know me just see the healthy me when they look at me.\n\nIn the time since the dentist’s appointment, my teeth have started feeling loose. they still feel awful every night and I get up multiple times a night to brush. I started seeing a new dentist who my grandma is helping me pay for. He claims I /don’t/ have periodontal disease, just gingivitis. I’m not convinced. \n\nI had a brain MRI and EMG scheduled on the same day by a neurologist. Guess who had an allergic reaction to the Gadolinium dye and had to be taken to the ER and didn’t get the EMG yet.\n\nMy facebook, full of my memories, photos, and videos of my music that i didn’t back up, got reported for having a fake name.  Groups and pages I adminned of 20k plus that I could’ve asked for financial help while I figure things out. Probably won’t get all that back. Oh, all the time I wasted over ten years on that account. Gone. Pathetic, lol\n\nMy ex-gf forced me to get started seeing a therapist. I quit smoking when I had a wisdom tooth extraction. I started an antidepressant. It just seems like it’s too little, too late. All of this is just too fucking much. I know I could’ve been someone great. I know I had great potential and several times I was rescued from what I thought was the brink and given second, third, fourth chances to become that person. \n\nBut now, it feels as if that person is gone. In his place is a complete failure. Mind that was once nimble, endlessly creative and unique is now sluggish and fractured. Body that was once slim but tight is now sickly and weak. Hands that once pulled impressive feats at an instrument or a controller now struggle to do basic tasks.  Hair that was once thick, flowing and playfully unkempt is now a thin rat’s nest of split ends that show my depression. My voice and throat are wrecked too, I didn’t even get into that one. I’m only 27. What the FUCK. \n\nI’m going to try some peptides such as BPC-157 to see if I can heal any part of my body or mind enough to get somewhat back to “normalcy” but things look pretty grim. I’m not working, my money is gonna run out before long and I really don’t want to become a full-on burden to others. \n\nThe worst part is that a couple of months ago my mind was working almost extra well. One of the xenharmonic pieces I posted on facebook was liked by a Sibelius institute professor! That's such an odd combination of impressive and pathetic, I know. I have no proof of that now after being zucced, regardless. It's just that I wish I had THAT mind to help me solve all these issues! \n\nMy best friend’s wedding is at the end of next month. So that’s one more thing I absolutely have to stick around for. I can’t ruin that moment by not being there. \n\nI don’t want to hurt all my loved ones. I don’t want my mom, my grandma, my best friend, my roommate, my ex to feel there was something they could’ve/should’ve done. But I don’t know how long I can fucking take this. Doctors are very little help. Therapist makes me feel better for like 10 minutes until I walk back out into my broken world. The SSRI has made me less immediately suicidal but it doesn’t change the fact that everything in my life has suddenly gone to shit. \n\nAll I’m fucking doing these days is sitting in a recliner, petting my poor little cat and watching youtube videos on gnosticism/Gnostic Christianity. The idea that our suffering is inherent to the wicked material world and we will be delivered to ineffable enlightened formlessness is of great comfort to me in this time of suffering. Plus, I’ve always found gnosticism to be fascinating in general. \n\nIf you read this far, bless you. I didn’t expect to type out this whole story. This is really only the surface of my ever-twisting depressing path lol. I don’t know what I expect by posting this but I have virtually no outlets left. I’m so tired. Any response, advice, commiserating at all is appreciated. I love you. Thank you. \n\n\\- - - - - - - BTW- tested negative for Sjogren's, Lyme's, various vitamin deficiencies, diabetes, thyroid issues, and had brain CT and MRI (no contrast though lol). Just to rule out a few suggestions people might make about the health issues. - - - - - - - - - - - - - - - -", "url": "https://www.reddit.com/r/SuicideWatch/comments/inpadp/i_dont_want_death_but_i_feel_that_life_is_being/", "title": "I don't want death but I feel that life is being sucked out of me. Longpost!", "social_network": "reddit", "user": "GnosisApoptosis", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 15, "down_vote": 0, "creation": 1599410717, "permalink": "/r/SuicideWatch/comments/inpadp/i_dont_want_death_but_i_feel_that_life_is_being/", "nsfw": false, "first_save": 1635425158.5024607, "replies_charged": false}