{"id": "t5_2qpzs_t3_o3tbux", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a", "35003726-80f4-4b57-a706-febe3655a157"], "text": "It may sound like something out of a fantasy movie, but scientists hope to be able to bottle the smell of happiness so it can be used to help people with phobias or depression.\n\nOur bodies produce different scents when we feel happy or afraid. These so-called chemosignals – which are in fact odourless – are believed to trigger happiness or fear in others. It is one of the ways smell impacts people’s social interactions.\n\n‘It’s like an emotional contagion. If I feel fear, my body odour will be smelt by people around me and they may start to feel fear themselves, unconsciously,’ said Enzo Pasquale Scilingo, a professor at the Department of Information Engineering at the University of Pisa, Italy.\n\nSimilarly, the smell of happiness can inspire a positive state in other people, says Prof. Scilingo.\n\n‘If we had a spray of happiness … If we can find some odour which can induce a happy state – or a general positive state – I think we can help many, many people,’ Prof. Scilingo said.\n\nHe hopes scientists can produce one within a few years. This could be particularly important in the aftermath of the Covid-19 pandemic, with cases of depression rising especially among young people.\n\n‘I don’t want to say having this spray will (cure) people, but I think it’s a very beautiful contribution,’ Prof. Scilingo said.\n\nSweat\n\nHe is coordinating a project called POTION which is researching these chemosignals. The researchers use videos to induce fear or happiness in people, and then collect their sweat to analyse which chemical compounds are released with each emotion.\n\n‘The next step is to synthesise the odours and … investigate how they induce emotions in others,’ said Prof. Scilingo.\n\nEventually, fear odours and people’s responses to them could be used to help psychiatrists understand more about different aspects of phobias and depression. And happiness odours could be used to help in treatment.\n\n‘If we can use the odour of happiness in addition to the usual treatment for phobias or depression, we (could) increase the efficacy of the therapy,’ said Prof. Scilingo. \n\nThe POTION researchers are also investigating how odours impact people’s social interactions, and sense of inclusion or exclusion from others.\n\nPrevious research has found that a person’s emotional state can influence how they respond to other people – and how others respond to them, Prof. Scilingo says. Someone feeling fear is less likely to approach or trust people, and others are likely to be wary of them. And the reverse is true for happiness – the happier someone is, the more likely they are both to trust others and to attract them, says Prof. Scilingo.\n\nMammals\n\nIn mammals, the sense of smell is uniquely linked to the part of the brain associated with emotions and the creation of memories, says Dr Lisa Roux, researcher at the Interdisciplinary Institute for Neuroscience in France.\n\nSmell is important for recognition between people. A mother can recognise the smell of her child, for example, and this may be an important part of bonding, she said.\n\n‘We humans use our sense of smell more than we think. It’s more unconscious, and a little bit taboo – we are not very comfortable with it – but there is more and more evidence that smell is important in social behaviours,’ said Dr Roux.\n\nThe first region of the brain that processes chemosignals – the olfactory bulb – is directly connected to the limbic system, which controls the ability to identify another individual, the formation of memories, and manages emotional responses.\n\nAll other senses – taste, hearing, sight and touch – are processed by other regions of the brain before being linked to the limbic system.\n\nThis may be because smell has been the most important sense for the survival of species. ‘Chemical signalling is very important, even for bacteria. It’s a very ancient modality, it’s really key,’ Dr Roux said.\n\n\n‘We humans use our sense of smell more than we think. It’s more unconscious, and a little bit taboo – we are not very comfortable with it – but there is more and more evidence that smell is important in social behaviours.’\n\nDr Lisa Roux, Interdisciplinary Institute for Neuroscience, France\n\nPleasure and pain\n\nThe sense of smell is linked to pleasure and depression, possibly because of its unique link to the limbic system.\n\nUp to a third of people with a defective sense of smell experience symptoms of depression, according to a research paper published in 2014.\n\nThis may be partly because of their loss of sense of taste, and concerns about personal hygiene and social interactions. But it is also likely that olfactory loss affects the brain’s functioning and in particular its emotional control, authors of the paper said.\n\n‘This might be because the olfactory system is directly linked to the limbic regions – which include the amygdala that is very important for controlling emotions,’ said Dr Roux.\n\nMice\n\nDr Roux is principal investigator of sociOlfa, a project looking at how a mouse brain processes chemosignals when it encounters a new individual, and then uses them to create memories.\n\n‘Mice interact a lot by smelling the different body parts of other mice, and the nature of the smell will carry rich information (such as) the social status of the other individual,’ said Dr Roux.\n\nAnimals use scent to mark – and detect – territory. In experimental conditions, if two mice fight, the one that wins will mark an area with its scent using urine. The subordinate one will also release a scent but only in one spot.\n\n‘A dominant mouse will have specific molecules to indicate they are dominant ones. And a sick animal will have signs of sickness within this odour mixture,’ she said.\n\nFemale mice use scent to select a mate – usually preferring an unfamiliar male possibly because it promotes genetic diversity, says Dr Roux.\n\n‘For me it’s a (form of) language. It’s a way to communicate important information within a social group, important to maintain the hierarchy within the group, and it’s very important for reproduction,’ said Dr Roux.\n\nStudying how mouse brains process chemosignals will help researchers understand general principles of how their brains form social memories, says Dr Roux.\n\nAnd the results may be relevant in people too. Understanding how the mouse brain processes chemosignals during social interactions and when forming memories of an individual could help scientists identify what happens when these functions go wrong - for example, in mouse models of autism.\n\nEventually this could also help scientists understand what happens in people whose ability to recognise others is impaired – for example those with Alzheimer’s – or those who have difficulties with social interactions caused by autism.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o3tbux/bottling_the_smell_of_happiness_to_help_treat/", "title": "Bottling the smell of happiness to help treat depression", "social_network": "reddit", "user": "Lopsided_Ad6035", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1624147997, "permalink": "/r/SuicideWatch/comments/o3tbux/bottling_the_smell_of_happiness_to_help_treat/", "nsfw": false, "first_save": 1635427108.1404002, "replies_charged": false}