{"id": "t5_2qpzs_t3_plw2eq", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "My life is too hard. It's one crisis after another. There is no end in sight. My anxiety is so bad. I can barely function. My boyfriend told me to \"get help\" and I feel like he doesn't care. My family doesn't have anything else to say to me to help because I keep going in the same downward spirals every day and call them crying. I have worked so hard this year to improve my life and overcome big fears to do so. I am not happy or satisfied with it because now every waking moment is a struggle to fix some broken part of my car or call some government person who is going to make me give them money. My life has been full of struggle and pain and I have wanted to die for so long. I've tried so many different ways of thinking about life. I have had my spiritual journey... I am tired. I can feel my body rotting and giving up. The only thing I live for is my perfect sweet little cat. If not for her I would find a way to end it. There are just no good ways. I've tired looking it up so many times but nothing seems like it's a lethal enough method to bother trying. The worst thing that could happen is I tried and survived with a permanent disability. I need someone to take care of me. I am scared and alone. My boyfriend does not get it. He doesn't want to deal with me. If he dumps me I'll probably consider ending it too bc I told myself when I got with him that if he wasn't the one I'd stay with then I was gonna kill myself. I completely flipped my life upside down to be with him and all he has said to me today is that I need to get help. I don't want help from evil money grubbing therapists who don't give a fuck. I don't want to get back on meds. I don't trust medical staff or anyone for that matter. I just want my pain to please finally stop. I am so tired of hurting every moment I am awake.", "url": "https://www.reddit.com/r/SuicideWatch/comments/plw2eq/im_tired/", "title": "I'm tired", "social_network": "reddit", "user": "iiimperatrice", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1631316173, "permalink": "/r/SuicideWatch/comments/plw2eq/im_tired/", "nsfw": false, "first_save": 1635427469.5406277, "replies_charged": false}