{"id": "t5_2qpzs_t3_qbhc0l", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87", "6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "I've been at every end of the suicide scale. Which doesn't tell you much, but my personal 1 would be going a whole day without wanting to die and my 10 would be the unfortunate failed attempt that landed me on the psych ward, getting ECT every other day, fighting off the cockroaches in the cupboards and sincerely regretting not studying more before getting locked up in a place where English is not commonly spoken. \n\nI'm not sure what number you'd put me at right now. On the outside, I am functioning mostly normally. There's a few \"you look stressed today\" or \"do you feel sick?\" comments here and there, but I am definitely a person who does people things. It has been like this for *months* and I cannot seem to get anyone to understand that this is not improvement. \"So you are still going to work every day?\" Yes, Doctor, because the extra Xanax I take after breakfast somewhat reduces the heart palpitations I get every morning, usually around the time I start throwing up and getting an upset stomach. (Thanks, Anxiety!) \n\nIt's a pretty cheap belt. I doubt it would hold my weight, and the injury plus structural damage would be hard to explain. But I tightened it around my neck as hard as I could and tried not to breathe and wondered if this would finally be it and then it turns out it wasn't. Rinse and repeat. My neck aches a bit, especially where the buckle pressed into it. That's... it. As far as attempts go, does this even count? I feel like a student who says they \"studied really hard!\" but actually just glanced at the title of their textbook while watching Netflix. And then complains when they get a bad grade. This is me, complaining now, that I have a bad grade in Suicide Attempts and I deserve it but this doesn't half take the piss.\n\nYou'd have to kill me to put me back on that psych ward, which would somewhat defeat the object. The isolation and boredom alone would be enough to drive a mentally healthy person crazy, if the \"no cell phone\" rule isn't enough. But at least there, I was *crazy*! When my brain told me how everyone around me hated me, despised me, wished I'd hurry up and die already, that my loved ones were relieved I'd been locked up so they'd be away from me, that I should've rotten in there like a killer in prison... I didn't have to put on a cheery face. Nobody batted an eye when I spent the whole day in an armchair staring out of the (unfortunately, locked) window. Need to release some more aggressive emotions? Here's a cushion and a padded cell - go attack the walls for a while! It's so freeing to just say to the world: this is me, and this is how mentally ill I am. Yes, being in the same room as others does terrify me because being looked at is physically painful. Yes, I am considering whether or not the chopsticks we got with lunch could pierce through my throat fast enough. And yes, certainly, I'm gonna go back to my bed and cry a whole fucking river because my stupid, sick brain wants me to, and that's fair enough. But I'm in the loony bin, so nothing matters!\n\nAnd then you're out, and you're meant to be normal, and things go back to normal, but you're not.\n\nThis is a long post. Much appreciated if you read this far. But it's weird going from sobbing, vomiting up what feels like a void in your chest, going through all the \"weapons\" in your house and wondering whether a note would make things better or worse to realising you don't have the strength, so you may as well get ready for work. I taught a great class today. I got asked to teach a new class too, and one of my students gave me a notecard with a penguin on it, which is cute. After I got home, I waited for my partner to fall asleep and tried again with the belt. It's not the method for me.\n\nTry explaining this to anyone and you'll look like even more of a weirdo than you actually are. Hospitals won't take you until you've done serious damage. But do you even need the hospital, when this \"crisis\" is literally just a Tuesday? No real harm done, anyway, except a bit of achiness and crying because I can't even kill myself properly what the fuck I'm a coward. \n\nBeing functional yet actively suicidal is bizarre.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qbhc0l/today_i_took_my_meds_ate_lunch_went_to_work/", "title": "Today I took my meds, ate lunch, went to work, taught a class, answered some messages, tried to strangle myself three times, stayed late at work, did some household chores, took my meds...", "social_network": "reddit", "user": "totoropengyou", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 31, "down_vote": 0, "creation": 1634667229, "permalink": "/r/SuicideWatch/comments/qbhc0l/today_i_took_my_meds_ate_lunch_went_to_work/", "nsfw": false, "first_save": 1635426154.7469974, "replies_charged": false}