{"id": "t5_2qpzs_t3_q7kpuz", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "Here I am again back on this thread per usual I’ll say my piece and probably end up deleting this post after a while but for now I’m at a lost. I’m a 24yo Black man who never really fit the “Black” criteria personality wise. I’ve struggled with severe anxiety and depression since i was 14. I shrugged it off thinking my biggest problem in life would be coming out as gay but once i finally did i figured out that was the least of my problems, although I was outted to my parents at 20 buts that’s another story. Point is I tricked myself into thinking coming out would solve all my problems when nothing really changed. I still have this black void in my heart that I have no idea how to fill. Over the years my mental health has steadily spiraled that’s to me ignoring it hoping when i got older it would just go away now here I am. My anxiety and depression have killed my emotions I don’t remember the last time I was happy, the last time I cried out real tears, the last time I was full of hope or joy, I’ve lost all ambition. I’m stuck in this state of limbo where I have no ambition to do anything let alone leave the house, get out of bed, shower. I just want to lay here and die of natural causes. I’m jobless and hopeless with no idea what to do with my life just a burden to others. What hurts most is I can’t help it. I feel as if my mental health is taking a physical toll on me now. I’m having gaps in my memory, I can’t sleep at night and when i do i wake with headaches, I can’t stay focused on something for too long or it physically hurts, and I have these random mood swings where i say hurtful things or lash out on the only people left in my life. I don’t know what to do or how to escape this hell I’m in right now. My friends don’t know what to say to me and my family acts oblivious like they no I’m suffering but choose to not care or even ask if I’m ok. Everyone just leaves me to my own choices and I don’t know what to do anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q7kpuz/24m_i_dont_want_to_live_or_die/", "title": "24M I don’t want to live or die", "social_network": "reddit", "user": "Exodusv4", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1634159268, "permalink": "/r/SuicideWatch/comments/q7kpuz/24m_i_dont_want_to_live_or_die/", "nsfw": false, "first_save": 1635427669.3390744, "replies_charged": false}