{"id": "t5_2qpzs_t3_q9s82n", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "Three years ago, I lost my two-year-old son. We never planned on having kids, we enjoyed our life as a child-free couple, we were the fun uncles and the Godfathers of our friends' children. But my sister-in-law lost custody of her 10-day old baby and we become parents overnight. He became our world, our friends became his uncles and aunties, and our whole life revolved around him, he was our sun. Then, we lost him, just as unexpected as his arrival was. I'm a psychiatrist, I know the grief stages, I know how to help others through their grief but my knowledge is fucking useless when it comes to my grief. I have clients who have lost loved ones, I have clients who have been suicidal, and I've been there to help them with their pain but while doing so, I couldn't help but feel like a hypocrite. How can I help these people who trust me with their problems when I'm drowning in grief? When I have been contemplating suicide from the moment we lost him? And everyone thinks I'm fine but I'm not. I don't blame them since I have pretty good at acting like I'm surviving when in reality I'm not. I have tried different types of therapies and medicines but nothing seems to work. It's crazy to see how a small child can change your life, we were able to see the world through his eyes, and boy, was it magical! I miss him. I miss his beautiful blue eyes. I miss his squeaky little voice saying, \"Daddy.\" I miss his maple syrup kisses. I miss having him in my arms while he's fast asleep. I miss seeing my world rise and fall as he breathes. I miss the sound of his laughter. I miss the sound of his tiny bare feet running down the hallway. I miss his hugs. I miss feeling his hand in mine. I miss him running into arms after a long day at work. I miss his sassiness and silliness. He was the carbon copy of my husband, he used to joke that he was now paying for everything he did to his parents as a young child. I miss his questions. I miss everything thing about him, and I wish I didn't sweat the small things because those are the ones I miss the most. I miss watching Frozen and Trolls on repeat, and every time one of my friends complains about watching the same movie with their children, I silently scream to them, \"your child is alive, do you even realize how damn lucky you are?\" I miss reading the same book a thousand times. I used to get so annoyed and upset when he would beat the shit outta me when he was asleep (no one told me how strong a toddler is while they're sleeping or when they refused to get into their car seat) but now I just wish he was here, to wake up and see him cuddling next to his dad or all stretched out like a sea star. When he learned how to walk our privacy went out the window, he would knock on the bathroom or simply walk into the bathroom if it was unlocked. Now, there have been moments when I have gone to the bathroom and broke down because it was too quiet, there is no more knocking. Everything is too damn quiet. Our car rides are not the same, no Disney songs are playing in the background, his car seat remained empty until we had the strength to remove it. Holidays are not the same, the magic is gone. Halloween is coming up and I wish he was here. I wonder what costume he would have wanted. I wonder who he would have been. He would have been five this year. What shows and movies would have been his favorite? Would he still want to sleep with us or would he have been ready for a big boy bed? Would he still want a puppy or would we already have one? So many questions. He had a life ahead of him. Would he want to be a cop like Dadda or a doctor like Daddy? Who would he have been if he was here, today? \nI've tried, I've tried to live for my husband, for my family, for my friends, and in honor of my son. But this isn't living. Waking up every day and curse because you're alive, it's not living. Surviving, it's not living. I've tried to be content. I have an amazing husband, amazing family, and friends but it's just not enough, it's not the same, and it will never be. I'm not writing this as a cry for help, I'm too far gone. I'm writing this to show others that no one has their life together. My life used to be Instagram perfect, our family used to be \"goals.\" We were a family of three, I had a job that I used to love and so did my husband. We had and still have a nice house with nice cars, and when people look at us without knowing about our son, about our pain, they would think we're happy, that we live a life with minimal worries. But it's just an illusion, nothing it's like it seems. Nothing can prepare you for the pain that it is to lose your child. Many of my young clients have told me they wish they were strong like me, but I'm no role model. I'm just a heartbroken man who tried to live after a heartbreak but failed. I'm done. I just want to be with him. I want to hug him and never let go. I want to feel his hugs and kisses. I want to hold his hand. I want to see those beautiful big and bright blue eyes. I want to hold him in my arms because that's where he belongs, he doesn't belong to God or heaven, he belongs in his dads' arms. I want to see his face. I want to see his smile and hear his laughter. I want to play with him, to tickle him, to play hide and seek. I want to tell him how much I love him, how sorry I am, and how much I have missed him. I hope he's there the second I open my eyes once again. And if there's no afterlife, if he's not there, at least I won't be in pain anymore. And if I end up in hell for killing myself, then that's what I deserve for failing him. As parents, we had one job, and we failed terribly. Maybe I'm meant to suffer, maybe that's why I haven't been able to live a normal life. Maybe I need to pay, I need to pay for not being there for him, for trusting the wrong person, for not being there to protect him, for not seeing the signs, for not being there in his last moments. I failed him so if I end up in hell, that's what I deserve. I'm done. I don't care what comes next, I can imagine all I want, but at the end of the day, I have no fucking clue, nor do I care.\nIf you have kids, please hug them and be grateful that you have them by your side, I know it sounds cheesy but I truly hope you are never in my shoes. And if you have a babysitter, it doesn't matter how many good reviews they have, take precautions, install nanny cameras. I was trained to see abuse signs and I didn't notice anything. There were no bruises, no injuries, until that fateful day. We woke up and had a normal morning, he had pancakes with strawberries and bananas while my husband had a smoothie and I had my cup of coffee. We hug him and kissed him and told him we were going to see him soon. Then, we received the call, and the next time we saw him, he was hooked up to machines that were breathing for him. His body was there, I could see him breathing but our little boy was gone. So, please, be cautious when it comes to your little ones, not everyone is dangerous, but just be cautious, please.\nI'm going home now, or whatever you go when you die, I don't even care anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q9s82n/im_done/", "title": "I'm done.", "social_network": "reddit", "user": "Ok_Can6112", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 14, "down_vote": 0, "creation": 1634447159, "permalink": "/r/SuicideWatch/comments/q9s82n/im_done/", "nsfw": false, "first_save": 1635425571.4840467, "replies_charged": false}