{"id": "t5_2qpzs_t3_oxhp70", "request": ["37248a85-36ad-4f27-afa2-d6240c3a39c2"], "text": "Trying to keep this short. I had an incident where I took way too many pills to where the amount was toxic. This was during some foggy days that I simply can’t remember no matter how hard I try to think about it. I now believe I was in a psychosis. I’d like to not go further into that part because I’m awaiting a professional opinion and treatment. \n\nHowever. At the hospital I had to go through some treatments to recover. Scared and confused I wasn’t sure if I should tell my parent or not. After a long talk with the doctor I decided they could tell my parent in case they where concerned. I truly regret my decision now. \n\nMy parent went into some sort of panic mode and almost harassed the hospital I was in. Calling the doctors all the time asking all kinds of questions demanding them to keep me there etc. I asked my parent to stop their behavior because it was causing me unnecessary distress. Trying to explain to them how I felt and so on. My parent refuses to listen to what I have to say. Telling me I’m ill as if this is completely new to me. This is something I’ve been dealing with for years and I’m trying to make sure I get the help I need. My parent have always been aware of my mental state because I’ve been expressing this a lot over the years. Now I believe they haven’t really been paying attention to me being open and honest all along. This hurts me very much. \n\nMy parent have almost been bashing me over this very incident ever since it happened some weeks ago. Telling me that I’m unstable. Saying that I should’ve come to them in advance even tho I have, they just didn’t listen. I also gave my doctor consent to tell my parent because I trusted them expecting this to be kept between us. Now a lot of family members I don’t even speak to knows. And my parent feels the need to tell me “They don’t know about it” totally random in any conversation if we talk about someone. (Conversations that’s totally unrelated to this topic)\n\nMy question is have any if you experienced anything like this? How did you deal with it?\n\nI’m trying to get past this and recover and not be dragged right back to that awfully painful event. It’s almost like my parent is trying to make me a prisoner in my own past. Help.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oxhp70/over_protective_parent_after_suicide_attempt/", "title": "Over protective parent after suicide attempt", "social_network": "reddit", "user": "SlutFaithful", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1628039805, "permalink": "/r/SuicideWatch/comments/oxhp70/over_protective_parent_after_suicide_attempt/", "nsfw": false, "first_save": 1635428564.2109494, "replies_charged": false}