{"id": "t5_2qpzs_t3_mz9xp0", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "I just can’t. I want the pain to stop. I need the anxiety to stop.\n\nMy hypochondria is driving me up the fucking walls! Over the last few days I’ve convinced myself I clearly have diabetes from one elevated test, have failing kidneys/liver, and hypertension. I literally don’t have any of those according to my doctor. But god dammit I spend so long everyday crying about it and researching it and scaring myself and working out and stressing about what I eat (which has become only a handful of save foods).\n\nAnd it’s never FUCKING ENOUGH.\n\nI can’t do this. I’m so tired. I’m so so fucking tired. And I tried so hard. I tried. I wish my anorexia would have killed me when I was thinner. I hate this. I don’t want to be alive.\n\nI just can’t function like this anymore. I’m a failure. There’s no fucking hope for me. Whenever I feel happy for even a quarter of a second all of my fears come back to me and I just break down once more. I’m so tired of crying. I’m so tired of plain meals that are honestly pathetic. I’m so tired of relapsing but in this way that makes it 10x worse. But no one takes me seriously because of hypochondria. I wish they’d take me seriously. I want a new body. I NEED a new body.\n\nI want to kill this one more than anything but god dammit I don’t want to die. That’s why I do all this. I simply don’t want to fucking die. But if this is my life then maybe it’s time. Maybe I’ve outstayed my welcome. I always joked that nature was trying to pick me off, but deep down I always believed it.\n\nI just want it all to stop. Please. Just make the anxiety go away. Even for just an hour.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mz9xp0/im_driving_myself_mad_and_i_cant_fucking_do_this/", "title": "Im driving myself mad and I can’t fucking do this anymore (RANT)", "social_network": "reddit", "user": "MentallyFuckedBerry", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1619476363, "permalink": "/r/SuicideWatch/comments/mz9xp0/im_driving_myself_mad_and_i_cant_fucking_do_this/", "nsfw": false, "first_save": 1635422277.050607, "replies_charged": false}