{"id": "t5_2qpzs_t3_22oclm", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "Hello. I make this post in part because I am drinking after a long day  so my inhibitions are kaput and in part because I find the tenor of the discussion on this subreddit a little... lopsided?\n\nI have been depressed since I was, at latest, 8 years old. I attempted to kill myself twice at that age (protip: it's actually pretty tough to off yourself with a knife whether you cut deeply or not, and attempting to suffocate yourself with a pillowcase might not work).  I'm a lucky little white suburban boy-child, with loving parents, so I've been getting treatment of all kinds since. In the last few months, I've been receiving electroconvulsive therapy (ECT), and it is the most effective treatment I have ever received. It has been like a miracle for me, and I feel so much better; it's as though I am a different person.\n\nI still fully intend to kill myself. For me, I have realized, it is as much an intellectual issue as an emotional one. As such, I am planning on buying a gun ASAP, just to have it handy should the time seem right.\n\nI am one semester away from having my bachelor's degree in a scientific discipline. I have close friends that I (now, at least) speak to frequently. My family is wonderful, and I have no significant family issues (my grandfather removed his own head with a boomstick, but that's ancient history at this point). I have various, conflicting plans for the future. I am seeing a self-proclaimed \"psychoanalyst/psychiatrist\" once a week. I just want to be clear that I am neither in despair nor do I have any reason to be.\n\nSo, the reason I am typing this tonight is pretty much morbid curiosity. I am too comfortable with my own head, at this point, and I want to see what other people have to say on the subject. My family can't handle it, and they all take it too personally, so it really just becomes a conversation about their feelings and nothing else (not to sound callous--I do care about their feelings, more on that later), so I simply won't talk to them about it, anymore. The same goes for several of my friends. My psychologist friend has suggested that I have \"anhedonia\", if that gives anyone here an idea of what specific malfunctions I have.\n\nI have experimented with harming myself to test for pain threshold and the like, and I don't believe I have any particular aversion to pain or anything else about the act itself that stands in my way. The only reason I am still alive is that I feel an instinctual revulsion to hurting my family and friends. This is becoming less of an issue as I continue to fail to see much difference between dying this way and dying any other way other than the fact that I have a good chance of outliving my parents if I let nature take its course. That's pretty much all that is keeping me from just painting some walls with my brains now: if I wait until my parents are dead, I see it as roughly morally neutral, which I care about for some reason I have yet to rationalize.\n\nI hope I have managed to communicate myself effectively. That's the gist of it, anyway. I'm curious to hear the thoughts of perfect strangers, if you're inclined to share. If I have posted in the wrong place, or this is otherwise inappropriate, please go ahead and delete this post without hesitation.", "url": "https://www.reddit.com/r/SuicideWatch/comments/22oclm/ect_has_made_me_feel_so_much_better_i_still/", "title": "ECT has made me feel so much better. I still intend to kill myself.", "social_network": "reddit", "user": "dagiarrat", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1397112173, "permalink": "/r/SuicideWatch/comments/22oclm/ect_has_made_me_feel_so_much_better_i_still/", "nsfw": false, "first_save": 1635426480.1346734, "replies_charged": false}