{"id": "t5_2qpzs_t3_oy6voe", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "The last couple days, I’ve been seeing this weird dream. Most of my dreams are weird, because some antihistamines and antidepressants can cause you to see weird dreams, and I’m on mirtazapine, so that’s probably why.\n\nAnyways its not really a single dream, more like the end of whatever dream I was seeing. I notice that I am in a dream, which happens very often actually. Then I get this feeling, like whatever binds my soul to my body is gone and my soul can leave my body. I feel happy and content, and I try to leave my body, I don’t feel afraid. Just as I feel like I’m being released from my body, I wake up, I notice that it was just a dream, and I feel disappointed.\n\nI’ve never attempted suicide, I don’t think I will. Although I came close a couple years ago. But these days things are becoming more and more hopeless for me. On top of that I am in physical pain some of the days because of IBS. Which is nothing compared to a serious disease. But where I am right now, I can’t hope for anything other than death.\n\nI can play video games sometimes though, so I guess I haven’t given up yet.\n\nI am not in a lot of pain, I want to say that again. I can’t handle it. I must be strong. But I am not strong. I am just not strong, that is just not who I am. Please don’t tell me I am strong, IBS is like not a serious disease. Most people can handle it just fine. My life has ended because of it, because I am not strong, I can’t push back.\n\nAnxiety attacks started again. God there is just so much darkness. It is drowning.\n\nI may not be able to reply if you reach out. I am going through an IBS flare up so I have to stay in the bathroom most of the times.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oy6voe/not_at_risk_there_is_an_immense_amount_of_darkness/", "title": "(Not at risk) There is an immense amount of darkness", "social_network": "reddit", "user": "nitratehoarder", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1628125802, "permalink": "/r/SuicideWatch/comments/oy6voe/not_at_risk_there_is_an_immense_amount_of_darkness/", "nsfw": true, "first_save": 1635427903.886674, "replies_charged": false}