{"id": "t5_2qpzs_t3_mvsd6x", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "So I’m not even sure if my case is an emergency but probably not.  I haven’t told anyone (my therapist, friends, family etc) but when I’m feeling particularly low like tonight I look up methods.  Mostly the consequences if it goes wrong, and there seems to be a lot like permanent brain damage etc which puts me off but the thoughts are still there.  I can’t message my therapist, it’s late.  I won’t message my friends, I feel like a burden to them at times.  They tell me I’m not, but when I message someone (not related to anything serious like these thoughts etc, just a regular message and they don’t reply, which is fine because I tell myself maybe they’re busy etc, but then they later message on a group chat, am I unreasonable to feel a little upset?) it makes me think if I weren’t here no one would notice.\nAnyhow, I don’t want to phone any helplines because it’s intimidating phoning people.  I’m not keen on phoning the mental health team, I’d be asked to go to A&E and it’s the middle of the night and I don’t drive, spend most the night there and have to make my way back.  I want to go to sleep but I can’t because struggling with these thoughts.  Maybe I should just push through them, but they always come back.  I don’t think I’m going to do anything tonight...my thought process is I need to organise things before ever doing anything, so I’m not in any immediate danger hence why this isn’t an emergency.  I really want to tell the people I know but don’t want them to think it’s just me attention seeking or to start treating me like the depressed, suicidal person rather than just me", "url": "https://www.reddit.com/r/SuicideWatch/comments/mvsd6x/whats_the_best_way_to_deal_with_suicidal_ideation/", "title": "What’s the best way to deal with suicidal ideation if too anxious to phone a helpline?", "social_network": "reddit", "user": "rhubarb1983", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1619048000, "permalink": "/r/SuicideWatch/comments/mvsd6x/whats_the_best_way_to_deal_with_suicidal_ideation/", "nsfw": false, "first_save": 1635427266.2464497, "replies_charged": false}