{"id": "t5_2qpzs_t3_3nu9o3", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I mean, isn't all this shit just one big sign from the universe that I don't belong here. Every day is a goddamn nightmare, I dread waking up in the morning. I've been abusing my xanax to sedate myself, trying to sleep more so I don't have to be awake. All the other meds do is take away my hypomanic states, which sadly were the only part of life I enjoyed. Right now it is just a static depression and that doesn't seem to be changing anytime soon. I used to be a straight A student, now I'm skipping classes left and right. I am going to have to coast on whatever natural abilities I have, which is a B student at best. I transferred colleges recently and abhor the new school. All I want to do is go back, thus putting another notch in the failure belt.\n\nPeople with autism are unwanted by society. This is a fact, you see it on the news. People would rather expose their children to deadly diseases then have them wind up like me. Aspergers is a fucking joke to people, it's used as an insult, people call it \"special snowflake syndrome\" because everyone with Aspergers is a self diagnosed reject that wants a blanket excuse for their shortcomings. People with autism are toxic, I might as well be a leper. I am nothing but a burden to everyone around me. \n\nI BP basically every day. It is hell, the addiction is like a drug. I used to be anorexic, people thought I recovered but any weight gain was just from binges. How pathetic is a male with an ED? It's a teenage girl problem. I never got treatment for my wahhh-norexia because my parents didn't believe it to be real despite me being 20 pounds underweight, which is probably why I botched the recovery so badly.\n\nI hate being lonely, but I hate being around other people too. I pretty much hate most people by default. I'm a bitter person because I've tried being nice for so long and it got me nowhere, so I kind of just don't care anymore. I mean, I'm not deliberately mean to anyone, but I'm not the kind person I used to be.\n\nI self-harm constantly. I love the feeling of pain. I bang my head against the wall repeatedly or whip myself with a belt or punch myself until I bruise. I'm basically killing myself slowly through that, BP-ing, and abusing drugs to sleep. Why not speed up the process? I've got over 100 .25 MG of xanax, all my other prescription drugs and a bar full of alcohol. I don't see a single reason not to down them all, chase it with vodka and wait to die. None of the anti-psychotics or anti-depressants work anyway, might as well put them to use.\n\nThanks for reading, I guess. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/3nu9o3/bipolar_aspergers_ocd_social_anxiety_disorder/", "title": "Bipolar, Aspergers, OCD, Social Anxiety Disorder, Bulimia; obviously I wasn't meant for this world", "social_network": "reddit", "user": "brainsonmytypewriter", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1444225703, "permalink": "/r/SuicideWatch/comments/3nu9o3/bipolar_aspergers_ocd_social_anxiety_disorder/", "nsfw": false, "first_save": 1635422925.1526446, "replies_charged": false}