{"id": "t5_2qpzs_t3_iysiy5", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I am always scared to go to sleep because it means i have to wake up to yet another day. The other night i lied awake and i began to weep, thinking about how much i want to die and how i am not even able to do that because of the pain it will cause to the people who would notice. The thing is that, even if there are people who say they love me or enjoy my company or care about me and would be hurt if i disappeared suddenly, i still *want* to die.\n\nIf only my death could easily be painless, for myself and for the people i would leave behind. It makes me feel devastated and conflicted just thinking about it; I really want to die, but i dont want to hurt anyone because of my decision. If only i can simply disappear from this earth without a trace and without anyone realizing i ever was a part of their life. If only it is so easy just to delete myself from existence without it having an impact on others.\n\nAll week there was the thought of death, i have been thinking about that more and more than anything else. I would be sitting there doing nothing and i feel exhausted already and i would only have the energy to listen to music, particularly a song about blowing my brains out because that's the only kind of thing occupying my mind these days.\n\nRegardless of whether or not i will be 'happy' later on, regardless of all this love and support, i still just want to not exist. These suicidal thoughts are not simply because i want to end the suffering anymore. It is also because i have thought about it, deeply, on many days and nights, and it makes complete sense for me to cease to exist later, it is something i actually *want* because i truly have no will or desire or need to live - simple as that. \n\nIt is a common belief that suicide is a selfish, easy way out. I can understand where this belief comes from, and i know how hurt people can be if they knew and loved somebody who committed suicide. But if people want to live, why can't others want to *not* live, without feeling guilty about it and without feeling like they have to stay alive for longer than they'd like to?\n\nDespite wanting to die, i cant do it. Not because i am scared of dying, but because i am scared of what my suicide will do to the people currently in my life. And the thought of that holding me back makes me feel even more depressed. It can be so easy for me to just do it, but i cant, at least not now.\n\nI'm sorry for these thoughts. I just wanted to write this where someone could understand me even if just a bit, to have these thoughts simply be heard, without being told \"it gets better\" \"try not to fixate on death\" \"you've been through so much and you're still here\" or \"i would never forgive myself if you ended your life.\"", "url": "https://www.reddit.com/r/SuicideWatch/comments/iysiy5/the_other_night/", "title": "The other night", "social_network": "reddit", "user": "revealinghope", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1600931720, "permalink": "/r/SuicideWatch/comments/iysiy5/the_other_night/", "nsfw": false, "first_save": 1635428162.552271, "replies_charged": false}