{"id": "t5_2qpzs_t3_qgzrzj", "request": ["5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "Throwaway for purposes of identity protection and anonymity.\n\nSo, how can I begin this?\n\nAt the end of 2019, my dad died due to cancer and, although I've suffered for a while, I can't say the same for my little brother, who was 13 years old at the time.\n\nAfter the year has ended, he entered into a very problematic depression with suicidal tendencies, in which he started taking Zoloft 50 at the time.\n\nFast forward to January 2020, my mom and I caught him trying to kill himself with a dozen or so of those damn pills and we didn't know how to react to that, and instead, we took him again to another psychiatrist. With that, this doctor also prescribed antipsychotic medications, along with Zoloft, because, at the time, he had this complaint that he was listening to words.\n\nfast forward again to May 2020, when he stopped taking those meds due to the doc's orders and, during those insane lockdowns, we've noticed that his symptoms haven't been improving and he tried to kill himself again and stopped going to his online therapy.\n\nNow, fast forward to August 2021, because it's the time that he started having symptoms again and he was meeting more friends into his school, after a long year of lockdowns. We also noticed he was getting very stressed out for some reason and, due to that, we've seen him in several episodes, such as one where he pulled a kitchen knife and tried to kill himself in front of my mom. He was also caught trying to take again other medications to kill himself, and, the most recent event is where he was banging his head hard against the wall, and started to scream in pain. After all of that, we took him to a hospital and he started taking Zoloft again, but this time, it was a 100mg dosage to help him improve those symptoms.\n\nNow, in October 2021, the school called and reported to us that he was having strong headaches, was very sleepy and moody and, the most problematic thing: he took 4 pills of Metamizole (dipyrone) 300mg and never even reported to us that he was having those headaches.\n\nSorry for such a long report but, I don't know how I can help my brother overcome this issue and I can't get rid of the fact that I'm trying to do everything in my power to help him improve, but with his suicidal tendencies, he keeps telling me and my mother that he hates u and everybody else, that we're depriving his of his freedoms and that he wants to run away from home.\n\nDue to doctors orders, we have prohibited him from going outside to meet friends outside of school, go to social events unless supervised by another adult and, that he must be monitored all times, all due to his history of trying to kill himself multiple times, but, thank god he never even came closer to do that.\n\nAnyways, I wanted to know how, along with the help of this amazing community, how can I help my brother overcome this suicidal tendency and depression? I'm in despair and I simply don't know what else to do...", "url": "https://www.reddit.com/r/SuicideWatch/comments/qgzrzj/i_need_help_with_my_suicidal_little_brother_i/", "title": "I need help with my suicidal little brother - I simply don't know what to do anymore", "social_network": "reddit", "user": "TAsuicidewatch179482", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1635349966, "permalink": "/r/SuicideWatch/comments/qgzrzj/i_need_help_with_my_suicidal_little_brother_i/", "nsfw": false, "first_save": 1635428286.2649066, "replies_charged": false}