{"id": "t5_2qpzs_t3_lrugag", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I have contemplated suicidal thoughts many times. And I honestly haven’t done it because of indecision, a strong self-defense instinct, or maybe just scared, not because I don’t want to. Have played with cutting myself many times, but never close to life threatening, I usually get drunk and eventually lack the energy for seriously doing it.\n\nMy life from the outside looks great and people probably won’t think I am hating it, but I am just tired of it. And day after day I have less reasons to keep going. Things that I used to assign a lot of value have lost it, no-one appreciates my efforts, and nothing I do “for myself” makes me happy, even things that should.  I might never work out the courage to do it, but that feels even worse if it makes sense.\n\nMy problem is every time I seek for support online, I feel like I am treated like a child. No one treats it like a real option, you get lots of generic advice, and guides to “help yourself”, relaxation techniques, get a hobbie, seek family (who probably cause a lot of it) and so on.... I really don’t want to help myself. I want things to stop, or to stop being shit and more and more the “stop being shit” option feels crazy and unrealistic.\n\nAre there any resources that you can recommend that treat things without that overly positive tone, or so much stigma, don’t try to empathize with me through generic text that is aimed at literally any human that visits their site, and that did help you? Something that is less patronizing than the first 100 google results.\n\nDo you, or did you feel the same way?", "url": "https://www.reddit.com/r/SuicideWatch/comments/lrugag/i_feel_condescended/", "title": "I feel condescended", "social_network": "reddit", "user": "Apprehensive_Diver98", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1614218320, "permalink": "/r/SuicideWatch/comments/lrugag/i_feel_condescended/", "nsfw": false, "first_save": 1635426640.3825235, "replies_charged": false}