{"id": "t5_2qpzs_t3_j3bwzd", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "Hi, \n\nI am 29 years old, almost 30, and have been actively battling suicide, since about the age of 13 years. Since young childhood up until 3 months ago, I have experienced severe domestic abuse with many people and their households. Neglect, Physical, emotional, verbal, mental, sexual assault and abuse in life, as well as being in two cults, and being brainwashed and damaged by the \"spiritual teachers\" and others in the community. I haven't been in any cult for nearly 2 years. Nor in a relationship for a year and a half. I don't have contact with my father, and my mum and I escaped him 3 months ago. I experience non epileptic seizures and severe complex PTSD from everything I've been through. I also have some other issues with my mental health such as clinical depression, as early as 13 or 14. I am in unbearable pain all the time, constantly tormented by my past, everything I've been through, and it won't leave me alone. It won't ever leave me alone. I try so hard, and I have all these years, trying to do better, but ending up more traumatized. I'm now on disability. I don't know how to do this anymore. I wish I could explain what a day is like. For hours on end I am tormented by flashbacks. For hours on end I am also tormented by chronic rumination of the past, all the things that have caused me the most trauma, and I can't stop it :'( I go to 3 different regular therapies. I am tired. I am teary, and also angry at myself that I can't make my brain stop. I just want peace. I literally feel I am being tortured everyday. Anyway I am sorry for sharing this. I know this is bleak, and I don't want to bring anyone down who might read this. I think I just really wanted to see if I could try and share here what I am honestly going through. I feel vulnerable sharing this so I might delete it if I end up feeling too anxious. It can be hard to open up. \n\nLastly, I just want to say that I hope today treats you kindly somehow. Because none of you deserve to suffer or go through what you're experiencing alone.", "url": "https://www.reddit.com/r/SuicideWatch/comments/j3bwzd/my_first_group_post_i_think_im_looking_for_any/", "title": "My first group post. I think I'm looking for any bit of genuine understanding, but if that's not possible given the context, then empathy if anyone feels up to it. Thank you so much.", "social_network": "reddit", "user": "dear_pixel_heart", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1601569762, "permalink": "/r/SuicideWatch/comments/j3bwzd/my_first_group_post_i_think_im_looking_for_any/", "nsfw": false, "first_save": 1635428064.351195, "replies_charged": false}