{"id": "t5_2qpzs_t3_inyjxk", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "Hey everyone, I am a 19M who is currently living with my parents due to Covid. Past  month I have been having these sort of \"extreme\" panic attacks at the midde of the night which has been keeping me aways a good nights sleep. This panic attacks makes me cry uncontrollably for minutes sometimes ranging to hours...Now I have never experienced any sorts of mental depression or anything but I am quite Asocial and have  quite a few people in my lives. Those few peoples are just my parents and some gaming buddies that's all. I am my parent's eldest child and the realization that one day they will leave me are causing these panic attacks. As the eldest child I always feel like my parent's deserve more from me but they never pressure me or anything, actually they are quite supportive unlike any other stereoptypical asian parents  they are always easy on me and help me with everything they got, my dad is even financing my university studies even though we are just a regular old middle class family. Now I am also not quite a religious person but during these month I have been praying to god to \"give\" my life to them in return  just give me some cancer or  something that I will just die slowly or just end it with a bang, even though suicide is forbidden in my religion and morally so. I have never ever contemplated suicide b4 even though I had tougher times during high school years, I never thought of ending my life, even now as I think of about it, feels very absurd , but just the thought of watching my mom and dad pass away kills me everytime and encourages me more and more to just do it.\nI just need some advice....", "url": "https://www.reddit.com/r/SuicideWatch/comments/inyjxk/sometimes_i_want_to_kill_myself_as_an_act_of_a/", "title": "Sometimes I want to kill myself as an act of a \"Sacrifice\"", "social_network": "reddit", "user": "Roryx_404", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1599443206, "permalink": "/r/SuicideWatch/comments/inyjxk/sometimes_i_want_to_kill_myself_as_an_act_of_a/", "nsfw": false, "first_save": 1635428189.581718, "replies_charged": false}