{"id": "t5_2qpzs_t3_k5j3qa", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "My friends joke about wanting to kill themselves constantly. “Haha if I get below a 60 on that test I’m actually gonna kill myself.” “Omg my new teacher makes me want to kill myself.” “My mom is so annoying I wanna die.” \n\nSo every time I try to express that I’m genuinely suffering, they don’t take me seriously. It’s like everyone either thinks I’m an attention seeker or kidding. Even my psychiatrist just looks at me blankly, raises my medication dosage and says “try not to do anything until next week” every single session. The only reason I’m not dead yet is because I can’t find a reliable and minimally painful method.\n\nI’ve been waiting for the right time and the right method but honestly I don’t even fucking care anymore. Next time I get the chance, I’m gone.\n\nEDIT: \nFirst of all, thank you to everyone giving me support and awards! It genuinely means so much. You’re all such wonderful souls and I’m sending you all the love you need to get through whatever it is you’re going through :) <3\n\nSecondly, I feel like this post is getting misconstrued a bit so I want to clear some things up. I totally get that I wasn’t very articulate - It was just sort of an angry vent and I didn’t imagine it would get so much attention. Anyway, My point in the original post is NOT that people aren’t allowed cope with humour - I even cope with humour myself sometimes. My point is that it’s frustrating that wanting to die has become the punchline to half of the jokes on the internet, so even when you’re trying to talk about being suicidal in a serious manner, people treat you as if you’re kidding. \n\nI also understand that absolutely no one’s obligated to listen to me. I always make sure that my friends are okay with me venting to them before I say anything even remotely emotional. If they’re not, I totally understand and they have every right to ignore me or tell me that they don’t feel comfortable with that. But responding to my “I’m struggling really bad right now” with a laugh and a joke is hurtful and unnecessary.\n\nI also know that people might joke but actually be serious and coping through humour, but there’s just no need to turn what could be a meaningful conversation into a joke. If I come to someone about something and they respond with “I feel that way too, I’m sorry,” that’s absolutely valid. I have no issue at all with that. Just please don’t laugh at me. \n\nAnyways, hope you all have a great day. Keep fighting.", "url": "https://www.reddit.com/r/SuicideWatch/comments/k5j3qa/the_fact_that_suicidal_ideation_is_so_normalized/", "title": "The fact that suicidal ideation is so normalized makes it impossible to get help", "social_network": "reddit", "user": "untrying", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1548, "down_vote": 0, "creation": 1606945219, "permalink": "/r/SuicideWatch/comments/k5j3qa/the_fact_that_suicidal_ideation_is_so_normalized/", "nsfw": false, "first_save": 1635427247.1989903, "replies_charged": false}