{"id": "t5_2qpzs_t3_gq3cnq", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "This post is going to be long\n\n&#x200B;\n\n18 (F) I want to start off by saying I don't know why I did it. It was after a fight with my mom, over texting she called me an ungrateful bitch and blocked me. I was anxious and I was sad but i've been sadder. I cut myself on my thigh. I didn't even think the pills would kill me, I guess it was more of self-harm by poisoning than a suicide attempt. All I know for sure is I took 2.5 Ativans and after that didn’t work I took a prozac. Then dumped the container on my bed and counted them. This was the third time I did this, if I didn’t act on it then it wouldn’t mean anything. I took 20 pills of prozac and with a sip of water completely surprised on how easy it was. I put on my shoes and went for a walk. I was crying, drafting a note I ended up deleting. I arrived at a spot my boyfriend and I agreed to have a picnic at. Now it might not happen. I got home at 7:30 on May 22nd, and took 20 more pills. Only 6 left so I took those as well. My mom came home and told me off again, unblocked me, and said she loved me. I started crying hard. She told me I was stupid for crying and went upstairs. Three hours later I texted my boyfriend about how I was having a bad day and he told me to trace a picture. We started joking around and I ended up laughing. Laughing after a suicide attempt. I texted my friend explaining what I did and she asked me what would happen if I told my mom. I said my mom would yell at me. She asked me if I could tell my brother. That was even worse. I went upstairs and my mom hugged me. I cried and she asked why. I whispered “I took too much prozac” she asked how much. I said “a lot” she was alarmed and said “did you overdose?!?” I nodded, unable to speak. She told me to put on my shoes. I think the main reason I told her was because I was scared about having a seizure. It’s one of my biggest fears. Her advice was to make myself throw up first and she'll take me to the ER. I didn’t tell her I already threw up and the taste was so bad I ate an egg roll so it wouldn’t happen again. I couldn’t throw up again, even with my years of bulimia. She said “I guess we wouldn’t have ipacac anymore” We went to the car. She cycled between being comforting, angry, and sad. She told me to google info about prozac overdoses, it was nothing I didn’t already know from prior research. She told me I should have told her three hours ago. She asked me how many pills, I said 40, she asked me what the dosage was, I told her 40. She said “Damn it [name]! You’re gonna need a liver transplant!” She says we have to make up a story to tell the people at the ER. \"I was anxious and I thought taking prozac would help. It was impulsive and without considering the outcome, I took a handful.\"\n\nbackground on me and my mom: She may or may not know I cut, she doesn't know I have an eating disorder, she does know I'm anxious and depressed. I asked for therapy once a month for the past year and a half. My mom always says she'll try but I don't think she does.\n\nThe receptionist asked why I was there. “I took too much prozac” she got awkward “like... on purpose?” I tried to act like I was perfectly fine. my mom said “it was a fluke” and we got lead to the er room, which was more curtain than room. \n\nThe ER doctor asked \"How much did you take, 10? 30? 50?\" I told him I didn't count but probably 30. 50 struck me as being such a large number, I didn’t realize that’s actually really close to the amount I took. He asked the dosage, I said 20mg. I don't know why I lied about the dosage, I guess I didn't want to worry the doctor. Stupid, I know. He asked if I took any pills other than prozac, I said no. The ativan wasn’t enough for me to worry about or want to tell people. I was asked if I ever thought of suicide or going to sleep and not waking up. I said no. Not exactly true but I didn’t want to stay there long. After a few more questions he called poison control and then talked to me, he said the biggest risk is serotonin syndrome. I knew that from my googling I did earlier. They tested me for corona, there was a few hours where I stayed in the emergency room, my mom read me an op ed piece on how suicides were increasing during the quarantine. She mentioned how it didn’t apply to me. I was afraid it did. I was negative for corona so they moved me to a room on another floor where I could be observed. My mom had to fight to get permission to be there with me, she left me in a wheelchair by a desk in a dimly lit hallway while she harshly conversed with the lady there. When she got permission, we were taken to a room. There was a hospital gown on the bed. I asked the nurse if I had to wear it. She said no but it might be easier to sleep in it instead of street clothes. I was afraid if I wore the gown then they would see my cuts on my leg I made that night. I had a headache and was dizzy. I got an IV with saline and didn't cry so my fear of needles can kiss my ass. The nurses were very nice, I was scared of sleeping in the ER because, although the doctors didn’t tell me this, I thought if I went to sleep I wouldn’t wake up. I didn’t want to die. It was probably 3 AM when I slept. I woke up to the new doctor being there. She asked me in a thick African accent if I knew where I was. I said the hospital. She asked me if I knew why. I didn't want to say it out loud. It felt wrong admitting it because until this point I didn't say directly what I did. I usually danced around it. That wouldn't do here. \"I took too much prozac.\" \n\nI couldn't bring myself to say \"Overdosed.\" That word made it all far too real. I was told I would have to video chat with a psychologist and he'll say if I'm a danger to myself or others. This was fine. My nurse was nice, she was named after a girl from Gone With The Wind. She told me my phone was on the floor, it fell when I was sleeping and broke so half the screen no longer worked. The nurse made me pull up my shirt so she could give me a shot in the stomach, I asked her if I could avoid it and my mom told me just to take it so I wouldn’t seem problematic. I don’t remember who did this but I had to get stickers put on me for a heart rate monitor. I put on some crime drama that my mom likes and watched tv for a while. My dad called and asked where my mom and I was, she said I had a really bad headache so I had to be taken to the ER to get meds and an MRI. The nurses visited occasionally. From the way I spoke and how I acted, you would never be able to tell I overdosed the night before. The gone with the wind nurse was engaged and marrying a guy who’s last name was Lee. The hospital was peaceful. I felt okay for once. Then someone wheeled in a computer with a camera.  It was time to talk to the psychiatrist. He asked me what I did and why. I stuck to my story. He asked me the same screening questions they're required to and then he asked me \"What do you think about what happened last night--taking the pills.\" It was another sentence that was too direct. I told him it was a stupid thing that I did. we played some more question and answer. He asked me if there was a gun in the house, I said yes but it didn’t work. My mom said “it’s an antique” it wasn’t. It just didn’t have bullets. He said he’d put down ‘no’ then. (Edit, my mom told me that there is a gun in the house but she didn’t want to tell him that) after 30 minutes he said \"you made a choice, a potentially fatal choice. Although it wasn't an attempt it would be a mistake to pretend it didn't happen. It's my recommendation that you get discharged because going to a psych ward wouldn't do much in this situation\" He told my mom to get me a therapist and to only give me a week's worth of medicine at a time and not to let me have access to pill bottles. seemed fair. I later figured out she wouldn’t do any of that. I asked the nurse if I could take out my own IV, she said okay but told me to wait. I was picking at the tape, my skin coming off with it. Then I completely removed the tape, tube still inside me. I pulled it out a little. No blood. Kept pulling and got to the end. There’s the blood, shit. I went to the bathroom and grabbed a paper towel. The nurse walked in. \n\n“Where’s your IV?!” “\n\nI removed it” \n\n“Well I brought gauze for you”\n\n“I used a paper towel”\n\nMy mom said “wash your hands and get the blood off your wrist”\n\nmy mom asked the nurse for some recommendations for therapists. She gave her a packet as we were leaving. Another empty promise. I got home and took a nap. my brothers asked me if my headache was gone. I said yes. I went to my room and took all my medicine out of it. I was a bit bothered that my mom didn’t do it instead. At bedtime my mom looked me in the eyes and asked if I was okay for the night. I was. She asked me for the bottle the pills were in because of the ER doctor asking. I showed her but it didn’t matter anymore. \n\n&#x200B;\n\nI honestly wouldn't regret this whole situation if it ends in me getting the help I need and causes my mom to take my mental health issues seriously.  I'm weirdly calm now but I won't pull this shit again and I don't recommend overdosing to anyone", "url": "https://www.reddit.com/r/SuicideWatch/comments/gq3cnq/i_overdosed_two_days_ago_and_need_to_get_my/", "title": "I overdosed two days ago and need to get my thoughts in order so here's my story", "social_network": "reddit", "user": "anxiety-and-theatre", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1590376513, "permalink": "/r/SuicideWatch/comments/gq3cnq/i_overdosed_two_days_ago_and_need_to_get_my/", "nsfw": false, "first_save": 1635422938.063422, "replies_charged": false}