{"id": "t5_2qpzs_t3_qevyrf", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351", "4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I'm worried about my ex gf who I had dated for just over a year, we broke up about 3 months ago but have kept in contact on and off since. The relationship wasn't healthy at all, for starters it was long distance (we lived \\~5 hours apart), but real issue was that about 80% of the time we had dated she was forced into having to live with her ex bf who is a narcissistic manipulator and had put her through about 7 years worth of emotional abuse. She also has an 8 year old kid, but not with her ex that she's been forced into living with. Anyways since our break up she's had a lot of time to think and has come to the realization just how much she's been brainwashed and manipulated by him over the years which came as quite a shock to her and how she could be under his control for so long without even realizing it. I've been the only man in her life that has actually treated her well and made her happy and is blaming everything on why our relationship ended 100% on herself even though I tell her its not.\n\nShe has only attempted to kill herself one time which was years ago, she cut her wrists and had to get rushed to the ER and they fortunately were able to stitch her back up and save her. Throughout our relationship she would mention how she'd have thoughts about killing herself whenever she got into one of her really dark moods triggered by her ex, I'd say it was maybe once per month that would happen. Lately it's becoming more and more frequent though and I'm unsure if they are empty threats and she's just looking for pity from me or if she is serious about it at all.  It's really been waning on me and I would want nothing more than to be able to help her, but being 5 hours apart and not being able to do anything to get her out of her living situation really has me sitting here feeling helpless. I've thought about telling her mom which is really the only friend/family she has in her life that she could talk to, but I really feel that her mom would make things much worse for her. I have no idea if there is somewhere I could call that would have to bring her in by law in order to evaluate and give her help if need be, anytime I've thought about that I decided not to even look into it because I'd fear if I did make a call to have that done and if she wasn't being serious when mentioning suicide then it could make things much worse. Over the years her ex had made sure that she felt she had no need or desire to maintain her friendships, so she really has no friends, she is literally the only person in her life she can talk to. I honestly don't know what I'm posting this for, I feel like I've ran out of options and there is nothing I can do other than continuing to communicate with her but it's starting to have an effect on me feeling helpless and I feel nothing I say to her matters anyways. I guess if anyone has any suggestions I'd be open to hear any.  \n\n\nEDIT: What made me decide to post was her text she sent me a little while ago saying how suicidal thoughts are all she ever thinks about anymore, and that her step sister got married making her realize she'll never be good enough for anyone in terms of getting a house together, marriage, having kids or anything... this makes it even harder for me to respond because I just want to tell her how selfish she's being, but I know that's never anything that should be said to someone having suicidal thoughts.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qevyrf/between_a_rock_and_a_hard_place/", "title": "Between a rock and a hard place", "social_network": "reddit", "user": "InTheEndItDsntEvnMtr", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1635094072, "permalink": "/r/SuicideWatch/comments/qevyrf/between_a_rock_and_a_hard_place/", "nsfw": false, "first_save": 1635423152.2893019, "replies_charged": false}