{"id": "t5_2qpzs_t3_4523c3", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "So, I have been a reddit lurker for years.  Made an account just to post here because of how odd I feel right now.\n\nFor as much self-loathing and depression I have, suicidal thoughts have clouded my mind for decades.  I always start to feel suicidal thoughts rolling through whenever I am at my worst.  When I am extremely hurt or upset.  When I've been kicked while I was down.\n\nAfter two failed attempts, and seeing the effect it had on those I loved, I vowed to never attempt again.\n\nToday?  I don't feel that I'm in any danger, but the thoughts are back.  The odd thing about it this time is...  Well.  I am not crying or upset.  I am not super angry.  I am calm.  I am logically thinking.  It makes perfect sense for me to just take like, the proper amount of pills and liquor to do it.  Don't worry, I know I won't do it.  Specifically because I don't know where I'd get half of the items I'd need.  Yet...  Logically, it makes perfect sense.  Like, I wouldn't be crying, I wouldn't be upset, I wouldn't be listening to Radiohead, none of my normal suicidal behavior would take place.  I visually see myself calmly performing the act and just sitting outside under the stars waiting for it to finish.  Just being totally chill and \"whatever\".\n\nThis is quite odd.  Has anyone else experienced these type of thoughts?  Where it just...  makes sense?  Where you're not crying and actively hating?", "url": "https://www.reddit.com/r/SuicideWatch/comments/4523c3/a_new_mental_state_of_suicide_for_me_at_least/", "title": "A new mental state of suicide (for me, at least).", "social_network": "reddit", "user": "metal_spider", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1455100008, "permalink": "/r/SuicideWatch/comments/4523c3/a_new_mental_state_of_suicide_for_me_at_least/", "nsfw": false, "first_save": 1635425263.7739613, "replies_charged": false}