{"id": "t5_2qpzs_t3_mnwge6", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I don’t know what to do anymore. I’ve always been ugly and no matter what I try to do with my appearance I will always be unattractive.\n\nPeople will say “oh appearance doesn’t matter, you’re in a relationship so who cares what other people think”, well I fucking care.\n\nI care because do you really know how it feels to never feel confident about yourself? Do you know how it feels to not be able to take pictures of yourself or even walk past a mirror without wanting to kill yourself? Do you know how it feels to not be able to buy new clothes because you don’t want to look at yourself? What about spending thousands on skin care and other cosmetic products because you would literally do anything to look less horrible than you do now but even after all that money, time and effort it does absolutely nothing for you?\n\nI’ve been bullied and called ugly my whole life, the comments people say to me really stick and still go through my head and keep me awake every single night. I was called ugly for the first time when I was 6 years old by a high school kid at school, and I will never forget that.\n\nI was always the ugly fat friend that had to watch all my other friends get boyfriends and guys that had crushes on them and I just had to sit there and act like I didn’t care when I’m reality I was so fucking jealous and depressed because of it.\n\nI never really had any boyfriends or anything up until I met my fiancé 3 years ago and I can guarantee if he didn’t get to know me online before we really met in person, he would’ve taken one look at me and chosen someone else in an instant.\n\nI’ve always felt like I’ve been disadvantaged because of my appearance, such as never being in the cool social inner circles at school and all of my jobs, being instantly hated and judged before people can even get to know me etc..\n\nEverything’s getting worse now with time and genetics not being kind to me, as well as me and my partner becoming a semi-open relationship.\n\nHe could get any girl in an instant but I tried to do my thing the other weekend and basically it was me and a couple ‘friends’ with my partner and his work friends, basically it was established that we were open and I was interested in one guy (the only one that would even talk to me) and it was going okay but he literally tried to get with every single one of my other friends before he came back to me and it got very close but nothing ended up happening because my partner wasn’t feeling the night anymore and needed to go home and of course he comes first over any other person, but basically he’s still trying to get with my other friends (even the ones that are in exclusive relationships that have said no) over me, literally even my one friend that is significantly less attractive than me (I’m not trying to be rude but it’s true) before me and I know every single guy on the earth doesn’t have to like me or find me attractive or anything but it just had a major impact on my confidence and it just reminds me that I will always be everyone’s last choice  and I will always be the ugly one.\n\nMaybe I sound stupid but being ugly is hard and it feels so fucking shitty to never feel good about yourself or get attention from people. I did actually kinda date someone in school (another literal reject that had no friends and no one liked just like me) and we worked together and a guy we went to school with too came up to him at work and said “oh you’re dating her? That’s disgusting you could do better man”. That shit hurts.\n\nAnd I know if anyone’s reading this you’re probably thinking “oh it’s not her looks it’s her shitty attitude” judging from how much of an asshole I probably sound right now calling other people ugly and stuff. But I am a fucking good person. An untalented, useless, ugly but good person you know, I really think I can have a good personality when I don’t feel super depressed and suicidal, but I’m just fucking done right now and I need to get this shit off my chest, I’m so done being nice to everyone when all I get back in return is insults and pain.\n\nThere’s no way I can afford plastic surgery and a lot of my issues can’t even be solved by surgery so I really feel like the only option is to just end it like I’ve always wanted to.\n\nNo, I can’t just accept and love myself. No, trying to be nice and giving me false hope by just shutting down everything I say by saying “awww you’re not ugly” doesn’t help at all.\n\nI don’t know I’m really just done, I’ve been crying for the last 3 days straight just knowing the whole world thinks I’m unattractive and there’s nothing I can ever do to feel confident and happy and I just can’t deal with this pain anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mnwge6/im_so_sick_of_being_ugly_suicide_seems_like_the/", "title": "I’m so sick of being ugly, suicide seems like the only option", "social_network": "reddit", "user": "TheAnxietySheep", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1618022619, "permalink": "/r/SuicideWatch/comments/mnwge6/im_so_sick_of_being_ugly_suicide_seems_like_the/", "nsfw": false, "first_save": 1635427127.3889768, "replies_charged": false}