{"id": "t5_2qpzs_t3_qdxbmy", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351"], "text": "Moreso lately, I've been getting into dark headspaces and just sitting with it and seeing how deep they go, not doing anything to fight it and just seeing how much awful and horrible shit i can believe.i don't think life is worth living, it's all a trap. You exist now, and so you're responsible for everyone else who's known you no matter how much you want to believe you're not.\n\nThe past few years the only thoughts I can usually get through my head are just negative self-loathing or fantasies where i manage to escape and vanish from society gracefully without anyone noticing and normally i block it out and distract with the internet and media but I'm done.\n\ni keep imagining ways I'll die. Really vicious stuff, putting a knife in my throat, shooting myself in the head, jumping off of buildings, walking into traffic. Lots of that.\n\nI just have nothing to offer anyone, if there's one thing I've had for years, it's been that I'm sweet, but that is all i have, I'm nothing else, I'm so dumb and alone.\n\nI've seen pity in so many people's faces. I'm so dumb that people see how useless i am and how hard I'm trying and still failing relentlessly to be of use to someone and so i see pity from everyone and it hurts worse than anything.\n\nPeople tell me I'm a perfectionist, but I'm not, I'm just terrified of seeing that look ever again, it's like putrid toxic fumes to me. It makes me want to smash my head through glass.\n\nI thought I'd finally graduate and get a job and figure it out. That was my light at the end of the tunnel this whole tim,  being on my own, i thought that's what I needed. I realized in school i was studying a major i didn't care about and so i thought i was deciding to do something for myself when I switched to something i was fascinated with but now i have the degree, im here, alone, and i know less about who the fuck I am than I ever have even though I have everything I've ever worked for for years. There's no meaning in fucking anything, it all feels so fucking empty. All i ever feel is pain, i can't even remember a time in the last few years where i felt genuinely happy because of something that wasn't drugs or alcohol.\n\ni don't need anything anymore. I don't want anything anymore. I'm just empty and waiting for death, hoping it's fucking soon.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qdxbmy/i_keep_spiralling/", "title": "I keep spiralling", "social_network": "reddit", "user": "strranger101", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1634961456, "permalink": "/r/SuicideWatch/comments/qdxbmy/i_keep_spiralling/", "nsfw": false, "first_save": 1635423166.221114, "replies_charged": false}