{"id": "t5_2qpzs_t3_q9egyn", "request": ["5f7c2841-3f43-4682-8126-88825da57933"], "text": "Hello, if you are reading this it’s because I consider you a friend. If you don’t consider me a friend please don’t read the rest of this text.\n\n\nI’m currently either dead or in the process of dying, I am letting you know because I care about my friends and don’t want to make you guys start looking around for answers in a couple weeks when you realize I’m missing. I also don’t want you to think that I stopped talking to you specifically or something. I also don’t want anyone to feel guilty or think this was their fault.\n\nNow I won’t get into the how I’m doing this but it’s too late to change this decision, I’ll try to explain a bit of the why to give you closure, and to get this off my chest before I go.\n\nSo let’s get some common arguments that I’ve already heard dozens of times out of the way, and in the process I’ll explain a bit more about the situation.\n\n“Oh but James, you have so much to live for” or “it gets better eventually” or “your future self wouldn’t want you to do this” or any other alteration of this statement.\n\nWhile that might be true I don’t think the journey is worth it. I’ve been planing this for several months now. I have prayed extensively asking God to help me improve and change something, but for some reason that I do not know He hasn’t. I’ve tried medication and therapy, I’ve tried burying myself into work, videogames, or hobbies, I’ve tried every piece of advice available to me, lately I’ve been sleeping ten to twelve hours a day and working eight of the waking hours I have, I don’t find enjoyment in any hobbies or anything else I can do in my free time, I’ve been trying to do things I used to enjoy such as juggling or reading, or trying new things I’ve always wanted to do but everything feels dull. I haven’t had a “happy day” in months. I don’t see how this could change anytime soon. Joy in life is made out of novelties and new things, but the excitement of those things wears out eventually. There are still things I wish I could have done, but honestly I don’t see why I should try.\n\n\n“But James, you have a family and friends that care about you!”\n\nIt is true that I have a family that  loves me. And I love them very deeply in return, but right now while I have a handful of people that consider friends there is only one person that I consider a close friend. He is the only person that actually reaches out to me to talk instead of me reaching out to him. Now if you’re not this person I don’t blame you. Everyone has personal lives and things to do. I have never expect and would never have expected that you take out time out of your schedule to talk with me.\n\nLife moves on. Some people move forwards with it and some people are left behind. I don’t blame those in front for being in front. The only person to blame is myself.\n\nAs for my family, like I already mentioned I love them very deeply. And I know they love me the same way, but at a certain point the constant suffering and sadness I’ve been going through has overpowered this love I have for them. I recently realized that sometimes in life you need to put your needs before the need of others. And for me this means ending the suffering in the only possible way.\n\nOver the last couple months the sadness and depression have started affecting my physical health. I feel this constant pressure and pain deep inside my chest, it gets especially bad when I’m I’m feeling sad or depressed. I have the impression that someone reached a fist inside of my chest and is twisting my insides into a tight and painful ball of flesh, I’m having trouble eating properly, my sleep isn’t fulfilling and is usually filled with nightmares and interrupted.\n\nThe only time when I can say that I’m in peace or somewhere close to happy are the last 15-30 minutes of sleep I get in the morning, right before I wake up. During that time I’m usually completely lost in dreaming or in such a deep sleep my mind is completely blank. It’s during that time, when I completely forget that anything exists that I’m in peace. \n\nCould I tough it out and keep living? Could I simply decide to keep living this existence?\n\nMaybe, but I’m deciding not to. If I keep going I’m afraid I’ll stop blaming myself and start blaming people around me. And if I do that I’m afraid I’ll start hurting said people. And that is the last thing I want.\n\nThere are several people that have endured way worse than me. People that have lived through horrors that I can’t even imagine or pulled themselves out of holes way deeper than mine. The suffering I go through is absolutely nothing compared to what other people have gone through. But I am not those people. I don’t have the mental strength or willpower to push through. And even if I did I don’t want to.\n\nThis was a rational decision. It wasn’t an impulsive decision made in the heat of a bad day. This was pre planned. It has been planned since last New Years, when I first tried to kill myself. I decided to give myself some time to decide if I really wanted this. What happened then was an impulsive decision, that made me realize how fragile and precious human life is.\n\nA human is much more than a bag of muscle, blood and organs that walks around, we aren’t just biochemical machines or computers. We are the culmination of everything and everyone that has affected us up until this point. In my case I have 19 years of memories and life experiences, on top of all the genetic material that comes from both my father and mother, every single person I have interacted with, everything that I have done, every injury, every laugh, every cry, every moment of my life has shaped me into who I am now. But I am deciding to stop this. I know I don’t know the extent of the consequences of this action. I don’t know how much this will affect the people around me but I know that I can’t worry too much about everything, all I can do is hope that the people I’m leaving behind will be able to cope with everything and eventual move on.\n\nSo I’d like to thank you. Like I mentioned in the beginning, if you’re reading this it means that at a certain point in my life I considered you a friend. It means that we had fun together, laughed together, talked together, did stupid things together. And I’m sorry that I have to do this. And I’d like to thank to for those moments, those moments are what’s letting me go now in relative peace. I have lived a life that I’m happy with. The only reason why I’m doing this is because I think that the past is brighter than the future. I wouldn’t have changed the memories I have with you guys for anything else. I wouldn’t have changed them for a longer or happier life.\n\nI’m happy with the life I’ve lived. But all good things must come to an end.\n\nAgain there is no one to blame other than myself.\n\nOne last time thank you for all the time we spent together\n\nGoodbye", "url": "https://www.reddit.com/r/SuicideWatch/comments/q9egyn/my_suicide_letter_i_want_to_share_this_with_a_few/", "title": "My suicide letter. I want to share this with a few random people before I set up the scheduled email.", "social_network": "reddit", "user": "Got_To_Juggle", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 27, "down_vote": 0, "creation": 1634398955, "permalink": "/r/SuicideWatch/comments/q9egyn/my_suicide_letter_i_want_to_share_this_with_a_few/", "nsfw": false, "first_save": 1635421114.3265789, "replies_charged": false}