{"id": "t5_2qpzs_t3_ohm0xo", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "My mom , my sisters never support me . I want to apply for an audition in k pop companies . I am not sure if id get in but as always its worth a try but sadly no one supports me in that my mom is an indian who is way too religious about everything and my fake sister is always supporting her. my mom says that its all FAKE the KPOP Companies are FAKE they will KILL me . I am like YOU DONT EVEN KNOW WHAT THAT IS . I JUST DONT KNOW I AM SO FRUSTRATED. i am done my mom is like YOU ARE GOING TO SOME OTHER COUNTRIES TO DIE AND ALL. Idk this is my dream and i always wanted to do this. YOU MIGHT ASK ME. WHAT HAPPENS IF THEY DENY MY REQUEST OR NOT EVEN ACCEPT ME AT ALL. then the answer is YES I DO ACCEPT MY FATE. i Can do everything on my own but getting a professional photo / helping with video editing and all requires money and as i still live in my moms roof i cant pay. and also i cant get a job so yeah no one is helping so yes i am planning to end my life because i dont wanna live like other people have scripted my life. noone is here to support me . so i am done. bye. i am just planning to die i am not fixating on a time there are people like . go follow your dreams but i know kpop is very picky but its worth something maybe a try or so AND EVEN MY FAMILY IS NOT HELPING ME IN THAT. THAT IS UST UN ACCEPTABLE YOU HAVE TO HELP ME IN ACHIEVING MY DREAMS. WHY YOU LIKE THIS. WHY YOU CONTROLLING ME. WHY CANT YOU JUST HELP ME.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ohm0xo/i_am_planning_to_end_my_life_soon_because_i_am/", "title": "I am planning to end my life soon. because i am / was never supported anywhere", "social_network": "reddit", "user": "lonelyyyaf", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1625935098, "permalink": "/r/SuicideWatch/comments/ohm0xo/i_am_planning_to_end_my_life_soon_because_i_am/", "nsfw": false, "first_save": 1635428101.114973, "replies_charged": false}