{"id": "t5_2qpzs_t3_datire", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "I turned 22 this year. It’s been 6 years since my last suicide attempt and those years have definitely had their ups and downs. I’m a senior in college now in a major I hate, because I wanted to make my parents happy and be an engineer. I’m struggling with my classes which in turn makes it hard to keep motivation to keep trying. My sleep schedule is absolutely fucked. I’m just broken mentally at this point. I was a “gifted” kid growing up and my mom always expected me to do great things. She’s reminded me a few times about how I’m technically a genius and I have to keep reminding her that IQ doesn’t really mean anything and I took that test when I was a kid. This year she finally said she was done with her expectations for me since she’s never right. And on one hand that’s what I’ve wanted and on the other it kind of broke me more. My dad knows how much I hate my life right now and he’s always there to support me to just get through it so it’s over. I appreciate that. But it hurts to see the pain in his eyes when I talk to him about it. I feel like a failure even though I know I’m not. I do know I’m a disappointment though. I had a great relationship a year ago. I slowly destroyed that with my toxic and unhealthy tendencies, one of which was major emotional management issues when it came to being angry. But from that I learned and actually grew a lot as a person. I don’t blame her for leaving, but I was already beginning to change in the end and she still walked away. She went on to date her friend she always told me not to worry about a few weeks later. This was a year ago and I’m still alone. That is what it is though. I hold no anger over it. I guess I’m just trying to give context to the situation or maybe I’m just talking for myself. I don’t know. I don’t get angry anymore. About anything. I guess I changed too much I don’t know I just can’t find it in me anymore. I get breifly angry sometimes, but it never lasts. The problem is I don’t really feel anything else either. I try to get out and talk to people but I’m so busy with school it’s hard. My best friend Emma says I should just get a girlfriend but I’ve tried. I’ve talked to so many people over the past year and they all just stop talking to me eventually. I just feel so alone. Funnily enough she’s the closest thing I have to a relationship. She wanted to make a marriage pact at 30 years old since we’re at different parts of life right now and of course I accepted because I fuckin love her. I just don’t have it in me to tell her I’ll probably be dead long before then. I’m rambling I’m sorry. Drugs help deal with my problems but I only get high when my roommate isn’t here so I don’t get paranoid. I’m just ready to die. I see no future. Sometimes I wonder if that gun really did go off 6 years ago and now I’m in hell. \n\nSorry for wasting your time with all this. I’m just gonna go get a little higher, turn on some music I listened to when I was younger and happy, and watch the sunrise. \n\nIf you’re reading this I hope you have a wonderful day. I love you. I don’t know when I’ll die, but I keep getting this feeling it’ll be soon. Exactly how I don’t know. But if I do let’s grab a beer on the other side. I love you.", "url": "https://www.reddit.com/r/SuicideWatch/comments/datire/really_struggling/", "title": "Really Struggling", "social_network": "reddit", "user": "StrayWalnut", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1569753255, "permalink": "/r/SuicideWatch/comments/datire/really_struggling/", "nsfw": false, "first_save": 1635427767.362542, "replies_charged": false}