{"id": "t5_2qpzs_t3_lnce1w", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I'm very sorry if my English is a bit incoherent and long-winded. I tried the best I could. \n\nIt was Senior year in high school, I was already a fully blown introvert feeling like shit but was too afraid even think about self diagnosing myself with depression, (I still don't).Now, In class, the subject was psychology (which was exclusive to senior high in my school), we landed on the topic of depression and suicide. We went straight through the basics of such. We never really delved deep into the topics though. At the end of the lesson the teacher asked us the question \"Who do you think should be blamed for the suicide?\" No one answered, so the teacher decided to give a conclusion herself, saying \"The one who should be ashamed for the suicide is the person who committed suicide! Because, if they had a last moment regret they would've been able simply stop themselves before even doing it!\" Everyone in the classroom seemed to comply to what she's said while I just sat there silent, thinking\"What..??? N-no... no.. just..no.. \" I felt personally attacked. At the time I wasn't sure that how I was feeling was notable enough to determine that I had depression, though I was all too familiar with such topics and I was sure as hell that that kind of statement wasn't a right thing to say, think or even to teach to anyone. So I was infuriated, I felt like wanting to protest but I couldn't. I'm already living in an area where topics of depression and/or most mental illnesses are rarely treated or even brought upon. People who do show their illnesses wind up being labeled weird or crazy by many folks, so I felt like a burden. Since then I couldn't trust anyone to personally talk about my problems. I've already attempted with my parents twice and all they had to give me everytime was \"Just be happy!!\" \"Be happy, love. Just don't think negatively\". Now, I'm mostly stuck inside my home with my very thoughts, slowly feeling more tired and empty everyday, eventually leading to me contemplating suicide, and getting reminded about that statement made by my psychology teacher. I know what she said wasn't right in a lot of ways, but it didn't stop me from wondering to myself if it truly is my fault for feeling and thinking this way. So is it my fault for being suicidal?\n\nAgain, I'm sorry if this was longer than I wanted it to be. I keep finding myself venting too much", "url": "https://www.reddit.com/r/SuicideWatch/comments/lnce1w/is_it_my_fault_for_being_suicidal/", "title": "Is it my fault for being suicidal?", "social_network": "reddit", "user": "OrvaJuniper", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1613729198, "permalink": "/r/SuicideWatch/comments/lnce1w/is_it_my_fault_for_being_suicidal/", "nsfw": false, "first_save": 1635427132.4684632, "replies_charged": false}