{"id": "t5_2qpzs_t3_q46xyg", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2", "e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "Hi everyone\nIm a french girl so please dont care about my english. \nIm here since many months, reading everyday your posts and dont know how to respond to anyone cause Im like you. Totally desperate. In full distress. It confort me unhealthily cause im like, okay, Im not alone to feel this hell way, a lot of people want to die and maybe some are dead right now Im litteraly really scared to think about this and just to post here so, I pray for all of you hoping you find peace in the others worlds.\n My situation is getting worse every fucking day on this earth so, maybe I need help. Maybe its to late. But who can help me ? Psychiatrist psychologist oh lol let me strangle them please\n\nIm in a state of totale isolation, derealisation since months to survive. But time pass and reality change, without me. Oh no of course I change too. I deny my feelings. My apparence. Avoid the thoughts that come to my mind cause its unbearable. Pure distress. Like. You're not you anymore  You're missing your all life. You're 19. You should be dead at 17. Why are you still alive. You're wasted you chance. You have lost your soul, you fill yourself with hate with rage, anger with frustration with regrets, your mind has no thread, the voices are so confused that there is no longer any connection between your actions and your decisions, you are impulsive  as if you don't know how to think anymore, where has your intelligence gone, your qi is negative, all i hear is suicide you you should be dead, how do you put up with the shame of still existing?  suicide you, the more you wait the more your karma increases, you fear death? there is something, the worst awaits you, you will die, what are you waiting for, kill yourself, quickly, quickly , now\n\nTo avoid contempt. Am i sick ? Lol.\nI just know that I have to die. But I believe in life after death. I feel that Im never really alone. Its really scary. Leave. Go away. But if i go outside, is to kill myself. Nothing else. I dont have friends anymore I haven't replied to any birthday messages. I cannot tell anyone about the distress I am in. No one can help me. No one can save me. My mind dont want to save me. He want me dead. Since many years. I think its these are my last days on earth. No one will take me serious isnt it ?\nIm scared to death. Thats my problem.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q46xyg/what_time_is_it_derealize_to_avoid_suicide/", "title": "What Time is it? Derealize to avoid suicide", "social_network": "reddit", "user": "aynatyu", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1633727468, "permalink": "/r/SuicideWatch/comments/q46xyg/what_time_is_it_derealize_to_avoid_suicide/", "nsfw": false, "first_save": 1635425189.0342302, "replies_charged": false}