{"id": "t5_2qpzs_t3_q1x0aw", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd", "b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I never posted on this sub even though, I have interacted with many suffering individuals before. It made me relate to them. I can't take it anymore. I loved the wrong person. I gave her everything. She sucked the life out of me. Every time she needed emotional support, or monetary or needed someone to be there for her, I was there, when her family mistreated her, I was there. When all the world blamed her, I pushed her up. but she lied to me a lot and she left me when I needed her most. She caused me pain. 10 years relationship made me take a lot of turns for us. I abandoned my pursuit of masters to get a job so we can marry. We come from a conservative environment. Her parents were pushing her to find a suitable husband and she couldn't tell them about me then because I was still a student. She told them later indeed. Afterwards, she withdrew her approval after I invested a lot. I worked night shifts that caused me extra stress, insomnia, eating disorders and basically ruined my health. I did it all because we were together. She did make sacrifices at some point. That what pushed me to do all of this. Now, that I saved enough for us to marry, she said she wants time. I discovered that she has a secret Instagram. She goes out all the time. She posts about it. She basically does not want to marry, so she can enjoy her life. I was never against fun, but she asked me so much to save to marry. I told her we will need to be thrifty and suck it up to make it, but she obviously forgot. She basically goes out with friends, spend money then at the end of the month tells me she needs money because she is in pickle and that all her money was spent on necessities ( I am not sure but going to fancy restaurants and having expensive meals isn't that much necessity for me when you're \"middle class\"). I give her money not knowing she is just throwing hers away.\n\nBack in 2019, she left me on a Monday 3/3 and when on a date with a male colleague the next day. She even contemplated to marry the guy after 1 month of knowing him under pretext: my parents are pushing me. Fast forward to October 12th, her birthday, I had endured 9 months of suffering. She had contacted me several times, asked me to give us a chance then abandoned me. She basically was closing a wound and opening it up. Anyway, on 12th October, I got her a similar wedding ring I had given her years ago but she lost it. We decided that it was worth saving. She \"admitted\" all what she told me about the other guy was just to get rid of me, and to make me \"move on\" in her own words.\n\nSince October, 12, 2019 we came a long way. I graduated, then took my night shift job. I tried to change a lot because I felt indeed the reasons which she left me for were valid. I had stopped working hard back then and stopped paying so much attention to us and going out and all. Anyway, we tried to start anew, and make our relationship healthy and based on communication and transparency. She took a loan from the bank to buy a car. I started paying 50% of the loan with her. She never bought the car. She spent the money on her family as \"they pushed her to give some to them\". She obviously spent some on herself.\n\nRecently, each weekend there is an issue to not meet up: her period, her parents are going to visit relatives, she's sick. I believe she was truthful. Maybe I am an idiot. I still put up with it and tried to meet her on every chance. Whenever, we get into a fight: she says : We're drifting apart. THEN SHE realizes it is her fault and admits it. She confesses that she loves me. I succumb and I try to make it healthier for both of us\n\nShe had a look change this Saturday and didn't even let me know while everyone knew on the internet.She asked the whole internet how she looks,and for me: all i had to know is she spent 2 dys boringly sitting at home. all I asked her how what her weekend. She told me she was bedridden because of a car accident she sustained a week ago. When that happened, I gave her money for doctor and treatment for that injury. Then, she comes and lies to me in my face. yesterday, I had a nightmare in which she was posting nudes of herself on social media. I woke frantic. I said: it's just a nightmare. Something in me said: she has this Instagram that she had abandoned long ago. I checked it: Voila! pics of her, heart imojis exchanges....(We had preset rules that we shouldn't have secret accounts from each other. If it was needed to be secret then it is wrong). . However, she does not even chat with me under pretext: her phone is broken. HOW THE FUCK A BROKEN PHONE allows chat and posting on instagram but not \"hey, honey, sorry for being late.. I had a new hair color? wanna see?\" I call and always get voice mail.I called her yesterday and tried nicely to get her to tell me about her lies. She denied it. Once, i confronted her she blamed it all on me. She always does. She became an attention seeker but won't admit. The issue is I predicted all of these events, and told her what can be done to avoid them but she said \"trust me\". I did, and now I am the one killing myself. I tried reasoning but she won't budge. It was all my mistake from her point of view. All of the sudden I am incompatible with her and she instantaneously breaks up with me and says: I am on my period I am mad. I tried overdosing yesterday. I ended up just causing myself some sort of food poisoning. I called her today just so I can avoid the sinister thoughts. I can't open up to anyone really. I had trusted her about all my secrets. She was my confidante. She said I am bothering her and if I want to kill myself I should go ahead and do it and stop bothering her at work and that she has ambitions to work for. I told her I just want someone to talk to because I truly do not want to kill myself today. She started screaming and defending herself that I am too traditional and that I am against \"having fun\" and going out (remember the agreement about saving for marriage???) I am always in a losing situation. Had she told me she wants to be active on social media, we could have posted pics together as a couple rather than her presenting herself as single. Indeed, some of you might assume she're cheating but she is not. She blocks any unknowns. However, it does not mean that her colleagues are not viable game (it happened before??) I had trusted her completely many times even when proved unworthy of my trust. She keeps blaming me for being a \"prison\" to her while I always tried to change for the better for her. It is always me who needs work even though through past events, we had clear agreement: I was always right. Back to the phone call. She hung up. I called back and asked her to just to talk to me until I can get a hold of my mother -- a 25 year old is going to cry to his mother... imagine that, but what solution do I have. I do not wish to kill myself and cause my mother cardiac arrest or create a trauma for my sis who considers me her role model). She started screaming and say she doesn't want me and I am bothersome giving me the obvious solutions: Go out, date, be happy....how funny. If this was a solution, we wouldn't have this Reddit group. Obviously, I am wrong from her point of view, and all my problems are mine. 10 years relationship, and this is what I get.\n\nI am pretty sure I have clinic depression. I am not a doctor but I may have developed borderline personality disorder, and some post traumatic stress disorder from all the accumulated pain. Indeed, it is my mistake that I've put her in a central position in my life, but when I haven't, she accused me of neglect. Now, she's truly neglecting me, it is my fault???? I can't win, she just can leave.\n\nSince I am going out well here as some stats. I get paid around $720 a month (yeah fucked up country as well) she gets around $630. We pay the loan 50% for a sum of $140. In the span of 11 months, I saved around $5100, gave her around $1800 in cash to solve problems that she faced including her father's health issues (the man doesn't even know he's doing fine thanks to my hard work). I literally spent around $300 on myself. This of course, does not even include expenses of going out, travelling and such, but I wouldn't count that against her since those are common activities. I never did the math or cared about this until yesterday. Anyway, I am put this out just to give perspective. AM I IN THE WRONG HERE? was I really incompatible. No she is not a gold digger. She offered to give the money back after few months in future. I DONT NEED IT, Iam killing myself ffs. I gave her when she was in most need of it. The gesture matters. Giving bill gates $1 million is stupid as when Ellen Degeneres gave him a 30k something check. Giving a homeless person that much money has more value. Money has a value of the trouble it solves in our mundane life. I know banks disagree but that's why they're banks (emotionless establishment built for profit not for emotions). A relationship isn't around money of course, but I can't statistically make a point about how many times I helped her emotionally while she left me alone when needed (well she helped at times). Not to mention, that I spend months letting her that I am horny without her paying attention to me(not living together- against the law in this wretched place.) I ask her for just a picture of her face??? or her new nail color or her hair style. I need to ask for that!!! While she posts it in hide in her Instagram and ask \"what do you think guys\"????(literally- I am not making this shit up) Under pretext: I am too tight/traditional and I would have not allowed it? SHE NEVER ASKED ME for my take?! I am fucking atheist in a fucking religious country. How fucking am I traditional. I studied cultural studies. I know how culture works. Obviously, she wants me to act as western in her independence ( I am not against it) but I have to traditional when it comes to her monetary needs? and paying for the marriage and protection? Either choose one camp or the other. One cannot pick what he wants from every culture to get the ultimate culture that benefits him alone???? I went too far already, but I am pissed. Damn, I feel bad for anyone who reads this.\n\nPlease, I do not really need to be convinced. I just wanna know was I the bad person here? I am really a bad person? Did I need to give her more freedom? I feel I am bad really. I blame myself a lot. I do not want to kill myself over her..fuck that. I want to not feel this pan suffocating me. This pain of betrayal and hard work. imagine you get one life and someone screws it up for you and tell you: Hey it is not late: start over, go out, love, and do whatever. Leave me fucking alone OUT OF THE BLUE!\n\nProbably this shit makes no sense, and it has tons of mistakes and typos. Paragraphs are ill-constructed but my writing prowess isn't on point with the shit going on my mind. Dates I mentioned as exact. I have a very acute memory...I wrote this to be my online tombstone. I want people to maybe learn something. I want to at least have someone read this and enjoy a maybe badly written tragedy. (you're better off with Shakespeare).", "url": "https://www.reddit.com/r/SuicideWatch/comments/q1x0aw/i_end_it_now_a_lot_of_ranting_hopefully_someone/", "title": "I end it now. A lot of ranting. Hopefully someone reads this nonsense.", "social_network": "reddit", "user": "happyonceuponatime", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1633442547, "permalink": "/r/SuicideWatch/comments/q1x0aw/i_end_it_now_a_lot_of_ranting_hopefully_someone/", "nsfw": false, "first_save": 1635426542.3056035, "replies_charged": false}