{"id": "t5_2qpzs_t3_ppkt3p", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a", "bd24e5dc-1a86-4808-94df-346d0c1d2c42"], "text": "I am 23 years old and this is my first time I am having severely suicidal thoughts. \n\nI am a undergraduate student about to graduate from a good University/and recently I was accepted for a job to work in China. I had my concerns about the vaccine since I have a condition called SVT. My recruiter called me two days ago and said that now the consulate requires you to be vaccinated against COVID. Since now it is mandatory for traveling to China with a Visa, I contacted the chinese consulate in Chicago to see if I could get an exclusion (they haven't replied back yet) and I'll as well be talking to my doctor on the 23rd about my vaccine concerns in relation what I have seen online about the Myocarditis problems of some young adults and kids after taking the vaccine. I set up a backup plan of working at a place called KinderCare( since vaccines are not mandatory and I can get exclusion proof) and today I told my mother about all this as well as my worries getting the vaccine with the my SVT and the Myocarditis possibilities. \n\n\nThe only think she said to me was \"I can't do this. I need to start my new life...you need to go\" \n\n....\n\nAfter my concerns of potential heart and health related issues all she cares about is me leaving after I graduate so she can have this big \" happy life transformation\" that she keeps telling me about...my health concerns mean nothing to her...\n\nFor a while now all she says is how she is going to have this big transformation and how I'm holding her back from living her life..but I didn't ask to be born...\n\nToday I have never felt more low..\n\nNow I have now rashly decided I will be getting the vaccine anyways regardless of whether or not it will impact my health or heart problems, I think to myself that today if the first day I have ever felt like this...  To be honest with my feelings right now, I'm kind of hoping I actually get Myocarditis and die. \n\nI always wanted to live up until now.(sorry for the errors in typing..I do not feel that good)", "url": "https://www.reddit.com/r/SuicideWatch/comments/ppkt3p/my_first_time_feeling_suicidal_thoughts/", "title": "My first time feeling suicidal thoughts", "social_network": "reddit", "user": "Frosty_Condition7497", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1631822322, "permalink": "/r/SuicideWatch/comments/ppkt3p/my_first_time_feeling_suicidal_thoughts/", "nsfw": false, "first_save": 1635427095.0388844, "replies_charged": false}