{"id": "t5_2qpzs_t3_pt4fdo", "request": ["8c1ff307-4217-4f27-b25f-fe2a745f5ef0"], "text": "I want to preface this with I know things get better and this feeling is temporary. I'm very aware of this. Yet, I have been through a lot and I've been noticing my bad days are getting more intense and increasingly dark. I'm certain I have situational depression triggered by many big life changes that occured in succession of each other. Here's a list:\n\n- My (emotionally/psychologically/verbally) abusive dad divorced my mom which I know had an effect on me. Even though I knew it was a good thing, it disrupted my life and shook my \"family's\" structure and relationships even further apart\n\n- I was put under too much pressure to immediately find a job after graduating college. I got my first job within a few months and at first it was my dream job, then it turned out to be a highly toxic environment for myself. (Bullying, shady business practices, inappropriate behavior, sexual harassment, threats, and more). At this point I was very aware of witnessing myself become further and further closer to a breaking point. I was breaking down at work which I had never experienced before. I had always been able to push through but at this one critical point of having a fight with my wonderful first (and hopefully lasting) boyfriend, finding out my mom has been emotionally abusive and questioning my entire life up to this point, other factors took place like car problems and other stressors but those two were major and I noticed a shift. It effected my work and then the bullying by my art director deteriorated my self esteem which I had carefully built up for the first time in my life before graduating. And then I quit/was fired not quite sure it was a weird situation but I found something that I really enjoy right now even though it's most definitely temporary unless my pay is increased. I feel it's really good for my mental health currently.\n\n- I'd like to mention further how change to new situations are difficult for me. Sometimes I question if I'm autistic since I take things so seriously, at face value for the most part, and I have trouble with sarcasm and reading between the lines. But that's just a small detail that leads to a entirety different subject, I may post about. My point was I wanted to mention how my first relationship in the beginning was so magical yet had a lot of trauma and pain that I never thought I had before it was uncovered due to a close relationship (which in a general sense was the first time anyone has been close to me especially in this way). I didn't know until more recently but I was being influenced heavily by my mom. She put a lot of fear based and negative ideas in my head about him and I trusted her more than myself at the time so I took in her words as my own without knowing and was repeating her hurt towards him thinking they were true/could happen. \n\n- one of the biggest pain points is recently finding out my mom was emotionally abusing me and had all my life. I knew as a young child I felt my parents weren't suited for me and I wasn't getting the level of care I needed so I felt detached to them and hesitant to ask for help knowing they wouldn't be able to provide what I needed. Looking back I don't really remember much about my mom until I was homeschooled in 7th grade (I was most definitely depressed then too. I didn't have friends, I was highly stressed, behind/struggling, going home to be yelled at while trying to get help with homework. Crying every single night until I was pulled out. that was the darkest year I had up until this year which feels equally dark and overwhelming but I feel I'm better equipped to handle this pain due to past experiences). I wanted to die increasingly (I had always had times of wanting to escape/run away/die throughout my life but it was noticable more at this time), I laid on the bathroom floor for hours having dark visualizations and that year also lead to meeting someone who also has a part in this story.\n\n- So to continue with my mom, she treated me like a friend/therapist/partner. We would clash most of the time but I think it was within the last few weeks of high school we became very close to the point where we were becoming emeshed. I thought it was really nice to have a relationship so close and I felt I could speak to her about spiritual topics and voice my opinions freely. It was nice, I felt I was helping her work through her own emotional issues and I had good advice to heal her wounds. I was her emotional support. I listened to her speak about anything and I felt really good whenever I could voice my opinions and thoughts. Though I'm not quite sure if I ever felt truly heard, I thought she understood me but I'm not so sure anymore. \n\n- We were locked at the hip, she replaced her deteriorating relationship with her \"husband\" and used me as a surrogate. She told me things no child should hear from their parent. Though it felt together we sort of trauma bonded over the pain of my dad/her husband. I found he was cheating before she did and things spiralled. She heavily relied on me and it was too much for me to handle though I felt it was my job to help. For a few years I constantly would try to help her and nothing changed. Tensions built yet we were still emeshed I felt now very brainwashed by her actions and I'm still processing all of this because I never questioned her before.\n\n- I was slowly piecing together bits here and there after meeting my boyfriend and getting a taste of normalcy and it opened up my world but also made me question everything. I realized my foundation was built on unstable grounds and I have been going through a major renovation having to unveal layer after layer of truth that leaves me so disillusioned but I know I'm stronger and wiser each time, it just bring up a lot of fresh wounds and is painful to uncover everything you know to be true wasn't so. I watched Jennette McCurdy speak about her mother and it woke me up in a sense and I felt terrified to question my mom but all the evidence was right in front of my face.\n\n- to best describe my situation I would say I'm going through very similar treatment and experiences to Rapunzel from Tangled. Mother Gothel is such a great example of how it is living with a potentially narcissistic mother. Mine however is built from self claimed Martyrdom and victimization. I don't want to take a deep dive into all of the things she's done because I'm already exhausted thinking about it and this is already taking a lot out of me to write this much.\n\n- but something I should mention that I hinted at earlier was the influence of an individual who came into my family's life when I was in 7th grade. This old man was meant to repair a window but instead changed my world view (along with my parent's perspective). I don't want to detail everything because again it's just too much and how it ended was what's currently affecting me most. He was a predator and using spiritually to manipulate. He had a ankle bracelet and was being charged for his multiple crimes, sexual in nature. He had asked me inappropriate questions and there was just so many things wrong with that situation that is too much to discuss right now (unless anyone needs/wants clarification). \n\n- Another life change that happened right in the midsts of my last jobs worst point was moving to an area that uprooted everything from friends, comfortability, feeling safe in this area... everything changed. I feel really grateful that I've been able to spend time with my boyfriend at his place I do notice a shift in my mental health and general wellbeing. I adore him so much and I don't think he'll ever know how much of a positive impact he makes on my life even though I try to tell him. But I'm very grateful for him and my friends, although I feel bad that these dark times impact them negatively.\n\n- I also feel strongly for social justice issues and animal welfare/environmental causes which feel very current with everything that's been happening and I'm sure the pandemic and collective has impacted this feeling too.\n\nIt feels good to talk about it and feel brave enough to share. I just need some comforting words and advice in how to cope, breathe better,  just healthy ways of handling hard times. I know things get better in time and heal and there's so much more I could detial above but I feel satisfied that maybe if someone just can relate maybe that would be helpful as to not feel isolated.\n\nTLDR; I'm going through a difficult period in my life, any advice, experiences similar to mine? Thank you, if anyone reads this and can relate on any level know that you're not alone and we'll get better in time.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pt4fdo/i_need_help_please_help/", "title": "I need help. Please help.", "social_network": "reddit", "user": "Murky-Library6476", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1632305712, "permalink": "/r/SuicideWatch/comments/pt4fdo/i_need_help_please_help/", "nsfw": false, "first_save": 1635427480.5919943, "replies_charged": false}