{"id": "t5_2qpzs_t3_ns9o6a", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "I honestly can’t remember the last time I genuinely smiled and actually said to myself I’m happy, all I hear from my family is that pain is temporary and you’ll get better but I’m fucking sick of lies, life and myself. Every sleepless night all I do is cry nonstop I’m fucking sick of it. Even though I cry I can’t feel anything no happiness no boredom no anger no joy nothing, until I found a solution, I started cutting myself with razor blades, and thanks to that, the emptiness in my body was replaced by something and that was pain, that necessity of feeling something feeling alive for at least a night was too strong for me to handle.\nI have deep cuts from my hip all the way to my ankles and if I ever run out of room or if my leg is too bloody and messy I’ll just start on the other leg and arms. I’m too much of a coward to just end it all with a clean cut to the wrist or neck so I’ll just keep doing it until I die from blood loss on top of my puddle of blood. I’ve been waiting for my demise for so long so I hope every day I do this I’ll be closer to my death I started to feel extremely tired, dizzy and my skin started to look more pale each day, please if there’s a god please make it sooner and just end my suffering, I can’t believe it’s possible to go years and years without crying and feeling like shit for at least one single fucking day. All I do is try to provide for my family all I do is try to live and really tried everything I tried changing my looks, my personality, exercise but never works. I hope my day come soon.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ns9o6a/why_is_mutilating_my_body_the_only_answer/", "title": "Why is mutilating my body the only answer", "social_network": "reddit", "user": "Long_Letterhead_1362", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1622825381, "permalink": "/r/SuicideWatch/comments/ns9o6a/why_is_mutilating_my_body_the_only_answer/", "nsfw": true, "first_save": 1635427048.0266423, "replies_charged": false}