{"id": "t5_2qpzs_t3_qdpg21", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8", "4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "CW: suicide (obviously), sh, ed\n\nI hate my parents. Their form of ‘parenting’ is yelling at me and my siblings until we can fix our problems ourselves. I’m convinced there’s been something wrong with me since I was a young child but they just punished me for misbehaving instead of taking the time to at least google why I was acting in that way. I’m so mad at them for not getting me help when I could’ve been fixed easily. They love pretending that we’re a functional family.\n\nI always hate my family and hate myself because goddamn they were overreacting about something, but there was no need to egg them on by behaving the way I did. \n\nI know they won’t really think I’m messed up unless I commit. We got into an argument once. I was frustrated and was hitting hard surfaces and trying to hurt myself and my parents got mad that I was being ‘dramatic’. I kept thinking about how I wanted to walk into the middle of the highway or jump off a tree and kill myself. Later my sibling brought it up in an argument and made fun of me for hitting myself. They always think I’m overreacting and ask if ‘I think I’m in the movies’. Once, I walked out of the house because my mom was yelling at me and I wanted some space so I wouldn’t act rashly. They locked me out and pretended no one was home. My dad and siblings were eating. I saw them. They turned off the lights when I knocked. My mom and dad definitely have anger issues. They hit me or swear or throw things at me or yell but that’s only when they’re really mad at me. Its not ideal but it doesn’t qualify as abuse since they justify it because its ‘my fault for being so shitty’’. Sometimes I don’t agree with them on the measure of my shittyness, however, but my parents explain in detail how infuriating and worthless I am and I gotta say…. It matches up. I don’t even remember how often they freak out because I block it out the moment it happens. Sometimes I don’t remember what my parents just said in an argument cause I’m phasing tf out.\n\nEveryone knows I’m the black sheep of the family. The one who stays in their room and never comes out. The one who’s always grumpy and telling other people off. I know I’m an antisocial kid who does the bare minimum around the house but I procrastinate so much that I can’t even finish my homework a lot of the time. I feel so guilty about procrastinating and not cleaning up stuff but I can’t muster the energy to turn off my phone or stop immersing myself in fiction because I feel so sad and empty. When I was little I would stay up at night crying thinking about the future and how bleak it seemed. I wanted a meteorite to come and crush my family so I wouldn’t have live without them or have to grow up. My childhood wasn’t even that great, I don’t know what that’s about.\n\nMy issues are so small and insignificant and I feel bad for making up stuff. I can’t even cut myself properly or do anything that warrants actual attention. I want to bleed out on the floor but I’m too scared it’ll hurt. \n\nI’m not close with anyone at school- all my close friends moved and we only see each other once a year. They don’t care about me anymore and I was such a shitty friend I’m surprised they stayed as long as I did. I had no social skills and even now I struggle with talking to kids in my class and making eye contact with people. I thought they actually wanted to be friends with me, but I recently realized that they see me as some kind of ‘pet’ who can’t interact with other humans normally. I was so delusional for my whole life, thinking that since I was moderately smart and talented people would want to be friends with me. I thought I was attractive but I’ve been looking closer in the mirror and different angles on my phone camera and I realized I look like a fat pig at school. \n\nI don’t excersize and I keep gaining weight by binging. I made myself throw up for after I binged a few times but its not even working and I couldn’t even stick with it. My gay struggles aren’t even that relevant anymore- sure, your parents put on highly homophobic sermons and force you to read the bible and be soaked in anti-lgbtq content. When I came out, my mom just thought I was delusional! That it’s a normal thing that happens for teenagers, and that soon I’d come to my senses.  She didn’t even get that mad at me when I first told her, just kind of took it in and said that she would love me no matter what, like its some kind of disease, being pansexual. They make me uncomfortable but its not like i got kicked out or anything!! I’m not pretty enough to be a girl and I’m not masculine or worthy enough to be a boy. I felt dysphoric for a few days and wanted to have a flat chest and be male presenting but I don’t feel as bad now and I feel like I’m just making it up for attention. I’m making up everything for attention. I’m a fraud!! I don’t even feel anxious or dissociate or feel suicidal all the time. Sometimes I feel great and love myself and love my life. My grades are decent, my parents provide us with lots of stuff, we go on family trips occasionally. My life would be perfect for a different person. Instead, I’m constantly in a bad mood or taking it out on my family. My room is always messy. I just stay at home after school, doing nothing. I only work twice a week at my job. I really am a piece of shit, no matter what my family does.\n\nEveryone says ‘It’ll hurt your loved ones’ or ‘it’s selfish’ and I don’t fucking care. I want them to know how much they hurt me, no matter how much it was justified. I want to die and never have to listen to my stupid parents ever again. I don’t want to burden my sort-of friends because I know that they won’t care and that it’s just needy. No one trusts me or likes me enough to talk about their struggles so I don’t want to dump mine on them. Hell, sometimes I rant about things to people and immediately feel guilty. It just spills out. Another count for the suicide reasoning box. My family will breathe a sigh of relief when I disappear off the face of this earth and never come back. If they’re right, I’ll watch from hell as they all party with Jesus or whatever. \n\nIt doesn’t really matter anyways. I deserve it, and this is not a call for help.. it’s literally true. It’s not like I’ll remember bad moments anyways, what with the blurry quality of my mind. I feel so disconnected from reality and I can hardly remember my childhood. it was only a few years ago, wasn’t it? I talk about how bad my memory is and how I want to go to therapy but everyone thinks its just me being quirky again, haha! What a funny joke! You don’t need to go to therapy, just figure it out! It’s not that hard! I want to wipe that condescending look of their faces and prove them wrong and prove that I’m not making it up. I want them to take me seriously, and my life’s already way too messed up to fix. I’m just scared about how much it’ll hurt, and maybe I do care about my little sister. I feel bad for ruining her and ruining her family memories. I just hate myself so much and hate how I feel and I want to disappear. I hurt everyone so much that they’re not going to care when I’m gone. They’ll spit on my grave and get annoyed at how ‘weak’ I was but I’ll already be gone. \n\nI’m sorry for ranting like this but if anyone reads this I want to them to know the full picture and that I’m not really like the people on this subreddit that can stay alive and not harm other people deeply by merely existing. I literally cause my own problems, no matter the environment I’m in. PIECE OF SHIT. That’s me. Wanting to hurt my family somewhat, even through death. I hope everyone who reads this can feel better about themselves because you’re definitely not as bad as", "url": "https://www.reddit.com/r/SuicideWatch/comments/qdpg21/im_a_bad_person_and_i_want_to_die/", "title": "I’m a bad person and i want to die", "social_network": "reddit", "user": "_chocolatepancake", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1634934229, "permalink": "/r/SuicideWatch/comments/qdpg21/im_a_bad_person_and_i_want_to_die/", "nsfw": false, "first_save": 1635426883.1803641, "replies_charged": false}