{"id": "t5_2qpzs_t3_pupm4e", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "I haven't posted here in a while, I went back to being a lurker again I guess. I used to write whole fricking essays as posts, but now I just can't find the words or the motivation, even though my feelings are the same, if not stronger. Therefore, I might sound like an incoherent idiot in this post (although I was kind of one before too), but I suppose I'll have to try my best to express my feelings.\n\nSpeaking of lack of motivation, well, I don't think I even have motivation anymore. I hardly find reason to get out of bed (only on weekends because on weekdays I have no choice because school), let alone to \"self-care\", do work, get a hobby, or be anything else than a procrastinating asshole. Oh, and those shitty \"motivational\" videos that are supposed to \"fix\" people like me? One word for that. Bullshit. If other people like it, then whatever, I couldn't care less what other people like and do, but I'm too far gone to actually believe in stuff like that. Even if I were to find this so-called \"motivation\", there's another obstacle, my own fucking mind. Anything from not letting me do my work by telling me there's that one video on YouTube I need to watch or to check my social media just one more time, all the way to thinking up thoughts and scenarios that are so intrusive that I can't even mention what they are, I can always count on my mind to mess me up in ways that I would have never even thought were possible. Despite all this, I still fantasize about being a productive guy that actually does something with his life, and I even entered a competition and joined a club at school thinking it would be a good idea.                                                                                                                                                        And that, makes me even more pathetic.\n\nThat's not even the only thing that makes me a pathetic person. I'm rude, self-centered, I yell at people sometimes on even the slightest provocation, etc. When my mom told me this a while back, I thought it was offensive, and even though she's still toxic as fuck, I now realize that that was one of the only things she was right about. It baffles me how anyone ever thought I was a good person. Perhaps it's because they only see who I was pretending to be, and don't know the loser I really am inside.\n\nMoreover, one thing I've learned about the world is that no-one gives a fuck. People are born, people suffer, people die, and everyone either turns a blind eye or pretends to care when they're actually just as self-centered as everyone else, in most cases. Still, I can't help but wonder, what if someone I knew realized that I wasn't okay, that I'm only a few steps away from ending it all? What if, by chance, someone I knew found my Reddit account or caught me writing one of my suicidal rants? How would they react? I already have my answer, and it's that they would either contact my parents or tell me generic \"uplifting\" shit such as the biggest lie in the world, \"it gets better\". I've been waiting for it to \"get better\" for YEARS, and the more I wait, the more these years of untreated and even undiagnosed mental illnesses make my life even more miserable. The most likely outcome if this were to happen, however, is that they would simply not know how to react and back away. I wouldn't really blame them, and I would, in fact, be happy with it, since I don't want to drag anyone down with me. The two people that I would absolutely NOT want to be finding out about this are my parents. I made the big mistake of telling them about my suicidal thoughts some time ago, and they said I should get help but didn't really commit to it, and they don't even mention it anymore even though I told them I've been feeling this way since I was 11 years old, for fuck's sake. I would imagine that a parent would make sure that their kid who just told them that they've been hiding suicidal thoughts for years is not having those thoughts anymore, but oh well. On top of that, they do things that make me even more suicidal than I already am, and I would even go as far as to say that they are the main reason (not the only reason) that I want to end it. They don't physically abuse me or anything crazy like that, but they force me to become the person they want me to be instead of letting me be myself. They misgender me as if I had never even come out to them in the first place (coming out to them was also a mistake), they're forcing me to become a doctor, saying that my feelings are because of the internet when the internet is the only thing keeping me alive, forcing their religion on me, forcing me to get married and have kids when I'm older even though the idea of having kids scares me (because apparently my only purpose as a human being is to serve and obey my parents, and my parents themselves said that, not these exact words but somewhat similar).\n\nI know it will never ever happen, but I still dream about the day when someone will say to me, \"Look, I know you're not okay. Tell me what's going on.\" I know that nobody will know my situation unless I tell them myself, but that's something I'd rather not do, so I just go on dropping extremely vague hints.\n\nI think about all the things I've mentioned above on a daily basis, especially about how things will never get better. Today, though, I thought about it even more, since I received a message today from something called \"Reddit Care Resources\" that a \"concerned Redditor\" reported me as needing help. The message itself was pretty generic, \"you're not alone\", a list of suicide crisis hotlines, etcetera etcetera. Even if I wanted to call a hotline, which I don't, I don't have a phone or a quiet and private place to talk on the phone, because once again, toxic parents. I also live in a third-world country, and there are so many stories about how fucked up the mental healthcare system in my country is, especially for people like me who are atheist and LGBTQ+ like me, so I highly doubt the efficiency of what little mental health resources my country does have. I have no idea who had them sent me this message, whether they're a follower of me or whether they're just someone who randomly clicked on my profile and wondered \"what the fuck\" when scrolling through my post history. If, by the slightest chance, that person is reading this right now, I would like to let them know that, while I appreciate your concern, it's too late for me to \"seek help\".\n\nThe worst part about all this is, I can't end my pain and kill myself. I can't bring myself to do the deed because I'm a stupid coward, so I'm stuck with this suffering, at least for now. So, I guess I'll just keep bullshitting my way through life. I've been doing this for as long as my shitty memory can recall, so I guess I can pull through just a little longer until/unless I get the courage to kill myself. One thing I might do is draw a butterfly on my wrist, because it's a relatively well-known symbol of thoughts of self-harm among those who have had thoughts of self-harm before. To others, it would just look like a random pen-drawn tattoo. Hence, if someone like me sees it, they will know that I feel that way too, and I might even be able to talk about it with them. I've also noticed that pen marks on the skin are quite easy to rub away as long as you're creating enough friction. Therefore, my parents won't be able to find out about it, because I can easily get rid of the butterfly drawing if I want to. Knowing myself, though, I'll probably chicken out of doing this too because of the seemingly infinite \"what-if\" possibilities my mind creates about literally everything.\n\nThis post is very, very long, so I don't expect that anyone will actually read this whole thing, and I'm fine with that. If, however, you have read all the way till here, I want to tell you something.\n\nThank you for showing this slight amount of care to a useless nobody.\n\n(Side Note: I ran this through a word counter and apparently this post is a whole 1,455 words long, not including this side note. This is probably going to be an inconvenience, especially since I didn't include a TL;DR, so I sincerely apologize.)", "url": "https://www.reddit.com/r/SuicideWatch/comments/pupm4e/a_random_and_shitty_rant_because_i_cant_fucking/", "title": "A random and shitty rant, because I can't fucking take it anymore.", "social_network": "reddit", "user": "Error_Code_Nobody", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1632507867, "permalink": "/r/SuicideWatch/comments/pupm4e/a_random_and_shitty_rant_because_i_cant_fucking/", "nsfw": false, "first_save": 1635426130.0149279, "replies_charged": false}