{"id": "t5_2qpzs_t3_oi4atd", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "**TW: eating disorders, sexual abuse/rape, alcohol**\n\nSorry about the long life-story post.\n\nMy parents got divorced before I started primary school, father had alcohol issues and was beating my mother; she was cheating on him. Then me and my sister were raised by our mentally ill mother who finally got diagnosed with schizophrenia when I was 17. Grew up in an overcrowded flat where my mother and his boyfriend lived their hedonistic life (listening to loud rock music, drinking beer, having lots of sex), not letting us sleep on school days, leaving us sleep-deprived as children and also traumatised as our room with my sister was a pass-through one. She couldn't keep a job and spent all her money on cigarettes and bought cheap candy for us to compensate for being a bad parent, she almost never cooked for us. My sister and I got fat. I was heavily bullied at school and was always a loner. I developed anorexia at 14 and was struggling with that until the age of 18, my lowest being 38 kgs. I was hospitalised as well.\n\nI was raped and sexually, emotionally abused at age 15 by a 60+ drama club teacher where which my mother failed to notice even though I was staying at the club until midnight some days. When I was 18, mum had two suicide attempts, for one of them I was the one who intervened and called the ambulance. She had been in and out of hospital before then, I was spending my teenage summers visiting her in hospital. Then I developed an unhealthy obsession with one of my teachers who was narcissistic and crossing my boundaries all the time (the relationship was non-sexual, non-romantic, but full of tension), manipulating me and making me feel so little compared to him. This lasted for years.\n\nI wanted to escape abroad and got accepted to university there as I was doing exceptionally well in academics despite my struggles. However, my unresolved traumas were haunting me, I developed binge eating and gained 20kgs in one year, I was also spending excessively, more money than I had. I dropped out and returned home, admitted myself to mental hospital for 6 months. I was diagnosed with borderline personality disorder. Now I live temporarily  with my dad and I'm unemployed and shattered, I want to go back abroad where my sister lives but might not be able to due to immigration rules (I am waiting for my results now, whether I can go back or not).\n\nI've now cut contact with my former teacher  and I only used to have friends through him therefore now I have no friends. The only person I can rely on is my sister(emotionally) and my dad(financially). I see absolutely no joy in life. I am like an empty shell. I cannot choose a career as I don't think I could succeed in anything despite my excellent grades. I cannot take big responsibilities, for example, I cannot be a doctor. Yes, I KNOW THE WORLD NEEDS DOCTORS, but fucking hell, I would be one if I had the mental endurance. I was the mental health nurse for my frickin' mother as a child/teenager for years, so no thank you. However, I generally have a huge need for being engaged intellectually, this sucks when you realise that highly intellectual jobs usually come with huge responsibility. I am also pretty creative (writing, panting etc.) but all of us know that's of no use in the real world. I  cannot afford to take risks as I have no money, I cannot afford to drop out again, I've actually dropped out of two unis now so if I start something it has to be a thing I can actually finish.\n\nSo yeah, the last month or so I've been contemplating ending it all. I have virtually no reason to live. I don't want children - don't want to commit the irreversible mistake my mum made (having me). Life is nothing but torture for me. Pure pain, devoid of the slightest feeling of happiness. Never been in a relationship, even my first kiss was a non-consensual one from my abuser, how cute! (: (.....it's not). The world is a horrible place overall. I want no more of this please...\n\nStill, I cannot actually do it. It's because of my sister I think, with whom I still share a bond, even though she's far away.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oi4atd/my_whole_life_has_been_nothing_but_suffering/", "title": "My whole life has been nothing but suffering", "social_network": "reddit", "user": "TelephoneNarrow1811", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 27, "down_vote": 0, "creation": 1626009477, "permalink": "/r/SuicideWatch/comments/oi4atd/my_whole_life_has_been_nothing_but_suffering/", "nsfw": true, "first_save": 1635422258.022805, "replies_charged": false}