{"id": "t5_2qpzs_t3_njw9va", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "you can skip the first 2 paragraphs if that is too much, I couldn't keep it shorter, the most important things are below them\n\n Alright so as Im writing this my face is all sticky from tears and I am hyperventilating so it is very serious. Yesterday, both hangover, me and my gf were arguing, on phone over something related to my behavior. I fucked up again, didn't keep my promise again but I said Im deeply sorry and that I will take care of myself. As the fight grows on I said something I don't really remember now, she misunderstood me and hung up. I called her 11 times after that, also on every social media where she blocked me. As I was on clonazepam I later tried to send her a snapchat where I apologize but I don't remember anything after that so I went to sleep. \n\nHere is the most important part, I wake up, I take my phone and it is at 0%, I charge it and first thing I do - I see her messages. Oh fuck. She called me 15 times but my dumb drugged ass forgot to put sound on on my phone and I just didn't hear her call me. That was before 3 am and then she texts me something like see you in hell, thank you for our 6 months, I lost everyone this weekend, even you and my dad. At this point, I'm screaming out loud but luckily her 2nd suicide attempt also didn't work and I was a bit relieved. I call her immediately, calm her down, we finished our argument from the night before and luckily we ended up making up. \n\nNow, she most likely has borderline depression and anorexia and adhd and she is going to take adhd exam at some psychiatrist next Wednesday. It took her YEARS to sign up for adhd test and treatment so I'm proud of her for that but fuck man I cant count how many times have I brought up the topic of getting her to a therapist for her mental health in general and ed as well. She always in the end said that she is going to see one but she needs time (we both still are a bit underage and live with our parents and law in this shithole country is that you cannot go to any doctor without your parents and their consent). We talked about her going to the adhd psychiatrist and telling them about their borderline and anorexia as well. I asked her if she could do that next Wednesday but she said \"we'll see\" and as always when we talk about her mental health she also said that she doesn't want to talk about it anymore. \n\nMan, I am soo fucking scared for her, not even that I probably wont sleep today because of last night, she just has been feeling so low these past few months. She claims I am the reason she is still here, she has severe sleep problems and all the other shit, this is so advanced that most people would probably leave her and I do not want to do that, I just fucking need to convince her to see a therapist. The problem is, she has some bad memories with therapists from a few years back, I offered her help of my mom who works in health industry and knows many people so we could get her there faster but she refuses every single fucking time. I just cant stand seeing her suffer so much and I know that it should be her who decides she needs a therapist and I will not make her do that, I don't want to. I want to convince her but I have no idea how. Can you help me?", "url": "https://www.reddit.com/r/SuicideWatch/comments/njw9va/how_to_encourage_my_girlfriend_to_see_a_therapist/", "title": "How to encourage my girlfriend to see a therapist as soon as possible?", "social_network": "reddit", "user": "big_c00mer", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1621857532, "permalink": "/r/SuicideWatch/comments/njw9va/how_to_encourage_my_girlfriend_to_see_a_therapist/", "nsfw": false, "first_save": 1635422273.16464, "replies_charged": false}