{"id": "t5_2qpzs_t3_p94bk8", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "I've only known this person for 2 weeks but we got really close in that amount of time and Jesus fucking Christ have they gone through a lot. \n\nI've tried to be a good friend and support them. They say I'm the only person they really tell about this type of stuff anymore so that's a plus. Although they've made it clear it's not helping. They have multiple suicide attempts per month probably even every week they just don't tell me everything. They've tried therapy and counseling in the past but it's hard when their abusive mother doesn't believe depression is. I thought having her open up would help her, because she always hides behind a wall where she acts like everything is perfectly fine and suppresses every bad thing that can happen. But I'm fairly certain talking about it doesn't help her especially when I'm suicidal myself and don't have much to say back. \n\nHer mom and her brother are physically and mentally abusing her in every way imaginable. Making fun of her when she opens up, gaslighting her and making her believe this is some cry for attention and overreacting, not believing in depression at all, times they've attempted to kill her, and so much more but you get the idea. Child protective services and the cops apparently don't help with the unsafe household. \n\nWhat else am I meant to do?? I'm so confused and scared that one of these times I'm going to lose her and I just want to help. This isn't even all that's wrong with her, there's so much more too such as \n\n-Insomnia. She stays up for multiple days on end.\n\n\n-When they do try and sleep they have lucid dreams of their body hanging and they can't look away. \n\n-Borderline personality disorder and bipolar (both officially diagnosed)\n\n-The thought that she's an accident from her father's affair and blames herself for being \"walking PTSD\" for her non biological mom she lives with \n\n-Abondment issues from her past mom leaving, ex girlfriend leaving, and friends leaving (one of them due to suicide)\n\n-Eating disorders. This one I'm not sure about but she goes days at a time without eating \n\nAND SO MUCH MORE \n- \nI don't even want to get into it all because this post has been long enough. This has been the most tragic tale of a person I have ever heard and they're only 15. I want to help them out of this but I'm not sure I can. The only thing I can think of doing is just being there for her as much as possible and showing her love. This is hard when she doesn't open up unless I ask and it's either that's hopeless or I'm bad at it because there have been multiple suicide attempts since we started talking. This fucking sucks. Sorry for the post that is all over the place I'm having a bit of a breakdown over this.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p94bk8/i_want_to_help_my_suicidal_online_friend_who_has/", "title": "I want to help my suicidal online friend who has been through literal hell but I don't know how and I'm scared", "social_network": "reddit", "user": "The_N00bster", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1629599192, "permalink": "/r/SuicideWatch/comments/p94bk8/i_want_to_help_my_suicidal_online_friend_who_has/", "nsfw": false, "first_save": 1635426575.5294805, "replies_charged": false}