{"id": "t5_2qpzs_t3_pnoq41", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I've had some suicidal thoughts pop into my head over the past week and I thought I would reach out. I'm currently in college and the stress that comes from balancing schoolwork, clubs, and my job is getting to me. But my social life isn't helping at all. Did I say social life? It's actually non-existent. I'm living in an apartment off campus and my roommate and I were very close at first but now he sends a lot of mix signals about how close we are as friends. He previously stated that he was trying to bring me into his group of friends but they literally never talk to me and we've hung out about 3 times––which were very awkward because his gf and him were having their childish \"problems\" and tend to not act myself in group settings (which I am trying to work on.) The uncertainty regarding the friendship between him and I is driving me nuts and I feel myself deviating between angry and confused all the time. I feel like I have nobody at home. My grandma, who raised me, is getting really old and has now developed a childish mindset due to cognitive decline. My Dad is a narcissist and a emotionally abusive person, and I literally subconsciously shut him out. I have two older sisters, but they have boyfriends and have their own lives. I am happy to be away from my hometown but really sad that I feel like I have nobody. I am fighting so hard every single day. Going to the gym, meditating, going on drives, but non of it has seemed to work this week and I feel myself on a new decline. I am scared. I am hurt. I am so lost and confused. I am also dealing with PTSD, ADHD, and OCD and I believe I have a personality disorder. A lot of rough moments from my childhood will pop up into my head at random times and it's starting to freak me out. Not only that, but the belief that I have a personality disorder stems from another problem: I feel like I adopt a very feminine, girly, empowered women mind when around males, and a masculine role around women. I had believed this to mean that I was transgender and spent 6 months hyper fixating on that, but now I'm wondering if its a trauma response due to emotional and mental abuse I took from males growing up. I am just stressed, confused, and scared and I need support.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pnoq41/need_some_support/", "title": "Need some support", "social_network": "reddit", "user": "NewFox9456", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1631568075, "permalink": "/r/SuicideWatch/comments/pnoq41/need_some_support/", "nsfw": false, "first_save": 1635428094.6767042, "replies_charged": false}