{"id": "t5_2qpzs_t3_epwt7b", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I honestly don’t get it and no matter what it’s all your fault. The only reason I’m still alive is because I’m too afraid of dying and it’s too much effort to make a plan that’s ideal or not painful. I wish I had the will to grab a gun and blast myself but I’m scared, just too weak to do it.  It’s easier for me to just keep on living. Living is far easier then killing yourself when your own self preservation  doesn’t want to you die or hurt itself. Even if I have to suffer immensely like being homeless or whatever psychological ailment  there are tools in place in the human body to keep you alive for as long as possible.  \n\n  I want to die there’s no doubt but I don’t want to kill myself and there’s nothing nobody can say or do for me that will change that fact. It’s the people that make me so mad humans are so cruel and brutal with how they treat people that don’t fit in. We have all the tools to give someone like me a peaceful death the same way we can treat a cancer patient and not just say hey you know what get over it you still have to contribute just like everyone else.  The least people can do is be kind but we’re just a byproduct of nature and she designed humans to be social animals  that can reduce humans into “inhumane” circumstances.\n\n I’m not insane like people claim I am or defunct in reasoning it’s this sick sad world and it’s sick beliefs that continues to plague the world of injustices. It doesn’t matter what extenuating circumstances that exist, the fact that your were imposed in this world by way of being burdened.  Society doesn’t care about people like me no matter how much we suffer,  perhaps in-fact nobody cares or can truly care that’s fine I understand. \n\nNo different than the starving child left to rot while someone has too much food for themselves. All I’m asking for is help killing myself I don’t see the big deal with that? If you need to charge people for it so be it. I don’t see what the big problem is if you want to live so bad fine the people who want to live will continue to life and the depressed worthless people you despise so much will be ridden of existence that seems like a win-win no? What kind of society can’t offer me the right  to die but force me to live against my own will? \n\nAnd I know this will sound just simply like a cry for help that I want sympathy, empathy, a way to be a parasite once more  even though I’m inclined as a human to be social and interact. All I want is my pain to end is that too hard for you understand? Nothing works nobody can help me unless you assist in my death. Do you have any idea how long I’ve been ruminating over this?\n\n There’s nothing in this world can offer for me that’s worth the suffering. I don’t want to toil away for 40+ years miserably why is that so hard for you to understand? The shame has no effect on me it never motivated me it just made me go deeper into the rabbit hole. If you want to discard me as trash you might as well put me into the ground six feet where all the rest of human garbage resides.", "url": "https://www.reddit.com/r/SuicideWatch/comments/epwt7b/i_wish_society_would_provide_people_like_me_a/", "title": "I wish society would provide people like me a peaceful death.", "social_network": "reddit", "user": "KingOmega9", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 123, "down_vote": 0, "creation": 1579243569, "permalink": "/r/SuicideWatch/comments/epwt7b/i_wish_society_would_provide_people_like_me_a/", "nsfw": false, "first_save": 1635428073.2562084, "replies_charged": false}