{"id": "t5_2qpzs_t3_qhc09x", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "I feel hopeless, another manic episode. I feel like I’m not getting anywhere and my hole just keeps getting bigger and bigger. I am Christian and as much as suicide is a sin and not forgivable, it just slowly sits on the back of my mind. The only reason I believe I’m still here is because of my Mom, Brother and my Newley adopted dog named Rylie, I got her from our Local Animal Control and she is the best dog around. I feel like I’m going in circles and I can’t get out of what seems like a room full of water, slowly rising. I lay here in bed crying and asking why? My boyfriend who says he cares but when I say I’m overwhelmed he tells me I’m too sensitive and that I need to grow up, I just wanna be held, I have so much anxiety and depression and it’s like he doesn’t understand. I just wanna be cared for and just held that’s all. So I’m sure he wouldn’t mind if I’m gone, if I do happen to leave, I hope someone reads this and knows that Rylie has three favorite blankets, she is allergic to beef and loves chicken. She doesn’t like to sleep alone, and she loves her stuffed animal that is a turtle and we named him frank. She loves to run around and play rough, but she also likes to give snuggles and kisses. I just wish someone could hold me, that is all. God please help me. I feel so hopeless, I have knocked myself in the head out of manic and anger. I have pulled out my hair and scratched myself. Nothing seems to relive the pain I feel inside. Here comes Rylie to give me kisses and cuddles. I’m tired of being a fake happy person, I have been pretending long enough.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qhc09x/im_not_okay/", "title": "I’m not okay.", "social_network": "reddit", "user": "KaylaHerDogRylie", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635385499, "permalink": "/r/SuicideWatch/comments/qhc09x/im_not_okay/", "nsfw": false, "first_save": 1635426868.3253977, "replies_charged": false}