{"id": "t5_2qpzs_t3_pycqpa", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "Hey.\n\nThis is gonna be long so if you ain’t trying to read a essay on why I want to die, then please go ahead with your day and I hope you have a blessed one. Now to the intro.\n\nNobody said life was going to be easy. Hell, only people that have ez lives are rich people. Now think about this. “Nobody asked to be born”. The reason I’m here today is the same reason everyone else is here. I was born. It’s not fair to not have a say on if you wanted to try and live and such a shit world. Why can’t i just say that I’d rather not been born, or id rather be dead without people trying to recommend me a therapist or meds? Nobody should give a shit about whether someone wants to die or not. If they want to die then so be it. Help them die. It makes things way easier. Now you’re probably thinking, “why would you say something like that”? I know it may sound messed up, but coming from someone who has had these thoughts and feelings for a long time now, I’m going to illustrate why few this way.\n\nMy first reasoning comes from me realizing that I’m replaceable. When I say replaceable, I mean not being special. Think of something or someone that you couldn’t live the rest of your life without. That would be irreplaceable. Now think of something or someone that you may like a little, a lot, or maybe not at all and you wouldn’t care to lose it/them. That would be me. A replaceable piece of shit. If I’m gone, I will have people that would maybe care for a couple days, a mouth or so. Then forget all about me, as if I’m something they ate at school lunch. This shows that if I’m not special, then are you really different? No. Im no different than some other melanated individual. If he/she were in my position, it would all be the same with little differences that could be either better or worse. If someone dies and there not special, nobody’s gonna care. If Beyoncé died (knock on wood) the whole world would be sad and she would be remembered forever. I would die a be forgotten. See what I mean? I’m not special. I’m so replaceable it’s funny.\n\nMy second reasoning comes from me realizing that I’m worthless. When I say worthless, I mean how much money you’re worth. If I were a currency in the world, I would be the little dust at the bottom of the barrel that is never coming out. Money is by far the most important thing in the world. I don’t give a damn what you say. The hell with love and fulfillness or whatever stuff people say is more important. If you didn’t have money, than you would have food, or water, or a home, clothes, literally anything. Money buys happiness. You get married. Guess what? You give rings and a wedding with all that other stuff. That all cost money. People who love to eat; that cost money. People who love their kids; they cost money. People who love money; cost money. Everything cost money. I’m a below average money making pig. Actually, no I’m not. I don’t even have a job anymore. Why? Please look at the first paragraph. Because I don’t have a lot of money that I can use on myself and the people i love, im worthless.\n\nMy third reasoning comes from me realizing that im a failure. Why I say failure, I mean haven’t or can’t accomplish anything and is not/won’t be in a place in life they can enjoy. Not being in a position to have a better life. Yeah I failed alright. How can I say that I am happy? But you’re only 19. You have so many years to live to see where you end up. Im tried of being told that. I don’t know what I want to do. Im being told to go to college, but I don’t even know what I want to do in college. I don’t even think college is something I want to do. It would be a waste of money and time. Let’s say I get the degree and get a job with said degree and don’t enjoy it. Well I failed at being happy and not I’m in debt. I don’t know what I want to do snd even if I did know, I’m not special. I can be replaced and who’s to say I can even do it. I can’t do anything. I’ve failed many times before so why would I think that anything else would be different. If you fail, you fail. Tuff shit. That is why I’m a failure\n\nIn conclusion, I’m a worthless, replaceable piece of shit that has failed myself and everyone I love. I could go on and on and on with many examples of me being worthless, replaceable, and a failure, but that would make this way too long and my fingers are getting tired. Ha; yet another thing I can’t do.\n\nIf you’re gonna try to recommend a therapist, the doctor, a ward, meds etc, don’t. Its all just a waste of time and money and I’m not worth it at all. To be honest, if you actually read this, why would you? I’m not worth it. If I die, i would be forgotten for the rest of time. Good. Not like I was anything special to begin with. I mean look at me. I’m average height, skinny, black, male, brown eyes, not handsome, not strong, not smart, shy, introverted, no skills, no friends, no lover and not a single person cares about me. \n\nYou want compassion; move on. You want fair; tuff shit.\n\nHappiness is only momentary. Pain is always\n\nI was made for no reason at all.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pycqpa/essay_on_why_i_believe_suicide_is_the_best_thing/", "title": "Essay on why I believe suicide is the best thing for me and my family (;_;)", "social_network": "reddit", "user": "AyyCoyote", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 27, "down_vote": 0, "creation": 1632977610, "permalink": "/r/SuicideWatch/comments/pycqpa/essay_on_why_i_believe_suicide_is_the_best_thing/", "nsfw": false, "first_save": 1635422991.8689158, "replies_charged": false}