{"id": "t5_2qpzs_t3_j081sz", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "Okay Reddit, I need your help. I'm using a throwaway account to post, and minor details have been changed.\n\nI (25m) have a friend (22nb) we'll call A. A is an international student and currently does not have authorization to live or work in the country.\n\nFor a few years, my partner (24nb) and I have lived in the same apartment. It has an extra bedroom we don't typically use, but rent is low enough and we make enough money between us that we can live comfortably by ourselves. We don't go out of our way to find roommates, but we agreed to each other when we moved in that we'd offer the extra bedroom to anyone in need until they can get a place of their own. 5-6 different people have lived in that room over the years, but it's always been a very clear understanding of rent expectations (if any), chore obligations, and a move-out date. I don't love roommates but would rather someone have a roof over their head than myself be minorly inconvenienced.\n\nAt the start of the pandemic, the local university forced out the students from on-campus housing, which included A. A approached us with seemingly nowhere else to go, so we of course welcomed them into our home. My partner and I found out a few months later that the university was absolutely still allowing approved residents but agreed that being in our home was probably the best environment for A anyway.\n\nAt the time, A was just a handful of credits away from finishing a 4-year degree at the university and was on track to graduate that Spring. \n\nWe talked about a move-out date of August but reiterated that we could amend the plan if needed.\n\nShortly after moving in, A stopped taking their prescribed psychiatric medication without the supervision of a doctor. We did our best to encourage A to continue with the medication or indicate to a doctor that it wasn't working, but A ignored us and decided to quit the medication anyway. \n\n(Side note: A has a long history of suicidal ideation. We had a large scare last year where A convinced us they'd be ending their life on a specific date. Both my partner and I struggle with suicidal ideation as well, but it's well-managed. Because of this, we understand that in-patient hospitals aren't always conducive to healing, as providers can misinterpret passive, disorganized ideation as having immediate harmful intent. We've avoided hospitals/authorities because of this.)\n\nA never finished their Spring classes, and their professors were gracious enough to allow them to complete their coursework from home over the summer. A never did this. Over the course of the summer, A began to become fixated on the idea of being an \"illegal college dropout.\" I obviously can't understand some of the issues A is going through, but it seems that they're more comfortable in the certainty of failure than the uncertainty of trying. \n\nA's mental health spiraled over the summer as well. We have suggested seeing ANY provider (especially the ones A has FREE ACCESS to at the university) to try to help. A mutual friend has even tried organizing a crowdfunding campaign for an immigration lawyer, but A refused. A is convinced that some people just \"want to die\" and \"are meant to die\" and not only shoots down but scoffs at our pleas for them to seek any type professional help.\n\nIn June, we had a talk with A to essentially plead with them to seek out any professional, as the burden of A's health and citizenship issues unintentionally fell on my partner's and my shoulders. We shared how we were scared every day to open their bedroom door to find a body and how we were willing to do what we could to help, but we just didn't have the resources to give them what they needed. \n\nA's solution to this was to shut down completely and climb further into their denial. A talks less to us about their health but is very open about how poorly they are doing in general. Since then, A has been lashing out at strangers and coworkers (not my partner and I, thankfully, but the anger is still apparent), insulting them and their livelihood. A is convinced that they were dealt a permanently bad hand and is intent on making sure those with privilege are aware of it, even if that personally hurts someone else.\n\nA is now officially un-enrolled at the university. I have expressed that I think it's best for our relationship as friends that they move out sometime soon, though I know that things are really uncertain at the moment, so I'm okay with a delayed move-out date.\n\nA can sense my frustration and texted me a few days ago to ask why. I explained, again, that I'm frustrated at the situation and that someone I care about deeply isn't taking care of themselves. I made a final plea for A to call on anyone to try to help, regardless of their profession. Hell, it could even be me. A only responded that they were moving out in under 3 weeks.\n\nLast night, I confronted A, and they admitted that they are moving out sometime next week to take a \"vacation,\" possibly to their home country. They won't let me enter their room because they don't want me to see something in there. A openly said that they \"might\" die, but maybe not. They are now wanting to discuss how to get rid of their stuff that they don't want to take. They said that our house is a toxic environment for them.\n\nI've left out a lot, so please ask any clarifying questions if needed. I'm really struggling here. Am I in the wrong for pressuring A to get help? Should I be taking a more active role? Should I be immediately calling authorities (even though I know the resulting debt is a huge trigger)? Am I creating a \"toxic\" living space?\n\nThank you for reading and for your response.", "url": "https://www.reddit.com/r/SuicideWatch/comments/j081sz/suicidal_roommate_advice/", "title": "Suicidal roommate advice", "social_network": "reddit", "user": "zurtope", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 27, "down_vote": 0, "creation": 1601134273, "permalink": "/r/SuicideWatch/comments/j081sz/suicidal_roommate_advice/", "nsfw": false, "first_save": 1635428146.2694926, "replies_charged": false}