{"id": "t5_2qpzs_t3_n4wvgz", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "I'm so fucking mentally ill, anytime I reach out for help, I get told to just kill myself or told that I'm an awful person without fucking any advice. Even in suicide hotlines/suicide chatrooms/by a fucking psychologist in training on reddit (shoutout to her if she's still here). Like goddamn I guess mild depression is as far as mentally ill people can go without being told to literally die.\n\nI have really low empathy and I hate animals and people. I remember hating them as a child as well, especially animals/young children even though I was like 6-7 or whatever. My home life was always awful, I have so much trauma from abuse/assault/harassment/rape/neglect. I used to commit crimes (such as stealing and animal abuse when I was a young child), probably due to that? I don't know why but I never grew out of it until I got bored of them, not because of remorse. I still don't feel remorse for that, though I was always aware it was wrong and didn't care.\n\nEven if I'm not good at telling what's morally correct/having empathy, I still pretend to. Nobody knows I'm mentally ill (besides having anxiety) in real life. I'm very soft-spoken (I talk very quietly and I look approachable) and I'm not that mean to anyone to their face, despite my mental state. Although, I've had some people say they were afraid of me (never spoken to them before) and I'm very fucking paranoid that some people can tell.\n\nI think one of the worst years for my mental health was in 7th grade; I attempted to commit suicide for the first time, I'd self harmed as a young child by hitting my head/arms against things but I'd only just started cutting, and I used to hate myself (due to abuse/being conditioned to dislike myself in comparison to my sibling) but I never really hated myself as much as I did then. I developed an eating disorder as well, which I still have but it's different now (used to be just c/s and restriction, now it's b/p and restriction). I also got really into snuff films/gore and realized I was a necrophiliac (possibly? I haven't watched porn or snuff involving necrophilia since before last November and am no longer sexually attracted to anyone in general, especially not corpses, but I vividly remember I was at the time).\n\nIt only really spiraled from there. I tried committing suicide multiple times since, my body is constantly in pain because I starve myself a lot and I cut myself daily - more-so out of boredom now, I can't remember the last time I cried, everyday feels the same and it's been like that for two fucking years, and I have intrusive thoughts that are even worse. I can't fucking go a day without thinking of killing someone/myself, I have so much childhood trauma that more and more is resurfacing but I don't want to remember.\n\nOne of my worst moments was when I was making a school shooting joke with a friend and wrote a threat on a whiteboard; forgot to erase that and my entire fucking school started freaking out and the police came. In my mind at the moment (shh I was literally in middle school), I didn't think about the consequences at all before that. After they came, all I could think was 'don't get caught,' not 'I feel bad for anyone panicking' because that wasn't on my mind at the time. I wasn't caught, neither was my friend, everything went back to normal but more safety measures afterwards. >!America moment.!<\n\nMy parents are abusive and I don't keep close friendships/ignore all of my friends unless they actually need something, so I have nobody to reach out to. I don't know what to do. I don't want to fucking do something awful but I have no money for a therapist and I can't afford to get put into a psych ward. I can't tell anyone who I know in person because I really really can't get into a fucking mental hospital. I've attempted suicide so many times before in my life, it wouldn't hurt to try again but I don't want to anymore; I want to get help but I fucking can't.\n\nGuess I'll kill myself. If you actually wasted your time reading this; thank you. Also personality disorders (I'm assuming I have a personality disorder but I'm not a psychologist so I'm not saying which) can't go away the same way that anxiety/depression can, so I mean... suicide is like the only option (besides being mentally ill and I can't fucking take this anymore). Anyway I'm gonna go overdose. Bye :)\n\n>!anyway I just straight up saved you guys from another murder case, be grateful. /s!<\n\n&#x200B;\n\nEDIT: i forgot but i thought i should include this; i'm 15f. okay goodbye for good. change da world, my fi;nal message.", "url": "https://www.reddit.com/r/SuicideWatch/comments/n4wvgz/i_legitimately_have_no_other_option_but_to_kill/", "title": "I legitimately have no other option but to kill myself at this point. I'm very mentally ill and can't be fixed.", "social_network": "reddit", "user": "VanishingUtopia", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1620158944, "permalink": "/r/SuicideWatch/comments/n4wvgz/i_legitimately_have_no_other_option_but_to_kill/", "nsfw": false, "first_save": 1635427061.0331776, "replies_charged": false}