{"id": "t5_2qpzs_t3_n545et", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Dearest Angel,\n     I could only cry when you told me about your new girlfriend. It was natural. With teenage hormones, fake love, and my self loathing, I automatically assumed it was to spite me and I added it to my list of reasons. You read the rest of this and you'll understand what I meant.\n     I'm proud of myself, really. I'm proud I could make it this long without breaking. After years of everything. I know that you've never asked me about anything really, and you use me for your own advice and consolation. So I'll tell you my life. \n     I was born April 26, 2005. You understand that. I was born into a family of eight, making me the ninth. We would add two more after that. I wasn't a girl, and my family was disappointed. Above all that, I had expectations to live up to, which I rarely exceeded. \n     Getting emotional yet? You haven't had to deal with what I had to, but you were the only one who cared. \n     I shouldn't be angry at you, and deep inside, I know I'm not. \n     I could never be mad at you. \n     And I blame myself.\n     You ever question what happened with the boy in the back? You ever question, \"Why, oh why, have I never seen this boy's arms?\" \"Why, oh why, does he dress the way he does?\" \n     It's funny, they wanted me to be a girl, but it seems I was past a socially acceptable expiration date. \n     I'm writing this in case you ever read this. I know you won't. I feel it. My death won't matter, my story will never be told, I'll never be told! I'm unimportant, and I'll always be. Life is different when you're me. \n     And I just got picked in this game of Russian Roulette.\n     With love and pain/With fire and with rain/With the rumble of a train/I'll be gone/Gone forever.\n     Hopes and prayers from the one who never got a chance. \n\n                            It is bad, I'm sorry.", "url": "https://www.reddit.com/r/SuicideWatch/comments/n545et/i_wrote_a_letter_it_isnt_inspired_by_me/", "title": "I wrote a letter. It isn't inspired by me.", "social_network": "reddit", "user": "N031GAM3R11", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1620178825, "permalink": "/r/SuicideWatch/comments/n545et/i_wrote_a_letter_it_isnt_inspired_by_me/", "nsfw": false, "first_save": 1635422314.829273, "replies_charged": false}