{"id": "t5_2qpzs_t3_pwyvbs", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "I’m transgender - Female to Male. \n\nI think I first realized this when I was very young - I’ve just always felt off. For a very long time I tried to deny it, and tried to be more and more feminine until my 18th birthday. I cut off all my hair (I’d previously refused to because I believed I would ‘realize something’ which is dumb as hell in hindsight) and came out officially. \n\nI started testosterone right before the pandemic, and being high risk made it so I could not do much but focus on my transition. However, testosterone didn’t work well for me — I have a medical issue with my throat (hence the high risk) and my voice wasn’t physically capable of dropping. There were certain things that did change but overall I was still perceived as feminine, no matter how hard I tried — I still am perceived as feminine. I’m unable to pay for the surgery to get rid of my chest on my own and I’m unable to work long hours due to disabilities. \n\nI hate my body. I hate it so much I want to puke every day. I’ve given up trying to change it, I’ve given up completely. A few days ago I had to go to the doctor to get a check up and she recommended a Pap smear since I turned 21 and I started bawling in the office before throwing up when I got home. I don’t know what to do to fix it because I’m never gonna be the person I want to be — I’m never gonna be seen as male. Everything I do is too feminine. I stopped working out and I stopped searching for doctors because I’m tired. I just want to die. I want to die and be reborn in the right body. There’s no surgery that can make me taller, there’s no surgery that can make me have a penis that’s not somewhat off, there’s no surgery that can replace the 18 years I lived previously as female. I hate myself so much. The only reason I’m alive is because I don’t want to hurt my mom, but I’m planning on moving out soon. I want to kill myself when I do that, because then she wouldn’t be the one to find me. \n\nThis is the first time I’m writing this out so I’m sorry if it’s in cohesive. I’m so fucking tired. I’m literally writing this on my porn account because this was entirely triggered by being Horny and realizing I’m missing the right parts all over again. I’m sorry if you’re reading this because it’s all fucking dumb and doesn’t make sense", "url": "https://www.reddit.com/r/SuicideWatch/comments/pwyvbs/i_will_never_be_the_person_i_want_to_be_and_ive/", "title": "I will never be the person I want to be and I’ve given up.", "social_network": "reddit", "user": "yet_another_twink", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1632804395, "permalink": "/r/SuicideWatch/comments/pwyvbs/i_will_never_be_the_person_i_want_to_be_and_ive/", "nsfw": true, "first_save": 1635427970.2896445, "replies_charged": false}