{"id": "t5_2qpzs_t3_kb9fzi", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "TW! This was written shortly after a s*icide attempt. There is no rational thinking involved and I have significant memory gaps and was/am highly at risk to myself.\n\nI had it all planned out, it was going to be this week's Friday evening. I have an obsession with cutting so I wanted to cut my wrists. Along with my PTSD and depression I have very severe dissociative symptoms and sometimes black out for hours. The last days I just felt nothing, I was nothing - I barely remember the last days. I was just existing somehow, fixated on the last day to come. \n\nYesteday evening, everything got out of hand. I've relapsed with self harm and that day, I lost all sensation in my body. My hands were tingling and numb, I was confused and desoriented. I had compulsivly checked my for my artery and felt my pulse a lot, but I just lost all connection to my body. I Googled a million pictures to make sure I was going to hit the right artery on my wrist to kill me. I tried to poke the area where I suspected I had most success, but little blood came out. Everything became so foggy around me I suddenly realized I wasn't able to kill myself, even though I wanted to so badly. I was so out of it and couldn't think straight, I just started sobbing uncontrollably. I didn't feel sad, but I sounded like the most heartbroken person in the world. I cut my legs again and just felt nothing. \n\nI then went completely into auto pilot and took a cab to the ER. I remember very little, but I just sobbed and sobbed. Everything happened really fast and everyone was so nice, it almost made me hurt more. When the doctor saw my leg, she said \"you really have to get stitches, we have to get you to a surgeon\". My leg was covered in blood, while my wrists looked completely normal. I had no idea what was going on.\n\nAfter getting several stitches I was sent to the closed off part of the clinic and had 24/7 surveillance. I got sleeping pill after sleeping pill but I couldn't sleep. My mind was still racing. By 2 am they had given me 4 sleeping pills (I'm a very small person) and I don't remember any of them. I began to get seizure like crampings on my arms and cried for help and a doctor, but the security and the person watching me assured me it wasn't from the pills and just my intense stress, but I had never experienced anything like this before. It felt like eternity. At some point I must've passed out, but was glad when the night was finally over, the drugs were out of my system and I got to go to my own room without surveillance.\n\nI'm now going to be here for I don't know how long. I'm mad at myself for failing to kill myself. I'm mad I didn't pick another method.\nI don't really have a different option than to follow part of the therapy program here, and I am glad that at least everyone is really nice.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kb9fzi/i_failed_at_a_suicide_attempt_yesterday_and_went/", "title": "I failed at a suicide attempt yesterday and went to the ER", "social_network": "reddit", "user": "sselbtunlaw", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 92, "down_vote": 0, "creation": 1607714873, "permalink": "/r/SuicideWatch/comments/kb9fzi/i_failed_at_a_suicide_attempt_yesterday_and_went/", "nsfw": false, "first_save": 1635428118.579816, "replies_charged": false}