{"id": "t5_2qpzs_t3_jelkd1", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I don’t know if I’ll go through with it. But it seems like my ability to control my actions and thoughts are lessening by the minute. At this rate I will be gone in a few days. And since I can’t tell anyone about this, I need my last words to be out there somewhere.\n\nHello, my name isn’t important. Neither is my age, nationality, occupation or past traumas.\n\nI have major depression, anxiety, bpd (crippling dissociation anyone? ) and bulimia nervosa. I have been actively struggling with these for the last 6 years. I have been hospitalized due to complications of bulimia numerous times, institutionalized 3 times and underwent ECT treatment in each of them. I also tried dozens (yes literally) of medications and therapy.\n\nNone of them worked.\n\nBefore you say “maybe you should change your therapist”, I’d like to inform you that I did. In total of 12 times. Among those therapists, two of them told me they couldn’t/didn’t know how to help me. One of which was a professor.\n\nI’m newly married, I have the best husband I can ever hope for, two spoiled dogs, a car, a house , you name it. But my brain won’t let me live.. I can’t even work. And as much as I feel guilty about everything I have and still feeling this way, I have come to the conclusion that I have tried everything to save myself- even if it’s for the sake of my loved ones and not my own- and it simply didn’t work. I have recieved the most radical treatment that modern medicine can offer -I let them electrocute my brain for god’s sake- and it still didn’t work.\n\nI’m coming to terms with the fact that this is it for me. It’s sad really. I had so much more to do, see, feel. I’m genuinely sad that I can’t live anymore. Then again, it’s the most merciful thing I can do for myself, the best self care for me and my situation in my opinion.\n\nNo one believes me when I say I did everything I could, that I really tried my hardest. \n\nI hope you do. \n\nThank you for reading this. I really appreciate it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/jelkd1/i_just_need_my_last_words_to_be_out_there/", "title": "I just need my last words to be out there somewhere.", "social_network": "reddit", "user": "scaremeidareyou", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1603183214, "permalink": "/r/SuicideWatch/comments/jelkd1/i_just_need_my_last_words_to_be_out_there/", "nsfw": false, "first_save": 1635422936.629928, "replies_charged": false}