{"id": "t5_2qpzs_t3_q1x6i6", "request": ["4162f604-29a0-4041-a85b-c249e1ca13f8"], "text": "Today marks 2 years since my last graduation party.\nI was wondering that the party will be full of fun, good memories and good day.\nIn fact, it wasn't.\nI was in the worst situation as a new graduate; I was about to complete another half year in University because of one single course, but thanks god I didn't.\nI was totally disappointed, I was wanting to die ASAP.\nI was following my colleagues and classmates and helping them as I can. But I couldn't help myself to get an excellent or even good GPA, to start into academic career. My life dream these days.\nI tried to commit suicide and end up with my life.\nI hated parties very much, imagine yourself with high volume of music and some silly \"inspirational\" talks and you want to get out there but you can't.\nSo I faked myself and tried to draw this smile and that happened. \nI tried to enroll into pharmaceutical academic career, but I couldn't cuz of my low GPA = 2.49.\nBecause of all of this, I spent 2 months with psychological treatment. I went to a freaking miserable job in a pharmacy gives me 1000 per month, so I tried to resign but COVID has come and I had to stay 7 months.\nI tried to get rid of this.\nThis is not my life. That is a freaking miserable punishment. \nso when the first COVID-19 wave ended, I had to resign and get a new standard job. But instead of that, I had 10 months to get a new job.\n10 Months of waiting, trying, offering, lots of hours into LinkedIn, Wuzzuf, Forasna, etc. However, no results.\nI spent days into pharmaceutical companies, pharmacies, factories, no results.\nEven I contacted with my friends and colleagues , no results neither.\nI was getting rejected. Every. Single. Time.\nOn the other side of the river, Everyone is doing great, everyone does his best. Everyone I know was better than me. \nSo, I tried to kill myself more and more, but I couldn't.\nI wanted to disappear and get rid of this life.\nSo I tried to cut my throat and veins. But in the last moment, I stopped and cried a lot.\nIn the last second before this, I discovered that suicide is haram, whatever I thought.\nI prayed, prayed a lot to GOD for helping me.\nNowadays, I feel good, not so much, but when I compare this with what happened yesterday, it seems excellent, alhumdullah.\nAt least, I have realised that I have to survive.\nSidnah Khaled ben Al Walid (May Allah bless him) said when his dying \"Not slept the eyes of cowards\". Life is not for cowards, life is made for braves.\nWhatever happened through these years, I am confident , thankful for GOD, and proud with myself that I tried at least.\nPraise be to God always and forever for everything.ا\nMy Lord, make me enter a truthful entrance, and lead me out a truthful exit, and grant me from Yourself a supportive authority. (Al-Isra 17:80)", "url": "https://www.reddit.com/r/SuicideWatch/comments/q1x6i6/if_you_suffer_from_depression_read_this_please/", "title": "If you suffer from depression, read this, please.", "social_network": "reddit", "user": "Senior-laszlo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 0, "down_vote": 0, "creation": 1633443063, "permalink": "/r/SuicideWatch/comments/q1x6i6/if_you_suffer_from_depression_read_this_please/", "nsfw": false, "first_save": 1635422899.6561344, "replies_charged": false}