{"id": "t5_2qpzs_t3_c9qery", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "So i'm not feeling particularly incredibly suicidal at the moment, (maybe just a bit of idealization at the moment) but dammit does the state of the hellish world we live in right now just make me want to take a bullet to the skull. We live in a world where corruption rules and the biggest assholes win. We live in a world where it's cool to be totally apathetic and abusive towards our fellow man. We live in a world where common sense and human decency is thrown out the window in an effort to climb the social ladder the effects of which are worse the more power said person has. Hell even genocide is apparently cool again and as someone who is often the target of such hate speech (being queer and all) frankly i'm terrified. Like, I don't know how i'm supposed to deal with this. It's easy enough to say \"just ignore it, everything will be okay\" but that sound irresponsible of me to think otherwise considering the aforementioned ocean of apathy we all are forced to live in. But at the same time I am such a low energy person that thinking about these kinds of things exhaust me so much and further tire my already exhausted brain. Sometimes I just kinda wanna end it all, save the trouble y'know? Hey, the vast majority of people in this world want me dead anyways so what's the harm?\n\n&#x200B;\n\nSorry, I mostly just needed a place to vent but this seemed a bit too involved in suicidal idealization for r/depression. Don't worry, I don't have the means, no fire arms in the house or anything (which is the only way I'd want to go tbh), and I am medicated. Might delete this post later considering this is my main account and the whole \"damn I kinda wanna die lol\" shtick isn't really a good look.", "url": "https://www.reddit.com/r/SuicideWatch/comments/c9qery/real_talk_how_can_anyone_find_the_will_to_live_in/", "title": "Real Talk: How can anyone find the will to live in the horrible fucked up world that we live in now", "social_network": "reddit", "user": "PrinceNoMoreStars", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 23, "down_vote": 0, "creation": 1562394205, "permalink": "/r/SuicideWatch/comments/c9qery/real_talk_how_can_anyone_find_the_will_to_live_in/", "nsfw": false, "first_save": 1635422303.677968, "replies_charged": false}