{"id": "t5_2qpzs_t3_ozb4q0", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I wanted to hold on, I wanted to wait it out. But I can’t any longer.\n\nTo My ex fiancé, I loved you with all my heart, and everything you’re saying crushes me. Because I know that I loved you, and it hurts that even after all this I still love you. I’m sorry you think the worst, but I promise you I never intended to make you feel anything but good. You don’t have to believe me, but I never once cheated. Never even thought of it. You were my everything and will always be the most beautiful woman in the world to me. I really wanted to spend my life with you, but I pushed you away and learned that I didn’t deserve someone so special. I wish I could go back in time, and make things better. Every morning I miss your smile, your eyes. I miss coming home and you asking “what was the best part of your day”. I miss how excited you got about 90 day fiancé and new recipes you found on tik tok. You deserve the best life possible, and I hope that’s what you have. Sincerely I did love you, and I’m sorry I wasn’t good enough at showing you. \n\nTo my son, you’re the best part of me but I feel I let you down. I gave myself to work, instead of you and I’m sorry. I cant give back that time and I’m sorry you have to go on without me. Your mom is an amazing woman, and she will make sure you’re alright. The day you were born you lit up my life. Your smile, your laugh, your love for Mario and animals is so pure. Sitting here right now, I’m not very proud of anything other than being your father. I love you so much. I wish I knew how to heal so I could be there for you. But this pain is just too much for me. My friend gave me his word if you ever chose to wrestle he will look out for you. I can’t say I hope that you will, but if you do know I made sure people have your back. But please, ask your mom for advice she has the brains. You’ll be better following in her footsteps. Please never think this is your fault, you’re why I held on this long.\n\nTo your mom, please sell my house and anything in it you don’t need. My code is still the same for my accounts every penny in it is yours. I’m sorry I let you down, you were a godsend and I hate that we’re here now. But I did love you, and I am ending this still loving you even though it’s different it’s still love for you. \n\nMom, I’m sorry that this will hurt you. But I can’t keep feeling this way. I’ve fought off these urges for too long. I just can’t keep doing it. I love you and thank you for all your sacrifices. \n\nBye, Aaron Michael William F.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ozb4q0/im_sorry_to_those_who_love_me_this_is_whats_best/", "title": "I’m sorry to those who love me, this is what’s best for me.", "social_network": "reddit", "user": "Aaron_michael_Fro", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1628270274, "permalink": "/r/SuicideWatch/comments/ozb4q0/im_sorry_to_those_who_love_me_this_is_whats_best/", "nsfw": false, "first_save": 1635428216.316811, "replies_charged": false}