{"id": "t5_2qpzs_t3_op0o8o", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "Yesterday we broke up. After months of battling with my OCD and extreme jealousy she got very aggressive and abusive, I can't blame her after putting up with my bullshit for so long. She said that she wants to break up (she said it a lot before, along with other painful stuff), and I kind of just listened and deleted her, broke up... Now I regret it...  \n\n\nWhat confused me was her unblocking me (I was blocked from our main chat before break up) right after the breakup, even though she wanted it. She hasn't messaged me and since yesterday is talking to our best mutual friend. All I know is she doubts the decision to break up and is indecisive and wants time to think... Now with that little hope I can't even move on or anything, waiting is killing me, I still love her and I want her back and I'm tormented with the thought of her saying that she'll stick to the decision to break up.....  \n\n\nAt the same time my little brother is having a major operation, my mom is waiting for cancer test results (they found a lump on her liver and there's a lot of cancer background in our family), I'm off my anti-depressants that I got for OCD, I'm probably dropping out of the university and everything is just going to shit... On top of that none of our friends besides the one who's talking to her, reached out to me. I feel so lonely and lost.   \n\n\nI've been back to cutting after long years about 2 months ago, now I'm just feeling like ending it all, but I don't want to sadden my family, they are going through enough... I just want to disappear, I don't have anywhere to vent so I'm leaving it here, I'm sorry.", "url": "https://www.reddit.com/r/SuicideWatch/comments/op0o8o/i_feel_like_theres_nothing_left/", "title": "I feel like there's nothing left", "social_network": "reddit", "user": "Aniver220", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1626906599, "permalink": "/r/SuicideWatch/comments/op0o8o/i_feel_like_theres_nothing_left/", "nsfw": false, "first_save": 1635426624.9450753, "replies_charged": false}