{"id": "t5_2qpzs_t3_m7f4v3", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "For the first time in 4 days I had a conversation with people I know. The people I consider friends. I regret trying to do this.\n\nI asked them yesterday if they wanted to get into a call after school today and to my surprise everyone could.\n\nI think I said something earlier about how I know I love my friends but I just can't feel it and I really can't fucking feel it. It felt like I was in a call with three strangers and it's even worse now because the chat is over. I'm alone.\n\nAlone really hurts. I can't tell if alone hurts more than feeling like I don't even know my friends because it hurts largely in the same way. It's like a headache except I can't take a painkiller and be better in an hour or two, there's just this deep, dull ache somewhere in my soul or my head.\n\nIf I can't love these people and I can't love myself how the fuck could I ever love anyone? These are great people that would sacrifice and have sacrificed great things for me and yet I still can't pull myself to feel anything for them. I can't pull myself to feel anything really. I feel so fucking dead. I wanna line my exhaust pipe to the back window of my car but if I did then mom might get sad and dad might get upset.\n\nMaybe a call was just a bad medium to talk over but today just isn't great for me. It got a little worse in the realization that, thanks to taxes, my plans to run away are damn near impossible if I either don't want to work 15 hours a day or am unmarried, and, based on my emotional situation, I doubt that last requirement is bound to happen.\n\nThe more I live the less I want to. I want to tell my school counsellor about these thoughts but I feel like suicidal thoughts crosses the line of what I'm allowed to talk to one of them about. I want to talk to my friends about it but I know that one of them used to be in a constantly panicked state when another friend told them they wanted to kill themself back in middle school, so I'm lost.\n\nI think I might try that crisis text line sometime later tonight. I don't know. I can't love. I don't know what the hell I'm supposed to do. It doesn't seem worth it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/m7f4v3/i_regret_trying_today/", "title": "I regret trying today.", "social_network": "reddit", "user": "Lostmyalt9120", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 15, "down_vote": 0, "creation": 1616028296, "permalink": "/r/SuicideWatch/comments/m7f4v3/i_regret_trying_today/", "nsfw": false, "first_save": 1635428254.6315343, "replies_charged": false}