{"id": "t5_2qpzs_t3_p736u0", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "Life has never been good to me. I grew up in poverty, born to a 16 year old mother. My brother was born when I was 5 and for some reason my mother always loved him and hated me. \n\nBut thats ok things will get better\n\nI lived in numerous homeless shelters as a child and lived in poor, gang riddled areas\n\nBut things will get better\n\nI witnessed severe domestic violence growing up and was brutally abused as a child, along with my brother \n\nBut things will get better\n\nWhen my mother got tired of taking care of me, she would toss me to whatever relative would take me. Then when she had no choice but to keep me, she allowed my step father to use me as a punching bag\n\nBut things will get better\n\nI was always a below average looking woman, graduated college with mediocre skills and grades. Worked 5 years working with child protection but the stress burned me out, put weight on me and lead me to develop thyroid issues, ovarian cysts and aged me 10 years. I have also struggled with severe insomnia for the last 10 years, so that can't help appearance wise. I can't even get good sleep to take my mind off things. \n\nBut things will get better\n\nMy brother was murdered at the age of 17, meanwhile the people who abused us are alive and well\n\nBut things will get better\n\nStarted my graduate degree in 2019 but the pandemic put that on hold. Now I'm blending smoothies and washing dishes for a living. Im back sleeping on my mothers couch, the same woman who can barley take my presence. She chains smokes around me, even though she knows it makes me sick.  She threatens to get my cat put to sleep because she is tired of the noise she makes at night. But I have to deal with it because I have nowhere else to go. \n\nBut things will get better. \n\nI can't talk to friends because they get tired of hearing about it. I lost friends before due to my depression\n\nI have no purpose, no will to live, no beauty, money, skills or hope. Nothing but debt and a lousy job, and crappy house. Binge eating is the only thing that makes me feel slightly better. I lie around catatonic most of the time. People can see the stress and despair on my face but I have no health insurance to find a good therapist, medical or dental care\n\nBut things will get better. Its been almost 33 years. They aren't getting better. Im single, no marriage, friends or kids. I have no reason to live. \n\nIf I had a method, I would kill myself for sure. I can't live much longer like this. I wish I had access to a gun.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p736u0/im_tired_of_people_saying_things_will_get_better/", "title": "Im tired of people saying things will get better", "social_network": "reddit", "user": "Imblue_65", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 14, "down_vote": 0, "creation": 1629330198, "permalink": "/r/SuicideWatch/comments/p736u0/im_tired_of_people_saying_things_will_get_better/", "nsfw": false, "first_save": 1635426561.553869, "replies_charged": false}