{"id": "t5_2qpzs_t3_dbdshl", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7", "ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I am 30 years old and most times I feel like an ancient walking corpse. I've just been through so much shit in my harsh life that has beaten me down and twisted me into something ugly and broken that I never wanted to be. I can't even recognize myself as a human being who was once an innocent child who had a soul anymore. I've been dead inside for so long and so spiritually sick and diseased in the head that I long ago became something inhuman and monster.  Something blasphemous and beyond redemption.\n\nI lost the girl I loved because of my own inadequacies, weaknesses and failures as man. I felt the cold knife of betrayal twisting painfully in my guts. The haunting phantom of my dearly beloved's unfaithful infidelity plaguing my every waking moment and cursed dream during fitful sleep. The suffocating stranglehold of crystal methamphetamine addiction and severe alcoholism are like powerful, brutal hands crushing my bruised and battered throat. Stealing my breath and depriving me of oxygen. I am drowning in a bitter ocean of self-loathing and self-hatred. I am the brooding king of self-destruction. I kill myself slowly in so many creative and increasingly twisted ways. I mutilate my flesh with knives and razor-blades. I am an artist of my own demise. I bleed until my flesh is ghostly pale and my vision becomes blurred and dimmed. I bleed until dizziness and coldness shock my bones with icy electricity. I poison my body with caustic chemicals and vile filth. I am covered with scars that turn purple in the moonlight like the gravestones of lost love- Grey Obituaries to the death of romance.  I descend into delirium and lunacy through forced sleep-deprivation. I hallucinate evil, faceless banshees that pursue me like bloodthirsty and rabid vicious astral- winged beasts in the barren and howling night. My sanity is raped and destroyed. Hanging by a ragged thread.\n\nI can't do the hope thing anymore honestly. It's too painful to bear any longer. Hope torments me more than anything else ever has because for me it's such a mocking lie. There is no future for me.  Tomorrow is painted black and the tomorrow after that is even more bleak. A cemetery of ash to choke upon. No dramatic and touching story of redemption in store for me. No magical fairy tale ending for me where I fall in love and live happily ever after and I've honestly come to accept that. It's time to stop tormenting myself with childish fantasies and face the grim reality of brutal truth.\n\nThe cold stark truth is that not everyone can be happy and I know I am one of those people who will never be happy. It's simply not in my nature.\n\nTo me this bleak fate is tragic but the objective reality of the matter is that to nature and the universe my suffering is completely meaningless.\n\nTo me this life is not a gift but a curse and a vile punishment. I never wanted to be born into death but here I am condemned to this prison of bone and flesh. Sentient and conscious in a godless and meaningless universe without purpose or meaning. Sentient, conscious and hopelessly imprisoned in a cursed mind and defective mentally ill brain for what fucking reason Goddamnit? What reason other than to fruitlessly despair over my doomed and forsaken lot in life. Agonize over my terminal incapability and tormenting inability to feel the smallest shred of joy, happiness or contentment and the cold hard fact of my own inescapable mortality and the inevitable bitter end of all things. I feel like humanity is an abomination of nature and a fatal mistake of evolution. I don't believe any living organism was ever meant to possess this horrendous magnitude and scope of agonizing self-awareness, conscious spiritual suffering and depth-less levels of emotional pain. The torturous complexity and endless planes of consciousness and sentience suffered by mortal human beings is truly a sadistic cruelty far outweighing the rare and fleeting beauty within the chaotic maelstrom of the indifferent universe. A single rose buried in a predatory cosmos of venomous, fanged arachnids and fork-tongued serpents.\n\nI think this is the end of the road for me and the final chapter of my ghastly story. It is time for me to surrender to the grim reaper and his sharp silver scythe come to harvest my corrupt, rotten soul.\n\nSure, I could continue the uphill battle that is destined to defeat. I could continue struggling in vain to swim upstream and fight against the cruel machinations of fate which will surely and without a doubt mangle my flesh into mutilated mincemeat despite my most valiant acts of resistance. I could continue the exhausting tooth and nail fight to try to grow as a person and be strong and overcome all my personal demons and attempt against all odds to find meaning, purpose and satisfaction in my life but the truth is I don't have even close to the amount of willpower, energy or discipline that would be required for that type of herculean struggle and miraculous victorious transformation. I am drained of all my vitality. I am spiritually crushed and my broken mind is in ruins.  Why keep lying to myself? My time is up. I failed. I lost. Game Over. I fucking quit. \n\nI simply don't have the capability to change and grow as a person. I am vacant and empty of the virtues required for personal character growth. I am programmed to self-destruct and I've desperately tried hundreds of times to change my malicious programming all in vain. The hellish virus continues to infect me to the very core. Spreading it's lethal cancer into my aching, tired bones. I am a terminal patient and victim of my own neurotic curse. My life expectancy is dropping fast and will be buried and forgotten below. I have an imminent wedding with infinite oblivion. The totality of zero and the eternal sucking void of nothingness seductively calls my name and beckons me towards the abyss and I slavishly obey it's deathly call.\n\nI lie in bed at night restless  and without sleep. Staring at the silver stars of the sky which burn like sharp and treacherously jagged soulless orbs of cold plasma and stab like cruel celestial knives into the whites of my eyes. I am forsaken and alone in this howling and barren night. I fall into seemingly endless escapist fantasies about the bizarre and calming darkness of death and the profane netherwordly freedom it would surely bring.  I romanticize the cosmic force of death as the avenging liberator of this earthly dungeons bleak purgatory and as the final destroyer of the conscious cruelties of burdened humanity. Deep into the morning hours I contemplate the total obliteration of sentience and erasure of consciousness. The complete and total perishing of the soul. Not even a trace of a forgotten ghost of antiquity or a single ash from a candle burned millenniums ago in solitary ritual but a silenced whisper that was never once even breathed into quiet being. The disappearance of existence lusting after the promised silence of eternity.\n\nSuicidal ideation has become a soothing lullaby and tranquil melody for me during these oppressive nights of silence which wound and bleed my soul and psyche with a monstrous  blood-lust and inhuman greed. The Day of the Rope inches closer and closer and I can almost feel the flames of apocalypse warming my coffin-hungry flesh. I can almost taste the glorious finality of cold gun-metal on my lips. The serene silence of the nocturnal doom-laden forest and soft chirping of crickets as I close my eyes and take my last earth-bound breaths, placing the barrel of the shotgun to my skull in my final place of rest. The forbidden hope is just within my reach.\n\nI  take grim solace in the fact that at any moment I have the power to decide to permanently leave this horrible, miserable place and disappear from this tortured mortal coil forever. I don't have to slowly kill myself, self-destruct and painfully decay anymore. I can simply choose to take the final exit in one glorious blast. The comforting feeling of cold steel on the roof of my mouth before the blinding flash of pain that releases me once and for all from this cruel and tragic mortal game.There is something strangely liberating about surrendering to the bitter struggle and lying down to die.  Abandoning the hopeless fight for the pipe-dream of a higher destiny and accepting the end of the road without anymore tears. A bittersweet comfort in the pathetic act of crawling into a hole to wither and die like the wretched broken man and spiritual cripple that I am. I plan on killing myself during the winter in late December. Shortly after Christmas day and before the dawning of the new year of 2020 I will commit suicide. I can't take another year of suffering. My blood will look enchanting and pretty painting the crystalline snow in deep crimson.\n\nOn this morose and defeated note I end this piece of lamented writing on this cold gloomy morning with a certain few quotes that came to mind from the brilliant mind of my favorite German philosopher and fellow tortured soul and they are as follows.\n\n\"The thought of suicide is a great consolation; One can get through many a bad night with it\"- Friedrich Nietzsche\n\n\"Hope in reality is the worst of all evils because it prolongs the torment of man\"- Friedrich Nietzsche", "url": "https://www.reddit.com/r/SuicideWatch/comments/dbdshl/wired_to_selfdestruct_rapidly_digging_my_own_grave/", "title": "Wired to Self-Destruct. Rapidly digging my own grave.", "social_network": "reddit", "user": "MisanthropicLycan", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1569859616, "permalink": "/r/SuicideWatch/comments/dbdshl/wired_to_selfdestruct_rapidly_digging_my_own_grave/", "nsfw": false, "first_save": 1635422551.484844, "replies_charged": false}