{"id": "t5_2qpzs_t3_o9xa57", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "I’m in absolute fucking hysterics right now. I can’t keep doing the same bullshit of struggling over and over and over and over and just think “well that’s just life!” Then I really don’t want it. Is this even the right sub to talk? I don’t care I just want my thoughts out there and I’m already expecting this shit to be taken down. \n\nMy mom had me at 14 to my 35 (maybe older) year old father. My earliest memories where finding dead rats in my bed and groups of men in bed with my mother before being taken away by my sperm doners cousin. She wasn’t any fucking better either. She let her son molest and rape me ever since I got transferred to her until she divorced her husband (because she was violently abused towards him, like I remember her stabbing him with scissors and pouring bleach on his head during an argument) when I was 12, me and my bio sister went into her custody and my brother to my dad. Constant fighting and yelling and speeches  about “oh honey you’re the reason for my divorce!” And only finding beer in the fridge and not food so 12 year old me was horribly underweight but she would tell doctors that “I don’t eat she probably had anorexia” despite me starving for any bit of fucking crumbs I can find. \n\nSend nudes to older men at 14 because having just the SLIGHTEST bit of positive attention made my whole world and become a horrible addiction for me. Easily had dozens of conversations on kik as a simulation for attention I’m never going to get. The bitch cousin found my tablet and saved all the photos to show to the family and cry about being a failure. One time we were throwing a party for her boyfriend at the time and she comes bursting through the fucking door “HOLY SHIT EVERYONE THE FBI IS COMING BECAUSE OP SENT NUDES TO OLDER MEN AND ARE COMING TO ARREST HER” In. Front. Of. Everyone.  She made sure to tell her coworkers, her friends and as far as to tell my friends in middle schools moms what I was doing so nobody wanted to associate with me.\n\nKept to myself in high school because every attempt of a friend I had my mom would swoop in and tell them I’m too shitty of a person I was and to steer away! Started dating this classmate senior year who was also in a terrible family situation and the cousin said he could live with us without asking for my permission. Fast forward to him getting married to another woman  behind my back and had TWO kids without me noticing. So I kicked him out. Cousin would be in my face “oh you’re so naive! How do you not know anything?!” And would call her friends about what my ex did to me and they’d laugh about being so ignorant. When my sister turned 15 she kicked her out for wanted to be sexually active in a safe way and shamed her and then sent her to my dad. The cousin would tell me E V E R Y T H I N G about her day and would actively ignore me when I wanted to get something off my chest so I learned to shut up. \n\n“Oh my boyfriend called me a dumb bitch and to kill myself :( boyfriend sent me pictures of him cheating on me because I yelled at him :( boyfriend says he likes to do these things during sex, can I have some money to buy these toys?” That’s literally ALL she would ever talk about to me. That and how all the men at work want to sleep with her. And she did. And then she would complain about how they performed in bed. Then, she pulled out a Lingerie set and with a sort of fondness in her voice “these were the underwear I wear when I was seeing so and so behind (dads) back” I lost my shit HORRIBLY. and surprised! I got kicked out. \n\nMy dad took me in and I tried to do adult things for once. Everything was going ok until my biologicals started reaching out to me and I’m having horrible breakdowns again. My bio mom reached out first so I decided to go visit her as she was only a state away (about a 35 minute drive) drank with her only to have her brother start molesting me saying “your mom used to bend over for me as kids….maybe we can have that fun again!” Got horribly sick so fucking sick and ran away. Turns out she is a prostitute with drug addictions and 9 other kids with only two sharing the same baby daddy.  Now I have my bio dad reaching out to me saying he’s terminally ill and wants to reach out to me but I’m so done. I don’t want to keep doing this. I just want a fucking break for once and so tired of being angry and stressed out all the fucking time. Please.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o9xa57/so_fucking_sick_and_tired_of_struggling_ever/", "title": "So fucking SICK AND TIRED of struggling ever since I came out of the damn womb and I just want to stop….I just want it all to stop….", "social_network": "reddit", "user": "Throwaway_bbluee", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1624927134, "permalink": "/r/SuicideWatch/comments/o9xa57/so_fucking_sick_and_tired_of_struggling_ever/", "nsfw": false, "first_save": 1635422267.42418, "replies_charged": false}