{"id": "t5_2qpzs_t3_ow7trm", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "Hey all.   \n\n\nFirstly, would like to say I appreciate all of the bravery that everyone here has in waking up every day. And all the insight and guidance that this community provides. I've only lurked a bit, so please forgive me if these questions are redundant, as I am sure they have been covered many times in a support-oriented group like this.   \n\n\nI don't know what else to do and I don't have anywhere else to turn. I've been struggling with this stuff since I was probably 12 or 13 (about to turn 30). All throughout I have made what I refer to as passive attempts on my life through intentionally reckless choices and substance abuses, all the while resigning myself to something finally taking me away from here. In my mind I have always assumed I would kill myself eventually, and that it was not a matter of \"if\" but a matter of \"when.\" I had resolved to take matters into my own hands and end it about 8 years ago, made my peace with people and said my so-called \"goodbyes\" only to stick around because I had found some decent distractions that took me away from the pain for a while. Things were definitely better, and I have been very proud of myself in keeping around. Even in light of those distractions, I've still been fixated on getting out. The only thing I ever think about anymore is the end - it's been the primary thing in my life for so long and I just can't fathom being alive much longer. Every day, it's the forefront of my thoughts, from the time I wake until I eventually pass out. I have people that I love dearly, and even the thought of hurting them doesn't motivate me to stay topside anymore.   \n\n\nCovid has been especially hard for me - I've been separated by an international border from my fiancee for the better part of a year and a half, my closest family is ten hours away (and we're on better terms than we used to be but still somewhat estranged), all of my creative outlets were put on permanent hold, several people close to me have died this year, and I have been leaning especially hard into my addictions as my means of escape. I am a really awful alcoholic and in a service industry job that facilitates a lot of extra-curricular drinking. I can feel my body breaking down. I am so tired.   \n\n\nI'm not sure what I am looking for. I am not religious and I don't want this to become a religious conversation because that does not comfort me. I guess I would like to know what keeps the rest of you going when you're in the absolute depths of it (and recognizing that this shared experience has been absolute havoc on everyone, to their own personal degrees which I will never fully comprehend). I genuinely don't want to give up just yet, because I feel like there's nothing left for me to lose (and I actually see that as a good thing).  My mindset has been that if I stay alive and keep enduring all of this, it's pain that I'm used to and therefore can tolerate, but if I end things, yes, it's release but that's finally it. That's all. But in the past I have felt enough fringe \"optimism\" to want to tough it out and increasingly I don't see the point. Instead, I increasingly fixate on the immediate release, or even worse (to me), I imagine a life where I actually make it out and things get happy and then eventually I lose the people that I care about one by one each year to the void. So, what do you all do to distract yourself when you're in the trenches?   \n\n\nNothing but love to all of you, no matter where you are or what you're going through.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ow7trm/just_wondering_what_you_all_do/", "title": "Just wondering what you all do", "social_network": "reddit", "user": "tramhamck", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1627880340, "permalink": "/r/SuicideWatch/comments/ow7trm/just_wondering_what_you_all_do/", "nsfw": false, "first_save": 1635428093.528754, "replies_charged": false}