{"id": "t5_2qpzs_t3_mh6uzm", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "Hello. I would want to express how I'm feeling all this time.\n\nFirst of all, I apologize if my English is not good in general.\n\nA little background, I am a middle child. I lived in an certain asian country, in which I grew up with a strict parent. They were using violence as a punishment of my wrongdoings. And long story short, I didn't feel like I received enough attentions from anyone. it feels like I lived in my bro's shadow and my sis' most hated person. It was rough for me, because simply, my dad almost blamed me for everything. All of these things made me think that I have no self worth and I don't even care if I am dead or alive.\n\nUntil I met a person, a partner. We're not currently married, but this relationship... is actually taboo in my country. We love each other. It's just, I feel like I hurt him more than I could imagine. I kept making the wrong choice and mistakes over and over again. He said that I dramatized almost everything, and I think he is right. I wanted to discuss a problem, but when I do, it turns out to be a drama in his eyes. Probably in the others' side too... and I feel really, really, really bad about it. I keep apologizing to him and i just want us to live happily but.. honestly, i don't want him to be sad. I want him to be happy.\n\nI personally think all of it is a big misunderstanding. Purely though, in others eyes, it is indeed my fault. My brain is just simply too stupid. I am stupid, inconsiderate, uncapable of being a decent human.\n\nI promised my partner not to be suicidal. He said he would be sad if I'm gone. I believe him. I'm appreciating his thought. But in the end, I still feel... suicidal.\n\nDon't get me wrong. I love him genuinely, and I would want to spend my life with my partner.\n\nBut is it worth living, if I keep mkaing the same mistakes over and over again...?Do I worth to breath, if I keep hurting others?\n\nMy partner is going to be sad if I'm dead. but in the end.. I'm so selfish, am I not...?\n\nI don't know, man.. I feel like shit and so stressed about making the same mistakes over and over again. I just sometimes don't care about this world and want to let myself be free, let others be happy..  \n\n\nThank you for reading my story. Any comments are really appreciated. I desperately needed some advices from someone..", "url": "https://www.reddit.com/r/SuicideWatch/comments/mh6uzm/i_have_no_will_to_live/", "title": "I have no will to live", "social_network": "reddit", "user": "meesok", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1617199604, "permalink": "/r/SuicideWatch/comments/mh6uzm/i_have_no_will_to_live/", "nsfw": false, "first_save": 1635428434.9479382, "replies_charged": false}