{"id": "t5_2qpzs_t3_iv29kl", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I don't think I'll ever actually kill myself. Partly because I'm a coward and partly because of how much i love my kid and I'm all she's got. Her life shouldn't be ruined because mine sucks, she didn't ask to be here. But there are days like today where I wonder why else i should keep breathing. My family is nuts, just a bunch of paranoid, selfish, narcissists. My younger brother being the exception but he's got so much of his own stuff to deal with. My friends don't actually know me at all. Not for a lack of trying on my part, they just don't listen when i talk. I'm their shoulder to cry on and they don't do the same for me. Some friends right? But they're all i have. Not a lot of chances for a single mom making near minimum wage to hire a babysitter and go make friends. I can barely survive as is. And my job? Well the work itself is fine but the people are terrible. Myself and others have been bullied for years. They almost exclusively promote males only. I just got passed over for a 19 year old boy that *I* trained who's been there a month and a half when I'm going on two years. There was a girl who got held against a door and threatened by a guy in front of a camera and witnesses and they didn't fire him. They even considered promoting him a couple months after and nearly fired her because he continued to harass her in and out of work and she became depressed. Until he verbally threatened a male manager and his kids. Then he got fired immediately. But i can't leave. No where decent where I live will hire a single mom with only fast food experience. I've looked and i keep looking. So here I am. A single mom of a handicap child. Eking out a lonely existance in my own personal hell. I keep hoping one day soon it'll get even just a little bit easier, because there aren't words for how tired I am of this life.", "url": "https://www.reddit.com/r/SuicideWatch/comments/iv29kl/im_so_tired/", "title": "I'm so tired", "social_network": "reddit", "user": "Maddy1515", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1600417778, "permalink": "/r/SuicideWatch/comments/iv29kl/im_so_tired/", "nsfw": false, "first_save": 1635427176.4350986, "replies_charged": false}