{"id": "t5_2qpzs_t3_pafkjf", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "I used to keep my passive suicidal ideation a secret. Until mental health became less taboo to speak about. \n\nEverywhere I see people share things like \"I'm here for you if you need someone! Your life matters to me! #SuicidePrevention\"\n\nWhat makes them hypocrites is, if you're honest and open about your thoughts they ignore it & basically accuse you of \"being an attention seeker\"\n\nAn ex best friend of mine burnt her bridge with me when I said I had written out a letter to say my goodbyes. \n\nShe looked at me and said \"Oh, are you gonna mention me in it too?\"\nI asked her why she would even ask me such a thing.\nShe goes \"yeah, well people who are suicidal don't say they are going to commit, if they wanna kill themselves they just do it, they're not going to say \"hey, I'm gonna kill myself!\"\n\nWhich I was literally begging and crying and pleading to her to PLEASE HELP. All I needed was for someone to hold me tight and tell me that I mattered. \n\nAll I ever hear about with me being open about Suicide is that I'm an attention seeker or I'm not really suicidal I'm just saying it because it's trendy and sounds hard-core.\n\nThese same people still to this day claim to be a safe haven of support for people struggling with Suicide and I've just absolutely had it with them. It makes me sick. Don't pretend to be an ally and accuse those coming to you for help for being dramatic or not really wanting to die.\n\nWe don't want to die. \nWe want to stop hurting. \nWe want the misery to end & to us....death feels like it's the only option.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pafkjf/a_good_majority_of_people_i_know_are_such/", "title": "A good majority of people I know are such hypocrites", "social_network": "reddit", "user": "throwwawaytrashpanda", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1629776548, "permalink": "/r/SuicideWatch/comments/pafkjf/a_good_majority_of_people_i_know_are_such/", "nsfw": false, "first_save": 1635428429.204499, "replies_charged": false}