{"id": "t5_2qpzs_t3_kd8nnb", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "I mean it, I just want to be smart as a normal person, I want to not be socially inept like a normal person, I want to be human. I don’t feel like a human being. I’m a moron who can’t process simple information easily. Especially with responsibility on my back. I procrastinate until the end like the pathetic loser I am. It makes things worse now that im a senior about to graduate and I don’t know what I want to do. Options are more limited because I’ve been inept with mathematics my entire life. Just last year I became comfortable with adding, that’s how pathetic I am. I don’t know what’s wrong with me something’s missing in my brain and it hurts not being able to articulate well enough for others to understand. It took me several days to just write this out because I didn’t know how to convey my emotions because there’s  too much information that I didn’t know where to start. I give more than I have, sure being a friend is a job and you sign up for it when you reach out to someone. I only want comfort from certain people and that makes me feel like a scumbag; I guess it’s because no one understands me except for 1 person. Even that person isn’t as connected with me as I thought. I feel so alone, avenues are closing, doors are being locked and I’m going to be left slowly bleeding with the freezing atmosphere holding my cold body. I just want to die and have everyone forget me because I know for a fact everyone will get over it within a day or two. I’m too much of a coward to kill myself and I hate it, why can’t I carry on with something for once in my life. I just want to have one person I can talk to, one person I can connect with emotionally, one person who will look at me and say I understand you and won’t just blow me off acting as if I’m lazy on purpose and depressed on purpose. “You put yourself down” of course I fucking do, you don’t know how it is to wake up everyday with dread on your mind and not being able to make progress on things that are important. You don’t have a fucking clue how it feels like being restrained by your minuscule fucking brain. If anything I’d rather have my life taken by something. Maybe I am being selfish and maybe I dint know what I wish upon myself, but look at all my inhibitions and tell me if I’m worth living. There’s a legion of people around, but not one person even understands. I say dream constantly because I’d rather daydream than acquaint myself with reality. I’m too tired to move on, I’m sorry.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kd8nnb/why_cant_i_be_like_everyone_else/", "title": "Why can’t I be like everyone else", "social_network": "reddit", "user": "Any-Math-783", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 46, "down_vote": 0, "creation": 1607986321, "permalink": "/r/SuicideWatch/comments/kd8nnb/why_cant_i_be_like_everyone_else/", "nsfw": false, "first_save": 1635426413.4735467, "replies_charged": false}