{"id": "t5_2qpzs_t3_9h6stz", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "I have been suicidal for a couple years now. Have had an attempt here and there. And have also been admitted to a youth psychiatric institute.\n\nI was there because I am psychotic, have HPPD, DP/DR, and since then some other stuff but that's besides the point. \n\nIt wasn't like most psychiatric institutes. If you had a talk with a psychiatrist or psychologist you woulnd't sit in a white room with a clipboard, but we'd play pool, basketball, or smoke a cigarette together.\n\nI was 15 at the time. I was already fucked in the head, but after a faux XTC overdose in school I got a lot worse, and it had repercussions I will face every living day. I was facing a lot of scary stuff, stuff that will never pass as long as I am alive since all those problems are rooted in my HPPD. My life was changing and scary and my friends, parents, girlfriend, and even psychologists didn't understand what was going on with me. I was so scared and alone.\n\nI thought of killing myself frequently, and for the same reasons I still do. \n\nSo I got admitted to the institute, visited 2x a week for a couple hours. Initially my suicidalness was off the table for treatment. Until my girlfriend left me for someone else after 1y2mo together. I was angry, sad, and confused. But mostly scared, as the person who understood me the best left my life. I was mourning.\n\nAfter lunch at the instutute I stepped to one of the psychologists and asked her if we could talk a bit. I told her that I think of suicide a lot. We talked a bit to see how badly I was doing. We decided it would be a good idea to immediately step to my head-psychologist and start a trajectory to treat it and talk about it.\n\nA few weeks later I was talking with a different psychologist outside, and we talked as I bumped a cigarette off of him.\n\nI can't remember exactly what we talked about, but it wasn't the most cheerful thing. I do remember a silence, which he broke with;\n\n\"My sister, like some people here, is very depressed and suicidal aswell. She calls me a lot at random hours in desperation saying she will take her life, after which I have to spend a couple hours on the phone with her to talk her out of it. This can be during office hours, or night hours, at any time really. I am not proud to say that I eventually grew tired of it, and am even less proud of what I told her when she called me again. I told her to just stick to living for 6 more months, and if it didn't work out I would help her find a peaceful death. I was feeling guilty at first, but I decided to leave it as she finaly felt like she was being understood. A couple months later she showed massive improvement, and was doing a lot better. I suppose that that ultimatum just gave her an exit, and when she had an exit she felt less inclined to leave.\"\n\nThat stuck with me. I am 18 now, almost 19. I think of suicide by the day. I have a pact with my girlfriend that on my end just means 'don't kill yourself'.\n\nI am Surrounded by agony,\nsurrounded by confusion,\nand surrounded by catastrophy.\nSurrounded by anything but death and that's how I know death is the only way out.\n\nI know it, and I can feel it that when I die it is of suicide.\n\nBut there is an exit and as long as that exit is there, I won't feel as inclined to leave. Because sometimes when there is an exit, the only thing that leaves is your urge to leave.\n\nI suppose everyday I live to die another day.\n\n\n\nI sincerely thank you and applaud if you read it all the way through, and I hope you got something useful out of all of this\n\n", "url": "https://www.reddit.com/r/SuicideWatch/comments/9h6stz/sometimes_when_there_is_an_exit_out_of_life_the/", "title": "Sometimes when there is an exit out of life, the urge to leave is the only thing that leaves", "social_network": "reddit", "user": "Yungsleepboat", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1537375527, "permalink": "/r/SuicideWatch/comments/9h6stz/sometimes_when_there_is_an_exit_out_of_life_the/", "nsfw": false, "first_save": 1635427778.4290874, "replies_charged": false}