{"id": "t5_2qpzs_t3_ar8jlm", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "Hello! This turned out a lot longer than I expected. If you get a chance to read it, I’d really appreciate it. :)\n\nSo,\nIve been on the antidepressant effexor from 2011-2013 (age 16-19) I suffered from an array of side effects, but didnt realize it and I thought I was just lazy, stupid (brain fog), unappreciative, and incompetent.\n\nBy the end I got full blown anxiety and panic attacks and a lot of rapid heartbeats. Again I thought this was my fault and I was just mental. \n\nI went to a psychiatrist in South Korea who prescribed me xanax 0.25, seroquel, citalopram, and two other tranquilizers for 3 years. I couldn’t function or think at all but again, I thought this was because I was lazy and stupid. \n\nI became increasingly suicidal and hated life to no end. Never blaming the drugs but I always felt like it was my fault. I’m just a fucking negative person. No one in my family blamed the drugs. They saw me in bed for weeks at a time without eating and my grandpa asked my mom, “does she have a terminal illness?” Which my mom replied, “its depression.” \n\nNo it wasn’t. The drugs were knocking me out. \n\nNothing I did brought me any joy so I was drinking all the time. I blacked out every time I drank because I was mixing and managed to get raped on the street by a guy I was drinking with. But it was my fault for drinking so much. \n\nAnother psychiatrist I was seeing through university told me to cold turkey the 5 meds in January 2017. I went through hell on earth and went back on effexor. \n\nIn March 2017 I kept throwing up and I suffered GI bleed so I went back to Korea for treatment from a Chinese medicine doctor. During this time I had trouble sleeping (to say the least), thinking, doing anything, my head was always burning hot and my extremities were always freezing cold. The Chinese medicine doctor I was seeing at the time advised me to quit the effexor too so I CTed in 2017 December. \n\nIt’s been 1 year off all meds. \n\nDuring this time, I had a really bad nervous system imbalance, couldn’t sleep no matter what I did. I could sleep maybe 2-4 hours. I lost the ability to use my arms and some body parts still feel numb- especially the abdomen. If I hold something for a long time or stay in a certain position, my hands and feet would get numb. I had trouble breathing - no matter what I did my breath would never go down to my abdomen. I couldn’t digest anything, I would get bloated from just water, like my stomach was frozen. My shoulders and neck muscles were frozen “upward” in a startled position too. \nIt was so bad. When I tried to sleep, right before I would “drift” to the stage of sleep, a muscle in my leg or arm would jerk by itself and force me awake. This went on for months. When I did manage to fall asleep, I would wake up gasping for air with my heart beating like crazy. \nThroughout even this, it took me a long time until I suspected the drugs and I even managed to convince myself that I was experiencing this trouble sleeping because my psychological state “knew” that I was lazy and didn’t achieve anything so it was waking me up because I didn’t deserve to rest.\n\nI tried to live a normal life and tried smoking weed and drinking alcohol and every time I did I felt like my chest tightened up and I couldn’t breathe. \n\n\nI saw a cranial osteopath who does biodynamic osteopathy. After a couple sessions, my breathing, digestion, frozen shoulders and sleep have gotten a lot better, but there’s this other problem that won’t get resolved. \n\n\nThere’s this part in the back of my neck, it feels like the spinal cord. It feels like it pulls all my muscles to that part. So my neck wants to tilt backward and the chin wants to point up to the ceiling. It also pulls my jaw back. It’s like clenching but not up and down clenching, it forces open the mouth and pulls the jaw back towards the throat. \n\nIt feels like my neck is stuck in a forward head posture. When I try to straighten the back of my neck, it feels like it pulls on the scalp, nose, and face. I know my scalp is really tight because when I comb through my hair with my fingers, it really hurts my head to move my hair in a different direction. \n\nI can feel the back of my neck and spinal cord vibrating like it has its own pulse. And sometimes, my jaw spasms like someone in a cartoon that’s really scared and has a jittery jaw. That would happen except it would be more like jittering then the jaw would get stuck at the farthest position it could go to the right side, and vice versa. It’s a really scary thing to experience. \n\nBack in September, doctors convinced me I was depressed and I tried taking effexor 25mg (lowest dose) and my neck was STUCK in the position I described to you and the muscles in my jaw were pulling back so hard that it felt like I could crack my teeth with the strength of the muscles. \nThen I got prescribed muscle relaxers.\n\nBut I cant talk more than a couple sentences anymore without my muscles shifting me to this messed up head and shoulder position like a dinosaur with neck problems. My eyes and mouth get dried up and my skin (face and scalp) looks like its getting pulled back by something and its really tight.\n\nThe jaw pulling back still occurs and when I press on the muscle below the ear behind the jaw, it hurts like hell. \n\nI don’t know if what I’m going through is the result of change from the drugs or because of TMJ. \nI’m getting treatment for the TMJ with a palate expander that expands the upper jaw so the lower jaw can sit forward. \n\n\n\nBut if this is happening because of change due to the drugs, I know that I’ll need to kill myself. \n\nPlease fucking help me someone.\nSomething fucked up is happening and NO ONE can tell me what’s going on. \n\nI’m only 24 years old I was a model and a university student before all this. My asian family has basically abandoned me throughout this. I can’t even work because noise feels like it’s drilling through my skull. The papers I write for school look like it’s written by a lazy middle school student. My cognitive function is so bad. I used to be smart, in student council, a model (5”9 and 120lbs, thick black hair, thick eyebrows with long lashes, big eyes, pale skin, and lips shaped like a heart, ballerina lean body.) people would say I’m gorgeous. But I had the lowest self esteem and I was filled with self hatred. When I quit the drugs, it was because I wanted to stop the degenerate life and start enjoying myself and taking on responsibilities. \n\nTurns out, I could do so many things I never thought I could in the past- like cooking, taking care of bills, going to places alone. Even when I was basically shutting down from the physical changes in my body. But it’s too late now. I don’t think I’ll be the same as other people anymore. I wouldn’t even be myself anymore. I can’t even socialize without running out of breath from saying a couple words. \n\nIf this can’t be solved and Ive gone through permanent changes someone please help me  be okay with dying. \n\nI blame myself for all of this. I should have known better. I should have questioned the doctor more. I was afraid to question him. I should have done my own research. I should have just sucked it up when I was emotional. I was being overdramatic. I should have loved myself more. I should have been more grateful for what I had. I didn’t realize how good I had it. What I could have done. \n\nI’ve been researching about the concept of free will in hopes of making peace of all that’s happened. I want to blame my past, I want to blame my parents, but I don’t think it’s their fault. \n\nEven though as a child \n• most of my freedoms weren’t respected (what I would be allowed to wear, not being able to close my room door, not being able to see friend without begging my dad for days, talking to friends on the phone, etc).\n• In the first grade I would have to face the wall and memorize multiplication tables for hours. If I moved positions, my father would threaten me.\n• I would get hit with rulers as a child. Then as a preteen my dad would tell my mom to “go to her room” and sit in a chair while I kneeled on the floor. He interrogated me for 6-8 hours and slammed my head with his hands occasionally. I called my mom for help and he would say, “your mom’s not coming to save you.” \n• my parents would fight for hours at a time while I hid in closets or laundry baskets. I would go to bed hungry \n• my dad would watch extremely violent R rated movies as a family.. I still remember really gruesome scenes I’ve seen as a 6 year old. \n• when I went out with my friends, I would be followed to make sure there weren’t any boys. If there were, my dad would flip. \n• my dad threatened to kill us all \n• when my father left when I was 13, my mom took out her anger on me. She complained about everything, she called me a whore and useless. When I acted out, she said I had contaminated genes and dirty blood from my father. She commented on all my friends, calling them whores or ugly. \n• I never hear my mom say nice things about people. She would look at a model and comment on her eye wrinkles. \n• my mom used me as a therapist since I was 6- after her fights, she came to me to complain. When I finally told my grandma about all the things that happened, she said she had no clue because my mom didn’t say one thing to her. But she told me, a 6 year old, everything.. \n\n\nThere’s more but I have no energy to get into it right now.\n\nI guess these incidents really caused me problems without even realizing it. I was always getting into abusive friendships or being the abusive one in the friendship. Which continued to relationships. I would catch myself doing the things my dad or mom would do to me to other people. Then feel extreme guilt and self loathing. \nI wish I could love someone in a healthy way because all I want to do is love but I sabotage every relationship. I also have a deep hatred for them and myself that comes out in sadistic ways. Yet I love them more than I can ever love myself and never want them to leave me. \n\nBut why am I such a fucking victim. There are people worse off who go through worse things. And I made such a big fucking deal about them and fucked myself over instead of trying to make things better.\n\nEven if I realize all this now, I’ve caused myself physical changes on top of everything. \nIt’s unfair to hear from therapists to just stick it through and live, if this physical change is permanent. Doctors all deny that this could have been caused by the meds and just prescribe me muscle relaxers and antidepressants.\n\nI’ve been trying to accept having to die by studying on the topic of free will. I’ve looked back on every single choice that’s led me to this point in time and am really trying to accept dying. Even if I live, it won’t be much of a life. I’d only have the ability to say a couple of words at a time, have to take it really easy at all times, I wouldn’t be able to be anywhere with a lot of noise for longer than a couple hours, I wouldn’t be able to partake in small joys like drinks and weed, and not even partaking in conversations. \n\nI remember when I was taking those drugs, saying to myself “you are a shit person and a part of you needs to die. These meds will kill it.” Or “these meds will help me forget those memories”. Or taking the meds with alcohol, cocaine, mdma, and weed and fainting and waking up in 3 days, wondering why I didn’t die. \n\nI just don’t understand why I had to realize my toxic ways after I’ve done so much damage that I probably won’t be able to recover from. I feel like if I had just handled my emotions in healthier ways.. instead of trying to show my parents I was suffering, I would have just lived a good life. \n\nIn a way, I wanted to show my parents- this is how bad I’m suffering. Because I never complained when I was a child. Even the way I tried to show them was so passive. They don’t care anyway and all I did was sabotage my own chance at happiness. \n\nI ate a couple krispy kreme donuts yesterday and wokeup with a nosebleed. That’s how messed up my system is. \n\nSomeone please help me be okay with dying.\n", "url": "https://www.reddit.com/r/SuicideWatch/comments/ar8jlm/everyone_thought_i_had_the_best_life_but_i_took/", "title": "Everyone thought I had the best life, but I took psychiatric drugs from 16-23 in the most self destructive way wishing I was dead. 1 year off meds in hopes of a better life but now I really have to kill myself.", "social_network": "reddit", "user": "niniyo27", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 10, "down_vote": 0, "creation": 1550321685, "permalink": "/r/SuicideWatch/comments/ar8jlm/everyone_thought_i_had_the_best_life_but_i_took/", "nsfw": false, "first_save": 1635422550.0818295, "replies_charged": false}