{"id": "t5_2qpzs_t3_oo2vpj", "request": ["9cb7ef4e-af9d-4403-b84a-be5dd3f5e75c", "e79a79ca-6f5c-44ca-b1e4-309a4afa83c2"], "text": "Cant even muster the energy to deliver my rant. Which is actually just a series of observations about the realities of living in modern society, feeling unfulfilled with the progression of life, and the brutal ways people treat each other in the name of profit. The same observations I've been making since I was twelve years old. But I guess I dont really need to do that here, we all know more or less exactly the way each of us feels about how life works, it's why we congregate in places like these. People think we're looking for advice, or sympathy, a shoulder to cry on. In some cases that's true but when we've reached the end of what we think we can endure and we are sitting in front of our screen holding a bottle of pills, or that length of rope we've been tying over and over to get just right (wouldn't want it to fail when we need it most) We Know that noone has the words to give us to make it better. That magical set of words that will fit in a character limited text box, and will wipe away all the sorrows and pains of our lives. The miraculous advice given by a stranger that knows nothing of the specifics of our hardships, that will rejuvenate us and show us a new light that will guide us in life. NO. We came here for ourselves. Our last ditch effort, our last vestige of hope that by sharing our stories and our plans and our pains, we can gain the clarity and strength we need to keep struggling through these trials. Or that with the commiseration of those that see the world the way it truly is, we will finally find the courage to end them. I hope you discover, in the process of releasing yourself, the Will that you need to keep on fighting for your life. (Reposted but I just dont know what else I can offer to help this sea of drowning people)", "url": "https://www.reddit.com/r/SuicideWatch/comments/oo2vpj/the_sad_truth_is_theres_nothing_that_i_can_say_to/", "title": "The sad truth is theres nothing that I can say to help with your problems, or my own.", "social_network": "reddit", "user": "InApathyWeTrust", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 10, "down_vote": 0, "creation": 1626790523, "permalink": "/r/SuicideWatch/comments/oo2vpj/the_sad_truth_is_theres_nothing_that_i_can_say_to/", "nsfw": false, "first_save": 1635425155.978236, "replies_charged": false}