{"id": "t5_2qpzs_t3_qejmel", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42", "5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "I feel utterly numb to the concept of suicide. I’m so tired of living like this I don’t think I’m able to comprehend the gravity of my thoughts anymore.\n\nI’ve been suicidal for years and have entirely lost touch with what life without depression feels like. I have constant suicidal thoughts and am continuously planning how I will end my life. I’ve been in this state of survival for too long, all my existence has come to is finding distractions that get me through each day, hour by hour.\n\nPart of me feels like I’m ready to end my life tonight, yet part of me doesn’t believe that I’ll ever be able to follow through with it. I feel like I’ve been standing on the edge of a cliff for years, only a foot away from death. Although I’ve been within one step of the end for so long all I have done is inch closer and closer to the edge year by year despite the fact that I'm close enough to end it at any moment. I’ve been here for so long I’m not afraid anymore.\n\nBut I’m exhausted. I don’t think I can keep living like this much longer. I need a way to snap myself back into reality and understand the severity of these thoughts and the actions I plan on taking. Because at this point in my life suicide doesn’t feel like that big of a decision anymore.\n\nI am just finally beginning to reach out for help which got me thinking about how honest I can be without being hospitalized. I’m aware this might be what I need but I’m still not ready to admit that is what’s best for me. If I’m honest with a therapist and admit that I have a plan I doubt they would be able to understand that this is typical for me. I’m having a hard time wrapping my head around the fact that a therapist would find the level of suicidal ideation I have concerning. The thought of suicide just feels so normal to me.\n\nAm I overexaggerating the extent of my suicidal thoughts or am I so numbed by them that I’m unable to comprehend the severity of where I’m at?", "url": "https://www.reddit.com/r/SuicideWatch/comments/qejmel/subconsciously_normalized_suicidal_thoughts/", "title": "Subconsciously normalized suicidal thoughts", "social_network": "reddit", "user": "scandinaviancow", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1635044625, "permalink": "/r/SuicideWatch/comments/qejmel/subconsciously_normalized_suicidal_thoughts/", "nsfw": false, "first_save": 1635427298.7061758, "replies_charged": false}