{"id": "t5_2qpzs_t3_k9jfcs", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "\nI know that suicide isn't the answer, certainly not now in my life. I'm 34 so im still 'relatively' young. But I dont really see the point in going on. \n\n\nI'm suicidally depressed because:\n\n1. I have social anxiety around strangers and cold approaching girls - which also means I'm not able to be funny around strangers either in the same way I'm able to be when I'm with friends or family (which I dont have much of anymore either)\n2. I'm not the intellectual I believed I was.\n3. I grew up with delusions of grandeur, which I haven't, nor ever will at my level of function, live up to.\n\nAnd tomorrow I'll wake up feeling slightly better, enough that I'd be embarassed that I felt suicidal last night, but not enough to actually approach life with any level of determination to create meaningful change, or even try to go after what I want in life. \n\nAnd then a few days later I'll have another small break down where I ruminate in my pain and misery again.\n\nAnd so the cycle continues, as it has for years, and will continue for years.\n\nAnd the worst part is I know my pain is marginal compared to others. Not just others on this reddit, but compared to people living in abstract poverty, violence, slavery, homeless, terminal illnesses, etc....\n\nI am so blessed I can literally spend the rest of my life never working and just lying in bed with snacks, alcohol, wifi, 4k tv, netflix, pornhub, and everything else I could possibly want. \n\nSo yes, I know how easy I got it, and I should be more happy, mindful and filled with gratitude.... But no matter how i look at it, no matter how often I reflect on my blessings and celebrate a victory, big or small, I am still here needing to write a post like this.\n\nWhy the hell, even at a point like this, am i not able to say f**k it, and live more free and do what I want to make myself more happy in life? Especially considering I know it would make me happier.", "url": "https://www.reddit.com/r/SuicideWatch/comments/k9jfcs/whats_the_point_in_living_when_all_im_able_to_do/", "title": "Whats the point in living when all I'm able to do is exist and consume resources?", "social_network": "reddit", "user": "NunyaBidnizz68", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 17, "down_vote": 0, "creation": 1607482628, "permalink": "/r/SuicideWatch/comments/k9jfcs/whats_the_point_in_living_when_all_im_able_to_do/", "nsfw": false, "first_save": 1635428053.7015343, "replies_charged": false}