{"id": "t5_2qpzs_t3_nia4j6", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "\nWell, it starts off like this. I met (M-Bane) in 2019 on Tinder, but I blocked him on my socials since I met my second boyfriend at the time. (M-Jace) is my second ex. Him and I are still good friends to this day. A year passed I followed (M-Bane) but he didn’t notice it was me, so I left it as is. I created a new snapchat due to plenty of tinder men following me on my old one, so I made a new one for my close friends that I trust and care. (M-Bane)followed me on there and I didn’t add him immediately because I was unsure. I eventually added him a day later. We talked and then started dating. We felt so connected like lost lovers. He tells me he has this girl friend of his (F-Sari). I am not one of those girls that looks through their boyfriends phone, but I did. I had a gut feeling and I listened to it. She was calling him babe and he love her her. I was angry but I was mature ,and wanting to be the bigger person ,and so I left it as it is. I was like what ever I trust him. A couple of days passed by and his mother discriminated against me because I had mental illness. The mother didn’t want her son to be involved with a mentally ill girl. The parents practically hated me over my mental illness ,so that’s that. (M-Bane) talked trash about his exes some including; their weight and how they were disgusting. They were fat and unappealing to his eyes. He even talked crap about (F-Sari) how she was very disgusting and an abomination to society because of the way that she looked. He also fetishized hispanic girls like me. I’m Cuban by the way. He loved that I was very skinny and hot and basically his wet dream. Days go by and (M-Bane) Messages me and says did you message (F-Sari). I said no and she literally impersonated me on Instagram DM‘s. She poorly photo shopped and Instagram DM from me. She did identity theft because she made a whole fake DM accusing me of something that I did not do. If you may ask, Yes I do have the photos to prove it. She basically wanted to tear us apart. I felt very threatened in the relationship and I asked for him to block her(F-Sari) and her best friend (F-Ally) because they were in on it. A couple of days go by and one of his friends (M-Nick) said to look on his Snapchat. And, it’s him with (F-Sari) and (F-Ally) The two girls that I told him to block. Then, he breaks up with me and then minutes later him and (F-Sari) were dating. I slit my wrist on FaceTime while he broke up with me because I was unmedicated and very distraught and betrayed and broken. It was very difficult to the point where I had to be admitted to a psychiatric hospital for one and a half weeks. It was the most traumatic thing I’ve been through and horrible. The disorders that I have are PTSD, Anorexia Nervosa, Borderline Personality Disorder, Major Depression Disorder, Anxiety. I disassociated so much during that stressful and traumatic time that I cut myself just to bring myself back on earth because I did not believe what was happening to me was actually true. It still breaks my heart because I cannot trust a single man anymore. Due to the fact that I feel like he used me for his sexual bucket list and tossed me on the road.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nia4j6/is_it_justified_that_i_slit_my_wrist_on_facetime/", "title": "Is it justified that I slit my wrist on FaceTime my toxic ex was breaking up with me?", "social_network": "reddit", "user": "rbritts18", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1621655581, "permalink": "/r/SuicideWatch/comments/nia4j6/is_it_justified_that_i_slit_my_wrist_on_facetime/", "nsfw": true, "first_save": 1635422271.322926, "replies_charged": false}