{"id": "t5_2qpzs_t3_p8injn", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I recently began high school, and it’s just been a huge reminder of how much of an ass I am to be with and to handle. I’ve always been an embarrassment, school just highlighted it.\nI’m indecisive, I’m lazy, I’m talentless, I’m slow, those are just a few of the major flaws in me. I cant assert myself, and end up creating so much discourse by doing so. I am my own worst enemy. But everyone is to a certain point, right? I’m just not strong enough. Im tired of the anxiety attacks, overwhelming myself to where I get sick, and tearing myself down when I make mistakes. I’m tired of the stress eating. I’m tired of being misunderstood. I cry myself to sleep almost every night (sorry that’s weird), and get hellacious pains where I almost faint from stress. I don’t wanna do this anymore. I don’t want anyone else to deal with me too. Sometimes I get babied around by teachers because I have so much stress. I feel so guilty. I don’t want to make anyone’s life any harder than it already is. I just can’t calm down. I feel like it’ll  be better for everyone in the situation if I just killed myself. There’ll be tragedy, but everyone at school will forget, and my parents will move on and finally live the life they want. I’d prefer if everyone just forgot I was ever here, so they don’t have to waste any time. I just wanted someone to listen before I might go. Hopefully I can be strong in another life. Thanks for reading.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p8injn/im_tired_of_myself/", "title": "I’m tired of myself", "social_network": "reddit", "user": "mizzpea", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1629510528, "permalink": "/r/SuicideWatch/comments/p8injn/im_tired_of_myself/", "nsfw": false, "first_save": 1635426619.9423797, "replies_charged": false}