{"id": "t5_2qpzs_t3_gue4r9", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "I've never been open about my depression, so this is unfamiliar to me. Even at my worst moments I never turned to anyone for help.\n\nI'm definitely past the worst of my problems, and I'm blessed/cursed to say I'm still alive. When I say cursed, what I mean is some days my mind just regresses back to the days where I contemplate suicide until midnight, then I would repeatedly rock my head with my fist until I go numb, after that I go to bed and then the same thing the next day. When I say blessed, I mean most days I'm completely okay. Not great, not bad.  The curse is I could be fine for weeks or months, but suddenly one day I feel immense pain in my chest and feel sadness. One day I'm fine, the next I'm cutting again. One bad day can feel as long as one great month. This is one of those bad days.\n\nI wanted to share something to the other suicidal people of this subreddit, or the noble people, whom I respect very much, that delve themselves into this pitiful world of melancholy in hopes that they may save a stranger's life.\n\nMy older sister and I talked the other day. She told me that because we shared traumatic experiences from our abusive parents and relatives, we are to become more compassionate beings. I lied and told her that I agree, but in reality all that misfortune caused nothing but hatred. \n\nI had problem socializing with other people as a child. I mainly attribute this to the negligence of my parents when they weren't telling me how much of mistake I was. When I became a teen, I had a huge problem in school because I didn't trust anyone. I immediately hated everyone because I assumed they were going to bully me. I still have this problem now. I can't stand when I hear laughter behind me because I automatically assume they're laughing at me.\n\nThere was a Reddit post I saw the other day titled: \"What is the biggest lie you've been told?\" And one response really struck me.\n\n\"The world tells you that the nerds that get bullied in school grow up to be successful, and the bullies end up in a jail or jobless.\"\n\nThe nerds at my school ended up killing themselves. \n\nI'm thankful I ended up not being a shell like I see some other victims of childhood trauma, but sometimes I feel so hurt. I used to think \"I still have a long life ahead of me, time will fix everything,\" but now I just cry because I'm reminded how much longer I have to endure this pain. \n\nIt's cliche, but the world is so cruel. My chances for happiness was stomped, crushed, and extinguished the very second I was born. \n\nNow I'm just filled with hatred. Hatred towards my parents and relatives who would scream at my face that I was picked up from the trash in the slums, and that they're willing to throw me back there. Hatred towards the teachers that saw the scars on my body and did not intervene. Hatred towards the counselor who promised me help and then ignored my cries completely. Hatred to the kids who singled me out and pretended to be my friend before beating the shit out of me. Hatred to the world for making my life so agonizing. And finally, hatred to myself for becoming a victim.", "url": "https://www.reddit.com/r/SuicideWatch/comments/gue4r9/finally_opening_up/", "title": "Finally Opening Up", "social_network": "reddit", "user": "PleaseHelpCasper", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1590986821, "permalink": "/r/SuicideWatch/comments/gue4r9/finally_opening_up/", "nsfw": false, "first_save": 1635427532.392332, "replies_charged": false}