{"id": "t5_2qpzs_t3_jbdztl", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I'm on the brink of being homeless. I've been telling people I lost my job due to COVID, but the truth is, I just walked out. I can't hold a job for shit. I have been unemployed for 8 months now. My unemployment is running out. I have to get a job fast, but the only places hiring are fast food and grocery.\n\nSure, one could say that is better than being unemployed, but it kind of isn't. At most, these places pay $8 an hour. I need at least $12. That would allow me to pay all of my bills with nothing left over. It's simply not enough. Even if it were full-time. \n\nIt doesn't help that I am autistic and have severe depression and anxiety. I've either been fired or walked out of every job I've had. The pressure is too much. I hate it. I just want to be normal. I want to be able to work normally, but I simply cannot. \n\nI'm so helpless, and I hate it. I can't drive. I can't remember to do half of the things that adults are supposed to. I have no viable skills. I'm not discipline enough to be self-employed. The job market is trash for everyone at the moment, even worse when you have no qualifications. \n\nI'm lonely. I have a good friend. I have family that love and care for me, which I realize is more than other people can say. I'm thankful for that, but I am still so lonely. I feel like an outsider to everyone. I'll never have a significant other. It seems in the department of love, I got dealt a pretty shit hand. I'm a black, gay, autistic female. My attraction to people is unconventional. I almost exclusively wear fandom attire. (Zelda, Mario, anime, Spiderman etc). In short, I'm no catch. I mean, I'm a good person. I have a lot of talents and am very caring. However, no one would know as no one wants to put in the time to get to know me. Which is, in part, my own fault. My social skills are bad and I tend to push people away. \n\nThe anxiety is too much. The depression is too much. I never sleep and constantly feel overwhelmed. I can't get the help I need for my mental health without insurance. I can't get insurance without a job. I can't find a fucking job. Even when I have one, I can't keep it. What the fuck am I to do? Like, honestly I give at this point. I'm caught in the stupidest cycle. \n\nStep 1: Realize mental health is declining\nStep 2: Seek help\nStep 3: Remember you can't get healthcare w/o insurance. \nStep 3.5: Remember insurance is only available to you if you're working.\nStep 4: Get job\nStep 5: Work, but have no time to get to the doctor. \nStep 6: Crumble under the pressure of working due to declining mental health and get fired from/quit job. \nStep 7: Loss of job causes more anxiety and depression \nStep 8: Repeat from step one. \n\nThere is no way out it, is there? Like, I've been making posts about my depression and shit for like 5 years. I'm almost 30 and absolutely nothing has changed. It's not from lack of effort. I've been trying really fucking hard to change things...it's just not enough. I know no one will read this stupid ass post. I'm just so fucking tired, man", "url": "https://www.reddit.com/r/SuicideWatch/comments/jbdztl/what_do_i_even_do_anymore/", "title": "What do I even do anymore?", "social_network": "reddit", "user": "iminanothercastle", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1602724772, "permalink": "/r/SuicideWatch/comments/jbdztl/what_do_i_even_do_anymore/", "nsfw": false, "first_save": 1635427148.1800845, "replies_charged": false}