{"id": "t5_2qpzs_t3_qb79ys", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "A bit of long read.\n\nI'm just scared by posting this, because I think I will get ridiculed. I don't know but when I was 15 I started getting mood swings violently. I lived with my father, then my father fought with my mother because I was having so much violent hallucinations that he basically left me with my mother. I will never forget the scene that happened when I reached mom's house. My mother was furious and beaten my brother so much that blood began to drop from his neck. She was enraged because I sent several audios to her one day because my brother was hurting me psychologically.\n\nWhen I began to live with her I just began to deteriotate more. Like wipping myself in animal feces in the street, running in mid of traffic, and in one incident attempting to threw myself infront of a car, but he stopped in the moment I jumped.\n\nI started taking medications. It began to be OK. Until I got fat, man boobs, and it literally destroyed my life. So many nights crying, many nights. I shower frequently, but I can still look dirty and stink. I'm not even a human at this point, I'm an ogre.\n\nThen there's my mind. My mind. I can't think normal because when I go out at the street my mind begins to automatically capture every person on the street and my imaginations begins to think embarrasing moments of that person, and I HATE IT. I think that person my mind is referecing is laughing at me and think I'm a dumb person. Another day arrives. I get out to the street and my mind begins to imagine myself in situations in grandiosity like scenario. Now after a few moments after that thoughts goes away, an music comes to me and repeat, repeat, repeat until I get exhausted and began to compulsively say \"I'm gonna kill myself\", \"I just want to die\", \"Wish I would die now\".\n\nWhen I go to the church I act like a drug addict because of my mind. When the crowd of the churchs pops in, my mind begans ridiculing me and the others members of the church, and then I began making strange movements so that thoughts can go away. Sometimes I just jump from my chair. Sometimes I just start to make faces so I can get along with the people.\n\nWhen I'm using the computer, I think my computer is beaming at my thoughts then processing it at the computer, that someone is monitoring me, that hackers are seeing my ugly face and body and laughing at their random \"conference\" with friends alike. It is just killing me. It is killing me.\n\nI wish that my mind would finally induce me at a full blown psychosis state and make me finally kill myself with a knife wound to the throat. I just don't know. I'm confused.\n\nMind, I just hate you. Why does it have to be so unfair? God, I'm even scared of posting in this sub because I think people will make fun of me. I just want to end it all.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qb79ys/i_hate_my_mind_and_it_is_killing_me_and_it_will/", "title": "I hate my mind and it is killing me, and it will not end until I actually kill myself", "social_network": "reddit", "user": "kepler415", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1634632756, "permalink": "/r/SuicideWatch/comments/qb79ys/i_hate_my_mind_and_it_is_killing_me_and_it_will/", "nsfw": false, "first_save": 1635427635.2350917, "replies_charged": false}