{"id": "t5_2qpzs_t3_q79hq4", "request": ["5f7c2841-3f43-4682-8126-88825da57933", "5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "Four months ago, I cheated on my partner. We've been together for eight years and I cheated on her with some girl I met in class. We obviously broke up and I had to leave our apartment, I've been living alone since then and that's when the suicidal thoughts began.\n\nWe ended things on good terms so we were able to keep in touch with each other. About two weeks after we broke up she's with her new boyfriend. I only found out because I went to her apartment to help her with something. They've been together since then, too. The suicidal thoughts got worse after that night.\n\nFrom the day we broke up until now I've been trying to survive each passing day without a breakdown but every night I would fail and cry my eyes out until I cry myself to sleep. Waking up makes it worse because I had to go through it all over again. I can't seem to find the energy to keep up with my classes online, I couldn't talk to anyone, I'm living in remorse and regret and all I ever wanted was for her to take me back. I've blocked the girl I cheated on her with as well as her friends. I didn't flirt with anyone, couldn't talk to anyone in the first place, each day just filled with regret and pain, each night was spent overthinking until morning, then repeat.\n\nI know she'll never take me back. She's happy with her life right now and I'm not the reason for it anymore so I feel like I have no more purpose in life or continue living for that matter. I really hate my suicidal thoughts but I can't get rid of them even if I'm trying to. I'm really scared that one of these nights would be my last.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q79hq4/does_a_cheater_deserve_to_be_suicidal/", "title": "Does a cheater deserve to be suicidal?", "social_network": "reddit", "user": "tileset", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 96, "down_vote": 0, "creation": 1634126031, "permalink": "/r/SuicideWatch/comments/q79hq4/does_a_cheater_deserve_to_be_suicidal/", "nsfw": false, "first_save": 1635421079.7007458, "replies_charged": false}