{"id": "t5_2qpzs_t3_qgtvh4", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "Don’t post this anywhere else please. \n\nTrigger warning- Abuse and SH mentioned. \n\nThe last few years have been utter shit I won’t lie. Three years ago I was sexually and emotionally abused. I reported it but u it I was handled horribly by the police and it never went any further. I never got help because I was made to feel (by the police) like it wasn’t a big deal. I then shared a class with said person for the next few years. \n\nIn that time I was suicidal, self harming and severely depressed and anxious. I got a bit better but it never really went away. Then in 2020 I went to college. It’s a dance college so I already work my body to the limits. But my teacher is awful and borders on emotionally abusive. I hate the place and every day I am scared to go in. I love dance and in a few months I have auditions for dance universities. I need my tutor to get to an audition ready place. \n\nThen this year I am done. The pandemic ruined me. I’m still severely depressed and anxious. Since I was 13 years old I have seen so many people who tired to help me mentally but lost if the time they saw me for one session and that was it. Then in December 2019 I finally found someone who I clicked with and they were helping. Then in February they disappeared off the face of the earth and they referred me to another mental health service. \n\nThen a month ago I had an assessment for this service where I disclosed my past trauma. A week later I had a social worker at my door who I had to recount this to who then told me the police would have to get involved again, against my will. I then had to recount my story to a police officer who then gave me TWO DAYS to decide if I wanted to prosecute. I’m 17, I felt like that was way too little time. After that I was a wreck, I felt physically sick and anxious and I wasn’t in college. I found it it’s a 6/9 month waiting list until I can get help from the mental health service and it’s going to be a while until I can get help from specially trained SA counsellors. \n\nThen to top it all off we’re getting our kitchen redone and it’s all gone tits up. We’ve had no kitchen for three months so we can’t really cook anything and we have no tap except out bathroom one. My gran got diagnosed with cancer and both of my sisters have had covid and had both been around my gran. And now my younger sister has got it to keep everyone safe my family isn’t even living together. \n\nIt’s all small things but I’ve had enough. I have two jobs and I’m so stressed with college and everything else happening in my life. I have virtually no help from anyone to help me deal with anything (my family and boyfriend are great support systems but there’s only so much they can do). I’ve tried using crisis lines but they don’t really help. \n\nI am done. It genuinely feels like there is no way out of this right now and I can’t cope anymore. And while I don’t want to do anything or think that I will I don’t know how to cope anymore. \n\nI don’t know if this is a rant or me asking for advice but any words right now would be nice.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qgtvh4/i_cant_do_this_anymore/", "title": "I can’t do this anymore", "social_network": "reddit", "user": "Emmy_C484", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1635331691, "permalink": "/r/SuicideWatch/comments/qgtvh4/i_cant_do_this_anymore/", "nsfw": false, "first_save": 1635426155.6617725, "replies_charged": false}