{"id": "t5_2qpzs_t3_5he0xl", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "I'm DONE with never having a girlfriend since years, and missing the opportunity to experiment this while I'm young. If I hit 25 while NEVER having a girlfriend, I will never stand it!\n\nEven if I found a girlfriend past 25, I would ALWAYS have the feeling that I've missed something important before. What it does when you experiment love while being young. I will forever be an orphan of those adolescent loves I have not known. You know, this innocent, rather carefree love, without the obligations of the adult life. And I wouldn't endure this. I already can't stand my current situation.\n\nAnd I lost something like 7 years, during which I could have known young adult love, just her and me, leaving me with just 5 potential years of it, before women start to go out with me wanting marriage and children.\n\nI will hit 25 on January 2^nd . \n\nWhen I was 22, I made some kind of suicidal pact, saying that if on January 3^rd 2017, at 3:00 AM (GMT+1), I never had a girlfriend before, I would end my life, that horrible, sunk and unrecoverable life.\n\nAnd that I would surely try to commit suicide during the night between December 31^st and January 1^st , during New Year's Eve, hoping that a girl would save me at the last moment.\n\nAlthought I tend to forget this pact during the rest of the year, I tend to remember it during December, January and February (because of Valentine's fucking Day). And suicidal thought come back.\n\nBut now, I am almost hitting the deadline. I think that the suicidal thought are stronger than other years, and getting stronger and stronger from now on. I am supposed to see my psychologist next week to talk about it, but I needed to talk about it now. Because I really feel bad, I am done with never having a girlfriend, and having such a delay in romantic relationships.", "url": "https://www.reddit.com/r/SuicideWatch/comments/5he0xl/i_planned_to_suicide_if_i_never_had_a_girlfriend/", "title": "I planned to suicide if I never had a girlfriend once I hit 25. I will be 25 in less than one month, and suicidal thoughts are coming back.", "social_network": "reddit", "user": "Stained_Class", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 55, "down_vote": 0, "creation": 1481293793, "permalink": "/r/SuicideWatch/comments/5he0xl/i_planned_to_suicide_if_i_never_had_a_girlfriend/", "nsfw": false, "first_save": 1635427712.4745855, "replies_charged": false}