{"id": "t5_2qpzs_t3_gd1yju", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "I have been suffering from strong really strong suicidal ideation for the past 2 months . I am almost convinced that i am gonna kill myself. I'm sure i'm gonna kill myself. I don't see the point yo life or the point in doing anything anymore BUT ... \nI used to be driven , i used to has great dreams about My potencial and My personal power so i have decided to make this pact with myself . I Will do My very Best starting from tomorrow 4th may 2020 till 4th may 2021. I Will go to sleep everynight knowing i did My Best to reach the goals My non depressed happy self used to have so that by 2021 may 4th if i choose to die i Will die with a calmed soul, knowing i did My Best and lived with integrity. I Will shoot myself knowing i acted with integrity . I Will shoot myself knowing i did My Best and did My Best to be loyal to the dreams My old self had. I Will maintain a diary of this here .\n\nIf after doing this i still choose to die, i would die with peace in My soul .As of now i'm convinced i'll kill myself . I'm justo making the conscious choice to hold for a year first \n\nIf i die..\n\nI Will die having Taken My body to it's best\n\nI Will die having meditated everyday for an hour for at least 100 days\n\nI Will die having done no fap no porn for at least 100 days \n\nI Will die having become a good memory athlete \n\nI Will die having learned as much as i can of trading \n\nI Will die having learned as much as i can of coding \n\nI Will die having learned as much as i can from piano \n\nI Will die having perfected My french, learned arabic and japanese\n\nI Will die having done as much as i can to avoid not dying by suicide by going to therapy . \n\nIF I DIE I WILL DIE WITH HONOR", "url": "https://www.reddit.com/r/SuicideWatch/comments/gd1yju/suicide_and_integrity_pact_with_myself/", "title": "Suicide and integrity pact with myself", "social_network": "reddit", "user": "felo7", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1588553971, "permalink": "/r/SuicideWatch/comments/gd1yju/suicide_and_integrity_pact_with_myself/", "nsfw": false, "first_save": 1635427739.1940944, "replies_charged": false}