{"id": "t5_2qpzs_t3_pnzqiu", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "So basically Im not sure if this belongs specifically here, but Im an adult that became reliant on deliveries and takeaways to manage my depression because i couldn't make the effort to feed myself, so i spent a lot of my own money even though I know it was bad. I also had an account that was linked primarily to someone in my family's account and it would default to them without realising, so i have spent a lot of their money as i wasn't keeping track as my brain was in a fog particularly in lockdown. Anyway i think they're gonna find out imminently and i cant bear it i feel so sick and so sorry, and Im stuck at home for the next few days in the same house but its my birthday, and I obviously don't want them spending more money on me but don't know if i should tell them or not before I leave because i feel like it would be worse to say whilst I'm there? But i also don't want them to find out before I've told them and don't want to accept any presents. I really need help because i can't sleep or eat and i feel so sick like i can't bear to live with myself. I don't know what would be best to do, please help me. Obviously i will pay them back but it will take some time. Would like to know if there's a hotline or something specifically about this kind of thing i can call urgently.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pnzqiu/got_addicted_to_buying_takeaways_due_to/", "title": "Got addicted to buying takeaways due to depression and now I have accidentally spend loads of someone in my family's money, and I feel they will find out soon and I really need advice, because I feel like killing myself from the guilt and shame", "social_network": "reddit", "user": "856378262548hgji", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1631613499, "permalink": "/r/SuicideWatch/comments/pnzqiu/got_addicted_to_buying_takeaways_due_to/", "nsfw": false, "first_save": 1635426176.814286, "replies_charged": false}