{"id": "t5_2qpzs_t3_qgpiid", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "1. I have a huge amount of existential dread. I never feel quite sure if I'm in the real world, or if I have free will, or if life has anything meaning at all. I ruminate obsessively on these topics and it causes me much despair.\n2. I feel as if God abandoned me. I am a Christian, but Christianity as a whole doesn't make sense to me. It speaks of a loving God, but I can't help but just see a God who wants to inflict pain upon me for some cosmic purpose I can't understand. God seems cruel to me.\n3. I hate myself. I see myself as ugly, inside and out. I have an unattractive body, I think about myself way too much. I've made a lot of disgusting, ugly mistakes and I can't forgive myself for them. The shit I've done is really bad.\n4. I feel alone. I feel as if I can't talk to anyone about my problems, and if I do they don't really understand where I'm coming from. They give me the usual bullshit of \"practice mindfulness\" or \"find a therapist\" which I'm already fucking doing. I can't talk to my family about my problems, as my dad gets frustrated with me and my mom starts worrying about me and I fucking hate that.\n5. Any happiness I have is very fleeting. I've felt this way for five years. Why bother continuing my existence? I fantasize about slitting my wrists or shooting myself constantly. Nothing I do satisfies me anymore. I feel incredibly detached from the world. I'm constantly depressed or anxious and I've had enough. I want it to end.\n6. Psychiatric medicine doesn't work. It's also hurt my ability to enjoy sex, even while off the drug. There's other treatments I could try but they're too expensive. My doctor has recommended I try clinical trials of ketamine or psilocybin, but there's no studies in my area.\n7. My life is going nowhere. I can't accomplish anything and I'm watching all my friends traveling the world or getting married. I can barely keep a part time job. I don't have much money, as I have climbing medical bills and my parents charge me rent.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qgpiid/i_want_to_kill_myself_heres_a_list_of_why/", "title": "I want to kill myself. Here's a list of why.", "social_network": "reddit", "user": "Odd-Cheetah-7812", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635312968, "permalink": "/r/SuicideWatch/comments/qgpiid/i_want_to_kill_myself_heres_a_list_of_why/", "nsfw": false, "first_save": 1635427994.6225252, "replies_charged": false}