{"id": "t5_2qpzs_t3_kkuyyb", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I used to have a life I loved and a promising career. Happily divorced. I knew I didn't want a second wife or any kids. A friend convinced me otherwise and twisted my arm into a relationship. Now we have two young kids.\n\nShe is disabled physically and it's getting worse, she is increasingly bedridden. She has a mental disorder and lashes out at me emotionally and bullies me even as I look after her. Sometimes things are okay but it is all getting worse. One of our kids has a mental disability too and we don't know how bad it is going to progress.\n\nI had to quit my job and take another job that paid enough to look after all of us, which I hated. But I couldn't balance the demands of that job with caring for my wife and now I've been fired. I have nothing lined up for next year and barely time to search. \n\nWe can't get any kind of government benefits in my country because my wife is an immigrant and would be denied her visa if we applied for any. I have exhausted all my emotional and financial support networks. Nobody wants to hear me talk about it any more because their sympathy has dried up. I am just tired. I'm sick of not being allowed to sleep. I'm sick of my wife feeling guilty for everything but being unable to change any of it. I have given up my hopes and dreams that were so strong and dedicated my life to working impossibly hard for something I don't want but have no choice in any more.\n\nThe only thing that stops me killing myself is the knowledge that there's nobody else to look after them and I don't want to leave a horrible mess and ruin the lives of my friends and family. It's not even that I *want* to die, I want my old life back. But that can't happen, and I'd rather just go to sleep and not wake up. I don't want the life I am permanently stuck with.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kkuyyb/backed_into_a_corner/", "title": "Backed into a corner", "social_network": "reddit", "user": "tepharo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1609034674, "permalink": "/r/SuicideWatch/comments/kkuyyb/backed_into_a_corner/", "nsfw": false, "first_save": 1635422317.1140893, "replies_charged": false}