{"id": "t5_2qpzs_t3_q5sxnc", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "Just because I'm a boring person, I shouldn't assume the world is boring. Just because I've had some bad luck, doesn't mean that I'm unlucky. I shouldn't be weak, and if I help someone who is weak, I can't think that I've done them a favor because I wouldn't want it to become a habit. So what does this mean about myself, currently weak. \n\nBoredom is dangerous. When you're bored, you find yourself thinking of terrible things. Even if you don't want to think about it, you still do. How many childhoods are completely ruined by abuse and neglect?  How many people have demons looming over them they can't get rid of until the day they die? How does someone truly get their hands on wealth? What would I be thinking about if, for this whole time, I had what I think I missed out on? And then you start to make decisions like, \"murderers should be killed\" or \"rapists should have their dicks cut off\" etc\n\nI fucking hate the people who made my life shit. Everything is their fault and they're why I'm so miserable. I wish they would just die and give me peace. I want to kill them and then myself. Originally I was going sit in my favorite chair and slash my neck, but I read online that death from blood loss, towards the end, is like having the worst migraine of your life. That's no way for a tight-assed coward like me to die. I'd prefer something faster and more humane, like one of those death injections those european countries legalized for the mentally unwell.  \n\n...\"today is the first day of the rest of my life\" is a hard mindset to put into practice when you have obligations, people, and zero closure from the past trailing along right behind you, with no end in sight, and the direction of suicide is comparable to the direction of moving on and fixing everything, in how much it resists my current life. I don't know if I'm expressing that well or if that will make any sense. \n\nBasically, I know there's a way to validate my shitty life. If it's possible, I'd like to undertake some kind of noble calling.  If I manage to avoid fucking up and accomplish anything good simultaneously. I still want to believe I can be a good something. But it's outlandish for a bad nothing to think of being a good something. I'm not even in the same category of thing. I feel like I'm double my age and thinking and concentrating on things are just getting harder, and everything is simultaneously getting boring and more boring. I'm so tired.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q5sxnc/bore/", "title": "Bore", "social_network": "reddit", "user": "throwaway09212021", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1633948151, "permalink": "/r/SuicideWatch/comments/q5sxnc/bore/", "nsfw": false, "first_save": 1635427009.0124521, "replies_charged": false}