{"id": "t5_2qpzs_t3_qbuqnz", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "I don’t really know where to start with this damn post, I really just need to get my thoughts down somewhere, my thoughts on the state of the world and how I view things, since these thoughts have really been getting to me and my depression. I’m just going to start. I absolutely hate the state of the world and how things “work”. Everything just feels so damn impossible and pointless, it seems that young people don’t really have much of a future with the way things are going (I’m in my early 20’s btw.) Just look all around and you can see it everywhere, the climate is fucked because of decades of neglect, the job market is screwed with low wages and shitty jobs where the employees arent event treated as humans, the housing market is fucked with record high house prices, who the hell can even afford a house anymore? Pollution is absolutely everywhere and it really seems like theres no “light at the end of the tunnel” so to say. Idiocy is absolutely everywhere, and that’s thanks to the way the “education system” is, you have anti-vaxxers all over the place among other groups of idiots.\n\nThe world is so completely screwed because this is how its been shaped by the ultra wealthy people/powers of the world, profit is more important than ANYTHING, over human lives, the enviroment, everything. They control everything and how the world operates. It seems like the world has gone absolutely fucking insane, we produce so much useless garbage for what, for a few assholes to profit off of? The earth only has so many resources, and so many of these resources are used to create shitty items for consumers that break due to being cheaply made, OR even expensive items that are designed to break/fail/cease to function after a certain amout of time, planned obslescence is a crime against humanity. Who gets screwed over in the world? It ALWAYS seems to be the good, hardworking, everyday people who just want to get by. This is one of the things that really gets me, you see so many good people holding eachother up and supporting eachother while they continually get fucked over by their own government who is supposed to be working FOR THE PEOPLE, but what happens, they fuck over everyone, corruption is abundant everywhere and everyday people have no control over it. Higher up government employees that actually make the big decisions continually fuck all of us over wile living on their cushy government salary, paid by who? THE TAXPAYERS, THE ONES WHO GET SCREWED. Education is a total joke in many places, so many people can’t even access proper healthcare because universal healthcare is completely absent in many places as well, why? Because its not profitable enough? That’s so fucking stupid, even in some places with universal healthcare everything isn’t covered, just look at Canada, vision and dental isn’t fully covered by OHIP, oh well if you’re poor you don’t need good vision or teeth right?\n\nJobs, there are SO MANY useless jobs that exist for no good reason. It seems like most jobs are a total joke where you get treated like absolute crap by your employer and get paid equally crappy. Governments could put rules/regulations in place to help this but they fucking don’t. Take a good look at retail jobs, the employees get treated like total by their boss AND the customers, and get paid pennies. Treat everyone well and the way you would want to be treated, especially retail workers that go through hell, are you having a bad day? Don’t take it out on workers who did nothing wrong, please. Treat them like humans and be nice, and everyone will be happier. Just look at healthcare workers, governments hail them and call them heros, but they cant pay them better? What kind of a sick joke is that, especially with the hell they’ve gone through thanks to this god-awful pandemic.\n\nGetting anywhere in life seems impossible, ESPECIALLY if you have a physical/mental illness that prevents you from being fully functional. People say that there isn’t a taboo againt mental illness anymore (or as much as there used to be) but its mostly crap, mental illness is DEFENITELY still taboo, so much so that people are afraid to tell their family/friends about it. Getting a good job isn’t impossible but it certainly seems as such, for fuck sake even people with PHD’s have trouble getting jobs outside of school. Degrees seem to have less and less value these days. Nepotism is rampant everywhere and if you don’t really “network” or “have connections” good fucking luck. I believe everyone should have access to quality education but that’s not how it is. The world could be a MUCH better place if everyone had acces to at least basic, quality education, but education is way underfunded, theres teachers out there buying supplies, or even FOOD on their own dollar because the school doesn’t get shit, even thinking about it is abhorrent.\n\nThe enviroment, oh boy the enviroment already seems so far gone, we destroy the enviroment to mine precious resources among other things, and what do so many of these resources go to? Creating more and more garbage for the consumer populus, all for a very few people to get richer and richer. Governments don’t really give a single shit about the enviroment and anything they claim to be doing/implementing is more of a PR stunt then anything. People are fucking dying because they don’t have access to clean drinking water or adequate nutrition while in first world countries, restaraunts throw out SO.MUCH.FOOD at the end of each shift, simply because it wasn’t sold, it could be given to the homeless but nope, right into the dumpster it goes. Another good topic is war, I won’t get into it much but war as a whole is extremely fucking stupid, absolutely every war has been pointless, why? Because humans are complete power-hungry pieces of shit, if we could all just get along and live in harmony the world could be much better, so many valuable resources are wasted on war and weapons, all because we cant fucking get along with eachother.\n\nI don’t really know what else to right because I’m losing my track of thought but I’ll say a bit more. I really believe the world could be a better place for everyone and us humans could take much better care of our own damn planet and everyone could be happy, but I don’t really believe it’ll ever happen because of corruption and greed. I sometimes fantasize about a large corporation like amazon or something forming an private military of their own to overthrow governments and take over the world for a new world order, a better one, and all the profit and shitty things they’ve done were just a means to and end, and that end being a better world for everyone, a world free (or mostly so) from corruption and greed and just shitty behavior in general so everyone can live better, less stressful lives. But that’ll never happen.\n\nI don’t really know what else to say but I just wanted to get some of my thoughts out, my post may not be the most coherent as I'm not going for perfect writing or grammar or whatever but yeah, I hope everyone is doing alright in these hard and stressful times and hopefully things will turn around for everyone sooner or later, we’ll see I guess. – An Anonymous Depressed Person.\n\nEDIT - The only reason I haven't offed myself already is because I couldn't hurt my parents like that, they're good people. If things don't turn around in the future when they pass, I'll probably take my own life then. At least they can be proud of my university-educated bro.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qbuqnz/i_hate_the_way_the_worldsociety_works/", "title": "I hate the way the world/society works.", "social_network": "reddit", "user": "throwawayaccrandom30", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 16, "down_vote": 0, "creation": 1634712167, "permalink": "/r/SuicideWatch/comments/qbuqnz/i_hate_the_way_the_worldsociety_works/", "nsfw": false, "first_save": 1635428426.24124, "replies_charged": false}