{"id": "t5_2qpzs_t3_ow0srr", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "As the title suggest, I have a real problem with being self-destructive and I desperately need advice on how to stop being so self-destructive.   \n\n\nI have struggled with depression for close to 8 years now, and most of my depressive thoughts and feelings come from my own stupidity and bad choices. \n\n&#x200B;\n\nWhen it comes to love and intimacy I don't have much to complain, I get around. But here lays one of my biggest issues when it comes to self-destructive behavior. I don't feel like being in a relationship, I can hang around with a girl for a year, have fun, do fun things, but I can't take the next step because at that moment I really don't feel like being in a relationship. Then when the 'relationship' ends, I get this huge feeling of sadness over me and I instantly regret the choices I made (when it's too late obviously).   \n\n\nIt feels like only when it ends I can finally see what I had and that maybe I should've gone for it instead of cutting it off. This causes instant suicidal thoughts, since suicide is something that's on my mind a lot, especially when it gets triggered through things like regret. I can't eat, sleep or be productive, I have this constant feeling of sadness and a kind of sickness over me and I can't get rid of it. I have this huge feeling of 'why am I this stupid' and 'why can't I see what I have when I actually have it'. \n\nThis is not something that happened once, but maybe 3 times in the last 5 years and still it's like I don't learn from my mistakes and it gets to the point where I actually think there is something wrong with me. \n\n&#x200B;\n\nWhen it comes to friends, I don't have anything to complain either. I have a big group of friends with a few guys being like brothers to me. I can talk about anything to them, but this is just something they really don't understand and I can't blame them because not everyone has had problems with depression/suicidal thoughts. I will act like nothing is wrong, I will act like I'm living life, while in reality I am just counting days and I wouldn't mind dying at all. \n\n&#x200B;\n\nI have a good job, with great potential and above average pay. But more often than not I can't get myself to give 100%. There is not specific reason to why, I just can't. I get distracted very easy and it causes me to not as good of a job as I should. At the end of the week I will look back and think to myself 'I should've just put a little more effort in', and then the next week starts and it's the same shit all over again. \n\nI am pretty much 24/7 tired and I do not have the drive to do anything really. I'll be hungry as f\\* but I can't eat. \n\nAt this point my self-destructiveness prevents me from getting in to a relationship which ends up giving me an insane amount of regret. I'm messing up my job for no reason since I really like my job (believe it or not). And it basically just triggers my depressive feelings.   \n\n\nExcuse me for the long read.  \n\n\nIf anyone has any experience with this, or any tips, that would be highly appreciated.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ow0srr/tips_on_how_to_stop_being_selfdestructive/", "title": "Tips on how to stop being self-destructive", "social_network": "reddit", "user": "JamesC999-", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1627853424, "permalink": "/r/SuicideWatch/comments/ow0srr/tips_on_how_to_stop_being_selfdestructive/", "nsfw": false, "first_save": 1635422536.6420112, "replies_charged": false}