{"id": "t5_2qpzs_t3_3z7n3y", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "Broke up with a guy who I realised will never be faithful to me and will never want me the same way I like him. All of our friends are the same, and now that I can't take any more pain from from him I've cut him off and consequently all my friends. I just can't bear even to talk to them because they remind me of him. And it's been so long that I can't imagine life being any different.\n\nHe cheated on me right in front of my face when he thought I wasn't looking. Just the images of him feeling that other guy up breaks my heart in two and gives me a panic attack.\n\nI just couldn't take it so I went on a two week drug binge. I did over ten grams of mephedrone, more GHB than I can count and some crystal meth added in there too. I was so messed up by New Year's that I couldn't even bear to leave the house to meet another guy I had potential with, and now it looks like I've lost him too by sucking him into my horrid drama filled life. \n\nMy sister is telling me to stop taking more GHB and Benzos but when I try I get the worst palpitations and panic that I am so tempted to end it all that I have to redose or I just know I will end it.\n\nDespite being so sleep deprived I'm so scared of going to bed because it means lying down and being alone with my thoughts. I just don't know what to do. Living out the next fuck knows how long all alone...I just don't know how I'm going to do it. Please don't tell me to stop the drugs now because seriously they are the only thing keeping me sane enough to seek help right now. I am going to sit here and take benzos until I'm so delirious that I pass out. I can't see any other way.", "url": "https://www.reddit.com/r/SuicideWatch/comments/3z7n3y/horrendous_breakup_lost_virtually_all_my_friends/", "title": "Horrendous breakup, lost virtually all my friends and turned to drugs for over two weeks. Can't take anymore", "social_network": "reddit", "user": "Howawful999", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1451782552, "permalink": "/r/SuicideWatch/comments/3z7n3y/horrendous_breakup_lost_virtually_all_my_friends/", "nsfw": false, "first_save": 1635426342.342586, "replies_charged": false}