{"id": "t5_2qpzs_t3_qc49ul", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "&#x200B;\n\nTrigger warning/TLDR - It is a bit long and some subjects are sensitive. It basically asks why people who have everything in life go out of their way to show off, like if you have great communication skills and charisma, why would you have any interest in making someone who has no social life, feel like an abomination that should delete her self fromthe face of earth because no one loves her and never will. If you are successful and also are lucky enough to have two alive parents and do not suffer from chronic mental illness since childhood, and people like you, why would you make someone who literally rarely talks to people and is shamed for having no one to talk with and suffers from loneliness, anxiety and depression all of her life, feel like the ugliest and most weak thing that has ever existed and abuse her until helplessness and alter her worldview into a bitter hateful anxious distrustful one.\n\nReal post starts here.\n\nNeither the victim nor the bystanders think the person who insults others is cool so who are they trying to impress? Like you can do that if you are 10 so your friends can laugh but if you are 18 or 50, like what exactly are you doing with your life when most people your age have lovers, car, a job and you go out of your way to insult others? I think they are fully concious since they never seem to care about the victim or have any remorse and have a weird justification of their actions and always spill out sh\\*t but if you insult them back, they threaten to beat you up or tell you to look at how pathetic you are. Like okay? You don't like me but guess what? A lot of people don't like me but no one goes out of their way to bully me like you. It is almost like these people have everything in life and like, we all have insecurities. We all have flaws we wished we did not have.\n\nTelling me I am ugly or horrible or annoying, or have small breasts or ugly eyebrows or call me anorexic and generally spend your time thinking of making insecure someone who is already insecure is extremely bizzare. Like it is one thing to make fun of someone's shirt, it is another to be genlte with people your life, your parents to think you are the next messiah and an angel, to have a lover, a car and a life, and still make fun of someone who basically has no social life and struggles with mental illness. Isn't it really that simple as if you find someone weird.....just don't insult them or attack them? Isn't it that simple? Like if they have a huge nose, a big mole, are in a wheelchair or just do not share your interests, that doesn't mean you should point it out. While children can be cruel and overly honest, that is different from the people that act fake nice to everyone and choose a few victims and make their life hell because they do not fit their standart of what a person should look like and do with their life. Like thanks for telling me I will die and not have a boyfriend due to my boring personality, now I don't want to date anyone even more.\n\nAnd the weird thing is that they like to have control and think you are below them but get strangely offended when you offend them, like why do you care? I just want you to go away, and sometimes insulting makes such people go away but I can't imagine why society tolerates them and why they are so liked? They are not charming. They do not make you feel welcomed or good, they just feel fake. And this comes from a person who has PHD in fakes as an ex people pleaser who did that to survive. And even if they move on with their life they never miss the oppurtunity to comment on anything, Despite having a wild social life and actually a lover, it is as if they would drown you in water if you have a tiny bit of of food on your sweater that you have to look really hard to notice, while others who are already popular socially (whatever that means?) can afford having spots and looking dirty, because they are accepted, but no matter what you do, (drink water, breathe too loud, walk weirdly ?) you are damned.\n\nYou can't exist without your existance and everything you do, even going to the toilet be commented on. It is just...so weird and obsessive to me how some people in my life did that and I can't get over it, because most of it was abusive and I do not know how to process this memory. I would describe these people as extremely succsessful socially so if you have everything anyone could ask for, a lover (boyfriend/girlfriend) a job, be concidered attractive and hot, money, two alive parents, an apartment, car, and you have life outside of school, unlike me in high school, why would you go out of your way to make someone else who has no social life and no one to hang out with, ashemed of their existance and abuse them until they wished every single way that they wanted to die because no one likes them, no one loves them or at least you and your friends implanted these thoughts in their head for years and now have a great life and people love you, while you left someone in this world broken and bitter, especially if this person used to be a positive force in people's life before being abused to self harm and s\\*\\*cide attempts and is stuck with an ill mother and an alcoholic father and all she wanted was a friend to eat and hang out with during the weekend while you could afford an exbox, friends, great social skills, a lover that thinks you are the best person in the world even though you are a monster. I am anxious about work and the future and feel like a child since my parents didnt teach me how to take care of my self so now I feel like an invalid in a way because I also self isolated to avoid street harassment and lack core key experiences, lack will, give up easily and lack knowledge on adulting.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qc49ul/why_cant_people_who_are_intentionally_mean_to/", "title": "Why can't people who are intentionally mean to certain people to show off and think they are the coolest person ever, but in reality are an asshole or a bitch to pass time out of boredom, can't look at them selves from an outside perspective and see how pathetic they are, they make me anxious?", "social_network": "reddit", "user": "Soft-Clue-6345", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1634745894, "permalink": "/r/SuicideWatch/comments/qc49ul/why_cant_people_who_are_intentionally_mean_to/", "nsfw": true, "first_save": 1635426996.3011165, "replies_charged": false}