{"id": "t5_2qpzs_t3_o1qd90", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "My family have always been the type to believe in conspiracy theories, even before the age of Trump and QAnon.\n\nAt the start of the pandemic I noticed they were just not taking it seriously, the made themselves vocal that the pandemic is \n\n* Not real\n* A lab created bioweapon from china\n* And just a cold\n\nAs soon as lockdowns became a common experience, they grew further and further misinformed. \n\n\"It's just a democrat hoax\"\n\"Don't believe the fake news\"\n\nThen they went to masks. They refuse to wear them in public places and grew more and more hateful towards people that do wear masks. \n\nI ask my family, why? It's such a simple act that shows that you respect your neighbor and that you are being responsible with your health.\n\nI received similar conspiracy theories such as \"\n\n* Masks make you more sick \n* Masks are just a hoax, they don't do anything\n* The virus isn't real so why should I have to wear a mask\n* And finally \"I'm not going to be told what to do.\n\nEventually, I had several sit-down conversations with them on this, pleading them to wear masks for their health.\nI presented logic and reasoning, I cried during this - saying \"I am only having this conversation with you because I love you and need you to live a long life\" that is my motive, and nothing but. \n\nYou see, I have severe intrusive thoughts which resulted in thoughts of my parents and family dying from covid every day, and knowing that the risk is real and this could put them in a hospital or even kill them.\n\nYou could imagine how I felt when they acted like me bringing up masks was just me trying to argue with them, to disrespect them.\n\nThen the vaccine came out. I was so so so relieved. Finally! My family could take the vaccine and I could have my first real night of rest in nearly two years. \n\nOf coarse, they were against the vaccine. And this is not when the vaccine was in development stages - but when the side effects are known and millions have already taken the vaccine. \n\nThey receive their news from disgraced doctors and politicians, youtube channels, fox, newsmax, oann. \n\nI try and convince them. I ask them please, please do this. Please even if you do not believe in it do it for me. I cried again. Again, this was only brought up by love - not prodding for an argument. Of coarse my family sees it as me prodding, and I am met with verbal abuse. I have been called liberal p***y - a pathetic excuse for a son. Mostly from my toxic brothers, but the rest of my family just stands by.\n\nEventually I got them to promise me they will wear masks in church. - They lied.\n\nEventually I got them to promise me the will get the vaccine. - They lied again.\n\nTurns out they were only trying to get me off their backs. I am sure they never had any intention of following through with their word towards me. When this occurred, I realized that my family has zero respect towards me. They treat me different, look at me different. All because I try to get them to be informed and make rational decisions because I love them and nothing but.\n\nThey have done this over, and over for the past year and a half. I have dealt with it - and kept my mouth shut  for much too long. The amount of times I have stood up for something I think is important within the last two years I can count on my hands. \n\nEvery single time, I am met with verbal abuse, animosity. \n\nThey spread misinformation back and forth to each other every single day, and even things that I know are wrong, that I know are hateful - I keep my mouth shut, because I know if I speak up on these things, even if I am respectful with my intentions - it will result in my family threating me poorly.\n\nToday I received my second dose of the Moderna vaccine. As I go into the pharmacy - I hear \"you have to be careful when you come back because of vaccine shedding\". I shut my lips because I don't want to have an argument right then and there.\n\nI get my vaccine, again it went smoothly and no symptoms past a slightly sore injection site. I guess I'm lucky with that.\n\nAs I am walking out of the pharmacy I pull of the CDC's page on vaccine misinformation in which they talk about vaccine shedding, of coarse - they shouldn't even have to make these pages - but unfortunately people believe in very irrational things.\n\nI go back to the car and put my phone on the center console \"Please just read this\" \n\nShe brushes me off and says \"I have read it\"\n\nIf you have read it then you know that vaccine shedding is not a real thing. Of coarse she believed that it was real nonetheless.\n\nShe tells me, when you get back home - you are not allowed to hug or kiss your sister for two weeks.  (me and my kid sister is the closest relationship in my family, it feels like she is the only one who respects me)\n\nOf coarse my jaw dropped - I decided that this is one of the rare instances where I NEEDED to stand up for myself. I calmly say, \n\n*I will not discontinue showing affection for my little sister because of a conspiracy theory*\n\nMy mother blew up, I have never seen her so angry at me. She said some incredible hurtful things to me. All because of me standing up for myself, in an instance where it is imperative to do so.\n\nOf coarse standing up for myself is seen as disrespect in this house, even on something such as this.\n\nMy own mother told me - \n\n* All you do is tear this family apart\n* You do nothing for this family\n\n* She insulted me based on me voting for biden\n* For the entire drive it was a barrage of Insults at my character - I get frustrated with her. I tell her that this is not a normal, healthy belief, you have become conspiracy theorists, this is not ok. I did not directly insult her or act disrespectful, other than calling them conspiracy theorists.\n\nThis ended with my mother telling me, I need to move out right now.\n\nListing reasons being voting for biden, and always going against them on things (maybe 7 times within past two years?) \nTearing this family apart\n\nI can not remember what was said by her past this, I just know she said more hurtful things and in the end what I got from her is \n\nI am a disappointment to the family\nI do nothing but tear the family apart\nI do nothing for this family\n\nInsult after insult - then she called me a drug addict because I take Kratom. \n\nAll this because I feel like I have an obligation to inform my parents on things that are important to their health and wellbeing.\n\nI tell my parents that they have hurt me mentally over the past two years to an extent they will never understand. She responded with saying \"you are not the victim\" and further getting angry at me, acting like the family is the victim of me!\n\nI am so done. I have calmed down with them, as I will never go asleep hating each other - but I now know that these people are not the people that they used to be.\n\nI saw their true colors. They treat their own son like that, while I want nothing but good to them.\n\nSo here I am, having to sell my belongings so I can pack up and get far far away from here.\n\nI have realized that these people are toxic for me, and I can not be part of their lives unless they significantly change who they are as people, which we all know will never happen.\n\nAnd at the end, I need to move out - and the only decent person in this family (my kid sister) will be heartbroken, and so will I. \nI am crying as I type this.\n\nI do so much for this family. \nI am so hurt.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o1qd90/i_am_in_a_position_where_my_household_has_become/", "title": "I am in a position where my household has become toxic and emotionally abusive. I was told I need to move out - and I am at such a loss. My heart is broken and I don't know where to turn, my mind is going back into suicidal ideation.", "social_network": "reddit", "user": "DamnitDean", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1623911066, "permalink": "/r/SuicideWatch/comments/o1qd90/i_am_in_a_position_where_my_household_has_become/", "nsfw": false, "first_save": 1635427232.0574224, "replies_charged": false}