{"id": "t5_2qpzs_t3_nxbzuu", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "I was always fat growing up. In elementary school, I always thought I was the same as everyone else.  But the person that made me realize and feel different from others was my mom. She would call me fat which was typical coming from an Asian household. But along with her calling me fat over the years, she would try to put me on diets, starve myself, and exercise. \n\nShe would belittle me and say that I will never be successful because I am fat and ugly. She would belittle me and say that I am such an inconvenience because she has to pay and provide for me. She would list the prices of each ingredient she bought to make me food and remind me that I am a financial inconvenience to her. \n\nOne memory that really stuck with me for almost 6 years is when in high school, I asked my mom if she could buy me a shirt that was $20. She said \"You are too fat. You aren't worth the price of that shirt. Nice clothes are for the skinny people.\" \n\nMaybe one year after that, I went to lunch with my older sister and she called me \"embarrassing\". She told me that she was embarrassed to be with me because I ate like a pig. I didn't want to go anywhere with her again because I was scared to make her embarrassed. \n\nGrowing up I always admired my sister. She's 10 years older than me so we never really connected. I always thought I was an inconvenience to her because she would have to take care of me since my parents worked all the time. It was hard for me to love my sister when I was and still am constantly compared to my tall, skinny, beautiful sister. My mom always made sure that I knew how different I was and how pathetic I am compared to her.\n\nI always got excellent grades. I did numerous extracurriculars. I go to a good university. I was always obedient. But I am never good enough because I am fat. My sister was a rebel. She was never home and always out. She would speak her mind and say no to my parents all the time. But my parents didn't care. But when I stand up for myself in the moments that my parents pick on me, I am punished. I am yelled at. I am labeled as disobedient and a troublesome child. I get called a burden and reminded of how much easier my parents' lives would be if I was never born.\n\nWhy am I the burden? Does my mom ever consider the reason why I gained so much weight during my childhood was because I was always alone? I was always left alone at home since 6 y/o because my parents worked. To avoid boredom and loneliness, I would binge eat and eat my feelings away. My sister had a childhood filled with my parents in love where mine was filled with my parents' broken marriage and being lonely in my room. Does she realize that I choose to be fat and eat to the point of wanting to throw up because that's the only thing that won't hurt me, won't belittle me, won't make me feel lonely?\n\nI am not blaming my mom for making me fat. But I wish she understood that many of the things she has said and done really shaped the insecurities, the anxiety, the depression, the binge-eating, and trust issues I have today. \n\nI always wondered if she would even care if I told her that I attempted suicide in middle school. Would I have lifted the weight off her shoulders if I had succeeded? Would I have finally done something that would make her happy?", "url": "https://www.reddit.com/r/SuicideWatch/comments/nxbzuu/the_questions_that_i_wish_had_the_answers_to/", "title": "The questions that I wish had the answers to", "social_network": "reddit", "user": "Dapper-Examination", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1623404385, "permalink": "/r/SuicideWatch/comments/nxbzuu/the_questions_that_i_wish_had_the_answers_to/", "nsfw": false, "first_save": 1635427049.3576646, "replies_charged": false}