{"id": "t5_2qpzs_t3_kqth6j", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Why is it when you give your all to someone and they throw it away? I was with my girlfriend for almost 5 years we had a few bumps but we always fixed it. This last month I had been laid off from my job since I do seasonal construction, not only was I depressed because I couldn’t find a job, I’m struggling with on going depression and on top of that I am trying to hold a relationship up pretty much on my own, my ex had her own problems, her mom has cancer, she’s failing college and to top it off she works all the time. I woke up about two weeks ago after staying up all night figuring out what to do with myself and with her, I crunched all my bills and thought about ways to re spark that fire we had just a few weeks prior. I fall asleep and wake up the next day to a long text of her saying that she’s done with me and wants nothing to do with me, I freaked out but I didn’t give up hope I mean it’s happened before. I went to her house the next day and she cried in my arms kissed me and told me she loved me, she said that we will never be back together but she loves me, me being an idiot I had thought that it was a chance but unfortunately it wasn’t, I tried everything to win her back, I wrote her letters like how I used to, I texted her to make sure she was doing okay (she suffers from chronic depression) and fast forward 5 days later we had a conversation and she basically told me that she loves me but doesn’t care, she then blocked me on everything. I went to her house to see what I even did wrong and it turns out she was getting ready to go on a date with one of my old friends. I completely broke down in front of her. Not only did I lose someone who I completely changed for, I lose my dog, and her family that I called my family. I lost everything that I have ever cared for. It’s been roughly a month now and I’m just done. There’s so many questions I have that I can’t even ask and I feel nothing all I want is to end it. I know that that sounds pretty dumb but when I say I lost everything that I cared for I truly did. I have nothing left in me to go on and the more and more I think, the more it feels right to do so. I just needed to get this off my chest because I can’t take it anymore, thanks for who ever listens, peace.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kqth6j/almost_there/", "title": "Almost there", "social_network": "reddit", "user": "dizzydean7310", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1609832621, "permalink": "/r/SuicideWatch/comments/kqth6j/almost_there/", "nsfw": false, "first_save": 1635422316.0065608, "replies_charged": false}