{"id": "t5_2qpzs_t3_psbbuf", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351", "4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "Everytime I walk into a room I feel like I completely kill the mood. I don’t even know what I do wrong I just feel like people automatically hate me. I can’t conversate if my life depended on it (which right now it’s kind of feeling like it does). It feels like I walk into a social setting and everyone’s speaking a language I don’t understand. Imagine you’re sitting in a group with a bunch of people and they’re all speaking Korean and you’re just there nodding your head smiling awkwardly. You think they’re talking bad about you. You have no clue what to say. My mind is just blank and I’m silent. I think about suicide 24 hours a day 365 days a year. When I’m at work, school, doing groceries, at the drive thru in McDonald’s, when I wake up, when I go to bed, all day every day I think about blowing my brains out with a .45 hollow point or 12-gauge shotgun in the woods where nobody would let me survive and a helicopter can’t take me to the hospital in time to revive me. I don’t have anything against anyone I don’t have any hate for anybody other than myself. I’m the problem. I’m the one that has to change. I have acquaintances I talk to every few days briefly or so. I’ve told these acquaintances how I really feel and we have a short conversation where they show me pity and then never check up on me or ask to hang out. Which in hindsight I feel like this was a really stupid idea because why would I open up that deep to an acquaintance someone I barely know. I probably made them feel fucking horrible for something they have nothing to do with. Them never hitting me up makes me feel worse because I think that they’re thinking I’m some psychopath they want to avoid. I worry so much about what people think of me. Any small judgement or comment even from a stranger I take it extremely serious on myself and I’ll overthink about it for days. “What the fuck is wrong with me?” Is the question I ask myself every single day.", "url": "https://www.reddit.com/r/SuicideWatch/comments/psbbuf/i_hate_myself_more_than_any_other_human_being_on/", "title": "I hate myself more than any other human being on this planet", "social_network": "reddit", "user": "Downawful", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 189, "down_vote": 0, "creation": 1632198097, "permalink": "/r/SuicideWatch/comments/psbbuf/i_hate_myself_more_than_any_other_human_being_on/", "nsfw": true, "first_save": 1635423122.1922872, "replies_charged": false}