{"id": "t5_2qpzs_t3_84fxjf", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "As long as I can remember, I’ve been mentally ill. I have borderline personality disorder and recurrent depressive disorder. \n\nI have never been able to hold down a job, or make any friends, because as a teen I would lose my job or my friends as a result of my mental health- it was out of my control.\n\nBut now, as a 30 year old, the problem is me. I can’t get a job, because I am so anxious about losing it before I’ve even started, that it becomes a self fulfilling prophecy... I become avoidant, more depressed, then get fired as I’m not reliable... all self sabotage according to my mental health team.\n\nThe same goes for friends. As an adult, I have isolated myself from all social situations. I perfected being invisible in secondary school, as I was horrifically bullied. Now I don’t even give people a chance, I know they’ll eventually let me down, hurt me or abandon me, so what’s the point? I also don’t know who I am, and hate myself so much; my appearance, my failures, my whole life, in fact. I don’t understand why anyone else would like me or want to waste their time with me, when I can’t even stand me.\n\nI’ve wanted to die every day since I was 13. That’s 17 years of pain, suffering and hatred of myself. I’ve tried to commit suicide so many times that I’ve lost count. Each attempt has strengthened the idea that I’m a complete and utter failure, I can’t even kill myself right.\n\nI guess the point of this rambling is that I don’t know what else to try. My mental health team have said the only person who can break this negative cycle is me- but I don’t want to. I’m so tired of trying, and failing, over and over again. It’s exhausting. \n\nI don’t get enjoyment out of anything anymore- all my hobbies are boring, life is boring. I have zero motivation to do anything, along with no energy. There is no point to life. I’m probably never going to be able to work again, so I can’t contribute to my family financially, and I know I am a constant financial and emotional drain on them. I’m sick of trying new things, only to get bored and give up within a week or two.\n\nIt feels like someone has stuck my give up switch permanently on... I have given up, but I’m stuck in this place with no way out, because I can’t even commit suicide successfully. If anyone has any suggestions, I’d love to hear them. (apart from God, because I used to believe in God, but if he seriously loved us he wouldn’t let this screwed up world operate; where law-abiding, working class citizens have to constantly struggle, whilst the rich and powerful can do whatever they want with no consequence, and the other end get everything handed to them by the government. God rant over.)\n\nSorry for the long rambly post, hopefully someone understands what I’m saying!", "url": "https://www.reddit.com/r/SuicideWatch/comments/84fxjf/stuck_in_a_never_ending_self_destructive_cycle/", "title": "Stuck in a never ending self destructive cycle", "social_network": "reddit", "user": "taddi87", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1521053785, "permalink": "/r/SuicideWatch/comments/84fxjf/stuck_in_a_never_ending_self_destructive_cycle/", "nsfw": false, "first_save": 1635422558.5327466, "replies_charged": false}