{"id": "t5_2qpzs_t3_qbuutp", "request": ["56f46b9a-59d4-48f0-aed3-4247ea68706d"], "text": "My mom has a history of abuse to the family and emotionally instability. We all walk on eggshells around her and if we cracked one she won’t hesitate to yell, scratch or punish us. To this day since birth I don’t ever remember calling her out her name but she’s done the same almost every other day.\n\nLast Christmas the whole family was together where her gift to everyone was reading a note explaining she’s been wanting to commit suicide because she felt no one loved her and she’s been working to keep a roof under our heads but didn’t feel appreciated. She refused any love, affection and gifts we gave and she even blew up at me for calling suicide watch numerous times.\n\nThe past 10 months my brother, sister and I all moved out the house but I’ve temporarily moved back to my moms house so I can take care of my disabled dad living with her. Her birthdays coming up in exactly a month and all she wanted for her birthday was the entire family to come together and spend one night with her.\n\nIs it wrong for me to feel like she might murder suicide or just kill herself In front of the family? She’s extremely abusive dealing with depression, she doesn’t want anyones help, shes felt used, she wants the family to spend one night with her when she barely contacts anyone, she stays in her room closet everyday. And it’s odd that she knows there’s only two rooms, her and my dads room and the one bed guest room for 2 brothers and a sister all adults. Wouldn’t a family member that loves you doesn’t want you to sleep on the floor for fear of bacteria and bugs etc., or why 3 adults in one bed?\n\nI’m seriously thinking about this to the point where I’m planning what steps to take if anything happened. If she was going to shoot the family one by one, she’d kill me first the strongest, then my brother, sister, disabled dad then herself.  If she was going to shoot herself she might do what she did last Christmas and read a suicide note then put a gun to her head.\nShe could make us drink poison at the same time, or have a bomb set to detonate. I want to get police involved but I don’t have proof that it could get this serious other than her history.\n\n\nTL;DR: should I be worried about my abusive, depressed mom wanting to commit suicide or murder suicide on her birthday by having the family she doesn’t talk too spend one night with her as her gift?", "url": "https://www.reddit.com/r/SuicideWatch/comments/qbuutp/should_i_be_worried_about_my_mom_committing/", "title": "Should I be worried about my mom committing suicide or murder suicide?", "social_network": "reddit", "user": "CokeJersey", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1634712718, "permalink": "/r/SuicideWatch/comments/qbuutp/should_i_be_worried_about_my_mom_committing/", "nsfw": false, "first_save": 1635428317.9911664, "replies_charged": false}