{"id": "t5_2qpzs_t3_mui3jr", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "First off, C, I beg of you, don’t blame yourself. Sure, the reason I’m doing this is technically because of you, but that doesn’t make it your fault. You left me because it was the best option for you, that makes sense. So I’m doing this because it’s the best option for me. And yes both of these things are selfish, but that’s to be expected sometimes\n\nYou know, I don’t wanna off myself, I want to live my life, but I want a life with you, but I know that’s unrealistic\n\nI keep telling myself I’ll ask you out on June 9th, just in time for your birthday a month and a bit later so we could celebrate together. Just in time for summer, it would be so fun. \n\nbut I know you don’t want me, \n\nI know you don’t date your exes\n\nI know, you don’t have to tell me\n\nI love you, so much. You were the brightest light in my life for the short time we were together. You made me happiest just by saying hi, being with you was the happiest I’ve ever been. I love you more than anything, anyone. You meant the world and then some, still do. I just wish I meant the same to you \n\nTo my cats, Cody and Leo. \n\nI love both of you to death\n\nCody, you were so loyal, the best cat anyone could ask for\n\nLeo, man, despite you not being as all over me as Cody I still loved your antics. So little fucks given, you were like selectively deaf to everything except for food\n\nTo my Nana\n\nI’m sorry, I really am.\n\nYou were the only person in our family that I trusted, still didn’t tell you anything but I still trusted you the most, you were the sweetest soul, I wish you the best in life\n\nTo all my parents and guardians\n\nI love you all, but at times, fuck you too\n\nYou guys overworked me, wanted me to be perfect and forced me to be. Had to sacrifice so much time with C when I was with her to keep up with your bullshit\n\nStill, at the end of the day, I love you \n\nTo my friends and acquaintances \n\nI know you guys don’t really like me\n\nI know I’m the annoying one\n\nI know I’m not anyone’s best friend really\n\nI still love y’all \n\nThanks for somewhat sticking with me all this time, somewhat at least \n\nTo anyone else that may read this \n\nHave a good life, hug those you hold close, any moment they could be gone, you never know\n\nTo wrap things up here’s how it’s going\n\nI’m killing myself, I don’t know when, I don’t know how, I just know I want to, and as soon as I find a way and place and time to do so, I will\n\nWhy? C left me, simple as that. I wouldn’t off myself If I had any chance with her again, but I know I really don’t. \n\nAs for a will, C, you get first dibs, take anything and everything you want or need, but there’s a few things I want you to have\n\nTake my drawing tablet, I know how much you loved art, I want you to not be limited by pencil and paper\n\nTake whatever money there is left, and buy yourself a bubble tea,\n\nTake anything else you want or need, and no limit to how much shit you take\n\nTo the twins, take my laptop and gaming setup. It may not be the most powerful things, but I grew up with you guys, I want you to have it.\n\nTo Dboi, take my knives for your collection\n\nEverything else can be split up to however people want it \n\nAnd a final note:\n\nTo Reddit, I love you beautiful bastards. THANK YOU, for giving me a place to talk, for those who reached out, to those who are so kind, keep being awesome, you guys are the best\n\nAnyways, anyone who I didn’t mention no hard feelings I just forgot, \n\nFarewell yall, have good lives, hug your loved ones, and please, I don’t wanna be forgotten\n\n-A", "url": "https://www.reddit.com/r/SuicideWatch/comments/mui3jr/this_is_it_this_is_the_end_heres_a_short/", "title": "This is it. This is the end. Here’s a short explanation", "social_network": "reddit", "user": "xydrogen", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1618890937, "permalink": "/r/SuicideWatch/comments/mui3jr/this_is_it_this_is_the_end_heres_a_short/", "nsfw": false, "first_save": 1635428232.1803958, "replies_charged": false}