{"id": "t5_2qpzs_t3_q5lkef", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2", "0c6360e0-5fd0-41bf-97f4-d870570d8b8d"], "text": "I don't know quite know what to say but that's nothing new. I'm a social retard who can't even form a sentence, who can't have a normal human conversation. Right now I'll just say the first things that come to mind though, I don't care anymore.\n\nI hate myself, I always have and always will. I hate everything about me, and the things I hate the most are that which I have no control over and never can or will. I want to cut myself to ribbons, I want to make myself suffer to the greatest degree of agony I can before I go. I lay at times refusing to eat or drink, starving myself in hopes of death till I surrender to my weakness once more as I do.\n\nI've attempted suicide before, I'm no stranger to it alongside self harm. If only I was not released from the noose in an act of cruel fate in time now past, my suffering would already have long been over. This and other failures of the same kind were all in vain. Now all I can constantly think of is slitting my own throat, it's always on my mind. An act without fail, the joy of knowing a pathetic fuck like me would bleed like a pig in fear and agony before my fitting end would make it all the better.\n\nThe knife sits by my side, yet like a coward I still do nothing. Still afraid, as I always am. I pray for the mercy of death, yet it seems to be that my own (small shameful) hands are the only ones who will grant it. My heart is broken, my soul is crushed, my spirit dulled and my body crumbles away more and more every day.\n\nNow dear potential reader; why do I hate myself? Why do I want to die? Well I'm sure I could provide an infinite multitude of reasons. First of all I'm so very lonely, loneliness destroys me the most. Yet I am the very reason for it. Even if some kind soul decides to give me a chance (even though I don't deserve it), I just end up fucking up again and again. I just turn into a freezing stuttering mess, my brain freezes, mind goes blank, I can't say a single sentence and don't know what to do, forever unable to form any or maintain any kind of relationship. Even over text I can't even manage to respond. I know it's my fault but I just don't want to be so alone, I can't take or handle it anymore.\n\nSecondly my awful body and it's dire health. My body is pathetic and disgusting, I despise it with all my being. My health grows worse every passing moment, I can't do anything because of it, like a prisoner. Everyday I'm filled with both pain and shame unending, physically and mentally (throw OCD in alongsidethe anxiety to really fuck shit up). What do I hate most about my body though? Usually this is my greatest shame, the thing I'm most embarrassed of and would never say. But fuck it you don't know me, I'm anonymous so who cares. I have a little small, tiny and pathetic penis, not even fit for purpose. 4 inch erect and 2 inch flaccid if you're curious. I know you already think less of me now, don't worry so do I.\n\nI'm a joke, a lesser man if I could even be a piss poor excuse for one. I mean no one could ever love me anyway, but imagine them seeing that? I'd always be a joke. I'm too afraid to ever let myself be that vulnerable and just get laughed at, the little cowardly stuttering virgin and his tiny dick. Hardly a catch am I? I'll never be a real man no matter what I do, nor will I ever know the the joys of love or having someone there by my side. These are just realistic facts I've had to accept.\n\nSomeone loving me though? Now that's the biggest joke. I wouldn't love me, I doubt anyone else in their right mind would. Anyway, I guess I've rambled long enough now. I've not exactly got anything of value to say anyway, I never do. If you read this though, thank you for at least acknowledging me. Now enjoy your laugh at me, I accept and understand it. I'll be gone from your mind soon anyway, just another worthless soul gone and forgotten from this world.\n\nFarewell stranger, I can only hope you're doing better than me. Take care!", "url": "https://www.reddit.com/r/SuicideWatch/comments/q5lkef/im_so_tired_i_just_want_to_end_it_all_the_fire_of/", "title": "I'm so tired, I just want to end it all. The fire of my soul faded long ago... No one will probably read this nor will anyone care, but that's nothing new to me really.", "social_network": "reddit", "user": "X_Shy-Sad-Boy_X", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 20, "down_vote": 0, "creation": 1633916780, "permalink": "/r/SuicideWatch/comments/q5lkef/im_so_tired_i_just_want_to_end_it_all_the_fire_of/", "nsfw": false, "first_save": 1635425167.5662997, "replies_charged": false}