{"id": "t5_2qpzs_t3_pmyt5g", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "So the pills I'm on lethal dose is about 4000mg. I've saved up to 3925mg. The lethal dose does change depending on your body weight so I'll probably need more than 4000mg. Next Friday I'm getting my prescription meds which should be about another 4000mg for the month, give or take. I'm on a mood stabilizer which is very ineffective because I'm not getting the right dosage and is not 100% the right prescription I should be on anti depressions too. I have Bipolar 2, Borderline Personality Disorder and anti-social disorder or atleast have been diagnosed with these diseases. My life is not a bad life it's just that my family don't really know how to work with me and think that my depression because of these diseases is something I can build a bridge and get over it.\n\nI have tried to kill myself on 3 different occasions but have been stopped by my family before I could even attempt it.\n\nIt doesn't help that me and my trans girlfriend broke up like 3 weeks ago. We are still friends but she is not as supportive as she used to be and we don't talk often. I am afraid if I tell them I have a plan to kill myself they would notify my family.\n\nI'm an atheist and don't believe in the concept of heaven or hell. I think when u die there is nothing afterwards. I do like the Buddhist concept of reincarnation, well I think it's them that believe in it but I'm not going to put my hopes on it.\n\nI'm kinda feeling that I'm over sharing but that's fine I've been like this for the last 3 years. \n\nI do self harm on occasion. I've last done it like 4 or 5 days ago. I took a lighter and burned myself on my wrist and forearm. I want my family to be more supportive. Recently my family have gotten a lot less supportive and it doesn't seem like they care as much it seems they are fed up with my suicidal ideations.\n\nLike I said my life ain't that bad. It's just the thoughts of suicide and the depression is overwhelming me. I can't take it anymore. I plan on killing myself on Friday the 17th of September.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pmyt5g/wanna_kill_myself/", "title": "Wanna kill myself", "social_network": "reddit", "user": "Janus_Aeyer", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1631473278, "permalink": "/r/SuicideWatch/comments/pmyt5g/wanna_kill_myself/", "nsfw": false, "first_save": 1635427457.2206173, "replies_charged": false}