{"id": "t5_2qpzs_t3_n29ti1", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "How do I never overeat again?\n\nBeforehand: do not comment a dietary plan. \n\nI have had a problem for the past year and a half where I fly off the handle and will eat 7000+  calories at once and be incapacitated for a day or two. This has happened twice in the past 4 days and it cost me my first full time job only a month into employment. \n\nI’ve tried eating an entirely medically controlled diet in an inpatient clinic. I overate like this immediately again after weeks of treatment. I have tried just about every diet possible. Please do not answer this with a diet recommendation. I know the exact diet that has occasionally allowed me to go a couple weeks without overeating, but right now it seems impossible for even that to help because whenever I try to follow it I overeat very quickly. \n\nI have a one room apartment (a quad) where I’ve stolen food from the communal fridge, but for the most part it’s easier to stick to my diet in that place. Because I have poor mental health and lots of bad memories have tainted the apartment I am currently living with family at their house within the same city (they know all about my problem) and them simply having food present has allowed me to do this and lose my job. \n\nPlease, tell me what I need to do. I am right now looking into purchasing methamphetamine to try and do anything to stop these obsessive cravings that literally stop me from sleeping a few nights a week, and most of the time keep me from being able to focus on anything I’m doing in the moment (I’m only thinking about food)", "url": "https://www.reddit.com/r/SuicideWatch/comments/n29ti1/suicidal_ideation_over_overeating/", "title": "Suicidal ideation over overeating", "social_network": "reddit", "user": "Lordd_Humungous", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1619838522, "permalink": "/r/SuicideWatch/comments/n29ti1/suicidal_ideation_over_overeating/", "nsfw": false, "first_save": 1635427273.414906, "replies_charged": false}