{"id": "t5_2qpzs_t3_o9kl1h", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "Hi!  \n\nMy situation: \n\n- narc mother, no contact for almost 2 years, she was never a real mother to me, the biggest abuser in my life (left when I was 14)  \n\n- father (lived with him 14-17) with a new woman since I was 16, she utterly despises me because of misunderstandings/stereotyping me and cannot comprehend that she shouldn't hold teenager-behaviour against me when I am in my 30s now - so basically I've no father, we never spend time together, barely have phone calls. he seems somewhat interested in my life but 0 emotional support ever.  \n\n- boyfriend with anger management problems, very fragile ego, have  to manage his emotions so he doesn't spiral so I sacrifice my mental wellbeing to maintain his, otherwise we are both down and that's worse for me  \n\nDon't have any family, don't have anyone who truly cares, I am probably codependent because I desperately need at least 1 person to LOVE me, so when I feel he doesn't, I am panicking inside and break down. I need reassurance I don't always get.   \n\nTried one therapist, he was shit and abandoned me too, so I'm afraid to start looking for someone again.   \n\nI was(am?) relationship-dependent and always loved the other person more than they loved me. I am always abandoned, so I barely try to make or stay friends with people because I'm afraid they will stop caring, so I barely interact and the friendship just dies. \n\n\n \nI have sometimes very strong suicidal thoughts, like this weekend/today, but I don't have guns and other ways don't appeal to me. I took half of my ADHD medication so now I am chatty and I can write this out.  \n\nBasically I feel alone, with not much hope, becaues I cannot have suddenly a family that cares about me, it just won't happen. There is much more to my story but it would be too much for a post.  \n\nI am getting triggered by anything, for example physical photos, seeing other people even just have them. Thinking if I would disappear, my own father wouldn't even have one piece of picture of me. How can a person ever recover from this much lack of care?", "url": "https://www.reddit.com/r/SuicideWatch/comments/o9kl1h/can_we_ever_recover_from_a_lifelong_lack_of_care/", "title": "Can we ever recover from a lifelong lack of care?", "social_network": "reddit", "user": "annalousia", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1624887985, "permalink": "/r/SuicideWatch/comments/o9kl1h/can_we_ever_recover_from_a_lifelong_lack_of_care/", "nsfw": false, "first_save": 1635428214.1575203, "replies_charged": false}