{"id": "t5_2qpzs_t3_q9jo20", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "I know this sounds really fucked up, but I honestly resent my parents. My stepfather has always been kind of a dick and my mother has always enabled his behavior. I looked up what toxic parenting looks like and they both fit the descriptions to the fucking dot. \n\nFor some backstory, almost every single attempt (including my most recent, which this story stems from) has involved me trying to give myself alcohol poisoning. If I am being completely honest, I really don’t like alcohol that much. My parents however think I am some sort of alcoholic due to all of my failed attempts - they refuse to believe I am suicidal and think I am feigning suicidal tendencies as a front for alcoholism. \n\nMy most recent attempt (maybe two months ago) was no different. I kept drinking and drinking, and I honestly was really excited because I thought that I’d succeed that night. My stepfather caught me getting more alcohol though. \n\nFor the longest time, I’ve recognized that I’m too much of a pussy to choose any other method, so a while ago I decided that if I was ever stopped again, I would just tell my parents I have a drinking problem rather than letting them know I am trying to commit suicide. My reasoning for this is that I honestly resent my parents. We don’t really talk (small talk pisses me off and that’s all they know), we don’t do anything together (they’re always together; they’re always “tired” so that means they can only watch their show rather than one we both like), and the list goes on. Because of this, I decided that my parents don’t deserve to know how I am really feeling if we never have any normal fucking conversations other than “how was your day”. \n\nSo when my stepfather caught me, I just said “I have a drinking problem”. That was that. I can’t really remember the entirety of the night for reasons that I have made apparent but I remember texting my older sister and her boyfriend what really happened. \n\nNow time skip to the next day and my mom is like “What the hell were you thinking” and for some reason I tell her the truth. “I was trying to kill myself.”\nThen I left for school.\n\nI don’t dislike my mom as much as I do my stepfather (I love my mom in all honesty) but my stepfather made sure to convince my mom I couldn’t have possibly be making another suicide attempt and instead was feigning. Now whenever she doesn’t think I’m listening talking to someone else she will be like “He tried telling us he was trying to kill himself but he told ___ that he had a drinking problem”.\n\nI want to stab myself in the fucking neck just for them to be like “how could we have known” when in reality I actually told them.\n\nI apologize for how incoherent I must sound. I’m writing this with a jumbled mind and I doubt it is easy to understand. I’ll be happy to clarify anything.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q9jo20/parents_are_stinky_smelly/", "title": "Parents are stinky smelly", "social_network": "reddit", "user": "jackaroniandcheese", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1634415306, "permalink": "/r/SuicideWatch/comments/q9jo20/parents_are_stinky_smelly/", "nsfw": false, "first_save": 1635425271.9710846, "replies_charged": false}