{"id": "t5_2qpzs_t3_lk4hhm", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I worked hard, I got into med school, I volunteered, I worked out, I got involved, I talked to people, I kept friends, and I burned the fuck out. I got so fucking tired of sucking up to everyone, living by the clock, planning every single minute to maximize my productivity, being the hospital bitch, having my ass handed to me on a platter only to go home and study, feeling like nothing I do is ever enough. I worked so fucking hard and I keep underperforming. I was told that if I jsut put my head down and stay focused I would have a successful career and be happy. Well guess what, I am lonely as fuck and constantly stressed. Nice to know that the next phase is just as stressful if not worse with the amount of abuse residents endure on a day to day basis.\n\nEvery time I talk to anyone I'm idolized for being in medicine. you must be so smart! you must have all your shit figured out! Well guess what, it fucking sucks out here, I can't even enjoy talking to patients because I'm so anxious about getting my shit done on time or risk looking like a loser. I took time off to get better and all it did was make me more isolated and more alone. \n\nI don't know what the fucking point is. Every time I pass an obstacle I think this is fine because one day this will all be worth it, I will feel happy and fulfilled and feel accepted. What a fucking joke. No one takes me seriously because I'm quiet and my anxiety keeps taking over whenever I make a mistake. \n\nGet help! It will all be better! Yeah right. Try telling a doctor that the reason you want to kill yourself is because you can't endure the same shit they had to do. They pretend to care but in reality they see me as weak, I'm not allowed to be fucking human because I decided I wanted to be a doctor.\n\n Well fuck the day I decided I want to be a doctor because if feeling inferior and anxious and alone is all I'm going to get out of it I don't want this shit anymore. But I can't quit, because I'm 200,000 dollars in debt and I endured so much just to be the fucking loser who can't make it through med school.\n\nI can't even enjoy anything anymore because all I can think of is how trapped I am in this hell hole of either being stressed and anxious or dropping out and having a ridiculous amount of debt. I have no hobbies or outside interests because the process of getting in and making it ot the other side was so bloody consuming. Sorry, now that you've sacrificed your soul to get in you now also have to sacrifice your sleep, any semblance of a social life you once had, and your sanity so that we can pump you through the fucking system. And by the way, now that you had to take time off, good luck getting licensed anywhere in the world with MENTAL HEALTH written on your record.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lk4hhm/i_did_all_the_right_things_and_im_still_depressed/", "title": "I did all the right things and im still depressed", "social_network": "reddit", "user": "kamhamshazam", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1613359256, "permalink": "/r/SuicideWatch/comments/lk4hhm/i_did_all_the_right_things_and_im_still_depressed/", "nsfw": false, "first_save": 1635428258.3929954, "replies_charged": false}