{"id": "t5_2qpzs_t3_qa3d9d", "request": ["0c6360e0-5fd0-41bf-97f4-d870570d8b8d"], "text": "TW rape, abuse, etc\n\nHey. Sorry for my English. I'm a 20yo.\nI've been going through hard times since birth. My mom was abused then kicked out of her home at 18. She met my dad, he offered her to stay in his house, and never let her go. Then me and my brothers were born. My dad stopped beating my mom in front of us when we started getting old enough to remember. But he switched to mental abuse. Like screaming, destroying the apartment, etc. Me, a 5yo children, had to protect myself, my mom and lil brothers, against that terrible monster that was my dad. If he had lost his socks, just for that silly reason, we will be going through hours of screaming, insults, etc. My mom did her best. Our home, which was a small apartment, was dirty af, with cockroaches everywhere. I was living a nightmare. Really young I started suffering from depression and suicidal thoughts. I told myself I needed to kill my dad before killing myself so that at least my family will be safe. I never did. I wish I had. Then I started going to middle school. I started experiencing harassment. I found support online, but I was soon approached by adult males. They were listening to me venting, supporting, caring. I thought it was love. I started sending my first nudes at 10. I didn't liked it but I knew I would loose they \"love\" if I wasn't doing it. They shared it in public. My parents, the school, my classmates, no one knew. I still called the cops with my friend but they didn't cared. I went through my family situation and school situation plus the never ending relationship with older men online until I started highschool. A little before that, my dad hurt my mom on the head with the window, and she had a stroke. We weren't sure at all she will survive, but she did, with a completely changed personality and loss of memory. she was like an elderly, at 40yo. I had called my big brother so that she could see her before her death when we still thought she was gonna die. He raped me. I was 13, he was around 22. That's when I got broken. The cops were laughing at me. They were laughing at the little girl in the room next to mine. I was hearing everything. They were obviously thinking I was lying. After that, nothing was ever the same. I was so broken and I still am. That's when I knew things couldn't be ever saved. A few months after my mother's stroke, I managed us to go in an orphanage. My mom stayed at an homeless house. She still is. I somewhat managed to finish highschool. I started studying English and here I am. I can't do anything. My apartment is a mess. I barely eat but I feel hungry all the time. But I can't cook. I'm too tired to cook. I obviously suffer from mental health issues but I also have medical issues. Not so long ago I started losing holes of hair on my head. I'm fat af. When I see myself in the mirror, I see a young girl who looks like she's already old. I'm dirty because taking a shower is too much. I don't brush my teeth. I smoke as hell. I spend my days in bed. There's nothing beautiful in me. I'm disgusting. I always have either headaches, back pains (I have a disease), my wrist or knees hurt. I have a gf but she's already struggling. No one knows I want to kill myself. Everyone see me as the brave 20yo who still manages to keep going even with my rough past. Well, I can't. I have no money. I'm currently at university, but I know I won't go through it. I'm not even studying, how could this even work ? I can't eat, I barely manage to sleep, I can't shower, I can't clean, how could I study ?? If I fail my studies, my monthly amount of money will be gone. I will have no money to live on. I know I need to keep going in order to survive, and I kept going for a little while, but since I'm 18 I really don't want to live anymore. I was planning on killing myself after highschool, so I never imagined what my future could look like, and I'm completely lost. I just want to end this all. I wish I could live but I'm just too tired. And if I just take a break, I'm homeless. I'ld rather die than to go through homelessness. I'm venting here because that's the only place where I can. I'm sorry.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qa3d9d/im_too_tired_to_keep_going/", "title": "I'm too tired to keep going", "social_network": "reddit", "user": "Far-Wafer8430", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1634491828, "permalink": "/r/SuicideWatch/comments/qa3d9d/im_too_tired_to_keep_going/", "nsfw": true, "first_save": 1635426273.5727332, "replies_charged": false}