{"id": "t5_2qpzs_t3_a7jy8w", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "Im just so done. It's been years of this, and it hasn't gotten better. Everyone says, it'll get better, nothings forever, and I used to believe them, until I graduated highschool. I thought things would finally be different for me, things would finally start looking up. But at university I developed an eating disorder and was tormented everyday by the potential of seeing my childhood sexual abuser walking on the same campus as me. My parents knew he would be there for months before, and they did nothing to try and prevent him from attending my dream school. I dropped out, 20 pounds lighter and ten times more traumatized. I didn't even finish my fist semester. I'm such a disgrace, an idiot, a failure. And now I'm back here, in my childhood home, surrounded by the years of agony. I've cried so many times in this house, I've screamed, I've bled, I've done every drug on the face of the earth here. I hate living here. But theres no where else I can be. I spend all my money on drugs and useless things that make me happy for a few hours until I need to go buy more things. My two friends always talk about moving out but one doesn't want to move until next year and the other is lazy and won't get a job until her mother stops buying her drugs (which wont happen). I'm woken up everyday by my mother getting mad at me about something. She's always nagging me and getting mad at me, taking everything out on me. My father doesn't talk to me, he hasn't for a good year now. It's better than him verbally and emotionally abusing/neglecting me like he had for the previous 17 years of my life. My poor brother has to live with me. He has to put up with my rollercoaster of emotions, me making the parents mad, putting the whole house on edge for years. But at least he's my parents favourite. I don't want to hurt them, but I'm so fucking tired of this bullshit. Life is bullshit. My mother has told me that if I were to kill myself she would either do the same or become and alcoholic. Sometimes I think about killing them and then myself. It's fucking crazy I know, but I don't want them to live a life as horrid and painful as mine has been. But I can't make that decision for them. Anyway, maybe they should think about what they've done. Allowing me to be abused for years. Sure, maybe they didn't know. But it was their job to know. Why would you let all the things you saw continue? Both of you allowed such an inappropriate relationship to grow, you encouraged it. And it turned into the thing that will be the death of me. I will never get over everything that happened. I will never forgive myself, the two of you, our whole family, I will never be at peace with it. I hate myself. I did it to myself too. My therapist tells me that I couldn't have known any better but I did. I knew it was wrong, but my disgusting self couldn't stop. And so I don't think I deserve to be here anyway. If this life shit is so amazing, I don't deserve it. I'm so fucked on so many levels, I barely feel human sometimes. So I should be put down, like the animal I am. The future is so bleak. I will never be happy. You can all argue with me as much as you want. I don't have a crystal ball. You're right. But I have been doing this fucking shit for years. So fucking tell me it gets better again. Keep telling me how much better its going to get. Tell me that until I'm dead. Fuck this. Fuck all of you. And most importantly fuck you, me. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/a7jy8w/tired/", "title": "tired", "social_network": "reddit", "user": "uuuugughhghhh", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1545201603, "permalink": "/r/SuicideWatch/comments/a7jy8w/tired/", "nsfw": false, "first_save": 1635426294.308435, "replies_charged": false}