{"id": "t5_2qpzs_t3_q3lq5b", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "No.1001 of things not to say in response to someone that takes the courage to carefully disclose to you that they're genuinely struggling and at risk of suicide:\n\n\"I'm not worried. Whatever happens to you, I feel and trust that the universe is unfolding as it should be\"\n\n~ I'm sorry, what? No, just no. To most suicidal people hearing this I think would hurt them and have them feeling more sense of alienation... but to someone who has also experienced indescribable spiritual, cult traumas, and extreme malpractice, manipulation and exploitation from quote on quote \"spiritual teachers/healers\" and their communities... just NO!\n\nFor me it feels like this experience I've just had reaffirms again why I don't feel safe with anyone. That there is no point in ever trying to disclose how I feel, and what I'm going through. That there is no point in taking the risk in asking and hoping for any measure of baseline support from another person. All I want, and I'm sure others can relate to this - is to be truly heard. \n\nI'm really sorry for venting this here. I can't know with certainty that other suicidal people would be upset to be told the words I just was because we are all different, but I at least feel this is the only group/place I can share something like this, where maybe someone might understand where I'm coming from, and how I feel. \n\nI feel indescribably angry and hurt by how I was responded to. My cptsd is so triggered that I've been crying. I hope sharing these words doesn't bring anyone here down, because I empathize that many of you are already going through so much as well.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q3lq5b/no1001_of_things_not_to_say_in_response_to/", "title": "No.1001 of things not to say in response to someone that takes the courage to carefully disclose to you that they're genuinely struggling and at risk of suicide:", "social_network": "reddit", "user": "dear_pixel_heart", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1633650459, "permalink": "/r/SuicideWatch/comments/q3lq5b/no1001_of_things_not_to_say_in_response_to/", "nsfw": false, "first_save": 1635427901.8346539, "replies_charged": false}