{"id": "t5_2qpzs_t3_ay3f27", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "Bear in mind I’m only 20. 1. When my mother was pregnant with me she (we) we’re home homeless and slept on a park bench for some time 2. All the way up until high school when it finally ended I was severely bullied both physically and verbally (Punched in the eye, dragged across the dirt, thrown rocks at, called fat ass and cry baby) 3. I’ve suffered from a wide array of mental afflictions (Depression, anxiety, paranoid delusions, pure ocd - causes unwanted horrific images to pop up in your head over and over again) just recovered from my last episode which involved me nearly throwing up, having panic attacks, breaking down crying for weeks on end. 4. Family losses (lost my grandfather to lung cancer, one of my cousins to suicide, the other was stabbed repeatedly and bled out on their way to the hospital) 5. Was witness to domestic violence where my mother would be pinned up against a wall and screamed at 6. Was kicked out of the household I was living in two years ago because someone falsely accused me of making a suicide pact with someone and labeled me “dangerous” because of my mental health, even though I don’t have the heart to hurt a fly. 7. Quite a few heartbreaks when it comes to romantic relationships leaving out the details as of right now. 8. My mom and I were given a short time by family member to move out and find somewhere to live once 9. Dropped out of high school ( this is my fault of course) 10. the damage Pmo has done to me 11. Self harm issues in the past I can keep going. I’m just surprised I still have humanity and I can treat others well.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ay3f27/why_i_want_to_give_up/", "title": "Why I want to give up", "social_network": "reddit", "user": "Lostsoul2030", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1551903678, "permalink": "/r/SuicideWatch/comments/ay3f27/why_i_want_to_give_up/", "nsfw": false, "first_save": 1635427723.2165334, "replies_charged": false}