{"id": "t5_2qpzs_t3_inpabb", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "A rant. Not much else. I just know people here will be able to understand what feeling suicidal is and why I am in a constant state of suicidal thinking. If you don't read further I will understand. It is long. Either way I wish you well.\n\n&#x200B;\n\nI get crippling migraines when exposed to certain color/intensity light. Funny enough, the big fusion ball in the sky we call our Sun happens to be exactly what can trigger it. So, I live in a dark secluded room. I come out barely to prep food and normal stuff like using the restroom. I am trying my hardest to maintain a normal shower schedule though I sometimes forget for a few days. I feel like garbage after that. Anyway.  \n\n\nI also have been cursed with a lovely problem of a intense pain in random locations throughout my body which exhibit different feelings. Yay me. Be it burning sensations in the feet. The needle sensations in the arms and legs. Shocking sensation that goes from the back to my chest. Stabbing sensation in my back and sides. The sharp shooting from the neck down the arms. Even the slightest touch can at times trigger a pulse that will travel throughout my entire body and it feels like every muscle fires at the same time. I tense up for a second or two and then my body goes back to normal except now everything is hurting 10 times worse and it can last for a few hours.\n\n&#x200B;\n\nYour \"loved ones\" come to you to \"help\" but every word or touch is like a dagger being stabbed into my brain and body.\n\n&#x200B;\n\nOh oh and the occasional twitch that hurts but I can't control happening is also really lovely. I hate it. I hate it all.\n\n&#x200B;\n\nOf course the mental stuff has to be thrown in. A large mental illness list. A bunch of horrible child abuse past mixed in with neglect. You end up with a chronically suicidal person who never received proper treatment for over 29 years. I really am a broken person.  \n\n\nI turn to drugs (Weed) to numb the pain but it keeps building. You can only get so high for so long before you either switch to something harder or you hit the stop button.\n\n&#x200B;\n\nYeah, I go to the doctor and what not and he just runs more tests but it shows nothing. They are clueless, or at least he is, and I am at a loss. The therapist seems to be jerking me around right now. She's quitting her practice and seems to have just checked out in the caring department.\n\n&#x200B;\n\nI can't take it much longer. It's only going to get worse. I hate my body.\n\n&#x200B;\n\nSorry if you read this far. No happy ending. I really truly hate this prison I am in. I promised my mom I wouldn't leave before her and I'm trying to hold to it. Also she pretty much told me I'm not allowed to leave before her anyway. I don't have that right she said.\n\n&#x200B;\n\nIt's not easy to ignore my exit plan.", "url": "https://www.reddit.com/r/SuicideWatch/comments/inpabb/i_cant_take_this_pain_much_longer/", "title": "I can't take this pain much longer.", "social_network": "reddit", "user": "-MajorTemplar-", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1599410711, "permalink": "/r/SuicideWatch/comments/inpabb/i_cant_take_this_pain_much_longer/", "nsfw": false, "first_save": 1635422318.6248398, "replies_charged": false}