{"id": "t5_2qpzs_t3_qf617n", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42"], "text": "I'm just so tired. Tired of waiting for therapy to roll around again. Every day I'm just thinking \"hold it together til Tuesday for therapy\" - even Tuesday nights, after therapy, I find myself back to that awful feeling. \n\nThe earliest I remember feeling suicidal, I was about 3 years old and I was praying to not wake up in the morning. Nobody knew. First attempts age 13. Nobody knew then, either.  More attempts and then inpatient stays at 19. Now at 25 I'm just. So. Tired. \n\nI'm trying to build connections as I'm incredibly lonely, however I'm autistic and if I'm not overwhelmed by social anxiety anyway, when I do try to make connections, it usually unravels pretty quickly as people just see me as weird. And if I do manage to begin friendships, I'm exhausted afterwards which usually triggers meltdowns with suicidal thoughts. I've tried finding actually autistic support groups to meet like-minded individuals but the only groups that exist are for the parents\\carers of. \nI've recently gone no contact with my parents for multiple reasons but when they were in my life, I was so desperate for companionship that I'd visit them even though I knew they'd trigger me further. My brother constantly tells me that everything I do is a choice (he doesn't believe that autism is a thing) and I'm choosing to be suicidal (he even believes you choose to have goosebumps or babies reflexes and trauma responses) and the rest of my family and I just don't seem to click. \nThe only friends I do have are online but that in itself can feel super isolating and hard to build emotional  connections, nevermind physical. I'm so desperate for a hug. \n\nSupport wise I have carers that come in 3 times a day to help with meals but there's about 20 of them so building up a rapport isn't easy. Also as I mentioned, therapy once a week. \n\nAs for purpose.. I really wanna help other disabled folks (I have multiple conditions) but at the mo I can't do much at all so that seems so far off. \n\nI know meeting those human needs will help me a lot but I feel lost when trying to achieve them and each time I fail, it hurts more. \n\nMy suicidal thoughts can be triggered by so many things. The big ones are society, loneliness, frustrations and not being understood. I also hate having a psychical body - even before I had physical health conditions, it's just exhausting. Reading people, trying to translate myself to others, meeting basic needs, sensory aspects etc. I often wish we were just energy that is able to communicate or sentient fart clouds. \nSociety really hurts me. Injustices, poverty, war, corruption. I don't want to be a pawn in this game anymore. \n\nAnd then there's emotional triggers - parents, animals, memories of abuse\\flashbacks, anxiety, depression etc \n\nI wouldn't say my physical disabilities have a direct impact but for example, today I did something I haven't done in months due to pain. What used to take me 2 hours took me 9 hours and was not up to my usual standard. Initially I was proud of me for just doing *something* beyond meeting basic needs. But once I'd finished, the frustration, pain & feeling inadequate became overwhelming. There was a time I wanted to do this as a career but that seems so unlikely now. \n\nI really wish I could just give in and say \"enough\" and put myself out of my misery. It's starting to feel like I'm just lying to myself now - every \"it'll get better\" and \"you'll get there\" \"you're deserving of living\" etc are just lies to me now. The years of therapies and counseling and medication and assessments. I've had enough. \n\nI find it weird that there's no longer a self esteem portion anymore, too. I used to believe I was awful and undeserving. Now I know my worth. I know I can do great things if I had support. Heck, I do do great things as is. But I still don't want to be here. \n\nThe only reason I haven't attempted more recently is the fear of failing and leaving myself with even more illness and conditions to try and manage. I wish I could find it in me to just bite the bullet and end the suffering.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qf617n/wish_i_had_the_balls_to_go_through_with_it_22/", "title": "Wish I had the balls to go through with it. 22 years of suicidal thoughts and I'm exhausted.", "social_network": "reddit", "user": "ThrowAwayAcc1259", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1635125376, "permalink": "/r/SuicideWatch/comments/qf617n/wish_i_had_the_balls_to_go_through_with_it_22/", "nsfw": false, "first_save": 1635427320.0419087, "replies_charged": false}