{"id": "t5_2qpzs_t3_q4xgwp", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I feel so inadequate and inferior all the time. It is draining my energy to sit in my room all day ruminating about insecurities and doubts as stress inducing scenarios enter my head confirming my already deeply embedded beliefs about me being inherently awful in every aspect of my life. I have big dreams and actively work towards them and study nonstop for the career I desire, but that leads to me neglecting more and more practical matters like self-care and homework. \n\nI decided to improve my depressed mental state via running and walking around observing nature instead of having my eyes glued to a screen. Fixing my thought patterns and employing strategies of reducing negative thoughts impacts. Even though it helps... these thoughts are so ingrained into me that it is significantly arduous to just destroy them like that. I know it is a process and won't take one night and it is an active effort... that would be fine and dandy if I didn't have a mental breakdown, screaming at the top of my lungs staring down at a knife wanting so badly to stab my leg. Then I looked desperately for alcohol to self-medicate from the emotional pain I was experiencing but my efforts were futile. I decided to take 14 stress vitamins in one sitting and sipped on a ton of coffee... pretty self-destructive, but it did ease the pain however that could be the result of the placebo effect. This happened recently today and it came as a surprise because of how sudden my mood went from 0 to 100 in a minute. I saw something a bit triggering that normally wouldn't elicit this type of reaction but my mind was depleted on all mental and cognitive resources to effectively deal with it, I snapped. I wanted to escape, not die, just escape the pain. These mental breakdowns are not rare nor uncommon. I am under so much stress that even when I am relaxed I feel utterly anxious by going through mental compulsion and creating threats inside of my mind. I try endlessly to stop it, but it is difficult to do that when it occurs so frequently. I feel like I am running away from an inescapable destiny of suicide. I just don't want my parents, sister, boyfriend to deal with the aftermath.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q4xgwp/i_feel_so_suicidal_that_i_accepted_it_as_a_normal/", "title": "I feel so suicidal that I accepted it as a normal emotion", "social_network": "reddit", "user": "LivingInError01", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1633825454, "permalink": "/r/SuicideWatch/comments/q4xgwp/i_feel_so_suicidal_that_i_accepted_it_as_a_normal/", "nsfw": false, "first_save": 1635427998.3947866, "replies_charged": false}