{"id": "t5_2qpzs_t3_iy9doj", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "Why I'm posting. I was one of those 'trolls' as someone might've called it for a few days because I didn't want to join and act like I'm crying out for help when I know I could say something and friends might be there for a short period of time. I left some recordings from the past week, a letter written. Last time I left something in real time for my brother, he and his then (awesome) girlfriend actually got off their asses and somehow got to me in time and I woke up unable to control my body in the ER, then put on a hold for 72 long hours (gotta love that the psych ward put me on the medication I was on, a side effect being suicidal ideation and why I was there.  Having to take it just stoked my bulimia. So, now I'm think 5 years later. Life should be good right? For the most part.  Been sober for over a year, although this was spurred by wanting to make my dad proud after he passed March '19 from Parkinson's complications. Sobriety has made me much more acutely aware of too many things.  I miss my dad, and wish I hadn't let my mom treat him like crap especially in his illness.  He was the best person I knew.  I wish I hadn't wanted to nimb life and could've spent more time in a sober and inquisitive state.  He is really so lucky that he does not have to see the Jerry Springer shit going on with our country. My mom just wants to ignore it. Like she does. I text her sorry, ugh finally just took the final from Spring quarter and fall starts next week...things have been busy, blah blah, and her response, glad you're ok? OK? So me responding at all means I'm ok? OK...but you go ahead and tell your friends lies about that, like when you told them the reason I came home from the air force academy beat back when was because I was raped. (Found that out about 12 years after the fact. 3 things: she NEVER asked me or talked to me about why, so if she thought I was raped at USAF in '02 she just let me be?! AND she wasn't going to let me come home; it was the fine I'm going to move to South Dakota with ym friend who is leaving at the same time AND the real reason was I was depressed. Calculated how long it would take to his the ground jumping from my 6th story window). I've gotta go...feeling it now. Sorry if this breaks rules.", "url": "https://www.reddit.com/r/SuicideWatch/comments/iy9doj/i_dont_know_why/", "title": "I don't know why", "social_network": "reddit", "user": "beonthestars", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1600865142, "permalink": "/r/SuicideWatch/comments/iy9doj/i_dont_know_why/", "nsfw": false, "first_save": 1635422936.208576, "replies_charged": false}