{"id": "t5_2qpzs_t3_qembn1", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "It's 2am now and I can't sleep. I can't with my parents/siblings. They are driving me insane. They argue and criticize every single things I do wrong. My life just fucking sucks. These below are just some things that really makes me angry. I'm always angry. Wake up angry. Angry during the day. Angry right before bed.\n\n1. **Argument over money/achievements/moving out/siblings.** My parents complains how my younger brother and older sister are already making money while I'm still at school making no money. My sister went to the most expensive university and picked a garbage major. She used so much of my parents money during this time while I went to a local university because I understood my parents status and was depressed to focus on academics. My brother does not communicate with any of the family member and goes goes straight to his room. We never talked for at least 5 years now in the same house. He doesn't even talk with his parents. So we don't know if he still goes to college. I was the only one that did well in highschool. I got valedictorian/salutatorian during my junior year and could of kept at it but only dropped to 8-11th place because I got hella depressed during highschool and ditched half of my senior year. And, I throw away things that are never used or it has been sitting there for at least 3+ years or things that poses a threat to health, they would often say I make no money and only knows how to waste money and throw out things. They are mild hoarders. I throw out things because it takes up space or its not safe. Not because I'm wasting money intentionally. When they say this, they tell me to move out. I want too. But how? I live in one of the most expensive place in the USA. I can save money staying here instead of living pay check to pay check while hurting my grades in class. I can work a shit job while in school but I don't need to because I'm only 5.5k in debt (subsidized loans). I've already worked for 1 year during school.  And I can't focus if I work. I spend to much time lost in my mind and want to focus on my gpa for the last year.\n2. **Defrosting frozen food.** My parents always leave frozen food countless of time at room temperature. I tell her to defrost it overnight or submerge in cold water. I tell her not to refreeze defrosted meat/fish. They don't listen. When a salmon smelled bad, I told her this was because she left it out for too long in room temperature so I threw it out to avoid getting the family sick. She says I'm always throwing things away, ungrateful, and crazy and always starts to argue with me when all I want is a day of silence and a day where I can just relax.\n3. **Hoarding/Broken things/ Mess** I live in the corner of the living room. I have no privacy. My sister has her own room. My brother has her own room. There is one more room in the basement because I refuse to use because its the room that leads to the backyard where dirt and people constantly walking in/out. So because of this, I chose the small space. I have a used closet from my brother/sister, which now is broken. My parents say how I can't take care of things and everything brakes on my end. THATS BECAUSE IT WAS USED FOR YEARS AND WAS ALREADY BROKEN. My sister would put her books, old clothes, and things in the room. I do have clothes on my chair/bed but that is normal and usually cleaned by the end of the week during laundry. ITS ONLY MESSY BECAUSE I HAVE SO LITTLE SPACE to put things.\n4. **FLOOD DAMAGE HOUSE.** I'm the one in the family that did all the paperwork, photos, calling FEMA/insurance, helping my parents purchase household essentials, helping my parents pay their bills online because they don't know how too, etc. I did all this was a fucking stutter and so much of my fucking time. My brother does not help, and my sister is away. My siblings did financially assist my family but none of them did any paperwork. My parents will argue how I'm unsupportive and lazy and will praise them because my sibling helps by giving them money.\n5. **Flood food safety.** My parents will salvage certain melons that they grew over the summer because it \"might have not touched the water\" when I told her it can't be eaten because sewage flood water can splash on it and not worth the risk. I told her to dispose of anything that water can get into (hand soap, dish soap, laundry detergent/softener, oil, etc). But when she doesn't listen, I threw it away myself and she calls me crazy, money waster, spoiled, etc. I keep telling her its not worth the risk, its not worth the risk, its not worth saving $100. Just throw it out.\n6. **Walking The Dog.** I'm the only person along with my mother that walks the dog. My younger brother doesn't do shit. My sister rarely does it. And when she tells me to walk the dog, I get so fucking pissed because I always do it. She's the one that got the dog while away at the MOST EXPENSIVE private university so I took the responsibility of walking it while she was out for 2 years. Now her argument is that she works full time, while I'm at school so I should at least help out.\n7. **Personal Issues.** I already have my own stresses of life and these are just putting more strain on my head. I have a mild stutter which already affects all aspects of my life. I am considered short which affects most aspects of my life. I had countless rejections/my own dating pursuing mistakes/girls with bf/being played/no luck on dating apps and this already took a large part of my life. I was depressed for over 4 years which affected my undergrad GPA to 2.8 the first 2 years (now its 3.4). Now I'm graduating a year later and stuck with a major that makes no money. AND, I still need to go to graduate school for at least 2 years to make the degree useable.\n\nHonestly, If you were to ask my neighbors, they would describe me always getting angry and yelling. I don't blame them. And, I don't know anymore. I don't know if I'm the problem. I learned so much over the years. I'm just so tired. Mentally, physically, psychologically, spiritually tired.  I don't know what to do anymore.\n\nEDIT: Alright, I'll give myself until age 30. 7 more years. I will wait it out a bit longer. Thank you to those who took their time to read/ sent me a message/commented below.  ", "url": "https://www.reddit.com/r/SuicideWatch/comments/qembn1/should_i_just_end_it/", "title": "Should I just end it?", "social_network": "reddit", "user": "A-Happy-Ending", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1635055906, "permalink": "/r/SuicideWatch/comments/qembn1/should_i_just_end_it/", "nsfw": false, "first_save": 1635427919.221883, "replies_charged": false}