{"id": "t5_2qpzs_t3_f1s6c4", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "Hi everyone, sorry if u have some problems to read what I'm going to write but English it's my second Language.\nWhen I was a child, I suffered sexual abuse many times but I didn't remember those episodes until the age of 15. It was my older sister and I don't know exactly where the memories get bcause I only remember her touching me and make me touching her, watch porn videos and etc etc. Anyway, I felt on depression and on day, a year ago I finally confess this to my partners because I was living with my sister and she was making my life a entirely hell. They did not do nothing. They even didn't talk to her about it. I felt more and more on depression and if it wasn't enough, I had been having alimentary disorders (two, bulimia and anorexia). \nMy parents always blame me of having this. And when I went on 35 kg they took me to see a doctor and a psychiatrist when I was 18 years old, the last year. They gave me antidepressants and my family was acting like I really care to them. I have my friends and I was feeling like I could confront my life. But she still there at home, everyday to remember me that it's not a little justice in this life. She turns on the TV on the living room looking some news or the Law and Order and making comments like 'Oh, how could that mdf do that to the child!!' and the rest of the family just agree, like, ok nothing it's wrong.\nI left the antidepressants because one, it didn't work it anymore and my parents didn't go with me to see psychiatrist anymore. And two, cause my mother still said that I was acting and lying about everything and that I just was too pretentious to eat. I always asked for help and I make a big effort to leave my bed everyday (but rarely I get out). \nI have my friends, I have the love of my life, but I'm not me anymore, my alimentary disorder started at the age of 10 to manifest and I can't no more. The panic's attach, the loneliness I feel, the guilty, I just cannot do this anymore.\nMy parents still acting once again like I really matters to them (my parents had hearts attached and my mother battle the cancer so they think that what I have it's not even a illness) but yesterday, for example, my mother told me that I ashame her because I don't eat at birthday (even I offered eat at home until we gone to the birthday party so I don't skip that food, cause at home I have the type of food my mind let me eat to stay in some kind of temporary metal peace).\nBut it's ok, I understand. Nobody will ever feel like I feel. I just want some peace, I just want to go to some place when I don't have to worry about what or how to eat or worry about being touch to another person. Some place where I don't have to think on how much they hate me or how much I screwed their lifes. \nSo, I'm planning my suicide again, it's not my first time but I cannot find a correct way. What can I do? I know it could be creepy to some of u to tell me 'hey, try this option' but I'm going to do this anyway. I'm just need some suggestions.\nThanks for reading.", "url": "https://www.reddit.com/r/SuicideWatch/comments/f1s6c4/i_need_to_end_my_life/", "title": "I need to end my life", "social_network": "reddit", "user": "JAKso87", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 15, "down_vote": 0, "creation": 1581349855, "permalink": "/r/SuicideWatch/comments/f1s6c4/i_need_to_end_my_life/", "nsfw": false, "first_save": 1635422940.6135762, "replies_charged": false}