{"id": "t5_2qpzs_t3_8t8acw", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "What I mean is I live in a place beyond sadness, beyond will, beyond the depths of everything that kept me human. It’s beyond not just not feeling but also not being present. It’s like I don’t exist or maybe I do and nothing else does. Nothing really affects me anymore. \n\nIt’s to the point where I’ve tried doing drugs and drinking to do anything but it just makes me feel either flat or like I’m sinking. During the past school year my school has been threatened to be shot up and bombed (separate occasions) but it didn’t bother me. No risk even occurred to me even when I tried. Nobody ever talks to me and the last time I really felt anything was when a good friend was moving and their last word about me was “you know, you’re too sad all the time.” Now I sneak out when I can’t sleep which isn’t often cause I usually sleep close to 14 hours a day. I spend most of my money on drugs just cause it might bring me something to experience. \n\nI have rope in my closet if I ever want to leave and honestly I’m not sure why I haven’t already. There’s nowhere to go. Not down or up. I don’t cry no matter how much I try and I can’t get anyone’s attention to possibly just give me a hug or maybe I’m just that unbearable. I’m not scared that I’m not liked and even hated by some people and in fact I’m extremely passive about it. I wish I could just be worth a dime to someone. Even that statement is part of the problem. I become physically sick and disgusted with myself whenever I get physically or emotionally invested with people one on one. It frustrates me but not even emotionally, just mentally. Fucking Christ I just want to drag a razor across my face. I want to rip myself open and tear the meat right off my hands with my teeth. Someone has to die here and I think it’s gonna be me. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/8t8acw/i_live_beyond_the_melancholy/", "title": "I Live Beyond the Melancholy", "social_network": "reddit", "user": "goremind", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1529737677, "permalink": "/r/SuicideWatch/comments/8t8acw/i_live_beyond_the_melancholy/", "nsfw": false, "first_save": 1635427500.9418838, "replies_charged": false}