{"id": "t5_2qpzs_t3_ou6zvn", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "My mother has been threatening suicide on me for the past weeks. Telling me in detail how she wanted to do it, and that she would have left a letter accusing me of pushing her to the edge. She furthermore refuses to seek professional help, because I am the only cause of our depression. \n\nFor years I've functioned on what I call \"survival mode\" : work on the most important stuff, brush details or small tasks aside.\n\nWell this nonchalant behavior of not allocating energy to details and small tasks finally bit me in the ass this week.\n\n- I didn't put enough effort into formatting excel files, which let down my colleague and forced him to take the workload. He resented me immensely for this. I also know he complained about me to other colleagues. \n\n- I put away participating in a colleague's goodbye gift and eventually forgot. All my colleagues knew about it and treated me like a pariah.\n\nMy work was the last thing I had left. If my colleagues hate me, going into work will become extremely painful. I saw no more issues to my suffering. Not to mention, I have trouble understanding social cues and creating bonds. I worry I'm not fit to live in a society, or work with colleagues.\n\n\nI had an unused prescription for antidepressants, and I planned to go to my pharmacy and swallow them all.\n\nHowever I put it off. I called the suicide line twice. While the discussions felt a bit superficial, they managed to convey important things : 1. Forgetting to participate in a gift will be forgiven in time as my actions speak for themselves (I am actually a very empathetic person) 2. One bad work performance on something as minor as formatting excel files will eventually get buried under the rest of my good deeds, as long as I show I learned from my mistakes and don't do the same shit.\n\nI have a shit load of structural issues that keep putting me down. My relationship with my mother, me thinking not allocating time and energy to small tasks is efficiency, my crippling depression, me getting a debilitating anxiety attack everytime something goes bad at work, me not being able to socialize and create bonds.\n\nI realized all of this has no relationship to work. If I keep using work as a band-aid, I'll keep getting hurt again and again. I need to tackle my structural issues.\n\nSo in the end, I didn't go to the pharmacy, even though I already had taken the prescription out of my binder. I decided that my issues were in fact solvable, and I wanted to at least give it a serious try ; not for my colleagues (these I will leave soon enough) but for myself.\n\nThis goes beyond work and colleagues, which are temporary. I want to understand why I'm living the way I do. I want to give myself some compassion, while not running away from my misshaps. I want to change, I know I can if I understand why I'm doing it, and if a professional can give me tools and advice to cope better and change behavior.\n\nFuck my colleagues. This goes well beyond them. They are not in my head, they can't know what I am going through, and it's ok. I want to do it for me, not for work.\n\nNow that I have a precise goal and an actual plan to tackle my issues, a door has been reopened. I will live for me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ou6zvn/woke_up_with_a_plan_to_commit_suicide_decided_to/", "title": "Woke up with a plan to commit suicide - decided to give myself the chance to face my problems", "social_network": "reddit", "user": "Successful-Car1438", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1627594788, "permalink": "/r/SuicideWatch/comments/ou6zvn/woke_up_with_a_plan_to_commit_suicide_decided_to/", "nsfw": false, "first_save": 1635423042.1218855, "replies_charged": false}