{"id": "t5_2qpzs_t3_ae6fzk", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "30 years I've been fighting the desire to kill myself. I made it 29 without an attempt. I now think about it every day. \n\nIt's a long story and one I have daydreams about getting down in full somewhere, anywhere, but I think at the rate I'm going, I might legit just die first. \nNutshell version: I was introduced to the concept at only 8 by a neighbor, who's failed attempt killed a classmate and their siblings. It was traumatic af. Then a bunch of other traumatic shit happened and I've been pretty perpetually traumatized since. largely just because I'm on the spectrum, super observant thanks to hyper vigilance and sensitive to sensory stimuli and meds. \n\nSo I'm now just trying not to become a similar story to my neighbors poor children. \nI was trying to outlive my mother, but I failed and attempted by overdose last year after a simple outpatient surgery that I knew would exacerbate the thoughts as any injury does. Turns out I didn't think about that plus the effect of steroids. Suicidal ideations on steroids were a new level of hell for me and even though i warned others about the way my brain doesn't handle physical duress, not one person in my support network was able to actually support me, as is frequently the case. (I scream. It's good for exactly nothing but my vagus nerve. Anyway...)\n\nSimple outpatient procedure at 37. \n3 attempts followed.  \nI'd successfully avoided attempting for 30 years, y'all. \n\n I genuinely don't care anymore if family buries me. Fuck em. The weirdest part is I've already been to a suicide funeral in the family and have seen that future in part. They'll survive. \nI'm just trying to get them on board with some end of life arrangements now, just in case, so I don't screw them like it would have had I succeeded. It's supposed to be the other way around in just a few years time with me helping with their arrangements and I feel like a dick, but I'd be a bigger dick if I wasn't being honest with them about this struggle. \n\nI'm fucking doomed y'all.\n\nI'm aware, on some level, that I'm an autistic person with head injuries that got stuck on this thought pattern very early and have essential hardwired it into my mind by obsessing over my not existing somehow. \nKnowing that makes it 0% easier to manage 30 years fucking on with the same impulse control problems that make not stimming impossible. And major meltdowns are basically just fatal now instead of just making me into an adult that technically commits assault with every meltdown\n\nAfter 3 attempts finally last year (rx OD, jump, hang. Didn't jump, really fucking should have. The other two, permanent damage. so now I'm only safe because I'm afraid to try again and I hate living here, I used to live here between bouts of \"will this med work or ramp up the ideations?\"), I'm wigging the fuck out every day thinking up new ways to die and trying to source info on all this suicidal creativity. So creative these new ones, and I think my mind may be trying to bury my preferred method with like an avalanche of ridiculous options, because NOT thinking about my PM is as easy as not thinking about suicide at all anymore. It used to live locked away with whatever other skeletons I used to not want to think about and I can't not think about any of it now. It's like a wall in my brain got knocked down and I can't seem to rebuild it fast enough. I don't even know if I can and I already know it's not healthy anyway. \n\nMeanwhile I'm desperately trying to process the year that contained those attempts before spring gets here. And then there's life in general at the moment just rolling over me as usual. And when the date of the first attempt rolls around in a few months it's PTSD time. I've actively avoided remembering the dates of my attempts, but I know I'm going to just feel so down and be useless those weeks whether I remember them or not BC it happens with the hospital stays and other calendar dates I try to forget. I try to tell myself because I can see it coming I can manage it. Doesn't matter tho. My body says fuck you and won't get out of bed for a week whether I remember if I went in exactly that week or not. \n\nSo instead of processing I'm just rockin on my bed (stimming), trying like hell to distract myself from the thoughts, feeling like 30 fucking years of mistreatment and this avoidant behavior is quite enough, especially staring down my body falling apart and already knowing the feeling of it taking my mind with it. \n\nI've been an old soul since I had my first existential angst over wealth inequality at 3. \nI am almost 40 and we all know what's happened to the wealth gap in those years. \nI'm so fucking tired there aren't words. \n\nI was never supposed to be this old and it's not even that old. Like even if poof I could magically be better, I don't want to enjoy being older, that's backwards. And I certainly don't want to be more miserable than I am. The thought of reaching an age where my hormones whack out again in decade or so is beyond terrifying. \n\nI just want to be released from being this pained, misunderstood, and fucking useless thing that was built all wrong. \nMy mind is it's own prison and no one should have to live there. \n\nI don't know what anyone could possibly say to me, but thanks for reading all of this. \n\nI keep trying to convince myself that my queer existence is enough, but I genuinely feel like suicide is the only rational response to some situations, mine included, and I wish like hell there was a Dr Kevorkian for us to call for help.\n \n7 billion of us is just too fucking many humans to be as effectively cooperative as humanity needs to be in order to progress. \nJust let some of us off this rock humanely for the love of fuck. \nSomeone else definitely needs the water and energy I'm consuming over the next several decades more than I do... \n", "url": "https://www.reddit.com/r/SuicideWatch/comments/ae6fzk/obsessive_ruminations_clap_your_hands/", "title": "Obsessive ruminations clap your hands", "social_network": "reddit", "user": "suicideenby", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1547037576, "permalink": "/r/SuicideWatch/comments/ae6fzk/obsessive_ruminations_clap_your_hands/", "nsfw": false, "first_save": 1635427992.660949, "replies_charged": false}