{"id": "t5_2qpzs_t3_pq4anf", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "\nWow! This is it, this is my note. Damn, damn. This feels bad. In all seriousness, though. Please try not to blame yourself. I know you will, and I know it’ll be hard, but you guys can get through this. You are all the strongest people I know. I’m still contemplating even including this note, but I’m sure you guys would want closure before anything happens.\n\nMom and dad, I love you. Im sorry I wasn’t the perfect child you wanted, and I’m sorry I, um, “moved on” still thinking that. I’ve always felt like this, its not your fault. I just couldn’t speak up about the things they were bothering me, I couldn’t speak up on the things that effected me the most and I’m sorry.  I know you guys loved me, and I know we had our ups and downs but I promise it didn’t influence me to do this. Thank you for everything , I’m so grateful for all that you’ve given me, promise. I promise I’ll take care of myself on, the other side I guess? And I’ll always be there right he both of you.\n\nMom, be smart, do do anything stupid, you’re strong, you can get through this.\n\nIsaiah, hey. I don’t know what to really put here ? Um, I love you. I know I never said it but I promise I actually do. Lol. Um, yeah. Sorry I was kinda a shit to you all the time.. I just never really knew how to express my feelings. I’m glad I see you as such a cool brother, and I’m even gladder you saw that in me too\n\nTo the  group chat,\n\nI’ll go into specific people that hella impacted my life, but for now. I just wanna say, I lovr you all, I love you all so fucking much. Thank you. You all made me feel so loved and actually made life worth living while I was still chillin. I genuinely would’ve done this so much longer ago if you weren’t all there for me. I love you , so fucking much. And I will never be able to specifically narrow down like, the amount I adore you all. You fuckers are making this so hard, :,)\n\nFenris\n\nFen, I know you say “I couldn’t live without you,” all  the time. But you can. And you will. Please make this last promise to me, you will stay alive. And you better, if I see you up here I swear to god ill beat the shit outta you. \n\nBut seriously, I know what I say seems pretty contradictory but you have such a life ahead of you. Ok? You’re so gifted and have the fuckin best personality ever man. You got this, you can live through this. You will, please..? \n\nI will definitely miss everything we’ve done together, not gonna go into them cause I might start crying haha. But yeah, I love you man. It’s not your fault, you made me so happy.\n\nArlo\n\nArlo, man. I love you so much. I shared my absolute hardest laughs with you and I would not be able to have stayed as long as I did without you. You were so sweet to me, you made me so fuckin happy. I swear. I’m laughing at the memories while typing this. Take care of yourself for me, man. You’re my best friend, always and forever  \n\nNik, victor, my honey bunches of oats,  blah whatever \n\nMan, I knew it would hurt to type this. I know we haven’t talked the longest time, but I genuinely feel like you’re one of my closer friends. I’m sorry You constantly saw the negative side of me. But, Um. Time to ramble I guess. You made me so happy, so fucking unbelievably happy. You never ceased to make me laugh, feel validated, smile, whatever, you name it. I’m sorry I didn’t listen to you when you said I would get better. I guess I’m jus impatient:P. But FR, you were the kindest soul I’ve ever met. A literal angel man. Also, you’re so talented. That combination is gonna get you far, you’re going to get so big,, and I’m sorry I wasn’t there so see that.\n\nI wish I got to talk to you more, I was so happy when I did. Tbh, i kidna looked up to you ? Haha. But, !! Yeah. Yeah, I love you, so much and I’m glad I got to share my time with ya. 🤍\n\nBobo\n\nHi, I love you. I feel like I was never the most srs with you and ig, idk. I’m glad we stayed friends for so long csuse like .you’re so fucking cool and fun to hang out with. I cant think of a memory that didn’t involve me laughing with you . I cant think of much to say but , thank you. You made me feel awesome. I love you, take care of kam for me ^^\n\nDanni\n\nOhhh, hey. AH, wow. Um, I’m sorry I never got to fly out to Cali like I said I was going to. I’m bad at keeping promises.\n\nBut anyway, in the short time I knew you, you made my life so much  better. I was so nervous when I first called you but Idk, I felt a kinda click with you? And I’m glad you enjoyed the calls so much. Your laugh made me happy.\nYou’re so fuckin funny man, and like nik, also talented as hell. You’re gonna make it big. Thank you for being so nice to me and treating me like how you did,, (even if you did abuse i forgor entirely too much.) \n\nKam\n\nKam, I love you. I wish we could have met up before this happened. And I’m sorry, sorry for this and I hope you know I Love youso much. You were literally my best friend ever , and I’m so glad you stayed as long as you did. The calls I had with you never changed, they were always some of the best highlights of my life and I’m glad you were there for me during every step . I wish I could hug you, thank you.\n\nMolly\n\nMolly. I love you , I love you so much. You’re the sweetest, funniest, most genuine soul ever. I know you said that you’d be sad if I were gone, and I’m sorry that I didn’t take that into perspective. Out of the 8 years I’ve known you, all of them have been the best. I think you’re the only friend ive NEVER had an altercation with. I’m sorry I always told you not to tell your parents about how I was feeling. And thank you for being the most understanding person I’ve ever met.\n\nLizzie\n\nHi lizzie, um. I love you, a lot. You helped me grow as a person and realize a lot of things. Please take care of yourself. You’re the kindest person. I’ve ever met . Like ever. It’s insane. Your positive energy always rubbed off on me and I’m so grateful for that. Thank you for always being there for me, thank you for being so fucking kind. Keep your head up, man. You’ve got a long life ahead of you.\n\nJourney\n\nI love you. I really wish we could’ve met when I visited Maryland. You’re like my bestest friend I’ve ever had. You were always there for me and never failed to make me laugh. Thank you for that. I wish we got to call more, you’re a joy to be around and nothing less . Thank you for all the memories, I wish I could’ve made more.\n\nAlso my favorite twenty one pilots song is tear in my heart, forest, or shy away, because I never told you.\n\nDave / jack \n\nI don’t know how to word this but, thank you? For everything. I was never the most serious person with you, but I liked it like that. Even though my absolute worst times, you never failed to make me laugh and I’m so grateful for you. I cant describe how much I care for you. \n\nStay strong for me, ur awesome. I love you man.\n\nKylee\n\nFor the short time that I’ve known you, I’m so glad I met you. You were like one of the highlights of my years. Every call and text with you were so funny. I cherish every laugh and conversation I shared with you, so thank you for that. Like so much. I love you immense amounts and I hope you’re doing alright. Be kind to yourself \n\n\nI got really exhausted while writing this so some honorable mentions of people who really helped out,\n\nJJ, void, taz, corvex, pj, Ashton, eddy, Josh, leaf, cole, nate, Kurtis, mint, leshen , levy, Rylee, and probably a shit ton more people I can’t think of . These words apply to you too, I love y’all. So much. Thank yku \n\nPlease check on each other for me, I’m not sure how much this will impact you all. But , in the case that I do, please get through this. I’m sorry you never got to know my most genuine self. I love you all. If I didn’t specifically write your name, please know that it doesn’t mean anything. Im really tired and only thought of the first couple of names I could think of. \n\nKnow that nothing you could’ve prevented this. I was sick, there was just no cure for me. And I’m sorry I always talked about what was bothering me, I’m sorry if I burdened or hurt you ever . Please take csre, <3\n\n-keaton", "url": "https://www.reddit.com/r/SuicideWatch/comments/pq4anf/im_14_and_killing_myself_tonight_so_heres_my_note/", "title": "I’m 14 and killing myself tonight, so here’s my note if u care to read it .", "social_network": "reddit", "user": "sillythrowaway17", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1631898566, "permalink": "/r/SuicideWatch/comments/pq4anf/im_14_and_killing_myself_tonight_so_heres_my_note/", "nsfw": false, "first_save": 1635425186.2618456, "replies_charged": false}