{"id": "t5_2qpzs_t3_pqtia9", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "Everyday I go through the same slog, wake up extremely early to go to a job I despise, get treated like an animal and absolutely have no respect for my time or self as a person. I go home, get treated like a slave, a pet, and no respect for myself and my own time by my father. Even my own friends do this to me at times. I have a significant other, but we are long distance until we can manage to move in together somehow, But I can't even afford it for another 2 years because I am brought down by $5k of medical debt from my last attempt where I was neglected and released too early and immediately had a psychotic Adderall induced episode in the middle of the night, So much for a 40 minute ambulance ride and a hotel where I got stabbed in the wrist every so often.\n\nMy hours are dipping down at work and I've been told they are considering firing me by a little birdie on the inside, I can't afford anything because the medical debt completely consumes my entire paycheck. In response to that I get berated for not having money or anything by my father (Who also did nothing but berate me in the hospital.). I am almost 22 and forced to live a life that someone else is controlling, I never wanted to go to college, I never wanted to be here in the first place. But I'm forced to study for a degree that I don't even care about. A lot more lately my partner has been ignoring me and not talking to me for days at a time, I feel ignored and unnoticed by everyone around me. My awful drinking habits have been coming back and I've been going back into the compulsive behavior of abusing random substances just to get the mind slogged.\n\nI don't know where else to go with this, because my life is dull and meaningless as far as its going. I already know nobody even cares around me, nobody even bothers to talk to me. The last few months have made me more increasingly suicidal than the last attempt, the only thing even making me hesitate is the fact I could have another huge medical bill I can't afford because I didn't take enough again, or the rare case of luck. I don't enjoy anything I do, my past hobbies aren't even fun anymore to me. There is nothing I am good at, crazy right? I gave up music years ago, I gave up my long term interest of fighting game tournament play, I can't even watch shows or movies like I use to, its awful.\n\nThe only thing I do these days is mindlessly consume meaningless media that doesn't benefit me or anyone to pass the time, besides that I just disassociate and forget days after days of my life. I can't even remember anything before I was 17, most likely due to trauma.\n\nI feel like a mindless slug waiting to just dissipate.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pqtia9/i_am_a_slave_to_the_world/", "title": "I am a slave to the world.", "social_network": "reddit", "user": "LeahIsUltraGay", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 61, "down_vote": 0, "creation": 1631995699, "permalink": "/r/SuicideWatch/comments/pqtia9/i_am_a_slave_to_the_world/", "nsfw": false, "first_save": 1635425269.361094, "replies_charged": false}