{"id": "t5_2qpzs_t3_jbxyvr", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I'm having a super hard time. This is my first post and it's a pity party so  I'm sorry and here it goes. I've never gotten help for my childhood abuse. No-one really knows my story. A few people do, but I never got any counselling or felt safe or understood it enough to talk about it  when I was younger and was actually able to get help. I've tried to get counselling but I can't afford to pay out of pocket. I went through a counselling service connected to my work but they turned me away because I needed trauma counselling and I already had a bad experience with one of their counsellors who weren't trauma informed and made me feel like a sac of shit. I can only find a few sessions at a discounted price and I keep being told, only doing a few sessions will likely just make things worse so don't do that.  Now I'm alone with no help and at all and don't know what to do. The rumination is 24/7 and if  one more person tells me to think positive I'm gonna punch them in the throat. I'm trying to keep myself from having a breakdown but have obviously failed and  am a high  risk for suicide right now. My family is not  a support and I can't be around them or talk to them right now. I had to drop out of school and am going to have to give up my job soon because I have so much anxiety I can't leave my apartment sometimes. I work at a homeless shelter so I'm at a higher risk of contracting co-vid and I am being forced to work with little support. My clients are overdosing, becoming more aggressive and more difficult to manage. I'm having problems with my neighbour and should be going to the tenant board but I'm too overwhelmed to take that on. I can't sleep every night and feel delirious pretty much every day. My arms and legs feel like jelly. The anxiety I feel in my chest literally never goes away now. I've had to go to the hospital twice because my depression is so bad I'm not digesting my food properly. I wake up with sleep paralysis sometimes and I lost a lot of my things in a flood that wasn't my fault. I'm gay and hate my body so I don't date and can't enjoy sex. I don't qualify for the CERB benefit here in Canada because I quit my full time job and went part time  to be in  school, full time. Now that I've dropped out,  I'm trying to pick up more shifts at the awful place I work at in attempts to try and not go through all my savings and student line of credit.  I just got some set hours but it's only week one and I already can't handle it. I'm struggling with maintaining my friendships. I've worked my ass off in life and always just end up falling through the cracks. I'm so tired. There's only so much a human can take.  I'm looking for any reason to stay alive and I'm coming up short friends. It makes me sick to know that if I end up deciding to die, my final act in life will hurt others and affect their lives. I'm embarrassed. I hate myself. I'm really scared. Thankyou if you read this.", "url": "https://www.reddit.com/r/SuicideWatch/comments/jbxyvr/dont_know_what_to_say/", "title": "Don't know what to say", "social_network": "reddit", "user": "Dexter1114", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1602801623, "permalink": "/r/SuicideWatch/comments/jbxyvr/dont_know_what_to_say/", "nsfw": false, "first_save": 1635428058.411253, "replies_charged": false}