{"id": "t5_2qpzs_t3_oe50qt", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "This is my first time ever posting on Reddit so please bare with me. I’m 23 years old and I cry almost everyday. I don’t have friends and I don’t understand why. Each time I have had a friend it ended because they betrayed me. Whether it’s spreading rumors about me, being friends with my abusive ex, or leaving me out all of the time just being plain shady. I hate my parents. I blame them for how horrible I feel about myself. They’ve always treated me like shit. But they think they are parents of the year because they’ve given me “nice” things. In reality my parents have mocked me crying, they have blamed me for not having friends, made fun of me for it too. They always forced me to do things I didn’t want to do and it never benefitted me once. Like forcing me to try out for an elite choir when I was a young kid despite my debilitating stage fright and overall just me not wanting to do it. But it doesn’t matter to them. They can’t understand how bad of parents they were and still are. In fourth grade I moved over 1000 miles away from my hometown. I was sad and depressed and had no new friends. My grades slipped. Instead of asking me what was wrong my parents beat me until I couldn’t sit down. One time I caught a ride instead of waiting for my mom who always moves at her own pace, to go to cheer camp. My first year on the squad. I left the house and caught a ride. My mom drove all the way up to the school embarrassed me in front of everyone and took me out of camp. She humiliated me on purpose. One time my parents forced me into a mental hospital. ON VACATION. My parents have ruined my life over their lack of compassion, quickness to anger, control issues and so much more. It’s caused me to search for love from people who pretended to care about me. Now since I cut those people off I have no friends. I’m out of college so making friends is impossible atp. It seems like no one wants to make new friends at my age because being clique-ish is cool. I’m not going to make new friends ever. My career field is generally gate kept by older people so definitely won’t have friends at work who are my age and we can hangout. It’s been one year since I cut off my shitty friends and I may have only hung out with or interacted with a person my age only 3 or 4 times. Out of an entire year. 10/10 you’ll find me on my couch in my apartment. Everyday. I never go out even on the weekends because I have no friends. Trust me I’ve tried reconnecting with people I ent to school with but no one ever puts as much effort into it as I do because mostly everyone has their people already. Anyways, I just wish I could die. If nothing can change in a year nothing will ever change. Friends aren’t going to miraculously fall into my lap. The only happiness I get is the split second I think about dying and how when I do die I’ll finally get to be happy because I won’t have to care about being lonely. I hope all of you struggling right now who have friends, who have people that care about you other than your own family, cherish those people. Because something is better than nothing. And I don’t have anyone. I don’t text anyone during the day. No one texts me. I don’t remember the last time i went to a party or the last time I was out past 7.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oe50qt/hopeless/", "title": "Hopeless.", "social_network": "reddit", "user": "ConcentrateSalt7145", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1625482815, "permalink": "/r/SuicideWatch/comments/oe50qt/hopeless/", "nsfw": false, "first_save": 1635423050.4940813, "replies_charged": false}