{"id": "t5_2qpzs_t3_ba3d6x", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Disclaimer: this is not a success story. In any form. I failed (obviously) and I feel wretched. If you’re looking for feel-good’s I suggest another post. If you want to hear how I lost my mind...continue.\n\nYeah. You read it right. Today, at 24 years old, I tried to commit suicide for the first time. I guess if you're here you probably want the backstory, huh? I feel so stupid over it, but maybe writing will help. Maybe someone will respond and make me feel less alone. Maybe...Idk. Just maybe. Anyway. Into the story I guess.\n\n\n\nSix years ago I met this girl. She was weird af. Theatre kid, into odd shit. Total weirdo.\n\n\n\nThis total weirdo would wind up becoming my best friend, and for the purpose of this story, we'll call her Angie.\n\n\n\nAngie and I haven't always been on great terms. When we first became friends we were really close. Then, she got super close with another girl, who we'll call...Trina. The closer Angie and Trina got, the further away I was driven. After a while I quit talking to her because I didn't feel important. This would happen two more times. The first time we went four months without speaking, and she reached out and we became friends again. The second time I think it was about six months and I reached out. The third time was nine months, and she reached out. The last time she reached out was about one year ago exactly. In between all those \"break ups\" we got really close. Her and Trina quit talking completely. The biggest problem became the boys she would date. They would treat her like shit, I would get angry, eventually couldn't stand to watch it anymore, and then I would leave. Every time hoping she would ask me to stay, and every time being left with silence.\n\n\n\nHer and I connected so deeply that we were both convinced we were soulmates. Platonic, but soulmates nonetheless. Both of us believed that soulmates could be platonic, and both of us believe you have multiple.\n\n\n\nIt's important for you to know that we both, from the very beginning, have always been straight. I've never been in a relationship, and she's been with two men, and now that I've said this I'm sure you can guess what's coming next.\n\n\n\nAbout seven months ago I started wondering if I was entirely straight. I don't know what made me think about it, but something did. Then shit hit the fan.\n\n\n\nAbout two weeks ago I realized that I had feelings for Angie. I'll never forget it. I was picking up laundry to wash when I realized it. I've always had this idea that I need to find Angie in a man for me to be happy. That if I find the male version of my best friend I'll be set. Then one day the thought occurred to me that maybe I shouldn't be trying to find a male version of her because of the whole \"you can't duplicate people\" thing. Maybe I was just interested in her from the beginning...From there it spiraled.\n\n\n\nI began to worry a lot. What did it mean? Why did I have these feelings? How long had I had them? Am I feeling this because I'm lonely or because it's legit? What if this destroyed my friendship? How could I tell her? Could I tell her? What if I told her? It was a lot. I was especially worried that I wasn't actually feeling anything and that I was just lonely. Then we went to the beach for my birthday and that's when the fire nation attacked (I'm depressed. Just roll with the crappy Avatar references)\n\n\n\nDuring the day she would mention that she needed to find a guy like this, or she wanted a man like that, or guy this, guy that. Blah blah blah. And every time she would mention it I would get insanely jealous. At this point I guess it's worth mentioning that I have depression. Diagnosed, untreated. Don't tell me I don't know what I'm talking about. I assure you, I do. Anyway, it was at this point that I realized the feelings were real. I panicked.\n\n\n\nI made it through the day and promptly went home that night and absolutely lost it. I self-harmed a lot when I was a teen. Abusive home since I was young, no other way to cope...yeah. Anyway, I went about five years without doing it. Then I relapsed back in November of 2018. Then again in March of 2019. Then again last Saturday. When I got home from the beach and promptly lost my shit.\n\n\n\nAngie knew something was up the second I got home. We talk 24/7, so she knows how I speak and type. If anything is even remotely off, she'll catch it. And she did. She prodded and prodded until she eventually guessed what was going on and I admitted that, yes, I did have feelings. She told me she didn't know if she could be a couple because she didn't know how she felt about sex with a woman. She then told me that she did, however, have feelings for me.\n\n\n\nI was happy. She told me that it wouldn't ruin our friendship, she was glad I told her, and that she would wait for me to figure out what I wanted.\n\n\n\nThe next day we talked again and I told her I knew what I wanted and that I was just waiting to see where she would land. She told me she was down to try. I was happy again.\n\n\n\nThen the next night we hung out at a park and we talked about it. For two hours. She told me she was 80% yes. That she wanted to try, that she could see where it would work, and even confessed to one point in the past a few years ago when she wanted to kiss me. She told me she just needed time to get used to the idea. After a week of anxiety, I felt like I could finally breathe. She wanted me too. She was 80% yes. It was good.\n\n\n\nThen today. I've been waiting to get a definite yes or no from her. Today I got my answer.\n\n\n\nShe told me no.\n\n\n\nAfter all of it. The 80% yes. The wanting to kiss me in the past. Telling me she thought it would work. Talking about how certain people would react to us being a couple. Telling me she wanted to try. After all of this, she said her answer was no. That she only sees me as a friend, and that she's still healing from her ex of over a year.\n\n\n\nNeedless to say, I shattered. Every time I've ever wanted someone, they never want me back. The last time I really, truly had feelings for someone was six years ago. I wanted this so god damn badly. Wanted it so much I couldn't breathe. I was anxious all day, everyday, for six days. I ate next to nothing because of the anxiety.\n\n\n\nI left work 40 minutes early. I got in the car, and broke. For months I've been struggling with my mental health. Depression is a fucking bitch. Because of that depression, I had a suicide plan. Every suicidal person does. Even if they're too scared to enact it, we all know how we'd do it. Mine was simple. Drive to this secluded area an hour away from home. It's in the middle of no where, so no one would bother me. Drive there, plug the exhaust pipes on my car, get back in, take sleeping pills, go to sleep, and voila. Dead.\n\n\n\nI made it to step five.\n\n\n\nI left work and immediately got on the highway and headed to my suicide spot. There was no hesitation, which was a first. I just got in the car and went. Without thinking. Well...maybe I thought a little, because I stopped at walgreens to buy melatonin, water, and duct tape (to cover the window cracks). I bought a journal too.\n\n\n\nAt first I was hyperventilating. Not because of the suicide, but because of the rejection. I couldn't breathe. Then the more I drove the calmer I got. It would be over soon. Just a few more hours and then I wouldn't feel any of this anymore. It was so muthafucking comforting.\n\n\n\nI eventually made it there, and did exactly what I set out to do. I was shaking, but I wanted to do it, so I did. I opened my trunk, grabbed a cardigan and a towel from the beach that was still sitting there (bigger problems, don't judge me), and I plugged both of my exhaust pipes. I got back in the car, and downed a handful of Melatonin. Idk how many I took. Maybe 50? 60? I knew I wouldn't OD on it. I just wanted to fall asleep before the carbon monoxide affected me in case it gave me a headache or something. Anyway, I downed the Melatonin, reclined my seat back, and laid down. I texted Angie. Told her where I was. Told her I was sorry. That I loved her. Ten minutes later she blew up my phone. Anyway, back to how I'm still breathing. I was dozing off when my phone buzzed (from Angie). I went to grab my phone to check it and I couldn't move my hand. Moving my arm was so hard. I panicked. My survival instinct kicked in. Had she not texted me I've no doubt I would be dead right now. Frankly, I wish I'd just turned my phone off. That's what I get for wanting to know what her last words to me would be. I regret not turning the phone off.\n\n\n\nI panicked when I realized I couldn't move my hand, and by some force of adrenaline I opened my door and stuck my head out and breathed. I could smell the grass. It smelled nice.\n\n\n\nI eventually wound up sitting on the ground. I don't remember how I got there. Leaning against my car with my door open. I lost it. I sobbed. And sobbed, and sobbed, and sobbed. I've never had so much mascara all over my face before. Was a bitch to wipe off when the random car came down the road to check on the weirdo loser in the Nissan just sitting in a field by herself. Being unwanted by the person you want the most is soul crushing. Make fun of me all you want. Call me a weak piece of shit. I lost a piece of myself today, and I don't know if I'll ever get it back.\n\n\n\nThat's essentially it. I sat there for three hours. Just sat there. Sobbing. Texting. Wondering why I'm not enough. Being angry that I didn't just stay in the fucking car. As I'm writing this I'm sitting in a motel room. Couldn't find my laptop charger, so I'm working on what little battery I had when I left the house. I don't know where I go from here. My head hurts from crying. My stomach is a disaster from all the Melatonin. Mostly my fucking heart hurts. So god damn bad. I've never been this crushed by a rejection. I don't know how I get over this. Idk where I go from here. I don't know anything except that this destroyed me.\n\n\n\nIf you read all of this, thank you. Thank you for listening. Idk that I feel any better, but I like having this exist in the world somewhere. Idk why. I just do.\n\n\n\nThe journal I bought only has one thing written in it. I wrote it before I took the Melatonin. I was hoping it would be my last words, and I'm sad to say I still believe it.\n\n\n\n\"Maybe some people are just born to die.\"", "url": "https://www.reddit.com/r/SuicideWatch/comments/ba3d6x/today_i_tried_to_kill_myself/", "title": "Today, I tried to kill myself.", "social_network": "reddit", "user": "alexis_jne", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 85, "down_vote": 0, "creation": 1554549904, "permalink": "/r/SuicideWatch/comments/ba3d6x/today_i_tried_to_kill_myself/", "nsfw": false, "first_save": 1635422322.8722367, "replies_charged": false}