{"id": "t5_2qpzs_t3_q3x04s", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "I lied to myself that I was getting better. I was foolish to have hope that things would be different. \n\nIt isn’t. \n\nI’ve been at the peak of my depression for the past two years. Mix that with a toxic work environment, an attempt at a equally toxic/loving relationship and chronic insomnia, I have been planning my death for months. The last time I wanted to make an attempt on my life, I had one (1) online friend available who talked me down. Then after the crisis was averted, my toxic/loving online SO showed up. \n\nNow, I have no one. My relationship is over. My online friends don’t talk to me. I don’t have any IRL friends who take me seriously. \n\nYesterday I sat on my kitchen floor with a knife pressed against my radial artery, just trying to find the strength to cut through until my anxiety caused me to vomit long enough to distract me. \n\nI reached out to an online friend on a different fucking continent just to have anyone who would respond to me until I put myself to sleep with alcohol and sleeping pills. \n\nI started therapy a few months ago when my depression was causing me to lash out at the one person who claimed to care the most about me (my online ex) because my desire to keep them close to me was pushing them away and I wanted to fix myself. \n\nAnd I thought I was. I thought I was getting better but that was a fucking lie. I had put off the thought of starting meds because “I was getting better”. I have had my PCP, my GYN, and everyone who knows my issue, and even my therapist tell me that I have reached the point of needing meds. \n\nBut no. I was convinced I’d be strong enough to pull through. Big fucking rip. \n\nHere I am drowning myself in alcohol and sleeping pills just to tranquilize for the day since I can’t get an appointment for a few weeks. I tried reaching out to my PCP for some help but they aren’t available until next week. None of the few people I can call friends live close to me. I reached out to them, willing to drive the hours just to see anyone but I can’t even get a response. \n\nI wouldn’t even be upset if I just didn’t wake up. The only people this would affect is my parents and my aunt. They’re the only reason I haven’t done it yet. Those friends of mine, I love them and I’m sure they like me in some way but it won’t matter. Hell, they wouldn’t even know. It would just be a matter of “I haven’t heard from her in a while. I hope she’s okay” until I become a distant memory. \n\nNone of them know my address. None of them know my parents. My body wouldn’t be found until it started to decay. Such a wonderful thought lol", "url": "https://www.reddit.com/r/SuicideWatch/comments/q3x04s/i_feel_so_pathetic/", "title": "I feel so pathetic.", "social_network": "reddit", "user": "propofol_diet", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1633697126, "permalink": "/r/SuicideWatch/comments/q3x04s/i_feel_so_pathetic/", "nsfw": false, "first_save": 1635426536.2568257, "replies_charged": false}