{"id": "t5_2qpzs_t3_m49osr", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": " (pardon any spelling & grammar I'm dyslexic) Ok so, I'm a guy and I'm 16. Ok so I was sexually assaulted, by my own fucking brother. Started when I was around 6-7 and didn't actually finish until 14-15 and well at the start I was a dumb kid and well it was fun I guess, I didn't really know what I was doing. He is older than my by a few years and well when I came to the realisation that what we were doing was wrong I thought that if I told anyone then I would get in trouble because I knew it was wrong and illegal. When things where happening we never said anything (no consent) but at the start I did act like I wanted it as disgusting as it sounds. When It came to the point I realised how wrong it was I tried to say I was buzzy or I walked away but that didn't phase him. One time I was having a shower and he burst in and well you can assume what happened. This happened weekly for probably 7 years, sometimes more sometimes less. It got to the point I was scared to take showers and almost cried when I has having one and heard him.\n\nI kept this to myself until 2 weeks ago, I finally mustered up the courage to tell my best friends, nothing really happened after that. I constantly think of it and something as small as kneeling on the floor is enough to practically bring me to tears. I just want to know how to feel, angry, terrified, sad etc because rn I'm feeling nothing. I sometimes look up \"sad multifandom rape\" and just look how they react and most of the time that doesn't help. I've not been diagnosed with depression but would say I was (I don't want to tell anyone how I feel in person and I don't have the courage to get it tested)\n\nMy brother is coming home from uni and well I don't know what to do suggestions?\n\nMy friends know some things about me but they just don't know how much I have done. I cut myself regularly and they think I have stopped because I promised I would call them before I do but well I don't because I don't know what I would say when they ask \"what's wrong\" because half the time I don't actually know how to feel, and whenever we talk about me I feel like a burden because I feel like I'm annoying them or they have better stuff to do than help me.\n\nPS even though I hate him I still love him, I am not fuckling speaking to him either or my parents or the police. ohh I forgot to mention I've also thought about ending it and even go to the point of tying the rope round my neck and let go but cut it off right before I passed out.\n\nThere is soooo much more I could say but I will end up having a breakdown for the 5th time today.\n\nI shall leave with these questions:\n\n* What should I do?\n* How should I feel?\n* Will I ever stop thinking about it?\n* How much longer should I try until I just fucking give up?", "url": "https://www.reddit.com/r/SuicideWatch/comments/m49osr/i_want_to_know_how_to_feel_i_just_need_help_on/", "title": "I want to know how to feel, I just need help on what to do and how to feel. And a way to keep living with the guilt and not just giving up on life =)", "social_network": "reddit", "user": "thisisaburneridkwhy", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1615652967, "permalink": "/r/SuicideWatch/comments/m49osr/i_want_to_know_how_to_feel_i_just_need_help_on/", "nsfw": false, "first_save": 1635426197.6343708, "replies_charged": false}