{"id": "t5_2qpzs_t3_h08ssw", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I’m at a loss for words as to how bad I feel right now and how hopeless my life has become. I’m a 25 year old female who just doesn’t see my life getting any better. I literally go to bed dreading waking up and wake up paralyzed by the anxiety of having to make it through another day. The last 2 weeks has seen me spiral back into old habits I thought I was becoming free of. I suffer from eating disorders and I’ve started binging and purging again to cope with the immense pain I feel inside. I’ve hidden it from my family because I know of they find out they’ll start locking all the cupboards, pantry and fridge, stop letting me have any access to money, take away my car, basically leave my life even more empty than it already is. It feels like bulimia is all I’ve got to live for anymore even though it makes my life a living hell. I’m attending a day program (though it’s online atm due to covid) for my eating disorder but outside of that my life’s gone to shit. I have no job and no motivation to do anything. I pretty much just want to lay on the floor and die each day my brain overwhelms me with thoughts of suicide and how much of a burden I am on my family. I’ve had this disease since I was 12 and it’s made me do some fucked up things. I’m so ashamed of myself for the person I’ve been and the things I’ve done, last year I blocked up the gutter in our street with my vomit as I couldn’t do it in the toilet as my family would find out, we had to get the council out to unblock it I was so fucking humiliated. I’ve stolen food as I had no money for food to binge purge. I’ve lied to my family and at times health professionals to cover up the disorder. Plus there’s just a bunch of other shit I’m disgusted in myself for. Last year my relationship ended with my boyfriend who I thought was the love of my life. I feel like a complete idiot now and blame myself for the abuse I endured from him. He suffers from a drug addiction and mental health issues but he understood me well. I gave him everything I had but it wasn’t enough. And now I’m left with trauma I can’t erase. I’ll never be the same again after what I went through with him. Anyway I just wanted to end this by saying I hope my life ends soon because I don’t know how much longer I can physically and mentally take this pain. I believe in God but don’t understand why he lets me suffer so much. I know I’ve been a bad person but I haven’t always been. I feel for everyone else out there suffering too. Life is a sick joke", "url": "https://www.reddit.com/r/SuicideWatch/comments/h08ssw/im_tired_i_cant_do_this_anymore/", "title": "I’m tired I can’t do this anymore", "social_network": "reddit", "user": "LowConfidence1", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1591787603, "permalink": "/r/SuicideWatch/comments/h08ssw/im_tired_i_cant_do_this_anymore/", "nsfw": false, "first_save": 1635422942.2585328, "replies_charged": false}