{"id": "t5_2qpzs_t3_m2sx12", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "I hate this damn pandemic. It's just brought into focus how much my life sucks and that I really need to die.\n\nMy husband: We've been married for 18 years, he used to be loving and supportive but once the kids were born, he just stopped. All he does all day every day is sit in front of the computer. If he's not working, he's watching youtube or playing a game. He hardly talks to me at all. If I ask for help, he makes such a big deal about how I should be able to handle things myself and that I don't help him at his job, so why should he help with mine. I've just stopped asking for help. He told me that my thoughts and feelings were stupid, so I can't talk to him about that either. If I suggest anything like a restaurant or activity, then it's stupid or a waste of time. I'm stuck always doing what he wants, eating the food he wants. I can't even pick on mother's day or my birthday.\n\nThe kids: My husband wanted kids. Because I grew up with abusive parents, I really didn't want children. So we have two kids. Both have special needs and I've been the sole caregiver for their whole lives. Dad wants nothing to do with them. So I'm stuck doing everything that involves them. Over the past year I've had to do school at home, and I found out that the teachers have been doing their schoolwork for them, so it's a massive effort to get them to do anything. I've had days where I've been screamed at and cursed out by the kids and then I'm stuck doing their schoolwork and making sure it gets turned in. They've grown up watching their dad do nothing and ignore me, so they do the same thing.\n\nMy job: I have owned and run my own artsy business for 18 years. At first my husband was helpful and supportive. Since I lost 75% of my income in 2020 due to cancelled events, he's been telling me that my art is a waste of time and that no one wants it anymore. I also had 2 other part time jobs since we've been married because he thought I wasn't pulling my weight enough in the household. One job I quit after 7 years because of an abusive boss and my husband asked me to quit the other one because he wanted me to be at home more. \n\nThe breaking point: He told me in early 2021 that I was too fat and he wouldn't love me unless I lost weight, back to my weight when we first met. I'll admit that I've put on some weight, but I've had 2 kids and a ton of stress in the past 18 years. He's gained 60 pounds since we met and I haven't said a peep. So I went on a diet. I stopped eating desserts and bread. I've lost almost 15 pounds in 6 weeks. Not a word from the husband. I'm going to keep going. He knows that I had anorexia in high school. I'll just keep going until I'm a skeleton. \n\nHe doesn't believe in divorce, so my only way out is to die. I'll stop eating completely on May 1st.", "url": "https://www.reddit.com/r/SuicideWatch/comments/m2sx12/worn_down_and_theres_nothing_left/", "title": "Worn down and there's nothing left", "social_network": "reddit", "user": "okiewolfbear", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1615476911, "permalink": "/r/SuicideWatch/comments/m2sx12/worn_down_and_theres_nothing_left/", "nsfw": false, "first_save": 1635422276.335989, "replies_charged": false}