{"id": "t5_2qpzs_t3_m37wbu", "request": ["9cb7ef4e-af9d-4403-b84a-be5dd3f5e75c", "e79a79ca-6f5c-44ca-b1e4-309a4afa83c2"], "text": "I’m tired y’all.  I’m just so tired.  \n\nI’m mot even sure if I should be posting here. I want to die, but I don’t want to do it myself.  \n\nMy life just isn’t getting better.  It’s worse and worse.  I do not want believe I have the strength to start over again.  I  barely have the energy to do it now.  \n\nI’ve dealt with passive suicide ideation for about 7 years.  These feelings just keep getting stronger and stronger.   I have floor to ceiling windows. I find my self leaning into them and fantasizing about landing to the ground.  Sometimes, I just wish someone would plunge a knife into my heart and twist it.  Multiple times.  \n\nI’ve been trying to listen to sermons, but I find myself thinking if god was a merciful, yet all knowing god, he would have had my mom abort me when she had a chance.  \n\nI won’t have health insurance for a therapist until 4/1.   There are things I could be doing to improve my life, but I’m fighting so hard to stay alive that I just don’t have the energy to do that other stuff.  \n\nMy family is being supportive by caring for my baby while I “heal” but all it reminds me of is the fact that there are people out here to care for my son.  He doesn’t need me and will probably be better off without me.  \n\nI am crying out for help. Please let me know tips on how to get over this feeling.  I’m tired of fighting this fight.  \n\n\nPS: I’m feeling really delicate.  Please no comments commiserating.  I just think I need tips to get better.  I’m afraid if I find people who agree I won’t feel like death is a crazy idea.  It might tip me over the edge.", "url": "https://www.reddit.com/r/SuicideWatch/comments/m37wbu/help_request/", "title": "Help request", "social_network": "reddit", "user": "Ir131", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1615517678, "permalink": "/r/SuicideWatch/comments/m37wbu/help_request/", "nsfw": false, "first_save": 1635425157.8587253, "replies_charged": false}