{"id": "t5_2qpzs_t3_q0aotm", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf", "4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "Alright, so I hope you can hear me because I don’t want to record this a hundred times. Anyway, I promised some people that I would put this video together if I ever got to the point of trying to end my life again. I want those that have been in my life, for better or worse, to have some closure that suicide itself usually doesn’t give to those still living. I also want to make clear why I am doing this. I don’t want there to be confusion. I’ve been contemplating this for a very long time.\n \nThis choice is not about the breakup. Please do not blame it on that or think that is what brought me to this point. This choice is about a lifetime or physical, emotional and sexual abuse, as well as neglect and failure by the systems society has put in place to prevent these things. The relationship only showed me that my childhood, and the behavior of my abusers, was not normal. The relationship showed me what a functional family looks like and that certain things, like Christmas and my birthday, don’t need to be painful events. Roxie simply opened up my eyes and helped me understand that my experience wasn’t normal.\n \nIm not going to go into great detail about the abuse in this video. There are multiple copies of my narratives in circulation among therapists, friends and family members. One thing I have worried about is that if I were to end my life, those stories wouldn’t see the light of day. Im quite confident at this point they will forever be part of the public record. The system designed to prevent what happened, failed and I hope somehow, someday, that it can be fixed. Fixing it will mean people need to be held responsible, and I believe in part, that my death can help do that.\n \nIt turns out it isn’t normal to sleep on floors because your parents prefer to have a guest bedroom or an office. It isn’t normal to have to undress and shower in front of a parent everyday. It isn’t normal to be pulled from bed in the middle of the night because a parent wanted something from the kitchen. It isn’t normal to have your parents parade your failings in front of the neighborhood. It isn’t normal to feel the need to barricade the door and windows each night in order to feel safe enough to fall asleep. Until this past year, these, and many other things, were normal to me.\n \nSome may doubt the validity of my claims, just like some doubt that I have actually tried taking my life before. However, I think upon examination of all the evidence, a reasonable person can conclude they are valid. I admit that feels like a big assumption, but after finally opening myself up to clinicians, and in support groups, I seem to see more and more evidence each day. Evidence came in the form or developmental delays, hygiene and sleeping habits, isolation, expressions about various social systems, and direct pleas to authorities. Connecting the dots is really not that difficult.\n \nSome will posit that there is no way my parents could have been capable of these things. Socialability, and intelligence don’t preclude someone from also being vile and mentally ill. My mother was fantastic at putting on a face in public. I’ve come to believe that a lot of people who are mentally ill and abusive, are actually very good at faking it. Faking it, whether as the victim or perpetrator helps to insure survival. Look at Brian Laundrie, a performance in front of the police insured he was able to continue his reign of terror.\n \nIn my life I feel like I have always been in a state of survival and alertness. In many ways I have benefited from this. Some may point at my life and say, well he seems to have been a successful adult. I needed to insure that I didn’t have to rely on my parents because they couldn’t be relied upon. So that “success” is a product of necessity. Knowing that the longer I allowed myself to be dependent upon abusive and negligent individuals, the longer I’d need to handle the abuse. So yes, I made sure I could maintain as much autonomy as possible; that isn’t success that is survival.\n \nLike I have mentioned before, isolation was a symptom of what was occurring. However, it was also necessary for survival. Isolation insured that I didn’t need to worry about someone else being used against me. I learned early on, that a parent would take things that I cared about and destroy them if I fought back against the abuse. Therefore, no friends meant less to lose. It also insured others wouldn’t be dragged into it. The problem now is that the isolation is killing me.\n \nPeople will inevitably wonder why I didn’t fight back. It’s sad this is even a question. However, I learned early on that fighting back made it last longer. As I got older and bigger, the threat of fighting back was turned on me. A parent would threaten to call the police and claim I had attack them. At this point the police had already told me I was an ungrateful child, so I had every reason to believe that they would believe them and not me.  Like I said, the system failed.\n \nI have C-PTSD and one of the hardest consequences of this for me has been the hypervigilant state I am always in. My fight or flight instinct is like a hair pin trigger. The need to account for every person, emotion, and choice that occurs in an environment is exhausting. I’ve gotten really good at reading rooms for someone who was admittedly anti-social. This along with the warped self-image have been the two symptoms that never seem to improve. They always get worse. I negotiate with myself daily whether I need to sleep in my car, or if I deserve to eat. I never feel safe.\n \nThis is further made worse by the ADHD. Though not a consequence of the abuse, it doesn’t make dealing with the consequences any easier. The ADHD drives a response to the trauma that makes it harder for me to relax. I have to make myself busy to feel numb. I end up taking on twenty different projects and drown myself in work to not feel. This in turn drives stress and feelings of insecurity when I can’t seem to be like everyone else.\n \nBoth the ADHD and the C-PTSD drive the MDD. Being labeled with Major Depression Disorder was really upsetting when it happened. It felt obvious. It makes things feel impossible to overcome, so while there are treatments for both ADHD and C-PTSD, its hard to convince myself that I am worth fixing and spending money on the treatments. Which is ironic, because the ADHD and CPTSD have ensured I have the means to pay for the treatments.\n \nSo with trauma, developmental, and mood disorders I have been on a variety of different medications. None seem to work. They either feel like they have no effect, or more recently have a slight effect but also make me violently sick. The other part of treatment requires healing relationships and a network of supportive people. The problem is while we can’t find treatment I am essentially an emotional terrorist. The most healthy thing for everybody else is to avoid me, which is in turn the least healthy thing for me.\n \nAll of this is why I must die. I no longer want to be an emotional terrorist, yet find it impossible to fix the problems any other way. Society arguably will benefit most with my death. There will be less emotional pain in the world, should I die than if I were to stay alive.\n \nIn 2021, I can count more than 8 times between February and now that I have taken an action or ingested a substance with the express intent of harming myself. In 2020 these numbers were similar. In 20 years I feel I have tried almost every method or means in my life to end my life. So this is how I am going to do it. I have curry from a great Thai restaurant called Dee Garden Thai Kitchen. Ted, if you’re listening, they had a good mango rice dessert too. \n \nIn the curry, I am going to pour antifreeze. I will ingest the curry, and based on my calculations will be dead within a day. Until I am confident that the damage can not be reversed, I am going to stay rather hidden so I can’t be forced into a hospital. In a few hours though, enough damage will have been done to my already fragile liver and kidneys that organ failure should start. At that point I will go to the hospital in hopes of receiving palliative care while I die.\n \nI do not want my parents claiming my body. I want to be cremated and flushed away. I am hoping with what I have left in this world, my estate can do some good. I am personally partial to funding a financial literacy initiative, but I will leave that up to those I have left in charge. \n \nI wish you all the best. Be happy, because I will no longer be sad.  Goodbye.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q0aotm/a_transcript_of_my_goodbye_video/", "title": "A Transcript of my Goodbye Video", "social_network": "reddit", "user": "mrabstract29", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1633235401, "permalink": "/r/SuicideWatch/comments/q0aotm/a_transcript_of_my_goodbye_video/", "nsfw": false, "first_save": 1635425276.0553665, "replies_charged": false}