{"id": "t5_2qpzs_t3_okgd08", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "I have never actually been actively suicidal, but the thought has been there ever since my early teens when something pretty traumatic happened to me. It was sort of a back door, you know? But never something I considered going through with in a near future. I didn't have a plan or anything really, but the thought of having a way out was comfort enough. Really, the simple thought that \"this won't last forever, it will all end some day\" was usually enough to keep me from feeling panicked and claustrophobic for simply being alive.\n\nAnd growing up I naïvely thought that life would just automatically get better without me actually putting in the time and effort to make it so. The prospect of becoming an unemployed, depressed and washed up adult didn't even occur to me. I was convinced that by this time I would either be dead or having gotten my shit together, have a decent job and maybe even a steady relationship. This in-between sad existence was something I didn't expect. 13 year old me would be so disappointed.\n\nNow I'm at a stage in life where I'm still young, but I've managed to ruin basically everything I had going for me in life. If I had put in the effort I could have gone places. But here I am, borderline-alcoholic, depressed, used up and hating myself. Through my careless, self destructive lifestyle I've gotten myself a bad reputation, allowed people to take advantage of me and used and abused other people and more or less hurt myself in every way possible, physically and mentally. I'm scarred and damaged inside and out. I'm a shell. I've gone out of my way to make sure I get to see the very worst of human kind by spending my time with others who hate themselves and life as much as I do. I've destroyed so much I don't even know if I have more to lose. I feel like a bottomless hole of hatred, rage and contempt for myself and everyone else. I can't feel happiness, I can't love. I can't feel anything but shame, regret and anger. I resent myself for allowing life to get this bad. I'm not considering suicide now, but part of me wishes that teenage me would have just ended things before this shitshow began, so I wouldn't have to live down this long walk of shame. I thought there would be some kind of reward or feeling of pride at this point for fighting to stay alive. But all I get is more and more shit thrown at me. It never ends. Life just deteriorates and I feel like a zombie.", "url": "https://www.reddit.com/r/SuicideWatch/comments/okgd08/i_wish_i_had_killed_myself_when_i_was_a_teenager/", "title": "I wish I had killed myself when I was a teenager", "social_network": "reddit", "user": "Paragon_Belial", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 667, "down_vote": 0, "creation": 1626305060, "permalink": "/r/SuicideWatch/comments/okgd08/i_wish_i_had_killed_myself_when_i_was_a_teenager/", "nsfw": false, "first_save": 1635426873.3426328, "replies_charged": false}