{"id": "t5_2qpzs_t3_cv2qbl", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "Every day I wake up and I try to start over new. Happier perspective. “Good” thoughts. Achievable goals and ambitions listed for the day. And by the end of the day I’m laying on my couch feeling sorry for myself. I wrote a journal entry about how replaceable I am. And not just at work. \nMy mom would replace me and be able to provide a better life for my kids. My boys would never have to see me cry again, or be short with them because my anxiety is out of control. My boys wouldn’t be disappointed in my minimal reaction to something they’re excited about because I can’t muster the energy to fake a smile anymore. \nMy boyfriend would most definitely find someone healthier, prettier, more successful and more motivated than I. He deserves the best, and I know he would find it because he is handsome and charming. Well rounded and well educated. It wouldn’t be long before people were throwing themselves at him. \nI mean nothing to my mother. If anything it would be a relief if I was gone. No more inconveniences. No more financial burden. No more arguments about how I want my boys raised. No more pain, no more disdain. It would be relaxing and rejuvenating for her if u just disappeared. I have no father, my sister is my half sister and is on my mothers side, so her opinion of me isn’t much shorter than the hate my mother holds for me. \nI’ve completely isolated myself from my friends. Often I get invited out and I cancel last minute (even plans I’ve made), because I can’t make myself leave the house. \nYes, my children would be sad, maybe? They’re 10 and 6, so there’s lots of time and years to heal and move on if they could even wrap their little minds about my cease of existence. My boyfriend would be sad, maybe for a while. But someone very close to me killed themselves, and I’ve been functioning through life while moving forward with the pain. \nPoint is, there would be a temporary sadness for those who care...but they would move on. They would continue to live their lives. Eventually I would be a faded memory without even a second thought when crossing someone’s mind. I honestly feel in the long run everyone would be better off without me. I’m in constant torment of my mind, and my paranoia and inabilities to make rational thoughts has inhibited so many people around me from thriving in life. I feel like my boyfriend is constantly walking on eggshells in fear of triggering me. What a relief it would be for him! I ruin anything good he tries to do. Like for example, I lost my mind tonight because he wanted to split the cost of a party bus with his ex and her fiancé so that we wouldn’t have to drive and could relax. Because I can’t be an adult, the whole situation is awkward and uncomfortable now. Yet, when I put my foot in my mouth and said never mind we’ll take the bus, I am now uncomfortable and bitter because I have to spend an evening with him and his ex. Drama. That’s all I am. A waste of human breath that creates chaos and misery for everyone involved. \nI used to say the guilt of my children kept me from following through with suicide. But now, knowing they would move on and be happier, is almost more reason to do it sooner than later. \nThe freedoms associated with death are so enticing right now. No more pain, no more emotional war. No more anxiety over the shit planet I selfishly chose to leave my defenseless children in. No more suspicion. No more jealousy. No more worthlessness. No more poor self esteem. \nJust quiet.", "url": "https://www.reddit.com/r/SuicideWatch/comments/cv2qbl/the_reasons_to_die_are_outweighing_the_reasons_to/", "title": "The reasons to die are outweighing the reasons to live.", "social_network": "reddit", "user": "trashlady88", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1566699405, "permalink": "/r/SuicideWatch/comments/cv2qbl/the_reasons_to_die_are_outweighing_the_reasons_to/", "nsfw": false, "first_save": 1635426450.3485353, "replies_charged": false}