{"id": "t5_2qpzs_t3_pqesg4", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "***please leave comments, I’m begging please***\n\nI’m still what people would call “very suicidal” but this experience has made me realize that my actions would hurt everyone that I love in the world. I’m having some of the worst anxiety I’ve ever experienced after doing this and I think it’s my body telling me to come clean. I have no idea how to tell him. \n\nI want to give him a huge explanation but I tend to get caught up in the details and end up loosing focus on whatever I was trying to communicate. \n\nHis sister (19) passed away this year from a heroine addiction, but he speculates about suicidal intentions often. This is one of the reasons why I feel so terrible about this. First of all, I feel selfish for almost inflicting another tremendous loss and, secondly, I attempted with the drug that took his sister’s life. \n\nI texted a man I haven’t seen in almost two years and asked him to bring me the supplies and he came quickly. When he got here I did an amount that I thought would get the job done but I just ended up getting knocked out. I’m not really sure of everything that happened after that. I vaguely just remember him saying he has to leave and then I think I remember seeing the door close behind him. \n\nMy bf is not a very trusting person and he’s had issues trusting me in the past when it comes to cheating and being cheated on. I can’t shake the feeling that he’s going to leave me because he thinks I cheated on him. \n\nI know I have to tell him because he’s probably the one person on the planet that I’ve ever been completely honest to but I have no idea where to even start. If I mention that I didn’t cheat then I think he’ll be even more suspicious. I know the more important thing is that I’m honest about my attempt but he’s one of the only things keeping me on this earth at the moment and I don’t want to risk losing him. I suppose that sounds selfish but I’m also scared to tell him because of the pain it will cause him. Like I said, his sister passed this year and they were very close and I can’t bear to tell him that I nearly caused him more pain. \n\nPlease help me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pqesg4/how_do_i_tell_my_bf_that_i_attempted_while_he_was/", "title": "How do I tell my bf that I attempted while he was on a trip?", "social_network": "reddit", "user": "This_End_3356", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1631935185, "permalink": "/r/SuicideWatch/comments/pqesg4/how_do_i_tell_my_bf_that_i_attempted_while_he_was/", "nsfw": false, "first_save": 1635427940.215221, "replies_charged": false}