{"id": "t5_2qpzs_t3_ox8zrb", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I’m really starting to think that I am not meant for this world. That I have been damaged and screwed up too much to really relate to anyone. I have been seeing a therapist and he thinks I can change. He showed me letters of people who felt the same, but with each failure his words just continue to fall on deaf ears. \n\nI’ve honestly been trying run out the clock. My life insurance policies have a 2 year suicide exclusion. That exclusion ends next month. That way even if they do rule my death a suicide the people in my life will at least get something.\n\nI know what I want. I want a hot, swimmer’s build body. Right now I am a fat slob. But I can’t do it. I can’t control myself. As a gay man, this pretty much shuts me out of the dating pool. Yes there is the chaser community, but honestly seems to be 10 chubs to 1 chaser. \n\nI am so lonely and isolated. I am so awkward around people. I never feel comfortable in group situations. I can make small talk fine, but no one is ever interested in becoming more than just talking buddies whether I have romantic interest or not. \n\nI feel like I’m starting to become one of those incels people make fun of. I am very resentful of men with hot bodies who seem to have everything. I don’t want to sink into that type of hatred so I feel the best thing is too destroy myself as it appears nothing I do will ever make me happy.\n\nI’ve maxed out all my life insurance and accidental policies. My parents may lose a son, but they will be close to millionaires if my death is ruled accidental. I plan on taking some allergy pills which make me super drowsy and then get on the highway driving just a bit faster than usual on a super sharp section. \n\nHoping I can do this soon", "url": "https://www.reddit.com/r/SuicideWatch/comments/ox8zrb/lonely_fat_and_miserable/", "title": "Lonely, Fat, and Miserable", "social_network": "reddit", "user": "exorgoldcorona", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1628013498, "permalink": "/r/SuicideWatch/comments/ox8zrb/lonely_fat_and_miserable/", "nsfw": false, "first_save": 1635427096.6753182, "replies_charged": false}