{"id": "t5_2qpzs_t3_o4kegz", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "Yes, that is right, I do have suicidal thoughts and tendencies, fantasies, ideas. I see suicide as a solution. There is a famous quote that reads \"Suicide is merely a permanent solution to a temporary problem\" (I do not remember who said that) and, although I agree, what happens when you have \"too many temporary problems\"? Let me give you some background info:\n\n1. I have been diagnosed with Bipolar Disorder, Severe Depression, PTSD, OCD, high Anxiety leading to panic and anxiety attacks. I am tired of this - I have been changing professionals and medication for more over a decade and I do not see improvements.\n2. I have had cancer in the past, I beat it like a champion only because I was young and caught it in time, at age 25. I have never stopped smoking since I started, at age 15 and by age 30 I was diagnosed with COPD, namely emphysema. This is an illness that advances as long you do not quit smoking and that is the case, I am 36 still downing two packs per day.\n3. I am financially unstable. I live in Argentina, alone, in an apartment that my parents lent me out (rent-free). Even without paying rent, my income amounts to approximately USD $ 300 per month - generally speaking it is a very low salary, it is only the type of salary that enables you to live decently in third-world-countries like Argentina, Venezuela, North Korea, Vietnam and a few more.\n4. I hay to pay for private health insurance because of my psychological, psychiatric and general health conditions like having had cancer and a grand total of 11 surgeries. This drains up to approximately 30% of my net income.\n5. I am 36 years old with a chronic pulmonary disease that is advancing, I have had cancer, I have no money to just move abroad and make a living in a decent place (dreaming of Europe because I have Portuguese Citizenship). That is more like a dream and a reality.\n6. Because of my current health situation (psychological and physical), there are two main impairments: money and downhill health. I terms of health, LITERALLY, I cannot have sex if I do not take a handful of Sildenafil pills (commonly known as Viagra) and my mind is in a constant turmoil seeing clearly how stuck I am in a life that partially gave me a shitty hand and I did not play those shitty cards well.\n7. I am alone in a city in which I have been for years, Buenos Aires, but I just do not have many friends, I tend to isolate myself when feeling down. Add to that the fact that I have been single for about eight years, firstly because I was about 30 living with \"mom & dad\" and now struggling to make ends meet combined with health related issues.\n8. Sometimes I am so depressed that I see suicide as the one and only way out. I know that it is drastic, irreversible and that some people, like my family, will be left behind devastated, but, what can I do? My live is not going anywhere, it is not advancing, and that is all I can think of. It is actually soothing: when I go to bed and cannot sleep, on those days I feel down, I think about the beauty that suicide has in my mind and all the possible options and I actually soothe and get to sleep.\n9. I was (WAS) an airplane pilot and had everything going for me until a nearly fatal motorcycle accident that left me unable to fly again. I am an English teacher now. Sure, I like teaching, but I LOVE flying - there is a difference. That is another blow\n\nSo, if we count up the negative aspects we can see that:\n\n1. I have COPD, emphysema as stated above.\n2. I am emotionally unstable and different therapies, doctors and medication over more than 10 years made no difference.\n3. I feel am alone and I feel lonely (not quite the same).\n4. I have psychological and psychiatric conditions.\n5. Besides emphysema, it may possibly perhaps be that another COPD I have would be lung cancer (tests to take place in August).\n6. I am financially unstable and would LITERALLY not be able to live alone if it were not because of the generosity of my parents giving me a place to stay.\n7. I barely make it to the end of the month in a third-world-country, literally impossible in a \"real\" country.\n8. I lost planes, the love of my life, while heading to work. I like teaching but it is not the same feeling and it is not nearly close the money I would be making.\n9. All of my physical and mental conditions are chronic and will not go away.\n10. If I am lucky and get laid, without a handful of Sildenafil, I would literally not function (yeah, add that to the budget). I would like you to do the numbers so you have a vague idea of you much money I am now spending on health and, contradictory, on cigarettes:\n   1. Cigarettes ± USD $ 100 per month (2 packs x 20 cigarettes per day)\n   2. Private health insurance = ± USD 100 per month\n   3. One monthly box of the following medication: Sertraline, Pregabalin, Lamotrigine, Propranolol, Clonazepam, Queteiapine, Zolpidem, Sodium Divaplorate and sometimes it is up to two 60 instead of 30 pills of Clonazepam. I am throwing the meds here because I do not know their price in your country.\n\nAdditional info: I am a very spiritual person (not religious but spiritual, not the same) and through meditation I was able of seeing things that are out of this topic but that opened my way of seeing life, death, afterlife and so on. My dream is to slit my wrists open while sitting in a bathtub so that I progressively lose consciousness and see my life draining from my body; this will give me time to think, ponder, evaluate, come to terms and much more. I would write each member of my close family a letter explaining the situation: I know that in most suicide cases those left behind either do not understand the reasons and/or (even worse) blame it on themselves and I need to do that at least in a mere attempt to prevent me close relatives from feeling guilt. This is a well-matured and thought-over decision that has been in my mind for more time than I can remember. I just have not have the balls to act on it.\n\nHere is the kicker: even though I have not manned-up and gone through with it, by now, 6 to 7 years after having diagnosed with emphysema and smoking at the rate I do, there is (hopefully) a strong chance of having cancer. I will have some studies done in August this year. If I have cancer (brace yourselves) it would be a blessing because I can opt out of any treatment, save \"some\" money and vanish to the woods and I would live a life in nature, hunting and fishing until the final day comes. Basically, I will not be killing myself actively but I will do so in a passive manner by my inactivity towards the impending situation and, thus, giving me time to think, meditate, write those letters, come to terms with my choices and so on.\n\nWhy is suicide such a taboo subject? Has anyone of you been in my place? Has anyone you know been in my place? I will be standing by. I am not looking anyone to say \"YES! DO IT!\" but, let me be clear, I do not want either anyone saying \"DO NOT DO IT\". I want your honest opinions of what would you possibly do if you were in my shoes and if you were undergoing the same shit I am (read the text twice if necessary). Thanks.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o4kegz/is_is_strange_that_i_idolize_and_fantasize_with/", "title": "Is is strange that I idolize and fantasize with suicide?", "social_network": "reddit", "user": "lucasmalfetana", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1624240600, "permalink": "/r/SuicideWatch/comments/o4kegz/is_is_strange_that_i_idolize_and_fantasize_with/", "nsfw": true, "first_save": 1635428432.681703, "replies_charged": false}