{"id": "t5_2qpzs_t3_689a9z", "request": ["9cb7ef4e-af9d-4403-b84a-be5dd3f5e75c", "e79a79ca-6f5c-44ca-b1e4-309a4afa83c2"], "text": "A few of you might have seen my post last week about having pills and alcohol and wanting to die. Long story short, I didn't die, and I spent one week in an inpatient psychiatric facility with group therapy, regulated meal and break times, and strictly regulated possessions (no phones, shoelaces, plastic bags, or razors were anywhere accessible to patients.) It was the best week of my life.\n\n\n\n-\nConnecting with people who legitimately understand and can commiserate in my struggles was one of the greatest feelings in the world. In short, I felt alive for the first time in years. The compassion and genuineness in even the most reserved, unkempt, or uninviting individuals opened my eyes to the true significance and meaning in human life. The sheer determination and will of some patients was beyond inspiring, the almost carbon-copy similarities between my story and others' was overwhelmingly soothing, and the guided discussion helped reopen and readdress issues previously long buried. \n\n\n\n-\nThe people I met in the facility are some that I will never forget. The passionate frustration turned spiritual focus of an older gentleman in and out of prison and homelessness, the reserved kindness in an abused young lady, and the boisterous humor and wheezing laugh of a grandmotherly recovering addict will resonate with me in the years to come. I am in sheer awe and overwhelmed by the passion, the heartfelt connections, and the lasting impressions that a mere seven days has done for me. I finally see the future in a hopeful light, and am ready to face the challenges of reformation, coping, and living. \n\n\n-\nI want to thank the users here that urged me not to follow through with my plan, even though I ignored their care and worry, and I would like to urge you to watch the movie \"Short Term 12\" for one of the most accurate depictions of the raw appreciation for the value of human life that comes from staying in an inpatient facility. (The movie is about minors, but rings true for the adult side as well.) Sorry for the wall of text, I just wanted to express the appreciation I have for the experiences that have led me to a path of recovery.", "url": "https://www.reddit.com/r/SuicideWatch/comments/689a9z/i_attempted_suicide_and_spent_a_week_in_an/", "title": "I attempted suicide and spent a week in an inpatient psych hospital.", "social_network": "reddit", "user": "windows_to_walls", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 150, "down_vote": 0, "creation": 1493471833, "permalink": "/r/SuicideWatch/comments/689a9z/i_attempted_suicide_and_spent_a_week_in_an/", "nsfw": false, "first_save": 1635425162.1837335, "replies_charged": false}