{"id": "t5_2qpzs_t3_hi6tai", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "Today I had reminded myself of something that happened when I had a job last winter in a cafe.\n\nI was constantly stressed and had to leave because my boss bullied me. Being an oversensitive 17-year-old, I couldn't handle my treatment. In my last few weeks when I knew I had to leave and was preparing to say something to her about me leaving, my main goal was to get through the day as quick as possible without pissing her off. I ended up on front of house serving drinks. It was coming up to Christmas so it was quite busy and our cups, teapots and stuff were depleted due to a delay in the dishwashing station. I went to serve this woman a tea and when I removed the lid of the teapot I saw a small bit of dirty water at the bottom. Selfishly, I didn't want to waste resources since we were low on teapots and didn't want to take too long to make the order to avoid criticism from my boss so I just used the teapot with the bit of dirty water at the bottom. I know I should have at least tipped it away but I just wasn't thinking clearly in the moment. I was reckless.\n\nIt wasn't until I went to bed I realised my mistake. I couldn't sleep because I was terrified I could have possibly killed this woman by exposing her to the dirty water from the dishwasher, which could have contained bacteria. I've tried researching and rationalising to calm myself down but my fear is too strong. I know the hot water added to the tea may have killed any microbes. I know if any did happen it's more likely she got ill rather than dying but my brain is fixated on worst case scenario.\n\nIt's just I'm struggling to cope with myself knowing my momentary lapse in judgement could have ended someone's life. I don't know her so I could never take accountability and apologise to her. At least I don't work there now and can't hurt anyone else. I feel like I'm going to spend the rest of my life knowing someone possibly died because of me. Not knowing the outcome makes it worse for me. I am a bad person and I feel like I should punish myself for having an undeserved life when a woman possibly died because of me. I am too much of a bad person to continue my life. Do I consider living my life as a lie knowing who I truly am and living in an undeserved life? I did a horrible thing I shouldn't have done and there is no redemption for me. I want to do the right thing and end my life.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hi6tai/everyone_says_theyre_a_bad_person_i_am_the_first/", "title": "Everyone says they're a bad person. I am the first to mean it.", "social_network": "reddit", "user": "Ready-Pineapple3796", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1593458999, "permalink": "/r/SuicideWatch/comments/hi6tai/everyone_says_theyre_a_bad_person_i_am_the_first/", "nsfw": false, "first_save": 1635428165.407109, "replies_charged": false}