{"id": "t5_2qpzs_t3_mx3nd5", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "I was about 12-13, I was good friends with this girl. Long story short, I once took a picture of her butt when we were hanging out. I felt weird right afterward, it didn't feel right. I was hormonal and had no clue how to deal with it, but that doesn't change the fact that I harassed her. I feel horrible. I can't live with this fact. She never found out and the picture is long gone, but the fact that I was in a mindset to do this disturbs me. Even if I didn't fully grasp the severity of the situation, I cannot move past this. Is this forgivable? I feel like it is not, and I cannot forgive myself for the person I once was. In my mind at the time, i saw it as innocent. My thought process essentially was \"i like girls. i like butts. i should feel fine doing this because i like girls and butts and this is what people do when they are attracted to things. i'm horny, this is normal.\" i feel utterly disgusted with myself. i suppose what i'm really asking is: did i commit sexual harassment? it certainly feels like i did, but it's very hard to accept this possibility. i feel unforgivable. I should also mention i have pretty bad OCD, so getting stuck on something like this is a nightmare.\n\nedit: part of me wants to believe there's a difference between someone full on committing sexual harassment and a kid doing dumb shit out of innocence and ignorance, but this feels like a cheap cop out.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mx3nd5/i_cannot_deal_with_my_adolescent_misdoings_i_cant/", "title": "I cannot deal with my adolescent misdoings. I can't live with the guilt.", "social_network": "reddit", "user": "Zealousideal-Dream82", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1619207721, "permalink": "/r/SuicideWatch/comments/mx3nd5/i_cannot_deal_with_my_adolescent_misdoings_i_cant/", "nsfw": false, "first_save": 1635426200.4027984, "replies_charged": false}