{"id": "t5_2qpzs_t3_j41sdk", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "When I’m feeling despair from life events like losing a job or love on top of a lifetime of treatment resistant depression, I’m actually okay if I’m allowed to hibernate and focus 100% on making it through next 5 minutes or hour or whatever segment I can mentally handle.\n\nBut the moment people start to try and “fix” me, that’s when I become suicidal. I’d rather be loved as I am then made to feel like I’m lazy, selfish, or need to see another doctor or get out in the world more to feel better. \n\nMy parents mean well but keep trying to give me projects, like painting or sanding or cleaning or building, so that I can feel better. It’s making it worse. I’ve tried to communicate this and it gets better but I can still feel their judgment and my dad yesterday made a comment about “you know you hurt others.” \n\nNo shit, that’s one more reason I fall down the spiral of how can I leave this world painlessly and with minimum harm to others. I have lost for many years the ability to connect with those I love. I force it but can’t transform my intellectual knowing of my love for them into joyful shared experiences. I just want to be alone right now and to meditate and do what I have to do to stay alive and cannot cope with knowing I’m seen as a problem needing help and fixing.\n\nEverything in my life is breaking including my heart three times in a row. My dog is injured because of my stupidity with a pending $3000 bill or life of pain. My computer broke year day and my phone barely holds a charge. I lost my job during Covid partly due to a breakdown and partly to keep my immunocompromised boyfriend safe who sent me to my parents to keep me safe and then decided to break up with me. Half of my things are still 3 states away for me to pick up. Lost my bf and best friend, and then the one person who understood me and gave me hope.\n\nI know we’re all in pain. I feel selfish ranting on but that’s one of the defining characteristics of hating yourself or feeling depressed. A fixation on your misery and inability to connect with others’ needs", "url": "https://www.reddit.com/r/SuicideWatch/comments/j41sdk/problem_that_needs_fixing_feeling_like_a_burden/", "title": "“problem” that needs fixing = feeling like a burden", "social_network": "reddit", "user": "Tikvahopeomid", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1601668752, "permalink": "/r/SuicideWatch/comments/j41sdk/problem_that_needs_fixing_feeling_like_a_burden/", "nsfw": false, "first_save": 1635428167.5714364, "replies_charged": false}