{"id": "t5_2qpzs_t3_pq38zp", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "(standard TWs for self harm and suicide discussion)\n\nI don't know why it took me so long to realise it. Maybe it's because I explicitly didn't plan on living to be 20, but it's just hit me that this... this is permanent. I have a chronic depressive condition that is going to last the rest of my life. It's genetic, my father and all of his siblings had it before me. I think his father may have as well. But I realized that I'm 20 years old and I'm going to be staring listlessly out of bus windows dwelling on the fact that I am completely incompatible with my own self perception. \n\nI don't want to be like this, but I think I'm going to have to come to terms with it. I'm tired of seeing spite in every smile, danger in every person who makes eye contact in public, and a sick kind of longing for the freedom I had as a suicidal teenager where I felt like I had the option to leave at any time. Now I know I can't and I won't be able to for the rest of my life. I have pets to take care of, a partner who can't pay the rent without me and would be pretty damn fucked up if I died. He wants kids one day. Kids! A part of me wouldn't mind being a dad either but I'm going to have depression for the rest of my life and even if I do end up with a mostly positive life I'm going to scare my kids with the weeks I can't drag myself out of bed. I never understood it when my dad did it, and even though my memory is hopelessly fragmented my earliest memory is my dad breaking down crying in the kitchen. I don't want my kids to have that memory of me, even though I haven't been able to physically cry outside of anxiety attacks since I was 15. \n\nAnd my partner is the same. What's going to happen when both of us relapse at once? We already have nights we struggle to cook dinner because we both feel like shit, how are we going to feed the kids when we can't get up and call off work because our mental health is broken?\n\nI don't want to kill myself, not anymore. But I do, if that makes sense. I've come to terms with the fact that it's not going to happen, but there's that part of me that wishes I had the option. I have to live with my depression for the rest of my life and I really, really don't want to. I don't want to get to be a 90 year old man sitting peacefully on my porch and find my thoughts turning to how hopeless I've always been and how I genuinely can't stand who I am.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pq38zp/its_finally_hit_me_that_ill_be_like_this_for_the/", "title": "It's finally hit me that I'll be like this for the rest of my life", "social_network": "reddit", "user": "blackrussianterrier2", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 42, "down_vote": 0, "creation": 1631895364, "permalink": "/r/SuicideWatch/comments/pq38zp/its_finally_hit_me_that_ill_be_like_this_for_the/", "nsfw": false, "first_save": 1635425541.376585, "replies_charged": false}