{"id": "t5_2qpzs_t3_pzk6ck", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "I came to study in Germany about 2 years, applied for resident permit, extended my visa and had enough money in student bank account. All was good and well.\n  \n  But couple weeks later I had a very bad depressive episode, complete with suicide attempt, not showering for weeks, self harm, not being able to do anything and etc. During that time I missed paying for medical insurance, which in turn got me dropped out of university, negated my visa and essentially made me illegal immigrant in Germany. I was too scared to tell my parents or ask for help, so I just, stayed there. \n  \n  My parents paid the landlord directly so he didn’t know anything. Eventually what little cash I had run out and I started eating from trash bins and exchanging bottles for some money for hygiene products. \n  \n  At this I point I already wasted my parents money, my student bank account was  frozen, I dropped out, because of couple unsuccessful hanging attempts my brains memory was impaired and I was still horribly suicidal.\n  \n  So I kept spiralling into depression for weeks, attempting suicide (I tried drowning, it didn’t work. Tried cutting my major arteries, I kept fainting when I pressed the blade into the skin. Tied a blindfold over my eyes and walked on the high cliff hoping to fall and break my neck, I just tripped and ripped three pairs of pants. Pills - I just vomited and passed out.). After each attempt I would get so so tired, it might have been shock or just an adrenaline crash. I couldn’t move from bed, couldn’t clean or cook, pissed in bottles or just in cups because I was scared to see other roommates,  couldn’t even reach out and close the damn window in winter. \n  \n  I would occasionally get enough energy, douse myself in air freshener to mask the scent of sweat, vomit or piss, and eat or boil some water or even cook once a month in kitchen. I did it to make sure my roommates saw me doing normal human things and didn’t ring any alarms.\n  \n  Couple of days ago my parents got suspicious and bought me a ticket to fly home, I got scared they would find about everything, researched fines and penalties for illegal immigrants and got even more scared and started planning my suicide.\n  \n  In last couple days I managed to clean most of my room, threw away all moldy food, trash, ratty clothes, journals with very explicit details of suicide attempts and other gory details. I packed clothline, water bottle, a journal in case I decide to write last note, homemade bead necklace my sister made for my birthday, ziplock bag to put my phone, necklace and note in case they get ruined by rain, vomit, blood, piss or feces when my body eventually enters rigor mortis.\n\n  I survived.\n\nI tried working out a solution, I don’t think I have one for couple of reasons. \n1. I checked immigrations laws and since I was there for close to 2 years, I’ll have to pay about 30.000€ in fines. There are exceptions for illnesses, but since I wasn’t diagnosed, there are no official records of suicide attempts and no records of staying in hospital for mental crisis, I don’t have any evidence to back up my claim.\n2. I come from poor country and my parents don’t make a lot. They already took a loan secured by our house to pay for my student bank account and rent. There’s just no way to make money to pay for 30.000€ fine. And this amount of debt would absolutely crush my parents and my siblings wouldn’t be able to go to college. \n3. I’m very very sick and in daily life I would need assistance with everything from feeding, getting out of bed, changing clothes to bathing and using a bathroom. I don’t want my mom to waste the rest of her life having to take care of me. And I don’t want my siblings to see me this weak, dependant and undignified. \n4. In my small town nothing is secret and being suicidal is said to be sign of being possessed by devil. If I die in Germany my death can be explained as an accident, drunk mistake or even illness. If I go home my relatives and then everyone in town would find out about depression, my father would be jobless in less than a week, because nobody wants to be associated with my family and my siblings would get severely bullied in school. Nothing is worth the abuse my family would have to through. And living there and being constantly berated, accused of bringing devil and bullied, I would never get well.\n5. I had some very violent episodes, complete with breaking and throwing stuff. And the journal entries I wrote in this state were violent, full of ways I described how I would cut the meat on my bones, how I could kill a person and how I had imagined killing my siblings, my parents and then committing suicide so we could be together. I can’t even imagine what kind of psychological damage my siblings would have from seeing me screaming how I would kill them, describing how I tried to kill myself and breaking their things. And I can’t imagine how scared and confused they would be when I just never get better and they have to live with this twisted nightmare version of me. I love love love them and I wouldn’t be able to live if I knew i have hurt them.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pzk6ck/hey_guys_i_need_help_brainstorming_my_situation/", "title": "Hey guys, I need help brainstorming my situation, it seems really impossible to not kill myself", "social_network": "reddit", "user": "Key-Leader-993", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1633132561, "permalink": "/r/SuicideWatch/comments/pzk6ck/hey_guys_i_need_help_brainstorming_my_situation/", "nsfw": false, "first_save": 1635426160.3665993, "replies_charged": false}