{"id": "t5_2qpzs_t3_ouukv7", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": " Hello everyone,\n\nI am asking for help with this situation:\n\nI  have met a young woman on the internet, she seems like a really nice  person... unfortunately she is struggling with anorexia and a number of  other mental health issues I cannot even begin to list in full.\n\nShe  is 22 years old, she lives in the Ukraine. She currently weighs 22.5  kgs (=49.6 lbs), but she has told me that her weight was once as low as  17.8 kgs (=39.2 lbs). As recently as a couple of months ago, she weighed  19 kgs (=41.9 lbs). After that she was admitted to a hospital, where  she was forced to gain the amount she weighs now and was dismissed from  the hospital not too long ago. The best I can tell, she has struggled  with anorexia for around 6 years now. She is tired of it. She tells me  she is still attempting to lose weight, but while at one point she did  it for the thinness itself, at this point she just wants herself to die  trying. She values herself and her life as a negative (or at best a 0)  to society. She repeatedly told me she isn't even worth the effort she  puts into starving to death and that she never even could kill herself  properly using this method as she \"has no self-control\". This is the  only part of her messages i regard as a white lie, since she clearly has  already arrived at life-threatening weights.\n\nHer  family either doesn't care for her or doesn't understand her problem,  it is probably a combination of the two (she has told me both things),  so she cannot turn to them. The best part of this horrible story is that  she is not completely dismissive of seeking mental health support,  though she has told me that she has a bad experience with the local  psychologist of the small town she inhabits. She would probably require a  bit of convincing to actually call/visit a professional. I have  searched for ukrainian mental health hotlines she could call, but the  best I could tell, all of them are either reserved for the veterans of  the war in eastern Ukraine or not toll-free (she is from a poor  background, she has just enough money to support herself, or maybe not  even that much. She tells me she hasn't got any money on her phone for  calls). I haven't asked but she probably does not speak English, only  Russian and Ukrainian, I am communicating with her through an online  translation site, most of the time, the message comes across.\n\nWhat can I do now?\n\nIf  you can, please leave advice in the comments (or message me, that's  fine too). Feel free to ask for more details if you think it helps. Any  offers of help are greatly appreciated.\n\nThank you for your time.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ouukv7/not_about_me_is_this_allowed_im_worried/", "title": "Not about me, is this allowed? I'm worried", "social_network": "reddit", "user": "Traditional-Price286", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1627681322, "permalink": "/r/SuicideWatch/comments/ouukv7/not_about_me_is_this_allowed_im_worried/", "nsfw": false, "first_save": 1635422264.4595838, "replies_charged": false}