{"id": "t5_2qpzs_t3_q69zld", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "Just terrible. Fucking cycles of anxiety of every kinda and constant depression ranging from moderate to severe. My personality completely changed too. I use to be super bubbly and even annoyingly nice. I’m now so miserable I’ve lost most of my friends and been an asshole to family. I’m so focused on fixing my own misery that I only think about myself besides buying birthday presents and letting the few friends I have vent about their own trivial problems from time to time. Also have just a burning hatred of how I look due to a maxillofacial deformity and the inability to find a partner due to it and my neuroticism, really makes me sad too. Really was looking forward to first highschool teen love and eventuality having kids with someone. I’ve really tried and each rejection is just fucking dangerous for me especially when I put in a lot of work to make myself more attractive and likable. If I could be treated successfully I could probably handle being celibate forever and cope with whatever.\n\nI tried some codes on my dads gun safe. Right now I’m in the agony stage. Just every second is an anxious dread filled out of despair. Sometimes I think I’m actually in hell. Tried every type of antidepressant. Trying to get ketamine infusions but the clinic called me when I was in class at college and I’ve been trying to reach them and nothing. Called them like 10 times and just nothing. It’s almost like a sign. Maybe. \n\nIs it possible this is actually some sort of hell? I mean I had a near perfect blissful childhood and for it to turn into this, the contrast really is too much to bear. Currently 18 and already disillusioned with the world and everything it has to offer. \n\nCalled the suicide hotline and it was laughably bad. The lady had this fake sympathy attitude and acted bored. As soon as I said I’m done talking, kid you not as soon as I said “I’m gonna g…” boom call ended. \n\nLike I said with just everything going just so perfectly wrong and this terrible sense of doom, I think this is like some sort of hell. I’ve lost connection with people and they are all kinda dehumanized to me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q69zld/3_years_of_hell/", "title": "3 years of hell", "social_network": "reddit", "user": "Physical-Ebb4350", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1633999046, "permalink": "/r/SuicideWatch/comments/q69zld/3_years_of_hell/", "nsfw": false, "first_save": 1635425539.2334874, "replies_charged": false}