{"id": "t5_2qpzs_t3_qbe7ez", "request": ["fa52eed9-681b-4f68-b3d1-78c0eec9a3d2"], "text": "What I will say first is that I use Google thanslate along with my intermediate level English,sorry if it weird english.\n\nI'm from Thailand, now I'm 23 years old that about to coming to a dead end. Now I work in a different place from the province from where I live. (that everyone knows Bangkok) because my home province is rural, Working as general labor work around the production line.and now i haven't worked for 3 months now because I feel bad for what I am, that is, I have bad breath. (Because as a child I was not disregard or pay attention in dental care) It made me afraid to go out to society or go to work, and now I don't have job or money, living in a small apartment.that i haven't paid my bills for 2 months now and I'm sleeping in hopelessness. I feel like dying even though deep in my heart I really want to continue living. In a few days, owner will fire me out.and i will be a homeless person. In fact, I can go back to my hometown. stay there without using money But I don't want to ask my mom for money to pay 2 months' rent and the cost of a bus ticket home. and live day to day Asking for money from parents to use every day. It's so embarrassing And mother would be fed up In me, all my problems were I want some money To take care of the health of my mouth and nose, in fact, if I work for 4-5 months, I can earn money to treat it. However, as mentioned above, I'm afraid that work society will hate on me.and i don't want to make other people on work suffer with the smell of my breath. What should I do? My brain is thinking so hard now that I'm tired. I can't see the light at all, it's all dark.\n\nI am currently studying programming. half way there But to really work. I will have to practice for another year. because I study by myself And I probably don't have any reserves to do this. Because everyday life requires money,And finally, I have to work in the company anyway. Everything I thought I would do seemed to fail. because of the disease that I have. But what I think is that it would be nice to do freelance or work from home from this line of work.\n\ni'm thinking about suicidal everyday,but i don't want to.\n\nI didn't want to die because I was afraid others would have to cumbersome because of me. But it's almost time for me.\n\nNow I understand the feeling and people's final thoughts Before they were homeless\n\nhave good advice Can you help me? Thank you very much 😭", "url": "https://www.reddit.com/r/SuicideWatch/comments/qbe7ez/my_life_is_reaching_a_dead_endmaybe_tomorrow_i/", "title": "My life is reaching a dead end,maybe tomorrow I will be homeless. :(", "social_network": "reddit", "user": "IMM16", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1634658231, "permalink": "/r/SuicideWatch/comments/qbe7ez/my_life_is_reaching_a_dead_endmaybe_tomorrow_i/", "nsfw": false, "first_save": 1635425437.7471895, "replies_charged": false}