{"id": "t5_2qpzs_t3_brec34", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "I'm young. I'm 16 and I've been having suicidal thoughts since about a year ago and I've been feeling a profound emptiness inside myself for even longer.\n\nI guess getting a job is where it started. For, like, the first 2 weeks it was nice. Learning the ropes and all. Then, almost without warning, the learning phase stopped. And it was a grind. A constant battle of myself vs dickish customers. I try to be nice, but it's hard trying to be dry in a lake. When I'm not doing school work I'm working with very scarce exception. I like making music but I unfortunately don't have time for it and everytime I do have free time I'm wrung out so much I don't have the energy to do anything, let alone a creative task.\n\nI have, like, 3 friends. Only 2 of them are supportive of me, and only 1 of those I can see in the flesh. We shoot the shit during school, but my online friend is really the only human I can confide in anymore. But I feel bad for him. It shouldn't be such a lovely person's responsibility to deal with my incessant mental health hearing shit daily panic attack bull fucking shit. I almost feel like everytime we talk, I can't help bringing him down with me. I love him so much. He has a girlfriend, someone to love so I think he could persist without me.\n\nMy parents support me enough so they don't get arrested, which is a different concept from love. And except for a few cousins, I'm just an awkward shut in loser who hates everyone. If I told them, I feel like I'd just be a liability, or worse they wouldn't believe me.\n\nWhen I was around 12, I recognized that I (a man) had romantic feelings towards other boys at school. Seeing this as an abnormal, but not inherently negative thing (my family is not religiously or ideologically against it), I told them and they shut me down and I just felt like a fly pressed on the wall. The fact that they would so harshly do that made me feel like I was just an obstacle.\n\nI can't fathom doing that again, but with my whole character in lieu of a trait. Every day for like 2 months now, I have had a persistent heavy feeling in my chest that I think is psycho-somatic as it is paired with a looming melancholy.\n\nIf my life continues to be just a grind in a fucking service job, doing nothing but making money so I have the divine privilege of sucking Mr. Bossman's proverbial cock another day, I'd sooner be fucking dead now, having ended it while I was ahead.", "url": "https://www.reddit.com/r/SuicideWatch/comments/brec34/im_scared_of_life_and_death_too/", "title": "I'm Scared of Life, and Death Too", "social_network": "reddit", "user": "lil_cheezit", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1558464992, "permalink": "/r/SuicideWatch/comments/brec34/im_scared_of_life_and_death_too/", "nsfw": false, "first_save": 1635427570.1820655, "replies_charged": false}