{"id": "t5_2qpzs_t3_fbko8a", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "He has 4 kids, two under 10 and two over 20.  I'm over 25. He has a partner of 10+ years who loves him. He has a good job, which he actually quite likes. All his kids love him. The youngest still worship the ground he walks on. The 5 year old sees him like a super hero.\n\n&#x200B;\n\nHe had a son, my brother, who died. He'd have been over 20 now. He died around 15 years ago. My dad never had much contact with him and he died before that could improve. My dad tells me he \"wants to feel the pain his son felt\".\n\nHe also feels he can't make his partner happy. They have a relatively comfortable life, but it's also quite basic. I get the feeling they both find it monotonous and they're tired of living the same day on repeat.\n\nHe also gets OCD intrusive thoughts/ruminations. Mostly these thoughts are him doing something terrible which ruins the lives of the people he loves. Such as attacking his boss, which would mean he lost his job, which would cause major problems at home and let everyone down etc. These thoughts have been happening a long, long time. Decades. He battles them constantly and feels guilty for having them. He  actually ended up getting prescribed citalopram to reduce them (10mg a day - small dose. I think he's upped this to 20mg recently, however).\n\n&#x200B;\n\nYesterday he tried to hang himself in a hotel room. He had been drinking all night and had called someone and told them he was depressed and was going to do it. The information got back to me and I caught him on the phone as he was going to do it. After an hour of speaking the phone died so I called the hotel and told them to go to the room. They found him with a bedsheet around his neck.\n\nI managed to find him afterwards. He's now sober and saying the same things. He's tired of the challenges of life. He knows people love him and depend on him but he thinks ultimately we'll all be better off without him. There's nothing he can think off that will solve it or make him feel better.\n\n&#x200B;\n\nWhat the hell do I do?", "url": "https://www.reddit.com/r/SuicideWatch/comments/fbko8a/dad_attempted_suicide_yesterday/", "title": "Dad attempted suicide yesterday", "social_network": "reddit", "user": "tiredoflifejr", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1583017105, "permalink": "/r/SuicideWatch/comments/fbko8a/dad_attempted_suicide_yesterday/", "nsfw": false, "first_save": 1635428065.0846605, "replies_charged": false}