{"id": "t5_2qpzs_t3_qhabse", "request": ["69686dc6-5bf4-41ab-864a-231bdd6f02c9"], "text": "i don’t even know man. i don’t know where to start. my whole life feels like it’s gone to shit. my girlfriend and i got together last year at the start of grade 10, and that year was the happiest i’ve ever been in my entire life. i’ve never felt so cared for, so loved and appreciated. there wasn’t a single day we didn’t see eachother. there wasn’t a single day that we wanted apart. we’re know in the grade for having the perfect relationship, everytbjbg was perfect and exactly how i wanted it. that’s until the start of this month. last year (before we started dating) she had a crush on this guy, but we got together and those feelings quickly died out, but the start of this month she tells me that she likes him. before this though, she gave him her number and they started texting, I automatically had red flags, as I knew that he liked her based on the way he interacted with her and stuff and I was very uncomfortable with them talking. Things kind of starting to escalate now. She kept talking to him and would listen to my warnings but not do anything about them and just keep talking and talking until eventually they start wanting to hang out and she has all of these things she wants to do with him. This continues for about two weeks and it is making me so unbelievably sad and I’ve been just feeling so unheard up to this point and so not listen to. and then that gets us to when she tells Me she likes him over text. Obviously I am feeling so many emotions at this point and I am not in a good place already, so I get so mad at her, this is the second time I’ve ever been mad at her since the day we met. I just went off on her about how she was lying to me when she said I was the only one and how she was all just lying and I mean absolutely nothing to her and I keep just going and going until she gets to the point of tears. I didn’t want to do any of that and I didn’t try to it just kept happening. That night we come back to my house and talk and talk and talk and get to the point where she says she wants to have a break in the relationship, but she really would like to get back together she’s never going to stop liking me, but she just need a little time to be herself. I agree and we go on. The very next day she hangs out with him, she doesn’t give me any kind of time to process it doesn’t give me any kind of time to prepare, I wake up and see text from her saying she’s hanging out with him. This obviously made me so sad and just upset and it just made absolutely nothing better. she keeps talking to him and hanging out with him for a while now and she’s still doing  it up and it’s making me so sad every single damn time she does it. A little time goes by and we have another talk and she tells me she doesn’t know if she likes me anymore, she tells me she doesn’t know if or when we’re gonna get back together, and she tells me she doesn’t know what she’s feeling about anything. She knows she likes him, she knows what she wants with him, she just doesn’t like me anymore. She’s constantly insisting that I’m not getting replaced and that I am not just temporary, but with everything she’s been doing and saying it feels like I am. she’s hanging out with him instead of me, she’s falling for him. We have gotten so close over the past year, we have been through so much together and we have been so damn close, and I can’t help but feel so fucking betrayed by this. She told me that I was forever, that I was her forever person. She always tell me how there’s no way in hell we’re gonna break up, I just don’t even know what to think. Then a couple of days ago she tells me everything that I was doing in the relationship that made her feel bad, she told me how she felt like I depended on her solely for everything, how I would always expect things from her and she said she felt so bad for not telling me in the relationship but she just didn’t know how because she didn’t want me to feel bad. If she had just told me she could’ve saved our relationship, she could’ve let all of this just never happened and we’d be happy and fine. This person is the closest person in my life, I’ve never felt more emotion for another person that I have for her. I don’t even know what to think what to say or what to feel anymore, all I feel is just numb and hollow. I’ve never been in a good mental place and I’ve never not been suicidal. But this is just sending me over the top and I don’t know where to go when I don’t know what to do when I don’t wanna have to deal with this guttural heartbreak. Heartbreak isn’t even a way to describe it, I wouldn’t want to put this on any other human being on the entire world, not even the guy she likes instead of me. Every night it’s a struggle to not want to do it and every single day it’s the only thing I can think about. I just . know how to cope anymore, and I don’t want to", "url": "https://www.reddit.com/r/SuicideWatch/comments/qhabse/im_fighting_the_urge_so_hard_not_to_kill_my_self/", "title": "i’m fighting the urge so hard not to kill my self", "social_network": "reddit", "user": "Bacon_Fucker69", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1635379955, "permalink": "/r/SuicideWatch/comments/qhabse/im_fighting_the_urge_so_hard_not_to_kill_my_self/", "nsfw": false, "first_save": 1635425317.151203, "replies_charged": false}