{"id": "t5_2qpzs_t3_kyb1wd", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "Ummm, I don’t really know what to write. I’ll try and explain but I’m not great with words.\n\nI’m not sure if I’m posting this to the right subreddit but it seemed a good place to start.\n\nI (18f) just don’t know where things went wrong. I feel heavy all the time and just on the verge of tears. About a year ago I had a long depressive episode. It got to the point that I was cutting my thighs (not terrible physically but horrible mentally) and got so bad I was sitting at home alone with an open bottle of pills in front of me. I managed to put them away and a couple of months go by and things start to get better.\n\nWell, just recently I told my parents about all of this and we talked about my past (depression, suicidal behavior, and how at one point I wanted to runaway). Ever since then I’ve felt my depression return and just in the past day or two my mind keeps flashing back to when I would cut and how easy it would be to get my hands on  another razor.\n\nThe thing is: I got super lucky in life. I have two married parents, siblings, and a beautiful niece and nephew. I have straight A’s and am going to college in the fall on scholarship. We have never been poor or destitute. I don’t have the best relationship with my family members but nobody really does.\n\nBut for some reason I’ve always been unhappy.\n\nI guess the thing is my mind keeps going back to how easy it would be to end it all and all the ways I could do it (I never would though so my situation isn’t dire).\n\nI don’t know.\n\nI’m just so confused.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kyb1wd/i_feel_broken/", "title": "I feel broken", "social_network": "reddit", "user": "nickname_twist", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1610768034, "permalink": "/r/SuicideWatch/comments/kyb1wd/i_feel_broken/", "nsfw": false, "first_save": 1635425246.2602313, "replies_charged": false}