{"id": "t5_2qpzs_t3_nmsqyi", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I’d been clean from self harm for over a year before I started again in the last few months, and I’d been ideating for a while before I started harming again. When I was in my last year of high school I bungled a (if I do say so myself, really well thought out) suicide plan by having a panic attack and giving in to the burning need to know what would *actually* happen if I told my father. He took me to the hospital and they kept me for a few hours and then spat me out at 2am to go home and come back to their shitty homophobic outpatient program where they didn’t even listen to me and wouldn’t put me on the dose of meds my GP had asked. They didn’t take me seriously because I’m a guy and that clearly means that if I had *real* mental health issues my suicide attempt would have been successful, and the fact that I’ve permanently scarred my arms and my legs with the extent of my multiple-times-daily harming meant nothing to them. \n\nNow I’m an adult and I just feel there’s no point. I finally got diagnosed with bipolar (2) and PTSD because I’m a plain but spicy bitch like that. I narrowly escaped an involuntary hospitalisation year before last, and I’m wishing that my new psych would just... maybe step in and do the same. I feel like where I live a voluntary hospitalisation doesn’t mean anything, they’ll just send me home again, they did the same when my sister presented last year, just gave her some Valium and sent her home when she was ready. \n\nI don’t know. I don’t want to make a successful attempt just yet (not because I want to live but because I’m still responsible to my partner and pets) but I’ve always been fixated on this idea of ‘proof’, that my self harming is me proving to myself that it’s real, and I feel that since I fucked it up last time and it didn’t really count I just need to prove to myself that this *is* serious, that I’m *not* just being a drama queen, and that I really am feeling what I’m feeling. My partner is always so upset when I confess I’ve cut again to him, and I haven’t told him tonight yet that I did it again, and properly this time. \n\nI don’t know. I just... wish I could end up in hospital for a day or two, just to give my brain time to finally accept that I really am mentally ill and suicidal, and that I’m not just making mountains out of molehills.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nmsqyi/i_want_to_be_able_to_trust_myself/", "title": "I want to be able to trust myself", "social_network": "reddit", "user": "blackrussianterrier2", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1622188731, "permalink": "/r/SuicideWatch/comments/nmsqyi/i_want_to_be_able_to_trust_myself/", "nsfw": false, "first_save": 1635428109.2985814, "replies_charged": false}