{"id": "t5_2qpzs_t3_nqbg7r", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d"], "text": "Never really lived life at all and coming up on 30 in a few weeks. Pretty sure I have a cocktail of mental illnesses but never got formally diagnosed. \n\nDue to my severe social anxiety I never made any friends, literally none in 30 years. never had any relationships, virgin of course. Pretty much stayed holed up in my room for the entirety of my life up till now. Can't drive still, but then again don't need to since I never leave my room. On the very few occasions i need to run errands my elderly parents would have to drive me around, i am a fucking embarrassment but i'm too depressed to try to improve. I don't even help out around the house even though i really want to but depression is a bitch.\n\n My only purpose left in life is to at least repay my parents financially for all their support for a fuck up like me but i couldn't even manage that. Not sure how i managed it but i lost over 100k in the stock market last year where anyone with half a brain would of made money. That's like 4 years of my meager salary. Went into debt for about 40k and parents had to bail me out by withdrawing from their retirement account and now they would have to work a few extra years to make up for it. \n\nI really am grasping at straws at this point, i really dont have anything left to live for. I have accomplished absolutely nothing in my 30 years and is a complete burden on my parents. I really hope I can stay strong until they pass but it's getting harder and harder each day.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nqbg7r/complete_and_utter_failure_at_30_what_is_even/", "title": "Complete and utter failure at 30, what is even left at this point", "social_network": "reddit", "user": "Glittering_Dark_1200", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1622601878, "permalink": "/r/SuicideWatch/comments/nqbg7r/complete_and_utter_failure_at_30_what_is_even/", "nsfw": false, "first_save": 1635426974.943066, "replies_charged": false}