{"id": "t5_2qpzs_t3_l52of5", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "i’m a 20 year old gay man living in the Middle East, and shit has never been harder for me. In a few weeks, i’m planning on running away to the US to be with the man I love, let’s call him Jonathan. He’s been unquestionably devoted to me since day 1, and anyone that’s been in a long distance relationship knows it’s difficult. He’s opened up his heart and his home to me when I needed it the most. \n\nI still live with my parents, and they never listen to me when I tell them that i’m not safe here (they’re super homophobic, so I can’t tell them why). They’ve also been very abusive in the past, with my mom stabbing me at one point then threatening to kill me after she went through my phone and found out I was dating a guy when I was 16. My dad isn’t much better, having threatened to beat me up and kill my cat when I told him I wanted to take her to the vet a few months ago (because she broke her leg). \n\nAt the same time, I can’t help but feel an obligation to them. My parents are hopelessly in debt, and the pandemic hasn’t made shit any easier on them. My mom keeps telling me that going through with this move might give my dad a heart attack or even kill him, and even if that doesn’t happen, i’ll be destroying him emotionally, because he needs me rn, but I can’t bear to live here much longer. \n\nI can’t sleep at night anymore. The choice to go would mean me living with my boyfriend, but I also have to seek asylum for being gay, and the legal path isn’t an easy one. I almost jumped off the balcony last night because the choice between two shitty realities is impossible. \n\nLiving here means conforming to my parents’ rules, acting straight for many years to come, risking arrest (the govt. here is cracking down on gay people) and destroying my relationship with Jonathan, the only thing keeping me afloat. If I go, I get to be free, but I also risk my dad’s health, my future, and my security, as the road to asylum is long and grueling. I just want to be done with all of this. What do I do?", "url": "https://www.reddit.com/r/SuicideWatch/comments/l52of5/i_have_an_impossible_choice_to_make_either_i/", "title": "I have an impossible choice to make. Either I destroy my abusive parents and risk my future by running away or risk my safety and sanity if I stay", "social_network": "reddit", "user": "sn00pchipmunk", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1611623755, "permalink": "/r/SuicideWatch/comments/l52of5/i_have_an_impossible_choice_to_make_either_i/", "nsfw": false, "first_save": 1635427925.4953232, "replies_charged": false}