{"id": "t5_2qpzs_t3_q6q8x9", "request": ["0c6360e0-5fd0-41bf-97f4-d870570d8b8d", "4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "Tried in 3rd grade. Tried again in 6th. Planned for after I graduated highschool but I had met my soulmate. He made it better. Then he hurt me. He hurt my cats. The ones we got as kittens to love and raise together. Left him. Came back. He said he understood everything and we could work to make this better. It's been a month now. I get break down screamed at weekly for hours. It's my fault. This is a betrayal. I ruined him. I ruined everything. We had nothing but trust and I ruined it. He's deciding if we stay together or not. The work I've put in now is insignificant to the years I ruined and stole from him. 10 years together and only 2-4 were good, depending on his mood. I stole his prime. Years of his life wasted. My fault. Can't move forward, don't see how. I don't want to leave again but I don't want to go home. I want to not exist, no so much die but to just stop being here.\n\nPros:\n- His sisters don't have to worry about pretending to be nice to me anymore and can support their brother fully, yes they know he hurt me but apparently know women with broken arms who \"didn't even pull this shit\".\n- he can move on with absolute certainty that there's no going back and I can't pop up again\n- he can hangout with his sisters without feeling guilty that I'm there or at home, ruining everything\n- my parents don't have to work on liking him again and can let go of the relationship entirely\n- I won't be tired\n- he doesn't have to worry about doing the wrong thing (though I feel this is a lie since the weekly break downs I take and haven't run away again\n- he can feel comfortable again, he hasn't felt comfortable with me since I came home \n- my heart won't hurt anymore\n- I'd finally actually finish something I had set out to do, for once in my life\n- the things I can't fix just go away, no one has to worry about them being resolved\n- his new girl when he gets one can be the only girl I won't exist\n\nCons:\n- my cats get left behind\n- it's me running away again, I think", "url": "https://www.reddit.com/r/SuicideWatch/comments/q6q8x9/im_just_tired/", "title": "I'm just tired", "social_network": "reddit", "user": "MarieOMaryln", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1634056797, "permalink": "/r/SuicideWatch/comments/q6q8x9/im_just_tired/", "nsfw": true, "first_save": 1635426259.4805913, "replies_charged": false}