{"id": "t5_2qpzs_t3_qhcpmb", "request": ["0c6360e0-5fd0-41bf-97f4-d870570d8b8d"], "text": "My life has gone to shit. I used to have fun and be happy. I used to have savings and not worry about money as much. \n\nI now sit in my classes and I have a notebook where I write a detailed suicide plan several times a week. It’s very solid. I’m a senior in college and I don’t know what I’m doing with myself. I’m taking 20 credits for my engineering degree, working my absolute butt off, I have several jobs, and I have nothing to look forward to. I’m constantly worried about my finances and I have no plans for when I graduate. \n\nLife keeps on throwing the worst fucking curveballs at me too. It’s repetitive. As soon as things get slightly better something else happens and I’m either financially ruined, or I have to fix a big mistake that takes a bunch of time, or I’m an emotional mess. If it wasn’t for my boyfriend helping me out with everything that happens I would honestly be so fucked I wouldn’t finish school. My scholarship runs out next May so I have to get my degree by then or else I wasted four years. \n\nI don’t know what to do. I have no time to do things that make me happy anymore and it really breaks my heart. I’m looking at selling my ski gear to make rent. Skiing is like the only thing that makes me happy and keeps me sane. I owe people money for bailing me out when I had absolutely nothing. My life is just not enjoyable anymore and I’m sick and tired of being kicked in the ass when I’m already on the ground. \n\nI have a bit of stuff to do before I go through with it and I’m planning on starting that after work on Friday. Honestly, I just don’t think I’ll make it to the end of the semester. Things are getting worse and worse. Those little things that used to make life bearable are rapidly disappearing for me. \n\nMy only hesitation is making my mom sad. My boyfriend doesn’t see a long term future with me so he’ll be fine. Fuck man I hate it here.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qhcpmb/im_tired_of_planning_out_my_suicide_i_wish_i/", "title": "I’m tired of planning out my suicide. I wish I would just do it already.", "social_network": "reddit", "user": "throwaway140736", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635387763, "permalink": "/r/SuicideWatch/comments/qhcpmb/im_tired_of_planning_out_my_suicide_i_wish_i/", "nsfw": false, "first_save": 1635426385.3167198, "replies_charged": false}