{"id": "t5_2qpzs_t3_avmv4o", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "I've been depressed for pretty much as long as I can remember. I understood, even as a child, that most of my depressed and suicidal thoughts we're irrational in nature. So I made a pact with myself: I'm going to die eventually anyway and no one knows what takes place after death so there is no point in rushing it; I might as well see what I'm going to before I die.\n\nI've never taken any medication or therapy. Most people are unaware that I'm depressed, and the few times I've even tried to bring it up I'm either offered platitudes or met with \"What do you even have to be depressed about?\" More than anything my depression makes me just not want to talk about what's bothering me, and I haven't met many people with the patience to actually hear me out without injecting their own perspective into the topic. I spend gratuitous amounts of time trying to see and understand things from other people's perspectives and it has always irked me that I have at best met two people who have ever genuinely tried to do the same for me.\n\nLately I'm being plagued with rational thoughts of suicide. It's like I've beaten back every irrational possibility and all that's left in the tank is actual hard hitting reasoning. It feels like I'm constipated with the desire to kill myself. It'll hurt at first, and I know it. If try to force it and/or struggle through it then it will hurt that much more. But if I relax into it and approach it properly there will be the initial pain but eventually it'll get better and I'll fade away.\n\nI plan on seeking professional help but I'm not confident it will help. I don't like society. I'm bothered by humanity. I don't fit in well with people yet I crave human interaction endlessly. On a very superficial level I get along with people famously but I'm incapable of maintaining deep friendships. It seems like always I either fall out of touch, or discover some fundamental philosophy I just can't tolerate and need to break ties with the other person. I have hoped that emigrating to a different country would alleviate this, but the route to do so seems like it requires a certain amount of effort and dedication I cannot find within myself at this point.\n\nEither I have been woefully unlucky thus far in life or this is just how things will always be. And it's really hard not to believe the latter.\n\nI turn 29 in less than a month and I really feel like I've tried hard enough for long enough by this point.", "url": "https://www.reddit.com/r/SuicideWatch/comments/avmv4o/im_the_closest_ive_ever_been_to_committing_suicide/", "title": "I'm the closest I've ever been to committing suicide.", "social_network": "reddit", "user": "idunnowhatosay", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 64, "down_vote": 0, "creation": 1551328160, "permalink": "/r/SuicideWatch/comments/avmv4o/im_the_closest_ive_ever_been_to_committing_suicide/", "nsfw": false, "first_save": 1635427761.1080658, "replies_charged": false}