{"id": "t5_2qpzs_t3_pkekg5", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Where to begin...\n\nI suppose, at the beginning, right? I'm a 37yo white male. Came from a lower middle class family. Grew up in a nice neighborhood a block away from a golf course. It was an ok childhood. I had my own struggles, but that's not what brings me to where I am. And where I am, is out of hope, and out of options.\n\nThe last 7yrs of my life have been a nightmare that seem to be spiraling to the Abyss, because I sure as fuck don't see an end/bottom. I have multiple conditions that are invisible to anyone observing me, and the fact that they can't be seen has made it so no one believes. Some days, I'm not even sure I believe it. 7yrs ago I ended up in so much daily pain that all I could was lie in bed and puke my guts out from the pain. I spent months trying to find a solution. Chiropractors, doctors, nothing was relieving my pain. Someone got me one of those tens-patches that's supposed to help relieve pain. I put it on, turned on the power, and collapsed to the floor screaming in even worse pain than I'd been in. My body had felt like it was on fire. After a year of no change, my doctor told me that I have fibromyalgia. He included that I also have chronic/borderline pancreatitis, myofascial muscle issues, and Carpal Tunnel Syndrome in both hands/wrists.\n\nI took these diagnoses in stride, and figured that what I needed to do was get on disability. On top of those conditions, I've got a multitude of other problems that I've dealt with since I was 10yo. Most of them are orthopedic and lead to me having horrible joints, and a spine in poor condition. For 6yrs, I fought for disability. Trying with 2 different lawyers who both built me up to feel like the case was going well, only to have the judge rule against us, and the lawyers to throw their hands up and say that it was my fault for not having enough documentation, and add to that, the last judge included comments in his decision saying that he didn't believe a word of my testimony, and that my doctors were just lying along with me.\n\nTwo things have led to this outcome:\n\n1. I have been told since I was 10yo that pain is normal and I was just going to have learn to live with it. So, I did. At first it was people telling me it was just growing pains. Then it was just supposed to be part of the ache that \"everyone feels\" while existing. Then it moved to being arthritis & getting older. Since I'm so used to pain, I am not sure how to properly describe it, or have any kind of scale to weigh it against. When asked, \"is your pain a 5 or a 10\" type of question, my first thought is always \"I don't know\" because, a 10 for me is me lying in my own vomit unable to even do anything other than cry about the pain, but for others it's different. I get that I'm supposed to say what a 10 is for me, and my personal feeling, but I don't know what not being in pain even feels like. That makes it tough to tell others how much pain I'm in. Did I piss myself & pass out from trying to stand up and having pain shoot from hands, up my arms, and into my face? No. Did it hurt enough I almost collapsed back in my seat just to not have that pain anymore & teared up? Absolutely. Does that rate a 3, a 5, an 8.5?  I don't know, and I don't know how to convey that pain accurately to a doctor.\n\n2. Opioid medications, for the most part, do nothing to alleviate my pain. As my family has a complicated history with addictions & opioids, I've always tried to avoid them, but they're being largely ineffective has helped too. The only thing that I have found that helps at all is THC/CBD.\n\nThese two factors have combined into the perfect storm for disability denials. There aren't a ton of visits to doctors, cuz I'm just supposed to live with the pain, and any time I get offered opioids, I turn them down. Judges see that combination, and are convinced I must just be lying to the system to get out of working/being productive.\n\nI do actually enjoy working, and I have been trying to find something to do for work, but with my limitations, it isn't easy. I do some delivery driving when I can, but it doesn't make me enough money to pay my bills. It's all I can do, and I am still not able to support myself, and I am dragging others down this financial hole with me just trying to survive.\n\nI guess this is the part where I get to why I posted in this sub: I am going to kill myself. I don't know how else to stop the financial drain I am being on others. It affects their, and my happiness. I don't want to be a burden for the next 30yrs, waiting for old age to end what should've been over at the start of that 30yrs. I can't watch my parents, and siblings struggle to make their ends meet, while I contribute what is constantly not enough to make my ends meet. I don't want them to be upset about me being gone, but I know they will be. I just think that not having to struggle all the time will help them to live better lives. I am trying to plan a proper time, because I don't want my death to hang heavy on them during other events, such as holidays/birthdays. \n\nI am not looking for input, or well wishes. I am losing my will to fight. My reserves have been empty so long that I don't even know how I've made it to where I am. Even if I do continue to fight, what am I fighting for?  To work hard, and ever increase my pain until that kills me?  I just can't see an end to the way things are, and I'm running out of will to try and change them. Chronic illnesses, and the unending financial burden I continue to be are an assault on me every day, and I cannot change/stop them. I will be in ever-mounting pain for the rest of my life. I will be unable to find stable work that will pay me enough to support myself. I cannot keep living this way, when all that needs to happen to find the end is for me to stop breathing.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pkekg5/i_feel_so_lost_hopeless/", "title": "I feel so lost & hopeless", "social_network": "reddit", "user": "EWachh84", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1631120538, "permalink": "/r/SuicideWatch/comments/pkekg5/i_feel_so_lost_hopeless/", "nsfw": false, "first_save": 1635422307.671058, "replies_charged": false}