{"id": "t5_2qpzs_t3_qdk29v", "request": ["5f7c2841-3f43-4682-8126-88825da57933"], "text": "I have been struggling with suicide for years upon years and been fighting so hard emotionally, mentally, and physically to carry on. I just can't do it any longer. I already have a plan for it. I am not going to do it now, but I have a timeframe that I wish to do it. My whole life has been a war with myself and the people surrounding me. The only thing that really keeps me from doing it right now is my daughter. She is all I have. However, I know when I pass, she will have my husband, his family, and my family who loves her dearly that can easily replace me.   \nMy husband and I have not been on good terms due to me having depression, PTSD, and anxiety and him not liking it and not being supportive even though I told him in the beginning that I have these issues and I am struggling. When I told him these things, he said he would do his best to support me and my recovery, but that has been opposite. My heart is so broken because he told me that he promises that he thinks we will not work out and that he doesn't know if he loves me anymore. He said we can just live together for our daughter without having to actually love each other, but children can detect when things are wrong and it can damage them in the long run. I think it would be better for my child to not have to see two bitter people towards each other and just have one parent. I feel as though that would be the best route. I had two bitter parents and it ruined me completely. I think it would also be better to do it while she is young, so she doesn't remember me and wouldn't feel as awful as it would be for someone to actually know the person who does it.   \nI have been abused, hurt, abandoned and destroyed throughout my whole entire life. I wasn't protected and never will be protected. The people who were supposed to be there to protect me, didn't protect me and I was put in adult situations as a small child until I was a teenager by the same person who was supposed to be someone who helped me with advice and was supposed to be wise. They hurt me so much. I have nightmares. I am easily startled. I have survivors guilt. I am just always guilty all around, even things that I never ever did and never said. I have been losing my memory and forgetting faces. I forget my own age all the time and have to ask what it is. I think my brain is telling me that it is really time to give up.   \nAll of this hasn't been a recent thing with me. I have been in therapy, psychiatry, and treatment centers with no success. My family gave up on me a long time ago and now my husband has given up on me. I cannot deal with this pain and sadness anymore. I just can't. My daughter deserves better than me. She is so amazing, beautiful, intelligent, and going to do amazing things someday. She should not have someone like me interfere with her progress in life.   \nWhen I seeked help in the country I am currently in, I was encouraged to not take medication and that I should pray along with being happy isn't hard. I told them I even took medication and they told me strictly not to as breastfeeding comes first before my mental health.   \nI am so alone. I am so alone. My heart cannot take it anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qdk29v/i_already_typed_out_my_suicide_letter/", "title": "I already typed out my suicide letter.", "social_network": "reddit", "user": "Ok_Chocolateeeeee", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 44, "down_vote": 0, "creation": 1634918559, "permalink": "/r/SuicideWatch/comments/qdk29v/i_already_typed_out_my_suicide_letter/", "nsfw": false, "first_save": 1635421091.7647104, "replies_charged": false}