{"id": "t5_2qpzs_t3_4llavs", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "There have been many times throughout my life in which I’ve wanted to kill myself. I’ve exhibited suicidal behavior since I was as young as seven (I believe I actually did attempt at this age). Since then, I’ve never gone through with it because I’ve always been too afraid of the pain/uncertainty of what happens after death as well as putting my Mom through all that pain. But at this point, I think I’m reaching the end of my rope and these two barriers are slowly withering away. I am not sure if anyone will read this full thing because it might end up being very long, but all I know is I just want either a different life or for my life to be over. So here’s my story – some details I will leave out just in case anyone that knows me comes across this as I do not want anyone close to me to know what is going on.\n\n\nI’m in my very early 30s, and recently graduated from college with a business degree. After receiving the news during my final semester that the company I interned with did not have a job opening for me, I started applying and at the last minute, I got a job in my field shortly after my graduation, but it didn’t work out. I had a horrible, somewhat crazy boss and I moved several hours away to take the job. I didn’t know anyone and was miserable. After an incident at work involving my boss, I decided that I’m a complete waste of space and I ended up moving back to my hometown and back in with my Mom. At first I felt good about this because I was away from my boss – the cause of all my anxiety when I was living in that area. But now, I’m ten times worse. Basically, now I am in my early thirties, living at home working retail. I’m currently in the process of getting a second job and then moving out but this still isn’t stopping my depression from wreaking havoc on my everyday life.\n\n\nEvery day I even question my ability to do well at this retail job (I’m already a failure in my field). Three of my closest friends have recently moved away, and I have to sit back and watch everyone else around me cruise through their life so easily. I absolutely hate myself. I am a miserable piece of shit that should have not even been born. I am embarrassed to show my face at family gatherings and friend gatherings anymore. In fact, I do my best to avoid them because they bring me such discomfort knowing how much of a failure I am and how I don’t deserve any of what I have. The thing is, others on this sub have it way worse off than I do – so I really don’t even have the right to feel this way at all. This makes me even more of a piece of shit that deserves every ounce of self-hate and every ounce of misery that I feel.\n\n\nNow, I realize that I got the wrong degree. I should not have been a business major. I’m not smart enough for anything in my field and now I get to work on the $35,000 student loan that got me through the last two years of this degree. I’m a miserable, idiotic waste of a human life and I really should just kill myself because I don’t deserve anything. I haven’t wanted to be around anyone lately. I haven’t wanted to hang out with my friends because I constantly feel so depressed and miserable, and I don’t feel comfortable talking to anyone close to me about anything. I only feel comfortable talking to strangers about this kind of thing.\n\nI desperately want the courage to kill myself. I’ve thought about just trying to OD on whatever strong medication I can find around the house – maybe mix it all together with some alcohol. The other day I started at a full bottle of Tylenol Extra Strength, just wishing that I had the courage to down the entire bottle with a bottle of wine or whatever I could find. I’ve also thought about looking into how to get a gun in my state, and then just driving as far as possible before just blowing my brains out in the middle of nowhere. I just want this life to be over. I don’t want to burden my Mom anymore – I don’t want to embarrass my family anymore. I don’t want to be around friends anymore because they deserve so much better than me. I really wish I could have a friend that I do trust to talk to about all this but that’s pointless because I’m a piece of worthless shit and I don’t deserve it. Plus, they’d just end up not talking to me or leaving anyway.\n\n\nAll I do is compare myself to everyone else. I haven’t done shit with my life. I have no motivation anymore to do anything. I am unintelligent, untalented, have no marketable skills, and am overall just a burden on my friends, family, and society. I just need something to get me over this fear of killing myself. I truly hope that sometime in 2016, the fear goes away and I can finally make things right by ending my pathetic existence.\n\n\nI was in counseling for a couple of years but I don't have insurance anymore and it didn't really help too much. I think at this point, I am just not fixable.", "url": "https://www.reddit.com/r/SuicideWatch/comments/4llavs/i_hate_myself_i_want_to_die_but_i_dont_even/", "title": "I hate myself, I want to die, but I don't even deserve to feel this way.", "social_network": "reddit", "user": "throwthisaway091", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1464542611, "permalink": "/r/SuicideWatch/comments/4llavs/i_hate_myself_i_want_to_die_but_i_dont_even/", "nsfw": false, "first_save": 1635425264.7861977, "replies_charged": false}