{"id": "t5_2qpzs_t3_osudew", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111", "514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "Hopefully my behaviour can help find out why. I tend to be very apathetic, apart from when I'm stuck into researching my favourite subject which is nutrition and have become very impatient with my former favourite hobby I engaged in to relieve boredom, which are video games. I have some suicidal ideation, because nutrition can only provide so much information and find it extremely difficult to start new hobbies like learning an instrument. I have so far failed to mention my autism, which I inherited from my purely parental lineage and had diagnosed from a professional and autism has been linked with depression, although I do doubt my diagnosis to a small degree. My heart rate is in the 90s which is a possible indicator that something is wrong with me since higher heart rates are linked with depression, shorter life spans and a greater chance of CVD, although I am exercising and eating some legumes to lower it as much as possible. I am taking lamogtrigine which is supposed to stabilize my mood, as my consultant thinks that I may have Bipolar and I am growing some broccoli sprouts to treat my autism as it is the only shown treatment of autism there is, if I even have it in the first place.\n\n(I am whole food starch based, but I understand if you do not want to leave animal products behind, as my oldest sister still likes them.)\n\nMy main issue with making friends is anticipatory anxiety, possibly induced by church up until we stopped attending, much to the dismay of the pastors at 14 and maybe attending school at 14 after a history of only homeschooling. I'm completely fine in the presence of others, like at school and can tolerate them fairly well outside of regular social meetings, but the main reward is walking out of the regular meetings for sure, knowing I have some time before I encounter them again. Quickly going back to nutrition, I think I might be deficient in both calcium and magnesium, which seem to have a role in mood, alongside the obvious ones being bones and muscles and I am also taking ashwaganda. My grandfather on my fathers side, the autistic and very quiet one who only every talked to my mother once in his entire life, thankfully it being the pleasant topic of his civil engineering career. (He shook hands with the queen for an important construction project once, despite being very middle class.) I also have problems falling asleep at regular times, but no issue getting it consistently. I must further mention that I've had severe seperation anxiety based on my mother, to the point where I very rarely could be left with strangers and could not even be held by my own father, who has suffered from general anxiety for as long as he can remember.\n\nI grew up in a Christian community and also a completely secular sailing club, which gave me the feeling of being Jekyll and Hyde before having known about the book. But both feelings where equally enjoyable. Although I was in a Christian environment much more. This was balanced out by three and a half years of schooling I suppose, although one of my friends at church who I don't see anymore thought religion was stupid and my mother and I think he could have been autistic. I keep in sparse contact with one friend from my Christian-hood and none of the good friends I made in public school.\n\nAnd yet, after all of my research into nutrition and other lifestyle changes, such as aerobic fitness, what could be the cause of my low mood? Any supplements you guys would recommend, as I'm also taking boron which is a unessential mineral that boosts testosterone a fair amount among other things.\n\nThanks for reading this long post.", "url": "https://www.reddit.com/r/SuicideWatch/comments/osudew/what_could_be_causing_my_suicidal_ideation/", "title": "What could be causing my suicidal ideation?", "social_network": "reddit", "user": "FoldsPerfect", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1627417142, "permalink": "/r/SuicideWatch/comments/osudew/what_could_be_causing_my_suicidal_ideation/", "nsfw": false, "first_save": 1635427040.2607324, "replies_charged": false}