{"id": "t5_2qpzs_t3_ohowvz", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d"], "text": "I don't know what to do anymore. All I know that I should be happy. I got some close friends, a girlfriend and a loving mother, yet I feel only hatred for myself and  all I can think about, is what a failure I am. \n\nIf you don't want to read this whole text, you don't have to. I only want to write my toughts down once, in case I won't be able to it by tomorrow next week anymore. \n\nRight now I'm in the Infantry in the Swiss Military. This is what I chose and what I wanted. This is the strarting base for all my future plans. While I was drafted, I dind't mention that I'm serverly depressed for years now. I already had a failed suicide attempt 4 years ago. By not mentioning this at the drafting, I was able to go to the infantry and I planed to stay in it for about 2 years to finance my university degree. With the situation of Covid right now, it's impossible to find work in my field, so this is my only chance of financing my future. Today is the 6th day in the army, and I think I'm a liabillity for my squad, my platoon everything. Twice already my comerades had to do sit ups because of me, but I also don't want to leave, for I don't know another way of earning money right now.\n\nMy depression makes me panic in fear of fking up, everytime I have to do a task. This makes it impossible for me to do even the easiest tasks. All this pressiure and this feeling of dissapionting my squad, makes me cry myself into sleep nearly every night. I always hate myself for not being able to get myself together and always regarded myself as a failure. I also don't want to be that guy, that left his service. I can't do it anymore. Since Switzerlands gunlaws are just to easy, I already own a handgun, and in the last six days, the only thing I tought about is to use it for me, so I wont be the failure that quit his service. The problem is, I live at home, I have three siblings and I don't want them to find me. I also hate the thought of hurting my family, my friends, my girlfriend and all the people close to me. \n\nI really have no idea on what to do. I can't carry on, I don't want to hurt anyone, yet all I want is to end this 6 year long suffering. I already dreamed every day to end it all, but up until now, I always had a reason to carry on. As it's may not clear by with this text, I really wanted to go in the military, but now I realised, that I suck at the one thing that made me go through this until now. I don't know how to carry on, it's just to much. I also don't know if I'll still be around by Monday in a week. All I know is that I want to end it. Since years I expected nothing from my life, and the fear of becoming the failure I already think I am, makes me want to end it even more. \n\nSorry for posting such a long text. I don't expect anyone to go through this all, and I also kinda hope no one does. I don't want to waste your time with all that. Stay strong guys. See you mabey next week, or mabey not. The End.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ohowvz/the_failure/", "title": "The failure", "social_network": "reddit", "user": "WIKMS", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1625944510, "permalink": "/r/SuicideWatch/comments/ohowvz/the_failure/", "nsfw": false, "first_save": 1635426984.2677608, "replies_charged": false}