{"id": "t5_2qpzs_t3_oq8gc6", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "I don’t think I’m actively suicidal in this moment. If i really wanted to die right now i could just go to the river and jump off the bridge, but i guess my true preferred method would be to just shoot myself in the head.\n\nIve watched a lot of videos in the past of people killing theirselves and it mostly looks horribly painful. I cant imagine the weight of my own gravity pulling me down only from the neck; were i to hang myself by jumping, eliminating the chance of pulling myself back up, chances are i would be decapitated if not unraveled from a mediocre try at tying the damn thing. And trains? Fuck that. Jesus.\n\nA gun though. If i could just get my hands on a loaded gun. I dont let myself. I still have to update my address on my drivers license, ive thought about going to a range but that would just be unfortunate for everyone else there.\n\nI live alone. So if i had a gun, even if its “for protection,” at some point i would probably do it. I would text my neighbor “hey, im really sorry, but i need you to call the police for me and tell them to come over. There’s nothing you could have done, im already dead. But thanks for always having been such a wonderful neighbor. Tell them the key is under the doormat.”\n\nI have so many letters in mind to so many people. So many saying the same things. Sorry. Not your fault. Etc.\n\nBut now im going off on a tangent. \n\nI won’t do it because i still have my family. My parents live nearby and my brothers away for college and i know how it would affect them.\n\nBut i guess what i was hoping that someone could answer is which would be more lethal or at least cause unconsciousness quicker: handgun shot through the temple or through the roof of mouth?\n\nLike i said, im not going to do it. I know how it would affect those in my life. I do think about them. But i would just like to know.\n\nSometimes it looks so quick, they drop instantly. But other times, you hear their groans even after. Its haunting.\n\nThanks", "url": "https://www.reddit.com/r/SuicideWatch/comments/oq8gc6/i_figure_this_might_be_the_only_place_to_speak/", "title": "I figure this might be the only place to speak without getting deleted or sent away but we’ll see", "social_network": "reddit", "user": "HeWhoBreedPestilence", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1627065001, "permalink": "/r/SuicideWatch/comments/oq8gc6/i_figure_this_might_be_the_only_place_to_speak/", "nsfw": true, "first_save": 1635427464.9921398, "replies_charged": false}