{"id": "t5_2qpzs_t3_oscint", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d"], "text": "As a child, I always told myself and people that I would be a French teacher. Not a dream job per se, but one supposedly reachable, right?\n\nAt the beginning of high school, I decided to learn Swedish and fell completely in love with the language, the culture, the country as a whole. My goal to be a regular French teacher evolved and now I would absolutely love to become a French teacher in Sweden.\n\nBut it feels doomed to failure and it's seriously eating me up.\n\nWhy? Well, I stutter and have other speech issues. My stutter is not that terrible unless I'm in a stress-inducing situation, there it can get pretty bad. Even worse, I tend to... dissociate (? I don't think this is the right word) after a bad stutter. This is a terrible thing to happen as a teacher, right?\n\nI'm also anxious, have very low self-esteem and my social batteries run low most the time. What if it's too much work for my apathetic ass? What if I'm not good enough? What if students don't like me? What if they make fun of my appearance? Of my stutter?\n\nMy anxiety sadly comes with scopophobia. I was never able, in school, to stand up and go to the blackboard. I was never able to speak in front of other people. At the end of my second high school year, I had to give a presentation with a girl of my class in front of three unknown teachers. I broke down. The girl, and I thank her wholeheartedly for her kindess and attempt at comfort, had to hug me to calm me down (first time I was hugged or even touched ever since I was ten, when my pet bird died, so this hug really meant a lot to me). Being looked at, or just being noticeable, at best makes me uncomfortable, at worst makes me freak out.\n\nHow am I supposed to be working as a teacher in those conditions? Am I fucking delusional to consider getting this job?\n\nActually, I thought about working all alone in nature, something like that. Sadly, my academic profile is literature-oriented so I have a hard time finding a formation open to profiles like mine. Places are limited and usually very far from where I live. Either way, I'm physically not in shape and have a particularly bad spine (the wonderful aftermath of a fractured vertebra that had to heal on its own...), yet most jobs about nature require to be in pretty good shape.\n\nI've seen young adults, usually friends, buy a farm and work together. It would be amazing for me to have this opportunity. But I know no one, I have no training in farm jobs and then again I'm physically in not so great shape.\n\nThis autumn will be my third attempt at completing the first year of Northern studies. I have been trying to complete it ever since 2018 and in 2020-2021 I did nothing of my life. I feel horrible. How am I supposed to get by in life as an adult if I can't even complete a University year in a study field that I adore?\n\nI'm such an inconvenience and a disappointment. I feel so sorry for my parents. My life seems doomed to failure.\n\nMy apologies for the long rant.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oscint/my_life_is_doomed_to_failure/", "title": "My life is doomed to failure.", "social_network": "reddit", "user": "StolenOrgans", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1627347540, "permalink": "/r/SuicideWatch/comments/oscint/my_life_is_doomed_to_failure/", "nsfw": false, "first_save": 1635426978.2918484, "replies_charged": false}