{"id": "t5_2qpzs_t3_gx3s79", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "Please, please, please, whatever you do, do not give me hollow platitudes about \"self-improvement\" or \"seeing a therapist.\" I have tried both several times to no avail. \n\nI haven't made friends since middle school. I lost nearly all of them in middle school because they thought I was gay (at the time I wasn't.) I haven't been able to make any since. It's hard for a myriad of reasons--it's difficult to find people to relate to, with similar interests, and I'm extremely introverted. Of course, now I'm an adult with no social skills whatsoever, so I'm past the point of no return. Don't even get me started on relationships; that's a laugh. \n\nMy religious beliefs (Christianity) state that it's a direct consequence of God giving your mind up to \"vile affections,\" from rejecting Him one too many times, and that you're damned and beyond salvation at that point. I wasn't gay at 13 when I started consuming pornography, but I am now as an adult.  While less devastating than being permanently cut off by God and being a \"dead man walking\"--I should have been put down, but we live in a western society that no longer does that to homosexuals--I know I'll also disappoint my parents and grandparents, and also myself. They didn't raise me to be a homo. They tried to instill morals in me and I was hardheaded and now it's too late.\n\nBabies are the only thing that make me smile, and I can never have my own (nor would I feel like alternative methods would be viable in my situation). \n\nPeople treat me like crap no matter what, no matter how nice I am, in every facet of my life. Online, at work, while I was an undergrad trying to get lunch, at home with my family, it doesn't matter. I show nothing but kindness and consideration to others, wanting to help them out as much as I can--be it taking on more work than I should at work, making breakfast for my sister, financially assisting online friends, and I get treated like garbage in return. It's baffling and makes me think that there's something innately disgusting and unlikable about me. \n\nI'm unattractive. I have a hideous upper lip shadow that no amount of shaving can fix, and I'm too poor for laser or electrolysis. I'm short. I've never so much as been complimented a single time. Hitting the gym, etc. (although I have) doesn't help because it's my face that's inherently screwed, I'm never going to be cute. \n\nI intend to pursue a post-college education, but I only remember \"broad strokes\" and feel like I'm undeserving and only there because of my minority status. \n\nI have been to at least four different therapists and at least four different psychiatrists over the years and not one was able to do anything to help me, although I'm recipient and desperate for help. This has helped to crystallize my earnest belief that I'm beyond help. I just need to be put down. \n\nAll of these issues combined with my innate and constant unhappiness--some more than others--make me want to kill myself. I feel like I don't have any other viable options. I'm alive only by inertia and cowardice but life is becoming more and more unbearable. I'm trapped with no other alternative.", "url": "https://www.reddit.com/r/SuicideWatch/comments/gx3s79/irreversibly_screwed_up_my_life_its_never_going/", "title": "Irreversibly screwed up my life. It's never going to get better; I feel like I have no other options.", "social_network": "reddit", "user": "worriedvirginn", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1591360721, "permalink": "/r/SuicideWatch/comments/gx3s79/irreversibly_screwed_up_my_life_its_never_going/", "nsfw": false, "first_save": 1635426225.2795658, "replies_charged": false}