{"id": "t5_2qpzs_t3_ijsist", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "I'm tired from my past attempts of suicide. but years later I still want to end it all, I just have no energy to make an effort again. But the call of falling into blackness to silence all of my stress and emotions is so tempting. I just want a silence to all of this noise from my feelings and worries and self hate.\n\nI'm so tired of constantly teetering between self improvement and just trying to impress/satisfy others when it feels like whiplash going between the two, I'm tired of having no access to therapy or any professional help. I'm tired of being a 25 year old trapped by parents who refuse to let me grow up and leave and then feeling so stressed about what friends I make online thinking of my life. I'm tired of being stuck with a dad who says he loves me but treats me like absolute trash in the same breath. I'm sick of being related to him too- when he's just a hateful man who is so stuck in the past and in his judgement. I hate being of his blood.  I'm tired of feeling lonely even with friends who care about me online. I'm tired of wishing I could date but knowing that's impossible because I'm locked away by controlling parents. I'm tired of hating myself but being in love with hating myself. I'm tired of only being able to cry late in the night without fear of being forced to cheer up instead of let it out.\n\nI want freedom but it feels like I have no choice but rot away when attempts to get autonomy and freedom get shot down or stalled out until it's forgotten. I'm so scared that if I do get my ticket out of here, I'll just flounder because I was sheltered so much I never got the chance to ease into adult life and will have to learn everything from the base up right off the bat.\n\nI know people will miss me, but I feel like they'll also forget about me if I just vanish and never came back. That I'm just a blip in their life that won't miss me too much even if they realized I committed suicide. I'm just a failure and a loser who doesn't matter in the end when there's people much better than me out there who aren't locked away. I'm going to be a rotten corpse by the time I'm free anyways- meanwhile the online friends I have have lives anyways that can easily make them forget about me. I don't matter, and I don't think I ever will, and I'm not going to ever be fixed. So I might as well die sooner or later.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ijsist/im_so_tired_and_teetering_between_suicidal_and/", "title": "I'm so tired and teetering between suicidal and self destructive", "social_network": "reddit", "user": "ElegantHope", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1598852947, "permalink": "/r/SuicideWatch/comments/ijsist/im_so_tired_and_teetering_between_suicidal_and/", "nsfw": false, "first_save": 1635422543.197729, "replies_charged": false}