{"id": "t5_2qpzs_t3_hbq0rz", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "I (13F) have had anxiety depression and panic disorder but am only now getting diagnosed. My depression has slowly been getting worse since forever. I am in therapy and it really helps but it does take time and I don't know how much longer I can last. I have suicidal thoughts on a next to constant basis and hardly eat. I can't get out of bed in the morning and have not been in school since Monday because I am too depressed. My mum was crying earlier and I asked what was wrong, she said she was crying because it was hard to watch your daughter self destruct. Even on the occasion that I do want to eat I purposely don't to punish myself. I also have hit myself and pinched myself to the point of bleeding. I always feel like nothing matters. My parents are convinced I have autism. Only thing is my therapist doesn't think I do and no one else does. I obviously have nothing against people with autism but I feel like I am wasting professionals time when someone who actually needs them isn't getting the help that they may need. I am going to a clinic tomorrow to talk about getting tested for autism. Today I had to fill out RCADS form. I hardly sleep I just don't want to be here anymore. I constantly get calls from people and help them and tell them that suicide is not the answer but I have no one to reach out to. And am seriously considering suicide. I can sometimes talk to my aunt and have therapy once a week but for the rest of the time I don't know what to do. I get bullied at school so I guess this is a plus side to lock down. When we go back to school my younger sisters best friend will be there, she is horrible. She has told me to kill myself. Dislocated my knee. Paid someone to try best me up. Said that if I was her sister I would wish that I was dead. Usually I would just shrug it off but when you already want to die it really hurts. Her parents know but they think she is just scared at me because I was \"aggressive towards her\" but all that I ever did was remove a wooden brick she was hitting me with, tell her not to make fun of this little girl (she's like a little sister to me) for flapping her arms when she got excited (she has autism) and put myself between her and a five year old she was trying to sit on. Also I am a black belt in taekwondo but I would never hurt someone unless it was in self defense. I am just hopeless and worthless. I am a disappointment to my parents, I get good grades but I have often had to be sent home because I broke down. My mum is right, I am self restricting, but she is also a complete narcissist and has increased my anxiety and depression levels a lot over the years. I need advice on what to do.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hbq0rz/my_mum_says_i_am_self_destructing_and_i_agree/", "title": "My mum says I am self destructing and I agree, please help", "social_network": "reddit", "user": "Thankunext4", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1592524825, "permalink": "/r/SuicideWatch/comments/hbq0rz/my_mum_says_i_am_self_destructing_and_i_agree/", "nsfw": false, "first_save": 1635422552.7118945, "replies_charged": false}