{"id": "t5_2qpzs_t3_nkb2db", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "Hi! First of all, everything I say is real and serious.  I'm not joking arround I really need some help. I'm living in Germany so please don't be surprised if my english isn't that impressive.\n\nMy name is \"Lucas\" (not really but I won't say my real name because somebody I know could read this)\n\nI am 15 years old, about 6,2 feet tall and actually feel I look pretty normal. My hobbies are watching anime, playing nintendo exclusive games and cycling sometimes. \n\nI was never the guy who made friends at school and then visited them at their home. I sure wasn't lonely at school but I never met my school friends when school was over. When coming home I always played with my \"real\" friends who we're my neighbours. I was always a dumbass and fought with people at school. I did that at 3 schools and thought I was cool. Some of the people I beat up we're assholes but most of the time I was the one who was wrong. Almost everyone at school knew me as an asshole but I didn't really care. Then at my third school I didn't have friends and got bullied by people that we're way stronger than me. They filmed me getting beaten up and stuff and everyone knew. I also had some very very cringy attempts to meet girls that we're older than me. Meanwhile the people I always played with at home got older and did an education or just found new people. This was the point of time where I realised that I fucked up superhard. I realised that I was a bad guy and changed my bad personality. I now know how to deal with conflicts, how to don't have conflicts, how to be nice to people and how to not stand out from the rest of people. But it was too late. Now I stay here having no one. I hate going to school because it is so emberassing to me. I hate that people see me. In breaks I usually go to toilets wait until the bell rings. Because I was so stupid and did that stuff at 3 schools, I can't even go to the mall because I would see so many people I had bad experiences with. I just hate my past self sooo much. If there was just a reset button....\n\nMy parents never we're that strict but that doesn't mean they we're good parents. They breed me very bad. My father wasn't going to school on his last years and is a stoner. My mother is very very very religious since my grandma died and she is a big conspiracy believer. She often tried to manipulate me and it worked sometimes but now I have reached the point we're I know what is good and what is bad.\n\nMy grades got really better (they we're bad) but I am still very stressed of school and scared of the future because I could get a bad job and work my entire life for shit.\n\nI met some really really nice people in a community of a game. I played with them everyday and we always talked, laughed and had fun together. Recently I got a bit inactive though and they all met for holidays. I always said that I would love to met them in real life but now they all met up without me knowing it. They called me and said that they had a surprise. They're surprise was that they opened the camera and I could see them all chilling together, watching shows and playing games. This made me even more sad because I really loved them.\n\nI want to met people who are like me. I want to met good friends who share the same hobbies, are funny and caring. I want to have people that love me but I just don't see any option. I am scared of trying to talk to someone in my city not only because I got a bit socialy awkward but also because they could always have a connection to people that hate me. It is so hard to make people in a community get your attention because I am always awkward to new people. But if they would really know me for a long time they would see that I can be a nice and funny guy. It is just so hard. \n\nI searched for non painful ways to kill myself but everything had the danger of getting disabled / retarted or just having pain in general. If there would be a way to just click a button and die in 0,00001 seconds without pain I would have done it already. \n\nPlease help me!", "url": "https://www.reddit.com/r/SuicideWatch/comments/nkb2db/im_15_and_fucked_up_really_hard_please_help_me/", "title": "I'm 15 and fucked up really hard. Please help me.", "social_network": "reddit", "user": "Rolo-Louch", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 46, "down_vote": 0, "creation": 1621897797, "permalink": "/r/SuicideWatch/comments/nkb2db/im_15_and_fucked_up_really_hard_please_help_me/", "nsfw": false, "first_save": 1635427110.9785767, "replies_charged": false}