{"id": "t5_2qpzs_t3_7v1p8n", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "Huge wall of text, I apologize. Even if a single person reads it, I guess I just want someone to *understand* the why. \n\nI turned 30 last month. Which means I've officially struggled with depression (and other things) for half my life. Always waiting for it to get better. Always taking one step forward, and two steps back.\n\nWithout going into too many details and bore people even more, I struggled with anorexia for a decade. It got worse when I got to university away from my family, which allowed me more \"freedom\" in abusing my own body. On bad days, I'd spend upwards of 8 hours in the gym, and purged anything I ate.\n\n I got help. It looked like maybe things were going to look up. Then I was sexually assaulted. It's been 9 years, and I still will never be able to fully explain my feelings. It felt like my life ended, and an impostor's been living my life (very unsuccessfully) since then. Moments of happiness were rare. \n\nThrough it all (both the ED and my assault), my parents - as they always did and still do - dealt by not dealing with it, really. Jokes at the dinner table about my ED were the norm. My rape was just not talked about. Which of course also had the effect that I felt - and still feel - that they think it's my fault. Guess I'll never know for sure now. \n\nI suffered from PTSD, my method of coping was by attempting to drink myself to a slow death. My ED came back in full force. On the first anniversary of my assault, I attempted to commit suicide. I failed, obviously. My mother told my father about it by saying \"oh we had a little pill situation here\". I was knocked out cold for over 24 hours in my room. She never checked on me, because she figured I was \"sulking\".\n\nAnyway, let's fast-forward. I re-enrolled in uni after a year off for \"recovery\" because I was told working in a bookshop is pointless, and I need a diploma - without it I'm worthless. This is something I've been hearing since my teens, and it still rings true today.\n\nThe problem is, continuing my studies in the field I started in, I will forever associate it with my sexual assault since it happened while I was at uni. I hate it. All of it. And it didn't help that during the first year I was re-enrolled I was in a very toxic, abusive relationship, at the end of which I was barely 40 kgs (I just stopped eating. Stress, fear, unhappiness). My parents cried when they saw me, sent me back to the psychologist, problem fixed.\n\nI quietly set about to continue my studies. But over recent years, my brain feels like it has turned to mush. I can't learn new things, I can't concentrate; can't sit down with a book and read. Not just study material, anything. I was an avid reader, when I was younger I was signed into multiple libraries so I could borrow even more books, and I'd read through one/night. \n\nEverything that interested me, all of my hobbies slowly wasted away. And with my anxiety getting worse over the past years too, even attending seminars felt like an uphill battle. \n\nSpring of last year, I decided to commit suicide. I had some issues with timing, as my sister-in-law was due to deliver in the summer, and I was worried that if I do it too early I might put her or the baby at risk. So I decided I'd visit my family (they live in another country) one last time, meet my baby niece, then when I come home I can do it.\n\nI spent months preparing, trying to find ways to cause the least inconvenience possible (for my family, for anyone who might find me etc), and the least amount of paperwork.\nI was in the middle of sorting through my stuff (for donations), when my parents told me they're selling the family flat (that I was living in at the time), and instead they want to rent a flat for me that's pet friendly. \n\nI had been begging for a cat for several years, as I felt myself spiral more and more out of control. It's difficult to explain, but having a little life depend on me I felt would make me obligated to be around. \n\nAnyway, found a flat, signed the lease, and before I even unpacked my boxes or had all my furniture I already adopted an 8-week old rescue kitten. He was found in a ditch when he was 6 weeks old, without his mother. I related to him very strongly, and I can't find any better terms to explain it but \"love at first sight\" when I went to pick him up and his rescuer put him in my hands. \n\nAnd for the first time in a long time, I felt hopeful. After years of struggling with sleep, I had a little furball ready to pounce at 3AM, and demand attention. You'd think this would make things worse, but it made it better somehow. I wasn't alone. I made a silent pact with him. \"I'll be around, as long as you're around.\" I couldn't wait to turn 30, and to celebrate with this little furbaby who could be with me for the next 15 years. I kept thinking that by the time he's old and has to leave me, my life will be so different! Maybe I'll even have a family by then, a stable job.\n\nHe was unruly and hyperactive and so incredibly loving at the same time, he stole himself into my heart so quickly, and so completely. His demands for attention helped block out my intrusive thoughts. His almost aggressive insistence to curl up with me (read: on me) and spend an hour rubbing his little cheek against mine each night gave me more comfort then I'll ever be able to explain. \n\nHe was only with me for two months, when he got a very high fever. I was at the vet every single day, I never left him home alone - only to quickly run and get food. They didn't know what was wrong with him. After a week, his little tummy was swollen. They told me it was FIP, and he was going to die. I refused to listen. I spent entire nights on my PC, researching - with Jesse firmly cradled on my lap. As he was wasting away, I was already considering experimental treatments; having a possible cure shipped from the US, ordering it from a lab in China that would synthesize it, anything. But he was deteriorating so quickly. \n\n21 days after his first fever, I had him put to sleep because he had fluid build-up in his chest already.\n\nHe died on the 28th of December. Four days before my 30th birthday.\n\nI'm sure to most it might seem silly that this is what finalized the decision I was already considering in spring. It's not simply about Jesse, though I still cry every night at his absence. It's that every time there's a small beacon in my life, some tiny hope of better things to come, it gets crushed. And I come out on the other side worse for wear.\n\nAnd if I started out as a tree, I'm now just a toothpick. I don't have the energy anymore. I remember I was so proud of myself for how quickly I went back to a functioning level after that bad relationship. But the key word is \"functioning\". Barely getting by. Because the thing is, each time something happens that breaks me apart and I try to put myself together again, there are pieces missing. And it feels like after Jesse there's just nothing left anymore.\n\nAs a last plan/wish/bucket list completion, I drove 1400kms to surprise my mother on her birthday, two weeks ago. I also managed to visit my brother and his family. I spent a week there, and while I planned for it to be a silent goodbye, there was that tiny glimmer again. But every evening, my parents spent 2-3 hours glued to their laptop screens, looking at houses to buy (that's why they sold the flat back home). Lamenting that they'll need a loan, for the first time in their life. Worrying about money, long discussions, etc. \n\nAnd that's the bottom line, I guess. They're good people. My dad's always been my hero. For the past 30 years, he supported our entire family and works incredibly hard. They were hopeful, when they had two children - full of dreams for both of us, I'm sure. Thankfully my brother is doing well, has a lovely little family and a great job. But then there's me. The black sheep in the family, the one who at 30 instead of contributing is the cause of their headaches.\n\nIf I had just made myself disappear a few years earlier, they would be so much better off. Every day I'm alive, I'm just making things worse since they support me. And even if I get a job, in this country I still wouldn't be able to afford a flat + living expenses from that salary (hooray for rentals). And I don't even know how I'd go to a job interview, I have no degree, no work experience, all I can do is speak languages.\n\nSo this is my last night. Two days ago I went and picked up boxes, and been packing my stuff ever since - I don't want my parents to have to take more time out of their lives than is necessary due to paperwork and stuff. The sooner they get back to their lives, the better. I'm sure they'll be sad for a while - but in the long run, they'll be much happier without me ruining their future.\n\nI'm not scared anymore. I was scared and sad of all the things I'd miss out on - but the thing is, all those things only matter while I'm alive. I won't feel anything once I'm gone, so I just need to have the strength one last time and it'll be over in a few minutes.\n\nMy only regret is that I haven't managed to complete my 1000 paper cranes. I'm barely past 300; if I have some time after I finish packing I'll make a couple more.\n\nEDIT: [Jesse and his tiny high-five.](https://imgur.com/a/FSvPI) This was two nights before I had to say goodbye to him.\n\nEDIT2: Last one, I hope. It's a little past 6AM here, and I'm exhausted since I haven't slept in a day. Finished packing - well, I ran out of boxes so stuff like kitchen utensils aren't packed, but it'll have to do. Even went for a little drive while blasting music - ever since I've had my license, driving has been one of my greatest comforts.\n\n Now all that's left is to respond to all the wonderful comments here, try and type out some kind of note for my family, and have a glass of wine. Then I'll put on my little spotify playlist (The Greatest Showman - don't judge, the last thing I want to hear is Hugh Jackman telling me there's a whole other world out there, a better one), and make some more paper cranes until I fall asleep. \n\nI want to thank you all. You've shown more empathy and care to a complete stranger than most (if not all) people in my life, family included. Even on my last day, you all managed to surprise me. Thank you, for being with me the past hours - you've been a great comfort, even when some of your comments made me cry. I'm not scared anymore, I'm relieved. I just want to rest, and for the first - and last - time in my life for my brain to be quiet.\n\nSo lastly, to quote a classic: To die will be an awfully big adventure.", "url": "https://www.reddit.com/r/SuicideWatch/comments/7v1p8n/this_saturday_will_be_my_last_day/", "title": "This Saturday will be my last day.", "social_network": "reddit", "user": "Myrelin", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 29, "down_vote": 0, "creation": 1517688274, "permalink": "/r/SuicideWatch/comments/7v1p8n/this_saturday_will_be_my_last_day/", "nsfw": false, "first_save": 1635427763.2951953, "replies_charged": false}