{"id": "t5_2qpzs_t3_oody2i", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "Hello all,\nI am a 20yr old male, who is 1.82m 74kg of athletic build who is generally regarded as attractive. I’ve had girlfriends, lovers, and much more on the spectrum of intimate partnerships. \n\nReading this subreddit it seems many wish to end their lives due to something they view as missing. I can’t help but feel guilty for having so much of this yet still wishing to be erased. As a 20yr old I am graduating college summa cum laude a year early. I have coauthored a paper with one of my mentors which is going to be published soon, I was on full scholarship plus received grants for research so I have roughly 100k to my name. I have also been accepted to do a fully funded PhD in my desired field of study. I am also fairly athletic, having been on a national team for a relatively unknown sport, and ran in college. Due this I am also fairly well travelled having visited 16 different countries in my time competing. My only true ailment is that I mourn for society, as my chosen field of study is the environment. I sadly am bipolar, and despite finding a drug routine that has kept me feeling the best I have ever felt after 8 iterations of various regiments. Despite having finally found stability in this last year, despite having so much that so many yearn for I want to take my own life. Currently I am dog sitting for my professor for the next week. Caring for her as my professor visits her family is the only thing keeping me alive.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oody2i/ideation_despite_privilege/", "title": "Ideation Despite Privilege", "social_network": "reddit", "user": "909lbrweri", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1626824155, "permalink": "/r/SuicideWatch/comments/oody2i/ideation_despite_privilege/", "nsfw": false, "first_save": 1635426771.2431219, "replies_charged": false}