{"id": "t5_2qpzs_t3_q3n8rn", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "Things keeping me alive:\n\n* I want to learn how to surf\n* I have like 2 friends but we don't really open up to each other\n\nThings not keeping me alive:\n\n* I have no relevant experience and don't think I can find a job when I graduate college\n* If I have to live with my parents again I'm gonna kms\n* The world's 100% a cruel place and somehow I grew up thinking it was fair\n* It feels like I'm gonna be single forever, which is partially my fault but I don't really feel like changing myself cuz I'll just feel more like shit\n* I've honestly never been happy\n\nI really feel for the people posting here. I know my life isn't that bad but I wanna kms anyway. I think being young/alone has to do with it a little. \n\nI've always believed in myself though. Even though it doesn't make sense cuz I'm quite incompetent. And I always told myself I'd just keep pushing it and taking more risks until my life got better. That's basically what I've been doing. When you have 0 to live for it exposes you to alot of new things. I've also nearly drowned, crashed my car, lost alot of friends. I take alot of risks. \n\nI don't really need sympathy, cuz I know I can keep going. Even though I'm pretty suicidal. I'm gonna keep pushing myself until my life gets better or I end up broke/dead/in a hospital. Then it'll be over. I hope you guys can find the energy to keep moving forward even if you've got nothing. I've been on this sub a long time and hope yall can keep going. It's not always easy or possible though, I know.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q3n8rn/pros_and_cons_list/", "title": "Pros and Cons list", "social_network": "reddit", "user": "Pailed", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1633655834, "permalink": "/r/SuicideWatch/comments/q3n8rn/pros_and_cons_list/", "nsfw": false, "first_save": 1635427971.1595619, "replies_charged": false}