{"id": "t5_2qpzs_t3_q9kxvd", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "TL;DR: I'm just tired of being told nonsensical empty words of encouragement or being ignored all together. I just want to die peacefully.\n\nWarning: down below is a nonsensical, unedited, unfiltered rant. It's semi-long, so get popcorn and a coke, settle in, and prepare to read the most stupidly disorganized rant posted in the whole history of Reddit.\n\n\n\nI'm so sick of everyone's pseudo-ass fortune telling advice and therapy. It gets better! People care about you and love you! Your future self wouldn't want you to do it!\n\nShut up, shut up, SHUT THE FUCK UP. Unless you've got a genuine crystal ball or you're a fuckin time traveler or something, shut up about this \"It gets better!\" bullshit. You don't know what my future has in store for me. I don't know what my future has in store for me. But riddle me this: why take the gamble? I could have a shit future. I could have a good future. Hell, a meteor may come and crash down on the earth in the next twelve days and 32 seconds. No one knows for sure.\n\nSome people like those odds. They want to continue living and see what their future holds. Fine, so be it. Have fun, or whatever.\n\nI don't want to take that gamble. I don't care what my future holds. And I especially don't care about the people who love me oh-so much that they fucking ignore every call for help, treat me like shit when I reach out, and throw me away like a used chip bag every opportunity they get. Y'know what they say: humans are inherently selfish.\n\nI know each and every one of them is gonna spew the same ol sob song: \"Oh, u/Ace-of-Spxdes was such a wonderful person. We never knew the pain that they were going through! If only they reached out! Here's a suicide prevention number that'll just send the police to your house if you say that you're suicidal and make things 10 times worse than what they were! Boohoo!\"\n\nBut it matters not how people grieve—or celebrate—my death. What matters is that I'll be out of my misery soon enough. I'm gonna complete the small list of things I want to do and then kick the bucket. I'm tired of screaming for help. I'm tired of waking up and feeling like a walking corpse, cursed to walk the world with no escape. I'm tired.\n\nI'm so tired.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q9kxvd/im_so_tired_of_it_all/", "title": "I'm so tired of it all.", "social_network": "reddit", "user": "Ace-of-Spxdes", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634419444, "permalink": "/r/SuicideWatch/comments/q9kxvd/im_so_tired_of_it_all/", "nsfw": false, "first_save": 1635426212.1092334, "replies_charged": false}