{"id": "t5_2qpzs_t3_q76kn2", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "Something that's always bothered me is how people who are older than you LOVE to tell you shit like \"it all gets worse from here,\" \"enjoy being young while you can because it only gets worse,\" \"life only gets harder,\" etc etc, but the second you tell them you're suicidal suddenly they backpedal and now you've got so much to live for and so much potential to be happy. It's such a fucking load of dog shit. What's the point of the lies? It's so hypocritical and infuriating. Like, why fucking force me to live if we both know it'll never get better?\n\nAnd I do know that things won't ever get better. I have ADHD and autism, and the more I learn about it, the more it obvious it becomes that my brain is literally hardwired for me to be miserable. I can't produce and process dopamine correctly, so I don't feel satisfaction after doing tasks and I feel absolutely no motivation to do them. This translates directly into recovery. I have absolutely no desire at all to get better. I just want it to be fucking over. I hate all these memories, too, I hate laying awake at night ruminating over every little shitty thing I've done in my life. These memories will be with me for the rest of my life. No matter what I change, I can't forget all these memories that haunt me.\n\nAnd one thing that bothers me the most is my cat. He's the last tether keeping me here. Aside from the fear of a painful death, he's the only reason I don't end it all. And because of this, I sometimes have intrusive thoughts that I want him to die so that I can finally go through with it, and that horrifies me. I would never hurt him, and I don't truly want him to die, but the thought crosses my mind unbidden sometimes and it destroys me. I know that intrusive thoughts aren't indicative of a person's nature, and I wouldn't hold it against anyone else, but I just can't apply the same logic to myself. I am the only exception to a lot of my own rules. I also have this weird superstition where I feel like if I think about something horrible like this too much, it'll happen. I know that when he dies I'll think it's my fault because I thought about it one too many times. That's what I feel about my last cat. I watched him die very suddenly from what I think was a seizure, and I just can't shake the feeling that it was my fault. I'd just really like to hear that I didn't kill my cat by thinking about him dying too much.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q76kn2/tw_animal_death/", "title": "tw: animal death", "social_network": "reddit", "user": "Jaspurr_Cat", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1634112914, "permalink": "/r/SuicideWatch/comments/q76kn2/tw_animal_death/", "nsfw": false, "first_save": 1635427993.793009, "replies_charged": false}