{"id": "t5_2qpzs_t3_8n4dk4", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "This might get a little long, but i honestly don’t know what to do and he has made me jaded when i would never have second guessed someone’s pain. As some backstory, he has been a cog of the military for too long and we became friends because he knew how i could understand what he was going through; i was depressed and suicidal for a very long time, but fortunately was able to receive the right kind of help when i had no more rope. \n\nHe has always had bad things to tell me about his life. It has been horrible. The things he had to do in the military made me think i would lose my mind... i completely understand why he was suicidal, cause why wouldn’t he be?  But just recently, i found out he was faking it...not all of it, but the severity of it to a certain extent. And i am furious.\n\nIt has always seemed a little odd to me and other close friends why he would reject our companionship, while posting/sending messages about how people “don’t care if I die”; everytime, one of us would run to his side to make sure he knew how much he was loved and how much we did care. Some of my friends cursed him out for it - they were mad that he would say that when we would always be there. Some friends just let him vent and hid all the knives (i was one of those). And i truly thought that as long as we were willing to show him, it would mean something. Fast forward to him leaving us to go back home. I know vaguely that his other friends made time for him to be there, but i can’t speak for that (as i was not there). But when i knew he was leaving, i dropped everything to make sure he knew that all his friends were there. Last night, i saw him threaten to kill himself... and it was staged...\n\nI have never not taken a person seriously when they express it, but he legitimately put on an ‘act’: he sobbed, he cried, but even as my brain was telling me it as not real i still took it at face value. There were never any tears on his face. Immediately after crying, he said,  “fuck this” and ran to his room, pulling out a knife and threatened to shove it into his wrist. I thought he was serious cause he pointed it vertically and pushed. Initially i was flabbergasted, but i kicked into gear and grabbed his hand with the knife, and tried to take it from him, while i told him to stop. He was screaming at me (and I’m quoting what i remember), ‘fuck you! I might as well just kill myself! No one loves me.... what? You honestly think you can stop me?!’. I honestly could not tell you in more detail cause i was trying to wrestle the knife from him.\n\nI was sure he was already very injured because before i could even react to this, he had the knife pressed so deeply, i thought for sure he had impaled his wrist. Ultimately i was able to wrestle the knife away. And then i hid it. But as he started to calm down and pass out (both him and i were drinking, but he was drunk and i was not), i started to realize how strange the situation was. \n\nGuys, i grabbed the knife. I literally thought to myself it was better to hurt myself than him kill himself. So i grabbed it. But i was perplexed that i didn’t get stabbed by doing so. I ignored it cause it was not the important thing, but then later i also realized that not only did he cry like his life was over, but that the entire time he did, he held his hands over his eyes and when he threatened to end it all there were no tears on his face. I also realized that when i automatically looked at his wrist for puncture wounds, there absolutely was none. By all means, this knife should have done some damage to him and to me, but it was obviously dull.  Thirdly, i am not a strong woman by any means. Yet i was able to wrestle him and be able to take the knife away from him. \n\nHe honestly made it seem like i had defeated him in strength when I did it, but look back on it sober, that is ridiculous. And immediately after this ‘breakdown’ he was fine. Fine in that: i wrestled the knife from him, told him how much i cared and how messed up it was for him to say to me i didn’t, and got him to stop yelling enough so that he would listen to me about the therapy i received that ultimately helped me. This is not the first convo we’ve had about him getting help (he refuses to), but this is the first time i got angry and yelled at him for being stubborn. He told me the usual: “i hate you! Get out of my house! You don’t care NOBODY CARES” and i just sat through it until he tired himself out, stopped yelling at me, and went to sleep. \n\nI decided to sleep on the other couch next to him cause going home was not an option when i had just wrestled a knife from you... but when I woke up in the morning (he had left the couch to go to his own room) the realization of everything that had happened came all at once. Suddenly, i could see it all. And it hurt to know that someone i call a friend would manipulate me in such a way as to garner my sympathy while playing a game to see if i cared enough to sacrifice. I honestly don’t know what to feel...what to say to him...cause never would i ever purposely have tried to make my friends drop everything for me to play my “game” while i was going through the worst depression of my life. Is this just how it exhibits sometimes? Do you think i need to just try to surpass it because it’s still his own personal cry? Should i confront him? I really honestly could use any input on how i should go forward. Despite it all, my friends are my family, and i want to know what i can do\n\nTL;DR my friends has been manipulating me and my other friends into jumping through hoops while potentially faking their depression/suicidal tendencies", "url": "https://www.reddit.com/r/SuicideWatch/comments/8n4dk4/i_just_recently_found_out_that_my_friend_who_was/", "title": "I just recently found out that my friend who was suicidal was....not faking it perse, but only engaging in the behavior just to get me and his other friends to drop everything to help him", "social_network": "reddit", "user": "aoiN3KO", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1527641787, "permalink": "/r/SuicideWatch/comments/8n4dk4/i_just_recently_found_out_that_my_friend_who_was/", "nsfw": false, "first_save": 1635425265.101543, "replies_charged": false}