{"id": "t5_2qpzs_t3_mvz9ev", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "why am i so upset. there's so much shit in my head. sometimes i feel like i could maybe get through this someday, like i could sacrifice things in order to improve. then i get hit by a striking realization, it would be pointless. useless. im going down an unhealthy path. but it seems that any direction i choose, leads back down to the same desperate and painful place. im not sure how long i can stand it. it doesnt matter how much i sacrifice, because there's just so much fucking shit that i have built up inside that i will never be satisfied, i will never be whole, i could never ever let this out completely. im suffocating under myself. i dont even feel human. i have no connection to my family anymore, or humanity in general. its all so foriegn. i wish i could just run away forever. but everything catches up with me. and since i've given up, it's all far ahead. i'll never be able to run again. im trapped. these walls are slowly crushing me. iccan feel myself dying. why me? why do i have to live with this. why did it happen to me. why am i such a bitch. i feel so sick im so sick i want to vomit but at the same time im simply not sick enough why dont i have a reason why dont i have a reason why is everything my fault why why why why whywhy why why. i hurt myself so bad all the time, physically and mentally. i cant feel what i am supposed to be anymore what happened to me how did things get SOFUCKING BAD HOW HOW HOW HOW HOW. i want to end my life. i have tried to do it twice but i chickened out when things felt \"too real\". i wish i wasnt such a coward. i know it's an inevitability. i just want to get it over with. im destined to ruin my own life. i have already given up on my social life, school and general physical and mental healthiness. i wish my family didnt just view me as an edgy, lazy person. i wish they would take me seriously. im a complete failure in every aspect. i am going nowhere in life. i have no talent. i have no brains. i have no more motivation in life. im waiting for the moment i finally go through with it. i am preparing for it this year. it was a committment. i have to keep my promise to myself. all i feel is suffering and decay. i tried. i did the best that i could when i cared. im ashamed of myself. im ashamed of things that have happened to me. im a disgusting being. all i wish to do is rot and feel my flesh peel off in real time. i have an obsession with death. i dont fear death. i wish for it everyday. but i just wish i could actually do it. once i tried putting a bag over my head but once i started to lose oxygen i felt suffocation and ripped it off. the other was a belt. and i plan to hang myself with a belt yet again. i dont know how muchlonger i can actually go on like this. i cant live with this i just cant it makes me feel sick. i feel vile. im truly despicable.\nhelp me. please. i feel so alone. i feel so hated. i really dont belong here. i wish i never existed. i feel no connection to anyone here. i would have no problem killing myself. i found that i no longer care about how they feel, selfish i know, but the amount of selfish things i have done makes this feel so much less impactful. im a terrible person . i hate myself for everything. i know nothing will change. but i will whine. i need to let this out.  no one in my life knows how completely shattered i am. i found that trying to mention my emotions only ends up hurting people. im so tired of hurting. so tired. im so sorry. im really sorry.\n\nthis has all just been manic rambling i cant help myself. i feel like this everyday and its like my mind is melting apart while i continue to smash it to death. i've gotten absolutely no help at all. i have never seen a doctor for these feelings. im too afraid to be found out. im too afraid to let my mask rot away and reveal these abominations that are my feelings. i will simply die without saying a word. they cant get to me inside of here.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mvz9ev/why/", "title": "why", "social_network": "reddit", "user": "stupidandtoxic", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1619074929, "permalink": "/r/SuicideWatch/comments/mvz9ev/why/", "nsfw": false, "first_save": 1635428261.4692085, "replies_charged": false}