{"id": "t5_2qpzs_t3_q722ih", "request": ["5f7c2841-3f43-4682-8126-88825da57933"], "text": "I was so close today, closer than I've ever been staring down death. Even while on a US military carrier, where I used to think of throwing myself over the side and press up against the bars holding me back from the beautiful depths below, I never gotten so close.\n\n\nIt's so silly the way I did it too. It wasn't planned, I had made plans with friends to hang out this weekend. Made appointments for tomorrow and the next day and a month from now. Just talked to my husband about signing up for school again.\n\nI was just driving to work after I dropped my son off at daycare thinking about how I fucking hate my life and how I don't want to go in to work and deal with my PTSD today, how my life at home isn't perfect, how I feel like I'm slowly suffocating in my own mind and slowly drowning in luke warm water. \n\n\nI snapped today. \n\n\nI was on a turning lane, the light turned green and I went forward. I saw a big white truck and all I could make out was the headlights (it was dark 6am) all I saw was bright white lights and thought how peaceful it would be just to go into it. The light was so vexing, so peaceful, and so powerful. I drove into it with open arms, ready for it. But the truck turned away, because it too was on a turning lane. Then I found myself turning away as well, snapping back into reality. But if that truck hadn't turned... I wouldn't have turned either. \n\n\nI went to work and told a good friend of mine and down the rabbit hole I went admitting to more and more people what I had just done. At first I thought nothing of it, just that I needed a cry. But it was like my body was moving on its own, my mouth was moving on its own. Everything was screaming for help but my mind was trying to convince myself that I was fine. But until I was sitting in the hospital with a gown on did I realize \"holy shit there's something wrong with me\" \n\n\nI'm currently home after being in the hospital for hours and I just feel so empty. My problems are still not solved and now I'm just emotionally and now physically drained. \n\n\nWhere do I go from here, I feel so lost so empty yet so sad.\n\nThank you for reading if you got this far 🙏❤️", "url": "https://www.reddit.com/r/SuicideWatch/comments/q722ih/i_was_admitted_to_the_hospital_today_on_suicide/", "title": "I was admitted to the hospital today on suicide watch", "social_network": "reddit", "user": "Jemima64", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 57, "down_vote": 0, "creation": 1634093969, "permalink": "/r/SuicideWatch/comments/q722ih/i_was_admitted_to_the_hospital_today_on_suicide/", "nsfw": false, "first_save": 1635421100.7883036, "replies_charged": false}