{"id": "t5_2qpzs_t3_qhfewb", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "(Disclaim: messy post because I am medicated. Not overdosed, just took some clonazepam to chill a bit.)\n\nMy mom is a good person, basically raised me on her own. She supported me through my first suicide attempt, took two months off to be with me. It was the hardest period of my life. So I always told myself - next time is the last time.\n\nIt's been leading there as of late. I thought I could handle it for her, but I feel myself losing strength. \n\nToday was such a horrible day. I woke up and I was alone. I worked for 9 hours, barely ate. I hate, hate, hate my new job. \n\nWhen I got off it was early so I thought of taking a nap and getting up to set the table and maybe talk to them. The food was ready, just the table. But I missed my alarm and when I woke up it was almost 11 PM. Again, alone. \n\nI checked my phone to see if my best friend had texted me, but nothing. I just ate something and took a bunch of pills (not at attempt) to ease myself down a bit. Started researching methods and trying to figure out what I wanna do, what would be best.\n\nIn reality, I wish someone would reach out. They always tell you they will and they never do. I've read countless times \"I wish my family member would have told me\" but I know her reaction will be bad. \n\nI'm already ashamed of myself enough for the both of us. She will just adapt this attitude of concern but also anger, like \"Penelope, get your shit together.\" I wish I could mom. I wish you knew how hard I've tried.\n\nI feel unable to do things a normal adult would be able to do, like work. I don't feel capable of it. But it's not visible so people can't tell. They only paid attention to me when I overdosed and was admitted to a psych ward. Only then, for a brief moment, did it click in their brains that I'm not normal and I never will be.\n\nI've considered so many things. Packing my bags and leaving for some kind of volunteer program. The people who would miss me are few and can survive on their own. \n\nI'm just lost. I'm at that crossroads, the defining moment of whether this is the end or whether I fight. \n\nI wish I could tell my mom. And I wish when I did, she could see me for what I am. She could realize my intelligence is incapacitated by my mental illness. I am not capable of this. I am capable of simpler things. But I've always been the smart kid. If they only knew just how broken I am. \n\nI wish I could tell my mom. I have in the past, and I don't think I can do it again. I wish someone would tell her for me, but no one will catch up on my signals. I am saying 'help me' - pull me away from this road. But nobody is on the other end of the line. Just like there is nobody home when I wake up, or when I grab a snack, or when I sit down to have dinner, or when I brush my teeth, or when I go to bed. \n\nIt would be so nice if I could blurt out the words again, but her eyes showed compassion instead. A hug. Telling me that maybe I need to register my disability. A caress, a word of love. Those are the things I wish would happen if I said it once again. They will not. \n\nI wish I could say it but I can't. I've buried it too deep and it's wishful thinking to hope that anyone will notice before it's too late. Because nobody is looking my way.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qhfewb/i_wanna_tell_my_mom_but_every_scenario_that_plays/", "title": "I wanna tell my mom, but every scenario that plays out in my head is just terrible", "social_network": "reddit", "user": "penelope_07", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1635397241, "permalink": "/r/SuicideWatch/comments/qhfewb/i_wanna_tell_my_mom_but_every_scenario_that_plays/", "nsfw": false, "first_save": 1635422993.6665509, "replies_charged": false}