{"id": "t5_2qpzs_t3_pt746z", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d", "86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "How the fuck is that even possible. How did i survive a trian hitting me.\n\nI was blacked out so i don't remember but i broke my right leg, my rib cage (one bone in it) and my skull too. And my brain bleeded.\n\nTho I'm still alive here.\n\nMy mom and dad (both are religious/ sunni Muslims of ) now know I'm suicidal :/\n\nEven the local News talked about someone surviving a train. However they didn't give away my name or picture (thank God).\n\nHow the fuck did i mess this up ...\n\nHow is it even possible to survive a train hitting you. I'm filled now with even more scars then before. \n\nAccording to the cops i was like 4 cm away from dying ? \n\nAnd i told the cops \"i want to die \" after surviving. This is how my parents know I'm suicidal, the cops told them.\n\nWell i was rushed to a different City Incase my Brian kept bleeding. They thought i might get disabled or something but I'm still here fairly \"normal\".\n\nJust with a broken skull, ribcage and leg. Nothing sus haha.\n\nI'm just mad tho \n\nMy mom knows I'm suicidal now . And my therapist will now know too.\n\nI can't Believe tho i survived a mother fucking train bruh.\n\nWhat are the odds of surviving a train hitting you. I was literally laying on the railroad.\n\nThe sad thing is i was black out drunk. Blacked out me seems to have tried to live by moving his head away from one of the railroads? I literally have no idea but the cops said if my head was on one of the railroads l i would be gone. Apparently i was like 4-5 cm away from gone.\n\nI just can't believe i actually tried killing myself via a lethal method, train yet somehow fucking survived .\n\nAtleast my mom doesn't know about Me cutting but she now knows about sucidal thoughts:/ same with dad too :/\n\n\nI'm on my way to original city rn and gonna stay in the hospital to recover för a while.\n\nI'm just so mad i survived A FUCKING TRAIN bruh.\n\nTho they are giving me meds like oxycodone Wich are taking my physical pain away and making me feel better...\n\nMy leg and skull are hurting sooooo bad but IV oxycodone and paracetamol are helping.\n\nOxycodone is Also helping me sleep and shit \n\nI wish tho i slept forever back there in the train but here i am :(\n\nI won't be able to try sucide again for a while cause mom and dad are suspecting me lol .\n\nWell something good is my mom doesn't know i was drunk when i tired killing myself, so yeah good she doesn't know i drink. Yet...\n\nWell i guess I'm stuck here for a while since i can't even walk yet lol . Rip my leg .\n\n(For those wondering i made This post while laying on the railroad : \n\nhttps://www.reddit.com/r/SuicideWatch/comments/prfgaa/welp_im_gonna_do_it/?utm_medium=android_app&utm_source=share)", "url": "https://www.reddit.com/r/SuicideWatch/comments/pt746z/im_such_a_failure_i_somehow_survived_a_fucking/", "title": "I'm such a failure i SOMEHOW survived a fucking train hitting me. how unlucky am i ...", "social_network": "reddit", "user": "throwaway023829", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 141, "down_vote": 0, "creation": 1632315880, "permalink": "/r/SuicideWatch/comments/pt746z/im_such_a_failure_i_somehow_survived_a_fucking/", "nsfw": false, "first_save": 1635426901.654046, "replies_charged": false}