{"id": "t5_2qpzs_t3_m8acg4", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "This all started about 10 years ago I was the victim of a robbery turned stabbing, I spent 2 and a half weeks in the hospital with chest tube to fix a collapsed lung and multiple lacerations on my chin arms, neck, chest and stomach sustained during the assault. It felt like my world had turned upside down I became more and more withdrawn from social interactions and I started to get dreams of the incident and I suffered and wished I hadn't put up a fight. I had enough after a year so I left state and tried to run from my problems, fast forward to last year I was at the point of holding down the same job for 5 years I had my own apartment for the first time and the dreams of the assault were sporadic and at this point I felt like everything was under control.\n\nThen July of last year happened I was having some issues at work dealing with stress, and having difficulty sleeping from my returning dreams and I made an off hand comment about ending my life and it was brought to management. Well they took it very serious and brought it to the attention of their in network health services and I was forced to speak to a therapist and was not allowed to return to work until the we said it was safe for me to. \n\nThis was my first time really talking to someone about the issues that have plagued me over the years, and it took a toll on me mentally opening up about the assault, it made things worse the dreams nightly, thoughts of ending my life flooded my mind daily and yet it felt as if the therapist was just there to stop me from ending my life not truly there to help me, fast forward to August my Loa claim was denied, so I wouldn't be getting paid for my time off as you can imagine this made things worse for me as the added stress weighs on me even more. \n\nSeptember comes and goes still doing therapy I'm crying myself to sleep every night as I'm running low on food and money so I talk to my therapist on my last session before I'm slated to turn to work she approves my return.  I start working again but I'm so overwhelmed at work with everything in my head I start missing days until I eventually get fired for attendance in late October. \n\nNovember comes and I've been applying to every job I can find I land multiple interviews yet no takers, this continues until the present day where I'm 2 weeks away from getting evicted i was donating plasma just to buy food but I passed out during the donation process from being dehydrated and ended up jamming the needle in and blowing my vein up. I lost enough blood to be ineligible for donations until next month. So 2 days ago I decided to register for organ donation online, It took me 10 years of suffering to realize that I'm tired, I'm tired of putting on a fake smile, I'm tired of being scared, I'm tired of carrying this burden, I'm tired of running away from my problems, I'm tired and I hope my brother understands, I hope that someone who truly wants to live May benefit from my donation, I'm past the point of being scared of dying anymore having already faced it, I just want to be at peace.", "url": "https://www.reddit.com/r/SuicideWatch/comments/m8acg4/im_tired/", "title": "I'm tired", "social_network": "reddit", "user": "HoItby70", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 22, "down_vote": 0, "creation": 1616132393, "permalink": "/r/SuicideWatch/comments/m8acg4/im_tired/", "nsfw": false, "first_save": 1635422313.8157911, "replies_charged": false}