{"id": "t5_2qpzs_t3_pumd5n", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "I’ve been depressed for almost as long as I can remember. I had some unresolved childhood trauma that lead to a lot of problems. I self harmed from the age of 11-18. I’ve been clean for almost seven years now and it’s started to creep it’s way back into my daily thoughts. I can be driving down the road and I’ll have violent visual flashes of me dragging a blade through my skin, down the road not across the street. I don’t even want to hurt myself anymore cause it wouldn’t be worth it. It wouldn’t be like it used to be where I could hide it under my sleeves and have no one worry. No, now I have a life and a profession and a beautiful girlfriend who wouldn’t be able to handle me like that….\n\nEven when I’m smiling, even when I’ve just woken up and the world hasn’t had a chance to make me sad yet, I wake up with this heavy feeling in my body. I feel like I haven’t been able to truly feel joy without having to worry about the feeling disappearing from the slightest inconvenience or rejection. I smile through all of it but I swear everything is coated in a thick grey lens. It all feels pointless but I don’t have the guts to end it all. \n\nI just wish the intrusive thoughts would stop. I wish I could stop being so sensitive to every possible bit of rejection. I’m so tired of trying to be happy. I’m so tired of living. I wish I could just shoot my self. Death has to be better than feeling like this all the time. What’s wrong with me?", "url": "https://www.reddit.com/r/SuicideWatch/comments/pumd5n/relentless_intrusive_thoughts_passive_suicidal/", "title": "Relentless intrusive thoughts, passive suicidal ideation", "social_network": "reddit", "user": "Reliable_lizard-26", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 17, "down_vote": 0, "creation": 1632497976, "permalink": "/r/SuicideWatch/comments/pumd5n/relentless_intrusive_thoughts_passive_suicidal/", "nsfw": false, "first_save": 1635427198.9424202, "replies_charged": false}