{"id": "t5_2qpzs_t3_2ojytf", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "*Setting:*\n\nI like to think I'm a scientist. I structure the framework of my opinions and interpretations that form the basis of every criteria of my personality in as much empirical data as I can within the limits that my human fallibility. I'm 29 years old and I'm beginning my academic career by registering for the spring semester 2015. I have had two relationships where I knew that I was ready for a marriage and believed that the person with me was aswell based on several verbal confirmations whilst the persons judgement was not impaired and a decision would have been genuinely accepted regardless of the outcome. Both of these relationships ended because ultimately neither was as invested as I was. I have never to my knowledge ever been presented with data that would indicate that another human being was ever as interested in being around me as I was with them. \n\n*plot:*\n\nAlmost a year ago I met whom I believe is \"the one\", we'll call her Susan. Susan was my at the time current girlfriend's best friend in a new city that I had recently moved too that i currently live in. Susan and I instantly hit it off there was no effort, no deliberate choice or influence for us to connect we knew then and her best friend (jessica we'll call her) knew it aswell. So months went by and Jessica and I grew further and further apart because we discovered we were growing into further and further different people. Jessica moved back to her home city and Susan and I have simply constantly been together. Susan and I relate in a way that no one else relates with us like two outside observers whom met behind the two way mirror for this world's society and environment. Susan and I intuitively relate and communicate through passive response stemmed from confirmed shared bias. We each share similar goals and direction and are growing together as both individuals and as friends hand in hand as would a pair of friends exploring a museum together. We have implicit trust in each other's opinions and speak as candidly as we can imagine (both directly state this attribute in confirmation).\n\n\n*the twist (or as I persists it as a twist):*\n\nSusan is a homosexual (maybe bi) woman, I am a heterosexual man (who's been bi before). She has stated before that she's experimented with a man she was engaged with before but ended for various reasons none chief among them specifically beyond perhaps maybe that she was more interested in women. SHE had recently started saying that she find me attractive, she had alluded to having thought many times on her own inspiration about us being together and that she had fantasizes about us being together intimately. She went on to state that she feels that she doesn't want to define herself to a \"label\" and that for the past few months that she had decided to be celibate and think about what she truly desires in a relationship she had decided to explore one with me that \"if I ever was to have a relationship with a man there is absolutely no doubt in my mind it would have to be you\". \n\nSo we went for it, I initiated and kissed her. Susan kissed me back and seemed to enjoy it. I asked her if this \"felt right\" and she confirmed that it did. We kept kissing for the next your or so and then called it a night because it was around 4am and I had an appointment the next day (also not to jump into it). The next day comes and were excited to be together again that night, this is where I feel I ruined it. She came over and we immediately started talking about a project we'd been working on together (a thought experiment video game for social education about group ventures and projects). We smoked a it of weed and I started to kiss her, she returned the affection and then I started a conversation. I asked her she would be satisfied being in a relationship with me despite being lesbian, that if pursuing this with me would be the best course of action for her because I love her and I want her to be as happy as possible no matter who or what we are together. We had a long conversation about intimacy and what it meant for both of us and she decided that she could be happy if it were just with me but that she didn't want a relationship as committed to each other or even FWB but simply \"spontaneous sex with no deeper meaning\". I was devastated and agreed to terms I now have texted her stating as unfair to me that we would only ever have any kind of intimacy that she initiated.\n\n*conclusion:*\n\nMy worst psychological defect I believe is that I default to people not choosing to move forward in a relationship with me is because they don't appreciate me or because they aren't interested in me and so my instinct now is to believe that she's not attracted to me and doesn't want to be with me for that and not for lack of desire for committed intimacy. I feel as though I have all the data to suggest that even though in a population of 7 billion there's bound to be a relatively large pool of people compatible me the statistics in finding them and able to carry a relationship long enough to fruition is unrealistic. I want to commit suicide, to save me the pain of current and future disappointment. I realize how selfish that is and that others would be sincerely affected but I feel as though they'll eventually move on and \"get over me\" fairly easily. I honestly do not believe i have any data to suggest that I will find someone, just as excited to be around me as I am with them.\n\n*tl:dr;* \n\nI calmly, objectively (in my mind), and logically conclude that I have no data to support the continued disposition of expecting a potential paring with another human that results in an equally mutual interest for intimacy and a committed, monogamous partnership. Since I believe that a relationship is intrinsic in my ultimate desired goals and dreams I do not see the greater potential gain in continuing my existence given my current analysis of the environment and my potential.\n\n", "url": "https://www.reddit.com/r/SuicideWatch/comments/2ojytf/is_it_logical_to_self_destruct/", "title": "Is it logical to self destruct?", "social_network": "reddit", "user": "sysadmin001", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1417965892, "permalink": "/r/SuicideWatch/comments/2ojytf/is_it_logical_to_self_destruct/", "nsfw": false, "first_save": 1635422565.4088886, "replies_charged": false}