{"id": "t5_2qpzs_t3_hr4kd3", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I'm not sure if this is the appropriate place to post this but it's something I've felt suicidal over. Just to give a bit of background before I get into things, I'm 20 years old now and there were a couple things I did last year that make me feel guilt ridden and completely disgusted about myself. I also started developing a fear of becoming a pedophile (which is known as pedophilia OCD) when I was 18 but I didn't get diagnosed until later on in my life. I have suffered from having a porn addiction and it was especially prominent last year.\n\nWhen I was 19, my main source of porn was Reddit and I would follow a bunch of subreddits related to porn on this site. At the time, I followed a subreddit that's dedicated to only posting nudes of girls who were 18-19 and I would actively look at those posts mainly because I happened to fall under that age range. When I was looking at one of the posts, there was a comment on it claiming that the girl in the picture was actually underage with some of the replies even saying that the comment was true. I was shocked and confused and I felt the need to know if it was true, so I attempted to look into it. As I was trying to google to find out if this girl was actually underage, I ended up finding more nudes of that same girl instead. Instead of simply ignoring those pics and moving on with my life, I ended up giving in and masturbating to them. I felt really terrible about myself afterwards. I was ashamed and it greatly affected my POCD. Now I was even more afraid that I was becoming a pedophile and I became suicidal as a result. I don't even remember why I masturbated to those pics. Maybe I was really desperate and needed something to get myself off, I don't know. I'm probably just making excuses. I even downloaded those pictures but I immediately deleted all of them out of guilt. To this day, I still don't know if the girl in those pics was actually underage. I saw some people still posting her nudes on the subreddit after what I did but I saw some comments saying that the girl wasn't actually underage and that it was all a lie. I even saw that these pictures were even uploaded on Pornhub and xhamster and that got me more confused on whether or not these pictures were actually of an underage girl. As far I know, I either got lied to about these nudes or the claims that she was underage was actually true. I don't think I'll ever know for sure but either way, I don't want to see those photos ever again. It makes me feel sick to my stomach just thinking about it.\n\nThat wasn't the only thing that happened last year. During that time, I also became addicted to sexting on Omegle. Because I was 19, I decided to avoid dating anyone who was under 17 because at the time, that would only be a two year difference. I thought to myself that once I turn 20, then I would only seek out girls who were 18 or older. But until that time came, I thought keeping the limit to 17+ was a reasonable cut off point for 19 year old me. This extended to my interactions with people on Omegle, which led me to sext a couple girls who happened to be 17. At the time, I thought it was perfectly fine because, like I said, it was only a two year difference. All of it was only through text on Omegle and I wasn't actively seeking out 17 year olds specifically. It's just that if the girl happened to be 17, then I thought that it would be fine. Over time though, I started feeling really disgusted about myself and I completely regret those interactions looking back. Even though it was all only through text and I never solicited nudes from any of them, it still wasn't okay for me to do this. Even if I don't think that this act itself was pedophilia due to the age gap only being two years, I just can't stomach the fact that I sexted a couple girls who were technically underage.\n\nThese are the only two things that I ever did but it's been constantly haunting me ever since. I never actually did anything worse than these but I can't help but feel a lot of overwhelming guilt over them. They're constantly stuck in my head and it makes me feel like I deserve to die. I feel like a horrible person and I feel like I should get punished. That's why I even I thought about reporting myself to the authorities for the alleged nudes and what I did on Omegle (even if it was all only through text) but I don't even have a spine to do that. I honestly have a hard time forgiving myself over these things. The only excuse I can make is that I was still technically a teenager at the time and I didn't know better but I don't think that's enough. It doesn't help that I suffer from POCD and have been afraid that I might be attracted to minors even if that might not actually be the case. Admittedly, I've never actively seeked out any underage content or even seen anyone underage in real life that I've felt sexually attracted to but for some reason, I still have that fear that it might eventually happen. I've talked to my therapist about all of this and after everything I've said, she still doesn't consider me a pedophile despite the things I did at 19. She even told me that I don't deserve to go to jail despite all of this. I mentioned before that I also suffered from a porn addiction but it hasn't been as bad as last year and I've since deleted the Reddit account I used to look at porn. I can thank my therapist for that. She's been helping me but sometimes I feel like simply talking to her is not enough. Sometimes, I think I should talk to more people about these things but I'm hesitant in doing so because I'm afraid of getting backlash, even if I think that I deserve said backlash. I genuinely don't want to hurt anyone but I just can't get over the things that I did at 19 and I'll forever be regretful about them. I don't know what else to say, I just don't want to feel like a danger to society anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hr4kd3/i_feel_like_a_terrible_person_because_of_my_pocd/", "title": "I feel like a terrible person because of my POCD and my porn habits from when I was 19.", "social_network": "reddit", "user": "ta727523", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1594743761, "permalink": "/r/SuicideWatch/comments/hr4kd3/i_feel_like_a_terrible_person_because_of_my_pocd/", "nsfw": false, "first_save": 1635427144.4937334, "replies_charged": false}