{"id": "t5_2qpzs_t3_2z59ze", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "http://www.reddit.com/r/SuicideWatch/comments/2z1eoa/why_is_killing_yourself_seen_as_taboo/\n\nPosting this the next day; don't feel any better.\n\nI feel like my life is passing me by, and none of you (including people on here) seem to get that there's nothing I can do because I don't have any money. People seem to think you can magically do things, but the fact of the matter is, things cost money.\n\nEven if you find some free event/club, it still costs money for transportation.\n\nDo you people understand how bad I WANT to do something. It's not like I'm choosing not to do anything. It's just that I CAN'T do anything because the world runs on money. The world doesn't care  about taking away my time and youth because it refuses to give me a job that pays well.\n\nNot to mention, I have student loans. It's almost like I need to sacrifice something if I get some minimum wage job.\n\n* If I want to live on my own and be able to go out, then I can't pay my loans.\n\n* If I want to live on my own and pay my loans, I can't go out\n\n* If I want to be able to go out and pay my loans, I can't live on my own\n\nThe absolute insanity of this country (U.S.) is ridiculous. It would rather have people starve than to admit that the system is fucked in any way.\n\nHere's something I posted in another thread: http://www.reddit.com/r/offmychest/comments/2z14ap/its_all_a_neverending_cycle/\n\nSo, I just don't see the point. Either I'll waste so much time that I'll no longer be young and have the energy to do the things I want just to be able to have the money to do them, or I'll be stuck in this situation forever. I just don't see the point in going on. Why can't anyone understand that? I can't even get mental treatment because I don't have health insurance.\n\nIf I were to kill myself now, I would be a martyr for the fight against the fucked up ideals of this country.", "url": "https://www.reddit.com/r/SuicideWatch/comments/2z59ze/update_why_is_killing_yourself_seen_as_taboo/", "title": "[Update] Why is killing yourself seen as taboo?", "social_network": "reddit", "user": "psn22556", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1426444359, "permalink": "/r/SuicideWatch/comments/2z59ze/update_why_is_killing_yourself_seen_as_taboo/", "nsfw": false, "first_save": 1635428469.2422452, "replies_charged": false}