{"id": "t5_2qpzs_t3_9ku4x8", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "\n\nI was a good friend and boyfriend to a lot of people. If their judgement is only skin deep. Week then contest what I’m bring to the table. I don’t think blaming anyone is going to prove just. Holding people responsible for their actions over others and how they are known to wait and manipulate over others. Then yes I suppose I’m to blame for twisting and manipulating what I think to not match what the status quo thinks. I’m not here for that. But I know who I was over the fact that people have and will say whatever they want about people to cover up what they have said about people. When I assume I only have good thing to say about people? I’m sorry if that the case I’m dead tomorrow.. and you all can keep you lives over knowing that I haven’t been listen to over a thing any white community along with one or two attacker’s have been able to put out black people for a very long time. I don’t hate anyone but their attitudes. Why should I give anyone a chance over this alleged selfishness of my part. I hope that some day I know enough better of my self to be able to show anyone that they were wrong and that it just effects them and not me.\n\nIn me knowing that I don’t have or need anything has been the worst pain Ive know; and slcast them out as delusions. To the point where I’m desperate to not have any thoughts feelings or possessions. Just cause it’s hard to see, want to believe, or know that I was raped and molested and racially impugnated from my life honor and what I hold dear. Why would I want to try for any of you. Not that I still don’t regardless around the ideas of my own poverty and what I have and haven’t known. If it at all matters I don’t need or want anything to do with me, them, then. Anymore than him, they, and those; types of people even if they are just shitty kids.\n\nI don’t care about every tid bit of my being miss conditioned or irresponsible have to do with my situation, cause I’ve just been that to people when I would consider me at my best summer going into frogs, froshyear, and the summer after, leading to the whole of sophomore year until I was sexually raped and molested for racial prejudice and pandering over who I was, and entitlement issue consequence by everyone but me to this situation. My mom during this time was just as if not more abusive to me then my dad ever was but I still hold them both in the same regard and court for being not their for me, for this very reason.. I was anything other then trying to be myself and as secure as I could be.\n\nBeing bullied at school and at home left me with an estranged social circle that may never recover from what has been done to me not for me. Even if it took eight years to come to terms with what really happened and keeps ruining my life with these actual friends family and Sarah..\n\n\nI want to die because I don’t think I could show everyone where this has put me out from people that I actually care about. Around the fact of who has let me be myself and respected my boundaries, the people that didn’t; and if at all I recognize them. I’m not sorry for being mad. I’m a better person the the madness they make of me but me knowing why I’m upset in my: inhibitions and morals, has let me know that I’m the same as I was and people are being manipulated around that. Because they hate distrust or just don’t like themselves; professionally, socially, or in and with friends and family. Either way I don’t how to care anymore I want to die because I’m better then Their ideals or plans for Themselves and where They’d leave me to rot regardless of what They say or think. Who They and and what They’ve wanted from me. Based on others or Their disrespect. And how They rather have what They have to say over me saying that I’ve been hurt by them.\n\n", "url": "https://www.reddit.com/r/SuicideWatch/comments/9ku4x8/civil_defense_iii/", "title": "Civil Defense III", "social_network": "reddit", "user": "young_mof", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1538510979, "permalink": "/r/SuicideWatch/comments/9ku4x8/civil_defense_iii/", "nsfw": false, "first_save": 1635426459.5553527, "replies_charged": false}