{"id": "t5_2qpzs_t3_qaggfc", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351"], "text": "I am having troubles with a few things and it's been getting worst lately. I am 17 and I already feel like I've lived too long. I feel ashamed of who I am, I am a lazy person who doesn't spend time helping his future. Everyone around me has a job, are earning money while I sit in front of my computer all day. I have no idea what to do in the future since nothing really captivates me longer than a week, I am failing my classes because I am not taking the time to work on school and I get reminded constantly that I am disappointing by my parents. School is giving me a lot of stress and I cannot take my mind off of it. My family also adopted a dog a few months ago, I live with my father and my stepmother with her two kids, one is 5 and the other is 6 years old and I feel sorry for my siblings since they are being poorly taken care of, they grew bad habits of mistreating the dog by hitting him, same with my parents that have been also doing this recently. I try to prevent it by telling to stop and it's wrong and they most often shrug me off or tell me that I have no right in saying what is right or wrong for the dog. I have a really hard time dealing with animal abuse and it really hurts me deeply to think about it and now I have to witness it, I just can't. My dad also knows how weak I am about this subject and reminds me that it's all my fault and if I contact animal support they are just going to kill the dog because of me  (they being animal support). I am also homosexual, not that my family knows. But I have to hear their homophobic jokes every week. They always say one and I have to pretend finding funny or true. One time the dog was walking oddly, he basically shook his butt every step he took and they kept commenting \"Oh look our dog is a fa\\*\\*\\*t\", their words, not mine. This combination of feeling like a disappointment and a trash of life is driving me crazy. Recently my boyfriend, well ex-boyfriend, suddenly cut all contact with me, no explanation given he just said \"I guess this is goodbye\" I was worried for him at first so I contact one of our mutual friend and she assured me he was happy so I guess I should be happy for him. I was used to talk with him daily, we'd tell each other how our days went and help each other in rough times but now, I feel alone and keep ignoring the bad thoughts until I can't. I have suicidal thoughts, they make me happy in a way, it feels like there is a clear way out but I know I won't act on them it's more like dreaming. I want to live a peaceful life, in the mountains -Oooh how I love the hiking- away from the stress and pressure of society. I expect no pity and I know I have life easy if we compare mine to most of the world but I still felt the need to express my feelings. I'm crying and it's 1 AM, I still feel sort of relieved that I shared my thoughts. Right now I am in a state where I don't want to continue anymore, I don't want to wake up tomorrow, it feels too hard for me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qaggfc/its_been_hard_lately/", "title": "It's been hard lately", "social_network": "reddit", "user": "Duikan", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1634536083, "permalink": "/r/SuicideWatch/comments/qaggfc/its_been_hard_lately/", "nsfw": false, "first_save": 1635423158.9183931, "replies_charged": false}