{"id": "t5_2qpzs_t3_pe1ykr", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "This is gonna be pretty long, you are warned, but i just wanted to let out what suicidality is for me, cause i feel its pretty vague and a big concept. Maybe you relate to some things i wrote or even things i havent mentioned.... anyway thx for hearing me out.\n\n&#x200B;\n\n1. Suicidal thoughts\n\nThose are either unconscious, subconscious, or conscious thoughts about suicide. It’s pretty direct, and they usually end up in a lot of rumination or dwelling in my case. If I’m being honest, sometimes I welcome them, other times I don’t, but in general they are just ideas and thoughts that begin when my mind starts spiraling down. However, they can also happen when I’m feeling happy, like I don’t deserve happiness, and then I’m suddenly triggered and will start thinking about killing myself. Anyway, suicidal thoughts are, for me, when I start thinking about ending my life, whether it be a fleeting thought as I’m crossing a bridge or a conscious inner monologue as I’m laying in my bed sleepless at night. They can make me feel uneasy, but I can also calmly let them flow and not do anything to shift my attention or change my focus.\n\n2. Suicidal feelings\n\nFeelings are generally less controllable than thoughts, and therefore more anxiety-inducing, in my opinion. I’m not exactly sure how to explain this one, but if you have ever experienced it, I think you already know what I’m talking about. A lot of the time, though, people joke about this. It could be a coping mechanism for some, an automatic response for others, or a real cry for help and it can honestly be hard to distinguish who is making those jokes for what reason. I’m sure you’ve said, or heard your friends say things like “the exam was so hard I want to die”, or “I hate this class I want to kill myself”. I’ve said things like that too. The people who say them do not necessarily feel suicidal when they use these types of phrases, but those who do… just feel it. In this case, it’s often not logical, some might call it overdramatic or attention-seeking though I disagree with these sayings. It is a reaction to something, the same way that some people cry when they get happy while others jump around and talk incessantly, some others just smile and for some you can barely see their facial expression change. Some people’s suicidal feelings rise up at minor inconveniences, and even though these people know it’s irrational or nonesensical to want to kill yourself because you wanted to eat cookies but your siblings took the last ones, the feelings are still there. Most often, the reasons for feeling suicidal have piled up for some time, and the feelings just show up at something that is seemingly minor. \n\n3. Suicidal intrusiveness\n\nI know that this one can be associated with OCD, but I won’t go there, I’m only talking about my experiences. As the words say themselves, suicidal intrusiveness consists of intrusive thoughts or images about suicide. I find those completely uncontrollable and unlike suicidal feelings they will often happen without any trigger. The worst is when I’m doing an exam,  having a conversation with someone, at a birthday party, or in the middle of an interview, and I just get attacked. I get flooded by violent images and thoughts of ways I could make my soul leave my body. It does not matter whether I’m feeling depressed or not because as I said, I could be at a birthday party and having a good time, or writing an easy exam, and I will get bombarded. Most of the time, even if it happens while I’m feeling suicidal, having those intrusive thoughts/images is an ordeal. I would not go through with any of the methods I see because everything is so very violent, gory, morbid, disturbing and even disgusting. It is highly distressing, but then I need to just continue acting like I’m fine and like everything is okay, life goes on… They usually happen several times a day, sometimes for a couple of minutes and sometimes for hours. (ps: shout out and rip to all the exams I messed up because of this concentration killer, to all the conversations I abruptly ended and to the people who thought I was being lunatic or rude for not entirely listening to them or responding, to the interviews I messed up, to the parties I was excessively withdrawn at, to the events and opportunities I missed, etc. it’s all good. Or is it?) \n\n4. Suicidal urges\n\nWe have now reached the worst level of suicidality according to me. At that point, it is just dangerous for me to be in certain places, in the presence of certain objects or to be alone, because if something or someone doesn’t stop me, I’m going to do it. This is what makes me feel the most powerless, this is what makes me feel the most hopeless, this is when I feel I’m losing control of myself, this is when I don’t look forward to anything, this is when everything crashes down in my head to the point where i cant think or function, this is when I just want the world to stop. But it can’t. So I have the urge to stop my beating heart instead. At that point I usually can’t do anything but feel overwhelmed, panicked and/or insufferably low. At this point I start thinking “these are my last moments on this planet”. At this point I’m usually curled up in a ball in my bed, crumbled on the floor in a corner of my room or something along these lines. However, I do get suicidal urges when I’m not home sometimes, and that’s even more dreadful. Overall, my brain is always too scattered to function properly, I can’t think, I often panic, I have a hard time moving, I get a pressing feeling in my chest, my body often aches around my head, my clavicles, my respiratory system, my digestive system, and I’m ready for my heart to fail anytime. This is probably the state people talk about when they say you should call a hotline or check yourself into a hospital? I don’t know, you tell me. I’ve never done those things. Anyway, the urges tend to last from several minutes to hours or even days. Like suicidal intrusiveness, these urges can be intermittent: meaning they could, for example, come as I first wake up for a couple of minutes, then leave me alone for the rest of the morning, and then come back in the late afternoon, etc.. However, sometimes they are just constant for long. Let me tell you that I’ve done a few days with constant suicidal urges, and it’s incredibly hard to do anything, incredibly hard to look at anyone or anything without linking it to a way I could die, and when that happens I’m not even free at night, because my dreams revolve around these themes and suicide is the first word on my mind when I open my eyes.\n\nTLDR - me being suicidal refers to having suicidal (intrusive or not) thoughts and images, feelings, and urges. Sometimes a combo. And its getting harder and harder to cope my life is like downward slope", "url": "https://www.reddit.com/r/SuicideWatch/comments/pe1ykr/how_suicidality_is_for_me/", "title": "how suicidality is for me", "social_network": "reddit", "user": "inverted_cyclone", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1630265476, "permalink": "/r/SuicideWatch/comments/pe1ykr/how_suicidality_is_for_me/", "nsfw": false, "first_save": 1635428001.493868, "replies_charged": false}