{"id": "t5_2qpzs_t3_qh1g77", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "*Thank you to the moderators of* r/SuicideWatch *for allowing me to post here!* \n\nI am part of a team of researchers at New York State Psychiatric Institute/Columbia University who are currently recruiting participants for a research study looking at an investigational treatment for self-injury called transcranial direct current stimulation, or tDCS. tDCS is a non-invasive, well-tolerated form of brain stimulation that delivers a low current to a specific area of the brain using electrodes. Research has shown that tDCS can help reduce negative emotions and may help treat depression and other conditions.\n\nWe are seeking individuals between the ages of 18-65 who self-injure (through burning, cutting, or other means). Eligible participants should be staying/living within 60 minutes travel distance of Manhattan (New York, NY, USA) to participate. The study involves completing a baseline psychological assessment, questionnaires and twelve sessions of tDCS during six visits over two weeks. This is a double-blind trial, so you may be randomly assigned to receive an active or an inactive form of tDCS. All research procedures can be done from your own home–no in-person visits are required.\n\nThree months of treatment visits with a psychiatrist for medication management will then be offered after AT NO COST to you. Compensation of $150 is provided for time and effort if you are eligible and complete all research procedures.\n\nThe researchers on this team have no conflicts of interest to declare. All study procedures have been approved by the Institutional Review Board for New York State Psychiatric Institute.\n\nSome details about confidentiality and the use of your personal information:\n\n\\*If you consent to participate in this research, your personal information will be kept confidential and will not be released without your written permission except as described in this section or as required by law. Your name or other identifying information will not be made known if the results of this study are published for scientific purposes.\\*\n\n\\*To make your personal research results not identifiable with you if they are used for publication in the scientific literature and presentation at scientific meetings, we will remove all your identifying information, including name and date of birth.\\*\n\n\\*Questionnaire answers and data collected during the task may be used in future studies, and if shared with other investigators, information that identifies the scan, questionnaire responses, or task data with you will be removed beforehand. There is a potential risk of loss of confidentiality from such data sharing, but this is extremely low as only de-identified data from this study may be shared.\\*\n\n\\*Clinical records, including your name and other personal identifying information, and research data will be kept in secure storage at the New York State Psychiatric Institute. Information in paper format will be kept in locked files. Electronic data will be protected by a firewall (programming that makes it virtually impossible to access the data from outside the New York State Psychiatric Institute) and by restricting access within the New York State Psychiatric Institute through use of a password known only to authorized personnel. If information is transmitted electronically, it will be encrypted so that your identifying information remains confidential\\*\n\n\\*Records will be available to research staff, and to Federal, State, and Institutional regulatory personnel (who may review records as part of routine audits). Your information will also be available to other authorized individuals, including those at the New York State Psychiatric Institute. There are also legal advocacy organizations that have the authority under New York State law to have access to otherwise confidential subject records, although they cannot disclose this information without your consent.\\*\n\nIf you are interested, please contact Ashley at 646-774-7529, or at ashley.yttredahl@nyspi.columbia.edu. More information is also available at https://tdcsresearch.wordpress.com/.\n\nThank you for your time!", "url": "https://www.reddit.com/r/SuicideWatch/comments/qh1g77/treating_selfinjury_through_research_study/", "title": "Treating Self-Injury through Research Study", "social_network": "reddit", "user": "tDCS-NSSI-Research", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1635354549, "permalink": "/r/SuicideWatch/comments/qh1g77/treating_selfinjury_through_research_study/", "nsfw": false, "first_save": 1635427931.3436604, "replies_charged": false}