{"id": "t5_2qpzs_t3_q2xfk0", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I started writing tonight because I have been having boughts of suicidal ideation on and off for a month now, and depending how things continue I may throw in the towel. Hopefully I do not finish writing it or post here again, but I want to share a line I wrote:\n\n\"But if weeks or months go by and I still feel as wretched as I have for the last thirteen years, well, I will abandon hope in the folk platitude that 'it gets better.'\"\n\nFor context, I had a failed suicide attempt in my teens. I have been through a handful of medication attempts (bipolar) and therapy. There's been good times of course, and years where things weren't as dark, but I'm just so tired of fighting. I'm going broke paying for private care (U.S.A.) because it's damn near impossible to get decent care through insurance means. But even paying for higher quality providers still doesn't really improve my quality of life all that much.\n\nBased on past experiences trying to get help when suicidal, I know what \"getting help\" looks like. It helps, but the burden of fighting to survive is still my own and one I carry everyday. I'm well educated about care, and I've tried to be a role model for younger folk who need that push to accept a mood disorder diagnosis and pursue treatment. But I feel deceitful, as here I am at this place all the same. It's worth trying because some people do get better, but I don't feel like one of those people.\n\nThanks for listening, I just needed to get it out of my head at the moment. I'm going to try and make it to 2022 and hope new things distract me from death, but we'll see. Take care of yourselves, fellow redditors.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q2xfk0/i_started_writing_a_suicide_note/", "title": "I started writing a suicide note.", "social_network": "reddit", "user": "Pimpin_Took", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1633566979, "permalink": "/r/SuicideWatch/comments/q2xfk0/i_started_writing_a_suicide_note/", "nsfw": false, "first_save": 1635427654.386569, "replies_charged": false}