{"id": "t5_2qpzs_t3_folpx8", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "Hello, I have pretty much suicidal in recent years and apparently I can't tell anyone (it's about my personality) so under disguise I want to say a few words and get some advice. First I wanna let you know what my story is like.\n\nI'm a guy in mid twenties, back in my childhood I raised away from my family before elementary school. Those days pretty nightmarish because I need to endure a pretty abusive household verbally and mentally. My parents didn't know a shit about parenting so it was also difficult to reach them out plus whatever I say they don't even considered still to this day. My father is a careless men so I paid the price time to time before because of his indecisiveness and naivety. My mother on the other hand short tempered and pretty much liar if she benefits from it. They didn't even considered breakup so you can imagine what type of household I had.\n\nSo lack on adult guidence I became pretty much introvert thus leads to bullying in school. I hold my ground with breaking ties with anyone so it stopped. But the price I paid is deep friendship which I yearned for even now. Before puberty I hospitalized because of a rare disease. It caused scarring my body it's mentally discomforting. I interested in philosophy in puberty and it got me into more darker side of existence. Truly became aware of your surroundings in depth is terrifying. Because you know you'll never get what you want and you slowly felt alienation from society. Like I can't even find a person which holds same values with me, mathematically there's certainly exist but it's a tiring adventure especially when you don't have the energy within you. \n\nI'm non religious so holding something religious or playing a dice not for me. I lost hope besides feel alienated from current society. It disgusts me. There's nothing left to to do for me. I had peoples around me and somewhat had relationship etc. But I never revealed my heart. I never trusted anyone enough to reveal my true thoughts and emotions. It's exhausting. Not to mention out of all my relationship, I always cheated on. I understand I'm not the personality they thought to have but they don't even care about dignity or respect. So trust issues added on. I can reveal these things because I'm a stranger on the internet but revealing those things irl like saying punch me where it hurts. I think human nature is devilish to begin with I'm not exception either. Only thing matters to me to this day is philosophy of morality. Yet current society seems like bend morals according to their own agenda and ego so I feel like out of place. It's just piling up and up to where I can't stand to this mental pressure and yearn for ending this cursed existence & consciousness. \n\nI'll be honest I want only one thing to begin with, someone sharing same values with me and understand me, there's no need to be perfection. Because perfection itself is an utopic idea. I want to fell in love with someone friends and adventurer of life, side by side to the end. Whom I can reveal my true self without holding back, whom I can truly care and trust. Alas I feel like watching world from the bottom of a pit. It's like be a part of it or conserve your dignity and ideas. Btw I had professional help regarding this. I always against direct drug abuse of body to wash away thoughs. Thoughs only beaten by logic and experiences in my book. Considering possibilities, either way we'll die. But being on this sorrowful journey pretty much unnecessary, even if you endure all you do is pretending and left your parts of yourself here and there. Can you even call yourself to be true to yourself in the end of the day.\n\nYou know it's like being growing up. While you're child you're energetic, innocent, optimistic and when you've grown up you lost it all. Or like being in love for first time and being in love 100th time. Do you can say you can hold 100th person special to you as 1st time? It's just sad for you and to that person. Bright to dark. You lost yourself in this journey. There's only coping and chopping yourself. It's even more terrifying considering the death itself. Maybe I commit suicide maybe not. I'm just bragging about my thoughts.", "url": "https://www.reddit.com/r/SuicideWatch/comments/folpx8/what_to_do/", "title": "what to do?", "social_network": "reddit", "user": "Ther-Sha", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1585118801, "permalink": "/r/SuicideWatch/comments/folpx8/what_to_do/", "nsfw": false, "first_save": 1635426682.2621477, "replies_charged": false}