{"id": "t5_2qpzs_t3_q0bpmk", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I'm so lost. I've been a depressed loser the majority of my life. Shitty friends. Shitty family. Blah blah blah. I've been horribly depressed since I was about 14-15. Well I'm 20 now. Last month I had a heart attack. After 2 weeks recovering and having a load of tests done they know whats going on.\n\nCongestive heart failure.\n\nTurns out I was born with a heart defect due to my parents being very old when I was born. (dad 51 mom 48) My condition was worsened because of an inhaler I use for my asthma. I was ignoring symptoms for 2 years because I thought they were attributed to my asthma and me smoking. Stupid I know but when you are as low as me mood wise you kind of say \"fuck it\" to everything and at least I could look forward to cigarettes in my day to day misery.\n\nI have 3 years of comfortable life left. 5 years of total life left if I'm really lucky. 5 fucking years. No possibility of transplant due to a very low chance of success because of an immune disorder I have.\n\nI'm 20 and in a couple years I will be bedridden. Couple more I'll be dead. You always think that these types of things will be an awakening and that you'll breathe a second wind into your life and everything will be peachy. \n\nBut I feel terrible. I have wasted my life being miserable and I feel awful about it. The problems in my life will not improve in less than five years. I'm fucked. Wasted life. I'm completely fucked.\n\nI will never have a girlfriend. I'll never start a family. I'll never buy my own home and fill it with things I love, and people I love. I'll never get to see the world (never left my hometown). I will never get out of this rut. \n\nIt's funny I've spent all this time wishing to be dead and here I am. My wish has been granted. \n\nAnd I couldn't feel worse.\n\nTake me as a cautionary tale or whatever the fuck. Live your life I guess.\n\nThe only plan I have now is to kill myself before this wretched curse gets to me.\n\n&#x200B;\n\nGood luck to you all, seems like luck is all that matters in the end.\n\n\\~N", "url": "https://www.reddit.com/r/SuicideWatch/comments/q0bpmk/the_worst_hand/", "title": "The worst hand.", "social_network": "reddit", "user": "PhifeDwg", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1633239915, "permalink": "/r/SuicideWatch/comments/q0bpmk/the_worst_hand/", "nsfw": false, "first_save": 1635427640.574291, "replies_charged": false}