{"id": "t5_2qpzs_t3_q2larh", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "I have been utterly destroyed by someone’s true colors.\n\nSo I posted a since deleted post on r/relationshipadvice a few weeks ago talking about how I got really close to a friend over the span of a year, we confessed our feelings, and me telling them I wasn’t ready for a relationship at the moment, but willing to get to know them more and seeing how we felt later on. As time went on I found myself falling for this person, but I still didn’t feel ready to be in a relationship despite them really pushing for it. Around the time we had confessed our feelings, I fell into the worst depression I ever have. I had a massive, massive falling out with a friend, a drunk driver totaled my car and almost killed me, and I got fired from my job due to lack of transportation. The insurance company fucked me over too. It’s been a super stressful time. Being so depressed, I really wanted to fix myself and tried seeking therapy. I visited a psychiatrist and got diagnosed with severe depression and anxiety, and my psychiatrist obviously recommended I see a therapist. The problem was that I couldn’t afford online options and all of the therapists in my city are fully booked until next year, so I relied on buying books and other means I researched online to try and move forward. At least for the time being. \n\nDuring this, they tried to dash through a relationship, asking me to move in with them, talking about marriage and children, and mentioning a life plan they wanted me to follow. They love bombed me, said I was the love of their life, and would constantly talk about how I was the person that they would marry. They couldn’t go a second without telling me they loved me, how much they appreciated me, the works. This was a month in. It was a lot of pressure. I mentioned slowing down, which would work sometimes, but not always. I ignored the red flags because love makes you do really stupid things. One day, out of curiosity, I asked them how they felt about breaks, and they said that if I ever asked for one they would “fuck anyone as soon as I even asked for it.”  Another thing was that I vented my frustrations to this person, but they seemed annoyed whenever I would feel upset. I was always there to hear out their problems, offer solutions, and just be present. It was never a problem to me, I was falling harder and harder for this person every day so I had no issue with helping. I was just glad to be there. But sadly, when it came to me and the stuff I was dealing with, there was always some sort of hesitation, they would claim to not be able to help due to not knowing what to do in these situations, and kind of went MIA. Sometimes it was for hours, other times it was for days.\n\nThis led to a crisis of sorts, where me feeling unprepared for a relationship plus the lack of feedback led me to post there. After posting, pretty much all the comments told me that I should talk to this person and express that I wasn’t ready for what they wanted, and that we should talk it out and see how we would progress. Judging by the title, you probably figured out it went as well as trying to give someone a haircut with a chainsaw. About a week ago, I tried calling them. After a few days of attempting, they finally responded, and I tried expressing some thoughts, but they were busy, so they told me to text what I had to say. I didn’t really like this, since texting causes a lot of misunderstandings, but I gave it a shot. I told them the pressure was really overwhelming and I wasn’t really feeling reciprocation, so I needed some time to sort myself out. I made it clear that I really cared for them and loved them deeply, but I couldn’t keep up with what they wanted so I needed to take a break. They said they understood and that it was for the best. In a mess of tears and frustration, I went to sleep.\n\nFast forward to a few days later, I felt pretty terrible, and I felt like I expressed myself poorly through text, so I asked if I could call them. They said yes. I called and tried voicing my thoughts more clearly. I started crying since I was feeling regretful and selfish over asking for a break. I told them that I was only doing this because I did not want to be a burden or a constant source of negativity, and I asked them if they could wait for me since I really wanted to make things work. They responded to this by laughing at me, asking me if I was “fucking kidding them,” and calling me ridiculous. They belittled me and patronized me, sarcastically agreeing to what I was saying and laughing at my crying pleas. They also said that they refused to deal with their own problems and then have to deal with mine too, that I should just suck it up instead of sinking myself, and that I should fuck off and never contact them again. Then they blocked me everywhere. Mind you, this person was claiming to love me unconditionally a week and a half ago. This complete 180 has done a massive number on my head. I feel betrayed, confused, humiliated, and heartbroken. The person I met before doesn’t really exist, and I really don’t know how to take this. I had to throw my car keys into my backyard yesterday because I was seriously considering doing something very, very stupid to myself. I called the suicide hotline twice and they didn’t really help much. My family and friends were unresponsive, so I locked myself in my room to prevent further harm to myself. I feel so played. I can’t stop thinking nor dreaming about this. I’m having a manic episode and I’m really trying to keep it together. The point I’m trying to make with all of this is that I’d appreciate some advice and help on how to progress from here, since I really do not want to harm myself. I know I didn’t do anything wrong here, but I feel like the world’s biggest piece of shit for suggesting that stupid break in the first place. The thought of them being sleeping around because I wanted them to wait for me while I got help is completely unbearable to me. What the hell do I do? I seriously just need someone to talk to. I apologize if I sound like a manic mess, I’m having a massive meltdown and I don’t know where to turn.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q2larh/i_really_need_help_and_someone_to_talk_to/", "title": "I really need help and someone to talk to.", "social_network": "reddit", "user": "Tongazo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1633529569, "permalink": "/r/SuicideWatch/comments/q2larh/i_really_need_help_and_someone_to_talk_to/", "nsfw": false, "first_save": 1635426159.7568686, "replies_charged": false}