{"id": "t5_2qpzs_t3_kcymo9", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "During my suicidal crises, I've usually felt extreme mental pain and anxiety. I've been genuinely afraid of death and everything that would comes after. I've been scared and so sorry for my loved ones who I'd leave behind. Now, however, after two months of surviving one day at a time with depression and constant suicidality clouding my vision and driving me into confusion, I woke up today feeling crystal clear. I feel no anxiety whatsoever, almost normal or even happy. The death wishes that had been haunting me for ages don't really cause any negative emotions in me anymore. I've sort of accepted my imminent suicide as a fact and I can't bring myself to be sorry or afraid anymore.\n\nI've attempted suicide before and have been traumatised by my attempts, so I know brutal and violent it can really be. But still, I'm not afraid, and this is probably the first time I've felt this okay about it.\n\nI used to be a fighter. I used to tell myself I'll survive this no matter what, but now it's just as if my destiny had just revealed itself to me and I've finally made peace with it. This feeling is really freaky. I almost feel warm in my heart, not necessarily because of my pain ending sooner or later but for coming to terms with everything that's going to happen.\n\nThe reason I'm writing this is mainly the confusion I'm feeling due to the sudden shift of my emotions. I wonder what caused this, I honestly have no idea. Nothing in particular triggered this, it just sort of happened.\n\nBefore, I could never understand people who were able to say goodbyes to their loved ones in advance and write a suicide note. The pain of knowing they'd grieve for me always made even thinking about it so painful for me. But now I do. Maybe they've made peace with their death just like I have.\n\nThis is liberating, I must say. There's of course still a part of me that tries to argue and stay, but for the most part, I feel... free. And all of this makes me question if this is the point where I'm finally losing my mind.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kcymo9/ive_made_peace_with_death_im_not_afraid_or_sorry/", "title": "I've made peace with death. I'm not afraid or sorry anymore.", "social_network": "reddit", "user": "emrldeyes", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1607956122, "permalink": "/r/SuicideWatch/comments/kcymo9/ive_made_peace_with_death_im_not_afraid_or_sorry/", "nsfw": false, "first_save": 1635426220.2753713, "replies_charged": false}