{"id": "t5_2qpzs_t3_hf0hnn", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "I wrote this note because I know that eventually I’ll kill myself. A few months ago, someone I knew only slightly went missing one day and she left a suicide note, and it got me thinking about how I should be prepared. **I don’t plan to do it anytime soon**, but I know that some day, unless I get hit by a car or something unexpected, I’ll kill myself. In it I’ve mentioned the recurring problems I’ve had that I think I can expect to continue bothering me. I’m confident that I’d turn to drugs (like I have in the past) before killing myself, so I assumed that I’d be using around the time of my death. I’m making drawings on the backs of the pages because I’m an artist and I want to leave something pleasant and meaningful behind. \n\nI just want to know if there’s anything I should change. Every day I’m trying not to kill myself and I’m getting help and have been for years. Think of this as harm reduction for my family, just for when it finally happens.\n\n**Anyway, here’s the note:**\n\nI’m sorry. It’s all just too difficult. Without the drugs, without the highs—I can’t do this. And with the drugs, there are the inevitable comedowns, which, I have found, always outweigh the highs. So either way, I come to the same conclusion: I can’t do this. But it’s not much I’m missing. I wasn’t going to be anything great. Or at least, I would never feel like anything great. And if nothing good reaches me—if chronic despondency and cynicism will always get the best of me and continue to filter out any payoff of my misery—then why waste the effort? No matter what would have happened in my life, had I kept living, I would have become numb to it with time and retracted back into my default melancholy. Everything always falls flat—that is my experience. Excitement simply doesn’t last for me, and the world is just so incredibly dull in my eyes. Life is monstrously ugly and unremarkable.\n\nFor some time, I didn’t think I’d be the type to leave a note. I’m impulsive. I always thought that one day I’d just be over it all and I’d down some pills or cut an artery, and maybe scribble down a goodbye real quick, while bleeding or vomiting all over the paper. I thought it would pain me too much to think about my life and death within my last few hours of living, much less to write about it all. But I’m a writer, and I figured it would be heedless and selfish to leave nothing behind. So I wrote this ahead of time. (I’m sorry for any erroneous, vague, or inconsistent language.)\n\nI’ve known this would happen for a while now, I just didn’t know when. But I always knew one thing for sure: I could never let someone or something else claim my life. It’s mine, so I get to end it. I don’t feel that my life was given to me as a sort of gift; rather, it was imposed upon me. I was given this weird, demanding vessel of flesh to experience the universe through, and so much of my time and effort has gone into taking care of this stupid ugly thing that we call a “body.” And on top of this tedious maintenance, other expectations must be met, and I feel the need to not only meet but exceed each one of these expectations. It’s exhausting. Call me selfish or ungrateful, but that’s how I feel, and I don’t care who knows or who sees this. I’m dead.\n\nPut me in a box that is just big enough for my body—one that will quickly disintegrate, and do not embalm me. I refuse to be another ostentatious corpse in a stupid metal box clogging up the Earth with its selfish, arrogant body, leaking poison into the groundwater. I will decompose and there is no way around it. To slow or mask the process would be stupid. I should be no different than a bird who died and simply became a part of the Earth again.\n\nDon’t be misled by the nature of my death—life can be a beautiful thing. But beauty and happiness are not and have never been one in the same. When I was ten, it dawned on me that a life of great length would be meaningless if it meant happiness would have to be compromised. I wrote it on a piece of paper and put it in a locket I had. I meant to keep it until I died, but you know me—I lose things—so here’s this instead. I had used the word “love,” not “happiness,” but the utilitarian sentiment was there. And I’m doubtful that I have much left to experience that will be worth the painful waiting—the spaces in between the sporadic moments of contentment and excitement; the spaces between the hope. Those quintessential moments have become increasingly transient, and I don’t believe it would be reasonable to expect a comeback.\n\nThroughout my life, I’ve been travelling through “mindscapes,” as I call them—the different periods of my life. I visualize them, like landscapes. They can be comfortable, or they can be strange and unsettling, but sometimes, it seems that each new one is more horrible than the last, and life feels like a series of diminishing returns. I often find myself longing for the past, however miserable it may have been, and however well I may be doing at the moment. Comfortable familiarity seems to always be just out of reach. I’ve been in an incredibly unpleasant mindscape lately. I’m in no man’s land again, and this time, I’ve been gunned down. Life has always been a delicate thing, and it’s finally shattered, but at least I didn’t waste away slowly like so many do.\n\nSince I was very young, I’ve felt terribly out of place. I often felt that I didn’t fit anywhere in this world. And maybe I don’t. I’ve seen terrible things, not because of external circumstances, but because I have an immutable tendency to inflict pain upon myself. I’ve seen crippling fear and hopelessness, unbearable comedowns, and my own darting eyes. Age sixteen was infested with shadow rats and waking nightmares and utter confusion. There’s little joy left. I’m filled with malaise every second that my body remains in operation. I want to forget everything.\n\nI hate who I am, and it’s not like the hatred I would feel for another person. Sure, I’m horrendously ugly and burdensome, but more than that, I hate myself because I know myself too well. I’m devoid of mystique in my eyes. I hate my face, my voice, my body, my name, and my mind, not necessarily because they’re bad, but because they’re mine. I’m tired of them all. I can’t live with myself any longer because it feels like there’s something intrinsically bad about who I am.\n\nAnd the music—it would never be enough. There’s no need for secondhand regret, because I know for a fact that nothing is ever near as great as it seems, and unfortunately, the reverse of that is far from true. Things can be just as horrible as they appear. In fact, they can be far worse. Addiction is so much more harrowing than I could ever have imagined. Depression is tolerable, until it isn’t anymore. Try and blame me for wondering why the hell I should decide to continue living when every day I’m struck at least twice by a profound, seemingly incessant sadness, a sadness that is immune to ideal circumstances. In the morning I run to try to catch up, to make up for my sheer laziness and incompetence, but there’s never enough time, and never enough drive. So I have to take out loans. And that comes in the form of drugs. I borrow happiness. I repay the universe periodically through the comedowns, but I fail to keep up with the payments—I always fall short. I rack up debt, and that debt must be paid in the form of withdrawals. And the best way to avoid debt is to die. So that’s what I did.\n\nI am truly sorry to put you through this. I just couldn’t continue. Everyone becomes disillusioned with time, and some experience it far sooner than others, and some are particularly tortured by it. I can’t compartmentalize. I can’t realize something profound and then just ignore it and continue living as though nothing has shifted within me. It’s too much. Life just isn’t for everyone. There are some people (like me) who have lost the capacity to appreciate things. I’m unresponsive.\n\nI cannot speak to any of you directly here, because I think that would be too painful for all of us. I don’t want to haunt you. I waited. I waited for years because I didn’t want any of you to feel like I could’ve been something, like I missed out on some grandiose opportunity. If someone doesn’t have some meaningful direction by my age, what more can they really do? I’ve always wanted to die young. I don’t want to grow old and tired and stagnant. You know I love you. I don’t need to tell you that, but I will. I love you. I love you so much. All of you. You know who you are. But I’m too grotesque and sad and addicted to keep on living. I am sincerely sorry for any trauma I have caused you. I just can’t think straight. I can’t get anything to make sense. My head is screwed on all wrong, and I just want to cut it off—revoke my brainstem.\n\nAnd I beg you, please don’t cling to the memories. Nostalgia is and has always been nothing more than a terrible trap. Don’t dwell on the past, because you’ll only find yourself longing for something you can never have. And please know that there’s nothing you could have done. Your lives must go on. When a person really wants to die, he or she will find a way. I doubt you could have stopped me. You are all doing your best. Be stoic (in the philosophical sense, not the colloquial sense) and know that I died content. There won’t be a comedown for me this time. No crash, and no withdrawals. And I can assure you that comedowns and withdrawals are far worse than death. So suffer on your own behalf, not on mine. I was doomed to this from the beginning. There is no free will, and there is no changing your fate. So fucking live. Experience things. Don’t bother buying more time for yourself if you don’t intend to do anything valuable with it. There’s nothing left for me, but the rest of you still have a place in the world. I was bound to off myself sooner or later. If you thought otherwise, you were dead wrong. How long could someone like me really be strong? If you can, be happy for me. I’m okay now. I’m forever incapable of suffering. I’m done chasing and I’m done waiting. I love you. Goodbye.\n\nEdit: changed some things because they were stupid :)", "url": "https://www.reddit.com/r/SuicideWatch/comments/hf0hnn/should_i_change_my_note_grammatical_pedantry_is/", "title": "Should I change my note? (Grammatical pedantry is welcome.)", "social_network": "reddit", "user": "Ipits", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 20, "down_vote": 0, "creation": 1593003190, "permalink": "/r/SuicideWatch/comments/hf0hnn/should_i_change_my_note_grammatical_pedantry_is/", "nsfw": false, "first_save": 1635427524.0966167, "replies_charged": false}