{"id": "t5_2qpzs_t3_l5ulah", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "The subject matter addresses the following question:\n \"Why Is Self-forgiveness Important For Self-Esteem?\"\nIf self-esteem was a boat used to sail on the ocean of life in, then the inability to forgive oneself could be considered to have the effect of a hole in the hull. A perpetual guilty conscience could produce too much weight for the boat of self-esteem to remain afloat. Self-defeating behaviors significantly increase the chances of drowning in the turbulent waters of life. It's easy to become lost as waves of uncertainty can disorient us until we lose our way and become adrift at sea. It's not always easy to realize how detrimental states of despair and hopelessness can be in these vast oceans. We all make mistakes, but the majority of the holes in our boats are patchable if we learn how to identify and locate the holes before they cause us to become overwhelmed and sink. Self-forgiveness is a critical patch repair kit that every boat should carry in its maintenance and survival gear.\nI believe it's imperative to understand exactly what self-esteem is in the more literal/less metaphorical sense, so I'll begin with that objective first and foremost. To me, self-esteem is confidence in my ability to create the life I want to live and to understand that we are each entitled to find and experience true happiness in our lives. It's like an opinion we have in and of ourselves. The problem for me personally is that I find that the opinions of others can have a corrosive effect upon my own. I developed a self-defeating behavior of putting too much emphasis on what other people think about me and/or fallacies of inaccurate judgment and synthetic/artificial compassion. Many toxic people capitalize on their ability to falsely exalt themselves to levels of delusional superiority by manipulating and corrupting the self-esteem of others who deceive themselves into believing that they ARE less and deserve less than what they otherwise actually are and do. This discontent feeds the gears of insecurity and anxiety which leads to dissatisfaction as my confidence progressively evaporates. I tend to isolate myself more as I feel like an outcast in exile that no one could ever truly love, respect, understand, or care about. Drug and alcohol abuse eventually seemed like temporary (yet semi-effective) patches to fill the holes with, but I generally never stop applying them which inevitably causes my boat to sink while submerging myself in depression, self-pity, and a desire for self-destruction. It gets to the point where I'd sell the lifeboats and the life preservers for more patches that wind up being counterproductive and contradict my initial intentions via unrealistic expectations. Before long, any sensations of positive affirmations become scarce and I find nothing left to feel a sense of pride or accomplishment in. I become comfortable in the misery as it is the only familiar constant I have left to rely on. I have been known to further delude myself by failing to see any potential way back from chaotic oblivion and lonely desolation as I push absolutely every single nurturing person away from me in fits of self-disgust and repulsion.\nThe second factor in the question this essay focuses on is self forgiveness, so it would probably be helpful for me to list some supplemental information that pertains to it. In order to forgive oneself, I believe it is paramount to FULLY accept oneself including character flaws, shortcomings, and an understanding that human nature itself is imperfect. I have personally deduced that it will be truly impossible to live a life in recovery if I refuse to take the initiative and responsibility to forgive myself regardless of what ANYONE else thinks about it. Coming to terms with my failures in the past is a crucial first step in moving forward. Indefinitely condemning myself would be similar to making an otherwise curable disease fatal by refusing to adequately treat it. I really am my own worst enemy when I'm not taking care of myself mentally, physically, spiritually, and emotionally.\nSo I guess this becomes a question of \"How can I forgive myself?\" I honestly believe it first comes down to KNOWING myself and deciding to NOT run from the unpleasant truths. It's also important to use logic, reason, and rationality in order to see what's there to be seen. After all, dirty mirrors often only reflect inaccurate images of who we really are and how we see ourselves. I've discovered that keeping a list of strengths and weaknesses helps to keep the dust, dirt, and funk out of myself analysis. I've learned that journaling is also an excellent method for defining who I am on a daily basis. It is through this practice that I am able to reestablish values that I've forgotten about. I intend to restore myself back into respecting and upholding these virtues as they will provide a solid foundation for me to build upon. I believe this is the true nature and definition of the concept of \"rehabilitation\" whereas before the best words I could conjure up were \"a desire to not fail the same way over and over again and again\". I've learned the differences between self neglecting, self-excusing, self-punishing, and self-forgiving recently and how each are dependent upon the levels of my self-esteem and my values. I now see that the only mistake that anyone has ever really hypothetically made is failing to learn from a mistake (generally speaking of course).\nIn conclusion, self-forgiveness is important to self esteem because of the values one must define (or remember) and then choose to use for restoration purposes. This should generate an inspirational momentum that internal motivation can be derived from. Establishing peace with the past opens the door for future confidence to thrive in, so it's clearly a transitional process that also seems to promote mutually beneficial and reciprocated growth from. I think the hardest part is finding one past mistake to focus on first while indicating the abandoned values associated with that event. It is also very important to prevent rumination from disrupting the order of the cycle of forgiveness.\nThey say that \"to err is human and to forgive is divine\", but I personally feel that the phrase SHOULD say \"to err is human and to forgive and FORGET is divine\". The \"forgetting\" part has historically always been difficult, problematic, and controversial for me throughout the past until a  semi-relevant epiphany helped me to achieve a detectable measure of clarity in this endeavor after a period of self-reflection and serious contemplation. I am going to wrap this essay up with that epiphany  for dramatic effect. \" When we have an infected limb that can't be saved or salvaged that would otherwise cause harm or even death to the healthy body it's attached to if left unaddressed, we don't cut off the body and save the infected limb - we cut off the infected limb and save the body. \"Not forgiving yourself is the equivalence of saving the severed, infected limb.\n[Originally Written On 6-14-2020]", "url": "https://www.reddit.com/r/SuicideWatch/comments/l5ulah/why_is_selfforgiveness_important_for_selfesteem/", "title": "Why is Self-forgiveness important for Self-Esteem?", "social_network": "reddit", "user": "Kamforthepeople", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1611715953, "permalink": "/r/SuicideWatch/comments/l5ulah/why_is_selfforgiveness_important_for_selfesteem/", "nsfw": false, "first_save": 1635428048.4798331, "replies_charged": false}