{"id": "t5_2qpzs_t3_prfwx4", "request": ["fa52eed9-681b-4f68-b3d1-78c0eec9a3d2"], "text": "I think this might be my last attempt at reaching out online, as it’s becoming more and more clear to me that my struggles are not entirely unique or even that important to anyone. And why should they be? I’m not anyone special, I haven’t contributed anything to our society (not that I really want to because it’s so god-awful).\nI’m just a tiny blip in this world.\n\nBut my feelings are huge, and my struggles are real, and it makes every day more and more difficult to wake up to. So this is my last try on Reddit, to find some sort of advice or since of direction so I can find the strength to keep going.\n\nI’m so poor, and my skills limit me to working customer service jobs, which are draining on my mental health and don’t pay nearly enough to sustain myself on. I don’t have a car of my own or anyway to get around on my own. I’m stuck in a shitty roach-infested apartment that costs way more than it’s worth. The owners aren’t doing shit about the bugs, but I’ll be leaving this place soon anyway.\n\nI’m in a relationship with someone I never wanted to be with, and being with him is so draining, but I would have absolutely nothing without him now. (He’s not abusive we just aren’t working out) I have no friends of my own, and very few people I can rely on, all of whom are in no position to help me.\n\nI feel like if I stay, I’ll die, but if I try to leave, I’ll loose the few things I actually have. If I could get out of here and get started again on my own, knowing I could support myself I would have already. \n\nIt feels like my only way out now is to die.\nMy dreams feel so far away, and unreachable. I really feel like I never had a chance. \n\nCan anyone give me any advice? Anything that can help me? I’ve never needed help this much before.", "url": "https://www.reddit.com/r/SuicideWatch/comments/prfwx4/i_feel_stuck_useless_and_like_id_be_better_off/", "title": "I feel stuck, useless, and like I’d be better off dead. Please someone help me!", "social_network": "reddit", "user": "ChocolateGrouchy", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1632083649, "permalink": "/r/SuicideWatch/comments/prfwx4/i_feel_stuck_useless_and_like_id_be_better_off/", "nsfw": false, "first_save": 1635425461.7073884, "replies_charged": false}