{"id": "t5_2qpzs_t3_nqeoug", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "I'm in a lot of physical and emotional pain that will inevitably only get worse and death is all the hope I have.\n\nI have accepted this quite some time ago, the idea that if it got too bad I could voluntarily cease to exist when things got unbearable provided me with some solace. But now that I really want out even that little solace is gone, since now that I have to actually come through with it comes the thoughts about just how badly this will affect those closest to me.\n\nIf you've read this far you might want some details and I need to share this burden with someone so here it goes.\n\nI'm the only son of my mentally ill mom, although I have brothers on my 76yo father's side they aren't close to my parents and so it was expected of me to take care of my father in his old age and of my sick mother after he most likely passes first. This might not seem so important but I have a young cat that I love very much. \n\nNow to my situation.\nI'm a crippling depressed 25 yo male. During the pandemics I've lost my job, my apartment, my girlfriend, my best friend and to add a cherry on top my hair(I can't help but to laugh writing this). I have bad scoliosis, frequent migraines, insomnia and kinda voluntarily am an alcoholic. I've been to a fuck ton of doctors, psychiatrists and therapists and while it helped it things continue to get worse.\n\nI can honestly say I've tried my best to complete burn out a few times now. I did the whole shebang. I went to 3 different colleges(never finished), went consistently to the gym, started  2 \"long term\" relationships, a \"career\" and a few different friend groups with each new place I went to. And I was fucking miserable through it all and ended back on my ass starting from scratch 3 times. I can be sociable but I fucking hate everyone's bullshit, mine included. And I don't have it in me to try again, I just want to put my head in a bag and turn on the helium. But my mom dad and 😺 will be fucked if I'm not here. So my diseased ass either goes through with it and dooms them or suffers for 30 more years in this pathetic reality.\n\nI'm sorry for whomever has read all this, venting is of course cathartic although it doesn't changes things\n\nEdit: forgot to add that I've had to sell my car so my broke ass now has to take an Uber or a buss everywhere and also that I live in Brazil this is there on top with the worst of my situation, what a fucking shithole this place is", "url": "https://www.reddit.com/r/SuicideWatch/comments/nqeoug/i_am_terrified_of_the_fact_that_i_cant_die/", "title": "I am terrified of the fact that I can't die without destroying the lives that depend on me", "social_network": "reddit", "user": "lovelygrumpy", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 143, "down_vote": 0, "creation": 1622613147, "permalink": "/r/SuicideWatch/comments/nqeoug/i_am_terrified_of_the_fact_that_i_cant_die/", "nsfw": false, "first_save": 1635426574.6784606, "replies_charged": false}