{"id": "t5_2qpzs_t3_lpyb3g", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "For the past ten years, since I was thirteen, I’ve been depressed off and on, with suicidal thoughts coming and going. \n\nSometimes they were intense, and sometimes they were fleeting, just passing by.\n\nBut recently, things have changed. My anxiety is more overwhelming, and i can’t stop myself from having a depressive episode on almost a daily basis. Suicidal ideation used to be all hypothetical to me. But joking about suicide pacts with friends has turned into browsing for handguns online at work. I can’t tell you how painful it is to hear one customer after another ask “how are you?” And I, like a robot, tell them I’m “fine.” Sometimes I say I’m “good!” Enthusiastically to appear more normal. But nobody knows what lies below the surface.\n\n\nMy friends are clearly tired of hearing about my issues. When things get bad I tend to send a flurry of emotionally charged messages, and it’s exhausting. I don’t blame them, it sucks living like this, and it’s a downer to hear about. \n\nThe worse everything gets, the more I feel like it’s not even worth trying to get better. I jerk off because I’m lonely, then I feel ashamed and depressed after. I get no enjoyment out of my hobbies anymore. I hate my job, and my career prospects are shit. I’m too insecure to pursue the women I like, so they end up with other men and then I hate myself more and validate those insecurities in my fucked up head. \n\nI know I’ll never be happy, because I know trying to get better is a painful process, and not guaranteed to even work. \n\nWhat hope is there? \n\nHope is the most addictive drug. I fucking hate it. And I hate myself too. I don’t know what to do", "url": "https://www.reddit.com/r/SuicideWatch/comments/lpyb3g/i_just_have_a_question_about_what_im_feeling/", "title": "I just have a question about what I’m feeling", "social_network": "reddit", "user": "Fresh-Fix", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1614024208, "permalink": "/r/SuicideWatch/comments/lpyb3g/i_just_have_a_question_about_what_im_feeling/", "nsfw": false, "first_save": 1635427702.5295515, "replies_charged": false}