{"id": "t5_2qpzs_t3_qcdv51", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351"], "text": "Preface, I grew up in a really unhealthy, abusive, family and I've been dealing with the mental repercussions of their actions. I moved across America to the west coast to get away and grow and change, but I realize how poor I am now living here. I was in therapy for like 8 yrs and I've been out for a little over a year and I feel like I'm losing it and slowing turning into my parents and I'm constantly analyzing myself and try to grow and improve, but it just seems like there's no point and I will be constantly fighting myself because I don't want to hurt people. I've been doing well for a while, but today I got so angry I told my boyfriend that I wanted to punch him in the face. I didn't and wouldn't, but I could feel that rage boiling in me and after I calmed down I address what I had said and I didn't know whether or not to explain myself because I can't tell if I was expressing myself at that point or if I was trying to manipulate him and say sorry and then he would forgive me and move on until it happened again. He's not a fighter he doesn't really ever yell, he's so kind to me and love me, but I can't tell if I'm growing and changing in a positive or negative way. \n\nNot to mention I have dreams about having sex with my parents because of my molestation as a child, I have student loan debt I can't afford, a family who wants nothing to do with me because I don't want to be like them (not just family unit, but also extended family), my parents try to pin my younger sibling against me, and the sexual assaulte from multiple people.\n\nI'm having trouble finding hope, I feel like I'm a bad person anyway, and living with this anxiety and depression and whatever else just doesn't seem worth it. I feel guilty for even expressing these feelings because I feel like I'm just having a pity party and I'm selfish for even feeling bad in the first place. Idk, I just need someone to talk to or to help me understand or whatever. I want to don't want to kill myself, but I don't see anyone why out.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qcdv51/help/", "title": "Help", "social_network": "reddit", "user": "Fuzzy_feelings9", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1634772246, "permalink": "/r/SuicideWatch/comments/qcdv51/help/", "nsfw": false, "first_save": 1635423174.464369, "replies_charged": false}