{"id": "t5_2qpzs_t3_q8mgxg", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "Hello. Are there any ex-efilists or ex-promortalists or someone with similar experience that I can talk to?\n\nI fell down the promortalist rabbithole a couple of years ago. It's a philosophy that claims life is not worth living.\n\nOnline, I have seen antelopes with their guts hanging out and still trying to run, I have seen a wildebeest with it's leg hanging by a thread and it's still trying to fight.\n\nI have seen a man skin a tanuki alive. I have seen man pull fur off a rabbit while it squeaks in pain.  I have seen a fawn pulled from a conscious deer's uterus and eaten by a komodo dragon.\n\nI have seen all kinds of human depravity. Bestiality, paedophilia, pro-rape propaganda. I have watched people be tortured too (it is my understanding that these are acted) and read graphic descriptions of all this fear and pain and sickness.\n\nThis is largely thanks to these life-hating philosophies and their spread of such gruesome material.\n\nI don't want that to happen to me. I am terrified.  I want a way to understand this pain. I'm afraid that I never will understand , and that I only have two options; help others and suffer, or die.\n\nI do not want to sacrifice myself to help others. I am too afraid of being hurt. I am afraid that death is my only escape from this pain and there is not happiness worth living for.\n\nI want to know if there is a better way, a reasonable, rational response to this pain. I want to know if there's anything worth living for.\n\nWhere are other people that have this problem? I don't see other people acknowledge that this pain exists, only the efilists and promortalists.\n\nIs there anybody that has seen this pain but but found a better way? Once you believe philosophically that life is not worth living is there another way?\n\nEDIT: If you still believe life isn't worth living. Please don't comment.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q8mgxg/exefilist_expromortalist_looking_for_help/", "title": "Ex-Efilist, ex-promortalist looking for help", "social_network": "reddit", "user": "OC-alert", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1634297285, "permalink": "/r/SuicideWatch/comments/q8mgxg/exefilist_expromortalist_looking_for_help/", "nsfw": false, "first_save": 1635428184.9888704, "replies_charged": false}