{"id": "t5_2qpzs_t3_qd78me", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8", "86cc7700-ca86-40f7-89bb-4e4c46de1b41", "929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I've dealt with depression since I was 12, but now I'm in my early 30s and my mental health is rapidly deteriorating. I fear most of my life I've been misdiagnosed as depressed when I'm actually rapid cycling type II bipolar depressive. Multiple times a week, something will trigger me into either an angry or deeply depressive state, or anger that leads into extreme depression and cyclical ruminations about rational or irrational things. Like if my boss says something that irritates me, my brain will just start cyclically thinking and making myself more and more upset/angry until I have no control and I have to literally focus to stop the ruminations. This will go on for hours until I'm literally rocking back and forth like the crazy people i used to point out on the street to my wife and make rude remarks to myself. \n\nI have a ridiculous amount of stress. I'm working on a doctorate. Wife is working on a doctorate. We have a 17 month old. She does literally nothing around the house but help take care of the kid. I have to 1) do dishes, 2) the laundry, 3) all the cleaning, 4) trash duty, 5) take care of these 4 fucking cats I didnt want (I only wanted 2), 6) driving her places cause she refuses to drive or take initiative to get her car working again, the list goes on and on. We have no help, no child care ( cant afford ), no family nearby that she will allow to help. My dad's gonna drop dead any minute cause he's an opiate addict and my mom is going senile or something, her faculties are quickly leaving her and she can't even remember basic things and is constantly pissing off my wife, which results in 30+ minute long bash fests that I have to just sit and take.\n\nI have no help, I'm fucking crushed by the weight of these responsibilities. She talks to and treats me like she doesn't care about me, but she says otherwise. I told her I feel needed and not wanted, needed in the sense that she makes no money and is unable or unwilling to do any of her own shit or help with the chores. She used to help but as soon as we got married, that all went down the fucking toilet. No sex life. Think we've had sex maybe 5 times in 17 months since we had the kid? I cant even get a hand job or a kiss. Half the time she hasn't brushed her teeth until like after I've gone to work. She leaves trash everywhere and tells me if there were trash cans with bags in them that she'd use them (she says this on the occasion I haven't replaced the bag, even though there are bags right next to the can, she cant be bothered to do it herself).\n\nNow it's just me, and my bipolar or whatever the fuck this is. the lamictal initially felt like I had my life back for the first time in forever ,and now it isn't doing fucking anything 2 weeks later. What a crock of shit getting a glimpse at happiness was for once and then having it ripped away. \n\nAdditionally, I'm so dependent on cannabis to deal with all the stress and to try and turn my brain off that I can barely even get medicated by it anymore, and now I fear I'm developing cannabis hyperemesis syndrome. I have a an esophageal ulcer, gastritis, esophagitis, a hiatal hernia, all of which have not really responded to treatment. The meds I have to take to kill the stomach acid make my fucking guts hurt. \n\nI'm tired of all the anger, the hurt, the emotional instability, the exhausting episodes of ruminations/cycling. I worry that my sweet sweet innocent son is going to absorb my mental illness and that the safest way to ensure that he isn't ruined by me is to end it.\n\nConsidering methods and the research shows hanging has a very high lethality rating compared to some other methods. The helium in a bag over the head method is also tempting. \n\nIt's just been years, numerous different medications, doctors, couples counselors, therapists. Nothing helps. I'm just fucked up. Barely had the energy or desire to even type this out and don't even know why I did really.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qd78me/dont_know_whats_happening_to_me/", "title": "Dont know what's happening to me", "social_network": "reddit", "user": "FitTheme2963", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1634869443, "permalink": "/r/SuicideWatch/comments/qd78me/dont_know_whats_happening_to_me/", "nsfw": false, "first_save": 1635426857.6344118, "replies_charged": false}