{"id": "t5_2qpzs_t3_p4v2rt", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "Hi I live in Malaysia, I'm 18yo going to be 19yo this coming November. I have two sister, one is 20yo another is 22yo. \n\nI have just graduated from high school and my mother is asking me to help pay for rent, I don't have any skill I have only just started learning to code whereas both my sister had a few year break and is playing games 24/7 even right now they are playing. Although one is studying biomedical whenever she have free time is just games. My parents doesn't have much money left and we r just barely getting by but my parents continue to buy useless/ unnecessary snack, coffee etc. Also my mother likes to waste water by cleaning the floor multiple times with just only water (OCD) not soap even when I have already clean it. I have also already told them many many times (throughout 11 - 18yo) to not buy any more snack, and have told my mother that washing with water does not really clean the area and also told my sister to help out with the chores at least. But my effort is all for nothing, I have only added extra stress in my life.\n\nIs it wrong to think that this is unfair or am I being in the wrong here? Because when I'm telling my sister to learn some skill instead of playing games they get defensive and started to argue with me. I didn't force them to learn I'm just telling them that they should learn something instead of playing games whole day\n\nMy parents father 60+yo, mother 50+yo both have not work for a really long time. I won't and can't tell them to work because they r my parents, and I'm still living under their roof \n\nI have already gave up telling them what to do, because of this I have learned that you can't actually tell people what to do if they not willing to listen, and change. \n\nI'm In constant stress, my parents doesn't allow me to work because of Covid. So instead while I still have roof under my head I'm doing everything I can to learn the necessary coding skill / graphic design so I can start working. \n\nWhen I was younger I told my mother I will help with the rent but that was a year ago I didn't really think that through, my mistake on my part. Now my mother is guilt tripping me to pay for the rent. I'm using my allowance and am also out of cash ( shouldn't even be called allowance since I'm technically returning the money )\n\nBecause of this stress, I'm also constantly thinking why do so many people have a child when they are not financially stable or mentally prepared to be a parent. What do people expect when they have a child? Isn't it just a cycle, baby, adolescent, teenager > go college, young adult > start working, old adult > retired and have a child. Then cycle repeats again and again. In my case my parent want me to continue the family name.\n\nWhat would your advice be?\nAm I being a spoiled child?\n\nNote: My parents is loving but to me they r not ready to be a parent. ( They always argue, talk about money in front of me and my sister, not telling my sister to do any chore. Etc ). I don't have any driving license and my parents are also quite strict I quite embarrassed to say this but I cant ride on a public bus without their permission first. I had my Covid shot but parent still won't let me work outside.My sister is not helping to pay rent, I can't tell them what to do because they will go defensive and we will be in an argument again\n\n\nDon't have to sugar coat your answer, I'm also writing  here so that I can improve on myself. Thank you all for reading", "url": "https://www.reddit.com/r/SuicideWatch/comments/p4v2rt/asian_parents_is_guilt_tripping_me_on_paying/", "title": "Asian parents is guilt tripping me on paying their rent.18yo in need of guidance", "social_network": "reddit", "user": "Maxwell6181", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 17, "down_vote": 0, "creation": 1629039717, "permalink": "/r/SuicideWatch/comments/p4v2rt/asian_parents_is_guilt_tripping_me_on_paying/", "nsfw": false, "first_save": 1635426176.209123, "replies_charged": false}