{"id": "t5_2qpzs_t3_ealazq", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "It's been a really rough couple of months, hah. I go through waves of severity in my depression but for some reason the one I just went through was the strongest yet. \n\nI've dealt with mental illness for the majority of my life, starting with depression and bulimia, turning into self mutilation in recent months. While I don't regret it and still think it was best for my mental health, breaking up with my ex boyfriend a couple months definitely left me the most isolated I've been in a while,  and my mind hasn't always been the best only company. \n\n It's kind of weird not wanting to die. I attempted in two different ways, one of which was known to be relatively painless. I remember looking forward to it so much. Like I could finally escape all of this. But recently that desire has been feeling far more distant. Not that I suddenly have this strong will to live, but more so that I just dont feel like dying. I gave myself nerve damage with some of my self harm. It hurts most days but it's also a reminder that what I've gone through was real, as unhealthy as that kind of physical reminder is. \n\nRecently I'll look at how badly mutilated and scarred my body is and wonder how I'll ever move past this, emotionally or physically. I still wonder that. I think that's why I still keep the bottle in my room. I don't know why I haven't gotten rid of it but, although I feel like I'm past my worst moments it's still a comfort to have. Like an emergency escape button, hah. But I know I'm not going to use it. At least not for a while. \n\nI'm glad to be past through the worst of it all. I don't know why I posted this but it feels nice to get out. Thank you to anyone who happened to read this far 💛 I hope you all are bearing as best you can, and that we all find something to smile about today :)", "url": "https://www.reddit.com/r/SuicideWatch/comments/ealazq/got_through_two_attempts_dont_have_anyone_else_to/", "title": "Got through two attempts. Don't have anyone else to share the news with so here I am !", "social_network": "reddit", "user": "binarize", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 14, "down_vote": 0, "creation": 1576338799, "permalink": "/r/SuicideWatch/comments/ealazq/got_through_two_attempts_dont_have_anyone_else_to/", "nsfw": false, "first_save": 1635422946.1588454, "replies_charged": false}