{"id": "t5_2qpzs_t3_q1oh6x", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "I’m getting to the point of my life where I’m scared to grow up and live an adult life. I’m so scared because there are so many responsibilities at hand. I’m so scared about making enough money to support myself. And I kept thinking about this ever since I got in an argument with my mom over dinner about internships next year. My brother says I should be happy to have an internship in something I like (writing), but I took an internship this summer and had such a bad experience that I’m scared that my whole life will be like that. I’m so scared that like the internship I won’t have any time to myself, I’ll be depressed and frustrated, trapped in a job that I hate with a boss who is hard on me. Don’t get me wrong, in a way I’m glad I took the internship this summer, but it made me realize that I don’t want to live my life feeling the way I did at that internship. But I’m scared that once money comes into play, I won’t have a choice. \n\nAnd this night made me wonder why I was born. Why the fuck was I adopted? Why am I laying in this bed right now, typing this? Why am I alive? I don’t deserve to be because I am just another face out of a billion. \n\nI know this sounds dramatic and childish, but I am so scared to move on with my life and I wish I could just stop time and live in the past where I was happy and didn’t have to worry about being an adult.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q1oh6x/ive_never_been_suicidal_but_right_now_im_having/", "title": "I’ve never been suicidal, but right now I’m having an existential crisis", "social_network": "reddit", "user": "Low_PygmyPuff", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1633412859, "permalink": "/r/SuicideWatch/comments/q1oh6x/ive_never_been_suicidal_but_right_now_im_having/", "nsfw": false, "first_save": 1635426131.2919493, "replies_charged": false}