{"id": "t5_2qpzs_t3_mjpz8a", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "Who here can say that they still have hope for tommorow?\n\nA tommorow were you get to wake up next to someone you love, someone that loves and cares for you no matter how much you hate yourself.\n\nA tommorow where you can wake up and not dread the responsibilities of life, like work, school, socialization and the like.\n\nA tommorow spent in the company of friends and family, where you spend hours together making eachother laugh and smile.\n\nA tommorow where everything is ok. Not perfect, just ok.\n\nBecause I sure dont.\n\nI know tommorow, Ill wake up next to an empty bottle of bourbon, no love, just melancholy \n\nI know tommorow, Ill think of any excuse to stay home from work, to not go out and socialize, or even leave my room for that matter\n\nI know tommorow, my friends will be busy getting on with their own lives, and my family will only push me further into isolation. Every single gathering, im left with common pleasantries, and neglect from even my own parents.\n\nThere's nothing for me tommorow, nothing but an empty bottle, and twenty years of repressed emotion, mental trauma, an inability to take joy in company.\n\nI try desperately to cling onto some twisted fever dream of a life were I've won, were I've abondoned everyone and carved out my own path. I dream of a house that isnt falling apart around me, with a wife and children of my own. \n\nI so horribly want to stay in this dream, to never have to worry about the next time I have to deal with family, or will myself out of bed to be productive. Why cant I just never wake up?\n\nI just dont have hope for tommorow.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mjpz8a/who_here_still_has_hope/", "title": "Who here still has Hope?", "social_network": "reddit", "user": "No-Regerts88", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1617514400, "permalink": "/r/SuicideWatch/comments/mjpz8a/who_here_still_has_hope/", "nsfw": false, "first_save": 1635427516.4019723, "replies_charged": false}