{"id": "t5_2qpzs_t3_pg58lx", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42", "5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "Hi.\n\n\nTitle pretty much sums it up. Been suffering from severe depression/anxiety for 15+ years, but my depression and anxiety has increased so much over the past 2 years that I started to self harm in early 2020 and have almost constant, intense suicidal ideations. I've started to distance myself from my parents and coworkers, have ceased all contact with extended family, and avoid all contact with the outside world as I can no longer stand being around people.\n\n\nI can't talk to my therapist because she is a mandated reporter.\n\n\nI can't talk to my family because they don't care.\n\n\nI can't talk to my friends because I don't have any.\n\n\nI can't call a hotline because I will have the police called on me and they're a waste of time anyway.\n\n\nI've been hospitalized twice so far- one voluntary, one involuntary. Neither were beneficial. In my area even *mentioning* that you have suicidal ideations is enough to have the police called on you. Doesn't matter if I say I'm safe, will not act on any plans, etc.\n\n\nI **do not** want to be hospitalized again.\n\n\nI've tried/looked into the following, but for whatever reason they have not been viable:\n\n* \"Being mindful\"\n* Exercise/yoga/meditating\n* Breathing exercises\n* IOP programs (would have to leave job if I enrolled, can't afford to do that)\n* A myriad of medications\n* Snapping a rubber band on my wrist, drawing on myself with a red marker, etc.\n* Trying out new hobbies/getting a 2nd job to keep my mind occupied\n\n\nI just want to sit down with someone and get to the root cause of my thoughts.\n\n\nI have no idea what to do at this point and, tbh, my plans are starting to look more and more appealing everyday. I'm really struggling with everyday life and work. I'm so fucking tired of fighting this.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pg58lx/i_want_to_talk_about_my_suicidal_thoughts_but/", "title": "I want to talk about my suicidal thoughts but don't want to be hospitalized.", "social_network": "reddit", "user": "throwittothedogs21", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 162, "down_vote": 0, "creation": 1630537216, "permalink": "/r/SuicideWatch/comments/pg58lx/i_want_to_talk_about_my_suicidal_thoughts_but/", "nsfw": false, "first_save": 1635427297.129141, "replies_charged": false}