{"id": "t5_2qpzs_t3_f9hhwp", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I’m a 24 year old woman who has suffered with various mental illnesses since a very young age. I’ve been abused and neglected as a child, which led to my developing borderline personality disorder, major depression, cptsd with panic attacks, bulimia, a compulsive skin picking disorder and a self harm addiction.\n\nMy current situation is complicated but to summarize I had to leave my job last fall due to a suicide attempt. After leaving the hospital I sought outpatient treatment but had to put that aside because my fiancé’s agoraphobia advanced to the point where he can no longer leave the apartment for any reason at all. As a result neither of us is employed, and I’m working with the state and SSI to hopefully receive benefits to help us while we are both struggling mentally . I am afraid of coming off as a lazy free-loader but I genuinely am unable go function as a normal adult should.\n\nWe’re under threat of eviction and our electric being turned off. There are multiple elements to the situation that are making receiving public assistance nearly impossible for us. I’m losing my sense of hope and any desire to be alive I once had seems gone. I am afraid that I will hurt myself, but I have too many responsibilities right now to leave everything to go to the hospital. I’m not sure what to do, all I know is I’m trapped between having to stay strong and handle things for us or going away to try to get better.", "url": "https://www.reddit.com/r/SuicideWatch/comments/f9hhwp/struggling_to_decide_what_to_do/", "title": "Struggling to decide what to do.", "social_network": "reddit", "user": "bbrandneww", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1582665830, "permalink": "/r/SuicideWatch/comments/f9hhwp/struggling_to_decide_what_to_do/", "nsfw": false, "first_save": 1635422950.549758, "replies_charged": false}