{"id": "t5_2qpzs_t3_lmoqbi", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I'm sorry, I don't really know what I'm doing, just expressing my feelings at midnight I guess, I'm sorry to anyone who doesn't care. To start off I'm 15 years old. I never share my feelings with anyone and I kinda need to piece this together for my own sanity. I have this feeling inside of me that starts off as what I can imagine as a dark hole ferociously sucking my organs up like a vacuum then I just get really upset and have a headache and feel numb in my body. When I was 7 my parents divorced, which I don't resent because there was a lot of conflict in my home before that. The divorce was ugly too because my dad got with a girl that he is dating now the night before they broke up. Anyway fast forward to 2017 and my mum is in a car accident which leaves her unable to work, with constant migraines and a lot of heavy-duty prescription painkillers. She also gets with a lot of ass hole deadbeat guys in the meantime that just drain our relationship and her willpower. I stay at my dads and mums pretty equally at this time but I don't enjoy staying at my dad's house because his girlfriend because she does things to make me feel worthless and I'd attribute a lot of my social anxiety and idk just more reasons why i hate myself to this period.  Meanwhile, due to my mum not being able to work we had pretty much no money and rarely ever had food for like 2 years. Also sorry i cant remember everything i feel really shit rn and wish i could just go to sleep and not wake up, I think I'm just too much of a pussy to cut my wrists deep. I have tried to od on pills and cutting and stuff but that's later in the story. After that, my mum starts selling drugs for which i do not blame her she was really down in the dumps, but our relationship started to deteriorate and at the time i couldn't comprehend why but i later found out she was on crystal meth. Once i found a bag of meth in my room from apparently when my uncle put in there but idk he also stole $20000 and my mums laptop for a gambling problem too and I had to go over there and talk to him about it. My mum also started dating a bank robber, who in all honesty was really nice to me, he never did anything wrong by me but my mum and him fought and idk you couldn't really trust him. I forgot to mention but i think i have been woken up by about 4 police raids at this time. fast forward to midway through 2020 and at this point I'm staying at my mums full time because i couldn't take the metal trauma of being with my dads girlfriend at his house and they also had a baby so i was even more of an outside now. Anyway,  I'm in the shower getting ready for school and the police raid my house and my mum is taken outside with a couple of people that were staying at my house because she let them i don't know why but its something to do with meth. A officer watches me get dressed and I slip my knife into my pants when he isn't looking because it is illegal so i got to get it out of the house, when i am outside one of them says should we search the kid. luckily, another one says no such and such just watched him get dressed that was a very scary moment in my life. I say goodbye to my mum and don't even get to kiss her goodbye. She is taken to prison and i haven't seen her since. She is the one person in this world who i can remotely talk to, and I've seen her at her lowest lows wanting to end it all. I really fucking miss my mum. For about a month i stayed at my mums house by myself depressed as fuck that's when i tried to kill myself. Now i have to stay at my dads and whenever his girlfriend i don't know how to explain it and i don't know the word i just get really really upset and listen to my mums favourite songs thinking of her and cry and it really kills me for the whole night that's what happened tonight. These last few months have been the darkest periods of my life. The mental trauma of being at my dads is 100x worse than any of the physical trauma or deep fear of police i have now. Im nearly a straight A student and i go to the gym frequently because its where i can feel that i have a purpose but staying her as an outsider with all of my memories makes me not want to be in this world. Im sorry that my story is not merely as bad as most others but i needed to clear my head. I have probably also left things out but this is my raw thoughts that i have never shared with anyone. no one knows any of these things have happened to me, no one knows my mum is in jail except my close family. I go to school everyday with a straight face like everything is fine, but its not, i don't know how to explain this feeling but its eating away at my organs. Goodbye kind stranger.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lmoqbi/i_dont_wanna_be_me_anymore/", "title": "i dont wanna be me anymore", "social_network": "reddit", "user": "take_me_to_the_void", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1613660680, "permalink": "/r/SuicideWatch/comments/lmoqbi/i_dont_wanna_be_me_anymore/", "nsfw": false, "first_save": 1635426217.7050288, "replies_charged": false}