{"id": "t5_2qpzs_t3_nnsbv7", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42"], "text": "Around 7 months ago, I found websites and forums that promised penis size increase and attempted to do these techniques and failed horribly. I have lost so much sensitivity for no reason. Everywhere on my penis has arounf 10% sensitivity left and my scrotum's sensitivity is almost all gone aswell. Morning wood is super soft, erections are super soft. I'm only 19 and damaged my penis for life. I'm heading to the doctors next friday, but read all on the internet that nerve damage is permanent. In the last 7 months there have been zero improvement in my penis. I can't sleep anymore and can't tell anyone in my life because this is so embarrassing. I've dropped all my college classes except one and failed that class. This has taken a mental toll in my life and I don't think I can continue any longer. The first time I went to the doctors, they just gave me cialis, if they do it again I think I'm done with life. I can't continue life like this, every time I pee, take a shower, wake up with a weak erection, every time I walk I get reminded with the lack of sensations from my groin, I get reminded that I fucked everything up due to my insecurities. I have shut myself off from the world in the last 7 months. I just stay in bed all day or watch this livestreamer xqc which helps me forget until he ends stream.  I went dead silent in my friend's groupchat ever since this happened, I can't just pop in like I have havent been gone for little over half a year.\n\nI know some will say \"you're an idiot for doing this\" and you are correct. I wasn't even small, I'm 6 in long with 4.3 in girth . But how can I feel good about my size when I was hit all my life with that I have a small penis stereotype because I am an asian american. The first time I was hit with that stereotype was in 5th grade I remember that girl that said I didn't have a penis because i was asian. That terrified 9 or 10 year old me. Yeah and of course i get hit that stereotype in middle school as well with more stuff like I eat dog and what not. Flash forward to highschool, I'm in the football locker room with my teammates, went to take a piss at the urinals, my douche of a teammate stares at my dick while pissing says I have a pencil dick and tells my other teammates and make more racist jokes. Now flash forward to college during the corona virus shit. Asians getting blamed and shit, I was filling up my gas and this dude yells at me \"these small dicked asians ruin everything\". I can't say shit except \"shut the fuck up bitch\". Later stumbled upon penis enlargement exercises and gave myself nerve damage. Your penis is fine they way it is, if it gets hard thats all you need. You shouldn't be turned down by a life partner over your penis size. I've dated 3 girls and none of them complained. I should have felt satisfied from that. If a girl denies you for your size, you dodged a massive bullet, a missile maybe.\n\nIf you are self concious about your size, please do not do what I did it's not worth it at all.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nnsbv7/suicidal_thoughts_after_i_gave_myself_permanent/", "title": "Suicidal Thoughts after I gave myself permanent nerve damage in my penis.", "social_network": "reddit", "user": "Plastic_Grape84", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 621, "down_vote": 0, "creation": 1622309742, "permalink": "/r/SuicideWatch/comments/nnsbv7/suicidal_thoughts_after_i_gave_myself_permanent/", "nsfw": false, "first_save": 1635427336.0617456, "replies_charged": false}