{"id": "t5_2qpzs_t3_mooobe", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "\\*Just in advance, this might be triggering\\* I am a 27 year old female and have struggled with mental health issues for many years now. In some ways I feel like a lost cause - I have had so much therapy over the years (counselling, CBT, group therapy, self help books) yet always end up back in a place of feeling suicidal and wanting to end my life. It's so exhausting and draining.\n\nI find it hard to plan for my future because I just don't see myself being here for it. I am very indecisive about a career - I have a degree, but my mental health I feel has set me back and I struggle to know exactly what path to take and struggle to find the confidence to pursue it. This is because I had a job straight out of University that destroyed my mental health, and ever since I have been in \"comfortable\" jobs that are not something I want a career in. \n\nI struggle with romantic relationships, I was really hurt a couple of years ago by someone who lead me on for months and told people a lot of lies about me, and it has destroyed my faith in finding anyone - even a couple of years later when I feel I should be \"over it\" I just cannot see myself trusting men again, and I cannot plan my future because I don't see myself living that long. I have only had one relationship that lasted for 6 months, and cannot seem to get over how unhealthy I look at relationships.\n\nEvery single day I wake up feeling suicidal. I plan in my head all the different ways I could do it. I say \"once my dog dies, I'll end it\" because she's been my only source of comfort and love for all these years and she's getting older now. It is so draining just not wanting to be here, feeling like therapy hasn't helped, and with every minor inconvenience having thoughts go to \"I just need to kill myself\". I want to plan for a future and think of a career but at the same time having the \"backup\" plan of killing myself in a way is a source of comfort to cope with the immense pain I feel in my life. I don't really have a question, I just needed to write this out because I feel extremely alone and feel so much pain every single day that it's hard to escape from. I want to live a life that's free of mental illness, I think all the time about people that don't have mental illness and how I wish I could experience that. I want to plan for my future but can't see past 5 years ahead because in my head, I won't be here then.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mooobe/struggle_to_plan_for_my_future/", "title": "Struggle to plan for my future", "social_network": "reddit", "user": "JR2093", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1618137105, "permalink": "/r/SuicideWatch/comments/mooobe/struggle_to_plan_for_my_future/", "nsfw": false, "first_save": 1635426641.199323, "replies_charged": false}