{"id": "t5_2tand_t3_7m82q8_t1_drs2ctf", "creation": 1514303870, "origin": "t5_2tand_t3_7m82q8", "height": 1, "replied_to": "t5_2tand_t3_7m82q8", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SecretSensei", "text": "First of all take it easy on yourself friend. You're 17 years old. Very few people your age have figured out anything significant about life.\nA lot of the things youre dealing with would be best dealt with through a family member or mentor of some kind that can help you get a handle on adapting to the world in an effective way. Even if you don't have some one around like that dont stress it.\nYou can learn from a lot of people simultaneously through studying their behavior, communications style, attitude, body language, etc and seeing how these attributes all add up to your perception of them\n For every situation in your social life or any other aspect there's someone out there who can deal with effectively and with a style that will appeal to you. Seek them out IRL if you know any and if not find the online and get whatever clues you can from them and try to put them to use in your own life. \nThat and ad exercise to your daily activities. Your mind is over active and as youre becoming aware its doing you dis-service. The best way to counter that is exercise. If you can afford to take martial sets classes that's a great way to change your life and learn to control your thoughts. \nYou are not your mind / your intellect, you are over-identifying your self with your mind. Your mind is a part of your self, not your whole self. Learn to develop other parts of yourself, and be easy on yourself in the process. you've got plenty of time to figure it out.\n\nEdit: was with fam when i typed my initial response and meant to include the followong but gpt interupted: everyone has thougts that are fucked up at various times on their lives. It is peoples' attitudes and actions that determine how you are perceived by others. Learn to ask for help from people who you want to learn from and be willing to follow through without excuses when they accept your request and extend themselves in some way to help you. Also be open to help from unexpected places.", "permalink": "/r/DecidingToBeBetter/comments/7m82q8/realized_that_intelligence_has_been_obstructing/drs2ctf/"}