{"id": "t5_2tand_t3_oohykc_t1_h609iix", "creation": 1626877985, "origin": "t5_2tand_t3_oohykc", "height": 1, "replied_to": "t5_2tand_t3_oohykc", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Krakatoast", "text": "I second this\n\nI think part of the issue may be that you feel like you even have an issue at all, overthinking your overthinking so to speak.. I don’t think there’s anything wrong with being almost “paranoid” by modern standards, in fact, I think most people nowadays are insanely careless and unaware of their surroundings/unaware of the risk they expose themselves to. The other day I was with my mom at the grocery store, and this slightly older employee literally walked right into the side of her cart.. how the f**k does someone not even realize they’re walking directly into another object like that(?).\n\nAnyway, I think slowing down and realizing life is really about the journey, the process, it’s about enjoying it at the basic level. We’re all dying, just some faster than others. Most things that people really care about don’t matter, and a lot of what people overlook is actually really essential to life. Example, I got an iPhone12 and whenever people ask me and I tell them, they get all baby eyed and wanna see the phone and “ooooo wow” as if it really matters. It’s a superficial piece of aluminum with some nice components that allow it to operate a couple milliseconds faster, and it has a pretty good camera.. yeah ppl swoon over the shiny car, or house, then pop pills or crack that bottle of wine to get thru the day. “Coffee in the morning and wine at night hehe” yeah basically drugged up all day.. yeah maybe mental health and mindfulness matters more than a shiny piece of metal..\n\nSorry for rambling but basically my advice is to try and be present in the moment. Still mindful of what’s happening and how you’re feeling, but not stuck in your head as much. I think hobbies can help you get out of your head a little bit to enjoy the life that’s happening right in front of you. Friends matter but wanting to be a part of the “cool crowd” or super social is actually exhausting. I grew up as a “nerdy kid” but still had a few good friends. I always wanted to be “popular” so as I got older I did. I socialized more, it sucks, I stopped doing it. Lol. It’s exhausting and most of the bonds seemed so plastic. Just my opinion\n\nEdit: this comment has devolved into a blob. I just wanted to add that being at peace with solitude is an extremely powerful asset. The weakness that comes with needing many people, gives people some leverage over you in that they can withdraw their presence and use that to manipulate you. If you find peace in solitude, you are free to choose who you’re around, and can maintain only the cleanest relationships without having plastic friends to fill a void", "permalink": "/r/DecidingToBeBetter/comments/oohykc/i_dont_know_how_to_have_fun/h609iix/"}