{"id": "t5_2tand_t3_kpz5de_t1_gi13s4a", "creation": 1609730743, "origin": "t5_2tand_t3_kpz5de", "height": 1, "replied_to": "t5_2tand_t3_kpz5de", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Korroboro", "text": "When you were sixteen, you probably thought that if one of the people that knew you best decided that you were worth more as a sex doll than as a daughter –or even a person– then you really are worthless.  \n\nThat was a strong conclusion. It was made very, very seriously. Very emotionally-heavy.  \n\nThis conclusion is excellent, considering it was made by a sixteen-year-old person. It would be unfair to criticize it.  \n\nBut it has been written in stone for too long. You are so tired of it and it doesn’t get you ahead. Your conclusion is now a hindrance.  \n\nFortunately, now you’ve grown. You are not the same as when you were sixteen. You have learned a thing or two.  \n\nIt’s time to replace your conclusion.  \n\nGive yourself the life-changing present of two or three additional valid conclusions about the rape. Being worthless is not the only conclusion that can be derived from it.  \n\nFree yourself from the shackles you inadvertently made.  \n\nSome thoughts are toxic. Concluding and then confirming (and confirming, and confirming) that you are unequivocally worthless harms you repeatedly. You were harmed by the event (or events), but then you harm yourself again every time you repeat and/or confirm your conclusion.  \n\nYou have the power to stop that right now.  \n\nYou were abused. It was not your fault. Even considering the warning bells, it was not your fault at all. Stop demanding clairvoyance from your past self. It’s unfair and harmful.  \n\nNow you know what happened, yes, but give your past self a chance. My guess is that you didn’t know your stepfather would go that far.  \n\nOr you decided to prioritize his reputation and the family’s sanity. That was a mistake. A mistake that I guess you won’t repeat. So yes, you made a big mistake, and that’s fine. The consequence of that mistake is not fine, undoubtedly, but making mistakes is fine. You are a person. You are not perfect. You cannot demand perfection from anyone, specially from an inexperienced sixteen-year-old girl. It’s unfair and harmful.  \n\nYour worth is not related to the rape.  \n\nYour worth is related to learning how not to be suicidal. Your worth is related to exploring and finding ways to make big strides. Celebrate that.  \n\nI hope this helps.", "permalink": "/r/DecidingToBeBetter/comments/kpz5de/how_to_regain_self_worth_after_getting_raped/gi13s4a/"}