{"id": "t5_2tand_t3_au8gn8_t1_eh7yj3e", "creation": 1551064405, "origin": "t5_2tand_t3_au8gn8", "height": 1, "replied_to": "t5_2tand_t3_au8gn8", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mamaandthelittless", "text": "It boils down to a few factors for me. I’ve been going to therapy since early childhood, so I’ve experienced a lot of different types and practices. \n\nWhat’s made her the best for me is the type of therapy practices she uses but also the flexibility. Ive taught myself cognitive behavioral therapy and have used it for years with decent outcomes. I knew i wanted someone who practiced CBT because of that. When i found her, it was because she used CBT but listed several other styles as well. \n\nShe incorporates several types of therapy in our sessions and that flexibility has been the best thing for me. She listened to me talk, discovered what was useful for me, explained acceptance and commitment therapy, and told me why she felt it would be good to use along side my normal CBT.  I had a choice in the matter but trusted her guidance. Best choice ever. So I guess the fact that she was willing to find other things that would work with me based on what I was getting “stuck” on thought work wise, whereas other therapists have had no flexibility. They tell me what to do and that’s that. They do it one way as if we are all designed the same way, with the outcome being the same for everyone. \n\nShe doesn’t feel like a doctor, it feels like I’m going to talk to a friend. Bedside manner is huge to me because she ultimately doesn’t make me feel small. She speaks to me like I know what I’m talking about and we work together, instead of just following instructions. I’ve had many a therapists who make me feel intimidated because they make themselves appear superior and I’ll get nowhere in situations like that. Humor is a huge part of my life so knowing I can joke around in my sessions is a huge relief. \n\nShe also doesn’t try to overanalyze or question what I say. Many therapists do the thing where you say something and they feel there’s something there. They then hone in on it and it feels like I’m having to defend myself and explain why they’re wrong. She just listens, asks simple questions, and we move on. She takes me at my word, so in turn, I feel safe to say what I need to, even if it’s on the darker side. \n\nAnd the biggest difference I’ve found is she doesn’t make me talk a subject to death. I’ve had therapist who find out about certain traumas in my life and that’s the only thing we talk about. No coping skills, no tips and tricks on how to see it differently, just months or years if discussing one topic, as if that topic is the only thing that defines who I am. It made me constantly live in that trauma and because of that, I didn’t get past it for five or six years. She is different in this. She lets me dictate the length and importance of something. She doesn’t make me live in bad times, she lets me see them in a different light and move on. She gives me the freedom and power to deal with the things *I* find to be important and we tweak the problems from those topics together. \n\nSorry, it’s a super wordy and long response but the differences have been astounding and very important for good care. ", "permalink": "/r/DecidingToBeBetter/comments/au8gn8/after_29_years_im_finally_genuinely_happy_and/eh7yj3e/"}