{"id": "t5_2tand_t3_q0zjju_t1_hfbyphv", "creation": 1633339469, "origin": "t5_2tand_t3_q0zjju", "height": 1, "replied_to": "t5_2tand_t3_q0zjju", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ok_Hamster3522", "text": "A question I have is “what are you trying to avoid by going to video games?”  You have a goal in mind: finishing school and perform in your freelance job. You have a long term visa on where you want to be, yet you put that to the side to go to video games, something that is supposed to be fun and entertaining, something that in the end makes you feel even worse. How is that?  How is it that something made to be pleasurable makes us not feel great?\n\nTruth is, there is a feeling you’re likely trying to escape and do so by going to a source of “pleasure.”  It’s a false pleasure in that it’s great in the moment  but doesn’t serve you. You get a urge to go to it from your brain because that’s more exciting and pleasurable than the boring, less desirable work you have to do. In the end those urges you get to go to video games are just urges. It’s just your brain wanting to put you in a state of pleasure from an undesired state (discomfort, boredom, stress,etc.). You don’t need to act on the urge and you can decide whether to follow it or not. It’s completely on your control. It only turns into and action if you decide to act. \n\nNext time you get an urge to go to video games, when it’s not your true intention (e.g. when you’re in the middle of a task), identify what you’re feeling and the thoughts you have. Are you thinking “this is boring” or “I don’t really want to be doing this right now?” These are easy ways for your brain to go after that cheap and easy pleasure. Don’t let it. Let the feeling dwell, recognize it, and just let it sit there. Let it just run in your mind and body, don’t act on it. After about 10 min, the brain gets bored and goes onto something else. These urges may be hard at first to resist, and you may give in. That’s ok, just recognize it and be ready for next time. Over time you’re urges will subside and become far more manageable. Pretty soon the game console will start collect dust instead of your attention. \n\nYou can control yourself, know that. You’re on a good path to your dreams, don’t give that up for a video game that’s obsolete by next year. You’re life and future are far more important. \n\nI hope this serves you, you’re amazing, and I love you.", "permalink": "/r/DecidingToBeBetter/comments/q0zjju/i_want_to_focus_on_things_i_need_to_do_so_i_can/hfbyphv/"}