{"id": "t5_2tand_t3_pc41l7_t1_hahfcey", "creation": 1630017346, "origin": "t5_2tand_t3_pc41l7", "height": 1, "replied_to": "t5_2tand_t3_pc41l7", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "annoellyn", "text": "I mean, it's all relative to what makes you happy. So if you would be happy for the never fifty years just working a shit job and sitting in front of the TV for your spare then there is nothing wrong with that and you absolutely don't need to do anything to achieve more because it wouldn't add anything to your life.\n\nBUT if you want to have the money to do cool shit or have a job that you find meaningful then yes you need to put in work. Hard work.\n\nI'll use myself as an example. I graduated high school, couldn't afford secondary education. Was a manager at McDonald's for 14 years. Felt like shit all the time because I was just on autopilot. Go to work, pay bills, have nothing extra to do anything, repeat. \n\nNow I own my own business and I actually understand what it's like to enjoy your job and be able to do fun, interesting stuff. I have a dog and cats that I couldn't afford before and I love taking my dogs on adventures with me. \n\nNow I'm losing weight and working out not because I feel like I \"have\" to but because I believe I will truly be happier at a healthy weight and will be able to go hiking and camping with my dogs without my extra weight and laziness weighing me down. And I think it's interesting that aspect of it more.\n\nI think there's two sides to \"why do anything because we're going to die\".\n\n1) then what's the point of sticking around. I have struggled with suicidal thoughts in the past\n\n2) your going to die anyway so you can literally do whatever you want because everything is temporary. My coworker was very existentially depressed. He up and quit his job and hitchhiked to Montreal for 3 months with no money. Couch surfed for a while and worked under the table. Came back on a bus. He said he didn't feel afraid or anything because what's the worst that could happen? It's already going to happen.", "permalink": "/r/DecidingToBeBetter/comments/pc41l7/whats_the_point_in_doing_anything/hahfcey/"}