{"id": "t5_2tand_t3_pc41l7_t1_hahs43u", "creation": 1630023264, "origin": "t5_2tand_t3_pc41l7", "height": 1, "replied_to": "t5_2tand_t3_pc41l7", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "sozer-keyse", "text": "We don't know what happens when we die, the only way to know is to well... die. All we know is what being alive is like, you being born was literally you winning a 1 in 200 million odds race, and being alive means you get a chance to have your time in the universe.\n\nSure yes, we are all ultimately little more than specks of dust in the grand scope of things, and not everybody will have a huge impact, but at the end of the day what matters is what a meaningful life means to **you**, no matter how large or small.\n\nAt the end of the day, success is very relative and how it is measured is ultimately up to you. Some people find success in becoming wealthy through getting to the top of their career ladder, others may find success in becoming famous, someone else might find success in making a breakthrough that changes the world, and yet another person may find success merely in helping people change their lives on a smaller scale. Think about what would make you feel personally successful. In the broadest sense, *success is ultimately being able to do what you want to do.*\n\nThings like getting fit, being healthy, increasing your earning potential, putting the effort to improve yourself, etc. are all foundations that improve your quality of life. Being fit and healthy lowers your risk of falling ill, becoming disabled, or dying prematurely. Increasing your earning potential ensures that you will have the money and resources to do the things you want (sure money doesn't directly buy happiness, but it certainly makes it easier to be happy). Having discipline is what keeps you going anyway, because life has its ups and downs and sometimes you will need to just push on through the grim times.\n\nHappiness is not something that you are just handed. If you want to be happy you have to work for it. It's ultimately up to you if you want to do it or not.", "permalink": "/r/DecidingToBeBetter/comments/pc41l7/whats_the_point_in_doing_anything/hahs43u/"}