{"id": "t5_2tand_t3_nwmwjb_t1_h1ap2ru", "creation": 1623342430, "origin": "t5_2tand_t3_nwmwjb", "height": 1, "replied_to": "t5_2tand_t3_nwmwjb", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "YardageSardage", "text": "Here's one way of looking at it:\n\n>`I'm sure I'll take you with pleasure!' the Queen said. 'Twopence a week, and jam every other day.' \n>\n>Alice couldn't help laughing, as she said, `I don't want you to hire *me* -- and I don't care for jam.' \n>\n>`It's very good jam,' said the Queen. \n>\n>`Well, I don't want any _to-day_, at any rate.' \n>\n>`You couldn't have it if you *did* want it,' the Queen said. `The rule is, jam to-morrow and jam yesterday -- but never jam to-day.' \n>\n>`It must come sometimes to \"jam to-day,\"' Alice objected. \n>\n>`No, it can't,' said the Queen. `It's jam every *other* day: to-day isn't any _other_ day, you know.' (*Lewis Carrol - Through the Looking-Glass*)\n\nWhen you think about it, every day you will ever live will be a \"today\". \"Tomorrow\" is a sensible enough concept for planning for the future, but never forget that you can't actually ever live a \"tomorrow\". You will just (presumably) get to live another \"today\". \n\nThis moment right now, as you're reading this post, is \"right now\". Hypothetically, unless you suddenly keel over and die for some reason, you're going to get more \"right now\"s later. But those are hypothetical. Those aren't promised or guaranteed. They're not, in this moment, *real*. The only time that exists right now is... right now. And it's here, in your hands. You're living it.\n\n>\"Yesterday is history. Tomorrow is a mystery. But today is a gift...That's why it's called 'the present'.\" (Master Oogway, *Kung Fu Panda*)\n\nEvery season in nature has something beautiful about it, from the beauty of spring flowers, to blue silummer skies, to autumn colors and smells and crisp, shining winter nights. But you'll never see the beauty of the season you're in if you're too busy worrying about when the next season will arrive. What's beautiful around you right now? What can you see, and smell, and feel? What are you grateful for here and now? What makes this moment of existing worth existing in?\n\nLook around yourself. What do you have, today? What exists that makes you happy? What actions do you want to take? What have you been waiting for? **Why not do it right now?** Seriously, what's standing in your way? Is there something that you need to do first, or think you need to do? Does it bring up some kind of emotions, like fear or sadness or regret? What would it be like, if you decided to be bold, right now as you're thinking about it, and just... do it? Do it anyway? See what happens? \n\nTo me, that's what the concept of \"seize the day\" or \"live in the moment\" is all about. Look around you. Here and now, you are alive. Stop waiting for tomorrow to bring you happiness. Stop giving tomorrow so much of your thoughts and energy. If you don't live *today*, ___when___ will you live? Today is *it*! This is all life is! Today, and today, and today!\n\nHere's one more way of looking at it:\n\n>Time is like wax, dripping from a candle flame. In the moment, it is molten and falling, with the capability to transform into any shape. Then the moment passes, and the wax hits the tabletop, and solidifies into the shape it will always be. It becomes the past, a solid, single record of what happened, still holding in its wild curves and contours the potential of every shape it could have held.\n>\n>It is impossible, no matter how blessed you are by luck or the government or some remote, invisible deity gently steering your life with hands made of moonlight and wind, it is impossible not to feel a little sad looking at that bit of wax, that bit of the past. It is impossible not to think of all the wild forms that wax now will never take. ...\n>\n>... But then you remember, I remember, that we are even now in another bit of molten wax. We are in a moment and it is still falling, still volatile, and we will never be anywhere else. We will always be in that most dangerous, most exciting, most possible time of all: the now, where we never can know what shape the next moment will take.\n>\n>Stay tuned for... well, let's just find out together, shall we?\" (*Joseph Fink, \"Welcome to Night Vale\"*)", "permalink": "/r/DecidingToBeBetter/comments/nwmwjb/what_does_seize_the_day_mean_to_you/h1ap2ru/"}