{"id": "t5_2tand_t3_pxvmn2_t1_het4s2u", "creation": 1632972506, "origin": "t5_2tand_t3_pxvmn2", "height": 1, "replied_to": "t5_2tand_t3_pxvmn2", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MolassesSubstantial1", "text": "I think one of the biggest things on the road to self-forgiveness is an understanding our our childhood and trauma and our triggers. Not as a means to provide excuses for our behaviors, but as a means of introspection and understanding our motivations, tendencies, and tactics for emotional blockage.\n\nI'm not sure what exactly you're trying to forgive yourself for. You say you are the only person you hurt throughout your entire life was yourself. I would argue that, regardless of the circumstances, you are not fully responsible for the hurt throughout your life. Of course, other people aren't responsible for the hurt in your life either (depending on the context). Hurt/Pain/Trauma is simply an inevitable experience in life. Perhaps you blame yourself for not protecting yourself from pain. Well, you can't change the past but you can use your past experiences and behaviors to inform your actions and thoughts in the future.\n\nWhile I think writing entries in gratitude journals is great for putting things into perspective and improving mood, I do think that can also be a way for us to distract ourselves from addressing the root of the negative thought and triggers that re-emerge in our lives. You seem to be desperately grasping for some sense of control over your emotions and are unable to achieve the sense of control you desire in your life. I'm pointing this out not to make you feel shittier about yourself, but to highlight that perhaps you have an overwhelming need for control in your life, especially in your emotional state (as many people do) that you should look more into (i.e. where does this need for control come from? Do you feel like you can't rely on others? Do you feel more motivated when you feel worse about yourself (aka do you thrive off of self-hate) ? Are you angry at yourself for trusting someone who eventually betrayed your trust? What will happen if you don't impose all of these controlling pressures on your life? Are your mechanisms for establishing control also driving your anxiety? Is there a feedback cycle being created here?). You establish mechanisms that give you the illusion of control: deadlines for achieving emotional goals, fixation on certain behaviors (such as exercise), and taking responsibility for things that aren't necessarily in your control (that's doesn't mean their in someone else's control either, I'm just highlighting that life is frustratingly uncontrollable and an effort to control it too much is met with anxiety).\n\nThere's not one solution to your problem, there is only introspection, which will lead to some clarity about why you feel this immense pressure in your life. Sit down with yourself and have a conversation with every aspect of yourself. Your child mind, your teenage mind, you adult mind. What were each of these individuals biggest fears and worries? what were their greatest motivations? Ask yourself the really hard questions, ones that you have been avoiding. If you can, I would suggest doing this using a professional as a backboard. A therapist can really help guide you towards emotional clarity in your life.", "permalink": "/r/DecidingToBeBetter/comments/pxvmn2/advice_on_self_forgiveness/het4s2u/"}