{"id": "t5_2tand_t3_b5oao3_t1_ejjqd5n", "creation": 1553743080, "origin": "t5_2tand_t3_b5oao3", "height": 1, "replied_to": "t5_2tand_t3_b5oao3", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "FEARTHEND", "text": "You sound a lot like me at your age. Here's my story: My boredom with crappy lower class jobs and living for the weekend resulted in taking open studies at university. I was always a bad student but I had nothing to lose other than a few grand and a lot to gain in finding a new direction. I started in business/marketing, switched to psychological and sociology. What I promised myself is that I wouldn't chase money or a specific career, I would just do what made me happy and held my interest. Sociology ended up being so interesting to me that I got straight A's and I was able to completely reevaluated my abilities/intelligence as an unintended consequence!-cool. What I learned about myself was that I was born on at least 2nd base and didn't fully appreciate that others living in my city weren't. So this changed my perspective from worrying broadly about my uncertain future to a more proactive question, \"how can I use my fortunate position as a able-bodied, educated, white, male etc. to raise up others, rather than take part in a system that continues to make people more unequal?\" Because I'm always going to be more proud of myself for helping others than acquiring toys like a shiny new Mercedes. As a note, when I was a teen my dad took me for a ride in his new Mercedes convertable. I commented on what a smooth ride it was and he said \"I don't know if I like it. Everyone keeps looking at me like I'm an asshole.\" So just be happy. If you choose the material life you'll likely just kiss ass, work long hours and evoke jealousy fueled disgust. Also, you sound smart enough to know that all rich people ever want is More. There's rarely a satisfying finish line, only taking more and more for granted. Btw, I'm now a support worker in a group home for the developmentally disabled. They're like family and it's not like work at all unless you hate laundry, dishes, cooking etc. So I just love and take care of people and then go home to love and take care of my wife and dog. No divide between professional and personal. Just me- and because I'm so happy I have more discipline at the gym because I don't feel worn down and I eat well because I don't have to eat my feelings. That's my wealth.", "permalink": "/r/DecidingToBeBetter/comments/b5oao3/is_it_bad_if_i_just_want_to_live_a_simpleaverage/ejjqd5n/"}