{"id": "t5_2tand_t3_qgejw3_t1_hi7lqqu", "creation": 1635310178, "origin": "t5_2tand_t3_qgejw3", "height": 1, "replied_to": "t5_2tand_t3_qgejw3", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "productivityvortex", "text": "Ah I understand now: It’s all stemming from the cheating. That makes sense.\n\nI’m so sorry your friend isn’t recognizing her part in causing very real hurt for you. And I’m so sorry your ex cheated on you with someone you trusted. Having one person mistreat you this way is rough, having two people mistreat you and betray your trust is absolutely awful.\n\nWhen betrayals like this happen — and believe me, I’ve been through a lot of them — it throws off our balance and can make us question ourselves and our own judgement. On top of that it can be hard to accept that someone(s) you loved, that you thought loved you, could be so cruel. \n\nAnd because it’s near-impossible to make sense of it, sometimes it can be easier for us to look inward and try to see how WE can change, how WE might be the problem. Because that would be something in our control.\n\nAnd that tailspin is enough to cause so many of the thoughts you’re having.\n\nWhat your ex and this girl did — what both of them did — was cruel. And what’s worse is you’re the only one having to pick up the pieces.\n\nThere is no great answer here, because you’re dealing with an injustice. So here’s what’s helped me when dealing with similar situations:\n\nFeel your feelings, feel your rage and your jealousy, and everything. Write it down, get it out of you. It will hurt for a long time, but as long as you can physically hold on, you will come out the other side. You will be able to trust yourself — and other people — again.\n\nI promise.", "permalink": "/r/DecidingToBeBetter/comments/qgejw3/i_hate_the_person_i_have_become_and_i_cant_sleep/hi7lqqu/"}