{"id": "t5_2tand_t3_equz2p_t1_fexmu9a", "creation": 1579433415, "origin": "t5_2tand_t3_equz2p", "height": 1, "replied_to": "t5_2tand_t3_equz2p", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "EvergrowToday", "text": "I don't think your post is pretentious. You're just being honest and that's great. Let me try to give you some advice! \n\nA lot of people are just content with the way they are living their lives. They might feel like their job isn't perfect but they don't truly care. They don't really think about a deeper purpose or sense of fulfillment and that's completely fine. \n\nHowever, some people are NOT content with that kind of life without real meaning/purpose. Just like me, you're in that category of people. You can't just make that itchy feeling go away by ignoring it because as you said, one day it might come back and it will hit you hard in the face. \n\nSo that means there is only 1 option: work at it. Find yourself and your discipline. In finding those, you will find meaning and purpose. It might take a month, a year or ten years. It's not about the end result but about being on the path towards fulfilment. You have to realize that it takes time and effort and a lot of boring work. \n\nI think you should not think about 'should I pursue something meaningful in my life?' because the answer is yes. Instead, think about how to do it. \n\nTo me, the only way to move forward from where you are right now is trying different things. Try what you think is meaningful. Do social work. Stop your bad habits and create good ones. It's going to be tough and you are going to have days in which you might feel like giving up but once you're on that path, you will find your peace of mind. \n\nI wish you the best of luck and if you have any questions for implementing good habits or whatever, let me know!", "permalink": "/r/DecidingToBeBetter/comments/equz2p/i_feel_like_i_was_born_for_greatness_but_dont/fexmu9a/"}