{"id": "t5_2tand_t3_lpfqht_t1_gr9o4vk", "creation": 1616007736, "origin": "t5_2tand_t3_lpfqht", "height": 1, "replied_to": "t5_2tand_t3_lpfqht", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lernem", "text": "I'm really sorry to hear about that.\n\nGetting better is a process, and there is no way to speed it up. And it's really recent for you, some days after the breakup I was feeling really bad, mentally and physically. The first weeks were really terrible, and there isn't much to be done to be honest, except for tending to your physical and psychological needs. Be kind to yourself, remember to try to eat and sleep. Sometimes you won't be able to, but it's important to try.\n\nThe memories won't go away quickly, and they are probably getting triggered all the time when you feel a smell, listen to a music, or see something. Eventually, slowly, your brain will stop being triggered all the time, and you will be able to focus on other things.\n\nThese first days/weeks will be really bad, but once you get through them, you'll start to feel better.\n\nAbout friends, I contacted really close friends that helped me, and I made new ones online. Bumble, which is primarily a dating app, has an option to find friends, you might want to check it out! And I think while we can't go out due to the pandemic, you can try to find friends online, getting in discord servers, or reddit, stuff like that, there are a lot of options today. I also reconnected with friends I hadn't spoken to in a while. If you are close to your family, it's also a good idea to have them around.\n\nForming new social bonds is very important now, because we tend to dedicate most of our social lives to our partner, that's one of the best advices people gave me.\n\nAlso, don't get romantically involved with anyone now, because you are not ready for it and because you'll end up projecting a lot of stuff related to your ex into the other person at this moment, so my recommendation is that you only do it once you are feeling better and over the breakup.\n\nGood luck! You will get better, you can be sure of that, even though it might not seem like it now", "permalink": "/r/DecidingToBeBetter/comments/lpfqht/im_ready_to_say_my_breakup_was_the_best_thing/gr9o4vk/"}