{"id": "t5_2qh5i_t3_2i9fn0_t1_cl07mnp", "creation": 1412434574, "origin": "t5_2qh5i_t3_2i9fn0", "height": 1, "replied_to": "t5_2qh5i_t3_2i9fn0", "down_vote": 0, "up_vote": 12, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NikkiNebula", "text": "I have applied, I know all this. I may need it one day, I am fully aware of that. The thing is though...TODAY...I DON'T need it and I am thankful for each day my body allows me to work and take care of myself. That is the point. I have learned to cherish TODAY even though tomorrow may bring pain and disability. I cherish today BECAUSE of that very possible reality. I know people in their 60's and 70's with MS who NEVER went on disability and worked until retirement. They were diagnosed in their 20's and 30's when the treatments for MS were non-existent. It takes many years to diagnose MS and a lot of people have 10 plus lesions at time of diagnosis. I showed no signs at all before my exacerbation and was diagnosed in 8 days. That is almost unheard of and only thanks to an extraordinary ER doctor who saw that what was going on was more than anxiety. I have 2 lesions smaller than a dime, only one active. They have discovered this very early and I have a much better prognosis than most because with disease modifying drugs, the disease progress in slowed/stopped before irreversible damage can be done. I have a friend (who works full time at her own business, grooming dogs, grueling physical work, I know, I did it for many years) who at age 21 was diagnosed and had 12 lesions on her brain and spinal cord. 8 years, a successful business and a baby later...she is still kicking with NO meds. MS is different for everyone and the majority of people with MS have relapsing remitting as I do...where you may go years without a 'flair up'. I am no proud hero. Many suffer far worse than I do and I am THANKFUL, not proud.\n\n", "permalink": "/r/happy/comments/2i9fn0/in_the_past_year_i_have_was_robbed_at_gunpoint_my/cl07mnp/"}