{"id": "t5_2tand_t3_9165qe_t1_e2x5r5d", "creation": 1532396816, "origin": "t5_2tand_t3_9165qe", "height": 1, "replied_to": "t5_2tand_t3_9165qe", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": ">is there a way to just persuade myself to just sit down and study?\n\n6 years of higher education under my belt...I can say this is a deeply personal issue and the reasons people avoid studying are legion.\n\nYou are fulfilling that sense of accomplishment that you hope to achieve after studying by *researching studying itself.* Its a clever trick your brain is playing actually: make yourself feel like you’ve “done something” without having to really do anything.\n\nGood for you for recognizing this!\n\nIf I am not completely absorbed in a subject I cannot study as much as I would if I was.  Interest is absolutely essential here. **You cannot be forced to be interested in something.** Interest seizes you, dominates your waking mind, infiltrates your life...and you like\nit. When you are interested, or rather captivated, hours mean nothing, all you want to do is just dive deeper and deeper. Not that it isn’t a gruesome haul at times, but the reward of having knowledge about something you are interested in is *worth the inconveniences of study*. It’s a special kind of joy.\n\nBut if you’re taking a class simply to check a box and get through it, you will have to accept mediocre retention of the necessary information. If you can find a way to see the intrinsic value of a subject, it will get better. But some classes are absolutely a waste of time, *but that doesn’t stop you from finding a way to enjoy it.* Sometimes I would write a paper on something I really enjoyed, pouring hours into it knowing full well that the professor didn’t give a shit. It didn’t matter what grade I got or whether it was technically up to par, I needed to do it for me. It was to nourish the special gift of having interest in *something.* \n\nThe answer you are looking for is “discipline”. Maybe that’s what you need, or maybe your brain is bored out of its wits and needs real stimulation. \n\n\n\n\n\n", "permalink": "/r/DecidingToBeBetter/comments/9165qe/i_reached_the_advanced_level_of_procrastination/e2x5r5d/"}