{"id": "t5_2tand_t3_mm4b39_t1_gtqm8ia", "creation": 1617832517, "origin": "t5_2tand_t3_mm4b39", "height": 1, "replied_to": "t5_2tand_t3_mm4b39", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Jastrus", "text": "Thank you! That is exactly what I aim to accomplish - stop the 'paralysis by analysis' that my mind seems to want to do, and start acting - and living! :)\n\nIt's indeed key to really subdivide bigger tasks into smaller managable tasks. For example, writing a CV could be subdivided into: \"make document and add sections\", \"add list of jobs\", \"add projects\", \"add skills\", \"write description for job 1\", \"write description for job 2\", etc, \"ask someone to check CV and send it to her/him\", \"make improvements based on feedback (divide this task into multiple subtasks if there's a lot of feedback)\".\n\nIt may sound like cheating to call subtasks 'tasks', but well I determine the rules here and it's my own game, the only function being to make a system that keeps me productive in a focused, inspired and energized way. and besides that everything is a subtask of something, if you really make your tasks big you only have to do one task in life, 'live life'. Everything else is a subtask of that :P\n\nAnd thanks for your kind words. It's not easy, no, but I have learned life gets a lot harder if you let yourself get caught up in tragedy. I can't change the situation, what I feared would happen, actually happened, and that sucks. My mother died way too young. But then again, I can still live in a way that makes her proud, that would make her smile. And she wants me to be happy. So, that's what I want. And I want to be a light for other people, so I want to become a strong, stable, compassionate and cheerful version of myself :)\n\nIn a way, doing things is like a pilgrimage to me. It's not just about the accomplishments, though I need to get a lot done and these results will all do me good, but it's just as much about the process. I hope to become a better person as I do more. I think it was Jung who said that you can cure yourself by doing a 'supreme moral effort' instead of going to a psychotherapist - or you can do both, but the thing is that if you aim at good things and you act according to your inner compass, that that may also help you grow and heal from the inside - I wish to embark on this journey, trusting that this will happen :)", "permalink": "/r/DecidingToBeBetter/comments/mm4b39/method_10000_tasks_challenge/gtqm8ia/"}