{"id": "t5_2tand_t3_3fhabc_t1_ctplr90", "creation": 1438577644, "origin": "t5_2tand_t3_3fhabc", "height": 1, "replied_to": "t5_2tand_t3_3fhabc", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "tehorangecat", "text": "Thanks for replying.  You're just about dead on.  I am stuck in a rut - thing is, I'm not sure how to overcome it.\n\nWe are both bored.  We've been dating now for more than 10 years.  I know what sort of commentary that's going to lead to - We've had every excuse imaginable to delay our wedding.  We've been waiting on her to finish school, then I bought a house that I'm fixing up, and that's part of it, plus I'm supposed to be saving up money for the wedding as she wants a big wedding...  Suffice it to say, we're both sort of stuck in a rut.\n\nPlans...  The overall plan would be for me to fix up the house, then we get married, move in together, have kids, etc.  Once again, the two main speedbumps there are money for the wedding and for me to get off my lazy behind and fix the house.  We don't live together yet.  Financial goals aren't really set in stone.  I put money away automatically into my retirement account.  I'm supposed to be saving money for the wedding, but there's always something else that takes money away like vacations or emergencies like car repairs, etc.  I do own my home, thankfully, 100% paid for, but as mentioned before, it's a fixer-upper that I'm still working through room by room.  I should work a little harder at saving overall, both for the wedding and for a general emergency fund, but as mentioned, there are always incidentals that hijack that.\n\nTrue, I haven't tried every activity in the world.  Most hobbies require enough of a time or money investment though that the idea of just jumping around aimlessly sounds difficult.\n\nTravel is fun, but expensive.  I've been out of the country a couple of times while working for my previous employer.  We had a yearly company retreat in a couple of Spanish speaking locations, and while it certainly delivered life-long memories and stories, I can't imagine trying to save up the money to make those trips routinely.  Plus, she and her parents (whom she still lives with) are Disney fanatics.  They buy annual passes almost every year, have timeshares down there, and wind up taking at least a few trips down there each year.  I get dragged along, and that drains away a big part of my vacation time with work.\n\nThere probably is such an organization here; I live near a large enough city.  I'll have to look into that and see what I can find.  The last time I checked out Toastmasters, though, it was a bunch of small business owners trying to network for business contacts and customers.\n\nDon't get me wrong about my job.  I'm not that unhappy in it, and couldn't imagine moving to a different part of IT that would be really any more interesting.  It was only recently that I made the jump from a small business IT consulting company into the public sector.  I've learned a decent amount in the time I've been there, as I've been exposed to a much larger environment than our customers.  It's just that IT in general is not very fulfilling. \n\nMy mother tongue is English, and I took enough Spanish in high school and university to be almost fluent.  Spanish has actually came in handy a few times when dealing with people.  After university, I've dabbled in German, Japanese, and Russian, but I can't imagine many situations where it would actually be useful or helpful, let alone be used enough to be maintained.  DIY is a must given the work that I'm doing on the house, but it's more of just learning something well enough to implement it.  Plus, there are surprisingly few people out there who seem genuinely impressed by or interested in such things.  Cooking is fun, and I used to do more of it, but my current kitchen is not in a state to do very much.  Further, maybe I'm being too cynical, but I don't see how learning these sorts of skills, especially at the limited levels that would be accomplished in spare time, would make life that much more interesting.\n\nThe suggestion to go for a jog sounds pretty good though.  Perhaps next weekend I'll give it a try.  Exercise is one of those things I've been meaning to try more seriously.  I just always get caught up in the minutiae of it, of trying to figure out what routine to use or what weights to start at or even just getting space cleaned out for bodyweight work that I fall off track before I begin. ", "permalink": "/r/DecidingToBeBetter/comments/3fhabc/how_to_handle_a_lack_of_interest_in_life/ctplr90/"}