{"id": "t5_2tand_t3_ogrnth_t1_h4l3r1b", "creation": 1625835199, "origin": "t5_2tand_t3_ogrnth", "height": 1, "replied_to": "t5_2tand_t3_ogrnth", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "containmentleak", "text": "So you traded one addiction for another. From alcoholic to work-aholic and never really learned what you need to make yourself happy?  \nGuess what? 28 is still actually quite young and now that you know the issue, you have the rest of your life to learn how things can be different. If you lived to 90, you aren't even 1/3 of the way. You have everything you need to be happy, but also you are fully responsible for making yourself happy.   \n\n\n\"Never touched a woman\" so what? Be careful of internet advice. You can find some golden people of wisdom that really help and uplift. But that advice that makes you feel worse about yourself? Drop it. Drop it like a hot (rotten) potato that will only give you food poisoning.\n\nI saw a few posts of yours and I hear the things I thought and and said when I was struggling with depression. (It still comes and goes but I can handle it much better now that I know what it is.) Therapy. It's the first suggestion because, it's usually the best. You might not find the right therapist for you on the first try, but a decent therapist is gold.   \n\n\nThe basic steps that helped me was   \n1: disappointment. The first time my therapist said \"you're disappointed?\" I was like. yesss... this word. How one simple word to name your feelings can change everything. Disappointed. I thought my life would be different at this age. I thought parents were supposed to love their children. (sometime they just don't) I thought that I would be happy now that I have so many wonderful things in my life. (I wasn't) Life was so much better but I was still so miserable. How disappointing. mourn those hopes and past expectations and let go.   \n2: Forgive. All that time I was dissapointed I was beating myself for being in pain. Calling myself names, blaming myself and saying something was wrong with me. I was hurting and I literally kicked myself when I was down. Forgive. Forgive yourself for putting up with things you didn't deserve. Forgive yourself for not knowing how to make yourself happy. Forgive yourself for not knowing that money wasn't enough. You didn't deserve to be told that you're stupid or worthless, but your brain told you that. AND YOU BELIEVED IT. Forgive yourself. For both saying these things about yourself and for believing them. Forgiveness and empathy to yourself. Unconditional love to yourself is this. It's a practice. Everyday. Journal. \"I\"m disappointed about A or B. I forgive myself for A, B, or C.)  \n3: Hope. Things can change. THings can get better. Even when it seems like there is nothing left. Where there is still a desire to live (and anyone asking for help or advice still has this) there is hope. That is the most twisted thing about suicidal thoughts - and I've had them. They're the ultimate betrayal of what you really want: to live fully and a sign of the struggle to hold onto the last thing you have: hope. Keep holding that hope. The thoughts will come and go.   \nYou can live as much time as you have lived twice over and it can be different from what you have seen so far. I hope you give therapy a shot and let me know how things go in 6 mos or a year if you do, eh? <3", "permalink": "/r/DecidingToBeBetter/comments/ogrnth/well_i_worked_yoked_like_a_beast_of_burden_for_5/h4l3r1b/"}