{"id": "t5_2tand_t3_p46jua_t1_h8woz0p", "creation": 1628947357, "origin": "t5_2tand_t3_p46jua", "height": 1, "replied_to": "t5_2tand_t3_p46jua", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "greebledhorse", "text": "I was introduced to somatic experiencing (example exercise: [https://www.youtube.com/watch?v=yWK3Yb3dbmk](https://www.youtube.com/watch?v=yWK3Yb3dbmk) ) by a therapist, and it really opened my eyes to how much I was 'living in my head,' and how much I wasn't even curious about messages my body might have for me. When I'm living in my head, my body is at best a tool I need for accomplishing intellectual goals, at worst a liability that could betray me by getting sick. But like, there's a whole world in there, there's wisdom and love and messages about what I need right now. The sensory me is no less me than the intellectual me. And body messages & gut feelings and so on can be much more reliable informants than conscious logic when it comes to things like whether a person is trustworthy, whether an environment is safe, whether I'll be happy in a career, and so on.\n\nFeeling like shit could be an inconvenience that needs to be weathered intellectually or overcome with discipline, or it could be a meaningful and decipherable distress call from an old friend that loves you unconditionally. Brushing your teeth and taking a shower are incredibly boring on an intellectual level and give no intellectual reward besides knowing logically that it's 'the right thing to do.' I'd recommend getting in touch with things you want to do and things that feel satisfying 'just because.' And carving out 'slush time' where you don't have to worry about being somewhere or doing something. The more you involve your sensory awareness in your daily life and decision making, and treat it like a partner and not a vessel, the more I would expect taking care of it would feel natural. The part of your mind that feels broken and uncertain could be related to not getting, or not trusting, important messages from sensory awareness. \n\nIt sounds like this is impacting your life in a big way, and seeking out appropriate support for mental health is definitely important too. \n\nBest of luck!", "permalink": "/r/DecidingToBeBetter/comments/p46jua/how_do_i_convince_myself_that_the_most_basic/h8woz0p/"}