{"id": "t5_2tand_t3_fbt0cr_t1_fj9aw1i", "creation": 1583139866, "origin": "t5_2tand_t3_fbt0cr", "height": 1, "replied_to": "t5_2tand_t3_fbt0cr", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I'm not done reading the book yet, but what drew me to it is what's important.\n\nI'm an introvert. Whenever there are people around, I'd rather not be busy, so I can listen to them, await their social cues. At a work setting, having people around is stressful, I work better solo in a meeting room than in an open office layout.\n\nTo survive the open office, I would work alone, eat alone, but I saw that I didn't socially network, unlike the poeple who were extroverts, more energized by people while working.\n\nI considered maybe I'm also to an extent anxious around people. I came across the book, then while reading about it, I remembered that as a kid, in kindergarten and first grade, I had episodes of vomiting due to anxiety. In kindergarten, I was left alone not told about my section/class. The students had all been ushered to the classrooms, but no one paid attention to me in the hall, so I was left alone in a big hall, and I vomited. In first grade, I remember coming home sometimes using the spare uniform from the clinic because I'd vomited again, not sure if it was about recitation, or anxiety about schoolwork or about socializing with my classmates.\n\nI was a perfectionist as a kid. After first grade I didn't get stellar grades anymore. So now, as an adult, maybe a belief was formed in me at a very young age that if I cannot be my best (be perfect), best to keep to myself. Friends are optional. When I say something in a group, I think about it very well. I'm too considerate. I had trouble being candid, better at it now, but I'm not active on social media, I don't have a bigger circle of friends.\n\nInsight from the book so far/assignment: to learn how to be yourself with people, you have to be yourself with them right now, and not wait to be a better version of you. The version you are right now is alright, you don't need to work on yourself before you socialize. Do it, socialize, practice it, then you'll learn to accept yourself as you see that others aren't rejecting you.", "permalink": "/r/DecidingToBeBetter/comments/fbt0cr/any_books_people_can_recommend_for_just_improving/fj9aw1i/"}