{"id": "t5_2tand_t3_fbt0cr_t1_fj882l6", "creation": 1583107229, "origin": "t5_2tand_t3_fbt0cr", "height": 1, "replied_to": "t5_2tand_t3_fbt0cr", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Chingletrone", "text": "Damn, what a shit thing to say to someone, therapist or not. It can be really tough finding a good therapist, let alone one that really works for you personally. There are empathetic and understanding individuals out there working as therapists and counselors of various sorts, but it can be a long and frustrating process to find them (it took me many months of active effort, with years in between, but finding my current therapist has been life-changing due to the work and understanding we both are able to bring to the table).\n\nI agree with the above commenter that books on charisma and social graces only get you so far. You clearly have a tendency to fixate on your mistakes (real or perceived), beat yourself up, and probably bring some irrational beliefs to the table as well. None of this is meant as a criticism. I do this as too, although much less often and less forcefully than I used to. \n\nIn the mean time, here is an awesome [little tool](https://www.smartrecovery.org/smart-recovery-toolbox/abc-crash-course/) by an awesome organization - [SMART recovery](https://www.smartrecovery.org/) - with free meetings across the US and online. They are geared towards addictive behavior but are totally welcoming to anyone who wants science-based cognitive tools for self improvement and empowerment. The tool is called an ABC, and even if it feels silly at first, banging one out every time you start beating yourself up over an interaction that didn't go perfectly really will help you shift your self-perception and thinking over time. The entire curriculum of this organization is based on CBT, a type of behavioral therapy that comes straight out of clinical psychology, so this isn't just self-help that's only relevant to people with addiction issues by any means.", "permalink": "/r/DecidingToBeBetter/comments/fbt0cr/any_books_people_can_recommend_for_just_improving/fj882l6/"}