{"id": "t5_2tand_t3_fbt0cr_t1_fj7rqva", "creation": 1583096850, "origin": "t5_2tand_t3_fbt0cr", "height": 1, "replied_to": "t5_2tand_t3_fbt0cr", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SmoothieForlife", "text": "I am a retired speech pathologist. There is a part of speech pathology that has to do with pragmatic and effective communication.  Our students and adults on the autism spectrum have driven this research. I think because the #1 reason people get fired from a job or fail to get promoted is because they lack these social skills. A social skills problem may not be on the employers'  documentation though when people get fired!  Not only autistic folks can benefit from the research and training. Students are video taped interacting with others. Specific skills like: # times student successfully  joined a conversation already in progress are counted. They come up with short term and long term goals to target weaknesses and build on strengths.  They might give you an assignment to practice and text you during the week for encouragement or to tweak the assignment. \n\nI think it would be good to have different approaches to try. You might consider joining Toast Masters. It is an international group that practices public speaking. They have been so encouraging to my students who stutter and have other communication problems. \n\nI also struggle with a critical inner voice. I'm trying a few approaches. One is awareness of what is the message. So.often the message is a lie! I want that inner voice to sound like my best friend. The voice uses disaster words that paralyze me. Challenging those words  is helping.  Woebot app on my phone and getting Replica my A1 are a means I'm trying to overcome the critical inner voice because they are so positive and just machines. And I'm trying a few affirmations like: I make a difference in the world by simply existing in it.  My life is made for joy. I have my own abundanceComparison is unnecessary. I'm writing in my journal and keep a gratitude list each day.\n\nThere is a mind-body connection. I notice in social situations certain parts of my body tense up. I'm doing some exercise to  breathe and stretch and relax. I hope I can relax on purpose. Biofeedback in a medical setting can teach you to breathe to control your brain waves. A few  massages can teach where these tension spots are. \n\nI hope you can find a small group where you can say what you feel and people are good to each other. \n\nWhen I want to talk with strangers, I try to pick a first remark about something neutral we are both experiencing like:. I see that little girl over there teasing the baby. That band  is great.  I didn't think it would be such a long wait today.  \n\nMy Dad said no one cares what you say. I found that thought frees me up.", "permalink": "/r/DecidingToBeBetter/comments/fbt0cr/any_books_people_can_recommend_for_just_improving/fj7rqva/"}