{"id": "t5_2tand_t3_izky1e_t1_g6kqm94", "creation": 1601069794, "origin": "t5_2tand_t3_izky1e", "height": 1, "replied_to": "t5_2tand_t3_izky1e", "down_vote": 0, "up_vote": 15, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "campbell-1", "text": "What made me stop? Honestly, there was no true build-up or designed plan to actually stop.  Over the years I became the guy that couldn't mow the grass without first taking a trip to the gas station to grab a 12 pack of something.  I couldn't attend an event without first confirming there would be a beer tent available.  Then it started to impact my actual work by way of drinking heavily at lunch and social events. So it crept up and became part of my identity. I didn't really like it, but it's all I knew, so I maintained the status quo.\n\nBut the culminating event was at a wedding in Huntsville, Alabama. I was sitting outside on the patio drinking some homebrewed IPA that one of the groomsmen made.  I specifically remember watching the sun disappear on backside of the mountain and I can very clearly remember the individual rays of sunlight as they crept over the mountain as the sun was setting.  I remember how cold it was, I remember how isolated (physically and emotionally) I was because it was just me and my date (still together actually) sitting in some chairs outside drinking.  Then, someone approached me and said 'hey, did you know that person ABC is in the same industry as you?  You guys should sync up and see if you can do some business.'  But instead of going over to another adult and talking-shop, my very first move was to make a trip to the keg to refill my beer because that was my only true comfort zone.  That very instant that I decided to go to the keg, instead of the man,  I said, this is a fuckin problem and this is the last beer I'll ever drink.  Got the drink, didn't talk to the guy because I felt like a fucking loser. Woke up, grabbed some cold & shitty French toast from a local diner, hit 65 south to Mobile and the rest is 3 years of sober history. \n\nI've literally never even had a 'oh man, just one more beer, it could be great' situation.  I honest to god felt so pathetic at that wedding that that was my 'rock bottom' and flipped a switch.", "permalink": "/r/DecidingToBeBetter/comments/izky1e/1095_days/g6kqm94/"}