{"id": "t5_2tand_t3_lqd8er_t1_gohv0x9", "creation": 1614108343, "origin": "t5_2tand_t3_lqd8er", "height": 1, "replied_to": "t5_2tand_t3_lqd8er", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ThePotentialGentlmn", "text": "Congratulations my friend, you are getting the attention that you so desired. Is this coddling helping you? You didn't delete your reddit profile, because how then would you get through your next bout of whatever it is you have going on here. I have complete empathy for you brother, don't get me wrong here. I would like nothing more for you than to see you prosper in this life. You are just going about this situation wrong, that's my opinion, and that's what you are looking for right? An opinion on what to do......if you did delete your profile then I'm wasting my time right now.......I'll take my chances. \n\n*Dating apps are shit! They allow outside sources to determine your self worth. Like social media, they subconsciously allow us to put others on very rickety pedestals. Of the women you have met on these apps, how many were perceived differently in person  than you perceived their dating profile? Rhetoric at its finest. If you must use a dating app then be as real as possible and seek out the \"Realest\" potential mates that you can find brother.\n\n*All games are time sinks! Consider this, a game is used solely for the pleasure of occupying your mind. OCCUPYING your mind, not expanding it. So every time you are playing these games your mind is stagnant. Stagnant=No Growth. \n\n*Learn to utilize the skills of an introvert! You are searching in the wrong places pal. Searching for the comfort and acceptance of friends and women. You have to work on you for a while before you can establish these other relationships that you seek so much. Go inside yourself for a while. Ask yourself \"what do my thoughts say about me?\" Do some self reflecting and understand the power that the Web has. It has the power to make you or break you, and I don't say this lightly. If you really want a change then, if possible, lock yourself in that $1200 apartment when you are not working and don't let any outside interference persuade your thoughts. Consume yourself with motivation by way of the web. You are an educated person and I know that you know exactly what I mean. I hope this reaches you, if not, maybe someone else in your situation.", "permalink": "/r/DecidingToBeBetter/comments/lqd8er/goodbye_i_deleted_all_my_dating_apps_i/gohv0x9/"}