{"id": "t5_2tand_t3_msl89n_t1_gv1i2kt", "creation": 1618802040, "origin": "t5_2tand_t3_msl89n", "height": 1, "replied_to": "t5_2tand_t3_msl89n", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "nastyyynico", "text": "Sure! So, basically, like I said: it’s all about perspective and selecting exactly how you want to look at the situation that is your life. It’s about reframing the story and choosing a different approach. It’s about realizing that your current mindset and set of beliefs is a choice (even if it’s an unintentional choice).\n\nSometimes we tell ourselves horrible stories about ourselves. And as a result, we take on certain negative characteristics because we impose ideas on ourselves. It’s like a self fulfilling prophecy. We are setting ourselves up for failure if we don’t tell ourselves that we’re the hero/main character in our story. If I tell myself “I was abused, I’m a victim, and I’ve suffered and I feel indignant and I continue to suffer and feel indignant even though x happened to me a long time ago, etc etc etc......” and I choose to keep that as my narrative and I live my life with this mindset... that’s very self destructive and toxic. For me personally, it was a little more complicated. I lived there, on that planet, I wallowed in victimhood for a while.... and then my second mistake was...when I really committed to change, my narrative was different (which is good) but I was STILL attaching my identity to the things that damaged me so badly (which is bad).\n\nMy narrative went from: I’m a victim and I feel victimized and indignant and damaged and ruined.\n\nTo: I was a victim and it changed me forever and I’m still trying to figure everything out (I lived with this story for WAY too long... see how I was still identifying as a victim?)\n\nTo now, which is: My 20s were a wild ride. It was mostly shitty, but I am so much better for it and grateful for everything. Now I am on a self improvement/leveling up/glow up journey: I’m in the middle of a career change. I got a personal trainer so I’m getting my physical self in order, etc etc etc.\n\nAlso.... A lot of people don’t realize that we can wake up tomorrow and choose to be somebody else (and not in a psychotic way, in a very real, intentional way). I think this is another point I was trying to make.\n\nToday we can choose to live a different life and be a different or better person... does that change what happened to us yesterday? No. But we don’t have to identify with past. At all. \n\nI hope this was helpful.", "permalink": "/r/DecidingToBeBetter/comments/msl89n/psa_youre_allowed_to_rewrite_and_revise_your/gv1i2kt/"}