{"id": "t5_2qh5i_t3_czcs7s_t1_eyzxksb", "creation": 1567626478, "origin": "t5_2qh5i_t3_czcs7s", "height": 1, "replied_to": "t5_2qh5i_t3_czcs7s", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kungfubellydancer", "text": "Guild Wars 2 is one of my favorite games! \n\nThink of it this way, dear; if you choose your real life over your game, you get to play as the amazing you, your own RPG character. Fall in love with yourself as you love and admire your game character. You are a work of art just waiting to become a hero. \n\n Let's say you like to cook in GW2? Maybe you maxed out at lvl 100? Your other character who is lvl 80 collects the rare ingredients because he has a great offensive build? Well whatever you do in Real Life, also imagine all of your talents, skills, knowledge, experience, and even personal assets on a numerical scale. When you go to your kitchen and prepare a sandwich, try your best at it and make it look beautiful and delicious, you're essentially \"leveling \" yourself up in cooking. Then go outside and level up your gardening skill. You don't know how to plant roses? Don't worry, that's a lvl 55 gardening skill unlock and you're only lvl 1 so your only option is to replant the onion you used for the sandwich. If that onion regrow successfully, congrats, you just leveled to gardening 2! You're raising your gardening and cooking skills at the same time, and you're burning calories while doing so, so you end up losing weight too....er excuse me, leveling up your Endurance.\n\nI know it sounds obvious but you must use a little imagination and a lot of self-appreciation. Stop wondering of you're good enough or how big or small your body is and just focus on improving you and your skills. You can only play as you on this life so take it as FAR as you can go. \n\nYou have nothing to lose.\n\nTl:dr live rl as your own rpg character.", "permalink": "/r/happy/comments/czcs7s/28_mother_of_4_married_twice_former_video_game/eyzxksb/"}