{"id": "t5_2tand_t3_ml398i_t1_gtk9w2o", "creation": 1617712730, "origin": "t5_2tand_t3_ml398i", "height": 1, "replied_to": "t5_2tand_t3_ml398i", "down_vote": 0, "up_vote": 17, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Cataclystic", "text": "So my final salary was $58,000 a year, i started at $38,000 which barely paid my student loan bills. I avoided this subject because i know its pretty much just an American problem but that salary doesn't show you are a few things; my insurance was fully covered by my old work place, which was nice until I got a wife, then 600 a month of my check was deducted when I got married and my wife needed health insurance. This got you about $1500 checks (3,000 a month) which where I live is not great. If you know anything about state property taxes basically this means i would never be able to own a house in my state.\n\nMy new job pay is $68,000 a year with the sign up bonus of getting to 73,000 a year in September of Q3 this year, the new company pays 80% of my monthly cost insurance and 60% of my wifes, which gets you to about $380 a month for ALL of the insurance I listed in my post opposed to just Health insurance. So when I say \"tripled\" my pay, its really about $1,000 more a month which when you're living check to check like I am, is a massive raise. So I can see why tripled may be a little bit of an exaggeration but in my eyes, and my bills thats exactly what it feels like.\n\nI still talk to my old co-workers, I have some insider info that everyone is now unhappy and some have even reached out to me to get a new job also.. I may have triggered everyone to look into what life is like outside that place. So hopefully upper management sees that. If me leaving means it gets all better for them and they do nothing but brag to me about how great it is now then I won't be upset. I'll be happy they got something  they deserve.\n\nThank you for reading!", "permalink": "/r/DecidingToBeBetter/comments/ml398i/i_quit_an_abusive_job_and_now_normal_jobs_seem/gtk9w2o/"}