{"id": "t5_2tand_t3_k78fw8_t1_ger2gg7", "creation": 1607211617, "origin": "t5_2tand_t3_k78fw8", "height": 1, "replied_to": "t5_2tand_t3_k78fw8", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "not-over-until-i-win", "text": "I had a dream around 6 months ago and in that dream am worshiping god and felt someone behind me unbelievably angry seeing me do something good. \n\nNot gonna lie i was afraid HE or IT could kill me and I couldn’t even look behind my back becouse i was doing Sujud (google it)\n\nBut i realized i was worshiping god and no one can fucking hurt me even Satan himself. \n\nAfter that thought , my heart went from  panicking to calm in a second!. \n\nThan i felt someone came down from the sky (was it an angil??) and suddenly the evil force that was behind my back was not there (i thought whoever came from the sky killed whoever behind my back or he or it ran away) \n\nAfter i woke up i asked someone who explain those kinda of dreams for people (the dream was longer tham that but you dont need to hear it) \nAnyway his answer was :\n\nYou were trying to be a better person but you always fail and now you have second thoughts. \n\nBut you will succeed eventually and once you do that there  will be a person that wont like it seeing you succeeding (after i heard that i immediately thought of one person only!!) and god will move him away from you (after i heard that i thought he was gonna die or something but nope) \n\nOnce that person explained my dream to me i was thinking is it really him? “We are friends for more than 13 years no way its him your thoughts are wrong” \n\nand in the next 2 months that “friend” was dodging in every possible way from me, \n\nAnd i gave him an excuse everytime and one day I couldn’t take it anymore and i messaged him in WhatsApp. \n\nHe saw it and didn’t reply, after that i never saw him and i am unbelievably happy that god himself wanted me to be better so he made that “friend” hate me for no apparent reason.", "permalink": "/r/DecidingToBeBetter/comments/k78fw8/i_finally_cut_ties_with_a_toxic_person_in_my_life/ger2gg7/"}