{"id": "t5_2tand_t3_lxeatb_t1_gpmo4rn", "creation": 1614841671, "origin": "t5_2tand_t3_lxeatb", "height": 1, "replied_to": "t5_2tand_t3_lxeatb", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "disco_cats", "text": "I’m sorry you’re feeling this way and that it’s been going on for a while. I’ve been suffering with severe anxiety and depression for a long time too and it’s tough. I have some good days here and there, but I still have a decent amount of bad days all. \nDon’t listen to anyone who says to “get over it” cause they probably don’t understand what depression is really like. \n\nTherapy isn’t for everyone. I’ve tried a few times but it just isn’t for me either. Sure I learned some good tips and tricks from it, but it wasn’t my thing. Currently, I’m taking lexapro 10mg for my depression, atarax for my anxiety. Are you able to possibly start taking an SSRI from a psychiatrist and maybe start on a plan with that?  Like I said earlier, I still have my bad days but it’s wayyyyyy better than it used to be since I’ve started taking SSRI’s.  Basically it just levels you out. It’s not something you have to take forever, but it balances out your serotonin levels so they’re not too low and too high. \n\nI also recommend getting into yoga. I’ve been consistently adding it to my routine for the last year and a half and it’s life changing. Focusing on your breath and stretching out your body really makes a huge different. At least I think so :) \n\nAlso, getting on a routine is crucial. Don’t do too much to start. Start small like every morning you drink one whole glass of water. Do that for a week. Than add on something like make breakfast every morning (look into meal prep if you hate cooking. It’s awesome). And so on until you can get a consistent routine going. It’s OK if you fall off your routine every once in a while. You’re depressed and you e got a lot going on in your head I’m sure, it happens. What matters is that you get back into it eventually. And when you do, congratulate yourself or even reward yourself in a healthy way (no junk food lol). \n\nI really hope this helps you. It’s certainly helped me in the last two years (had a miscarriage a few years ago so I’ve really been working on myself since then To get back on track).  Remember to always take a deep breath if you start feeling off, and remind yourself “everything is going to be ok”. You’re only Human and it’s important to get better at your own pace and in your own time. No one else can decide that for you. Only yourself. Good luck ❤️ you got this!", "permalink": "/r/DecidingToBeBetter/comments/lxeatb/how_do_you_overcome_depression/gpmo4rn/"}