{"id": "t5_2tand_t3_ncw4b3_t1_gy86alr", "creation": 1621094633, "origin": "t5_2tand_t3_ncw4b3", "height": 1, "replied_to": "t5_2tand_t3_ncw4b3", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kiraminamoto", "text": "That is absolutely something you should be proud of. \n\nI've learned that yeah, there's general activities that society sees as \"things you should just do\" by a certain age but I think this set of assumptions is incorrect.\n\nEx. I used to have to write when to have a shower in my agenda because I lost track a lot. I likely had depression at the time and I didn't care to take care of myself because it just didn't seem worthwhile. I remember one of my friends saw that I was doing this and she laughed at me. I felt shame because I didn't do this thing that everyone else seemed to just be doing automatically. I still struggle with this. I don't brush my teeth every night for this same reason.\n\nWhen I was living at my now ex-boyfriends parent's house, I was preparing a work lunch for myself and my ex-boyfriend's dad came to me and said that he was proud of me for doing that. I thought that was a ridiculous thing to be proud of because I was taught since I was very young to prep my own lunches, so I saw it as something that simply needed to be done. It wasn't a norm for my ex-boyfriend or his sister to make themselves lunches, so what I was doing was the \"responsible\" anomaly. \n\nThat's when I realized that most people suck and will never see how these two things are exactly the same - we were all just raised differently, have gone or are going through different things, etc. and progress looks different for everyone. All of it should be celebrated.\n\nSomething that makes me very sad is when someone I know tells me about this thing they've achieved but they downplay having achieved it because it was one of those \"things you should just do\". I purposefully celebrate these things with them. Quite a few people have been weirded out by it but I think this is the way things should be.\n\nTL;DR: \nBe hella proud and clap for ya damn self - you deserve it. In fact, I'm clapping for you over here too 😊", "permalink": "/r/DecidingToBeBetter/comments/ncw4b3/i_have_brushed_my_teeth_every_night_and_morning/gy86alr/"}