{"id": "t5_2tand_t3_pt1ep1_t1_hdvgfzg", "creation": 1632334446, "origin": "t5_2tand_t3_pt1ep1", "height": 1, "replied_to": "t5_2tand_t3_pt1ep1", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ReeverFalls", "text": "Unfortunately you are most likely addicted to your phone. As are over 2 billion other people who have phones. If not more. But don't feel discouraged or bad about it. It's not your fault man. You're literally up against multi-billion dollar corporations that spend millions if not billions to make their apps addicting. Unfortunately you're a by product of what they're trying to achieve. With that said though, thankfully it's an addiction that can be easily broken or nulled to an extent. \n\nMy advice is set a timer and make sure your phone is on blue light/eye comfort mode. This actually helps a lot believe it or not. If that doesn't work then the next best thing would be to buy an alarm clock and leave your phone in the kitchen for the night. If you can make it an hour then your body will naturally want to sleep. Since it's not hyper stimulated by social media or games. Just my recommendation. I'm not a doctor so take what I say with a grain of salt. However I did work in the mental health field and have seen patients with this exact problem. \n\nThe main problem comes from 3 factors. It could either by GAD (generalized anxiety disorder), acute insomnia, or in extreme cases it could potentially be bipolar type 2. Again, do not take my advice as fact. I have no idea what other outlining problems you have in your life and know absolutely nothing about you. So this isn't to try and diagnose you over Reddit. What I will say is I think the absolute best course of action is to see your doctor. And be completely honest with him. He'll refer you to a mental health specialist. \n\nP.S. another thing I'd like to add is I commend you for opening up about your situation. Believe it or not, a lot of the youth and especially young-mid adults feel the same way as you. It's nice you're speaking up about this. As people might not be inclined to seek help for a \"silly phone addiction\". But that addiction is just as real as sex and drugs. So good on you. I hope you end up figuring this out.", "permalink": "/r/DecidingToBeBetter/comments/pt1ep1/my_phone_is_literally_killing_me_i_need_help/hdvgfzg/"}