{"id": "t5_2tand_t3_pt1ep1_t1_hdtne6t", "creation": 1632300720, "origin": "t5_2tand_t3_pt1ep1", "height": 1, "replied_to": "t5_2tand_t3_pt1ep1", "down_vote": 0, "up_vote": 125, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "igbmngd", "text": "I can offer some advice!  What you're going through was basically me in my late 20's!\n\nFirst off, if you feel that you cant' safely drive, call out of work.  Dying in a car crash is contrary to your goals, and folks die in crashes a lot more often than you might realize.\n\nSecondly, let's talk about your routine.  You want to set a consistent bedtime ritual, and follow through on it every night.  If you start work at 7am, let's say you need to be up at 5:30 (not sure if that's how your schedule works, adjust as you need to).  To get a good night's sleep, you should be in bed around 9.  Which means you need to start your bedtime ritual around 8:45-8:30 depending on how complex it is to get into bed.  I try to do something chill, or at least not SUPER stimulating for about an hour before bed, to give my mind and body a chance to slow the F down for bed.   I also make sure I'm done with any alcohol soon enough that I've got 2 hours to let it work its way through before I go to sleep.  (I don't usually have more than 1 a night, and usually with dinner)\n\nThird, we need to discuss your room.  I find that if I hang out in my bedroom, my insomnia gets worse.  If where I live/relax/eat is different from where I sleep, it's easier to just go to bed and fall asleep.  (this obviously depends on your living situation, if you're in a studio apartment, you'll have to adjust a little) My bedroom is comfortable, I leave the blinds open just a crack to let in some starlight (I feel better seeing starlight/moonlight/outside).  The temperature is comfortable.  Another poster suggested not even bringing in your phone and that's a solid idea too!\n\nLastly, my sleep got better once I addressed Vindictive Insomnia, basically where you stay awake because you didn't get a chance to do anything satisfying today so your mind wants you to accomplish something fun or for you, even if it keeps you from sleeping at all.  Vindictive insomnia is a bitch, so carving out time to do something that you enjoy (taking the dog for a walk, cooking a meal you like, watching a movie with your SO, etc) helps with that and makes it feel like the day wasn't just wasted.\n\nIf some lifestyle changes don't help, or you can't get them to go off, also don't be afraid to talk to a doctor or therapist.  Sleep is important!", "permalink": "/r/DecidingToBeBetter/comments/pt1ep1/my_phone_is_literally_killing_me_i_need_help/hdtne6t/"}