{"id": "t5_2tand_t3_lzy86r_t1_gq5licw", "creation": 1615161101, "origin": "t5_2tand_t3_lzy86r", "height": 1, "replied_to": "t5_2tand_t3_lzy86r", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Lithrops", "text": " I've had a similar experience, this is what I learned: \n\nPeople like to be \"fake deep\". They have confused wisdom for cynicism. It is easy, and often correct, to be upset at the state of the world. But constantly moaning about how mean people are and how badly life sucks is unproductive. Eventually you have to get up and do something for yourself. \n\nAny kind of growth makes people uncomfortable, because it exposes their relative immaturity. In order to grow you have to first recognise a personal shortcoming- you're admitting that you were wrong. This creates an environment ripe for bullying: the people who feel inferior take advantage of your exposed vulnerabilities to drag you back down to their level.  Using your example: you recognised that you had a passion for music. I don't know what exactly you mean by a \"deep and spiritual\" connection to music, but this seems like you're implying that music helped you mature as a person. They then shamed your new identity in music. \n\nIn truth, no one is perfect. If you reread what you wrote, you admitted to some of your problems already. I don't know the full story so I can't pass judgement, but: don't shame anyone's growth- that's part of the spirit of this subreddit. At the same time, don't take anyone's bs. You are part of \"anyone\" here.\n\nIf you've spoken honestly and they refuse to listen, you must choose if you value your connection to them above your continued growth. I chose to be polite but distant until my circumstances allowed me to leave. I still haven't found people I relate to, and the pandemic isn't helping. I still have a lot of \"what ifs\". The only thing I'm confident in is I don't think I'm so special that I will never find other people with the same values.", "permalink": "/r/DecidingToBeBetter/comments/lzy86r/a_narcistic_cry_out/gq5licw/"}