{"id": "t5_2tand_t3_fpdwms_t1_fll75ee", "creation": 1585254868, "origin": "t5_2tand_t3_fpdwms", "height": 1, "replied_to": "t5_2tand_t3_fpdwms", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "WaveSurf37", "text": "I hope this can help in some way. As a context, I graduated Engineering, and right before graduation, I suffered from huge amounts of guilt, anxiety, and depression.\n\nWhen I had my inward journey (through psychology, spirituality, etc), I found *creative-writing* & *acrylic painting* to be some form of outlet and flow.\n\nNow, I'm not really good at those activities. My vocabulary are not as diverse as a \"writer\" would have it; and when it comes to painting, all I can really paint right now are 2-dimensional styles of painting. I have friends who are much more skilled than me in writing and painting.\n\nI guess, when it comes to your journey, focus more on the **\"INTENTION\"** as to why you are doing those activities.\n\nFor example, maybe your intention for drawing/writing/carving today is to just relax or have some flow. Then that's your intention. Your intention is to \"***just be\".*** This helps you unwind and better prepare yourself for the coming days.\n\nMaybe your intention is to just ***\"express yourself\".*** Then focus on that. Because eventually, your art will be a symbol of Life, along with its different levels of emotionalities. They are like time capsules documenting your *state-of-being* from different moments.\n\nMaybe your intention is to ***\"******inspire other people\"*** through your art. Then do it. Flow with that intention in mind. Regardless if people see, praise, or ignore your arts, just focus on the intention.\n\nUltimately, you will have control of the **relationship** between your *inner-world* (thoughts, intentions) and your manifested physical art. This relationship is something that is uniquely yours, and no one will ever take that away from you.\n\nThis is your source of fulfillment: the intentions coming from your heart, flowing-out through your art.\n\nAs long as your intentions are pure, you can feel fulfillment, ***regardless*** of the visual appearance & skill level of what you do :)", "permalink": "/r/DecidingToBeBetter/comments/fpdwms/finding_joy_in_what_youre_doing_despite_of_others/fll75ee/"}