{"id": "t5_2tand_t3_q0h5k3_t1_hf8yqlw", "creation": 1633282407, "origin": "t5_2tand_t3_q0h5k3", "height": 1, "replied_to": "t5_2tand_t3_q0h5k3", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Dyltra", "text": "Rehab isn’t for everyone. But if you feel that you need to talk to someone who has experienced what you have gone through, what you are going through, NA is a great resource. You can fo when you please. You can share or stay quiet. \n\nI’ve gone to meetings because of a DUI I had gotten many years back, and although I’m not an addict, the messages were profound. I have an addictive personality, and I have struggled with an addiction in the past that I got through on my own. I wasn’t as deep in though, so I was able to kick it. This was way before my DUI. But to this day I struggle with addiction in phone games, or tv, or other things that I pick up along the way. I’m a smoker, and that I can’t seem to quit, but I do keep referring to the messages I’ve received from meetings. I’ve been able to recognize feelings I have from others stories. And because my parents are addicts, I’ve gained a lot of insight of their struggle. \n\nMeetings helped me in so many ways, even though I wasn’t struggling with a substance at the time. I’ve always struggled internally. And being in a room full of others who struggle took so much weight off of me. I was even able to share my thoughts and feelings and help others. \n\nThere is also something about finding a connection with someone outside of family and friends that is liberating. Being able to call or text or even meet up at all hours of the day and night that just takes pressure off. I’d keep to myself if I felt bad because I didn’t want to bother friends or family. But having someone there for you that you know won’t mind that you call at 3AM is a relief. Knowing that I’m not going to upset those who love me so much by dumping on them yet again. Knowing that this person is there for you, without judgement, pain, sadness, hope: they are there for YOU and your PAIN, your suffering. You can’t drag them down with you. They can bring you back up. They can be completely honest and tell you the things that loved ones can’t. I find that loved ones want to say anything to ease your pain, but someone who’s been where you are, will tell you what you need in order to help yourself ease the pain. Sometimes those things are the hardest to hear, and loved ones can’t bring them selves to say it. \nSometimes you need to hear it. Sometimes you need to feel worse to feel better. \n\nIf you should ever feel the need to vent, talk, or be told, you can always PM me. \n\nI have complete faith in you. You have a strong head on your shoulders, just be sure that your head doesn’t weigh you down. I’m stubborn and thick headed, but I’m also very open minded and willing to see the things I can’t. I’ve let my big head weigh me down, but I strive to avoid that these days. I try to recognize when I’m being stubborn, and when I know I’m right. \n\nGod grand me the serenity to accept the things I can not change, the courage to change the things I can, and the wisdom to know the difference. \n\nI live by this prayer. I’m not religious. My god is a constant flow of energy. Just energy that flows. I die my energy flows to wherever. God is whatever you want it to be. I am my own god. I creat my own destiny. And I try to only put my energy into things I can control. I accept that there are things that I can’t control, and I either let it go, or control what I can. You can’t control your addiction, but you can control if you try to manage it. You can’t control your feelings all the time, but you can control how you manage them. You can’t control the sun coming up, but you can control what you will do with your new day. \n\nBest of luck. You got this fam!", "permalink": "/r/DecidingToBeBetter/comments/q0h5k3/today_im_quitting_cocaine/hf8yqlw/"}