{"id": "t5_2tand_t3_o7uyb4_t1_h328k4a", "creation": 1624671252, "origin": "t5_2tand_t3_o7uyb4", "height": 1, "replied_to": "t5_2tand_t3_o7uyb4", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "yashshouldstudy", "text": "Hi :DD\n\nI'm so excited that you decided to delete those same apps. And honestly, I'm really sorry that you had to experience what probably was a painful breakup. Just please know that that person didn't deserve you. You are self motivated, disciplined, and a decent person. Don't let anyone tell you otherwise 💪😼\n\nAnd I totally understand the \"responsibilities\" that come with being active on social media. Personally, what was hard for me was responding to direct messages- it's been so hard to keep up with text messages and communication recently, and I've found that it's more peaceful when I just power down my cellphone and don't use it. But, for school and work reasons, that isn't as much of an option anymore. \n\nI have lots of online friends due to the #studytwt community on twitter. For me, Instagram and Snapchat were platforms where you could see what your classmates were up to outside of school. Soon, I realized that knowing what they were doing outside of the typical Mon-Fri (7 AM - 3 PM) wasn't worth my time anymore; I had to graduate this year after all ! I don't see myself deleting twitter, and I wouldn't say I'm particularly \"close\" with all of my online friends. I'm really only close with a handful, and that's about as much I can handle right now ! Plus, I added all of these mutuals on twitter on discord, so not all communication is lost :) Socializing at school is much more seamless and stress-free (at least I think) but once I return to face-to-face instruction, I'm not sure how true that statement will hold. \n\nSnapchat streaks are something I still literally do not understand, I have never been able to hold a streak for longer than 2 days. Plus, what's the point of sending me a black image with \"s\" scribbled on it in red ink ? ~~waste of cellphone storage~~\n\nWhat's your summer camp for ? I hope that you enjoy your time there :DD Let us know when you decide to embark on this journey of self-love + improvement <3", "permalink": "/r/DecidingToBeBetter/comments/o7uyb4/i_deleted_instagram_snapchat_on_january_1_2021/h328k4a/"}