{"id": "t5_2tand_t3_phdjvk_t1_hdtrc4q", "creation": 1632304463, "origin": "t5_2tand_t3_phdjvk", "height": 1, "replied_to": "t5_2tand_t3_phdjvk", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Dont-Lick-the-Cat", "text": "We live in a society that is extremely closed off to not only the world around them, but their inner world as well.  Please, do not allow others to make you feel bad or paint you as crazy or delusional simply because they cannot understand what it is you are going thru. We cannot expect others to understand us when they barely understand themselves.  \n\nAs long as you are of in no immediate danger of yourself or anyone else, continue feeling what it is that you are feeling and express that energy however you see fit.  \n\nEmotions are like the water in a vase. Adding clean water to the vase doesn't negate the toxicity of the stagnant, dirty water in the vase. It only infects any clean water you may try to add to it. You must pour out the nasty stinky water to make room for the new clean water to be effective.\n\nScream, cry, talk, write, paint, etc...The pain has to be released. Give yourself permission to Feel the pain and allow yourself to purge it.  Focus any residual energy into meditation or something productive.  The best songs ever written and powerful works of art originated from the broken hearts of suffering artists that were going thru their own DKotS. \n\nYou will have your highest of highs just to experience your lowest of Low's the very next day. This is completely normal, as the pattern of growth flows outward in a spiral. With each low becoming less and less. Just keep focused and continue channeling your time and energy in a healthy'ish' way. It doesn't matter how long it takes, Just make a goal and work towards it. Progress is still progress no matter how small it may seem.", "permalink": "/r/DecidingToBeBetter/comments/phdjvk/well_today_i_finally_did_it_i_finally_let_go_of/hdtrc4q/"}