{"id": "t5_2tand_t3_c8er3x_t1_esnrqe4", "creation": 1562146829, "origin": "t5_2tand_t3_c8er3x", "height": 1, "replied_to": "t5_2tand_t3_c8er3x", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": ">\" I told her I'm not interested in that but she's fun to text with so **we could be text friends.** Fast forward a few months and I say **we should meet up for a drink** just so we can finally meet. She gives me the line, \"Okay, I'll stop by your area for one drink at happy hour then I'm heading back to Hollywood\". Pretty cold but I didn't really care because **I'm not really expecting anything from her.**  \n>  \n>Well, within 30 minutes of meeting me, she excuses herself, phone in hand, and goes to the bathroom. She comes back and asks, \"where are we going next?\". We end up going out and spending all Friday night together and having an amazing time. **We've already gone on a second date** and **we're already talking about taking a trip together**. **I still don't have many expectations with her** because she's always busy with filming and may leave the country to film something soon but it's pretty fucking cool that she's already said that regardless of what happens between us that **she views me as a friend for life.\"**\n\nI'm gonna call you out. This sounds like you still don't know what you want or you do know what you want and you're trying to protect your ego by pretending you have no expectations. Did you really go in with the intention of becoming platonic friends with her before meeting with her? Why do you get excited about dates then if all you want is a platonic friendship? What was the REAL reason of grabbing a drink with her? \"to meet\" ... that's bullshit, you wanted to fuck her! Are you saying if she wanted sex you'd turn her down because all you want is a platonic friendship? I doubt any heterosexual or bisexual man says to himself \"My goal is to make a female friend who is also attractive and NOT have sex with her!\" (Unless of course he is using that woman to get more women but that's another story ...) If you know what you want, say it to her, then let her reciprocate or not. From what you've described it seems like you want a girlfriend that you can emotionally connect with and have sex, but no where in there did you state this to her or even to yourself. It sounds like you're afraid of rejection. Hanging out in the grey area is just asking for trouble.\n\nIf I was to recommend a book for you, it would be Mode One by Alan Roger Currie. You need to be honest with women and yourself. Right now you seem to be full of shit with a *facade* of \"I'm an emotionally connected evolved person\" when really you're still dishonest and playing games with women and allowing women to play games with you.", "permalink": "/r/DecidingToBeBetter/comments/c8er3x/im_not_an_emotionally_shallow_asshole_anymore/esnrqe4/"}