{"id": "t5_2tand_t3_qgus7h_t1_hi9v7z0", "creation": 1635356885, "origin": "t5_2tand_t3_qgus7h", "height": 1, "replied_to": "t5_2tand_t3_qgus7h", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "FatNinjaHD", "text": "In the message, the person writing this will apply a third-person perspective in order not to intrude or mix themselves in with the person on the other side, who is yourself\n\nIt's tough growing up when one has only ever seen life through a particular lense and they've been abused throughout the entirety of it.\n\nThe truth is that therapy doesn't really help, at least it hasn't helped this guy very much.\n\nIt may have allowed him to cope better, but hasn't really solved any of his problems. When times were really tough, he couldn't reach out to any one of his friends because they knew he wouldn't understand, and most therapists, he thought, either consciously or subconsciously, were just that. They aren't healers, they aren't soft and gentle people, they're men and women of their profession. So naturally, if he couldn't reach out to one of his loved ones about the things he was going through, how could he ever reach out to someone who he barely knows and who barely knows him? He did, though, once, reach out to one of his friends, and in that very moment, it helped, for a little bit, though as he, though, they didn't or maybe couldn't understand.\n\nHe was in a not too dissimilar situation throughout his own childhood and teenage years also, though maybe less intense in the extremity of the young woman's peculiar setting.\n\nThere are a few things he wishes someone had told him at the time, main one being, that, time heals. What he couldn't understand at the time, was why he felt as though he was in hell, and why no matter what he did, he couldn't seem to get out of it. He tried and failed many times, yet he did not give up once, and he's very glad and thankful to himself for it. He has now many things he always sought and aimed at, but never really expected or thought he would get. He has his own apartment, he can afford to buy not only what he needs but also what he wants. He works for himself and is free to do whatever he likes, and he is closer than ever to start achieving the mission, that's kept him on his feet for the past 6 years.\n\nHe was suicidal through 17/18, yet, after much deliberation, decided that he would not do it. He was too scared. Eventually, through these long walks of his, he arrived at the conclusion, that he couldn't fail, he couldn't surrender and he wouldn't give up because of what his skillset could do for other people, what it could do for humanity. This type of purpose driven mindset is what helped him get through the worst of it.\n\nIt is difficult. We, the lost children of time feel cursed by our very existence, worst of all being that the suffering feels empty and meaningless. Yet our struggle is the struggle for all mankind, and the mere instance of our survival helps everyone around. For that achievement, we are rewarded thoroughly.\n\n \nLife can be a very beautiful and wonderous thing, yet living without the knowledge of the ancients and without some perspective of what life is like for people outside ourselves, it can be misty and the path unclear to say the least.", "permalink": "/r/DecidingToBeBetter/comments/qgus7h/im_at_the_point_where_quitting_seems_to_be_the/hi9v7z0/"}