{"id": "t5_2tand_t3_qgus7h_t1_hibk2gh", "creation": 1635381648, "origin": "t5_2tand_t3_qgus7h", "height": 1, "replied_to": "t5_2tand_t3_qgus7h", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AyLilGiraffe", "text": "Abuse at a young age, that happened for a long time takes time to heal from, as someone who was emotionally/physically abused until about 9/10. Then it was just emotional. \n\nIt's really fucking hard sometimes, so hard I felt like I wanted to be done permantly too. That's okay because you're still here, part of you still wants to live. Having sucidual thoughts is not inherently bad, it's actually a very common coping skill with people who've been severly abused. I still get the thought randomly, but it's gotten a lot less over the years. It's wanting to act on it, where the concern is. \n\nYou may need a different theapist. Maybe a trauma congentive behavorial therapy one. Very least, you need one that has solid experience with people who've been abused, so any trauma/abuse therpist would work, but you may need to go as far to find one that has experience with sexual abuse of your gender identity. This process sucks, but it's so worth it when you see a trigger and it does not effect you and you realize it. That feeling is priceless. You may not be able to imagine what that feels like yet, but you can totally get there. Bring up having an emergency plan and points of contact for when you're really struggling. \n\nI also tried to figure out what I liked about life. Sunsets was one I remember so I started to watch the sunset as often as I could and I had a pet. I lived to take care of my pet at one point. Wouldn't take care of myself at that time, but she kept me going. \n\nWith your brother acting different, bring it up with him, not that you think they may he gay. Just a \"hey, i've noticed you've been a bit distant and it hurt to notice that. Idk what's goin on but I can listen\" Whatever he's keeping from you is his right, cuz autonomy, but you can make sure to remind him you're a safe person like this. \n\nAnd get away if you can. I needed to move states to be able to start healing, but not everyone needs that much physical distance. Some move neighborhoods or even cities. But being in an environment where it's on going or there's constant reminders makes it much more diffcult to heal, just like how it's hard for addicts to get better if they're surrounded by people doin the drug they have a problem with.\n\nOn that note, telling or listening to details of traumas, even if they are different from yours may also be or become triggering also. The first bit of learning to want to live again is the most delicate part, most people backslide in this time, so just protect that time as best as you can to give yourself the best chance.\n\nSorry for bein a bit all over. But I hope you get the just. Feel free to reach out as I'm in a stable place now.", "permalink": "/r/DecidingToBeBetter/comments/qgus7h/im_at_the_point_where_quitting_seems_to_be_the/hibk2gh/"}