{"id": "t5_2tand_t3_qgus7h_t1_hidcejz", "creation": 1635422318, "origin": "t5_2tand_t3_qgus7h", "height": 1, "replied_to": "t5_2tand_t3_qgus7h", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "greenappletw", "text": "From your post and responses here, you sound like a really smart, proactive, empathetic, and likable guy. I mean this as a compliment, but I think you have it in you to thrive. You have inherent human value and you also have \"above and beyond\" value. \n\nYou'll have friends as you get older, don't worry about that. \n\nFor this moment, this of it this way.....you feel done bc your body/mind is telling you that you can't take more of this. Think of this as a flashing emergency light....your environment is making you feel like this. Your instincts don't want you to die, but they want  to live in a more protected way. Whenever I've felt done in the past, what I did is shift my priorities away from other people. I stopped trying to change an abusive person's mind or I stopped seeking love from a callous person. My body didn't want to die; it wanted me to stop putting mental effort into these other people. My mind was just telling me that something needed to change to get to the next step of my healing process.   \n\nTake that energy back and instead put it back in yourself in tiny ways. Whatever makes you feel valued, do that for yourself. I personally eat healthy, or do some exercise, or just do a little self care like enjoying a hobby. Doing these things can push you further away from the feeling you have right now. Then you can do the bigger self care stuff...find a new therapist, make some little goals, learn how to do positive self talk, send your brother a text maybe just so you can assure yourself that you did your part. \n\nYou got this. It's cheesy but I genuinely mean it when I say that I'm impressed by your strength and how you carry yourself. People like you deserve to live cause you do make the world better.", "permalink": "/r/DecidingToBeBetter/comments/qgus7h/im_at_the_point_where_quitting_seems_to_be_the/hidcejz/"}