{"id": "t5_2tand_t3_h78nel_t1_ftrbofj", "creation": 1591924758, "origin": "t5_2tand_t3_h78nel", "height": 1, "replied_to": "t5_2tand_t3_h78nel", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "all-is-impermanent", "text": "Im like you and I also have the same thoughts about Sabotage. Im 38years old and just got diagnosed with ADHD. The motivation part - I can see know - is from the ADHD. And after some considerations I have tried some pills. I helps getting things done a lot. Before I could think about a specific task for days on end without doing it. Now that is better. I still have the motivation-pattern doing things in the last moment. But with the ADHD many have problems with measuring time-use. And just by knowing that now and telling my mind that it’s an issue I can feel small changes in the way I’m thinking about myself and that self-acceptance is starting to grow. I accidentally thought that is good in messuring time, because I can tipucally set a clock for 20min nap and wake up a 1minute  beforehand. But with eany other task I don’t have eany time-reculexion at all. The millions of times I came 5minuts late for school even though the school where my nextdoorneirbour has always been a puzzle for me why I could do so well in school and not manage that simple task to be on time. \n\nThe self-sabotage I’m still now aware of why - but every single night I use 50% of all Brain-energy for 4-5hours thinking about... I can’t go to bet early and usually it’s a sort of self-sabotage... \n\n... I’m not good at structure and I hate doing things that I feel someone is forcing me to, so notifications for going to sleep is not working at all. (Eventhought i made the notification myself and it’s I’m my best interest. I still feel forced, so I resist) \n\nI’m hoping to find a solution my self one day. Many times I can trick my brain saying I’m doing it for some one else’s fouled. But not this sleeping. \n\nI get very little sleep and usually I sleep after 3o’clock like today/night... ...eventhough I know the bad effects Of lack of sleep I can’t change it - yet!! - what ever I try it’s just getting worse. May years like that is not good but my Brian doesn’t care... \n\nStreaks are very effective on me. I did meditiaon with an app with streaks and more then 100th days I made it. It helped me and my brain a lot with mediation. But one day the app crashed and the streak where lost. After some emails I got them backs but with 8less then it was in realliaty. I stoped meditation instantly... (stupid but true)\n\nIs it self sabotage in everything or just some specific?? \n\nAnd advice: are you an adult look up adult adhd and also if you a a woman (can’t see it), look up adhd adult woman. Most meaerials are men - but there is a big diffence in gender.", "permalink": "/r/DecidingToBeBetter/comments/h78nel/why_do_i_self_sabotage_and_how_can_i_stop/ftrbofj/"}