{"id": "t5_2tand_t3_k9srm7_t1_gf72osm", "creation": 1607540528, "origin": "t5_2tand_t3_k9srm7", "height": 1, "replied_to": "t5_2tand_t3_k9srm7", "down_vote": 0, "up_vote": 131, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "D-33638", "text": "I needed to read this, thank you. \n\nTl;dr- I just recently did exactly this and have been feeling some guilt. \n\nI had spent the last three years working for a relative. I enjoyed the work mostly. The pay wasn’t the greatest (ok it sucked), and there were none of your typical benefits. There were a few fringe benefits though, and all said and done, I just sort of “settled.” But I always had this feeling that I was being taken for granted. They constantly made me feel like *they* were doing *me* a favor by employing me, despite the fact that they absolutely needed someone in my position, I busted my ass, never was late or absent, and overall just wanted them to succeed. While I was basically broke and stuck somewhere with few friends, very limited access to my favorite hobby, and a splintered family, they lived down the road in a nice newly remodeled home that they owned, drove nice vehicles, hosted gatherings that I was never invited to, etc. \n\nOne afternoon, they asked my opinion on whether they should do something. I gave it. They did the opposite which resulted in them having to do my job for *maybe* an hour or two, for which I got bitched at via text and basically told that even though they lean on me pretty hard, I have it good and get cut a lot of slack because I’m a [family member]. \n\nSo to recap, I’m in a place that I hate, surrounded by people who treat me differently because I’m not like them, feuding family, doing a job that wasn’t what I wanted to be doing, and getting paid shit while watching them make bank off of my hard work and live it up. F that. \n\nI packed up my shit and left that night. Haven’t heard from them since. I hope by now, having to pick up my duties, they realize how much I actually did. \n\nThanks for reading if you made it this far. Perhaps I should’ve posted this in r/AmITheAsshole.", "permalink": "/r/DecidingToBeBetter/comments/k9srm7/its_completely_ok_to_remove_yourself_from_a/gf72osm/"}