{"id": "t5_2tand_t3_eb0h10_t1_fb3e15f", "creation": 1576470550, "origin": "t5_2tand_t3_eb0h10", "height": 1, "replied_to": "t5_2tand_t3_eb0h10", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "double_chicken", "text": "Short answer....being prepared and damage control.\n\nLong answer...\n\nAside from the habits I posted above, I also do some basic meditation where I focus on my breathing. I feel most of my anxiety will level off, which helps a lot more than I ever thought it would. You could use apps like headspace, but all I do is sit down with proper posture and take deep breaths. I try and focus on each breath. If my mind wonders, I try and bring my focus back to my breathing. This also helps me take my mind off whatever is causing my anxiety.\n\nHandling failure is far easier if I can anticipate the actual possiblity of failure. I don't think too deeply into it. Really, most things I'll already know.  It's all about how I prepare. That's something I did little of before. If I'm going to try something I'm not good at or something new then I'll try and figure out where something can go wrong or where I will begin to fail.  For me, studying doesn't come easy. My mind will begin to wonder or something will end up distracting my focus and I'll literally have to re-read chapters to retain information. I decided that I had to limit all possible destractions. The library around the corner from my house has quiet rooms I can sign out for 3 hours at a time. It has helped a lot. \n\nAnother example could be walking into a job interview. I used to prepare on my walk into the interview. If I were to go on one now, I'd prepare questions that I would ask If I were the one giving the interview and make sure I have the answers. That limits my failure potential to questions I wouldn't think to ask. \n\nYes, sometimes failures happen that I don't prepare for. When it does, I'll try and do the deep breathing exercises. Even if I only have a minute or 2, it helps. A recent example is a couple months ago I missed a payment on my credit card by a day. I completely forgot about it and normally would have freaked out if that happened. My initial reaction was, F*****. After that slight panic, I closed my eyes took a few deep breaths and thought how I could fix that situation. My fear was the late fee even though it was only a day, I knew they would hit me with a charge and I don't exactly have a disposable income. I called right away and since it was the first time being late, they removed the charge. My next thought was how I could avoid that situation from happening again, so I signed up for autopay, which was probably what I should of had from the beginning.  \n\nEven the smallest failures triggered my anxiety and cemented my fear even more. If I really broke it down into steps, I guess it would be \n1. prepare and anticipate the possibility \n2. analyze and troubleshoot if it happens\n\nSometimes, like the late credit card all you can do is step 2 and that's ok.  I think what is important is having a plan for when that happens.  I think how I wrote this, it seems like it's life controlling, but it really isn't. I don't prepare to fail everyday, but for things where my fear pops up I'll be a little more aware of what I have to do. \n\nI hope this helps", "permalink": "/r/DecidingToBeBetter/comments/eb0h10/my_fear_of_failure_and_rejection_would_normally/fb3e15f/"}