{"id": "t5_2tand_t3_p5qj8l_t1_h98fo8t", "creation": 1629163356, "origin": "t5_2tand_t3_p5qj8l", "height": 1, "replied_to": "t5_2tand_t3_p5qj8l", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Liirin", "text": "Please visit /r/MensLib for some great discussions on masculinity and what it means without emotionally crippling yourself. A lot of the usual advice on “toughening up” is extremely toxic to those around you but also toxic to YOU. Don’t learn these “tough” things that later will be difficult to unlearn while you deal with the social and emotional fallout of these habits and mindsets. Just don’t.\n\nREST OF POST IS ACTUAL SUGGESTIONS\n\nI’ve worked with skilled tradesmen for the past 7 years, but I’ve been on the sidelines as a dispatcher. I get to know these guys *extremely* well, since they can open up over the phone. More importantly, I know their bosses and what the boss wants from them (worked large corporate and small businesses). I know their life stories, their worries, the types of jobs they like and the types of jobs I have to talk them into. I know their birthdays and their wife’s’ names and their kids’ names and the gossip with the other guys I work with. And lately I see them all the time physically, and I know how they appear and act. \n\nEye contact isn’t as necessary as you think it is, but *posture* is a main one. Shoulders straightish, back of your head in line with your shoulders, chin up, and eyes forward. A slump will be your downfall, so make sure to hold this posture as often as possible for as long as possible, while walking as well as while you’re sitting. Slumps are partially seen as not confident but mostly a sign that you’re not taking care of your body properly, and that is a very necessary aspect of the tradesman field. Every day they hear of another colleague that has to retire at 50 because of bad knees, bad back, pulled tendons, etc. You have to show that you know what it takes to do the job longterm. Please also take moderately long strides, a shuffle is seen the same way. \n\nBeing outspoken isn’t really needed in this workplace, but it will be needed to some degree in an interview. Bring notes if you need but don’t over rely on them. Compose a reason they should hire you, especially if you don’t have background. Skilled traders are either not willing to work with newbies at all or very open to training someone good (and they will not always advertise this, so spread that resume). You’ll want to highlight things like “I take pride in a job done right,” “I pay attention to detail,” “I love to learn new things, and I listen well,” and (if prompted) “I like getting along with my coworkers, but I’m not interested in workplace drama.”\n\nA bit of eye contact is good, but only on the parts you want to emphasize, like (eyes looking at the desk) “I like getting along with my coworkers, but” (eye contact) “I’m not interested in workplace drama.” (break eye contact) This is honestly a good all around rule, with a split second of glancing up for eye contact occasionally (every 3-5 sec) to make sure they’re still listening and to gauge their reaction.\n\nLastly I would recommend looking into a lot of skilled trades, since you only mentioned two. There’s electricians, painters, flooring guys, tile guys, roofing guys, HVAC. (Any home renovation stuff you can go straight to your local Home Depot/Lowe’s and ask for their subcontractor business to apply.) There’s general construction that get jobs from the state. Airplane repair. Plumbing. You can learn to repair basic home appliances and maintain the yard to be a live-in apartment maintenance guy, and that’s a pretty cushy job with housing included. There’s also more targeted commercial work, like electric water cooler companies or maintaining coffee machines. There’s LOADS of opportunities out there, and there’s sure to be someone who is desperate to hire a person who genuinely wants to work.\n\nBe aware that many openings will require you to have your own insurance, so I would do research on the ones needed in your area. When asked in an interview, say “I don’t have one yet, but I’m looking at X (and Y). What do your guys have?”\n\nI know I wrote a whole damn essay, but I’m passionate about getting people work if they want it and have honestly loved working with skilled tradesmen. They’re a mixed bag but for the most part pretty cool and/or very invested in the job. If you do get hired and don’t feel like you belong, ask for more work when you’re slow, ask questions, engage in talk with coworkers, you’ll be fine. The major thing long-term guys ask themselves about a coworker is “is he going to be lazy and make me pull his weight before we eventually fire him?” Prove you’ll pull your weight, and few people will have an issue, no matter your personal quirks.", "permalink": "/r/DecidingToBeBetter/comments/p5qj8l/how_can_i_toughen_myself_up_as_a_32_year_old_man/h98fo8t/"}