{"id": "t5_2tand_t3_p5qj8l_t1_h9b6ekx", "creation": 1629219116, "origin": "t5_2tand_t3_p5qj8l", "height": 1, "replied_to": "t5_2tand_t3_p5qj8l", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "cheesebetrayedme", "text": "Sounds like your root problem is less of a man issue and more of an anxiety issue. I worked in landscaping for five years and, like that construction person said, people really don't care what you are as long as you do good work.\n\nI recommend working on figuring out why you feel so unsafe looking strangers in the eye and building up your social confidence in other ways. Are you having a disproportionately strong anxiety response to things that aren't actually life-threatening? Does your mind have a tendency to create problems for you? Meditation could help, as could looking for solid evidence that those scenarios your mind is coming up with aren't as bad as you think they'll be.\n\nHave you tried vagus nerve stimulation exercises yet? They can help convince your body that you're not in any real danger and calm the panic response.\n\nAre you anxious around other people because you believe on some level that there's something wrong with you, or that you're going to be rejected? Spend some time each day writing down 10-15 reasons why you *don't* suck, why you're good and worthy of people liking you. And make sure you're treating yourself like you're valuable by taking care of your body, taking time to rest when you need it, stuff like that. If on some level you don't like or value yourself, it's easy to assume that other people won't like you either.\n\nAll this stuff is basically the opposite of what might be considered \"toughening up\" and being \"more macho,\" but in the long run it will help you a lot, and you may end up naturally appearing more masculine in the future, if those masculine features genuinely appeal to you.\n\nAlso, like others have said: gym and therapy.", "permalink": "/r/DecidingToBeBetter/comments/p5qj8l/how_can_i_toughen_myself_up_as_a_32_year_old_man/h9b6ekx/"}