{"id": "t5_2tand_t3_7c5306_t1_dpnx7a6", "creation": 1510408347, "origin": "t5_2tand_t3_7c5306", "height": 1, "replied_to": "t5_2tand_t3_7c5306", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "throwawayieruhyjvime", "text": "I just want to say, I've been reading through your responses to other comments, and the more I read the more I think you are pretty incredible.  Life hasn't dealt you an easy hand, but here you are overcoming it, not making excuses.\n\nA few years ago I was dealing with this similar problem (though my reasons were slightly different, coping mechanisms were similar), and it was this never-ending loop. I really like point number 5 the to comment made, and it actually is what I unintentionally did when I wanted to stop this downward sucking spiral. I literally wrote down all the things I dreamt I was and who I wanted to be in my dreams. Then, I started listing more details underneath them.\n\nExample:\n1. Beautiful\n- someone who has great hair\n- nice skin\n- good figure\n- someone who others always have something good to say about\n- someone with good values\n- someone who is open-minded\n- someone who treats others kindly\n\n2. Intelligent\n- able to speak on a number of topics with deep understanding\n- knows about current events\n- someone who knows what they don't know\n- someone able to listen and learn, then speak, rather than talking over others\n- well-read\n\n3. Athletic\n- can run a marathon\n- good figure\n- can run a sub-7 minute mile (minimum req.)\n- good at a number of sports\n\n4. Incredible dancer\n- able to freestyle\n- if I were to be called out for a battle, I'd kill it\n- able to express emotions properly through dance\n- able to move people with my performance\n\n5. Charismatic\n6. Kind\n etc. etc.\n\nSo after making this list, I started to have a clearer image of who I wanted to be. I recognize that I'll never be everything on the list I made, but I'm going to try my damn hard to be the best me that I can be in this lifetime. I can start now, and from this list, start making goals to get me closer. \n\nLet's take number 4, for example. I was also too afraid of actually attending a class, but one summer, I found a local dance studio that offered adult classes, and went three times a week. With a little help from a friend, I sucked it up and joined a non-audition dance crew (they literally accepted anyone, whatever their experience).  I started learning basics of differently styles, learning choreo, and even performing on stage a few times in local competitions. Since that moment three years ago, I've been proactive to work dance into my life, and I'm so much happier for it. \n\nAs for number 1, this one I felt weird about, because it felt a bit shallow? But that didn't change the fact that I still wanted it, and that actually, a lot of what I felt would contribute to the beauty I wanted was personality traits. So I made mini goals like, create a skincare routine; drink more water; try different hairstyles to find one that suits me; say something nice to someone at least once a day; never make disparaging comments about someone is trying (easier to do than simply telling myself 'don't gossip'), etc.\n\nSlowly, slowly, these things have added together, and I feel it's so much easier to love myself. I don't want to say it's because I'm becoming that person I dreamed of, but rather, it's because I'm actually trying and sorting through my values. It was hard to love myself when I was simply skating through life, not really doing anything beneficial to myself in the longterm.  Now, I feel like I'm doing something with my life and I'm not simply wasting my time. I still have 'relapses', but they generally last max one to two weeks now. \n\nI just realized I wrote a dang textbook, sorry about that! I was just really inspired by your post and I've spent the past hour doing some self-reflection, and this is what came out. I don't know if it will be useful at all to you, but know that you posting was really, really helpful for me. I'm incredibly grateful, because now I don't feel so alone in my coping mechanisms, and some of these comments are helpful to me, too. Good luck!!!", "permalink": "/r/DecidingToBeBetter/comments/7c5306/struggling_with_an_inferiority_complex_and/dpnx7a6/"}