{"id": "t5_2tand_t3_n398b3_t1_gwqj7le", "creation": 1620007983, "origin": "t5_2tand_t3_n398b3", "height": 1, "replied_to": "t5_2tand_t3_n398b3", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Oberon_Swanson", "text": "I was obviously not judging everyone and very clearly noted there will be many exceptions and varieties within my post. \n\nIt is not true of everyone but it is generally true. Not every Catholic priest is a rapist, very few are, but every last one of them knowingly and willingly works for an organization that enables the rape of countless children. And that four billion dollars we know they got to do it was donated from people who think their religion is this great thing. The whole notion that religion is good is completely horrific and insidious. \n\nIt is not just me who has had a bad experience with religion, it is all of society. Everyone glosses over the obscene horrors and harm for the sake of maintaining their delusions. How many homosexual people have been killed, or will be killed in the future, because of religion? How many people were exterminated because their religion wasn't the \"right\" one? How many more people will be exterminated because their religion wasn't the \"right\" one? And some great people, who are religious, raise their children as religious, but then their children get too into the religion and become murdering zealots who think they're doing what they were raised to do. We can bypass all of that by just dropping organized religion, The community around it and the effect it has on people is vile. It makes you feel good. It doesn't make you good. All of the supposed good a church does, can be done better without religion involved. Anyone who thinks they're becoming a better person by going to church is wrong. I know few people agree with me but I think it's important to tell people so they at least know what they're getting into or at least might stop themselves from going too far.", "permalink": "/r/DecidingToBeBetter/comments/n398b3/went_to_church_for_the_first_time_in_many_years/gwqj7le/"}