{"id": "t5_2tand_t3_l7ga6v_t1_gndhmv1", "creation": 1613289446, "origin": "t5_2tand_t3_l7ga6v", "height": 1, "replied_to": "t5_2tand_t3_l7ga6v", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Original-Estimate-43", "text": "I understand abortions are all‐consuming & extremely hard to overcome, so I get your reaction/emotions from that. This is blunt, so try & hold back those tears......lol. But you seem like one of those feminine, pitiful excuses of a \"man\", which chicks with control/dominance issues would manipulate (traits OBVIOUSLY inherited from her Father.....lol that's what daddy issues will do to you). They, usually subconsciously, see that they can use you to fill that need— and from what I read, it seems like that's pretty much all she did; at least after she realized she wasn't into you anymore. Some girls don't recognize that right away or know how to say it, so this resentment is displayed thru blaming & putting you down. Anything to make you feel inferior and let you know you're lesser than her. She gets a power trip out of it that she craves, basically fulfilling a compulsion. \n\nShit honestly, she just seems to be a crazy bitch who's mentally unstable. And you were the \"poor guy\" she released her relentless wrath upon. There are chicks who legit get off on this. She used you, played you, demeaned you, & slapped you around, and you LET HER. Yet you play the victim card & cry about it, literally. You probably lay on your couch for hours, gripping your teddy bear and saying \"woe is me\". She has daddy issues, and evidently you have extreme mommy issues, so it's really no suprise that you two ended up together. \n\nAs for some advice....I'm going to be very forthright here: don't cry so much in front of your GF. That doesn't mean to never show emotion, but do it much much less, like as little as possible. That way, when you really can't fight the tears (i.e. loss of a child, cheated on/lied to, or *maybeee* when you're trying to illustrate how much she means to you & not wanting to lose her), your reaction will be much more authentic and meaningful. It's only seen as a weakness otherwise. But for now, you're just revealing your true characteristics— or basically just how much of a little bitch you are. \n\nDeal with the traumatic state of affairs you endured on your own. Therapy, distractions, be with friends & family, etc. But fuck that psycho, her warped actions, & her weird, cult‐like family. Maybe those couple sentences will make you feel better because at this point, I feel much much worse for her than I do for you. It must be so weighing to deal with such a pussy ass lame as yourself.", "permalink": "/r/DecidingToBeBetter/comments/l7ga6v/she_said_i_was_not_supportive_and_that_she_was/gndhmv1/"}