{"id": "t5_2tand_t3_qe1242_t1_hhq8dur", "creation": 1634984882, "origin": "t5_2tand_t3_qe1242", "height": 1, "replied_to": "t5_2tand_t3_qe1242", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "faye555", "text": "Hi.  I can relate to a lot of what you're going through, with the anxiety and feeling inadequate.  Then  I noticed as I read your post that you care a great deal about what others think of you.\n\n I was always impulsive when I was younger, did very stupid things and took really stupid risks.  I also wanted people to like me and was a people pleaser and acted like I was someone I wasn't.  I was so uncomfortable in conversations sometimes that I dissociated and later forgot how the event ended or didn't remember how I got home.  That further made me feel inadequate.\n\nI married someone I barely knew and that ended up poorly, so I didn't think it through, but it's not all bad.\n\nTurns out I have ADHD which explains the impulsivity.  I had a bad childhood with little guidance from parents who were barely there for me and taught me little, but I was inattentive at the same time.\n\nAND I'm codependent, which explains people pleasing and a host of unhealthy habits and sacrificing my needs to please others and to get other people's approval.  I have anxiety too.\n\nI would find a great therapist and get input as to what's the root of your problems.  If you are sooooo focused on what others think of you and give too much of yourself, you may want to look at the patterns of codependents:\n\nhttps://coda.org/meeting-materials/\nLook at the patterns of codependents and also the recovery patterns and see if it resonates \n\nThere's no shame in going to a therapist, rather you are taking care of yourself and you need to do that, your life can be so much better.  😊. I hope you can get to the bottom of it.\n\nCoDA is life changing, if that's what you struggle with.  Best wishes!!", "permalink": "/r/DecidingToBeBetter/comments/qe1242/im_so_tired_of_myself/hhq8dur/"}