{"id": "t5_2tand_t3_q1s4q9_t1_hfgq11i", "creation": 1633430733, "origin": "t5_2tand_t3_q1s4q9", "height": 1, "replied_to": "t5_2tand_t3_q1s4q9", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "usoppppppp", "text": "No, it won't. It's not that you can't handle your own shit, is that you'll be emotionally dependant, not in a sense that every bad thing that happen you'll cry on her shoulder, but in a sense that you'll do everything for that relationship not to end, even if it's became a bad relationship over time, this is the point, you'll be willing to be in a toxic relationship just because you have a gf.\n\nI'm not saying that your next relationship will definitely be a bad one, I'm just saying that if it is (or if it becomes) with this mindset you'll have a really hard time getting out of it. And if be any means she breaks up with you, you'll be far worst then you're today.One other thing that can happen is that you might want to show a different version of you to someone, just because you think that person is a good match, which usually end up with that becoming a terrible relationship.\n\nI understand that you want to have a family, and that it's your dream, but wouldn't it be better to get better by yourself and then go on a relationship clear minded? Maybe don't overthink this, look for someone, but without any pressure, not every relationship will get to a marriage and that is fine, but it's something that you won't be ready if it comes. Maybe put this as the goal, first get your shit together, then meet someone, not the opposite.\n\nAnd as other people said here already, my friend, you need therapy, because you said you're speaking from experience, so you probably had a really good relationship that made everything work and you miss that, so it looks like you're still not over it (at least not 100%), and you need to get over it (100%) if you're thinking about looking for another.", "permalink": "/r/DecidingToBeBetter/comments/q1s4q9/a_girlfriend_will_cure_my_depression/hfgq11i/"}