{"id": "t5_2tand_t3_g32ms0_t1_fnqlgxd", "creation": 1587166993, "origin": "t5_2tand_t3_g32ms0", "height": 1, "replied_to": "t5_2tand_t3_g32ms0", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Here I explained it better.\n\n[https://www.reddit.com/r/DecidingToBeBetter/comments/g32ms0/if\\_you\\_can\\_afford\\_food\\_and\\_have\\_a\\_roof\\_to\\_sleep/fnplho9/](https://www.reddit.com/r/DecidingToBeBetter/comments/g32ms0/if_you_can_afford_food_and_have_a_roof_to_sleep/fnplho9/)\n\nIf you really find yourself unable to do something, yeah, you may do it anyway with sheer willpower, but you won't last long like that and your real problems won't be solved. If you have an essay next day, your real problem is your essay, or that you aren't studying/doing homework 30 minutes (or whatever amount you need) every day? You can get through homework through willpower, or you can fail your essay and start worrying about the next thing you have to hand in or the exams, and if it's too late to save the subject, then start studying today 30 minutes every day for the next time you take that course. Think long term, not short term.\n\nOf course you can go through your entire education doing everything at the last minute being stressed and feeling all the time guilty for procrastinating, many people do it, it's your choice really, taking things slowly and progressively seems a lot more enjoyable though... Of course at some point you have to force yourself a bit either way, but when you put things into a routine they are much easier to do. In a way what you dread is having to make the decision to start, not doing the thing itself.\n\nAlso like I say in the other comment, be honest with yourself. Don't think you're unable to do something unless you really have tried, and don't confuse not being in denial with your lack of discipline with an excuse for being lazy.", "permalink": "/r/DecidingToBeBetter/comments/g32ms0/if_you_can_afford_food_and_have_a_roof_to_sleep/fnqlgxd/"}