{"id": "t5_2tand_t3_7683sl_t1_dodfscy", "creation": 1508017518, "origin": "t5_2tand_t3_7683sl", "height": 1, "replied_to": "t5_2tand_t3_7683sl", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ToBeDetermined94", "text": "I have been and still kind of am in these same boat as you right now. I don't know where to head, how to head there, and what honestly keeps my attention enough to continue it. I know my opinion isn't the greatest and might not change your point of view but I'll sure as hell try. STOP OBSESSING ABOUT THIS. One problem I have is obsessing over different ideas and trying to figure things out to where I'm at a stand still. You need to take a break from school and as corny as this sounds, find yourself. Learn who you are as a person and what truly motivates you. Video games are just an escape just like drugs. You fill your time with videos games to ignore the fact that your miserable and can't figure out who or what your suppose to be. Just stop man, just stop being upset and negative. Wake up each morning and tell yourself that today is going to be a good productive day in which you will grow and learn more. You stated that your an atheist, so I recommend meditation. I'm a Christian but I still meditate often, it helps me relax and have a clear mind before I start the day. You seem to be a very intelligent person and maybe programming and computers is not the route your suppose to take, and that's okay. It is totally okay that you don't enjoy that lol,\nReally it is. Force yourself to go out and learn and try new things that could possibly spark a fire under your ass. Travel even if it's down the road or to a new state. Experience it all while your young and just live. It's easier said then done but honestly it's best to force yourself because the state your in is just a spiral of negativity and depression. Your going to slip back in it but realize this and move forward. It's your life, make it that way. I'm 23 and I'm just starting to do this and I still struggle everyday but I know that I can't sit in my own shit and expect myself to get clean. You have the power to change it, it takes effort and a whole change of lifestyle. I believe in you and if you need someone to bounce ideas off message me. Good luck brother!", "permalink": "/r/DecidingToBeBetter/comments/7683sl/how_do_i_decide_to_be_better/dodfscy/"}