{"id": "t5_2qh5i_t3_q81r9g_t1_hgso710", "creation": 1634337915, "origin": "t5_2qh5i_t3_q81r9g", "height": 1, "replied_to": "t5_2qh5i_t3_q81r9g", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "vivolleyball15", "text": "Thank you everyone for the well wishes!! \n\nI just wanted to take a minute to not only say that but also give some backstory! \n\nThey aren’t totally sure why, but when I was 13 I started feeling excruciating pain every few weeks in my pelvis. But it didn’t always come with blood, it was just a LOT of pain. This started October 2009. Went to the ER twice and they said UTI or constipation. Fast forward to the week of January 28th, 2010. I am 14, in 8th grade. I am in so much pain I’m blacking out pieces of the day, I can’t sit on a chair, and I become incontinent (lost control of my bowels). My parents bring me to the clinic, and I’m barely able to walk. The doctors there say it’s appendicitis and send me to the hospital. \n\nThere I lay in a bed waiting for surgery, still in pain even through the meds. Finally they put me on the operating table and my last memory is them using the sheet to lift me and me crying out in agony. \n\nWell, they started laparoscopic surgery, but when they got in there they saw it was actually ovarian torsion from a massive cyst. Since it had been a day or two since it twisted, I was in danger of septic shock and the tissue was dead. My ovary was the size of a small football. (I can post pics if anyone is interested). And so they had to remove it. \n\nMy first memory after surgery was them telling me what happened, saying they hadn’t seen this in someone so young, and that my fertility was likely dramatically reduced. And the only chance I had to save my other ovary was to go on birth control immediately. So I did, for 7 years. No periods. Nothing. But then I decided to try without. My cycle evened right out, and here I am. Perfectly healthy little bean, conceived naturally!", "permalink": "/r/happy/comments/q81r9g/after_being_told_since_i_was_14_11_years_that_id/hgso710/"}