{"id": "t5_2tand_t3_a1sa4m_t1_eatp6og", "creation": 1543625351, "origin": "t5_2tand_t3_a1sa4m", "height": 1, "replied_to": "t5_2tand_t3_a1sa4m", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "thalab", "text": "Just remember that all this great stuff you mentally healthy people have gotten a handle on is not easy for the severely clinically depressed, and sometimes the show of support comes across as condescension and shuts the door right in your face. Are you genuinely looking to help? Or is this a little triumphalism that you’ve made it?\n\nSpeaking for myself, as someone who has always struggled with one form of mental illness or another, and is definitely one of the sickos who do all of these things, could I ask you to join me back down in the planes of oblivion for a second? Goal setting is hard because people keep telling me “it will happen,” or “you deserve to be happy,” and to just believe it. Which is nice. That would be nice. \n\nNow here’s where I’ll say “I’ve tried it and it doesn’t work,” and you say “a ha! I’ve got you now!,” but Here’s the thing, I agree with you about effort. You have to try. \n\nMY problem is that as I HONESTLY assess myself (in therapy as well) I have come to realize that I am 32 and I have NEVER been happy. I have ALWAYS been depressed. All of my actions have been driven by this irrational sickness, and both my failures, and anything I would allow myself to consider successes, are products of this sickness. \n\nThe thought of being happy, and content, and secure, and confident fills me with terror now. I don’t have a coping mechanism for that.  For being “Normal.”\n\nI can’t be concrete in planning and goal setting because I seem to be chasing an illusory emotionally stable state (through the guise of career, or love, or esteem) that I don’t know, and seems to be so common that at this point if I haven’t even GLIMPSED it, I’m afraid I can’t/won’t. \n\nAnyway, just wanted to be honest here because I am at least motivated to try and get better. Thanks for putting this out there, and you are released from Oblivion, blessings and happiness to you on your way. \n\n", "permalink": "/r/DecidingToBeBetter/comments/a1sa4m/here_are_the_worst_mistakes_that_are_stopping_you/eatp6og/"}