{"id": "t5_2tand_t3_pcdig2_t1_haivyxm", "creation": 1630043894, "origin": "t5_2tand_t3_pcdig2", "height": 1, "replied_to": "t5_2tand_t3_pcdig2", "down_vote": 0, "up_vote": 27, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NomadicGhost45", "text": "Hey man, I'm usually not very good at extending a helping hand when it comes to heavy stuff like this, but I felt the need to speak out this time. I understand what's it's like to have porn tear a warpath through your life and continue to destroy relationships and warp your sense of what a healthy state of mind is. \n\nI can't say that I can relate to the scat fetish, but I also know what it's like to have a really depraved fetish. Before I ever got into a relationship I found out that I liked porn where the women cheats on the man (cuckold). I hate it and it has only twisted my perception of what a healthy relationship should look like, and has never done me any good. I only look at it with shame and I feel like it has grown out of control. I've had other \"fantasies\" where I am the subject of abuse, I won't divulge into all of it but I have no idea where all of it came from, from my memory I have no significant trauma that could've started this but it's 90-95% of what I get off to.\n\nAnyways, I know I haven't solved my problem so it would be kinda stupid to think that I could solve yours, but a few words of advice I think would is to imagine all of the good things that could come from overcoming your addiction, rather than focusing on all of the bad things if it continues on. Because if you continue to feel terrible about yourself you will keep on finding yourself in a cycle of grief, shame and relapse. But I think that if you feel positive, and work toward the good and not dwell on the past that you could really get somewhere.\n\nAlso, on a final note, I don't know if your fantasy has ever been \"fulfilled\" or not, but I heard a story once about a guy who thought he had a fart fetish and he thought it was the hottest thing ever, but once his gf agreed to fulfill it he was immediately disgusted. \n\nI think the reason people get caught up in extreme fetishes like this is because they can control the situation however they want in their mind, but in reality it could turn out to be repulsive and disgusting to them.\n\nI apologize for the long reply, I wish you the best, friend.", "permalink": "/r/DecidingToBeBetter/comments/pcdig2/porn_addiction_unloading_accepting_accountability/haivyxm/"}