{"id": "t5_2tand_t3_pcdig2_t1_hajygwc", "creation": 1630070994, "origin": "t5_2tand_t3_pcdig2", "height": 1, "replied_to": "t5_2tand_t3_pcdig2", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ok_Researcher_7123", "text": "Yh I need to hold my hands up here...\nI use it everyday but some days it's really bad where I I use it 3 times in a day and I feel exhausted. \n\nRecently I caught myself in a lie. I met this wonderful girl and I still was watching porn. Not only that, I sent pics to other people while agreeing to be in a relationship. \n\n3 weeks into the relationship I realised how wrong I was - I broke up with her instead of letting myself go down a route where I know I'm not ready months down the line. It's been about a week now and I'm still cut up about the entire thing as we connected on a different level. Seriously was different...but I couldn't see myself anymore in the lie...in the relationship. I feel like scum for doing that. Not only that I lied about how long ago I broke up with my ex and how long I was with her just because I wanted to finally not be alone. \n\nThis is and the only time I've lied like this. I never thought I'd be the person to do this. I was always trying to be the good person but I let the ball go on this one. I should've fixed the problem then I can get into a relationship. But I didn't - I was selfish and it was wrong.\n\nI still watch porn but I'm cutting back on the entire thing. Being alone, depressed and not being responsible cause me to loose my mind to it. Its not okay to do that. \n\nI will get better.\n\nNow writing this out I feel like I'm so much of a better person than this and realise why I'm not getting to the places I want to be. I've learnt for those 3 week I can actually be happy and not depressed. I just really need to beat these demons first.", "permalink": "/r/DecidingToBeBetter/comments/pcdig2/porn_addiction_unloading_accepting_accountability/hajygwc/"}