{"id": "t5_2tand_t3_pcdig2_t1_hakh7ma", "creation": 1630078783, "origin": "t5_2tand_t3_pcdig2", "height": 1, "replied_to": "t5_2tand_t3_pcdig2", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "roolyons32711", "text": "My partner has a porn addiction. Please understand lying is not the answer and it never was. My partner lied to me about his inability to perform (get off) for the first year of our relationship. Told me when he was circumcised the doctor made a mistake and it greatly affected his sensitivity. Being a good person, thought nothing of it and assured him I didn’t mind and just wanted to be sure he was enjoying himself. \n\nFlash forward ten months and I discover he’s been on dating sites, gay dating sites nonetheless. I 100% was going to leave. He begged me and pleaded he never messaged anyone and definitely never met anyone in person. As most normal people I absolutely was not buying it, he couldn’t give me a reason why he was there in the first place. He eventually broke down and cried to me about his addiction for the past ten years. \n\nWhat I can tell you is this: it changed shit for sure. I felt violated to some degree. Knowing he had felt horny that often made me feel… icky about him and it was terrible to feel that way but it’s the honest truth. It’s been a year and I still have anxiety about it. I often feel as though I will never be enough like those perfect porn stars and that eventually, inevitably, he will need more. He was on these sites because he’d gone past the point of even extreme wasn’t doing it. He needed real faces that could be potential real people he knew, at least that’s what he said, I’m not sure I’ll ever understand it. \n\nAnyway, I know the addiction itself is hard. I know it shouldn’t be about me or your partner, but please please understand the toll your actions with this can take. I’m still trying to heal from the initial shock and distrust that was created from the lying. I’m not sure when I’ll feel okay about it all, I don’t know if I ever will. You both may need therapy, I don’t know, but communication is absolute key to maneuvering this situation moving forward. \n\nTake care of yourself. I truly hope you can overcome this, for yourself and for your partner, because if not, brace yourself for those inevitable repercussions. I’m still unsure if my partner is going to recover, he says he’s made a great effort but does still consume porn sometimes. It’s definitely messed with my self esteem, aside from already having trust issues in general. \n\nAll of the luck friend.", "permalink": "/r/DecidingToBeBetter/comments/pcdig2/porn_addiction_unloading_accepting_accountability/hakh7ma/"}