{"id": "t5_2tand_t3_e4wkdp_t1_f9g5v9t", "creation": 1575293865, "origin": "t5_2tand_t3_e4wkdp", "height": 1, "replied_to": "t5_2tand_t3_e4wkdp", "down_vote": 0, "up_vote": 21, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "butwhatsmyname", "text": "How about this:\n\nDeliberately decide where to give the gift of generosity.\n\nWe often end up in a position where we perceive ourselves to be \"among friends\", and we behave toward those people around us the way we would like (and quietly expect) to be treated ourselves. That's completely natural and everyone behaves that way to a degree. We believe we know how our situation works and behave accordingly.\n\nSo it hurts when the people we have been expanding our energies on don't stick to the \"rules\". They don't reciprocate and return our generosity and we feel a bit cheated and used.\n\nThis isn't about making the end of that process hurt less, or even about cutting out the behaviour which leads to that hurt. This is about a more conscious, deliberate application of you energies and generosity.\n\nSo - basic example - if you're out with friends and decide to get an ice cream, and your friend Joe wants to get one too, maybe you feel an urge to say \"hey, let me get this for you\". When that urge hits you, ask yourself simply \"is this a gift I am happy to give?\". \n\nAre you picking up the ice cream to strengthen a social bond? To reinforce your image as a generous person? Because you feel like it's polite to offer? Because you owe Joe a favour or some money?\n\nNone of those are \"bad\" reasons, but you need to be conscious of what your reasoning is, and of what expectations it might create - on other people but also on you. Think carefully about the situation, and if you decide you want to get Joe an ice cream, make a deliberate point in your head to decide to give it as a gift.\n\nA gift should be freely given with no expectation of reciprocation. If you're not happy to give as a gift, then you need to stop giving in an unplanned, spontaneous way. Decide before you leave the house that if Louise wants an ice cream then you'd get one for her, because you know she's broke and you don't want her to feel left out, but that you won't be buying for anyone else.\n\nAlso, very important: **This goes for your time too**. Your free time shouldn't be free to just anyone who wants it. Offer it as a gift. Give it gladly. If you feel you may resent what you're being asked to do, or regret getting involved, then do not agree to do it.\n\n\"No\" is a perfectly good reason. You don't owe anybody an explanation for why you aren't going to spend your own time and resources. If you cannot say no, then you should not be offering your time and resources at all. Feeling like you're being taken advantage of is a classic sign that you're failing to value your own thoughts, feelings, time, and efforts.\n\nIt's not rude. It's not unkind. It's not selfish.\n\nRead those again.\n\nYou are allowed to not want to do things. Practice saying no. Anybody who pushes you and deliberately tries to force you to change your mind to their advantage is **not your friend**. \n\nPractice saying no. \n\nWhen you say yes, do so gladly.", "permalink": "/r/DecidingToBeBetter/comments/e4wkdp/how_to_stop_having_my_niceness_taken_advantage_of/f9g5v9t/"}