{"id": "t5_2tand_t3_odg5xy_t1_h41i7c1", "creation": 1625418844, "origin": "t5_2tand_t3_odg5xy", "height": 1, "replied_to": "t5_2tand_t3_odg5xy", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "\"I want them to carry that in their conscience forever. Does that make me a bad person?\"\n\nIt sounds like you are very hurt and you want them to feel that.\n\nYou're not a bad person but that is not a good move to want them to suffer. You'll just get in the way of your own happiness. Spite and anger are incredibly heavy and draining emotions to clutch on to and not let go. You need to feel those emotions in full, but don't hang on! \n\nI can imagine you feel betrayed, because they only will come for your wedding if it's a straight one.  Coming out as gay or trans can be very brutal and illuminating; because you learn just how much people are invested in a phantom that isn't actually you. It's brutal to find out just how much (way too fucking much) is hinged on conformity, cisness, straightness.\n\nYou should 100% not stream for parents I think, not because it will hurt them, but it WILL hurt you if you have to accommodate their homophobia on a day you are trying to be blissful. It already hurts so much that they don't want to come. You should not walk a path of hurting yourself more for people who have hurt you. \n\nI cut my mom off for 1.5 years not because I wanted to punish her, but because her not accepting me and still being in my life just to trash me was hurting me. Next month will see my mom for the first time in 7 years because of how much I was hurt by not being accepted. **Kinda hard to meet my mom in the place where I was thrown on to the street and made homeless for being trans. I still remember being outside and seeing that door close and get locked. I needed 7 years to get over that.**\n\n Back to you and your parrents, the wondering if they will come or not can be painful too. If it was me I would just say if they come they come, they don't, they don't. I'm ready to enjoy my wedding no matter what they do. You want to remove them from having power over your happiness. \n\nIt's a mind fuck for your parents to not want you to marry your partner. We expect our parents to want us to be happy and push us along in the way we already going (towards bliss)\n\nbut instead they withdraw support and make you walk towards your bliss without them.\n\nI'm tearing up writing this. My advice is to focus on your wedding. Your consciousness is a limited vessel, there is less space for bliss if you fill your container with spite.\n\nI just found out my dad is still not correcting family about my true name. 7 years after transition and my dad still letting people call me by the old name. emily to my face; {birthname} to extended family.\n\nI called him out real good when I heard that too, but I can't be weighed down by his bullshit.\n\nAnd you shouldn't be weighed down by your parents bullshit. You have to feel all the things, and it's not easy. But you'll shoot yourself in the foot if you grasp spite and try to hurt them back.", "permalink": "/r/DecidingToBeBetter/comments/odg5xy/parents_dont_want_to_attend_my_wedding_because/h41i7c1/"}