{"id": "t5_2tand_t3_l2by18_t1_gk5a95y", "creation": 1611292651, "origin": "t5_2tand_t3_l2by18", "height": 1, "replied_to": "t5_2tand_t3_l2by18", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Eyesodope", "text": "I think it is completely dependent on how someone uses it; I don’t think amphetamines are objectively more beneficial. Traditionally, the coca leaf was chewed throughout the day by the indigenous who grew it, harvested it and other crops, and they quit every time the season was up without any intense withdrawal effects. Weed has been used by many different peoples throughout the millennia for many different things and has a wide range of effects dependent upon the user. If you’re talking about objectively beneficial in terms of inducing and maximizing work done, it’d be dependent upon what field the person is in. Some artists are always high when they paint and it stimulates creativity for them; film makers; musicians (especially); writers; many athletes use it to lessen the intense fatigue and as a relaxant, etc. Stimulants and their analogues, let’s say the coca leaf or kratom, are both used traditionally to help workers work longer, harder, and more efficient, altering consciousness for that effect. Freud loved cocaine for that reason. Beneficial, as in psychologically and physically beneficial, is a hard word to consider when talking about cocaine or amphetamine analogues; weed is far less powerful in terms of the neurotransmitters used and hormonal effects (stimulants stimulate adrenal glands) than cocaine or amphetamines, undoubtedly. The word beneficial, objectively, depends upon a variety of different contexts, and I honestly don’t think amphetamines are as beneficial, objectively speaking. If we’re talking about culturally beneficial, as we do live in a culture that conditions people to maximize time spent on tasks, work, and other things of that nature, sure, I’d agree in that context, for the most part. What if we’re talking about a different culture that didn’t have 40-60+ hour work weeks like ours? There’re different sides to every coin, and it’s all perspective. If the meaning of someone’s life is merely to do enough work to get ahead at the fastest pace possible, then sure amphetamines certainly do that.", "permalink": "/r/DecidingToBeBetter/comments/l2by18/threw_out_my_weed_scheduled_a_psych_appointment/gk5a95y/"}