{"id": "t5_2tand_t3_l2by18_t1_gk5lcpo", "creation": 1611301127, "origin": "t5_2tand_t3_l2by18", "height": 1, "replied_to": "t5_2tand_t3_l2by18", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "EvolutionInProgress", "text": "As therapeutic as weed is when it comes to physical and especially mental things, it doesn't replace a psychiatrist. Good on you for making the smarter choice. \n\nI love weed too but had to let it go for professional reasons. \n\nBut remember you don't have to give it up 100% if you like the good parts of it, just don't ever use it when you feel the need...cuz that's the worst time to use it. The same thing I say to my fellow soldiers who love to drink. Don't drink when you're down because it becomes a crutch to help get through things you should actually be dealing with. Same goes for weed. \n\nGoing cold turkey is the only way with weed, or any addiction for that matter. You have made a decision, and took action. Now comes a harder part of getting used to living without it. And I promise you it may feel unbearable for the first few weeks, but once you get it all out of the system, you should be feeling a lot better. Go run and workout and just sweat it all out. Running especially helps cuz it gives you a natural high. Also, I know it may seem like you need prescriptions for the anxiety and depression, but I assure you it will get better once it start dealing with things on your own and without the help of any drugs. I've read that prescriptions drugs can be worse in some cases and should be taken as a last resort. Try to avoid that if possible. I too felt the need to get on meds but decided against it and I am glad I made that decision. \n\nSorry to get all preachy on you, I just went through the end exact thing a few years ago so I feel what you're going through. Good luck and take it one day at a time.", "permalink": "/r/DecidingToBeBetter/comments/l2by18/threw_out_my_weed_scheduled_a_psych_appointment/gk5lcpo/"}