{"id": "t5_2tand_t3_ch6na9_t1_euqlfp8", "creation": 1563980830, "origin": "t5_2tand_t3_ch6na9", "height": 1, "replied_to": "t5_2tand_t3_ch6na9", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I used to hold onto grudges and become resentful of people, and it has damaged relationships. I had my guard up about everything, and would either fly off the handle about something straight away, or hold onto anger from a culmination of events, before letting it all out and having a huge argument with someone. I was especially sensitive towards people who I felt had it better than me, or had something that I didn't, or thought that they were above me for one reason another. It stemmed from a combination of low self esteem, depression, and the fact that I was stuck in a rut.\n\nIt took a while to change my mindset, but eventually, I learned that holding onto anger, and not dealing with it in a healthy way, is only hurting me. Even if I wasn't openly angry, I was acting in a self destructive manner, and thinking about things in an irrational way. I saw every argument as a battle, and didn't want to let anything go, but after a while, it was exhausting for me, and again, it put a strain on relationships with people I cared about.\n\nIf I could sum it up in a few words, I'd say that holding onto that anger will only cause more pain. I was tempted to simply say that, but I figured I would give a backstory to myself, to let you know that I've struggled with anger issues, and feelings of resentment. It still comes up from time to time, especially if I feel stuck with something in life, and someone else manages to do better, but the other thing that helps me to think about that differently is that their success does not limit my chance at overcoming obstacles or getting out of a rut.\n\nI know that you have different issues to me, but I hope that this helps in some way, and that you manage to find a way out of this. If you have a supportive friend group, try to be open to them about this. There's a chance that they may have noticed, and hopefully will be willing to help. Also, therapy is always an option. I never tried it, but apparently it is very helpful.", "permalink": "/r/DecidingToBeBetter/comments/ch6na9/how_do_you_avoid_seeing_things_like_forgiveness/euqlfp8/"}