{"id": "t5_2tand_t3_ch6na9_t1_eurugry", "creation": 1563999113, "origin": "t5_2tand_t3_ch6na9", "height": 1, "replied_to": "t5_2tand_t3_ch6na9", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "furrysurender", "text": "Do you have intimate connections with others, and yourself? Would you want that if it felt right and true to you? People cannot connect to the wall you have put up around your heart. That wall serves you a purpose, to protect you, it’s a self defense mechanism. But in the end, it will not bring you fruitful abundance in your life, because your heart needs to be open to feel it. That’s why you are turned off by people operating through their heart, you can see it for what it is and what you don’t have. There’s nothing wrong with staying true to who you are, but is this the entire truth to who you are? You weren’t born this way, you were not 2 years old angry and sickened by the heart. So what were you like before you closed yourself off? What happened that made you closed off? Have intention to deal with it, not simmer in it. You might find that life will be less stressful when you learn to let go of your pain. Anger keeps the pain alive, but it also helps you avoid feeling the sadness. If you successfully open your heart up to the sadness inside of you instead of protecting yourself through anger, you will begin to heal. To feel is to heal. To deny your feelings is to deny the spirit in you, waiting and wanting to come back out again instead of being shut down and closed off. There is a THOUSAND times more power in healing and growing than the anger high you feel. If you want your power back, and spirit, go look for it. It just might be hiding underneath the wall you put up. Because really that wall is not there to only protect you from others, it exists to protect you from yourself. Your true self, your true heart, and your true spirit. You are capable of achieving that if you desire it. You just have to feel the feelings you deny are there, avoid at all costs, or refuse to believe are impactful.", "permalink": "/r/DecidingToBeBetter/comments/ch6na9/how_do_you_avoid_seeing_things_like_forgiveness/eurugry/"}