{"id": "t5_2tand_t3_o9y42t_t1_h3ivb4k", "creation": 1625026041, "origin": "t5_2tand_t3_o9y42t", "height": 1, "replied_to": "t5_2tand_t3_o9y42t", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Da_Real_CeReaL", "text": "Geez, even community colleges are expensive. Lol, I remember it was about $22 dollars a credit back in my day.\n\nHmm loan/fa advice... not sure what state you're in, but I think you have missed the priority deadline for fasfa. You might be able to apply, but you might not receive it this coming semester. \n\nPlus you might get screwed on fasfa because your under 25 years old, and even though you may be independent, fasfa still expects a \"expected family contribution.\" \n\nAs far as loans, I wouldn't take them out until after you transfer. They NEVER  go away, even filing for bankruptcy doesn't clear them. In my book once you've transfer you have a proven track record of being committed.\n\nGeneral advice... cs can be very difficult, and everything you will be learning will be severely outdated. Sure, you get the general idea how to code, but thats it. A quick job search will reveal noone needs a c++ programmer. \n\nIf it is your cup of tea, I would highly recommend either majoring in business, with a minor in philosophy, or speech/debate.\n\nOr if your dead set on tech, maybe a network admin, or management of information systems. As far as I understand it, network admins are responsible for keeping servers online, whether in a office, or website. And you'll probably have to be the go to person for all things tech. What new printer/copier should your company buy. Fixing internal communication problems. MIS as I understand it is utilizing databases to extract \"stuff\" from big data. SQL one of the standards taught and used today.\n\nAlso, don't depend on your academic advisor to help you. Do research, ask questions so you aren't blindly following their advice or recommendations. You just gotta follow your intuition and believe that it will all turn out OK. Theres no way to connect the dots looking forward. \nBest of luck. Dont hesitate to message me any comments/questions. I just finished up an 8 year academic career over here in CA.", "permalink": "/r/DecidingToBeBetter/comments/o9y42t/after_dropping_out_twice_im_going_back_to_college/h3ivb4k/"}