{"id": "t5_2tand_t3_oc6xxb_t1_h3tyizo", "creation": 1625248728, "origin": "t5_2tand_t3_oc6xxb", "height": 1, "replied_to": "t5_2tand_t3_oc6xxb", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MyBumIsClammy", "text": "I like to consider myself a passionate semi expert on Benzo withdrawal. I very strongly urge to never take one again. I wouldn’t even want to call them a bandaid because that’s being too generous. They are worse than a bandaid. They cause way more anxiety in the long run than they suppress in the short term. \n\nI’ve spent a lot of time on the website benzobuddies.com which is a support group for those who were addicted to benzos and are now going through the hellish withdrawal. I’m not exaggerating here when I’m telling you that benzo withdrawal can mess up your brain chemistry so much that the withdrawal effects can last years. \n\nIt is considered to among the worst withdrawals the human body/mind can ever go through. \nIt can cause LIFELONG issues with suicidal levels of horrific anxiety, depersonalization/derealization (which I’ve had and it’s hell) brain zaps, physical pain, suicidal thoughts, terrible depression etc.\nThe list of symptoms vary from person to person. Some have a few some have a lot. For some withdrawal lasts a few weeks, for some, years. That’s what makes it so notorious. \n\nI urge you to check out benzobuddies.com and read the horror stories to scare you straight. Wether you have anxiety or just take them for fun please find another way to get your anxiety under control (meditation, therapy, exercise, CBT/DBT, etc).\n\nEdit: Also I’d like to point out that you said you had a benzo overdose. Blacking out for three days to a week isn’t considered an overdose for benzos. That’s most certainly abuse of the drug but not an overdose. Unless breathing becomes difficult, your fingers and lips turned blue or your in a coma and doctors have to administer live saving drugs and treatment to save your life then you didn’t overdose. The LD50 for a benzodiazepine is actually extremely high. Now if you mixed a benzo with another drug thats where things get life threatening extremely fast. (Alcohol, opiates)", "permalink": "/r/DecidingToBeBetter/comments/oc6xxb/finally_coming_to_terms_with_the_fact_that_im_an/h3tyizo/"}