{"id": "t5_2tand_t3_oc6xxb_t1_h3uypd4", "creation": 1625264916, "origin": "t5_2tand_t3_oc6xxb", "height": 1, "replied_to": "t5_2tand_t3_oc6xxb", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Mixmoody", "text": "Humans character is basically regular habits and it is formed by the environment you live in, what you consume, read, watch, talk etc.You can always change your habit by altering these things like what you wanna watch, talk about, consume be it a show or drugs etc. Most important thing is when u have something think about the consequences of it and primarily about any past experiences.\n\nComing to addiction, it is basically extremist behaviour of humans. Whatever one loves keep on doing it until he is totally fucked up.This cyxle continues forever. For example a sex addict also starts slowly and holds on to it unless he is extremely fucked up. It can be anything.humans hop on from one desire to other unless they know its consequences. Cycle continues. Now the point is to be aware of what you are doing, if it is good for your health, is it helping? If you friends are doing but still is it hyped up or people are blindly consuming everything? If you are consicously consuming drug then still be consious of your habits. See what happens dont believe on what others say. \n\nLike you go to gym for having aesthetic body. Similarily you gotta put efforts to understand whats happening internally. Give in days and day out to understand functioning. Unless you gonna understand it ,you ll always end up fuxked up in life. I aint criticizing you in any way but its not ypur fault. When you aremt conscious about anything it aint your fault. But if u know what u are doing then its you having control on yourself. \n\nEven if you go to doctorz they ll prescribe ypu meds but they aint gonna repair you from inside. Meds, opinions doesnt matter unless you start working on yourself interally. Learn from the people who already know amd excel at it. Take care bro .Stay strong", "permalink": "/r/DecidingToBeBetter/comments/oc6xxb/finally_coming_to_terms_with_the_fact_that_im_an/h3uypd4/"}