{"id": "t5_2tand_t3_np615u_t1_h03extg", "creation": 1622477498, "origin": "t5_2tand_t3_np615u", "height": 1, "replied_to": "t5_2tand_t3_np615u", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "EvolutionInProgress", "text": "I'm sorry to hear that. Breakups are one of the hardest things to cope with. But not impossible - especially if you know the reasoning for it. \n\nI was kinda the same way as your described but over time, I guess learning from experience, I learned to focus on myself first. \n\nYour first step should be to make a promise to stay out of a relationship for as long as you need to get the ball rolling on your goals and purposes. \n\nLearn to love being alone, by yourself, focused on what you want and what you need. \n\nOnce you're comfortable being alone, you will find it a lot easier to put yourself first above others, and this habit should follow you when you're in a relationship as well. I can't speak for other men, but as a man I respect a strong outspoken woman who speaks her mind and stands her ground. \n\nI've gotten into a similar argument with my girlfriend who was still working on her path and I had already started my career job, and whenever we use to hangout we'd have to plan ahead to due my work and school and her work and school (and families, a whole another factor). She used to feel the same way saying she always makes time for me and hang out on MY schedule but never hers. I explained to her that she needs to tell me these things before they become a problem so that we can fix it before it's too late. Also that her schedule is a lot more flexible than mine. To her it was about the balance of power, and I try my best to keep it balanced. \n\nYou will be okay over time, but learn to focus on yourself by maintaining solitude for a while and learn to love being alone. I remember this a quote that went something along the lines of \"don't go looking for love, love yourself and your life and the right person will naturally come to you\", idk who said this, but I love it. And applied it. I remember being happy alone and single for a long time and things started falling into place. Don't force life, just let things happen naturally.", "permalink": "/r/DecidingToBeBetter/comments/np615u/breakup_made_me_realize_my_insecurity_about/h03extg/"}