{"id": "t5_2qh5i_t3_8srlrd_t1_e12hip2", "creation": 1529611785, "origin": "t5_2qh5i_t3_8srlrd", "height": 1, "replied_to": "t5_2qh5i_t3_8srlrd", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "_Prink_", "text": "Smoked for roughly 14 years, quit a few times, longest I could do was 1.5 years (relapsed after a night of heavy drinking where I ended up smoking a few cigs after getting hammered :I).\n\nI wish her the best of luck, hope she can manage!\n\nAlso, do not take this the wrong way, but if she ever happens to relapse (I dearly hope she won't!), she can always try switching to vaping and quitting from there. I've switched reluctantly last February (didn't really like the whole \"vape image\", but really wanted to quit smoking) and been reducing my nicotine dosage slowly and surely since.\n\nStarted with 6mg/ml, now I'm down to 0.5 (can't go down to zero cause I miss that damn throat hit otherwise :P). Still, it's a lot better than with cigarettes that contain about 12-18 mg/cigarette (depending on strength).\n\nArguably, nicotine isn't the bad thing about cigarettes, it's just the stuff that makes you addicted. By slowly reducing the intake, I got to the point where I can say I'm no longer addicted. Sometimes I go to work without taking my vape mod with myself, and even though I miss the sensation of vaping, I don't feel the withdrawal effects at all. (No jumpiness, irritability, etc.)\n\nSo yeah, if everything else fails, switching to vaping for a few months and slowly reducing the nic dosage is a viable alternative. (Not to mention the vapor does not contain all the REALLY harmful stuff present in cigarettes, like formaldehyde, lead or arsenic.)\n\nJust want to stress that I'm in no way affiliated with any vaping brand or whatever. Only reason I'm writing all this is because it helped me with my addiction, so I thought I'd spread the word. :P Still, the best outcome is if she can just cold turkey it, I really really hope she'll manage!\n\nGodspeed, I wish her the best! ;)", "permalink": "/r/happy/comments/8srlrd/the_love_of_my_life_quit_smoking_last_night_help/e12hip2/"}