{"id": "t5_2tand_t3_prtefy_t1_hdocfsi", "creation": 1632194104, "origin": "t5_2tand_t3_prtefy", "height": 1, "replied_to": "t5_2tand_t3_prtefy", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "intent_joy_love", "text": "Ok so you’re sort of fishing for compliments while also low key admitting that you know your insecurities are ridiculous. “I’m not smart but I actually am smarter than most people but I’m just not up to my own standards. For example I messed up a practical in biology that didn’t matter but I dropped out anyway. See I’m so stupid, right guys?  Please tell me I’m smarter than I think”\n\nYou need to stop feeling sorry for yourself and just focus on what you want to do. Stop comparing yourself to others because you’re not doing yourself any favors. You know you are smarter than some people, but not the smartest and somehow that’s the end of the world. You know you could pass biology, but you’re sabotaging yourself for some reason. You know you could have a relationship or have sex with someone, but you have sensationalized it so much and have high standards to the point that you’re acting like you’re an involuntary celibate. None of that is true. Just stop caring what other people think, you don’t need validation from strangers. Just believe in yourself. I know for a fact you can pass your classes and get your degree. College is literally set up for everyone to be able to pass. You can definitely find a relationship. Just believe in yourself and know it’s all going to happen for you. Stop fishing for compliments and complaining about yourself; it’s a big turn off and will push people away.  \n\nSorry for being harsh but you have to understand that no one in this life is going to come save you. You have to do this yourself, but you definitely can do it.  I wish you the best of luck and I know you will turn your mindset around.", "permalink": "/r/DecidingToBeBetter/comments/prtefy/im_not_good_enough/hdocfsi/"}