{"id": "t5_2tand_t3_mqjurw_t1_gugnzpr", "creation": 1618383792, "origin": "t5_2tand_t3_mqjurw", "height": 1, "replied_to": "t5_2tand_t3_mqjurw", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "UnendingQuest", "text": "I don't know, but I'm the same age and feel the same thing - especially during the pandemic and since I got sober.\n\nPart of me thinks a lot of people have kids to give their life meaning, but part of me also thinks that having kids just makes you too tired and distracted and busy pretending to be enthusiastically happy around them that you don't have time or energy to ponder whether or not life is meaningful or if you're happy or not.\n\nAnother theory I have is that up to my late 20's, life was such a struggle and a party and just a rollercoaster of unknowns and adventure and discovery and celebration and tragedy that by comparison my 30's feel like Groundhog Day. I often try to appreciate how little stress I have now comparatively and how much stability and resources I have (which themselves represent a certain kind of freedom), but I also feel that lack of spark / lust for life. I too am living in a new city where none of the people with whom I've spend my best times live.\n\nI'm coming around to thinking of my 30's as a time of contentment, self-reflection, and learning. Maybe I'll branch out more and try to create a richer and more fulfilling life once the world returns to some semblance of normal. Its for sure a first world problem, but it's hard to have a perspective on your life outside of your own range of experience.\n\nIf you're looking for resources on what makes a good life and what makes people happy, I have really enjoyed reading Maria Popova's work on her blog / newsletter Brain Pickings and The Happiness Lab podcast (I'm listening to it chronologically from the beginning).", "permalink": "/r/DecidingToBeBetter/comments/mqjurw/i_feel_like_im_just_floating_thru_life/gugnzpr/"}