{"id": "t5_2tand_t3_p7l0by_t1_h9l1bda", "creation": 1629408587, "origin": "t5_2tand_t3_p7l0by", "height": 1, "replied_to": "t5_2tand_t3_p7l0by", "down_vote": 0, "up_vote": 21, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "an_ineffable_font", "text": "There is an emotional dimension to productivity. When you complete a task, a little win, you get dopamine, you feel good and accomplished. You need to build up this dopamine tank with little wins without too much time in between. Time depletes your dopamine tank. You will build momentum and form a habit of productivity with a lot of little wins and, of course, big wins which are harder to achieve, but usually more important. With a completed depleted dopamine tank, you need to start with little tasks and build up to more important ones. Make sure any task is actually needed though. Fooling yourself with tasks that are not needed or have close to little impact will not cause you to feel accomplished. Your body and brain can discern the difference. \n\nWhenever I feel lethargic and unfocused, I do a written brainstorming exercise to talk to myself about what’s going on and what I need to accomplish, setting up priorities that need to get done first. Then, I schedule them in a timeblock on my custom calendar. I use the app Amazing Marvin. If I need additional structure, I use the Pomodoro method which eliminates distractions and challenges you to work, but also rewards you with breaks. \n\nRegarding moving to another country, I’m not sure because I don’t know what country your in and your financial situation, but, generally, you should move if there isn’t professional opportunity where you are and/or social opportunities because maybe the people aren’t generally likeminded or the local culture is not to your liking.\n\nAbout the loneliness, finding an online accountability partner from Reddit could help at least temporarily until you think of a way to find real friends.", "permalink": "/r/DecidingToBeBetter/comments/p7l0by/i_want_to_be_a_better_person_but_i_feel_lethargic/h9l1bda/"}