{"id": "t5_2tand_t3_of6vxh_t1_h4bkijy", "creation": 1625632645, "origin": "t5_2tand_t3_of6vxh", "height": 1, "replied_to": "t5_2tand_t3_of6vxh", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lbastro", "text": "I feel like I could have wrote something like this in my early 20s (I am now in my late 20s so it’s not like this was 3 decades ago or anything). I went through a similar breakup and I relate so much to that dread you described regarding how you are using your time alive. \n\nI don’t regret spending the majority of my mid 20s single. It’s hard to put into words but I think a big part of my problem at least was I was so overwhelmed by all of life’s possibilities that I would just shut down, and being single gave me the time and space to work through those feelings. I slowly started to reconnect with things I used to love when I was young, I started reading again, played more games, took online classes just out of curiosity, and I tried to just enjoy things without having to have some sort of plan for them. \n\nI also grew up and watched people who go down all sorts of paths end up in all sorts of places. People who I thought made good choices ended up drowning in shit while others who I thought made bad choices ended up coming out on top. Or vice versa. And people can change their life at any time at any age. Even if every choice you make is the “right” one and goes as planned, if you don’t enjoy your daily life what will all those right choices even be supporting? A life you don’t even enjoy living? It’s important to balance “smart” choices with just enjoying the moment. That’s cheesy but true. \n\nI am still single since that breakup. I do find it difficult to put myself back out there now that I feel ready for that again, but I am working on that.", "permalink": "/r/DecidingToBeBetter/comments/of6vxh/at_22yearsold_i_feel_like_an_adult_with_no/h4bkijy/"}