{"id": "t5_2tand_t3_gdoewc_t1_fpis2zg", "creation": 1588647453, "origin": "t5_2tand_t3_gdoewc", "height": 1, "replied_to": "t5_2tand_t3_gdoewc", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mtalton", "text": "Two questions\n\nWhat do you consider as the “normal progression” of ones life given that everyone moves at their own pace? A large part of not accomplishing the things we want and saying that we’ll never accomplish them only comes from you focusing on what you perceive to be “normal” and that you’re behind. You are not behind. Sure you may not be where you want to be but all of that can be changed. It requires a shift in your perspective.\n\nWhich leads me to my next question.\n\nWhat does down talking yourself and convincing yourself that you’re pathetic doing for your situation? How is it helping? We ALL feel we aren’t doing enough and yeah it sucks, I know how it feels. What i’ll say is that the longer you hone in on what you haven’t done and where you aren’t at, versus what you can do and where you want to be, you’ll never be the you version of the self you want to achieve. \n\nI feel the same as you man, I’ll be 23 in June and I’ve never had a “real” job. I’ve worked at my college, doordash, uber, really smooth shit you know? Although im 4 classes away, I dont have my degree yet so i’ve done nothing professional and I feel bad because others around me that are my colleagues, friends, same age. Have majorly gotten their degrees and are into jobs already. But guess what? Focusing on them will not help me, All I can do it focus on my degree during this pandemic and keep applying for work until something pulls through.\n\nIt’s all about perspective man, go fucking tunnel vision for yourself. FOCUS. It’s hard hell yeah but you only fail when you’ve accepted failure and you’ve stopped trying. YOU GOT THIS SHIT MAN", "permalink": "/r/DecidingToBeBetter/comments/gdoewc/my_life_has_been_wasted_current_times_have_only/fpis2zg/"}