{"id": "t5_2tand_t3_c58eod_t1_es0cyjd", "creation": 1561472298, "origin": "t5_2tand_t3_c58eod", "height": 1, "replied_to": "t5_2tand_t3_c58eod", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "coffeeTTTandthee", "text": "There may be an incongruity that you sense - you know you have accomplished great things, so you view yourself in a positive light, but other people are not viewing you the same way you view yourself.  So, many of your interactions are designed to make sure people view you the same way you view yourself.  The problem is that this is an impossible goal, because other people do not think objectively.  \n\nYou may have a scarcity mindset here, in that you are worried about the few people who may view you in a negative light, instead of the many possible people who view you in a positive light.  In other words, your only metric for success is a world where everybody, and not just a select few people, view you in a positive light.  Imagine a shepherd, who is more concerned about the few sheep who escape the flock than the hundreds of sheep staying with the flock.  \n\nWhat may help is realizing that, no matter what, there are many people in the world who flat-out will not like you, even before you open your mouth.  They can simply look at you and judge you on sight, for the most ridiculous and inane reasons.  Sometimes, hate is just the product of crossing paths with the wrong person, but you cannot avoid this.  If you try to avoid it, you will end up scared to take risks.  \n\nSo, what you have is a crisis of hope.  You are hoping you can become universally liked, but this is impossible, and nothing you can say or do will ever allow you to achieve this impossible goal.  \n\nNobody can tell you how to get rid of it, except you, but I have an idea that I have been harping on lately.  My advice is to work from the opposite perspective.  Instead of hoping that people will like you, assume that they do not like you, and then act how you would act if that were the case.  Worst case, you are correct, and you can simply laugh in the face of the person who does not like you, because their reason for not liking you usually has nothing to do with you.  Best case, you end up surprised by people who do like you.  \n\nThis may be over-generalizing, but I want to leave you with one thought as well.  If someone doesn't like you after meeting you, it is because you didn't read their mind or kiss their butt, or both.  If you can internalize this message, it takes some of the sting out of encountering hate.", "permalink": "/r/DecidingToBeBetter/comments/c58eod/why_do_i_care_so_much_about_what_even_random/es0cyjd/"}