{"id": "t5_2tand_t3_hkdg4n_t1_fws9g6s", "creation": 1593761879, "origin": "t5_2tand_t3_hkdg4n", "height": 1, "replied_to": "t5_2tand_t3_hkdg4n", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "dResilientHuman", "text": "Let me copy a few passage from a book I was recently reading. The book's named \"Adult Children of Emotionally Immature Parents: How to Heal from Distant, Rejecting, or Self-Involved Parents\", by Lindsay C. Gibson.\n\n>Emotionally engaged parents make children feel that they always have someone to go to.\n>they’re emotionally attuned to their children, noticing their children’s moods and welcoming their feelings with interest. A child feels safe connecting with such a parent, whether seeking comfort or sharing enthusiasm.\n>Emotionally immature parents on the other hand, are uncomfortable with their own emotional needs and therefore have no idea how to offer support at an emotional level.\n>Such parents may even become nervous and angry if their children get upset, punishing them instead of comforting them. These reactions shut down children’s instinctive urge to reach out, closing the door to emotional contact.\n>These children become competent beyond their years but lonely at their core. They often settle for emotional loneliness in their relationships because it feels normal to them, like their early home life.\n>People who lacked emotional engagement in childhood, men and women alike, often can’t believe that someone would want to have a relationship with them just because of who they are. They believe that if they want closeness, they must play a role that always puts the other person first.\n\nYour post drew me in because it all felt so familiar. You're not toxic I promise you. You have been neglected, you just need to heal. If you want give that book a try - I know it helped me.", "permalink": "/r/DecidingToBeBetter/comments/hkdg4n/i_realized_i_am_toxic/fws9g6s/"}