{"id": "t5_2tand_t3_q213a7_t1_hfi9roc", "creation": 1633457464, "origin": "t5_2tand_t3_q213a7", "height": 1, "replied_to": "t5_2tand_t3_q213a7", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "KonQuerGate", "text": "Have a decent sleep schedule. I stopped going to sleep any later than 11:15 pm and I am currently trying to wake up everyday at 8:00 am. That's one way to become more disciplined.\n\nTry to set one or two goals for the day (it's indicated that they represent a little challenge for you) and try to eat better (have a better meal in the afternoon, for example, something that might make you feel energic). A lot of people don't know this, but what we eat can really determine how we feel. If you're just gonna eat unhealthy things, you'll feel like shit. Stop ordering food, go get some ingredients on your own and try to cook some really basic meal, like instant noodles or an egg omlet. The idea is for you to do the boring option but observe that even the boring option isn't so difficult and that even with a little effort you can do a good meal on your own.\n\nI recommend to limit your social media usage. No matter which platform it is, social media is absolutely pointless and it only makes you feel like scrolling more every time you see a funny meme or video. You either delete the apps or you avoid using them for more than 3 hours a day.\n\nDo some small chores, like folding your own clothes nicely before putting them into the wardrobe, dusting your room a little or just straight up cleaning it. It doesn't have to be anything huge, but it has to be done.\n\nLastly, when it comes to porn, I suggest you stop watching it. Try learning more about NoFap and why you should do it. This might be the roughest part, because porn addiction is really hard to get rid of (even myself am still struggling to get past more than 8 days without fapping), but you must keep trying to stop. The urges will hold you back tho, and combine that with social media and you will have a really difficult time overcoming it. It's truly a test of your will.\n\nAs some final advice, I recommend reading some philosophy books. I started off with \"The philosophy book - Big ideas simply explained\". Or a different book, but philosophy can really help you have a different outlook on life.\n\nAlso try going for walks. Leave your phone at home, go out for a walk for about 20 minutes. Don't rush or anything, just try to relax, the idea is for you to refresh and take your mind off your phone. Maybe you'll feel the need to check it, but then realize it's not there, but don't panic, try to be more observant of the social life around you. Look at the people on the street and maybe ask yourself \"What kind of person are they?\" or \"What kind of struggles do they have?\" and maybe contemplate a little, BUT DON'T DEGRADE YOURSELF BY DOING SO. If you see a rich guy or something like this, don't assume they are better than you because they got a well paid job, that guy might be currently going through some rough shit without you even knowing.\n\nIf you want to better yourself, DO NOT COMPARE YOURSELF TO OTHERS, learn from them and find what YOU need, not what they already have.", "permalink": "/r/DecidingToBeBetter/comments/q213a7/i_have_0_discipline_in_my_life_but_i_want_to/hfi9roc/"}