{"id": "t5_2tand_t3_mogatc_t1_gu51p4v", "creation": 1618141505, "origin": "t5_2tand_t3_mogatc", "height": 1, "replied_to": "t5_2tand_t3_mogatc", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kiwipiealamode", "text": "I can relate. I've been the person you describe.\n\nI read dozens of self-help books from when I was a teenager. I tried many different techniques and felt like I still self-sabotaged. I was a 4.0 GPA student but had a difficult time accomplishing what I really wanted in my personal, and professional, life.\n\nBased on my own experience, here's my advice to you:\n\n1. You've learned a lot. Keep it up!\n\nI didn't know it at the time, but all of those self-help books I read and strategies I tried were valuable experiences that taught me things I could use. It sounds to me like it's the same for you. Through all your trial and error, I'm sure you've learned both what \\*works\\* for you and what \\*doesn't work\\* for you. That's great! Keep learning and paying attention to the results you get from the techniques you try.\n\n3. Build on what works for you\n\nThere are many ways to succeed and each person uses different strategies. Use what works for you and continue to do so. It's not so much about finding the perfect or ideal tactice or technique. It's about using the (imperfect) techniques that you already know and regularly using them. Then, keep experimenting and finding more techniques while continuing to use the techniques that work.\n\n2. You must cultivate patience\n\nThis was big for me. I kept looking for that one thing that would fix my problems and make me into the hyper-productive person I wanted to be. I was impatient for success and didn't realize that that \\*one thing\\* didn't exist. Instead, what works is continually doing the small things that build a little bit of success at a time. If you keep doing those, your mindset will change and you'll become more patient. As you build patience, you'll stop self-sabotaging.\n\nHere's a bonus:\n\nThese are the personal development books that had the biggest impact on me to start creating persistent success: \n\n'Getting Results the Agile Way' and 'Atomic Habits'\n\nBoth books focus strongly on building small successes and making gradual progress. They lay out effective techniques for making that happen in one's life. And mostly importantly, they helped me finally make those gradual shifts into creating steady success. Now, I look back and realize that I \\*am\\* that hyper-productive person I always wanted to be! If you read the books, I hope they're as helpful for you as they were for me.", "permalink": "/r/DecidingToBeBetter/comments/mogatc/ive_been_trying_to_not_be_a_lazy_loser_for_years/gu51p4v/"}