{"id": "t5_2tand_t3_mogatc_t1_guopg09", "creation": 1618544451, "origin": "t5_2tand_t3_mogatc", "height": 1, "replied_to": "t5_2tand_t3_mogatc", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "illhillster", "text": "Sounds like you may be experiencing rejection sensitivity dysphoria which is a common ADHD trait. Honestly, it took me getting on Wellbutrin and Lamictal to stabilize me enough to make progress in CBT and DBT. I got through 3 years of consecutive college as opposed to being on and off for like 10 years. Took a change in major too and started becoming more short term goal orientated. \n\nYou're not lazy. It's easy to assume it, I always did. However, I find the more I try to stick to a schedule/routine, get adequate sleep (delayed sleep phase disorder is also an ADHD thing), forgive myself for my fuckups, and just try to take things day by day has helped. It's still tough though. \n\nWe're pretty much living in a neurotypicals world and it's rough. Keep trying to find something that your skills and quirks would help you excel at. For instance, my boyfriend is super ADHD and after losing several jobs he got into tattooing and it's been the best thing for him. He can tap into his creativity and make his own schedule, and makes bank doing it. Check out imstilloldgreg on IG if you feel like it. Just saying, keep looking for a direction suited to what you need and what you excel at. All of this is easier said than done of course. \n\nI'm struggling super hard in what was supposed to be my senior year of college. My grades all tanked over covid, I have to retake 3 classes, and somehow figure out how to fund the rest of the semesters as those 10 years of fuckups in school really exhausted all my financial aid. I actually just sent a message to my doctor about adding Strattera to my prescription of Adderall to see if that will help. \n\nSomething I just looked into is Access VR, they try to help with achieving an occupational goal with your interests in mind, all while giving you the accommodations you need to survive in the workforce considering your diagnosis and struggles. It can also fund education. Check it out if that's something that would be up your alley.\n\nIt's really hard to try to discover my strengths when I'm so hard on myself, but I believe you can do this. Look how hard you hyperfocused on finding strategies for your ADHD! That's not laziness. Lazy people don't give a fuck. You clearly do. Keep at it. Things will start to click soon. Just remember you're neurodivergent in a neurotypical's world, it's not easy, exhausting, and easy to burn out. The important part is that you just keep trying. You'll get there! <3", "permalink": "/r/DecidingToBeBetter/comments/mogatc/ive_been_trying_to_not_be_a_lazy_loser_for_years/guopg09/"}