{"id": "t5_2tand_t3_qexkq5_t1_hhy81v8", "creation": 1635136653, "origin": "t5_2tand_t3_qexkq5", "height": 1, "replied_to": "t5_2tand_t3_qexkq5", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Fastpas123", "text": "I wish I could go about it this way, but it hasn't worked. Asking them to do something like that just makes them start treating me even worse. Also, I do keep my thoughts about them to myself. I don't comment on their eating habits or their bodies, I really do try as hard as I can to keep to myself. They're really toxic sometimes. My mom straight up lies to me, and my sister gets to talk shit all she wants because my mom and dad never did anything about it growing up and they aren't gonna now. There's no communication within my family and quite frankly, there never really will be. We all live in different parts of the house or in my dad's case, in a completely different house cuz he couldn't put up with the crap anymore. My sister and mum go out of their way to make me feel like crap at times, and I don't stand up for myself because I can't argue with stupid. They'll make arguments that literally don't make sense. My sister will keep pushing the arguments until she keeps threatening to punch me, and that's the farthest I've gotten with her because if I got into a fight with my sister I've seen from experience no one in the family will have my back. So yeah. Also an easy assumption to make would be that I'm just escalating the arguments, but literally no matter what I say, if I oppose to what she argues, it'll get to that point. I've talked to her in a wide variety of tones and we always get the same result. I've even tried sending her other people's perspectives in the past and she will just keep pushing her own beliefs and opinions. She's got bipolar disorder, if that's relavent. Honestly I don't know what the consequences of being bipolar are so that might be completely irrelevant but, yeah. It's hard to argue with someone who can't see reason. Also when I say argument, I mean more like, her making judgements on my life. She genuinely keeps making the argument that me not getting a cat or a dog is a sign of my irresponsibility... When she got her dog it was against my families will, and she got kicked out because of it... But of course she was allowed to move back in, when she ended up in thousands of dollars of debt and her boyfriend didn't wanna deal with her anymore. So yeah Im the irresponsible one apparently. Sorry I didn't mean to go so deep, it just strikes a nerve with me when people say I should negotiate or communicate my boundaries. My dad had to move out because he failed to do that after trying for 20+years.", "permalink": "/r/DecidingToBeBetter/comments/qexkq5/some_people_will_try_to_stop_you_and_you_cant_let/hhy81v8/"}