{"id": "t5_2tand_t3_enur0a_t1_fe6pcaa", "creation": 1578899203, "origin": "t5_2tand_t3_enur0a", "height": 1, "replied_to": "t5_2tand_t3_enur0a", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Budhungerz", "text": "Just to a something in that I really believe in, is a diet with what my body needs to function at its best. This also includes emotionally. When my body has what it needs in it, my emotions are more stable (especially with a consistent bedtime). We're creatures of habbit. Our bodies appreciate consistency.\n\nAs little processed foods as possible which includes bread. Especially bread with sugar added to it (a lot of bread manufacturers add suggar). Rye breads and whole grain breads are best for us. Add some veg and a little fruit into the mix and this is this is the best foundation to build from.\n\nIt may seem like I'm placing too much into diet when there are many other angles to look at your situation from, but our physical health is interconnected with our mental health and visa versa, this is a proven scientific fact.\n\nI wish you the best, no matter what your family arrangements are in the oncoming weeks/months. This may sound dicky but pride is important, but so is knowing when to use some humility (as you've already mentioned that you have done by not filtering). \n\nHave you considered speaking to someone about your grief or marital issues? I never believed in mental health professionals (psychologists). In recent years, I decided to give them a red hot crack because I was really desperate. It was the best decision that I've ever made. It isn't a quick fix, but it's had the most influence of anything in my life that's helped me, aside from diet and a little but regular exercise. I'm one of those people that needs the release of regular exercise to help stabilise my emotions and mood.\n\nBest of luck to you all!👍", "permalink": "/r/DecidingToBeBetter/comments/enur0a/i_finally_actually_listened_to_my_wife/fe6pcaa/"}