{"id": "t5_2tand_t3_enur0a_t1_fe9q5ta", "creation": 1578940455, "origin": "t5_2tand_t3_enur0a", "height": 1, "replied_to": "t5_2tand_t3_enur0a", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PhannyPaqued", "text": "Firstly, I'm so excited for you having recognized this in yourself. That is a HUGE step, awareness. The fact that you are already actively taking steps to better yourself is outstanding and so difficult to do, so good on you!\n\nIf you dont mind, I want to list some resources that have helped me, my family, and my friends with our self improvement, eating better, all of it. Take it or leave, pick and choose. I'm just excited for you and want to share!\n\nThe internet is a free gym. Here are some resources I love: \nbodyrocktv: high intensity interval workouts that you can do at home or the gym, 15-20 minutes typically and little to no equipment. I used to do them in a dorm room with a backpack full of books and got into impeccable shape. Just look them up on youtube.\n\nAlo yoga: good for the mental health and the body. Made to do at home, so if you're new to yoga and worried about looking confused in class, these are super helpful. Usually 30 minute videos. \n\nEating: cookbook, Cook once, eat for a week. You gather the ingredients and prep/cook it all one day. Three main ingredients makes three different meals with leftovers to eat all week. Healthy and a huge time saver. And the meals are DELICIOUS.\n\nSelf improvement:\nLife coach school podcast with Brooke Castillo: holy moly did this change my life and my way of thinking. It's so logical and practical. Brooke helps you see the world in a different way and teaches you how to change your thoughts, thus changing your feelings. Coaching yourself to be a better version of you. It's incredible.\n\nJordan Peterson's 12 Rules for Life: read or listen to the book, or check out his podcast archive that his daughter compiles. He goes over the rules in many of his lectures. It is an absolutely empowering take on life and how to be a great human living it. \n\nJohn Gottman on marriage and relationships. This has been relationship changing for me and my husband. I'll link some of his talks here: [on marriage](https://youtu.be/AKTyPgwfPgg), and [the science of love](https://youtu.be/-uazFBCDvVw)\n\nAnyway, these are my favorites. I hope they can help you or someone else in this thread!", "permalink": "/r/DecidingToBeBetter/comments/enur0a/i_finally_actually_listened_to_my_wife/fe9q5ta/"}