{"id": "t5_2tand_t3_icc6vg_t1_g21r5u8", "creation": 1597795751, "origin": "t5_2tand_t3_icc6vg", "height": 1, "replied_to": "t5_2tand_t3_icc6vg", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "FlameoThotman", "text": "Two things: perspective and small change. Both of these can be huge in my experience. \n\nThere’s a story I heard a counselor give once: she was helping a very obese man who came to her wanting to lose weight. He believed that he could not get better. His father was obese, and his father was obese, so he was doomed to it. He couldn’t walk. The guy would drink two 2-liter cokes on the daily. The counselor simply asked him to switch one of those 2-liter cokes into a Diet Coke for that first week. The next one, she asked him to switch the other one. Soon, he bought a mechanical bike and began peddling while watching tv. Soon after, he began learning to walk. Every week, he would come into counseling and ask: “so what are we going to change this week?” \n\nI find that story very inspiring. It emphasizes to me the importance of small change. So, my advice is to figure out what exactly you want to change, and then do so now. With this, a perspective change is essential. You can’t believe you’re a failure, or doomed to be one forever, or else it’ll become a self-fulfilling prophecy. Change your perspective - be proud of your achievements, however small. Forgive yourself, however often. \n\nI know a lot of this sounds in-the-air, so for some more concrete advice:\n\nYou mentioned you stay up super late and get mad at yourself for it. You have two options here - go to bed just 5 minutes earlier than usual (starting small) or begin to love this about yourself (change your perception). Both can work together as well. If you start to go to bed earlier, then you could be proud of yourself for doing that, which would help outweigh all the negative and begin to form a new perspective. \n\nMake a list of things you love about yourself. Hold onto that. Maybe even write a letter to yourself trying to empathize and understand why it is what you do, telling yourself it’s ok. I’m currently working through an autobiography for my own life, and going back over all the things that have happened in my life has actually allowed me to become much more empathetic and forgiving toward myself. \n\nHope this helps.", "permalink": "/r/DecidingToBeBetter/comments/icc6vg/ive_17f_decided_to_be_betterbut_have_no_idea/g21r5u8/"}