{"id": "t5_2tand_t3_oa8hgx_t1_h3glbrs", "creation": 1624987076, "origin": "t5_2tand_t3_oa8hgx", "height": 1, "replied_to": "t5_2tand_t3_oa8hgx", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CasualSky", "text": "This is probably very negative in terms of Psychology and addiction, because I do believe that there is video game addiction and that it’s a serious issue. Everything can be abused, and if you see it as unhealthy then it probably is!\n\nAnd I know playing video games is okay too, I just want to dive in the deeper part of this because I also have a big involvement in video games.\n\nIn some ways, video games are like any other hobby to me. If someone paints all day, every day, it’s probably not the healthiest, but if it makes you happy then it can be good in smaller doses like you’re saying.\n\nBut what separates a professional from the every day person in terms of healthiness? A professional artist does art all day, and while they make time for themselves, art is their passion and job too. \n\nSimilarly, A professional video game player, or streamer is playing insane amounts of video games every day, and it’s really honing the craft. A professional overwatch player HAS to play overwatch pretty much every day and constantly practice to maintain their edge.\n\nSo I guess in my mind, it’s very unhealthy if you have a life you’re trying to plan and college. Unhealthy for the average person, who doesn’t plan to make a job out of it. But if you wanted to become a CSGO player/streamer then playing it a lot would really just be seen as practice/work instead of an unhealthy hobby.\n\nEveryone knows themselves best, and you should do what feels best for you always. I’d want to know the opinions of others though, because it’s easy to view video games as something more of a distraction or hobby than a career. Everything is unhealthy in its own way, and video games are definitely unhealthy. But so are sports, and coffee, and everything. \n\nAt the end of the day, it’s a balancing act. Whatever’s important to us will be our priority, and if video games are hurting more than helping in your goals than send video games out on their ass. Lol", "permalink": "/r/DecidingToBeBetter/comments/oa8hgx/after_wasting_literally_all_my_life_playing_games/h3glbrs/"}