{"id": "t5_2tand_t3_oa8hgx_t1_h3h2anb", "creation": 1624994377, "origin": "t5_2tand_t3_oa8hgx", "height": 1, "replied_to": "t5_2tand_t3_oa8hgx", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "pretendering_", "text": "1. receptors in our brain designed to react to cannabinoids literally means nothing in terms of whether we should have the drug. not sure why this is relevant (unless you are making the argument that because it's \"natural\" that we should do it). the natural extension to this argument is that all drugs have some sort of \"receptor\" because they get you fucked up. that doesn't mean you should just do them. besides, what's the overall thrust of this -- that we were BORN to consume weed? or maybe, we have evolved to consume weed. we also evolved to have acne, appendixes, etc. that doesn't make them important to our overall being. you could make the argument this was an ERROR in evolution (although i wouldn't make that argument because i mostly think having these receptors is a pointless fact). \n2. sure. again not sure the relevance but i acknowledge this fact. what i would say, albeit anecdotally, is that a person that smokes weed every day for 50 years likely has issues in their life stemming from smoking weed. again, not backed by data (because of the aforementioned issues you mentioned) but it's not that big of a stretch.\n3. really not a great point here. you think you should treat your mental illness with a psychoactive drug which induces paranoia? come on. \n\ni think the problem with how you framed addiction here is that it's as if none of the issues with addiction stems from the drug themselves. not all addictions are in the form of untreated mental health issues. not all addictions are uncontrollable issues stemming from your personal life, either. some addictions (and I would say a good portion of them) stem from the drug themselves. a drug that gives you euphoria does just that: gives you euphoria. a euphoria you CANNOT get by simply solving your childhood trauma or going for a hike. \n\nlearning coping mechanisms for when you feel cravings, mitigating those feelings by distraction and ultimately consuming something which has LESS of a negative impact on your life is the way to go. but you can surely blame the drug. i haven't had an issue with ANY other drugs in my life. i don't particularly have an addictive personality either. meanwhile, weed was the *perfect* drug for me. the intoxicating nature of how i felt specifically while on that drug is just what did me in. just some food for thought though i appreciate the points you made.", "permalink": "/r/DecidingToBeBetter/comments/oa8hgx/after_wasting_literally_all_my_life_playing_games/h3h2anb/"}