{"id": "t5_2tand_t3_q3h0vh_t1_hft3m5d", "creation": 1633660246, "origin": "t5_2tand_t3_q3h0vh", "height": 1, "replied_to": "t5_2tand_t3_q3h0vh", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rocksteady2R", "text": "handful of thoughts, take it for what it's worth.\n\n* therapy has been utterly invaluable to me, if it is anything like that to you, be sure to keep at it.\n* at 7months you ought to have pretty well put it all on the table by now, so you know what you gotta get at with any new one.\n* consider treating it like a barber for a while.   And by this, i mean - I treat my barber as pretty much a sacrosanct relationship.  I spent about 14 months and 8 or 10 barbers till I found my guy.   I gotta love and trust my barber.   I gotta see that he has the skill to do what he needs to do with my ugly mug.  I gotta trust that he'll have some empathy for my derth of skill with small talk, an I gotta trust what he puts into the big topics we cover.  \n* I do say this knowing and acknowledging that I got mostly lucky with my therapist.   first one blew goats, second has been an Ace-in-the-Hole.\n* My Therapist consented when I asked to record my sessions.   I was/am able to play them back on my commutes.  This was a huge change to how i was able to absorb my therapy. I cannot recommend this highly enough.  You ought to be able to slap an audio recorder program on your phone/computer, and then, perhaps you can sneak re-listens in somewhere in your day.  There are some haircut conversations I wish I'd recorded.  That man is close to his God, and I love him for it.\n* remember that second bullet point - *I say* \"don't  bother letting her 'get to know you' - throw that big ugly shit up on the table and see how the therapist reacts to the thick of it.\"  That'll let you see their mettle, and you can pass judgement from there.  You know if the barber sends you out the door looking like shit, you don't go back.   \n\nThere we go.  thanks for letting me ramble and give unasked for advice on how to get a new barber... err... therapist.", "permalink": "/r/DecidingToBeBetter/comments/q3h0vh/my_therapist_is_breaking_up_with_me/hft3m5d/"}