{"id": "t5_2tand_t3_mmiqz5_t1_gtrwsfr", "creation": 1617857257, "origin": "t5_2tand_t3_mmiqz5", "height": 1, "replied_to": "t5_2tand_t3_mmiqz5", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Dareelbomb259", "text": "Okay, firstly let me say, there is no reason to apologize for this post. You can't get help if you don't ask for it. Secondly, you are doing the absolute right thing by asking for help. Whether or not this is the best place to ask for it (as opposed to a doctor, your mother, etc.) I can't tell you. But I can tell you that you are doing the right thing by asking for help. Also, quick disclaimer, I am typing this on the Reddit app (where even if I hit enter to make a new paragraph, it merges the whole thing), so I apologize in advance that topics aren't separated or organized. Now, I am not a psychiatrist or anything (I just have my own experiences), but I think that the best thing you can do for yourself is get yourself grounded. For me, that meant getting back to a place of normalcy. I was in the hospital for 5 days, and after I got out, nothing felt the same (I still had two months of outpatient treatment). I remember crying when I was doing laundry because not even that felt the same anymore. Now, I was able to get through my recovery process differently, but the bottom line is you need to get back to a sense of normalcy. Later on, everything will go back to feeling normal, but for right now, the best way to go about it is to do something every single afternoon/evening. Something you enjoy. It can be working out, reading a book, walk the neighborhood, laying in a hammock, whatever. The choice is yours (though I wouldn't recommend things that can get out of control like video games). And you can put whatever minimum time each day on it that you want (if you get to enjoying yourself, don't feel the need to make a \"maximum time\"). But the most important thing is that you do it every day (preferably at the same time each day). This will be the first step in getting grounded. And no matter how your day goes, you will always have this 'ritual' to look forward to each day. And it doesn't have to be some grand thing that you do, like work for half an hour on a project. It just has to be highlighted as that thing you do each day. Obviously there's plenty of things we do each day (eat, sleep, drive, etc.), but we do them without thinking.  This will be something that you can get a sense of normalcy from. I know this may not be the end-all-be-all to your problems, but it's a start. I do genuinely hope things get better for you. And please please PLEASE feel free to message me before ever decing to go where you can't come back. Aside from when I'm sleeping, working, etc. I will gladly stop what I'm doing to help.", "permalink": "/r/DecidingToBeBetter/comments/mmiqz5/i_need_help_mental_health_story/gtrwsfr/"}