{"id": "t5_28vigg_t3_lgzb3u", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "Long, dumb post but thank you to whoever reads it. Triggers are physical and sexual abuse.\n\n\nI’m a 29f and have thought about nonexistence since I was 9 (writing I wish I was dead in multiple journals). I’ve done therapy, antidepressants and have hobbies - I’m one of those “you wouldn’t know it” people as I am strong, attractive and extroverted on the outside but my inner thoughts never reflect this. It’s like I’m faking it to the world. \n\nIt never got better, things have only taken a downward turn the older I get. I have epilepsy and was diagnosed at 15 which was so bad at one point, I had to drop out of college and I continually have bouts of not being able to do anything due to my seizures and have missed out on a lot of different experiences because of it. I try and tell people I don’t let it hold me back, but it constantly does, just with side effects alone, but most people when I complain to them or back out of stuff for fear of having a seizure gets people calling me lazy, whiny or just uh-huh me to move onto the next topic. \n\nMy first serious relationship was with a physically abusive man who sent me to the hospital for a concussion. My second relationship was with a man who ended up sexually assaulting me and also groped me while having a seizure (who know how many times that happened before I found out) who I tried telling friends what happened years later and most didn’t believe me so I lost a lot of “friends” and my third serious relationship was a very close friend who developed a serious drinking problem while dating me. He changed completely. When we broke up and I left the city, he told me that he was doing much better without me around. He was my only real love I’ve had. Moving to this new city has been absolutely terrible. The people are mean, drivers are insane, snow is awful and I’ve been in a car accident (no injuries), got my car stuck in the snow twice and have been having zero luck with my art (something I did well in before moving), zero luck in meeting people (of course it’s covid but it still hurts) and the only people I hang around are my roommates who are very supportive and helpful, but not enough that the benefits of suicide outweighs the negatives. For everyone. I know those negatives are very trivial things but it’s just a reflection on my lack of feeling this will be a new start, just a “I still don’t have a place to feel comfortable and at home.”\n\nSo...it never has gotten easier for me. When I look at “happy” times in my life, it was all superficial stuff that showed I was outwardly happy but not genuine happiness (besides with the recent ex who I loved, but even then I just wished I could die). I constantly think about ways to die - get a gun, drive my car into something, overdose, but I’ll never be brave enough to do that. I also know my family would be heartbroken, but I also know they would eventually be ok because I am the “failure” child. I had a lot of promise in me where a lot of pressure was put on me to succeed and get a degree because I was so great in school, and now that I did not live up to that, it’s even another thing. \n\nPeople say if you’re an abuse victim that it isn’t your fault, it’s the persons fault. But I clearly stressed my exes enough to turn to alcoholism (the first two were extremely heavy drinkers) and I don’t even have close friends. \n\nI don’t have hope anymore. I don’t have questions. I just wish it was easier to kill myself and even therapy doesn’t help. I’m exhausted and tired of continually finding a new rock bottom. It hasn’t gotten better in 20 years, what makes me hopeful it’ll get better as I age, where my health will get worse and worse. \n\nSorry, just a rant I needed out. I’m slowly losing it and mainly just want to crawl into a hole. Living sucks.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/lgzb3u/been_wishing_i_didnt_exist_since_i_was_9_and/", "title": "Been wishing I didn’t exist since I was 9 and twenty years later, it’s gotten worse.", "social_network": "reddit", "user": "gingerbeesnazzy", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 11, "down_vote": 0, "creation": 1612979575, "permalink": "/r/Suicidal_Thoughts/comments/lgzb3u/been_wishing_i_didnt_exist_since_i_was_9_and/", "nsfw": false, "first_save": 1635429020.1743872, "replies_charged": false}