{"id": "t5_28vigg_t3_jf6xq0", "request": ["fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "Part 2 of my rant\nThis story doesnt include and abuse but does involve emotional situations.\n     At the age of 14 I started having depression and suicidal thoughts, I never told anyone and on occasion and in certain situations I would black out and come to in the middle of attempting suicide. Whether it be hanging my self, cutting, pills, walking into traffic and so on. It feels weird typing this as it's the first time I'm sharing it. In my late teens I pland on ending it a week after my 18th birthday, I drove out to a secluded trail and posted notes and signs so it would traumatize whoever found my body. I loaded my .22 ride stuck the barrel and pulled the trigger... click the bullet miss fired and didnt go off. I sat there with the barrel in my mouth for around 30 minutes or so I dont honestly know. It wasn't until some lady came up to me and pounded on the window, she had peer panic in her eyes. I turned on my car and rolled down the window throw the rifle to the passenger seat. Nothing was said for a few seconds till I asked how her day was which made her crack a little smile which was cute. She let out a sigh and said not the way she thought it would go, in which I responded with yea I can see how that could be. She asked if i was ok but before i could respond i drove off. On my drive I planned on what to do now, which I had no idea what it was. I need up deciding that every year if I was at a low point I would do the same, and so I have. I've only been at the low point 4 times since then, and each time with a fail attempt, and every time after I would go home and hangout with my roommates as if nothing happened, go to work as if nothing happened.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/jf6xq0/part_2/", "title": "Part 2", "social_network": "reddit", "user": "Boring_rant", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1603258100, "permalink": "/r/Suicidal_Thoughts/comments/jf6xq0/part_2/", "nsfw": false, "first_save": 1635429632.5291953, "replies_charged": false}