{"id": "t5_28vigg_t3_nwmnpr", "request": ["cf81d7c0-cd42-4d3e-a15d-51251de387ba", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "Last thread I made here, I declared that I was about ready to \"end it all\". I actually went to one more therapy session and I decided that there is 0 hope of things changing for me. Don't get me wrong, the therapist is nice and all, but my issue is beyond help. It's not even gender dysphoria at this point as I am very much aware of what I am biologically (male) and I don't feel like a female trapped in a male's body. I just have this nagging disgust for my own biological sex and know that transitioning won't even make a dent in how I feel because female is not even what I am biologically.  \n\n\nTuesday I forced myself to leave the house to go drop something off at the post office and I passed by a few attractive women, which made me instantly regret leaving the house. I hung out with a friend and went to a few malls and same thing occurred. There is NO escaping these feelings. When I want to motivate myself and \"work on myself\" I have that tightening knot in my stomach that makes me lose any motivation whatsoever. I am suppose to do my hobby that I was once mighty high on this weekend and I am not even looking forward to it (as had been the case since beginning of May). Like I actually want to cancel my plans this weekend. I also feel like giving away all of my possessions because life is just empty and dull and f\\*ck all.   \n\n\nSunday (before Tuesday), I attempted to go on my nightly 5 hour walk and within 25 minutes I wanted to break down and cry because the pain internally was way too much. I turned around and hurried home and had an anxiety attack. Same thing happened last night. Whenever I see people who I wish I was (either irl or online) I just want to break down and cry. I feel trapped and nothing is helping. Therapy will not help and at this point, it just doesn't seem worth fighting. I even told my mother about my biological sex problem and even though she is open minded about this, she did not know how to help since I am adamant about not transitioning, taking hormones, dressing up like a female. Just the thought of the ugly male body in women's clothes makes me want to throw up (The male body is what makes me want to).   \n\n\nMy therapist and even the only friend I told about this suggested that I dress like a woman either at home, or in public if I feel confident enough, but ew no thanks. That doesn't change what I am biologically. That doesn't change the fact that I went through my adolescence as the very sex I despise. I am a male internally and externally and nothing will change that. Not surgery, not fake hormones, not playing dress up, nothing! I told my mother about my desire to commit suicide and she said she could not condone it even though I am clearly in a lot of misery. At some point though, I need to do what is best for myself despite other people's reservations.   \n\n\nI am at a point where nothing will help and it makes no sense to keep on forcing myself to live like this every day. I will always be miserable, always be exposed to my triggers and will just keep feeling nothing less than extreme despair. I am mentally, emotionally and physically exhausted from just being alive and the idea that I will have to live this way for another 10+ years if I don't end my own suffering scares the sh\\*t out of me.   \n\n\nThere is no help for my situation.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nwmnpr/im_pretty_much_ready_to_quit_therapy_and_just/", "title": "I'm pretty much ready to quit therapy and just want to have the courage to quit everything.", "social_network": "reddit", "user": "LifeBytes123", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1623328914, "permalink": "/r/Suicidal_Thoughts/comments/nwmnpr/im_pretty_much_ready_to_quit_therapy_and_just/", "nsfw": false, "first_save": 1635429222.9233108, "replies_charged": false}