{"id": "t5_28vigg_t3_io2nhp", "request": ["fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "7 months ago, I posted a textpost here in this subreddit seeking help on writting and planning suicide. I was done with life and I wanted out immediatelly. I found myself as a parasite, a leech to everyone's happiness. I felt like a monster, I hated every aspect of myself. I thought that I didn't bring any good to this world and that eliminating me would lift off the weight on my loved one's shoulders.\n\nOn July 6th this year, I attempted. I downed some cough medicine and cold medicine but it wasn't enough for me. I keep getting fed heavypills by my parents if I ever fall sick from a simple cold. I think my body just grew accustomed to it. I wrote my suicide letters, gave it to a person I trust, and I slept my night away with an intense headache, fastened heartbeat, and I was literally suffocating away as everything started to black out. I felt serene when I couldnt see anymore and thought to myself I was dying.\nThen I woke up with two warm fingers on my cold neck. I felt like my stomach wasn't there, I couldn't feel my diaphragm, like it was hollow. Cold sweat and blurry vision accompanied my wake too. My parents were notified by the friend I sent my letters to. Amazingly he got a hold of them, he never even knew them, I survived that day.\n\nFirst thoughts I had were of dissapointment, on how I can't even kill myself properly. How devastated I was to reality. Then things started to shift. The first days were harsh, I kept feeling sick and uneasy, couldn't eat anything but porridge and water. Being force fed coconut milk was awesome too. But all in all, my vision was cleared. I see the light in the tunnel, not at the end of the tunnel, but around myself and just places that don't have to be the end. I can make my own spark now, and I'm positive everyone else can too. \n\nWhat Ive learnt:\nOnce you get beaten down theres no way other than up. Reality isn't as grim as we think, well in the past it wasn't as grim as I thought. Really I got a reality check, these grim thoughts were all really just delusions that our brain decided to just pull up. Anxiety, overthinking, paranoia, fear, all of that. There are things that we can control, and things that we can't control. We can't make everyone think of us positively, its up to them to decide, and if you think what you are doing is good already, then it's all fine. Intentions matter. Things that are in the past will stay in the past. We must and should focus in the present where all our actions will determine our future and be inscribed into our memory. The future is something to hope for and something we can mold. We can't expect life to be wonderful to us always, there is always a balance in things. To live is to literally suffer, that is true, but to survive is to find meaning in that suffering.\n\nPhilosophers/PhilosophiesI recommend reading and questioning your life to (but not to the point of meaningless)\n- Stoicism (plenty of philosophers talk about this, watch Pewdiepie's video on it. While I wasn't introduced to it through him, it delves quite enough into it)\n- Taoism (Buddhist monks)\n- Friedrich Nietzche (Nihillism)\n\nYou can do this. Believe in yourself.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/io2nhp/surviving/", "title": "Surviving", "social_network": "reddit", "user": "roenikoooo", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 11, "down_vote": 0, "creation": 1599461333, "permalink": "/r/Suicidal_Thoughts/comments/io2nhp/surviving/", "nsfw": false, "first_save": 1635429628.3290832, "replies_charged": false}