{"id": "t5_28vigg_t3_pz0oon", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "51818c1f-9070-43a1-96e3-b1b348ef35e0"], "text": "I wrote this with the intention of it being a note to my parents. \n\nPosted on a throwaway porn account because I don’t want my friends to see it and make them feel like I’m a burden on their life. \n\nI’ve been thinking about killing myself for the past year or so maybe. It was always a thought in the back of my mind but over the past two months it’s been something I’ve been thinking about daily and have seriously considered it a couple times. I don’t remember when I started feeling really depressed. I think it was right around the time Covid hit and I started to realize that I have no passion, no drive, and no idea what I want to do with my life. \nTaking even two classes is a struggle for me. I constantly forget stuff and Idon’t like the creative writing course I’m taking right now. It doesn’t focus enough on the actual writing aspect and just focuses on a bunch of other bullshit like a journal entries about what we did every week. This class has sucked any joy I have for writing out of me because it feels like a chore now. It feels like I’m just going through the motions trying to reach that next step but I don’t even know what the next step is. High school I actually enjoyed because the teachers actually gave a shit about you but that’s not real life. In real life no one cares about you. College is boring, tedious, and does absolutely nothing to serve me. I just don’t care about anything anymore. I don’t hate every minute of life. There are certain times where I go and do things that are really fun. Both of those times that I can remember most recently were with a friend on camping trips, but those are such a small portion of my life that I’m happy for, and I’m absolutely miserable for the rest of it. There’s just no way in life that I can be happy all the time and it’s too much work to to survive to be unhappy for most of your life just to have a few times when you’re truly happy. Over the weekends when dad leaves I feel more alone than ever and everything starts to blur around the edges. It feels like I’m living in a dream. I cant even tell what’s real anymore. I’m just too worried about my future and being happy. I see all these people struggling at dead end jobs going nowhere in life and they somehow don’t just break down constantly. I know you say if I want to improve my life or strive for some thing better after work towards it but I don’t want to and I’m scared to. My memory is getting worse too. I can’t remember anything from middle or high school. It’s just a big mess of faces and places. I don’t even like watching movies anymore. It feels like a chore now, everything in life feels like a chore, even just waking up in the morning. \nIt’s getting worse by the day and I don’t know if or how you’re going to be able to do anything about it but I just needed to share this with someone", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pz0oon/really_just_needed_somewhere_to_vent_and_someone/", "title": "Really just needed somewhere to vent and someone to know what’s going on in my head", "social_network": "reddit", "user": "Y45028", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1633063156, "permalink": "/r/Suicidal_Thoughts/comments/pz0oon/really_just_needed_somewhere_to_vent_and_someone/", "nsfw": false, "first_save": 1635428842.8075528, "replies_charged": false}