{"id": "t5_28vigg_t3_q6z39c", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "I'm a father of 3 and a husband. I feel like a failure... the 5 of us live in one room, and i sleep on the floor most nights so that my wife can share a bed with one of the kids.\n\nI had this game plan for sucess but it all fell apart.\nI had dreams, and things i wanted to see and do...\n\nI threw those all away so that i could focus on providing for my little ones and my wife.\n\nI'm unhappy... I love my family but every time I see them, I'm reminded of all the ways I have failed them and continue to fail them.\n\nMy job pays decently well for what i do, but i hate it...\nI constantly wish that something would happen to me at work or during my commute, because I feel like I'm worth more to my family dead so they can collect my life insurance and finally get a home to call their own.\n\nI get up every morning mon-fri at 4am for work and i get home around 6-7ish... but no matter how many steps forward we take it just seems like its never enough to reach the goal post...\n\nMy wife tries to help me when she see's i'm having a hard time but shes always working when im home, and when we are together i dont let her see how i really feel below the surface of my emotions because i dont want her to worry about or know how broken her husband really is...\n\nI feel like i am the anchor holding my family back instead of being the rock that lets them weather the storms...", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/q6z39c/i_feel_so_lost_that_my_life_has_lost_most_of_its/", "title": "I feel so lost that my life has lost most of its joy", "social_network": "reddit", "user": "Rando-the-Mando", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1634083619, "permalink": "/r/Suicidal_Thoughts/comments/q6z39c/i_feel_so_lost_that_my_life_has_lost_most_of_its/", "nsfw": false, "first_save": 1635428987.5169563, "replies_charged": false}