{"id": "t5_28vigg_t3_iiw7v5", "request": ["1298478d-f218-4dd4-a918-dcb9600d82ed", "03598834-ede5-4aab-9b0a-fc5de7674c00"], "text": "I do not know who I plan to share this with or why I’m even writing it but I feel like I need to get it out.  In the end, maybe it will help others understand what I’m going through or possible even help someone who feels the same way.  \n \nMy name is Chris Cates, I am a military Veteran with PTSD and severe depression disorder. By 10:39 this morning, I killed myself 13 times, in 13 different ways… in my head.  I don’t know what it was or what exactly led up to me breaking but I did.  As I laid on my bed, I had a euphoric feeling and felt like I was floating above myself watching.  My brain and my body were urging me to walk into the garage, get my 12 gauge and finish myself off.  I don’t know if it was my soul or my heart that was stopping me from doing it but it made my body physically hurt as I fought the urge to stand up and go….  I begged my son to lay with me and hold me.  I realized I was freaking him out so I let him go.  My dog at this point was stand with his front paws on my bed watching knowing that something was wrong.  He jumped up and immediately took my sons spot in my arms.  All of this helped but the urge was still pulling me.  I went through the normal steps of breathing and thinking about all the good things in my life, all the people that depended on me and loved me…  Even if I am often an asshole, but still the urge was pulling me and the pain was so intense I couldn’t help but scream and cry.  I know I was manifesting the pain but had no way to stop it.  Eventually I had to get out of my house and away from the thoughts of what was waiting for me in my garage.  As I drove, I was still floating but the pain went away.  I was still thinking about killing myself but the physical urge was gone.  I don’t remember driving…  I don’t remember turning…  I don’t remember parking, but before I knew it, I was in a Walmart parking lot.  I laid back in my seat and listened to “I feel like dying” by Lil Wayne 7 or 8 times.  I had gone to Walmart for a reason but couldn’t think of why so I just sat in my car and felt sorry for myself.  Eventually I got a message on my football team’s app asking about the game later today.  I immediately remember I needed ice and Gatorade for after the game.  As I walked through Walmart, I went out of my way to be nice and courteous to everyone who came near me…  Not trying to brag I did it for a selfish reason.  I needed someone to be nice or kind to me.  To my surprise, almost 100% of the people I interacted with were polite and talkative, almost like they could feel something wrong with me, or that I needed that from them.  I eventually made it back home where I am now pouring out my feelings.  My thoughts are clear and the urge is gone but the damage has been done.  My wife and kids are at the mall…  My wife who is afraid to go into 7-Eleven because of COVID would rather risk the mall than be around me right now and I get it.  I will be fine and I will do everything in my power to repair my relationship like I always do, but in the back of my mind I always wonder is this the last straw for her?  I hope not but understand if it is.  She knows my past and knows what I’ve been through but I know she can only take so much.  I will always love her and my kids and put them before anything else but I am scared I’m pushing them away.  I pretend like I have my mental issues in order because I take my medication daily and I go to the VA twice a year to tell them I’m fine, but that is all bullshit.  I’m not fine…  I wish I were strong enough to go sit down with someone and tell them everything I saw and everything that happened to me, but the thought of it scares the living shit out of me.  In the past 12 years I have had come to Jesus moments where I went through all the steps to set up regular counseling and each time I pussy out and don’t show.  The scary part of all of this is that the VA, knowing my issues and where my head was at, at that time, never reached out or called to see what’s up.  Each time I received a letter in the mail, weeks later, saying I missed an appointment and to “call this number to reschedule.”  I’m not trying to put them blame on them… In the end it’s my responsibility to be there but my fear is stopping me.  I served in the military from 2002 to 2008.  I have so many surgeries that I have lost count.  I wake up every day in pain.  I’m lucky if it’s just one of my problem areas, but I’m sure that doesn’t help my mental state.  I saw some fucked up shit and some terrible things happened to me.  As much as I push it all down and drink the thoughts away, they still creep into my dreams.  To the point where even though the nightmares only happen every couple of months, there is a reoccurring person in my dreams, from one of my memories, that started as a night terror and now she is living and interacting in my dreams like a normal person.  How fucked is that?  I have pushed it down so deep that I have normalized a dead person to where she now alive and interacting with me in my dreams.  I have never said that to anyone and reading it back makes me realize how crazy I might be lol.  \nIf this gets out and you took the time to read it, I’m sorry for the rambling and the poor me shit…  I honestly have an amazing life that my wife and I have built.  We have three beautiful kids and three awesome dogs.  We live in a big house, in a quite suburb, and have everything we want or need.  All of that makes it that much harder for me to wrap my head around morning like today.  I say that I could never do anything like that to my wife and kids, but honestly how much more damage am I doing with constantly being an asshole to them.  Would they be better off with out me?  Not necessarily dead, but out of the picture.  Do I do more good than harm?  These are question I need to figure out for myself and take the appropriate actions to fix them.  Here come the cringy ending…  I am NOT OK and that is OK.  I need to start taking responsibility for my own mental health.  I’m tired of walking around and acting like I have my shit together and making everyone think I have the perfect life.  I doubt they think that but you understand what I’m saying.  ", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/iiw7v5/i_broke/", "title": "I Broke", "social_network": "reddit", "user": "Evil_Genius1721", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1598721472, "permalink": "/r/Suicidal_Thoughts/comments/iiw7v5/i_broke/", "nsfw": false, "first_save": 1635428925.5484812, "replies_charged": false}