{"id": "t5_28vigg_t3_hferve", "request": ["20e5f323-e2c4-450a-8af3-177af94313bf", "b4d8161b-7016-486a-a4bd-5fb6a5aa639e"], "text": "I don't really know if this is the right place to put this but I need to get it off my chest and perhaps advice.\nI got in a fight with one of my closest friends. We had an argument as he had gotten drunk and forcefully tried to manipulate me into having a romantic relationship with him. He was very very drunk so I understand that maybe he never meant the things he said but I freaked out regardless as the forceful manner in which he was speaking in reminded me of an experience ive had in the past. I got insanely upset and shit the conversation down really fast with an \"I'm going to sleep I can't talk right now\" and it wasn't revisited until tonight. I was in bad mood and for whatever reason I decided to bring up the fight to him and discuss the way he had talked to me. This started an even worse fight than before though it was one sided as I was the one getting mad at him and he was trying to apologise. I may of taken it too far with the argument and said things that were too harsh which I regret immensely. Once our argument around an hour goes by and all of a sudden I'm getting calls left right and centre from friends asking if anyone is around to meet up with him and try calm him down and stop him from doing anything (it was 2am no one was around) . He had set out to end his life. All because of an argument with me. I feel so fucking horrible. What if he had done it? I literally wouldn't of been able to live with myself. I fucked up so badly with ever bringing up the argument. I was just scared and hated the way I was treated but I wish I had just shut up for once. I know from this day forward he's going to cut ties with me so I guess I've lost him in that sense. I really cherished out friendship as he was like a brother to me and I've never been so open to someone but i guess i ruined it. I'm thankful he's okay but I feel so horrible for ever triggering that in him.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/hferve/my_best_friend_set_out_to_kill_himself_because_of/", "title": "My best friend set out to kill himself because of me", "social_network": "reddit", "user": "cry_baby420", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1593053776, "permalink": "/r/Suicidal_Thoughts/comments/hferve/my_best_friend_set_out_to_kill_himself_because_of/", "nsfw": false, "first_save": 1635428959.5582774, "replies_charged": false}