{"id": "t5_28vigg_t3_pci8j3", "request": ["7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "I have recently been looking through people's posts, and I felt like my issues paled to the amount of people who actually had *solid* plans to die. Yes, I want to die. But I'm scared of the things I'll leave behind. What if I regret it last second, what if my last memory in the world is just pain? I'm sorry if I sound immature or ignorant about this. \n\nI don't normally want to die. Everyday is normal, but there are sudden periods where I will want to die. I feel sad and empty, nothing really matters and I can't stop crying at small things. These periods are increasing gradually; it once was once a month and now it's more frequent.\n\nI don't want to get professional help, as much as that sounds weird. I don't want my family to worry over me and have someone see me and judge me. I'm afraid of pain. I don't want to hurt myself, so I just sit here and cry for no reason.\n\nMy family and I have different religions, I don't know how. In my religion, suicide would land me in hell. I don't want to go there. Please don't make me go there. I've heard such horrifying stories about that place. As a child, I was so scared of that place that even writing the word 'hell', let alone saying it would scare me. It still scares me. But what scares me the most is that sometimes, I'm sad enough to accept the fact that I'll go to hell.\n\nI've made plans. I've thought about how to die. I have a few friends who I know are suicidal as well, but I can't seem to confide in them about the feelings I have, instead I try to help them. I keep smiling, worrying over them and acting fine. I want to tell them but I don't want to at the same time.\n\nI hate this. I hate this so much. But I still want to die.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pci8j3/i_want_to_die_but_i_dont_want_to_die_at_the_same/", "title": "I want to die but I don't want to die at the same time", "social_network": "reddit", "user": "xX_Leoana_Xx", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 15, "down_vote": 0, "creation": 1630047671, "permalink": "/r/Suicidal_Thoughts/comments/pci8j3/i_want_to_die_but_i_dont_want_to_die_at_the_same/", "nsfw": false, "first_save": 1635429252.9148772, "replies_charged": false}