{"id": "t5_28vigg_t3_hbo3hi", "request": ["3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "Hi, so i am gonna start this clearly, i am scared that he takes suicide, firstly my brother has no social life at all, doesn’t have any friends and in the family he never talks and is always against his family even when we are always trying to help him. Last time I saw my brother laugh was over 2 months ago and it was because my father broke his back!!! It wasn’t funny at all it was just an evil laugh. I am scared that he doesn’t have a positive mindset, he is indeed so negative that when someone wants to talk to him in school or in the family he just ignores them like he can’t hear or says something with a depressed low voice loud enough that no one can hear what he is saying. \nOne day my mom shouted at my brother and told him he is retarded and that she hated how negative he is and he will never succeed in anything and probably end up a looser and die lonely if he doesn’t change. \nA few days later my brother was in the bathroom the lights were turned off, and I heard him very clearly saying “I want to kill my self” because he shouted it out loud. My mom always calls him bad stuff even today, my brother shouted back at my mother and my father and mother started shouting while my father beater him with a belt. Today when I came home I saw 2 long scratches on his left arm (he is right handed) and I asked him from what? And he answered “oh just a cat” but my brother is scared from cats! He doesn’t like them at all, he lied, I am just assuming he is self harming, I am just crying scared that he is actually close to commiting suicide. I am trying to help but sit doesn’t work, he doesn’t want to talk to me and my mother and father always are angry and hit him and call him stuff that usually makes him depressed or heartbroken. 2", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/hbo3hi/my_brother_might_take_suicide_i_need_help_fast/", "title": "My brother might take suicide, I need help fast!", "social_network": "reddit", "user": "KingKroom", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1592517932, "permalink": "/r/Suicidal_Thoughts/comments/hbo3hi/my_brother_might_take_suicide_i_need_help_fast/", "nsfw": false, "first_save": 1635429581.397845, "replies_charged": false}