{"id": "t5_28vigg_t3_jnitru", "request": ["6587bfb5-f909-4bd9-a1eb-ee7504e47d40", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "I'm an 18 yr female with 5 younger brothers. I was born into a toxic and just straight up bonkers ass family. My mom had bpd and i'm pretty fucking sure my dad is a narcissist. I put so much into helping my family. I tried so fuckjng hard. I tried to help my mom with her suicide attempts. Even putting her mental health before mine. I've tried to make sure my brothers are all happy and dont follow in my parents steps. All I ever wanted was a happy fucking family. But after my parents divorce it just got even worse. And now i'm stuck living with my dad. Hes so fuckjng mentally abusive. He would always fucking tell me how i'm fat or weird or he would say i'm not doing enough to help out. Hes kicked me to the ground for no reason, pinned me to the ground, threw pop at me. Hes made comments about my chest size when I was a child. And my mom didnt care. Shes just as bad as him.  We've gotten into fist fights, shes called me ugly, shes called me dumb. She yelled at me about my fucking grades while I was having a panic attack crying on the fucking floor. None of my family members actually fuckjng care about me. None of them. I feel like even my friends dont care about me. I'm there for all of them but they're never there for me. And today. Today my somniphobia got worse and i'm under so much fucking stress and my dad picks today to be mean to me and yell at me. I cant leave my fucking bathroom. I feel like just exploding and fucking stabbing myself. I've never had anyone help me through my fucking childhood. All I had was anger, anxiety, and sadness. For a whole year I tried my best to better myself for my family. I tried so fuckjng hard. I havent yelled at my siblings in a whole year. I kept my anger in. Even when they stole $600 I stayed calm for them. I genuinely dont want to live without a happy family. I genuinely cant do it. I just want to stab myself until I cant anymore. I want to fucking die. I'm tired of trying. I am so fucking tired. I dont know why I had to be born into this. I dont know why. With all this anger and sadness I've been through I just dont want to be alive. I always think about ending it but today I just cant keep being here. I have nothing to live for. I have none to talk to. I fucking cant", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/jnitru/fuck/", "title": "Fuck", "social_network": "reddit", "user": "FrancisArh", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1604437520, "permalink": "/r/Suicidal_Thoughts/comments/jnitru/fuck/", "nsfw": false, "first_save": 1635429313.4476943, "replies_charged": false}