{"id": "t5_28vigg_t3_og0oxv", "request": ["20e5f323-e2c4-450a-8af3-177af94313bf", "7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "I am not doing good. I am not happy and I’ve been depressed & suicidal since I was 13 years old. That’s a long time to be so sad. I’m so tired of being sad. I’ve attempted suicide 2 times where I failed and I think I failed on purpose because my mom found me and knew I wasn’t coherent and made me fess up and took me to the hospital. \nIt hurt her so terribly which really holds me back from doing it. I’ve done numerous treatment programs and nothing helps. I know implementing the things you learn is important and I would but it didn’t help. \nNothing is even particularly wrong with my life. I just hate myself and i am so fucking depressed. I’ve been on different medications too which have given me awful health problems  along with them and they didn’t even work either.  I have bipolar 2 disorder I don’t get manic to often but I get extreme depressive episodes on top of being already depressed but it hits me like train. I wake up and I’m just like why am I still breathing, I’m exhausted I want to die. & I literally can’t think about anything else other then dying for days straight and it’s so sad. \nI try journaling and taking walks.. \nI just am hopeless & I am tired. I don’t want to live anymore. I don’t want a future anymore. But my mom said if I ever died she would die to. And she’s not lying, I am her whole world. She would not want to live without me wether i died from an accident or suicide. I also am so sad to ever leave my doggy behind he is like my actual baby. But I just am so tired so exhausted. I am 24 years old anddd I really want to die. I am so done. I don’t want a future I don’t want to breathe another day. \nI am so so sad. I feel like my brain is broken.\nI am defeated.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/og0oxv/i_want_to_kill_myself/", "title": "I want to kill myself", "social_network": "reddit", "user": "Livbug_", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1625721779, "permalink": "/r/Suicidal_Thoughts/comments/og0oxv/i_want_to_kill_myself/", "nsfw": false, "first_save": 1635428948.903343, "replies_charged": false}