{"id": "t5_28vigg_t3_gr6i00", "request": ["82ff3069-5f28-400f-ba6f-f94d4fcede90"], "text": "I (22F) have disliked myself for as long as I can remember. You know how you have the best intentions but your own hatred of yourself makes you self sabotage subconsciously and consciously? I've tried to die a few times, most of my stronger attempts were in high school, popping pills, drinking a little bit of Savlon, but I've never had the guts to take it all the way, and I say guts because I know that others think those who kill themselves are cowards but I think it takes a tremendous amount of courage to take that final step. I've been battling self harm for almost ten years, and my negative headspace coupled with destruction everywhere I go has made it so much harder for me to have any faith in myself. I feel if I hadn't ever been born the world would be a happier place, if I were to go today, nobody would be truly too shaken because I cause more problems than happiness wherever I go, even if that's not what I hope for. I wish I had the courage to just take that step but the worst thought to top it all is that nobody would truly be affected even if I went, barring the first few days of shock, and in some ways I know that my family and perhaps even my partner (we're in rough waters and it's all owing to my wonderful self sabotaging self) would be affected for a little while, but I've got strained relationships in some aspects with all those who are close to me and I do believe my absence would bring them more peace. I've googled different ways to die so many times but I don't have the guts to take that final step, so I cowardly self harm with not too much damage to kill me but enough, to hurt in that moment and punish myself. \n\n\nIt's been a long life of never feeling like I deserve space in this world and I just want someone to put me to sleep, and if not then wake me up when there's some hope, because for all these morbid thoughts I'm a hopeless fool and believer, but my insecurities and discomfort with myself always makes me lash out and bring those to fruition further enabling the thoughts that I shouldn't have ever been born, or should go soon. \n\nI know how terrifying death can be but I just want to stop feeling this pain, and stop causing a mess wherever I go and for most of my life I've felt like a burden, regardless of whether anyone made me feel that way or not, and there are so many people who I've unwittingly done wrong who would have all perhaps been better off had I never met them. \n\nI know how much it can suck to always hate yourself and find ways to hurt yourself and have the best intentions but find everything crumbling down, it there's anyone else out there feeling a shade of these things, I just want you to know I hear you. \n\nI try to leave hurting myself but I keep coming back to that, and what's worse is I don't hurt myself deep enough to do too much damage so often I work myself up this other way, of being too much of a coward to do what the world calls cowardice, when I know it'll be a better place without me. \n\n\nI don't hope any thing with this, I've been here most of my life, there's just something that ticked me to come write here and find this page, maybe it's to know that there are a bunch of us in this boat and we can be together and not feel like the worst pieces of shit or what, I don't really know. \n\nI'm very new to Reddit so forgive me for crossing any lines if I may have. I hope all of us feeling this way find the light and find love for ourselves, I keep trying and failing. \n\n\nBut I hope one day I succeed. I hope everyone here does.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/gr6i00/too_weak_to_die/", "title": "Too weak to die 💀", "social_network": "reddit", "user": "8991_crsd", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1590529931, "permalink": "/r/Suicidal_Thoughts/comments/gr6i00/too_weak_to_die/", "nsfw": false, "first_save": 1635428814.8501635, "replies_charged": false}