{"id": "t5_28vigg_t3_kl13td", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "f85d379c-7683-42c0-b22a-e345ed46496b", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "I was 8 when I first told my mother I wanted to die. At home I was abused by my father and eldest brother, and at school I was bullied. Moving schools didn't help either, being the smallest kid in school automatically places a target on your back, plus being the 'new kid' simply added fuel to the fire. It wasn't long until I started reacting violently to the slightest aggression from others, and schools took the opportunity to paint me as the problem and deny their schools had any bullying.\n\nFast forward 20 years to 2016. After multiple suicide attempts and still never having a period in my time where I considered myself 'happy', I had at least found a social outlet. For the previous 9 years or so I had been going to karaoke nights. They weren't massively fulfilling, it was rare I ever met anyone my age and the few who I did were mainly interested in drinking, clubbing and getting laid. On the plus side though, I had a good voice, and found singing less intimidating than talking to people (though still scary as hell), so at least I had an icebreaker to rely on.\n\nLong story short, a habitual troublemaker bullied some of the special needs folk as usual and I stood up to him. The manager told us to take the argument outside. What I didn't know was that 1. he was a  trained security guard and 2. he was friends with the manager. He literally tortured me for half an hour, all while egged on by the manager, then the police turned up and I was arrested. The police refused to contact any witnesses I mentioned, illegally refused to let me make any counter-accusations and charged me. \n\nCome the day of the trial, despite having evidence of my injuries that literally disproved their version of events and despite showing multiple times they had lied and changed their stories, I was still convicted because they 'saw no reason why the witnesses would lie'... And despite it being my first offense, they went far above the sentencing recommendations of the prosecution. My attacker also claimed that, due to me biting his chest at one point when I was literally being smothered and couldnt breathe, he couldnt work for 2 weeks as he worked with food and had to get tested first. He was asked for no evidence which was lucky for him given he actually worked at a travel agents, and I was sentenced to a 3 month tag and curfew, to pay the bastard who attacked me £1000 in lost earnings and of course, there's the criminal record.\n\n2 years later (and 2 years ago) I was diagnosed with severe PTSD. The slightest unexpected or loud noise terrifies me, I can't leave the house without my mother, I can't focus on anything, I had to give up my job and have been so debilitated that I can't even look after myself, plus there is literally not an hour I'm awake that I don't think of suicide, though have been too scared to attempt after my last one 12 years ago stoppedmy heart for a while and left me with minor brain damage, affecting my memory, specch and hand-eye co-ordination. I was given 12 weeks of counselling with a trainee and received no other help, though admittedly I learned a lot during that time - odds are I've been suffering with PTSD since before I was 10, it just got a LOT worse after the incident at the pub.\n\nThe crux of it is there is literally 0 hope of recovery. In fact, things have progressively gotten worse over time. My memory and ability to either concentrate or cope with simple tasks continues to worsen, as does my depression. There is literally nothing I have to live for; no career aspirations, nobody to care for, no feelings of self-worth or purpose and no hope of any kind of relationships given I'm a 32 year old asexual with no relationship history. All I do is leech off of the state, leech off of my family and be miserable. Hell, and with the urges I get to harm/kill other people (such as the police, my attackers, my brother's abusive wife, my nephews whenever they are loud etc.), I'm legitimately worried that at some point I will hurt someone.\n\nI know that I want to die, I know that killing myself would genuinely be the right thing to do for those around me and society as a whole, but I just can't. I'm too scared; too scared of pain or suffering, too scared of the consequences of failing again, too scared that I will have not made the world better in any way before leaving it. I know I can't kill myself, but as mentioned before, not an hour goes by that I don't wish I were dead. Realistically I need someone to kill me, but euthanasia is illegal here in the UK and I don't have the money for a hitman. If I try looking up something to either motivate me to kill myself or even just type something like 'I want to die' into a search engine, you get a bunch of smiley cunts telling you 'don't do it! It gets better! You have so much to live for!' like they have a fucking crystal ball. The world is a shit place, and I know for a fact I am never going to get better or be happy. I just want to fall asleep and never wake up.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/kl13td/sick_of_everything_by_this_point/", "title": "Sick of everything by this point", "social_network": "reddit", "user": "Cacti4Cuddles", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 11, "down_vote": 0, "creation": 1609062620, "permalink": "/r/Suicidal_Thoughts/comments/kl13td/sick_of_everything_by_this_point/", "nsfw": false, "first_save": 1635429024.373448, "replies_charged": false}