{"id": "t5_28vigg_t3_ojmn7r", "request": ["6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "I don't know if anybody will read this. I don't know where to go and who to speak to.\n\n\nI never feel good enough. For anyone. For anything good to happen to me. I'm constantly doubting my abilities and skills. I never ever feel good about anything I do. I don't consider I have ever done to be an achievement. I always try to go an extra mile for people- to give more, to do more, to put in more efforts because I feel like what I already do isn't good enough. I feel like I don't even love myself. No amount of validation makes me feel good about myself.\n\n\nI've been living away from my parents for the past 11 years in another country. I haven't been able to go home for the past almost 2 years because of the pandemic and I've felt better than I ever have. \n\n\nLiving alone for so many years has given me the realisation that neither my family nor my bringing up is normal by any means.\n\n\nI belong to a culture and society in which getting married is literally the most important thing a person can ever do in their lives. As a woman, I have been put on this planet to serve my lifelong purpose of getting married, making babies and running a household. Anything I do in terms of my career or personal growth is irrelevant. According to the people who run this so called society, a woman's career only serves three purposes - a hobby till she gets married, a reason for her to find a better groom, a way to help out her husband financially in case he experiences a dip in his career later on.\n\n\nI have always been so ambitious. I've been working so hard for all these years. But nothing i do matters to my family.\n\n\nI have been constantly put down and criticized for every little thing all my life. Today my mother got upset because she's been hearing about a lot of other people getting married since I am not married yet she she simply said, \"You are not getting married because there's something wrong with you. Your expectations are too high and you're never willing to compromise on anything.'    Our culture supports arranged marriages. My body has always been on the heavier side, but I have taught myself to dress well and carry myself gracefully nonetheless, whilst constantly trying to lose weight with no avail. \n\n\nI have been taunted and tormented with the whole marriage discussion for the past 5 years now. Every. Single. Day. I've been shown profiles, pictures of 100s of men, been berated when I refused, forced to speak to them for all this while. I'm tired. I'm exhausted. They keep showing me guys who are barely educated or have obnoxious demands, showing me what they actually think I deserve. They have resorted to harshly putting me down from the beginning of time so that they could keep my head on my shoulders, but they have completely broken me into pieces. I have never had much confidence anyway and whatever I have built over the past 11 years of staying away from them is pretty shaky as well. They sit in front of me, stare at me and keep finding faults with me.\n\n\n\" Your hair is ugly, I don't like it, cut it off. Your nails are too long. Cut them and make them look like mine. You don't dress well. Your attitude is wrong. You don't cook well. Your mother in law isn't going to be happy about it. You're too slow. You need to be faster with household chores.\" My dad has taken photos of me when I was sitting on the sofa in my pyjamas and sent that picture to me a couple of weeks later saying ,\"Look at how fat and ugly you look when you sit.\" I was heart broken. I'm having to go back home in a couple of months and I've been driving myself crazy thinking what I should wear and how I should behave in my own house so that something of this sort doesn't happen again. I feel like cutting pieces of my fat and flesh of my own body just to make things better.\n\n\nFrom my appearance to the way I sit, eat, dress, my glasses, my skin, the way I speak, my attitude, the way I think - everything. Just everything is wrong with me. I'm awful. I'm terrible. Since I'm fat, I must be grateful if anyone agreed to marry me at all and I must compromise everything to be with him since he would be doing me a gigantic favour by agreeing to marry a pathetic slob like me. The other day I was being taunted because I want the best of everything. And I don't make do with anything. Because that's such a terrible thing to do. \n\n\nSometimes I feel like they don't even think I'm human. I've been very emotional since I was a child. I think and think about anything and everything anybody says to me. They get mad at me because I refuse to stay with them, but honestly, I'm scared. \n\n\nThe both of them have been at each other's necks for as long as I can remember. And most of that anger got directed at me as a child. I used to find ways of staying away from the negativity and screaming all the time. My dad was always angry. I was always walking on glass around him. I wouldn't know if he would just scream at me for no reason. Or throw something at me. Or tell me how pathetic I am. I've heard him abusing me and calling me names behind my back. Words a parent must never use for their children. For no reason at all. He just addresses me like that.\n\n\n I'm scared of going back, of being made to feel like a terrible person who isn't capable of anything. I genuinely try to get better, to try to learn. I keep trying, but I'm just \n\n\nNever good enough.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ojmn7r/i_never_feel_good_enough_for_anyone/", "title": "I never feel good enough for anyone", "social_network": "reddit", "user": "thequeeninblack", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1626203599, "permalink": "/r/Suicidal_Thoughts/comments/ojmn7r/i_never_feel_good_enough_for_anyone/", "nsfw": false, "first_save": 1635429308.749458, "replies_charged": false}