{"id": "t5_28vigg_t3_hkizb7", "request": ["1298478d-f218-4dd4-a918-dcb9600d82ed"], "text": "I made a throwaway account because I need to get my thoughts out but I’m physically incapable of telling anyone. I’m 23 years old, a military wife, I have 2 kids. An almost 3 year old and a 1 year old. I am literally thousands of miles away from my family and my best friend. I’ve lived in Virginia for 3 years and I’ve made no friends. I’m suicidal. Can’t go a day without wanting to die. The one time I called a suicide hotline the operator told me “is this an emergency? I have someone on the other line and I can’t talk to you unless it’s an emergency” and I just hung up. My body and soul feel empty. My mom was never very good at being a mom, but it was okay because I had my aunt and my mother in law. But my mother in law died of brain cancer in January 2019, having only been diagnosed 5 months prior. And my aunts son (my cousin) raped and molested me as a kid and when I told her she just.... kinda pretended that it didn’t happen. My husband and I used to be really close but he works all the time and when he comes home he drink a whole bottle of whatever good alcohol was on sale and goes to sleep. His mom just died last year and I know he’s sad too. He’s almost never home, he barely gets to see his kids grow up. I really feel for him. But he lives in his own world where nothing really matters except getting to the next day. And I can’t really blame him because I relate. But we don’t have sex anymore. We barely talk to each other. I’ve mentioned I’m suicidal and he says things like “it’ll be okay” without looking up from his phone across the room. I’ve tried begging for his attention in the past but it really gets me nowhere so I don’t try much anymore. All I want is to feel any kind of lust for life. I’ve always struggled with depression but I would have happy days on occasion. I don’t remember the last time I had a happy day. I feel awful for my kids, I promised I would be a present mother for my kids, I promised I’d do the opposite of what my mom did but all I want to do is lay in bed and cry. I’ve stopped eating. I gained 50 pounds since having kids and I’ve always had body dysmorphia and even when I was 120 lbs (I’m 5’7) I thought I was a giant fatass. Now that I’m 170 (or more? I don’t step on the scale anymore lmao) I’ve decided to just stop eating because maybeeee it’ll help me hate my life less? If I’m not so fucking fat? I know that’s not how it works but it’s hard to get rid of an eating disorder mindset. I don’t have these standards for anyone else, just me. I don’t think about cheating on my husband or anything... I don’t want to destroy his life or my kids lives. I just want mine to end. Honestly the only reason we haven’t divorced is because I don’t have the money to move me and my two kids across the country. I wish I could put into words to someone that I need help but I’m just convinced no one wants to hear it.\nWe have guns in the house. I hold mine against my head sometimes but I’ve never pulled the trigger (obviously). It calms me weirdly enough.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/hkizb7/i_think_about_killing_myself_a_lot/", "title": "i think about killing myself a lot", "social_network": "reddit", "user": "somedumbwhoree", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1593782621, "permalink": "/r/Suicidal_Thoughts/comments/hkizb7/i_think_about_killing_myself_a_lot/", "nsfw": false, "first_save": 1635428926.1612072, "replies_charged": false}