{"id": "t5_28vigg_t3_kpdmtt", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "\nIt’s been an uphill battle for awhile. Not sure where to start. All I know is I’m out of patience and willingness. My biggest failure seems to be my inability to open up enough for others to understand where I’m coming from. \n\nI’ve had suicidal thoughts since I was a teenager. My childhood wasn’t terrible but it wasn’t anything to be happy about. My lack of communication unfortunately sprouts from growing up in an extremely strict household where I had zero room to express my feelings. I had a single military father who was harder on me being the only son...oddly strict rules and expectations...I had to ask for a glass of water until I was 18...and I could only have a drink after I finished eating...I left home feeling finally free but extremely lost and judged. \n\nMy sister moved away further solidifying my feelings of being alone in the world. I spent the next few years drinking and partying trying to enjoy life instead of figuring it out. Met my biological mother between that time and it didn’t go well. Realizing my mother wasn’t mentally all there made me nervous because I am now about 4 years into metal decline myself. \n\nI felt like I needed to be something bigger than myself in order to have a purpose. I wanted to become a firefighter but was unable to get financial aid to go get a degree. I decided since my father was in the military, I too could serve my country and find a bigger purpose. \n\n9 years and 2 tours later here I am, On my second marriage. My first marriage was unfortunate. Things fell apart when I was on deployment and when I came back it ended. I had a daughter in my first marriage. Unfortunately I had extreme issues with  coparenting styles with her mother to the point that I no longer have contact. My second marriage has been for 6 years now. We had a son together. The biggest issue with my marriage lies between two broken people. My wife has had a much worse childhood and similar hardships before we met. \n\nI idolized my wife when I met her because I felt she understood where I came from and why I have the walls that I did. She was accepting of my PTSD and actually helped me get on medication. She always had my back and defended me when I didn’t see any good in myself.\n\nA lot has changed in 6 years. I was the only one working for a while when she was pregnant. Long hours, different jobs, battling night shifts while trying to balance a marriage and parenthood. I noticed my mental health having another surge in the wrong direction. \n\nRecently I’ve found new work, extremely long hours but a great opportunity to set up the family in the long term. \n\nUnfortunately I’ve realized how much I’m not making the cut. My whole life purpose is to provide for my family and I’m constantly receiving feedback that I’m failing. I’m a horrible father, and a terrible husband. Due to my inability to “express” or “talk” about my emotions properly, I often come across as distant to my son and selfish and one sided to my wife. \n\nI honestly hate walking around like I never do anything right. I’ve already lost one family and I’m at the point of no return with the next. \n\nI don’t show enough appreciation is the feedback...which is tough to hear because I work 6 days a week to provide for my family. A year ago I was 212lbs , I am now 157 lbs . I know my diet and sleep probably has a huge roll in mentality but at this point I’ve lost all drive and willingness to live. \n\n“It’s selfish” .....sure....it’s very sad and unfortunately to leave a kid behind in this world..but should I just wait until he’s an adult?..I just found out a couple weeks ago my wife is pregnant with another..we’ve been working through things over the years and honestly I was happy when I found out...which makes this 10x worse. If I can’t manage my own thoughts....what makes me capable of teaching someone the value of life. Now I’m staring divorce in the face , the relationship has deteriorated and I’m the asshole again. All I do is work , come home , and ignore everyone. \n\nSociety says life is a gift. They shame you or patronize you for being suicidal or having tendencies and say that there’s more to life. I’ve lived thirty long years and I can tell you I’ve done great things and not so great things..yet the impact I left behind was so minimal. \n\nI’m exhausted, tired of pushing , and feel stuck. My whole purpose was to build and provide for my family. Something I never felt I really had. Now that I’ve failed through two of them I really see no point in sticking around. Stuck between honoring my feelings and what society says is the right thing to do. \n\nI apologize to everyone who had a positive role in my life. It’s nothing anyone could’ve or should’ve done. I think I’ve just been battling it for so long that I’ve realized I’m finally ready for it. When I look back I do see moments I am grateful for , but looking forward I no longer see a purpose.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/kpdmtt/stuck/", "title": "Stuck", "social_network": "reddit", "user": "0mac727bm", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1609648108, "permalink": "/r/Suicidal_Thoughts/comments/kpdmtt/stuck/", "nsfw": false, "first_save": 1635429363.049386, "replies_charged": false}