{"id": "t5_28vigg_t3_j1810r", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "This is going to be a long post, but I wanted to at least get some of this out there. I have two desires that are in constant opposition. I want to be left alone, to not have to deal with others. To know I am not going to be manipulated or used anymore. On the other hand I want to feel wanted. I want to know someone really does care about me for me. But with how damaged I am now, I doubt that will ever happen. I keep trying to make both of these things happen, working against myself knowing that no matter which one I manage to achieve, I will not be happy without the other. I am pretty sure I am beyond broken now.\n\nPretty much all of my life, I have been hated by everyone around me. I suppose it is just because of who I am as a person. I am rather crass in conversation and I have a bad sense of humor. Its not just that it is mostly dark but it is mostly garbage puns or word play that no one finds funny. Every once in a while I got off a joke or two that got laughs but I can't seem to remember any of them. \n\nAside from that, I have always known that I meant very little to people. I was never someone who was wanted. I was never someone who was important by choice. I have been a lot of things in my life,  most of the time I just tried to be useful. Because being useful is a good way to make sure people want to keep you around. If you are useful its more trouble to get rid of you than it is to put up with you. \n\nI have been in love a few times, but I do not think it was ever reciprocated. Nearly every woman I have dated has either cheated on me or stolen from me. Most have done both. Even if I saw it coming, I could not bring myself to stop it because even if it is fake, feeling like someone wants you around is amazing. I know, it was some serious self sabotage but if it were not for those brief moments when I thought I had happiness I would not have lived as long as I have. \n\nFamily was probably the worst part of my life. My mother has always hated me. I think she resented my birth more than anything else in her life. At one point she just told me how she felt. That she hated me, that she wished I had never been bore, that no one loved me. She went on and on about it while driving home from a family get together. I can't say that I blame her. I was a pretty worthless child.\n\n My father hated me too. My older brother was his favorite since they had so much in common and my father could not stand me or anything I was interested in. I liked video games and anime and cartoons when I was around 13. For my dad, that was too old and he just could not handle it. He was very vocal about how stupid my interests were. Up until about 4 years prior to this note, he just openly disliked me. When my older brother became distant to him, he latched on to me. And I pretending to be closer to what he wanted as a son. I went camping, rode horses. I changed my speech patterns and clothes every time I saw him just to keep him from attacking me for who I was. It still happened but it took longer for him to get to that point. A few hours at a time was fine for seeing him before he would show that he had a problem with me. \n\n My older brother despised me. He always thought I was our mother's favorite because I was younger and he seriously abused me for it. He would hit me, knock me over and just do pretty much any physically violent thing he could when no one was around. And we were alone a lot. When we got older, I agreed to let him and a woman he was with live with me. His woman ran up a huge bill under my name and caused my credit to go to hell and neither of them would take responsibility for it. Recently he started trying to be close to me again, I am guessing at the request of our father. But its too late. There may be blood between us but thats all there is.\n\nNo one in my family knows me. No one knows what I do for fun, what I like or even what I wear. My friends, well the people I see regularly, don't know much about me either. They just choose not to. And I cannot blame them. I am the tertiary friend. The one that is only around because the numbers needed rounding out or because I was available. The only reason people chose to be around me was because of convenience. I was there and I was willing because I was desperate for human interaction other than work. I know that is really pathetic, but I dont care anymore. I just wanted to feel like I mattered.\n\nIt really is pointless to talk about now though. There's nothing to be done about it anymore. I could go on and on about each person who has used me, or done something terrible to me but at this point it would be whining. I have become jaded. Cynical. And the few things that actually make me happy anymore have lost their appeal. I cannot enjoy any games. I cannot enjoy going anywhere or doing anything. If I am out with a group, I fake being okay as long as I can but it usually ends up showing.\n\nI have tried therapy. A few times to be honest but the last woman I spoke with talked to me for 4 sessions and decided that I would be better off in a mental ward, drugged out of my mind for the rest of my life rather than trying to process or deal with myself and at that point, I would rather die. The first therapist thought that I just needed a good woman in my life. The second thought I was gay. The third thought the best idea for me was to give up and commit suicide even though she phrased it as \"Life may not be right for you.\" so she could avoid any legal issues. I have tried to help myself. I have looked for support and people to care or at least fake it long enough to pull me out of this fucked up state I am in. It seems like even if I am paying people, they just cannot be bothered to care.  \n\nThe bottom line is, I am tired of being abandoned. I am tired of being unwanted. I am tired of being alive in a world that has no love for me. I wish I could matter, I wish I could be someone people wanted around and most of all I wish I could be someone I liked. Just know I was not always like this. I was hopeful and happy a few times, but it has finally gotten to me. I just cannot carry on like this. I cannot get back up after another hit. It's pathetic, but I don't think I have any more tries left. I just want to stop being so miserable. I would settle for being content. I would settle for being numb, but after seeing what drugs and alcohol did to people in my family, I couldn't ever go that way. I would rather be sad than angry. I would rather suffer alone than make myself a burden on someone else that I know would rather not be around me.   \nSo I have been thinking about suicide for a while now. I have gotten my will together and went over pretty much everything I needed to in case I actually go through with it. At this point, I am starting to think it would be better than having to deal with myself for the rest of my life. Whats the point of living if you cannot enjoy anything? Whats the point of trying if you know that you can never be happy?", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/j1810r/just_getting_all_of_this_out_of_my_head_warning/", "title": "Just getting all of this out of my head. Warning: Depressing as hell.", "social_network": "reddit", "user": "AnUnpleasantGuy", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 9, "down_vote": 0, "creation": 1601280286, "permalink": "/r/Suicidal_Thoughts/comments/j1810r/just_getting_all_of_this_out_of_my_head_warning/", "nsfw": true, "first_save": 1635428852.9455807, "replies_charged": false}