{"id": "t5_28vigg_t3_e4tbk7", "request": ["b38140a1-7eee-49dc-9a69-c07b4318950c"], "text": "My nephew has been having suicidal thoughts.  His parents will only let him hang with his friends like once every 2 weeks,  so he sits in his room and plays on his phone.  He is 14.  They give every excuse but since he has had a rebuttal to most it's just \" because I said\"or \"you need rest from or for soccer.\"  He does play soccer like 4 days a week.  It's just not with his friends.  He has talked with and told his parents about his thoughts on suicide but nothing has changed.  He is starting to rebel and fights are getting worse.  His mom ( my sister) is very manipulative.  My nephew hangs out with my kid the same age.  There will be 6 or 7 of them hanging out and they want to go to the store or somewhere else but his mom will not let him ,which leads to his friends being frustrated and him lying to his parents.  Then his mom uses this against his and says your friends are bad influences that's why you cant hang out. They are all good kids.  The worse they do is doorbell ditch.  He has told his friends several times he is going to kill himself. It's always after he sits in his room all day on his phone and social media hearing his friends have fun.  My son turned him into some school suicide hotline and told me the next day.  My sister is now mad at my son (and me) for not contacting her directly. She is making it about her.  She has her son saying that \"if my friends were really that worried,  why didn't they call me or my mom.\"  His friends have talked about it in the past with him but it keeps happening. I'm worried for him.  His mom is more worried about what everyone thinks about her.  She is a narcissist and will not listen to anyone or reason.  He still has soccer and does hangout 1 or 2 times a month.  I realize this is just how she parents and I have no say.  I am just worried about my nephew.   Any ideas?", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/e4tbk7/nephew_has_suicidal_thoughts_what_to_do/", "title": "Nephew has suicidal thoughts, what to do?", "social_network": "reddit", "user": "JoeMammaisugly", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1575259271, "permalink": "/r/Suicidal_Thoughts/comments/e4tbk7/nephew_has_suicidal_thoughts_what_to_do/", "nsfw": false, "first_save": 1635429425.057893, "replies_charged": false}