{"id": "t5_28vigg_t3_nzjil6", "request": ["f85d379c-7683-42c0-b22a-e345ed46496b"], "text": "So seeing as several therapists and councillors as well as teachers pointed out suicidal tendencies and behaviours in me as early as 8 years old I feel like it isn’t so surprising that it stuck around. My whole life I’ve been forced to parent people twice sometimes tripple my age, I struggled to pay rent after being alone for a few years. I’ve lived in trap houses, I’ve seen friends and family leave constantly either overdosing, getting shot in a bad deal or prison. I’ve been sexually assaulted many times even by family, my own grandfather molested me from the day I was born till the day I told my dad. After telling my dad it took my older sister saying it happened to her as well for anyone to believe me I was terrified to tell anyone because I was raised with the mindset of don’t snitch no matter what. My dad still forced me to go to the police and nothing was done they just labeled him a sexual harasser basically and that was it. When I was 11 I watched my mom send my dad to jail for something he didn’t or did do, she took me and my little brother 9 hours away to stay with her uncle in his trap. My dad had us back in two months and was out on lack of evidence, I wasn’t allowed to contact or even mention my mother because of how angry he was. He even told me and my siblings she had overdosed and died. So I started buying drugs started with weed,then acid,percs,xans,bensos, addy, lean and I overdosed many many times on purpose then I started selling as well and I got kicked out so many times because I didn’t count right. Then the family finds out not only am I a disappointment I’m also bisexual and was dating a full on Jamaican girl. Got kicked out for that too,lived alone for a bit then they let me come home. Then I get kicked out a month after I turned 16 for protecting my little brother from my step mom. I’m still to this day not allowed to contact him or my other siblings. Not being with my siblings and father literally ripped me apart but my mother took me home with her after my grandmother notified her I was homeless. So I figure “great at least I have some family left” we’ll two months after I move 6 hours to live with her I’m left at her and her bf’s friends house. He’s 35 at the time my mom was clean but didn’t know he wasn’t. I was fully clean from everything except for weed for almost 6 months at this point so my tolerance went down. I was with him for about two weeks. He got me so high my eyes would roll back then he would rape and beat me I was so high he convinced me that we loved eachother. I had all contact cut between me and him by my mother and step dad once they found out and at first I was scared I was pregnant because I was showing symptoms. I was and I fell in love With the baby and him again because it was his. Than because I was so young and my body couldn’t handle it I ended up miss carrying it destroyed me to my core. Everyone leaves. And for the past three years I’ve lived with a family that constantly threatens to leave each other and use me to end arguments and force me to pick sides. Yesterday it got really bad so I ended up snorting 5gs of crystal, smoking 3GS and drinking abt a shot of very potent infused water. I didn’t die because of how high my tolerance was but I was fucking trying to I wanted,still want to and always have wanted to die. I’ve tried therapy,rehab and changing/doing/taking anything I could to fix myself. It always ends the same nothing ever works longer than a few minutes. Sorry if this was jumbled I’m high again and just needed to vent about alt least some of what I went through and am still going through", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nzjil6/felt_this_way_for_years/", "title": "Felt this way for years", "social_network": "reddit", "user": "Makinbadchoices999", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1623665546, "permalink": "/r/Suicidal_Thoughts/comments/nzjil6/felt_this_way_for_years/", "nsfw": true, "first_save": 1635429094.4191952, "replies_charged": false}