{"id": "t5_28vigg_t3_i68yvd", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "I know no one's even gonna read this so I don't know why I'm wasting my time writing this. but I need to vent somewhere and I don't wanna bother my friends. I feel like I already bother them enough. I don't wanna be that one friend always fucking whining and complaining. I think that's why all my previous friends got sick of me and now they've probably forgotten about me. Probably for the better. I feel so ashamed by the fact that I exist. I am everything wrong with humanity. My life lacks any sort of meaning.  And I don't even wanna die. But right now it seems like the only way out. I'm stupid and messed up my relationship with the person I love the most of on Earth. I've only managed to keep one friend but who knows for how long that'll last. Soon he'll get sick of me too. I think the only way to remain friends is to not feel too much, to not be very attached to the friendship. And how do I do that when we're becoming closer friends every time we talk? I'm a failure, I feel like I'm bad at everything I do. I've playing the piano for years but I still can't play a single full song. I've been learning Russian for 3 years but am yet to advance beyond a very basic level. I have more than 360 hours in CS:GO but I'm so awful at the game other players often insult me and my team often loses games because of me. All of these are things I love doing and I've been putting a lot of effort.  But lately I've just been giving up. Why study Russian, why ever play the piano again? I'm terrible, I keep playing the same thing every day, over and over. Do I even deserve to live? I'm an awful, bad person. I lie and I hurt people and I'll never change despite desperately wanting too. Every time I look myself in the mirror, I feel disgust. I despise myself. i want to change so bad but I keep failing over and over again. I just wanna fucking die. It's the only way out. If there was a better way, sure it would have appeared by now, right?", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/i68yvd/every_day_is_pain_all_i_wanna_do_is_sleep/", "title": "every day is pain; all i wanna do is sleep", "social_network": "reddit", "user": "randomuser111991", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 16, "down_vote": 0, "creation": 1596928633, "permalink": "/r/Suicidal_Thoughts/comments/i68yvd/every_day_is_pain_all_i_wanna_do_is_sleep/", "nsfw": false, "first_save": 1635429368.8402889, "replies_charged": false}