{"id": "t5_28vigg_t3_qdk5ot", "request": ["03598834-ede5-4aab-9b0a-fc5de7674c00"], "text": "So I have the flu. Or covid or some kind of weird fucking virus thats making me feel like a giant pile of garbage and won't let me enjoy the only break I've had from uni in months. I kinda hope it just kills me. Whatever it is can just take me away and I would be totally fine with it. My friend is mad I got her sick again even though she's the one who gave this to me in the first place. She says I ruined her chances to see her long distance boyfriend. She says it's not fair all I have to worry about is an exam and then i'm free to lie around for a week. Like yeah sure i love being completely isolated from everyone hoping this is what finally fucking kills me. I still feel bad though. She made me cry. I haven't cried in months but I think i'm just feel especially pathetic right now. I just feel like everything is always somehow my fault. I always find a way to fuck things up. Like this one time I broke my ankle and had to go to the hospital and ruined my sisters anniversary with her boyfriend cause they couldn't see each other after cause of the risk of me having gotten covid. I begged my parents to not take me but they wouldn't listen. I could've waited a couple more days. Not like I fucking  matter that much anyways. I'm going to fail this midterm too, I know it. I can barely keep my eyes open but my professor wont believe me without a doctors note which I can't get until monday which is days after i'm meant to write it. which is fucking fabulous. Just another reason I'm a big fucking disappointment, burden, black hole of a fucking human being. Sorry, I'll stop now. Gotta go back to studying for an education i couldn't give less of a shit about.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/qdk5ot/idk_just_a_rant_that_i_know_no_one_will_read/", "title": "idk just a rant that I know no one will read", "social_network": "reddit", "user": "unhappybi-derman", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1634918824, "permalink": "/r/Suicidal_Thoughts/comments/qdk5ot/idk_just_a_rant_that_i_know_no_one_will_read/", "nsfw": false, "first_save": 1635429520.6554265, "replies_charged": false}