{"id": "t5_28vigg_t3_nahq5p", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "71ee6414-54fe-46c1-b092-5b6636504a95"], "text": "I have a job, but I still can't get ahead of my debt. I don't have a home, my stuff is in an apartment that I'm scared to go into because the other person is mentally abusive. So I'm not even sure if I have anything left. My entire life is just gone I guess. My car is broken down and I have 2 days to somehow move it (which means at minimum a new battery and altinator) or pay a minimum 800$ towing fee and possibly have it get repossessed anyway I don't have the money for that unless I don't want shelter for 3 weeks. I can't save up for a home because I can't live on the streets with my job as I need to be able to be clean so I'm spending all my income on cheap hotels and snap only gives my 19$ a month for food (which is so fucking helpful I can buy bread and jam and pb and then be out of food money for the month). I'm the bad guy in my family and nothing I say will make a difference cause they believe the abuser over me. So I'm truly alone. My \"friends\" have abandoned me. I'm probably going to have to give up my pets because the person I'm paying to take care of them is moving and can't anymore. I still owe her anyway. It k kills me inside to think of getting rid of them but idk what to do. I'm drowning above no one cares. I should've n been dead years ago but somehow I convinced myself life was worth it. But it's not. The universe very obviously doesn't want me to survive. But I'm a coward. I can't survive but there's no help or relief. I'm going to die on the streets alone and unloved and no one will even notice or care. There's no hope and no way out of this. All the waitlists are closed for the \"affordable\" (what a laugh it's still half my monthly income at least) housing and I don't have a way to save for the regular ones. I just want a home. but it's not going to happen unless I give up shelter for 2 months which would make me lose my job due to hygiene/sanitation and lack of sleep (danger hazard). I'm not safe and there's a increasingly smaller chance of my getting safe. I'm hopeless", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nahq5p/it_keeps_getting_worse/", "title": "It keeps getting worse", "social_network": "reddit", "user": "deckcody", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1620799114, "permalink": "/r/Suicidal_Thoughts/comments/nahq5p/it_keeps_getting_worse/", "nsfw": false, "first_save": 1635428994.5697753, "replies_charged": false}