{"id": "t5_28vigg_t3_gcoe4d", "request": ["17a9b9d7-ff9b-41b7-9002-7b804d6d8d40"], "text": "CW: Black and pink pills, hopelessness  \n\n\nI never asked for this life, nor for my bones to merge in-vitro to form the slovenly mess of my misshapen skull and body. I never asked to be born into a society which views physical beauty as the singular greatest good, venerating such above kindness, compassion, and intelligence. I never asked for my neural circuitry to function in such a way that I care about my treatment in said society. Thus, I feel I've had very little say in my own life experience and trajectory.  \n\n\nI was bullied horribly between the ages of 5 and 14, which took a psychological toll which will never be resolved. Despite a summa cum laude uni degree, I've only ever been offered a few (underpaid) \"respectable\" jobs -- and I'm generally ignored or shunned socially. I am kind, welcoming, and accepting to anyone willing to bless me with the gift of friendship, but I fear that's not too many people. While I'm skilled in the performing arts, I've been typecast as witches and hags since the age of 19. Somehow, I've managed to find  husband -- he is absolutely the most wonderful man to exist -- and he is my sole reason for continued existence at this point. Unfortunately, there is a lot he does not seem to understand about the more sinister workings of the world.  \n\n\nUntil my mid-20s, I had no idea about facial beauty, lookism, or the halo/horns effect. I now realise my only crime in life was being born ugly -- but unfortunately in modern society, that is the greatest sin a female can commit. By the time I learned about these disgusting subconscious mechanics, I was involved in a costly international courtship, so I was unable to properly save for cosmetic surgery. Since then, married life and the UK immigration process have presented one financial hurdle after another -- so saving up for cosmetic surgery is not possible. Besides, my husband absolutely does not approve of such surgery, and -- in all honesty -- at age 36, facial improvement may have little impact on my life opportunities. While my face after such surgery may be more symmetrical and aestetically inoffensive, there is a high likelihood I'll be brushed aside as an \"old hag\" or a \"Karen\".  \n\n\nSo, here I am...36 years old, only a few genuine friends on this side of the pond, a job as an agency nursing assistant, and a side business as a care-home performer which has temporarily been put on hold due to lockdown. Covid has refused to off me, and I'm too cowardly to do the deed myself. I must continue to \"bloom where I'm planted\", even if I am a patch of stinkweed, planted in the least fertile dust imaginable and watered with toxic waste.  \n\n\nAll I can do is pray for future generations, the evolution of the human brain, and the creation of a kinder and more accepting world.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/gcoe4d/life_as_a_truly_ugly_female/", "title": "Life as a Truly Ugly Female", "social_network": "reddit", "user": "MotznRoth", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 12, "down_vote": 0, "creation": 1588501771, "permalink": "/r/Suicidal_Thoughts/comments/gcoe4d/life_as_a_truly_ugly_female/", "nsfw": false, "first_save": 1635428884.5463908, "replies_charged": false}