{"id": "t5_28vigg_t3_n2ugf0", "request": ["6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "For my life, i have been generally miserable 99% of the time, even if i put on a façade and \"acted\" cheerful. The only time I can remember feeling true joy is in 2014. However, in the last 3 weeks, I have ran out of energy and can no longer put up the façade.  I have been emotionally drained of all joy and contentment  to where i either feel blank, anger, despair or envy.\n\nI tried to gain some sense of euphoria today by playing in a competition and making top cut, but I of course failed because my luck is dogshit (much like with my genetics and assigned chromosome as well as upbringing). The universe made me their lab rat to see how much they f\\*ck with me.  Well, I am not interested in taking it anymore. I'm not interested in existing just so the Government can tax me. I am not interested in existing just so those gifted with the \"pretty privilage\", \"genetic privilage\" or \"talent privilege\" can look down on me with their noses. I am not interested in existing so I can benefit society and do things for people.\n\nI live rent free and have no fear of going homeless anytime soon, but that doesn't make me happy. Money does not always buy happiness. I am just completely miserable. I feel ready to end my suffering. Might resume my normal 4-5 hours walks so I can seek out my final resting place. Find a place that is secluded and where I don't have to fear someone interfering with me finally ending my suffering if I ever get the courage to do it. However, I think I am nearing my breaking point and not even a therapist will be able to manipulate me into seeing hope where there is none.\n\nBefore anyone asks, I have family that care about me (supposedly), but they will get over it when I pass. They got over my Grandfather passing away in 1997, my great grandfather passing away in 2007), my grandmother passing away in May of last year, my cat Midnight being put down in November. The pain of my passing for them will only be temporary whereas this psychological pain that I am going through is permanent. Life will go on for them and they should be happy that I am no longer suffering.\n\nUntil then, since I know it is inevitable, I'm sure all you positive Pete's out there want to give me these platitudes about how \"life will get better for me\" even though you have absolutely no basis for assuming such bold claims, feel free to debate it with me (and lose the debate). I'm bored and miserable and not intending to do anything with my life at any point so I have all of the time in the world to debate this and shoot down your arguments. And if anyone else wants to ask specifics about anything I have said or how shit my life is, I might answer that as well. Maybe by doing so, you'll understand why things are hopeless for me.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/n2ugf0/second_post_here_might_be_nearing_my_breaking/", "title": "Second post here. Might be nearing my breaking point, but who knows?", "social_network": "reddit", "user": "LifeBytes123", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1619912495, "permalink": "/r/Suicidal_Thoughts/comments/n2ugf0/second_post_here_might_be_nearing_my_breaking/", "nsfw": false, "first_save": 1635429310.0717478, "replies_charged": false}