{"id": "t5_28vigg_t3_q0xq94", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "I really didn't want to talk about it, but at this point I just need to vent. Im a highschool student, I don't really have anything special. Except that I know a few things about myself. I never loved myself for who I was. Every single time I saw my self in the mirror I looked at myself with disgust. I started twisting my personality to fit in like people wanted me to be. I thought that if I can't atleast like myself, I might just make others like me. That didn't go well, people started shitting on me for being a \"fake person\" and now acting how I truly am. Friends dropped me quickly.\n 2 years ago, a friend I met on discord hanged herself on camera while I'm in the call. Probably the most horrifying thing I've ever experience (I prefer not elaborating on it too much because I don't feel comfortable talking about it). There's not a single night where I don't think about it. Another one of my friends irl used to be suicidal, they kept telling me how I was the only one who actually never cut contact with them and how I'm the reason they didn't end it all. But the regret of me being unable to do anything about how my online friend passed away is too unbearable for me.\nI feel like a failure to my parents, I've got nothing special. My brother on the other hand is a genius. Even my parents openly say that they wish I was like my brother, and that all I ever do is get in trouble and stress them out. I have pretty decent grades, but that doesn't matter to me. It doesn't matter at all if my parents can't consider how I feel about school. Partially my fault, I disappointed them various times. I can't bring myself to tell this to anyone I know, but I hate my life. I hate everything about myself. I hate how I act. Even people around me hate me, I cant express myself around them. I end being rude or mean to them without even wanting to. I have no hopes for my future. I tell myself that I like everyone, but in reality I hate everyone. I'm a fucking hypocrite. \nI grew up with the mentality that I should never talk about my problems to other because other people possibly are going through worse. But I just can't do this anymore. I fucking hate my life.\n\n\n\n\nIm not asking for help. I dont need to seek professional help. I just want to fucking love myself for once. Why am I such a fucking useless asshole . I wish that I could just live another life and restart from 0.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/q0xq94/cant_believe_im_writing_this_but_i_have_to/", "title": "Can't believe I'm writing this. But I have to", "social_network": "reddit", "user": "Sulvaa", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1633319453, "permalink": "/r/Suicidal_Thoughts/comments/q0xq94/cant_believe_im_writing_this_but_i_have_to/", "nsfw": false, "first_save": 1635429337.8943837, "replies_charged": false}