{"id": "t5_28vigg_t3_mmo7nw", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "cf81d7c0-cd42-4d3e-a15d-51251de387ba", "90472b3c-14c3-4a56-be61-333d4f5dd86c", "935370ff-2e76-44cd-b247-7eb7b997ce9a"], "text": "(21F) Dropped out of school 2 years ago because my depression crippled me so much I not only couldn’t go to classes but I ended up in the hospital due to suicidal ideation. I used to be an A student. I thought I was doing everything right by choosing school over parties. The first year of college was the time I felt like I belonged. I felt like I could actually be someone. Then my mind just failed me. I started thinking my friends hated me. I stopped wanting to hang out. I was depressed and it came off as me looking angry so my friends thought I didn’t want to hang with them anymore. I slept all day. \n\nAfter I left the hospital I had the bright idea of moving to another state for a fresh start. I felt that maybe I wasn’t in the right place. First time I made it to my new city, I felt like I was where I was supposed to be. Then depression hit me again and I stopped going to this film internship I had. Couldn’t go to class so had to drop the classes. Then got jobs and got fired from them—no explanation given. Now I’m back in school and have made straight As all school year so far, but I now realize I want more in life than just straight As. However, I’m not consistent with anything I do because depression always sneaks back up on me. Since I never know when it’ll come, I’m fearful of even starting anything. I started a podcast but have been inconsistent with it. I can’t expect my audience to grow if I’m not consistent. And if the goal isn’t to grow my audience, what’s the point? Depression wrecks every area of my life. I’m also insecure of the fact that my follower count on Instagram is so low. It’s hard to have a podcast when you have no influence at all.\n\nI honestly feel safer just being depressed and not pursuing anything. Too much anxiety. I just want a chill life and I just want to be financially secure. I don’t want to have to worry about survival my whole life but that’s exactly where I’m headed. People say I should be easy on myself but the truth is, patterns have already formed in my life and I’m afraid that pattern is starting and never following through on anything due to fear of rejection and failure and also anxiety. So if that’s the case, there’s really no point in living. I don’t want to feel like this my whole life. Classic case of how depression robbed me of every good thing that’s happened in my life and has made sure my potential stays just that—my potential without ever being actualized.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/mmo7nw/depression_stole_everything_from_me/", "title": "Depression stole everything from me", "social_network": "reddit", "user": "chewybacbacca", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1617874930, "permalink": "/r/Suicidal_Thoughts/comments/mmo7nw/depression_stole_everything_from_me/", "nsfw": false, "first_save": 1635428827.6723595, "replies_charged": false}