{"id": "t5_28vigg_t3_lo8fzp", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "Death seems peaceful the thought of experiencing nothing again calms me, to never experience a thing again or anyone. I’m scared of the thoughts that I have. every death I see im jealous I wish I were them no matter how painful their death was. some times I see people and I want to beat the fuck out of them, I see and hear things, things that would fuck people up. And lately, I have been talking to myself a lot \n\n\nI'm a psychopath, that or i'm going insane \n\n\nBut eh who cares, not a single person gives a fuck even if they say they do. People are selfish beings who only want the best for themselves and everyone just wants to procreate. Why?  Because it feels good. I don’t even know why I'm talking about this. But I do not feel this way. I don’t want kids to have the same thoughts as I do. I haven’t felt love all I’ve been doing is holding back. And is not like anyone loves or ever will love me anyway so who cares, I don’t know why I even try anymore. \n\n\nAnyway, I'm a failure at everything I do. I can’t even end my life properly, I cant pull a trigger, I can't jump nor starve, and can't take enough pills.\n\n\nI don’t know who I am\n\n I cannot live up to the expectations anymore, I was an honor student but what is the fucking point I won’t live past high school. I don’t give a fuck about what you guys tell me. And I know I don’t belong anywhere. I don’t know why you guys hang out with me. If I were you I would have forgotten about myself already, hell I’ve done that myself. I don’t know what I like or what I want. I only know that I have one thing really and that a tattoo but I'm probably not going to get one. \n\n\nDid you know that I'm on several watchlists for committing fraud, visiting black market websites, and finally for making computer viruses for money? And if I do anything wrong I'm gone without a doubt whether from myself or not.\n\nNot only that but, I have stolen 2 documents from the cia so that's a thing, ask me if you want me to show you. \n\n\nGod damn this white background is fucking with my eyes. \n\n\n\nI feel like the black body theory, in physics, a surface that absorbs all radiant energy falling on it. The term arises because incident visible light will be absorbed rather than reflected, and therefore the surface will appear black. It’s something that absorbs light and happiness and turns it into darkness, to nothing.  \n\n\nI lack massive amounts of serotonin, I wish that I had it but so does everyone else. I wish that I had a normal happy life, a happy family. But as I said before I can’t bring myself to passing off my genes, my thoughts, and feelings. Also, it’s not like i'll live long enough to be able to pass them on. \n\n\nI wish I had my own workshop to build things, to be left alone the hermit within me wants me to crawl into a hole and die there alone. I think i'll do that. \n\n \n\n  ", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/lo8fzp/whats_so_great_about_life/", "title": "what's so great about life", "social_network": "reddit", "user": "DEAMON24", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1613832067, "permalink": "/r/Suicidal_Thoughts/comments/lo8fzp/whats_so_great_about_life/", "nsfw": false, "first_save": 1635429357.4576786, "replies_charged": false}