{"id": "t5_28vigg_t3_khabm0", "request": ["03598834-ede5-4aab-9b0a-fc5de7674c00", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "First let me give you some context\nI’m from Mexico, I’m almost 20 and I don’t know how the people loose the fear to commit suicide if they ever get that fear because that’s the only thing that keeps me undecided from doing it\nSince mi childhood I’ve suffered from depression and I go to therapy but recently my life has no purpose. In my last year of high school (about a year ago) I suffered an accident in my judo training, my left leg got dislocated and after almost half a year of bad treatment the doctors got to the conclusion that they had to put me a hip prosthesis because my bone was not working anymore so yeah... the only thing that kept me kinda happy or at least motivated to do other things it’s now gone because I can’t even jump or even run without being in risk of hurting myself.\nAfter the accident, my teachers at school didn’t care about my situation and I failed my assignments; because the pain I couldn’t hang out with my friends and then the pandemic got to this side of the world and made the whole thing of getting emocional support by friends to deal with my new disability got more difficult and I don’t have the kindest family to get the emocional support that any person in a similar situation could need.\nSo here I am asking about the fear of committing suicide because I feel useless. I don’t have a life anymore. I’m just in a perpetual state of recovery but just when I think that everything is getting better, the pain comes back and I can’t get off my bed because of the massive pain\nMy parents and sister have to spend so much money on painkillers and have to help me to get up to go to the bathroom or anything else and they seem so exhausted because of me and believe me, I tried to do all of these things by myself but I just can’t. I feel so useless that I think it would be so much better to everyone if I don’t be here anymore but the thing is that I’m scared of doing it. The fear of not knowing what’s after death keeps me from doing it\nSorry if this is a stupid question but I really don’t what to do to make all this suffering end\nAnd sorry if my english is bad but it’s the best I can do\nThanks if you read until here", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/khabm0/how_do_you_loose_the_fear_to_commit_suicide/", "title": "How do you loose the fear to commit suicide?", "social_network": "reddit", "user": "JugularEmperor", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 12, "down_vote": 0, "creation": 1608526016, "permalink": "/r/Suicidal_Thoughts/comments/khabm0/how_do_you_loose_the_fear_to_commit_suicide/", "nsfw": false, "first_save": 1635429521.5144472, "replies_charged": false}