{"id": "t5_28vigg_t3_k0gvpk", "request": ["65b8351b-5dc2-4143-a37d-f2748f6d42bb", "90472b3c-14c3-4a56-be61-333d4f5dd86c", "03598834-ede5-4aab-9b0a-fc5de7674c00"], "text": "I am in pain. Not physically, but every day is a struggle to find the will to keep going. I am just treading water in life, with no end in sight, and I just want to rest and let the waters claim me. \n\nI’ve always been a failure. In high school I never showed up enough to finish...I guess I was so afraid of trying and failing that I felt it was better to blow it off. Later I took classes for a few years at a community college, which was fun, but eventually blew that off due to having no goal. Now I’ve been working retail for the past 20 years, refusing advancement because I am embarrassed of retail work and keep telling myself it is temporary. I suppose the fear of failing if I try has something to do with it. \n\nI am married and have children. I use this as an excuse not to try to grow, about I don’t have the time or money to pursue education, when really I have no idea what I want to do, nor the will to do it. The kids get healthcare through my employer and I keep myself in debt, both are further excuses not to take a risk of changing.\n\nEvery day I get up but am not sure why. I go to work, plod through eight hours of meaninglessness, go home and feel empty. Everything that I used to get enjoyment out of is just more tedium now. Video games and books used to be my way of escaping the need to face life, but I just can’t work up the drive to consume them anymore. Running helps a bit, but it is a temporary distraction and not a passion. \n\nThroughout my life I have been met with plenty of opportunities. Teachers who were always interested in helping me out, great reviews at work and offers for promotion, offers for jobs in other fields. It is my fault I am where I am, I am a coward and feel I have nothing to offer at this point. I am tired and don’t feel I have the energy to fix anything in my life. I am in pain and just want a release.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/k0gvpk/im_tired_of_it_all/", "title": "I’m tired of it all", "social_network": "reddit", "user": "Elperdidopendejo", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1606262293, "permalink": "/r/Suicidal_Thoughts/comments/k0gvpk/im_tired_of_it_all/", "nsfw": false, "first_save": 1635429165.4770904, "replies_charged": false}