{"id": "t5_28vigg_t3_m2s6wr", "request": ["1298478d-f218-4dd4-a918-dcb9600d82ed"], "text": "Hai! First post, pretty much ever on any subreddit.   \nI've been struggling with depression for 12 years. I wasn't able to handle going to school, I'm unable to work. I can't recall the last week I was able to work 5 days straight without breaking down. I'm taking loan after loan trying to cope with my poor income and sudden hyper-manic episodes (I'm bipolar) where I go and buy stupid shit. I feel so sorry for my fiancee who's been with me for 8 years seeing me get gradually worse and stopping attempt after attempt of finishing my life. I'm on meds, changed them regularly in order to find a good fit and the ones I'm on now are the best yet.   \n\n\nI've tried to manage the too-weak-for-a-job part by trading stocks, forex etc. Some days are great: 100% profit, even 1000% profit at times but in the end I always burn it by doing bad at certain trades and burning my whole account. My savings account is empty. I'm out of a job. I'm not able to take any more loans. I've 100% given up on this life.   \n\n\nBut 3 months ago I heard about \"quantum jumping\" or \"reality shifting\", something that I've long speculated about in my mind. The idea of an infinite number of universes, an additional one being created by the slight movement of your thumb, the smallest thought, the millisecond that your brain sent a  signal to breathe now rather than 1 millisecond later. The idea behind reality shifting is that you're using your mind to move your consciousness into a different reality: a reality of your choosing out of an infinite number of realities. That a person could go to a reality where they're the queen of England, that they're the first person on Mars etc. While they're in that reality, your body goes on with business as usual - just without a conscious soul in it.   \n\n\nI've been trying for 3 months by using several different techniques that people claim have worked for them. Testimonies from people. Articles from the CIA describing this very phenomenon. I have my doubts but this is the only thing keeping me going: the idea that I could take a break from this reality and hop into another one for a while. To heal for a bit. But I have serious doubts about it. Apparently you need to have full faith in that it will work in order to do it. I don't have faith in anything. I'm seriously incapable of doing most things. I've tried to lucid dream for 10 years and nothing has happened lol! I honestly don't know what to do. In my mind there's only one way out, same as it has been for as long as I can remember. I've sought help for years but it's all meds and therapy which does NOTHING to help me. I've been taken to the hospital several times, injured or not from attempting to end my life but I end up being sent home the same day because I can't specify what kind of help I need. I have no idea! If I did, I wouldn't be there. It's ridiculous.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/m2s6wr/im_done/", "title": "I'm done", "social_network": "reddit", "user": "harkaz", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 9, "down_vote": 0, "creation": 1615475036, "permalink": "/r/Suicidal_Thoughts/comments/m2s6wr/im_done/", "nsfw": false, "first_save": 1635428922.975921, "replies_charged": false}