{"id": "t5_28vigg_t3_pxlzua", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "51818c1f-9070-43a1-96e3-b1b348ef35e0", "cf81d7c0-cd42-4d3e-a15d-51251de387ba", "3fe0b1cc-1d30-4fbf-bb60-0b7c127e8d1a", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "I don’t feel strong enough to have a good life. I know it takes work and I know you have to constantly work at it, and I don’t want to. I go through periods of “I’m going to change my mindset!” and try to make those decisions that will enhance my life but I end up just kind of wanting to die all the time anyway. It feels inescapable and I don’t feel like fighting it anymore. I can’t handle any minor stressors and all I do all day is ruminate in my anxieties and negative thoughts. No matter how much I tell myself what I’m thinking isn’t true and it’s just a pattern I’ve gotten myself into, I still can’t help but reason that these thoughts aren’t coming from nowhere and maybe they do have validity if they’ve been occurring for the better part of the last ten years. I fantasize about just not having to deal with life. I have grown a rather strong hatred towards school which sucks because I always dreamed of going to a great college and now that I’m here I can’t stand it and I can’t really blame anyone but myself. I don’t flourish socially and I struggle so much academically. Even though I consistently get good grades the work makes me feel so incapable, frustrated and overwhelmed I cry most days just trying to get through it and when I’m not crying and trying to get it done, I’m just thinking about all the fucking work I have to do that I know will cause me panic. I don’t enjoy classes because I’m so concerned about being smart and coming off good to my teachers and peers. I really don’t like waking up everyday just to repeat the same shit. I don’t see a future for myself at all. I can’t even get through school and I know that isn’t the only way to be successful but it is decently important when I don’t have anything else going for me. I fantasize about not having to think about these things, not having to deal with a future and not being burdened by your own thoughts because well, in my fantasy I’m dead. It’s just a nothingness. I’d much rather choose that than this. It feels like I’m just passing time and I’d rather not put myself through that.\n\nI think about suicide everyday lately. It isn’t always consistent, but the depression is and has been for at least the last three years. I know it can go away and I can be happy but I just don’t care to try and make that a reality for myself. I am skeptical it’s even possible for me and part of me knows that this part of me just won’t die. So I wish I could kill myself but just as I suck at living, I feel like I suck at dying, or at least committing to it. I guess I’m afraid of the pain I’ll feel before dying. I also know it would be the problem of people around me. There’s so many reasons for wanting to die and reasons for not doing it. So I feel like I’m just trudging along barely making it through sometimes. And most days I wish I could just commit and make it end. There’s such an overwhelming feeling of being trapped and helpless and I even keep a bottle of pills on me in case I do decide to really go through with it. It seems like there’s no good help and I’m so fucking sick of trying to make shit that makes me miserable somehow less awful but saying affirmations in the mirror and journaling. I’m sick of being in this world and I’m sick of not being willing enough to take myself out from it.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pxlzua/i_suck_at_living/", "title": "I suck at living", "social_network": "reddit", "user": "okaypenz", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 8, "down_vote": 0, "creation": 1632883017, "permalink": "/r/Suicidal_Thoughts/comments/pxlzua/i_suck_at_living/", "nsfw": false, "first_save": 1635428844.4431295, "replies_charged": false}