{"id": "t5_28vigg_t3_kkgggp", "request": ["27706836-2f69-4384-a3d8-704484ace7d8"], "text": "They all say it's to protect the general population. The normal people who have never had everything stripped away from them including their rights and humanity. They do it to keep us from ending it all. Nobody is a felon on purpose. We all let someone down. Someone we cared about or maybe someone who was counting on us. We did what we had to in order to make it right and instead we were branded. Forever marked as not good enough for the human race. Sure you can put it behind you with the right support system and resources but the system will fight to put you back every step of the way. Every day I think about the taste of steel and gunpowder in my mouth. Of how it would affect my roommate to find my lifeless form and the mess on the wall behind me. Of how I'd finally be free from further disappointing the people who claim they care. One final disappointment to round out a life wasted. One final im sorry for never being what anyone needed. Finally I wont have to hide behind \"im fine\" or \"ill be okay.\" I have no one to say goodbye to. No one to mourne my passing. No one to remember the good times that never happened. But im afraid to die slow. Afraid to slit my wrists or overdose. The only fast option is forever out of my reach and so I have to live as a coward instead of snuffing my life out quickly like I want. Every day I get a little more courage and someday I'll be there. Someday I won't be afraid of the pain or the slow death. I want so much to be finished with this life of suffering and sorrow. I want to put the rumors and whispers to rest. Im not the monster you thing I am. Im something far far worse. Get your torches and pitchforks and demand my head on a spike. I offer no resistance. Im ready to go, but my fear keeps me bound to this mortal coil.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/kkgggp/the_real_reason_felons_cant_have_guns/", "title": "The real reason felons can't have guns", "social_network": "reddit", "user": "Domo-42", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1608978140, "permalink": "/r/Suicidal_Thoughts/comments/kkgggp/the_real_reason_felons_cant_have_guns/", "nsfw": false, "first_save": 1635429242.8984475, "replies_charged": false}