{"id": "t5_28vigg_t3_o4jx0b", "request": ["51bc1b45-8792-4b9a-86c9-1b72cd96a4ac", "935370ff-2e76-44cd-b247-7eb7b997ce9a", "d3dca3a0-327c-45d9-8a03-9a1f01a14fd1"], "text": "TW: suicidal ideations/thoughts and self harm\nI don’t exactly know what to refer to it as, but I usually just say suicidal fomo, or severe fomo. It’s hard to explain to my friends who don’t struggle that much with fomo, or also my family members. But for real, I will see my friends hanging out on social media, or even a random friend group hanging out and want to kill myself. Like not in a joking matter, and i’m not being over dramatic either. I will genuinely think about it, almost every night. And the sole reason is because I feel like i’m missing out, or left out. No matter how hard I try, I never am invited, or I feel like nobody wants to be my friend. Which makes me feel uninteresting and undesired. The root of the issue for me is FOMO, I don’t know if it has to do with anything else but yeah. Whenever I complain to my friend about how bad my FOMO is, they never seem to understand. They tell me that I should just get off my phone, or that people don’t have to invite me to things. That they didn’t intentionally leave me out. But I don’t think she realizes how bad it truly is, it’s tearing me apart. I spend hours everyday crying non stop and either self harming or self sabotaging myself. I purposefully make myself check social media, or drop my closest friends and I cannot stop. When I feel things start to get better, I see another post of people hanging out, or my friends send me a photo of them hanging out. It makes me feel worthless all over again, and the cycle continues", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/o4jx0b/does_anyone_else_have_suicidal_fomo/", "title": "Does anyone else have suicidal fomo?", "social_network": "reddit", "user": "vampirera", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1624238890, "permalink": "/r/Suicidal_Thoughts/comments/o4jx0b/does_anyone_else_have_suicidal_fomo/", "nsfw": false, "first_save": 1635428738.8635175, "replies_charged": false}