{"id": "t5_28vigg_t3_kifozl", "request": ["82ff3069-5f28-400f-ba6f-f94d4fcede90"], "text": "I have done something awful. Terrible. It started as a self destructive move after a kind of break in a relation and I am now facing prison for it because I kept the self destructive behaviour even after patch things up and get a baby. I tried already to end things twice before that and once since, all failed. I tried benzos OD but didn't take enough, then tried to jump off a cliff but someone saw me and pulled me off and sleeping tabs were old and just got me sleeping for 24h. Few months before being raided I had a change of mind and started to think I might deserve to be happy and should at least try and if not for me, try to make happy my gf and our baby. But it was too late and now I just feel awful because at first it was only to go to prison and get killed without hurting or bother anyone else (which makes me feel even worst and I consider people in prison for murder to be at my level when it comes to worth) but now it affected and ruined the now ex gf life; and I just can't stop crying and planning the best possible suicide. I got a life insurance back and I am planning the good old car crash in a cliffy area so I can ensure my family is safe since I will not be able to see them again. I don't want nor deserve sympathy, just a best way to end things while still having insurance kick in. I deserve nothing but die and stop wasting the already rare oxygen and remind awful memories to the mom. I have no family besides them a mom and a sister (to whom I speak rarely but will turn their back once they will know what i did) 1 friend that would do the same and that's about it really.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/kifozl/i_deserve_to_die/", "title": "I deserve to die", "social_network": "reddit", "user": "throw98979897", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1608676130, "permalink": "/r/Suicidal_Thoughts/comments/kifozl/i_deserve_to_die/", "nsfw": false, "first_save": 1635428813.875193, "replies_charged": false}