{"id": "t5_28vigg_t3_owwn2a", "request": ["65b8351b-5dc2-4143-a37d-f2748f6d42bb"], "text": "I’m so tired of everything \nIt’s like no matter how hard you try nothing gets better. My mother treats me like shit. She abuses me and my 11 year old sister verbally and physically. I’m ready to tolerate it cuz I have been tolerating this nonsense since I was little. But I can’t let my lil sis go through the same. It’s not okay that someone is used to abuse . My dad can’t say anything to her cuz then she puts fake allegations and yes this has happened before. I try so hard to keep my family together. I feel so lost. Why can’t it be a normal family . Why is everything so hard. And my friends- they won’t understand. Heck, there are just 2 friends who am I even kidding and both of them have ‘normal’ families. Just not me- \nMy mother doesn’t even make breakfast for us . I’ve learnt to do everything on my own but would it kill her to talk to me nicely. How can someone curse their daughters so much. And she acts like everything is fine in front of extended family and friends. It’s heartbreaking. I always have to keep a fake smile to keep my dad and sis happy. 2 years ago, I tried to kill myself by overdosing on sleeping pills but it didn’t work and neither did my family realised I need a therapist. Their behaviour has only gotten worse since then. I often think of doing it again but I can’t leave my dad and sis alone. Ion have the energy to go through that kinda Pain again . I can’t leave em behind. What do I do? Ion even have someone to make eye contact with-\nMy mom doesn’t hug me like other moms. There’s no one to give me their blessing. My grandma was the only one who understood me ; who\nKept everyone together but even she’s not here. I can’t even explain how I cry myself to sleep every night without making noise .", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/owwn2a/so_tired_of_trying/", "title": "So tired of trying", "social_network": "reddit", "user": "stfubitchumf", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1627967984, "permalink": "/r/Suicidal_Thoughts/comments/owwn2a/so_tired_of_trying/", "nsfw": true, "first_save": 1635429110.0005248, "replies_charged": false}