{"id": "t5_28vigg_t3_k02hdz", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "b4d8161b-7016-486a-a4bd-5fb6a5aa639e"], "text": "I just want to be dead so desperately, i have nothing to offer to this world except for more pain, damage & disappointment. I'm not even interested in a \"better life\" anymore, this world is just as sick and tired as we all are and there is so much pain, suffering and confusion that i feel never leaves this world, it just gets passed on and takes on different forms. I have no energy to even plan a suicide, there is nothing i could get my hands on that would allow me an even remotely graceful exist and i'm disgusted and scared of all other options. I'm useless, i'm lonely, i hate myself, always have, can't even say others do so aswell cause they couldn't care less. I'm annoying, i'm obnoxious, i'm embarrassing, i bring people down, i'm exhausting to be around and i am a burden  to my family, myself and society in general.\nI feel like i have tried everything but i keep getting worse. I have no will, no motivation, no goals (never have), no qualifications, no skills, shitty with money, can't keep a job cause of my anxiety, can't find a will to get up because of depression, i can't really trust my moods, feelings, thoughts or perceptions because of bpd, can't think straight or concentrate on any one thing for to long cause ADHD, i'm always exhausted and tired although i never do anything. I sway back and forth between just feeling empty, dead and indifferent to feeling like shit, shameful, enraged, guilty, disgusted by myself, hopless, lost, fragile, broken hearted, damaged, panicked and scared like a toddler that has no way to cope or express themselves and is all alone in this experience of reality. I don't know myself anymore. I can't even talk to anyone about it because it's all too much, i don't know what to say, it overwhelms me, i don't know how to express myself, i have MAJOR communication issues and conversation, especially messaging makes me anxious and exhausts me because there is no structure in my head and i can never get to my point and then get frustrated and everything gets even worse. \nI'm so ridiculous and i'm not even sure why i'm this way. I wish i could just wither away naturally, just decompose or give myself to the ocean. \n\n\"World i dispair in you, i don't feel like I'm going anywhere with you. I might as well fling myself into your ocean, atleast then I would be with you\" (btw, beautiful song called Ocean by Alice Phoebe Lou) \n\nSorry for this ramble i know this helps nobody and doesn't even really have a point. Also sorry if i'm doing this wrong, this is my first reddit post", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/k02hdz/wish_i_could_give_my_body_to_the_ocean/", "title": "Wish i could give my body to the ocean", "social_network": "reddit", "user": "J_mo0dy", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1606213085, "permalink": "/r/Suicidal_Thoughts/comments/k02hdz/wish_i_could_give_my_body_to_the_ocean/", "nsfw": false, "first_save": 1635429036.4610631, "replies_charged": false}