{"id": "t5_28vigg_t3_iqxnpp", "request": ["71ee6414-54fe-46c1-b092-5b6636504a95"], "text": "Hi! This is going to be a long one, I don't really expect anyone to read this... But if you do, in advance I would like to apologise, my English is self taught so I might have some mistakes here and there.\n\nI am a 20 year old girl from somewhere in this cruel world. I won't say that my life is the worst because I am sure people have it worst, its just that exactly because people have it worst I should be happy with what I have, but it just impossible for me.\n\nI would like to say that I born cursed, I can't exactly remember the last time that I was happy, the last time that I didn't feel this emptiness, when I didn't hate myself and when I didn't want to die.\n\nWhen I was 6 years old is the first memory that I have about trying to kill myself, my family had been fighting and I just went to the kitchen, took a knife and I was going to cut my wrist. I don't know where did I get that idea from, my sister was there so she stopped me and after that she and my mom explained why it was wrong and I should never do that, bla bla bla.\n\nWhen I was 8, men would look at me with desire, would say things at me and boys from my school used to touch me whenever they wanted. I developed an eating desorder since I thought that by getting fat they would stop harrasing me. They didn't stop and also the bullying started. They would call me ugly and then would touch me.\n\nI had to lose weight, and I did, I used to eat just twice or once a day, most of the time just a granola bar. The bullying didn't stop but as I grew older I started to fight back. One day when I was 13, two boys surrounded me and touched my however they wanted. My ex best friend was there, she didn't help me, she laughed. A teacher found us, she let the boys go without a warning and threatened that if I engaged in that behaviour again she would call my family.\n\nAfter that I lost one of the most important people in my life. I got really depressed, and with all the memories of the abuse I started to have suicidal thoughts, I used to cut myself, starve myself and just wish I was dead and that person was alive.\n\n15 years old I got a trip to Europe as a gift. While in Europe, in beautiful places, I didn't stop thinking about how I should die. My aunt told me in that trip that people didn't love me because i was useful but because I had born. I wish I hadn't.\n\n17 I get this idea to apply for this schoolarship, I spend a year preparing, my resume was literally perfect... I didn't get the schoolarship.\n\nI spend the next months planing my death, I pack my stuff, I clean my room, I say my goodbyes, after I had the chance, someone else in my family died and my friends notice that someone is wrong and make an intervention.\n\nAt 19 I start going to the therapist, things where okay for the first months, I learned how the sexual abuse had affected my life, how my family was really toxic and overall how scared I was of being happy and how hard it was for me to feel emotions. I have a poor emotional intelligence. I told my family I was going because of my anxiety, in reality it was my last chance on staying alive.\n\nThe other day after the session when I finally speak about the sexual abuse and how scared I am of men, my sister's boyfriend threatened with killing us if she didn't gave him money, I spend the last couple of weeks without sleeping.\n\n20, I finally at the start of this year got my shit back together, I started going to university, I stop pushing my friends and I stated to forgive my family. Someone died, I spend the weeks scared because of the way they died we where in danger too. Things started to go downhill again.\n\nMy mom and sister  are just constantly fighting, and in every fight my mom brings up how she wants to kill herself and my sister just answer that she want to kill herself too, at some points it just a fight about who wants to die more. Sometimes if they are fighting with other family members they just bring up the fact about how everyone else besides them both wanted that my mother aborted me. I wish I had.\n\nOr sometimes they would talk about that men that was with my mom when I was little, how he beated the shit out of her in front of me and they found her almost dead.\n\nOr how my sister's boyfriend once when I was little gave my so many spanks that they hat to take me to the doctors, and how they still together.\n\nSometimes is the thought that my aunt used to watch porn, masturbate and have cyber sex with men in the same room as I was sleeping In.\nSometimes is how she used to fight with me everyday and how I had to spend 4 years at her house because my mom didn't really knew how to take care of me.\nHow maybe because she wanted that I was aborted she treated me so poorly when I was young, saying how bad I looked because I was fat and how no men would love me.\nAnd also the fact that now her house is the only safe place where I can go so I don't have to hear my sister and mom fighting about who want to die more.\n\nI meet a wonderful guy at the beginning of the year, he is too good looking and too sweet and  I know that if it wasn't for his autism (that makes him bad at being social) he wouldn't even be looking at me. I have nothing to offer and even though I am sure he loves me,  I know he deserves better. Someone pretty, someone that can give him what he needs. I really wanted to have a relationship with him, but we both agreed that this was not the moment for both of us, I know that he can find something better.\n\nMy father was never present, I was a baby that he had out of marriage, the only way he shows me love is giving me money, he has told my multiple times that this is his way to show me love.\n\nI could go on and on... But I think that good enough for now, I feel much better after writing all this and even thought If no one is reading at least I got this out of my chest.\n\nIf you read, I don't know if I am waiting for someone to give me advice, or kind words or just make fun of me... But this was it.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/iqxnpp/it_just_getting_worst/", "title": "It just getting worst", "social_network": "reddit", "user": "curlsowner", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1599853112, "permalink": "/r/Suicidal_Thoughts/comments/iqxnpp/it_just_getting_worst/", "nsfw": false, "first_save": 1635429051.1994355, "replies_charged": false}