{"id": "t5_28vigg_t3_juv5up", "request": ["6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "I am a habitual cutter. When I'm panicking, and think I'm done with everything, I cut. I have cut messages into my legs. Cut my stomach and my breasts when I am at the bottom of a canyon of self hatred. Cut my wrist when I want to die. I've sawed through my flesh with an old steak knife, putting as much pressure as I could and the damn thing never cut deep enough!\n\nI finally have a knife sharp enough. The adorable pink knife with a dragon carved into the metal grip. I cut weeks ago after a trauma. There was hardly any pressure. But it sliced through me. Not deep enough because death wasn't the main intention. Seeing blood, feeling the pain, feeling the release of all the emotion and anger - that was the ultimate goal. Death would have been a happy side note.\n\nThe scar hurts more than the cut did, which is irritating. \n\nMy point of this post is to share with people who understand and won't run away, won't judge.\n\nI found a new coping skill. Instead of cutting, I paint... myself. With sharp angled, small brushes. With that fake vampire's blood stuff. It looks super fake when first applied. While it dries, it has an incredibly real resemblance to fresh blood. Same for dried blood when completely dried. It's somewhat therapeutic. If you happen to be very pale and fair skinned like I am, it leaves stains. Like temporary scars to remind what you painted - or write, like I do.\n\nIf this app wasn't so dumb, I'd attach pics. They look so real. And I want to share, but I can't on fb because people freak out.\n\nI feel better after talking about it.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/juv5up/coping_with_blood/", "title": "Coping, with blood", "social_network": "reddit", "user": "TeardropOfDragons", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1605479997, "permalink": "/r/Suicidal_Thoughts/comments/juv5up/coping_with_blood/", "nsfw": false, "first_save": 1635429314.987425, "replies_charged": false}