{"id": "t5_28vigg_t3_oqmm0i", "request": ["65b8351b-5dc2-4143-a37d-f2748f6d42bb", "7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "I've been somewhat stable for a hot second and then my birthday happened well tomorrow it does \nI've had extreme urge to kms \nI understand that people love me and etc etc and the only real reason I stick around is for others \nI mean I just think about how it would traumatized them (my sister' boyfriend killed himself infront of her) \nAnd I see the damage it does \nBut - idk how to make it better \nI went inpatient hospital on Christmas and it fucked me over so bad \nNothing bad happened just the pure extreme feeling of being stuck and can't leave ruined me \nI'm poly and have multiple partners - one of them I have alot of insecurities with and it triggers my isolation issues and makes me want to just broke up with her \nI love her to pieces I just can't handle the pain of the insecurities\nI want to go to college but I can't even handle working part time - \nI'm poor because when I was working I basically got abunch of monthly bills and now I have like 3 dollars to myself every month \nMy birthday has reminded me of my plan as a minor - 24\nWas when I was gonna do it\nI talked to my brother and. Morbid joke of people dying on their birthday would make all the pain and sadness sit in only one day. \nI've been thinking about that. \n\nThe general enjoyment of life is not really there and really I'm here for others \nIm on a 24/7 dissociation thing \n\nI have alot of medical issues that bed ridden me \n\nMedicine just had side effects that have ruined me in MULTIPLE ways - including almost dying of liver failure and gaining around 150 pounds that I haven't been able to ever get rid of \n\nI've always done things for others\nBeen used as mother nurse therapist money \nWhy is it the thing that I want for myself - is something so surreal and devastating \nI'm tired \nI want to die but will never do it \n\nSo I will sit here while slowly letting time decay me - just for others to feel happy", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/oqmm0i/im_tired/", "title": "I'm tired", "social_network": "reddit", "user": "DadPlant", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1627118224, "permalink": "/r/Suicidal_Thoughts/comments/oqmm0i/im_tired/", "nsfw": false, "first_save": 1635429109.26584, "replies_charged": false}