{"id": "t5_28vigg_t3_igev35", "request": ["6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "You can’t run away\nFrom everything you hate\nYou try to erase The memories will fade\n\nI slide through the humid streets of Lansing, Michigan.\n\nMy motorcycle an old Honda nothing special,but the only piece of freedom I own in this life.\nI ride to impeison my mind further into these streets and drugs.\nThe only thing to alleviate the pain and the constant pull of the hammer. Wanting to burn my ducking nose of when I pull it back and blow.\nHeroin.\nThe death and life of me.\nIt’s sickening the amount of time money and resources I donate so willingly. \nI like to fee I am not under the control of any system or organization.\nTruthfully I am the worst. \nBuckling and crumbling at the first sign of discomfort. \nBut we welcome the pain.\nThe heroin and I both. \nWithout it I am lost. \nI identify with the constancy of anger, angst and hurt.\nI got a full clip, in my 9 mm.\nScheming plotting. Day in day out. \nDeath is anticipated with every push and plunge.\nI keep my head on swivel waiting for any come up that may come t fruition. \nMy pistol will ruin there day. \nI am normally a nice person. \nBut I’m sick. \nAnd I’m not really sorry. \nI ride beyond safe speeds in the city because I have no regard for my life or anyone else’s why should I? I can barely keep this shell of a vessel I call my body nourished to even move. \nDope, women, bikes.\nThe only three things I have ever loved.\nThe only three things that will kill me.\nUnless I cock this bitch back and let it blow.\nI should get clean again:\nEven if it is only for a little while.\nFuck it.\nGet money, shoot dope,\nTIE THE KNOOSE.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/igev35/pain_runs_deep/", "title": "Pain runs deep.", "social_network": "reddit", "user": "killawbeez", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1598370910, "permalink": "/r/Suicidal_Thoughts/comments/igev35/pain_runs_deep/", "nsfw": false, "first_save": 1635429320.6180656, "replies_charged": false}