{"id": "t5_28vigg_t3_ieckmo", "request": ["e4caf65e-8cb5-40e4-9897-4291adbe7f3f"], "text": "I suffer from a skin condition called vitiligo, turned my whole skin white, its \"normal\" is what everyone says, screw that! I cant even be out in the sun before i get a headache or get a sunburned easily cant even go to the pool man! But i dont let that get to me. a big symptom that comes with it is social anxiety so yeah you know how that goes, i gained so much weight but then lost enough where i could wear medium sized shirts, used to be 3xxL. Yeah it may have boosted my confidence but Ive been lied to by exes so ive become paranoid, trust me i want real love but tbh i think Im really ugly because of my skin, well at least think i am most people say im good looking, why should that matter when on the inside i feel broken and ugly. i work a dead end job, im constantly thinking of dying when im there. Cant trust anyone because anxiety always makes you think of the worst. Ive become so full of hate and anguish. Weed used to help now i treat it as if it was nicotine. Im only close with like 2 people but dont know what im going through because they think im just another pothead. The only thing that keeps me going so far is my family. It tears me apart when i start thinking suicidal because they come to mind. I just want this to end, i barely graduated, my cousin who i looked up to as a father figure, died when he was only 22 years old, its been 6 years and im still angry. It ruined my high school experience, i skipped to the point where the school director would come to my house to drag to school, always felt bad but thats what a teen is right? Rebellious. i barely graduated coming out with no clue of what i really learned. I seek no pity just want someone to know that this world is fucked and Im only 20 years old. Im way too young to start feeling old.\n\n\n\nCant even open up to people nowadays because US MEN have to hide our feelings because of how society is.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ieckmo/why_should_i_suffer_this_feeling/", "title": "Why should i suffer this feeling", "social_network": "reddit", "user": "Kique_120", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1598072364, "permalink": "/r/Suicidal_Thoughts/comments/ieckmo/why_should_i_suffer_this_feeling/", "nsfw": false, "first_save": 1635428900.6660037, "replies_charged": false}