{"id": "t5_28vigg_t3_nm4vc2", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "I wish I could have never been born, or could have done much better in life. Instead I’m constantly letting everyone down and whenever I’m not letting people down, my mind tells me that I’m doing something wrong which puts me in a shit mental state. I feel like I’m constantly drifting away from society and my friend groups even though we talk daily. I can’t hold a simple 30 second conversation with anyone without feeling like I’m doing something wrong or boring them.\nI wish I could find a way out without effecting anyone but I feel like that’s selfish of me to do so instead I sit in my room playing games to get the little bits of enjoyment from them. And whenever my friends decide to head off to go to bed or do something else I can’t help but feel shitty and start feeling like I’m not good enough. I just feel lonely constantly, even when I’m talking to a friend. I always feel selfish when considering asking for help because I’m not worth anybody’s time and my friends all have coping mechanisms for their down times, I’ve overused my mechanism by playing on my game too much, I can’t get any fun out of it anymore, going back to games I’ve enjoyed in the past to try and ignite the spark they once had but it doesn’t work.\n\nMy brain says 1 thing whilst my heart says another. My brain tells me I’m useless whilst my heart tells me I’m trying my best. I fear failure and judgement and my fear of failure just manifests the failure to happen.\n\nI just want to disappear or cease to exist.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nm4vc2/i_just_want_to_stop_existing/", "title": "I just want to stop existing", "social_network": "reddit", "user": "Burdett1878", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1622113196, "permalink": "/r/Suicidal_Thoughts/comments/nm4vc2/i_just_want_to_stop_existing/", "nsfw": false, "first_save": 1635429344.524651, "replies_charged": false}