{"id": "t5_28vigg_t3_ptovvj", "request": ["51bc1b45-8792-4b9a-86c9-1b72cd96a4ac", "183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "d3dca3a0-327c-45d9-8a03-9a1f01a14fd1"], "text": "I was going to do it. I drove out to the spot I had planned. It's this big abandoned water plant. I was going to drink as much bleach as I could stomach then jump that way if either method didn't work on its own I'd still die. I'd written letters and taken all of my money out of my bank to give to my roommate/best friend. I played the song that I've always wanted to die to. I was going to do it. Then something stopped me. I remember the feeling I had at my mother's funeral. I was wondering why she would kill herself without saying goodbye or apologizing. I remembered realizing that no matter what she did there would still be people who she did not make amends with. People who hurt like I hurt. Sitting on the top of that water plant I began to think about just how many people would blame themselves for my death. I couldn't have that. The next day I woke up and realized that I couldn't have live anymore. I couldn't just be alive until the day that I killed myself. I had to want to be alive. So that day I researched therapist in my area and emailed a couple of them it only took a couple days before I was booked with one. I'm still very depressed and at days I wonder if being alive will ever feel worth it but it's getting better. I never thought that I would go so many days at a time without thinking about killing myself. I'm getting better. You can get better too. I never thought that I would even have the balls to start therapy but here I am and I'm working on myself every day. All the parts of me that are broken I'm now actively trying to put back together. Please don't let me go through this alone. Please get help. Please come with me on this journey to figuring out what it means to want to be alive.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ptovvj/after_coming_inches_from_suicide_i_started_therapy/", "title": "After coming inches from suicide I started therapy.", "social_network": "reddit", "user": "justanindypunk", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1632376984, "permalink": "/r/Suicidal_Thoughts/comments/ptovvj/after_coming_inches_from_suicide_i_started_therapy/", "nsfw": false, "first_save": 1635428716.7461295, "replies_charged": false}