{"id": "t5_28vigg_t3_i68nom", "request": ["fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "Hi, my name is Andrea and I am 23. I live in Italy and I have a problem: since I was 13 I keep thinking that my existence is a waist of space and resources.\nI have never attempted or tried to attempt any kind of suicidal gesture, but this nagging thought has never left my brain for more than one day. I am a waist of space and resources.\nI am currently studying at university to become an engineer, I am currently volunteering in my parish to help adolescent socialize, I am currently singing in two different choirs as a tenor.\nI have things to do, I have friends to meet, objectives to look forward to, but I can't help this feeling of helplessness that is making hard to maintain the social net that I threw myself into hoping that will give me something to live for.\nMy family is actually very supportive and I was never in need of something that they were not willing to provide, from education, to emotional support, to financial support. \nSomehow this makes it even harder. I have never told any of my relatives about this feeling I have because I didn't (and I still don't) want to upset them or ask them to spend more economic, mental and emotional resources on me.\nI've told three people about this situation: the first one, who was my girlfriend at the time, laughed at me like I was telling the best joke you can imagine; the second one listened but I sense she got the idea that this thing is in the past and everything is fine now; the last one listened and insisted that I looked for help. I am in a situation in which it is difficult even to ask for any help. I don't want to waste anyone's time or effort in fixing me. You would be better off with pretty much everybody else.\nSo I'm living in this state in which I clearly need help, but I don't want to get it (especially I can't afford to spend any money on something like this). \nI am painfully aware that my problem is a first world problem that I would never even have the luxury to have if I was born in another country or even in another family, and I do recognise the privilege I have in the life experiences I am living right now; but please do understand that this pain is real and it makes difficult even to get through the day.\nAnother thing that I am painfully aware of is that this text is too long and I don't believe many have read the hole thing.\nTo all of you who have come this far goes my warmest thank you for listening to this nonsensical rant about my short period of time on planet earth. Please forgive me if I made any grammatical or syntactic mistake, but English is not my first language.\nHave a nice day you all beautiful people.<3", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/i68nom/10_years/", "title": "10 years", "social_network": "reddit", "user": "boncitplink", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1596927466, "permalink": "/r/Suicidal_Thoughts/comments/i68nom/10_years/", "nsfw": false, "first_save": 1635429639.3933034, "replies_charged": false}