{"id": "t5_28vigg_t3_lfet5n", "request": ["82ff3069-5f28-400f-ba6f-f94d4fcede90", "cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "I’ve been struggling for years and I just wanna talk to someone about it. \n\nI had straight As for the last two quarters but I’m screwing my grades this quarter for some reason. I have a 15% in pre calc because a couple months ago when we started trig, zoom couldn’t stop freezing so I basically gave up listening because there was no point. Now I’m so behind and bc I have social anxiety I couldn’t ask the teacher to record the lessons or tell the truth, and now my AP class that I was doing great on is a C because I didn’t have time to add summaries to my notes. And to make matters fucking worse, I got a 0/27 for my quiz for that class yesterday because once again I was running out of time to start it because I start things too late. Now i have a huge 5 part assignment for my USgovernment class that I have yet to start that’s due TODAY because I guess i procrastinated out of stress and shit. And to make matters worse I accidentally fell asleep while comforting myself last night and missed both my periods one and two. \n\nAll my grades are low I’m losing my motivation grades are my life and now I’m ruining everything and I’m not sure why I’m doing this. This is all adding the fire to the flame of me wanting to die. I have no career interest besides a music career that I can’t do because you have to start learning when you’re a baby to be good and we never had money for classes. I don’t want to end up being a doctor or scientist like my parents want but I also don’t want to end up like them working paycheck to paycheck. I feel like the only option is to die and my grades are just convincing me more.  \n\nI’m constantly thinking about keeping the garage door closed and leaving my mom’s car on and just relax playing my favorite music and games until I suffocate, I threw away my razors months ago but I want to hurt myself so bad because I’m the one who is screwing up my life, so it turned into hitting my head until I get headaches when I’m upset. It seems I’m being self destructive by not doing my work too because I know how it would hurt me. I’m also letting friends step over my boundaries. My friend ws struggling with the ap class last semester so i did her exams and quizzes and now she still wants me to do it even her she’s doing fucking fine in class. My fault for letting her think it’s okay, but it’s just one of my alternative ways of self harming. \n\nI’m getting more paranoid too I always think when my siblings are concerned it’s not out of good wanting to help me but to make fun of me and I can’t stop thinking like that. Getting help from them feels weird and embarrassing so if they ask If I’m okay I want to get angry. But at the same time I want someone to hug me and tell me everything’s gonna be okay and tell them the same. I’m getting closer to the date I chose to die when I graduate, but now I can’t even see myself going to eleventh grade. I don’t want to be an adult and work for the rest of my life I can’t even talk to people I don’t know what to do right now I can’t fix my grades and I hate myself so much. I have a baby sibling and I think about how it would feel growing up knowing their sibling killed themselves. Having people care about you when you want to die is so burdensome, but at the same time I want someone to care and help me. Just rambling about non important crap. I know things are just gonna get worse from here no matter how much I talk about it. If you’ve read this far thanks.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/lfet5n/everything_is_going_downhill/", "title": "Everything is going downhill", "social_network": "reddit", "user": "crislann", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1612799932, "permalink": "/r/Suicidal_Thoughts/comments/lfet5n/everything_is_going_downhill/", "nsfw": false, "first_save": 1635428813.6198702, "replies_charged": false}