{"id": "t5_28vigg_t3_iz2v58", "request": ["fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "(English is not my main language)\nI wish i could tell my parents that I was a victim of grooming and that a 20 y/o told me nasty stuff that traumatized me and I still have nightmares about it because my parents will say its ALL MY FAULT. I also think its my fucking fault but i wish just someone believed me. I wish i could trust in someone.\nBefore he groomed me i thought he was a very close friend that I appreciated, he had my mum's phone number because i dont have a good relstionship with food and sometimes i used to black out in public or get dizzy. But he used my mom's number to threathen me for months telling me \"If you dont stop using your cellphone after 3 am, I will call your mom and tell her all your private stuff and your self harm issues\"  or things like that\ni dont want to go thru the whole story but you can read it in my first post, it just was sooo triggering that my groomer, a 20 year old, visited my dad and asked him if I was doing okay. And just that. That was so triggering that I self harmed again. How does a person that sexually harrased you can visit your family like nothing happened? Sometimes it makes me derealizate and think that nothing ever happened and its all in my head and no one is real. are you all real?¿?  I just feel like I'm trapped in my body and i just have to wait that i lose self control and do something that makes me end up in a mental hospital. Currently starving myself til I black out or something i just dont care about my life anymore, just feel like i am a waste of money and space for my parents and my mental health has just been worse and worse and they all have their own problems and stuff I think they are gonna divorce soon idk my brother also has been depressed and my parents dont even notice, i have more than a week skipping breakfast and they dont even notice. I just feel like no one actually cares.\nI feel used.\nI feel useless\nI feel stupid \nHe took advantage of me.\nI'm just 15 I wanna die real bad\nPlease i need ways to kms \nThe only thing stopping me from attemping suicide again is my brother who suffers from depression and social anxiety diagnosed at 14. But no one cares about me? Sometimes i wish i just had a stupid diagnosis so people would believe that I am feeling horrible and wanting to die. My parents say its all in my head and that i need to pray so the devil dont get in my head??? I dont know how to say that\ni cant go to therapy because my parents say its all in my head and that i have to believe in jesus. Fuck it. We all going to hell anyways.\n\nWeeks ago I met a cute girl and she is into me and so am I but I'm afraid she will get dissapointed when she knows me better, she also has mental health issues and i just think that it wont work out because i ruin everything. Everywhere i go. I am a troublemaker. She wants to meey me in person but its too soon and even if it wasnt my anxiety wont let me and my parents wont let me too im afraid I will catch the corona and make my parents mad because if i catch the virus again, they cant go to their jobs and start yelling at themselves about money\n\nA Week ago my dad left my mom alone at the hospital. What makes me think they will care about my mental health?\nDont lie. \nIt doesnt get better\nI have been suicidal since 12\nPlanning on starving myself to death because I'm such a pussy and I dont have enough courage to slit my wrist vertically in my own house. I hate my parents i hate everyone sorry for wasting your time.\nI cant go out alone because I KNOW my parents know that i have been suicidal they found some pills thing from my last attempt but they didnt notice that I attempted and I told them that I had been taking those  meds carefully to feel better\nBut if I have the chance to go out alone i will try to jump off a bridge or something i just want to die.\nBye.\nSorry for this❤", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/iz2v58/starving_to_death_because_my_groomer_visited_my/", "title": "Starving to death because my groomer visited my dad this is really long sorry hopefully this is my last post", "social_network": "reddit", "user": "charmingsasha", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 9, "down_vote": 0, "creation": 1600972245, "permalink": "/r/Suicidal_Thoughts/comments/iz2v58/starving_to_death_because_my_groomer_visited_my/", "nsfw": false, "first_save": 1635429626.1753478, "replies_charged": false}