{"id": "t5_28vigg_t3_nj7q0c", "request": ["51bc1b45-8792-4b9a-86c9-1b72cd96a4ac", "cf81d7c0-cd42-4d3e-a15d-51251de387ba", "b38140a1-7eee-49dc-9a69-c07b4318950c", "d3dca3a0-327c-45d9-8a03-9a1f01a14fd1"], "text": "I'm 21 F , from India , studying Architecture. \nI have had physical health issues since forever but it's been getting worse over time. Recently i got diagnosed with a bad spinal compression ( after getting misdiagnosed 4 times and getting verbally abused by my family for lying and faking pain until I found my current doctor ) and have been recovering from it. One more thing is, I feel like I have breast cancer (exhibit most symptoms) but my parents don't believe me, and they have taken to family doctors who have all told me it's nothing without even giving me a breast exam. I don't have the money or the bravery to go by myself to get tested. Even if it turns out that I do have cancer, my family can't afford the treatment. \nRecently my breathing has been getting worse (from about 2020 December... But it's been getting progressively worse) and it's gotten to the point I can't even do any activities by myself without struggling and heaving. \nI also have ADHD, Anxiety and depression (which my parents never acknowledge) . I can't pay attention to classes due to my physical and mental health issues, and everyone at class treat me like I'm dumb so I can't even reach out to them over this. \n\nIdk if it's just not visible or my parents don't want to see it, but they never pay attention to my breathing patterns even if I'm struggling right in front of them and my breaths are loud, and they give me chores to do... After repeatedly telling that I can't do it, they leave me . My dad has had a heart operation and gets mad easily and tries to blame everything on me. Today he saw that I didn't wash my dishes ( washing just my own plate shouldn't be hard but I wasn't even able to stand ) and got super mad at me and told me I deserve to die, almost 20-25 times, after which I told him he shouldn't use those words with me... To which he said I only talk back and started screaming loudly, ( this has been a repeating occurrence, him getting mad and raising his voice at me, and the rest of my family getting mad at me for provoking a heart patient) \nNow ...I already have suicidal thoughts due to my health issues. But these words really push me to it and right now I just want one way to die painlessly.... I have enough sanity left to remember that it's best to reach out to someone during such times and I have no one close enough who is mentally available to listen to all this without their own mindset going bad. \nWith the covid situation being especially bad, there is no way I will be going out to meet doctors at any point soon.\nI just need someone to LISTEN ... Once. I've never ever told all of this to anyone and always keep listening to everyone else's problems but I feel like they're all trivial compared to what I'm going through. Just...I need one person who will tell me I'm valid.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nj7q0c/verbal_abuse_myriad_of_illnesses_suicidal/", "title": "Verbal abuse , myriad of illnesses, suicidal thoughts. please just listen to me... Nothing else.", "social_network": "reddit", "user": "Ishadpi", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 10, "down_vote": 0, "creation": 1621776365, "permalink": "/r/Suicidal_Thoughts/comments/nj7q0c/verbal_abuse_myriad_of_illnesses_suicidal/", "nsfw": false, "first_save": 1635428737.640358, "replies_charged": false}