{"id": "t5_28vigg_t3_eu16lq", "request": ["9a99c5f4-ecf8-49dc-bda3-9ea5262997da", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "Hi,\n\nI'm currently a first-year university student and to say the least, things have been rough for quite a few years. To give some more info, I'm 18 years old and I've been dealing with a major depressive disorder since I was about 10 years old and severe anxiety for about the same amount of time. I have recently been diagnosed with severe schizophrenia and type II bipolar disorder. I  have been in and out of the hospital several times due to constant self-harm (burning and cutting all over my body, along with causing head trauma by hitting my head). \n\nover the last 2 years, my family life has just gone on a rapid downhill spiral. It all started around November of 2018, I found out my father (65 years old) was cheating on my mother with a woman who is much younger than him (24 years old). mine and my family's life have been turned upsidedown and everything has been going wrong. my mother has been having mental breakdowns more often than I can count. my father has done nothing to heal what has happened even with multiple attempts from everyone in our family. \n\nmy dad has never really been a good father, he has been a pilot for over 35 years now, therefore he never really has much time for family, my mom exclusively raised us and whenever my father was at home all my sister and I received was verbal abuse. after my older sister left the country to go to a Canadian boarding school, it was just my mother, father and myself. my mom would leave to go play netball with her friends and it would be my father's time to take care of me, he used that time to verbally abuse me about anything he could, and most of the time it would be about my emotional state and my mental health. after the first year of my sister being at boarding school, it was decided that I would also be going. the year before I went to boarding school across the world my father started to physically abuse me, we would hit me and shove me to the ground. a few months before I left for school my mother and I went back to our old family home in Canada to visit my sister and that was the year of my first suicide attempt, which was the first of many to come.\n\nfrom then on is when my life took a turn for the worst. I was sent off to boarding school where I used the excuse of not being comfortable in a short-sleeved shirt to continue to cut and burn myself. everything just went to shit in a matter of months.\n\ncoming back to currently.\n\nwith my recent diagnosis of schizophrenia and type II bipolar disorder and a plethora of medication change. my head has been telling me nonstop to just end it all, end my suffering and simply let all the people have a break from my restless mind.\n\nI just wish that I didn't feel like this.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/eu16lq/i_have_been_thinking_about_killing_myself_my/", "title": "I have been thinking about killing myself, my existence is a burden", "social_network": "reddit", "user": "alldayfaye366", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 8, "down_vote": 0, "creation": 1580008027, "permalink": "/r/Suicidal_Thoughts/comments/eu16lq/i_have_been_thinking_about_killing_myself_my/", "nsfw": false, "first_save": 1635429397.7170312, "replies_charged": false}