{"id": "t5_28vigg_t3_nikfvs", "request": ["20e5f323-e2c4-450a-8af3-177af94313bf"], "text": "(excuse the typo. But eh, idrc that I made a typo....)  \n\n\nor......we google ways/ask for advice on here in hopes of finding a foolproof method that won't land us in a hospital or in a vegetative state?\n\nI really hate when people say that. Being in denial thinking that we, or at least I actually want to live. Please don't tell me what I do or do not want to do. You aren't me, so stay out of it.\n\nThe desire for \"The Great Escape\" has only festered since three weeks ago. Being alive and seeing people be what I wish I could be but isn't due to a bad roll of the dice, or a bad coin toss, etc.\n\nI don't want to be alive knowing that I am the wrong biological sex, knowing that I lived 30 years as the sex I am physically repulsed by, and I don't want to be alive in this zombified state of emptiness. No moving to another state won't help, since you need a lot of money for that (and even during a pandemic this seems like a hard thing to do), no getting laid won't help since you need to be somewhat desirable for someone to want have sexual relations with you (especially during a pandemic), no finding a new hobby won't help, especially since I am already unmotivated to live or do my current hobbies in the first place.\n\nI had my second therapy appointment yesterday with my new therapist and I still feel empty, unmotivated and I just want to stop existing.\n\nCan't stand it. Tired of being alive...It just is not worth it.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nikfvs/if_you_wanted_to_die_you_wouldnt_be_goggling_ways/", "title": "If you wanted to die, you wouldn't be goggling ways to kill yourself\"", "social_network": "reddit", "user": "LifeBytes123", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 14, "down_vote": 0, "creation": 1621695578, "permalink": "/r/Suicidal_Thoughts/comments/nikfvs/if_you_wanted_to_die_you_wouldnt_be_goggling_ways/", "nsfw": false, "first_save": 1635428951.570184, "replies_charged": false}