{"id": "t5_28vigg_t3_kpmwyn", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "at first I want to say that **English is not my mother language**, so if I speel it wrong, or expose my feelings in a wrong way, I am deeply sorry.\n\n**MY LIFE IS SLIPPING AWAY FROM MY HANDS, AND I DO NOTHING ABOUT IT.**\n\nI am a desperate stupid. Have nothing to make myself passionate about this life. In real, people know me as:\n\n**\"easygoing\";**\n\nI am not. The short version was really I am not. In the inside of me, I don't like any people around me, I feel like I am above them and they can't catch me up. When I meet with a person at the first time, I got confused about what to do (even though hand moves etc.) and get very nervous at the moment. I try to keep cool, but it is impossible. I can't even make a good sentence to the person I am talking to.\n\n&#x200B;\n\n**\"excited and exciting\"**\n\nI am not. I don't enjoy anything, couple years ago I was addicted to anime, foreign (english based) tv series, movies, game(real game like mmorpg not mobile etc. :) ) and other things. What has been changed in my life ? Who am I ? I am a desperate stupid person that can't even cook my food because im too lazy.\n\nI had been used to cook my meal when I'm hungry, now I don'T want to go to the kitchen.\n\nI watch a tv serie recently BoJack Horseman via Netflix by pushing(its i think correct expression) myself toooooo hard.\n\nI don't enjoy anything I watch, anything I play. I don't even masturbate for 2 weeks and I don't feel that I need it. (Just sometimes for the circulation)\n\n&#x200B;\n\n**\"hyperactive\"**\n\nI am not, I used to be hyperactive. Last years, people use me as a wallet, napkin etc. and I don't have a feeling that I should live. I am not even close to be full of life. :(\n\n&#x200B;\n\n**\"man of his words\"**\n\nI used to be. I was taking the words seriously that for example I have a girlfriend, I would never ever do stupid things like smallest thing that like cheating/looking another women. I was giving my word to my girlfriend and I have been cheated twice. I don't understand the person is cheating me or not, don't care though anymore...\n\nRecently, I tell lies, sometimes big lies and I don't even care, I say like \"duckkk whateverrr scr\\*w itt.\"\" etc. Nobody catches my lies though.\n\n**\"smart\"**\n\nI used to be. I was thinking every second that like I was feeling like I am an \"entrepreneur\" and I can do many things if I had any chance. I had millions of ideas and millions of dreams that I want to do. I do nothing but shitting my pants.\n\nI didn't go to university, yeah I am enrolled to university, but its public and I don'T care my profession.\n\nwhen I was a child, I wanted to be a police officer. While growing, realized my eyes are not powerful enough to be a police officer.(myopia) I went to vocational high school (qualified) to work in emergency services.(paramedic) But I didn't like the thing I do and after high school, I didn't keep up the same thing.\n\nI did pretty hard while I was a high school student and was working part time in weekdays, full time on weekends. Developed myself and tried better that times, was creating a game servers and renting(selling) them to players.\n\n&#x200B;\n\nRecently, everyone is smart, I am just so dumb that I can't even do/think anything, but \"**HOW TO SPEND MY DAY FASTER AND SKIP TO THE NEXT DAY?**\"\n\n&#x200B;\n\n**\"golden boy\"**\n\nmy friends known me (what friend???) as a successful and everytime \"I\" HAVE THE IDEA OF FIXING things. Like economy, situations, problems, but nerdy style.\n\n&#x200B;\n\nI don'T give a shit about anything, I don'T even have my own option. I just quote the people on internet who's idea sound better to me.\n\n&#x200B;\n\n\"cheerful\"\n\nWhen people talk to me, I try to make jokes, dark memes or usual memes, send via IG some meme posts etc. share serious but funny things, but in real me I don't even laugh sh\\*ttttttt. I don't even smile. Nobody makes me smile and if a girl approaches to me I be like \"omg what do i do what do i do\" and fall in love with her in \"**5 DUCKING SECONDS!!!!**\"\n\n&#x200B;\n\nin 5 seconds, how can I be in love with a person I don't know and she sucks my all cheer in a second.\n\n&#x200B;\n\nWhen she texts me, I get excited temporarily and answer back, then again zombie mode.\n\n&#x200B;\n\n\"successful\"\n\n&#x200B;\n\nI am not even close to be successful. I just went abroad for a year with my savings and when I had no money, I didn't have the courage to work and came back to my country.\n\n&#x200B;\n\nI wanted to buy a farm a bit, I was thinking of peaceful life, quiet and far from people, so I could feel alright.  I gave up.\n\nI wanted to start my own company,\n\nI wanted to start a YT Channel,\n\nI wanted to start an IG page,\n\nI wanted to start some ideas of mine as projects,\n\n&#x200B;\n\nI gave up all of them or which is better I gave all of them up. :(\n\nI wanted to take the test and study Law, and become a Lawyer, I gave up.\n\n&#x200B;\n\n&#x200B;\n\nmy life is about giving up. I am so confused and lonely, I am unstable and for about couple months, I feel like;\n\n&#x200B;\n\nif I hang myself, how long would it take to find my body?\n\n(I mean like call me, worry about me and find my home and check if im ok)\n\n&#x200B;\n\nI feel like it would take more then a month to find my body dead.\n\n&#x200B;\n\nWhat should I do ? How do I get the \"joy of living\" back ?\n\n&#x200B;\n\nI am so egoist btw, also selfish.\n\n&#x200B;\n\nRecently I used to drink any free time, but I don'T even want to get up and take a shower.\n\nI don't know, I am sorry making your brain confused.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/kpmwyn/how_do_i_escape_from_the_feeling_of_commiting/", "title": "How do \"I\" escape from the feeling of commiting suicide?", "social_network": "reddit", "user": "Rayjon32", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1609689415, "permalink": "/r/Suicidal_Thoughts/comments/kpmwyn/how_do_i_escape_from_the_feeling_of_commiting/", "nsfw": false, "first_save": 1635429014.5519638, "replies_charged": false}