{"id": "t5_28vigg_t3_m5w6zn", "request": ["b38140a1-7eee-49dc-9a69-c07b4318950c", "7e28da7a-0583-461d-a0da-99621d24119a", "d3dca3a0-327c-45d9-8a03-9a1f01a14fd1"], "text": "So lately, due to many circumstances in RL, I've been relapsing into suicidal thoughts. It's been some weeks. Some days are better some worse. And even though I've dealt with these feelings countless times, it really destroys you time and time again. But this post isn't about that. It's more about how I manage to escape these thoughts. And yes, it's pretty much escapism. So beware since that can be addicting. But honestly, even if you have an addiction, you're still alive in the end. So there's that.\n\n[Addiction > Suicide] lmao\n\nAnyways. So, I normally cope by reading(books, manga, webtoons, etc.) and immersing myself into these worlds to escape from reality. Sometimes also watching some series and anime, but I'm not as much of a fan anymore tbh. But honestly, that's also what I do when I'm just simply depressed. When I'm having a suicidal episode, and with that I mean the nights when I just want to get my rope and run into the forest that's near my home... By then I don't need something that just distracts me, I need something that keeps me alive. So I go onto amazon(or any other shopping website, honestly) and put some stuff on my wishlist. If I have money to spare even buy something. But what it does in my brain, is that it somehow creates this future where I somehow buy and use this thing. It makes me look *slightly* forward to the time where I can use this cool or nice thing. And in the case where I actually buy something, it makes the excuse of at least waiting until the thing arrives. I mean I bought it, now I can't just go and kill myself, that'd be a waste of money. That kind of logic. And then when the item arrives, I'm often not as bad as I was when I ordered it. But even then, I still need to actually use that item, right? So I'd better postpone killing myself a little more. Yeah, basically my coping mechanism is finding ways to postpone my suicide until it gets better.\n\nI just hate this all. I feel so horrible, so helpless, it's all so difficult. And I really don't understand why everything has to be so difficult, so hard. But it's something I can still bear with right now. I don't know how long, if it will ever get better or if I'll succumb one day. I just know that I'll fight it until it gets better, or until nothing is left of my will. \n\nAnd if you, who's reading this, still has an ounce(or gram) of your will left, no matter how little, please fight with it. It's your only ally in that dark place. You know you experienced some darn good days somewhere in your past. Even if it's riddled with bad things, I'm sure you have people you love, or once loved, people you had so much fun with. I'm not saying that you shouldn't kill yourself *because* of these people. I'm saying that you should do it for your own sake. Hold on to these feelings you once felt. Don't EVER. Live your life for the sake of making others happy. Search for every single little thing, that could make YOU happy in the present or future. It doesn't matter if that's a pajama you saw and really liked and wanted to try on. Just keep seeking light somehow. I know how hard it is. It's not easy in any means. I just want to give up on a daily basis. Yet I know if I do, there will never even be a possibility of me being happy or normal ever again. Because I would've literally killed that possibility. \n\nSo now, just ask yourself: Do you want to be happy/feel normal again? If your answer is yes, that's all the more reason to continue fighting. \nIf it's no, well fuck. \nJust joking.\nIf it's no, do you really have nothing you desire? Stop focusing so much on suicide for a moment. Don't tunnel in on that thought, and broaden your vision a little. Think about something you were genuinely interested in, or liked, this month or week. Or even year. What was it? No matter what it was, make it your reason to survive just *a little bit longer.* Rinse and repeat. Make everything even slightly positive in your life a reason to continue a little longer. You like that brand of cookies? Yeah, think about killing yourself after you've eaten that. Just extend it. And get a therapist in the meantime. Honestly, if you find a good one, they can work wonders. Even I wouldn't still be alive without them. And if you don't have enough money for that, look up the national suicide prevention hotline for your country and give them a call. It's free. And anonymous. Just don't give up. \n\nBut if you somehow do give up, which I really hope you don't. Make sure you at least gave it your all in the life you lived.\n\nSorry for the long post, got kinda carried away. But if you read this all, thanks I guess?", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/m5w6zn/relapse_into_suicidal_thoughts_and_how_i_cope/", "title": "Relapse into suicidal thoughts and how I cope", "social_network": "reddit", "user": "SuckerFor_Sweets", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1615853998, "permalink": "/r/Suicidal_Thoughts/comments/m5w6zn/relapse_into_suicidal_thoughts_and_how_i_cope/", "nsfw": false, "first_save": 1635429415.950377, "replies_charged": false}