{"id": "t5_28vigg_t3_ikac1s", "request": ["bc91f4ca-43b9-43f6-a8ac-76c7feeea65b"], "text": "I'll start by saying, people have already tried to kill me. I don't know why, other than I got close to one of them and the family didn't like it. But that's all I know. My mother has openly admitted that she never \"developed any attachments\" to me. People have been extremely abusive to me right in front of her and she just says it's my fault and I deserve it. Recently I had a serious allergic reaction and she told me I wasn't allowed at her house and cussed me out when I called my grandmother to take me to hospital instead. My mother told me \"she couldn't be bothered\". My grandmother has had several strokes that make her act like she's got Alzheimer's, and sometimes she's good and acts like the mother I wish I had, but the rest of the time she tries to kill me and is very abusive. I try to help with her though because my mother can't be bothered to do it, and I like her when she's lucid. I don't have any local friends, and my online friends barely talk to me. My local friends just treated me like a dirty secret, barely ever talked to me, and refused to ever include me in anything. I've tried everything I could think of, everything I could find, and everything that was ever suggested to try to improve my social skills so I could at least have a friend. Every time I try to develop a connection with someone they still just treat me like I'm an evil monster or something. No matter how nice I am, they just instantly hate me. I lost my job just before Thanksgiving, and starved thru the holidays. I finally got a new one about a month ago, but the guy somehow got it in his head that I had skills I specifically told him I didn't. After the first day he said I wasn't fast enough. I did my best to improve, and have improved significantly. He just tells me I'm still not fast enough and that I'm \"not worth the money or training\" that I'm not even \"worth paying\". I told him about my bf so he could open his other restaurant back up, and he said he liked the idea and could really use the money from the other location. But as soon as he met my bf he got even meaner towards me, constantly pulling me aside to tell me how worthless I am and that the govt is \"paying me too much\" and \"making him\" pay me too much. I make minimum wage. Once my bf started working for him officially, he gave him an average of 6-8hrs, starting at 5 days a week, and wanted to give him more. He cut my hours to 0. I got depressed because of it and my bf said it was mostly my fault because I decided to try to be nice and warn him that if he tried to replace me with my bf it would upset my bf and he'd end up losing us both. I also tried to come up with ideas to make my costs less while I was learning, and told him I just wanted things to work out for everyone. While my bf initially said it sounded good, he changed his mind later and started calling it blackmail and said I deserved to get fired and that he no longer had to quit and go back to his old job because now he had a reason to fire me. My social skills aren't great, I thought I was being helpful.... My bf who had moved in with me for the job, and who has been increasingly asshole-ish since he moved in started blaming me for him having to quit the \"job he loved\" (like we'd agreed in advance that he would if he was just used to replace me). I tried to give him space cuz he said my being affectionate and trying to cuddle was \"being too clingy\". So I slept on the floor, which really hurt because I have a dislocated rib. He woke up, said he didn't sleep because I wasn't there and as a result was in a lot of pain (joints? He has some nerve damage on his arm.). So he decided to quit, and just blamed me. I tried to come up with ways he could not lose the job and he just got mad at me and packed up his things and left. My bc has made me very suicidal this cycle, during all of this, but tbh I already was. I've been abused and hated my *entire life*. I've tried everything to find *some* group I could fit in with, I've tried everything to be nice and more likeable, but nothing has ever worked. And I'm just tired of fighting. I'm tired of trying. I don't know how much of it is the hormones, but... I'm tired. I've tried, and no one ever gives me a chance. I don't know why. There's clearly nothing I can offer this world, no one wants me, and no one cares what happens to me. I think the only person that would be effected is my grandmother, and she'll just forget after a while. My absence has never effected anyone. I don't see the permanence of my absence effecting them anymore than it already does. I'm just... Done.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ikac1s/alone/", "title": "Alone", "social_network": "reddit", "user": "Nocturnal_Embrace", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1598920860, "permalink": "/r/Suicidal_Thoughts/comments/ikac1s/alone/", "nsfw": false, "first_save": 1635428793.762182, "replies_charged": false}