{"id": "t5_28vigg_t3_e8so2n", "request": ["610564bc-0916-401a-93cd-8d3e727a24ed"], "text": "(Rant) I’ve had a pretty rough go of things the past decade. Lost my mom to suicide in 2008, then lost my dad to a motorcycle crash in 2016. On top of that, I had three beautiful kids before I turned 26. I love them with everything in me, but damn is it hard raising three kids with absolutely no help. Their mother is the best mom they could have, and I pride myself in being an amazing father. But sometimes, that just doesn’t matter to me. I’m financially in a very deep rut. No matter how much I make, it’s never enough and it’s gone immediately. It doesn’t seem like it will ever end. I understand that this is strictly self inflicted. I think about suicide multiple times a day, but not in the conventional “who would care” type of way. I feel like I’m obligated to not die because of my kids, bills, work, etc. I know this is no way to live, but I’m at my wits end and have no idea what to do. I’m severely addicted (more mentally than physically) to marijuana and feel like it is the only thing keeping me slightly sane. And when I don’t have it, it’s an existential crisis. I completely understand that I need to drop this habit, but it feels like if I do, I will lose the battle to myself. Those 2-3 weeks after quitting that everyone says are the worst, seems like decades to me. I don’t want to die. I want to live and see my babies grow into the strong young adults I’ve raised them to be. But I’m so exhausted and ready to rest. My relationship has hit rock bottom. Me and my “girlfriend” haven’t been close for over a year now. I can see that I’m starting to take a toll on our relationship. She seems to not want to be with someone who has mental trauma, or like it’s becoming a “your trauma isn’t my trauma” type situation. This is just me making an uneducated observation. But either way, my brain is telling me she wants nothing to do with me and is going to leave as soon as she has the chance. Life just seems to take a liking to kicking me when I’m down, or when I’m finally trying to get back up again. I just feel cornered. It feels like I’m being held up by strings. Some good, some bad. But when I decide to cut a bad string, it feels as if three good strings are cut as well. I’m not sure if that makes any sense to anyone but me. Basically, I’m scared to start doing the right things, because all the right things come with bad side effects. I know this post is super non-sensical, but sometimes I feel like a have absolutely no one to talk to about these things, so ranting to a bunch of strangers seems to be the one thing that makes me feel like a very small minute weight has been lifted off my chest. So I appreciate anyone who took the time to read this and I apologize for the ranting.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/e8so2n/i_dont_want_to_die_i_just_want_to_cease_to_exist/", "title": "I don’t want to die, I just want to cease to exist if that makes sense.", "social_network": "reddit", "user": "babiskwerl", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 10, "down_vote": 0, "creation": 1575994570, "permalink": "/r/Suicidal_Thoughts/comments/e8so2n/i_dont_want_to_die_i_just_want_to_cease_to_exist/", "nsfw": false, "first_save": 1635429060.4417965, "replies_charged": false}