{"id": "t5_28vigg_t3_lvu6q1", "request": ["7095f3d3-98c4-4ee5-b79c-7083d5f62bab"], "text": "I didn’t know where else to post honestly, I mean I’d love for this to all be over but I am not gonna kill myself. I am too scared of death and also I’ve felt this way before (just not as strongly) and eventually things did get a little better so I’m hoping that will happen again. About 5 months ago me and my girlfriend of 3 years broke up, we were off and on so I always expected her to come back ya know? She didn’t this time. So now she’s with a new guy and I saw her Snapchat story with him in it, she’s staying at his house it seems and just I don’t know it hurts man. I took her off Snapchat so I can’t see the stories anymore (I don’t really use it I just decided to log in that day) seeing her with him it just sent me back to day 1 of losing her. It kills me to think of her with some other guy, loving someone else. At the same time I want her to be happy and I feel selfish, I suffer from depression and drug abuse and she didn’t use drugs at all so honestly I felt like she’s better off with a more stable guy. Honestly I think this was the best thing for her so I feel so fucking selfish man but I can’t help but miss her so much.... I don’t know how to get over this, I am an artist but I can’t even draw without thinking about her cuz I was teaching her art... the one thing I loved to do that took my mind off pain in life now makes me think of her and hurts me. I don’t know what to do man. Sorry for writing so much guys. Thanks for reading.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/lvu6q1/not_gonna_hurt_myself_just_sad/", "title": "Not gonna hurt myself just sad.", "social_network": "reddit", "user": "77Funerals", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1614660682, "permalink": "/r/Suicidal_Thoughts/comments/lvu6q1/not_gonna_hurt_myself_just_sad/", "nsfw": false, "first_save": 1635429249.5547445, "replies_charged": false}