{"id": "t5_28vigg_t3_qcl3ci", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "7e28da7a-0583-461d-a0da-99621d24119a"], "text": "So I’m 36 years old, and I hate my life… mentally abusive parents, and other family members have ruined life for me. From the time I was about 10 is when I have my first memories of conversations leading up to “you’ll never be good enough”. It was always over dumb things that to this day I wonder why they mattered. \n\nDue to their inability to care for themselves anymore, I still decided to put my life on hold about 2 years ago, and left my life as a single bachelor to come back and care for them as they’re older and I just assumed they’d respect me as an adult. Unfortunately that’s not the case. Every single day is arguments. It’s like I’m back in high school. \n\nToday was the day that broke the camels back. \n\nDue to a car accident about a month ago, I sustained life threatening injuries that prevent me from leaving the house. I’ve lost my career because of it, however I had an interview today to work from home. It didn’t go well. While they were cool enough to do the interview through tele-chat, it wasn’t even close to enough, and quite honestly the whole thing just depressed me as I really thought this would be the one good thing to happen for me in the last 2 years.\n\nIn the process of my interview I sat outside for it, leaving my mother to do whatever it was she felt the need to do throughout the house, which apparently included the breaking of my one of a kind, signed guitar, that I received from the guitarist who kept me alive during my childhood. I wasn’t met with an apology. Instead, I was met with “it’s not my fault” “it’s time to get rid of that thing anyway” and a whole bunch of other shit that just wasn’t ok. \n\nI know it seems as if I’m complaining and overreacting, but the rest of the stupid things that just piled up over the last 36 years have me in bed at 2am with a multitude of options staring me in the face. I don’t know how much longer I can hold out. \n\nTherapy hasn’t worked, I’ve begged them to come with me, to no avail, I can’t afford to get them health aids by myself, ESPECIALLY now and my brothers won’t help me.\n\nI don’t know what else to do. \n\nI think I’ve reached my breaking point, and feel like the world would be better off without me.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/qcl3ci/i_think_ive_reached_my_breaking_point/", "title": "I think I’ve reached my breaking point…", "social_network": "reddit", "user": "musicalchef1985", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1634796395, "permalink": "/r/Suicidal_Thoughts/comments/qcl3ci/i_think_ive_reached_my_breaking_point/", "nsfw": false, "first_save": 1635428840.24576, "replies_charged": false}