{"id": "t5_28vigg_t3_gllpat", "request": ["fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "When I a sophomore more in high school (15/16) I took off while my parents were at a party with my younger siblings. I ended up at my boyfriend’s house and my parents showed up 15 minutes later because my older sister called them when she couldn’t find me.\n\nWhat my mom never learned was I fully planned to kill myself that day and the reason I was at my boyfriend’s house was to say goodbye. He had happened to have a friend over so I wasn’t able to have a moment with him before my mom pulled up fuming mad and yelling at me.\n\nI had left left my phone unlocked on my bed pulled open to a note I had written that I deleted before handing her my phone when she brought me home so she never got to read it. What she did read was text messages between my boyfriend and I that made it look like I had planned to sneak out to see him all along.\n\nMy plan was to leave out the back door and go to his house to say goodbye then go to the park that housed a dam that had a hydro-plant  of sorts attached and jump in down stream where the current was too strong for my to swim. I’ve never been a strong swimmer but I knew full well that survival instincts would kick in and I more than likely be able to save myself we’re I to jump in anywhere else.\n\nI fully planned to drown myself that day. I strongly believe that if I hadn’t made that trip to say goodbye to that boy my mom wouldn’t have found me soon enough to stop me and I am so glad she did. I still suffer from suicidal thoughts and tendencies but I have grown past thinking of only myself and I couldn’t imagine leaving my family that way.\n\nMaybe one day I’ll sit down and talk to her about that day but I know right now she’s dealing with so much it would just break her heart beyond repair. We have a strong relationship and we share so much of our lives but I still find it so hard to share that part of my mind with her.\n\nShould I rip off that band aid in an attempt to heal or should I continue to protect my mom from the reality that she could have lost her child that day and possibly so many others?", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/gllpat/my_mom_just_thought_i_was_trying_to_spend_time/", "title": "My mom just thought I was trying to spend time with my boyfriend", "social_network": "reddit", "user": "dgcloe", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1589743966, "permalink": "/r/Suicidal_Thoughts/comments/gllpat/my_mom_just_thought_i_was_trying_to_spend_time/", "nsfw": false, "first_save": 1635429638.5742972, "replies_charged": false}