{"id": "t5_28vigg_t3_jr42vc", "request": ["fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "I don’t have any friends nd I do try make friends but I have no social life so even if I wanted to make friends I couldn’t I feel so anxious all the time and I just feel so lonely and depressed, my boyfriend played with my heart and fucked me around nd broke up with me on Valentine’s Day and made me feel like I was worth nothing. He blamed all his mental health on me because he didn’t wanna take the responsibility for it so he made me carry it on top of my own issues and I let him just dump all his problems on me until it cost me my education nd I was kicked out of my school because of his parents threatened to make a load of stuff up to get them in trouble if they didn’t get rid of me and I just don’t know what to do anymore, I’ve been clean of SH for months now but I’m ngl I think ima gonna relapse nd it’s been over a year since my last attempt nd all the feelings are coming back. I met this guy and he’s so fucking nice nd amazing nd I rly like him nd he likes me but I keep pushing him away because I don’t wanna get hurt again and I can’t control myself because I just wanna hug him nd let it all out but I can’t bring myself to do it. I’m sorry if your going through suicidal thoughts and I hope you get the support you need no one should have to feel such intense pain 🥺", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/jr42vc/is_it_me_or_is_anyone_else_so_lonely_atm_that/", "title": "Is it me or is anyone else so lonely atm that they feel like there the only person in the world...", "social_network": "reddit", "user": "SyncmXemzy69", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1604949193, "permalink": "/r/Suicidal_Thoughts/comments/jr42vc/is_it_me_or_is_anyone_else_so_lonely_atm_that/", "nsfw": false, "first_save": 1635429624.601326, "replies_charged": false}