{"id": "t5_28vigg_t3_odbgev", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "1298478d-f218-4dd4-a918-dcb9600d82ed", "20e5f323-e2c4-450a-8af3-177af94313bf", "51818c1f-9070-43a1-96e3-b1b348ef35e0", "6587bfb5-f909-4bd9-a1eb-ee7504e47d40", "d76dec3b-b6e9-43b7-bfb3-d6c48dabd65b"], "text": "Life sucks. And i hate it. And i hate everyone in it. And that includes you, and that includes me.\n\nWhy? I'm sure there are family and friends who will ask me that.\nAnd i will tell them, Why not?\nWhat is so goddamn great about life that i should stick around to experience every single agonizing second of it.\nBecause its fleeting? and you only get one life? Good. Atleast I only have to live through one. And this Brotherhood and salvation and eternal life that every religion promises, dear God man. Last thing i want to happen after i die is to have more life to life, more neaningless love. \neternal life... I can't imagine a worse hell. Its worse than Fire and brimstone. Heavens a place filled with people i hated in life. Ahh There's the rub. People. God if i could just get away from people. At one point, I really wanted people. I Wanted their love and affection. I wanted To be heard and understood by them. I wanted to relate and be related to. To be important to someone. My problem isn't even  being single or heartbroken and depressed from loneliness. Its nothing that can be fixed with time. i don't feel like I'm one of you. Either because i have failed to be one of you and i have become this cynical person that hates you for it, or you have failed to make me feel welcomed among you. But it Dosen't really matter.\n\nEvery human connection, every relationship, ends in grief in death or betrayal. leads to me feeling lost used and abandoned. unwanted once they've got what they wanted. \nEveryone is a capitalistic opportunist trying to rob each other or take advantage of some poor fucker.\nBut they never want me. Pick your poison.\nLeast when i was a kid thats how i felt. \nBad people right. But there are good people out thwre.\nNow the good ones anger me the most. I hate them the most. Everything and everyone no matter how sweet and kind they are just anger me and i hate them and want to hurt them.\n\nI am not a good person. I say fucked up shit to strangers on the internet. I self harm because its the only relief i feel sometimes. I'm a lier and a hypocrite.\nI've used people too. Perhaps to the  unmerciful extent that I've been used before, but I am still guilty. I'm every bad thing that ever happened or was done to me.\nOf course, I was the worst thing that ever happened to me. I chose to let it all happen. I chose to deal with it by scaring myself  physically and emotionally, burning my body, bashing my head til unconsciousness, or\naccepting hatred and nihilism into my heart and mind until those become my anchors.\n\n\n(The black and white come in )\nI want death more than I want life.\nBecause death seems so much nicer than this. Not because of salvation or heaven. But the nothing. Thats what fascinates me. That's what makes me feel excited now. Scared, but excited.\nAn abyss that will completely erase me and everything i ever was or could have been. God, why does it warm my heart so much more then the love of a woman or a God.\n\nLove, hope, faith, happiness. \nFrail, meaningless and useless things I don't want.\nMaybe there was a time when i did.\nthose things were always sold out when ever i went lookin. So naturally I just lived without. And only Then did i come to the horrifying realization that I never needed those things in the first place. That I never really wanted those things. That like a drug addict needs his fix, these people who are obsessed with love hope faith and happiness, are all just doped up privileged little monsters whom without  those things would elect to die as soon as possible. I am not like them. I have always existed in this disconnected state that has afforded me the terrible truth that all life is futile, and that pleasures and joys and Gods and people are all slowly decaying infront of me. I see people as walking corpses. Unaware of how dead they really are.\nlife will take what it wants from you and then put you back into the dirt where it spawned you.\nAnd our reward for it all is a slim hopw that theres An afterlife awaiting to perpetuate an existence that you never had any choice but to dwell in. You may love your life, your family, your friends, your possessions, maybe even love yourself. And I'm sure that life on earh and the life after that will be great. I'm sure that life can be great if I wanted it to be now. BUT I DON'T WANT THAT.\nthe want, the desire, the void in your chest always told you to want what you want. What happens, if you don't want anything or anyone.\nWhat happens when You just simply don't want. \n\n\nSo what is it that i want.\nFor a little while I just wanted to Want.\nTo desire. To hope. To pine. To starve. To eat and feel full. To love and fill loved.\nTo pursue, and be excited and driven. to be satisfied.\nTo be a fuckin human male, living his life.\n\nBut even that want is gone. \n\nLove, hope, faith and happiness peace, simply don't exist. And i cannot pretend that they do anymore.\n\nHate, Despair, Rage and Death, are the only things i can wrap my head around. I can reach out and touch them. \nThey're real and tangible. \n\nI want to hate this life and everyone in it that causes me so much pain and that includes me for i hate myself more than anything, i want to feel the despair because that's all i can feel and it's honest and true and defeats one of thwir greatest enemy and that's illusions of grandeur.\nI want to show my rage towards this very plain of existence and the people and the God who desire i keep perpetuating it and be happy like them to just race towards their graves all the while watching everything and everyone you ever cared about or loved slowly and quickly die and then be left to rot in the ground. I want to kill the people who've created a heaven that will make every indignity, every grief filled teardrop, every second of agony you lived through Eternal and never ending. But hey its all worth while being this life was only a test and you'll get to see everyone you lost or never even knew again in paradise! \nThe idea makes me sick. It makes me want to puke.\n\nMost of all tho.\ni want to die. I qanna die because death is the real release, the end of it all. The true climax that no sex could ever reach. Ring me. that will be a salvation unlike any eternal afterlife, the ceasing of existence. Freed of every thought, every memory, freed of a personality and a soul, Swallowed up into pitch black nothingness and ripped into infinite shadows of what use to be a broken man. Til i become the nothingness itself. \n\nThe twisted mind that lay underneath the very soul, the darkness you run from will one day have you.\nbefore that day came for me, i said to it, yes i accept you. Because you are me. \nAnd just as it was in my life, you will be all that i have in the abyss. \n\n\n(The color returns)\nOver the years i learned how to put it into words. And these words will be the only way people will know about the pain i felt in life.\n\n\nI would sacrifice all the good. Because the good causes me pain aswell. The good is just as disgusting to me as all the bad. I do loathe these reasonings people give. The things that get \"better\" I'm supposed to hold out for \"better\", the \"light at the end of the tunnel\" its all things I've embraced before. Its the fact that those thinga are simply not things i want or need. \n\nAnd you don't seem to understand me.\nthe light at the end of that tunnel is Life, and i want to Extinguish it. I want that light to be swallowed into black nothing, for that little light sickens me. Its the light i see all around me. And the light will be extinguished one day, and the abyss take the universe back from whatever nuisance caused so much chaos.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/odbgev/i_want_to_die/", "title": "I want to die.", "social_network": "reddit", "user": "JacobPittman", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 10, "down_vote": 0, "creation": 1625365638, "permalink": "/r/Suicidal_Thoughts/comments/odbgev/i_want_to_die/", "nsfw": false, "first_save": 1635428850.7942295, "replies_charged": false}