{"id": "t5_28vigg_t3_mo018q", "request": ["71ee6414-54fe-46c1-b092-5b6636504a95", "65b8351b-5dc2-4143-a37d-f2748f6d42bb", "cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "A disclaimer i’m not thinking of hurting myself or anyone one but i’m just gonna vent here. so people know their not alone. My life has giving me no other choice but to destroy my ego. Everything was so perfectly messed up that you would think that i am living in a malicious truman show. ironically the reason i believe in a higher power or god or whatever is because life is just so perfectly fucked up for me. It’s just fucked enough for me to be in real genuine pain but not messed up enough for me to be seen as rightfully complaining about it. I hope things don’t get worse. As a matter of fact one of the things that hurt me the most is that in the back of my mind i realize that some people have it worse than this. I’ll let you guys know some of the things i’ve went through. I’ve had a boatload of inferiority complexes throughout my life by and large due to growing up in impoverished areas. in addition to this my mental health has been a prevalent issue since i was a child. i remember javi h anxiety to the point of vomiting every morning before school. i had to stop because i was in danger of destroying my throat. So instead i would have to learn to embrace nausea. my parents weren’t bad but my pops definitely had some issues. he’s told me i’m possessed before and honestly a 50 year old has no business telling that to an 18 year old. i had to go to church and unfortunately this is we’re any belief or faith base system was attack because of the hypocrisy of those in the congregation. My brain went numb around 16 because in addition to this i had also been forced into an academy were i was treated like shit. i have other things but there more personal. i just want to say please stick around and have a blissful existence at all cost but i know it’s more complicated than that. \nPeace", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/mo018q/im_really_tired/", "title": "i’m really tired", "social_network": "reddit", "user": "livinglife444", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 8, "down_vote": 0, "creation": 1618038663, "permalink": "/r/Suicidal_Thoughts/comments/mo018q/im_really_tired/", "nsfw": false, "first_save": 1635429046.963127, "replies_charged": false}