{"id": "t5_28vigg_t3_fgu9g6", "request": ["6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "Okay, I just wanted to vent somewhere where I wouldn't be noticed.\n\nI've been having suicidal thoughts lately, and has gotten worse only recently. The main source was my family. Back then, I used to be an extroverted child, but as time went on, I became slightly introverted. It hadn't really been something I would think of, but as time went on (again), I felt I was being used by my OWN family. They would treat me like a slave, make me do things in their part and get mad at me if I did it wrong. If I were to ask a favor, even if it's a minor favor like getting my phone charger, they'd get mad, especially my sister.\n\nI started developing depression, which made me more of an introvert.\n\nOne of the main source of my depression was my parents. They prioritized grades over my well-being, and health, asking \"What's better? MEDICINE OR SCHOOL?\" From my past, when I were to talk back, they would get furious, so being their slave, I kept saying school. From this day on, when I get sick, I wouldn't tell them. Anyways. When they wanted/made me vent to them, they would TRY - and by try I mean force me to do what they want because they think it's a \"solution\" - to \"fix\" it for me. For others, it would be heaven, for me, it was HELL. I didn't want to get any help, I JUST WANTED TO VENT IN ORDER FOR ME TO FEEL LIGHTER EMOTIONALLY.\n\nSoon after, I developed multiple personalities I use depending on who I am with (e.g. I am more extroverted to my friends, introverted to elders or strangers, and quiet and timid (which according to my mother was disrespectful because I would rarely answer), to my family)\n\nOne day, my depression got the better of me. It was on a Sunday. I didn't talk to anyone, not even my family. We were in a doughnut shop, I was ordering my food when my sister went up to me and gave me money and made me order hers. Being my depressed self, I pushed her away by not talking to her or giving her any response. Little did I know, she cried. Blamed me, and my mother got mad. My mother said \"You made a spark in your heart, and your making it bigger\" (spark being my \"ignorance, disrespect, etc\") I was screaming inside, I kept saying to myself \"That spark you talk about is a forest fire, burning everything in its way. And you tell me, that I am the REASON it's getting worse? You fanned this spark into a flame!\" This was just any other experience for me. My mother was a control-freak, she made us think that her opinion was better than any other. She would ask us about ours, but contradict it with hers. If this was a Disney movie, she would be the evil stepmother.\n\nThe other source was my sister. She was a know-it-all, she acted like she knew all the information about everyone and everything. It annoyed me. She thinks of herself, and hers only. SHE ACTS LIKE SHE'S THE VICTIM, BUT LET ME TELL YOU, WHEN SHE DOES SOMETHING BAD, I AM THE VICTIM, NOT HER, ME! Her voice annoyed me. She made me her personal slave, forcing me to get her this, get her that, do this, do that, and get mad when I ask a favor from her. Well, that was the short part of her.\n\nAnd recently, we just had a dog. This time it was my father. One night, when my mother was on a business trip, while we were sleeping, she had the zoomies, she played with my dads glasses. When my dad went downstairs, I heard my dog CRY when he hit her, because apparently, she destroyed it. BUT IT WAS STILL FIXABLE, LET ME ELABORATE ON THE MEANING OF DESTROY, IT MEANS IT PUTS AN END TO SOMETHING, IT TAKES AWAY ITS PURPOSE, BUT IT WAS STILL USABLE. But of course, it wasn't his fault for PUTTING IT SOMEWHERE THE DOG WILL REACH. My parents would say that they wanted to give the dog away. I would cry, every night back then. I loved my dog, she was my only source of sunlight at home. So when he hit her, I was saddened, annoyed, angered, I didn't know what to feel.\n\nBut anyways, those were just only the littlest parts of what they did.\n\nFun fact: When they say \"I love you\" or \"Congratulations!\", it sounds sarcastic, and fake.\n\nEvery night, I would cry myself to sleep. I had gotten to the point where I would cut myself when I have the chance, I was forced to wear jackets so my classmates wouldn't see some of it.\n\nBut when a friend of mine talked to me, she said \"You fake your smile, but your eyes tell a different story.\" I felt happy, someone who knew, someone who knows how it feels. I was so happy, I almost cried.\n\nBut I tried to bottle all of my problems away, buried deep in my heart, but it wouldn't fit, they would overflow my heart, and worsened my depression. Making me cry myself to sleep, making me think that suicide would be the best option.\n\nRight now, I feel sick. Whenever I would move frantically, eat hard foods, I would get dizzy. I would sometimes felt like I was going to throw up, faint, or die. Which, when I think about, isn't a bad idea. Who would want a \"disrespectful\", \"ignorant\", dumb, \"lazy\" person as a child or as a friend anyway. I feel like I don't belong anywhere, I feel like I don't deserve life itself. Every day, I grow weaker, I just want to end it all.. With the COVID-19 outbreak, I just wanna be infected and get this over with.\n\nP.S. For some of you, my problems may seem minor, but if you were in my shoes, you wouldn't think that way. Being forced to be a student who always get good grades, being forced to do something you wouldn't, it all hurts me.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/fgu9g6/just_wanna_vent/", "title": "Just wanna vent", "social_network": "reddit", "user": "dksjg", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1583917694, "permalink": "/r/Suicidal_Thoughts/comments/fgu9g6/just_wanna_vent/", "nsfw": false, "first_save": 1635429323.5791063, "replies_charged": false}