{"id": "t5_28vigg_t3_l7nsny", "request": ["cf81d7c0-cd42-4d3e-a15d-51251de387ba", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "I am 17 years old but despite my young age I am physically and emotionally on my limits. I had a hard childhood - many deaths, by accident, natural cause or suicide. I watched my dad by his suicide attempt (unfortunaly he survived), called an ambulance for my mom who swallowed too many sleeping pills (luckily she survived). I saw friends loosing their battle to drugs and alcohol, cutting them of to not drown there to despite my IMENSE fear of loss. I got hit, spit on and yelled at until 7th grade (12 years), until my very first suicide attempt. I survived, obviously. No one knew it tho. I jumped off a wall but it was too low and I just broke my leg - told everyone I fell. \nAfter that I fought my way back up. Looked for friends online, found a place I feel like I belong to. I found my first real love - a person which I now can call my best friend. We had a thing, it didnt last long tho. She changed me, built me up. Then she fell and I grabed her hands, pulled her up. Shes now hospitalized, in recovery of an ED, Bipolar disorder and depression. But I am still here.. and in november 2020 I dropped again. My anxiety sky rocket, I havent slept good a single night since then. I'm constantly having nightmares, I hear knocking noises every time its quiet. I self harm every day, longest I went without was 5 hours. I have imense paranoia, afraid of the knocking sound, afraid to hear my nightmare singing \"come piggy piggy, let me cut the ham on your thights\". He wears a circus director hat, has loong, dark curls. Eyes with even bigger eye holes. And his grin... his cheeks are slit open, still bleeding, you can see his teeth from every angle. And in his long fingers, between the middle one and the ring one, he holds a razor blade, bloody, holding it right into my face. \nBut he is just the tip of the iceberg. My thoughts are freaking me out and everywhere is just.. pressure...\nAnd I cant find professional help. Every therapist in this country is overbooked, next free appointments in 11+ months. Under those conditions.. \nMy boyfriend never leaves me now. Hes there when I sleep, on mute when I shower (we have a long distance relationship, meaning he can only be on the phone), when I walk home. And this is good... cause these days I cant trust myself anymore. I survived on new years 2021. I sat in my bathtub, cut my arm - a long cut from my palm to the inner of my elbow. It was not deep enough tho... but I know, next time I try I will make sure its the last time...\nIf you... read all of this.. thank you for listening to a little girl.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/l7nsny/i_survived_twice_but_i_cant_fight_anymore_tw/", "title": "I survived twice. But I cant fight anymore (TW - graphical descriptions)", "social_network": "reddit", "user": "littlechili02", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 9, "down_vote": 0, "creation": 1611910297, "permalink": "/r/Suicidal_Thoughts/comments/l7nsny/i_survived_twice_but_i_cant_fight_anymore_tw/", "nsfw": false, "first_save": 1635429229.3466942, "replies_charged": false}