{"id": "t5_28vigg_t3_jwv2y5", "request": ["65b8351b-5dc2-4143-a37d-f2748f6d42bb"], "text": "I’ve been dealing with a lot of shit this year, from moving away from my fathers house after my parents divorced because he was mentally abusing me and drove me to cutting myself and becoming suicidal, to always feeling alone because no one wants to hang out with me. Im at my senior year of Hs but I don’t see my life getting any better then what it was 5 years ago. Ever since I was little I never had any friends, which made me socially awkward today since I never had that social interaction as a kid. I’ve been bullied, ridiculed of my weight and racially profiled, bean beaten bloody, was betrayed by my best friends after he told the school my secrets that I told him in confidence. To being rejected by my crush and then her telling the school she thought I was ugly. And now covid hit and I’m constantly fighting my mother of liver the dumbest things. Today I got into a fight with her about covid. Basically she wants to sell her old tv, so she posted it online and someone came INTO the house and looked at it. I got extremely pissed because not only are we in a lockdown, meaning if shit like his is caught by the cops she’s either getting arrested or fined thousands of dollars. But she got mad at me because I Apparently was being rude, which now I think about it I was. But I wasn’t mad at her I was mad at the world. My birthday is on the 21st, I’m turning 17. This was the very first birthday I was going to have that people actually wanted to go to. I finally had friend that wanted to come and spend time with me. This never happened to me all my life. I’ve had 3 birthdays were I’ve invited people to the house to celebrate and absolutely no one showed up, leaving me alone in the kitchen table with a cake and no one to celebrate with....... I just want someone to care...... I had to cancel all my birthday plans because of covid and now for some reason I brought it onto my mom. Now she yelled at me saying how rude I am and how she’s never paying for my phone again. Which kinda sucks but that’s not the point. I’m tired of getting yelled at. I’m trying to be better but my mind doesn’t let me. I constantly think of suicide and ways to kill myself and idk what to do anymore. All I bring is paint and disappointment to my mom and I don’t want to be here anymore......... I think I’m going to take my life", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/jwv2y5/tired_of_being_a_disappointment/", "title": "Tired of being a disappointment", "social_network": "reddit", "user": "PanChiN0", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1605756374, "permalink": "/r/Suicidal_Thoughts/comments/jwv2y5/tired_of_being_a_disappointment/", "nsfw": false, "first_save": 1635429146.3264906, "replies_charged": false}