{"id": "t5_28vigg_t3_jky9z3", "request": ["6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "Before anyone asks, yep, I have called the suicide hotlines (and warm lines), have been to counseling for years, tried all the meds (with horrible results, turns out certain meds cause schizophrenia in people who have had no history of it), religion, exercise, meditation, pets, journaling, venting to friends, beating up pillows, long car rides, 420, arts/crafts/hobbies, and lifestyle changes; for 15 years. Incoming book of woe is me, tldr at the bottom.\n\nI'm 30 now and have had surgeries for tumors, gone to bankruptcy because of it and lost my 795 credit score, have depression, a mentally/verbally abusive family, am a divorcee, broke my ankle and couldn't go to the doctor because no health insurance so it's healed bad and anything that has me put weight on it hurts; essentially slowing down my exercise progress. \n\nI can't keep a job because my poor health, despite spending tons of money on medicine and healthcare supplements, so I'm poor as shit. My own family has called me a burden and useless. I'm not religious and I don't think it's hard to see why. My depression started officially when I was 15, but I like to think it really started when I was 4 and male family members and friends started sexually molesting me. Yes I did report people as soon as I understood what was happening, my family chose to believe I imagine it all. Then there was the actual rapes, full blown. Multiple times, you read that right. Left me with a fun \"for life\" medical souvenir, if you get my drift. \n\n\nMy genetics are shit, because my parents literally drank cancer back in the old country (carcinogens in the form of pesticides, no one understood they should manage the runoff and divert it away from drinking water) so I'm losing my teeth, endocrine system, hair, skin, and my ovaries are caked in painful cysts. The doctors are talking more surgery, this time to remove my thyroid and gallbladder. I just had my uterus removed a couple months back because I grew a tumor so big it outgrew my womb. I'm fat, possibly prediabetic, and no amount of self care ever lessened my weight or improved my health. And I hit the gym for a minimum of 4 hours a week. The doctors insist that losing weight will help me, but refuse to acknowledge nothing is working and say I'm just lazy because all fat people get this way from being slobs. \n\nI looked at myself in the mirror today and just couldn't stop crying. I've kept my brave face all this time, telling myself it'll get better and then I can move out. If I just hold on and move out my mental health will improve. Maybe then it will all change, just maybe my health will move up and I can earn money.\n\nI could ask why me. I paid taxes, graduated high school, did all the counseling and medical mumbo jumbo like a good girl, even went and was careful never to have kids because I just didn't feel I was capable of keeping anyone else alive. Tried college, but I always got too sick to continue attending. I tried, with all my might, and stopped asking why. It's just hatred now. \n\nI don't think I have any strength anymore. I'm in quarantine because I'm positive for covid and all this time, I just haven't been able to make myself care about anything anymore. Regarding my fight to be strong, that is. Eating, sleeping, bathing, feeding my plants and my pet, working on ideas to make money, planning a possible future and the fun adventures it may bring me, I just can't. \n\nI can't remember what happiness feels like. I've long since stopped the antidepressants as years back, they tried all the ones available and none worked and I ran out of health insurance. I'd held on by sheer willpower since then but I think I'm out.\n\nI'm angry. I hate the world, my family, humanity as a whole, this body, the poison in everything we eat and breathe, how helpless I feel even though I did EVERYTHING I was supposed to to look after my health. Is this what it means to be on a sinking ship?\n\nA frenemy just told me to get back to meditating and eating right. Why? It just pissed me off that it's so easy to say this shit to people when it's not you suffering. Everyone tells me I need to heal but how the hell do you when life keeps digging the knife in deeper each time you stop the bleeding?\n\nI can't stop the anger. I keep rearing back from killing myself not because I'm afraid but because I've tried it 4 times now and I keep surviving: yet no one has ever found me or my notes. Funny, I even fail at killing myself.\n\nI like the idea of it ending. No more of this, you know? I'm not afraid. I feel guilty for being so casual about it when I know my mom has already lost her parents and her firstborn to violent deaths. But that makes me more mad. Why the hell should I care about \"who will miss me\" when none of them made my life any easier when I needed the help. Even my so-called best friend wouldn't let me move in with her because she likes her privacy, despite knowing I'm in an abusive home.\n\n\nTL;DR: I'm made of hate, but the body can't utilize it for self improvement anymore. How do I pull back? Is it even worth it at this point?\n\nEdit: My pet is being fed, my brother is doing it instead of me. Yes, I do feel like a shitbag.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/jky9z3/can_i_be_angry_and_still_heal/", "title": "Can I be angry and still heal?", "social_network": "reddit", "user": "Chaotish", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1604069796, "permalink": "/r/Suicidal_Thoughts/comments/jky9z3/can_i_be_angry_and_still_heal/", "nsfw": false, "first_save": 1635429314.1787896, "replies_charged": false}