{"id": "t5_28vigg_t3_j5y07v", "request": ["b4d8161b-7016-486a-a4bd-5fb6a5aa639e"], "text": "What if its my time to go. Thinking about it makes me sad. Not for myself, but for those around me. There are plenty of people who would miss me, and I might miss them\n\nif its possible. I just don't want to go on anymore. Things that used to excite me just don't anymore. I'm only 24 years old. Actually exploring these thoughts makes\n\nme want to cry. Is it because its the truth, or is it something inside of me begging to stay? I'm tired. I've built a life and a family for myself in the last 5 years.\n\nBut what if what I built isn't what I want? I have plenty of options, but I don't want to be around to feel the pain I might cause by leaving. I cycle through different\n\nphases of my life over and over again. I don't move forward. I wonder if this feeling is normal and we just try to make ourselves feel otherwise. Theres so much out there\n\nto learn and to do but all I want is to sleep. When I wake up will I still be the same person? Is this just a mood or a culmination of my time here? If i seek help will\n\nit get better or will I just keep forcing this feeling down for the rest of my life in an attempt to soothe the people around me. I'm afraid to tell my wife. I'm\n\nafraid she won't understand. Or worse she will understand but beg me to stay. I can't handle this pain. Existence is torment. What if I'm already dead and this is\n\nhell. It would make sense for some parts of hell to be good in order to keep the illusion going. I don't believe hell is a place but what if its just a feeling. The\n\nonly person torturing you is yourself, for the rest of your life/existence. I'm just so tired. I'm also afraid. This life I built could come crashing down at any minute\n\nwith or without any outward actions from myself. I can almost see the pieces fitting together like building blocks. I don't know if I'm a structural piece or an outer \n\nblock. I don't want to be a structual piece but I think I am. I think I'm holding this together and it hurts. I feel like I'm buried in stress and obligation. To my\n\nwife, I'm obligated to be here and to love her and our child. To my job, I feel like I am the only one keeping the place afloat and if I leave hundreds of people will\n\nfeel it. I feel like the king on a chessboard. Everything moves around me but if I fall so does my side of the board. The weight is crushing me and noone seems to care\n\nWon't someone please take this burden from me. Help me. Everyday I scream for help but noone comes. I am alone. I bury myself in entertainment. Tv, Movies, Video games\n\nanything to take my mind off of my actual life.\n\n&#x200B;\n\nsorry for formatting, I wrote this in notepad and just copy pasted.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/j5y07v/the_weight_is_too_much/", "title": "The weight is too much", "social_network": "reddit", "user": "robegod", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1601955138, "permalink": "/r/Suicidal_Thoughts/comments/j5y07v/the_weight_is_too_much/", "nsfw": false, "first_save": 1635429480.1540973, "replies_charged": false}