{"id": "t5_28vigg_t3_qfrxfa", "request": ["65b8351b-5dc2-4143-a37d-f2748f6d42bb"], "text": "I had to plan my brother's funeral alone. Had to help a lot with my mother's. I know my loved ones are going to be arguing with each other and possibly considering suicide themselves. They are too weak to take care of business as needed. Unfortunate that none of them will get the life insurance I've had laid out for them. I want to be cremated though and I doubt more than 20 people will show. So the cost shouldn't be substantial. I figure the more prepared I leave them, the more at peace I will feel at the end. I tried to wait for natural causes, but thats a slow miserable walk. My feet hurt. I'm tired. I'm over it. At this point, I'm saving lives by taking my own. I tried to make them see that their words and actions effect those around them. They don't see. Why are they ignorant to other's pain? I see it. They say I'm crazy, stupid, niave. I'm the one with problems now. I like being a martyr. I never appreciate what they do for me. I only come around when I need something. I'm too emotional...\n\nThey never HEAR me. They don't want to understand someone else's point of view. They don't want to forgive mistakes and give people chances to learn and grow. No. You either conform to our way or you are broken. You need help. What you love is wrong. \n\nMy entire life has been lived to please whoever is around me at that moment. Now I sit alone. Why do I care so much for those who give so little to me? \n\nAnyway, what music would you want played at your funeral?", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/qfrxfa/planning_my_own_funeral/", "title": "Planning my own funeral", "social_network": "reddit", "user": "Affectionate_Fudge57", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1635200325, "permalink": "/r/Suicidal_Thoughts/comments/qfrxfa/planning_my_own_funeral/", "nsfw": false, "first_save": 1635429135.1703405, "replies_charged": false}