{"id": "t5_28vigg_t3_p7i7av", "request": ["cf81d7c0-cd42-4d3e-a15d-51251de387ba", "7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "90472b3c-14c3-4a56-be61-333d4f5dd86c", "b38140a1-7eee-49dc-9a69-c07b4318950c", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "Ive only been recently going to a psychologist. They told me that i had an obsessive and compulsive personality. I need further evaluation to be completely sure but i feel like my thought process does match up with ocpd. Ive been depressed for 4years. I initially went to a professional because of depression and suicidal tendencies. I got diagnosed with anxiety as well. I feel like a lot of my suicidal thoughts and anxiety comes from ocpd thinking. After my failed suicide attempt I feel like a failure, i dont have anything left to keep me here any longer. None of my efforts meant anything. I regret living through it and dragging my meaningless life out, only to extend my suffering through misery and pian. Theres not a waking moment where i dont feel like at peace, genuinely i feel like death would be better than to live like this. Whatever im doing i feel like just crumbling to the floor and crying. Im so so tired of holding on and i cant even imagine making an effort to fix myself. I feel embarrassed, nobody else is making a big deal or causing trouble. I thought my strength was that i am low maintenance and i wont cause any problems for anyone and ill handle things on my own. I had one job, to keep my head down and live quietly and achieve at least the bare minimum. And ive failed that. There is no other life for me. Theres nothing that i or anybody can do to fix me, to fix my life. I dont see the point in anything anymore. Theres nothing else left for me than to end it all. I feel ashamed that i think of dying all day and yet i feel too sad and afraid in the moments where i decide to do so. I wish i could leave this place painlessly and without my loved ones grieving for me.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/p7i7av/i_deserve_to_die/", "title": "I deserve to die", "social_network": "reddit", "user": "error-23", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1629390357, "permalink": "/r/Suicidal_Thoughts/comments/p7i7av/i_deserve_to_die/", "nsfw": false, "first_save": 1635429217.7092226, "replies_charged": false}