{"id": "t5_28vigg_t3_i3vbi3", "request": ["3a1372b3-e9f7-4aa8-9927-da37f168fe5f", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "well... here goes. this is the first time that ive ever placed my feelings about this into wording of any kind. Im lost- in a bubble that I cant bring myself to break out of.\n\nfor what feels like all of my 20 years of life, ive never felt happy. sure, ive laughed and cried like anyone else, but the moment im alone i wipe that mask off and immediately feel sad.\n\nI hate literally everything about myself. I feel like a walking disaster. A lot of times, recently more than ever, I feel like I don’t belong on this earth- like it doesn’t have a place for me anymore, and that ill soon be homeless or in jail. At one point I considered committing a crime just to go to jail on purpose, so maybe then id have a roof over my head and (albeit shitty) food in front of me… and most other times I think about ending my life altogether, so that I can end this painful cycle.\n\nat first, when i began having these darker thoughts at 13 and 14, i thought, perhaps, I hadn’t lived enough of my life yet to determine whether I want to live or not- so I gave myself more time to find what im good at or what I love. but even now, that mindset hasn’t changed. Im miserable. I feel like im a terrible person, whose role on this earth is to show others how NOT to be. After all, im not one to believe everyone deserves to be happy.\n\nIn middle school, I was placed in a “gifted and talented” program that continued until I graduated. Usually, the GT kids were on trek to do great things- I know people from that class that have gone on to start awesome jobs or be accepted on full ride scholarships to big universities. And yet, despite being told my entire life how smart I am by being lumped with those students, Ive never had a passion or a talent that made me feel like I belonged there. I have a terrible inferiority complex with everyone I meet- Im not super funny, attractive, athletic, charismatic, smart… I feel painfully subpar in literally everything I do. My grades were always BARELY passing, and I was a lazy uninspired student. I have no real, useful skills. Nada. I can’t cook, do mental math, or play sports, and im not particularly adept in ANY field… instead I burn my life away on video games, but even on those im not anything special whatsoever. I’ve had this plot in my head that ive been trying to convert to paper for YEARS to write a novel, but I can never bring myself to do it. I quit easily and I feel like I can never finish what I started. I have no motivation or work ethic to improve myself, and I break my own promises constantly- I tell myself ill try to be better, put in X amount of hours a day toward something that could make me happier, but it never happens. In fact, its NEVER happened. And at the spiraling rate I find myself in now, it never will. I feel like ill ALWAYS be terrible at everything.\n\nAnd the worst part about all of this? All throughout my journey to find my purpose, the one thing that will make me the happiest, I’ve been told how smart and gifted I am and how my family is so proud of me. How much of an inspiration I am toward my little siblings. But in truth, I’m terrified of the possibility that they could grow up to be like me. I’m nothing special. “Oh wow! You’re struggling? Well youre so smart so youll figure it out!” No. I don’t think I ever will. And I don’t think anyone will ever understand. Im not the person everyone found me to be.\n\nA few years ago, I told myself (half-seriously) I would commit suicide if I’m still single by the time I turned 25 years old… and now, more than ever, I feel like choosing that course of action. My attempts at romance are pathetically terrible- I cope by watching romantic anime/tv shows and reading romantic books which serve as a convenient distraction. I am socially awkward by every definition- I have a sentence-immobilizing stutter and I can never fit into any conversation casually. My social skills are… well, if I called it trash it would imply that it somewhat exists, which it really doesnt. I can’t talk to anyone im not close to, much less people I find attractive- I only operate within a tight group of friends. But even then I always open my mouth when I shouldn’t or my terribly shitty personality ruins something for me and they decide that its just not worth it to be my friend anymore.\n\nOver the past 8 years ive spent on the internet, ive lost dozens of people who once called me close- all because I made one too many painfully wrong decisions or said something that had no business being said. A close group of friends have all but removed/blocked me from every aspect of their lives because I wouldn’t stop complaining about their decisions, and I was continuously argumentative and aggressive for no reason. They booted me because I was being an asshole- and the worst part is, it’s the same cycle over and over again and yet, despite me promising to be a better person every single time, it almost never works out. I have nobody to blame but myself. I hate it. It feels like I can never catch a break. Nobody else is compatible with me and I dread every single day the one conversation that will cause my last group of close friends, the only ones I have left, to completely abandon me. It’s happened so many times… and if it happens again, I don’t think I’ll have anything left to stop me from offing myself for real. I hate it that im such a brash, headstrong asshole. I hate that I parade my opinions around and I don’t allow others to come between them and me. I hate how I constantly say the wrong shit because im completely awful with words, and because of it I end up fucking something up or causing someone to hate me. I hate that I’m… me. I don’t want to be alive. I want to curl up somewhere and leave myself to the fate the soil beneath me gives.\n\nI just want one skill. One break, or job that I find myself deeply in love with. That’s it. But now more than ever that seems like an impossible task. I want to find the love that I’ve read about, and that my engaged friends and ex-friends have found. I want to love myself and see myself in the light that my family sees me in. I want to be an example for the people who look up to me.\n\nIm sorry if this was messy. This was written in the moment. I just…. needed somewhere to place them. im just lost.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/i3vbi3/im_not_happy/", "title": "im not happy", "social_network": "reddit", "user": "djst887", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1596587483, "permalink": "/r/Suicidal_Thoughts/comments/i3vbi3/im_not_happy/", "nsfw": false, "first_save": 1635429578.7872183, "replies_charged": false}