{"id": "t5_28vigg_t3_itkp78", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "This is my first time posting on reddit, so please don’t judge me lol. \n     So, basically life during the pandemic has felt slow and awful. In the beginning I loved the idea of being home all day. (I was laid off from my job and it has been torture trying to even find something else) Anyway, the last two months or so have been absolutely awful. There has been this overwhelming fear of impending doom. I’m sure a lot of people are feeling that, but it consumes me everyday. So many times I wake up in the middle of the night, constantly searching for good news. Obsessing over transmission rates and positivity rates in my town, something that I never worried about before. I think the longer this goes on the more I fear it will never end. It’s ruining my relationship and my friendships and even my parents are agitated at my constant seeking of reassurance. I just need to know everything will be okay, even though logically nobody knows. When I’m left alone I’m obsessing over these intrusive thoughts of seeing the people I love most getting sick and succumbing to this virus. Most people I know are cautious and concerned, and living in Massachusetts we have been doing extremely well at trying to control the spread in comparison to some other states. Yet, my intense paranoia continues. Fearing the second wave, fearing that if I decide to let my guard down and see a friend I will get it and pass it on to my loved ones. My mother had a small outdoor birthday party for me just invited my grandmother, my brother, niece and two friends of mine. Everyone else was just the people in my household. Yet the fear of catching it at my own party scared me so much I wanted to escape the fear and enjoy a normal day for once. After all it was my birthday. Well, it went down hill so fast. I decided to try and find comfort in an edible. I have been smoking weed for many years and consider myself to be an experienced user of marijuana. Well, this time the edible didn’t provide the once familiar comfort it used to. What I experienced was something you hear happening after someone dropped too much acid. The high came on slow, but long story short by the end of the night when I was supposed to be blowing out my candles and smiling for pictures opening presents I had what I’m sure is some type of psychotic episode.  I became convinced it was my fault of what was happening in the world because I didn’t listen and decided to smoke weed. That it was my fault for the pandemic because I never listened. I was screaming in fear that I was dying and if I went in my room that I would die and the world would collapse and that some greater being was about to pull the plug on “the simulation”. I was consumed in this delusion for HOURS. I scared my friends and they left haven’t heard from them since. I’m pretty sure my boyfriend is secretly mad or disgusted deep down. I feel like a failure. I feel like it’s not just a result from the edible but that I’m slowly losing my mind. I feel like I’m deteriorating and that this is what my future holds. To become paranoid, delusional, and psychotic. I’m upset that I let this pandemic get to me like this. I wish I could be more balanced like my friends. I wish I wasn’t consumed by fear. I just want to live my life. I want to work and have a happy relationship with my boyfriend but I don’t think that it’s meant for me. I feel like I should just die before I have to see the world get any worse. I can’t take the paranoia and anxiety anymore and I think they’d all be better off without me. I don’t know where I’m going with this, but I’m so sad and scared I don’t know who I can talk to.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/itkp78/i_feel_like_im_a_loser_and_ive_wasted_my_life/", "title": "I feel like I’m a loser and I’ve wasted my life.", "social_network": "reddit", "user": "Zealousideal-Cost-87", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1600214564, "permalink": "/r/Suicidal_Thoughts/comments/itkp78/i_feel_like_im_a_loser_and_ive_wasted_my_life/", "nsfw": false, "first_save": 1635429371.3865669, "replies_charged": false}