{"id": "t5_28vigg_t3_gpflcy", "request": ["b4d8161b-7016-486a-a4bd-5fb6a5aa639e"], "text": "I keep seeing myself fall, and then i can almost hear my body hit cement, it scares me, but i'm tired, living is difficult, i feel like a burden, my whole life people in my family kept telling me i cant do anything right, or that I'm a bother, or that i'm useless, now my sister tells me i don't have a life and that my life is meaningless and she wishes for me die every time she talks to me, i cant stop thinking about all the things they have said, i really feel like there is nothing i can do, i feel like everyone wants me gone, that i'm just ruining their mood even by only entering a room. It's really painful, i cant sleep and i just want to be gone, but i am scared too, i feel like nothing changes and my efforts just fall into nothing. No matter how much i try to feel better about myself it just never stops, and all I can think about is how i' ll never be able to get away from these people because they are right, i cant do anything right, i am incompetent in everything and my efforts never mean anything, all I can ever do is get stuck thinking about how everyone seems to think I'm to blame for things being the way they are. It's just I know deep down that they are right, if I were gone things qould be easier for them, they do want me to die, the way they talk to me you can tell they just don't want me around, i have always been isolated and ostracized but the hostility is too much too take anymore. It feels like they are only happy when i don't ever leave my room, when i don't exist anywhere in the house, when i do go in the kitchen or in the bathroom it feels like i'm committing a crime. I just want to stop feeling so sad and exhausted by this, i really am incapable of livimg a decent life, so what's the point.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/gpflcy/im_really_tired_i_really_want_this_to_be_over/", "title": "I'm really tired, I really want this to be over.", "social_network": "reddit", "user": "Hj149", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1590278597, "permalink": "/r/Suicidal_Thoughts/comments/gpflcy/im_really_tired_i_really_want_this_to_be_over/", "nsfw": false, "first_save": 1635429481.996005, "replies_charged": false}