{"id": "t5_28vigg_t3_iv8tlb", "request": ["b4d8161b-7016-486a-a4bd-5fb6a5aa639e", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "I'm mostly hoping getting it out of my head will help since I can't talk to anybody about it. They don't understand and don't want to hear about my depression and think of it as \"spreading negativity\" and I have to keep it all inside which just makes it worse.\n\nI'm not a depressed teenage which makes me feel worse. I'm in my 30a and am supposed to have my life together but here I am, living with my sister and her family because I was sheltered all ky life and have no skills, education, or anything to support myself because my narcissistic mother couldn't care enough to stay in one place or keep me in school. I hate myself and my life because I have literally nothing and nothing good about me. I could go on forever about all the things my mother has done and continued to do up to three months ago when I finally left but that's too much to type.\n\nShe called me today to yell at me ( again) because people are calling me about her and I'm refusing to lie for her so she can pull off whatever con she's trying to do but I was already in a bad mood because my sister blew up at me over nothing. It made me feel shitty and small and less than everyone else in this house and that I'm supposed to be walked on and stay quiet. I went out for a walk and found an empty park to cry in but it's been three hours and I'm still crying.  I literally have no where to go, I can't support myself on the grant I get where I live and I don't want to be in a woman's shelter. I have no options other than to suck it up or end it.\n\nI can't stop thinking about overdosing on excedrin and just praying I pass peacefully and quickly. I don't have anyone or anything to live for and I'm tired of being a burden. All I want is to not feel anything anymore. Not to have any worries or pain or stress. I grew up in the church and was taught it's wrong to commit suicide and that I'll go to hell if I do but I have been struggling with my beliefs for years now and I don't know if hell could be worse than this. I just really can't stop thinking about it. I just want to get better being away from my controlling, abusive mother but now I'm just a burden here and more stress. I wish I was never born. I just keep thinking about killing myself. I can't eat, I can't sleep, all I ever think about is dying. \n\nI don't know really why I made this post but I just am lost and defeated and tired of fighting.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/iv8tlb/i_need_to_vent_about_all_the_reasons_i_cant_stop/", "title": "I need to vent about all the reasons I can't stop thinking about killing myself today.", "social_network": "reddit", "user": "anotherhurtdaughter", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1600444880, "permalink": "/r/Suicidal_Thoughts/comments/iv8tlb/i_need_to_vent_about_all_the_reasons_i_cant_stop/", "nsfw": false, "first_save": 1635429480.4643886, "replies_charged": false}