{"id": "t5_28vigg_t3_o17jll", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "…. I’ve been struggling with relationship issues since 2015, all the guys I’ve met are those that will leave me after they are done using me… i feel more and more insecure. I feel like I need to give sex to guys for them to talk to me. I’ve been actively trying to find a bf trying to find someone that can give me a shoulder to lean to. But when i found one it just didn’t seem like the love i need as he was too busy to give time to me. Okay then other problem is with my parents, I don’t have siblings and I don’t get along well with my parents. Ended up I always don’t feel like going home , i think maybe perhaps if i go hotels with different guys everyday… i will be cared for more and given more attention…. I know it’s not right to think this way but lord have mercy, i keep overthinking stuffs. I’m driving myself nuts. \nI should probably just focus on my work now but the thought of being alone forever and no one that cares about me or stays with me just give me a lot of anxiety. It makes me lose hope to stay alive. I’m really depressed. I feel like dying. It feels like there’s nothing that can movitate me.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/o17jll/is_there_any_real_time_forum_that_i_can_post_to_i/", "title": "Is there any real time forum that i can post to , i have no one to talk or relate to, i feel depressed and upsets. It’s been for a long time already. Idk should i just gave it all up.", "social_network": "reddit", "user": "Ok_Door_1134", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 8, "down_vote": 0, "creation": 1623857364, "permalink": "/r/Suicidal_Thoughts/comments/o17jll/is_there_any_real_time_forum_that_i_can_post_to_i/", "nsfw": false, "first_save": 1635428828.1868238, "replies_charged": false}