{"id": "t5_28vigg_t3_ptmaha", "request": ["65b8351b-5dc2-4143-a37d-f2748f6d42bb"], "text": "I have a relationship where it’s likely I’m being just used by a man I have strong feelings for and who is a massive part of my life and that relationship might be tumbling, I have a totally non supportive family who constantly say I’m a big burden and refuse to listen to any of my problems and definitely don’t want to help me with anything. I have been struggling with my college studies and have even failed one subject last semester. I don’t know if I have any motivation for any specific career aspiration, no clear goals. I have been locked up with my non supportive family 24/7 for months now due to Covid lockdowns. I have an ongoing mysterious medical condition for three weeks now, (constant urge to urinate) tests have so far shown nothing and I’m at a crossroads. Been trying to save myself because I’ve always been utterly petrified of ceasing to exist and have been trying to get any med possible and go to every doctor in order to be well again physically but now I’m tired. I’m tired of being used by everyone and supported and genuinely loved by no one. Of suffering from symptoms I can’t get to the bottom of and about which no one cares anyway. I receive no emotional help. I really am a burden so I’ve asked god for whatever he plans to make it quick, whether it’s heal me or kill me.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ptmaha/ive_been_fearing_death_all_my_life_but_im_also/", "title": "I’ve been fearing death all my life but I’m also having thoughts about what if death would be a quick escape (not by killing myself, but no longer protesting against my physical illnesses since it would be no big deal if they killed me)", "social_network": "reddit", "user": "Hopey-Dreamer", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1632366598, "permalink": "/r/Suicidal_Thoughts/comments/ptmaha/ive_been_fearing_death_all_my_life_but_im_also/", "nsfw": false, "first_save": 1635429162.4071152, "replies_charged": false}