{"id": "t5_28vigg_t3_ioo5ju", "request": ["71ee6414-54fe-46c1-b092-5b6636504a95", "610564bc-0916-401a-93cd-8d3e727a24ed", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "Ive had active and passive thoughts for years now and as expected sometimes you just catch yourself in the middle of a really dangerous period where you don’t see the point in keep going. Im there right now.\n\nI never find comfort in typing/speaking my issues bc it doesnt help me. But i gotta keep trying things.\n\nOver quarantine I accidentally fell down a flight of stairs and seriously messed up my spine, but the pain while lasting and painful wasnt as bad as i thought it could be. When ever I find myself at the bottom of the stairs i pause/sigh/take a minute because since i moved to this place over a year ago I find myself lacking the energy to just go up this stair case on a daily basis, ive had breakdowns at the bottom too.. so this staircase is always on my mind.\n\nBesides some pretty gruesome things i want to do like, hanging myself downstairs, poking knifes to see if i should try cutting my legs and arms, smashing my head repeatedly into a wall (banging/taping w/forehead is soothing), etc, I caught myself hanging over the staircase with my eyes close wanting to letting go so fucking bad. I started sliding my feet backwards and lifting my fingers but then i heard a door open so i stoped.\n\nThis was the closest attempt ive had in months and it wasnt even at my lowest energy level. \n\nIve been having all sorts of nightmares about seeing strangers get eaten slowly and then a beast started to eat me, getting stabbed, stress nightmares, and even me getting stabbed multiple times on an airplane.\n\n\nBasically ive been having visceral passive thoughts and nightmares after about 2 months of no thoughts and its just been fucking me up, waking up exhausted , wanting to die at 7am, and with leftover pain physically.\n\n——————————————————————\n\nI tend to be super resliant and just get too busy and over committed so I can distract myself from my depression, but ive been crumbling so much since late 2018. ive started getting professional health because after years I cant handle it on my own anymore and I just cant get shit done anymore. \n\nEverything just takes too much energy to do. My academic, career, and social life have been crumbling bc of it and I no longer know what im working towards and for an idealistic/future oriented this is fucking me up because i dont see a reason to continue.\n\nIm way too fucking stubborn to let myself go bc of the popular thoughts  “Oh you might do something amazing in the future” “its selfish, think about those left behind” “suicide is an end, there is nothing after, you cease to exist”  \n\nIm not special, i may be one of a kind, but my thoughts and ideas are not, my issues are not, I don’t have a life purpose in mind, and im having an identity crisis trying to determine who I am outside of my sadness. “Beauty/joy/love/laughter only exist bc of pain/loss” I DONT WANT TO BE MY DEPRESSION I DONT WANT TO RELY ON IT FOR THE GOOD MOMENTS IN LIFE I DONT WANT TO TAP INTO MY PAIN. I WANT ALL THIS SHIT TO BE OVER.\n\n\nChances are, no one read this, and thats fine. If you did I’m sorry you’re also having horrible thoughts. \n\n-21 yr old who didn’t plan on being alive past 18, and is now lost", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ioo5ju/teeteringtrustfall/", "title": "Teetering/trustfall", "social_network": "reddit", "user": "bobrosstier", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1599544091, "permalink": "/r/Suicidal_Thoughts/comments/ioo5ju/teeteringtrustfall/", "nsfw": false, "first_save": 1635429049.5608683, "replies_charged": false}