{"id": "t5_28vigg_t3_pq40fn", "request": ["51bc1b45-8792-4b9a-86c9-1b72cd96a4ac", "65b8351b-5dc2-4143-a37d-f2748f6d42bb", "935370ff-2e76-44cd-b247-7eb7b997ce9a", "d3dca3a0-327c-45d9-8a03-9a1f01a14fd1"], "text": "Have you ever seen a post on Facebook or other social media asking you what you would tell your younger self? It goes something like this: knowing what you do now, what would you say to yourself when you were (insert age here)? \n\nSo what would I like to say to myself at age 9, nearly 22 years ago. What do I know about life now that would be invaluable to my younger self? Is there any wisdom that comes to mind? In truth, I would tell myself to find a way to die. Suicide is the best option to save a lifetime of ongoing pain, but timing is everything. These thoughts wouldn’t have been new to me at the time, my earliest memories of suicidal ideations are from ages 7-8, I just never followed through like I should have. \n\nIn my mind this boils down to a math equation. My death now would adversely affect too many people. I want to die, but I don’t want to hurt anyone. When I was 9, my relationship with my parents was tumultuous at best. I legitimately did not know if my parents loved me or not. Being told by my parents just a couple years later that they hated me really only strengthens these feelings. My sister was not born yet, and my brothers would only have noticed my absence in that they would have been unable to blame me for their problems. I had a couple friends, but even then they were distant. I was very aware that I didn’t fit in, even though I tried. My Grandparents would have been the most affected, but they had two other grandchildren. It’s impossible to do something like killing yourself and not affect anyone. Had I died at age 9, it would have negatively impacted 8-10 people at most, and they all would have gotten over it with time. \n\nI am 31 now and life has changed. I now have a sister who would be hurt beyond all reason, and would likely follow my example herself. My parents have turned around and told me that they would miss me and I’d like to think that I believe them. My brothers would each react differently. My older brother would take it really hard and blame himself, and my younger brother would recluse and bottle everything up trying to be strong for others. I have two nephews who would forever know that I had left. I’m involved in a church and have stronger friendships than I’ve ever had before. When I do the math, I can think of 7-8 people who would never get over my death, and I can’t put a number on those it would adversely affect. \n\n My wish to die is not malicious or meant to be manipulative. It’s not about attention or wanting to get back at anyone. I simply do not have any real joy in life and I have no hope that life will ever get better. I live in a constant state of pain, both physical and emotional. I’ve tried doctors, therapists, and other treatment options with little to no actual success. My entire life can be summed up with the word “stress.” I want to die simply because I am sick and tired of being stressed, sick, and tired. But this brings me back to the point of my post. I must continue to live for the comfort of others. My pain, my stress, my quality of life doesn’t matter, and to think otherwise is selfish. I must continue living so that others are comfortable and their quality of life is not negatively impacted. The needs of the many outweigh the needs of the one. I pray every night that I won’t wake up the next morning, but I can’t take action to expedite that outcome, no matter how much I want to", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pq40fn/long_reflection_i_wish_that_i_had_completed/", "title": "(Long reflection) I wish that I had completed suicide at 9 years old.", "social_network": "reddit", "user": "International_Sea285", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1631897714, "permalink": "/r/Suicidal_Thoughts/comments/pq40fn/long_reflection_i_wish_that_i_had_completed/", "nsfw": false, "first_save": 1635428718.5890818, "replies_charged": false}