{"id": "t5_28vigg_t3_jr3mxc", "request": ["029ade1a-045d-4a03-b80e-2f560fb4018f"], "text": "Hello. I never really thought I would say anything in a place like this. Before this year I had never really struggled with depression, I had severe ADHD, but was a really happy person overall. Now, ever since a breakup about 8 months ago and the extreme anxiety that I now struggle with thanks to COVID and other factors, such as not doing really well in college (my fault) I don't really want to be here anymore. The relationship didn't last very long, and I really shouldn't have reacted the way I did, but the main thing I struggle with is the guilt I feel for the way I acted before and after the realationship. I worry that I'm the kind of person who does not deserve to be forgiven, that what I did was truly despicable. I don't really know what to do anymore, and I don't know how to know if I am a good or bad person. I understand it's not that simple, and that I should learn to move on and learn from my mistakes but I just can't. Some days I feel fine, especially parts of some days I feel like I used to. But at the same time there are so many parts of the day where I just look somewhere and start planning how I would end my life, whether I could actually do it, practically or feasibly. I ask my freinds if I'm a good person or not, and they sure yes, they know the other person involved, but I can never bring myself to tell the whole story of what happened, or when I have I can't really bring myself to do it in a unbiased way. I wish she would just tell everyone exactly what went down, just so people would judge me truly, but she say's that it's really only between us. She has told me I'm not a bad person, but I don't know if she would tell me or not. I just want my old life back, not the one I have now. I'm just ready to give up.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/jr3mxc/18_and_not_doing_great/", "title": "18 and not doing great", "social_network": "reddit", "user": "cmames20", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1604947899, "permalink": "/r/Suicidal_Thoughts/comments/jr3mxc/18_and_not_doing_great/", "nsfw": false, "first_save": 1635429083.6237082, "replies_charged": false}