{"id": "t5_28vigg_t3_o6xoip", "request": ["029ade1a-045d-4a03-b80e-2f560fb4018f", "90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "Now firstly, I'm not doing so good as I do get yelled at home quite a lot and now I'm deciding to finally change myself, my brother yelled at me I think around 35 minutes ago and that was the most painful moment I've ever had, my life isn't hard it's only because I look at it the wrong way. I told my girlfriend what happened and she decided we break up and let me do my thing and let me become comfortable, I think that's fine but I'm fine but my crying is on and off, I cry and smile the next second, I feel okay I don't, but now, I'm confident in my ability to do what have to do\n\nMy brother did call me a failure and that's okay, I understand, I failed 3 tests out of 4, that's bad and it's term two, i realized what I have to do and stop fucking about but I feel so shit, I feel like my shoe is in an uncomfortable position, I need to keep going but I'm stressing too much, I just wanna be with my girlfriend and study, not do this, but I need this, I feel so bad it's just horrible, I want to give up but I'll he more or a disappointment than I already am, I feel bad but I feel good I'm going insane. \n\nI'm gonna study more and do more stuff because I can't stay down, I try my very best, I can't tell them I have ADHD, because they wouldn't believe me like the last time I told them, I just wanna keep life simple and enjoy it, now I'm stressing even more, because she doesn't wanna be around me and I understand that, it just hurts, she doesn't wanna talk to anyone at school, because she's having a bad week, I understand and I support her, I feel so shitty, I'm never enough all I wanna do is be proud of myself but they make me hate myself more, and more and more. It's like I get nowhere because now I need to build myself up again, I'm just stunned. I don't feel okay honestly.\n\nI'm changing what I need to do already by cutting off some bad friends but, I feel so shit I just need my girlfriend here to support me, not leave me and left me settle in, I just, can't see myself without her I feel so weird and bitchy, I'm a brat, I get whatever I want and do nothing with it, I'm so useless, I wanna be happy but I want the pain to end.\n\nI'm never enough, I'm never gonna do it, I can't do it.\n\nEdit: I also feel like I can never say something stressful because I don't wanna guilt trip her into staying with me but she's all I vent to.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/o6xoip/stress_school_relationships_and_home/", "title": "Stress, school, relationships and home", "social_network": "reddit", "user": "bigfuckinbrain", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1624528186, "permalink": "/r/Suicidal_Thoughts/comments/o6xoip/stress_school_relationships_and_home/", "nsfw": false, "first_save": 1635429072.5110903, "replies_charged": false}