{"id": "t5_28vigg_t3_pb2hmu", "request": ["20e5f323-e2c4-450a-8af3-177af94313bf", "51818c1f-9070-43a1-96e3-b1b348ef35e0", "b38140a1-7eee-49dc-9a69-c07b4318950c"], "text": "Everytime I have a flare of suicidal thoughts and feelings, it's usually because of this self-hatred that tends to come up when I feel like the people I love the most, don't particularly like me. Small things can trigger this. \n\nSometimes I'll tell a joke that a friend will find offensive and they will give me this look of disapproval, as if I have bad taste. Most of the people that I call friends are much older than me, and I'm always trying to make sure I am as good company to them as they are to me. Unfortunately, this mindset can make it really hurtful when they seem to disapprove of me. My feelings are deepened when I am really close to them, because I almost feel betrayed that they don't give me the benefit of the doubt when I seem to slip up a bit. \n(Please don't tell me to talk to them about how they really feel, because humans are never honest about that. What person would tell a suicidal what they honestly felt about them if they actually found them annoying or burdensome.)\n\nSince I enjoy most spending time with older people that I look up to, and I'm talking 5-20 year range (I'm 19), I often wonder if they just think of me as this young kid that likes to hang around sometimes, instead of someone they genuinely enjoy spending time with and feel generally equal to. And when I say \"equal\", I mean the feeling like they are just here for the mutual benefit of a friendship and not as an older person here to entertain/mentor the younger person. All of the crushes I've had on women are many years older than me, so I put a lot of pressure on myself to be mature and adult-like, but I rarely feel like I can reach that. I often try to tell myself that disapproval from an older person is not always deserved, but the fact that I look up to these people makes it difficult to contradict them. Nevertheless, I feel like the reality is that it is likely deserved most of the time.\n\nGoing back to the title of the post. When my suicidal thoughts flare up, I get the urge to drive my car into a brick wall. Sometimes I feel like I am doing it to spite of other people. Sometimes it is simply because I hate myself so much that I feel like I need some sort of grave punishment. \nThe only thing that irks me is the fact that I will not be able to see whether or not the world is different after I'm gone. I will not be able to witness whether or not my friends were fake or genuine, or to see how much everyone is affected by it. What kind of regret would they have? What would they say at my grave, in private, when no one is watching? The absolutely genuine, no filter, private eulogy.\n\nOther than the fact that I would hate to hurt my family, this is why I hesitate to kill myself. I could never experience being dead, to really look at the world with perspective.\n\nAnyone else relate?", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pb2hmu/desperate_for_the_approval_of_those_i_love_and/", "title": "Desperate for the approval of those I love and admire, and feel completely worthless without it.", "social_network": "reddit", "user": "Jeyzreyelhooters", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1629860126, "permalink": "/r/Suicidal_Thoughts/comments/pb2hmu/desperate_for_the_approval_of_those_i_love_and/", "nsfw": false, "first_save": 1635428973.0691793, "replies_charged": false}