{"id": "t5_28vigg_t3_j4nbvh", "request": ["e4caf65e-8cb5-40e4-9897-4291adbe7f3f", "1298478d-f218-4dd4-a918-dcb9600d82ed", "029ade1a-045d-4a03-b80e-2f560fb4018f"], "text": "“I’m nothing special”\nPretty common phrase, often used in an ironic way.\nI’m literally nothing special.\nI’m 16.\nI’m ugly.\nI’m fat.\nI have no friends.\nNo one has ever loved me romantically.\nI’ve never once been someone’s “best friend”.\nNo one ever wants to or has wanted to see me.\nNo one wants to talk to me.\nNo one cares about me.\nI’ve accomplished nothing in my life.\nI’ve never been talented at anything, average at best.\nI’m weak of mind and body. No will power to get fit.\nNo one would care if I died.\n\nIf many of the people I know read this list they’d tell me parts of it weren’t true, some might even be as delusional as to tell me none of it is. I don’t know whether these people are lying to me or themselves. \n\nIm ugly, I am ugly in objectively almost every way, no one has ever once found me attractive.\nNow you can say attractiveness is subjective, I guess that’s true but no one exists who’d think I’m good looking \n\nI’m fat, objectively in every way I’m fat, majority of the weight on my body is comprised of fat and I am on the high end of a BMI index.\n\nI have no friends, the most controversial on the list. So many people would say they’re my friend but it’s not true, none of them want to see me, want to talk to me, they just do it. I don’t know whether it’s out of pity or if they get some self fulfilment out of it or genuinely just have a different definition of friend. The best way to sum up this would be: if in a holiday of 12 weeks I didn’t message any of them none of them would message me.\n\nNo one has ever loved me romantically, realistically there’re two people who could argue to have “loved” me. Neither are genuine. Obvious for many, many reasons.\n\nI’ve never once been someone’s best friend, I don’t even think a soul in the course of humanity could argue this point. No one would ever call me there best friend.\n\nNo one ever wants to talk or see me, I feel I’ve explained this already but pretty much no one would ever come to me in a million years to meet up or talk.\n\nNo one cares about me, maybe a tad dramatic, my family obviously care about me but they’re obliged too so pretty sure it doesn’t count. Some of the people I know may say they care about me but that’s only in there own subjective way. They don’t want me to be hurt or die, that’s not caring about me, that’s good human nature, I don’t want anyone I know to be hurt or die.\n\nI’ve never accomplished anything in my life, I’m in no way talented, no exaggeration to these which is really sad. \n\nWeak of mind and body, like I said I’m fat, not overweight, being overweight can be healthy it can be muscle, but I’m just fat, fat and weak. And if I has will power or psychological strength id be able to change this.\n\nNo one would care if I died. Now, definitely an exaggeration. My family would be sad definitely but only because they HAVE to be, if you live with anyone for they’re whole life and they don’t do anything wrong to you obviously you’ll be sad when they die. Some of the people who know me might force themselves to be sad but within I’d say a calculated 9 months everyone would be past it, they’d be sad maybe out of guilt or just because they think they should be.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/j4nbvh/worthless/", "title": "worthless", "social_network": "reddit", "user": "RI0000", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1601761255, "permalink": "/r/Suicidal_Thoughts/comments/j4nbvh/worthless/", "nsfw": false, "first_save": 1635428901.0788188, "replies_charged": false}