{"id": "t5_28vigg_t3_nycoo4", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0"], "text": "So what am I supposed to do I simply don’t care like I really don’t I have come a long way from where I was. I now accept my sexuality my friends do I actually have friends lots of friends which I’ve never had before and they all love the hell out of me I got the job I’ve always wanted my own money I’m traveling around the country I’m good friends with my crush which I’m fine with having her in my life is just a treat itself but I just simply don’t care about myself I’m horribly obese my face is covered in acne I just do not care and could care less I just simply do not want to be here at all here come the get help or it’s gonna get better but I really don’t care if it gets better it completely terrifys me that I may have to live another 40-50 years I am 22 btw but I do not want to live that long I have done all I want to do in life everything the friends the job seeing the country improving my past situations and coming out of the closet the only possible thing I could think I maybe want to do is work on a fishing boat other than that I am completely ready to go I’m ready for my time to be up I wish every day I could give someone else my good health and benefits I have that really want it and just pass on and watch over my friends and family. A friend of mine got very ill multiple surgeries and all I wanted was to give her all of my health and pass on. I know if I go the world will go on eventually. I pray every night to not wake up. I am a very extensive maladaptive day dreamer so I’m not even mentally here most of the day. I just don’t know any more.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nycoo4/dead_end/", "title": "Dead End", "social_network": "reddit", "user": "Buggydriver_", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1623521510, "permalink": "/r/Suicidal_Thoughts/comments/nycoo4/dead_end/", "nsfw": false, "first_save": 1635428986.4918518, "replies_charged": false}