{"id": "t5_28vigg_t3_mr9o78", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "The one thing that gave me(21) the strength to endure high school was the thought of being away from home, in college. I used to fantasize about it all the time. Fantasize about my future. It was my way of escape. It’s why I didn’t kill myself and went to therapy and believed all the professionals I saw when they said “it gets better”. I ended up in the psych hospital 2 times my senior year. One due to a suicide attempt. I still pushed on and barely graduated high school, after receiving mostly A’s my entire grade school career. \n\nAnyways here are my failures after high school: \n\n•got fired from 2 jobs and not given a reason why I was fired \n\n•stopped going to a film internship I was hired at due to suicidal depression\n\n•film I wrote didn’t get made because I was broke and didn’t know enough people to help\n\n•stopped writing films altogether\n\n•hospital once again\n\n•more self harm cuts on my leg\n\n•still have never been in a relationship \n\n•lost a friend I actually liked being friends with because I was needy\n\n•dropped about 7 classes in total\n\n•the friends I made in college had to see me in the hospital, something no one should ever see\n\n•lost all friends from college\n\n•won’t graduate with friends from college\n\n•3 years behind in college\n\n•rarely talk to my little brother because he never calls even though we used to be very close\n\n•Had a psychiatrist try to get me hospitalized for the 4th time\n\n•Same psychiatrist dumped me as a patient\n\n•probably won’t ever get to enjoy sex due to a sexual side effect I wasn’t warned about. Docs said the side effect would go away after cessation but they never did\n\n•Have not been able to hold down a job\n\n•all my hard work in grade school was meaningless. It amounted to nothing\n\n•lonely majority of the time, a type of loneliness most won’t ever experience\n\n\nWhy then should I even go on?", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/mr9o78/im_embarrassed_to_have_not_killed_myself_already/", "title": "I’m embarrassed to have not killed myself already", "social_network": "reddit", "user": "chewybacbacca", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 11, "down_vote": 0, "creation": 1618471176, "permalink": "/r/Suicidal_Thoughts/comments/mr9o78/im_embarrassed_to_have_not_killed_myself_already/", "nsfw": false, "first_save": 1635429343.1737487, "replies_charged": false}