{"id": "t5_28vigg_t3_li22j1", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "So you know how sometimes in a video game or whatever, you eventually get to a point that it's obvious that with the mistakes you've made along the way, there is no possible way for you to finish the level/mission etc, so the only option is to give up? What do you do when you come to that realization about your life?\n\nI've made some terrible choices and done some terrible things in my 44 years, and there's no coming back from some of them... \n\nI've ruined my marriage, I've ruined my relationship with my daughters, I've ruined the very few \"real\" friendships that I've ever had. \n\nMy business(es) failed. \nMy physical health is failing, my mental health is failing, my financial health failed long ago. \n\nI can't even stand the person that I've become or the life I've created for myself... it's no wonder that nobody else wants to be around me, either.\n\nMy oldest daughter moved away months ago, my youngest is moving away soon... my best friend of 23 years is divorcing me and moving away, too.\n\nI now consider this \"experiment\" called life to be a failure. I've given the world what I have to offer, and it just wasn't enough to do any good.  I'm just over it... I don't see any point to suffering through the rest of the miserable life I might have left. \nUnfortunately, I'm too much of a chickenshit to kill myself... so suffering seems like the only choice I have left. And if we're being honest, that's probably what I deserve anyway. \n\nMaybe I can get lucky, and the universe will eventually tire of fucking me, and finally just put me out of my misery.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/li22j1/fuck_this_and_fuck_that/", "title": "Fuck this, and fuck that...", "social_network": "reddit", "user": "Sfilpansick", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 9, "down_vote": 0, "creation": 1613098833, "permalink": "/r/Suicidal_Thoughts/comments/li22j1/fuck_this_and_fuck_that/", "nsfw": false, "first_save": 1635429351.4464066, "replies_charged": false}