{"id": "t5_28vigg_t3_j9gsj1", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "I'm not quite sure if writing on here will make me feel better but I've been suicidal for as long as I can remember, I was probably about 6 years old when it started and I know it sounds crazy because that is such a young age to realize something like that but my life has never been easy. My parents were young when I was born and that meant I was always going to be a parent to my siblings I've had to grow up way to quickly. My parents divorced when I was about 3 and neither of my parents were too good at being alone so they moved on very quickly, almost immediately. My father had moved out of state and my mother began dating an ex soldier with PTSD who was extremely abusive and got her into drugs and they had my sister. When I was 5 my father took custody of my brother and I and we went to go stay with his new family which was a very toxic household, I had a new step brother and I got to see my half sister again (its complicated but my step mom was with my dad first so my half sister is older) I met my step mother who I very much love now but she was extremely abusive and she would find any and every reason to physically abuse my brother and I, I slept on the floor (all my siblings had beds) we rarely had the utilities on and I rarely ate and on top of it we never saw my father he was always either at work or off having affairs and I would often times stay up all night just to see if I could hear his voice before I would fall asleep but most times he didnt show. When I was 8 years old my  brother and I went to go visit my mom for summer break and mom died of a drug overdose squeezing me as she took her last breaths, My baby brother had to find her dead body in the morning because I couldn't move and I was afraid to scream, quite honestly I felt kind of numb but not the kind of numb where I wasn't sad just the kind where I knew i couldn't show any emotions because I had a lot of responsibilities and didnt want to be seen as a victim or make my siblings sad so I suppressed them and to this day I always check my fiancee's pulse at least 6 or 7 times a night because I fear it'll happen again. To back track a little my 1st day of kindergarten I came home from school quite upset about how my teacher kept calling me a girl and my mom was confused about why that upset me I didn't know what being a transgender individual was at that point but I just knew that I was a guy and because my grandmother was extremely religious my mom told me that this was going to be a secret between her and I and I liked that it was a secret with us because it made me feel like we were closer so I didn't tell anybody but you can imagine how much I hated myself growing up and when she passed away it took me a really long time to tell anybody else because I felt like that was one of the only things I had left with her and honestly I felt like I should be ashamed of myself due to my grandmother's views which I was later forced into. Throughout childhood I would always find a way to provide for my siblings because even though my dad was working the money never really went towards taking care of us my step mom would spend it on things like laptops and getting her hair and nails done and for weeks at a time I would run away from home but always come back at night to check on my siblings and nobody ever looked for me.  My father and my stepmother split up when I was 12 and my father took us back to live in our childhood home where my mom had passed away and as crazy as it may sound I would always sit in the room where it happened because it made me feel safe,  But that meant we were back in a religious home because my grandmother was still there and she says the only reason she let us all live there including my father is for my brother and I's sake,  That was too much for me to handle so at the age of 13 I ran away for the last time and never went back home my fiancee who was my bestfriend at the time brought me to her house and I lived with them till my fiancee and I just got our first apartment together last year,  It wasn't easy living with her family but it was way better then living with mine her mother was dating an abusive dude who would lay his hands on me and my fiancee's sister and he would always put us all down luckily hes not in the picture anymore. Things  are so much better now than I could have ever imagined but I'm still messed up as you can assume by everything that has happened plus more that I didnt even mention, I'm afraid to leave my apartment I haven't left since a little after we moved here last May and I feel like a lot of it stems from not being able to start hormone treatment due to my insurance not wanting to help but everytime I go outside I feel like I cant breathe, I get really lighthead and nauseous and even start to pass out and due to my fear of leaving my apartment I can't really work so my fiancee's income is all we have and we are barely making rent. I want to get help but can't seem to find a therapist who will come to the apartment especially since covid and it's gonna sound silly but due to my insecurities of my voice I won't do phone sessions either and I feel extremely helpless. I haven't self harmed in 4 months but I think about suicide every day when I wake up and recently I've been making plans to kill myself like i used to when i was younger and I feel like this time I'm probably going through with it but I feel horrible for my fiancee and our cats. I dont know what to do and it's not like I can reach out to a friend or family member because I don't talk to my family for the most part only really my brother and I don't want to burden him and the only friend I had was a narcissist who I had to cut off earlier this year so even though I have my fiance I feel alone. I'm sorry for rambling I know this is all over the place but this was my last attempt at trying to make myself feel a little bit better. I hope everyone else is doing well.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/j9gsj1/im_so_sorry_this_is_long/", "title": "I'm so sorry this is long.", "social_network": "reddit", "user": "Oliver0113", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 7, "down_vote": 0, "creation": 1602462343, "permalink": "/r/Suicidal_Thoughts/comments/j9gsj1/im_so_sorry_this_is_long/", "nsfw": false, "first_save": 1635429035.6957176, "replies_charged": false}