{"id": "t5_28vigg_t3_p66skv", "request": ["51bc1b45-8792-4b9a-86c9-1b72cd96a4ac", "51818c1f-9070-43a1-96e3-b1b348ef35e0", "cf81d7c0-cd42-4d3e-a15d-51251de387ba", "d3dca3a0-327c-45d9-8a03-9a1f01a14fd1"], "text": "I (28F) have pretty much given up on everything. I don't want to think. It's one of those days when I realize I really am invisible.\n\nIt's funny. Everything that has ever happened to me just taught me that I don't deserve help and that I'm just... nothing. Barely a person.\n\nMy disorders, my complete solitude, my fear of everything, social anxiety, bullying, all sorts of backstabbing, toxic parents, siblings who hate me, best friends who abandon me, broken dreams (ruined because of an older man who was preying on me), psychologists and psychiatrist who leave me for dead and turn the other way when I ask for help because I'm almost dying (I mean it literally, I don't want to get into details but I was almost killed), being led to trust people who only want to use me and abandoned me when I'm at my lowest, destroyed and scared.\n\nSome weeks ago a professor I know told me he could help me with a cyberbullying incident. I sent him the messages, threats and insults, I had received. He told me he'd contact his lawyer. Never heard from him again.\n\nWhich reminds me about all the money that have been stolen from me by some friends of my sister's; she herself gave a lot of my clothes away while growing up, without asking. And my favorite clothes that have been stolen - along with so many important things and gifts I held dear - while I was moving out. I was already terrified and alone, and most of all traumatized because of the abuse I had suffered in the months prior, then this. I felt like I had completely lost my identity.\n\nEven people on social media ignore me. I have had several private accounts during the years and it's a miracle if I get one single notification per day. Everybody else gets all the attention. My pain always goes unheard.\n\nAn entire life just like this. I'm made to be used, at best. More often just ignored, I'm simply worthless.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/p66skv/not_actively_suicidal_at_least_now_its_just_a/", "title": "Not actively suicidal, at least now. It's just a moment of calm before yet another storm. Still...", "social_network": "reddit", "user": "_rotten_apple_", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1629216209, "permalink": "/r/Suicidal_Thoughts/comments/p66skv/not_actively_suicidal_at_least_now_its_just_a/", "nsfw": false, "first_save": 1635428729.9564502, "replies_charged": false}