{"id": "t5_28vigg_t3_evhom4", "request": ["e4caf65e-8cb5-40e4-9897-4291adbe7f3f"], "text": "Listen, this is not a cry for help or attention or any of that shit alright? For the past few weeks,, I’ve been doing okay. I’m on new meds and maybe just maybe life was going to go my way. I think we all know where this goes. I’ve been convincing myself that I’ve been getting better,, however that’s not the case. I just bottle things up because I’m tired of being the walking nutcase or the fucking pity party. I’m tired of disappointing the ones that are the closest to me. I’m tired of hearing or seeing my mom cry when I can’t control what comes out of mouth. I’m tired of latching  onto people,, and then just pushing them away. I’m tired of therapy, tired of trying to keep my mind busy to deter the suicidal thoughts.. I’m just.. tired. I’m exhausted of trying to put on a happy face for the sake of others,, and myself. I just.. I wanna disappear,, erase myself from everyones memories,, go off the grid and never come back. The real fear of depression isn’t dying,, it’s living with yourself, forever. My war is spiritual,, and not fought inside a battlefield. Instead,, it’s fighting and raging in my mind. It’s so hard trying to convey the continuity of depression to people who have never had it,, no, I can’t just smile,, no I can’t just flip it on and off like a fucking switch. No,, I just can’t “stop being depressed”.  \nMom, I’m so sorry that I couldn’t see the light at the end of this road. To be completely honest, I think I stopped looking for it a long time ago. None of this is your fault,, please don’t suffer. Please, just accept the fact that I am peace with the war raging inside my head.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/evhom4/ive_fallen_and_i_cant_get_up/", "title": "I’ve Fallen,, and I can’t get up.", "social_network": "reddit", "user": "eechibby", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 12, "down_vote": 0, "creation": 1580271653, "permalink": "/r/Suicidal_Thoughts/comments/evhom4/ive_fallen_and_i_cant_get_up/", "nsfw": false, "first_save": 1635428902.9170883, "replies_charged": false}