{"id": "t5_28vigg_t3_ovnqsq", "request": ["7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "I'm so tired. When I was 12 I decided I was going to kill myself. During that time I was being abused really badly. My mom escaped from my abusive father with us and ran away when I was 9. He was an alcoholic drunk who beat her almost daily. He beat me and my siblings too as well. My mom beat us too back then, more than my dad did actually. Ever since then she began comparing me to my dad.\n\n\nI learned a long time ago not to talk about my abuse. It was a lesson I learned when I was in kindergarten. And then again when I was in 2nd grade. I was too young to understand that this system wasnt built to help kids like me. My kindergarten teacher acted like she didnt hear me when I told her. My 2nd grade teacher called my parents. I got a beating for that one. To this day I'm still scarred from that. I mean when a kid tells you that their parents beat them, why the heck would you call their parents and ask then if it's TRUE??? I never said anything about it after that.\n\n\nWhen I was 12 I accepted the abuse as a constant in my life. I accepted that I was subhuman, a bottom feeder. Because if I was my father's daughter that meant I was a scumbag. My mom projected the anger she had at my father onto to me. She beat me violently, threw stuff at me, and yelled at me. She made my life a nightmare and nobody cared. I hated myself, I still do. But I also hated the world for not caring about what was happening to me. I thought I was borderline sociopathic, I couldn't muster any sympathy for anybody. Not even for myself. I just wanted it to end, the sadness and pain was suffocating.\n\n\nSo I decided I was going to end it.\n\n\nBut then one day I was in the girls locker room changing for gym and over heard girls talking about progressing to 8th grade. They talked about how your grades in 8th grade was important for college. Which isnt true by the way. And I thought \"Maybe if I can get good enough grades and get into a college I can be free. Maybe I dont have to suffer like this anymore. Maybe death isnt the only way out.\"\n\n\nI wish I wasnt so stubborn. I wish I didnt have any hope. I wish and wish and wish, over and over and none of them ever come through. Why did I give myself hope like that? It's so hard to let go of hope. Because if I didnt have hope then I would have the willpower to die.\n\n\nBut its not like it's not an option. That day I gave myself an ultimatum. If I didnt graduate and leave to college then I'd kill myself. And I will. Because i cant take it anymore. I'm so tired.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ovnqsq/when_will_i_stop_regretting_not_killing_myself/", "title": "When will I stop regretting not killing myself", "social_network": "reddit", "user": "ArtistWriter", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1627802379, "permalink": "/r/Suicidal_Thoughts/comments/ovnqsq/when_will_i_stop_regretting_not_killing_myself/", "nsfw": false, "first_save": 1635429255.06307, "replies_charged": false}