{"id": "t5_28vigg_t3_qd2nqz", "request": ["51bc1b45-8792-4b9a-86c9-1b72cd96a4ac", "183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "1298478d-f218-4dd4-a918-dcb9600d82ed", "d3dca3a0-327c-45d9-8a03-9a1f01a14fd1"], "text": " I dont even know if the title phrasing makes any sense or if anyone can relate, but this is the most accurate way to describe how I feel, I'm not actively trying to off myself and I dont think I'm depressed, I just dont feel like life is for me, I cannot handle it, I'm not built for it.\n\nEvery day I go to sleep I feel like I forgot something, like there's something on my to-do list I haven't done yet, I can't go back to sleep satisfied, but I know what that thing is, it's my suicide, I feel like I'm always postponing it and I can't handle it, I want this done already.\n\nI feel like everything about me and my birth was a mistake, I was doomed before I was even born and before I was even self-aware, everything about me feels like its pitted against me, it was already set out for me. As if the life I was given to live out is telling me its all wrong, i'm not supposed to live it out, everything came out wrong and I should just start over, and I'm not even in my 20s yet.\n\nTheres not really anything in particular that makes me feel this way, I truly don't believe I'm depressed,I just know life isn't for me, I'm not cut out for it either.\n\nThe ending to my story is way overdue, It feels like life is just dragging on, I can't even picture tomorrow or remember yesterday, I can't imagine a near future, the only far \"future\" i \"dream\" of when someone asks, is my fake reality that I daydream in to pass the time, it's not the future I want, it's just a pastime to indulge in, the future I want is nothing, thats what I want, to end my life and stop this hacksawed self from dragging on, slowly giving up on me.\n\nMy body is falling apart, I am constantly fatigued to the point where I cannot function in my everyday life, my family has noticed my severe fatigue and I've gotten tests for it yet nothing odd shows up, I'm perfectly healthy according to my lab tests, I see that as a sign, my soul longs for rest, my body is just carrying me from one place to another, keeping my life going, thats the only reason it *is* going. Which is why I want to end it's misery.\n\nI dont want to strive for a future everyone wants me to achieve, I want my future, the one where I never existed but the best I can do is end my life. I keep distracting myself with the pleasures of life, anything I remotely enjoy I milk it dry of dopamine until I'm back to where I started, its my escapism, I'm just stringing along, using it as a way to keep me going but I know it's all a facade, none of what I achieved matters as it was only just a pastime to distract from my constant yearning of death, just there in the back of my mind.\n\nI'm overdue, my body is overdue, my soul is overdue, I belong in the ground slowly decomposing instead of being forced to live and breathe and serve a society I don't belong in, I feel awful for wanting death to come at such a young age when there are people who are suffering and wanting to stay alive, but I just know theres no prospect for me, I'll keep studying, keep working and achieve a happy future, yet at the end of the day I'll still be longing for my death to come. Life is a gift, and I've served my purpose in everyone else's life, I just want to be put to rest already.\n\nIf anyone's read this all the way, I apologise for the very long post, it's difficult to describe these feelings as I've never opened up fully about them before.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/qd2nqz/i_feel_like_my_suicide_is_overdue/", "title": "I feel like my suicide is overdue.", "social_network": "reddit", "user": "artisanalecstasy", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1634854046, "permalink": "/r/Suicidal_Thoughts/comments/qd2nqz/i_feel_like_my_suicide_is_overdue/", "nsfw": false, "first_save": 1635428707.7411826, "replies_charged": false}