{"id": "t5_28vigg_t3_ez54y1", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "My preferred “fantasy” I guess you’d call it is to wrap my car around a tree or a pole. I don’t want to injure anyone else, I want it to be relatively quick, and look like an accident so my family wouldn’t know I purposefully ended my life. So far I’ve been too scared to actually go through with it which is a good thing. But I think about it a lot more, especially when my relationships with my family/friends are under duress or I’m stressed at work. \n\nI’ve been to therapists, I’ve been on antidepressants. Diet changes, adequate exercise, job changes; you name it, I’ve tried it. The main thing that holds me back is the trauma it would bring my family and friends, especially my mother. I think it would wreck her. She’s depressed, suicidal at times, and an alcoholic. My grandma’s death almost killed her and I think mine would send her over the edge. And I just can’t do that to her when her life is finally going well. \n\nI just can’t shake this feeling. I’ve obsessed over a deadly car accident for years. Things improve for a while and I forget about wanting to die, but the thoughts are always there in the background just waiting for my next failure. Therapy again? Another round of antidepressants that may make me sicker and more suicidal than I am now? \n\nThank you for listening to me vent. I hope this subreddit will be a positive experience not only for me, but for others, and I look forward to meeting some of you and hopefully we can all find a reason to stay one more day.\n\nTL;DR Basically I have suicidal thoughts about killing myself in a car accident and it’s hard to tame sometimes.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ez54y1/thought_about_how_id_do_it/", "title": "Thought about how I’d do it", "social_network": "reddit", "user": "Lejuicyfruit", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1580883976, "permalink": "/r/Suicidal_Thoughts/comments/ez54y1/thought_about_how_id_do_it/", "nsfw": false, "first_save": 1635429376.4253101, "replies_charged": false}