{"id": "t5_28vigg_t3_pk0s9o", "request": ["1298478d-f218-4dd4-a918-dcb9600d82ed", "51818c1f-9070-43a1-96e3-b1b348ef35e0", "029ade1a-045d-4a03-b80e-2f560fb4018f"], "text": "I've been passively suicidal on/off for a few years, but for the past few months I've been actively suicidal consistently, daily, to the point where even when I'm \"distracted\" and having a good time it's there in the back of my head.\n\nA lot of bad stuff has been happening and piling on and on and I just don't have the energy or motivation to deal with it or look forward to anything. I don't believe things are going to get better, but the only reason I'm still alive is because I have people who depend on me for financial and emotional support, and I know they and my family would be devastated if I did this.\n\nI don't believe in an afterlife or reincarnation or a soul, I believe when you're dead you're dead, and that's what I want, for everything to be over. But thinking about what the people I love would have to go through if I killed myself, even if I wouldn't be there for it, makes me want to cry, and I don't want to do that to them.\n\nThis makes me feel like my one way out of everything falling apart is gone and I'm just stuck as everything collapses around me and gets worse and I don't know what to do.\n\nI wish something would just take this out of my hands, like a fatal car accident or an accidental overdose, because then I wouldn't have to worry about the guilt, it would just be over.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pk0s9o/i_resent_my_loved_ones_for_keeping_me_alive/", "title": "I resent my loved ones for keeping me alive", "social_network": "reddit", "user": "3J4n3", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1631064962, "permalink": "/r/Suicidal_Thoughts/comments/pk0s9o/i_resent_my_loved_ones_for_keeping_me_alive/", "nsfw": false, "first_save": 1635428919.713015, "replies_charged": false}