{"id": "t5_28vigg_t3_p8hotu", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "610564bc-0916-401a-93cd-8d3e727a24ed", "935370ff-2e76-44cd-b247-7eb7b997ce9a", "b38140a1-7eee-49dc-9a69-c07b4318950c"], "text": "EDIT: Aug. 26: This situation has been/is being adequately addressed (yes, by professionals). Thanks all!\n\nHi.\n\nI don't know where on Reddit to put this.\n\nThis isn't me personally \n\nI have a friend who has the stomach flu, no longer contagious. Because of this flu, she naturally couldn't/stopped eating. Water and very occasional saltiness. Tomorrow is day 6.\n\nBecause she's not eating, she can't take her Zoloft. She is now in a suicidal state brought on by lack of Zoloft, Tylenol 3, not eating, not getting/maintaning nutrition, living in poverty not sleeping. She's chronically ill.\n\nThe chronic illness I get because me too. I'm well versed in suicidal crisis/treatment. I was in a suicidal state for basically 12 years. I'm on Zoloft as well, coincidentally. \n\nBut I don't know how to address suicidal thoughts and ideation when depression isn't the main cause. Not when, for example, she can't go to the psych ward (they won't take you here right now if your physically sick), she has no family, partner, friends (just me), I can't bring her with me to work tonight. She's suicidal because the stomach flu triggered various stuff. Can't eat=no Zoloft, no Zoloft...\n\nI don't think she'd do anything tonight, but if this continues over days...Given her physical health history, she could be not recovered for another 5-10 days. Then, she'd need to begin the Zoloft, introducing the BRAT diet...\n\nWe're both aware she needs \"stabilization,\" that the psych ward could give if not for the pandemic. \n\nShe says she needs back on her meds, if she were a nurse, she'd IV herself for dehydration.\n\nSo, any advice...appreciated.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/p8hotu/what_to_do_when_usual_routes_fail/", "title": "What to do when usual routes fail?", "social_network": "reddit", "user": "rosehymnofthemissing", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 10, "down_vote": 0, "creation": 1629506743, "permalink": "/r/Suicidal_Thoughts/comments/p8hotu/what_to_do_when_usual_routes_fail/", "nsfw": false, "first_save": 1635428854.6870131, "replies_charged": false}