{"id": "t5_28vigg_t3_osi4aa", "request": ["51bc1b45-8792-4b9a-86c9-1b72cd96a4ac", "90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "    I’m so done with life. I keep hearing “be strong” and “it will get better” but I can’t wait anymore. Im exhausted and empty. I feel like life keeps trying to push me over the edge. Just when the pain goes away, I feel hurt all over again. I’m not even a good person. Along with suicidal thoughts I also have homophobic and transphobic thoughts. As a gay person I know it’s wrong. Transgender people and Gay people all deserve love, I know that, and I want that. But I can’t change no matter how hard I try. I’m just to lazy, sensitive and weak for this world.\n\n    I have no passion. I’m not good at any sports, my grades in school are average, I have no interest in any instruments. I feel like I am meant to be a failure. I don’t know where I am going in life. The only thing that brings me joy is video games. Even then they sometimes make me frustrated and upset. I just have no other hobbies or interests.\n\n    My social life isn’t much better. I have 0 friends in real life and my internet friends have their own lives to live. I got myself obsessed with a fictional crush that makes me believe I will never get over him and will forever be alone and stuck on him. My family is the only reason I am still here today. I can’t even bring myself to cut because of fear of how they would react. We already lost our mom, I don’t know if my dad can take another loss. He said if something happens to us kids he might kill himself and I don’t want that for him. \n\n    I am at a loss here and am not sure what to even do. Most days I just lay down thinking about my fictional crush. I truly believe I don’t belong here. As I said before, I am just to weak and sensitive for this world. Everyday feels like hell. Back to my question, I have to ask. Is suicide ever the option? I am completely convinced that it will never get better and that is all my fault and my high standards for life.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/osi4aa/is_suicide_ever_the_option/", "title": "Is suicide ever the option?", "social_network": "reddit", "user": "Pirate_Tick", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1627370784, "permalink": "/r/Suicidal_Thoughts/comments/osi4aa/is_suicide_ever_the_option/", "nsfw": false, "first_save": 1635428732.9685767, "replies_charged": false}