{"id": "t5_28vigg_t3_o3kj3r", "request": ["51bc1b45-8792-4b9a-86c9-1b72cd96a4ac", "b38140a1-7eee-49dc-9a69-c07b4318950c", "d3dca3a0-327c-45d9-8a03-9a1f01a14fd1", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f", "fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "I hear people talking about people of advanced age committing suicide. Especially when an older celebrity commits suicide. \n\nThey always wonder why. They're older, they are in the last stages of life, why not just hang in there. \n\nPeople often believe that it's because the victim of suicide could not face getting old. People often try to attribute it to health problems that the person was having. \n\nThis could be true in some cases, but I present another theory. \n\nI am 44 years old. I have had suicidal thoughts since I was around 9ish. I have attempted. I have a plan. \n\nWhen I was young, what kept me from doing it was fear of dying. \n\nI have no fear of dying anymore. \n\nWhat keeps me here is bargaining with myself. \n\nI tell myself I'll revisit the issue when my daughter is older. Or that I will wait and see how certain events play out. \n\nRight now, I am waiting until I am 55, and then I will revisit the issue. My daughter will be 28. If my daughter is doing well, and if my husband passes before me, then I may do it then. If not, then I'll set another date for when I'll revisit the issue. \n\nLots of people do this, and eventually they'll reach the time when they figure this is the time. \n\nAt some point, when you live like this your whole life, you're just tired of the thoughts, and you can't find any more reasons to stay. Or, more likely, you find more excuses to allow you to feel better about leaving.\n\nPlease do not refer this post to the Reddit Helps people are whatever it is called. I am in counseling, and I am on medication. I have been for years. I don't need hotline phone numbers DM to my inbox. \n\nI'm just putting this here so that people that wonder why can see an alternative reason.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/o3kj3r/why_people_commit_suicide_when_they_are_older/", "title": "Why People Commit Suicide When They Are Older", "social_network": "reddit", "user": "Ecstatic-Jaguar-4707", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 15, "down_vote": 0, "creation": 1624121988, "permalink": "/r/Suicidal_Thoughts/comments/o3kj3r/why_people_commit_suicide_when_they_are_older/", "nsfw": false, "first_save": 1635428731.91504, "replies_charged": false}