{"id": "t5_28vigg_t3_qaa4fk", "request": ["1298478d-f218-4dd4-a918-dcb9600d82ed"], "text": "I'm a 33-year-old privileged white male and I'm done living.  \n\nBeen a \"professional\" musician since 2009 and have nothing to show for it.  I've traveled.  I've done it to the extent that it can be done without having to sign a contract.  No wife, no kids, no formal education in production or business or any field that actually makes a musician successful in 2021.  Got into Berklee ten years ago but couldn't afford to go; my dogshit family wouldn't co-sign a loan to admit me to the most prestigious universities for music on Earth, even though it was real important to go to college.  Mom died.  Grandma died, grandpa's family wrote me out of the will, unbeknownst to me(should never have given them my SS#).  \n\nBlah blah blah, victim mentality\n\nBlah blah blah, heartbreak for the first time\n\nBlah blah blah, don't know how good I have it\n\nBlah blah blah, still done with life\n\nI've done what I was made to do, what I came here to do.  I don't have anything left to give that you can't find somewhere else on YouTube.  I'm way better than 90% of the musicians out there but have a shitty attitude and am just not good enough to play with that 10%, the ones that really know what they're doing, the ones that will be successful no matter what, pandemic or otherwise.  \n\nI'm alone, I'm angry all the time, I'm an addict, I never sleep, I found Jesus but it was out of desperation; I have no home, I'm always one missed gig away from homelessness, and I'm just done.  \n\nI own guns, thanks to my crazy redneck friends, I can shoot well, and I'm just waiting for civil war to pop off.l, but I'd rather be long gone before that day comes.\n\nFifteen years, tops.  We'll either be at each other's throats, looking for gear, tools, equipment, and sustenance for survival, or technology will be vast enough to bury my soul in, to hide away from this nonsense world.  \n\n1354 Watkins St\nConway, AR 72034\n\nPut a bullet in my skull", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/qaa4fk/im_absolutely_ready_to_die/", "title": "I'm absolutely ready to die.", "social_network": "reddit", "user": "Warm_Instruction_519", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1634512520, "permalink": "/r/Suicidal_Thoughts/comments/qaa4fk/im_absolutely_ready_to_die/", "nsfw": false, "first_save": 1635428918.588548, "replies_charged": false}