{"id": "t5_28vigg_t3_epz3r6", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "I constantly want to end it, the only reason I haven't is because it would make my family sad. My parents and grandparents have done so much for me, and I raised my dog since he was a puppy and I don't want him to go on knowing he'll never be able to see me again ever. I haven't seen my family and dog in 2 years, I won't see them again for a long time cause this bitch ass deployment I've been on since June just got extended for I don't know how long. And even when I do see them again I don't know if I'll feel happy like I used to. I know it's selfish, but I hate seeing all the people I used to go to school and work with look all happy with college or getting in relationships and all that. The last time I was in a relationship it was one of those stupid ones that lasted a couple weeks in high school, I'm about to be 22 now and haven't been in one since. I'm constantly berated at work no matter how much I try, because that's just the way it is. If you don't act like a retard frat boy you're looked down upon, im a quiet, reversed person, I just do what I'm told to, to get the job done, I'm not here to  party, I'm here for work. I'm thinking of going to a mental health clinic when I get back hopefully they'll give me some meds. But I'm constantly thinking of a way to go. Either a couple of bottles of sleeping pills all at once, or a shotgun slug to the heart, or maybe I'll just walk into the wilderness and let the winter elements of the north take me. Thanks for reading if you got this far, if I still feel like I'm a failure by 30, I'm ending it once and for all.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/epz3r6/fuck_this_place/", "title": "Fuck this place!!", "social_network": "reddit", "user": "Italianodude02", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 9, "down_vote": 0, "creation": 1579260031, "permalink": "/r/Suicidal_Thoughts/comments/epz3r6/fuck_this_place/", "nsfw": false, "first_save": 1635429377.2453284, "replies_charged": false}