{"id": "t5_28vigg_t3_n24dv5", "request": ["029ade1a-045d-4a03-b80e-2f560fb4018f", "cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "I used to have an active social life, bold, fearless, I would go to spur of the moment concerts and hikes, exercise every day and kept multiple journals. Involved in social activism and being a useful person. \n\nI’ve hit a huge low since my health took a turn, and being unable to distract myself with constant activity because tiny basic things tire me out, I’ve had to come face to face with a lot of childhood trauma from my dad. He was crazy abusive in every way and  my circle forbade me from calling the police. \n\nRegardless, I feel pointless. I can barely take care of the house and cooking while my husband is off working as a teacher and volunteering and being incredible. He’s so patient with me and kind, he never expects more than I can give, and I cry thinking of how much it would hurt him if I killed myself. \n\nHowever, I know he would move on. We’ve been married less than a year and he could easily find someone else or just thrive on his own. He would be happier too because he wouldn’t be bogged down by me. \n\nI don’t want to be alive anymore because I’m useless and helpless, I feel constant pain, I have daily anxiety attacks due to trauma and I just want out. He’s so full of hope and  zeal, but I’m empty these days. \n\nI honestly hope he falls out of love and find someone behind my back so when I do it, he won’t be as hurt.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/n24dv5/chronic_illness_has_me_feeling_like_ending_it/", "title": "Chronic illness has me feeling like ending it.", "social_network": "reddit", "user": "Beastimor", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 4, "down_vote": 0, "creation": 1619819631, "permalink": "/r/Suicidal_Thoughts/comments/n24dv5/chronic_illness_has_me_feeling_like_ending_it/", "nsfw": false, "first_save": 1635429070.3506796, "replies_charged": false}