{"id": "t5_28vigg_t3_ichncl", "request": ["fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "Hello. This is not my first account I made this one for obvious reasons. I won’t bore you with my entire life story but I’ve felt the need to say this for a long time. Since about age 13 I’ve thought about hurting myself. A year later and I was in a deep depressed state and got the cops called on me due to a suicide attempt. Since then I took meds for a year then lied to my doctors saying I felt fine because I just felt like a robot, no emotions at all. Since then I’ve held on but those thoughts of ending my life have always come back. This year has been odd for everyone. I’ve been thinking of attempting to end my life seriously for the first time since my last attempt. Don’t even get my started on other people, though that’s not the reasoning of these thoughts. Honestly as silly as this may sound my body feels like it’s been failing me for awhile now. Again I’ll skip a lot of details but various areas of my body hurts and aches. I’m trying whatever I can to make it stop but I feel I’ve screwed it up to badly to fix. Just when it seems I fixed one issue a new one arises. And now I’m hurting so bad psychically and hospitals are already busy enough I doubt anything could help. I’m a ticking time bomb waiting for the day where something random will occur physically and it’ll kill me. Unless I end my suffering myself..I’ll keep waiting it out as best I can see if these issues eventually go away but I doubt they will..I know it might sound dumb but I just want all this mental and physical pain I feel to be over..\n\nSorry for the long and sorta vague post including all details would make this to long imo. But if you have made it this far thanks for listening. Not many people have", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/ichncl/need_to_get_off_my_chest/", "title": "Need to get off my chest", "social_network": "reddit", "user": "Throwaway91919196", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1597814397, "permalink": "/r/Suicidal_Thoughts/comments/ichncl/need_to_get_off_my_chest/", "nsfw": false, "first_save": 1635429617.4870152, "replies_charged": false}