{"id": "t5_28vigg_t3_kxuqpx", "request": ["fe572f64-a138-4e7a-b171-2b276fad9350"], "text": "I (23f) have been suicidal for 7 years now. I have always suffered major depression, anxiety, and bpd. Its gotten to the point that i am experiencing depersonalization/derealization. I have attempted a few times in the past. \n\nI've been in an unhealthy relationship with the guy i met in high school. We've been together for 5.5 years and engaged for year and a half. Throughout this relationship, ive been emotionally abused, cheated on constantly (not physically as far as i know), occasionally physically grabbed me, pushed me.\n\nI've been so loyal to him and talked to him so many times about his actions and how they affect me. He doesnt care about crossing boundaries. I've accepted the fact that that's who he is but i want no part of it. Its those other local girls over me. Everyday. I do everything for him. I give him all his free time to play video games, pick up after him, cook and clean for him. Always there when he needs me.\n\nI tried fighting back by giving him a taste of his own medicine. Maybe thinking that will wake him up. That never worked either.\n\nIf i leave i will lose everything. I will be homeless. I work full time but cant afford to live on my own. Assistance takes months and i cant wait months. I dont have a car so i wouldn't be able to keep my job and finding work right now is extremely hard. My workplace needs me and i love being on their team. \n\nI have no friends or family to go to. My only friend is him but it isnt healthy. The only reason im still here is because i stayed for my dog. He passed away early october. Now im still here for him. And hes the one who is gonna push me over the edge.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/kxuqpx/im_on_the_very_edge/", "title": "Im on the very edge", "social_network": "reddit", "user": "babyxaqua", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1610718105, "permalink": "/r/Suicidal_Thoughts/comments/kxuqpx/im_on_the_very_edge/", "nsfw": false, "first_save": 1635429625.4650567, "replies_charged": false}