{"id": "t5_28vigg_t3_nu0xff", "request": ["51bc1b45-8792-4b9a-86c9-1b72cd96a4ac", "d3dca3a0-327c-45d9-8a03-9a1f01a14fd1", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "Posting here cuz suicidewatch doesn't feel apt. \n\nThe closet I've gotten to was when I bought a rope and booked a reservation at a motel. I work in the produce department of a grocery store. If I were to kill myself currently, only one person would be working in my department division. I made extras that day so my absence wouldnt screw over my coworker. Then I asked someone working in another division of my department what would happen if I were to \"quit and never come back.\" Would I screw everyone over? He said yes, which meant I decided to wait. \n\nI have to get my affairs in order and ensure my department is fully staffed before I commit suicide. It sucks because I cant focus on shit. All I can think about is suicide. I look at the shower head attachment and think about hanging myself with it. Any height I wonder if I could jump off it. All knives I think about stabbing myself with. I dont even want to do anything anymore, but I have to keep up a facade of normalcy. \n\nTho the mask is slipping. Without even thinking I just make suicide jokes like all day. Or say stuff like, \"I wish this cord would electrocute me.\" \"I'd rather get hit by a semi truck.\" \"I'd rather die.\"  \"I just want to disappear.\" People are starting to notice. Shit. \n\nIdk. I just needed to talk about it. I have no one else I can say this to", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/nu0xff/suicide_is_all_i_can_think_about_but_i_cant_even/", "title": "Suicide is all I can think about but I cant even act on it", "social_network": "reddit", "user": "lolfmltbh", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 15, "down_vote": 0, "creation": 1623029898, "permalink": "/r/Suicidal_Thoughts/comments/nu0xff/suicide_is_all_i_can_think_about_but_i_cant_even/", "nsfw": false, "first_save": 1635428728.7200036, "replies_charged": false}