{"id": "t5_28vigg_t3_m288qg", "request": ["90472b3c-14c3-4a56-be61-333d4f5dd86c"], "text": "I honestly don't know where to turn anymore. Every single day feels like a battle that I just don't want to face anymore. I feel like I have absolutely no one in this world. I just went no contact with my last remaining family members because my grandma is a narcissist and no one in this world supports me, they all say I was wrong to do that because she's family. I feel immensely guilty everyday because I also left behind a grandpa sick with cancer since he can't really see due to I think glaucoma or something and grandma refuses to let him get the surgery he needs so there's no way to contact him. I left behind a mentally disabled sister too, but she never wants to contact me through text or call but I still feel guilty anyway. I have no friends. When I stopped doing drugs two years ago, I lost the only friends I thought I had, because I basically went completely sober, no alcohol either since it was affecting my life. I have chronic migraines, and severe stomach pain that is so bad that basically all foods I eat give me some sort of pain, usually severe pain, lasting anywhere from 4 hours to 3 days at a time, and usually accompanied by diarrhea or vomiting as well. I can barely stand or do anything during the times I have that pain, and no one understands that in the house I live in now. No doctor can figure out what's wrong with me. I've had this pain for over 3 years. I am recovering from an eating disorder, and now I have worse health than I have ever had. I feel like a total failure, in every aspect of my life. I can't even point how low I feel into words. I just want to give up. I feel alone, I feel like this reddit post is my last resort. I am tired of constant pain in every inch of my body. I am tired of just wanting to experience joy but can only feel mental and physical pain. I have several mental disorders and that only makes things worse for me, no one takes me seriously. I just want to die. I told my boyfriend this yesterday, the only reason I haven't done it yet, and he basically just added on to my reason of why I want to die, because he said I dont do anything around the house anymore, that was his response for me saying I want to kill myself. He basically said I need to fight harder. Anyway this is just a jumbled mess because I am having a panic attack and feeling so low right now. So sorry :(", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/m288qg/no_hope_left/", "title": "No hope left.", "social_network": "reddit", "user": "brinewtea", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 1, "down_vote": 0, "creation": 1615409724, "permalink": "/r/Suicidal_Thoughts/comments/m288qg/no_hope_left/", "nsfw": false, "first_save": 1635429358.1935847, "replies_charged": false}