{"id": "t5_28vigg_t3_g0d1wa", "request": ["b4d8161b-7016-486a-a4bd-5fb6a5aa639e"], "text": "Hello everyone. I am writing this here, hence I won't be able to see a therapist any soon, at least not until I fully finance myself and not being have to explain therapy to my family. If you read it, and if you can relate to any of it please let me know. Sincerely, have a nice day.\n\nDuring my pre-teenage times the age 12-14, I was in rebel emo phase. Again, I had no emotional problem, I rarely feel upset or sad. I was just into it because I liked the music. And I was highly influenced by the so said \"culture\" of those interests. When I like something, I become really obsessed with it and search for every detail. So later, I got into history and I finally found my obsession. I was also interested in writing and I wrote many depressing poems, demon themed, death themed things. It was consuming all over me. And the point here is that, I literally had no problem in my life to cause those feelings. I was feeling super numb, writing sad poetry not because I felt sad, but to write those things. My online friends that period weren't good either, they often self harmed, etc. I never had any of those, thankfully. As the time passed, things got worse for me. I am sure many of you played a game, where a man's house was filled with same picture of an island, looking for dumb details to prove his conspiracy, I was in that state. And my family didn't want me to talk with my so called 'online friends', I understand why so well and I am very grateful they did. But that time, I was totally consumed by the darkness I created. I attempted s#cide, but thankfully failed. \n\nAfter that attempt, as soon as I opened my eyes, I did a 180 degrees turn personalitywise. I was way more talkative, energetic, still into history and that music style but as a cheerful girl. I literally disliked my whole middle school but in high school I was one of the most popular girls honestly. My high school was science high school, where you are with bunch of hard working students and everyone knows everyone. I was really friendly and in high school I got rid of my history obsession and changed my music style, but it happened slowly and not by force. I was basically disinterested. This happened when I wrote 400 pages book defending, romanticing a war criminal, actually wanting to publish it but THANK GOD my computer crashed so I couldn't. I can't even imagine if the book went published, I would be so disgusted now. Quick note, after my personality turn, I also felt disgusted by history, because it reminded me my own self. Anyway, since the 11th grade, everything seemed to be fine. \n\nIn present time, I am 18 years old, female. I am actually very spoiled in family, my parents are very chill people. We get along well. I never had a boyfriend or a girlfriend to this age either. Nor I had long relationships with anyone, my online friends and I often lose connection after 3 years or less. We moved out of city a lot and few months ago we moved again. Since we changed city, my mood decreased. And I was worried to turn into my old self. So before things happened, I wanted to write everything out. I really hope I can talk with some people here. Those last weeks, my mood got horribly low that I actually found myself reading some history things again, talking like my old self, definetly not nice things.\n\no no.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/g0d1wa/bunch_of_thoughts/", "title": "bunch of thoughts", "social_network": "reddit", "user": "ejelius", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 6, "down_vote": 0, "creation": 1586757310, "permalink": "/r/Suicidal_Thoughts/comments/g0d1wa/bunch_of_thoughts/", "nsfw": false, "first_save": 1635429482.300401, "replies_charged": false}