{"id": "t5_28vigg_t3_p9j2o3", "request": ["183fcaaa-d540-4d2a-b2f1-5c427d562e0e", "b38140a1-7eee-49dc-9a69-c07b4318950c"], "text": "I want to talk about how I have suicidal thoughts every day, without people treating me like I’m suicidal. I know it doesn’t make sense, but I have an exciting backpacking trip planned that I’m secretly thinking “if somehow I die that’s fine” but if I mention that to someone they’ll get all worried and keep their eyes on my movements. I want to be left alone by the people who love me, I want to talk about how I’m walking into the wilderness with a slight death wish, how it’s getting me through the fear of following my dreams knowing that if I stay home I’ll just die at home by my own hand. I’m not actively trying to die, but if death came for me in the woods, I’d welcome it, u know? \n\n Im not out there jumping off cliffs, but I want to die, and I wish I could talk about it and get a Viking’s reaction, someone to slap me on the back and nod and say “you’ll make it out alive, and if you don’t then you were brave and I’m proud.” I am brave because I feel the fear and I continue and maybe I’ll die, but I’d be a coward if I let my thoughts chase me down in a house in the fucking suburbs. \n\nI want to tell people I’m scared of my own thoughts, without having them call the cops or raise the alarms. I want them to believe me without making them cause a ruckus about. \n\nI am depressed, I am suicidal, I don’t want anyone to know because that’s when everyone pretends to care and I don’t have the energy to keep telling them I’ll figure it out. And by figure it out I mean let me die if I want to, let me heal if I can.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/p9j2o3/let_nature_take_me/", "title": "Let nature take me", "social_network": "reddit", "user": "mary_w3b", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1629660393, "permalink": "/r/Suicidal_Thoughts/comments/p9j2o3/let_nature_take_me/", "nsfw": false, "first_save": 1635428856.9421065, "replies_charged": false}