{"id": "t5_28vigg_t3_qab328", "request": ["cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "God bless you for even stopping to click on this. Need some support and kind words desperately , I have nowhere to turn to right now, and If you’ve read my posts before, this is a recap with multiple updates. \n\n\nBaby is 16 months, and we still have not recovered our finances...right when I was about 3 months pregnant we lost everything , all our savings due to financial emergency after emergency....\n\n\n\nI’m 28,When we planned our baby, we were going to do engagement right around the same 3 month mark , and now as we speak I’m dealing with a flooded house! Like I’m starting to feel this will never work out for us. It’s like in one fell swoop I lost my maternity joy, engagement joy, wedding joy, some of the most important milestones that we remember forever. And I haven’t been able to focus on getting my body back in shape due to all the stress. So I never binded my hips or my waist, nor did I get to work out regularly ..\nInstead of my lovely perfect hourglass figure I’m now borderline apple shape. I cry every time I look in the mirror, I hide from my partner and rarely see my friends . I used to light up a room now I hide in the back.\n\nI was even attacked by someone at 5 months pregnant, almost losing the baby, and spending the last year and change in court trying to get justice !. It made me give birth 6 weeks early too; it was horrible.\n\nnot to mention I was 2500 miles from my family in the Bay Area for 8 whole months, I just came back to Miami area , so this whole time it was just me and my man 100% of the time with the baby, no time for ourselves.\n\n.We make good money but it’s always gone because something is always going wrong....\nRight before the shutdown we were making headway to rebuilding ourselves...then the shutdown happened and we are still struggling. My partner had a successful event planning business and he lost thousands on thousands in deposits due to the shutdown .\n\nAnd we have always spent below our means, used budgets etc.\n\nI love my partner and baby. I don’t mean to sound ungrateful. But I really feel so ashamed deep down for how everything turned out. Just need some support ...cuz most people assume when everything goes wrong that you didn’t save or plan properly..especially in communities of color.. And we did all of those things, I promise you... but life had other plans. And having to celebrate my friends and family as they get to enjoy these things has been hell for me, but I still just try to forget about my own situation cuz it’s not like they made this happen to me. And I’ve even had a couple people I trusted make fun of my situation and abandon me, so that was also painful. This journey has been crazy. It really has.\n\n\nI took a job for $19 an hour and got fired cuz I got into a car accident where I could’ve died the week AFTER my dad got his prostate cancer removed. My partner and i are down to one income , i was supposed to be using the money from this job to rebuild my business that failed during pandemic…\n\nit’s been a month of searching for s new job and nothing is working. I have $200 to my name .I think I am going to end my life today. I have considered Baker Acting/5150 myself but I know I can’t handle being locked up with no ability to exit the facility . I gave birth during Covid so I have some bad anxiety about being back in a hospital locked up for 3 whole days cuz it was soooooooooo miserable. \n\nI am also currently in therapy but it’s not helping. My life is too hard smh", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/qab328/finally_started_law_school_but_i_dont_feel_strong/", "title": "Finally started law school, but I don’t feel strong enough anymore", "social_network": "reddit", "user": "Lifespitmeout", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 2, "down_vote": 0, "creation": 1634515857, "permalink": "/r/Suicidal_Thoughts/comments/qab328/finally_started_law_school_but_i_dont_feel_strong/", "nsfw": false, "first_save": 1635429214.5149238, "replies_charged": false}