{"id": "t5_28vigg_t3_i9876a", "request": ["029ade1a-045d-4a03-b80e-2f560fb4018f", "935370ff-2e76-44cd-b247-7eb7b997ce9a", "3a1372b3-e9f7-4aa8-9927-da37f168fe5f"], "text": "Hello reddit. I like to put out there that there are many reasons I still have suicidal ideation. I used to want to be nice to everyone and thought life was good. But after some backstabs, not knowing how to deal with vain and difficult people,friendships growing more distant, never knew how to stand up to bullies or people who take advantage of you, developing trust issues, I grow more desensitized, less compassionate, more stressed/careful about people,feel sadistic when esp bad people suffer, and more cynical. I'm also shy introvert but can talk to some people depending. I don't have any close friends(which I perceive could still make time to talk to you even if they have a long day of work) and partner. I feel I probably turn more of a blind eye to animals who need help in front of me because I am too concerned about myself or don't care much. Also it seems in this world, you can't be yourself, especially at work, such as being strictly professional and not suffer wrath of mean bosses if possible. Moreover, it seems I have to be in part of \"white lies\", which I felt touched my moral nerve, to get into nursing school and do well on interviews and \"wear a mask\" if go to work as a nurse. FYI I am not nurse but currently am in college.(and I may end up not like nursing after I tried nursing school and jobs i guess) Although I still want a good house, stable income, be independent from parents, and have enough money to do side projects, I feel I can't live with values. Such as working at a workplace that is true to itself and filled with compassionate and fair people. I used to look up to law enforcement, medical field, school systems, law, and government,etc. However, when I look around those places and other work, there always seems to be corruption and suffering.(ie. bully victims being punished rather than bullies for fighting back, police just frame innocent people, arrogant doctors harass and act condescending towards nurses, us people somehow allowed some president to allow covid situation to worsen and many people suffer the consequences with the virus). Also, I know I am not creatively minded and great problem solving person to be appealed to demanding different jobs out there nowadays. I often felt uncorfortable to be part of jobs or companies(i guess that's like pretty much everywhere) that has corruption within that I cannot help deal with and just help instead to continue their existence. I feel if I continue living I feel I am one of many people out that contribute to the worsening of the environment like driving cars(make ozone layer worse). And also I feel some guilt that I survive and ignore people who seem to suffer non-stop depression,suicidal, and hopelessness because I don't exactly know how to help them effectively and feel I may drain my own energy. I also wonder if people who committed suicide were always destined to never have their mortal lives saved. I did see some therapists but I can't still resolve my being too pure thoughts. If I were a theist, I would not want to be with a God that restricts freedom unreasonably, be contractidictory between what's out there and what's in \"holy document(s)\", allows evil and corruption to spread on earth,(and people's lives continued to be obliterated), and somehow created someone like me to suffer due to having a curious mind and being knowledgeable and uncertain. I often feel empty inside, and that I don't deserve to be happy. I still don't know my life purpose and unsure if I could be capable to help make big changes in the world. There's seems to always be injustice in this world and not much good people left to make significant changes to overcome such injustice. Does anyone feel like they are too pure for this world and rather kill themselves and not be corrupted? What ways, if any, do you deal with these being too pure feelings and still live? Is there no hope for pure hearted people to live in this world even anymore? Also any advice for my own case? Even links and readings are alright.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/i9876a/too_pure_for_this_world/", "title": "Too pure for this world?", "social_network": "reddit", "user": "NashW0120", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1597352424, "permalink": "/r/Suicidal_Thoughts/comments/i9876a/too_pure_for_this_world/", "nsfw": false, "first_save": 1635429086.424809, "replies_charged": false}