{"id": "t5_28vigg_t3_krqp1k", "request": ["7095f3d3-98c4-4ee5-b79c-7083d5f62bab", "6587bfb5-f909-4bd9-a1eb-ee7504e47d40"], "text": "So, I have got your attention. Yes this is my last post. It breaks my heart people who are educated and talented people are here in this community.\n\nI know you are suffering and you wanna end it all. You think, it makes you happy the feeling of leaving this world. You already hate this world. You even hate your loved ones. \n\nHere I am telling you what's gonna happen,  I have done this, I don't know hundreds of times, to planning to fade away, but I actually have tried to kill myself twice .\n\nOnce you have done writing your suicide notes and you will go look for your loved ones.\n\nIn heart, you are crying but on your face you will put fake smile so they will remember you how happy you were in your last days.\n\nNow, the end is coming near and you are feeling sense of anger and pressure in your head and your heart is pounding so hard. \n\n\nThis moment will come. And in this moment, I am telling you if you really want to be happy then don't do it. Feel the pain but don't do anything. Just lie on your bed and cry. Listen sad songs and let yourself  break apart.\n\nBecause you are worth it. I know, in that moment, you would want be happy but you are crying and it is making you ashamed but it is okay.\n\nYou will be okay.\n\nLie there and face another day. And forget your night. Forget what it is going through your mind.\n\nFocus on the ways which will make you happy.  Make a list. But before that, clean your room first, shower  and change your clothes. You probably don't know but gardeners cut unwanted and broken leaves from a plant or tree, so a plant can use full potential to grow. Also, have you heard a tree grows half or short? A tree grows as tall as it can grow, and so can human, so can you. \n\nNow, when you will do a new list, don't add negativity, only the things you loved the most. Pretend as if you died last night, now this is your new birth.(don't believe in afterlife or reincarnation, only superstitious people believe in that, you are a part of nature and nature never forgets like sun always comes tomorrow). \n\nIf you can postponed your suicide date, then you can achieve anything else in this world. I have achieved it. The happiness when I was a kid. If I can do you it. You can too. Trust me, it's hard but it's possible, you have to close all the doors of leaving this planet.  \n\nI am done but you are not done, you have a work to do. Stay calm and fight back. There is no beautiful person more than your own self.  You guys are good people and I truly believe that GOOD PEOPLE ARE MAGIC. THEY RESTORE OUR FAITH IN HUMANITY.\n\nLook after yourself.\nI am here if you need talk to. I won't leave. I am staying with you, if you are staying with me on this beautiful planet.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/krqp1k/this_is_my_last_post/", "title": "This is my last post", "social_network": "reddit", "user": "Umbastard", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 26, "down_vote": 0, "creation": 1609948980, "permalink": "/r/Suicidal_Thoughts/comments/krqp1k/this_is_my_last_post/", "nsfw": false, "first_save": 1635429298.4236887, "replies_charged": false}