{"id": "t5_28vigg_t3_m52a1g", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "Welcome to: What do I say if I ever see a psychiatrist.\n\nI have really bad anxiety? When it flares up I can have panic attacks, I shake a lot, and I have bad chest pain. It happens more often in groups but I still feel anxiety one on one.\n\nI hate myself. I'm not really sure of anything. I avoid people because I'm scared. I have been letting my body slowly die (I usually talk myself out of getting help of any kind.) I only think about why life isn't worth living or try to distract myself.\n\nI'm very depressed. I believe there will be nothing after death and that this life won't even matter. It makes me wish I was already dead, but I keep making excuses to not kill myself. I can't make plans or think about the future without this being a problem.\n\nI'm very paranoid. I'm always worried about making other people think the way I do. I worry that they will kill themselves or hate me. It gets to the point where I get delusional and think that everyone is in my head and hate me for who I am and what I think and feel.\n\nI hear things. I'll hear people downstairs or in rooms when none's home. I'll hear people talking about me when none's around. I can hear people yelling about me or at me too often. I keep seeing things out of the corner of my eye, but it's just something not there or something I missed.\n\nI don't want to cause any problems for others. I won't even leave my room to get a drink if people are downstairs. I don't make unnecessary noise. I won't get help for myself, or I won't eat around people. If I think seeing a doctor won't help I won't go so I don't waste both our time/money. I've seen doctors and councilors before but nothing has helped.\n\nEven though I am worried about everyone, I care about them and how they feel. I try to stay away so they don't go crazy like me.\n\nI've been keeping a lot of journals to try and sort things out by myself. I've been looking through them while typing this out, trying to find more things I should tell you. I don't want to miss anything, then look back and regret it. But I'm looking through all of these journals I have. I've been keeping them for a few years, writing in them maybe a few times a month. Most of it though is just me rambling trying to convince me not to kill myself that night, or trying to convince me to kill myself that night.\n\nI just hide and don't do anything. I should die. I hope I do soon.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/m52a1g/finding_help/", "title": "Finding help..", "social_network": "reddit", "user": "Aveeeeeeeee", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 3, "down_vote": 0, "creation": 1615750480, "permalink": "/r/Suicidal_Thoughts/comments/m52a1g/finding_help/", "nsfw": false, "first_save": 1635429017.2017603, "replies_charged": false}