{"id": "t5_28vigg_t3_pzphzt", "request": ["51818c1f-9070-43a1-96e3-b1b348ef35e0", "cf81d7c0-cd42-4d3e-a15d-51251de387ba"], "text": "(38 bi m) So as mentioned before I am really bad at forming relationships. I am an Aspergers sufferer and as a result I have really bad social anxiety. This stops me being able to just go out and find anything meaningful. That and I have zero confidence in my body or appearance. \n\nWhen I do find someone I like the always don’t like me the same way and I get friendzoned and their I stay. It’s not their fault they don’t like me that way and I don’t blame them in anyway. But I do tend to spend my time in unrequited love quite a lot and for many years. Most of the time I am happy enough just having the companionship but it always hurts like hell when they end up getting into a relationship because I know I can never be the special one or the one that comes first. \n\nThis is a very painful experience and leaves me feeling hurt and rejected. Again I’d like to say that I don’t blame the other person for not wanting me that way. It’s not their fault. Although I have to admit that I wish they saw me that way.\n\nSo things never seem to work out for me in love and things never work out for me socially and things never work out for me from a stability angle either. It’s been this way my whole life. No friends, no real love life just emptiness.\n\nI’m not sure how much more I can take. Just the constant loneliness is killing me. I just want to get a hug and some sort of affection to make me feel wanted at least. I don’t feel that’s ever going to happen however. I know I can’t go on like this forever. I the alternative is suicide to end the pain of my loneliness.\n\nSo at this point I need to point out something. I’ve had unkind comments before calling me a “simp” or “incel” I’m neither of this things I’m a man who’s struggling to achieve which others achieve easily because of my condition. I am suicidal because I can go on anymore feeling alone. I’m scared for a future alone.", "url": "https://www.reddit.com/r/Suicidal_Thoughts/comments/pzphzt/feeling_so_run_down_and_starved_of_human/", "title": "Feeling so run down and starved of human affection. So lonely. Why does this have to hurt so much? Think I’m better off dead", "social_network": "reddit", "user": "Smurf-the-adventurer", "subreddit": "Suicidal_Thoughts", "subreddit_path": "r/Suicidal_Thoughts/", "up_vote": 5, "down_vote": 0, "creation": 1633154280, "permalink": "/r/Suicidal_Thoughts/comments/pzphzt/feeling_so_run_down_and_starved_of_human/", "nsfw": false, "first_save": 1635428985.1807795, "replies_charged": false}