{"id": "t5_2tand_t3_jhuqf4_t1_ga38w7o", "creation": 1603653366, "origin": "t5_2tand_t3_jhuqf4", "height": 1, "replied_to": "t5_2tand_t3_jhuqf4", "down_vote": 0, "up_vote": 14, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "stardust1283", "text": "I am 28, and drank heavily/couldn’t control myself from about 17-25. The exception was being pregnant at 23, so minus that year obviously. \n\nAround 25, I realized this wasn’t working for me. I had realized that before and tried to stop but couldn’t. It was upsetting and frustrating. I was tired of feeling sick all the time and I knew I needed a change. I went over to r/stopdrinking and found the most amazing community on reddit. So many empowering stories! I read a book called This Naked Mind which I highly recommend. It’s completely changed the way I think about alcohol. \n\nI committed to stopping drinking at 25 for the foreseeable future. People didn’t care, even though I was nervous because all my friends and family still drank. I just told them I was going to stop drinking for now because it messed with my anxiety levels and everyone was cool. \n\nI missed drinking the first couple drinks of the night when everyone was pouring one. But after that it was easy and watching everyone get sloppy and knowing I would go to bed sober and wake up rested and happy made me feel good. I also saw how annoying drunk people actually are lol. \n\nAnyways, I had to commit to not drink at all for about 2 years (had another baby in thst time which also helped obviously), but I was sober for a few months before conceiving. \n\nI’m 28, very close to 29 now and honestly I feel so much better. I can now drink on occasion and control it. I don’t crave being drunk or having more than 1 or 2 at most. I don’t like feeling like crap and sleeping poorly. I love feeling healthier and filling my time with meaningful hobbies and interests and being a better parent. So now I still have a glass or two at Christmas with family or for my birthday but I easily control it and I don’t feel like I need it anymore. \n\nYou can do it!! I guarantee you your life will be better and richer. One day at a time :)", "permalink": "/r/DecidingToBeBetter/comments/jhuqf4/i_think_im_gonna_give_up_drinking_last_night_was/ga38w7o/"}