{"id": "t5_2tand_t3_io2rtf_t1_g4c4iyg", "creation": 1599490216, "origin": "t5_2tand_t3_io2rtf", "height": 1, "replied_to": "t5_2tand_t3_io2rtf", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Chingletrone", "text": "Hit up some online meetings. I know from experience that this phase can be deceptive in that you might be thinking \"I don't need much support because I already stopped on my own.\" Realistically, maintaining sobriety is just as difficult if not more difficult than initially stopping. [SMART recovery](https://www.smartrecovery.org/community/) has a great online community with multiple zoom meetings every day. They focus on cognitive tools to change your thinking about and relationship to compulsive/maladaptive behaviors (ie addictions). Pro-tip: look for meetings that are skills/tools focused, and if you want a more personalized setting avoid meetings where verifications are provided (these tend to have 100+ ppl in attendance). \n\nIf meetings aren't your thing, you could still benefit from browsing the \"resources\" section of the website and reading up on some of the tools (developed from the discipline of Cognitive Behavioral Therapy) for changing thoughts/behavior patterns. There is also a forum. It isn't super active, but there are a few active posts each day in my experience.\n\nEDIT - Just want to add: In recovery speak, you are likely passing the \"acute withdrawal\" phase and probably beginning to experience \"Post-Acute Withdrawal Syndrome,\" aka PAWS (SMART is a great resource if you want to learn more about this phenomenon + some strategies to cope with it). As you enter PAWS, the physical symptoms of withdrawal begin fading into the background, but psychological issues - including intense cravings, irritability, mild-moderate depression, sleep disturbances, random fatigue, etc - can linger for weeks to months. It's different for everyone, but post-acute withdrawal typically lasts for 1-6 months after quitting a serious habit (not even necessarily a physically addictive drug). Keep in mind that it is perfectly normal to continue fixating on these substances and to generally feel \"off\" like something is wrong, which your mind will immediately jump to those old habits as a solution to get \"right\" again. \n\nIt tends to become less and less noticeable the further out you get. Remind yourself that this WILL fade over time, it's just a natural part of the healing and adjustment your body and mind are undergoing. At some point in the not-too-distant future, you will notice a mild craving that fades within a matter of seconds and realize it's the first time you've really thought about it in days or even a week. Stay strong, seek support if/when needed, and maybe focus on your health and wellbeing in the mean time: diet, sleep, hydration, moderate exercise, work on some hobbies/goals that give you satisfaction, some form of social fulfillment (reddit barely counts), and perhaps some mindfulness or other calming/spiritual activity. \n\nBest of luck and you definitely can get through this! Lapses (short term, one-off instances) and relapses (full-blown return to addictive behaviors) can happen. Hopefully not for you, but if they do, consider it a learning experience and part of the process and keep moving forward. For many people, quitting a range of addictions like you are currently working on will be the most difficult thing they ever have to do. Congrats on beginning that work.", "permalink": "/r/DecidingToBeBetter/comments/io2rtf/i_am_13_days_without_cigarettes_weed_or_alcohol/g4c4iyg/"}