{"id": "t5_2tand_t3_q694r3_t1_hgalupm", "creation": 1633998386, "origin": "t5_2tand_t3_q694r3", "height": 1, "replied_to": "t5_2tand_t3_q694r3", "down_vote": 0, "up_vote": 12, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Moosycakes", "text": "That's a great journey to decide you are interested in starting on! I have also been trying to get back into reading recently after not being able to read properly for over a decade due to chronic anorexia, it's such a gift to be able to read and it can really open up your worldview.  \n\n\nMy main recommendation is to try and diversify the types of works you're reading as much as you can. A lot of books that are traditionally seen as \"classics\" are very western focused and unfortunately for a lot of people that means missing out on incredibly well written classics and contemporary works that are translated or international. It's a positive thing to read all different sorts of books from all different sorts of authors from all different time periods from all sorts of countries worldwide. Genre diversity can also be really helpful- poetry, short stories, longer books, childrens/YA fiction, memoirs, quality non fiction etc etc... everything will help you with your knowledge and with your reading journey in general. If there's a book everyone thinks is \"trashy\" but that you love or are interested in, don't not read it because other people are too pretentious for it. There are no bad books if you enjoy them. And don't be afraid to give up halfway through a book if you hate it either- give it a chance but if you're dreading reading time because of it, it's not worth it (or maybe it's a book for a different stage of your life and you can always come back to it later).  \n\n\nIt's also a good thing to note that starting with older classics may be quite difficult and put you off because the further back you go, the further removed the vocabulary used gets from everyday speech which may mean the books are more difficult to understand or you may need to pause your flow of reading to look up what words mean or check annotations etc. One way you can work on this is by starting with modern books you're interested in and then move in backwards chronological order so you're getting more and more older vocabulary knowledge with less difficulty, more contextual clues, and having to pause your reading flow less often which can be helpful in facilitating your enjoyment of the process.  \n\n\nI know a lot of people like the GoodReads website to track the books they've read, post/read reviews and set goals for their own reading. I personally don't like to use GoodReads because it's owned by Amazon so I use the StoryGraph website/app, it's really clean and simple, gives you statistics, has a decent userbase and also has some really good reading challenge lists.  \n\n\nIf you really like short stories then that could be a great place to start for you but I would also suggest trying some medium sized novels (\\~300 pages) as well especially to start off with as it can be motivating to have a longer story where you are more able to get invested in the characters and the story. Some people like to listen to the audiobook version while reading a novel especially if they're just starting or are finding the process hard. Audiobooks are also great for your reading journey while working around the house or on your commute, they're also great for people with dyslexia or visual impairments.  \n\n\nIf you want to read multiple books at a time, figure out a system that works for you. Some people like to read a fiction and a nonfiction simultaneously but can't do two fictions, while others like to have a classic and a summer chick lit read on the go at the same time. And some people like to just have one book to read at a time. It's personal preference and you'll be able to figure it out for yourself with time what works best for you!", "permalink": "/r/DecidingToBeBetter/comments/q694r3/i_have_decided_that_i_want_to_be_wellread_and/hgalupm/"}