{"id": "t5_2tand_t3_oqqbf5_t1_h6d6km8", "creation": 1627135216, "origin": "t5_2tand_t3_oqqbf5", "height": 1, "replied_to": "t5_2tand_t3_oqqbf5", "down_vote": 0, "up_vote": 20, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SetchSetchster", "text": "Please talk to a doctor before you do anything. These are good questions, but big questions. This is a big reason therapists emphasize the importance of meds AND counseling for successful treatment. It isn’t worth going back to suffering. However, you can talk to a doc or psychiatrist about how you’re feeling and talk about your options. Do not under any circumstances take yourself off without guidance from a medical professional Serotonin Shock Syndrome is a very real thing, and it can alter your life forever (muscle spasms, tmj, tics) or even kill you.\n\nEdit: I say this because I empathize with your pain. I know the feeling of safety from what feels like you. You are not defined by your mental illness or your suffering. It only controls you if you decide it does. It is up to you to seize control. I was misdiagnosed as having general anxiety disorder and depression for years and the meds didn’t help. I continued pushing treatment. I wasn’t getting anywhere. I took myself off meds (led to potentially permanent tmj) and spiraled, and became addicted to drugs to cope. After 8 years I finally saw a true psychiatrist, and was diagnosed with Bipolar disorder type 1. I’ve come a long way since starting mood stabilizers along with SNRI’s. I continue therapy because it can be overwhelming. Life is hard, but it’s up to us to seize control. You are more than your past. You are more than your illness. You are more than your thoughts. You are more than your mistakes. You are you and that isn’t defined by anything but your character. You can make choices to change what you’d like. Humans can change. There is always hope for a brighter tomorrow.", "permalink": "/r/DecidingToBeBetter/comments/oqqbf5/is_there_a_possibility_of_returning_to_the_state/h6d6km8/"}