{"id": "t5_2tand_t3_oa8hgx_t1_h3gvid2", "creation": 1624991409, "origin": "t5_2tand_t3_oa8hgx", "height": 1, "replied_to": "t5_2tand_t3_oa8hgx", "down_vote": 0, "up_vote": 16, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Hipoteticamentee2", "text": "Way to go! I made the same decision about 5 years ago, when I was halfway through my college years, and all I was doing was staying home playing video games with my roommates. I was always self aware that I wanted more from my university life than that, especially in the social department, I would always envy my peers getting together, going out, getting drunk, telling stories about their crazy nights, and they would never invite me to hang out, nor would I feel welcomed if/when they actually did. I would never have anything new happening in life, still a virgin, no prospects at all...And even my grades were getting affected by my constant gaming. So my self confidence hit rock bottom.\n\nSo I made the decision of joining a student association in my uni, where I didn't even know anyone, but I felt like it could be fun. And oh boy it was. It helped me come out of my shell. At first I was still a bit socially awkward, but little by little I started getting more comfortable, and it really helped me fight my shyness. It didn't take long at all before I made a lot of friends, my peers started inviting me to fun stuff, and I was living the social life I was dreaming about a few months before, and even scoring some hookups which I previously thought would be completely out of my league.\n\nAlso, by not having as much spare time thanks to this, it helped me organize my schedule much better. My grades went back up, and I even started practicing sports regularly. Needless to say, my self confidence levels were the highest they had ever been. Not even 1 year after my decision of quitting games, I was a completely different person already, and a much better one.\n\nA few years later I quit the association because I had to settle down from the party life. I graduated, got a good job immediately, and now I'm living a good, balanced, healthy life, with fun hobbies, sports, friends, all that's left is some therapy to deal with some past stuff, which I plan to start soon.\n\nEvery once in a while I might sit down to play some game, but I seriously get bored before even 1hr has passed.  \n\n\nMy number 1 tip for anyone looking to get out of the grip of gaming addiction would be: Think of some sport you would like to pick up, and do it, and remember there are hundreds of sports out there which you haven't even thought of, and are super easy to pick up (Squash, padel, combat sports, just hitting the gym..., etc.)\n\nGood luck to everyone!", "permalink": "/r/DecidingToBeBetter/comments/oa8hgx/after_wasting_literally_all_my_life_playing_games/h3gvid2/"}