{"id": "t5_2tand_t3_oa8hgx_t1_h3oahja", "creation": 1625141779, "origin": "t5_2tand_t3_oa8hgx", "height": 1, "replied_to": "t5_2tand_t3_oa8hgx", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Moonfrog9", "text": "Well, symptoms confirm that there is a root cause, but not necessarily which one(s). \n\nSo I'm no medical professional, but here's what I think. Symptoms are like hints to a riddle. Sometimes the answer is easy and medical diagnosis can be confirmed, like with heart or lung issues. Other riddles, like in psychology or psychiatry, require the doctors to guess based on the hints, and never get a definite answer -- just the best guess that science offers us so far, because the brain is still such a mystery. Some disorders  seem like easier bets due to their distinctness. Either way, it's a lot easier to treat a patient with a prescription than to tackle the complexities of how much cultural norms or other abstract social/personal factors have contributed to their symptoms.\n\nSo from there the question is, in the case of a person's attention deficit, how much are the symptoms coming from the person's nature, and how much is coming from their nurture, their environment? Not so easy to say for sure. Were they born like that or did society instill it? Is it that some kids only become restless and inattentive because they are made to sit still for 5 hours a day of uninspiring lecture, while other kids are just born excessively inattentive and need medication? Which kids are which, when they show the same symptoms? Do emerging technologies like smartphones or social media change us to be less focused? How much or how little? To what extent do we know of recent technology's affect on us when it's still new? How much do we care? It's all still a mystery, so yeah, it's an interesting time to human.", "permalink": "/r/DecidingToBeBetter/comments/oa8hgx/after_wasting_literally_all_my_life_playing_games/h3oahja/"}