{"id": "t5_2tand_t3_oa8hgx_t1_h3gvon3", "creation": 1624991485, "origin": "t5_2tand_t3_oa8hgx", "height": 1, "replied_to": "t5_2tand_t3_oa8hgx", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "neueme", "text": "I'm not disagreeing that gaming *can* be an unhealthy addiction. I'm saying that making that determination can only be done on an individual basis, and you're trying to make a generalization instead. You write in a way that lumps together gaming as a serious hobby and gaming as an addiction-- like unless someone *barely* plays games (ie, not daily and not for a long time), they have a problem. But that's just not true--you're over-generalizing. Not everyone is into other hobbies like painting, but they *like* video games. And that doesn't automatically make them an addict. If you know they're an addict, you can infer they play too much/ excessively and they don't play for fun. But generally you can't infer from how much someone plays that they are an addict and don't actually enjoy playing; even if it's close to all day every day, it may be that they work in video games. \n\nSo too you assume gaming is a meaningless hobby, but many games involve some kind of creativity and self-expression. A person is creating and playing a character, or navigating through difficult situations, etc. It's not as though games are completely passive entertainment. \n\nAs i said in my first comment, you assume some hobbies are productive and thus worthwhile, and others aren't. But they're hobbies. What does it matter if, or what, they produce? Most people don't like my drawings, or music, or poetry etc. I don't care. It's fun and relaxing for me and I enjoy it. I spread my time among a lot of hobbies. Some people have just one or two. And that's OK. People should do whatever fulfills them.\n\nNote that there are gamer communities where they can share the cool characters they've created, YouTube videos where they share how they figured out an effective way past a tricky point. How is that *not* bringing joy to other people by making their life easier? They make friends with other gamers through the hobby and so forth. For plenty of gamers, it's a fulfilling--not numbing-- hobby", "permalink": "/r/DecidingToBeBetter/comments/oa8hgx/after_wasting_literally_all_my_life_playing_games/h3gvon3/"}