{"id": "t5_2tand_t3_oa8hgx_t1_h3ig8xd", "creation": 1625017929, "origin": "t5_2tand_t3_oa8hgx", "height": 1, "replied_to": "t5_2tand_t3_oa8hgx", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "thehangofthursdays", "text": "Edit:  OP has [way bigger issues](https://www.reddit.com/r/gayspiderbrothel/comments/o1kl2h/this_is_real/h22w8k8/?context=3) than gaming, namely having fallen deep into the [white nationalism recruitment trap](https://www.vox.com/policy-and-politics/2019/4/9/18296864/gamer-gaming-white-supremacist-recruit).\n\n~~That's awesome!~~\n\n~~I think it's important to think of it less as \"I want to spend less time gaming\" and more like as \"I want to spend more time experiencing the world/out of the house,\" like you mentioned in your post. You game for a reason — for dopamine, for a sense of accomplishment, for a sense of community/social connection, etc etc — so you'll need to find activities that fill those voids in order to succeed. For example, you can't replace gaming with studying... but you CAN replace eight hours of gaming with an hourlong nature walk with a friend and maybe an hour working on a jigsaw puzzle or another challenging (but analog) activity, and that will give you more time in your day for studying etc. Restated, you have to fill that hole gaming left with something that also feels good in a similar but better way.~~\n\n~~With that in mind I think you are on the right track!~~\n\n~~I also wouldn't beat yourself up too much about college exams — if you go to a competitive high school this can be hard to remember but being headed for any college or technical school is a big accomplishment, and what you do and who you become in college is far more important than where you go. Just avoid colleges where the four-year graduation rate is lower than the acceptance rate or that are outside of your budget (if you're from a country where you have to pay) and you should be fine.~~", "permalink": "/r/DecidingToBeBetter/comments/oa8hgx/after_wasting_literally_all_my_life_playing_games/h3ig8xd/"}