{"id": "t5_2tand_t3_oa8hgx_t1_h3h685x", "creation": 1624996092, "origin": "t5_2tand_t3_oa8hgx", "height": 1, "replied_to": "t5_2tand_t3_oa8hgx", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "RiceBang", "text": "1. Understanding your first point is important when considering treatment. I'm arguing in benefit of addicts in this conversation, just so we're clear. Because I believe most addiction stems from a mix of ignorance and untreated mental health disorders. \\*\\*Note: most\\*\\*\n2. Sadly you have to rely on anecdotal data here, which validates my point and explains why we have to fight so hard to reach common ground on this issue. Not just us, but everyone, for an entire century.\n3. Of course not! I think that when people find themselves an addict, there is often an underlying cause. And again, identifying that cause is the first step in treating it. \n\nUltimately there is no data to conclude that marijuana has physically addictive properties. So why delude ourselves into believing it is addictive, when clearly the issue lies inside our brain. \n\n&#x200B;\n\nIf the issue was with the drug, people wouldn't be in denial. This obviously does not apply to abuse of physically addictive drugs.\n\n&#x200B;\n\n\\>Learning coping mechanisms for when you feel cravings, mitigating those feelings by distraction and ultimately consuming something which has LESS of a negative impact on your life is the way to go.\n\n&#x200B;\n\nAddicts know this, but can't stop. Their inability to perform executive function in a neurotypical manner is null. If this was not the case, they would not abuse drug(s).\n\n&#x200B;\n\nFor you, the intoxicating nature of how you felt specifically while under the influence of marijuana is what drove you to use more. For me, the nature of how I felt is what drove me to keep living. We are not the same, our brains are not the same, not all addicts are the same. And we can agree on that point.", "permalink": "/r/DecidingToBeBetter/comments/oa8hgx/after_wasting_literally_all_my_life_playing_games/h3h685x/"}