{"id": "t5_2tand_t3_nccz9w_t1_gy74gwc", "creation": 1621070065, "origin": "t5_2tand_t3_nccz9w", "height": 1, "replied_to": "t5_2tand_t3_nccz9w", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "KireinaXSerenity", "text": "I have shared this same thought process myself. Let me pass down to you my life changing realization. I was hung up on being afraid of change, and wishing I could snap my fingers and just be where I want to in life. Unfortunately change is a result of work... I often spent many days over stressing about needing to change that I forgot to actually start doing the change. It’s all about baby steps and adjusting to where you need to be over time. Fulfillment will come the moment you step out of your comfort zone. Personally, I started slowly becoming more engaged and becoming more persistent with all things in my life that need work to them. For example, I needed a job and slowly started searching and applying, the more I put into doing it, the more unstoppable my mindset became. After a few interviews here and there, my work wasn’t for nothing, as the job I have now practically came to me. It’s about putting thoughts out into the universe. “Manifesting” some people might say. Have the “do or die” mentality.\n\nOn the discussion of becoming fulfilled with who you are, realize you are a person with a heart that’s worth beating. You have your own goals, aspirations and talents. Enjoy the little things and learn to appreciate yourself. If that isn’t enough, start making advances towards the person you want to be. Learning how to handle responsibilities, is a talent in itself. Everyone is always learning to handle and take on new responsibilities. How I go about handling them is keeping them all in front of me and in my line of sight, and slowly dishing out to them each equally, or to the ones that are more of a priority in the moment. The guy who knows how to juggle first had to learn how to pick up the ball and throw it... start small and soon you’ll be able to multitask any given situation. \n\nTo end off, the majority of people are constantly learning and improving, I don’t think there is any definitive line to be drawn on where you’ll be all grown up. People in their 70’s are still learning new things and growing as people. Try to focus hard and work hard on your goals. Don’t give up, you’re only 21 and there is plenty of time in your life for change and growth, it is never too late. Stay positive and enjoy the journey, no matter the pebbles or boulders in your way. Stay strong and live on. Best of luck friend :)", "permalink": "/r/DecidingToBeBetter/comments/nccz9w/how_do_i_become_more_independent_and_comfortable/gy74gwc/"}