{"id": "t5_2tand_t3_odg5xy_t1_h40bj89", "creation": 1625392049, "origin": "t5_2tand_t3_odg5xy", "height": 1, "replied_to": "t5_2tand_t3_odg5xy", "down_vote": 0, "up_vote": 16, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BocaDeCaca", "text": "Fellow homo here! People find all sorts of reasons and justifications about why they don't like someone/something, and cling onto it even if it's flimsy, because it's easier than evaluating their own feelings and reaction to it. I realize we're not getting the full cinematic experience of what's going on just by this post, but it sounds like it's one of those. Throwing out that they \"don't get why it has to be about you all of the time\" sounds like a constructed thing in their head that they applied to you because they are uncomfortable with you being gay, having a partner, living elsewhere, whatever it is going on in their brains. So by painting you as self-focused, attention-seeking, or any sort of negative quality, it keeps them from turning inward and possibly seeing the wrongness of their own reaction by projecting them onto you. \n\nAnd all of that considered, I think it's okay if you don't want to go out of your way to make them a part of your wedding when they have already put negativity into it, and it's nowhere close to the date yet! If you feel safe talking to them about it, I think it could be helpful to figure out how they're feeling and saying how you feel, too. Maybe it could change something, and if not, some find peace in simply speaking their minds. If you don't want to navigate that(say, because past experiences and patterns of behavior point to it being a waste of energy), then just put that energy into the people that support you and are happy for you! At the end of the day, we can't convince people who we are when they are committed to misunderstanding us. \n\nAlso, congrats to you and your partner! And I wish you guys all the future happiness, love, support, and all that sappy jazz!", "permalink": "/r/DecidingToBeBetter/comments/odg5xy/parents_dont_want_to_attend_my_wedding_because/h40bj89/"}