{"id": "t5_2tand_t3_odg5xy_t1_h41uau0", "creation": 1625424771, "origin": "t5_2tand_t3_odg5xy", "height": 1, "replied_to": "t5_2tand_t3_odg5xy", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lillyflower716", "text": "First of all, CONGRATULATIONS!!! 🎊 I'm so happy for you! Second, I 100% agree with practically everyone here is saying. YOU'RE getting married, this day is about YOU (and your S.O.)! There's nothing wrong with that and no, that doesn't make you a bad person. It's incredibly sad that this is your family's reaction rather than be happy for you, celebrate in your joy, and be a part of it. That's how it should've been. But at the end of the day, their choice not to come, is going to haunt them as they're the ones that are going to deeply regret it as they're the ones that will be missing out on one of the greatest milestones in any child's. \n\nCouple things I've learned the hard way; is that at the end of the day, you can't make everyone happy and you shouldn't have to sacrifice your happiness for anyone else. That's why you gotta just do what makes you happy regardless of what anyone thinks. Second, although I know it's your family and it hurts, the truth is you have a new family now and that is with your partner. Ya'll are forming your own family and if your folks want to be a part of it that's great, and if they don't then oh well that's their loss. I went through something similar with my family and looking at things through this perspective is what helped me get through it, and helped it be less painful. It's just me, my fiancé, and my dog for now! I hope this helps you as it has helped me. \n\nYou do you and keep that date! Get married and enjoy the beginning of the rest of your life! Don't let anyone or anything ruin this beautiful occasion/experience for you! I hope it all works out! Wishing you all the best! 🤍👰🏻‍♀️💕👰🏻‍♀️🤍", "permalink": "/r/DecidingToBeBetter/comments/odg5xy/parents_dont_want_to_attend_my_wedding_because/h41uau0/"}