{"id": "t5_2tand_t3_4j4ih2_t1_d33qngm", "creation": 1463120397, "origin": "t5_2tand_t3_4j4ih2", "height": 1, "replied_to": "t5_2tand_t3_4j4ih2", "down_vote": 0, "up_vote": 17, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "My very non-professional thought is that you are complacent because you think there is a \"real you\" or dream career that you can find through introspective thoughts during your free time. \n\nI fumbled through enough jobs that I hated, quit, and tried something else. You're not unique in not having a clear path at 24 years old, and thinking that you're \"aging\" in the sense of your career options being limited is, I think, a bad path for you to go down.\n\nGrad school could very well give you a better perspective on what you enjoy, or it could give you a bunch of anxiety as you go into debt as you think you need to find an even more niche job that you'll love. \n\nIn the \"if you have a hammer every problem is a nail\" vein, you actually sound fairly well-suited to my profession: political campaigns. \n\nI do a wide range of research, from public policy to opposition research. But, during the course of a political career you knock on a ton of doors and try to get people to support your candidate. You recruit and maintain relationships with your volunteers. You think strategically on messaging, data and staff-management. It's exciting because you're in direct competition, and the insane hours make you feel very alive and like you are having an impact. \n\nThe pay starts pretty poorly ($2-3,000 a month) and the jobs are very temporary. But, it's really exciting to have to find a new job and a new adventure every 6-12 months. \n\nAll that to say, if you enjoy those things, go look for industries that have those components. Work for a non-profit, go look for startups that need someone who can do outreach who might hire you because of your language skills. \n\nYou're 24. You can take some risks and not have them destroy your future. The most exciting time in my life was when I was bouncing around the country working on shitty races and having to do manual labor for a few weeks in-between to afford gas money to get to my next one. I have a much more stable job now but I legitimately miss the uncertainty that accompanied the early parts of my career. \n\nWarning: the empty bottle of rye next to me does exhibit our proclivities for becoming booze-hounds, fair warning :) ", "permalink": "/r/DecidingToBeBetter/comments/4j4ih2/hate_my_job_escorting_on_the_side_so_i_can_move/d33qngm/"}