{"id": "t5_2tand_t3_nhn34u_t1_gyy6ywx", "creation": 1621608894, "origin": "t5_2tand_t3_nhn34u", "height": 1, "replied_to": "t5_2tand_t3_nhn34u", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "gafflebitters", "text": "Thank you for reaching out with your problems, I find often this is the hardest thing to do because as you said i believe, sometimes when you reach out to people you get hurt and that has been the thing that has crushed my soul more than anything else.\n\nI have learned, people do care, people have been exactly where i have been. They have put their head down and just focused on their breathing and putting one foot in front of the other and in a little bit, when they raised their head, they noticed a calm in the air, a little sunlight breaking through the dark clouds. NOTHING  is permanent in life, the good things and the bad, everything changes but it can be very difficult to picture this in your current state of mind and so, that is where i learned to reach out to certain people.  \n\n\nOne of my problems was i kept reaching out to the \"wrong\" people. People who did not have the skills, patience, knowledge to help me, my bike was broken, i kept taking it to my dad who had no tools or time to fix it and he kept saying \"get lost kid! I got problems of my own, your bike is broken? i got REAL problems here, how am I gonna pay the rent and bills?\" This did not mean they were a bad person or did not love me- which of course was the very next thoughts in my head. It meant I needed to look elsewhere. \n\nGuess when it is the hardest to ask for help?\n\nIt is when i am \"sad, confused, and lost and i feel like the odds are against me\". You did it! you reached out!  I have an inspirational fridge magnet that is so humble and yet so profound and it says \" success comes before you reach your goal, for it is a simple as taking a step in the right direction\" . You have experienced success! you have taken the first step in a positive direction, the hardest one, hopefully they will come easier after this.\n\nReach out, listen to others, rely on their experience and strength, we are not meant to go through this world alone, we are supposed to work together and just because you found some people who cannot help you and have no strength to share at this moment, keep looking, people are all around you and they want to help.\n\nMessage me if you want to talk.", "permalink": "/r/DecidingToBeBetter/comments/nhn34u/i_feel_sad_confused_and_lost_i_feel_like_the_odds/gyy6ywx/"}