{"id": "t5_2tand_t3_nhn34u_t1_gyx9td4", "creation": 1621587555, "origin": "t5_2tand_t3_nhn34u", "height": 1, "replied_to": "t5_2tand_t3_nhn34u", "down_vote": 0, "up_vote": 56, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "RLJ05", "text": "This sounds really tough, but I know you can get through this. You already took one great step, writing this out and asking for help. It sounds like the root issue at the moment is not being able to find a job, I think you should 100% focus on that fully in the short term. Once you get a job you can get a little money and start to be more independent from your parents, who are not helping.\n\nMy parents also didn't help me, one died and the other was too poor to help me with university, so I understand a little. I think your situation is harder because it sounds like your dad doesn't want to help you, but he could, so that really sucks. I'm sorry for you man. Anyway, my point is, doesn't really matter why your dad won't help, if he won't, you just got to move on from that and focus on you and what you can do for yourself.\n\nGetting a job will help with money, but also with your confidence, anxiety and general mental health. Many people struggle to find a job, it's a very common thing, especially if this is your first serious job. It is hard, it's a numbers game. You have tried 3 times, go out there and apply for 3 more, heck go out there and do 10 more. How about you set yourself a challenge to apply to one job per day for the next 2 weeks! Just keep trying, it'll work out for you.\n\nIf you need any specific advice on how to apply for jobs or what to say on an application form, PM me, maybe I can help from my own experience in the job market.\n\nAfter working for a few months, then I would reassess, do you want to keep working, or go back to school. At that point it'll be an easier decision because you will be in a better position to compare the two choices, and in a better position to pay for it.\n\nGood luck man! Make sure to post on here when do get a job, I'm excited to hear about it", "permalink": "/r/DecidingToBeBetter/comments/nhn34u/i_feel_sad_confused_and_lost_i_feel_like_the_odds/gyx9td4/"}