{"id": "t5_2tand_t3_nhn34u_t1_gyz4yv6", "creation": 1621624158, "origin": "t5_2tand_t3_nhn34u", "height": 1, "replied_to": "t5_2tand_t3_nhn34u", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "-AngryChinchilla-", "text": "I have many Chinese friends and they have told me that there is a crazy amount of pressure on young asian people and i’m sorry you have to deal with all that. A little bit about myself, I went through a very abusive childhood due to my step-father and it left me with many issues including the fear of never being good enough. I wanted to prove to everyone that I was smart and would be successful so I applied to college and got a 30k student loan even though I didn’t have a genuine interest in what I was studying. Long story short I never finished. I started working full time and it wasn’t until 26 (the age I am now) that I figured out what I really wanted to do and now I am back in college with another student loan. I know where you are from the parents are expected to pay, but if your father is being unsupportive then you may need to take matters into your own hands. In society we are expected to have everything figured out in our early 20’s and that never happens even if others appear like they have figured it out. Usually everyone changes paths at some point in their life in regards to work. I also have a problem with over sleeping and not eating enough, we sound very similar. Anyways I truly think you will break out of this shitty part of your life. Keep applying for jobs, save your money, study what you’re passionate about, stop worrying about everyone else because your path is individual to you, and in a couple years I promise you will find where you fit and be a happier person. I’m not going to say it won’t be hard, but life is harder for some people and in the end they learn the best skills from it.", "permalink": "/r/DecidingToBeBetter/comments/nhn34u/i_feel_sad_confused_and_lost_i_feel_like_the_odds/gyz4yv6/"}