{"id": "t5_2tand_t3_nhn34u_t1_gyxtf2h", "creation": 1621602313, "origin": "t5_2tand_t3_nhn34u", "height": 1, "replied_to": "t5_2tand_t3_nhn34u", "down_vote": 0, "up_vote": 16, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "iboojenny", "text": "Hello lovely, I am sorry this is happening to you.  \n\nI want you to know that you aren’t alone. I’m 29 now, but believe me when I say I was in the same exact situation you were-grew up with my sister except it was my mom who got custody of us.  \n\nShe didn’t raise us so much as “have us”. She was physically abusive up until my sister and I were about 12, when she knew couldn’t hit/belt us anymore. That’s when she became emotionally abusive and manipulative (depending on her mood and how well my sister and I would get along with each other she would sometimes cause a rift between us on purpose). She was always negligent-being a single mom, she worked a lot and this made her frustrated with her life, so on her days off, she would spend all day in her bedroom. ALL. DAY. She would watch TV all day and have all 3 meals in there while keeping the door closed. She did not want to spend time with us.  \nDon’t get me wrong, there were some good days where she would take us to the mall...but most days consisted of her dissociating from being a parent. This was very confusing for my sister and I as adolescents.  \n\nI was parentified at the age of 7. I cooked meals for myself, my sister, and packed my mom’s lunches for work. I was also expected to follow up on chores in a way that my younger sister was not (I’m older by a year a couple months). My mom did not cook or clean as her philosophy was “I pay the bills, you earn your keep by doing everything else”.    \n\nTo this day, my trauma still affects me. I’m in therapy (it’s been 3 years now) and I currently unpack a lot of things from my childhood) so that I can heal and move on from it and begin a new chapter in my life. I just want you to know that with this comment thread, YOU are NOT alone.  \nIt feels like it right now. I’ve been there. I remember feeling so hopeless and I remember having no concept of mental health, yet mine was hanging on by a *string*.  \n\nThe saying goes “people throw rocks at things that shine” but they never told you that for some people, your own family would be the ones to cast the first stone. You’re so young, and I know what I’m saying is cliché but it DOES get better. I remember being in your place and other people telling me the same thing and I still felt hopeless.  \n\nImagine there is a version of yourself holding onto this light inside of you that *refuses* to let that light go out. You are so much stronger than all of these external factors malfunctioning and disfunctioning around you. You have to still be you no matter what. Yes, your dad just like my mom are both unsupportive. It is something we have to accept. This is a hard pill to swallow. You are wonderful, amazing, and ambitious. No one can take that from you.", "permalink": "/r/DecidingToBeBetter/comments/nhn34u/i_feel_sad_confused_and_lost_i_feel_like_the_odds/gyxtf2h/"}