{"id": "t5_2tand_t3_qbx2td_t1_hhfqz3h", "creation": 1634779033, "origin": "t5_2tand_t3_qbx2td", "height": 1, "replied_to": "t5_2tand_t3_qbx2td", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rocksteady2R", "text": "steady, plodding steps forward.   it's really teh only answer that works for most folks.\n\n* set goals, pursue goals.  \n\n* take a few weeks to pencil out a \"3-5 year life plan\" (google it.)   Even if you decide not to pursue it, it can highlight areas of your life and things you want to focus on.   again- two weeks to do this, use all your silliest whimsical thoughts - you can rule them out later in the process.  \n\n* /r/theXeffect .   this system.... fuck man... learned about this system a few years ago and it just struck a chord.  I did it fairly hard-core for the next few years.   last two or so not so much, but that's because I'm cruising fairly well.  changed my life.   take a look - might work for you, might not, but it's simple as hell.  \n\n* I joined a men's group 2 years ago.  let's me talk out my emotions & thoughts about  failure, drive, fears, shame....... whatever.. **All** of it.  now-a-days, if I notice myself start to slack on a goal/plan/hope/dream/feeling/process, I can talk it out in the group and regain my good perspective on it.    My men's group is called the [Mankind Project](https://mankindproject.org/), and there is a sister organization for you ladies called [Woman Within](https://www.womanwithin.org/).  Don't be fooled by the belief that someone as young as you cannot need this - it's... life changing, again.  I won't ever go back to not handling my thoughts and fears.  \n\n* a step own from support groups... or... well... let me say - it's a different animal, at least - Accountability groups.  if you're in a big city, you can likely find business/school/hobby accountability groups where you simply get together an report what you did on your goals and what you didn't.  I have only been to 3 and they seem useful enough.   I simply have enough on my plate; that was an example of me spreading myself too thin.  I get enough accountability out of MKP.  \n\n\nanyhow.  that's what I've got for now.  good luck!", "permalink": "/r/DecidingToBeBetter/comments/qbx2td/im_terrified_of_my_extremely_average_and_lazy/hhfqz3h/"}