{"id": "t5_2tand_t3_qbx2td_t1_hhejc7n", "creation": 1634760010, "origin": "t5_2tand_t3_qbx2td", "height": 1, "replied_to": "t5_2tand_t3_qbx2td", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Admirable_Example131", "text": "Atomic Habits seems to be mentioned quite often, but another one I could recommend is [Four Thousand Weeks: Time Management for Mortals.](https://www.goodreads.com/book/show/54785515-four-thousand-weeks?ac=1&from_search=true&qid=0IOtmdo3vc&rank=1)  \n\n\nThe book isn't about scratching everything off your to-do list, but quite the opposite. It helps bring to light that the average person only lives about 4000 weeks in their lifetime. You can't do everything, but with such little time, perhaps its worth doing some things. I would recommend reading the summary for the book and some of the reviews left by others!  \n\n\nI used to be in your shoes, wanting change but never acting on it. Waiting for that spark. Fortunately, I was able to travel and meet people from all different backgrounds (work and culture) that gave me some motivation. But that motivation was really just awareness. I started reading and listening to some books regarding Mindfulness to start (i.e. Habits, Escapism, Leisure, Time, Self-Deception, Addiction, Growth Mindset etc. etc.). Each chapter I read brings more awareness and more connections that inevitably bring me to living more in the present time and not so much in my head or through  a screen. In the past year alone I've went from being a college dropout working non-career oriented jobs to self-studying my butt off and making x3 more than I ever have before while also exercising, eating healthier, and sparking conversations with strangers. Sure there's always things that I'd like to have accomplished during the day, but I'm no longer lying in bed tonight thinking about all the things I didn't accomplish. Think about a pixel on your phone and how tiny it actually is. Imagine putting enough pixels together to form your phone or laptop's screen. That's a heck of a lot of pixels! Millions even! Now doing small tasks you set out for yourself each day. Get the big picture? (heh).   \n\n\nAlso, it's amazing how the brain works the more you read about it. How much control we do and don't have. How much being aware of what the brain wants/doesn't want that isn't actually good for you(or is!).", "permalink": "/r/DecidingToBeBetter/comments/qbx2td/im_terrified_of_my_extremely_average_and_lazy/hhejc7n/"}