{"id": "t5_2tand_t3_qbx2td_t1_hhepg1e", "creation": 1634762425, "origin": "t5_2tand_t3_qbx2td", "height": 1, "replied_to": "t5_2tand_t3_qbx2td", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kylexx343", "text": "What changed me was making normal things slightly harder. I was same boat super ambitious then just gave up in highschool had a 2.1gpa etc. one summer my moo said I probably couldn’t change even if good grades were just handed out, I took that as a challenge. I started by making every day things a little harder by adding exercise in my life(when going up the stairs I did lunges, when walking to my bedroom I did push-ups) then I wanted to challenge myself and read a little here and there. School came I started to spiral again but I had made so much progress I didn’t want to lose it. I did my homework the day it was assigned every day even if I had to skip being with friends because I knew that if I did this now in a few years it would pay off. So I kept studying, reading, working out and adding more and more challenges to complete daily as if my life was the video game. I used psychology on my side and made sure I completed little things that were rewarding first etc etc. i Graduated highschool with a 4.44 in the end. I wasn’t done though since I wasn’t doing college I had to find work. The good grades and new found work ethic landed me my current position making 50k/year at 18 which was astounding. Now ofc I want to keep progressing so I add little challenges daily to help me feel better. Best part is now that I have found a well paying job for my age I can stress less about things like money and what not and go hang with friends much more than I could when I was letting my work pile up.\n\nOverall that was my little anecdote maybe it’s helpful maybe not but just try to start small even if it’s just making your bed in the morning or reading 5 pages of a self help book. \n\nBest of luck to you, you got this and I am sure you’ll succeed if you keep your mind in the game", "permalink": "/r/DecidingToBeBetter/comments/qbx2td/im_terrified_of_my_extremely_average_and_lazy/hhepg1e/"}