{"id": "t5_2tand_t3_ocf98t_t1_h3uh0mf", "creation": 1625256662, "origin": "t5_2tand_t3_ocf98t", "height": 1, "replied_to": "t5_2tand_t3_ocf98t", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ashishpayasi", "text": "Here is a huge hug for you! \n\nEveryone is unique, like fingers in our hands. Each finger is beautiful and it may be a strong like thumb or weak like pinky finger, but each one is important and none can be compared. Now to bring smile to your face, just imagine if your hand had all fingers as thumb itself being that strong one would you want that, i guess not. \n\nNow typically this feeling of comparing starts somewhere in the family and while you were growing up. Someone compared you and you did not like a bit and that journey continued for many many years and your subconscious mind was programmed that you are not good enough. It was a very bad thing someone did and we cannot go back in time to fix that. But there are two methods in which this can be fixed\n\n1. Using Emotional Freedom Techniques (EFT) you can resolve this, you may need an EFT practitioner to help you with that, you can learn your self as well but it’s better if you take help of expert. \n\nWhat is EFT, like the name suggests, we all are woman / man of emotions . What we become is what emotions triggered in us from time to time to make us like this. What is an emotion, a emotion is a feeling of guilt, fear, anger, happiness or a combo. This is triggered when something uneventful happens and if it is repeated over an over it becomes a scar and makes us the people we are. So EFT allows us to recognise that there is this trigger and trapped emotion that needs to be released and once you do it, it will no longer bother you. Its not psychotherapy and this does not even need medication, but its responding to series of questions, recognising that yes this is a problem, then speaking out loudly that you are really upset and bothered of how this makes you feel and eventually you will realise that this intense feeling with a very high degree of impact will subside. Your Can find more about it on youtube and if you need one to connect to let me know.\n\n2. The second method is bit complex and needs practice and consistently doing and changing behaviour to overcome this. The method is simple its observe your thoughts, when and how they occur, like you observed in getting back to art but to impress others. When you are able to observe these thoughts the next thing you need to do is to tell yourself, you are proud of yourself and you love and accept the way you are. This method is called mirroring image technique. In this instead of some external person your best version of yourself will always be there for you and whenever you feel low or lonely this best version will support you and help you believe in yourself. \n\nThe big idea that you must realise and accept is, you have come to this world alone and you will go alone. When in need you are the only one who will be there to support and therefore you have no obligation to prove to anyone else. \n\nYou must also realise another fact of life which is, everyone else is also fighting the same battle and this its a global phenomenon and you are not alone in this. I am glad you recognise this needs to be attended to and i think that is a great start. \n\nShort story about me: i had leukaemia when i was in grade 10. And before that i used to seek attention and i used to send birthday cards and wishes to everyone, hoping they wll do the same but till class 10 I was always disappointed by others, when i got leukaemia no one asked or came forward to help my family and that day i realised that its not worth trying to impress others, you cannot control their behavior at all and chances are they will disappoint you, those who do not they are rewards in your life. I then took some time to also fix another problem of having expectations from others. I dealt with that at the same time but i forgave everyone one for not being their and decided to be there for anyone who needs help. And so here I am. \n\nWhen you feel strong and happy and are ready to help others do that, help and share love with as many people as you can because the world now has many people who are hurt than those who can heal and we need more healers. \n\nLove and light to you!", "permalink": "/r/DecidingToBeBetter/comments/ocf98t/i_feel_like_my_biggest_struggle_is_comparing/h3uh0mf/"}