{"id": "t5_2tand_t3_pszouq_t1_hdu9r62", "creation": 1632316541, "origin": "t5_2tand_t3_pszouq", "height": 1, "replied_to": "t5_2tand_t3_pszouq", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "greebledhorse", "text": "I encourage you not to see \\*everything\\* related to your fiancé's trauma as a kind of deficit. Trauma is by no means a healthy place to live, or the best way to learn anything, but it does come with its lessons. When your fiancé connects happiness to narcissism, I agree that it's a kind of negativity, but I also see him expressing a strongly held value about accountability. He's clearly seen more than one case where someone's mission to be happy didn't include accountability, so he's learned something really valuable about that. It's like if you said something offhand like, \"Life is always better when you're tipsy ;)\" and he got a 'something's not right' feeling about it, like there's a real danger a statement like that overlooks, and said something about how alcohol can become an addiction. \"Getting over\" trauma doesn't mean the person becomes like a person who was never traumatized, it means that the person has finally integrated their traumatic experiences into a life story they can feel proud of and at peace with. Your fiancé will probably always be someone who *knows* exactly what the 'negative' side of life looks like, and healing will probably look like getting to a place where he isn't having nightmares about it or avoiding social/leisure/work activities because of it. There can be a lot of value in this to you; he has all of the life learning he needs to know not to ever treat \\*you\\* like you don't matter because \"he just wants to be happy, and isn't it so annoying that your pesky needs keep threatening his peace?\" I encourage you to talk to your fiancé more about his perspective, and show curiosity for this negative side of life (without encouraging self-sabotaging *behaviors*)!", "permalink": "/r/DecidingToBeBetter/comments/pszouq/fiancé_is_negative_came_to_a_realization_it_might/hdu9r62/"}