{"id": "t5_2tand_t3_pszouq_t1_hdudmn0", "creation": 1632318396, "origin": "t5_2tand_t3_pszouq", "height": 1, "replied_to": "t5_2tand_t3_pszouq", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "greebledhorse", "text": "Oh hm! Off the top of my head I'm imagining something like, \"Hey, back when we had that conversation about happiness, I said this and you said that, and I'm realizing that I don't actually have a good sense of where you're coming from with that. At first I thought it sounded kind of negative, but I don't think that's all of it. What did you mean when you said that? It sounded really important to you.\" \n\nKind of a tangent at first but - there have been times when people have wanted me to 'get help' for trauma (I'm in a better place now!), but they wanted me to do it *their* way, and then when I resisted that, they were concerned that I wasn't even motivated to help myself. Reflecting on that, and my own real motivation to help myself that people weren't seeing, I've come to see 'true help' like a life raft... everybody who is dealing with trauma actively wants to be in less pain and will actively move towards things that they see floating around that look helpful. If someone who's been through trauma moves away from something, they probably don't see it as the life raft they're looking for, even if the person offering it intends it as helpful. All of that's to say, if you provide your fiancé with a 'life raft' (with good boundaries in place to keep you from being overwhelmed), he will recognize safety and support and come to it on his own when he needs to. I feel like your 'job' is just to be a safe landing, with curiosity about how effective you're being, as your fiancé walks his own journey only he can walk. You don't have to feel and take on all of his anger and pain at having been mistreated by selfish people, you don't have to see the world exactly like him, but if he can share what's going on, that will help him feel safe and heard and known, which will help him carry his own burden.", "permalink": "/r/DecidingToBeBetter/comments/pszouq/fiancé_is_negative_came_to_a_realization_it_might/hdudmn0/"}