{"id": "t5_2tand_t3_89rm30_t1_dwu8gp0", "creation": 1522908222, "origin": "t5_2tand_t3_89rm30", "height": 1, "replied_to": "t5_2tand_t3_89rm30", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "successaddictions", "text": "I know this is coming in almost 10hours late, and I hope it gets to you friend. I will say that you are sailing your boat in the wrong direction, and sure enough you will get to a destination but it will be the wrong one too.\n\nSelf talk as prescribed above helps and has been very effective for many but not when it clashes with deep seated beliefs like the ones you mentioned here. It actually even backfires. The scriptures say \"out of the abundance of the heart, the mouth speaketh\". So if your speaking is contrary to what you believe, it leaves you in confusion and doubt. \n\nWhat you speak about yourself reveals how you see yourself and that's what you need to change. You need to change the way you see yourself friend. This usually takes time, but I assure you its time invested and not wasted. You deserve a good life, we all do, especially those of us that believe we were created by a good God. \n\nIt took me several years to become optimistic about my life from the times when I was suicidal to this point I have reached in life. I actually thought I would drop out of university but behold I completed it, with several incomplete results as expected, lol.. So I dropped out after my final exams. I lived with depression most of the time and became reckless too and It took me seven years to build the desire/will to go back/to sch and funny thing is when I got back, I had several A+ in my results. But then as a regular student, my best result was a \"B\". \n\nI will like to share with you what I learned and how it transformed me without drugs and I hope it can help transform you too. So if you actually read to this point, let me get a reply from you because it necessary you begin the mind shift that will completely change your outlook on life in Jesus name. \n\n\nEdit: its not enough to know what efforts you should put in, its actually a question of whether you believe enough in the person who will be putting in the desired effort (you). If you do not believe in your ability to put in the required effort then what do you expect will happen after some time? You need to work on your believing friend.", "permalink": "/r/DecidingToBeBetter/comments/89rm30/how_do_i_turn_my_darkness_into_light/dwu8gp0/"}