{"id": "t5_2qh1i_t3_dx6y66_t1_f82puoo", "creation": 1574195915, "origin": "t5_2qh1i_t3_dx6y66", "height": 1, "replied_to": "t5_2qh1i_t3_dx6y66", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": ">Hey, I know you’re hurting really bad right now but I just wanted to let you know that you’re strong, you’re worth it and that you are going to make it.\n\nYou don't know me at all, so this entire sentence is at best an uninformed guess. Random compliments from people about traits they could never know I have are an empty gesture clearly only made to talk me out of suicide.\n\n>Maybe not tomorrow or the next day, but there will be a day where life gets a little easier, or you find the right person for you, or get your first pet and the grayness of everything is given a little bit of color, a little bit of light.\n\nLife being ever so slightly easier would not make me feel better. The last week has been far easier than the one before and I still want to kill myself, possibly even more so since nothing is distracting me.\n\nPeople and pets won't help either, I've had both so I would know.\n\n>You can do it. I know it’s hard, I’ve been there. Some days I still am there. But this feeling is temporary. \n\nEverything's temporary. Because we die. Doesn't make it all any less unbearable. \n\n>Reach out for help, even if it’s to a total stranger. Call the hotline, find a therapist or try group therapy. Let your friends in.\n\nI'm already seeing a therapist and I have no friends, so that's not an option. I refuse to call a hotline. They suck.\n\n>There are people who care about you and don’t want to see you gone.\n\nPoor them, it's not about what they want. \n\n>they love you and would have wanted to help you\n\nNo, they actually wouldn't. There are limits to what they'll support and what I want lies outside of it. They love the idea of me, the me I perform so no one knows anything is wrong.\n\n>You are loved more than you know.\n\nI'm loved exactly as much as I know.\n\n>This is your sign to keep going.\n\nThose entire comment is the same twenty points everyone has used to try and talk me out of suicide and it never works.\n\n>It gets better. I mean that. It does get better. Easier. More colorful.\n\nJust because you mean it doesn't mean it's true. You don't know anything about my life, so how could you know that? There could be any possible number of things that will guarantee that my life will remain miserable.\n\n>You are worth it and you are loved❤️\n\nWhat would you have said if I'd replied that everyone I'd ever cared about died years ago? Who'd love me then?\n\n>I believe in you.\n\nI don't, which is why I'm killing myself.", "permalink": "/r/AskReddit/comments/dx6y66/suicide_survivors_of_reddit_whats_kept_you_alive/f82puoo/"}