{"id": "t5_2tand_t3_niuety_t1_gz4055i", "creation": 1621728797, "origin": "t5_2tand_t3_niuety", "height": 1, "replied_to": "t5_2tand_t3_niuety", "down_vote": 0, "up_vote": 11, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "RLJ05", "text": "Hmm if you love it why do you want to stop? I think that's an important question. Most people I would say do these things but they don't love them, but they do them out of habit, or for some other underlying reason.\n\nIf you do want to stop, I think you need to figure out why, for you. You should start by writing out the pros and cons of these behaviours clearly in a list. What are the short term and long term impacts?\n\nFor example for me, a short term impact of drinking is feeling like crap the next day, being tired, then I lose that day, I struggle to work well or exercise. So that's a clear negative. For you it might be different, but either way, go ahead and write these things down. The first step to changing behaviour is to understand it. A positive short term impact is while I'm drinking I have more social confidence and find it easier to have fun with other people, like at a party. So the impacts are not only negative. Either way, write them all down.\n\nIt's good to split impacts into short and long term. Long term are impacts that are caused by the repetition of behaviour. Sometimes these are harder to see, but can be more significant, especially if you are doing these things regularly. \n\nThe other thing I would advise is to start to think about your values. What I mean by values is what is the type of person you want to be, what are the qualities and goals of that person. For example, only of your values might be the idea that a person should be reliable and able to help others. You can have more than one value. These are things that you look up to when you see them in others and want to see them in yourself. Another example could be to be trustworthy, to be someone that others know will tell them the truth. \n\nOnce you have an idea of your core values, you can then start to look at how these behaviours can impact these too. Does you choice to drink or smoke impact these values, especially in the long term. Seeing this help you make the right choices.", "permalink": "/r/DecidingToBeBetter/comments/niuety/i_like_being_undisciplined/gz4055i/"}