{"id": "t5_2qh5i_t3_2jrdqb", "request": ["fadb5a21-1823-4d18-8225-20eb417448ae", "b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11", "23d40627-ba71-4806-9d30-ac350683ef35"], "text": "Thirty years ago tonight I was sitting in a hotel room learning my lines! I was in a bit of a dither, awash in anticipation and trepidation for the occasion looming on the morrow. I surmise that across town there was a young lady who was a cool and calm as could be, with all plans go. \n\nI felt, and still feel, I might add, the most fortunate of young men, for when I asked her to marry me she neither snorted with derision nor scampered away calling out for help, but said yes. \n\nMy trepidation also may have had something to do with the howling blizzard raging around a city with increasing levels of snow, threatening to close incoming roads, where my groomsmen and ushers were slithering their way to help me get hitched and the airport from which my parents and brother were trying to make a chilly way to assist me.\nI was learning my lines for we had decided to recite our vows to each other, something which may have seemed romantic, but in the cold light of day was something that filled me with no small amount of dread. Mostly due to the fact I am a bit slow and light in the mental department, and felt, perhaps ill equipped to deliver on the requisite requirements of elocution.\n\nWhy had we decided upon a cold day in late October 1984 to hitch our wagons? Well, we hadn't, not exactly. My darling betrothed had, full of foresight and unending amounts of intellect, decided upon a day in early October, knowing full well that the day would be full of early Alberta Fall beauty with mild breezes blissfully wafting across meadows of wildflowers, while our chosen Padre recited the words, man and wife, in strong melodious tones, full of the promise of a new life together.\n\nSo why then was I listening to the sounds of a million raging snow demons trying to knock down the gates to my hovel? in short, the US Air Force, in all it's wisdom had decided that before my embarking to protect the free world, based in the fair country of Germany, from the predations of the Soviet Bear to the East, I would first need to spend several weeks romping through the West Texas hill country, dodging rattlesnakes and scorpions,  playing army guy while various and sundry Rangers and Spec Forces dudes attempted to prevent my completing the school. The dates of said military misadventure happened to coincide with our conjugality, and have resulted in a deep seated and never ending enmity and loathing betwixt my betrothed and said Air Force, for while she was mailing out the invitations to our impeding connubiality she was having to mark out the date SHE had chosen as being the most opportune and auspicious and replace it with the date that had been foisted upon her by the unyielding might of Uncle Sam.\n\nSo we married in Edmonton, in a blizzard of epic proportions, slid all the way to the reception ... and I have to say I don't have good memories of what all transpired that day, except to say that I was besotted with the gorgeous lady that had become my wife.\n\nOur life has been good, not perfect, but very, very good. We have enjoyed many adventures, spent many hours over many miles together, endured problems, raised two wonderful daughters, who, fortunately for them, have taken after their intelligent, articulate and loving Mom.\n\nI am fortunate beyond measure, I am ever in a state awestruck bliss, I adore the beauty that agreed, knowing full well who and what I am, to become my wife. She is still to me the same as when I first saw her 36 years ago, when I look at her I still see the vibrancy and youth that is the love of my life. I look forward to spending another 30 years of adventure with you. My life. I am forever yours. ", "url": "https://www.reddit.com/r/happy/comments/2jrdqb/what_thirty_years_can_bring/", "title": "What thirty years can bring", "social_network": "reddit", "user": "BwanaPC", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 26, "down_vote": 0, "creation": 1413782995, "permalink": "/r/happy/comments/2jrdqb/what_thirty_years_can_bring/", "nsfw": false, "first_save": 1635438926.58893, "replies_charged": false}