{"id": "t5_2qh5i_t3_sqbhh", "request": ["c889a480-189a-4ed9-aa88-81c300413196"], "text": "After years of living in dreadful housing - firstly with an absentee landlord who refused to do any maintenance, resulting in a boiler leaking carbon monoxide into the house and nearly killing us all - and then two more years in a place so small that my wife and four children could barely move - last month I finally managed to buy the house of our dreams.\n\nIt had taken sacrifice, hard work and frugal living to save the deposit we needed, and then the actual process from offer to getting the keys had taken about five months end-to-end.\n\nSo, when we finally moved in, everything was wonderful - this place is so perfect for us you just couldn't imagine.  The kids have their own rooms, we have so much space, great views, a huge basement that contains a full-size snooker table and a purpose-built cinema area - add 100Mb broadband and you have redditor heaven - well, this redditor at least.\n\nAll was great for a few weeks - until I discovered my contract was being dropped.  The bottom fell out of my world and I became convinced we'd lose the house before we'd even made the first mortgage payment.  I'd had to do a dangerous thing to meet some of the costs of moving - use some money earmarked for a tax bill that's due in a few months - and any disruption of income was very dangerous.\n\nBut as soon as my CV went live on the job sites I started getting headhunters call and lots of very positive applications.  I had lots of interviews booked for later this week but today I heard back from the one I really wanted, who've offered me a great role at a great rate.  I start in a couple of weeks and I can pay back Peter as well as Paul, keep the wolves from the door, and hopefully take the family on holiday soon as well :-)\n\n**tl; dr:** saved like mad to buy a great house after years of housing from hell; bought it but lost my job straight after - got a new one today!", "url": "https://www.reddit.com/r/happy/comments/sqbhh/bought_house_of_our_dreams_then_lost_my_job_today/", "title": "Bought house of our dreams then lost my job; today I got a new one!", "social_network": "reddit", "user": "WastedTruth", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 104, "down_vote": 0, "creation": 1335291594, "permalink": "/r/happy/comments/sqbhh/bought_house_of_our_dreams_then_lost_my_job_today/", "nsfw": false, "first_save": 1635441454.9929957, "replies_charged": false}