{"id": "t5_2qh5i_t3_111tgl", "request": ["3fa9d278-6200-4503-908d-5c456f8aa87c"], "text": "I need to express this feeling of complete happiness I have!\n\nSo, to start the story, just to give some background, I was laid off in January this year, and until about a month ago, I had been pretty depressed about my life, where I was, what I was doing (or not doing).  I got a degree in something I don't like doing, and had only held jobs in that area, because \"that was my degree.\" Sadly, I kinda shrunk up and climbed into a bit of a hole.  I closed myself off to the world, thinking that I had lost a lot of value and self-worth.\n\nAs a side-note, I was kinda happy to be laid off, because it was a real wake-up call that I shouldn't be doing that line of work, and it gave me the feeling of freedom that I can do something more valuable with my skills.\n\nanyways, fast forward to a month ago, I got to spend some real quality time with my family and get me out of the funk that I'd been in; it felt like hitting the reset button.\n\nsince then, things have been going a lot better.  I'm back out meeting people, really quality, really smart people.  Putting myself out in the world,  \"doing epic shit\" as one person told me to do.\n\nAnyways, I found the SXSW Eco conference was happening in my town, and decided I wanted to go.  Because the tickets were so expensive, I decided to volunteer as a way to go without having to pay. cool. great. I'm in.  \n\nTHEN a twist happened last week.  I found out that the event was hosting a Hackathon to build new mobile apps based on some cool new datasets being released by the government.  Anyways, it allowed me to get a free pass to the event, and I wouldn't have volunteer for my tag, so I signed up for the event and got my pass.  One thing to keep in mind, I have never built an application in my life, before this event I had about 10 hours of actual programming/development experience under my belt.  \n\nBecause of that, I got a lot of \"why are you doing this? You're not a developer\" questions leading up to it.  I  thought that to myself as the event got closer, but I said to myself, \"I'm just going to go to the event and see what I can do, I'm a smart guy, I'll figure it out.\" In preparation, I decided to take a crash course in java programming.  I used Codecademy.com (since I had dabbled before), and learned as much JavaScript as possible.\n\nFinally, the event comes around, it's a 24 hour hackathon, meaning, we're supposed to finish an app prototype in 24 hours. It started Thursday at noon and I get a team of 2 others to circle up on my project idea.  Not really knowing what I'm doing, I do my best at providing input and seeing what I can do.  It gets around to about 8pm, and we don't have an app and about 10 lines of code completed.  My teammates leave, and our main developer guy gives me some tools that would at least give me a platform to try and do some work.  I decide that I'm just going to stay and \"do it.\" I think my exact words were \"I'm just gonna stay and see if anything comes out of it.\"\n\nSo, I stay all night, beating my head into something I've never done, and just try to make some progress.  It was hard.  It was so hard to have my head in that information for that long, and to even concentrate for that period of time was a feat in itself. I don't think I've ever worked so hard, and wanted something to work so bad in my life but I MADE IT HAPPEN.\n\n9am roll around, and my first teammate comes in, he says \"how was it?\" and I said \"well, it works.\" shocked, he says \"really?\" I say yep.  at this point I can hardly keep my eyes open, over the last 24+ hours, I only got 20 minutes of my eyes being shut.\n\nanyways, fast forward to the end, WE FINISHED THE APP AND WON THE EVENT!\n\nI have been beaming with excitement since then. I feel like a freakin' rockstar.\n\n**TL;DR, Built an app in 24 hours without any having any coding skills and won a hackathon.  I feel like I could conquer the world! It's one of the best feelings I've ever had in my life!**\n\nSorry to be so long, but I had to say something, I want everyone to feel this way!\n\n", "url": "https://www.reddit.com/r/happy/comments/111tgl/had_one_of_the_best_days_of_my_life_ever_tldr_at/", "title": "Had one of the best days of my life ever! (TL;DR at the end)", "social_network": "reddit", "user": "smakers1", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 16, "down_vote": 0, "creation": 1349546569, "permalink": "/r/happy/comments/111tgl/had_one_of_the_best_days_of_my_life_ever_tldr_at/", "nsfw": false, "first_save": 1635438996.0199666, "replies_charged": false}