{"id": "t5_2qh5i_t3_bfykff", "request": ["c889a480-189a-4ed9-aa88-81c300413196"], "text": "Ok so, this is Easter weekend, so we went out to a fancy(ish) dinner Friday night, a fun family dinner Saturday night and today we went out to go see family some 2 hours away. I honestly had dreaded every one of these encounters but they all turned out much better than I had expected and I actually had a lot of fun seeing distant relatives again.\n\nRecently, (past couple months) I had been vaping a LOT (probably around 75mg of thc per day) of weed and/or thc concentrates. It just seemed to ease boredom, give me something to look forward to every night, and make sleeping a hell of a lot easier. I was juuust running out and getting low on money so a few days ago I had decided to stop smoking completely and try to use it all up on 4/20 as a mini tolerance break of sorts and a big let off. As fun as it was, I felt guilty and like some sort of druggie, and I hadn’t even realized I felt guilty. I feel so much better in the last couple days. It’s like a weight’s been lifted off my shoulders and I don’t feel guilty for something so many people do.\n\nEarlier this week, some of my closest friends had been planning another game night (just us nerds playing ping pong and board games and laughing, but I absolutely love them) and since I’d be out today I got a bit disappointed because I probably wouldn’t be able to make it in time and it was for going to something I didn’t even think I’d like. I knew they usually went on for pretty late so I figured I might be able to make the tail end but that was all. It started at 3PM and usually goes until around 11PM. I showed up at 8ish I think and I had a blast. We played Settlers of Catan and had a great time and lots of laughs then played some ping pong and random mini games and then Tellestrations (or however you spell it, it’s like telephone but with pictures and guesses moving onto the next person) then we all decided to go outside. It was dark by now, of course but we were going to play ghosts in the graveyard (tag of sorts) across the host friend’s yard and another adjacent house’s yard that was currently for sale so no one lived in. The host friend then pointed out that his neighbor on the opposite side of the for sale house was actually another friend from school, whom we weren’t as close with but still all mutually liked and knew was chill. So I texted her on Snapchat, asking if she wanted to join and/or if we could use her yard too for a bigger game. She said go for it to using her yard but she was going to bed. I thanked her and said if she ever felt like joining, we’d love to have her with and she said ok and ended up showing up a bit later. (It’s worth it to mention here that the group is all high schoolers, mostly juniors with one super cool and funny sophomore and a couple seniors, 9 total people including the neighbor that joined later) I had actually had a mild crush on this person (the late neighbor) for quite a while now but just regarded her as a friend and knew I didn’t have a chance (no we didn’t get together, but it was still a great time) She’s just always so outgoing and so happy and pretty and funny and amazing all around and I’m SO happy she decided to join\n\nAnyways, we all ran around and hid and got caught and found each other and it was so much fun and super tiring at the same time. Many many really genuine happy heartfelt laughs were shared among everyone and I really don’t laugh very often, so that was so amazing. I just feel like life is perfect right now and I want to be able to relive this whole night over and over again. I don’t want to die or anything, but I feel like if I died right now, it would be alright. My life feels complete already and I feel like the happiest and most peaceful and calm I ever have. I am so fucking lucky in life and I really hope that luck continues but I’m just scared I’ll never be able to have this kind of fun and carefree life I have right now after high school. Even just this year after the seniors graduate, I feel like it’ll already be a lot less enjoyable. I just don’t even want to imagine what it’ll be like to have to leave everyone behind and start a whole new life somewhere else after high school completely. I really can’t even describe how I feel right now, but I can almost guarantee that no drug could possibly feel better than I do at this moment. This has to be what heaven feels like. I’ve been through some shit in life. We all have, but my whole future seems possible now. I feel so free to do anything life has to offer. Again, if I died instantly right now, it would be completely fine. There’s no way I can ever be happier than how I feel now and I’m not even sure why. It doesn’t seem like a big event or anything and it’s not too different from anything we’ve done before, but I just feel so amazing.\n\nI love you all. The only reason we’re alive is because of random chance. You only get one life, so I feel like everyone should just be able to be happy and free. If the whole world could feel how I do right now, all conflict would instantly cease and we’d all just give each other a big hug.  Love who you will but we all deserve love. To every person out there that feels unloved, if you ever find me irl just ask and you’ll get the best hug of your life. Even if you feel like I won’t help, hugs never hurt, hugs only make me happy and I wish I could give everyone hugs. I’m sorry for rambling but this is seriously the best I’ve ever felt and I hope I can look back at this and remember just how it felt, or at least some sort of nostalgia from it. Stay happy everyone, you all matter to me and the world wouldn’t be the same without even a single one of you <3\n\nIf anyone needs help or to talk to anyone, I’ll always be here and I will never judge you for anything you’ve said or done or say or do. Fuck hate, just love love. <3", "url": "https://www.reddit.com/r/happy/comments/bfykff/i_just_had_one_of_the_best_nights_ever_very_long/", "title": "I just had one of the best nights ever! (Very long, mostly just me anti-venting)", "social_network": "reddit", "user": "OpsadaHeroj", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1555912381, "permalink": "/r/happy/comments/bfykff/i_just_had_one_of_the_best_nights_ever_very_long/", "nsfw": false, "first_save": 1635441447.9990773, "replies_charged": false}