{"id": "t5_2qh5i_t3_d5msn1", "request": ["f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "My boyfriend and I have been looking for a new car for a variety of reasons. We've also been discussing marriage for awhile now. My parents are very controlling and won't allow us to marry until we've done a list of things they want. We're also not allowed to share a room or sleep together. We can't even use the same bathroom.  We are currently living with them because it's cheap and we want to build a house together eventually and while they are toxic at times and controlling they do genuinely care about my well being and love my boyfriend like their own child. \n\nWell my boyfriend was in his room, and I guess he didn't think I could hear him? But I was in the kitchen cooking. It's a fair distance but I could still hear clearly. I turned off my music because I heard him talking and I couldn't tell if he was calling me to look at something. I knew he was shopping for cars so I thought maybe he found one. But when I paused to hear him, I heard him talking and figured out he was on the phone. I shrugged and went back to cooking I don't tend to Eve's drop but he did kinda get a little loud so I couldn't really help it. Like I said it's a pretty good distance from where I was to his room, and I didn't move. He told the person on the phone he looking for a car for his girlfriend but then he paused for a second and chuckled a little and was like \"well....my future fiancée.\" And he genuinely sounded excited! \n\nI have issues with depression and had been feeling pretty down lately. I start to isolate myself and that just makes it worse. I start feeling unwanted and lonely, not because of what others do but because of how I interpret things. It felt really good and made me really happy to hear how excited he got when he was talking about me. Calling me future fiancée was just icing on the cake. It really made my day, especially with how work went this morning.", "url": "https://www.reddit.com/r/happy/comments/d5msn1/just_overheard_my_boyfriend_refer_to_me_as_his/", "title": "Just overheard my boyfriend refer to me as his future fiancee!", "social_network": "reddit", "user": "GuiltyEnigma", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 24, "down_vote": 0, "creation": 1568752460, "permalink": "/r/happy/comments/d5msn1/just_overheard_my_boyfriend_refer_to_me_as_his/", "nsfw": false, "first_save": 1635443328.6634512, "replies_charged": false}