{"id": "t5_2qh5i_t3_4k8pfv", "request": ["b5925080-d3d2-4e5b-a596-2b1b5f902b94"], "text": "I know that's not entirely the most positive title, but I've been having a good few weeks and at this rate, my life can't really look any further upward unless I suddenly get a large sum of money come through\n\nI'll start with the fact that my counselling sessions have led to me discovering myself and are helping me to view myself in a similar light to what others seem to view me in. My self-perception is becoming far more positive and accurate compared to how I used to be, where I viewed myself as weak and useless, and believed I'd never be anything special. Now, I'm aware of my flaws still, but I'm far more confident and cheerful, and my self-concept has improved dramatically too. I no longer see myself as useless, and I know I'm capable of great things - maybe not incredible feats of physical strength, but I have other traits that are far more beneficial, and the compliments I've received from friends and family alike have been staggeringly positive. Clearly, I've improved over the past two years\n\nThe next big thing that's been going well for me is the society I run at my university. We got nominated for Society of the Year (but didn't win), and I was also nominated for Committee Member of the Year (but didn't win). And while I didn't walk away with a physical trophy, I've still achieved some far more personal victories since then. With regards to my society, I got re-elected as Chairman, with everyone saying that I was the only one fit for this role this year. On top of that, the committee I've got this year is incredibly enthusiastic, full of ideas and seems to be prepared to work hard for the society. As well as this, after a recent meeting I had with our universities Vice President of Student Involvement, I walked out to hear the Societies Co-ordinator singing our praises and saying we'd be one to watch for next year.\n\nAs for the meeting with the VPSI, I actually wanted to talk to him about the possibility of taking on the role myself, as it is a role where students get elected into it by the student body. He was extremely encouraging and said that he thinks I'd be great for the role, and even opened up to me about some of the things he'd struggled with as VPSI (namely the fact that he's been bullied while in this job and received a lot of unwanted attention for various, unjust reasons). His encouragement has led to me setting my sights on working towards that role next year, and the only problem my friends saw with me going for this role was that I'd likely struggle to earn the support of the sports teams - but I know I can work my way around that\n\nBut there are also some more personal victories that spring to mind at the moment. The two big ones being the first time I cried properly in over five years after the aforementioned loss at the an award ceremony. But I wasn't crying out of misery or frustration at losing out - more joy and happiness in seeing how far I'd come since coming to university. I worked hard to get the nomination alone - who cares if I didn't win? My efforts were still recognised. I even said to my friend who had to deal with me that night \"I earned a good cry - it's been five years\", and I feel a lot more capable of expressing my emotions freely\n\nBut the main thing that's been a success for me as of late is that I'm finally making ground in the world of dating (or at least, I think I am). I got over the whole \"nice guy complex\" quite a while ago, and am now working on building up my confidence and talking to girls, specifically one in particular who I've admired from afar for a while now. My friends have encouraged me and told me we'd probably be good for each other, and it means more than they could know to hear that. Throughout my life, I've always felt inferior or simply not good enough for others, but now I'm getting over that problem and figuring things out for myself. And to be told that I'd be good for a girl who, as far as I'm concerned, is kind, caring, funny, smart, drop-dead gorgeous and almost gifted with nature as if she were a Disney princess...it's safe to say that that makes me feel good. I've been trying to make small talk with her for a while, and she seems really happy whenever I talk to her, and when she talks about her passions, her whole face just lights up - it makes my heart skip a beat just thinking about it\n\nSo, in short, my life's been going really well - and while it's definitely far from perfect, it's finally taking the direction I want it to\n\ntl;dr - I've made a ton of progress and had a good couple of weeks where people have been telling me \"You can do it\" in situations where I always thought \"You couldn't do that in a million years\"", "url": "https://www.reddit.com/r/happy/comments/4k8pfv/if_my_life_looks_up_any_further_its_going_to_get/", "title": "If my life looks up any further, it's going to get a neck injury", "social_network": "reddit", "user": "ProJoShiZone", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1463757470, "permalink": "/r/happy/comments/4k8pfv/if_my_life_looks_up_any_further_its_going_to_get/", "nsfw": false, "first_save": 1635439092.0697787, "replies_charged": false}