{"id": "t5_2qh5i_t3_11xirm", "request": ["4de8d439-3f8c-406c-9767-31bcb471a057", "807b0e60-90ff-4117-a669-a9b732d8f68c"], "text": "This was dated 9/8/2012 to put it in perspective that I'm not that far along. I had help - without some of these people who knows where I would be and what I would be doing.\nToday, on the eve of the start of my new job, I had some time to sit and reflect. This is a story about changes for the better, and how even the smallest tear drop will ripple across a body of water, building itself and snowballing into something fantastic.\n\nPrior to 2012, I wasn't happy. I, as would most, could look at Sodapopp and see that he was happy - complacent, with his surroundings. This was nothing short of a superficial coping mechanism to blend into a world seething with people that all seemed to live perfect lives. I consistently found myself doing things I didn't want to do all to gain acceptance with people that, at the end of the day, I really didn't like. Conforming to the majority is a bitch. I stop, think, and compare myself to others that may or may not feel that way and I'm just overwhelmed with sadness. Despite having a close knit circle of friends, many of my relationships at this point in my life were flawed. Typical conversations ensued in the fashion of, \"What are you doing this weekend?\" \"Oh, that's cool. Hit me up!\" This type of fluff talk was shared with individuals I thought were 'cool' and 'down'. The type that drank themselves into a stupor on Friday and Saturday nights; who's natural charisma seemed to always lead a troupe of able bodied peers on a series of memorable nights. Offically a part of the hivemind, this mindset of chasing the next party and fighting to become Mr. Popular put me in a position to become even more flawed than the people I desperately saught to be like. In hindsight, I can't believe I could have been so short-sighted. In an environment with so much diversity, wherin those participating are expected to embrace the aforementioned diversity - I found myself looking down upon those that didn't drink and party until their bodies ached and screamed for rest. Never did it cross my mind that the choice to not indulge in that lifestyle that I'd be eliminating the possiblity of meeting some of the most interesting people available at the time. Even at the time of this writing I am disappointed and disgusted with the strength of my tunnel vision at the time. But I am not mad, upset, or filled with regret. Had it not been for that short-sightedness and ignorance, I may not have grown and matured into the indivivdual I am today.\n\nThen I graduated. I moved to a city where I didn't know anyone to work at job with people that I had absolutely nothing in common with. I felt alone. Depressed seems like too harsh of a word to describe how I felt at this time but the sensations I experienced weren't too far off. My work itself was fulfilling, but the constant alienation I felt by my then-coworkers made team projects and meetings awful to look forward to. One event in particular stands out at the time of this writing. It was a team lunch with 2 of my former managers, a senior auditor, and the president of the company. All was well until they began to talk about mortgages, children, and day care - concepts that are very foreign to me. As I looked down at my plate and toyed with my food I observed one of the managers go around the table and invite everyone to her daughters birthday party. Everyone except me. Why? Is it because I'm young? Black? Different? A terrible employee? It didn't matter, because little things like that led me to detest my job and hate the people I worked with. Fortunately (or unfortunately, pending interpretation) I was laid off the following week after that ever so memorable lunch meeting.\n\nDuring this time I experimented with MDMA for the first time. This, by no means, is meant to advocate for the use of drugs or illicit substances but the feelings and sensations I underwent under the effects coupled with electronic dance music served as a tipping point for a series of changes I made in my life from that point forward. The first of many changes, and what I consider the biggest was to start doing things that I wanted to do. Things that made me happy, that looking back at an old age I could be proud of. One of these things was snowboarding. The grace and elegance I could exhibit while carving down a mountain is just something so intrinsitcally rewarding that I don't believe I have the words to describe it in this text box. In addition to the snowboarding, I started attending music festivals. The first of which were with my close dear friends Panda & Tiger. I'm sure its been said in a song or poem somewhere but music changed my life. While I may have been too premature to the variety of EDM to truly enjoy Ultra Music Festival, it was the atmosphere that sold me. The general vibe that each and every individual festival goer emits is one of welcoming and acceptance. Never have I felt more comfortable with striking up conversation with complete strangers than ever before. The fact that I was able to share that experience with two people that I've known my entire life turned it into one of those memories that are burned into the depths of the hippocampus - the part of the brian responsible for memory deposition and recollection.\n\nFast forward to April of 2012. My old roommate was getting married and wanted his wife to be to move in and thus, all the house occupants needed to move out. I hopped on craigslist to which I met my current landlord, Nicole, to whom I explained my wants and needs for roommates that I didn't just live with. I was a little worried at first, but on move-in day, all of my worries and anxieties were alleviated when I met Abroham, Tie, and Momo. I still remember it like it was yesterday - moving my desk up the stairs and hearing Abroham playing Deadmau5 and Tie playing Gareth Emery. I was grinning with excitement that we all shared the same taste in music. My festival career continued with Tie and Momo. Loaded, DayGlow, Starscape, IDentity - so many that I can't even accurately recall the bulk of them off the top of the head. But each and every single time we got together under the premise of good music and good people, I felt myself getting better, stronger, happier. If God exists, him bringing those 2 into my life was a way of 'saving me'. Later on at this point Tie and Momo got together and at first I was worried because, well shit, I live with them. But seeing them grow into a perfectly functioning couple - I'd be straight up lying if I said I didn't find myself envious that they had something so special. Another pivotal life-changing point in time was going to Camp Bisco with Panda, Sage, Elephant, and Bro. Let me just stop and interject that in high school - I thought Bro was a giant douche. Not because he truly was, but because he was popular and I wasn't. Yeah, I was salty. But after seeing all these people after going on our separate journeys and coming together to talk to each other for who we are and what we've become, I respect the dude. I really do. Bro, if you're reading this I hope good things continue to happen in your life - you deserve it. Getting back on topic though, Camp Bisco was pivotal because it was then that I really started to love myself and gain confidence in who I am and what I believe in. It really solidified the concept that no one needs to be impressed to be befriended. No one should have to go out of their way just to be liked by someone. It should just happen.\nThis summer was amazing, and The Electric Zoo was the perfect way to bring it to a close. Between the music, the weather, and the people I went with and met there - it turned out to be another one of those 'best weekends of my life'. But seriously, never have I felt so content and satisfied with everything in life until this point. I know I didn't really show it but Sunday night when 200 people started singing me happy birthday...... fucking onions man.\n\nSo here I am in the aftermath of the summer of 2012 and I feel grounded, motivated, and ready for whatever life has in store for me. Who I am now compared to who I am just one year ago are so similar but still simultanously miles apart. To everyone that was in this story or a part of this story, I just want to take a moment and say thank you. I want you all to know, whether you know it or not, that you are appreciated and you inadvertently served as a catalyst to incite some of the biggest and brightest changes in my life.\n\nThank you and I love you all dearly,\n\n-Sodapopp\n\n\n*edited for names", "url": "https://www.reddit.com/r/happy/comments/11xirm/a_letter_i_wrote_to_my_friends_after_beating_my/", "title": "A letter I wrote to my friends after beating my depression.", "social_network": "reddit", "user": "SodaPopp", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1350968739, "permalink": "/r/happy/comments/11xirm/a_letter_i_wrote_to_my_friends_after_beating_my/", "nsfw": false, "first_save": 1635439616.5583186, "replies_charged": false}