{"id": "t5_2qh5i_t3_es3bt", "request": ["13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "No, I didn't get a new car or house or a million dollars or anything, but it was awesome anyway.\n\nFirst, I didn't travel. Normally, we travel for Christmas, but for various reasons, we decided to spend it at home this year. I never realized what a stresser that was until now. No trying to find a ride to the airport, someone to take care of the dogs, weighing of luggage, etc. \n\nThis also meant we could nicer gifts than usual for each other, our families, and a family we 'adopted.' (Typical story- single mom, couldn't afford nice presents for the kids, so we and two other couples each adopted a kid and got them tons of toys from Santa.) \n\nIn addition, the gifts I got this year were all above average in awesomeness. I'm usually kind of a hard guy to shop for, in that all of my hobbies are pretty specialized and a layperson can get easily lost. A few people made the extra effort though, and really researched what I could use and got it for me. \n\nAlso, I bought Munchkin with a B&N gift card I received from one of my aunts. Blasphemy, I know, to spend a book store gift card on a game, but I had a 25% off coupon, I get my books from Amazon for cheaper, and my already too big backlog of books just got bigger by 6 from gifts, so I'm set for now. Anyway, I somehow got my wife and a couple of her brothers to play with me, and they all loved it! It's totally not what they are usually into, so this was a welcome surprise.  \n\nFinally, I tried two new recipes (soft-serve pretzels and clam chowder), and they were both hits. Always nice.\n\nTl;Dr-\n\n * No traveling, no stress\n * Gave great presents  \n * Got great presents  \n * My wife and her brothers now love Munchkin\n * Everyone likes my pretzels and clam chowder (that sounds somehow dirty)\n\nHope everyone enjoyed their Christmas or Solstice or Festivus or 3 day weekend or whatever as much as I did!", "url": "https://www.reddit.com/r/happy/comments/es3bt/i_had_one_of_my_best_christmases_this_year/", "title": "I had one of my best Christmases this year.", "social_network": "reddit", "user": "TopRamen713", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 17, "down_vote": 0, "creation": 1293466763, "permalink": "/r/happy/comments/es3bt/i_had_one_of_my_best_christmases_this_year/", "nsfw": false, "first_save": 1635442935.4275658, "replies_charged": false}