{"id": "t5_2qh5i_t3_audfm3", "request": ["44cd61d3-f01a-4909-b162-9daae7dd79b2"], "text": "She knew at first, it took me seeing her as three different people. She is a luscious, royal goddess - especially as a Leo.  \nMe as the Pisces, she finds me endlessly entertaining. I find her [fabulous](https://www.youtube.com/watch?v=IseXQNVdSBw) in nearly every way, [terrifying and beautiful](https://www.youtube.com/watch?v=JeTeuWMWhK0) in every other.  \nEven though we are living apart due to work practicals, she just now parted for home - an hour away, so not so bad - and I'm deliriously happy. I love her, We are both so privileged to have found one another once again.  \nBTW: Past life regression hypnosis revealed her and I have been together in one body or another for some 12,500 years. She was here first and her courage and selflessness caught my admiration.  \nHer stubbornness encouraged me to stick around and nudge her in healthy directions.  \nOur abject acceptance of one another helps us each be a better person, if not for ourselves, then for them. Ultimately we learn we MUST do it, love, for ourselves. She is one of my best reflections.  \n  \nI wish each and everyone of you the joy I experience.  \nI wish each and every one of you to know, to experience, to live in some moments where things start out unexpectedly good, and get *better*.  \n  \nIt happens every day.  \n  \nMuch love to and from your being.  \n  \nNamustard, hold the mayo.", "url": "https://www.reddit.com/r/happy/comments/audfm3/my_wife_and_i_are_so_much_in_love_with_one/", "title": "My wife and I are so much in love with one another. Both over 50, just celebrated our 5th year together. It was love at first sight. We are twin flames.", "social_network": "reddit", "user": "Oz_of_Three", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 21, "down_vote": 0, "creation": 1551047150, "permalink": "/r/happy/comments/audfm3/my_wife_and_i_are_so_much_in_love_with_one/", "nsfw": false, "first_save": 1635442437.872768, "replies_charged": false}