{"id": "t5_2qh5i_t3_9w8mvy", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "Some context. My brother has had a hard life, but when he was younger, he was an amazing athlete. Easily could have gone professional in at least 3 sports. Unfortunately, he suffers from all kinds of mental illnesses which were not often recognized and treated when he grew up. As such, he turned to drugs. Now, I was only 6 years old when he started, so all of my memories of him are negative. He stole my allowance, screamed curses at my parents, and generally made things very difficult for my family. Especially my mother. I hated him. At least I thought I did. I thought any redemption for him was completely impossible. After all, after 15 years of the same shit, it's easy to think someone will never change. \n\nI'm not really sure what happened recently, but he is clean of *everything* except the occasional drink on the weekend for over 100 days. Weed is even legal now where we live but he hasn't touched it at all. But that isn't the best part. Yesterday, he won a professional pickleball tournament. I'm only sad I wasn't there to see him win. Sports were always his favorite thing. Even weeks into a bender that man could run circles around everyone. One time, he got out of jail and decided to go run a half marathon with no training or preparation. He ended up in the top 50 racers in a race with over 600 people.\n\n I'm just so unbelievably happy to see him having a life for the first time I have ever known him. He's keeping promises, working, and I even had a proper conversation with him for the first time in probably 7 years. \n\nI know I shouldn't get my hopes too high. Once an addict, always an addict. But for right now, I actually have a brother. And I'm just going to ride that happiness wave as long as I can.\n\nIf he makes it to Christmas, this will be the first Christmas I've had with him in I believe 12 years. I can't even explain what that will mean to my family. Especially my mother.", "url": "https://www.reddit.com/r/happy/comments/9w8mvy/my_brother_is_over_100_days_clean_from_drugs_and/", "title": "My brother is over 100 days clean from drugs, and just won a sports tournament!", "social_network": "reddit", "user": "Castle_for_ducks", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 41, "down_vote": 0, "creation": 1541978939, "permalink": "/r/happy/comments/9w8mvy/my_brother_is_over_100_days_clean_from_drugs_and/", "nsfw": false, "first_save": 1635440710.6030295, "replies_charged": false}