{"id": "t5_2qh5i_t3_m62qxo", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a", "13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "We love our daughter (she's 13 btw), we just don't love each other. That's honestly the best way to describe the relationship at this point. We look at each other and we know there's just nothing there anymore, no deep, yearning love like when we first met. But no hostility either. We see each other as good friends who genuinely care about each other, but leave it at that. Needless to say the divorce was amicable. We each had our own attorneys for representation's sake, but the filing was fairly straightforward and our visitation agreements between our daughter was agreed upon.\n\nI have to thank my (now ex) wife for making it significantly easier for our daughter to comprehend and make peace with. She really was able to get through to her much easier than I was. She made it clear that none of it was her fault, not in the slightest, and that we both loved her equally. The hardest thing was just us not being together. She couldn't quite wrap her head around that, even though her ears had to listen to some of the more intense arguments we had between me and my wife.\n\nAnyway, getting back on track, we had just finished dinner together and my daughter was still on that tipping point: being a little withdrawn since the separation, but not fully shutting me out either. She went to her room and I was doing dishes and I hear her screaming over the phone at someone, the angriest I've ever seen her. I go to her door but then stop myself and just think \"Let her get it out\", and so I just stand there listening to her call someone a \"fu--ing cu-t\", \"bi-ch\", you name it, and I'm just like \"Woo man, hate to be on the other end of that call\". Eventually things go quiet and I slowly open the door. She immediately tells me to fuck off but I can tell she doesn't mean it, she's just angry at the world.\n\nSo I sit down next to her and just very calmly ask her what happened. Here's the jist: Some girl from school that she was in a group chat with said that her mom must be happy to be out of the house and is probably already with another guy because I supposedly wasn't keeping her (my wife) \"satisfied\" enough, and also that they'd probably still be together if it wasn't for her (my daughter). Yes, another 13 year old kid said that, hand to God. And then my daughter basically gave the \"You have no idea what you're talking about\" rebuttal and layed into her, defending me in some way. There's more to it but that's essentially what went down, some girl tried being a troll for shits and giggles.\n\nAs she's going into more detail, she's on the verge of tears and I just hold her hand and scoot closer to her, telling her that none of it is true and that she shouldn't listen to her. Even though she's nodding her head in agreement, she kicks her nightstand out of anger and knocks a glass over and it shatters and she screams \"Fuck\" at the top of her lungs. This sends her over and I take the opportunity and just hold her tight against my chest as she bawls her eyes out, screaming and crying at the same time. After she wraps her arms around me, all I can think to do is let her carry on, just softly repeating \"It's okay baby, I'm here\" and \"It's gonna be okay baby. It's gonna be okay\" and I nearly start crying just seeing her like this.\n\nShe starts coughing from crying and yelling so much and I just rub her back and kiss the top of her head over and over to help her calm down. She eventually gets to a point where she isn't crying anymore and is just staring out into the hallway. I let the silence just sit there for a few moments before I get her to look at me and stare directly into her eyes and say \"I love you sweetie. You're gonna be okay\" and kiss her forehead before she says \"I love you too\" and I smile warmly but she doesn't smile back, yet I still just hold her close and we sit in silence.\n\nI know this was probably a build-up from all her anger and rage she was holding in since the separation, and I don't blame her for being that way at all. After she finally was really calm, I asked her if there was anything she wanted to talk about but she said no. I reminded her that she can talk to me about anything and we just kind of left it at that.\n\nI know we have a lot to work through, but I'm confident she'll come to terms with the whole thing one day. And if she wants to do something like therapy to help her, I'll be there for her 100%. Anything to make her happy.", "url": "https://www.reddit.com/r/happy/comments/m62qxo/my_daughter_said_i_love_you_too_to_me_for_the/", "title": "My daughter said \"I love you too\" to me for the first time since me and my wife divorced", "social_network": "reddit", "user": "AnchoredEnclosure", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 502, "down_vote": 0, "creation": 1615876268, "permalink": "/r/happy/comments/m62qxo/my_daughter_said_i_love_you_too_to_me_for_the/", "nsfw": false, "first_save": 1635439293.5611093, "replies_charged": false}