{"id": "t5_2qh5i_t3_7dmto6", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb"], "text": "I started writing a post but before I was half way done with it was a wall of text. Ive got it typed up on google docs if anyone wants to see it Ill post it but Ill stick to bullet points.\n\n* Supposed to graduate high school in 2004.\n\n* Had to take an extra year due to being short a few credits.\n\n* Delayed again when it came up I was short on classes that were not mentioned before.\n\n* I delayed myself by another year (2006) by focusing on WoW rather then doing the 2 weeks worth of work to graduate.\n\n* (2006)Wash dishes for a month and decide that I need to go back to school. Spend the next 4 years working only 2 years and always part time but part of it going to school.\n\n* (2008) Stop going to school because my mom made to much by FAFSA standard even though she couldn't afford to help me with school. I have to wait until winter 2010 to go back.\n\n* Unemployed for 2 years. Felt like killing myself several times for being worthless.\n\n* Land a job at a mom and pops thanks to two guys from highschool.\n\n* Work there part time, school full time for two years. Literally walked 2-2.25 miles to work and school everyday, uphill and downhill, and even in the snow on the rare occasions. Sometimes doing HW at work between class and work.\n\n* Right before I graduate 1. Fafsa sends me more money because they had it laying around. Bought a car with it. 2. A local hospital lays off 100 employees in the field Im going into.\n\n* Graduate, cant find a job in that field for two years. Stay at mom and pops making minimum wage for another 2-ish years but moving to head manager.\n\n* Land a job at my current company $11.50/hour to $16.XX/hour.\n\n* Start saving for a house.\n\n* Car accident two years ago that wiped out the 5k I had started saving. Bought a new car but had car payments, silver lining - I learned I had high credit because I was approved for a $20k auto loan\n\n* Buy a new car in September of 2015 with the assumption it will last for many years.\n\n* Paid off new car Before Thanksgiving 2016. Small raise at work to $17.XX an hour.\n\n* Sit down with my boss at lunch. Ask him \"whats the difference between my job (entry level) and (next step up?\" \"Nothing with everything you can do that's why Ill get you a big raise.\"\n\n* Currently - Boss got me the raise from $17.XX/h to $25/h. It came in on half my paycheck today.\n\n* Checked bank balance - 18k saved at the moment. This time last year I paid off the 13k on my car.\n\nIve stopped buying video games and comic books ($100 a month on comics alone not to mention bags, boards, and boxes) so not only will my raise be a nice boost but Ill keep some extra money. If I can keep saving like this I estimate that Ill be at 42k saved by the end of next year. That will be enough for a decent down payment on a house so I can finally move out of my moms house and live on my own at sadly 33 but better late then never.\n\n*  \n\n-", "url": "https://www.reddit.com/r/happy/comments/7dmto6/it_looks_like_life_is_starting_to_get_back_on/", "title": "It looks like life is starting to get back on track for me.", "social_network": "reddit", "user": "redtechwizard", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 14, "down_vote": 0, "creation": 1510942340, "permalink": "/r/happy/comments/7dmto6/it_looks_like_life_is_starting_to_get_back_on/", "nsfw": false, "first_save": 1635438958.4407895, "replies_charged": false}