{"id": "t5_2qh5i_t3_q054qz", "request": ["b3574414-2d10-4990-bb3e-d9be8a3b6716"], "text": "Last year, I was a HCA working ungodly shifts throughout lockdown. I was burned out and the fear of the virus (among other things) brought back the agoraphobia I'd had as a teen.\n\nI'd joined a dating site a few months prior to lockdown, and I soon matched with a gorgeous guy, \"H\", who was interested in the same things as me, and wanted the same things in life as I did. It was difficult for me to imagine going out to meet him though, both because of the virus, and because of my agoraphobia. It got to a point where I was having panic attacks on the 10 minute bus to/from work. How the heck would I manage travelling into town, on a 40 minute commute to meet someone new, for a *first date* of all things? Talk about pressure!\n\nSo I made a post on a dating/relationship advice sub, and although I don't follow that sub anymore, a few really kind users reached out both on the post and in DMs. They validated my feelings, and made me feel so recognised. I got some great advice about ideas for places to go, including quieter places, and what to do, including buying a fidget cube which I definitely used on the journey up there! For the location, I chose a small, quiet coffee shop, to meet up with him on 6th October - two days before my birthday. \n\nThe users there also encouraged me to be honest with him about the agoraphobia. I was worried it was going to put him off, as the agoraphobia pushed away friends and partners alike over the years, having them assume I was a flake and didn't want to see them when I really did. But I was honest anyway - to my relief, H was sympathetic, not at all judgemental. Our first date was a dream; no panic attacks at all, and he made me feel so safe and comfortable. Over time, we went on more and more dates, and my agoraphobia slowly began to shrink away.\n\nThere was one occasion when I did actually have a panic attack on one of our dates on a walk around the canal. I can normally hide it, but H picked up on it straight away, got me some water and walked me home, all the while telling me I was safe and reminding me we could stop and sit down any time. I felt so loved.\n\nWe're celebrating one year together next week, from our first date at the coffee shop, on the 6th October. And it's my 30th birthday on the 8th. So we're going sight-seeing on a four-day city break, which is something I would be so nauseous about trying last year!\n\nI just feel so happy. And I'm so glad I managed to conquer my demon once again, which I don't think I'd be able to do without support from the Reddit users who'd been in the same boat! To anyone struggling with their own demons, remember that there are people out there who know how you feel, who won't judge you or take it personally when your demons affect your plans - and I encourage anyone to find strength and support in numbers. Your feelings are valid! I'm forever grateful for the ideas and the kindness to encourage me to meet such a wonderful man.\n\nHope you all have a great week! 🥰", "url": "https://www.reddit.com/r/happy/comments/q054qz/its_been_one_year_since_i_made_my_first_post_on/", "title": "It's been one year since I made my first post on Reddit about struggling with agoraphobia when setting up a first date...", "social_network": "reddit", "user": "blinkrandom", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1633214512, "permalink": "/r/happy/comments/q054qz/its_been_one_year_since_i_made_my_first_post_on/", "nsfw": false, "first_save": 1635439580.7199156, "replies_charged": false}