{"id": "t5_2qh5i_t3_6fh5ym", "request": ["af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "I posted here a couple of months ago about undergraduate research in the summer, and I was accepted for the research fellowship! My mentor and I hope to work with Nietzsche's *Thus Spoke Zarathustra*, which is my favorite Nietzsche text. I was somewhat hoping to work with Kierkegaard, but I am still very excited. I didn't end up asking him to be my thesis advisor because there's another professor that is better acquainted with postmodernist literature (on top of lots of Continental philosophy)--I asked that professor instead, and he agreed to be my thesis advisor despite having a full plate that I did not know about. I hope to still ask my mentor to be on my review board. I asked my thesis advisor if I could analyze *Akira* as a part of my thesis and he said films count just as much as literature, which I am SO excited about.\n\n\nOn top of that, my boss offered to let me keep my job until I graduate, which is very exciting because she was very stern when she told me that they almost never rehire my position after one semester. I think she likes me because I clean all of the time, and we laugh a lot together. I'll be working for her over the summer to make money to pay for my groceries, because the program will pay for my housing. I'll learn how to paint walls!\n\n\nThe last thing (perhaps the most important) I am excited about is that a professor I thought disliked me sent me this e-mail a few weeks ago, which I still have yet to respond to (nervous that I will say the wrong thing): \n\n\"I just read your macro paper, and I'm blown away.  I'm not saying it's *perfect*, but it shows incredible depth of thought, care in writing, and appreciation of the central arguments that have driven the evolution of this topic.  In one paper, you managed to describe the main tenets of three (four?) separate epistemologies, compare them, and take a stand on which you think is correct.  I think that's very impressive.\n\n\nAs you know, I think it's a character failing to worry too much about grades.  The value of what you've done this semester lies in the high quality of your work, and the intellectual progress that you've made, not some silly letter that I happen to assign.  But, alas, I appreciate the practical reality of the matter, so I reluctantly capitulate:  Your grade for the paper is an A, and your grade for the course is an A too.  So you can now stop worrying about that, and start thinking about how to work this paper into a shape good enough to send to undergraduate philosophy journals.  I can help you with that, if you want, when the semester is over.  You could start by revising your argument against Russell's view of induction, which I thought was the only really weak part of the paper.  You'll also have to get the word-count down, as those publication venues generally don't take anything over 3K.\" I guess this one was such a big deal to me because he gave me a B+ on my previous large paper, and I was really proud of that paper. It wasn't the grade that made me think that he did not like me, but rather the way our interactions went. I did not feel quite as good about this paper, and it felt really nice to know that he was impressed by something of mine that I myself was not impressed by. He did bring his greyhound/German Shepherd to the last class, and that was super cool.\n\n\nI am so sorry for the length of this post! Although I wish I did not have to leave my cat again, I am feeling much more optimistic about my future, and that feels very good. I am hoping to purchase a ghost mantis soon, and maybe an axolotl, as my end-of-summer splurge. I have bought way too many pens in the past two months.", "url": "https://www.reddit.com/r/happy/comments/6fh5ym/i_leave_for_my_research_fellowship_one_week_from/", "title": "I leave for my research fellowship one week from today, and one of my philosophy professors has offered to help me publish one of my papers!", "social_network": "reddit", "user": "AlyssaMayFire", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1496697175, "permalink": "/r/happy/comments/6fh5ym/i_leave_for_my_research_fellowship_one_week_from/", "nsfw": false, "first_save": 1635441991.6952894, "replies_charged": false}