{"id": "t5_2qh5i_t3_j8wzgl", "request": ["1d9bc0bf-4a1c-437e-94e7-5a07c99811fe", "4311bf71-6ec2-4c3b-aa15-1f9a3223e07b"], "text": "It seems like such a dumb thing to be happy over, I know, but I've always wanted to mod a home into a video game I've been playing for a few years now (I'm keeping it vague because I don't want to break the rules but, the game's well known for its modding community, it's single player, and it's... \"realistic\"). For what feels like forever, I couldn't find any tutorial that would make the kinda terrifying experience of making said home + mod a little less, well, terrifying, but I finally did, and I'm ecstatic! \n\nI wish I was joking but I just became so overwhelmed with happiness over changing the model of a large item I needed inside the house to something different and smaller than the original so that it would better fit inside that I flailed my arms around lol. I thought another modder that did something similar was a wizard, and that I'd have to go into like, 3D modeling software and pick apart the game files but nope, it was as easy as just changing the model in the program that helps create the mod/home. \n\nNobody else really cares about this kind of stuff around me, so I just had to share it with someone. Figured this was the best place to do it, even if only one person sees it! \n\nGo me! I'm going to have the **best** house in the (game) world now (to me anyway, because I made it myself, with a lot of TLC and troubleshooting). :D", "url": "https://www.reddit.com/r/happy/comments/j8wzgl/it_may_not_be_exciting_to_some_but_it_makes_me_so/", "title": "It may not be exciting to some, but it makes me so happy that I finally know how to mod one of my favorite games!!", "social_network": "reddit", "user": "ViedeMarli", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 10, "down_vote": 0, "creation": 1602381748, "permalink": "/r/happy/comments/j8wzgl/it_may_not_be_exciting_to_some_but_it_makes_me_so/", "nsfw": false, "first_save": 1635440608.2992764, "replies_charged": false}