{"id": "t5_2qh5i_t3_ktodw4", "request": ["af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "To say life has been rough recently is an understatement. This has single handedly been the hardest time period of my life. Every day is an uphill battle fighting my new chronic illness and crushing stress to make sure I keep a roof over my family's head. Tomorrow isnt promised given no one knows wtf I have atm. But even through the immense pressures and feelings of complete loneliness, I push through as much as I can and am trying to remain as optimistic about life and my situation as possible. \n\nWell tonight I got a little break. I had an awesome zoom date off tinder (Never thought this shitty app worked based off multiple uses with no results). Im not expecting marriage or anything crazy. But im so happy someone looked at me and didnt think I was worthless for being sick. That they liked me for me and were willing to work through my unexpected and uncontrollable problems. That I could still be attractive despite feeling like everything is trying to bring me down atm. Im happy and thankful that someone just cared to be there for me after being abondoned by my previous partner. I may not believe in god, but idk. Sometimes i genuinely feel like something watches over me and helps me out when I need it the most. Maybe that's god I guess. Who knows though. Im just thankful for everything good that comes my way. \n\nAnywho, back to the topic. We talked for way longer than expected and probably could have talked through out the whole night lol. The vibes were just there and it felt amazing. She seems like such a sweet girl and I really love the intellectual vibes she gave off. For so long Ive wanted to talk to a potential partner that could have deep and meaningful conversations with me and could keep up with me and/or surpass me. Well tonight I finally felt that feeling, and fuck it feels so good. \n\nI dont want to get too ahead of myself lol But im optimistic and very excited after having kicked it off so well and I cant wait for our next zoom date and inperson date we scheduled c: \n\nIm happy to say:\n\nI actually feel really genuinely happy right now c:", "url": "https://www.reddit.com/r/happy/comments/ktodw4/had_my_first_zoom_date_today_and_it_went_amazing/", "title": "Had my first zoom date today. And it went amazing!", "social_network": "reddit", "user": "ponysniper2", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 21, "down_vote": 0, "creation": 1610187239, "permalink": "/r/happy/comments/ktodw4/had_my_first_zoom_date_today_and_it_went_amazing/", "nsfw": false, "first_save": 1635441980.002972, "replies_charged": false}