{"id": "t5_2qh5i_t3_p8k0nm", "request": ["b3574414-2d10-4990-bb3e-d9be8a3b6716", "2293bc08-7671-4d63-b63f-dbe4a3a4858a", "5b81e8b4-a0f8-4747-8a7a-0e37aae01c43"], "text": "Millions of us call happiness their lifelong goal. But few define what happiness means, often leading us to chase what our parents, friends, and role models defined as happiness. So when we are back to wearing diapers, we realize we ignored everything we genuinely esteemed.\n\nIn my experience studying dozens of happiness frameworks and science-backed studies about happiness, I've found the best chance at being happy at any time comes from defining what happiness isn't. It's like an inverse happiness checklist.\n\nIn it, you write what doesn't bring you joy and then ensure your current pursuit of happiness, whether it is to travel the world or become wealthy, doesn't include any of the items from the checklist. \n\nThe inverse checklist serves two purposes: it helps define happiness and tells you which activities to remove from your life.\n\nSo, for example, if you conclude money doesn't bring joy. But you work from 9-9 because \"hustle is life,\" then reduce the number of, say, side projects you have. Otherwise, you'll be frustrated after reaching financial \"freedom\" and likely feel physically and mentally exhausted.\n\nEach person's definition of happiness varies. However, most people can include specific items into their inverse checklist to define happiness.\n\n## Your definition of happiness cannot reject distress\n\nWe can't control the decisions and behaviors of humans, animals, or nature. Otherwise, hurricanes and phone thieves wouldn't exist. So no matter the statistical formula you use to predict events or the number of possible scenarios you draw on your whiteboard, potential sources of unhappiness are always around the corner. \n\nTo avoid the discomfort from harmful events, some people write a list of sources of distress and eliminate them from their life. For example, they quit their job to run from their nerve-racking boss. Or switch majors. The issue with this list is its potential size—it's infinite because any event in our lives can distress us.\n\nA more efficient solution is to invite distress into your life. And realizing happiness can coexist with events that don't match our definition of a perfect activity, day, or life. For example, a harmless event like Microsoft Word crashing before letting you save an article could either ruin your day. Or it could become a fun challenge to overcome.\n\nWhen you welcome distress, you experience two benefits. First, you become used to different causes of discomfort, reducing their chances of affecting you. Second, you realize distress can (and must) coexist with happiness.   \n\n## Your definition of happiness cannot come from others\n\nMost of us chase a definition of happiness that other people set for us, leading to repentance during our deathbed. For example, some people accumulate academic titles to impress their parents, while others seek minimalism according to a monk's advice. \n\nIn college, psychologists, doctors, and nurses taught me around 80% of older people under palliative care regretted their lives' choices. But you don't need wrinkles or to be in a hospital to regret your life. So instead, change it today. \n\nFirst, write down a list of scenarios that would bring happiness to your life. You can then describe the benefits of each scenario and the barriers between you and them. Second, answer the most crucial question: \"who's someone in my life who believes this scenario would bring happiness?\" \n\nAsk yourself one last question: \"Is this goal worth pursuing even though X person shares it?\" \n\nContrast your answer with other items from your checklist. So if you think happiness is living amongst your friends in the countryside (goal), your friends feel the same (influence), but your inverse checklist says you *don't* like being away from the city, then stop pursuing that goal.\n\n## Avoid being miserable on your deathbed.\n\nWhile your DNA differs from the millions of people who have regretted their life's choices on their deathbeds, you may be following another person's definition of happiness—just like they did. Unfortunately, the old and sick don't have the strength to change their lives drastically. But you do. \n\nSo start developing today a definition of happiness your elderly self will accept, one *you* truly believe. \n\n**Share one item you would add to your inverse happiness checklist below.** If you are not comfortable doing it publicly, please DM me on Twitter at @ MrNicolasForero — I'm curious to discover what you would add.", "url": "https://www.reddit.com/r/happy/comments/p8k0nm/how_to_be_happy_instead_of_miserable_when_you/", "title": "How to Be Happy (Instead of Miserable) When You Become 60+", "social_network": "reddit", "user": "Nicolasforero", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1629515963, "permalink": "/r/happy/comments/p8k0nm/how_to_be_happy_instead_of_miserable_when_you/", "nsfw": false, "first_save": 1635439590.3485975, "replies_charged": false}