{"id": "t5_2qh5i_t3_nbs6x4", "request": ["44cd61d3-f01a-4909-b162-9daae7dd79b2"], "text": "Our son from my partner’s previous relationship is having his friend over to the house for the first time. They couldn’t get the switch to connect to the TV and he came to me for some help.  I went about troubleshooting and hear him tell his friend quietly, “It’s okay, my second dad is going to fix it.”\n\nHe calls me dad by mistake frequently and corrects himself and has for the 4 years I’ve been in his life.  He calls me by name otherwise.  He has a dad and I don’t want to impose on that.  I’m flattered by the mix up and try to make sure he doesn’t feel weird about it when it happens.\n\nI have two older kids.  I have been called dad countless times for over a decade now. Not to say it isn’t everything to me, but if you’d asked me if I was in some way waiting for him to call me dad on purpose I’d have thought that was absurd.\n\nI froze when I heard it, but it only took me a second to compose myself. I went about fixing the TV and then explained how I figured out what was wrong and how it needs to be setup to work next time. They were good, picking between Luigi and Kirby last I heard.\n\nI made it all the way downstairs before things got real blurry and my heart wouldn’t stop trying to run away. \n\nIt’s been a privilege to earn the title a third time.  I think I am as proud of myself in this moment as I have ever been.", "url": "https://www.reddit.com/r/happy/comments/nbs6x4/i_just_overheard_my_nonbiological_son_7_refer_to/", "title": "I just overheard my non-biological son (7) refer to me as his second dad for the first time, and it meant the world to me.", "social_network": "reddit", "user": "Elbobosan", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 545, "down_vote": 0, "creation": 1620942093, "permalink": "/r/happy/comments/nbs6x4/i_just_overheard_my_nonbiological_son_7_refer_to/", "nsfw": false, "first_save": 1635442435.8899903, "replies_charged": false}