{"id": "t5_2qh5i_t3_e2n7hi", "request": ["77a5a12a-14c1-468d-b6d8-4b6928ce40ae"], "text": "I live in an area where it doesn't rain often. Several months ago, I was walking to my car on campus and it rained much harder than usual. I was not prepared and soaked about halfway through my 10 minute walk. Someone pulled off to the side and rolled his window down, insisting I take his umbrella. He told me to do something nice for someone. I love making people happy and doing little things for people, even strangers. I can't think of another time someone has shocked me with their kindness.\nI kept the umbrella in the trunk of my car, but we didn't get rain for a long time and I didn't see anyone that needed it.\nToday leaving work, I ran to my car in the rain. It was drizzling but nothing crazy. I turn left at a light to leave the parking lot and the center median is a pretty common spot for homeless folks to hang out with a sign. I know many of them by now and give them my leftover lunch stuff whenever I can. Today there was a younger guy I hadn't seen before with a dog and a sign that said \"Smile!\" My light was green and I'm in a center lane, so I pull through the intersection, park my car on a side road and run back to him with the umbrella and $10. Its Thanksgiving tomorrow, I wanted him to be comfortable and fed. He was really happy for the umbrella and I saw him open it up for himself as I was waiting to cross the street :') it started pouring when I got home and it's supposed to rain for 5 days straight. I think I found the perfect person to pass along a kind gesture. Watching him open up the umbrella seems like such a small thing but made my day", "url": "https://www.reddit.com/r/happy/comments/e2n7hi/a_stranger_did_something_very_kind_for_me_and_i/", "title": "A stranger did something very kind for me and I passed along the favor today", "social_network": "reddit", "user": "purpterp22", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 23, "down_vote": 0, "creation": 1574890352, "permalink": "/r/happy/comments/e2n7hi/a_stranger_did_something_very_kind_for_me_and_i/", "nsfw": false, "first_save": 1635440754.967925, "replies_charged": false}