{"id": "t5_2qh5i_t3_7d9oko", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "I've always had a bit of a complex about how I think management views me in any job I've worked. In all of my long term jobs I've been regarded as a model employee. But despite that, I've been forced to just watch as countless people were promoted over me. \n\nAs a teenager I was thrilled when McDonalds started grooming me to become a supervisor, but they would never commit to officially giving me the stripes, it was always something along the lines of \"you're just not ready yet\". Meanwhile some jerk comes in with a few months experience and gets the spot.\n\nFast forward to today, I've been working at Tim Hortons for about 8 years now. It's been a lot of the same, I'm the superstar employee that is always overlooked when there's an opportunity for advancement. All of my supervisors were nowhere near as experienced and capable as I was at keeping the shift together when they got bumped up over me. It definitely stung, even though I just went along with it.\n\nThen suddenly 2 months ago everything changed. The restaurant manager (The main boss) just up and quit on pretty short notice. Plans for succession were all of a sudden in the works, while it was still unconfirmed who was getting it, there was a de facto leader everybody assumed was going to be it.\n\nTo my surprise, the owner took me aside several days after the manager quit and offered to make me a supervisor. I said yes of course, and I went along my happy way, content with what I had been given. I respected my fellow supervisors for their experience, and defaulted to the de facto leader.\n\nToday was a shocker to everybody, I was once again pulled aside, this time I was given the manager position. I once again accepted, and the owner made the announcement that I am now in charge. I'm still in shock, I had some suspicions that I was going to be the one, but I don't think I ever let myself believe it. I know I deserve it more than anybody else, I just never expected somebody would ever be willing to take a leap of faith with me.\n\n ", "url": "https://www.reddit.com/r/happy/comments/7d9oko/for_the_first_time_in_my_professional_life_i_feel/", "title": "For the first time in my professional life, I feel like I'm finally being acknowledged for what I'm truly worth.", "social_network": "reddit", "user": "Regnes", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 26, "down_vote": 0, "creation": 1510803235, "permalink": "/r/happy/comments/7d9oko/for_the_first_time_in_my_professional_life_i_feel/", "nsfw": false, "first_save": 1635438842.943717, "replies_charged": false}