{"id": "t5_2qh5i_t3_gphijn", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb", "4311bf71-6ec2-4c3b-aa15-1f9a3223e07b"], "text": "This happened yesterday, I am still struggling to deal with it but in a very good way......I think. I needed to share and it's not something for my RL networks.\n\nI checked my monthly pay that went into my bank account yesterday. It was noticeably higher than normal, which is odd because I'm on a fixed salary, get no overtime or allowances, and any pay increases only happen in August. I went online to check my pay slip and there it was - no student loan deduction made. I only get a SL statement once a year and it's been a while since the last, but at that point I'd calculated my repayments would finish at the end of this year. So this was right out of the blue. I checked with payroll department and yes, they have received notice on 1st of the month to stop taking payments.\n\nWell this is amazing news for anyone of course, and the extra money is going to be FANTASTIC - or will be when lockdown ends and I can get out and use it (not that I'm ungrateful for being safe and still able to work).\n\nBut for me this is so much more.\n\nI have had a very difficult relationship with all things relating to my university experience. Right from when I applied - I'd wanted to take a year out before going, parents wouldn't let me, I then wasnt accepted for any of my applications (and this was on the back of me being top of every class at school with tons of extra curricular and volunteer work and everything else you could possibly want). I ended up having to take a year off so I could reapply, but it was too late to be able to do my original plans so I just got a job and watched all my friends leave town. Plus I had to endure my dad not speaking to me for 6 months solid (while I was still living with my parents). Huge mess.\n\nSecond time round I got into a world-renowned university.....but halfway through my studies I had a complete mental breakdown...nvm why. PTSD, suicide attempts, very bad stuff. Eventually I dropped out because of it. My parents' reaction to this was so severe that I couldn't possibly move home, had to cut off contact for a while in fact because of the toll it was taking on me dealing with their destructive and controlling and demeaning behaviour. \n\nThis was also just as the credit crunch happened and there I was with no degree, no confidence or support, a suddenly very restricted and competitive job market, trying desperately to keep a roof over my head because to go home would have literally killed me. I racked up credit card debt just to pay the basic bills, I had no social life and lost all my friends, I had to live in a hostel for a while and in many squalid and dodgy places after that too. Trying to explain dropping out of a very prestigious university to potential employers was impossible. As was trying to deal with my mental health and financial problems. Had to take the first job I could get and spent the next 10 years or so trapped in an awful attempt at a career I hated and that made me die inside every day.\n\nI honestly don't know how I got through it.\n\nAnd all the while the interest was piling up on this 5-figure sum of SL debt.....for which I had absolutely nothing to show. Every year I'd get a statement showing that the interest accrued was more than what I'd repaid, so the debt kept growing and I honestly thought I would never be free of it until I die.\n\nI was so trapped by all of this for such a long time. Doing soul-destroying work because I had no other choice, for nightmare bosses. Living in squalor. Trying to deal with debt and mental health problems. Having no support network. So many times I came close to ending it.\n\nOh and another real kicker was when I eventually decided to go back to finish my degree to try and break out of this cycle, but because of the funding rules I could not get a further student loan to do so, and would have to pay £9k per year tuition fees UPFRONT from my own pocket, plus living expenses. Not possible.\n\nDark days. Dark years in fact. But bit by bit it eventually got better.\n\nThrough very frugal living I managed to balance my budget. It meant no social life for years and that has done lasting damage to the relationships of my youth, destroyed most of them in fact. But I paid down my credit cards and eventually started to save.\n\nWhat took longer was building up my confidence and finding better work. I still don't exactly love what I do but there is at least meaning to it, and variety and challenge. And that's good enough. Plus through hard work and a fair dose of good luck I have managed to become moderately successful. I lead a team, although I still so often feel like an imposter. I'm surrounded by people not just with degrees but extensive postgrad study, doctorates, etc. I even manage some of them. To be in my position without a degree is very unusual. But however difficult and 'not me' the work may sometimes be it is at least work I can take pride in.\n\nIt's perhaps ironic that I now work at a university. And even now there are days when that is in itself very hard because I see so much of where my life could maybe have gone instead.\n\nSo for all these years - about 14 of them - I've had this SL debt hanging over me, reminding me what a waste it was, always pulling me back to all the things I went through because of that failed attempt at study.\n\nAnd now - BAM! With one glance at my monthly pay, it's all gone. The debt is gone. The last tangible link to all that horrible history is gone. The fact that it was a surprise has made the impact even deeper.\n\nI'm suddenly free of so much more than the financial debt. And I can't stop going nuts over it.\n\nBottle of bubbly has been popped 🍾\n\n\n\nTL;DR: unexpected end of student loan repayments has me high as a kite feeling free of so much bad history", "url": "https://www.reddit.com/r/happy/comments/gphijn/big_surprise_and_i_cant_stop_smiling_and/", "title": "BIG surprise and I can't stop smiling and occasionally screaming and dancing with happiness! My student loan is paid in full and this is SUCH a big deal way beyond the money.", "social_network": "reddit", "user": "conifer13", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 15, "down_vote": 0, "creation": 1590286219, "permalink": "/r/happy/comments/gphijn/big_surprise_and_i_cant_stop_smiling_and/", "nsfw": false, "first_save": 1635438943.1898055, "replies_charged": false}