{"id": "t5_2qh5i_t3_14nsyl", "request": ["89f969a3-3a22-4eff-8a40-d1d5b9658c57"], "text": "She's always on my mind. No matter where I am, what I'm doing, who I'm with, I'm always thinking of her. Her eyes are unreal. Sometimes I call her just to hear her sweet innocent voice. Shes adorable, perfect, and the most beautiful person I know inside and out. I've always considered myslef lower than regular kids, but I'm only seventeen, and I know what love feels like. and that's a feeling I know they don't have. \n\nThe reason I post this is because I'm sitting awake at 3:30am on a school night thinking about our relationship over the past few months (we've been together for four and a half months). It's just mind-blowing to think about how we have drastically changed each other just from being together amd loving every minute of it. When I met her she was the sweetest girl I had ever met, but I noticed she was incredibly shy, and was unaware of her beauty. She has opened up to me gradually, and now we are closer than ever, and I very much enjoybher company whenever I'm with her. I have also noticed her self-esteem is much much much higher than it was wen we met. She finally knows she's gorgeous, and uses it as a weapon against me and others lol. For me, she has more or less changed my life completely.Before I met her I never realy knew what happiness was. Shes my companion; I'm always with her and we do everything together. She's given me a best friend :') I am in a complete state of euphoria guys, it's just amazing knowing that you love someone and they love you back the same way. I love her :)\n\nOh and I also forgot to mention how amazing it is getting constant action.", "url": "https://www.reddit.com/r/happy/comments/14nsyl/me_and_my_girlfriend/", "title": "Me and my girlfriend :)", "social_network": "reddit", "user": "drugs_are_fun_mmkay", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 50, "down_vote": 0, "creation": 1355226462, "permalink": "/r/happy/comments/14nsyl/me_and_my_girlfriend/", "nsfw": false, "first_save": 1635440653.7131772, "replies_charged": false}