{"id": "t5_2qh5i_t3_2xi41v", "request": ["cf382ebf-3ce7-40b7-a290-2028168701eb", "b5925080-d3d2-4e5b-a596-2b1b5f902b94", "f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "New to this subreddit, and wanted to contribute something. I have what I think is a pretty good system going to infuse happiness into my day, and want to share in the hopes that others will find my tips useful.\n\n\n* **Wake up early.** Gives me quiet time to prepare for the day ahead, read the news and not be rushed about it. Sometimes I also use the time to get some work done without interruption. I'm always happy after spending my morning the way I want to.\n* **10 minutes of guided meditation.** Helps me check in with myself and calm any stress to face the day happy and positive. I'm a fan of the Headspace app, but there are many others that are great!\n* **30 minutes reading, without computer distraction.** Great way to get lost in a novel or build knowledge from a non-fiction book. I'm currently reading \"The Happiness Advantage\" by Shawn Achor and learning some fascinating stuff about positive psychology that I can put in daily life. So far, highly recommended for fans of this subreddit.\n* **Exercise every day.** Whether it's a dedicated lifting session at the gym or a long walk in the city on a sunny day, I find getting some sort of exercise very beneficial on my well-being for the day. It also helps build self-esteem because I know I'm improving myself, which definitely makes me happy.\n* **Journal the happy parts from my day before going to sleep.** I write three things I'm grateful for from the day, one positive experience from the day, and anything else that I want to record. I use the Day One app on iPhone/Mac so that entries will sync across devices. It's always fun to read back on the happy parts of my past few weeks. \n\n\nWhat does everyone else do? I'm always looking for new suggestions :)", "url": "https://www.reddit.com/r/happy/comments/2xi41v/what_daily_habits_do_you_do_to_make_you_happy/", "title": "What daily habits do you do to make you happy? Here's 5 things I do -- would love to hear yours.", "social_network": "reddit", "user": "minquigy", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1425162196, "permalink": "/r/happy/comments/2xi41v/what_daily_habits_do_you_do_to_make_you_happy/", "nsfw": false, "first_save": 1635438913.6922848, "replies_charged": false}