{"id": "t5_2qh5i_t3_2kbpyz", "request": ["af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "Take everything in this post with a grain of salt. Most of the information provided is from scientific research, but I also took some notes from some less credible sites. The text with parenthesis are my personal comments and suggestions.\n\n\n**What can we do to become happier?**\n\n* Forgive and forget. Don't hold grudges\n* Create strong relationships with friends and family\n* Have a passion and develop a skill\n* Don't compare yourself selves to others. (get off facebook!)\n* Love yourself. (compliment yourself. recognize your positive characteristics)\n* Be appreciative and grateful for the big and little things in life. Create a list at least once a week of the things you are appreciate.\n* Be optimistic\n* Don't predict when you will happy/unhappy. We tend to overestimate when we will be happy/unhappy. Avoid phrases such as \"I will be happy when X\" and \"I would be much happier if I was Xing\".\n\n\n**Things that we think will attain us happiness, but does not** \n\n* Money. Money doesn't make you happy, but the lack of money makes you unhappy. (In other words, unless you are in poverty, money isn't very important)\n* Fame\n* Personal aesthetic (how great our hair looks, how great our outfit is today, etc)\n* Material possessions\n* Power\n\n**Cool facts about happiness**\n\n* 50% of happiness is controlled by genetics, *10% by life circumstances that we can't control*, and 40% by our actions/attitude. (Only 10% of our happiness is dictated by our ethnicity, nose shape, height, foot size, and eye color!!!! Again, stop using phrases such as \"If  I was X, I would be much happier\" or \"People who are X are much happier than me\")\n* We have a \"base line\"/\"set line\" for happiness. We tell ourselves that we will be happy after X, but after we get X, we go back to being unhappy. We then set up a higher baseline to become happy. (Understand that you are capable to being happy RIGHT NOW)\n* Positive emotions prompts even more positive emotions. \n* Happiness \"undo\"s physical effects of stress\n\n\n\n**Sources**\n\n\n*  http://www.pbs.org/thisemotionallife/topic/happiness/what-happiness\n\n*  http://greatergood.berkeley.edu/gg_live/science_meaningful_life_videos/speaker/sonja_lyubomirsky/what_determines_happiness\n\n\n**Personal Thoughts**\n\nI have been practicing the art of happiness long before doing this research. The thing that helped me the most at becoming a happier person being appreciative of what I have. This single technique transformed me into a completely different person. \n\nBeing appreciative also helped me rid of \"If I X, I will be happy\" thoughts. It is very important to understand that we are capable of being happy in the now. ", "url": "https://www.reddit.com/r/happy/comments/2kbpyz/i_just_did_some_research_on_what_makes_us_happy_i/", "title": "I just did some research on what makes us happy. I thought I would share a summary! :)", "social_network": "reddit", "user": "RedSeed", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1414278666, "permalink": "/r/happy/comments/2kbpyz/i_just_did_some_research_on_what_makes_us_happy_i/", "nsfw": false, "first_save": 1635441996.9522834, "replies_charged": false}