{"id": "t5_2qh5i_t3_ppwd7a", "request": ["b0c0a1d6-df85-40fe-9afc-934b125e4d6a", "13a1dc62-9ccd-4970-8ffc-a9a073b3ec65", "e78e5c86-dbf1-4ab8-a98c-e9d544934b7c", "f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "This is where I’m at right now and I feel so lucky and happy to be in this quiet house in this cozy moment - I just had to share it with someone! I’m curled up in bed, just finished a good book. My cat is purring at my feet, it’s that perfect temperature where it’s chilly but not enough to shut the windows. There’s just a soft breeze so I’m fine by the window wrapped in a duvet. It was sunny all day and the bed is made up of fresh sheets that dried on the line, they smell like sunbeams and the forest. It just started raining and I’m in the room with the awning over the window that has that lovely pitter patter sound, the window cracked enough to let in that amazing rain smell, you know the one. I took a shower before bed, after deep cleaning the house yesterday and burning scented candles all night tonight which somehow adds to that extra clean feeling. I made dinner earlier, Italian with local produce, the herbs and tomatoes were from my own garden. My guy baked us an apple rhubarb crumble after while I did the washing up, with apples from our tree outside and rhubarb from the neighbour. I added some vanilla ice cream, we didn’t have enough of our own strawberries to bake with them too so they were a tasty fresh topping instead, divinity. We rolled a joint from the plant we just harvested from our garden and shared it afterwards. The cat got fresh catnip from the garden and tuckered himself out bouncing around chasing moths. I have the day off tomorrow so no alarms are set tonight. The coffee maker is set to go with coffee for the morning, every once in a while the breeze brings that fresh ground coffee smell by. We are deep enough in the woods now that I can’t see our neighbours, but I can smell that they have their wood stove going through the damp chilly night air as well. We don’t have to share our house with any roommates anymore, so we’ve left the music going in the far room for extra white noise. Radiohead in the rain is extra soothing you guys. There’s an owl softly hooting outside and a couple of tree frogs singing in the distance. We live close enough to the ocean now that every now and then I can also hear a foghorn going softly way in the distance by the lighthouse, we’ve been suffering a drought so it’s been a while since I’ve heard it. My guy is snoring peacefully and the cats purring has turned into soft snores as well, his little feet are twitching while he dreams.\n\nI’ve dealt with a lot of negative crap this past while, moved 13 times in the last 4 years, cross country in there too, and haven’t really had ‘home’ for a while. Living out of vehicles was part of the tougher times.. but soaking in the little things like this lovely night in keep me so very happy with my forested escape in my little comfy house and all the hard work done in getting here, and ready for the hard work yet to come. I hope you get a chance to stop and appreciate the little things you’ve worked hard to have today too!", "url": "https://www.reddit.com/r/happy/comments/ppwd7a/i_had_just_a_really_lovely_evening_in_my_cottage/", "title": "I had just a really lovely evening in my cottage in the woods and feel so very content right now, I have no one else to share this moment with!", "social_network": "reddit", "user": "whack_with_poo-brain", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 27, "down_vote": 0, "creation": 1631868070, "permalink": "/r/happy/comments/ppwd7a/i_had_just_a_really_lovely_evening_in_my_cottage/", "nsfw": false, "first_save": 1635441793.9067278, "replies_charged": false}