{"id": "t5_2qh5i_t3_e1ukpy", "request": ["d9021d56-8bfa-490f-87b8-52154c0b1b05"], "text": "It was a day I cannot believe actually happened.\n\n17 years ago, a friend of mine was getting married and wanted me to play guitar with one of her female friends who had a semi-professional singing background. We were asked if we'd learn and play their wedding dance songs to which we obliged. We were introduced and set about practicing 2 songs for the wedding, but played so well together we ended up doing 30 songs. \n\nI was married at the time, so we forged a healthy platonic friendship built on music. She soon met a man and they had children together. We continued being friends and hung out regularly within our group of partners and the like. I had children too.\n\nMy marriage ended, and I went through a few years of on-off relationships. Soon I met someone else who I was with for a few years. In this time, her relationship ended. We lived in different cities at this time as we were both tied to the parents of our children by shared care arrangements, so rarely saw each other. Then some time later, my relationship also ended. During all this time, our friendship had always been close but the distance guaranteed we never crossed any boundaries. I love that we could both trust each other to be respectful in this sense. Whenever, we caught up, we'd play music together... often for our friends and family. \n\nFor the first time in 17 years, we were single at the same time, albeit in different cities. By phone and by text, we kept chatting and became a support for each other. We shared stories of our kids and the difficulties of being a single parent. Finally, we agreed to meet again at a halfway point, in what was to become (unexpectedly) our first date. \n\nWe're 47 years old each, and feels like a lifetime of changing experiences and good luck brought us together at the right moment. I always loved this woman in the right way, but this was the first time I could express it to her, and for her to me, appropriately.\n\nThe feeling of a first date with someone I was already in love with was so powerful. I was worried it would be awkward, but it was so incredibly natural. We know we can trust each other, we know our stories, we know our goals. On this date it all came together, and we kissed for the first time. It was one of the most beautiful nights of my life.\n\nJust so happy right now. \n\nOur mutual friend is also very chuffed that her wedding singer and guitarist from 17 years ago finally hooked up.", "url": "https://www.reddit.com/r/happy/comments/e1ukpy/my_first_date_with_someone_im_already_in_love_with/", "title": "My first date with someone I'm already in love with.", "social_network": "reddit", "user": "McMayhem27", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 44, "down_vote": 0, "creation": 1574753251, "permalink": "/r/happy/comments/e1ukpy/my_first_date_with_someone_im_already_in_love_with/", "nsfw": false, "first_save": 1635442650.225874, "replies_charged": false}