{"id": "t5_2qh5i_t3_15wyf6", "request": ["89f969a3-3a22-4eff-8a40-d1d5b9658c57"], "text": "Circumstances with growing up and my parents getting divorced when I was younger resulted in never seeing my extended family for a little over a decade.  I think the worst part was after finally getting to see them this last christmas was the entire time they were only an hour and a half away from me.  \n\nSo I've been an introvert most of my life, whether that was because I lost most my family through divorce or something else it doesn't matter.  I've never much had an affinity for letting any emotions show and a half decade of emotional abuse from my stepmother meant I graduated high school with no close friends or family.  So I enlisted and left almost immediately.  To make a long story short I've been more and more depressed after having to move across the world year and year and never have any close family to be close to so for the last couple of years I've been working to become more open.\n\nThis christmas I took some time off to go back home, luckily I only live a good ten hours away, and visit some family I've only spoken with lately over Facebook.  My brother, who is much more of an extrovert then me, came along with me and my mother who I again, haven't seen in many years.  Because I was feeling pretty high of myself lately and the fact that after years I've gotten into shape and put myself on a good path I didn't tell any of them we were going to come visit.\n\nIt was an amazing experience for all of us.  Though it left me more depressed then I was before I think, at least for a moment.  I got to see my mothers mother, her three sisters and brother and all of their spouses and kids. So it was a pretty big family reunion I would say.  If anyone had ever seen a Youtube video of soldiers returning home and seeing their families reactions I can tell you it once just like that.  One of my aunts froze for a good three seconds (a long time actually) and my uncle was at a loss for words while stumbling over them.  I was ecstatic seeing them like this in truth, was glad someone cared that much for me and my brother.  \n\nNow, what I was saying earlier about this reunion making me more depressed.  I got to see my cousins that I have never met and they weren't newborns or babies.  These kids were teenagers and long past the age where we've should have met.  I did have one cousin though that I've seen before our family had split, a couple of years older then me.  It was great seeing her again and getting back in touch with family.  The depression only lasted a short while though when I saw my cousins for the first time, the euphoria of meeting new family made me more happy then depressed.  \n\nA couple of pictures of myself, my brother and our 'new' cousins and my uncle.  http://imgur.com/a/QRvjD  \n\nTl;DR:  I spent years running from family only to grow depressed.  Changed my life and surprised them during Christmas.  Introvert = alcohol though.     ", "url": "https://www.reddit.com/r/happy/comments/15wyf6/finally_saw_family_after_a_14_years_away_from/", "title": "Finally saw family after a 14 years away from each other (Late Christmas Post)", "social_network": "reddit", "user": "Zombi_Sagan", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 18, "down_vote": 0, "creation": 1357254020, "permalink": "/r/happy/comments/15wyf6/finally_saw_family_after_a_14_years_away_from/", "nsfw": false, "first_save": 1635440654.6020966, "replies_charged": false}