{"id": "t5_2qh5i_t3_bkvi0f", "request": ["af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "New mobile user, idk how to format but essentially heres a life story\n\nSo, I am a 15 (16 in a week) year old Male, my life definately hadnt given me a very good hand for cards. Shortly after I was born we found out my mom had cervical cancer, 4th grade she got breast cancer, my dad had a drinking problem from PTSD and I had been failing all my classes, I always tried to be laid back and happy but life never really liked that, my moms cancer got very bad multiple times, brain tumors and stuff of the sort. She has been hospitalized many times and has also lost all of her memory multiple times, it's never fun. But my mom is the strongest person I know, and I know she'll make it through this.\n\nRecently (2 months ago) I started anti-depressants, I take lexapro and it's been working for me. I've been so much more happy and upbeat, I have an amazing girlfriend (ik highschool relationships dont usually last but yknow, I hope it does) I've been bettering myself and plan to get a job once i turn 16, I'm going to also start going to the gym and get all my grades up next year. I had never cared about my grades up until now, when it was sadly. Too late. I failed all my freshman classes and now all my sophomore ones, I'm doing summer school and drivers ed this summer as well as going to my dads a lot (hes sober now and is moving in to a new place, where he has a workshop. I love to make stuff and take stuff apart) I will be getting my grades up, doing forensics and drama, and I have plans for my future for the first time in literally ever, I finally want my life to be good and I'm bettering myself any bit I can, this lexapro has helped me so much with my good vibes and just being better in general and I wanted to share, my plans for my future are computer science/programming and theatre (Kansas Wesleyan College). I've always had lots of potential but just never cared, and I'm finally caring and applying myself. I've never been happier and I'm gonna continue getting happier, every bad thing has a bright side, even when my mom faints or has a seizure, almost forgets everything. It hurts. But I know we will make it through it, I always keep good vibes and my optimistic outlook\n\nSorry for the super long post\n\nGood Vibes All Around!✌\n\nPhoto: https://www.reddit.com/r/happy/comments/bkvfca/2_months_on_antidepressants_and_ive_never_been/?utm_medium=android_app&utm_source=share", "url": "https://www.reddit.com/r/happy/comments/bkvi0f/2_months_and_antidepressants_and_ive_never_been/", "title": "2 months and anti-depressants and I've never been happier", "social_network": "reddit", "user": "BagelDip", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1557045081, "permalink": "/r/happy/comments/bkvi0f/2_months_and_antidepressants_and_ive_never_been/", "nsfw": false, "first_save": 1635441986.7504702, "replies_charged": false}