{"id": "t5_2qh5i_t3_7v7xjd", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "Story time...\n\nMy dad is battling ALS and he fought for a week in the ICU after another local hospital really treated him very poorly and left him in bad shape after a routine feeding tube procedure. He had a spell after he was discharged where he couldn't breath. At one point I thought he was leaving us and had to give him mouth to mouth while we waited for the ambulance. He says I saved his life. All he wanted after the two long days in the hospital was to be home again, and I watched him being taken away to a new hospital from our driveway. I stayed with him the next night, making sure he was comfortable. During the night, I was contemplating the inevitable, and I learned something very important and profound. The deep love I felt for him would one day be matched by the love of my children. I found comfort in that realization. When he was moved to the ICU and was under their watchful eyes, I went home the next night and burned some tobacco for a prayer around a campfire (I'm not really religious, but desperate times call for desperate measures.) I prayed that he would be able to come back to the comfort of his home. As I did, a pack of coyotes began howling. It was so surreal. It felt like the whole of Nature was behind my dad, fighting for him just like the rest of us.\n\n\nIt was a roller coaster of a week, and I was back and forth between total confidence to none, but soon everyday he began improving a little bit everyday. Everyday was a new level of happiness. I was able to watch hockey games with him and he was regaining his sense of humor, all the while being given truly exceptional care by an amazing group of nurses and doctors. I have to write them all a letter today expressing our gratitude. They believe that it was a blood clot in the lung caused by the fact that the other hospital didn't roll him or move him at all during his stay, but my anger towards them slowly faded while I was filled with hope and happiness watching my dad improve. Home was on the horizon.\n\n\nWe were finally able to bring him home Friday. Don't tell my wife this, but it was the happiest day of my life. We laughed, we cried tears of joy, we got to listen to music, got to play on youtube and watched his [favorite video](https://youtu.be/J_CyG9MyDxA), and best of all we get to watch the Super Bowl today!! Second chances don't happen often, and were getting one right now. \n\n\nI know our fight is still an uphill battle, steeper than its ever been before, but all we wanted was for him to be at home again, and our prayers were answered. And I'm feeling happiness that I have not felt in a long time, and I'm sharing it with everybody that I can. And be sure to tell the people that you care about that you love them! ", "url": "https://www.reddit.com/r/happy/comments/7v7xjd/its_been_a_long_weekbut_it_turned_into_the/", "title": "Its been a long week...but it turned into the happiest day of my life.", "social_network": "reddit", "user": "mijreggin", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1517764069, "permalink": "/r/happy/comments/7v7xjd/its_been_a_long_weekbut_it_turned_into_the/", "nsfw": false, "first_save": 1635440707.7337472, "replies_charged": false}