{"id": "t5_2qh5i_t3_em6x0b", "request": ["4161666b-4b17-4c22-bb40-42efca26f347", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "I was walking back to my dorm from class while listening to the song “High on Humans” by Oh Wonder. The song is basically about how interacting with complete strangers in simple ways can be a really positive experience. The singer/songwriter got the inspiration when she had a conversation with some random people on a train about what condiments they put on their food or something. I’ve been listening to the song a lot lately, and it has made me realize that I am always surrounded by all kinds of interesting people, and that having a simple conversation or even just smiling at someone can be very fulfilling. So anyways, when I was still probably fifty feet away from my dorm door, I noticed a girl was holding it open for me. She had no idea who I was, yet she had the biggest smile on her face while she waited for me to get there. I could just tell from her smile and the way she said “your welcome” that she must have been having such a great day. Her mood was so contagious, and the fact that this happened while I was listening to “High on Humans” made it even better. The interaction made me so happy for the rest of my day. I’m hoping I’ll see her on the sidewalk or something again, cause I’d like to let her know that she brightened my day. I don’t know why such a simple little interaction made me so happy, but it did!\n\nThis probably seems like a very insignificant event and I’m not sure I have the creative writing skills to really capture the moment, but I wanted to share.", "url": "https://www.reddit.com/r/happy/comments/em6x0b/a_simple_interaction_with_a_stranger_that/", "title": "A simple interaction with a stranger that brightened my day!", "social_network": "reddit", "user": "o___o__o___o", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1578558751, "permalink": "/r/happy/comments/em6x0b/a_simple_interaction_with_a_stranger_that/", "nsfw": false, "first_save": 1635440976.1298747, "replies_charged": false}