{"id": "t5_2qh5i_t3_keoo71", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "My dad was diagnosed with COPD this summer and it really hit me hard when I found out. He's been on a CPAP machine for some years now was prescribed breathing treatments and an inhaler before switching to a new doctor and being tested. He'd been having breathing problems since last winter and the rest of the family and I have been really concerned about it. He's never been one to go to the doctor much or seek medical treatment when he probably should. He's been overweight most of his life and worked a career for nearly 30 years that has a low life expectancy due to stress related health issues. \n\n I wouldn't say I have a favorite parent, but I did have a nightmare when I was a teenager where my dad had passed away and now the thought of losing my dad has been one of my biggest fears. I've cried about it occasionally and really only talked to my husband about that concern. I've dealt with that fear haunting me for over 10 years. \n\nOver the past 4 months, he's started a new medication for his COPD and has been eating healthier. He's lost 80lbs and has had noticeable changes in the activities he can handle. Just a few months ago, he couldn't catch his breath and almost passed out after moving mattress to their basement and would have to to take breaks to use his inhaler while mowing the lawn. It was almost to the point I considered buying him a riding mower next year if he didn't get himself one. Now we don't have to worry about him using the push mower and he's able to move furniture and play with my kids. He often volunteers to take care of things more too, like taking the grandkids or dog outside to to play. He even brought over a ladder to my house and helped my husband clean out the gutters just because I asked him what was causing the stains on our ceilings on one side of the house. Turns out the downspouts were clogged and causing water to back up into the eaves. Months ago, we would just borrow the ladder and my husband would take care of it. This time he just showed up one afternoon and started working on it during his lunch break. He probably would've done the whole thing if he didn't have to get back to work(even after retirement, he still likes to have a job.) My husband ended up finishing the task so my dad could come by later and pick up the ladder. I'm just really excited to see my dad doing so well now and feel like he's a lot like he used to be when I was a kid and he would teach me how to swing a bat and how to catch and throw a baseball or football. I'd bug him to play catch with me when he'd get home from work or on his days off. I also grew up being his fishing buddy and spent a lot of quality time with him. He's someone I've looked up to my entire life and is the reason for my strong work ethic. He's always taken such great care of the family and taught me the most about finances, credit, and other life skills and I honestly don't think I could be as far in life without his guidance and help when I've struggled to get back up on my feet. \n\nWhen he first told me about his COPD, I was afraid of losing him sooner than I ever thought and that he wouldn't get to see his grandkids graduate high school. Seeing his improvement gives me hope that we'll still have him around much longer now and my kids will have an awesome childhood full of wonderful memories with their grandpa. Plenty of fishing trips, baseball practice, and life skills lessons for my kids for years to come. Being a dad has always brought him joy and now he's got more energy to keep up with the grandkids. I'm just so proud of him and am happy to see how well he's doing now.", "url": "https://www.reddit.com/r/happy/comments/keoo71/my_dad_is_being_more_health_conscience_and_i/", "title": "My dad is being more health conscience and I couldn't be more proud of him", "social_network": "reddit", "user": "Aurie37", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1608173593, "permalink": "/r/happy/comments/keoo71/my_dad_is_being_more_health_conscience_and_i/", "nsfw": false, "first_save": 1635442845.9512596, "replies_charged": false}