{"id": "t5_2qh5i_t3_b44001", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "To begin, I’m a bit of a fuck up. I graduated high school in 2013 with really good grades, had AP courses so I was going into a university with a Semester already in the bag. It took one semester, 14 credits, for me to learn that I had absolutely zero self discipline. I made it halfway through my first semester and just lost all ability to do school work, just had zero motivation or drive. went to parties and had fun with friends, played games... just stopped school entirely while still attending.  I failed those classes. Academic Suspension. Tried again next semester. Same thing. Academic probation. Moved back in with mom and dad, couldn’t have been more depressed and had zero self worth. Got a job at UPS, absolutely hated it. Got so fed up with hating myself that I said fuck the consequences, joined the National Guard without telling anyone, in the hopes I’d have an income and fix myself in the process. It worked. Passed Basic, Was fit, Was motivated. Went to Advanced Individual Training (AIT for short) graduated top of my class 99%GPA Maxed out PT 300+ extended scale. Let’s go start school again at a community college. Same thing happened... again.\nAlright, get a job as a manager of a sandwich shop while I try to figure shit out.. flounder around for 4 years bouncing from part time and seasonal jobs ( often 3 at a time to pay bills). \n\nUntil a month ago. I put my resume on indeed, and a contracting agency finds my resume, sees I have 4 years of experience in the guard and likes the look of my resume enough to pass me along to the company that actually wanted to hire me. This would be my first “real” job ever. In an office setting. What the hell is happening.\n\nMonday rolls around and i wake up for the first time in 5 years, where I don’t have muster up the courage to battle back my depression and lack of will to live. It’s been the hardest part of the day, every day, for half a decade. I go to work, and I’m not going to lie to you... it was fucking amazing. I felt important and, I had energy, and I started cleaning up the house when I got home. Tuesday rolls around, it was even better than Monday. I cleaned out my car unprompted, called my parents and started budgeting how i can afford things to improve quality of life around my house, planned out tasks I wanna get done... Every single day this week has been better than the last, and I’m just so damn happy I had to share it with someone. Thank you for your time. \nTL;DR I messed up my life for the past 5 years someone took a chance on me and gave me an amazing job with amazing people and I couldn’t be happier.\n\n\nEDIT: I’ve never gotten a silver before!! Oh my god my day just got even better. Fake internet points win. Firstly I’d like to thank the mysterious stranger, and secondly I’d like to thank my dog for always being there and cheering me on with that blank stare of his. Honestly though, thank you!", "url": "https://www.reddit.com/r/happy/comments/b44001/started_to_get_my_life_together_and_suddenly/", "title": "Started to get my life together, and suddenly everything is a whole lot better.", "social_network": "reddit", "user": "zgunit", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1553254575, "permalink": "/r/happy/comments/b44001/started_to_get_my_life_together_and_suddenly/", "nsfw": false, "first_save": 1635438834.5426006, "replies_charged": false}