{"id": "t5_2qh5i_t3_my15vu", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a", "c889a480-189a-4ed9-aa88-81c300413196"], "text": "Got it on sale too!!!!     16 dollars marked down from 65!! \n\nWhat a gem of a little game this is. It brings me back to how I felt when I first played Portal 2, one of my favorite games.  I am a stickler for the \"classic\" era of puzzle solving/adventure/platforming games where you either solve increasingly difficult puzzles/challenges and/or collect things along the way to open up new areas.    Think along the lines of Crash Bandicoot,  Spyro The Dragon, Jak and Daxter, and Yooka-Laylee!   And then there's the survival horror classics like Resident Evil and Silent Hill before they turned into hardcore action games. \n\nDon't get me wrong, I love other types of games too, but there's something ultimately satisfying about the replayability of these other types. At least for me! I tend to get bored easily by RPGs where you walk around and go on \"looting\" quests and constantly upgrade your character. \n\nWhat is making this moment so special for me, however, is that it is sparing me the agonizing anxiety and depression I was feeling due to these lockdowns (up in Ontario,  Canada). I can distract myself, immerse myself, and I genuinely feel much calmer and content. This is how I used to be when I played video games as a teenager and child, but lately, I struggle to find a game I'm willing to spend money on, especially because of the reasons mentioned before. \n\nThe humor in Portal made me laugh my ass off and I can still smile when I randomly think of quotes from it, and the philosophy in THIS game really makes me think, as well as the  scenery making me feel calm. \n\nVery good game, and I can't wait for the sequel!", "url": "https://www.reddit.com/r/happy/comments/my15vu/i_bought_the_ps4_game_the_talos_principle_and_i/", "title": "I bought the PS4 game : \"The Talos Principle\" and I have been in puzzle-solving heaven for two weeks now!!", "social_network": "reddit", "user": "masterofmydomain89", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 1, "down_vote": 0, "creation": 1619326407, "permalink": "/r/happy/comments/my15vu/i_bought_the_ps4_game_the_talos_principle_and_i/", "nsfw": false, "first_save": 1635439311.1147575, "replies_charged": false}