{"id": "t5_2qh5i_t3_10fc8u", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "A little back story for all of you wonderfully happy people: I recently moved three hours away from my home to attend school at Sonoma State University. Just like the majority of all college goers I took out student loans to make this happen, and although this has never gotten me down (as the loans are the only reason I'm even able to be in college right now) I decided not too long ago that I was going to do everything I could to not have to accept any more loans. \n\n\n*Insert long and tedious montage of endless internet searches and online applications with those god awful questionnaires*\n\n\n Fast forward to yesterday, wherein I received an unknown voice mail while meandering about our local Renaissance Faire. Apparently, while attending to work as a head manager at The Ol'e Raley's grocery market, my roommate received a call from one of their recruiters asking if she knew anyone looking for a job. Bam! I was on the schedule by 9 last night. \n\n\nGranted, it may end up being temporary BUT $12 an hour and an average of 40 hours a week is pretty damn rad! I'm so happy and grateful that it's ridiculous!\n\n\nThank you for letting me share my good news with you! I hope you all have equally awesome scenarios unfolding in your lives. \n\n\nHere are some bonus Renaissance Fair pictures of me before I got the news and was super happy anyway.  :)\n\nhttp://imgur.com/a/CTbUn#0", "url": "https://www.reddit.com/r/happy/comments/10fc8u/after_months_of_searching_i_finally_got_a_job_a/", "title": "After months of searching I finally got a job! A $12 an hour job to boot!", "social_network": "reddit", "user": "hp_indahood", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 38, "down_vote": 0, "creation": 1348537125, "permalink": "/r/happy/comments/10fc8u/after_months_of_searching_i_finally_got_a_job_a/", "nsfw": false, "first_save": 1635441327.9778442, "replies_charged": false}