{"id": "t5_2qh5i_t3_orua8v", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a", "2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "TLDR; I'm so tired, but I can't leave my little girl.\n\nMy daughter is a few months shy of turning 2 years old.  She's normally been a great sleeper and has given us very little trouble at nightimes (or at least compared to some of the stories I hear from our parent friends - I know how lucky we are in this regard). Anyway, the last few weeks have been a slightly different story. I don't know why but she's been waking up and crying out for us in the night a few times more.\n\nOther than her nightime waking, she's also not been napping properly durng her day (denying us those precious few hours to get some jobs done without being interrupted or just having a quiet coffee). On top of this, both of our jobs have been horrendous (my wife and I work in health care, which is a tough sector to work in during a global health crisis). My wife is also recently pregnant and dealing (very admirably) with the whole morning sickness thing (I don't take for granted that she has a much tougher deal than me - you women are awesome!).\n\nAnyway, when my daughter called out for me an hour ago (it's 3 o'clock in the morning BTW), I had to steel myself to go into her room and settle her calmly. Anyway, I'm on her bedroom floor right now, watching her sleep and I've got my hand poking through the bars of her cot - she's holding my finger tightly and squeezing them every now and again as she breathes. \n\nThe thoughts going through my head are these - one day, far sooner than I'd like I'm sure, she's going to want me to \"LEAVE ME ALONE\" because \"you're so embarrassing\" or \"you just don't get it!\". Lol. So, although I'm tired, I want to go back to sleep and God knows how I'll manage work tomorrow, I really don't want to let go of her hand. Ever.", "url": "https://www.reddit.com/r/happy/comments/orua8v/being_daddy_is_hard_but_its_the_best/", "title": "Being Daddy is hard, but it's the best...", "social_network": "reddit", "user": "Splooie04", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 39, "down_vote": 0, "creation": 1627286725, "permalink": "/r/happy/comments/orua8v/being_daddy_is_hard_but_its_the_best/", "nsfw": false, "first_save": 1635439285.4157856, "replies_charged": false}