{"id": "t5_2qh5i_t3_dsr8dq", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "“I’m standing in an ocean of grass which sways across the surface. Electricity is building in the air, collecting all around me. As each of the ten thousand blades brushes against one another, they zap, sending waves of electricity rippling across the field. The fine hair along my arms and the back of my neck stand lengthwise, blue currents flowing across them like the greenery.\n\n“The breeze builds to a billow, whipping my hair in every direction. The clouds darken. Their lazy nature intensifies, transforming from puffs into tunnels. Swirling tubes begin to form, arching wide as they plunge to earth.”\n\nJames sweeps his hand out to animate the effect. He always acts out the scene for us, using body language to direct our imagination.\n\n“As each tornado descends toward the ground, lightning shoots upward from the grass and connects to each cyclone’s base in spurts. Hundreds of strobing tunnels swirl across the valley, tenaciously shredding the floor below. Turf uproots with dirt, sending electricity and earth flowing in skyward spirals.\n\n“A tunnel approaches me. I lift my hands to protect my face as it swallows me up. Inside, the wind blows so furiously that my eardrums shatter against the onslaught. Air whips like leather across my hands and my face, the dust like millions of tiny spears.\n\n“Suddenly, it stops. I’m left standing in the eye of the tornado. Cautiously, I opened my eyelids, only to find that the storm had completely died out. The valley floor was empty. Not only had the clouds dispersed, but the grass is gone as well. Where there was once energy and life, there is only tilled dirt.\n\n“The night sky is full of uncountable stars, with air so clear that the cosmic plume of our galaxy’s halo can be made out.\n\n“An orb of light appears from the canopy. At first, it is too faint to detect, camouflaged by the background. Growing, bigger and bigger, it isolates itself, descending from the stars until it is floating before me. Its light illuminates the dirt below, forming a glowing disk on the tilled soil.\n\n“As light touches the surface, a green sapling hatches from the dirt. Smaller than your little finger, it pierces the ground and curves toward the sphere.\n\n“Twisting and growing, it pirouettes upward, leaves multiplying along its stalk. At the tip, a bulb forms, reaching toward the life light. Opening like the first stretch after a night’s sleep, the bulb sends scarlet petals with brazen yellow stripes outward to embrace the glow.\n\n“More saplings spring up, and more, spreading outward until they fill the light’s periphery. A bouquet of life opens in a wave from the center, the red and gold from the first flower joined by every other color imaginable.\n\n“Above them, the orb’s surface is a milky whiteness which swirls and shines simultaneously. Heatwaves flow outward from it in every direction, causing the flowers on the other side to ripple and contort like a mirage.\n\n“The peaks in the distance drop away, creating an expanse that extends, seemingly infinitely. This orb and I are alone in a vast desert, void of any vegetation except the circle below my floating companion.\n\n“I reached out to touch the ball of light. Immediately, it shot upwards into the clear sky.\n\n“I felt a pulling in my chest. Rising off the ground, I followed behind the orb. We float on, heading into the stars. I looked down and watched the circle of flowers shrink until it was no bigger than a pinhead.\n\n“The horizon connects, and I’m left staring at the planet’s entirety.\n\n“The moon’s pocked surface comes into focus. Mountain ranges dress the pale rock, forming valleys and summits scarred with craters. I find you both sitting at the rim of a crater, legs dangling into the concave, heads held back in laughter. I land on the white sand, standing behind you.\n\n“In that instant, everything in the universe made sense. I had no question as to why we are here, where we came from, or where we go.\n\n“Everything just... was.”\n\n[https://www.amazon.com/gp/product/1701666774/ref=ppx\\_yo\\_dt\\_b\\_asin\\_title\\_o01\\_s00?ie=UTF8&psc=1](https://www.amazon.com/gp/product/1701666774/ref=ppx_yo_dt_b_asin_title_o01_s00?ie=UTF8&psc=1)", "url": "https://www.reddit.com/r/happy/comments/dsr8dq/after_hundreds_of_hours_im_pleased_to_announce_my/", "title": "After hundreds of hours, I'm pleased to announce my very first publication, \"Lucid.\" Here's a quick excerpt from one of its more visualistic scenes:", "social_network": "reddit", "user": "JFBennett", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 14, "down_vote": 0, "creation": 1573095219, "permalink": "/r/happy/comments/dsr8dq/after_hundreds_of_hours_im_pleased_to_announce_my/", "nsfw": false, "first_save": 1635440706.7240481, "replies_charged": false}