{"id": "t5_2qh5i_t3_hnkkjf", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a"], "text": "I have something to share as I've been looking for a place to post this story for a while now, this story happens at the beginning of 2020 and my life have never been the same, from just living my life day to day to actually looking forward to the next day.\n\nOkay so where do I start. I've been living a bachelor lives here in California almost 3 years now and to say that I enjoy it is an understatement, i own a 4 bedroom house with a large backyard for gardening and for my dog (Italian Mastiff) to run around, the number of bedroom is for my family when they come visit, I also own several real estate that I have been renting out and make a decent amount of money out of it and the job that I'm currently doing pays in the ranges of mid 6 figures and I get to set my own time, I also have some stock bonds and shares from companies and businesses that I've been investing but even still I'm just doing all of this cause I can and I got nothing better to do, now don't get me wrong I love my dog and house but they are just that; some thing to pass my time with.\n\n5 month ago before the lockdown; I got a knock on my front door at first it was weird who when I open the door I was surprised that it's this girl lets call her Jade. jade is an escort I met when I first came to the state 9 and a half year ago to pursue my Phd, I was ecstatic about the whole idea of having sex for the first time since I spent a lot of my high school and college year prepping for my field of study (Biomedical engineer) and I live most of my life in a rather conservative country in South East Asia and the fact that my family also have a very traditional (my family are of Chinese descent) approach when it comes to having relationship; which means that you only have sex with someone you want to marry even if you're a male as having a child out of wedlock (sometimes accident happens) are very frown upon, my parents have made it very clear to me that as long as I lived a single lives, sex should be the last thing on my mind.\n\nJade has been to me my go to escort if I just want to have sex without going to bar picking up girls I would always call her up, even as an escort she and I connect emotionally. jade and I have known each other for years before I move from Boston to Cali as I finish my Phd and got a job offer here in the west coast before we part ways we had one final sex that lasted for an entire weekend. when Jade show up she was holding 2 little girls she came up to me shaking and immediately ask if she can come in so I obliged and make her a tea to calm her, after drinking she try to reminisce about our past stating that unlike her other client I never make her fell uncomfortable and treated her badly, however as I try to catch up with her she shut me down by diverting the conversation back to stuff about what a good person I am to the point that I feel uncomfortable.\n\nAs I have a meeting in work today I told her that she can stay and make her self feel like home, I then show her the room she and the girls can use and I told her that I'll be back before 5pm, deep down I already know where these is going but I just doesn't know what to do or say. that evening I came home to a clean house and 2 cute little girl laying on the couch watching tv next to my dog and a nice smell of a home cooked meal; an authentic Chinese meal not the one you get at Chinese restaurant in the state which have been modified to please the masses outside of china and a clean kitchen, after we ate she take the girls to clean up and brush their teeth and we all actually sit down and watch TV together before she takes them to bed.\n\nSometimes around 8 after the girls went to bed she told me that we need to talk at first she asked me what do I think about the girls, I told her that I really like hanging out with them and before she can say anything I ask her if they are mine. she breaks down in tears telling me how this past 3 years have been a living hell for her. her parens passed away when she's 12 and she lived with her aunt ever since, that part I know about however what I didn't know is that her cousin are sexually abusive and the moment he found out that she's pregnant he's been physically abusive toward her so she fled out of fear and has been living with her fellow ex-escort friend Cammy, I know Cammy as Jade, her and I once had a threesome together.the moment she gave birth to our daughter, Cammy and her boyfriend have been asking her to go look for me and asked for child support since the two of them have been planing to move in together and start a family, and can no longer have jade living with them and since I don't have a social media presence only Linked-In also I've changed my number many times she has been trying everything to get in touch with me. as soon as they found out about my whereabouts Cammy and Her boyfriend drove her all the way from Boston to Cali with our 2 daughter.\n\nAfter hearing everything that need to be said, she told me that she understand if I didn't believe her and i want a paternity test or even didn't want anything to do with my daughter as my grandfather might disown me. I shut her down and told her that I definitely want a paternity test and if they are really my daughter I will take responsibility, if not I will still support her until she can stand on her own as for my grandad situation (**he is very Traditional**), I told her that since she's half Korean (East Asian), were not in a same sex relationship and the fact that she don't do drug not even smoke, the worst he will do is give the right to the main family estate to my younger brother, which is not a big deal for me anyway since I live in the state the the main family house is in Asia.\n\nImmediately the next three day I make an appointment for a paternity test and the following 2 weeks I got the result and they are mine, I am thrilled we then takes the girls out for some fun and as soon as we arrive home and she put the girls to bed I jumped at her and kissed her like her lips were air and I couldn't get enough of it, she looked at me in shock because the past weeks after we've been reacquainted I had been acting like I don't care. I told her that I've been acting that way to soften the blow in case the kids were not mine and it doesn't matter anyway since I'm still going to adopt them even if they are not mine. I told her how after arriving in Cali I've only had sex twice and never really liked it and for almost 3 years I have basically no sex drive at all until when she came back to me. she looks at me then tears rolls down her eye she, say she loved me and I told her I've loved her since before I moved to Cali and have actually Been contemplating to ask her to move with me but I don't have the guts to do so since I don't know how she feels, we continue to kiss and that night I had the best sex I've ever have in my entire life.\n\nI call my dad the next day and told him everything. I was expecting to get yelled at for starting a family with a prostitute but all my dad ask is that is she still an escort or have she quit her job, I told him she wants to be a stay at home mom, and she agreed to sing a prenup as money is not really a big deal for her and we just want to spend the rest of our lives together. my mom then asked me if I'm happy, I told her yes. they have been having a FaceTime meeting with my fiancé (that's right I propose, we will Get married after the pandemic dies down, and she would love to have a traditional Chinese wedding at my hometown), and they love her, they spend the entire afternoon talking about how they think I was gay since I never been in a serious relationship with girls despite being the oldest, while all my other siblings are married at the age of 26 and have at least 2 kids after getting a stable job and are actually glad that I found someone and my parent's cannot wait to meet their granddaughter and as my other siblings as well, our daughters was habit overwhelmed as well after meeting everyone since only know of her mom as their family and now they have this huge family that really loves them an can't wait to meet them. my granddad have asked after looking at my fiancé if she's white, I told him she's mixed of Korean-American and she was born here, after a moment of silence he just nods in approval.\n\nNow five months of living together I have never been happier, I have 2 very beautiful, wonderful and smart daughter, an amazing sex life with a wife who loves everything about me and are very eager to learn about my culture and a baby on the way.", "url": "https://www.reddit.com/r/happy/comments/hnkkjf/single_m45_lives_in_cali_found_out_i_have_twins/", "title": "Single (M45) lives in cali. Found out I have twins daughter (F2) from wild weekend with an escort acquaintance I've been with for almost 6 years when I was (36) and she's (24)", "social_network": "reddit", "user": "Snoo_21792", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 23, "down_vote": 0, "creation": 1594226911, "permalink": "/r/happy/comments/hnkkjf/single_m45_lives_in_cali_found_out_i_have_twins/", "nsfw": false, "first_save": 1635439327.1872473, "replies_charged": false}