{"id": "t5_2qh5i_t3_8and06", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "I've struggled with depression, anorexia, and self-harm since I was 15, and truly saw no way things would get better. I got too sick to put effort into life, and dropped out of school halfway through grade 12. I moved out to live on my own when I was 17, because I just wanted to get away, and thought it might be easier to die if I distanced myself first. I got a job, and went day-to-day, getting high every night and generally feeling crappy. It's been a year and a half since I moved, and since, I've started to try at life a little more, but still didn't feel 'normal'. This past week, though, has been one of the best I've had in a long, long time. I officially adopted Clive, the cat I had been fostering for four months, after his ulcer healed, I'm working towards management at my job, and started doing online schooling to complete my high school diploma. I applied to university for drawing and painting on a whim, with a cobbled-together portfolio and little hope of getting in. Yesterday, I got news that still feels utterly surreal: I got accepted for September, and for the first time in ages, I'm actually looking forward to something. I can't wait to expand my skills, and meet like-minded people I never could growing up in a small town. It's been hard, but things are finally looking up. Hang in there if you're struggling. It's cliche, but things really do get better. Good vibes and love to you all", "url": "https://www.reddit.com/r/happy/comments/8and06/after_years_of_feeling_life_wasnt_worth_living_i/", "title": "After years of feeling life wasn't worth living, I got an email that has me floating a foot above the ground", "social_network": "reddit", "user": "wheelofmilk", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 26, "down_vote": 0, "creation": 1523157229, "permalink": "/r/happy/comments/8and06/after_years_of_feeling_life_wasnt_worth_living_i/", "nsfw": false, "first_save": 1635442881.0779889, "replies_charged": false}