{"id": "t5_2qh5i_t3_q3egdg", "request": ["d616ef6b-b663-4224-82e4-e87b0aff3562", "5bcd7a82-c8bf-45e5-9556-cc778b964467", "2293bc08-7671-4d63-b63f-dbe4a3a4858a", "0c4243d9-adb2-4db8-bf87-57a87f62e968", "d9021d56-8bfa-490f-87b8-52154c0b1b05"], "text": "I want to preference this with an apology if I've Broken rule one :3\n\n&#x200B;\n\n**Background.**\n\nSo a little background on myself, I'm obviously not going to get into the whole detail for detail story of my life in order to not bring down anyone who's reading this and having a lovely day but here is the basics. When I was born, I had some complications at birth causing me to have a stroke down the entire left side of my body. the  moment I was born, I received PT/OT which lasted until I was probably 10 or 11.  Around that time, My family moved to a completely different part of the country. When I got into the new school district, I did not participate in physical therapy because I was scared of being made fun of. Which everyone did regardless.\n\nFast forward a few years and I'm in Highschool now, I've been through a lot. I was a rather self loathing person at that point in my life. I lost my best friend, my brother, to college at that point and was not feeling life at all. I was depressed.  I began praying an awful lot idk why, for love, for friends, for anything really.  One day, sitting last year in my virtual class I decided I was done hating myself for no reason.\n\n**I wanted to change.**\n\nI had always been a smart kid; AP courses and whatnot so I always relied on my brain to get me through anything but now I wanted it all baby! I wanted everything.  **I wanted to be someone, someone I was proud of.** I got done with my boring elective course and lingered over to the garage and started lifting the 5 pound weights sitting on the desk. I learned two things that day: Lifting weights is fun and most importantly it's incredible hard.\n\n**Growth.**\n\nFinding myself increasingly bored with videogames and installing Arch Linux for the 10th time, Weightlifting became this wonderful new outlet for my life. I started doing every exercise I could because it became so enjoyable to me. I also noticed another thing: I was able to do things with my hands and move my fingers in ways I never even knew I could ever do. I went 5 to 10, 10 to 20, 20 to 30, 30 to 40, 40 to 50 and growing every week. My weight lifting had given my an entirely different approach to every aspect of my life. I was finally beginning to be happy with life.\n\n**On clown nine.**\n\nIt's my senior year now. I am a college student through my Highschool, I show up to a class at the Highschool then I go to the college for two classes sometime during the week. I have a group of friends who I talk to for like 50 minutes after class before heading home and a friend I can text whenever to hang out with. GOD has blessed me so gratefully by placing a wonderful girlfriend in my life who has helped me become so so so much more of a better man and a happier person. I work hard for myself and I pay it back to those who have supported me along the way. about an hour ago, I did 5 reps for 200 pounds. Something that just broke me, making me so grateful about life. I have come so far through so many hardships and I've reached the top. I fly airplanes now, Left handed. I drive, left handed. I partially wrote this, left handed.  I am rarely home, hanging with friends making up the time I've lost over the past few years.\n\n**Closing.**\n\nI am so grateful for life now, I live the life I always thought was impossible for me. I'm getting college applications from colleges I never even dreamed I could ever attend. I am humbled by the beautiful things in life. I don't seek pity or attention, I am confident with myself and I don't need anyone to validate me. I humbled by the wonderful things that have happened to me and wish the best for everyone. To those in a position like me, afraid nothing ever changes, you need to give yourself the chance of a lifetime and be proud of who you are and push yourself to overcome obstacles in your life!\n\n**Closing the closing.**\n\nI may have strength and courage now, but I will always be a nerd at heart.\n\nI hope anyone who reads this has an amazing day! I'll be around from time to time to answer questions & whatnot if anyone has any.", "url": "https://www.reddit.com/r/happy/comments/q3egdg/i_am_proud_of_myself_im_very_proud_of_myself/", "title": "I am proud of myself. I'm very proud of myself.", "social_network": "reddit", "user": "DrawingCompetitive76", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1633628684, "permalink": "/r/happy/comments/q3egdg/i_am_proud_of_myself_im_very_proud_of_myself/", "nsfw": false, "first_save": 1635439068.4218001, "replies_charged": false}