{"id": "t5_2qh5i_t3_4ygdln", "request": ["c889a480-189a-4ed9-aa88-81c300413196"], "text": "Coming out of my darkest days, I now see with a greater clarity of purpose, as my goals have sharpened and I can see my destiny before me, that I actively move myself towards with each waking day. \n\nI want to share the beautiful power that attends the journey of self-realization, actualizing the deeper powers at rest in ourselves. As a person who suffered, a person who was a victim of a circumstance, I finally came into a new vision of reality, one that reflected a greater knowledge about the human experience.\n\nI come to you with the gift of a lifetime, a chance to create your own heaven on earth, a chance to unshackle yourself from the chains of pain and negativity. \n\nI made many hard decisions, but none of it was in vain. It was all towards a purpose of supreme purity. I now speak with Truth flowing through my consciousness and my actions.\n\nI want to share the gift that has given me to myself. I can now see things that were previously invisible to me. It is through the power of several ideas which awakened my conscience, which really gave me the seeds of life. \n\nI started up a new YouTube series called \"The School of Wisdom\".\n\n It is a resource for self-enrichment. It is an opportunity to dispel the devils of negativity, a chance to learn about yourself through your own eyes of self-awareness. \n\nhttps://www.youtube.com/watch?v=xEyBi3UZ-Nk&list=PLMFR7hvfV_kiQuSVooZ8d1Zxyen2Js3UF\n\nMy videos explore a set of topics which each investigate a different angle of the self-development process, the process of purifying our intellectual and emotion content of any and all poison. It is an ideological toolkit for the Seeker of Truth, the mechanic wishing to improve the Engine of his life. \n\nI also started up a website called \"UntetheredThoughts.com\" for those who want to live in their own version of happiness, those who are ready to fight for their values, and become a warrior for their own self-enlightenment. I have over 60 pages of content, filled with examples and metaphors, to illustrate the beautiful gems of truth I have discovered through my school of experience and study. \n\nI want to share the journey which has proved itself to be best seizure of action I have ever taken... \n\nHappiness is not by chance; it is by chance. Only those who take action are those who are ready to take their life to the next level.\n", "url": "https://www.reddit.com/r/happy/comments/4ygdln/a_new_youtube_video_series_the_school_of_wisdom_a/", "title": "A new YouTube Video series- \"The School of Wisdom\" - A source for self-enrichment to tap into the deeper dormant powers that lie unawakened in the human subject...", "social_network": "reddit", "user": "matters1776", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 3, "down_vote": 0, "creation": 1471573679, "permalink": "/r/happy/comments/4ygdln/a_new_youtube_video_series_the_school_of_wisdom_a/", "nsfw": false, "first_save": 1635441460.1873577, "replies_charged": false}