{"id": "t5_2qh5i_t3_51rgor", "request": ["89f969a3-3a22-4eff-8a40-d1d5b9658c57", "c15214d3-1d77-40d5-ad12-df4ba3bdb7b2"], "text": "Im going to try to keep this as brief as possible, and condense a many-years journey into a few paragraphs. There is no TLDR, so if you don't have 5 minutes, just read this some other time if you get the chance. :D\n\n\nI've never wanted money. Never wanted things, status, or corporate American success. I don't read the self-help, \"How to be a Millionare in 30 Minutes\" kinds of books and watch motivational videos that implore me to \"GRIND, GRIND, GRIND!\" my way to satisfaction in life. All I've ever truly wanted is genuine happiness. The goal of my existence has been to find an attitude with which I can approach the world that will induce consistent, unwavering happiness within my person.\n\n\nOperating on the idea behind the quote \"Bring ideas in and treat them royally, for one of them may be the King\", I've listened to countless teachers, psychologists, and preachers, trying desperately to catch the elusive fish of true happiness within a net of some perspective with which to approach reality. This pursuit has been, up until a couple of weeks ago, a rollercoaster ride but ultimately a failure. However, I think I may have finally found the King.\n\n\nSo this is the secret I stumbled upon, and please forgive me for the roughness with which I will articulate it; The secret is to be consciously aware, in some capacity, of the unending expressions of joy taking place all over the globe, and to find it within yourself to be happy for those experiencing it. Let me explain.\n\n\nWe cannot always be happy for ourselves. Unless you are some enlightened monk or natural enthusiast, most of our days are pretty average. We wake up, go to work, come home, get ready for tomorrow, and squeeze some recreational time in between. If we are honest, the majority of our days are uneventful at best, and down-right boring at worst. But they are \"uneventful\" or \"average\" in relation to what? When we say a day was mediocre, what are we comparing it to? We are comparing it to those days that come along every now and then where we experience euphoria in some form or fashion. The birth of our kids, wedding days, promotion days, first-dates, etc. Those days are incredible and transcendent, but they are rare. Atleast they are for the individual.\n\n\nThe fact of the matter is that there are over 7 Billion people on this planet. There are 4 babies born every second and over 350,000 born each day. Read that again. Lol. It's an insanely populated world we live in, and in such a world, exhilarating moments and days are by no means rare. They are happening as you read this, and they never stop.\n\n\nSomewhere right this second, a mother is holding the child she just gave birth to. Some of you know that feeling. Somewhere, someone has within the last few minutes proposed to their long-time girlfriend or asked out the cute darling at the front of the class. Most of us know the emotion associated with those kinds of things. Hysterical laughter, heart-throbbing romance, nervous excitement, the list can go on. Let it simply suffice that there is an insane amount of happiness exploding for individuals around the planet each and every moment.\n\n\nSo if you can grasp that reality, there's just one other step to bring it home. Be happy for those people. You know what extreme joy feels like. We've all had fleeting moments of it at some point. Now just imagine all of those people, with dreams and ambitions just like yourself, feeling the way you felt when that happened to you. Imagine they are your brothers, sisters, mothers and fathers if need be. We are all one big family, after all.\n\n\nIf your happiness leans only on the situations surrounding your unique life, you will find it. Once every couple weeks, you will find it. But if you take your eyes off of your own world, and look through the eyes of the 19-year-old young man from East Asia that just got the career he's always dreamed of, you will have it always. Meditate on the nearly inconceivable amount of cloud-nine experiences that are inevitably happening to millions of the 7 billion people we have on this planet- and you will smile.\n\nI brought this idea in two weeks ago, and catered to it as if it were the King. I haven't stopped smiling since. Joy is now my default emotion. I laugh periodically, and genuinely, at the thought of others having the times of their lives. I believe my search for happiness may be complete. Toy with this perspective and see what happens. I felt it was my duty to share it.", "url": "https://www.reddit.com/r/happy/comments/51rgor/my_secret_to_happiness/", "title": "My secret to happiness.", "social_network": "reddit", "user": "Hidalgo321", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 105, "down_vote": 0, "creation": 1473343604, "permalink": "/r/happy/comments/51rgor/my_secret_to_happiness/", "nsfw": false, "first_save": 1635440651.3203955, "replies_charged": false}