{"id": "t5_2qh5i_t3_aiceuv", "request": ["23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181"], "text": "I quit my job 3 months ago without much of a backup plan. I’m fortunate enough to have parents who graciously let me live with them rent-free to focus on getting my mental health in order and finding the right job for me.\n\nIt’s been hard going from living on my own for a year and a half to living with my parents, so getting this apartment (I just got the call an hour ago) is a huge step in the right direction. I can’t wait to be independent again.\n\nMy new job has better, more consistent hours and is in a much more laid back environment. They’ll provide me with a ton of training and guidance and it’s a giant stepping stone into the corporate side of the industry I’ve been working for the past three years, which is what I’ve wanted to do from the beginning. This company was the number one I wanted to work for, too! \n\nI’ve also started taking commissions for my embroidery which makes me so happy and proud as I’ve never been a very artistic person so it means so much that my friends like my work enough to pay me for it.\n\nOh, and I’m gonna get a cat! I’ve always had family pets, but never one of my own. I absolutely cannot wait!\n\nWhen I woke up on my 25th birthday a month ago to see snow (despite living in Massachusetts, it’s only snowed on my birthday once before in my life), I knew 25 was going to be a good year for me. It seems like it’s all starting to come together. I’m just so fucking happy I can’t stop crying!", "url": "https://www.reddit.com/r/happy/comments/aiceuv/4_months_ago_i_was_depressed_and_filled_with/", "title": "4 months ago I was depressed and filled with anxiety every second of the day due to my job and living hundreds of miles from friends and family. Tomorrow I’m taking a much needed vacation and next week I start a new job and move into my own apartment!", "social_network": "reddit", "user": "sjallllday", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 27, "down_vote": 0, "creation": 1548092007, "permalink": "/r/happy/comments/aiceuv/4_months_ago_i_was_depressed_and_filled_with/", "nsfw": false, "first_save": 1635440868.9524348, "replies_charged": false}