{"id": "t5_2qh5i_t3_7u5ran", "request": ["f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "Ever listen to Claire de Lune by Debussy? I listened to that about thirty minutes ago and I wanted to cry. Not sad cry, but have absolute unfathomable tears of joy. It moved me. It is because I’m just so amazed at life and how outstanding it is, and I think that piece really reflects that feeling. When I look at how I was a few months back all I can see is a sad girl who only saw what was going wrong with her life. Today, I am grateful for those months because they helped me learn to see how complex yet rewarding life is. Between reading on positive mindsets, meditating, journaling, and manifesting why life is great, I have seen a stark contrast in just my entire well being. Even the simplest things make my heart feel full. I walked past an elderly group of friends. One said “Macy moved out.” I have no idea what the context of that story was but it just made me so happy. These people were able to get together and talk, they have something going on in their lives that creates conversation which enhances human connection. Isn’t that fucking beautiful? Any of us can do this. Listen everyone, YOU are capable of anything because we were brought to this world to achieve our dreams. Instead of saying “I can’t” say “I can”. See the good in everything and everyone. Let sudden opportunities to you be a sign and take that opportunity. Don’t worry about the future and don’t dwell on the past because the only time you are living right now is the present. Appreciate the present because you don’t want to waste a moment of it. Instead of kicking yourself for making a mistake, see it as a blessing for it gives you an opportunity to make a positive change.\n\nPlease everyone, love yourself because life is so beautiful. ", "url": "https://www.reddit.com/r/happy/comments/7u5ran/god_i_dont_know_what_it_is_but_life_is_so_goddamn/", "title": "God, I don’t know what it is but life is so goddamn beautiful.", "social_network": "reddit", "user": "catharsisisrahtac", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 39, "down_vote": 0, "creation": 1517358569, "permalink": "/r/happy/comments/7u5ran/god_i_dont_know_what_it_is_but_life_is_so_goddamn/", "nsfw": false, "first_save": 1635443329.011126, "replies_charged": false}