{"id": "t5_2qh5i_t3_eg5q64", "request": ["5bcd7a82-c8bf-45e5-9556-cc778b964467"], "text": "This Christmas, I am 22. My brothers 25. My mom 61. I have to get to work at noon, therefore I uSuallly would have gotten up at 9 to open Christmas present and have breakfast with my two, opening the presents with ample picture time (I loathe this),getting ready and dressed to leave by 11 am just to not be rushing.\nI woke up at 10:30 am, knowing I am far behind schedule \nSaid f the brekky- we need to rip open these gifts, we take turns and I am making ten second intermissions to grab my makeup and get ready (pictures being taken throughout the whole process) \n\nThat’s sort of the part, because normally on these conditions I would be Uber stressed out and mad and mean, but this year was different. I loved being with my family, I loved my families reactions to all the things that I had thought hey, maybe he’d like this. Maybe mom would use this. It was the first Christmas I felt like I actually had given to people and they loved the gifts they had received and  more so just me yelling at my mother to rip that baby open faster faster move move we gotta go! I felt like the most family oriented drill sergeant. I made it to work in time, and usually holidays aren’t nice. They are painstakingly filled with fights and grudges, this year was different \nAnd I am so happy to have that as the best gift to receive in 2019.\nI hope 2020 brings marvelous presence in all of your lives, the law of attraction is real. And I am really really fucking happy", "url": "https://www.reddit.com/r/happy/comments/eg5q64/my_first_blessed_christmas_that_i_remember_and/", "title": "My first blessed Christmas that I remember and will forever.", "social_network": "reddit", "user": "alikiemele", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1577417762, "permalink": "/r/happy/comments/eg5q64/my_first_blessed_christmas_that_i_remember_and/", "nsfw": false, "first_save": 1635439161.3464243, "replies_charged": false}