{"id": "t5_2qh5i_t3_80n1hp", "request": ["8bed9c95-eda8-4aca-9f64-c1f6ec35f283"], "text": "A little info on me; Barely 27 year old male and  I struggle with untreated depression and anxiety. I don't post much at all and honestly I probably haven't even logged in about a year but I wanted to just say all this somewhere.\n\nSince August of 2008, I have been with the same girl. We were high school sweethearts and we had imagined spending the rest of our lives together. We both had depression admittedly, but she was a bit more upfront with it while I liked to keep mine neatly tucked away. The early years were great, fights and arguments were minimal and we could just hang around in each other's company completely content without even doing anything. Eventually we bought our first place together, a small rinkydink trailer, and we made it work. We were working, we had our goals in mind and we were pushing towards them. \n\nProbably about two years ago I finally popped the question early on a Christmas morning. Caught her completely off guard since she often dropped hints but figured I wasn't the type to go for something like that. Things went well for a while afterwards. We were more affectionate than ever.\nOver those years, she had many rough bouts with her depression. I patiently worked through them. When she'd get drunk, I was there to support her no matter how angry she would get. I kept my issues more to the background as I was more focused on seeing her improve. Cut to about a year ago and my depression starts to hit me hard. We had eventually bought a house thanks to her promotions at work and my stressful but well paying warehouse job. Eventually, I lose that job thanks to large increases in production. Sometime after she began to get more distant. We talked less and fought more. Despite this I worked hard to improve myself because I knew at this rate I was going to lose her. I found a new job, it didn't pay much but I accepted anyway. It was another warehouse but even more stressful. I busted ass though, got myself promoted to even more stressful positions, and shouldered burdens as best I could. I tried to keep the relationship together how I could. Tried dates, conversations, etc. Eventually I finally started to discuss my own issues with depression. It was met pretty negatively. On more than one occasion with opening up about how I felt, I'd be met with various things like \"I feel like we swapped genders at some point\" or just generally being brushed off with things like \"everyone's got problems\".\n\nThis past Christmas, I thought things were improving for once. There were apologies for how I had been brushed aside and talk about working on our own issues. We did gifts, we had pleasant talks again, we saw movies. Around mid to late January things were getting bad again and she decided she wanted space to sort through her own issues. Not to break up, but to just sort of be friends for a while again. We were going to work on ourselves. I got particularly drunk sometime that week in the guest, something I never really do. She actually ended up calling my mom to come and look out for me though from what they both told me, I really just lay in bed and talked about all the various issues going on in my life. Definitely the kind of drunk I always figured I'd be.\n\nI started looking into solutions for my problems but haven't started anything yet. By February, I already knew what was coming and saw all the signs. Things weren't going to improve, we were actually communicating less than ever. I eventually put in all of my vacation time with the intention of trying out medical help however last night while at work, I got the message \"Can we talk when you get in?\". I knew what it was so I went ahead and told my boss I needed to head home because I wanted to rip that bandaid quickly instead of stressing it the whole work night.\nSure enough, I get in and we talk. We aren't mending this and she's also apparently \"never gotten over\" my drunk depression bout. I actually thought I'd be crying when it came but I didn't. I agreed to it and went and took a ride. I thought about how I tried my best to keep things together and how I had stuck by her for years through her own depression and she hadn't been willing to give me the same. Eventually I went to my job, told them I was quitting, and came back around.\n\nI've decided I'm going to take my savings, which are pretty okay right now especially thanks to the recent tax returns and just start over. We plan to sell the house and split whatever we manage to get back out of it.\nI've made plans with friends for the first time in a long time of my own accord. Friends I've neglected due to long work hours, stressed out sleeps on days off, and stressed out relationship issues.\nEven though it feels like I shouldn't be, I'm pretty happy right now. I've loved this girl for a long time but I honestly believe it's been quite a while since she's felt the same. I'm going to go back to working on me and maybe some years from now I'll feel I'm in a good enough place with myself to try relationships again. I'm getting old but I'm going to start over.\nThat's kind of comforting.\n\n**TL;DR: Dated girl for a long time. Had good times, then had really bad times. Breaking up but feel surprisingly good about it.**\n\nThis whole post is probably a mess. I've probably glossed over things and I'm sure things are just jumbled. I just kind of typed it out as I thought but thanks for bearing with me.", "url": "https://www.reddit.com/r/happy/comments/80n1hp/broke_up_with_my_fianceé_of_almost_10_years_but/", "title": "Broke up with my fianceé of almost 10 years but surprisingly happy", "social_network": "reddit", "user": "DeliciousMilkTea", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 44, "down_vote": 0, "creation": 1519743543, "permalink": "/r/happy/comments/80n1hp/broke_up_with_my_fianceé_of_almost_10_years_but/", "nsfw": false, "first_save": 1635442181.2197807, "replies_charged": false}