{"id": "t5_2qh5i_t3_15653a", "request": ["b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11", "af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "I've always bounced back and forth between feeling very down and depressed and reasonably optimistic and mildly happy. I haven't felt contentment or solid happiness until recently and I cannot describe how great it feels to finally be here. \n\n\nI'm a literature nerd and love to read. Reading one of my typical, dark books (The Catcher in the Rye, still a wonderful read), I came across this quote:\n\n\n“I think that one of these days,' he said, 'you're going to have to find out where you want to go. And then you've got to start going there.”\n\n\nAnd it got me thinking. I'm 23 years old. It's about time I decide what life's going to be like, how I'm going to be seen by others and what my attitude is. So I found where I wanted to go (toward happiness) and I've gotten there rather easily, but I had to consciously make the decision.\n\n\nReading the quote wasn't the only catalyst for this change. As silly as this sounds, I've been watching season 7 of How I Met Your Mother and I found myself empathizing so much with Ted who, if you're not familiar with the show, is a whiny, pessimistic and mild-mannered guy by the end of Season 7. He's always coming to people with tiny, silly problems. He's constantly depressed, finding his value in women. And I started to realize that the only person I really had common ground with on the show was the one who was consistently unhappy, single and pathetic.\n\n\nThat's not a happy realization.\n\n\nI've been single for about six months now and, despite feeling like I'm a decent catch, haven't met anyone. There are a few girls that I'm interested in and I realized that they won't be attracted to someone who's constantly down. It's exhausting to be around someone who's depressed and I found myself realizing that if I wanted to attract the best woman possible, I'd have to change.\n\n\nSo here's what I've done:\n\n\n•When I start feeling bad for myself or down, I start rapidly listing all of the things I have to be thankful for. When you start realizing that you HAVE computer speakers and what a great thing they are or when you realize that you have easy access to clean water and abundant food, it changes your perspective. You realize how important your family and friends are. BE THANKFUL. I used to try doing this, but I'd turn it into a guilt trip: \"Dude, you have all this and you're still not happy? How pathetic!\" Instead I now count the blessings I have. Not only does it distract you from what you have going on, but it gives you perspective. Yes, I'm going to a job I don't like-- but I walked out to my garage and had the choice between driving two cars. I'm immensely blessed.\n\n\n•Cut out the negativity. You know what? You don't need to know about every damn burglary or murder in your town on the 6 o'clock news. Give yourself the permission to be a bit blissfully ignorant about things that you CANNOT change. Does it help me to know 10 people died in a house fire? \n\n\n•Be aware of what you're consuming. I love music. Alkaline Trio, The Cure, The Smiths, Parkway Drive-- all great music and very much some of my favorite music. But it's music that can put you in a dark, unhappy place. I now try to keep track of how I'm feeling when listening to music. If I'm listening to Alkaline Trio and I start feeling a little dark, I switch over and put on some frivolous rap or pop. It's OKAY to enjoy crappy music and laugh about it. It really, really is. Not everything in life has to be deep and heavy. \n\nAnother part of that, too, is the TV/movies I'd watch. I love Louis C.K. But watching Louie makes me super cynical. Now that I'm in a better state of mind, I can handle it much better than I used to, but I still find that it can affect my mood. Keep an eye on what's going into your mind because what you put in, you might just get out of it, too.\n\n\n•Be confident. This is, quite possibly, the largest part of it for me. I'm a laid-back, extremely nice guy. But this also means that I've allowed myself to be seen as a doormat. I've changed this. My boss, a former Marine, accused me of making a mistake. I would have normally apologized, regardless of guilt, and slunk off to my cubicle. Not anymore. I outlined exactly how I didn't screw up, exactly what I did and offered evidence of what I did to prevent problems-- all professionally. Have the balls to take initiative and stand up for yourself-- nicely, I might add. It's the small victories, too. Yesterday I had someone bring me a sandwich with cheese on it. I'm allergic as hell to dairy and told the guy when I ordered. The manager came out and mentioned I'd need to make sure I asked for the sandwich without cheese. Nicely, I told him that I had in fact asked for no cheese and that I appreciated them correcting my order. It sounds incredibly stupid, but standing up for yourself (nicely) gives you a huge boost.\n\nI also started carrying myself differently. I read a post on Reddit about walking confidently. I took that to heart. I walk with purpose now. I use my voice to get people's attention (it's all about tone and volume) when I need to. I'm direct. I don't slink around with my hands in my pockets, eyes fixed on the floor. Start believing that you're confident and you will be. I went from feeling powerless and weak to confident and strong. This alone is huge progress and a major source of my happiness.\n\n\nLet me say this before I wrap this up: my life isn't perfect. I'm half in love with a girl who has friendzoned me for the past five years, I work a meaningless, low-paying job that I don't enjoy, I'm stuck in a town that I don't get much joy from and my circle of friends needs a thorough house-cleaning. I didn't just win the lottery and have this epiphany. Effectively not much has changed in my life, aside from my attitude and the way I feel.\n\nBut what I've found is that you can only let the external factors affect your happiness so much. YOU make that decision. Look, I can't control 100% of my job. But I can listen to music that makes me happy. I can be confident with my boss. I can help my co-workers out and build friendships with them. I can find the good in what I do. And if I can even improve 20% of my time at work, that's still an improvement. Don't try to change or improve everything-- it's not black and white. Improve what you can. Sometimes just the challenge and the feeling of accomplishment is enough to bring you joy.\n\n\nI know that this time in my life is temporary and I realize that unhappiness is a GREAT motivator! I'm not content where I'm at, but I can be happy where I'm at for now and work toward a future that I do want.\n\n\nI used to say that I was too smart to be happy because a truly intelligent person would realize how bad life is, how against the odds we all are and how hopeless things are. I disagree now. \n\n\nIf you're intelligent enough to find ways to be unhappy, you can also be intelligent enough to find ways to be happy. \n\n", "url": "https://www.reddit.com/r/happy/comments/15653a/after_23_years_of_feeling_pessimistic_depressed/", "title": "After 23 years of feeling pessimistic, depressed and cynical, I've (mostly) overcome it. (Tips inside)", "social_network": "reddit", "user": "neverenough22", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 26, "down_vote": 0, "creation": 1356017139, "permalink": "/r/happy/comments/15653a/after_23_years_of_feeling_pessimistic_depressed/", "nsfw": false, "first_save": 1635439210.3421679, "replies_charged": false}