{"id": "t5_2qh5i_t3_ofwk8m", "request": ["5bcd7a82-c8bf-45e5-9556-cc778b964467"], "text": "I used to hang around the wrong crowd, just not good people and they where not good people for multiple reasons but to break it down, they did drugs and drank alcohol and used women for sex and ect. and I used to find that crowd fun to hang out with and I used to find them cool and I myself was not a good person either but one day I met an extremely kind and decent person and we talked to eachother and became friends.\n\n&#x200B;\n\nWe had become good friends and I told her about some of my old crowd's crap I didn't like while I was friends with them (when I shouldn't have liked any of it) and she didn't like the stuff I told her they did and eventually me and her got closer because I wanted us to become closer friends and I eventually began to see that nothing my old friends where doing was okay at all and I saw how bad I myself was because of her, I realized that I was not a good person and neither where my old friends so I was still friends with them for abit there and one of them made fun of someone for taking their life and others did other crap and eventually I finally pushed the old crowd out of my life for good and I became a truly good person all because of her.\n\n&#x200B;\n\nWe are now best friends :) and she is the most incredibly wonderful person I have ever and will ever meet and the greatest and most decent person I have ever met and will ever meet and I am living a very healthy and happy and joyful life all because of her, simply knowing her made me turn into a good person and me and her hang out and enjoy being around eachother and she will always be my one and only best friend because of what she did for me and because of how she helped me so so much, she means the world to me and I love her like family, like a sister and I could never ask for a better best friend or be more grateful that she is in my life now and I am extremely protective over her, I have met other good people through her who are my friends now including her boyfriend who is also one of the greatest people I have ever and will ever meet and me and him are amazing friends and I'm just thankful and blessed she is here for me and that she is in my life, we always get along and we agree on literally almost everything and we have the same morals and we both respect eahcother extremely and if it wasn't for her I don't know where I would be or who I would be hanging out with right now, she gave me the courage to stand up to my adoptive dad who I don't want in my life and she's been here for me for everytime and I am always there for her and I make sure to be the greatest best friend I can be to and for her.\n\nI just wanted to express this somwhere :) Have a nice day good people.", "url": "https://www.reddit.com/r/happy/comments/ofwk8m/i_have_the_greatest_best_friend_i_could_have_ever/", "title": "I have the greatest best friend I could have ever asked for and she truly saved me from myself and from the crowd I used to hang out with.", "social_network": "reddit", "user": "TheDarkApex", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1625706419, "permalink": "/r/happy/comments/ofwk8m/i_have_the_greatest_best_friend_i_could_have_ever/", "nsfw": false, "first_save": 1635439161.0850062, "replies_charged": false}