{"id": "t5_2qh5i_t3_dto7yp", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "I got a new job today and quit my old job. All of this happened in the course of few hours and I've not been this happy and excited in a long long time. I was at an interview this Monday and they said they would call me on Wednesday if it was good news. Wednesday came and went and no phone call. Then I thought that they might have said that \"we will let you know after Wednesday\", so I waited. Well, Thursday came and went and still no phone call and I settled to the thought that I'd be stuck in this same place for another ten years. Then came Friday and they called me and congratulated me on my new job! I couldn't believe it and asked them to repeat the message. They really wanted to hire me. Then I went to speak to my boss and told him I got a new job offer and it's a business I have an education for and asked him when could I leave this place. He basically told me that they encourace people who like to educate themselves to “chase their dreams\". So he told me I could leave TODAY and I answered after a millisecond of thinking that yes, it would work for me. And here I am, laying on the couch trying to contemplate what the hell happened today. I will never ever have to wake up at 5 to a meaningless job in place that has no future and I have a new career path. I can get a healthy amount of sleep and actually have a job in a field that is growing and I have an opportunity to develop my skills in a way I didn't even know was possible. So yes, this has been a good day :)", "url": "https://www.reddit.com/r/happy/comments/dto7yp/i_just_got_a_new_job_and_ive_not_been_this_happy/", "title": "I just got a new job and I've not been this happy in a long time", "social_network": "reddit", "user": "creative_ducky", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 3, "down_vote": 0, "creation": 1573257659, "permalink": "/r/happy/comments/dto7yp/i_just_got_a_new_job_and_ive_not_been_this_happy/", "nsfw": false, "first_save": 1635442878.4115002, "replies_charged": false}