{"id": "t5_2qh5i_t3_imcyjp", "request": ["0344ec6b-2528-4c06-8dba-4c3095c02293"], "text": "Honestly I just needed a place to vent how drastically happy a simple purchase made me today. \n\nI work as a Paramedic (in Canada) and have for a year now but I just bought my second Michael Kors item. Sounds stupid that a mere purse and wallet excited me so much but it's not about the items at all.\n\nI grew up poor as hell before my mother clawed her way up to the high end of the low income tax bracket. I remember she was making 28,000$/ year when I was in high school which we thought was fantastic considering she had me as a teen and started on welfare while I was a baby. My mother truly worked her ass off to get that far. I know all too well what it was to go without lunches so my much younger brother would never have to. I remember the power shut off several times, we moved a lot, etc. Not the worst life but far from comfortable. \n\nI initially followed a similar path to my mum of low income and ended up in shit relationships and so forth until I decided to join the Canadian Army at 22. Since that I was injured, medically released, married the man I met in my platoon that I love, got sponsored retraining meaning I owe zero student loan debts, we have a house, bought my first financed new suv, and overall we are quite comfortable with our combined income. I'm truly doing stuff I really never saw happening in my life. The fact I don't have to stress about which bill to pay anymore or how much food I can afford, etc is mind-blowing to me. \n\nAll that said I just bought my second item from the designer I've always adored which if you'd told me that even 2 years ago I would never believed it. I didn't have to save, I didn't have to do the whole \"do I REALLY love it and will I use it enough to justify this price\" thing like I used to for many things... I just clicked add to bag. \n\nI really sincerely never thought I'd see the day and it truly reminds me just how incredibly far I've come. I didn't even really get hit like this when I bought my car which is a VW Tiguan ... A brand my mother scolded me for being a \"rich person car\" once lol... I know it's not but she was so concerned about the cost of it and maintenance because I don't think she really realized just how far my finances have come until we went on a girls vacation recently. All the money I've loaned and given her and she really didn't \"relax\" until then. \n\nIt's just so overwhelming knowing I escaped. I escaped genuine poverty despite the odds. It's only up from here and I am already looking into buying a rental property to add to our income without my husband or I having to commit to another busy job... An added security blanket as well since his back is quite bad already... But I know without doubt we will be stable should he need to change careers and it's the most accomplished I've felt to date.\n\nI'm just so fucking grateful to have made it this far. It just hit me like a ton of bricks. I may not be \"wealthy\" by any means but internally I feel rich.", "url": "https://www.reddit.com/r/happy/comments/imcyjp/i_did_it_i_finally_made_it_and_it_took_buying_a/", "title": "I did it. I finally made it and it took buying a purse and wallet to register... I truly escaped poverty.", "social_network": "reddit", "user": "nessa19x", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 406, "down_vote": 0, "creation": 1599212172, "permalink": "/r/happy/comments/imcyjp/i_did_it_i_finally_made_it_and_it_took_buying_a/", "nsfw": false, "first_save": 1635442721.7087853, "replies_charged": false}