{"id": "t5_2qh5i_t3_bu99zm", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "hi everyone! I haven't posted as often as I used to on reddit, but I really did want to share how amazing I've been feeling lately :)\n\nI still can't believe how great I've been doing now compared to the start of this year. I went through so much, so *so* much. I had 5-6 month depressive episode (starting in December '18) and it has finally subsided. This was my worst episode yet; I went into isolation and suicide attempts and so many pages of potential last letters. I went through losing people one after another because of how much hurt I was getting from them. it was a tough time and to top it off, my psychiatrist kept switching my meds so it was just months of hell. emotional and physical abuse, gaslighting, unmentionable things. and they're gone now, thank god.\n\nbut looking back at that now? I'm glad that I constantly made the decision to stay. I can say I'm at the happiest and proudest moment as of now. I'm off medications that were really not working for my mental health, my relationship with my family is at an all-time high, I've made such amazing progress personally and professionally, I've been accepted and transferring to one of my top university choices in the fall, dean's list. two years in a row, ending sophomore year with a 3.7cum gpa and. one year of RA experience...life is just so good!\n\nand when I really thought I wouldn't be able to believe in love again, I found a reason :) he's my dream guy, a gentle 6'3 Italian giant with the sweetest heart and even sweeter parents! we've been talking for quite some time, but yesterday I took my chances and made it official, and I'm so happy! and yesterday I met his parents too for a picnic LOL, and they were absolutely amazing, especially his pup! my last relationship, I didn't feel as though I could be my genuine self, especially with the parents. it was like I had to pretend to be someone just to impress them, but I didn't feel that way at all yesterday. I was welcomed with open and loving arms, and I received so many sweet gifts from his mother and I really did want to cry!! just so sweet. you don't really meet people like that often, people with hearts of gold even after going through so much. I absolutely love him!\n\nbut I'm so happy that apart from my relationship, I feel more confident as an individual. I've gained confidence in myself and my skills, and learned to really trust my intuition. I learned to fall in love with music and my favorite artists all over again. and it's a lovely feeling.\n\nis it hard to let go of the past, or really just to learn from it? yeah, of course! and it's even more difficult with how I am as a person-- still worrying and caring for people who I don't talk to anymore/had to cut off. I hope they're doing well, and I don't see the need to carry any animosity anymore. it just doesn't help anyone, and I just wish everyone the best in life and to have that opportunity to just live life with happiness and love.\n\nI put a recent selfie up with one of my favorite songs! there is so much to smile about, and I'm so excited to continue the year with this positive mindset. wishing everyone the best in life, and lots of love to receive and share!!\n\n&#x200B;\n\nhttps://preview.redd.it/es801phhc2131.jpg?width=118&format=pjpg&auto=webp&s=f095994bfa0bec24ccde33a7220060f67bc20325", "url": "https://www.reddit.com/r/happy/comments/bu99zm/after_a_long_and_difficult_depressive_episode_i/", "title": "after a long and difficult depressive episode, I can finally say that I'm happy again :)", "social_network": "reddit", "user": "_gansmadchen", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 16, "down_vote": 0, "creation": 1559098086, "permalink": "/r/happy/comments/bu99zm/after_a_long_and_difficult_depressive_episode_i/", "nsfw": false, "first_save": 1635442869.2011697, "replies_charged": false}