{"id": "t5_2qh5i_t3_ctc3wc", "request": ["d2bf8290-ea9d-4601-bf64-8bb709730ec1", "13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": " In addition to making a big effort with therapy, lifestyle changes, and recommitting myself to my life endeavors, this also helps me. What also helps me is writing out times I genuinely felt pure joy in my life, and slowly relishing in the feelings of each of those memories. It reminds me in that moment the feeling of warm happiness. I’ll share some of mine. \n\n I remember feeling joyful: \n\n• Making out with a boy for the first time when I was a kid. Holding hands with him. Playing with him, flirting, tickling, and falling madly into puppy love. Hiding our steamy make out sessions from our families, pretending to just be good friends. “There is no sweeter innocence than our gentle sin”. \n\n• Running around the Hozier concert with my friend in SD. Being so excited, feeling beautiful, feeling ecstatic, funny, capable of anything. Falling in love with Hozier and myself and the air coming out beneath my shoes. Warm, flowy, amongst my kin.\n\n• Hopping on rocks along a river bed. Squishing mud between my toes. \n\n• Play fighting with my dog. Laying on the carpet and gently play prodding him to wrestle and feign that his bites hurt so he’d apologize with a lick. I miss my soft fur boy. \n\n• Eating a hot brownie. \n\n• Laughing with my friends over the dumbest jokes. Especially when sleep deprived or at the end of our ropes.\n\n• Getting my sense of smell back from a septum deviation fix and smelling fresh cut Christmas trees for the first time in years.", "url": "https://www.reddit.com/r/happy/comments/ctc3wc/remembering_the_joyful_things_in_my_life_has/", "title": "Remembering the joyful things in my life has helped me during my struggle with depression. Try out my method if you’re having a hard time remembering what happy feels like on the bad days.", "social_network": "reddit", "user": "irideagiraffetowork", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1566363807, "permalink": "/r/happy/comments/ctc3wc/remembering_the_joyful_things_in_my_life_has/", "nsfw": false, "first_save": 1635441667.3348076, "replies_charged": false}