{"id": "t5_2qh5i_t3_qg6eaw", "request": ["4311bf71-6ec2-4c3b-aa15-1f9a3223e07b", "e78e5c86-dbf1-4ab8-a98c-e9d544934b7c", "f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "If you look at my post history, even for a few seconds, you’ll notice that I really like to talk about what I like to call the Cole’s Girlfriend Saga.\n\nIf you want to read about it, here’s my original post: https://www.reddit.com/r/sad/comments/n3zgmd/im_so_damn_sick_and_tired_of_getting_duped_by/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nIf not, allow me to summarize: Prior to 2021, my main group of friends consisted of Me, Jack, Cole, and Gage. Then Cole got a girlfriend. Then Cole’s girlfriend wanted total control over the group, and staged a dispute between us regarding our mutual suicidalness in an (successful) attempt to turn my buddies against me. New Year’s Eve, I was exiled from the group, a new group chat was made without out me, and I was left to rot in a state of perpetual suicidalness for the next few months. Cole did not care what happened to me because he thought he would get laid. He did not get laid. He got dumped. He came back to me shortly after to try and get me to be his friend again. I rejected his half-assed apology. He roasted me, officially ended the friendship, and would continue to harass me for the next month for not getting over it. I haven’t spoken a word in our group chat since 2020.\n    Now that you’re all caught up, things might possibly be about to change. I’ve not been feeling well lately, so I took off the first few classes of the school day to go to the Doctor. By the time I got to school, it was Lunch Break. As I’m walking up to Jack in the lunch line, I hear Cole say to him, “You ever wish you could be friends with somebody again, but you fucked it all up?” I can’t prove that he’s talking about me, but if he is, that’s incredible, because keep in mind the last time I texted him he was boldly refusing to accept any responsibility for what happened. It’s good to know that he could finally be coming to his senses almost a year later.", "url": "https://www.reddit.com/r/happy/comments/qg6eaw/the_coles_girlfriend_saga_may_finally_be_ending/", "title": "The Cole’s Girlfriend Saga May Finally Be Ending!", "social_network": "reddit", "user": "x_xacious", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 2, "down_vote": 0, "creation": 1635254890, "permalink": "/r/happy/comments/qg6eaw/the_coles_girlfriend_saga_may_finally_be_ending/", "nsfw": false, "first_save": 1635442008.4988751, "replies_charged": false}