{"id": "t5_2qh5i_t3_nklmrh", "request": ["d9021d56-8bfa-490f-87b8-52154c0b1b05", "c15214d3-1d77-40d5-ad12-df4ba3bdb7b2"], "text": "The best investment for your future is not financial, such as investing in index funds. Or physical, like doing yoga every day. Though both can help. A study of 724 men conducted by Harvard allowed this question to be studied. What is the best investment of time and energy now for our future health and happiness? It turns out to be relationships.\n\n## The Study\n\nThe study tracked participants health and happiness over a 74 year period. **And the single best indicator of happiness and health in later life was the strength of individuals relationships**. Building and maintaining strong relationships will be better for your health than more money or prestige, most of the time.\n\nWhen we try and discover the impacts of decisions on our future health, we often try to work backwards. We start with an older individual. Then use the fallible tool of memory to isolate decisions and trends from their life that led them to where they are now. The use of memory often results in errors because memory is fallible.\n\nThis study attempted to bypass this problem by tracking the people as they grew up. Recording decisions, health, happiness, and wealth year by year. It’s called the Harvard Study of Adult Development.\n\n## The Harvard Study of Adult Development.\n\nIn 1938 the study began. It followed 724 men(the 1940’s weren’t great at gender equality) through their lives. The participants came from all parts of the societal strata, upper, middle, and lower class.\n\nOne group of boys were specifically selected as sophomores (year 10 here in Australia) from Harvard College. While another group of the boys were selected from Boston’s poorest neighbourhoods. The boys from these areas came from mostly disadvantaged backgrounds.\n\nThe study measured health, happiness, financial success, aspirations and dreams. They routinely checked in year after year. Sending out another questionnaire, sitting them down for yet another interview. Today most of the participants have passed away. But the study continues to track their children and grandchildren.\n\n[Robert Waldinger, the current director of the study and fourth director in total presented a TED talk watched by millions on their findings.](https://www.ted.com/talks/robert_waldinger_what_makes_a_good_life_lessons_from_the_longest_study_on_happiness?language=en)\n\n## The Findings\n\nThis study allowed the future consequences of many actions to be measured. Does more money make you happier? Do cholesterol levels in your mid 50’s have a correlation to health in later life?\n\nNow, these answers are almost impossible to answer because of [correlation vs causation](https://www.khanacademy.org/test-prep/praxis-math/praxis-math-lessons/gtp--praxis-math--lessons--statistics-and-probability/a/gtp--praxis-math--article--correlation-and-causation--lesson#:~:text=To%20answer%20questions%20like%20this,the%20values%20of%20two%20variables.&text=Causation%20means%20that%20one%20event%20causes%20another%20event%20to%20occur.). But what this study has allowed researchers to do is find the best indicator of future health. And the best indicator found was the quality of individuals relationships. The people with better quality relationships were happier and healthier.\n\n## The Power Of Relationships\n\nThree of the most important findings from the study were:\n\n## 1#: Social connections are good, loneliness kills\n\nSocial connections are really good for humans. We evolved as social animals in tribes. Therefore we need close and strong social connections. And the lack of connection or loneliness kills. When isolated, we suffer terribly. Investing in relationships are key. Participants who had strong social connections were happier and healthier.\n\n## 2#: It's the quality of relationships that matters most\n\nDeep trusting relationships were the best indicator of future health. Not the number of relationships. The men with the highest satisfaction in their relationships, not the most relationships, at 50 were the healthiest at 80.\n\n&#x200B;\n\n&#x200B;\n\n## 3#: Social connections protect our brain\n\nPeople in strong relationships, who felt they could trust and rely on their spouses, families, and friends, experienced higher retention of memory and cognitive abilities. Loneliness and poor relationships either don't inhibit or potentially cause quicker memory loss.\n\n## Why Is This Surprising To Most Of Us?\n\nMost of us want more money. [We're often hard wired to chase wealth and status](https://thehappyorchardblog.com/the-score-cards-that-count-in-your-life/). It is rare to survey a millennial who would put strong caring relationships in their top goals for life.\n\n## Good Relationships Aren't Sexy\n\nBeing rich and famous is glamorous. We think being able to buy whatever we want will make us healthy and happy. It turns out investing in the quality of our relationships is a much better way to secure future health and happiness.\n\nBut this is counter-intuitive. We get caught up in the rat race of life. In the busyness, careers, eating well and exercising, buying a bigger house. Relationships are often left by the wayside.\n\nWorking on relationships is not sexy or glamorous. It's plain old hard work, a slog. I find myself sometimes thinking about other things I should be doing instead when spending time on relationships. Coffees with friends or long chats with families(virtual or face to face) leave the dishes not done or the bathroom not clean.\n\nIt's also scary to reach out to strengthen relationships, to open the door for others. Inviting people for tea, making the first phone call or proposing the weekly catch up. We open up to rejection. To the door being slammed in our face.\n\nJust know each instance I go out of my way to strengthen my relationships with my spouse, friends and families. I have felt better afterwards.\n\nSometimes it won't work out, and sometimes the dishes will be left dirty. But we now know that investing in our relationships is the single best way to impact our future health and happiness. So, turn TV time to family board game night. Plan a monthly date night, or reach out to that friend for a zoom catch up. You will feel better afterwards. And you are protecting your heart and mind in the process.", "url": "https://www.reddit.com/r/happy/comments/nklmrh/the_best_investment_for_our_future_health/", "title": "The Best Investment For Our Future Health", "social_network": "reddit", "user": "thehappyorchardblog", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 3, "down_vote": 0, "creation": 1621935158, "permalink": "/r/happy/comments/nklmrh/the_best_investment_for_our_future_health/", "nsfw": false, "first_save": 1635442627.5023353, "replies_charged": false}