{"id": "t5_2qh5i_t3_7xtmt0", "request": ["13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "He's curled up in bed with his head in my lap, completely submurged under the blankets. Every now and then he shifts, to scratch his ear, or nuzzle into my leg, or just to murmur that he loves me. His face isn't visible, he just looks like a big soft ball of comfy. I love these moments, the two of us nestled up into each other, the single bed somehow never feeling too small (apart from my knees slipping off when I'm riding him). \n\nI'm amazed at how perfect this boy is. He's the kindest, most thoughtful and generous and loving man I've ever met. He cares about me so much, and treats me with respect and consideration in a way that makes saying that feel clunky. It's not the drilled-in niceties of \"how to treat your gf\" buzzfeed articles, but the inevietable result of him seeing and loving me as I am. It's never felt like a thing he does, but a thing he is. He is gorgeous (oh that body) and intelligent as fuck and pulls me in with his words and conversations. I started dating him for his mind, but stayed for his heart. \n\nWhat truly makes me so happy that I can burst is more than just how good he is - it's how good we are. How we fit together, and love each other. How we loose hours every day just cuddling, literally not doing anything else. How we trade kisses and hugs every time we leave the room. How we argue, sure, but we always talk it through because we're important enough to work through the niggling annoyances instead of letting them build up. How every moment can be made better by his presence.\n\nLife is good. Oh, there's assignments and work and arguments and the gradual loss of feeling in my legs, but they don't define it. This does. These moments, eating a candy cane and browsing reddit as my beloved smush sleeps on right next to me.\n\nI'm just really damn happy right now.", "url": "https://www.reddit.com/r/happy/comments/7xtmt0/my_boyfriend_is_the_most_adorable_entity_in_the/", "title": "My boyfriend is the most adorable entity in the world", "social_network": "reddit", "user": "CornerHuckleberry", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1518729414, "permalink": "/r/happy/comments/7xtmt0/my_boyfriend_is_the_most_adorable_entity_in_the/", "nsfw": false, "first_save": 1635442926.581103, "replies_charged": false}