{"id": "t5_2qh5i_t3_a4qjlk", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb", "23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181"], "text": "Preface, I'm not great at writing so apologies on the rambly nature of this. \n\n\nI've never really felt like I've belonged to a group of people, I've had a few friends here or there throughout my early teens. And I'm grateful of that. (although less grateful of a lot of my fellow peers, but that another story)\n\nOn starting college (16-18 yrs in the uk) I thought my life would remain fairly the same but little did I know. I very quickly found myself surrounded by some of the most awesome friends I could hope for. I quickly learned how to become a somewhat normal member of society and went to a few parties and even had a girlfriend for a few months which was honestly an amazing few months. Fortunately we parted on good terms and are still very good friends now.\n\nI honestly don't know what my life would be like without this awesome group of people, potentially I wouldn't even be here. But again, that's a story for another day. \n\nHowever, after finishing college I took a gap year before university while all but one of them went to uni or got full time jobs. And for the first few weeks I felt myself really missing them, I loved being able to come in and be able to be around these people. It just made me happy. Which is something I don't find comes easily.\n\nGoing back to just over a year ago I started a new job at the local theatre and entertainment venue as a casual hours technician. I knew I'd prefer this job to my previous one (retail work, very much not for me. I only lasted 8 weeks).\n\nIt has taken almost a year to get used to it, getting to know the team and build relationships with my coworkers and manager. I still don't think anyone there would describe me as chatty but I'm able to have conversations with them and not feel like I'm lost (which was certainly the case with my retail job)\n\nFor the last month or so we have been very busy, with it being Christmas there are lots of Christmas parties in the function rooms and we have been manically setting up and rehearsing for the pantomime. As a consequence I've been racking up some serious hours. (and some serious paychecks too!)\n\nJust this week I've worked 6 out of 7 days and have done over 80 hours. Any sane person would be done by this point, but I'm not. I can't wait for the rest of December!\n\nI really have found a home for my gap year, a group of people I see every day, can have a good laugh with and enjoy myself (while getting paid too!)\nI even seem to have made a few friends and we are going to Lego land next week on the only day we don't have any panto shows.\n\nI don't always enjoy life, I'm hardly someone who's always happy - if fact it used to be almost never - and I'll become pretty sad quite easily. (I also struggle with mental health issues, but have yet to have any formal diagnosis. But I am working on that too, trying to better understand myself and deciding on what I should do to help move forward) Work however gives some joy (actually quite a lot to be honest) to my life I otherwise wouldn't have, and I'm incredibly thankful of that. And of the people that help make it possible.\n\nI do worry consistently about going off to university next year, having to start from ground zero again trying to find another - hopefully - awesome group of people to spend time with. And trying to carry on doing work in an industry I love, but would never pursue professionally. But I've still got 9 more months before that's a reality I'll need to face. And hopefully those months will be as enjoyable as the last few have been. ", "url": "https://www.reddit.com/r/happy/comments/a4qjlk/i_dont_even_care_im_working_80_hour_weeks_because/", "title": "I don't even care I'm working 80 hour weeks because I love my job.", "social_network": "reddit", "user": "OverclockingUnicorn", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1544402109, "permalink": "/r/happy/comments/a4qjlk/i_dont_even_care_im_working_80_hour_weeks_because/", "nsfw": false, "first_save": 1635438946.4586105, "replies_charged": false}