{"id": "t5_2qh5i_t3_nz9dy", "request": ["cf382ebf-3ce7-40b7-a290-2028168701eb"], "text": "Starting with the more trivial things that happened today, my favorite football team won home-field advantage for the playoffs while their bitter rivals lost their chance to make it.\n\nI also stayed up all night hosting a great get-together at my house for New Year's Eve. It started with three people, and expanded to ten in the hours leading up to it. We spent the night watching Return of the Jedi just to hear \"It's a trap!\", enjoying Kathy Griffin making Anderson Cooper uncomfortable, and playing Wii Sports (I kicked butt).\n\nThe best part has to do with what demons I've been fighting for the past three months. In October, I pulled myself out of college to take a leave of absence because I was overwhelmed with work. I learned the hard way that anxiety comes as a side dish with ADHD. This, along with putting too much pressure on myself and my parents being too overbearing on me since middle school in fact prevented me from learning valuable skills like executive functioning and dealing with stress and the pressure of completing tasks. Leaving school was one of the worst days of my life. From the next day on, I worked as hard as I could to seek every means of help and work to prove to myself that I can learn these skills. Now, I am getting ready for the spring semester! I'm overjoyed, but I'm feeling more motivated that I have a lot of work to do and I've only completed step one. At the very least, I'm gonna be back where I can thrive with some of the most beautiful people I've been honored to meet and be friends with (and I mean that as in caring, friendly, and extremely supportive).\n\nI've never been this excited about going back to college before, and I love school!", "url": "https://www.reddit.com/r/happy/comments/nz9dy/2012_is_only_a_day_old_and_already_im_having_a/", "title": "2012 is only a day old, and already I'm having a great start to the year!", "social_network": "reddit", "user": "jczik", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1325471692, "permalink": "/r/happy/comments/nz9dy/2012_is_only_a_day_old_and_already_im_having_a/", "nsfw": false, "first_save": 1635438915.1232412, "replies_charged": false}