{"id": "t5_2qh5i_t3_9902j3", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e", "258e332d-215f-495f-8bee-bccd57229f62"], "text": "In January 2017 I started a nursing course. I was overjoyed and excited! I worked really hard and did well in all my classes..... except one. I failed one of the core courses. One that’s a prerequisite for every course in the following semester so I couldn’t advance in the program without it. I was devastated. A week later I moved into a beautiful new apartment and got in a huge fight with my best friend. We didn’t talk for a month. My friends from school stopped answering my messages and disappeared from my life. I felt like I had lost everything. \n\nFour months later I tried to register for the course I failed but it was full (that class has a 40-50% fail rate! Awful teacher imo). Another four months later and I try to register for the class again. There were only eight spots and I was ninth in line... so another four months pass and I find out they’re offering the course in the spring semester too. So I register and I get in! Got my final marks for the course last week. 87! That’s 20% more than last time. I had to do an internal application to renter the program into the proper semester. The admissions are given on a first come first serve basis (provided you pass whatever course you failed). I was so anxious that I didn’t apply until mid June. I applied for September but also January because I did not believe I would get in for September. I’ve also been applying for jobs because money. \n\nToday I got a call to come in for a job interview tomorrow morning. And then I got an email from my school. It was an offer of admission to my program starting in two weeks... I cried. I cried happy tears and felt a huge weight get lifted from my shoulders. \n\nThe next two weeks are going to be super busy for me! I have to run around and get all my non academic requirements taken care of and I need to pack and get ready to move. I still have to apply for financial aid, but thankfully I have enough to pay my initial fees. But I am so excited. ", "url": "https://www.reddit.com/r/happy/comments/9902j3/today_everything_started_looking_up_for_me/", "title": "Today everything started looking up for me", "social_network": "reddit", "user": "PortraitBird", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 10, "down_vote": 0, "creation": 1534825192, "permalink": "/r/happy/comments/9902j3/today_everything_started_looking_up_for_me/", "nsfw": false, "first_save": 1635438838.7811222, "replies_charged": false}