{"id": "t5_2qh5i_t3_dri0mv", "request": ["e660e09a-842d-44ca-8826-ddfa61319574"], "text": "My best friend at the time had gotten me kicked off my college campus by falsifying a claim that I had raped her (I’m a bisexual woman). Luckily, they were able to prove she was lying, but because she had family connections, I was asked to move off campus anyway. Our friends stopped talking to me and I graduated alone and friendless. \n\n\nI worked for a year, was in a fairly toxic (though luckily not abusive) relationship, when I got accepted to grad school in Cleveland, about nine hours from my home. I didn’t know it at the time, but that one email would change everything. \n\n\nIt’s now a little over two years later. I woke up this morning in a house that I share with my best (girl) friend. We’ve been best friends for a year and I cannot imagine my life without her. I never want to go more than a day without talking to her. We’ve been through the worst of grad school together. She’s going to medical school and I’m so proud of her for it. She works her ass off and comes home exhausted and all\nI can do is make sure the laundry and dishes are done so she doesn’t have to worry about it. She thanks me by cooking 3-4 times a week, usually my favorite Indian food (she’s Indian and an excellent chef). \n\n\nShe introduced me to her childhood best friend, a loving, patient, funny, kind, intelligent man with whom I eventually fell in love. Our one year anniversary is in a few weeks. He lives in New Jersey and is finishing his first semester of law school. We’ve never gone more than four weeks without seeing each other. He worked with me gently through all the bullshit and bad habits of my past relationships, pushed me to work hard on myself, and introduced me to more wonderful people with whom I’m proud to be friends. My weekends (and occasionally weeks!) with him are spent having dinner with our (!) friends, going out on New York City, and cleaning his house together. His mom has my phone number and regularly texts me videos and news articles that she thinks I may find interesting. He is Indian and I am white, so we were concerned about how his family would react; they have been nothing but kind and welcoming and helpful from the beginning, helping me to learn the language and culture and including me in every way possible. They even FaceTimed me to include me in Diwali celebrations! \n\n\nMy roommate’s boyfriend is here this weekend as well. Charming and intelligent, he’s an excellent chess player and a world class skier. He’s got a bit of a “brooding writer” vibe — incurable insomniac, with some of the greatest and most fascinating stories I’ve ever heard. \n\n\nMy greatest joy in life is spending an evening at home with a bottle of wine and our little family of four, playing board games and watching movies and enjoying the company of my favorite people. \n\n\nTo those of you feeling alone in the world: it gets better. It gets so much better. I had no one. Now I have my people, I have my home. Yours is out there too. You’ll find it soon.", "url": "https://www.reddit.com/r/happy/comments/dri0mv/three_years_ago_i_could_not_imagine_the_life_i/", "title": "Three years ago, I could not imagine the life I would have right now.", "social_network": "reddit", "user": "tsisdead", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 36, "down_vote": 0, "creation": 1572876185, "permalink": "/r/happy/comments/dri0mv/three_years_ago_i_could_not_imagine_the_life_i/", "nsfw": false, "first_save": 1635439385.6644359, "replies_charged": false}