{"id": "t5_2qh5i_t3_eqkqf2", "request": ["4311bf71-6ec2-4c3b-aa15-1f9a3223e07b"], "text": "Around this time two years ago, I was in a profoundly dark place, gaining weight, drinking myself to sleep every night, working like a dog for $10 an hour and failing most of my classes in a shitty community college that I went to after having a nervous breakdown at my original university. I was regularly thinking about hurting myself and in May, 2018, I drove about an hour north in the early morning to a hiking trail I used to frequent. There was a large cliff there with a drop of at least 100 feet and I was determined to step into thin air and the oblivion that would come with it. I sat there for about twenty minutes, cried, and looped back to my car, drove an hour back home, changed, and apologized to my boss for being late to work.\n\nToday I’m sitting in my house marveling at how lucky I was to not do it. In the time since then, I found my vocation was cooking, and I got pretty damn good at it. I went to culinary school for two semesters and aced every course. I landed a job in a renowned restaurant group and three weeks ago was transferred to their flagship restaurant in New York, where I’m training to help open a new one in South Beach, Miami. I’m making better money than ever before and am finally feeling myself have some control over my life. \n\nI’m overwhelmed with joy, happy to be alive, and frankly feel like the luckiest fucker to ever walk the earth.", "url": "https://www.reddit.com/r/happy/comments/eqkqf2/by_some_insane_sand_unimaginable_twist_of_events/", "title": "By some insane sand unimaginable twist of events, things somehow got better", "social_network": "reddit", "user": "jwal245", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 19, "down_vote": 0, "creation": 1579374462, "permalink": "/r/happy/comments/eqkqf2/by_some_insane_sand_unimaginable_twist_of_events/", "nsfw": false, "first_save": 1635442053.3171484, "replies_charged": false}