{"id": "t5_2qh5i_t3_f7enwm", "request": ["af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "I am finally able to start taking antidepressants again. The last ones didn't work, but now I'm on what my grandma calls \"the family pill\" because it's worked for so many family members, both immediate and extended. I hope it works for me, too.\n\nMy doctor is a good listener, and she's helping me get myself back on track. I have hope that I will be back to my happy, optimistic, outgoing self. \n\nI've had depression so long that my husband has never known me without it. I cannot wait to be the wife he deserves.\n\nIn the beginning of my depression, I gained 80lbs. I have lost almost 30 in the past year, as I bumbled my way through life. Now I'm starting a real fitness habit: yoga in the morning, pilates in the evening. If I can lose 30lbs with no specific intention, I know I can lose the rest if I put my mind to it. \n\nI started regulating my sleep schedule this week, no more sleeping all day. And it's working. I still feel pretty groggy, but I'll be bright-eyed and bushy-tailed once I develop the habit.\n\nI still have a lot of work to do, and a long way to go, but a journey of a thousand miles begins with a single step. The first few miles are always the hardest, but eventually, as the body is strengthened, you begin to enjoy hiking, and can spend more time looking around than making sure that one foot goes in front of the other.", "url": "https://www.reddit.com/r/happy/comments/f7enwm/im_finally_starting_to_get_my_life_together_now_i/", "title": "I'm finally starting to get my life together. Now I just need to make sure I keep putting one foot in front of the other.", "social_network": "reddit", "user": "MrsKryptik", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1582307010, "permalink": "/r/happy/comments/f7enwm/im_finally_starting_to_get_my_life_together_now_i/", "nsfw": false, "first_save": 1635441986.0540876, "replies_charged": false}