{"id": "t5_2qh5i_t3_6v67ul", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb", "2778c73c-d71d-404c-b65e-4d85a23ff142", "44cd61d3-f01a-4909-b162-9daae7dd79b2"], "text": "So while I was watching the eclipse with my glasses, I waited until I couldn't see any of the \"sun\" through the goggles and then took them off, assuming totality was occurring...but surprise! just got a dose of bright sun (for a second). \n\n\nNaturally, being the anxious hypochondriac that I am, I immediately started freaking out and called a doctor. They basically said that if I do have damage, then there's nothing I can do about it. So this led me to crying in the shower and being grateful about everything I have. \n\n\nIf something does happen, then I'll consider it a life lesson and be resilient. If nothing happens, then I'll consider it a life lesson too. I just realized I've never been so happy to be average. Of course I realize this every day but it didn't hit me quite as much when something like eyesight wasn't in the balance. \n\n\nI'm so grateful I'm average. If I were super smart or incredibly beautiful or rich then maybe I wouldn't have to work as hard and rely on those things. There's actually studies that show that people who are called super smart suffer later in life b/c they rely on talent rather than effort. \n\n\nInstead I get to challenge and surprise myself every day with what I can do.\nI am already so lucky- I have a middle class loving family, shelter, food, internet, a warm bed to go to, I graduated college, as of right now I have all 5 of my senses. \n\n\nEven if I do suffer eye damage (will update you on that), at least I'll still be able to communicate with other people, build resilience, etc. I won't be granted the privilege of being weak or lazy. \n\nAt least I'm not [this girl](https://en.wikipedia.org/wiki/Omayra_S%C3%A1nchez)(NSFW) and I don't have any mental or physical (yet) conditions. Day to day life is relatively easy for me. And living in a 1st world country is like winning the lottery ticket since 60% of the world's population does not. I think on Reddit we sometimes tend to forget that.  \n\nI've never been more happy to be completely average. ", "url": "https://www.reddit.com/r/happy/comments/6v67ul/so_happy_to_be_average_eclipse_viewing_warning/", "title": "So happy to be average- eclipse viewing warning", "social_network": "reddit", "user": "menses_maiden", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 2, "down_vote": 0, "creation": 1503350779, "permalink": "/r/happy/comments/6v67ul/so_happy_to_be_average_eclipse_viewing_warning/", "nsfw": false, "first_save": 1635438961.2037454, "replies_charged": false}