{"id": "t5_2qh5i_t3_pk1q15", "request": ["b3574414-2d10-4990-bb3e-d9be8a3b6716"], "text": "*obligatory \"I'm on mobile\" \"English isn't my first language\" mention*\n\nI don't really know if this is the right sub for that. I just feel overly happy and I want to share it, the same way one would evacuate his anger in one big rant.\n\nSo, there's this girl in my uni. We have friends in common so I see her sometimes at parties, we played in a rpg together, we're in good terms overall but nothing to write home about, really.\n\nThere's this week where we go every evening to different bars, to give an opportunity for the newcomers at the uni to meet the other students. Of course I went, and of course she went.\n\nYesterday evening, I might have drank just a little bit. She went to ask me a question when she was leaving and (I'm certain there was a logical reason but I can't remember it) I ended up telling her that yeah, she's a great person and I would love to get to know her. She didn't really reacted. \n\nI realized during the night that it was a dumb move on my part. I don't know what I was expecting.\n\nToday, I spend most of the evening acting like yesterday never happened. We were cordial but I didn't wanted to get back on the topic. There was nothing more to say, right?\n\nAnyways I drank a bit again and I was here challenging people to arm wrestling. I don't know why, but I asked her, and she accepted. We had had to move in a corner of the bar to find a suitable table to do it. I won and we started discussing about gender roles or whatever. Anyways, she brought up what I said yesterday. I comfort her that I took some time to think it through, and it was just me forgetting to just shut the fuck up and she shouldn't worry about it. She asked me \"why?\" I told her that I don't know what I was expecting, going to her while not really knowing her first.\n\nShe told me that she felt the same, kinda attracted but she would like to get to know me better first.\n\nIf that's not a girl asking you to a date I don't know what is.\n\nAnyways, after this bar marathon is over, we plan to have a date together and see where it goes.\n\nI'm just fucking happy because we played a rpg together for a year. If she saw me yell about my Dream Body spell while making mildly offensive jokes about cat people in Tamriel and still think \"I find this man attractive\", then I know I can be myself with her and it won't be a problem.\n\nWhat makes me smile like an idiot is that, when she finally went to leave, I told her \"see you tomorrow\", and \"I can't wait to see you again\". And she fucking said \"me too\" with that cute shy smile after a second. Every time I think about it my heart melts a little more. She's precious and I can't wait to see her again.", "url": "https://www.reddit.com/r/happy/comments/pk1q15/confessed_to_this_cute_girl_at_my_uni_and_she/", "title": "Confessed to this cute girl at my uni, and she said she felt the same!", "social_network": "reddit", "user": "Abserial", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 23, "down_vote": 0, "creation": 1631068395, "permalink": "/r/happy/comments/pk1q15/confessed_to_this_cute_girl_at_my_uni_and_she/", "nsfw": false, "first_save": 1635439586.6721299, "replies_charged": false}