{"id": "t5_2qh5i_t3_qazs9t", "request": ["d616ef6b-b663-4224-82e4-e87b0aff3562", "23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181", "f99849f1-c5ed-4a2e-9fa7-a30fa9b108d8", "db00040a-8e0a-460b-8461-1663433c39fb", "4ac40434-7819-4123-ba6e-67be5bf90ee7", "d2bf8290-ea9d-4601-bf64-8bb709730ec1"], "text": "I finally had the good fortune of meeting a good man that loves me for real. We’ve been together a while now. His son is a sweetheart, he opens up to me about his troubles and thoughts and he’s the man of the house for me when dad is working his two jobs. He gives me a reason to be a kid again (which I never grew out of anyway 😅). I had to tell somebody. I love our little life. We are broke as shit and thriving in a tiny apartment. We carved pumpkins and did arts and crafts last week. There are pumpkin seeds and glitter and toys everywhere. I have a bag of lollipops hidden behind my nightstand for special treats, he doesn’t know and thinks I only bought the one I gave him. I always loved to sing and my boyfriend is the first person I could ever freely sing in front of without feeling self conscious. We have pretty house plants, and his son picked me beautiful flowers from the backyard that melted my heart. Reddit, I just had to tell somebody that my little tiny life with my boys is wonderful. Ive been through some things and never thought I’d be here and I’m loving every second of it.", "url": "https://www.reddit.com/r/happy/comments/qazs9t/i_never_thought_id_be_posting_here_but_im_happy/", "title": "I never thought I’d be posting here but I’m happy and I had to tell somebody about my little joys 😊", "social_network": "reddit", "user": "SassySpider", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 89, "down_vote": 0, "creation": 1634603110, "permalink": "/r/happy/comments/qazs9t/i_never_thought_id_be_posting_here_but_im_happy/", "nsfw": false, "first_save": 1635439050.0886, "replies_charged": false}