{"id": "t5_2qh5i_t3_3zpxpp", "request": ["af00f57d-0c85-41f5-985c-7cc20793bcbb", "16c197eb-37e3-4b7d-b0c8-d85bde10c493", "13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "I'm fifteen minutes early. As I cross the street I spy the sushi restaurant, its windows covered in local newspaper stories and awards. It's a crisp mid-April day in northern Virginia. The wind is brisk and the sky is a deep azure, with small puffs of clouds lazily sighing across the sky.\n\nI grab hold of a searingly cold metal chair next to a table that's been optimistically left outside the restaurant, and take a seat. It's only been a couple of days since she first messaged me, but I've been playing the exchange over and over again in my head. A Simpsons quote, of all things, piqued her interest, my knowledge of cursed frogurt satiating her desire to meet someone that inhabits the same world she does. \n\nPleasantries led to digitally shared laughter, and a connection was made. We spent nearly five straight hours talking online that day, only to spend another two hours that night on the phone. Quite a feat, considering our mutually shared distaste of using a phone for its originally intended purpose. This was followed the next day by nearly a thousand text messages.\n\nStill ten minutes early.\n\nA flash of my ex wife's face appears in my mind's eye. It's been six months since we amicably split, agreeing that, despite nearly a decade and a half of friendship, including three years of cohabitating and three years of marriage, our time was sadly at its end. It's been four months since I last cried over her, and several weeks since I last thought of her. I hold no ill will, but I'm not about to let the past ruin the present; I permit a moment of nostalgia for days gone by, and then file her visage away into long term storage.\n\nStill eight minutes early.\n\nI'm gently snapped out of my thought-trance by someone rounding the corner a few yards away from me. Her hair is pulled back into a tight ponytail, and large sunglasses hug her round face. Just like in the pictures I spent untold hours staring at, she is a full-bodied woman, with defined shoulders and a powerful frame. Her enticing hips gently sway as she walks towards me, an endearing yet slightly nervous smile appearing on her lips.\n\nShe's wearing a long-sleeved black sweater that clings to her arms and voluminous bosom. Her black skirt gently brushes the tops of her knee-high boots, her bare peachy thighs occasionally peeking out from behind the soft fabric. She has multiple rings on both hands, as well as earrings and studs slowly hiking their way up and around her delicate ear lobes.\n\nHer appearance is that of a librarian moonlighting as a solitary goddess. Intelligence, veneration, and lust incarnate. \n\nI flash an earnest, friendly smile. \"Well hello! You must be Priscilla.\"\n\nTimidly, yet cheerfully, she replies. \"Hi!\" \n\nHer voice is bathed in honey, high-pitched, soft, vivacious, and comforting. As she nears, I catch her scent on the breeze. She smells of vanilla, lilacs, brown sugar, and indistinguishable warmth. \n\nWe start walking up the street, exchanging the obligatory small talk. Yes, my drive in was fine. I've never been to this part of the state before. No, I didn't have any trouble finding the place. You're right, it sure is cold as hell out here. To myself: your exposed, supple legs must be freezing. \n\nHer very existence is intoxicating. I can barely walk without stumbling.\n\nWe come to a bench and sit down, the cold wood pressing against our backs. The gelid wind has us instinctively sitting close, enveloping us in a cocoon of public seclusion. We discuss her time as a roller derby blocker, my undying love for video games, and our shared appreciation for cheesy 90's movies.\n\nShe removes her sunglasses, and I can't help but stare. Her eyes are a velvet swirl of hazel and green, surrounding pupils that look like polished onyx. The entire world melts away. The cars, the people walking by, the stores, the restaurants, the noise, the wind, the sky, the cold. All that exists is me, her, and our park bench.\n\nHer very soul peers back at me and breathlessly whispers. Enraptured. \"Oh. There you are.\"  \n", "url": "https://www.reddit.com/r/happy/comments/3zpxpp/oh_there_you_are/", "title": "Oh. There you are.", "social_network": "reddit", "user": "pojut", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 65, "down_vote": 0, "creation": 1452089687, "permalink": "/r/happy/comments/3zpxpp/oh_there_you_are/", "nsfw": false, "first_save": 1635441990.2400866, "replies_charged": false}