{"id": "t5_2qh5i_t3_10rnfw", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e", "ea4a7795-7887-476a-9ab2-4c77d117a852"], "text": "My husband and I lost our house in April of last year after three years of unemployment.  We are in our very early 50's, and wiped out our savings attempting to hang on in an economy that had no jobs that paid the salaries on which our budget was based, and valued even less people in our age bracket, despite our advanced educations. In our spare time (which we had in abundance) we worked our two Labrador retrievers in Search & Rescue, which is an all-volunteer activity.  During a training exercise my dog tore the cruciate ligament in his knee, the repair for which would cost between $3200-$3700.  Literally days later the plantar facia in my foot began to detach, but without health insurance I could not afford to get medical help.  We were homeless (living out of a room in my parent's house), hurting and, frankly demoralized.\n\nSince April of last year my husband has gotten his dream job and I started a surprisingly successful detection dog training business; we are renting a little cottage that is absolutely perfect for us, with a landlord that is a delight; we convinced our credit union to loan us part of the money for my dog's surgery and managed to save the remainder, thus my dog is now healthy again and ready to get back to SAR work; I made the last loan payment for my dog's surgery yesterday; I was released from medical treatment for my foot last week and rehab on my foot is going beautifully - I should be back to my old activities next week, my dog at my side, my hubby happy in the job he's always wanted.\n\nFrom having the \"wheels fall off\" of our lives, to full recovery in 18 months - life is really is amazing!", "url": "https://www.reddit.com/r/happy/comments/10rnfw/the_speed_at_which_life_can_turn_around_can_be/", "title": "The speed at which life can turn around can be amazing...", "social_network": "reddit", "user": "K931SAR", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 22, "down_vote": 0, "creation": 1349110387, "permalink": "/r/happy/comments/10rnfw/the_speed_at_which_life_can_turn_around_can_be/", "nsfw": false, "first_save": 1635438845.4187722, "replies_charged": false}