{"id": "t5_2qh5i_t3_96e1ev", "request": ["c889a480-189a-4ed9-aa88-81c300413196"], "text": "There is a story in my family that goes like this:\n\nMy great uncle (let's call him Bill) was a dairy farmer his entire life. He rode horses around the farm, my great aunt adopted pretty much every stray dog within 30 miles, and they had lots of other farm animals. One day, he and some of the farm hands were having their lunch in the shade of a barn. Someone asked, \"What do you think heaven will be like?\"\n\nOne farm hand, who I knew, reports that his own answer was, \"I just want to not work. I want to be able to sit somewhere cool and just not do anything.\"\n\nMy great uncle Bill reportedly said, \"Well, when I get to heaven, I hope I get to take care of animals. That's what I'm good at, and I hope I get to keep doing it.\"\n\nThis was his life on earth, and he would keep doing it into eternity if he could.\n\nAnd I always think, that's really it, isn't it? Happiness is doing in life what you would do in heaven. \n\nHe died when I was pretty young, and I never heard this story until years later. But when I think of great uncle Bill now, I prefer to think of him in the green cattle pasture that I know well, right at the foot of a mountain, on a sunny day, riding one of his horses and followed by his pack of rescued dogs, rounding up cattle.\n\nIn my own case, I know I'm living well when I'm surfing, hiking, and writing. I can only hope when I pass away, people will think of me as I would be in my heaven, on a trail in the woods or catching waves in the early morning.\n\nOf course it's possible to be wrong about what makes you happy. I have done things I thought SHOULD make me happy and pretended that they did, but they're not things I would do in my own heaven. This story has kept me focused on spending my free time doing things that ACTUALLY make me happy, things I could do forever, even if I could do anything.", "url": "https://www.reddit.com/r/happy/comments/96e1ev/my_great_uncles_idea_of_heaven_always_gives_me_a/", "title": "My great uncle's idea of \"heaven\" always gives me a lift", "social_network": "reddit", "user": "CopperTeapot", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1533962964, "permalink": "/r/happy/comments/96e1ev/my_great_uncles_idea_of_heaven_always_gives_me_a/", "nsfw": false, "first_save": 1635441436.3240843, "replies_charged": false}