{"id": "t5_2qh5i_t3_2z8w2m", "request": ["4de8d439-3f8c-406c-9767-31bcb471a057"], "text": "One of my wife's great talents is gift giving. It also happens to be one of the great contrast between us...nearly tragicomic, since the last thing a great gift-giver deserves is to be paired with someone whose gifts are not just bad in comparison, but terrible in the absolute. Among my worst include a pipe-cleaner bicycle that served as an IOU for a real bicycle that has never materialized, and 40ft of nylon rope with knots in it.\n\nThis year the chasm between us became much wider. Some background: The grocery store that we shop at displays and sells local artwork. When we first moved to the neighborhood (we're in Boston), a particular absurdist piece caught my eye. It showed a man with a bat head (or bat with a man body?) dressed in the fashion of the 1950s. They weren't asking much, but I was gun-shy and didn't buy it. That hesitation cost me the piece, since by the time my resolve had solidified, it had been sold, and I felt like a boob. This missed opportunity grew more galling over time because no art that has been displayed in that grocery store since has come close piquing my interest. But as my disappointment faded into dopey complacency, my wife's gears were turning.\nGetting that piece back was impossible, it was gone, but maybe there were others, she thought. After all, he or she was a local artist. She first went to the grocery store thinking she could get the name from them, but alas. Drew pictures of a bat-man? How long ago? Perhaps it was never meant to be.\n\nJust as she was about to leave the store empty handed, she head something. \"Psst!\" A re-stocker with blond dreadlocks wrapped in a bandanna beckoned her. \"That guy you're looking for? Between you and me, I think he used to work as a barista at a coffee shop up the street,\" he leaned in so close she could smell quinoa on his breath, \"Just don't tell them who sent you.\" (I may be embellishing a little here.)\n\nMy wife was skeptical, but her case was hanging on by a thread. THIS thread. It was coffee shop or defeat, so she did the only thing she knew how and pushed onward.\n\nBelieve it or not, the white Rastafarian was telling the truth. However, more obstacles. The artist, envisioning the polar wasteland that Boston would become, had moved permanently to Miami and was rumored to be artist-in-residence to a Cuban mafia boss. They said he had e-mail, though, so my wife saved herself a trip to Florida and wrote him.\n\nIt took a while for him to respond, but he eventually did. The two of them discussed various options but ultimately decided that the completed artwork that he had for sale wasn't going to cut it. (For one, while other works included bats, not a single one had the bat-man chimera that spoke to me so viscerally.) So my wife commissioned a new piece, giving the artist some basic parameters of my tastes, such as burgers, birds, and bat-men. The result was [this picture] (http://imgur.com/nYmz7u8), which came in the mail shortly before my birthday.\n\nAnyway, just a long-winded way of sharing my excitement.\n\nTL;dr: I didn't buy a piece of art and then it was sold. I was sad. My wife tracked down the guy, and commissioned something custom for me!  Overjoyed!", "url": "https://www.reddit.com/r/happy/comments/2z8w2m/hard_to_beat_this_gift_next_time_its_her_birthday/", "title": "Hard to beat this gift... next time it's her birthday, I'm screwed.", "social_network": "reddit", "user": "Theboneyman", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 177, "down_vote": 0, "creation": 1426523685, "permalink": "/r/happy/comments/2z8w2m/hard_to_beat_this_gift_next_time_its_her_birthday/", "nsfw": false, "first_save": 1635439615.2337494, "replies_charged": false}