{"id": "t5_2qh5i_t3_c9k1ii", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "I broke up with my ex a year and a half ago. I put on weight (like 40 lbs, but I carry it well) and haven't done anything on my off days except watch TV, eat, and binge drink. Mainly, I'm just too exhausted to do anything active or even leave my house except to go to work.\n\nAnyway, there's a guy at work who's been like my bff since we started working together last year. I never had any intentions of a relationship with him. He had a girlfriend, ex-wife, etc... We are just really close at work. Tell each other everything. But we never hang out outside of work.\n\nHe just left his girlfriend (she's a psycho that I've had to hear about since we've been friends) and moved in with his aunt. \n\nLast night, I invited him over for fireworks so he wasn't alone. He ended up sleeping over, and as we were laying down, he confessed that he's in love with me. He embraced me, told me how beautiful I am, how my smile and my eyes light up his day, and lots of other extremely sweet things that no one has ever said to me. He asked if he could kiss me and i said yes. We started making out, and one thing led to another. I kind of hesitated, because I hadn't shaved my legs in a few days and I feel uncomfortably fatter than normal.\n\nIt was the most beautiful thing. He wanted to look in my eyes, kiss me all over.\n\nSince he is my only friend that I would tell something like this to, I'm turning to Reddit to express my happiness. I'm feeling so beautiful and happy today!", "url": "https://www.reddit.com/r/happy/comments/c9k1ii/i_just_had_sex_for_the_first_time_in_over_a_year/", "title": "I just had sex for the first time in over a year because of self-image problems and it was the best thing ever!!", "social_network": "reddit", "user": "saltstorm100", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 95, "down_vote": 0, "creation": 1562354660, "permalink": "/r/happy/comments/c9k1ii/i_just_had_sex_for_the_first_time_in_over_a_year/", "nsfw": false, "first_save": 1635440700.1573882, "replies_charged": false}