{"id": "t5_2qh5i_t3_6n4oac", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "It's been a long time coming, but over a decade ago, I moved to Arizona, which was a place I had lived as a child and had some unpleasant memories (plus I love green nature/the outdoors, and it never felt quite \"right\" or comfortable there). I knew right away that it wasn't a great \"fit\" for me, but stuck it out to go to school and work a good job. \n\nThe last year was more challenging, and I had to see a therapist for anxiety/depression. They kept telling me the \"grass is greener where you water it.\" And I don't disagree at all! But they did not take into account, perhaps, that people feel more comfortable in different places for various reasons and that's ok! There is also a some negative occurrences in Arizona, and the past.  Combined that with the fact my company I worked for and enjoyed downsized about a year ago, and there wasn't much left there except family (which is important, but they aren't too far)!\n\nFast forward to today. My boyfriend and I, having been together 14 years, are now engaged. Looking back, I think we did not get married because of issues about my self worth--I did not think I was worthy or deserved it. And so I kept putting it off, too afraid to move forward and receive any attention from others. But everyone deserves to celebrate their love with one another.\n\nWe moved to a lovely city in California. While the first week of moving was stressful, we are now at a place where it feels more like home! There is so much to do and  it feels so freeing!\n\nThe most amazing parts are (1) I've been able to ride my bike almost everywhere including the beach and beautiful parks with greenery (2) for some reason I feel pretty comfortable around the people here, and just the culture in general, maybe the diversity is a part of that. People allow you to be \"you\" here, more so than before (or so it felt). It's a vibe that seems more like the metropolitan city I grew up in. (3) there are more job prospects and I can restart my career after it felt like it was over (4) my fiancé received a bonus that has allowed us to buy some \"nicer\" furniture and home supplies. I got to shop again which i haven't done in awhile! I even splurged on some items like active dresses/workout clothes, a dress and tanning lotion. I didn't realize in such poor condition some of my clothing has gotten over the years. Plus I haven't bought a nice or sexy dress in so long. But my boyfriend/fiancé may appreciate it! (5) I've been forced to get outside my shell and overcome social avoidance. And it's working -- I'm beginning to feel freer and better overall!\n\nAll in all, it feels like I'm going to be ok now. Better than ok I hope! Trying to keep it positive, but I was diagnosed with ptsd due to trauma from years ago, and moving has given me an opportunity to get away from the people and places that remind me of that. I've been crying intermittently throughout the days, because I can't believe this is happening! I didn't think I could feel this happy (or deserved to) for a while and I'm grateful! Maybe there really is a guardian angel watching out for us. Maybe dreams can really come true, if you stick with it and keep moving forward :-)", "url": "https://www.reddit.com/r/happy/comments/6n4oac/so_overjoyed_after_moving_to_a_new_city_cant_stop/", "title": "So overjoyed after moving to a new city! Can't stop crying!", "social_network": "reddit", "user": "sohappysocal", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 12, "down_vote": 0, "creation": 1499981145, "permalink": "/r/happy/comments/6n4oac/so_overjoyed_after_moving_to_a_new_city_cant_stop/", "nsfw": false, "first_save": 1635440714.799277, "replies_charged": false}