{"id": "t5_2qh5i_t3_pakdmh", "request": ["f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "Birthday\n\nHave had a plan to celebrate my birthday this week to make up for the fact I didn’t have a proper 21st, and I don’t want to drunk text my friends and think this appreciation is only out of being under the influence. But I just want everyone to know having friends who genuinely support you and want to see you succeed is so amazing. I NEED the best for all of my friends period. Knowing I have the support from them as well in whatever venture I take is so heartwarming. \n\nGet friends who are confident and are confident in you. \n\nIt’s so nice being at peace with yourself knowing you have a group of people who want the best for eachother. It takes a while to find these people but cherish it. I used to never see a point to life and wanted to end it all for the longest amount of time because I didn’t see a point… and I can see where people come from in hopelessness, give it time you will find your people. You will find your group that all supports eachother. You will find meaning to keep going, you may not find the reason but you will find why and who to keep going for to support them and to have them support you is amazing. Just give it TIME. I really never thought I would find this point in my life but man does it feel amazing to regret every single negative thought about life I ever had. I hope everyone finds this. I want everyone to reach this point of appreciation towards who they have in their life.\nThey tried to remove me for a vague title yeaYEA YEA WE WILL SEE ABOUT THAT .", "url": "https://www.reddit.com/r/happy/comments/pakdmh/birthday_birthday_just_get_happy_about_living/", "title": "BIRTHDAY birthday just get happy about living another year please", "social_network": "reddit", "user": "creasedaf1", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 3, "down_vote": 0, "creation": 1629799774, "permalink": "/r/happy/comments/pakdmh/birthday_birthday_just_get_happy_about_living/", "nsfw": false, "first_save": 1635443358.450012, "replies_charged": false}