{"id": "t5_2qh5i_t3_bp6h5n", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "To start off, I want to let you know that I’m currently a teenager.  As a teen, I have to listen to all sorts of different genres of music when I’m in a car with friends.  Some songs are good and some are garbage, but that’s besides the point.  My point is, I’ve been trying the past couple of years to branch out to all sorts of genres of music with inspiration from my friends and family’s tastes.  While I’ve been on this search for awesome songs to listen to, I found out something amazing:  You can blend genres of music.  Now, I know most of you already know that you can combine different types of music, but like me, I don’t think you understand the full extent of it.\n\nI’m talking about COMPLETELY different genres, like jazz, punk, dubstep, rap, and even folk music can be combined to create some amazing tunes.  I’m leaving 3 examples here, but there are countless other genres that I haven’t discovered yet that I’m sure are equally good.  If you have others to show then please leave a reply.\n\nTo start, let’s talk about punk pop.  This is a genre that you may already know about, and it really peaked about 10 years ago.  I know that many people who listen to this style of music are stereotyped as “Edgy” but I can’t help but legitimately love all of these songs.  Recently, artists have started mixing more electric and dubstep into here, one of my favorites being a relatively unheard of artist named SkyeRocket.  [Here’s](https://www.youtube.com/channel/UCQ8LphDbsq3ycz-EdWxwJ1Q) a link to his stuff. (Also yes I’m linking YouTube for now, I can link spotify later on if you guys want it)\n\nNext, there’s a bit of a stranger yet equally fun genre, also involving punk:  Folk Punk.  This genre is very unpopular, yet you can tell the people who write this music are singing from the heart, whether it be for fun or to convey a point about the world or their circumstances.  As I like to put it, half of it is r/im14andthisisdeep while the other half is eye opening stuff.  Ok, maybe most of it is r/im14andthisisdeep but you get the point.  My favorite artist from this genre is a band called the wingnut dish washers union.  [Here’s](https://youtu.be/FO79S-VPkL0) a link to my favorite song of theirs.\n\nLastly, I have a genre that I personally don’t listen to much, but I’m still happy it exists none the less.  It’s called Japanese Ska, and it’s exactly what it sounds like.  Love the bounciness of Ska?  Think of that, except it’s more exciting- and in Japanese.  It’s a bit hard to describe, yet really good! Since I don’t listen to it as much as the other genres I can’t say much else, but [here’s](https://www.youtube.com/user/tokyoskanet) a link to my friend’s favorite artist.\n\nThat’s all I wanted to show for now, because if I showed more this post would go on forever.  If you know about any other of these genre blends, please share them!", "url": "https://www.reddit.com/r/happy/comments/bp6h5n/not_exactly_a_story_but_it_makes_me_super_happy/", "title": "Not exactly a story, but it makes me super happy that different genres of music can combine!", "social_network": "reddit", "user": "thespecialpoint", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 2, "down_vote": 0, "creation": 1557970088, "permalink": "/r/happy/comments/bp6h5n/not_exactly_a_story_but_it_makes_me_super_happy/", "nsfw": false, "first_save": 1635440711.7335515, "replies_charged": false}