{"id": "t5_2qh5i_t3_2fi2a2", "request": ["23d40627-ba71-4806-9d30-ac350683ef35", "13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "A friend of mine was fortunate enough to start a software company and sell it for a great sum of money at a relatively young age. Lately he has been a bit bored and decided, on a whim, to sign up to be an Uber driver. He has a fleet of cars and decided to use one that is fairly popular and the result has been a 5-star rating as he has met some interesting celebrities, politicians, and business leaders. I've laughed at him for doing it but he has really enjoyed it. The part that strikes me as so funny is that none of these people have any idea how much this guy is worth.\n\nThe other day he picked up a lady in her mid-20s and was talking to her. It turns out that she is a single mom who has moved in with her parents. She's in a suburban area and doesn't have a car and is forced take taxis/Uber to her job. My friend the Uber-driver dropped her off at a restaurant where she remarked that she was working there as a server. She was very insistent that he accept a $10 tip on the $5 fare.\n\nNow, the $10 isn't going to be enough to be useful to my friend but she is very insistent and he reluctantly agrees to take it because the tip is obviously important to her. (For those of you not familiar, Uber drivers typically do not get tips.) My buddy thought about it all night and it really bothered him that this single mother working as a waitress was tipping him.\n\nSo the next day he walks into the restaurant, finds the server, orders a soft drink, and thanks her for her tip from her fare the day before. He said it was very nice, but that he felt that she was the one really working hard to provide for herself and her child. And with that, he puts $100 bill on the table and walks out.\n\nGood guy.", "url": "https://www.reddit.com/r/happy/comments/2fi2a2/uber_driver_tips_the_customer/", "title": "Uber driver tips the customer", "social_network": "reddit", "user": "Happyhokie", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1409872753, "permalink": "/r/happy/comments/2fi2a2/uber_driver_tips_the_customer/", "nsfw": false, "first_save": 1635440884.9381137, "replies_charged": false}