{"id": "t5_2qh5i_t3_q7rllk", "request": ["6b93752c-d52c-407b-88cc-1f59c1677fad", "f99849f1-c5ed-4a2e-9fa7-a30fa9b108d8", "db00040a-8e0a-460b-8461-1663433c39fb"], "text": "I remember being told by my high-school guidance counselor that college wasn’t even an option for me. I used to harbor so much anger and be a trouble maker. Financial instability was always a thing growing up. It’s just how I thought the world was for me. \n\nYesterday I had my final interviews for my dream starting position at my dream firm and shortly after, received a full-time offer as an Audit Associate. It’s literally a life changing opportunity. I’ve had an amazing hiring experience and never thought I’d make it past the resume part. \n\nI’m the first in my family to ever go to college. I survived through athletic scholarships and so many awful, random jobs.\n\nThis December I’ll be receiving both an MBA and MPAcc. I have worked so hard for so many years to get here. This was always my dream, as in literally, I would joke about wanting to be in this position because I thought it was so out of reach.  \n\nIt still doesn’t seem real and honestly not sure how to express my excitement because I’ve been working so hard towards this for so long. \n\nI don’t really have a support system to express my excitement so I’m ranting here. Idk how to express my excitement outward without feeling like I’m bragging. Statistically, there’s no reason i should have reached this point and am just really proud of myself honestly. \n\nI hope I am able to provide proof to my two younger brothers that they can achieve anything they want. College wasn’t even a possible option for us. I hope I can give back to others and be the person who I’ve always needed and searched for.", "url": "https://www.reddit.com/r/happy/comments/q7rllk/ive_worked_so_hard_for_this_i_dont_even_know_how/", "title": "I’ve worked so hard for this, I don’t even know how to express how happy I am.", "social_network": "reddit", "user": "AttemptingToPaint", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 21, "down_vote": 0, "creation": 1634182821, "permalink": "/r/happy/comments/q7rllk/ive_worked_so_hard_for_this_i_dont_even_know_how/", "nsfw": false, "first_save": 1635439669.5321114, "replies_charged": false}