{"id": "t5_2qh5i_t3_9gt7lb", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "I am so happy at the moment. I feel the break up was the best thing to happen to me. I have never been so happy. \n\nI remember being so depressed, I had lost so much weight. I picked myself up, started building myself. Since then I have met so many girls, went on so many dates, made many friends. I get so many attention these days, I look very different than I used to. \n\n&#x200B;\n\nI am always the centre of attention, usually, in a group of twelve people, I am getting most of the attention.\n\n&#x200B;\n\nThis is the before and after picture of me.\n\n[https://imgur.com/a/ZEzYJrh](https://imgur.com/a/ZEzYJrh)\n\n&#x200B;\n\nIn the last two months, I have made many changes.\n\n* I run a lot these days, the other day I ran for 10 miles in an hour and thirty minutes.\n* &#x200B;\n* I am so much dedicated towards fitness that I go to the gym five days a week.\n* &#x200B;\n* I read a lot, I have read many books in the last two months.\n* &#x200B;\n* I am learning guitar, I am doing amazing at it so far, almost learned the song Blackbird which is pretty advanced shit.\n* &#x200B;\n* I am learning Spanish, doing well so far.\n* &#x200B;\n* I have been writing a lot, I am more inclined towards literature and expressing myself through writing.\n* &#x200B;\n* I am working on my vocals, it's good to have the abilities to sing and be a songwriter.\n* &#x200B;\n* I went on a solo trip for twelve days to other states of my country, I went to Rishikesh in India, to The Beatles Ashram, and to many other places.\n* &#x200B;\n* I couldn't ever get up before 10, these days I get up by 7.\n* &#x200B;\n* I never could really get myself out of my uncle's tyranny, I am finally quitting his business this month end. \n\n&#x200B;\n\nI am such a free bird. I have no fear. I have so much confidence than I ever did. I still don't drink or smoke. These days I find girls giving me their phone numbers by themselves. None of this would have happened if I were still with my ex. I feel change is a good thing. \n\n&#x200B;\n\nThe best thing I learned from my last relationship was that \"Never force anyone to be with you\" If they love you, you will have them at any cost. Pushing someone to be with you will make them leave you more. Suppose you're working at a company, the owner implies that you can't leave them because they depend on you. This way you feel more stifled. It's the same for a relationship.\n\n&#x200B;\n\n&#x200B;\n\nInstead, after some time, try to set your partner free. Challenge them to leave. If they really love you, they may not leave. Nobody likes being caged in a relationship. Not every relationship lasts forever. Suck it up that yours may not last forever, this way you won't be in the same situation as me. As what George Harrison once wrote, \"All Things Must Pass\".", "url": "https://www.reddit.com/r/happy/comments/9gt7lb/i_feel_the_breakup_was_the_best_thing_to_happen_me/", "title": "I feel the breakup was the best thing to happen me.", "social_network": "reddit", "user": "stopitkramer", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1537261874, "permalink": "/r/happy/comments/9gt7lb/i_feel_the_breakup_was_the_best_thing_to_happen_me/", "nsfw": false, "first_save": 1635438835.5215962, "replies_charged": false}