{"id": "t5_2qh5i_t3_ae83c0", "request": ["4161666b-4b17-4c22-bb40-42efca26f347"], "text": "First of all, I would like to say hello to everybody on this wonderful subreddit! Second of all, please forgive me if I do anything wrong by accident; trust me, I read the rules.\n\nNow, let me get to the real nitty-gritty: women make me feel happy, but none more so than my very own mother. Why? Well, she's been very understanding in regards to my various quirks and has done whatever it takes to make sure I can live a happy, fulfilling life of my own in case something were to happen to her. She has also been kind enough to allow me and my brothers to visit my father (himself an awesome person, but that's a different story) on the weekends even after they divorced. Also, she has always been there for me - in spirit, if not always physically - when I needed a helping hand and I felt as though no one else would help. \n\nMy mom's a very strong woman as well, having experienced numerous challenges herself and choosing not to give up on life. Not only that, but she isn't afraid to speak up or take action when she feels that something is wrong. I mean, good luck to you if you get on her bad side. That aside, she's instilled me with a strong sense of justice and respect for those who are of different ethnicities, genders, orientations and other immutable background traits. I may not agree with all of her political opinions, but she has also instilled me with the ability to understand where people are coming from even if I hate them or their opinions. \n\nPolitics aside, what I really love is all of the happy memories we've shared over the years, such as the time she saved up money and went on a school-sponsored trip to France and Italy with me when none of the other people in my French class elected to go. Another thing she really did that impacted me was the time she told me that I was a better human being than she was. I'll admit, I've committed my share of mistakes, but to hear that sort of thing from somebody who is herself a wonderful human being in spite of all the things she did that I didn't like (which I'm not going to call her out on here) really means A LOT to me.\n\nSo mom, if you're reading this, I just wanna let you know that I love you very much and that you're forgiven for any wrongs that you may have committed towards me! ", "url": "https://www.reddit.com/r/happy/comments/ae83c0/my_mom_makes_me_very_happy_because_shes_such_a/", "title": "My mom makes me very happy because she's such a wonderful person", "social_network": "reddit", "user": "NewEnglandSynthOrch", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 14, "down_vote": 0, "creation": 1547049095, "permalink": "/r/happy/comments/ae83c0/my_mom_makes_me_very_happy_because_shes_such_a/", "nsfw": false, "first_save": 1635440993.64041, "replies_charged": false}