{"id": "t5_2qh5i_t3_bu1wt0", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142", "608fc108-cf44-476e-8378-c59ee7483909"], "text": " \n\nThis is probably going to be longer than i intended but i wanted to say something for anyone it may help. The point is, things can always change. Yes they can get better, and sadly they can get worse. But as long as you don't give up you can always come out on top. Sometimes the change is short. Sometimes it takes a while. But if you hate where you are you can always control where you are going.\n\nThree years ago my girlfriend of eight years left me suddenly with no reasons. Blaming me for things that didn't make sense. Accusing me of things i didn't do. Everything was so sudden, i was hurt and confused as she lead me on for months that we can possibly get back together. We still had four months to our lease on our apartment and neither of us could afford to move out so she moved into the guest room... From an eight year relationship to a sudden situation of awkward roommates with no notice... This is now my definition of torture.\n\nNeedless to say i was a little 'upset' at this time. I was devastated. The person i planned to spend the rest of my life with threw me away. I had the date and trip planned for when i was to propose. My close friends and some mutual friends already knew about my intentions. All down the drain.\n\nTo put salt in the wound the company i had worked at for over ten years was having trouble and laying off people including cutting hours and overtime which i had every week. I was mostly spared from many of the cuts because i was better trained and more reliable but the threat always loomed. The entire industry i work in was struggling and falling and it's the only thing i know how to do.\n\nI came home one day from work near the end of our lease and all of her stuff was gone, as well as some of my stuff she decided was hers... No warning, no notice. A giant mess left behind and her keys on the counter. I sat in my apartment alone, feeling like i was worthless over the whole weekend and into the next week. Looking back i realize how bad i was. I was in no condition to be alone with my thoughts for that long. Thankfully i just moped and cried for a majority of it and stayed to myself.\n\nTo make matters worse i was good friends with her brother and i also worked with him. I had helped him get a job with the company a few years back. He seemed upset by the whole situation too. We all got along so well it was such a jarring situation as we had so many mutual friends that were completely surprised by the events.\n\nAdmittedly in an awkward situation i was having trouble finding a place i could afford at this point. I didn't need a lot of space but prices were high everywhere. Around this time her brother was looking for a place with his girlfriend and could use the help on the rent and we got an apartment together splitting everything three ways. Not an ideal situation but helped us both out. Pissed off my ex was just a bonus as this stage but i didn't have many options.\n\nAround this time i met someone through a mutual friend. We hung out a little as a group. Friends on facebook. The normal stuff. I just thought she was nice until we hung out just ourselves a few times. She was amazing, And more surprising she seemed to actually like me, even as damaged as i was. We hung out more and more as just the two of us over the next few months until we officially started dating.\n\nWell i had a little rebound with a time skip, over the next three years i got a promotion at work i had been fighting for years to get. We bought a beautiful house, adopted a rescue dog and a kitten (now a cat), and most amazingly of all we have a baby on the way. Due in less than 6 weeks. Even talking about marriage when things settle down after the baby. I am terrified, excited, worried, but most importantly i am happy and looking forward to the future.\n\nIts amazing at how things can change and how quickly. four years ago i was in what i thought was a good relationship and at a good place in my life until my world crumbled around me. I had nothing when everything was done. Now i own my own house, new vehicle in the driveway. Awesome animals that get to run around the yard and play. And in a few years they may be able to run around the yard playing with my son. All while i have an amazing woman with me. We make each other better than we ever could be alone. We are honest with each other. Sincere. And make sure we talk about things if they are bothering us. I have never been in a relationship with this level of communication before.\n\nIf you are happy, upset, depressed, stressed, or anything else. Just keep in mind its not permanent. If you are happy, do things to stay happy, dont take it for granted. Depressed, seek help, it doesnt have to always be that way. I am happy today and looking forward to the future but i also have to realize there will be bumps along the way.\n\nTL:DR; was content, then very sad, then happy.", "url": "https://www.reddit.com/r/happy/comments/bu1wt0/a_long_road_to_happiness_from_the_ending_of_a/", "title": "A long road to happiness, from the ending of a long term relationship to the beginning of a new life (long)", "social_network": "reddit", "user": "TwistedDragon33", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1559060048, "permalink": "/r/happy/comments/bu1wt0/a_long_road_to_happiness_from_the_ending_of_a/", "nsfw": false, "first_save": 1635441320.094874, "replies_charged": false}