{"id": "t5_2qh5i_t3_9c0otk", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb"], "text": "Just to set the record straight; I’m talking about my male cat. He’s an orange medium/long fur tabby. He is a super sweet momma’s boy, and I’m sure my SO gets jealous lol.\n\nBut seriously, between the two of us we have three cats. Two torties and the tabby. Before getting together, we both had a tortie, both female, and only a year apart. Mine is your typical aloof cat, prefers solidarity, and gravitates to males. Seriously, she’s a poop and trades me in for any guy’s attention. Although I’ll give it to her, she will cuddle me on occasion and knead dough on my side, but usually that’s because she’s wedged herself between us (she typically sleeps on his side or on top of his head/pillow). I like to think of her as the old refined gal even though she’s only 8. My SO’s tortie is the strangest, sweetest, and clueless bow legged adorable thing to ever murp at you. Put her in a room with anyone and she’s golden while the other two hide. She’s a perfect middle daughter; neutral, sweet, loving, and a great balance for a family.\n\nNow my boy...call me biased but he’s so damn cute. He’s the youngest at just 4 years, and still acts like a kitten. He plays fetch and is the most vocal of them all. I love how when I come home from work or school, he greets me and wants to cuddle. Seriously, at a little over 20 pounds this thing crushes my chest and loves pushing his face in mine. Sometimes I find it hard to get up and go do things because he’s so demanding of my attention and I can’t resist a cat!\n\nDon’t get me wrong, I love all my cats. Sometimes it hurts that my older gal, my original if you will, doesn’t love on me the way she loves on my SO. And his baby girl sometimes seems more like everyone’s cat than ours lol. I guess I just have a special bond with our boy... I don’t know reddit. \n\nI’m posting this because our little family has gone through a major change. We recently moved to a big city from my hometown so I can continue on with my education. It’s been one heck of an adjustment for the oldest and the youngest cat (middle girl is always well adjusted lol). Lately they’ve been coming out more and sleeping with us again. \n\nBut what happened today is what prompted this post; I woke up and found him curled up next to my pillow, his head nuzzled up against mine, and it was the sweetest thing to wake up to.\n\nAll in all, they’re all amazing cats with unique qualities, and I love them!", "url": "https://www.reddit.com/r/happy/comments/9c0otk/theres_nothing_better_than_having_a_successful/", "title": "There’s nothing better than having a successful week and coming home to the cutest of lil boys!", "social_network": "reddit", "user": "xxMattyxx317", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1535779737, "permalink": "/r/happy/comments/9c0otk/theres_nothing_better_than_having_a_successful/", "nsfw": false, "first_save": 1635438957.2269294, "replies_charged": false}