{"id": "t5_2qh5i_t3_oa65or", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "*Hi, so How are you? I hope your well <3*\n\n!TW meantion of Su1cide and SH!\n\n*So I recently and other people around me have noticed im so happy. Its strange because from November 2020-march 2021 I was in a depressive cycle and self H1rmed a few times and thought about s1ui1de for a while. Now a month later I feel refreshed for no reason. I haven't done anything different to my life style except from becoming more spiritual and becoming Lacto-ovo vegetarian. I never realized such small changes can really change a person.*\n\n*Learning about farm animals more i made the decision to go Lacto-ovo vegetarian which means, no Meat, poultry or fish, but you can eat dairy products and eggs. This made me feel better for my health like eating habits and overall wellbeing. I do know that lots of people love their meat and fully respect them for that.*\n\n*Becoming spiritual well kind off:*\n\n*I love spiritual things like manifesting and finding a meaning in life really helps me realize I can get through really tough dark times. Im only a newbie and I have a lot to learn but so far after a few months I really find it helps me cope!*\n\n*The moral of this is that if you feel down even in a really dark place then you have something missing in your life. Try something new even if its so small. Small thinks count just as the big things do too!*\n\n*Anyway I really hope you find your inner happiness <3*\n\n*(Feel free to follow me for any random things and coping strategies!)*\n\nAlso sorry if I put it in the wrong category im not really sure as im new here! ", "url": "https://www.reddit.com/r/happy/comments/oa65or/feeling_happier_for_being_a_vegetarian_and_being/", "title": "feeling happier for being a vegetarian and being spiritual?!", "social_network": "reddit", "user": "plomicated", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1624965264, "permalink": "/r/happy/comments/oa65or/feeling_happier_for_being_a_vegetarian_and_being/", "nsfw": false, "first_save": 1635440693.3994176, "replies_charged": false}