{"id": "t5_2qh5i_t3_94smkk", "request": ["e660e09a-842d-44ca-8826-ddfa61319574", "8bed9c95-eda8-4aca-9f64-c1f6ec35f283"], "text": "After my divorce, I was sure I was going to be miserable forever. I'm one of those guys that wasn't really done right in the marriage, yet still somehow lost everything in court. I lost my home. I lost my financial independence and stability. I lost my dignity.\n\nI had to move back in with my parents, who are raising my brothers kids. Bringing my own kid into this environment hasn't been easy. Going from being a fully independent grown-ass man who owned his own home to living in whatever spare space can be found in my parents house was devastating. \n\nI was, in other words, pretty sure I was going to be lonely the rest of my life. I'm more than a little bit of a geek. I'm not like a lot of guys. I was, in honesty, on a fast track to neckbeardy inceldom, but thanks to therapy, I managed to stay a sane and mentally healthy person...other than the loneliness and issues with self esteem.\n\nNot long after my divorce, I was at a friend's house. This woman came in while we were hanging out, an old friend of his. She was kind of crass, kind of loud, and completely adorable. In short, everything you look for in a Country-grown West Virginia girl. I was instantly attracted. I found out after she left she had a boyfriend, so I chalked that up to \"Oh,  well\" and moved on with life. \n\nWe hung out a few times at my friends house, always just coincidentally being there at the same time. We always talked and laughed together when she was there. Then last week she messaged me to ask about places to take her kid to play around here. We chatted, and resolved to get together sometime with the kids.\n\nI spoke with my friend and discovered, to my pleasant surprise, the long-term boyfriend and she were finally over. It had been a messy explosion of a separation, so we had that in common as well. that night I talked to her again when I got home and showed the slightest spark of interest in just *her* (Literally, just the words \"we should get together just us sometime\") and she began to pursue me. I intended to suggest we get together sometime in the next few days, but she wasn't having that. \"What are you doing right now?\" she asked me. She picked me up at my house, on her lunch break, and we just drove around talking.\n\nWe got together again that night for more driving. Things got a little physical. We got together again the next night, she took me out into the woods, and things got way, way more physical. It was like nothing I've ever experienced. A cool breeze, the stars sparkling gorgeously overhead, her naked body in the moonlight. I found myself laying on a blanket at two in the morning thinking, Is this really my life?! We've gotten together a few times and it's always just so easy to talk to her. We laugh and smile and flirt. And after the kids are safely in bed and looked over, we go off in the woods again to have some more adult fun together.\n\nSo last night we spent four hours together and it was the best time of my life. I had gotten us a motel room instead of running out to the forest this time, and it was so nice to be able to be comfortable with each other. To lay there and snuggle up while we talked. To see that sparkle in her eyes that she digs me. We're not madly in love, this isn't the start of some epic romance...but she digs me. She likes me. She sees worth in me, and enjoys spending time with me. I haven't felt that in SO many years.\n\nI have never been pursued like this by a woman before. It's done so much to make me feel better about myself. There were so many little moments, little words said here and there, that just gave me a warm feeling inside. \nShe's pretty fresh from her relationship and isn't looking for anything more than exactly what we have, and I couldn't be happier to provide it. After the amazing time together we had last night, I realized this morning I could never see her again and consider myself lucky and content. She's reminded me of my worth. She's shown me that things aren't hopeless for me, that there are women out there who will find me attractive, will find me someone to have around. I never thought I'd feel this way again.", "url": "https://www.reddit.com/r/happy/comments/94smkk/a_few_months_ago_i_was_miserable_with_no_self/", "title": "A few months ago I was miserable with no self esteem. Today, thanks to a new friend, I know that I am smart, funny, sexy, and charming.", "social_network": "reddit", "user": "Wanderer0412", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 10, "down_vote": 0, "creation": 1533482843, "permalink": "/r/happy/comments/94smkk/a_few_months_ago_i_was_miserable_with_no_self/", "nsfw": false, "first_save": 1635439376.645203, "replies_charged": false}