{"id": "t5_2qh5i_t3_177rni", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb"], "text": "Long story, so stick with me, but it's kind of a bittersweet tale, but it was still a fantastic trip with a happy ending.\n\nMy girlfriend had never been out west, let alone snowboarding. So for Christmas I said I was going to take her out, and with style. First class flight tickets, a hotel right at the lifts, equipment, food, even lessons were on me. I went all out, even joined her in the first time classes so we could spend the time together. Conditions were great. We came in after a cold front had hit, and there was not a cloud in the sky. No fresh powder to carve up, but hey, life's not perfect. We spent a day and a half getting her up on her feet and used to the board, as well as the basics of riding the lifts and how to balance yourself.\n\nThen the worst happened. While starting to learn how to turn (in snowboarding you move your hips and knees to turn on your heels and toes) she suddenly \"caught an edge\" on her heel side. This means while facing uphill, she didn't put enough pressure on the balls of her feet to lift the heel side edge of the board, so it got caught in the snow. Physics took over and she fell backwards, and as one naturally does to stop from falling she put her hands out and landed hard. \n\nAs soon as I saw her double over holding her wrist I knew; I had it happen to me years before and I recognized the look of pain in her face. The instructor asks if she wants ski patrol and she refuses, and walks down the hill to where the rest of the class and I waited. We went to the gondola and back to the base of the mountain with instructions on how to get to the closest clinic/emergency room.\n\nOur spirits were already dampened, and only grew more sour at the emergency room when we were told the price for her being uninsured (upwards of $1500). We went to a nearby Urgent Care, which was a little cheaper, but she still wound up in a cast with strict instructions to rest and stay off the slopes.\n\nI was devastated, partly from guilt that I had brought her out there and partly from the fact that she wouldn't get to enjoy our last two days out there. Despite this she continued to say how this was the best trip of her life and, along with the urging of other friends and family, convinced me to go out the next day to board alone.\n\nOur biggest fear was that this injury would require surgery. She's already had a couple in the past (one for her knee and another in her finger), and from what the urgent care doctor said it looked like a bone may have shifted. We were not looking forward to a uninsured surgery followed by possibly months of rehab.\n\nSo today she went to see a specialist (the same one who did her finger surgery), and got wonderful news; no surgery, and she only needs the cast for a month. A MONTH! When I hurt my wrist I was in it for double that.\n\nNeedless to say we are both thrilled, and despite the injury she maintains it was a magnificent trip, and still wants to snowboard again. Depending on her recovery we might even be able to make another trip this season, although we'll be going east instead of west where to mountains are a little less steep and a little more kind (I hope!)\n\nThanks for reading.", "url": "https://www.reddit.com/r/happy/comments/177rni/girlfriend_broke_her_wrist_snowboarding_last/", "title": "Girlfriend broke her wrist snowboarding last weekend, doesn't need surgery!", "social_network": "reddit", "user": "sumguythere", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 3, "down_vote": 0, "creation": 1359065097, "permalink": "/r/happy/comments/177rni/girlfriend_broke_her_wrist_snowboarding_last/", "nsfw": false, "first_save": 1635438964.889031, "replies_charged": false}