{"id": "t5_2qh5i_t3_j3wzrg", "request": ["77a5a12a-14c1-468d-b6d8-4b6928ce40ae"], "text": "I previously ordered this: [https://meh.com/deals/6-pack-all-mixed-up-magic-grass-anklet-socks-3](https://meh.com/deals/6-pack-all-mixed-up-magic-grass-anklet-socks-3) I think they were like 5 bucks...\n\nThe order started shipping.. and got stuck a little over a week ago... so I wrote an email to their support... it goes a little something like this...\n\n>It looks like my package took a detour through a black hole on its way to me. I suppose if I used enough Magic Grass I could theoretically fly high enough to find it, however I don't believe I have enough of said grass. I'd appreciate it if the person in charge of intergalactic shipping could get back to me at their earliest convenience.Sincerely,Missing my Magic Grass.\n\nI was hoping for a couple of laughs from their support guys and a snarky remark... instead I got this in return....\n\n>Kevin (Mercatalyst)  \n>  \n>Oct 2, 2020, 10:32 AM CDT  \n>  \n>Good day,  \n>  \n>As a space travel agent myself, I can assure you that moving items through time and space is not an exact science. We just kinda throw things into the black hole and hope it pops out where it was meant to be.. The timing of which is also not scientific...more of a guessing game really. That would be why we threw you a guess of Monday, September 28th - Tuesday, October 13th on your initial delivery date estimate. I know that time is relative and you're probably feeling like it's been \"forever\" but I assure you, we're not ready to give up on those dates just yet. For all we know, they just stopped tracking the package after it made the time/space jump and it'll be outside your door later today. Believe me when I say, we've seen it all.  \n>  \n>My suggestion is this. Take up a new hobby to pass the time while we get this delivery across the finish line. Consider: Conquering and enslaving the alien race of a planet in a binary solar system. Building a time machine (these are great for passing time). Learn to ride a bicycle. Ok, that last one is a joke. I mean, it only has two wheel so how would you keep it from falling over?Do me a favor. Keep your eyes off the clock and I'm sure it'll be there in no time at all. Or at least in a few weeks time. If you're not covered in magic grass by October 13th, reach back through the internet tubes and rattle the electrons in my inbox. I'll get you hooked up.\n\nThis may be the best response I've ever received from a company.", "url": "https://www.reddit.com/r/happy/comments/j3wzrg/when_a_company_does_customer_support_right_it/", "title": "When a company does customer support right it puts a smile on my face!", "social_network": "reddit", "user": "IgnitedGeek", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1601653775, "permalink": "/r/happy/comments/j3wzrg/when_a_company_does_customer_support_right_it/", "nsfw": false, "first_save": 1635440760.0557442, "replies_charged": false}