{"id": "t5_2qh5i_t3_1de8ll", "request": ["af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": " Lately, my best friend and I have been hanging out more often and going on more formal dates. It started this past Thursday when her, a mutual friend and I ditched class. We took a sudden trip to Oatman, AZ and while there we both got closer with each other and started holding hands. Something we haven't done since Halloween 2011. \n\n After coming back to town and dropping off the mutual friend, we headed to my house because I had to get ready for work. After I got ready, we left my house so I can drop her off home and I go to work. When we got to her house we did our usual hug goodbye but when we went near each other I kissed her on the cheek. We then looked at each other and kissed on the lips and that was that.\n\nSunday, she went to her friend's house for a birthday party. At about 5 I went and picked her up to take her to the movies. \n\n On the way to the movies, I grabbed her hand and had asked where we were in the relationship, and she said she's still feeling bad about how her last relationship ended (it ended badly) and how she wants to take it slow because she doesn't want to ruin how things are right now. (So still semi-friendzoned) After the movies we had to find something else to do, I suggested dinner at Chili's. At Chili's I discovered how bad I am at holding a conversation with someone if there isn't something that is going on as well. With dinner at Chili's over as we were walking back to the car, I had my arm around her and pulled her toward me, we looked at each other and kissed again. After a few seconds, we stopped and kept walking toward the car, I open her door we lean against the car and kiss again. After we get in car and head back to her place so I can drop her off. On the way there we hold hands while I'm driving and make small chat, and tease each other a little bit. As we arrive to her house we give a kiss good night, she gets off and goes inside her house, then I head back home.\n\nToday, we both had school and it was a standard day. After school she came over to my house and we spent the afternoon together, watched a few episodes of The Big Bang Theory and kissed a lot. During one of the times we did she said \"You really like kissing me, don't you?\" To which I unintentionally whisper back, \"Yeah.\" \n\nEven though this has only been a few days, I've already noticed a change in how I see myself, I don't have as much self-confidence issues anymore and I have a better self-esteem. I've even found that I'm genuinely happier because of it. I have a better, more optimistic view of things now.\n\nSorry for the, probably confusing, wall of text , but for once in a long time, I can truthfully say I'm happy.", "url": "https://www.reddit.com/r/happy/comments/1de8ll/im_semiout_of_the_friendzone_close_enough_but/", "title": "I'm semi-out of the friendzone! :) Close enough but still changed me.", "social_network": "reddit", "user": "alexg69", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1367300932, "permalink": "/r/happy/comments/1de8ll/im_semiout_of_the_friendzone_close_enough_but/", "nsfw": false, "first_save": 1635441994.64054, "replies_charged": false}