{"id": "t5_2qh5i_t3_2aanv3", "request": ["77a5a12a-14c1-468d-b6d8-4b6928ce40ae"], "text": "So today I was stressed out knowing that my account is overdrawn, I have bills past due, and I had .85 to put in my gas tank didn't think I was going to make it to work. I was unable to get a hold of my mom and managed to get my grandma to answer, but since I lost my drivers license and she lives almost two hours away, there wasn't much she could do to help me. I eventually broke down and embarrassingly asked my friend if I could borrow some gas money and she enthusiastically said yes. Luckily, mom finally got a hold of me right before work was over and she let me know that she was going to drive over to my work (about 30 minutes away and in horrible traffic) to help me out and bring me some money. After all was said and done and having a half tank of gas, I called my friend to tell her how thankful I was, but I didn't have to take her up on the favor. She let me know that if I needed anything at all, just let her know. A few hours later, I was working out and heard a knock on my door and it happened to be my friend. She and her boyfriend brought over snacks and food, and even a Starbucks gift card to get me through until payday!!! I can't even begin to explain how thankful and grateful I am to have such loving and caring people in my life. It's embarrassing for me to have to ask for help, but it's such a comforting feeling to know when I'm stressed and in need of help, I have amazing people to help me out. I've already thanked them, but I just needed to brag on these lovely folks! Thanks for letting me get this out, and I hope y'all are having a great evening also!", "url": "https://www.reddit.com/r/happy/comments/2aanv3/i_am_grateful_for_the_amazing_people_in_my_life/", "title": "I am grateful for the amazing people in my life!", "social_network": "reddit", "user": "throwameowmeow", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 14, "down_vote": 0, "creation": 1404957786, "permalink": "/r/happy/comments/2aanv3/i_am_grateful_for_the_amazing_people_in_my_life/", "nsfw": false, "first_save": 1635440773.476548, "replies_charged": false}