{"id": "t5_2qh5i_t3_1t0r6f", "request": ["e660e09a-842d-44ca-8826-ddfa61319574"], "text": "I could make this a super long story but I'll try and keep it semi-long. ;)\n\nI didn't grow up in a healthy/happy home and moved out when I was 17. Home life sucked, harassed on a daily basis in school for being a dweeb etc.\nThen I met a guy when I was turning 19 and we spent almost 11 years together. He was, back then, a way out of sorts as he lived in another city.\nHowever we were anything but right for each other, he constantly put me down, talked shit about my family and friends and made me crawl into a shell and almost end all contact with the outside world. The only regret I have is that it took me so long to end it. \n\nEnter happy mode.\n\nAt my old job a new guy started working there. Sure I found him attractive but he annoyed me a little because he was so damn confident. Also because he instantly hung out with the worst girl at work, because she more or less tried to put her claws into him.\nSee she's dumb as hell but has a kickass body - ergo she's popular.\nAnywho.\nOne day after work us colleagues went out to say goodbye to a girl that was leaving and I actually got to talk to him properly for the first time. Turns out he was really nice.\nHe was a trekkie, like me, love his family and we ended up talking the entire evening. Didn't think much of it at the time as I was still in a relationship.\nWe now started mailing funny, sillly stuff to each other at work, even though we sat across each other, only to make the other laugh.\nStill, I didn't think of it - he's just a very charming and friendly guy.\n\nFast forward a few weeks, all colleagues are out partying, he's dancing with every girl and I was laughing my ass off as he's sort of a showoff.\nBy the end of the night me and him, the only two not being wasted, helped three other female colleagues get home, then he walked me to my bus.\nIt started to drizzle and he asked me stop - in which he straight out said he was interested in me. Stupid, naive me was actually surprised, I've always gotten along better with guys so I thought nothing of it.\nHe knew I was in a (bad) relationship (as other colleagues I'd confided in had gossiped) and flat out asked me if I wanted to stay in that relationship or not.\nIn that moment I just knew I wanted out.\n\nAfter that began a turmoil of breaking up with my bf, him taking all of our stuff, me flat out broke and forced to move to a apartment the size of a closet and no furniture. Basically it was a shitty time in my life.\nBut time heals all wounds.\n\nNow it's 18 months after this guy first showed his interest in me and by now we are a proper couple. I still live in my tiny apartment but it has furniture and is really cosy now - also we're now planning to move in together.\nHe has,every single day, made my life a life worth living. I've almost forgot just how bad I used to feel, how much hate and discomfort I was surrounded by.\nHe makes me wake up smiling, he makes me laugh, he simply makes me happy - truly happy!\nOur families and friends are all chuckling at how well they think we go together and how happy they are, for both of us (he came from some bad, shorter, relationships himself).\n\nSo to get back to my title; I'm turning 31 in two weeks (he's 29) and I feel like a lovestruck teen.\nI'm grateful for every day I get with him and for the first time in my life, I'm planning to do what I never thought I would - to start a family, to get married, to grow old  together. For the first time I want all of that.\nHe helped me find my smile again and I am so happy.\n\nTL;DR: Long life of shittiness, new colleague turned out to be the key to happiness. \n\n[Us on an early Saturday morning](https://scontent-a-ams.xx.fbcdn.net/hphotos-frc3/1382313_10152209793688943_142934253_n.jpg)", "url": "https://www.reddit.com/r/happy/comments/1t0r6f/soon_to_be_31f_and_feeling_like_a_teenager/", "title": "Soon to be 31(F) and feeling like a teenager", "social_network": "reddit", "user": "geekbydefault", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 14, "down_vote": 0, "creation": 1387216496, "permalink": "/r/happy/comments/1t0r6f/soon_to_be_31f_and_feeling_like_a_teenager/", "nsfw": false, "first_save": 1635439408.4922068, "replies_charged": false}