{"id": "t5_2qh5i_t3_5wdbum", "request": ["77a5a12a-14c1-468d-b6d8-4b6928ce40ae"], "text": "So, this time last year, I was engaged to be married. I ended up finding out shortly before my birthday that she'd been cheating with a man her father's age, and the engagement was broken off. I took it really hard, spending many a night trashed alone in our apartment (we still lived together for several months afterward). I ended up taking a twelve-week leave of absence from my job to deal with the mental and emotional fallout of it all. I started seeing a therapist, taking antidepressants...things got pretty dark there for a few months.\n\nMy closest friends pieced me back together, and I was able to move out and back to my hometown (shoutout to r/Austin!) to get back to baseline. I tried forcing myself to date, but my heart wasn't in it. A lot of the people I dated were really cool, but I couldn't stand to be touched, couldn't imagine kissing anyone new when I had previously committed to someone for life. I felt like I was cheating - yeah, let's all laugh together. I eventually ended up writing off relationships entirely, and for several months I was extremely depressed. Couldn't sleep. Switched to a liquid diet because I couldn't eat. Then, out of absolutely nowhere, I met R. She makes me happy that all of the awful events of the past year happened to me, because if they hadn't, I wouldn't be here with her. She is showing me what a relationship is capable of being, what it's supposed to be like. \n\nApparently, living in constant fear and suspicion that you're being two-timed is abnormal. And apparently, it's not an expected part of a relationship that you should find a way to deal with the self-loathing associated with your s/o constantly telling you that she's out of your league. You're supposed to have feelings and not be ashamed to feel or talk about them. Imagine that, right?\n\nWhere the ex would tell me things I dreamed of doing were ridiculous, R encourages me to chase my ambitions. I have a pretty great job, but I'm formally educated in a totally different field. I told my ex I'd like to go back to college and get a second degree in my actual industry, and she told me it would be a waste of my time because it wouldn't earn me any more money. R told me that I should go for it if I thought it'd make me happier.\n\nR is open with her feelings. She communicates them willingly and encourages me to communicate mine. She doesn't make me feel like she's doing me a favor or humoring me when she asks me how my day was. She makes it a point to ask me to just tell her what I'm thinking every once in awhile.\n\nShe's a straight-shooter. She's tactful without sugar-coating and honest without compromising gentleness. I don't feel like I'm walking on eggshells anymore. I don't feel like the one I pour so much of myself into is merely tolerating me. I trust that if she was ever unhappy, dissatisfied, or otherwise upset with me, she would tell me rather than distancing herself (or, you know, running off with some creepy old dude behind my back). \n\nWe haven't had a big fight yet. And yeah, I know we'll have one. But I know that when we do, neither of us are giving up on this. Neither of us is going to walk out. We're going to talk about it like adults. I truly trust her. It's kinda funny to say, considering she's like 5'1\", but she makes me feel safe.\n\nI feel like the effort I put forth is being mirrored, even exceeded at times. I've never felt like anybody was truly as happy to be with me as I was to be with them. She tells me she feels lucky to have found me, that she feels pretty because she knows I like her. And I just have to laugh about it. \n\nA year ago, I was hollow. A year ago, I stared out off of the balcony of my 5th floor apartment, stoned as shit, debating whether falling five stories would definitively be enough to kill me, or if it was too risky because I might just survive as a vegetable or something. A year ago, I had a breakdown in a gun store because I knew I wasn't going to be able to handle the three-day waiting period required to purchase a handgun in Oregon.\n\nToday, I have a great job that I'm getting better at everyday, back home in Austin, closer relationships with my family and friends after they gave me so much support through my dark days, and an amazing woman I get to share it all with. I have so many reasons to be alive and grateful. I have all of those without her, but she works everyday to help me appreciate my life for what it is, to improve it in any way she can. She's such a strong positive force in my life.\n\nIt feels weird, in hindsight, to think that I ever even came close to marrying anyone else.\n\n\n**TL;DR** Last year, my now ex-fiancee did me the biggest favor anyone ever has by cheating on me with some creepy old guy and breaking off our engagement. Her actions led me down a dark path that ended with me being happier than I've ever been, with an amazing woman that I couldn't possibly be thankful enough to have found.", "url": "https://www.reddit.com/r/happy/comments/5wdbum/i_make_me_happy_but_i_found_finally_the_one_who/", "title": "I make me happy, but I found finally the One who makes me happier.", "social_network": "reddit", "user": "kachompkachomp", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1488153019, "permalink": "/r/happy/comments/5wdbum/i_make_me_happy_but_i_found_finally_the_one_who/", "nsfw": false, "first_save": 1635440772.5606942, "replies_charged": false}