{"id": "t5_2qh5i_t3_mey6fh", "request": ["b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11", "d9021d56-8bfa-490f-87b8-52154c0b1b05"], "text": "Wow. We got this far. From being a dumb little kids chatting online about stupid drama to teenagers talking about life and reality drama. There is one reality I hate to have to accept. That is that I'm in love with you. You have a girlfriend, and I'm fine with that. I want you to be happy, I would never attempt to sabatoge your relationship. Hell, I would hate that. There's a higher chance of me getting hit by a train than doing that.. But however, I can't deny these hidden feelings inside of me that I depise. I grow so happy whenever I see a message from you, my cheeks turn red and my heart bursts with joy whenever we converse. \n\nYou're one of the only people that can make me happy just by sending me a message. That's why I so frequently message you.. Of course, I'd never tell you this to your face, nope. It's pretty rare for me to hold on a crush for this long, but I can say that I am certain that I've fallen in love. Ugh, it's both a blissful feeling and a terrible one. Hopefully you'll never see this, you probably never will. \n\nThis is a dumb little teenager crush, but I can't deny how hard I've fallen. It's embarrassing to write even though you'll never find this. I feel as if the cupid has struck me with 3 arrows instead of one (both like hellfire on your back but bliss). I know you think this little crush is adorable but I think it's also living hell. A part of my mind does want to be with you, romantically. But I do understand that will probably never become a reality, and I'm also fine with that. I don't even know what I'm saying at this point, I'm just saying that you, quite literally, drive me nuts but I'm also a rational person myself (credit to mom).\n\nAnd I will say this, as much as I paint myself as the respectful non-jealous crush person, I will say. I do get jealous pretty frequently. As much as I will deny it, I am a very jealous and envious person. So, you could put the puzzle pieces together with that. \n\nHugh, I don't have a lot more to say, other than. Yes, I've fallen in love with you. I know I act all embarrassed and shy whenever you bring up the crush, but now that you probably won't find this, I'm much more open now. Yes, I've fallen in love. Deep. Yes, I blush every-time you speak to me. Yes, I do think about you pretty frequently. Have I had this crush ever since the beginning of 2019? Yes. Yes, I do get insanely jealous. Will I admit it? No. \n\nI love you..both romantically and platonically :) \n\nFROM, \n\nsomeone who saw a tiktok and got inspired and is probably going to regret this.", "url": "https://www.reddit.com/r/happy/comments/mey6fh/a_love_letter_for_the_person_who_makes_my_life/", "title": "A Love Letter for the Person Who Makes My Life Great; Kind of Happy", "social_network": "reddit", "user": "aylinchoreddit", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1616923664, "permalink": "/r/happy/comments/mey6fh/a_love_letter_for_the_person_who_makes_my_life/", "nsfw": false, "first_save": 1635439189.2507677, "replies_charged": false}