{"id": "t5_2qh5i_t3_apnml8", "request": ["a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "I know that sounds a little odd but it absolutely made my day what happened.\n\nSo today in my city there was a decent amount of snow (3 in or so).  Got home from work, made my girlfriend dinner and then relaxed for a bit.  Then the door bell rang.  I answered and two boys were standing outside in the snow and said \"can we shovel your driveway?\"  In shock I just said \"for anything?\"  They said \"we don't want anything.\" So I pulled out my wallet and gave them the $7 I had and told them they could have it.  The older boy said thanks and proceeded to give his little brother $5 while he kept $2.  \n\nI was so surprised by that.  What a great kid, looking out for his little brother like that.  I scrambled to find some more cash to give them while they were shoveling.  I found $7 in quarters and decided that would at least make it fair (they'd each get $7, some in quarters).  So I opened the door and said \"you're doing a great job guys!  I found another $7 for you!  It's in quarters but you can have it!\" The little boy said \"are you sure?  I don't want to take more than you're comfortable with.\"\n\nI told the boys they shouldn't worry and it was my pleasure to give them that $14.  I'm just so sad I didn't have more cash to give them.  I went back inside and before they left the smaller kid knocked on the door.  I answered and he said \"we're done!  Are you sure you want to give us the money?\" I told him absolutely and that they shouldn't worry about it at all.\n\nMan, I hope my kids are that sweet someday.  The parents are doing something right and I'm so happy to be in a neighborhood like this!", "url": "https://www.reddit.com/r/happy/comments/apnml8/two_young_boys_shoveled_my_driveway_today/", "title": "Two young boys shoveled my driveway today", "social_network": "reddit", "user": "knodel12", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 14, "down_vote": 0, "creation": 1549934454, "permalink": "/r/happy/comments/apnml8/two_young_boys_shoveled_my_driveway_today/", "nsfw": false, "first_save": 1635442236.3204777, "replies_charged": false}