{"id": "t5_2qh5i_t3_newlni", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a", "4311bf71-6ec2-4c3b-aa15-1f9a3223e07b", "5b81e8b4-a0f8-4747-8a7a-0e37aae01c43"], "text": "I made some posts yesterday just kind of laying it out there that my dad had originally left me and my mom when I was 3 but has since come back into my life as of last year. I noted how strongly my mom still strongly dislikes him, no surprise there, but also how he's at least trying with me and has been active in my life thus far. I usually try to spend the weekends with him when I can and it's been pretty good. He's not trying to overcompensate or anything like that and be a superhero. He's just doing whatever a decent dad does or would do I guess.\n\nWell, the first day I actually met him and he came to our place, in October 2020, it went okay. I look a lot like him. He talked for a while and explained himself and why he'd been gone and all that. Didn't try to lie to me though and answered any and all questions I had. He even went so far as to say how he wasn't leaving again and was going to be there for me now. He stuck around for a few hours and before he left, after my mom mostly yelled at him, he gave me one last hug and said \"I love you baby\". But all I said was \"I know\", he gave me a mixture of confused but also understanding and then left. I mean, what else was I gonna say? I didn't even know him and I wasn't sure that that would be our last meeting. I could wake up the next day and he might never come back.\n\nAs the months went on, I guess you could say we grew closer. He texted me at least once a day just to tell me good morning or ask how my day was going while I was at school. We'd talk on the phone at least once a week and I started staying with him on weekends by November. He also did come to my birthday party in November and I spent half of Christmas Day and New Years Day with him, so that was cool. I still hadn't said I loved him yet. But I would soon.\n\nBack in February, he took me to one of my favorite places I hadn't been to since I was a kid: the Museum of Science and Industry in Chicago. I love anything to do with STEM and we spent the whole day there. It was at half operation because of COVID restrictions but I still had a blast. He mostly just let me run around and see whatever and I was constantly pulling his hand to show him something. And all the while he was just calm, casual and just going with the flow. Not overbearing but right by my side the whole time. We even had our picture taken together, our first in over a decade obviously.\n\nWhen we left, I thanked him for taking me and told him how much it meant to me. I told him my dream was to be a science teacher and he said \"I know. You told me. You want to teach K-8 kids\". The fact that he remembered some small detail like that made it all the more special for me and we had smiles almost the whole way home, even holding each other's hand.\n\nWhen we finally got to my mom's place, he wrapped me up in his arms and hugged me, I thanked him again, he said \"You're welcome baby. I love you\", \"I love you too dad\". He sounded like he breathed a sigh of relief and he hugged me just a bit tighter. He smiled at me, we said goodbye, he kissed me on my head and that was that. The first time I ever told my dad I love him :).", "url": "https://www.reddit.com/r/happy/comments/newlni/the_day_i_told_my_estranged_dad_i_love_him_for/", "title": "The day I told my estranged dad I love him for the first time", "social_network": "reddit", "user": "lavish_bonus", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 16, "down_vote": 0, "creation": 1621298339, "permalink": "/r/happy/comments/newlni/the_day_i_told_my_estranged_dad_i_love_him_for/", "nsfw": false, "first_save": 1635439305.8939688, "replies_charged": false}