{"id": "t5_2qh5i_t3_4ytppf", "request": ["ea4a7795-7887-476a-9ab2-4c77d117a852"], "text": "In 2001 I lived in California and my then roommate broke my favorite wine glass. Let's call it \"THE glass\". He accidentally dropped it in the kitchen sink and it was completely shattered. I stood next to him when it happened and he apologized and said that he is very sorry. But he must have noticed the sadness in my eyes. I tried to shake it off quickly because I know that one should not cling to material things as they are all transient. But THE glass was very special to me and that's what he must have seen in my eyes.\n\nMy friend offered to buy me a new glass but I said that it had personal value and there is no way that it can be replaced. He asked me what's the story behind it and I said that I honestly think he doesn’t want to hear it as it might make him feel even more sorry. He insisted to tell him the story, so I did.\n\nMy girlfriend at the time was living in Germany and we were in a long distance relationship. We met while I was in Germany to visit my family and we were together for about a year at the time. Whenever I was in Germany I stayed at her place and when drinking wine I always used this vintage crystal wine glass of hers which I liked a lot. I think it was from her grandparents from before the war. I got really fond of this glass and my girlfriend must have noticed.\n\nSo when I was back in California about 4 weeks later a packet arrived and when I opened it, it's filled to brimming with rose petals. Digging through them I find a letter with instructions, a few other items and THE glass. I know that THE glass meant a lot to her too and it deeply touched my heart that she had sent it all across the ocean for me to have it. So I follow the instructions: Spread the rose leaves on the bathroom floor, fill the bath tub, put the apricot fragrance bath ball in the tub, but the CD on that she had sent and pour a glass of whine. It was one of the best moments of my life.\n\nMy friend looks at me in shock just realizing what he did and I could see in his expression that he wished that the earth would open up and swallow him. He wanted to hug me but I said that's not the end of the story. It's getting worse, and I really think that he does not want to hear the rest of the story. But he insisted again so I told him that this was not the glass he just broke.\n\nUnfortunately I had broken the glass myself a couple of weeks after my girlfriend had sent it to me. I was heartbroken then and couldn't tell my girlfriend for almost a week because I knew how much she had loved THE glass. I finally managed to tell her and of course she was devastated but tried not to show it too much.\n\nFast forward about 2 months: I'm back in Germany and my girlfriend and me are visiting my grandparents who live about an hour away from her place. It's the first time they meet and they like each other a lot to my very delight. When my grandparents leave the room to get coffee and cake from the kitchen my girlfriend very excitedly points to the display cabinet in my parents living room and there it is: THE glass. The exact same glass.\n\nMy grand mom is the first to come back to the living room, sees us standing in front of the cabinet in awe and asks us what's the matter. My girlfriend just points at the wine glass without saying anything. My grand mom says \"Oh yes, that's grandpas favorite wine glass. He had it for decades and he drinks wine only from this glass\".\n\nI don't know exactly how but a little while later when we all sit on the table drinking coffee and eating cake the conversation came back to the wine glass and my girlfriend told the story about sending me THE glass to America and me braking it. There was a short period of silence and then my grandpa said. \"You know, I want you to have my wine glass. It makes me happy that it will belong to someone who can appreciate it as much as I do. And I don't know how much time I have left. And it's better to give with warm hands than with cold\". I immediately said that I feel very honored but that I know how much the glass means to him. But he insisted and I think I would have hurt his feelings if I would have declined. So I took the glass back to California and this is THE glass my friend just broke before I had told him the story. \n\nMy friend looked at me devastated and I think I actually noticed tears building up in hes eyes. I told him that he should have believed me when I said that he doesn't want to her the story. Now we hugged and I told him that I'm fine and that it's not his fault. I should not have left the glass in the kitchen if it means so much to me and these kind of things just happen. \n\nLike I said this was in 2001 and I was looking for THE glass in every drift shop I came across. But both THE glasses were very old probably from prewar and this kind of style apparently is very hard to find. They were crystal glasses and quite heavy. I found countless glasses which had the right bottom (a diamond shaped stem) but not the very plain top without any carvings or such. The ones I found which had the right top didn't have the right stem.\n\nBut for 15 years I never gave up believing that I will find THE glass again. And last week I finally found it. It's the exact same glass, heavy crystal glass, diamond shaped stem, plain top. I'm so happy right now but also a little sad because I have no one to share my happiness with. My grandparents both passed away years ago. My back then girlfriend and I broke up in 2005. I separated from my wife about a year ago and her and her two kids do not want to have to do anything with me. I think my guy friends do not really care about me finding an old wine glass. Although there are other things I can share with them and I'm grateful for that.\n\nBecause I want to share my happiness about me finding THE glass so badly, I opened a reddit account just for that. Have been reading on reddit for a bout a year now but never posted anything.\n\nHope this can inspire some of you guys not to give up if you had lost something you cared about. Eventually it will come back to you when you keep believing in it.\n\nBless you all.", "url": "https://www.reddit.com/r/happy/comments/4ytppf/looks_like_things_do_come_back_sometimes/", "title": "Looks like things do come back sometimes ...", "social_network": "reddit", "user": "flominios", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 78, "down_vote": 0, "creation": 1471764592, "permalink": "/r/happy/comments/4ytppf/looks_like_things_do_come_back_sometimes/", "nsfw": false, "first_save": 1635440222.3524826, "replies_charged": false}