{"id": "t5_2qh5i_t3_hh16as", "request": ["77a5a12a-14c1-468d-b6d8-4b6928ce40ae"], "text": "Just wanted to share\n\nSo, I met Devon prior, but we never really spoke until early January. It was her birthday and we were both stuck at work with not much to do. We spent the day playing a silly card game, throwing pens at each other, and just generally getting to know each other. \n\nShe mentioned not really having any plans for her birthday and invited me out for drinks. I knew we had an instant connection and I wanted so badly to say yes, but I was recently out of a marriage and just wasn't ready to get into anything new. So I said no to her. Three. Times.\n\nA week or two passes and I'm at work again. I get a phone call asking for help with a program that I'm in charge of and I need to go to our other location. I show up and low and behold it was her that needed my help. Now, this location usually doesn't have any people in it, so after we finish with what we were working on, we decide to skate for a bit and just hang out. The connection we had was natural, unforced, and completely undeniable after that day.\n\nAnother week passes though.\n\nI'm sitting on my couch in my underwear, drinking a few beers when I decide to scroll some facebook. I notice I had a pending chat request from 4 days prior from Devon. I reply to her, apologize profusely for informing her message. Then she puts herself out there again and asks to meet up.\n\nY'all, I turned this woman down THREE TIMES on her birthday. Never reached out to her. Ignored her message for four days. And she still just wanted to get to know me.\n\nI, of course, said yes this time.\n\nA few weeks after that, everything was still going great, and she was looking for a new place to stay. In a move we both knew was crazy, we moved in together after barely a month together.\n\nTen months later, we took a trip to see her family and were planning to go to Disney. I also planned on asking her to marry me. We had talked about marriage and she even picked out a few rings. I made it three thousand miles with the ring with no issues at all.\n\nWe had a nightmare trying to get a rental car. We landed at 2am and even though we had a reservation, there were no cars available. So we Uber to her dad's house and get a car in the morning. We load up in the rental and start driving to Disney. A half hour into the drive, I'm filled with anxiety and realize my dumb ass forgot the ring at her dad's. We went back and got it, and drove to our hotel near Disney. Our plan was to carpool with her grandmother to save a bit of money, so that night, we drop off the car at an unmanned return center with a drop box for the keys.\n\nI swear to you, the minute I heard the keys hit the bottom of the box, I knew I had fucked up. The ring was still in the car. After an hour of terrible customer service from the rental company, we finally get a locksmith to come open the car for us. While we wait on the locksmith, she jokingly says \"you should probably just give me the ring, that way you can't lose it again.\" Well, the locksmith arrives and opens the car. In a move that would make the director of Oceans Eleven jealous, I pickpocket her phone and open the camera app and pass it off to the locksmith. I told him I needed a favor when I gave him the phone. I drop to one knee and ask the love of my life to marry me. Not gonna lie, I thought she might say no, just as payback for me turning her down on her birthday. My heart fills with joy as she says yes, genuinely surprised that I actually followed through with her joke. I'm sitting there basking in the moment when I hear \"oh shit! I didn't get it! I wasn't ready!\" In my move that was I was so proud of, I forgot to hit record on the phone.\n\nSooooo, we do a retake, this time smiling and laughing during the proposal, all while the car alarm is going off behind us.\n\nThat's the story of how I met and proposed to my beautiful, amazing wife. Our wedding was just as perfectly imperfect as the rest of the story (officiant said the wrong names, round two of me forgetting the ring, and all after COVID changed our plans multiple times) but I'm running out of time to type it all out.\n\nI couldn't possibly be happier to have such an wonderful partner and I thought in a time where all seems bleak in the world, y'all could benefit from a smile or two.", "url": "https://www.reddit.com/r/happy/comments/hh16as/just_wanted_to_share_my_perfectly_imperfect/", "title": "Just wanted to share my perfectly imperfect proposal", "social_network": "reddit", "user": "Dephyle", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 1, "down_vote": 0, "creation": 1593290809, "permalink": "/r/happy/comments/hh16as/just_wanted_to_share_my_perfectly_imperfect/", "nsfw": false, "first_save": 1635440762.126909, "replies_charged": false}