{"id": "t5_2qh5i_t3_52cvm1", "request": ["13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "He also made a lovely wooden dildo out of cherry wood. Needless to say, I'm extremely fond of this. \n\nHe is making me a necklace of silver chain, that he is forging himself, with a leaf (taken from the tree where he carved our initials) preserved in epoxy. \n\nHe takes me on motorcycle rides,  laughs his head off when I manage to get mud to go flying all the way into the back seat of the jeep while off reading, believes in my ability to succeed, and loves making me happy. \n\nI fit perfectly in his arms. I'm short and soft, he's big and strong. He can press up against my back in the shower, drape himself over me, and have his arms wrap entirely around me. \n\nWe share the same kinks, the same music tastes, the same everything. We're soul mates. And, even if we aren't and this crashes and burns, I will have no regrets from this. \n\nWe've only been in each other's lives five short months, and dating for only one come September 15th, but I couldn't be happier. \n\nWe have a lot of growing up to do, a lot of challenges to face. The thirteen year age difference (19/F and 32/M). The next eight months of distance, due to my schooling. Our baggage, as neither of us got through this world unscathed.\n\nBut, I know the dream. \n\nWe will have a small house, on the outskirts of a small town. I will sell erotica, romance, and whatever other works I can churn out. He will sell sex toys, jewellery, wood carvings, and whatever else he can make.  Whenever we aren't creating, we may even tackle my dream of owning a used bookstore. We'll have dogs, cats,  rats, and maybe a goat. Be as self sufficient as possible. \n\nAs insane as all of this sounds, I'm happy. He walked into my life as my first good relationship, after terrible abuse, was ending. He took my damage, took my fear of falling for him, took the things about me I couldn't stand--and told me he loved me more than he had ever loved anyone. \n\nBecause I know I have his full support, I was able to hit the publish button on my first ever erotica. Because of his love, the scars from low self esteem, abusive relationships, and misadventures no longer seem like scars--they just seem like different parts of me. Different parts of something that I have finally realized are amazing. \n\nI'm happy, with a tattooed biker cook thirteen years my senior.\n\nI'm happy.", "url": "https://www.reddit.com/r/happy/comments/52cvm1/my_boyfriend_made_a_forge/", "title": "My boyfriend made a forge.", "social_network": "reddit", "user": "Bittersweetreality", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 16, "down_vote": 0, "creation": 1473659137, "permalink": "/r/happy/comments/52cvm1/my_boyfriend_made_a_forge/", "nsfw": false, "first_save": 1635442929.4783506, "replies_charged": false}