{"id": "t5_2qh5i_t3_4lyo0s", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "Hey guys.. just wanna share my happiness, as I cannot do this anywhere else!!! \n\nI had graduated college in 2013, and since then I had worked at a hospital and private practice, and after a lot of thought on the subject I had decided to pursue being a doctor. I knew it was not going to be easy, but I knew if I worked hard, I would be able achieve it.. \n\nI worked my ass off to get shadowing experience, studying for MCAT, and eventually preparing my application to submit. I had a decent high school GPA (3.8+) and a decent MCAT score (93rd percentile). My first try I did not get in.. that was the most depressing moment in my life! The wait to hear back from my interviews, and knowing that I had spent about 3k in application and MCAT prep were a heavy burden on my conscious. The whole 2014-and the first half of 2015, I spent worrying, stressing, and working. I was stressing so much I was hurting my own body, I had gained weight, which further hurt my emotional and physical image. I was so down in the dirt, that I was seeing no way out. \n\nTo add to that, my family life was bad too. I had moved in with my parents post graduation, as back then I was not working, and I needed to save up money to take MCAT prep course. My mother was supportive, but my father was not. and my brother also was very negative. All this combined to form this environment where I could not leave, and the emotional stress of all this were just destroying me from inside...\n\nin 2015, I thought to myself, this is the last time I am applying to medical school. I had decided to do MBA as a back-up, in case medical school does not happen.. While studying MBA, and doing a small part-time gig, I applied to medical school and started doing interviews. I had 4 interviews, and they were early. Again the wait game began, and I was a nervous wreck, but since I was diverted with studying MBA, i was mostly busy and didnt think about it too much...\n\nI still remember the day I got my acceptance. I got a call from the school, and boy was i nervous. I was scared they might wait-list, or reject me. The admissions dean was going on about my achievements, and all i could think was him saying \"but\", as in you have all these things...but..we cant accept you.. and he didnt say the but. I broke down crying.. smiling.. yelling.. you name it. I was HAPPY... happiest I had ever been. My hard work had paid off and it felt satisfying. For past 2 years, i had so much rejection that first I could not believe it. I thought it was as dream.. or somehow it would be taken away from me..i guess that is just what happens when you develop a bad mindset. I still smile thinking about that day.. knowing that come august, I will start on a path of working towards what I always wanted.. my dream come true and hard work paid off!!\n\nI guess the point of this post to not only share my happiness, but to show that times do change. Things eventually get better, and that sometimes when I was down in the dirt.. i could never see the sun..but as my mom told me \"be patient, this shall pass too\" and it did. One thing I learned is that not to take things for granted..or be over-confident. Also that to remember all the things I went through..and people who helped me through the times..\n\n\nI truly am satisfied.. happy.. on the top of the world.. and i am happy to be sharing it with you anonymous people...\n\nthanks for your time", "url": "https://www.reddit.com/r/happy/comments/4lyo0s/so_i_am_finally_heading_in_the_right_direction/", "title": "So.. I am finally heading in the right direction!", "social_network": "reddit", "user": "hindukid", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1464743367, "permalink": "/r/happy/comments/4lyo0s/so_i_am_finally_heading_in_the_right_direction/", "nsfw": false, "first_save": 1635441325.5200527, "replies_charged": false}