{"id": "t5_2qh5i_t3_mhann", "request": ["77a5a12a-14c1-468d-b6d8-4b6928ce40ae"], "text": "The [RockyGrass Academy](http://www.bluegrass.com/rga/) is a bluegrass camp in Lyons, Colorado held each summer the week before the RockyGrass music festival. Somehow, our first time entering, my best friend and I lucked out in the VERY competitive lottery (I've heard of people applying for upwards of 5 years and not getting a spot).\n\nRight before I applied, I discovered my favorite band was going to be TEACHING at the academy!! I've been in love with the [Punch Brothers](http://www.youtube.com/watch?v=FVlrZddebsI) (do your ears a favor and check these brilliant fellas out) for a while, and the thought of getting mandolin lessons from Chris Thile (arguably the best mandolin player in the world-- most famous for his band Nickel Creek) while sitting by a river on a ranch in Colorado makes my heart feel like bursting in a good way.\n\nOne of my biggest frustrations as a musician is that I don't really know how to play with other people. I recently picked up mandolin, and music theory has been opened up to me. I'm finally ready to learn to be a real musician, and at the RockyGrass Academy I'll learn from some of the best bluegrass musicians out there. I could not be happier.\n\nAlso, if you haven't heard [The Goat Rodeo Sessions](http://www.youtube.com/watch?v=d-31e8Nlujw) yet, you're in for a treat. Chris Thile, Yo-Yo Ma, Stuart Duncan, and Edgar Meyer making some of the most beautiful music I've ever heard.\n\nI hope everyone's having a great day!", "url": "https://www.reddit.com/r/happy/comments/mhann/i_just_found_out_my_best_friend_and_i_got_spots/", "title": "I just found out my best friend and I got spots (in a very competitive lottery) at a bluegrass music academy this summer taught by our favorite band in the world. I'm so happy I can barely breathe!", "social_network": "reddit", "user": "SmotherTheresa", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1321647810, "permalink": "/r/happy/comments/mhann/i_just_found_out_my_best_friend_and_i_got_spots/", "nsfw": false, "first_save": 1635440775.4240394, "replies_charged": false}