{"id": "t5_2qh5i_t3_nxlsz6", "request": ["4161666b-4b17-4c22-bb40-42efca26f347", "e9d5c1b3-4f2e-427b-a98e-af434f9cf1da"], "text": " Journeying through this life, we find ourselves arriving into places that trigger us to become who we really are. These places bring experiences, thoughts, and emotions inside ourselves that become our mirror. But, unfortunately, these experiences often reveal themselves as traumas, high-level stress, chronic diseases, or powerful shocks that usually make us feel disempowered and weak, and most of all, they make us feel the victims of this world.\n\nSince childhood, we are usually taught that our external environment has the most powerful impact on our lives. We are told to be competitive, to be “smart” to win over every time, insist as far as possible, and earn as much as we can. Society shows us constraint, guilt, and limits in all areas. It teaches us about the power outside of us, which we are taught to own, to accumulate as much as possible, to keep it, and not share it so that we will not lose it.\n\nIn this process of being educated by society, we lose ourselves, forget who we are, and lose all connection to our future and our most desired path. We lose connection with our passion and enthusiasm, with our true ability to love, and we forget about our potential here on Earth. It’s like massive amnesia at a planetary level that keeps repeating for ages and millennia, and waking up seems so hard.\n\nDeep inside, during these painful experiences, we start to pine for a better life, for an amazing us inside, for grandness and happiness, and for living from our true inner self. But, deep inside, we all know there is much more to life than having a job, working a lot, having 2–3 vacations a year, and then succumb at one point after we repeat the same experiences, the same thoughts, and emotions.\n\nActually, there is no need to find ourselves. We do not have to do anything. But if we want to live life to the fullest and feel elevated emotions like love, true compassion, joy, and fulfillment, we have to decide — do we want to live as the persona molded by society outside us? Or do we want to live as the most honest and powerful self, liberated by our own light and power within?\n\n*What is there to lose? What is there to win?*\n\nFrom where I am standing, after more than 10 years of searching and questioning everything, we never lose anything, but we can win the most gracious gift of all — the gift of being a creator and the freedom to live a life beyond our wildest dreams.", "url": "https://www.reddit.com/r/happy/comments/nxlsz6/why_do_we_need_to_find_out_who_we_are_and_be_happy/", "title": "Why do we need to find out who we are and be happy", "social_network": "reddit", "user": "felicitypowerwithin", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1623433460, "permalink": "/r/happy/comments/nxlsz6/why_do_we_need_to_find_out_who_we_are_and_be_happy/", "nsfw": false, "first_save": 1635440964.3095484, "replies_charged": false}