{"id": "t5_2qh5i_t3_in9fis", "request": ["0344ec6b-2528-4c06-8dba-4c3095c02293"], "text": "\\- **Get into nature**. Take a short walk, eat lunch outside, go to a park for a half hour, even open a window and listen to the rain. Taking a few minutes to connect with the natural world help me feel grounded and relaxed.\n\n* **Meditation.** At first it was very difficult to sit still for that long. But after the first week, I started to truly realise that all of my problems were in my own head. I was perceiving things poorly, from past images that I’d clung onto.\n* **Yoga.** Please look after your body as well as your life! Follow your internal compass — your intuition. If something feels right, you’ll know. Even more poignantly, like in yoga, if something feels wrong, you’ll know for certain. When you’re practicing yoga, the movements at hand require a level of focus that demands that you be in the present moment. The practice pulls you from your thoughts because it is stronger than them.Getting into your body in this way is an antidote for rumination and a soother of worry. There are times to think, but during yoga, you are only required to move, and it requires your full participation.\n* **Ritual.** For me, it’s making an afternoon cup of tea. Having a small ritual like this that you do at the same time every day provides a touchstone in the day. It’s best if the ritual is a healthy one, of course (i.e., not lighting up a cigarette or pouring a drink).\n* **Avoid drama and the people who cause it**. Drama is what I call the manufactured junk that causes conflict and unhappiness. Some people seem like they must always be submerged in drama. My husband and I decided long ago that we weren’t going to tolerate it. We don’t befriend people who bring drama, and we work to keep it out of our relationship. It helps us deal much better with the real ups and and downs of life.\n* **Try to maximize time spent on activities that induce «flow.»** Flow is the term for that magical time when you’re so immersed in what you’re doing that you don’t really notice the time passing. We are happiest when we are in flow. So when you do something and realize this is happening, make a mental note of it, and try to build time into your days for similar activities.\n\nIf you are interested, there’s a lot out there to get you started. I recommend the mindfulness&yoga apps but please find what suits you. If you have any apps or sites you want to share, please do!\n\n**Disclaimer**: This is not an advertisement, I am sharing knowledge of the apps. I’m not affiliated with any of the links below.\n\n**Apps I use:**\n\nZenia.app: Great Yoga App that sees my movements and tells me when my asanas aren’t correct (free version, sub based) - [https://get.zenia.app/0BrF/f2f98069](https://get.zenia.app/0BrF/f2f98069)\n\nNike Training Club: a great app to diversify your classes and try out new workouts. (free) - [https://apps.apple.com/ru/app/nike-training-club/id301521403](https://apps.apple.com/ru/app/nike-training-club/id301521403)\n\nHeadspace: Meditation & Mindfulness (free version, sub based) - [https://www.headspace.com/](https://www.headspace.com/) I think everyone knows this app\n\nFabulous: a science-based app, incubated in Duke’s Behavioral Economics Lab, that will help you build healthy rituals into your life, just like an elite athlete. [https://www.thefabulous.co/](https://www.thefabulous.co/)\n\n**Find what works for you, discard the rest. Good luck!**", "url": "https://www.reddit.com/r/happy/comments/in9fis/what_are_some_suggestions_for_things_to_do_daily/", "title": "What are some suggestions for things to do daily for one to feel happy? Here are some things I do that work for me.", "social_network": "reddit", "user": "JasmineHodgess", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1599341446, "permalink": "/r/happy/comments/in9fis/what_are_some_suggestions_for_things_to_do_daily/", "nsfw": false, "first_save": 1635442734.4038315, "replies_charged": false}