{"id": "t5_2qh5i_t3_6yrknq", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "TL;DR: My wife and I hit two major milestones: being married for 7 years, and paying off all $80k of our student loans. So happy right now. We're going out for a fancy dinner this weekend.\n\n---\nShort story, because I feel like sharing:\n\nMy wife and I got married in college, despite much disapproval from our families. I had planned to ask her to marry me after school, but we were at a place where she couldn't afford to stay in school. Federal aid cut her off because her dad made too much money, but he never helped a dime with her college expenses, leaving her in the same trap a lot of young Americans are in lately. So, we decided to get married in school. This made us both \"independents\" (like we weren't already...) and she was able to qualify for a pell grant and some more loans. \n\nWe got married our Junior year, her at 20, me at 19. We both finished school and graduated with around $80k in loans, combined (I'm still baffled as to how this happened, we both worked through school, were frugal and I had a full tuition scholarship; room-and-board for two years, then rent and groceries for two years really adds up). We punted on having a wedding until after we graduated, opting to wait until we could afford what we really wanted.\n\nNow, 5.5 years after graduation, we've paid off all of that debt, and stuck together through good times and bad, and hit the 7 year mark.  Feeling pretty happy about that. Thanks for listening, reddit.", "url": "https://www.reddit.com/r/happy/comments/6yrknq/student_loans_paid_off_and_7_years_married/", "title": "Student loans paid off, and 7 years married.", "social_network": "reddit", "user": "roviuser", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 33, "down_vote": 0, "creation": 1504833253, "permalink": "/r/happy/comments/6yrknq/student_loans_paid_off_and_7_years_married/", "nsfw": false, "first_save": 1635441324.8248231, "replies_charged": false}