{"id": "t5_2qh5i_t3_2w7v5v", "request": ["608fc108-cf44-476e-8378-c59ee7483909"], "text": "I'm sorry if this is a little long, I need to get this off my chest. I have been clinically depressed for 26 years. Little things excite me, but I quickly lose the flame. This is the longest I've been happy since my cat passed in October. My job sucks, sucks bad. For just barely a little over minimum wage, I am a body to this company. I have worked my heart out, harder than anyone here.\n\nWhen I started working for this company, I was at an all-time low. We had just enough money to pay our rent one last time. No money for food, gas, nothing. My boss called and asked for an interview. During the interview he asked if I could afford to buy the required steel toed shoes. I embarrassingly said no, and he took me to Wal-mart to buy said shoes right after the interview.\n\nI knew it would be a great place to work for right then. I valued my job, because they came in a time when I needed it most. I worked as much overtime that I could, putting in 60 plus hours a week. Did my job without complaint. A year later, a supervisor position opened. I put in for it because I wanted to do more. I had no experience, but it didn't matter. My boss immediately obliged. He started to train me. This is where it begins.\n\nAll of a sudden, I got my first write-up from corporate. For doing something EVERY employee did. Eat in the office. Had done it all the time, no one said anything negative about it before. Since I still wasn't official to the position, this write-up automatically disqualified me. They hired someone who only had 2 months experience in the department. 2 years later, they just fired my boss. For caring too much about us, the employee, and not the client. All they care about is $$$.\n\nI got interviewed for his position almost 10 minutes later. I accepted before really thinking about it, because it meant more money, and better opportunities in the future. I would start the next day. That night I had a panic attack. I have been experiencing them nightly since my cat passed. This one was bad enough to send my to a stress center. I emailed my new boss a lengthy letter a few days into it stating that I did not feel like I was the right person for the position based on what I had been going through lately. That I would stick it out until they found a more suitable candidate. Someone outside of the department with previous supervisor experience. Our departments moral was low, we needed someone who could bring it back up. I would stick it out for 6 months if I had to.\n\nA few days later, I find out that he was interested in interviewing a gal (We will call her R) I had worked with at a previous job. She has been working here for about a year. He asked me my thoughts on R. I told him my honest opinion. NO. See, the supervisor is required to fill-in whenever needed, works overtime when a position needs filled, say a person calls in sick, or wants a vacation.\n\nR is the type of person that shows up late everyday, never works overtime, lives a half mile away but says she can't work because she only has one car and her husband has 3 jobs. She lies constantly, always has to be right-her way or the highway only. Manipulative. The definition of Bipolar. Any drama we have in this department, is caused by her. My first \"best-friend\" was exactly like R. The type that was your friend one day, your enemy the next. I told him all of these things. I almost moved in with R, until I found out she was like my ex-friend. I am the reason R even has this job.\n\nI told my boss all of these things. I then told him everyone else in the department will tell him the same things about R, and that morally I can't do that to this team. I would stay. He said he would have to interview both of us. I said if she gets hired, I would have to quit. I won't physically be able to handle it. I wouldn't be able to trust anything she says. She will instruct us to do things, and set us up for failure. How can I work someplace where I won't know if what I'm doing is actually the right thing, or the thing she wants me to do to get written up?\n\nWe interviewed Thursday. Yesterday, I had a brief meeting with my boss. I am now on the hunt for new employment. I didn't get fired, my boss told me the interviews were very good, and we were both really close. But she just barely came out on top. He also told me that he understands I can't stay and that he hopes I give him 2 weeks notice. He didn't even try to get me to stay. Even though I have a clean record (besides the BS with the food), I am the hardest worker, who cares? is what he pretty much told me. Oh, and I didn't get paid for my 3 total weeks of being a supervisor either. Even though I did all the job duties of a supervisor. That was the topping on the cake. I don't need this job. I can find something a lot better, for a lot more money, and a lot better benefits. I stayed because I cared. Well, no more. \n\nToday I put in about 10 different applications/resumes. 2 hours later, I got a call for an interview, as I was on the phone getting details, I get another call asking for an interview, and as I'm typing this, I just got a third call. Though I'm not sure I'll pursue the 3rd call. It's for a minimum wage job. But I am so happy that I am even getting all these interviews after feeling so low all week, all month. It's a bright light finally shining on my meek life. The first interview I'm especially excited about, almost next to my home (walking distance), pays almost $1 more. The 2nd one, 50 cents more than the previous interview, but a totally different job. I am just excited to not be treated like a piece of trash anymore. I cannot wait until the day I can tell this company to shove off!\n\nUpdate 2/19/15: Did both interviews. Turns out the 2nd interview actually pays $3 more than what I make now. Well I'm happy to report I got a job offer today from the place closest to me! Not ideal hours, but they can be changed later. I also got offered to do a job shadow thing for the $3 more one, but I didn't like the drive, or the job. So I declined that one. I start my new adventure next week! So excited!!!", "url": "https://www.reddit.com/r/happy/comments/2w7v5v/have_been_depressed_for_too_long_just_recently/", "title": "Have been depressed for too long. Just recently received 3 calls asking for an interview. Nervous but excited!", "social_network": "reddit", "user": "Green_Day_16", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1424197705, "permalink": "/r/happy/comments/2w7v5v/have_been_depressed_for_too_long_just_recently/", "nsfw": false, "first_save": 1635441491.2168133, "replies_charged": false}