{"id": "t5_2qh5i_t3_yhdap", "request": ["af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "> \"All I ask of you is one thing: please don't be cynical. I hate cynicism -- it's my least favorite quality and it doesn't lead anywhere.\"\n\nI had been laughing with this man for over a decade, and it hit me right in the feels when he was fired from NBC. I was watching his last show during my 5th and not even close to final year of undergrad. I was angry and discouraged after failing out of the engineering program through my own laziness, and was about to be dismissed from the university entirely at the end of the quarter. I didn't know what to do. I was under a mountain of debt in a degree program which had no built in career upon graduation. I saw my friend's succeeding but kept on with my, \"Fuck it,\" bullshit, underachiever mentality. I wasn't happy for my friends, I though I deserved more.\n\nWhen Conan made this speech (http://www.huffingtonpost.com/2010/01/22/conan-obriens-heartfelt-f_n_433954.html) at the end of his final show on NBC, something clicked inside my head. I was crying by the end of it. I realized I was the problem, and I had to change.\n\nAs of today, I have been dismissed from University, re-instated, graduated, found a job (looooong process), and am finally up to date with my monthly bills after two years of late fees and terminated services. I don't make snarky jokes about people to bring them down. I try to wake up with optimism. I try to make my pessimistic friends think like optimists. Everything is possible. Don't become a jaded cynic who is more superficially satisfied than truly proud. **Try!** Not trying is bullshit. If you're in your mid-twenties like me and haven't lost someone you are lucky. Life is short. Go and do something. Be happy!\n\ntl;dr: Conan O'Brien made me realize I had to try. I'm happy again.", "url": "https://www.reddit.com/r/happy/comments/yhdap/conan_obrien_changed_my_life/", "title": "Conan O'Brien Changed My Life", "social_network": "reddit", "user": "NastyRazorburn", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 59, "down_vote": 0, "creation": 1345401853, "permalink": "/r/happy/comments/yhdap/conan_obrien_changed_my_life/", "nsfw": false, "first_save": 1635441991.9767258, "replies_charged": false}