{"id": "t5_2qh5i_t3_34ao3y", "request": ["c15214d3-1d77-40d5-ad12-df4ba3bdb7b2"], "text": "I'm a rising college senior and ever since last fall it has been an endless search for an internship for this summer. I was so filled with doubt and futility, thinking all the good internship spots were filled in the fall and I would have an uneventful depressing summer.\nThe worst point of my job search was probably doing two interviews during the last FINALS WEEK for a position that I was so very close to getting but didn't get.\n\nBut after several career fairs, networking events, dozens and dozens of applications and a fair amount of interviews, I finally got an offer for a full time paid internship in my are of interest (business/IT stuff), right in my home town (I thought I would have to go to NYC to find such an opportunity but now I can spend the summer with my friends and family woohoo).\n\nThe thing that gives me the most satisfaction is the fact that I got this with no connections or assistance or networking. This was all me and I've never felt so accomplished. I applied with a genuine cover letter and spent all night before the interview researching the company and figuring out exactly what I wanted to say. HR called me back an hour after the interview to give me their offer. My girlfriend was in the room when I got the call and she saw my face light up like I had just won the lottery. It's so damn satisfying to succeed after trying and worrying about something for 7 months.\n\nI got the offer a week ago and I'm still just filled with excitement. I can barely pay attention in class anymore because all I can think about is starting my internship. I can't wait to do a great job this summer and maybe even get a full time offer. : D", "url": "https://www.reddit.com/r/happy/comments/34ao3y/finally_landed_my_dream_internship_after_7_months/", "title": "Finally landed my dream internship after 7 months of trying", "social_network": "reddit", "user": "awesomedan24", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 20, "down_vote": 0, "creation": 1430327584, "permalink": "/r/happy/comments/34ao3y/finally_landed_my_dream_internship_after_7_months/", "nsfw": false, "first_save": 1635442809.8007982, "replies_charged": false}