{"id": "t5_2qh5i_t3_9zj7p", "request": ["e660e09a-842d-44ca-8826-ddfa61319574", "258e332d-215f-495f-8bee-bccd57229f62", "2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "For the past couple of years I've been going through intense bouts of depression and anxiety about my looks, fitness, intelligence, friends, everything. I always thought I would never be good enough to be accepted by a girl.\n\nOver the past few weeks it had gotten worse; no foreseeable future due to being rejected by every university I applied to and no job to fall back on, a strained relationship with my family and very little money.\n\nThis has been the all important boost that my ego needed, and I honestly feel like I could conquer the world. I just wanted to let Reddit know that if you feel the same kind of anxiety that you should just go for it and to hell with the consequences. I am a happy happy guy.\n\n \n\n**Edit**: I had a request for details of how it happened, so here's the story. I've known Isabelle since we were both much younger, but we only got to know each other properly at the 2009 new year's eve party. We got on like a charm (except for her Twilight obsession, which I can grant her considering practically every other aspect of her is wondrous. She dances in museums and laughs with her whole body — I hope that explains what I mean).\n\nI know a few other girls who I had a major crush on but got into the \"friend zone\" and couldn't pull my way out, and I desperately didn't want that to happen with Isabelle. Because of this, I kept my distance and completely over-thought everything. Bad move. This distance made me lose interest in pursuing anything, and I sank deeper into depression. 11 whole fucking months later, I still hadn't done anything and was totally miserable. I decided that if I wanted to make things happen in life, that this would be a good place to start.\n\nI knew she was at least vaguely interested and could stand the sight of me, so I called her up and we went for a walk. We were playing Pooh sticks on this bridge over a stream and I had just said something that made her laugh, and so I just went for it. The rest is history.", "url": "https://www.reddit.com/r/happy/comments/9zj7p/today_i_asked_out_a_girl_for_the_first_time_ever/", "title": "Today I asked out a girl for the first time ever and she said yes. We're going for a date on Sunday. I'm 18.", "social_network": "reddit", "user": "OneHappyMoFo", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 224, "down_vote": 0, "creation": 1256947628, "permalink": "/r/happy/comments/9zj7p/today_i_asked_out_a_girl_for_the_first_time_ever/", "nsfw": false, "first_save": 1635439388.2199712, "replies_charged": false}