{"id": "t5_2qh5i_t3_1vfuom", "request": ["a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "The past month has been very likely the happiest of my (still young) life. I'm hopelessly in love with the funniest, sexiest, nerdiest, and sweetest guy I ever had the pleasure to meet.\n\nWe have known each other for months playing DND with friends but I was still dating someone else at the time. I always held some attraction to him but my crush felt a little silly in my mind. After a rocky break up I got back on my feet, ready and open to live my life as it unfolded. One night we were watching Zoolander and I was crowded next to him on a couch with two others. I swear I must have been blushing because I was filled with butterflies for what felt like the first time. At first I couldn't even consider making a move. Until that point I had no indication that he liked me anymore than a friend. Then a bottle of rum was shared and I became a little more bold, seeking out an opportunity. Eventually, someone left the couch and there was room for him to move away from me. He didn't and if that wasn't a signal for me to try then I don't know what was. I mean we were really on a tiny couch and packed in tighter than a college dorm hamper. So I pretended to adjust myself on the couch and happened to leave my hand on his knee when I settled. My heart banged against the walls of my chest as I waited for him to react. Would he scoot over? What if I totally misread everything? My mind was overwhelmed thinking of the possible consequences until I saw his arm about to move. Then the first of many exciting moments happened, he held my hand and my god it was the best handholding in my life. As the movie went on I melted in the warmth of his presence as he eventually held me in his arms. I could feel his breath on my neck and my imagination ran wild. At a couple points we locked eyes and eventually we shared a kiss. Thankfully the last person on the couch besides us was my bestfriend and greatest wingman who quickly decided the floor was a better seat. After the movie, we hastily rushed to my car. After some very excited kissing he said \"You have no idea how long I've been wanting to do this.\" I could go on for hours but essentially, we just click. I didn't anticipate to fall in love so quickly but looking back, I don't know how I could not.", "url": "https://www.reddit.com/r/happy/comments/1vfuom/i_found_the_greatest_guy_and_things_just_fell_in/", "title": "I found the greatest guy and things just fell in place.", "social_network": "reddit", "user": "tallenbear", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1389957954, "permalink": "/r/happy/comments/1vfuom/i_found_the_greatest_guy_and_things_just_fell_in/", "nsfw": false, "first_save": 1635442255.360591, "replies_charged": false}