{"id": "t5_2qh5i_t3_ev9aaf", "request": ["3fa9d278-6200-4503-908d-5c456f8aa87c"], "text": "To understand how HUGE this is for him I have to share a little back story. My kid went to a very tiny private school since Kindergarten. With small classroom sizes & where everyone knows eachother and their parents type environment.\n\nMy kid struggled with being organized and writing down assignments. He would often forget about upcoming tests or papers due. I would find unfinished homework shoved in his unorganized notebook, or in the back of his desk. When I would meet with teachers they would share that often times after they have given the lesson and assign the in-class work my son would look around and be clueless. Asking, what are we doing? How do we do this... etc? The Teacher would say, \"I just went over it with everyone\".  And sometimes they could go over again with him, but sometimes the time wouldn't allow. I remember studying with him for tests coming up, only to find out he didn't do well. Many tears were shed. School was hard for him and his confidence was starting to dwindle. He started calling himself stupid and self harming himself. which broke my Mama heart. Because he is such a good kid. He's kind to everyone, respectful, helpful and just a thoughtful person.  \n\nAfter his 4th grade year the principal had a meeting with me about him and the upcoming 5th grade year. She shared her concerns for his success & highly suggested that I medicate him and to also hold him back & repeat the 4th grade. This was gut wrenching to hear. His already low self-esteem would certainly take a hit. He wouldn't be with the same classmates he's had since kindergarten. He would then also be in his younger brothers class (who has no problems with school), and at this age kids are self aware and they talk. I felt so distraught for him. Plus, I didn't understand how repeating a grade and doing nothing else different was going to help him. Because this is such a small private school, they can't accommodate (or have the resources) children that don't fit into the \"norm\". \n\nI made the hard decision to pull him from the only school he's known and enroll him in the public school system, which had the funding and resources available to help him. He started his 5th grade year there. It was awful hard on him. Everything was new. New, building, new teachers, kids, and curriculum. We soon started him on the evaluation process, which took some time and eventually got him on his own IED plan.  This was HUGE!! \n\nCome to find out my kid struggles with reading/comprehension. It's hard to do the assessments when you don't know what you just read. Also, he gets anxious if he feels he's slower then the other kids so he wouldn't take his time to understand or do the assignment right & just scribble something down to turn it in. Once we were able to find the problem we were able to address it and tackle it head on. He had a team of supporters at this new school helping him how he needed it. Once the IEP plan was put in place he thrived!\n\nWell, my kid is now in the 6th grade. He has an IEP plan in place and he is rocking it! He finishes his homework on his own, and he's getting A's & B's. It is So SO SOOO amazing to see his confidence built back up. The school posted on FB the kids that made the Honor Role, and for the first time in his life his name was on it. My heart BEAMED with happiness for my son. I know that changing schools (as hard as it was on him) was the BEST thing for him. \n\nI'm So proud of my son, It is truly a joy in life to see your children overcome an obstacle and succeed. I am happy.", "url": "https://www.reddit.com/r/happy/comments/ev9aaf/my_son_got_on_the_honor_roll_for_the_1st_time/", "title": "My son got on the Honor Roll for the 1st time!", "social_network": "reddit", "user": "-flyonwall-", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 49, "down_vote": 0, "creation": 1580235876, "permalink": "/r/happy/comments/ev9aaf/my_son_got_on_the_honor_roll_for_the_1st_time/", "nsfw": false, "first_save": 1635438989.3648973, "replies_charged": false}