{"id": "t5_2qh5i_t3_iglds", "request": ["cfcd3c1b-8d85-4f01-a313-b0943d8c4f22", "4d117a53-9372-4484-a20e-20dce96e63e4"], "text": "One thing that has always made me happy is the good I see in my community, especially when one of our own needs love, help, and support.  \n  Like many places, the economy in my small town isn't what it used to be.  It's no secret that people everywhere have been tightening their belts for longer than is comfortable.  This was always an industrial town, full of railroad workers.  That time has long since gone, and though there have been other successful businesses thrive here, the area has never enjoyed that level of prosperity since the rail running through town ceased to be the driving force in the economy.  Lately, of course, that's been worse, as even the successful businesses have cut back personnel, man-hours, and budgets.  Naturally, this effects other businesses too.  Bars are less busy on the weekends, restaurants have more open tables, and retail stock sits on the shelf too long.\n  \nOne thing, though, that makes me truly happy is to see the willingness of people here to still come together for the sake of those who need them.  I'm fortunate enough to see it maybe more than others.  I work at a local bar/restaurant/club, and like many, we'd like to be busier.  The band scene, it seems, just isn't what it used to be.  One thing we're always willing to do, however, is be the host venue for a benefit for one of our neighbors.  We've done several over the last few years.\n  \nMost recently, a local family was in need of some help with medical bills for a very ill child.  Friends pitched in to organize, bands were contacted and donated their time on a Saturday night, door prizes were secured, and the word was spread.  The night of the benefit came, and by a couple hours in to the event, you couldn't get in the door.  The bar hadn't been that busy on a run-of-the-mill Saturday night in a long time.\n  \nTo me, it says a lot about a community that even though no one has much, they all came with something to give.  It makes me proud to be here and be a part of it.\n  ", "url": "https://www.reddit.com/r/happy/comments/iglds/the_good_in_my_community/", "title": "The Good in My Community", "social_network": "reddit", "user": "30SomethingAltoona", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 1, "down_vote": 0, "creation": 1309807674, "permalink": "/r/happy/comments/iglds/the_good_in_my_community/", "nsfw": false, "first_save": 1635442454.5357988, "replies_charged": false}