{"id": "t5_2qh5i_t3_palf1d", "request": ["f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "Super new to reddit, but in all honesty I read this reddit as often as I do my religious studies and after seeing everyone share their joy never fails to make me smile. So I want to share mine as well :-) btw, I'm not a native English. So if sentences don't make sense, you now know why  \nI have known my now boyfriend ever since we were in middle school. He met me during one of the hardest times of my life as a kid. I found out I'm incurably ill at a very young age. Not something that will be fatal on long term but quality of life is severely reduced. As kids his company was one I enjoyed alot, everytime. In all my years of meeting people I've never consistently been able to enjoy someone's presence. Years pass, we change. I did not for the better for a long time. Stuff got to me and I got bitter. (Which, til this day I wish I realised how down bad I was. I'm still thinking about how I could've been better) however, we remained friends but through my act I made him feel not loved with my rough attitude. One day I realised just how poorly I was doing and treating those around me because I got so bitter after alot of things happened. I realised I didn't want to be like this anymore and lost myself over the years. I distanced myself from every thing. Stopped using my phone, computer and consoles as a whole as I started to do some self reflection and learn. Alot of times passes, I wrote down his info to pick up contact again after I bettered myself before I took a trip. I promised him that when I'm ready I would soon greet him again. Going back to people I once knew was harder than ever, all I thought of was how people perceived me and how I was like before I saw in how I was. I struggled contacting him but after months of contemplating I did it. And I couldn't call him. That man singlehandedly changed his phone number dammit! So after contacting some other people who knew both of us they gave me his new info. I messaged him scared whether he would accept me or not and to my suprise, he did. I explained to him everything that went on in my mind and how I look back on myself. From that point on things improved even beyond what I thought. Being around him has made me learn even more. And eventually I felt things were getting a bit awkward. In a pinch and desperate effort I told him that I liked him alot and just needed to get it off my chest because the awkwardness that I felt. I would be fine if he didn't feel the same I knew what risk I would take because if he didn't feel the same at all, well, we all know where that can go. And he said he liked me back and that he always did ever since we were young. I don't know how to transition from this point on in my writing, but life has been so good. We can talk about things, I can be myself even if I am rather childish he always loves seeing me happy and doing what I want to do. He appreciates the transparency of our relationship and that we can talk about every little thing that bothers us and it's okay, we respect eachother and don't mock eachother we listen to each others feelings and improve from that point on. Even if he has odd passions I love them. Seeing his interest and pure joy he finds in a hobby I can't help but smile. I've had some confrontations with people who hate my guts. Rightfully so, it's okay that they're mad and I understand. It motivates me even more to better myself. I've been invested in my roots, languages and beliefs. My health has hit a downfall and I can't do much anymore,  I no longer work and had to take care of myself. He's here to support me through it. The path to recovery and getting my health back together will take a long ass time, but hey, atleast I'm with a guy who told me he thought he was going to marry me when we were 10 :)   \nThe biggest lessons I've learned and I hope someone can learn from these as well. Respect and equal treatment is important. You never know what someone is going through so never snap at someone because you have your own bad day. Consistent effort and showing you care builds long term bonds, it's okay to be tired but be sure to talk about how you feel and those who really appreciate you will understand how you feel. And last but not least, perception. Do not work yourself up over something someone said if someone comes off rude, I guarantee most of the time someone just worded it poorly. And even if it was meant to hurt you teaching yourself how to perceive the world and things around you will make even such things won't affect you anymore, you'll feel more joy and your quality of life will significantly increase when you start to smile at strangers and see everything in a positive light. The moment you start doing it it becomes natural and will only become a better and more dominant trait over time. Oh and, do it for yourself. Make changes you want to change like investing in a subculture that's not 'socially desirable' but you've always admired. Investing and developing interests will make you feel more confident. I play drums but also love knitting sweaters and I'm proud of these drastically different hobbies. oh and, really the last one. Tell them that you like them. Trust me on that one  \nSorry I treated this like a diary entry but maybe someone enjoys reading it haha, I still suck at writing. A last reminder for those who need it, know that you're loved. Surround yourself with people who MAKE you feel loved and do not feel afraid to leave and start over again and you can finally start fresh. It helps. I'm proud of you and you should be proud of yourself as well. Little steps always count up to something bigger.", "url": "https://www.reddit.com/r/happy/comments/palf1d/despite_all_downfalls_and_against_everything_i/", "title": "Despite all downfalls and against everything, I couldn't be happier with how things are going. Happy with myself and how lucky I am to date the man of my dreams :)", "social_network": "reddit", "user": "BiggieCheese9000", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1629804461, "permalink": "/r/happy/comments/palf1d/despite_all_downfalls_and_against_everything_i/", "nsfw": false, "first_save": 1635443355.6075716, "replies_charged": false}