{"id": "t5_2qh5i_t3_9wplgf", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "I sat down today at a study hall table at my Universities computer lab, and there was a newspaper on the table with a picture of a kid at a party and then another one of him in the hospital. I thought I recognized him so I picked it up and read some and noticed that he mentioned the incident at the party, and I soon realized it was the same guy. It was extremely snowy and cold up here in New England last St. Pattys day and this guy went to the bathroom in the woods behind the house. He was so drunk that he ended up falling down the embankment and fell into a stream losing his shoes in the process. The only reason that I heard him calling for help was because I had the same idea to go to the bathroom, and when i heard him, and looked over the hill it was apparent to me that he had been down there for a few minutes, soaking wet in about 20 degree weather with no shoes crawling through the snow. As drunk as I was at the time I knew that this was a really bad situation and I made an effort to get a huge stick and pull him up the steep bank without letting myself fall down it too. Once he got up the hill he periodically started to pass out and wake up a few seconds later. I knew that this was serious, except no one around me thought it was that bad and kept telling me to put him on the couch to sleep it off. No one wanted me to call an ambulance because that would probably mean that the party would be shut down (yea, priorities right?). Anyways I convinced one of his so called friends to call someone and drive him to the ER, and as it turns out he had Alcohol Poisoning and was a few hours away from dying. \n\nI spent the last 6 months or so thinking I acted like an ass and overreacted because I never got filled in that this kid actually went to the hospital. Everyone that was at the party gave me weird looks because I was yelling at them to get out  of the way and also pushing some people out of the way so I could get through the crowded house. So when I read the article that he wrote about how he was hours from death and it changed his life because he decided to go to rehab after, he thanked the \"strangers\" that helped him out that day saving his life. \n\nI don't think I have ever been this shocked and happy, it's such a weird feeling, and I love it. I am so happy right now!\n\n&#x200B;\n\nTL;DR - Assisted in saving a persons life, and found out I did 6 months later when I read his article in the university paper.", "url": "https://www.reddit.com/r/happy/comments/9wplgf/i_just_found_out_that_i_assisted_in_saving/", "title": "I just found out that I assisted in saving someones life last St. Pattys day, and I spent the last 6 months thinking that I overreacted and made a fool of myself.", "social_network": "reddit", "user": "theguywhoisright", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 79, "down_vote": 0, "creation": 1542120007, "permalink": "/r/happy/comments/9wplgf/i_just_found_out_that_i_assisted_in_saving/", "nsfw": false, "first_save": 1635440705.8983164, "replies_charged": false}