{"id": "t5_2qh5i_t3_ehtm14", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb"], "text": "I’m a 15F, very young, I know. I’m a ski racer for a mountain up in Vermont, so I travel there from my home state of New York every weekend. It’s a huge commitment, and I am constantly stressed. Sometimes I wonder if it’s worth it, but oh well.\n\nThe first weekend of training, I was skiing on a regular trail full of people, but I didn’t know there was a bare spot (patch of grass) towards the bottom of the hill. I couldn’t see it, and usually these things are marked by a pole in the ground so everyone knows to avoid that area.\n\nAs a ski racer, I was probably going around 50 MPH. I hit the bare spot, and get launched and landed on my head. Everyone says they think I was unconscious for a few minutes, and I dented my helmet in 2 different places and cracked it (keep in mind, this is a racing helmet. It takes a LOT to crack one of those).\n\nI ended up going to the hospital and they did multiple tests on me. They couldn’t believe that I had not sustained any lasting injuries, they thought I might’ve broken my neck. I got SO lucky and I am forever grateful.\n\nHowever I did suffer from a concussion, this forced me to stay out of school for two whole weeks. We are now aware that someone with a concussion shouldn’t be absent from school that long, but my doctor unfortunately misguided me in the beginning.\n\nEveryone who gets a concussion has a different story. They affect different people in different ways. For me, it made my depression much worse (I was diagnosed with MDD a while ago), gave me constant headaches, and I could not concentrate. I also got very dizzy easily, and my sense of balance is impaired (I fell down the stairs twice within the past 2 days).\n\nBut there is ALWAYS a way to turn a horrible situation into a good one. \n\nIt has been a little less than a month since my concussion. I haven’t done much, I’m going to concussion therapy but other than that I’ve been home. However my parents and I decided that we had the time to spare to take a little trip.\n\n3 years ago I met this boy online. We grew apart but eventually we started talking again and we started dating. He lives about 200 miles away (about a 3.5 hour drive), and my parents are letting me see him in 2 days.\n\nBecause of this horrible injury, I get to finally meet someone who held my hand as I healed myself. Someone who didn’t leave my side even when I tried to push him away. Someone who truly cares about me even when I don’t care about myself.\n\nI am learning to love myself every day, learning what it means to start being independent. He has helped me with all of this and I am eternally grateful. I no longer depend on others for happiness, but I now can seek out happiness in myself.\n\nThere is always a way to turn a negative situation into a positive. Never ever lose sight of that.\n\nTL:DR: I suffered from a concussion and somehow managed to turn it into a positive situation. Thanks to my concussion I will be meeting my long distance boyfriend in 2 days.", "url": "https://www.reddit.com/r/happy/comments/ehtm14/my_ski_racing_injury_is_turning_into_the_best/", "title": "My Ski Racing Injury Is Turning Into The Best Thing That Has Ever Happened To Me", "social_network": "reddit", "user": "NegativeMatch", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 29, "down_vote": 0, "creation": 1577746322, "permalink": "/r/happy/comments/ehtm14/my_ski_racing_injury_is_turning_into_the_best/", "nsfw": false, "first_save": 1635438944.2834458, "replies_charged": false}