{"id": "t5_2qh5i_t3_mboi0d", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065", "5b81e8b4-a0f8-4747-8a7a-0e37aae01c43"], "text": "Well, she's not my niece by blood even though she still calls me it now. My best friend thought of me as a brother and welcomed me into his family, even before she was born. I've watched her grow up alongside her dad and love her like she was my own kid. Always have and will. \n\nAnywho, the memory in question happened when she was about 8. I happened to actually be living with her family because I was moving apartments. Her dad actually comes and finds me and asks me to help (her mum wasn't home at the time). So we go to the bathroom and she assumes correctly that since I had basically Jimmy Page hair at the time, I knew about braiding hair and different ways of styling it. So that's what I did!\n\nI got any remaining knots out and basically spent the next hour minutes running through different braid styles I could think of and she was absolutely dumbfounded at how skilled I was and kept saying \"How did you know to do that?!\" and \"That looks so pretty!\", and I was smiling the whole time and joking with her about whatever. We finally settled on something that looked like [this](https://i1.wp.com/therighthairstyles.com/wp-content/uploads/2014/03/1-2-braids-hairstyle-for-girls.jpg?resize=508%2C631&ssl=1) and she was in awe at how amazing it looked. Even her dad couldn't believe it. And she gave me a hug as a thank you. I will say I had some small sense of pride afterwards and said \"I did that\" and felt accomplished. \n\nYeah idk why this thought popped up in my head recently but it brought a smile to my face thinking about it. The way she looked at me with such trust and then happiness at how pretty I made her feel is just wondrous.", "url": "https://www.reddit.com/r/happy/comments/mboi0d/just_felt_like_sharing_one_of_my_happiest/", "title": "Just felt like sharing one of my happiest memories ever of me and my niece", "social_network": "reddit", "user": "SaneLighting", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1616532687, "permalink": "/r/happy/comments/mboi0d/just_felt_like_sharing_one_of_my_happiest/", "nsfw": false, "first_save": 1635442839.7769465, "replies_charged": false}