{"id": "t5_2qh5i_t3_a9ek0e", "request": ["e660e09a-842d-44ca-8826-ddfa61319574"], "text": "Hello everybody, and Merry Christmas!\n\nI am 19 years old. I have been suicidal since I was 8. I started self harming when I was 11, and kept doing so until not too long ago. It got really bad. I developed an eating disorder and you know sometimes it *still* kicks my ass. \n\n2018 was pretty terrible for me. Had two not-so-great boyfriends, flunked out of college (again), got diagnosed with BPD and a plethora of other things, and got to a point where I couldn’t even get out of bed in the morning. \n\nIn November, I finally found the will in myself to *want* to get better. I was sick of hating myself and wanting to die every single day. I got back into therapy. I started medication for the first time. I figured out once and for all that I’m non-binary, and I have amazing friends who’ve taken it in stride and use they/them for me and call me by a new name. \n\nLet me tell you, folks. I have never felt so happy and at peace with myself *ever*. I feel like I am finally, truly, happy.\n\nMedication and therapy has worked like a charm for me. My friends are so amazing and supportive. One of them mentioned that my entire demeanor as a person has changed. \n\nI have to say this, however: the medication and therapy would not have worked if I had not first gained the will to get better. It literally starts there. I’ve had therapists and medication in the past, and it did jack shit cause I didn’t care if I got better back then. I care now. I care so much now. \n\nSelf love is so important. It has taken me 19 years to learn. I can finally see myself as a person who is learning and growing just the same as everyone else, and I can recognize that some people are further along, and some are farther behind. We’re all just on our own road to victory.\n\nI can finally look into my future and see light. If you had told me one month ago - that’s right, one *month* ago - that I would be so happy and energized and ready for life, I would’ve laughed in your face and said something about wishing to be dead. \n\nThis is the first time in my life I want to be alive. I am so ready for life. This may seem like a silly remark, but I scrolled straight past a “like to instantly die” meme today, because I don’t want to die anymore. I want to live.\n\nTo anybody out there who’s struggling with this same shit, I promise you there is hope. There is light at the end of the tunnel. I know you’ve heard it a billion times and said “bah” to the very idea a *billion* times, but take it from someone who was there just a month ago. Things get better. You just need the will to make it happen, and I know that’s the hardest shit in the world. It took me 11 conscious years to find the will. I know you can too. There is hope. \n\nThank you so much for reading, I hope you’re having/had a very merry christmas this year!! \n\nTL;DR: I’m not suicidal for the first time in 11 years!! I still have a ways to go in recovery, but I can finally truly say that I am *HAPPY*!!!!! \n\nP.S. Sorry for the rambling I am just so excited for life and I had to get it all out!!!! ", "url": "https://www.reddit.com/r/happy/comments/a9ek0e/i_am_so_proud_of_myself_2018_is_the_year_i_kicked/", "title": "I am so proud of myself. 2018 is the year I kicked mental illness in the ass.", "social_network": "reddit", "user": "Timeristic", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 22, "down_vote": 0, "creation": 1545741094, "permalink": "/r/happy/comments/a9ek0e/i_am_so_proud_of_myself_2018_is_the_year_i_kicked/", "nsfw": false, "first_save": 1635439386.4204712, "replies_charged": false}