{"id": "t5_2qh5i_t3_evkim6", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a", "23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181"], "text": "In the past, anger resulted in a lot of errors of judgments, it ruined friendships, and it destroyed all peace of mind. Consequently, I experienced no joy, healthy relationships, or luck and fortune. This is why it was so important for me to be mindful of my anger and learn to manage it in a healthy way that ensures it diminishes over time.\n\nAfter five years, I've managed to make great progress and feel a new person. Thoughts of anger, hatred, and ill-will no longer plague my mind and influence my actions and speech. In a sense, I feel great liberation and freedom from it. I feel so much more patience, empathy and calmness day to day and can naturally carry a smile to share with others, something I thought only psychopaths did.\n\nI made a [video](https://youtu.be/_DCsHV7Mmbc) to share how I understand anger, and detail the best ways to not only manage it but even use it to make us better people. By using kindness, patience and insight, I feel equipped to deal with life's obstacles, but also no longer fear the hatred and ill thoughts of others.\n\nPlease have a look and share your thoughts. I am still learning and am no way an expert, but I will share my experience if its helpful.", "url": "https://www.reddit.com/r/happy/comments/evkim6/the_past_five_years_ive_managed_to_work_down_so/", "title": "The past five years, I've managed to work down so much of my inner anger and hatred that it has brought on an elevated state of calmness and inner joy. I realized the three most effective ways to deal with anger are patience, kindness, and insight. How does everyone here manage with anger?", "social_network": "reddit", "user": "sickient", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1580288758, "permalink": "/r/happy/comments/evkim6/the_past_five_years_ive_managed_to_work_down_so/", "nsfw": false, "first_save": 1635439278.6240366, "replies_charged": false}