{"id": "t5_2qh5i_t3_9qaef", "request": ["0344ec6b-2528-4c06-8dba-4c3095c02293"], "text": "Oobleck! I recently taught a lesson to fellow college students on how to make Oobleck, and they had tons of fun.\n\nYou're going to need: Cornstarch (a box of it is about 84 cents at Walmart) Water Container (Bowl if you want to touch the stuff directly, which I recommend, but I also recommend 2 ziplock bags or a balloon to make a stress ball out of it to save.)\n\nMix one part water to about 2 parts corn starch, or more. It should turn into some sort of gloopy substance. When you exert gentle pressure on it, it behaves like a liquid. But if you squeeze it quickly or strike it, it behaves like a solid!\n\nThis is what as known as a non-Newtonian fluid. One way to describe why it works the way it does is to think of a bag of sand and water. If you strike the bag, it feels hard, because the water doesn't have the time to get in between the spaces of the grains of sand. If you squeeze it slowly, it will compress, since water has more time. The same for cornstarch molecules and water molecules.\n\nWhen you're done playing with it, put it in a ziplock bag and squeeze all the air out. Then put it in another bag, again, squeezing all the air out, just in case the first one pops open. It's tons of fun! If you leave it overnight, it will get hard, but if you work it a bit it will go back to normal. You could probably also put it in a balloon or a condom to get a more round shape.\n\nHere's some cool videos! http://www.youtube.com/watch?v=yHlAcASsf6U - People running on the surface of a pool of Oobleck \nhttp://www.youtube.com/watch?v=Yp1wUodQgqQ - Oobleck subjected to sound waves http://www.youtube.com/watch?v=NKxKVpHZe5Q - It crawls and looks alive here!\n\nAnyway, that's it. I would seriously consider making stress balls out of this and marketing it, but I can't figure what to put it in to make it aesthetically pleasing and not just a bag. Or how to do it quickly and efficiently.\n\nHave fun!\n", "url": "https://www.reddit.com/r/happy/comments/9qaef/oobleck_youve_probably_all_done_this_before_but/", "title": "Oobleck!  You've probably all done this before, but it's cheap and endlessly entertaining and relaxing!", "social_network": "reddit", "user": "Zaeyde", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 26, "down_vote": 0, "creation": 1254511199, "permalink": "/r/happy/comments/9qaef/oobleck_youve_probably_all_done_this_before_but/", "nsfw": false, "first_save": 1635442728.4641676, "replies_charged": false}