{"id": "t5_2qh5i_t3_9i1i3r", "request": ["77a5a12a-14c1-468d-b6d8-4b6928ce40ae"], "text": "I have a terrible memory. There are multiple contributing factors to why my memory is absolute ducking shit. Like it’s so bad that every time I’m looking for something I end up lost in thought just wandering my house because I forgot that I was even looking for anything. It’s a fucking shit show. \n\nBut it’s not completely fucked. I don’t remember the ideas themselves but instead the emotional impact that they had on me. It’s clear as day. \n\nNow, I was late to the Breaking Bad universe. I started watching the series while visiting my best friend at Yale earlier this year and we ended up canceling all of our plans in favor of being held up in Pauli Murray College for weeks high off our fucking asses binge watching Breaking Bad. To refer to Breaking Bad as the Mona Lisa or the Creation of Man of television would be taken as an insult by the both of us. \n\nNever have I wished more that I could relive something for the first time without it feeling like deja vu.\n\nWell wishes do fucking come true.\nI’m making lemoñade bitches!\n\nI turned it on to watch one of my favorite episodes as inspiration for something and turns out the combination of my shitty ass memory and being fucking up on Mary Jane caused my ass to completely forget most of what the fuck happened in that show. \n\nI’ve never EVER been able to see any sort of silver lining to my terrible memory. It’s always caused shit to just...fucking crumble on my hands even though I give everything 138%.\n\nI’m just so elated that something so grand and meaningful could come from one of my rotten fucking Lemoñes. \n\nHot diggidy fucking damn...there are no words.\n", "url": "https://www.reddit.com/r/happy/comments/9i1i3r/breaking_bad_again_like_its_he_first_time/", "title": "Breaking Bad again like it’s he first time.", "social_network": "reddit", "user": "autmnleighhh", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1537637913, "permalink": "/r/happy/comments/9i1i3r/breaking_bad_again_like_its_he_first_time/", "nsfw": false, "first_save": 1635440764.5712588, "replies_charged": false}