{"id": "t5_2qh5i_t3_b9dzgh", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142", "c889a480-189a-4ed9-aa88-81c300413196"], "text": "I shoot music videos occasionally, it started out as a bit of fun for my friends, as I got better other artists in his circle offered me money to do them. I had prior knowledge as ive been into photography and shot vlogs for my other friends YouTube channel (very small channel).\n\nSo I'm very familiar with lightroom, premiere, that sorta thing.\n\nAnyway, I loved it so much I thought I'd apply for an access course in the field. As my past jobs have been shitty entry level things that I'd rather not do the rest of my life.\n\nI sat down for the interview and was asked why I want this course and if I have relevant experience. In the UK, you need A-levels or NVQ level 3 to go to university. I have none of those things, hence the 'access' course for adults.\n\nThe woman interviewing me said \"It seems you already have adequate knowledge, so the access course might be pointless for you, let me ring the head of video production\".\n\nThis young lad came down, looked around the same age as me took me to the media production department and showed me around. I was on heaven with the amount of equipment and 4k canon cinema cameras they had. \n\nHe said the access course will be a slow burn for you given your knowledge, the access course is designed for people who have never even touched a camera before.\n\nHe asked to see one of my videos. Afterwards he said \"yeah you're going straight onto the degree.\"\n\nExcellent! I thought. That means only 3 years instead of 4. And I can get a student grant, which you can't get on the access course.\n\nHello sweet new camera :D Things are looking up now.", "url": "https://www.reddit.com/r/happy/comments/b9dzgh/applied_for_an_access_to_higher_education_course/", "title": "Applied for an access to higher education course to get into uni, showed them my relevant experience and they've allowed me to skip the course and head straight into a degree!", "social_network": "reddit", "user": "MeMuzzta", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 19, "down_vote": 0, "creation": 1554390898, "permalink": "/r/happy/comments/b9dzgh/applied_for_an_access_to_higher_education_course/", "nsfw": false, "first_save": 1635441320.9317267, "replies_charged": false}