{"id": "t5_2qh5i_t3_w35qk", "request": ["af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "Optimism is great.  It really is.  I like to classify myself as a relatively happy person, but I want to take it to the next level.  I have been inspired by [this TED talk](http://www.ted.com/talks/lang/en/shawn_achor_the_happy_secret_to_better_work.html), and now, I have a direction to follow.  Towards the end of the talk, Shawn Achor outlines 5 small changes in your life that can make a big impact on your overall happiness and optimism.  Thus for the month of July and onward, I will doing the following:\n\n* Making a continuing list of things I am grateful for.  Each day I will add 3 things to the list\n\n* Journaling about a positive experience that I had that day\n\n* Exercising daily (with occasional breaks)\n\n* Meditating for 25 minutes each day\n\n* Every time I open up Reddit, I will comment on someone's post on r/happy complimenting them on their work/experience/etc.\n\nI will be posting my journal on here in a separate post each day.  ~~I am also thinking of tweeting the 3 things I am grateful for every day via Twitter, but I am not sure about this yet. edit: I have made a Twitter for posting my 3 grateful things on.  You can follow it (or not, its up to you) @3gratefulthings.~~  But I don't want to do this alone.  I want everyone of r/happy to join me.  Feel free to do this however you want, but I want to hear about your progress as well!  If you made it this far in the post, thank you, and if you are joining me, comment and let me know, upvote so others can see (self-post so I don't get karma), and good luck to all!\n\nEdit: I decided to make the journaling and 3 things private as they are very personal things that I don't necissarily want to share :/ Sorry! But you can still do all of the above!", "url": "https://www.reddit.com/r/happy/comments/w35qk/i_am_embarking_on_a_journey_to_become_more/", "title": "I am embarking on a journey to become more optimistic and I want to recruit you in my journey!", "social_network": "reddit", "user": "Stoichio", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 10, "down_vote": 0, "creation": 1341512674, "permalink": "/r/happy/comments/w35qk/i_am_embarking_on_a_journey_to_become_more/", "nsfw": false, "first_save": 1635441978.2126586, "replies_charged": false}