{"id": "t5_2qh5i_t3_klddpw", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb"], "text": "I have a difficult job, my wife and I moved across the country a few years back to redress the work life balance. Didn’t really work for me, but I was able to support her to stay home and raise our children which was great.\n\nI worked, paid the bills to buy new stuff, did a little of what I love (being with family) and a lot of what I didn’t (work). Got promoted a few times, etcetera etcetera.\n\nI wasn’t happy, I wasn’t unhappy I was just trying to get on.\n\nI know it sounds twee, but recently (and maybe the dirge that is 2020 has something to do with it) I had a bit of an existential awakening.\n\nI moved across the country for a better life and ended up just doing the stuff that made me miserable with a different view out of the window.\n\nThing is, it didn’t end up being complicated. I love my kids and my wife. I don’t need any more stuff, or a better car, or a bigger house, I don’t need to spend cash on crap I don’t need to fill a void I don’t have.\n\nSo I’ve redirected myself. I’ll go to work and do my job as best as I can, because having pride in what you do is important. But. When I come home the only thing I want to do is be with my family, not spend time on the phone re work. If I don’t get promoted anymore, so what. Why do I crave the accolades and approval of people who I care nothing for, nor them me.\n\nSo, it may be simple and may even seem like a anticlimax if you’ve read the above, but if it helps anyone, focus on what you have, not what you think you ought to. I’ve chosen to be content with my work, invest myself fully at home and let myself be content.\n\nI’m not the most articulate and I’m sure the above could be said better, but change where you think you want to go. Happiness is the destination.", "url": "https://www.reddit.com/r/happy/comments/klddpw/embracing_mediocrity_and_the_decision_to_be_happy/", "title": "Embracing mediocrity and the decision to be happy above all else.", "social_network": "reddit", "user": "Grand_Pick8070", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1609109398, "permalink": "/r/happy/comments/klddpw/embracing_mediocrity_and_the_decision_to_be_happy/", "nsfw": false, "first_save": 1635438939.7126968, "replies_charged": false}