{"id": "t5_2qh5i_t3_px2bx", "request": ["a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "I really love this subreddit. I think it, along with a few others like /r/trees and /r/mylittlepony really represent a reaction and a reddit population fed up with being steeped in the misery, pain, and sarcasm that makes this place the enjoyable if hard boiled place to hang out. \n\nIt's with that in mind that I want to tell the story of the happiest a woman ever made me. We talk about \"forever alone\" and \"that chick was crazy\" and the aftermath of breakups disproportionately to the happiness that was requisite to make us feel that awful. This is an attempt to tip the scales, as a bard once said. \n\nI work for a fairly close-knit team in Silicon Valley. I grew up having enough luck with women, but the high school or college or just good old fashioned summer romance thing was a bit lost on me. Relationships were a little normalized, never loud or fast burning or tragic. That desire for drama maybe fueled me a bit. \n\nA friend of mine dated someone in the company and they became my friend in turn. Unfortunately (but not really, because I'm an alright person), I had to come to her aid a few times. They're relationship wasn't really working out. I was a shoulder, but I didn't really have designs. That didn't even really change when they broke up. \n\nWe were at an engagement party at a friend's house. It was successful, and I had plans to crash at the house afterwards. I like doing that because you get to see the embers of a good party, the wanderings out the door, the unlikely pairings and sure things coming to fruition. The half-drunk clean and clear, helping to tame the disaster that party house invariably becomes is my favorite time. It's quiet, but your ears are still ringing from a good time. It's calming. \n\nThat bringing leaves the dregs, the six of us, sitting at a table, chatting. To foot accidentally touches hers. \n\nHave you ever seen L'Amant (The Lover)? It's a 1992 movie that garnered some controversy because of the way the love scenes were shot (and with whom, and her age). It's not great, but it does have this one neat scene. The two main love interests are cold towards each other for the first little while. Then, they share a car together, and their hands touch (just barely) while resting on the bench seat of the vehicle. The ridiculous proportion of the subsequent dam burst...it's something to see (but not really worth watching). \n\nI take my foot off hers, my accidental foot, and she puts hers on top of mine. We lock eyes, but just for a second. \n\nI move to the couch and have a laydown, enjoying my drunk and trying to figure out what just happened. Some who remain go to bed, and we're down to three. The girl comes and sits down next to me on the floor. We coax the other to go to bed. \n\nI put my hand on her shoulder, and without missing a beat she puts her hand on mine. \n\nThis is a detail, and I think they get thought about but not talked about (again) in proportion to their significance. This thing was all about the details, and so this post will be. \n\nHer hand darts off mine as someone comes out of the bathroom, fieldcraft on a KGB level here. Our small touches sync with the opening and closing of doors in the house. A goodnight from the final person and the last door latch and a few things happen all at once. \n\nI put my hand around her neck, my fingers on the opposite side near her ear and pull her in for the deepest kiss I've ever had. One of the longest, and best. Girls sometime give this...savourous little moan in the throes of pleasure like this, and they drive men absolutely insane. They were present.  \n\nWe kiss and when we find time for a breath, she whispers, \"Do you want to spend the night in my bed\"? I thought she'd never ask. \n\nWe won't get into the details, but the details pile up in that room. \"I had been dreaming of this\", she said, and meant it in every sense. Her sudden excellent fashion sense? To get my attention. Her mock blushing over the fact I had now seen her naked. I didn't think I would ever stop smiling. \n\nShe made me breakfast, /r/happy. This seems insignificant, but...I was never forever alone. I was far from it. I've made a lot of breakfast. But nobody had ever made breakfast for me. Not even one. \n\nAnd it was the best night ever. \n\nOur little affair continued and my inbox for details runneth over. Spooning on the couch and watching The Sound of Music (that I had never seen). Having to pause it a bunch of times. Elaborate logistics to get to her house or my house after functions, trying to stay incognito. \n\nI've seen movies with girls, but none had ever burrowed into my at my side. None had trouble keeping their hands off me. None interrupted the movie for a kiss. \n\nI twitch awake from nightmares now and then, and I cannot describe the deep feeling of happiness and content to have someone catch you on the shoulder, bring you back down from an arrested position and kiss your shoulder, soothing whatever tased you awake. \n\nCamping in Utah and love-making in tents, drunk and happy. \n\nCrying together over the prospect that the baggage and circumstances might not let this work. \n\n\"I'm crazy about you\", I said. She said it back, not a second's hesitation. \n\nThe excuses to get close, the secret touches at work, being very interested in what each was doing. \n\nThese details go on and on and on, and there's more I won't share, ones I'll keep in a box and only think about when things are as bad as they can be. You can click the name of this throwaway to find out how it all ends, but I wouldn't. Stay here, happy with the details. \n\nDon't miss them. \n\n", "url": "https://www.reddit.com/r/happy/comments/px2bx/the_happiest_a_woman_has_ever_made_me_or_the/", "title": "The happiest a woman has ever made me, or, The story is in the details, keep your eyes open. ", "social_network": "reddit", "user": "aseriousmang", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 1, "down_vote": 0, "creation": 1329697376, "permalink": "/r/happy/comments/px2bx/the_happiest_a_woman_has_ever_made_me_or_the/", "nsfw": false, "first_save": 1635442258.1238573, "replies_charged": false}