{"id": "t5_2qh5i_t3_4zkojo", "request": ["cf382ebf-3ce7-40b7-a290-2028168701eb"], "text": "So maybe this is not the right sub to post this. I couldn't find where else to do this and i figured this was the most relevant. Also no one may read this or comment and thats alright. I just want to express and share my life changing experience. \n\nA few weeks ago i went backpacking, canoeing, and rockclimbing for 3 weeks along the AT trail. I dont want to get into details about the program, but basically i was with a group of people I've never met before that first day i went. Im only 16 btw for background info. \n\nWe hiked through the rain and the cold and injuries with maybe 35lb packs? During those 3 weeks i didn't have a phone or any type of electronic. Just what i had in my bag. I realized that while i was there i love nature. I love the outdoors and i love living simply. Theres something so beautiful about getting up in the morning, getting the essentials done, packing up camp, and setting off onto the trail to your next destination. I love nature so much and i appreciate all the small things so much more. Clean, dirt free water? A hot shower? Somewhere dry to sleep? A pillow? These are all things that most people take advantage of. As a society we don't have to worry if its gonna rain and if we're gonna be wet all night. We dont have to worry if theres gonna be a stream where we can get water. \n\nLiving out in the woods and in nature away from society is the best therapy there is. I've been dealing with depression for years. While out there i wasn't depressed one bit. I was thinking about how grateful i was that it was sunny that day or that we got to camp before dark. I wasn't thinking about how much my home life sucked or how i didnt get along with my parents or that my friends were moving away. There wasnt depression out there for me. Out there i was just me. \n\nDont get me wrong, i had breakdowns and i had my moments. But there wasnt a grey cloud hanging over me the entire time. I was truly happy. I think everyone should do something like this and go camping/backpacking for a few weeks at least once in their life. You have so much time to selfreflect and think about yourself. You have a clear head free from outside pressures. \n\nIm back home now and i cant wait until i graduate and can go do things like this on my own time. I found my outlets and i found things i love to do. Nature is so simple and beautiful. Everything in nature is beautiful and you should stop for a few minutes every day and appreciate that. \n\nIf anyone wants to know anything else about this experience or the program i did it with feel free to ask !!", "url": "https://www.reddit.com/r/happy/comments/4zkojo/these_past_few_weeks_have_been_the_best_of_my/", "title": "These past few weeks have been the best of my life and Ive never felt so true to myself !!", "social_network": "reddit", "user": "mamapanddaa", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1472157048, "permalink": "/r/happy/comments/4zkojo/these_past_few_weeks_have_been_the_best_of_my/", "nsfw": false, "first_save": 1635438913.9984522, "replies_charged": false}