{"id": "t5_2qh5i_t3_f3rrvp", "request": ["4161666b-4b17-4c22-bb40-42efca26f347"], "text": "I went from a constant complainer and blamer just a few years ago to being someone who always thinks about all the positives and joys in life. Even the bad times I take in a positive light because they serve to teach me something and make me stronger, more experienced and wiser. It's impacted me so much I decided to make a [video about it](https://youtu.be/WRNh3vpXIzo).\n\nGratitude is focusing on all the good things in life and being thankful for everything that brings us happiness. It is about developing a thankful appreciation for all of life's joy and abundance, instead of focusing on life's negative sides.\n\nThere are four main ways to develop gratitude:\n\n1. Mental Gratitude Exercises - Recount 3-5 good things that happened during the day, every night before bed. And remind yourself of all the good things that will be happening today, every morning.\n2. Gratitude Journal - Every time something good happens, write it in. Big all Small.\n3. Express gratitude openly and frequently - Express your gratitude for your friends, family and work to them directly. It will make them feel so respected and appreciated.\n4. Gratitude Meditation - (Passive) Be mindful of all your thoughts, feelings, sensations and emotions, and observe them through the lens of gratitude. (Active) Actively think positive thoughts, grateful thoughts, and be thankful for all of we have.\n\nBenefits of Gratitude: Strengthens friendships, Encourages humility, Reduces envy and jealousy, Increases fulfillment, Reduces selfishness, Improves physical and emotional wellbeing, Increases empathy, Strengthens self-esteem.\n\nMay we all develop a grateful mind and observe all the joy and beauty life has to offer. how to practice gratitude meditation.", "url": "https://www.reddit.com/r/happy/comments/f3rrvp/gratitude_has_changed_my_life_it_showed_me_that/", "title": "Gratitude has changed my life. It showed me that life will always have the good and the bad but with a grateful attitude, we can choose to focus on all the good things which make life so worthwhile and magical. Now I focus more on what I have instead of what I don't and it changed everything!", "social_network": "reddit", "user": "sickient", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1581684799, "permalink": "/r/happy/comments/f3rrvp/gratitude_has_changed_my_life_it_showed_me_that/", "nsfw": false, "first_save": 1635440978.591891, "replies_charged": false}