{"id": "t5_2qh5i_t3_oil4jq", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a", "2293bc08-7671-4d63-b63f-dbe4a3a4858a"], "text": "I've never really been hopeful for anything. And if I have been, it's never lasted for more than an hour. My expectations have always been at rock bottom to protect myself from disappointment. This has worked well for me, with minimal hurt from hoping too much.\n\nBut. I don't need to do that anymore. \n\nI don't necessarily know why, but since June, I've been looking forward to waking up every morning.\n\nActually, I know why. It's because the belief that I had to die to feel at peace has been proven wrong. Completely wrong. It's so reassuring to know it is possible to be happy and alive at the same time. \n\nFor the past few years, I've been wallowing in my depression. I feared death but at the same time craved it. So, as foolish as I was. I tried. Failed. And regretted backing out for about 8 months. Mainly because I was now on people's watchlist.\n\nI had a fear of pills for a while. Just the thought of them made my stomach twist and turn. I would constantly lay in bed, stay up late to wake up minutes before the bus.\n\nI was convinced that there was nothing left for me. \n\nSo I acted impulsively. If I was gonna go. I was going to go out with a bang. I fractured my hand. Had a scrap with my Bastard of a Parent. Attempted. Planned another. But at the same time, I desperately hung on. I didn't really want to die. No one really does. \n\nA close friend of mine dragged me out. I will always admire and appreciate her for having the patience to deal with me. She let me stay. And I've realized, her family is the polar opposite of mine. Calm and quiet majority of the times. Full of fun. Laughter. They don't raise hands or lace poison in their words.\n\nI didn't know that this was possible. For me to be happy for more than an hour. For me to be a part of a household where my contribution is appreciated and needed. Where my mental illness is not a myth. Where my feelings don't have to be locked away.\n\nI feel so validated and unconditionally loved.\n\nI want to start getting professional help. To better myself.\n\nI feel like with this. I can keep pushing forward. That I will keep standing up after falling down. No matter how many times that will be. I don't know why, but I feel happy to be here.", "url": "https://www.reddit.com/r/happy/comments/oil4jq/for_the_first_time_in_4_years_i_feel_hopeful_for/", "title": "For the first time in 4 years, I feel hopeful for what the future holds for me.", "social_network": "reddit", "user": "hmm_gm", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1626068908, "permalink": "/r/happy/comments/oil4jq/for_the_first_time_in_4_years_i_feel_hopeful_for/", "nsfw": false, "first_save": 1635439287.0493207, "replies_charged": false}