{"id": "t5_2qh5i_t3_vspgs", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "So, not sure if this will get read or not, but it's really important to me, so I figured I'd post it. My husband was driving me to my mom's house yesterday. We had a green light and were going straight, while the lanes in front of us at the intersection had a red light for people who were going straight and a yellow arrow for people who were turning. We, having a green arrow from the get-go, had no need to slow down, as everyone in the lanes in front of us had red/yield lights. We advanced into the intersection and out of nowhere, this woman in a van pulls out in front of us to make a left turn. She had to be going at least 60mph. We were going the speed limit, which was 50, I believe. Anyways, her car hit ours head-on and somehow managed to flip onto the driver's side (probably because she was turning so fast, I'd guess?). The airbags went off, and all I remember was feeling my back pop in what had to have been about 15-20 different places. I think I tried to scream, but I couldn't hear anything but metal cracking and bending and my ears ringing. My husband doesn't remember it, but  I think he tried to put his hand out in front of me so I wouldn't get banged up too badly from the airbag. The only reason I know is because his hand got cut up pretty badly and I had a handprint on my arm from it. There was another car involved, and the driver was an elderly deaf man. He said he had undergone 4 bypass surgeries, but had no other health problems he knew of. His worst injury was a minor abrasion on his cheek and some pain in his wrist. The lady in the car that flipped over had gotten herself out of her car after the firemen cut the hood off her car. All she complained of was a couple broken fingers and a little bit of pain in her ribs. I sat in the car for what seemed like an eternity. I cried like a baby for about two hours, then the people in the ambulance finally stabilized my heart rate and blood pressure (they said I was hyperventilating and in shock). I had to get x-rays taken of my back and neck, but they just gave me some pain killers and muscle relaxers. The main doctor told me I'd have some bruises and I'd be sore, but shit, if that's the worst, then I'm extremely thankful. \n\nTL;DR: Husband and I were in a three car wreck yesterday. Our car was totaled. The lady that hit us flipped her car, but got nout safely. The man in the third car was perfectly fine.\n\nEDIT: I'm really sorry about the huge block of text. I'm just really REALLY happy everyone involved is okay. I was so scared, I can't describe it. I don't get out much, so this was literally the worst experience I've ever had in my life. I just needed to kind of get this off my chest and write it down. Thanks for listening, Reddit. :)\n\n", "url": "https://www.reddit.com/r/happy/comments/vspgs/was_in_a_car_crash_yesterday_no_one_had_any/", "title": "Was in a car crash yesterday; no one had any serious injuries. :)", "social_network": "reddit", "user": "dmetridmetri93", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1340981878, "permalink": "/r/happy/comments/vspgs/was_in_a_car_crash_yesterday_no_one_had_any/", "nsfw": false, "first_save": 1635438853.5769176, "replies_charged": false}