{"id": "t5_2qh5i_t3_8fidhw", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "I had a stomach infection when very young that destroyed my intestines so badly that food would leak out of them and my body would attack itself thinking that the foods were an infection. I was 6’ tall (male) and 124lbs. I looked like a heroin Addict. I visited dozens of doctors that told me nothing could be done. They gave me cop-out diagnoses like “IBS” and gave up.  I avoided eating ANYTHING I was allergic to for 15 years while taking piles of expensive supplements, probiotics, and artificial stomach acids until my intestines healed and my immune system reset. Blood and stool allergy tests every year showed no improvement for the first 12 years or so, then they all started improving. Today for the first time it showed all clear except a couple weird things that don’t matter. I can eat REAL food. Like NORMAL people. I can go to a restaurant. It’s AMAZING.  \n\nAlso, \n1: Soylent came out a couple years ago and helped me gain 25lbs, so I don’t look anorexic anymore, that’s been nice. Not as nice as HAMBURGERS THOUGH!!!!! I highly recommend Soylent for nutritional shakes. \n\n2: Don’t bother with freakin American medical doctors. They really do just hand out pills. \nNaturopathic doctors solve problems. \n\nSorry for the long rant. It’s a very big day for me. ", "url": "https://www.reddit.com/r/happy/comments/8fidhw/spent_my_life_surviving_on_protein_shakes_and/", "title": "Spent my life surviving on protein shakes and vitamins due to major food allergies. Today the blood test said I’m over it. I ate a sandwich for the first time in 15 years and I’m not sick. I can’t believe how good it feels.", "social_network": "reddit", "user": "Jake-Bullet", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 136, "down_vote": 0, "creation": 1524899728, "permalink": "/r/happy/comments/8fidhw/spent_my_life_surviving_on_protein_shakes_and/", "nsfw": false, "first_save": 1635440702.9783888, "replies_charged": false}