{"id": "t5_2qh5i_t3_1ifims", "request": ["608fc108-cf44-476e-8378-c59ee7483909"], "text": "I just wanted to post this because I have never been so happy in my life. \n\nI was recently asked out by a guy who I had met online and he couldn't be more perfect. We had talked online two months ago and I deleted the account to the site. I had then come across him at my work and talked to him briefly there. I reactivated the account to find him and talk to him again. We exchanged numbers and texted each other for a day or two. Our first date consisted of him coming to an open mic that I had played at and he watched me play guitar with a couple of my friends. It was fantastic and I had never been able to talk so comfortably with someone before. \n\nHe is honestly the person who I would say is ideally for me and he has said the same about me - that I was exactly everything that he had been looking for in a person and that all of these \"coincidences\" (there have been a lot similar things regarding both of us and many other things) are a sign that we were meant to find each other. It sounds crazy and I think it is too, but it makes sense to me.\n\nAlso, I just got the job that I have been waiting for. It's only temporary but its definitely something that will help me in the future. It seems as if everything is falling into place. Next June I will be officially graduated with a Arts degree. Nothing could take away the happiness that I feel right now. My life is finally coming together the way that I'd like it to and I am excited for what the future has in store for me. I've learned to appreciate the present moment now as well which has just been incredible. \n\nI don't know.. things are great.", "url": "https://www.reddit.com/r/happy/comments/1ifims/i_have_honestly_found_the_person_who_i_have_been/", "title": "I have honestly found the person who I have been searching for my entire life and things are coming together quite nicely for me now. It's an amazing feeling.", "social_network": "reddit", "user": "xracquellyy", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 15, "down_vote": 0, "creation": 1374000255, "permalink": "/r/happy/comments/1ifims/i_have_honestly_found_the_person_who_i_have_been/", "nsfw": false, "first_save": 1635441498.1891441, "replies_charged": false}