{"id": "t5_2qh5i_t3_hnplb7", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a"], "text": "I felt happy. Really.\n\nI did not act the smile. Did not have to force it. It just came.\n\nWoke up in super bad mood - I wanted to cancel the day - but instead\n\n* Ate a breakfast (this is big for me!), and went to my therapist for a session\n* went out to the woods for a walk, and talked with my wage mother on the phone\n* Ate a lunch (also bit thing)\n* Went home, urge came to crossdress, but I did not feel like it, so I did not do it (I am really anxious about my sexuality), instead I read a book about an actor's life\n* On the way home, I bought groceries for my mum  \n(we have been fighting for the past year, and I was holding grudges)\n* Ate dinner, and played with the dod, then went out for a walk with her - watched the sky and the hills for a bit\n* On the way home, I listened to some Salsa music (Elio Revé Y Su Charangón), I even sang along \\*.\\*  \n(this is also big for me, since lately the depression took away the joy of music from me, and was slowly replacing with anxiety and unease. this was truly horrible, as before it music alway soothed my soul)\n* Came home, took a shower, currently drinking some herbal tea to calm myself.\n\nI was anxious about I not remembering how to be happy. How to feel happy.\n\nThis day has proven me wrong.\n\nToday I felt free. Today I won a skirmish against depression and anxiety.The war is far not over yet, but hell I needed this very much.", "url": "https://www.reddit.com/r/happy/comments/hnplb7/today_i_smiled_genuinely_after_nearly_2_years_of/", "title": "Today I smiled genuinely after nearly 2 years of worsening depression", "social_network": "reddit", "user": "HotPinkSomething", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 19, "down_vote": 0, "creation": 1594242434, "permalink": "/r/happy/comments/hnplb7/today_i_smiled_genuinely_after_nearly_2_years_of/", "nsfw": false, "first_save": 1635439333.739103, "replies_charged": false}