{"id": "t5_2qh5i_t3_1799yg", "request": ["a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "With a few boring parts omitted (for the record, my name isn't actually X):\n\nYou have learnt a great deal this year and been exposed to a number of new complex technologies and workflow process. It is great to see you embrace these challenges. I would like to see you begin documenting ideas of where you see additional opportunities for <company> with our customers.\n\nX, it’s clear that you have an aptitude for technology and this is where one of your greatest strength lie. Depending on the route you would like to take I very much see a good fit for you in the installation, configuration and support of the <company> suite of <software> applications. You would bring a great deal to this type of role and I encourage and support you in this, should your interest lay here. In 2013 I would like to see you challenged technically and see you develop your skill set. Great work. You are highly diligent in this objective and meet it with ease\n\nAgreed, it is a pleasure to have you as part of the <company> onsite team and you bring a great deal of knowledge and value to the customer. Being on a billable contract is important and staying in one an achievement. I look forward to you being part of the team for many years to come\n \nX, it is clear from the feedback I have received that you conduct yourself in a professional manner at all times and are committed to reaching the goals assigned to you. You are an excellent example to other <company> staff and our customer. Good work !\n \nOnce again you have shown your technical ability in delivering custom solutions to problems. The feedback you have received from Y and Z is significant as they have been working on similar workflows for some time and for you to come in and impress them to such an extent that it is clear that you have exceed this expectation. I would like you to take these technical skills further and build upon your Java skills and also begin to look at using Oracle as a datastore. Congratulations !!", "url": "https://www.reddit.com/r/happy/comments/1799yg/i_started_my_first_real_job_in_march_of_last_year/", "title": "I started my first \"real\" job in March of last year. Here's my first year-end review.", "social_network": "reddit", "user": "asdfman123", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 24, "down_vote": 0, "creation": 1359126624, "permalink": "/r/happy/comments/1799yg/i_started_my_first_real_job_in_march_of_last_year/", "nsfw": false, "first_save": 1635442247.5346344, "replies_charged": false}