{"id": "t5_2qh5i_t3_dpu76t", "request": ["d9021d56-8bfa-490f-87b8-52154c0b1b05"], "text": "Sorry for both the formatting (i’m on mobile) and putting this on possibly the wrong subreddit. I looked around for where else to put this, and this was the best place I could find. I made a reddit account just to post this. \n\nFor some backstory: I’m a massive agoraphobic with numerous diagnosed mental illnesses. I’ve become a regular Boo Radley of my small town. It’s rare I ever even leave the house, and when I do, i’m paranoid, shaky, and uncomfortable the whole way. I’d been having a tough past few weeks— a last-ditch treatment for my mental illnesses might not be accepted by my insurance (TMS therapy, it’s not fully FDA approved, only some treatments it has are), and i’d be spending this halloween essentially alone, with both parents working, no friends to celebrate with as my closest friend recently had been put in inpatient for a severe eating disorder, and my boyfriend lives states away.\n\nToday I ran out of body wash and regular hand soap. One of my mental illnesses is severe almost crippling OCD, with a cleanliness obsession. So you can imagine how badly I needed that soap, ergo why I left the house to begin with. The whole trip, i was trembling, almost in tears, my voice reduced to what could pass for a Disney princess (i’m a man, for reference.)\n\nOn the way home, I was super thirsty and needed to take my meds. Not wanting to go through another store and deal with all the stress that goes with that, I decided to settle on going through the drive thru of a Mcdonalds and order a large soda (way easier to cope with than going inside and ordering.) While I was waiting to pay, I was shaking, big time. Tears were already swelling in my eyes at the thought of talking to someone.\n\nWhen the lady asked for my money, the total was $1.08. I handed her two dollars, not wanting to make myself even more anxious scrounging around my car for a few cents. When I handed her the money, she smiled and waved it off, saying “Oh, I have a few cents here, I’ll spot you. Don’t worry about it.” And handed my dollar back.\n\nI was surprised to say the least. I never really experience people being nice to me who aren’t my family or friends, AKA biased people. But a stranger who never met me was willing to do something so seemingly small but relieving to me. I quietly thanked her, shaking as I took my dollar back. She said something along the lines of ‘No problem, sweety.’ I was really too shook to hear her fully, but I definitely caught the sweety part. I wanted to tip her so badly, but was too scared it’d be pointless or insulting given the nice thing she’d just did for me. That, and I had no clue just how to even say I wanted to tip her.\n\nThe way home i’ll admit I cried a little. It wasn’t a big deal, it was just eight cents, but it meant a lot to me. Someone was nice to me despite not even knowing me, and it made my day, no matter how minuscule the effect was on either of our lives.\n\nEvery small nice action you take, it effects someone. No matter how tiny. You never know what they’re going through and how much it can mean to them. So to the lady in the (too small of a town to name the exact restaurant for her privacy, so i’ll say, Vancouver WA as it’s the closest county) Mcdonalds that spared me eight cents, thank you.", "url": "https://www.reddit.com/r/happy/comments/dpu76t/why_every_small_nice_thing_you_do_means_something/", "title": "Why Every Small Nice Thing You Do Means Something. Thank You, Mcdonalds Lady, I Owe You Eight Cents", "social_network": "reddit", "user": "thoreauu", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 12, "down_vote": 0, "creation": 1572556996, "permalink": "/r/happy/comments/dpu76t/why_every_small_nice_thing_you_do_means_something/", "nsfw": false, "first_save": 1635442652.8880584, "replies_charged": false}