{"id": "t5_2qh5i_t3_69x8nk", "request": ["ba0d1102-e426-4cb2-aee0-676868a519e8", "a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "I don’t believe so much in finding oneself. A phrase people often throw around without too much thought. Everyone is the creator for their own self. Think about that for a second. \n\nTherefore it’s so important, as Golda Meir famously said ; “to create a self that you would be happy to live with for the rest of your life”. \nDon’t allow your happiness to be in the power of anyone except yourself. You are the God for yourself. GOD: Generator, Organiser and Destroyer. \n\nI am not religious and in some respects I envy people that are. Religion gives a feeling of being part of something much bigger. Not simply being alive on one tiny planet in an infinite space; for a minimal amount of time; struggling to find meaning in it all. \n\nWe are too distracted by our own egos to see that we are simply just a speck of dust in a vast desert. We think of ourselves as though we are the most important thing in the whole world.\n\nWe think it matters what car we drive, what brand of trainers we wear. Because we care so much about what other people think of us. When in fact those people are mostly thinking about themselves and what others think of them. It really is a crazy, viscous circle.\n\nWe crave community and making a difference to the world. Yet we focus on materialistic wants and desires that we think will make us happy. Yes they might give us short bursts of pleasure, but notice how quickly that wears off and we are back to wanting more. Pleasure does not equal genuine happiness and contentment.\n\nDid you know that 99% of our thoughts are negative? No wonder we are all so depressed and anxious. We only have one life and shouldn’t we try to get the most from it. We don’t get to have another go at it if we make a mess of this one. This is it. The time is now.\n\nLike when people who are not yet 60 say how they are too old to do anything, like study or go travelling or even to go for a long walk. What does that even mean? The average life expectancy in the UK is 80 years old. So that’s a quarter of your life you are basically wasting, just waiting to die. Madness!\n\nAny situation depends on your reaction. What I mean is, our thought patterns are not out of our control. We decide if something makes us feel pissed off, upset, confused. We decide whether to be lazy, selfish, bored. We can choose to be more positive. Sure it takes practise and patience but it will make a huge difference to our happiness and wellbeing. Or you could just take the easy option and give up before you even try.\n\nYou cannot achieve anything in your life without doing action. When you put 100% effort, focus, concentration, dedication and devotion with good intention, you will receive good karma. It’s a sad world when we don’t do something we enjoy because we think that unless we are the best person in the world at it then there is no point. Yes there is a point, the simple fact that you enjoy doing it. Also how can you improve if you never even try.\n\nDon’t focus on results, just keep doing. Once you start something, finish it. If you won’t practise, how will you find your mistakes? Humans learn by mistakes, ours and others. \n\nBelieve in yourself, never doubt. Know that there is something inside you that is greater than any obstacle. If it’s important to you, you will find a way. If not, you will find an excuse.\n\n“Enthusiasm is the secret and harmonious spirit which hovers over the production of genius” : Isaac D’Israili\n\nGo enjoy your life!", "url": "https://www.reddit.com/r/happy/comments/69x8nk/take_action_for_a_happier_future/", "title": "Take Action For A Happier Future", "social_network": "reddit", "user": "Jessaloua", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 2, "down_vote": 0, "creation": 1494238599, "permalink": "/r/happy/comments/69x8nk/take_action_for_a_happier_future/", "nsfw": false, "first_save": 1635441421.0622325, "replies_charged": false}