{"id": "t5_2qh5i_t3_18rtau", "request": ["13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "I had a terrible weekend... I tried to be productive, but I got so little done. Last night, I couldn't sleep, and ended up getting less than two hours. \n\nI woke up, couldn't get my assignment printed because the university print shop apparently doesn't open until 9, and I had to be at my TAship by then. As soon as I got to my TA class, I was told by my colleague that a quartet (we're music composition majors) that I thought was due at the end of the day was due at 9:00 (so, I was already late). At the end of class, we all met in the professor's office and I raised my voice (not quite a yell, but considering how soft spoken I tend to be it was surprising) at my colleague (for no good reason other than me being on edge). \n\n\nAfter we left the office, I ran up to my colleague and apologized, told him that I was frustrated and that I shouldn't have gotten mad. I told him my frustrations with the printing, and he suggested a place just across the street. I went over there, got my printing stuff done and turned in (even though it was late, the professor was fine) and even applied for a job at the printing place (I am constantly printing stuff as a composition major, and I've been looking for a job so I hope that it works out!). As soon as I got the score turned in, I check my email and found that I won a composition contest and I am getting a piece performed in New York! \n\nI am now sitting at home drinking coffee from my Bialleti for caffeine and getting shit done. \n\n**TL;DR** My day went from shit to awesome. ", "url": "https://www.reddit.com/r/happy/comments/18rtau/i_went_from_having_a_terrible_day_to_a_great_day/", "title": "I went from having a terrible day to a great day in 10 minutes!", "social_network": "reddit", "user": "--Petrichor--", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 10, "down_vote": 0, "creation": 1361220808, "permalink": "/r/happy/comments/18rtau/i_went_from_having_a_terrible_day_to_a_great_day/", "nsfw": false, "first_save": 1635442933.5700293, "replies_charged": false}