{"id": "t5_2qh5i_t3_bcmsa2", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb"], "text": "I recently visited someone who I thought could be a possible friend.\n\nThe hangout was pretty bad.\n\n&#x200B;\n\n\\[can skip if don't wan't details\\]\n\n>^(I'm very isolated and alone. I'm working on it, and my current challenge is that I tend to stick around longer with certain individuals most people would definitely leave after being around very shortly. I wrongly think I'm the one who has to \"suck it up\". Regardless of their lack of interest in me, their bad habits, rudeness, invalidation and putting down, or unhealthiness. As a result, I have a lot of rage -- that I try VERY hard to, but rarely channel into healthy assertive action. But this person was pretty supportive and thoughtful in a past specific environment so I agreed to meet them after a couple years. They changed.)  \n>  \n>^(Most times when I tried to speak, they replied with a completely different topic, one about themselves in long stories without stopping much for me to join in. The only times I could even make a sound was when the person stopped to drink or look at their phone. I'd often begin to speak, but they'd bulldoze through without hearing me. I very audibly asked happy, lighthearted questions to propel balanced conversations, and they often didn't even respond. Like literal SILENCE after being asked a conversational question. Sometimes while looking at their phone, sometimes acting as if they didn't even hear me, but I was within 2 feet of them the whole time, and every place we walked or sat was quiet. This kept happening. At this point, I was just trying to forgive.)  \n>  \n>^(Later, they started asking me a lot of way too personal questions involving finance, where I get my money, and word for word said: \"do you use your mom's credit card for everything?\" Later, the person kept repeating over and over that \"we should start a creative business together\", mentioning they don't know how to use a computer, do art, or create anything, but they know how to do \"everything else\". Then, they kept saying I should either move to their place and help them clean their apartment and work on everything, like portfolios, job, entire life,) ^(together. They kept mentioning they could move to my place as well. Kept saying we don't have to, but \"you should sleep over at my place, I could sleep over at yours, sometimes we could hang out for a whole two days\". That's when I really understood the person is overstepping standard boundaries.)  \n>  \n> ^(This is the first time we saw each other in 2 years. This is not a date. We're the same gender and not interested in each other. The person is 37 years old.)  \n>  \n>^(And I said \"OK\" to everything as the person blurted everything out so fast, just out of bewilderment. In the end... I thanked them for hanging out with me. We both expressed we'd meet again.)\n\n&#x200B;\n\nI felt invisible, silent, and pretty insulted by the credit card thing.\n\nAll those inner pep talks to say \"no\" on the spot were blown by me.\n\nBut yesterday, I decided to put my foot down. Instead of letting go with ambiguous silence, I tried something new.\n\n&#x200B;\n\nI utilized my anger and gave them a piece of my mind by texting them in a controlled manner exactly how they were inappropriate, explained how I felt, told them I am moving on for me, said I'm also letting them know so they know what happened between us, and then I wished them well. I set up online and offline boundaries and they cannot contact me again.\n\nIt's true that I could've not done anything.\n\nBut I need to start somewhere. This would be the starter for getting used to speaking up on the spot, which is my ultimate goal.\n\nOne time speaking up and distancing is not gonna hurt anyone.\n\nSo I felt happy.", "url": "https://www.reddit.com/r/happy/comments/bcmsa2/i_set_a_healthy_boundary_with_a_disrespectful/", "title": "I Set A Healthy Boundary With A Disrespectful Acquaintance.", "social_network": "reddit", "user": "ulj1Ivh", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1555128688, "permalink": "/r/happy/comments/bcmsa2/i_set_a_healthy_boundary_with_a_disrespectful/", "nsfw": false, "first_save": 1635438954.7615356, "replies_charged": false}