{"id": "t5_2qh5i_t3_aup6ob", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "I was casually checking my email at a friend's house when I saw the email. I cried, and asked my friend \"IS THIS WHAT I THINK IT IS? Read this email! Am I reading it right?!?!?\" until I understood that it was in fact, very real. I promptly got very drunk with friends and sent several all caps text messages notifying people who had helped review my essays and gave me encouraging words throughout the process. This is all I've wanted for the past 10 years, and spurred on by my need for real growth and skills beyond my current job. I just submitted my deposit for enrollment and set up my official university email today :)\n\nThe past few months while putting together my application have been so complicated and hard: I contracted **whooping cough** in November (*because it's 1902? so annoying*), moved suddenly in the middle of December from a second floor walk up, while changing thyroid medications because the first one made me sicker, all of which was happening while trying to study for the GRE and write my application.\n\nMy favorite phone call to make was probably to my former professor.  He knew I didn't have anyone else to mentor me in this process and reviewed my essays and wrote me a very long (according to him) letter of recommendation. He then offered any assistance in getting situated or class selection strategy \"even though you'll have advisers to help you going forward, I'm still here if you need me\". I don't know if I've ever felt so supported.\n\nI hope I never forget this feeling.", "url": "https://www.reddit.com/r/happy/comments/aup6ob/i_got_into_grad_school_after_i_received_my/", "title": "I GOT INTO GRAD SCHOOL! After I received my acceptance email this weekend to my first choice school, I got to call my former professor that took me under his wing and gave him the good news.", "social_network": "reddit", "user": "CranesImprobableView", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 33, "down_vote": 0, "creation": 1551122882, "permalink": "/r/happy/comments/aup6ob/i_got_into_grad_school_after_i_received_my/", "nsfw": false, "first_save": 1635442872.40024, "replies_charged": false}