{"id": "t5_2qh5i_t3_qbgfc0", "request": ["db00040a-8e0a-460b-8461-1663433c39fb", "4ac40434-7819-4123-ba6e-67be5bf90ee7", "d2bf8290-ea9d-4601-bf64-8bb709730ec1"], "text": "(First and foremost, I'm not here to promote anything, I will not be giving the handle out to anyone, even if asked, just so that we're clear. I only want to share the joyful and sentimental feelings I'm currently in right now.)\n\nMy puppies have their own TikTok page and have \nbeen a part of Tik Tok since they were 5 weeks old. They were the tiniest beans we've had. I look through their old videos from time to time and was doing so today. I ended up on one of their last videos and it was a video of them first as 5 week old puppies and then as they look today, at 10 months. The song was \"night changes\" by One Direction. While I was listening to that song, I cried, thinking about how much the three of us have been through together, how much time I put into their needs and the moments where I'd hold their tiny bodies in my arms and they'd fall asleep.\n\n There's a part in the song that says, \"We're only  getting older baby, and I've been thinking about it lately, does it ever drive you crazy, just how fast the night changes?\" And it makes me think about how quickly they grew up and how little time I unknowingly had to hold them in my arms. It doesn't make me sad, not one bit, but I do wish I had more tome to hold them, even though I was doing it a lot already. It'll always be my favorite memory with them. I love my puppies so much and wouldn't trade them for the world.", "url": "https://www.reddit.com/r/happy/comments/qbgfc0/im_happy_crying_over_my_puppies_right_now/", "title": "I'm happy crying over my puppies right now", "social_network": "reddit", "user": "1BoiledCabbage", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1634664624, "permalink": "/r/happy/comments/qbgfc0/im_happy_crying_over_my_puppies_right_now/", "nsfw": false, "first_save": 1635441411.6638963, "replies_charged": false}