{"id": "t5_2qh5i_t3_5nomgr", "request": ["ea4a7795-7887-476a-9ab2-4c77d117a852"], "text": "I am a college student, and over this past summer, I got the chance to study abroad in Italy for four weeks (one in Venice, three in Rome with weekend trips in between). \n\nMy art teacher recommended that everyone keep journals for the trip. Now, this was not my first rodeo abroad, and every other time I had also tried to journal my trip but ended up falling off the bandwagon. This time, however, I was determined. \n\nI did really well – far better than I thought! It helped that my friends on the trip were also all journaling, and we helped each other stay on track. I saved every scrap of paper that came my way: receipts, ticket stubs, postcards, prayer cards, even wine labels. I poured my heart and soul into the journal, and I was REALLY proud of myself for actually sticking with my plan to chronicle my adventures. \n\nThen my typical absentmindedness and general lack of organization kicked in. \n\nThe whole class was traveling via coach bus to visit Florence, Siena and Assisi over my last weekend. Somewhere between staying in a hotel in Florence and traversing the country in the bus, my journal disappeared. I just couldn't find it. \n\nI contacted the bus company, the hotel in Florence, and the university that had served as home in Rome. I had to leave the country on Monday, but some of my peers were staying for a few more weeks. I asked them to keep an eye out for me, and bring the journal back to the States if they found it. \n\nUnfortunately, all of the searching was in vain. My friends came back to the US journal-less and I had to come to terms with the fact that my travel journal really was lost. Needless to say, there were quite a few tears spread. I have a terrible memory, and this journal would help me recall the trip for the rest of my life. It broke my heart that it was gone. \n\nFast forward seven months from June 8 to January 12. My boyfriend came into the house and tossed a book-shaped package into my lap. I wasn't expecting anything, and we were both curious to see what was inside. \n\nImagine my surprise and delight to find my journal, fully in tact and a note from its rescuer. I cried tears of joy. I had long given up on my journal, thinking that it was incinerated in a dump somewhere or read by bored Italians who laughed at my ramblings. \n\nThis was the best start to the New Year that I ever could ask for, and I owe ten million thank you's to the kind man who took the time to track me down and pay the ridiculous amount for postage in order to[My journal came back!](http://imgur.com/rmXnxsF) return my journal!!\n\ntl;dr - a kind tour guide in Rome found my travel journal and sent it to me, after seven months of me believing it was gone forever. ", "url": "https://www.reddit.com/r/happy/comments/5nomgr/after_7_months_lost_abroad_my_travel_journal_came/", "title": "After 7 months lost abroad, my travel journal came back!", "social_network": "reddit", "user": "ladypooffin", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1484283362, "permalink": "/r/happy/comments/5nomgr/after_7_months_lost_abroad_my_travel_journal_came/", "nsfw": false, "first_save": 1635440226.9656162, "replies_charged": false}