{"id": "t5_2qh5i_t3_1i57jv", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "She developed a [germ cell tumour](http://en.wikipedia.org/wiki/Germ_cell_tumor) when she was 9 years old.  It came right out of the blue- we thought that she had stomach flu, and took her to the ER for rehydation.  They kept her overnight, and then had some weird results on bloodwork (mainly pregnancy hormones), and when the pediatrician came to see her the next morning the tumour had popped out of wherever it was hiding and she looked about 5 months pregnant.  She had an immediate ultrasound, and although the tech wouldn't say anything, it was pretty easy to see that there were 3 things there that shouldn't be (one large tumour, one very large ovary, and one lymph node). \n\nWe got immediately transferred to an excellent pediatric oncology centre, but because she was so small, and the tumour was so large (it eventually turned out to be the size of a dinner plate), none of the CT scans etc were giving a clear picture of what was going to be involved.  They couldn't do surgery for 3 weeks as they had to stabilize her, but the assumption was that it was likely advanced ovarian cancer, with the strong underlying message that we should probably be starting to think about end-of-life care. \n\nThe surgery was the best day of my life :-)  The surgeon came racing out of the OR, and I've rarely seen a happier man.  They took out the tumour, one ovary/fallopian tube, and one lymph node, and he was very confident that he'd gotten it all, and that she'd be fine.  A few months of chemo, and some recovery time, and she's really never looked back. \n\nNow all that we have to do is have a yearly 'aftercare' checkup, and yearly nephrology and pulmonary checkups to look for long-term effects of her chemo. So far she's great, and given that it was a germ cell tumour, there's very little chance of a recurrence. \n\nBut I still panic a bit before every checkup, so every time we get the all-clear I just want to have a party :-) \n\n\n\n", "url": "https://www.reddit.com/r/happy/comments/1i57jv/my_daughter_had_her_yearly_postcancer_checkup/", "title": "My daughter had her yearly post-cancer checkup yesterday, and she's now 8 years cancer-free", "social_network": "reddit", "user": "kimmature", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 643, "down_vote": 0, "creation": 1373622931, "permalink": "/r/happy/comments/1i57jv/my_daughter_had_her_yearly_postcancer_checkup/", "nsfw": false, "first_save": 1635438835.1530516, "replies_charged": false}