{"id": "t5_2qh5i_t3_jpdnjk", "request": ["258e332d-215f-495f-8bee-bccd57229f62", "4311bf71-6ec2-4c3b-aa15-1f9a3223e07b"], "text": "I have always been somewhat disillusioned about how much my vote matters, considering how there are 300 million people in this country. But, at the encouragement of a very close friend of mine who I look up to very much, I decided to register as a voter in Georgia around a month ago.\n\nHowever, I figured that my voter ID wouldn't arrive in time for the election, and I had no other form of Georgia ID because I am not originally from Georgia- just here for university- so I decided to get a learner's permit as a foolproof way of ensuring that I would have a Georgia ID on me. I didn't want to use a provisional ballot as those can be messed with, especially considering levels of voter suppression for this election. \n\nAs predicted, my voter ID indeed did not come in time for the election, so I used my brand new learner's permit instead on Election Day. I put my ballot in the ballot counting machine, and watched as the number of counted ballots rose: 96 to 97. Then I left, assuming that 'oh well, I've done my civic duty, I'm sure there will be larger than a 1-2% margin anyway'.\n\nExcept Georgia ended up being one of the most nail-biting battleground states; as I'm writing this, Trump and Biden are only around a thousand votes apart. And one of those thousand votes that made the difference is mine! This experience has really inspired me to be more involved civically: I have seen for myself that, yes, my vote really CAN matter! It's a great feeling to think that my actions, in some small way, genuinely have influenced the future of this nation.", "url": "https://www.reddit.com/r/happy/comments/jpdnjk/as_a_college_student_i_voted_for_the_first_time/", "title": "As a college student, I voted for the first time in the presidential election a few days ago in Georgia.", "social_network": "reddit", "user": "navyrook", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 35, "down_vote": 0, "creation": 1604697405, "permalink": "/r/happy/comments/jpdnjk/as_a_college_student_i_voted_for_the_first_time/", "nsfw": false, "first_save": 1635440697.4964702, "replies_charged": false}