{"id": "t5_2qh5i_t3_i75rrx", "request": ["ec625709-7f64-46c7-8416-e278a4a2b110", "0344ec6b-2528-4c06-8dba-4c3095c02293"], "text": "I have always worked even having part time jobs from the age of 11. I'm 38 now and on the 17th of July I got made redundant. In the current climate and due to my rural location jobs are scarce. There was literally only two within 10 miles in the industry I work in that would suit my skillset. Not going to lie although my husband is still in work and earns enough to support us and the children if we limited our lifestyle and didn't help my mother out as much, but I was really panicking. Then our boiler broke and we had to pay for a new one and my son's school said that they would be using iPads in September to limit contact that parents needed to purchase. I haven't been sleeping and I hated not being the career woman that I always have been and to be honest having being on Furlough since May felt that I was losing myself as a person. I love my teenage children and have enjoyed spending this time with them but I felt isolated from adults. \n\nI got interviews for both jobs and then didn't hear anything for two weeks, there was nothing else going and I hated the thought of being totally alone once the children go back to school in September. Well today I got a phone call for the job I really wanted and they offered it to me, I start Monday! An hour later the other job called and offered to me which I turned down. It is such a relief, I know so many people have it worse than our family and that I am so lucky. Just wanted to spread a little joy, I feel that a massive weight has been lifted off us and that I can relax for the first time in months.", "url": "https://www.reddit.com/r/happy/comments/i75rrx/today_my_luck_changed_and_im_feeling_positive/", "title": "Today my luck changed and I'm feeling positive about the future.", "social_network": "reddit", "user": "Jella18", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1597069541, "permalink": "/r/happy/comments/i75rrx/today_my_luck_changed_and_im_feeling_positive/", "nsfw": false, "first_save": 1635441844.7818372, "replies_charged": false}