{"id": "t5_2qh5i_t3_paf49b", "request": ["e660e09a-842d-44ca-8826-ddfa61319574", "e78e5c86-dbf1-4ab8-a98c-e9d544934b7c", "f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "This afternoon my boyfriend (17M) and I (17F) found out we would be on our schools homecoming court, and it felt so surreal! I had to keep looking at the announcement post over and over to make sure I wasn’t dreaming! For some context, we’re both seniors and were one of four couples most voted out of around 12+ couples! It makes me really happy, because I’m a shy, mostly introverted kid, and I have a lot of social anxiety, and it’s just really good to have a sort of…validation from my peers, you know? Although I also owe a lot of it to my boyfriend, he’s really outgoing and charming, I don’t think I could’ve ever gained the confidence to do this without him! I’m super excited for the homecoming game now, I’m determined to make my senior year the best yet!\n\nIt’s funny too, we were supposed to find out who was on the court last Friday, but due to technical issues (they left one of the couples off the ballot) and ties (apparently four couples tied for second place! Isn’t that crazy?!) we had to revote today! I was anxious my entire class after voting, but it felt so good to see our names there!\n\nIf you don’t mind me getting mushy, I really appreciate my boyfriend a lot and am so excited to get to do this with him. We both had really bad previous relationships, and it was something we bonded over. He treats me so well, he likes to show me off, is always loving to me, and I can tell him anything! I can’t express just how much I appreciate him, because I really do. He even bought me a froggy bucket hat that he gave me earlier today! Honestly, my day has just been really amazing, and I hope yours is too!", "url": "https://www.reddit.com/r/happy/comments/paf49b/my_boyfriend_and_i_are_on_homecoming_court/", "title": "My boyfriend and I are on homecoming court!!", "social_network": "reddit", "user": "Skibbsies", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 61, "down_vote": 0, "creation": 1629774767, "permalink": "/r/happy/comments/paf49b/my_boyfriend_and_i_are_on_homecoming_court/", "nsfw": false, "first_save": 1635439374.0851588, "replies_charged": false}