{"id": "t5_2qh5i_t3_anbxc7", "request": ["3fa9d278-6200-4503-908d-5c456f8aa87c", "a8d9fccd-13d1-43e0-bbac-4d4282b21bb6", "a0e8eae7-000b-41d9-95ab-e3fc3447f7db"], "text": "I've been dating this guy for a couple of months now and he's honestly the best person I've ever had the pleasure of knowing. We were friends before dating and I'm so happy we took a chance. He is so funny and so kind to everyone he sees including strangers, and even those that are not the nicest. He has such a positive outlook on life and he always pushed me to want to be better and look for the bright side in things. He's been such radiant beam of light and I'm so glad we found each other. \n\n\nHe's honestly made me a better person and he inspires me every day. I love who I am around him and I love how he makes me feel. I want to see him happy and watch and help him achieve his goals and strive to be the best person he can be. He's my best friend and he deserves it. \n\nAnd I'm so proud of myself because I didn't settle for anyone. My last ex was definitely not right for me and I'm glad I did find the right person for me. He was out of my league and I realize now that's not true. I deserve the best. I've worked so hard on improving myself and even though I'm not perfect, he loves me even though sometimes I don't love myself. He's helped me accept my flaws and helps me improve. I'm so lucky to have such a wonderful human being in my life and I am so proud of him for who he's become. I'm sorry for rambling so much, I've just been so happy and excited I had to tell someone.", "url": "https://www.reddit.com/r/happy/comments/anbxc7/im_so_happy_that_i_found_someone_that_loves_me/", "title": "I'm so happy that I found someone that loves me for me and makes me the happiest gal in the world", "social_network": "reddit", "user": "Firefox8D", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1549352763, "permalink": "/r/happy/comments/anbxc7/im_so_happy_that_i_found_someone_that_loves_me/", "nsfw": false, "first_save": 1635438996.7421288, "replies_charged": false}