{"id": "t5_2qh5i_t3_copq3g", "request": ["4311bf71-6ec2-4c3b-aa15-1f9a3223e07b"], "text": "We met three years ago. I was a cook/food runner at a local bar she and her friends would go to often. We also went to the same university just up the road. I'll never forget on the first date we had how nervous she was not just because it was a date, but because she was still trying to master English. Almost the whole date consisted of \"Huh?\" and \"What?\" from both of our ends lol. But whenever she managed to make a clear sentence, she actually was pretty funny and was 10x smarter than me. We started going steady soon after and graduated together and got our own apartment soon after. There hasn't been a day I wasn't happy to see her. \n\nAs for the ring, my older brother does blacksmithing as a hobby and is a welder by profession. When I originally came to him about the ring, he was hesitant because he had never actually made a ring before. But we worked something out and a few weeks later, he presented me with a beautiful silver colored titanium engagement ring that actually left me stunned at how pretty it was. On the inside of it, I had him write \"I love you\" in her Icelandic language. \n\nThis morning, I got up early and made her favorite breakfast: Chocolate chip pancakes with bananas and skyr (which is basically yogurt and cheese mixed together). I was so ancy because I just wanted to give her the ring and know her answer lol. I tell her to close her eyes and I put it in her hands and she almost screams in shock. Then, through her tears of joy, she just nods her head and I breathe the biggest sigh of relief before sliding that puppy right on her finger. It fit perfectly. I think she cried even more when she saw the \"I love you\" on the inside. But wait there's more! \n\nI took out my guitar and played [1, 2, 3, 4](https://youtu.be/m6pW_q1PvH0) by the Plain White T's for her. I first learned of this song when we visited my other brother in Chicago and they just happened to be playing a small concert nearby. And when I heard that song, I just kept it in the back of my head. I won't get into how much my singing voice sucks but I think she tolerated it for a little bit lol. \n\nSo anyway, I'd say it's been an eventful day. I also booked us dinner at a fancy restaurant in town (she hates but doesn't hate when I go all out for her). I hope your day was as good as mine! :)", "url": "https://www.reddit.com/r/happy/comments/copq3g/i_made_breakfast_in_bed_for_my_girlfriend_this/", "title": "I made breakfast in bed for my girlfriend this morning for her birthday and then surprised her after she finished with an engagement ring I had my brother make for her that says \"I love you\" in her native Icelandic. She said yes!", "social_network": "reddit", "user": "IntriguedParsley", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 111, "down_vote": 0, "creation": 1565481847, "permalink": "/r/happy/comments/copq3g/i_made_breakfast_in_bed_for_my_girlfriend_this/", "nsfw": false, "first_save": 1635442063.1438, "replies_charged": false}