{"id": "t5_2qh5i_t3_6a9yzn", "request": ["ea4a7795-7887-476a-9ab2-4c77d117a852"], "text": "Sorry for the wall of text. I'm writing this because I am so happy about our new dog. So my wife and I have had a lovely border collie/lab/german shepherd mix named Milo for 11 years. He's our baby and we love him dearly. We've talked about getting another dog for years and we have always been hesitant because Milo is very protective of the house and can be a bit aggressive with other dogs when they come in. Plus I travel for work and we were worried about the costs and all that stuff. \n\nWe both follow a rescue organization called Save Our Scruff on IG and there was a dog that we both noticed. My wife typically spams me with rescues telling me how cute they are and this was the first time I sent one to her. So we decided to apply and we were accepted. We met Trufa (Truffle in Spanish) with her foster parents and she was delightful. We agreed she was the one for us and adopted her in early February. \n\nIt was such a great decision for us. She has become part of our family so quickly. My wife I and used to talk about how if Milo and Trufa snuggled together we would be so happy. Well they do it all the time now.  Trufa is also so happy and calm and goofy that it has made all of us happier. My wife and I have a new little girl, Milo has a little sister and Trufa has a forever home. \n\nTL,DR - adopted a second dog, hoped they would get along. New dog is amazing. Dog snuggles happening regularly.\n\nhttps://instagram.com/p/BS6A5YWg776/", "url": "https://www.reddit.com/r/happy/comments/6a9yzn/we_adopted_a_rescue_dog_from_mexico_as_a_second/", "title": "We adopted a rescue dog from Mexico as a second dog and it's been wonderful!", "social_network": "reddit", "user": "Mako_Milo", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 5, "down_vote": 0, "creation": 1494381934, "permalink": "/r/happy/comments/6a9yzn/we_adopted_a_rescue_dog_from_mexico_as_a_second/", "nsfw": false, "first_save": 1635440227.3723814, "replies_charged": false}