{"id": "t5_2qh5i_t3_4zrlq5", "request": ["13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "When I look at you, I see a striking figure. Tall, graceful legs reach up to complement long, flowing hair that falls down to a full and luscious bust. I see beautiful, almond-shaped eyes that hold my gaze so comfortably, so directly. I see the soft lips that split around a broad, all-encompassing smile that never fails to lift my spirits. I see the long arms that you wrap around me so tightly, and which we wrestle with when playing ‘find the perfect finger formation’ on the bus to Uni.\n\nI see the individual piercings, each placed by careful design to accentuate perhaps the most expressive face I’ve ever known. You laugh, cry out, scream, scowl, gasp, chuckle, frown, smile, and all the rest so honestly, so openly.  I see a face that I know is telling me the truth.\n\nI see your scars, a constituent part of who you are. I see a hallmark of who you were and what you changed to bring yourself to your current lifestyle. At first, I was a little apprehensive, but I came to realise that this was one part out of many that make you up. Moreover, that I would not ever want to remove anything, however relevant to present life it may or may not be, that played a part in making you who you are.\n\nI see someone who embodies their joie de vivre. The sudden sprint to rush-hug a friend. Your arms slowly encircling me from behind when I’m agonising in front of a screen and need consolation. The careful application of nail polish to slender, graceful hands covered in rings that all have stories.\n\nI have never been embarrassed of you, I have never been ashamed of you. I am ashamed of how little I appreciated the simple act of a compliment.\n\nTo me, your body is comfort. It is tenderness. It is the, well, embodiment of all that you mean to me. The piercing eyes that look for my roving pupils when you call me out on my bullshit. The soft hands gently reaching over my chest to pull me tight and be my jetpack. The breasts and legs that scream “WOMAN”, and the face that screams (metaphorically, thankfully, although God knows you’ve had the right sometimes) “COMPANION.”\n\nWe all have things about ourselves we don’t like. Shit, I’m no Daniel Craig. But there are so many things about you that I do like, about your body and how you inhabit it around me. I want to keep it that way, and anything I can do to keep me around your body and the mind living inside it I will try.\n", "url": "https://www.reddit.com/r/happy/comments/4zrlq5/im_recovering_from_an_eating_disorder_my/", "title": "I'm recovering from an eating disorder. My boyfriend wrote me this letter to show me how HE sees me.", "social_network": "reddit", "user": "colonel_avocado", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 17, "down_vote": 0, "creation": 1472255002, "permalink": "/r/happy/comments/4zrlq5/im_recovering_from_an_eating_disorder_my/", "nsfw": false, "first_save": 1635442931.230682, "replies_charged": false}