{"id": "t5_2qh5i_t3_puw9zo", "request": ["e78e5c86-dbf1-4ab8-a98c-e9d544934b7c", "f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "I’ve been practicing yoga for almost 8 years now and it has become my life’s passion. \n\nI started practicing to straighten my posture (which had become crooked after an operation on both feet (age 14) and a lack of physiotherapy that left my in the obligation to learn how to walk again, on my own.) This has been a great challenge both mentally and physically.\n\nOnce I became an adult and completed my yoga teacher training, I worked relentlessly for about 3 years to start a business. All I wanted to do was help people and the planet and was so eager to contribute. \n(I had problems with self confidence and public speaking my whole life. It was a huge challenge for me to talk in front of people.)\n\nLast summer, I got a contract with the city I currently live in, to teach 12 yoga classes for the upcoming autumn session. I was so happy and excited but also stressed out! \nAt some points I thought my head would explode because of the stress but I remembered everything that yoga is and managed to get through it. \n\nLast Tuesday, I taught a group class (14 students) and it went amazingly well! The students gave good reviews and seemed to have really enjoyed it! \nThe person that hired me said that she had to stop the registrations because there was too many people that wanted to take the classes! She told me my contract would be renewed for the winter session and that there would be two classes a week instead of one! \n\nI’m on a cloud right now to think that my career is really taking off and that I’ll be able to share yoga with the world! \n\nThank you for reading! \n\nTL;DR : Spent years working on myself and my yoga business. Got a contract with my city to teach 12 classes (once a week) in autumn and just learned the contract will be renewed and upgraded (two classes a week for winter session)! Yay!", "url": "https://www.reddit.com/r/happy/comments/puw9zo/taught_my_first_yoga_group_class_and_the_students/", "title": "Taught my first yoga group class and the students loved it!", "social_network": "reddit", "user": "Peace4Every1", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 15, "down_vote": 0, "creation": 1632530993, "permalink": "/r/happy/comments/puw9zo/taught_my_first_yoga_group_class_and_the_students/", "nsfw": false, "first_save": 1635443170.8620524, "replies_charged": false}