{"id": "t5_2qh5i_t3_cyfdzy", "request": ["89f969a3-3a22-4eff-8a40-d1d5b9658c57", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "I'm running on a euphoria right now, so please don't mind my gushing. \n\nQuick backstory: in a relationship that saved my life, then it fizzled out quickly. \n\n4 years ago, I met this girl, swore that she was perfect for me, she took care of me when I was unable to take care of myself for a time, something my family got quiet on helping, then she changed when her family life fell apart. I kept improving, her own life led her away from me.\n\nThe breakup left me as a shell, didn't know whether I would want to move on or if there was anything to pursue.  Then, I started changing again, my skills improved for my hobbies (Check my history for that) and I started some online profiles for giggles.\n\nI didn't pay at the time, but my phone would constantly alert me to likes, messages, and 'views.' So I took a chance.  Paid a few subscriptions and started those paths. \n\nThen, dates I thought would happen fizzled out, but I kept my head high. I kept trying, failing trying, failing again, and again, blocked a few 'interesting' matches,  until a few weeks ago. \n\nHere's a fun match, a year or so older, that's fine. She looks like she keeps herself active and healthy and didn't look the age. I still feared the Catfish so I kept my questions simple and watched the response. \n\nThen, something happened, she kept replying, got teasing at one point. So, I pushed:\n\n\"Let's meet up!\"\n\n\"Okay. \"\n\nThis is gonna happen isn't it???\n\nSo, I press date ideas, she changes them, then we agree...for this morning...\nBrunch at a local hip stop for wine and socializing. Chill vibe and great food.\n\n...she's late... then, i got a message,  \"Sorry, I'm running behind! I'm 20 minutes out!\"\n\n... different, she wanted to be here. Nice change of pace. \n\nThen, as I'm waiting at the bar,  she introduces herself from behind. We would spend the next 2 hours talking. \n\nShe's got a language barrier as a Russian American, but I think I can work with it. She's got a son who seems to have his life together, so I'm hoping this first date is going to lead to many more where she's not distracted (My other thought was she was nervous as hell, which is possible) she was took in everything we talked about, and we exchanged phone numbers at the end.\n\nI'm hoping this is a good trend for me.", "url": "https://www.reddit.com/r/happy/comments/cyfdzy/i_had_my_first_date_in_months_actual_first_date/", "title": "I had my first date in months, actual first date in years!", "social_network": "reddit", "user": "TheGreatTrumpWall", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 24, "down_vote": 0, "creation": 1567371079, "permalink": "/r/happy/comments/cyfdzy/i_had_my_first_date_in_months_actual_first_date/", "nsfw": false, "first_save": 1635440649.7793088, "replies_charged": false}