{"id": "t5_2qh5i_t3_9it6y4", "request": ["25d24ca5-f502-424e-a8f8-3466abfbbd33"], "text": "Tldr at the bottom  \nBackstory, im 23, introverted, riddled with depression and whatnot, and never been in a relationship; all ive ever wanted was emotional intimacy. Im not a virgin, ive been with 1 other girl, but that was just a drunken one night thing and we left immediately afterwards.  \nBut this date, holy moley, I'm going to keep this sfw and as brief as i cam because thats not the point of this story but i have to get this out. \nBasically im travelling Europe alone, coming out of my shell, soul searching, whatever. Decided to try tinder and i matched. We both went and had a smoke and a drink and hung out all night, kissing and whatnot. She asked me back to hers and i was all about it, sadly her flatmate was not ok with randoms coming home, fair enough. So at 2 in the morning we found a hostel with a private room and booked it.  \nObvi not going into detail, this is a christan minecraft server, but ive never been so happy. For years ive been craving closeness and intimacy and it finally happened. She was happy to be with me, no pretenses or caveats. We just lay there for hours holding each other. I can stop smiling, i feel like such an idiot walking around with a big doofy smile on my face, I've not been so happy in years. We're hanging out again tonight; we established that it was a one night thing, but im alone in Europe and leaving soon so im happy to just hang out.\nIs this how normal people always feel?  \n  \n\n**TL:DR** Craved physical closeness and emotional intimacy my whole life, finally got it and now im just euphoric about it.  \n  \n**Edit:** Sooo she made an idiot of herself the next night and now im cross and upset but im leaving this here because nothing can retroactively ruin that night, and because my boosted self esteem led me to strike up a lovely conversation with a girl at the burger bar so im still happy and still calling it a win", "url": "https://www.reddit.com/r/happy/comments/9it6y4/i_had_my_first_date_the_other_night_and_it_was/", "title": "I had my first date the other night and it was amazing!", "social_network": "reddit", "user": "BIOHAZARDB10", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 21, "down_vote": 0, "creation": 1537889867, "permalink": "/r/happy/comments/9it6y4/i_had_my_first_date_the_other_night_and_it_was/", "nsfw": false, "first_save": 1635440666.8479111, "replies_charged": false}