{"id": "t5_2qh5i_t3_8axzxp", "request": ["25d24ca5-f502-424e-a8f8-3466abfbbd33"], "text": "Monday, April 10, 2017 - Monday, April 9, 2018\n\nOn April 10, 2017, the second Monday of April, summer's ambiance well and truly dissolved for another year, I forced my hard drive to the ground by tripping over the USB cable. The hard drive had died. Self-hatred. Self-hatred. What a fool I was. But I deserved it. The painful irony here is that I was in the middle of backing up all my files to Google Drive to avoid this kind of thing, after the enclosure had ceased working weeks before. I was completely distraught. This wasn't too soon after my long term partner had cheated on me. Earlier that day I was feeling the best since the day I found out, but naturally this incident returned me to the psychic perils which was increasingly becoming home. Suicidal ideation was once again an euphoric escape. For I had lost sentimental videos, the videos only in colour, of my late mother, of my childhood birthdays between 7 and 10, which I hadn't backed up. They were gone. I rang up my IT friend on WhatsApp, who was in Thailand at the time, and he assured me with a synergy of IT aptitude and perceptive empathy, that I would get them back. He returned and gave it a shot, but to no avail. The weeks followed - not only was I in grief, feelings of betrayal, for my long term relationship, but I felt I was grieving a part of my mother all over again. I desperately searched my family home for either the original VHS, or the CD that contained the converted AVI file. Each time I'd go home, there was no luck. Ultimately, just as I had accepted the loss of a relationship, I accepted the loss of the files.\n\nOn April 10, 2018, the second Monday of April, summer's ambiance well and truly dissolved for another year, and today I've been uncharacteristically sleep deprived and subsequently emotionally sensitive (4.5 hours sleep on Saturday night; 5 hours sleep on Sunday night). I woke up this morning, with a dream note in my phone from 6.56am: \"Videos bsck but dorsnt have same people\". The night before, I had finished a day meditation retreat of 7 hours, and spent the night having a long overdue catch up with the same friend before he moves away. At his home, the topic of the hard drive came up, which he still had. He decided to give it another go -- and while there was some tentative recognition, there weren't any files. I was fine with this. I'm currently happy, and we went to enjoy a flow of words and the Melbourne International Comedy Festival. While at work today, my friend rings me up in a state of shock, telling me that the files are currently recognised out of fortuitous luck, and to quickly work out where the files would be located and which ones would be accurate before it dies again. After some trial and error, oscillating speeds, and an electric razor, both the videos were successfully copied off the hard drive.\n\nFor the rest of the day at work, I was in complete shock and had to continuously hold back tears. I'm overwhelmed, and eternally grateful to my friend. As of writing this, he had saved some other files, but the hard drive has once again died. But that's fine. I have the videos back after 364 days. Videos I would only check out, at most, once a year. They were only lost for one time each of the calendar year. I am floating. I'm in shock. Likely due to sleep deprivation, this all seems like a dream. It's as if a part of her has been resurrected. Ineffably bizarre. Over the last few months, I've returned back to my usual state of having not cried, at best only the feeling of crying or a tear or two. Despite genuine and emotional experiences in meditation and a greater feeling of inclusive compassion, one of my mind's defense mechanism is still to intellectualise and analyse. But maybe I'll be lucky enough to let it all out tonight.", "url": "https://www.reddit.com/r/happy/comments/8axzxp/364_days_later_after_my_hard_drive_stopped/", "title": "364 days later after my hard drive stopped working, it works again. I got videos back of my late mother which I thought I lost forever! :)", "social_network": "reddit", "user": "Geovicsha", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 48, "down_vote": 0, "creation": 1523276607, "permalink": "/r/happy/comments/8axzxp/364_days_later_after_my_hard_drive_stopped/", "nsfw": false, "first_save": 1635440665.7618563, "replies_charged": false}