{"id": "t5_2qh5i_t3_4xn1f3", "request": ["13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "A few months ago a new girl was hired at work and within the first hour of meeting her I already started to like her. A few days I asked her for her number so I could send her memes (don't judge we both love dank memes) and she gave me her number.\n\nWe started to talk and I realized that we really had a lot in common and had really good chemistry. Now during this whole thing she had a boyfriend. I had no problem being her friend despite liking her but it was painfully obvious that she wasn't happy with this guy. Eventually she broke up with him and then not too long after that she told me that much like myself she started having feelings for me pretty much the first day we met.\n\nUnfortunately though she was on vacation in Florida when we found out we like each other so we had to wait until she got back to go on a date or hang out again. When she got back her, a friend of ours, and I hung out at her house. While we were there we decided to watch a movie on Netflix.\n\nAbout a quarter of the way through the movie our friend had to leave. About five minutes later her and I started to cuddle, getting progressively closer and closer to one another. Eventually we looked at each other and she pecked me on the cheek and then she moved towards my lips. When she did this I did the most awkward thing I could've done, I literally backed away and said \"Oh my god holy shit this is happening.\" and then we kissed. We then backed away a little and looked at each other and softly said \"Hi\" and then started to make out. And a dumb thing I wanna add, the protagonist in the movie that was on said \"I'm a living meme. I am a fucking meme.\" the moment we kissed.\n\nEver since that night I have not stopped smiling and replaying everything back in my head. I know you're not supposed to measure happiness on whether or not you have a relationship, but I've been the happiest I've been in a very long time. After a long time of trial, error, and defeat in my life over these past couple years, it felt so nice to have something go my way. Thanks for reading my ramblings /r/happy :)\n\nEDIT: Oh my god you guys are too nice!\n\nEDIT 2: We just made it official!", "url": "https://www.reddit.com/r/happy/comments/4xn1f3/i_had_my_first_kiss_a_couple_days_ago/", "title": "I had my first kiss a couple days ago!!!", "social_network": "reddit", "user": "Norbit1223", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 339, "down_vote": 0, "creation": 1471155395, "permalink": "/r/happy/comments/4xn1f3/i_had_my_first_kiss_a_couple_days_ago/", "nsfw": false, "first_save": 1635442916.617956, "replies_charged": false}