{"id": "t5_2qh5i_t3_m3udgp", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a", "b3574414-2d10-4990-bb3e-d9be8a3b6716", "258e332d-215f-495f-8bee-bccd57229f62"], "text": "So quick summary: Me and my wife of four years wanted to start a family but my she cannot have kids of her own. So after getting in touch with our local adoption agency, and with them living with us for a few months with us as the foster parents, we officially became the parents of two beautiful girls named Amelia (7) and Judy (11). They had been under the care of an actually very sweet and loving older couple who were their foster parents. But obviously with them getting up there in age, it was getting harder for them to take care of the girls. So that's when we stepped in. \n\nNow when I say she was standoffish, I'm referring to Amelia. She wasn't necessarily scared of me or my wife or anything like that, in fact she was quite comfortable and adjusted very quickly to living with us. She just saw me as a bit intimidating because I'm rather tall (6'5) and have lots of tattoos. I think she thinks I'm like a biker or gangster or something lol. And anytime I'd ask her something like how school was, it was usually just one word answers. But whenever my wife would ask, it'd be hard to get her to stop talking. This happened when we were the foster parents as well. \n\nSo the incident in question happened earlier this afternoon. My wife had taken Judy to the mall to get some more stuff for school since they both may be going back to in-person classroom attendance soon, and I watched Amelia. We had breakfast together and she politely asked if she could go out in the backyard to play. I was doing some work on my laptop in the kitchen and I hear my neighbor's dog (a German Shepherd) barking and don't think much of it. But then a few seconds later I hear her yell Daddy for the first time ever. I jog outside and see her standing there on the verge of tears as my neighbor's dog on the other side of the chain link fence is sitting there looking concerned. \n\nI go over and kneel down next to her asking \"What's wrong sweetie? Did he scare you?\" and all she does is nod and wrap her arms around me trying not to cry. I smile and tell her \"It's okay sweetie he's not gonna hurt you\" and I pick her up and she's holding on to me with all her strength. I immediately figure out what happened and know the dog isn't a threat because he is the biggest goofball you can imagine: there was a ball next to the fence that Amelia and her sister must have played with and the dog saw her and made the connection in his head that she wanted to play catch and was trying to get her attention to play. I know this because he's done the same thing when I cut the grass or do yardwork and just wants someone to play with. He's honestly the cutest thing\n\nShe calms down enough and, while she's still holding on to me, I get the dog to stand up and hold my hand out for him to sniff and lick my hand and say \"See? He's not mean at all\" and I pet him all over his head and he melts in happiness. I then ask her if she wants to try and she doesn't say anything except slowly reaches her hand forward and lets him smell her and she laughs as he licks her hand and she giggles, and I kiss her on the cheek for good cuteness' sake. I even let her throw the ball and he quickly brings it back and dumps it in her hand and she's laughably grossed out and completely forgets why she was scared in the first place. \n\nEventually we both head back inside and I make her lunch and it's like an immediate transformation of how she is with me. I just talk about the work I was doing and she's asking me loads of questions like she does my wife and it really just feels awesome. Just wanted to share this story and hope it made some of you smile.", "url": "https://www.reddit.com/r/happy/comments/m3udgp/my_adopted_daughter_called_for_me_for_the_first/", "title": "My adopted daughter called for me for the first time ever a today and also clung on to me when she got scared after being shy around me since she moved in with us", "social_network": "reddit", "user": "FocusedMaintenance", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 50, "down_vote": 0, "creation": 1615592774, "permalink": "/r/happy/comments/m3udgp/my_adopted_daughter_called_for_me_for_the_first/", "nsfw": false, "first_save": 1635439306.712136, "replies_charged": false}