{"id": "t5_2qh5i_t3_t7t1p", "request": ["8bed9c95-eda8-4aca-9f64-c1f6ec35f283"], "text": "And a week later was offered one with a 42% pay increase! I've been searching for a few weeks now and finally found a position that I really would love to have!  It was really an eye opening experience, working with several recruiting companies and having many different experiences.  The only advice I have to give job seekers is to go with your gut.  Several of the recruiters I worked with were VERY pushy, short in their conversations, and borderline rude.  I finally found a company to work with that was pleasant to work with, friendly on the phone, and seemed like they truly cared about my career path.  While I realize recruiters DO work for the cut they get, some are much nicer to work with than others.\n\nFor those wondering why I turned down the first position offered, the money was the only thing that was better over my current job.  The work environment was extremely rigid, the office was crappy (think cramming employees around a folding table), and the commute would be over an hour and a half.  The new job has a much nicer office, with an \"industrial\" style to it, better pay, and is just overall much more inline with the career path I want to be on.\n\nTo anyone not happy at your current position, take the time to look elsewhere.  Recruiters can certainly help, and while I know most advise against then, it makes it the whole process easier while you maintain a full time job.  And most of all, good luck!", "url": "https://www.reddit.com/r/happy/comments/t7t1p/i_turned_down_a_job_that_would_give_me_a_17_pay/", "title": "I turned down a job that would give me a 17% pay increase...", "social_network": "reddit", "user": "beer_venom", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 12, "down_vote": 0, "creation": 1336183753, "permalink": "/r/happy/comments/t7t1p/i_turned_down_a_job_that_would_give_me_a_17_pay/", "nsfw": false, "first_save": 1635442190.535952, "replies_charged": false}