{"id": "t5_2qh5i_t3_bla7fr", "request": ["c15214d3-1d77-40d5-ad12-df4ba3bdb7b2"], "text": "About a half a year ago, a shockwave hit my oh-so-good and oh-so-stable life and it pushed me into a depression. It felt like nothing was the same anymore. I didn't know what was real and what was fake. The easiest, most mundane things, routines and habits were difficult as I could only think about \"it\". I could only look back. I thought I would never be able to completely forgive what had happened and the people causing it. I thought I would never be able to fully trust and believe in someone again. I felt betrayed and let down and feared that I'd be an unhappy depressed mess at my 31st birthday.\n\nThe months after the event have been an emotional rollercoaster. With effort, medication, the loving support of my wife and a few best friends, I managed to pull through. Each dip of depression was like taking two steps back and gave me new fears and doubts. But each time I managed to get up and take three steps forward. With every phase, I got new insights and renewed strength to keep fighting and to fight even harder than before.\n\nLast week was my birthday, and I wasn't the mess I feared I would be. I was feeling very stable and happy and self-confident again. I am able to see things in perspective and I'm learning to accept what's happened within its context. But most of all, I can value again what's still good. I'm surrounded by some beautiful people and I feel like those bonds are only growing closer and better. I have the wife and relationship I've always dreamed of. My two beautiful children give me so much satisfaction and pride. I have a couple of great friends who will always have my back. My mother, my grandparents and one of my brothers are schoolbook examples of what it means to have caring family members.\n\nI can still trust those people. Actually, I have never felt so much love to give and receive as I do now. Life is good. It'll get even better.", "url": "https://www.reddit.com/r/happy/comments/bla7fr/went_through_a_few_months_of_depression_now/", "title": "Went through a few months of depression, now feeling better than ever", "social_network": "reddit", "user": "88scythe", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 15, "down_vote": 0, "creation": 1557136967, "permalink": "/r/happy/comments/bla7fr/went_through_a_few_months_of_depression_now/", "nsfw": false, "first_save": 1635442806.033555, "replies_charged": false}