{"id": "t5_2qh5i_t3_7scmb5", "request": ["d2695e58-e735-4b4e-a3b9-4ea28b82b28e"], "text": "[Apologies if this isn't allowed in this subreddit, as it is not a story of something happy that has happened but happiness to come. After a life of mental illness, anxiety, depression, and feeling suicidal, I have finally seen a doctor. I finally feel better. I laid awake one night and the following came to me, I had to write it down, and now I feel like I need to share it with someone.]\n\nSomeday we will buy a house. Maybe it'll have a barn, maybe not. Maybe it'll have a greenhouse or a starter garden, maybe not. If not I'll build it from the ground up. I will plant every seed and raise every chick, cow, and pig myself. I will find every kind of animal that'll have me and love them til they die. I would probably become a vegetarian but that's okay. Because I'll have every kind of vegetable and fruit and spice known to man in my backyard, and hell if I don't have the motivation to learn how to cook the damn things. I was born the rabbit of my family anyhow, and that's saying something having sprouted in the middle of nowhereland farm country. I will fail and learn and try try try again like my momma raised me, work my ass off like my daddy taught me, and someday I will sustain myself with the fruits of my labor. And when I get things going, I'm going to hire someone wonderful to watch over everything whenever I head out to travel the country with the love of my life trucker.  Someday were going to have little sprouts of our own, and we will be that family that rescues too many dogs and turns the stray cats into our furbabies. We will raise our kids in the sunlight and show our kids the wonder that is videogames in the moonlight. I'll paint and knit and sew  and game until my hands fall off. \n\nOr, just maybe, I won't do any of these things.\n\n I have spent my entire life not knowing what to do with it. Which college to go to, which classes to take if I ever got there, driving, job, career- hell it took me this long to see a professional on how to fix my brain legos so that I can actually DO any of those things. What do you want to be when you grow up? I don't know.  I'll never grow up. I wanna run through a golden ocean of a field in a Wisconsin summer like a child would, chasing butterflies. That's life to me, and I want to create more of it. I want to nurture it. I want to embrace, enhance, enchant it. So, I guess, maybe someday we will buy a house.\n", "url": "https://www.reddit.com/r/happy/comments/7scmb5/someday_we_will_buy_a_house/", "title": "Someday we will buy a house.", "social_network": "reddit", "user": "nuwatw", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1516689997, "permalink": "/r/happy/comments/7scmb5/someday_we_will_buy_a_house/", "nsfw": false, "first_save": 1635440637.8930745, "replies_charged": false}