{"id": "t5_2qh5i_t3_nhhj47", "request": ["af00f57d-0c85-41f5-985c-7cc20793bcbb", "5b81e8b4-a0f8-4747-8a7a-0e37aae01c43"], "text": "Recently I’ve been having trouble with a coworker, so my boss sat us down and we attempted to clear the air. \n\n(I think it’s also worth mentioning my bosses and I have been friends since before I got the job, and that it’s a small business- they are a married couple.) \n\nWe had a meeting, it went ok- but I was still only cautiously optimistic. After the coworker left, my boss came to me directly and told me in no uncertain terms that she’d never want to lose me as an employee or a friend, and that she will do whatever she has to to keep me around- even if that means firing the troublesome coworker- after giving them a fair chance to improve of course.\n\nI was happy enough knowing that my first boss felt so warmly about me- I felt so appreciated. \n\nBut later, her husband (other boss) sent me a message telling me that while he supports giving the coworker a fair shot- that he really didn’t care for them and would also choose me over them. Negativity for the coworker aside, it just made me so happy to know they both think so highly of me and value me so much.\n\nI want to show them I appreciate them with some kind of gesture, but I don’t know what to do. They are both retired musicians, and the husband worked with a law firm for several years. I know he has a fascination with prison buildings, and also he happens to be from Japan. The wife is very funny, she’s the primary boss of the cafe, and definitely “wears the pants” so to speak in their relationship. I know she likes things that are cute but not cutesy, and she is following a pretty strict diet right now- she is not Japanese. \n\nAny ideas are welcome~", "url": "https://www.reddit.com/r/happy/comments/nhhj47/my_bosses_love_me_and_im_crying_im_so_happy_how/", "title": "My bosses love me and I’m crying I’m so happy, how do I show them I appreciate them?!", "social_network": "reddit", "user": "youremakingmeanxious", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 3, "down_vote": 0, "creation": 1621562847, "permalink": "/r/happy/comments/nhhj47/my_bosses_love_me_and_im_crying_im_so_happy_how/", "nsfw": false, "first_save": 1635441979.196373, "replies_charged": false}