{"id": "t5_2qh5i_t3_2i9fn0", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "Getting home after a long, hectic, ridiculous, yet typical 10 hour shift in fast food management. My legs are throbbing, I am exhausted, I am soaking wet with sanitizer and mop water, I have mustard smeared all over my shirt and I smell like a mixture of grease and hate. In 7 hours I gotta get up and ready myself to work the dreaded 12-10 Saturday shift. While in the shower washing away the muck and fry grease, out of nowhere, I said aloud to myself, \"I am so lucky.\" Simply shaving my legs without sitting down because of not being able to physically stand without help, not cutting myself because I had no feeling in my hands or my legs and no sense of pressure... is something I am so so thankful for. 2 months ago there came a point where I could not bathe myself, I could not even keep down water and threw up 5 to 6 times daily, at one point I was in bed for 10 days straight and simply walking to the bathroom felt like I was running a marathon, I was numb from my scalp to my toes with the exception of my eyes and nose, I had vertigo for weeks. My speech was severely slurred. I couldn't drive. I could barely dress myself and lived in pajamas and slippers, even to see the neurologist. I gained 25 pounds of water weight in 1 week due to reaction to intravenous chemicals and steroids. I was so scared I would never feel better and I would be forever doomed to use the motor-buggy at Wal-Mart. I am now happily traversing the isles of Wal-mart on my own two feet. No more narrowly avoiding hitting elderly people or nearly running over that 4 year old decked out in hunting camo from head to toe and sporting a mullet that rivals Billy Ray Cyrus circa 1992. I need no loud succession of beeps to announce to everybody in the store that I, the one out in pajamas at 3 pm on a Tuesday...am backing up. I may miss ramming into sunglasses displays though, that was always fun and not embarrassing at all. Who knows what the future holds? Whatever it may be, at this very moment...I am thankful to be working...even in fast food. My job provides with me medical insurance that gives me an MS drug at no cost that without insurance, would cost me $3500. Multiple Sclerosis is an incurable, mysterious, unpredictable and debilitating disease that may very well put me in a wheelchair at some point...but on the bright side...maybe it won't. Although the diagnosis is definitely one of the last things I ever wanted to hear...it did bring some good with it. If being diagnosed has taught me one thing, it's to be thankful for all things and all accomplishments, however small or insignificant an accomplishment may be or seem to others...it's an accomplishment. I now tend to lean towards looking at the brighter side of things rather than the dark and I have gained something I have lacked for a long long time... faith. I am not so cynical about life anymore. Amongst all the bullshit, I am actually the happiest I think I have ever been. It may be all the drugs but I don't care. I am happy. Tingly hands and all. Happy.", "url": "https://www.reddit.com/r/happy/comments/2i9fn0/in_the_past_year_i_have_was_robbed_at_gunpoint_my/", "title": "In the past year I have was robbed at gunpoint, my 10 year marriage fell apart, then 10 days after my 29th birthday...I was diagnosed with Multiple Sclerosis...in that order...yet today...I am happier than I have ever been.", "social_network": "reddit", "user": "NikkiNebula", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 269, "down_vote": 0, "creation": 1412408969, "permalink": "/r/happy/comments/2i9fn0/in_the_past_year_i_have_was_robbed_at_gunpoint_my/", "nsfw": false, "first_save": 1635440712.8647218, "replies_charged": false}