{"id": "t5_2qh5i_t3_l77o69", "request": ["a9b702ea-7cbf-4932-81ef-1b1a68bda265", "64dc2923-ade0-4dd3-ae6c-66779b700555"], "text": "Obligatory on mobile, please excuse bad formatting. \nI have this friend, we've known each since around 2009/10, for most of that time we were only really acquaintances with a mutual friend until around early 2019. Something happened and we realised that we both have similar senses of humour, enjoyed discussing opinions on things, and just generally got on like a house on fire. Ironically this happened after she moved to another country with an 11 hour time difference.\n\nAt the beginning of last year our friendship really flourished because both of our countries were in lockdown so we both were on social media a lot more. We spoke everyday, joked about, it was fantastic. Around the second half of the year though, she started to drift away and we spoke less and less often. \n\nI've had history of confusing friendship with attraction so I was scared to say anything to her about the drifting because I was worried she'd get the wrong idea.\n\nI've tried messaging her a few times over the past few months, but the conversations all died pretty quickly. Today though, today I made a joke about forgetting her name that made her properly laugh. And even though the conversation wasn't long like it used to be, it felt so good to get that rapport we used to have back again for a little bit. I almost cried I was so happy. It felt really good.\n\nTLDR: Was losing touch with a friend, but today I made her laugh, and it was like it used to he for a little bit. Which felt nice.", "url": "https://www.reddit.com/r/happy/comments/l77o69/i_made_my_friend_laugh_today_its_been_so_long/", "title": "I made my friend laugh, today its been so long!", "social_network": "reddit", "user": "Sahrion_true", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1611865420, "permalink": "/r/happy/comments/l77o69/i_made_my_friend_laugh_today_its_been_so_long/", "nsfw": false, "first_save": 1635440798.7972496, "replies_charged": false}