{"id": "t5_2qh5i_t3_481hz3", "request": ["74704fa2-216a-4299-aa5c-2674d62eb4e5"], "text": "I've always kind of hated my birthday. \n\nIt's just never lived up to what I thought a birthday should be. So over the years I just began to treat it like any other day. \n\nMy birthday is the 28th, today. My plans were to go have a few beers with some friends and my brother at a bar later tonight. \n\nNothing spiffy. \n\nSo Saturday the 27th. My gf and I decide to go to Knotts Berry Farm (a theme park in So Cal) we have annual passes. \n\nHer sister an nephew join us. \n\nIt's a mess. The park is overflowing. 2 to 3 hour waits for almost every ride. \n\nSister and nephew bail because the had some other stuff to do. \n\nGF and I go see one of the shows. Eat. Sit in our favorite spot. \n\nIt's getting later. I'm getting tired. \n\nWe decide to call it a evening. So around 7pm we head home. \n\nAfter some crazy traffic. We make it back home. \n\nUnlock the door. Head inside. \n\n#SURPRISE!!!\n\n12 of my closest friends and family bombarded me with confetti.\n\nI was, and still am, completely floored. \n\nI've never had a surprise party. I've never had an all our birthday. \n\nThis. Was. The. Shit.\n\nHer sister left the park early to sneak into my house and deck the place out with like 30+ Mylar balloons. Streamers everywhere. My freaking BABY pictures all over the house. Food. Drinks. Friends. Family. \n\nEverything. \n\nI'm stunned. \n\nWe spent about 4 hours just having some beers and chatting. Laughing. Eating. \n\nIt was.... Magic. That's the best way to describe it. \n\nEveryone waited around for midnight to usher in my official birthday and then slowly everyone dispersed. \n\nAll of this was planned and paid for by my amazing girlfriend. \n\nShe had me fooled so good. I had no friggen clue.\n\nSo. I'm happy. \n\nBest birthday ever. \n\nI've never felt more loved. From my friends and from my significant other. \n\nPerfect way to become 30. \n\nBefore tonight I hated my birthday. Now I will remember this day for the rest of my life. \n\nJust had to share.", "url": "https://www.reddit.com/r/happy/comments/481hz3/happy_30th_to_me/", "title": "Happy 30th to me.", "social_network": "reddit", "user": "iaminfamy", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 55, "down_vote": 0, "creation": 1456660953, "permalink": "/r/happy/comments/481hz3/happy_30th_to_me/", "nsfw": false, "first_save": 1635442132.8950396, "replies_charged": false}