{"id": "t5_2qh5i_t3_otbffq", "request": ["2293bc08-7671-4d63-b63f-dbe4a3a4858a"], "text": "I'm sure that this doesn't apply to every situation, but it made me happy to think about today. I thought about my first girlfriend this morning. It was actually because of hearing a song we used to listen to all the time, just driving around our little home town. \n\nWe were both 16 when we met, and we were together for nearly 2 years. It was a classic story, she got into college in a different state, I couldn't afford to go to college yet, we planned to stay together long distance and it lasted about 3 months. \n\nBreaking up with her ruined both of us at the time of course for a few months, that first person you fall in love with does a number on you. I was pretty miserable for a while. \n\nFor years when I thought about it, it would make me a little sad. Especially if I was single at the time. Then I really never thought about it at all. This was probably the first time I thought about her in as long as I can remember, maybe years (I'm 30 now). This time though I didn't feel sad at all, everything I remembered was a happy memory. The first time we kissed, which was the first time either of us had kissed anyone. Doing absolutely everything together. Sneaking out just to see each other for a few minutes. Climbing an old fire tower in our town, laying out in a field under the stars together. Falling asleep together for the first time. Carrying her around for no reason. Planning all the trips we would never end up going on together. Also, just that overwhelming feeling of wanting to be near someone, and the joy I'd feel when her car would pull up or when she would walk out of her front door to meet me. \n\nIt's all just nice fun stuff, and it doesn't really matter to me anymore that it didn't work out, and I don't really remember the painful part of it ending. I'm just glad it happened, it was probably the best part of my childhood and young adult years and you can't get that back. In my mind she was the most beautiful, smartest, and funniest person I had ever met, and I couldn't believe when all those feelings were reciprocated. Even if it didn't last, we loved each other. Not everyone gets to experience being in love with someone at 17, its such a pure and simple thing, and I think I'm pretty lucky.", "url": "https://www.reddit.com/r/happy/comments/otbffq/old_heartbreaks_can_eventually_just_be_nice/", "title": "Old heartbreaks can eventually just be nice memories", "social_network": "reddit", "user": "IridiumTrigger", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1627483758, "permalink": "/r/happy/comments/otbffq/old_heartbreaks_can_eventually_just_be_nice/", "nsfw": false, "first_save": 1635441072.407236, "replies_charged": false}