{"id": "t5_2qh5i_t3_8riynt", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "Hi. I’m a Muslim living in Malaysia(which makes me double Muslim lol!)\n\nI’ve invited some friends over to my house for a party like I do every summer.\nHowever this year the invitees are ppl from the hospital I work at. Last year were my uni friends.\n\nI knew that one of my friend is gonna bring his boyfriend as his +1. So I quickly went back through my list of invites and texted each and every one of them this note:\n\n🌈note: among the invites are open LGBT. If you are uncomfortable with this scene, please excuse yourself from the event. We’ll catch up another time at another event. 🤗\n\nI expected some of them would back out, with our community being pro muslim, but NOPE!\n\nThey all expressed their support and love. \n\n-Some said they’d come BECAUSE it’s LGBT friendly while being straight themselves. \n-One came out to me (I’m very shocked, I’ve known this particular friend for 8 years!)\n-Some asked me what happened the previous year that I suddenly had to add that note in...they just basically want to grab a popcorn and gossip.\n\nI.AM.FLOORED. \nI’ve never expected such a reaction. \n\nMaybe some of you would not understand my excitement. Especially if you come from a country that has advanced LGBT rights movements. I get it. But nonetheless I’m very happy. \nI knew that I have some great work friends: they’re funny, driven and smart. But I didn’t know they were THIS great, you know? \n\nAll we do is hustle hustle hustle at work. Barely have time to talk about our personal lives. We text each other only about work. \nSo I thought they were one way, suddenly it turns out they’re another way.\n\nAh~ there’s hope yet for my little country. ", "url": "https://www.reddit.com/r/happy/comments/8riynt/living_in_muslim_country_im_inviting_a_bunch_of/", "title": "[Living in Muslim country] I’m inviting a bunch of friends over to my house next weekend and made sure they know it’s an LGBT friendly event. Didn’t expect such an awesome reaction!", "social_network": "reddit", "user": "appleforserenity", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 20, "down_vote": 0, "creation": 1529151040, "permalink": "/r/happy/comments/8riynt/living_in_muslim_country_im_inviting_a_bunch_of/", "nsfw": false, "first_save": 1635438836.6800978, "replies_charged": false}