{"id": "t5_2qh5i_t3_8fzoby", "request": ["258e332d-215f-495f-8bee-bccd57229f62", "ba0d1102-e426-4cb2-aee0-676868a519e8"], "text": "As the title said. Round May of last year, my fiancée called everything off. Wedding, dating, everything. I spent the next 6-8 months in a depressive panic for lack of a better term. I would text her massive paragraphs detailing how sorry I was, making sure she knew I was feeling like an asshole about what I did (it was basically a communication breakdown. We were long distance), and pretty much doing everything in my power to push her further and further away without realizing what I was doing. \n\nA few months ago, after our last big fight, I vowed to keep myself as far away from her as I could and go back to the dating scene. It wasn’t easy. Online dating is a fickle mistress. And not to mention how hard it was to push myself away from someone I had known for over 10 years and was dating for 3 of those with plans to marry. Tried all manner of free sites. In 4 months, I had one date. (Living in a small town doesn’t help with stuff like this just FYI). I was getting close to the edge. Not really suicidal, but I wouldn’t have been mad at something killing me. \n\nWell that’s when mom and dad both told me I should try one of the paid sites. E-harmony ended up being fairly nice and a lot better in terms of communication. Still no dates from there. But again. Small town life. But I was having a better time. That’s when I met Rachael (fake name). \n\nRachael’s  profile gave off a very fun vibe. So I decided to message her.  We had a good time talking. We ended up having a TON in common, except for our religious beliefs. Which seemed like to her would be a big deal. But I pressed on anyways, asking her for the traditional dinner/movie/mall walk. She agreed. \n\nSince then we’ve been on almost 10 dates. Some more dinners, a whole day in the Smokey Mountains of TN, we’re going to a drive-in this weekend (surprisingly they still exist down here) and just general driving and cookouts and stuff like that. I haven’t so much as thought about my ex since i met this girl and she puts the biggest smile on my face. It may have only been a little while, but I’m the happiest I’ve ever been and I have her to thank. \n\n[Here is a picture of us at Bald River Falls in East TN. Thanks for listening everyone.](https://i.imgur.com/KKChFNB.jpg)", "url": "https://www.reddit.com/r/happy/comments/8fzoby/last_year_the_girl_i_thought_id_spend_the_rest_of/", "title": "Last year the girl I thought I’d spend the rest of my life with broke up with me. I’ve been in a slump ever since. Last month I met someone online and this has probably been the absolute best month of my life.", "social_network": "reddit", "user": "K1LL3RM0NG0", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 16, "down_vote": 0, "creation": 1525097088, "permalink": "/r/happy/comments/8fzoby/last_year_the_girl_i_thought_id_spend_the_rest_of/", "nsfw": false, "first_save": 1635440717.621727, "replies_charged": false}