{"id": "t5_2qh5i_t3_f86idn", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "Okay so the backstory for this is pretty long, sorry about that, I have ADHD so I get pretty rambly sometimes.\n\nSo like I just said, I have ADHD, and I also have a few other mental disorders that can be really challenging sometimes, so my school offers something called an IEP (I honestly don’t know if I ever learned what it stands for, and if I did, I don’t remember) for those students, which basically gives them extra help, like giving them more time on tests.\n\nSo I have an IEP, and students with an IEP are able to go to a “special” study hall (or are forced to, in my case), where it’s basically study except there’s less students and more teachers and they’re always making sure you’re doing work and help students more.\n\nThis “special study hall” has a name, but because it’s specific to my school, I don’t really want to share it. Anyway, these SSHs (that’s what I’ll call them from now on) are all over the school, and include students from all grades, and I’ve made a lot of friends with the other people in my SSH, and there’s even a group chat among most of us in our SSH.\n\nOkay, sorry for that backstory, it was way too long. Can you tell it’s 2:30 AM here? Anyway.\n\nSo ~a week ago I walk in to this SSH and one of the TAs (there are 3 TAs there) jokingly says “Oh no, it’s [my name],” and my friend responde with “No, it’s the opposite,” and it made me feel really good.\n\nI have anxiety, so I constantly feel like I’m saying/doing the wrong thing and that my friends don’t like me, but hearing him say something like that really warms my cold and shriveled heart.\n\nIt just makes me really happy to know my friends (or at least that one friend) feel the same way about me as I do about them.\n\nMy life hasn’t been particularly easy or fun, but this year I think I’m learning from my past mistakes, becoming a better person, and finally starting to get over my depression, and knowing that I have people like that by my side really helps me through my daily struggle.\n\nI applaud you for getting to the end of this, and hopefully everyone reading is/will be as blessed as I am, or even more so.", "url": "https://www.reddit.com/r/happy/comments/f86idn/finally_have_some_good_people_in_my_life/", "title": "Finally have some good people in my life", "social_network": "reddit", "user": "Spudblood", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 16, "down_vote": 0, "creation": 1582444067, "permalink": "/r/happy/comments/f86idn/finally_have_some_good_people_in_my_life/", "nsfw": false, "first_save": 1635440699.4354217, "replies_charged": false}