{"id": "t5_2qh5i_t3_2towb8", "request": ["23d40627-ba71-4806-9d30-ac350683ef35"], "text": "Saturday I turned 35, and while I feel pretty damn old these day, I must admit that it was one of the best birthdays I've had in a while.  \n\nI had 16 of my closest friends (including my lovely wife) join me for a dinner at my favorite bar/restaurant, and it was a great time. We drank delicious cocktails. The owner of the bar knows me well enough by now, and he made sure to have on-hand my favorite drink (Lagavulin 16yr Scotch whisky; I take it neat), even though his distributor was out of it. He went and got a bottle specifically because I was coming. We ate delicious food. I ordered an amazing steak. It was just my favorite people, gathered in one place, having a good time.  \n\nToday, my wife and my hilarious dog and I went for a 3 mile hike and enjoyed a day of great weather. It was the perfect way to both wrap up the weekend, as well as get my blood flowing and process whatever leftover alcohol there was in my system. It was a beautiful experience that made me feel great afterwards. I'm kind of stubborn about getting out and doing stuff like that sometimes, but once I'm doing it I always feel awesome. \n\nI'm lucky. Despite any worries I may have about trivial stuff like money or my career or what's going to happen down the road, I'm really just grateful as hell to be married to a beautiful woman who really loves me, and I'm so fortunate to have so many great people to call friends who know me and accept me and are always there to offer advice or a good playful jab to my ego – whichever I need at the time. Three of my best friends even got together and bought me a bottle of that favorite Scotch of mine, which was really generous and *exactly* what I would have wanted if been asked.  \n\nWhat a great and memorable weekend. This is the first time I've ever visited this subreddit, and I just wanted to share. I hope all of you had a good couple of days. ", "url": "https://www.reddit.com/r/happy/comments/2towb8/i_just_had_a_great_birthday_weekend/", "title": "I just had a great birthday weekend.", "social_network": "reddit", "user": "REMAIN_IN_LIGHT", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1422247519, "permalink": "/r/happy/comments/2towb8/i_just_had_a_great_birthday_weekend/", "nsfw": false, "first_save": 1635440886.52207, "replies_charged": false}