{"id": "t5_2qh5i_t3_bstdgy", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "TL;DR: Couldn't swim for almost my whole life and panicked when I got in water that is too deep, overcame my fear and swam an entire lane in a pool that was 2,20m deep.\n\nI am a 23 year old male and I've always been ashamed of myself for not being able to swim. My parents did put me in a swimming class when I was six years old, but before I was able to learn the basics, our family moved and money didn't allow them to get me into a swimming class again.\n\nWhen swimming became a subject in PE, I was terrified because I was the only one in my class not able to swim. Therefore, I skipped these classes out of fear of being bullied, which in turn never helped me to finally learn how to swim. Whenever my parents or my big brother tried to teach me, I went into a panic and hyperventilated out of fear that I might drown if they leave me unattended. And so, the years came and went and I still wasn't able to swim. The mere thought of entering a body of water that was deeper than I was tall made my muscles cramp up.\n\nA year ago or so, my big brother, who loves to swim, took me to the pool on a family trip. In the non-swimmer's pool, where I could safely stand in, he showed me the basics, taught me that panicking only make matters worse and was overall very patient with me. However, I still chickened out when he asked of me to go to the swimmer's pool.\n\nAfter a rather bad exam yesterday, I had to unwind a bit. At a whim, I decided to go to the nearby indoor pool and just sit in the water for a bit to just have some time for myself. Since the pool was rather empty that day, I recalled the things my brother has taught me and swam a little bit in the non-swimmer's pool. I don't know how I got there, but suddenly I wanted to prove it to myself I could swim an entire lane (50m) in the swimmers pool. And I fucking did it. Granted, I wasn't the fastest and at the end it felt like my arms were falling off, but the second a panic thought threatened to arise, I concentrated myself on the end of the lane and kept going. When I started to realize I was in water where I couldn't stand in, I was too far inside the pool and just forced myself to keep going instead of giving up then and there.\n\nI felt like I won the olympics when I got out of the pool. Swimming is something a lot of people take for granted, but to me, I overcame a fear I had with me for almost my whole life. And the best thing is: I had fun doing it. And I definitely want to keep going.\n\nThank you, big bro.", "url": "https://www.reddit.com/r/happy/comments/bstdgy/after_not_being_able_to_swim_my_entire_life_ive/", "title": "After not being able to swim my entire life, I've swum an entire lane yesterday.", "social_network": "reddit", "user": "WolfL1nk", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 31, "down_vote": 0, "creation": 1558782855, "permalink": "/r/happy/comments/bstdgy/after_not_being_able_to_swim_my_entire_life_ive/", "nsfw": false, "first_save": 1635441312.2195535, "replies_charged": false}