{"id": "t5_2qh5i_t3_9amg6w", "request": ["a8d9fccd-13d1-43e0-bbac-4d4282b21bb6"], "text": "Apologize for mobile, bad capitalization and possible grammar, yadda yadda...\n\nI've had an amazing day and I felt like I should share....\n\nMy husband was super sweet and loving this morning ( including getting some yesss lol), I head to work, a place that I only work 1 or 2 days a week normally because I have 2 jobs. \n\n(I should preface this next part: I am in the service industry so if some of this sounds odd that's why)\n\nRun into a friend at the busstop, happen to get a ride to work from a  different co-worker, all good, hang out for an extra minute but have plently of time to get breakfast.\n\nGo to breakfast, and happen to get a good friend of mine as my server, win win, and run into an old couple of regulars whom I catch up with pretty enthustically.\n\nSo: 5 friends I haven't seen in months, plus a good morning with my man, shit is going great! \n\n I head to work, after stuffing myself like a turkey, come to find out, its my favorite manager. \n\nOn top of this, I get a better set of tables then I originally had, and get the pleasure to work with about 10 more people that I normally wouldn't see, and in fact, haven't seen for multiple months at this point. \n\nAll of the love I got, and a slightly mythic status in the eyes of the newbies, felt great. Even above that, helping them l, despite not knowing their names, (new people in a place im barely at gimme a break lol) , I felt like a king!\n\nAwesomeness on top of that.. all of my tables loved me, and I got some regulars I never see. \n\nKeep this train going right??  Right!!\n\n So I get done, a friend of mine whose birthday was about a week ago, was getting done at the same time so I suggested a hang out/lunch. \n\nI haven't talked to him alot lately, but him and I have been great friends for 3 years, it was more a matter of bringing each other up to date.\n\nWe did that and more, hanging out, getting food, talking about deep stuff, and even the philisophical ends of it. Another awesome great bonding time.\n\n But wait there's more!!\n\n Go shopping, get a great dinner to make and get to spend some time with the love of my life whom began this day, I'm a very lucky girl. \n\n\nSome great salmon, rice, and asparagus for dinner with some funny tv as the cherry on top. \n\nI've had an amazing day, I honestly don't care if anyone likes this, its more a happy venting. \n\nI appreciate every bit of love I've gotten today and I'm so thankful to know so many wonderful people.", "url": "https://www.reddit.com/r/happy/comments/9amg6w/i_had_the_best_day_ive_had_in_a_while/", "title": "I had the best day I've had in a while...", "social_network": "reddit", "user": "oh_hmmmmm", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1535348867, "permalink": "/r/happy/comments/9amg6w/i_had_the_best_day_ive_had_in_a_while/", "nsfw": false, "first_save": 1635442244.0775197, "replies_charged": false}