{"id": "t5_2qh5i_t3_ez6m4o", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a"], "text": "Didn’t know where to post this so I just looked up keywords to find somewhere.. came here. \n\nI’ve been having the worst anxiety at night recently for no apparent reason. My hubby falls asleep before me. \n\nIt was particularly bad last night and in his sleep, he flopped over, garbled out “I love you.” And held onto me... I asked him several times what he said, what he was doing, etc. No response. Finally, I leaned my head into his chest and listened to his heart’s calm beat. I immediately felt  a wave of tiredness and fell into a peaceful sleep. \n\nI woke up this morning and he had no recollection and seemed shocked to find out about it. He kept telling me I should’ve woken him up, no matter how deep in sleep he was and he would’ve helped. I reminded him that he kinda did even without realising. Even while asleep, he was trying to comfort me.\n\nHe was getting ready for work while I made his breakfast and immediately dropped his bag to hug me from behind around the waist and tell me it would be okay, he’s there, etc. I thanked him but told him if he didn’t let go and get moving, he’d be late for work. His response?\n\n“Some things are more important.” :^)\n\nI always help him in the morning before work and he kept stopping me to hug/kiss/or just screw around with me to make me smile/laugh. I was so worried he’d be late but it seems he JUST made it in time. Before he left, he declared we were having pizza, beer, and watching some anime when we’re both home tonight and I just got so happy over the idea of him thinking ahead for “us time”, even though it’s not really a new thing. \n\nIdk man I just had to post this because literally just being around him is the best and makes me all fuzzy... even 8 years later. It still feels like when we first met. Idk how I got so lucky. \n\nEven when he left, he texted me the same stuff he was saying and.. my heart is happy.", "url": "https://www.reddit.com/r/happy/comments/ez6m4o/some_things_are_more_important_the_little_things/", "title": "“Some things are more important” - the little things mean a lot.", "social_network": "reddit", "user": "xOrionis", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 12, "down_vote": 0, "creation": 1580892439, "permalink": "/r/happy/comments/ez6m4o/some_things_are_more_important_the_little_things/", "nsfw": false, "first_save": 1635439355.3582907, "replies_charged": false}