{"id": "t5_2qh5i_t3_7uomd1", "request": ["e660e09a-842d-44ca-8826-ddfa61319574", "258e332d-215f-495f-8bee-bccd57229f62"], "text": "Hello Reddit!\n\nI’m typically not one to post a lot on Reddit, but for this, I just couldn’t help it!\n\nMy husband I got married in September and I really can’t stop thinking about it or stop looking at the pictures! I wanted to share a few of my favorite pictures and moments. \n\nhttps://imgur.com/a/6bJ2l\n\nA little information about some of our accessories:\n\nThe bouquets were all hand-made by my stepmom. They were made from origami paper flowers and comic book pages. The handle is the bottom of a lightsaber toy. The groomsmen all received a smaller version of the comic book flowers, also with the bottom of a lightsaber.\n\n(not sure if you can tell from the photos) The centerpieces also feature 3 comic book flowers, with DnD dice in the vases, instead of the usual decorate stones. All of our tables were named after famous couples in pop culture (i.e., Jack and Sally, Superman and Lois Lane, Cinderella and Prince Charming, Jim and Pam, Leslie and Ben, Han and Leia, etc.). Each table also received a disposable camera and wedding themed mad-libs. Hilarity ensued. \n\nA friend in the wedding party made the wine, which she personally labeled for us. \n\nYes, the “no admittance except on party business” sign is a Lord of the Rings reference! Also hand-made. \n\nBonus: watch me Rick Roll my husband during our vows\n \nhttps://vimeo.com/234393440#t=979s \n\nThanks for looking at and reading! I’m just so elated. I wish I could relive it all! \n", "url": "https://www.reddit.com/r/happy/comments/7uomd1/i_got_married_in_september_here_are_some_of_my/", "title": "I got married in September, here are some of my favorite moments from the wedding", "social_network": "reddit", "user": "abraun9346", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 15, "down_vote": 0, "creation": 1517543218, "permalink": "/r/happy/comments/7uomd1/i_got_married_in_september_here_are_some_of_my/", "nsfw": false, "first_save": 1635439395.1773229, "replies_charged": false}