{"id": "t5_2qh5i_t3_jdg1np", "request": ["ea4a7795-7887-476a-9ab2-4c77d117a852"], "text": "Does anyone else feel that it's impossible to feel extended sadness?\n\nI was interested in the extended sadness topic (depression) cos my friend got divorced, but my friend has since been doing better and is on the rise\n\nSo I'm happy about that ofc\n\nI made a few posts on the extended sadness sites  on reddit (like the depression ones) in the past, but I think I deleted them cos they weren't important. This  extended sadness topic has been an entirely closed topic since. I just got bored with it\n\n&#x200B;\n\nAre there anyone here where this secret to perfect happiness does not work for them?\n\n1. You want to be happy\n2. You have a basic understanding of human psychology, and/or life\n3. Your extended sadness is not genetic like most ppl are not\n\nYou got tired of being sad\n\nThat's it. Simple. None more complicated than that\n\n&#x200B;\n\nI watched this best ted talk on the extended sadness topic to see if it would affect me. In the past it'd make me feel sad (with moments of joy cos there are some funny comments)\n\n* Cos when you think sad things, you become sad\n* But when you think happy things, you are pleased, and overwhelmed with delight\n\nBasic human psychology\n\nThis  best ted talk on the extended sadness topic has absolutely 0 impact / effect on me anymore. I'm immune to extended sadness\n\nI'm fine\n\n[https://www.youtube.com/watch?v=-eBUcBfkVCo](https://www.youtube.com/watch?v=-eBUcBfkVCo)\n\n&#x200B;\n\nI'd be incredibly surprised if this secret to perfect happiness does not work for anyone else, just these 3 things  above, at the minimum\n\nI'd be so incredibly confused if anyone could prove that they had these 3, and yet still had extended sadness. That would be humanely impossible. That would be like saying gravity doesn't exist on earth, what.. If anyone had just these 3, they're set for life\n\nI was going to include a bunch more, but then I thought about it, and anyone won't need more than just these 3. They don't even need to have their life goal, that's just a bonus to look forward to =)\n\nDoes anyone else feel that it's impossible to feel extended sadness?", "url": "https://www.reddit.com/r/happy/comments/jdg1np/does_anyone_else_feel_that_its_impossible_to_feel/", "title": "Does anyone else feel that it's impossible to feel extended sadness?", "social_network": "reddit", "user": "happypuppy100", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 2, "down_vote": 0, "creation": 1603026487, "permalink": "/r/happy/comments/jdg1np/does_anyone_else_feel_that_its_impossible_to_feel/", "nsfw": false, "first_save": 1635440220.303065, "replies_charged": false}