{"id": "t5_2qh5i_t3_c1cj7p", "request": ["5b81e8b4-a0f8-4747-8a7a-0e37aae01c43"], "text": "I am really happy about this and I just want everyone to know. \nBut I was bullied my entire school life and ridiculed by my family. My dad said I would never be able to get a job because I had too much anxiety. He would take videos of me having huge anxiety episodes so he could show people at work -- at the business he owned -- (Kind of emotional abuse to encourage BPD in someone) So growing up I was very lonely and always felt inadequate, and I sometimes still am.  I was always the 'weird one'\n\nIt sounds cliche, but I joined a club last year in university, first time in my 21(f) year life. It was hard. With BPD, I wanted to leave so badly, I worried about being judged and felt so shameful. It's very easy to impulsively quit with BPD, but I really really worked hard to keep attending for the first bit because the club itself sounded so cool. I did still feel judged at moments and really embarrassed about myself, but I never left the club because it felt like it didn't matter how weird I am. Again, I felt so welcome.\n\nNow it sounds really cliche, but I had so much fun and felt really welcome. I havent made and real friends from it, but it made a difference. We had teams and soon enough, when we saw one another in the hallways, they would often say hi and maybe have a short conversation, and it would make my day.\n\nOne time when we had our \"milestone\" and presented the work we had done so far (game development club) I had to leave early. But my team told me the other teams were so impressed with the character animations I did. It felt so nice to be noticed, appreciated, and positively reinforced.\n\nEven at the after-party at a resturaunt. I got to sit with 5(!) other people. I was a part of the conversation instead of just sitting there in the background being forgotten. \n\nI had something to look forward to instead of my \"favourite class.\" People listened to my ideas and not ridicule me. I felt like I could still accomplish things even with a lot of anxiety. I was welcomed even for being a little weird. I dont think anyone in that entire club knows how meaningful those small things were to me.\n\nI think people should remember that you never know how significant things like asking someone \"hey, how are you?\" or being a good listener can be to someone", "url": "https://www.reddit.com/r/happy/comments/c1cj7p/the_first_time_i_truly_felt_welcome_and_normal/", "title": "The first time I truly felt welcome and normal instead of ashamed and guilty. Overcoming a lifetime of being put down.", "social_network": "reddit", "user": "Bunninium", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1560706532, "permalink": "/r/happy/comments/c1cj7p/the_first_time_i_truly_felt_welcome_and_normal/", "nsfw": false, "first_save": 1635442976.6917908, "replies_charged": false}