{"id": "t5_2qh5i_t3_c8fdhc", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": " I work at a gas station. About a month ago, I just graduated high school. For some reason, just before graduation, finishing High School pushed me into a deep depression.  I felt like I lost my purpose, my friends, and I realized how much I was going to miss my “old life/friends.” Everyone seemed to have a plan and they were all leaving. Except me. I contemplated suicide multiple times within that month. A week after graduation, I’m working the morning shift at the gas station this man in a little green Acura pulls to pump five, pumps his gas, comes inside. He immediately starts dancing to the radio and singing along. He starts going on about how he wants to go to a karaoke night with his buddies, we go on about our fears and I tell him how I went cliff diving with some friends after graduation and it was the closest I felt to death. You feel the adrenaline, then you jump and get the disorientated feeling from the jump before smacking into ice-cold water, unable to breathe. He was so invested in my story, so invested in spending time out of his day of pumping gas and picking up some quick food to really talk to me. I talk all day to people, but it’s really just me on autopilot behind a register. Nothing like this. I didn’t see him again for two weeks, until I was working the evening shift and opened up the glass door to clean the glass. This man, again in his green Acura on pump five opens up his arms and yells “YOU’RE THE CLIFF DIVING GIRL” I kinda giggled, waved, and went back to clean the glass. Ever since then, I see him twice a week. He never fails to ask about my day in an overly happy voice and has a genuine conversation with me every time. And has now made it a habit to catch me daydreaming looking out the window and give me a little wave and smile before taking off to wherever he may be going. I always look forward to seeing him every shift I work. Thank you 20-year-old something man that drives the little green Acura and is the living version of Chris Trager from Parks and Rec. You kept me going with your smile and happy voice every time you came in and made me feel like even though I don’t really know you, I have someone to talk to. You saved my life. Thank you.", "url": "https://www.reddit.com/r/happy/comments/c8fdhc/to_the_man_who_drives_the_acura_and_never_fails/", "title": "To the man who drives the Acura and never fails to make me smile at work", "social_network": "reddit", "user": "fflowergirl", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 21, "down_vote": 0, "creation": 1562103169, "permalink": "/r/happy/comments/c8fdhc/to_the_man_who_drives_the_acura_and_never_fails/", "nsfw": false, "first_save": 1635440705.1847248, "replies_charged": false}