{"id": "t5_2qh5i_t3_o7c9bs", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "When I was 17 I got a very deep depression and had to leave school due to bullying. \n\nwith alot of therapy and my mom help I got into the night school to complete the 9th grade. Did 2 years and I finished it all except for math. Had to do another year in another school just for that.\n\nThen I decided to do night school again for the 12th grade for 3 years. It was the time of it.\n\nI went to literal hell in this past years for it and never felt better.\n\nI had to deal with a narcisistic mother, a family that blamed me for something nasty I didn't ask for, , a suicide attempt, losing jobs I wanted, unemployment, had to deal with idiots, my own depression that still makes me stay in the couch all day, and a freaking pandemic. \n\nThis school year my job let me go and I decided to go get my yearly social security checks and stay home to study and rest. \n\nI almost failed the second year but turned it around and was actually the 1st one to finish everything. This year I made question of doing the same.\n\nHad an intership also that I finished with a 17 score!\nAnd the lady of the intership told me I might get a 9 month internship in another hotel cause she sees me with a great future! \n\n\nDid 2 school events with my class but I got to take the rains (misspelled I know xp)\n\n\n6 years ago I was depressed and didn't left my house and never thought I could do much. \n\nNow I am 24 and feel like I can do almost anything I put my mind into and I an in therapy and trying to be the best me I can be. My next battle will be losing weight and move out! :)", "url": "https://www.reddit.com/r/happy/comments/o7c9bs/i_am_so_happy_today_i_officially_left_school_for/", "title": "I am so happy!!! Today I officially left school for good. I did my 12th grade like I was meant to do and I love the me that finished it", "social_network": "reddit", "user": "r-ism", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1624579559, "permalink": "/r/happy/comments/o7c9bs/i_am_so_happy_today_i_officially_left_school_for/", "nsfw": false, "first_save": 1635440692.676264, "replies_charged": false}