{"id": "t5_2qh5i_t3_29us37", "request": ["608fc108-cf44-476e-8378-c59ee7483909"], "text": "Not sure if this is the right subreddit for this, but I have a story I want to share with someone because it made me feel awesome. \n\nI can't wrap this up into a story, so I'll just try to give a play by play. But first, some background: I'm a generally depressive mid-20s guy who has never had a girlfriend. I'm not an ugly troll, I just rarely follow through in my pursuits; anxiety is a real bitch. Anyways, like the title says, this could have gone better, but I'll still smile about this for weeks:\n\nTuesday: Meet friends at bar for USA v BEL World Cup game.\n\nWe get really drunk.\n\nChanting, screaming, I lose my voice. \n\nAfter game, I'm headed to show. None of my friends want to see band. I go alone.\n\nI stop at home to get stoned. It's a drone-metal/noisey kinda show.\n\nI was so drunk I wasn't sure they'd let me in\n\nThey did\n\nI go to back of venue near merch setups, back of bar. I'm tall, didn't wanna be in anyone's way just yet.\n\nI'm getting thirsty\n\nI glance over at the bar and spot a gorgeous woman a bit older than me right by the water jug. \n\nShe looks at me.\n\nI look away. *queue anxious feelings*\n\nI'm really thirsty. Fuck it. Was she looking at me, or at the door just past me?\n\nI go up for water. She's unmoved. She probably wasn't looking at me. I resume my post. \n\nShe starts staring at me. At me? Or through the door? I don't know, but if I keep glancing, I'm going to look like a creep. I gotta pee. *I leave to pee*\n\nWhile peeing, I think \"If she's looking through the door for someone she knows, she'll likely be doing that when I get back...\"\n\nI return. She's glued to the show. I refill my water, she smiles.\n\nI smile back, and return to my post. She's looking at me/the door again. I turn. We lock eyes. She smiles. I smile.\n\n**WOAH**\n\nNormally, I'd continue being an anxious pussy. But I immediately downed the water I'd just poured and went back for more. \n\nI introduced myself, voicelessly (I sound like shit) \"I couldn't tell if you were looking at me or at the door, so I figured I'd come over and say hi.\"\n\nShe poured me a cup of water. She told me she was staring at my shirt. We talked about the shirt for a minute and started talking...\n_________________________________________________________\n\nOkay, so that's it. Turns out she had a boyfriend who was on his way to the show. But here's the crazy stuff...\n\nI've felt alone, forever. Foreveralone. This woman was.... ideal. Same favorite bands, same taste in music... Same fields of study. She was in her 30s, she was a professor, she had 1 phd and was earning a second phd in behavioral analysis! She was a knockout. Total babe: smart, funny, sophisticated, gorgeous. And I approached her while drunk and stoned -- typically an anxiety nightmare for me -- with barely any voice to speak with. \n\nHer boyfriend arrived, I stopped flirting with her but we still talked (the three of us) during breaks during the show. \n\nShe told me I was \"Quite an amazing man,\" upon her departure with a handshake, and I'll never forget it. Coming from such an amazing woman... Sigh. \n\n**TL;DR** I'm generally an anxious guy who strikes out miserably and has no game. Earlier this week, I had massive handicaps (drunk/stoned/no voice), and still managed to approach and befriend a woman who seemed to genuinely enjoy my company. Further, she was way out of my league, and if she was single, something tells me I just might have stood a chance. ", "url": "https://www.reddit.com/r/happy/comments/29us37/it_coulda_been_better_but_ill_still_smile_about/", "title": "It coulda been better, but I'll still smile about it for weeks!", "social_network": "reddit", "user": "erawkTHROWSIT", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1404508235, "permalink": "/r/happy/comments/29us37/it_coulda_been_better_but_ill_still_smile_about/", "nsfw": false, "first_save": 1635441492.6553874, "replies_charged": false}