{"id": "t5_2qh5i_t3_5n9ci5", "request": ["8bed9c95-eda8-4aca-9f64-c1f6ec35f283"], "text": "I recently started a new job and it has been wonderful so far! The people are amazing and the job is very low stress. I have been in for training so far and am incredibly happy that they chose to hire me! It is the first job that I have had where I can be me and not worry about having to fake it so I fit in.\n\nI work in the box office for a theater and art gallery. I myself am an artist and having conversations with other workers there is wonderful and fulfilling.\n\nThe individual that is training me is a great personality match for me and is very cheery and pleasant. She is very understanding and helpful. I find myself laughing and smiling often during training.\n\nThe training is very simple and I am having a fun time doing it. Watching the other employees do their job shows how easy it will be to work there. I also get heavily discounted tickets to plays and discounted classes.\n\nMy previous job was incredibly stressful and was slowly killing me. I was incredibly overworked and depressed, had no energy for anything but work. The owner of that business was horrible, mean, and lied way too much. My relationships with my friends and family was suffering. I started drinking heavily. The job was causing me to be a meaner person (which is really out of character for me) due to all the horrible and unhappy people that I had to deal with on a daily basis. I was being harassed by angry people on almost a daily basis with no recourse. I was on the edge of ending it. \n\nI worked there for a year and the owner decided to end my employment due to me taking a coworkers side about the harassment we were being subjected to. I have never been fired before and it made me very upset at the time, in retrospect it was the best thing that could have happened.\n\nI went in for the interview the day after my birthday, got the job in a few days and started 3 weeks after they chose me for the position. This new job has turned everything around for me and I couldn't be happier. I find myself humming and singing to and from work and looking forward to seeing everyone.\n\nI am looking forward to the future and I am excited. Thanks for reading, this is my first post in happy!", "url": "https://www.reddit.com/r/happy/comments/5n9ci5/a_new_job_has_brought_me_unexpected_happiness/", "title": "A New Job Has Brought Me Unexpected Happiness!", "social_network": "reddit", "user": "LucidSage", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1484100235, "permalink": "/r/happy/comments/5n9ci5/a_new_job_has_brought_me_unexpected_happiness/", "nsfw": false, "first_save": 1635442187.5728784, "replies_charged": false}