{"id": "t5_2qh5i_t3_8osqvb", "request": ["cf382ebf-3ce7-40b7-a290-2028168701eb"], "text": "So this post will be long. I'm sorry if my grammar and formatting sucks.I battled with seasonal depression in high school but it got exponentially worse when a family member I was very close to molested me in my sleep. I fought with suicidal thoughts and my depression was worse than ever. I dealt with it alone for the most part because my family made it seem like it wasn't a problem, because it wasn't on purpose (he had been drinking). I didn't call the police because my dad told me I would destroy our family.  I tried to commit suicide at 18 and my mom had me committed to a psych hospital. It helped for awhile but I could never stay positive because my parents still let him live in the same house. I got a lock on my door and that was it. I felt like I was going insane for so long. My best friend at the time took advantage of the situation and talked about how it wasn't as bad as what happened to her as a child. I was being minimized and it was destroying me.When I was 21 the same \"friend\" got me drunk and took advantage of me with her boyfriend's help in their apartment, they filmed it too. She sent me home after that and I got in a car accident which gave me a mild concussion and also intestinal bruising. They texted me the video the next day after I finally got home and I felt so sick when I saw it.  When I confronted her she said I asked for it and told me how could I say otherwise if I was drunk. I stayed friends with her for a year after that because I thought \"Why would a friend lie to me? I had to have asked for it.\" But she started telling other people about it and the story to them was *much* different. One of our mutual friends she told, than told me what she said and I knew I was right. I **NEVER** asked for it and was literally so drunk I couldn't move. I  suffered in silence for awhile until I broke down to another friend. After that I told my parents and the \"friends\" mother too.I stayed in school and managed to get through my associates degree with good grades, seeing I made the Dean's list pushed me to put all of myself in school so I had something else to focus on.A little over 3 years ago I tried to start dating again with no luck, or so I thought. One guy fell head over heels for me (his words) through our conversations over OKCupid. When I agreed to a date and he first met me in person he was so nervous that before I got there he drank some \"liquid courage\" and tried to kiss me way too intense. I felt uncomfortable and I told him I wasn't interested after that. He said he understood, apologized, and asked if we could still be friends because I was an awesome person.He was my friend for 2 years and saw every side of me(emotionally). He said through that, he fell for me more. He knew about my \"baggage\" and thought I was a strong person for telling him. He knew after I told him that I wasn't ready to date and I realized that too.  Through his encouragement I started therapy and it CHANGED MY LIFE! My therapist was so good and I worked really hard to do the exercises she gave me. I made good progress but it was tough. I decided I'd rather feel uncomfortable in the exercises now and push through it rather than be uncomfortable my whole life. I progressed to the point that I felt like a person again.I wanted to try dating but told him it might not last. He told me \"Any time you give me is all I could ask for\".  I graduated therapy January of this year. We moved in together in March, we talk about our future and he constantly tells me he loves me and makes everyday so special. We do struggle with money sometimes, but I know we can push through anything together. It took so long to finally get here, I remember the hopeless times and I'm so happy I made it to where I am today.I'm finally happy! (Again, sorry for the wall of text)  \nEdit:He proposed!  \nAnother Edit:We're Married :)", "url": "https://www.reddit.com/r/happy/comments/8osqvb/my_life_has_changed_so_much_since_i_was_16_im_27/", "title": "My Life Has Changed So Much Since I Was 16, I'm 27 Now And Finally Happy", "social_network": "reddit", "user": "Lady_Azure", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 19, "down_vote": 0, "creation": 1528219877, "permalink": "/r/happy/comments/8osqvb/my_life_has_changed_so_much_since_i_was_16_im_27/", "nsfw": false, "first_save": 1635438912.254149, "replies_charged": false}