{"id": "t5_2qh5i_t3_7rrbv1", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e"], "text": "Hello all:\n\nI don't know if this is allowed, but I'm just so excited. After years of being unable to find an agent who was willing to take the time to actually read anything I sent them, I finally managed to self-publish my first novel today! \n\nBut first, what really makes me happy, is that I didn't do this alone. It's only through the generous donations of friends and family that I managed to come to this point. They helped give me the money needed to hire an artist, get the ISBN numbers, and enough to purchase some advanced copies. \n\nFor years I sent query letters to hundreds of agents and barely got any replies from them that weren't automated responses that showed me no one had bothered to look at what I sent. This was so disheartening and made me want to give up. However, a trusted friend managed to get me back up on my feet and we launched a website together: [StarvingWritersGuild](http://starvingwritersguild.com/index.html)\n\nI have been blown away at how wonderful people have been to me and what I've done and just had to share it with you guys. I'm just so giddy about this whole event that words can't describe it. \n\nFor those interested, this is the blurb for the book, Lost Time: Blake Azarel is trapped in a vampire-infested America. He's now the only surviving member of the Gray Forum, a secret organization sworn to protect the world from supernatural forces. An accident propels him into this bleak future. Join him as he unlocks the mysteries of his past, and confronts the vampires who now control society.\n\nIf this is allowed I'm posting a link to the book here: [Lost Time print copy](http://www.lulu.com/shop/mc-ashley/lost-time/paperback/product-23482544.html)\n\nInside that link is a link near the bottom of the page to the ebook if that's more your speed.\n\nMods, please let me know what is and isn't acceptable for links. I don't want to break any rules just because I'm so excited. Thanks for reading, guys!", "url": "https://www.reddit.com/r/happy/comments/7rrbv1/i_finally_got_published/", "title": "I Finally Got Published!", "social_network": "reddit", "user": "NKSCF", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 23, "down_vote": 0, "creation": 1516465662, "permalink": "/r/happy/comments/7rrbv1/i_finally_got_published/", "nsfw": false, "first_save": 1635438834.8436487, "replies_charged": false}