{"id": "t5_2qh5i_t3_b99dpy", "request": ["89f969a3-3a22-4eff-8a40-d1d5b9658c57"], "text": "This timing couldn’t be better. Well, 5.5 years ago, I was playing baseball on scholarship in my Freshman year, when an injury ended my career and my hopes of free college (which I couldn’t afford otherwise). Thus, I joined the military. I did my stint and now just drill on guard weekends and used the education benefits to go to school, pursuing a degree in Finance. Once it came time to look for jobs/internships in the second half of my college career, life became dreary. I hated finance, I knew I couldn’t work in that field with sanity and I became depressed over it. I had no drive, adult ADHD hit me hard and I really thought about just giving up every morning. Colors faded, hopefulness became dread, I became irritable, and it wasn’t looking up. Then it all happened.\n\nI met the girl of my dreams, who gave me the drive and the reason to push myself to bigger and better things. I went back to what I learned from my military MOS and pursued a career as a Network Engineer. I started working a very good job, a salary I knew I could live on and things began looking up. However, soon after I got a phone call from another employer offering me a job making almost 40% more money in the city I wanted to live in, with much more room for growth. I took it in a heart beat. I absolutely love where I work. Today I got the keys to my very own loft, I’ve paid off all of my debt, I’ve bought my car in cash, and I just had the entire place fully furnished with brand new everything and paid for it in full today. \n\nPicking out the place, the furniture, and taking the job was stressful, but she helped me with EVERYTHING. The anxiety is gone, the depression, the doubt; she lifted this weight off my shoulders without even trying and am still waiting to wake up from this dream I’ve been in for the last two years. \n\nI never thought I could achieve any of this, i worked hard, I kept my head down and just did my job, because I had a reason to. Now it’s just me and my dog in a city I love, hopefully soon to be joined by my beautiful girlfriend (possibly fiancé soon) to continue this journey with me. \n\nI am truly happy. Even though things aren’t working out right now, doesn’t mean ANYTHING. Keep self motivating, find your catalyst to propel you into euphoria. My girlfriend is mine, and if you have also found yours please share in the comments. I’d love to hear what got you all moving forward in life away from those rainy days.\n\n", "url": "https://www.reddit.com/r/happy/comments/b99dpy/after_struggling_and_putting_myself_into_a_hidden/", "title": "After struggling and putting myself into a hidden depression, everything is going right. Find your catalyst to get things moving, I finally found mine!", "social_network": "reddit", "user": "NetworkNooob", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1554360629, "permalink": "/r/happy/comments/b99dpy/after_struggling_and_putting_myself_into_a_hidden/", "nsfw": false, "first_save": 1635440650.1142218, "replies_charged": false}