{"id": "t5_2qh5i_t3_eltcs8", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a"], "text": " \n\nI'm bipolar 2 and I got an episode that  lasted the entirety of December up until yesterday. It was AWFUL. It  set my Generalized Anxiety Disorder on fire and I was crying all the  time, always anxious, sad, I didn't want to do anything - I didn't even  want to shower (I did though, don't worry). It was a very, very  difficult episode. I even had trouble sleeping and through several ways -  sometimes I could only sleep 4 hours, other times it'd take me up to  two hours to fall asleep even though I was tired.\n\nBut  here's where the amazing part comes - my fiancé. He was there  throughout the whole thing and supported me with so much love and  patience. It fills my heart up. There was a day in which I cried six  times and every time he'd hold me with patience and try to calm me down.  One of the times he was in a match of League of Legends ARAM and he  stopped just to hold me while asking the others to wait for just a  second.\n\nThis  Christmas was also my first one without my family. It was just the two  of us. Well, he bought me a whole bunch of little gifts from Wish and  AliExpress and handed them over to me during the 24th (I'm from  Colombia) and I couldn't help but to burst out crying again from  happiness. He got me a Teemo hat and a Fallout bubble head among the  many gifts.\n\nI  just wish I could express to him how much I love him and thank God he's  with me. God knows what'd be of me if he wasn't around. Even small  little things like stopping his gaming to go lay down with me and browse  the iPad so I can fall asleep with someone there awake and know I'm  safe and sound. That's my favorite part. He turns on the lamp and lays  down right there beside me. No complaints about not being able to play,  no whining about being bored... He simply does it. Even if I ask him to  go play his games with his friends. I just love him. I really do.\n\nI'm  sorry if I'm rambling but I really needed to finally rant and vent  about something good after such a long time of crying and being  miserable. If you got to the end, thanks for listening. Goodbye!!", "url": "https://www.reddit.com/r/happy/comments/eltcs8/i_wouldnt_be_here_without_his_help_im_finally/", "title": "I wouldn't be here without his help. I'm finally doing good again!!", "social_network": "reddit", "user": "WarchiefSnorlax", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1578493506, "permalink": "/r/happy/comments/eltcs8/i_wouldnt_be_here_without_his_help_im_finally/", "nsfw": false, "first_save": 1635439351.3552437, "replies_charged": false}