{"id": "t5_2qh5i_t3_q4i5pw", "request": ["cf382ebf-3ce7-40b7-a290-2028168701eb", "2293bc08-7671-4d63-b63f-dbe4a3a4858a", "4ac40434-7819-4123-ba6e-67be5bf90ee7", "d2bf8290-ea9d-4601-bf64-8bb709730ec1", "a8d9fccd-13d1-43e0-bbac-4d4282b21bb6", "e78e5c86-dbf1-4ab8-a98c-e9d544934b7c"], "text": "Here is one philosophical question he answered!        In the Nicomachean Ethics - the book got its name because it was edited by his\nson, Nicomachus - Aristotle set himself the task of identifying the factors that\nlead people to have a good life, or not. He suggested that good and successful\npeople all possess distinct virtues, and proposed that we should get better at\nidentifying what these are, so that we can nurture them in ourselves and honour them in others !      \nWhat are friends for ?  He identifies three different kinds of friendship :there’s friendship that comes about when each person is seeking fun there’s a chief interest is in their own pleasure and the opportunity of the moment which the other person provides . Then there are friendships that are really strategic acquaintances where people take pleasure in each others company only in so far as they have hopes  of taking advantage of it. Then there’s the true friend not someone just like you but someone who is seeing you but about who you care as much as you care about yourself the sorrows of your true friend are you sorrows . their joys are yours . It makes you more vulnerable should anything before this person but it’s hugely strengthening too . Friendship teaches us what we ought to be it’s quite literally the best part of life .", "url": "https://www.reddit.com/r/happy/comments/q4i5pw/aristotle_was_fascinated_by_how_things_work_how/", "title": "Aristotle was fascinated by how things work . How does an embryo chick develop in an egg ? How do squid reproduce? What makes whole society go Well ? What makes people happy ? Philosophy was about practical wisdom !", "social_network": "reddit", "user": "Zack-M-Hidig", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1633772813, "permalink": "/r/happy/comments/q4i5pw/aristotle_was_fascinated_by_how_things_work_how/", "nsfw": false, "first_save": 1635438905.7619948, "replies_charged": false}