{"id": "t5_2qh5i_t3_oan2zj", "request": ["8bed9c95-eda8-4aca-9f64-c1f6ec35f283"], "text": "This day is finally in sight and I’ve been waiting for years and it’s finally here! I am finally leaving the ghetto shithole where I’ve suffered and been depressed and wanted to die for 18 long hard years and moving to a resort town of 1500 people near a beautiful beach. My new hometown is away from all the filthy smog in the city, and overall the attitude of the people is miles ahead of my old place. No longer will I be blankly stared at by losers and degenerates. Nowadays I will be waved at and have pleasant conversation with my refined gentlemanly and ladylike neighbours. Now I can safely go for walks to a quiet park that’s not filled with disgusting people and not have to worry about some asshole’s untrained pit-bull or Rottweiler going nuts and attacking me. I also can walk in peace knowing that there aren’t any dipshits driving full speed while having horrible music on full blast. I can hear the birds singing, there’s ample forest that I can likely go hunting in, and I think my romantic and sexual mating chances are very high since there’s lots of beautiful beach babes down a few blocks from my house :p. I am so extremely hyped to move there, I’ve been depressed and felt unwelcome long enough. Now it is time to live the high life and embrace my true happy self that’s long waited to truly show. Special thanks to everybody who’s helped me at least survive through the doldrums, you all know who you are. This is straight up one of the best things to ever happen to me ever, period. I am thrilled beyond belief. :))", "url": "https://www.reddit.com/r/happy/comments/oan2zj/i_am_so_excited_to_move_to_my_new_hometown/", "title": "I am so excited to move to my new hometown", "social_network": "reddit", "user": "kentuckychicken1987", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 16, "down_vote": 0, "creation": 1625018672, "permalink": "/r/happy/comments/oan2zj/i_am_so_excited_to_move_to_my_new_hometown/", "nsfw": false, "first_save": 1635442176.6161668, "replies_charged": false}