{"id": "t5_2qh5i_t3_ds5wxf", "request": ["258e332d-215f-495f-8bee-bccd57229f62", "af00f57d-0c85-41f5-985c-7cc20793bcbb"], "text": "The past few months have just been consistently stressful and my anxiety has been through the roof. I wrote a pretty bad midterm yesterday which has really been making me feel anxious while I await my results, and I’m especially nervous since I already failed the first midterm despite studying my hardest. I cried for hours after writing it. I’ve been feeling like my best isn’t good enough and it’s difficult to see others succeed around me while I haven’t been getting the same results. I’ve resorted to smoking every night and getting high because it helps numb my emotions, and gives me something to look forward to. I received another midterm mark today and I got a B-!! Even though it’s not an exceptionally good mark, I am so damn happy I’m seeing something other than D’s and C’s. I’m gonna be riding this happy high all night and be productive and get as much of a paper done that’s due on Monday. I’ve decided to stop smoking for now because I realize it’s not a good coping mechanism at all and I hate being dependent on it. Gonna remain optimistic as possible and just get these next few jam packed weeks out of the way before exams. Just had to write this down because I’m proud of myself and I haven’t been proud of myself in months.", "url": "https://www.reddit.com/r/happy/comments/ds5wxf/feeling_the_best_ive_felt_since_starting_my_third/", "title": "Feeling the best I’ve felt since starting my third year in university. Haven’t felt this proud in months", "social_network": "reddit", "user": "Miimmoouuu", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1572989469, "permalink": "/r/happy/comments/ds5wxf/feeling_the_best_ive_felt_since_starting_my_third/", "nsfw": false, "first_save": 1635440708.5504417, "replies_charged": false}