{"id": "t5_2qh5i_t3_gn0bky", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb"], "text": "&#x200B;\n\nhttps://preview.redd.it/gpdm8et97tz41.png?width=750&format=png&auto=webp&s=7e6fdb3579e4a57861dd76bf955043346d6d02b8\n\nHey, Reddit,\n\nafter  almost 3 years of development my first app is now finished and will be  released soon in the App Store. I could not be prouder.\n\nName  of the app is turning point. It combines several apps into one.  Habittracker, calendar, moodtracker and a daily journal + statistics.\n\nI  came up with the idea of the app because it annoyed me to have to use  several apps for my daily organization. Habit tracker for habits,  calendar for appointments, reminders for trivial things (shopping etc.),  mood tracker and diary.\n\nI also had a normal success journal on paper, but I couldn't follow my development there or at least it was very time consuming.\n\nBesides, the number of apps slowly went into the money.\n\nI'm convinced that if you use the app every day, your life will improve significantly.\n\nAt least this is already the case in my life. :-)\n\nWe  also built in a vision board at the beginning, which asks you about  your life goals, annual goals, 3-month goals and monthly goals and which  daily habits you can implement to achieve your goals. These are then  added to your daily dashboard and you can see them at a glance along  with your appointments and normal trivial tasks.\n\nWe  call the app \"Wendepunkt\" - which means turning point in english.  Wendepunkt because it can really change your life for the better.\n\nEach  of these habits that \"pays in\" to one of your goals, we call turning  points, because they bring you closer to your true self. Anyone who has  read James Clear knows about the power of habits and small steps.\n\nYou can assign the turning points in 7 areas of your life to ensure that you maintain an even balance between the areas.\n\nBecause what good is a million dollars in your bank account if your relationships are bad?\n\nThe 7 categories are:\n\n* Physis\n* Emotions\n* Lifetime\n* Relations\n* Career / Vision\n* Finances\n* Spirituality\n\nThere are also 6 daily questions that ask you about your day and your plans for the day. 3 in the morning and 3 in the evening. \n\nWhat you are thankful for, and what you have learned. In this journal you also record your mood, how you felt that day.\n\nOnce a week you will receive 3 more questions that will give you more depth and help you reflect on your life.\n\nIn  each month you can see in which of the seven areas of your life you  have developed. At the beginning you determine your starting point in  the vision board, how you are doing in the 7 areas of life.\n\nI  am honest. I would never have thought that this \"small\" project would  be so elaborate, but the logic and conception was much more extensive  than I thought.\n\nFor now the app is only available in German, but we plan to launch it in other languages as soon as possible.\n\nI know, the app is far from being perfect, but it is honest. :-)\n\nI'm curious if the app will be well received and if it will be able to cover a demand on the need of people.\n\nLet me know your thoughts.\n\nYou  could find Screenshots and Impressions on our website. Sorry that is  all in german, but i guess the purpose of the app will be visible.\n\n[Wendepunkt App](https://wendepunkt.rocks/wendepunkt-app/)\n\nBR\n\nJens", "url": "https://www.reddit.com/r/happy/comments/gn0bky/finally_did_it_i_create_an_ios_app_that_will_help/", "title": "Finally did it. I create an iOS App, that will help to manage your life and reach your goals. Hope it will be a gamechanger for you.", "social_network": "reddit", "user": "Juwax", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 23, "down_vote": 0, "creation": 1589932324, "permalink": "/r/happy/comments/gn0bky/finally_did_it_i_create_an_ios_app_that_will_help/", "nsfw": false, "first_save": 1635438942.6709793, "replies_charged": false}