{"id": "t5_2qh5i_t3_8susn7", "request": ["77a5a12a-14c1-468d-b6d8-4b6928ce40ae"], "text": "Hi, I’m Austin, and I am an alcoholic.\n\nThis is how I started frequent conversations that have been the trailhead to my path of sobriety, self-discovery, reconnecting with God, and eventually personal growth. My path to reclaiming my mental health, growing as a person, and becoming a farmer started with the admission that things were not okay.\n\nI believed I had my life under control, and that picking up two beers and drinking them in the car on the way home from work, only to hide them before anyone could see was “normal”. I thought chronic anxiety and panic attacks were a fact of life. Frustrated and tired were my natural state. I looked forward only to making some extra cash at my second job so that I could waste money without consequence. I was depressed and not willing to admit it.\n\nAfter a 15 hour shift and a mental breakdown at my restaurant job, I proceeded to get drunk to ease the anxiety. I returned home to the mother of my children in the middle of the night ready to argue, and thinking I could wake up and everything would be ok in the morning. Boy, was I wrong. She had enough. I later read that “rock bottom is when the thing you lose, or the next thing you are about to lose is more important than drinking.” I was on a path to losing my family if I kept it up. Little did I know at the time, this would be my rock bottom. I admitted that my life had gotten out of control, and I began to rebuild myself into the person I knew I was meant to be.\n\nA few days later, at 24 years old, I admitted for the first of many times that I was an alcoholic, and that my life had become unmanageable. I immediately quit my restaurant job and reinvested time into myself. I met new and supportive friends through church and Alcoholics Anonymous that showed me love and support only for my desire to improve myself. My best friend (a former drinking buddy) had a small farm that I began to work on to distract myself from the pain and guilt I felt from those I hurt. Growing mustard greens and salad mix together was productive and fun, and gave me a chance to confide in my friend who was there to support me. I slowly began to forgive myself, and tug at the roots of my struggles that had lead me astray. What happened next gave me the affirmation to keep moving forward.\n\nI had been praying every single day, but still carried immense guilt and hurt and begged God, daily, often crying with nothing more than a prayer of “help me God, I’m lost, I cannot do this any longer”. Our church offers a prolonged prayer session at the end of nearly every service, where mellow music plays and members of the church can engage God together without judgment. During this time , I was praying when a woman who I have never seen or met before (and have not seen or met since) approached me with a message, herself crying while she delivered it to me:\n\n“God sees your tiny mustard seed of faith, and sees you tilling your field and removing the rocks from it. Right now, all you see is an empty field full of rocks and roots, but God has amazing plans for growth in this field that is your life. So keep tilling and laboring because one day, the harvest will be plentiful and it will be because you of your tiny mustard seed of faith.”\n\nLittle did this woman know, I had spent the entire day before pulling roots and stones from the ground, and planting …you guessed it… mustard seeds. How could I deny this beautiful gift of affirmation God had given me? I doubled down on my walk with God. I asked for what my next step of faith would be. Little did I know, it was already sitting in my lap.\n\nI spent the next few weeks searching for my “next step of faith” while continuing to pray, and spending my spare time farming. It occurred to me God’s message of the mustard seed had a double (and in hindsight seemingly obvious) spiritual and practical application for my life. I doubled down again and invested heavily in the farm, turning my 1 bedroom apartment into a nursery. I’m officially a partner of Northeast Florida Urban Farms.\n\nSince coming on board with the farm, my life has changed drastically. I am happy again. I look forward to waking up every day and producing food and creating something for myself and others. My mind is alive and my heart is open again. I am able to spend more quality time with my son and can’t remember the last time I had an anxiety or panic attack. My journey has just begun, but I know I am on the right path. I will be 90 days sober next week. I have been faithful and God has returned the favor tenfold. There are still rocks in my field, but the mustard seed has been sown, and I can see the leaves sprouting, bringing new life and growth.\n\nOriginal post on Facebook, but thought reddit would get something from my story also:\n\n[https://www.facebook.com/neflurbanfarm/posts/184293675615922](https://www.facebook.com/neflurbanfarm/posts/184293675615922)", "url": "https://www.reddit.com/r/happy/comments/8susn7/90_days_sober_20_lb_down_started_a_business_with/", "title": "90 days sober, 20 lb down, Started a business with my best friend. How I overcame my depression.", "social_network": "reddit", "user": "neflurbanfarm", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 24, "down_vote": 0, "creation": 1529609507, "permalink": "/r/happy/comments/8susn7/90_days_sober_20_lb_down_started_a_business_with/", "nsfw": false, "first_save": 1635440764.8850749, "replies_charged": false}