{"id": "t5_2qh5i_t3_2tumym", "request": ["8bed9c95-eda8-4aca-9f64-c1f6ec35f283"], "text": "We took a long time to finally find a date and time where our common mates from school to meet up for dinner. We had graduated over a decade ago and had since only met up a few times in the past decade. It wasn't easy as everyone was busy and when we finally got the date fixed, my friend and I was hyped!\n\nMy friend came out to me about a year ago, while all these time I had known that she may have been gay (due to various circumstances). She told me that her resolution this year was to come out to everyone she knows so that she can lead her real life and social media life the way she wants it to be, without hiding or avoiding. \n\nOur school mates were one of the last groups of friends that were 'scheduled' and she had been through the process again and again with her family, closer friends, and her other acquaintances. The good news was that her family were very accepting and loving, and nothing in their relationship had changed when she came out. Some of her extended relatives thought that it was a phase, but they were very polite even though they couldn't come to understand it. The overall experience for her was fairly pleasant.\n\nSo, it finally came around to our common school mates and we met at a restaurant for a hearty dinner. The food was delicious, the mood was awesome, we caught up with each other's life in work and love life. It was simply perfect. One of the mates was kind and asked repeatedly (in a concerning way) on what could be so important that she wanted to talk to us about. We were very chatty and we side tracked a few times because my friend was nervous and I guess that everyone else felt it too.\n\nFinally, she said it. She explained fully that she had discovered herself, she finally knew what she is and what she wants. But she never did say the keyword. My heart was jumping so fast because I realised that if I was in her position, I wouldn't know how to break it! She looked at me and said 'Oh no, I don't know how to do this!' and I jokingly said, \"Well... I could spoil it for you and you'll regret it for the rest of your life.\"\n\nWe laughed nervously while the other mates asked me \"You knew this already? What is it?!\"\n\nFinally, she said \"I realised that I like women.\" She went on to give a very good explanation on when she first noticed/thought of it, how she had initially coped with it, and how she finally decided to come out. It was a well thought explanation and very easy to understand. \n\n\"That's what you wanted to tell us?\" the mates said.\n\n\"Yes! Why are you all so calm about it?\"\n\nEveryone said \"That's because you are still who you are! We are friends just the same, no matter what!\"\n\nThat seriously warmed my heart so much, I think I almost melted at the spot. They asked if she had told her family and they were happy that her family was accepting. They were considerate and asked if there was anyone else in our circle who didn't and shouldn't need to know yet. We even went for some desserts after the restaurant closed and talked about the good ol' days in school!\n\nI am super proud of my friend for having the courage to come out and I am super proud of my mates who were open-minded and caring all the same. I am also honoured to be part of this friend's life, for her to trust in me and our friendship.", "url": "https://www.reddit.com/r/happy/comments/2tumym/i_stood_by_my_friend_as_she_came_out_to_our/", "title": "I stood by my friend as she came out to our common friends :)", "social_network": "reddit", "user": "throwingfeelsaway", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 126, "down_vote": 0, "creation": 1422374675, "permalink": "/r/happy/comments/2tumym/i_stood_by_my_friend_as_she_came_out_to_our/", "nsfw": false, "first_save": 1635442185.3163495, "replies_charged": false}