{"id": "t5_2qh5i_t3_bk9l0b", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a", "258e332d-215f-495f-8bee-bccd57229f62"], "text": "I’m not necessarily a chronically depressed person, but in general I think I’ve always been close to that line. Even when I feel okay, I would describe a happy day as mostly just feeling neutral or content.\n\nI got married a year and a half ago. I love my wife very much and she makes me happy, but relationships take a lot of work; especially for me, being an introvert with a little social anxiety. I struggle to communicate when I know I should be talking more, I miss important cues sometimes, and I can get inexplicably upset over stupid things. I know all of this but it’s hard to change them.\n\nI was very nervous going into this. I wasn’t sure if I would be able to come out of my shell to be vocally supportive during labor, and I wasn’t sure how I would act with my son once he was born. I knew I’d love him but that’s an academic thought more than anything.\n\nThe day that we went in to induce her, I was running on little sleep which made things worse and I expected it to go badly. But as soon as things got going I snapped into it and honestly I think I did a great job. When it mattered the most I did what needed to be done without thinking about how I wouldn’t normally act that way.\n\nThen, 24 hours later, my son was born and I swear it felt like there was nothing in the room except for my wife and my son. He came out wide-eyed, looking around, and very calm. He was the most perfect little baby I’ve ever seen (and I’ve seen a lot).\n\nI feel like a completely different person. I’m smiling so much more. I’m being more vocally loving with my wife (like I should have before). I’ve been singing to him and talking to him nonstop, things that I ordinarily would feel embarrassed about. I’m self-conscious about that sort of thing even in front of my wife and my relatives but with him it just doesn’t even occur to me. I’m holding him right now while he sleeps and he’s just the most precious little angel.\n\nhttps://i.imgur.com/xBR06Dr.jpg", "url": "https://www.reddit.com/r/happy/comments/bk9l0b/my_first_child_was_born_a_week_ago_and_ive_never/", "title": "My first child was born a week ago and I’ve never felt happier in my life!", "social_network": "reddit", "user": "SocialIssuesAhoy", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 21, "down_vote": 0, "creation": 1556896377, "permalink": "/r/happy/comments/bk9l0b/my_first_child_was_born_a_week_ago_and_ive_never/", "nsfw": false, "first_save": 1635439362.0553558, "replies_charged": false}