{"id": "t5_2qh5i_t3_f5txuo", "request": ["d9021d56-8bfa-490f-87b8-52154c0b1b05"], "text": "I've been on reddit for ages and have talked a little bit about being a late bloomer, and falling for my best friend.  She likes me too- but she needs some time after getting out of an abusive relationship. I'm totally on board, we're just going with the flow- she's worth the wait.\n\nMe even liking someone, like that, let alone falling for them is rare- so I've never had someone to share valentines day with in any capacity. \n\nMy birthday is Sunday (Feb 16), we are planning on going to Universal Studios on Saturday and spending the day at Wizarding World. Looking forward to seeing her and my birthday has me all kinda screwed up on what day it is and when what is happening this week. I looked into possibly renting a hotel room so we could go downtown and just have a night to ourselves, then go to the park in the morning but a single night was like $120 for like a motel 6, even more for a nicer place and her apartment is like 30 minutes from Universal. Just not worth it for 1 night. \n\nAny birthday, holiday, or special occasion I've thought about getting her flowers- but when she and the ex were sharing a house, I didnt want to do something nice and have it come back to bite her. \n\nNeither of us are big on Valentines day (me mostly because of my birthday) With Valentines Day so close and her having her own space, I went ahead and bought a dozen roses [pretty cheap, considering they usually jack up prices]  I'm going over Friday night so we can go out whenever we're ready Saturday... and planning on giving her the flowers just because I can actually give her flowers now. Then it hit me, Friday is actually Valentine's day. I get to give her flowers for the first time, On Valentine's Day. O_O Woah. \n\nAfter:\nA pretty great weekend was had\n\nFriday night I arrived around 930pm. Gifted [Valentine's Day flowers](https://i.imgur.com/zjILbK9.jpg) and a 5 pack of Reese's Peanut Butter cups. Neither she was expecting, the flowers alone were enough but I wanted to be able to say I gave her flowers and chocolate. The vase is hers. We stayed up till 1am doing a lot of not much. \n\nSaturday early morning little one came in several times and finally got mom to go sleep with her in her room. I must have missed bestie walked through the bedroom into the living room because around 11am I heard the two of them talking and I assumed she was still asleep or maybe taking a shower considering she'd run out of energy yesterday (it's a thing that happens due to medical issues) When I finally made it into the living room, I got snarked at for sleeping so late even though technically I'd been up for hours. That was smoothed over quickly and she made French Toast for breakfast. It was good!. Put her wheelchair in the back of my crossover and went to the park. \n\nWe both have mobility issues and she suggested we switch of riding and pushing (I was okay with pushing her all day but she wanted to switch off and save us both some energy/pain)\n\nI pushed her from parking through CityWalk. We switched off and went to ride Men in Black Alien Attack, the line took us about 30 minutes we chatted through the whole line, much of the time she kept draping her arms over my shoulders and pulling me into her. The twins make excellent pillows but I would have been just as happy had she not been endowed with such vast tracts of land. \n\nWe took the Hogwarts Express from Kings Cross Station to Diagon Alley, I bought a pumpkin pastie and butterbeer fudge and it was pretty good. We walked around Knockturn Alley. Took the train to Hogsmeade Village and had dinner. Left the park after about 5 hours, drove back into Orlando and a couple drinks at a local pub she's wanted to take me to for at least a year. Went back to the house and started to watch Men in Black International but realize it was almost 11, we were tired and didn't want to be up till 1am. So fixed her window covering to keep out the evil day star and went to bed.\n\nMy birthday: sleep got interrupted by small girl child yet again. \nWe ended up just having a lazy morning. She gave me my present which was Nathan Pyle's \"Strange Planet\" book and then went to get food at a local place that was an independent kinda hipstery place and he food was both very unusual but very good. At breakfast she admitted to ordering the book within minutes of me telling her I liked it and considered buying it but hadnt done so yet.\n\nWe went back to the house and watched Men In Black international in it's entirety. About 3pm I left to drive to Daytona to visit my parents (My twin lives there, and so does my mom and her birthday was Today/Monday)\n\nSunday night: We went to New Smyrna Beach for dinner. The place we chose was right next to the airport, and we got to see the Goodyear Blimp land after the Daytona 500 was postponed due to rain.\n\nMonday Morning: We got to see a SpaceX rocket launch then went to brunch with mom and the twin. Mom and I went to Starbucks before I packed up to come home.\n\nAll in all, I'd say the weekend was a success.", "url": "https://www.reddit.com/r/happy/comments/f5txuo/had_an_amazing_valentines_day_and_birthday_weekend/", "title": "Had an amazing Valentine's day and birthday weekend", "social_network": "reddit", "user": "reddituseranyonymous", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1582041756, "permalink": "/r/happy/comments/f5txuo/had_an_amazing_valentines_day_and_birthday_weekend/", "nsfw": false, "first_save": 1635442646.1258595, "replies_charged": false}