{"id": "t5_2qh5i_t3_fafj9", "request": ["f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "My girlfriend (whom also happens to be my wife) and I are expecting a baby. Have been for 26 weeks minus one day now. This morning we had a planned midwifery visit. It turned out my girlfriend had a blood pressure that was pretty high. The midwife made us an appointment with a gynecologist in the local hospital. There, they took a blood sample and – a little while later – we met the gynecologist. He measured her blood pressure again, which had risen to very high levels then. It was 170 over 110, which is called severe hypertension. Severe *pregnancy-induced* hypertension, in the case of my girlfriend. (This is also called eclampsia. The condition, not my girlfriend.) Also, she had proteins in her urine. Something she didn't have before now; she developed all of this only recently. Weird, but it could happen to anyone, we were told.\n\nAnyway, the gynecologist was alarmed and immediately did an echoscopy, which showed a severely limited umbilical blood pressure. We were told this was dangerous, because the baby's blood and oxygen supply was being limited by this. And because of that, he had my girlfriend hospitalized. Man, were we dumbstruck. And then it got a bit nasty. She got all these infusions with heavy medicine, meant to bring down her blood pressure and to prevent epileptic seizures (the used magnesium for that). (She isn't epileptic, but those seizures can apparently be caused by severe pregnancy-induced hypertension.) We were told this was all extremely important, as otherwise things could get dangerous for either my girlfriend or the baby. Or for both.\n\nThe magnesium was getting my girlfriend all woozy and got her severe heat attacks, headaches and caused her breathing to get quite heavy. Then the doctors gave her a shot that would prepare the baby's lungs for premature birth. They explained that they hoped the baby would not have to be born for quite some time, but that the high blood pressure was a severe risk.\n\nSome time later we learned that the hospital we were in doesn't have the means to deliver and nurse such young babies. So after my girlfriend's blood pressure was stabilized at 160 over 100 she was transported to an academic hospital by ambulance. I drove there in our own car, which gave me the opportunity to play some Madrugada at full blast. That cleared my mind for a bit, which was good. When I got at the other hospital, she was already there, of course. She was being treated well, for all I could see. She had another echoscopy, the results of which looked a bit better than the ones we got earlier.\n\nWell, all in all it seems to be relatively okay now. (I'm at home at the moment, as I couldn't stay in the hospital. It's nearly 2:30 in the night. I'm dead tired but I couldn't really sleep yet.) It's just that this all came extremely unexpected. My girlfriend will go from a 40 hour work week to complete bed rest. It's likely she'll be in hospital until the baby is ready for delivery. Hopefully that's still some time off, as every day it stays in the uterus is a better chance of it being born healthily. The uterus is the best incubator, as the doctors said.\n\nI'm a bit shaky. Although that might just was well be from the cold as from all the sudden changes and seemingly bad news. The weird thing is that I have no idea how I should be feeling. I have a wife in hospital that has eclampsia, carrying a baby that's way to young to be delivered, but might still have to get out one of these days. The only way the hypertension will go away is to give birth, the doctors said. It's the pregnancy that's causing all this and there's nothing that could have prevented it from developing. It's just bad luck. Anyways, I wanted to get this off my chest. It's weird how fast all this is going. I have no idea what's going to happen now. We'll do this day by day, I guess.\n\nBy the way, there's this strange and fatalistic voice inside me that's been saying all day long that as long as my girlfriend gets through this and will be all healthy again, it doesn't really matter what happens to the baby. One of the things that could happen is that it might not survive. That's a real risk, we were told. I *know* that and still I don't really care; *just get my girlfriend through this!* She's really all that matters now. For me, anyway. Is that wrong?\n\nI have no idea if I have been making any sense in this story, but it's good getting it off my chest here. So thanks for reading. Or not. I don't think I really care at this moment; I just want my girlfriend to be healthy. And *fuck*, I'm really tired now; I'm off to sleep.\n\n**EDIT (2011-02-04):** She now officially has the HELLP-syndrome. Darn it! More proteins in her blood, platelet levels dropping fast and pain in her liver. She's also officially twenty seven weeks pregnant today. And the baby is said to weigh somewhere between 900 and 1050 grams. Perfectly along the curves. No lagging behind in growth, luckily. And it moves a lot. The doctors say that a baby only moves around a lot in the uterus when it's comfortable there. So yay, there are still some positives here. Also, I'm hearing a lot of stories where situations like ours turn out fine in the end. That's not to say ours will, too, but it *does* give us some hope. So here's hoping some more...", "url": "https://www.reddit.com/r/happy/comments/fafj9/i_could_use_some_happiness_right_now/", "title": "I could use some happiness right now.", "social_network": "reddit", "user": "Bengt77", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 4, "down_vote": 0, "creation": 1296179167, "permalink": "/r/happy/comments/fafj9/i_could_use_some_happiness_right_now/", "nsfw": false, "first_save": 1635443335.9487312, "replies_charged": false}