{"id": "t5_2qh5i_t3_5n1t1n", "request": ["d181a122-29a9-4a5a-9c58-6b505894c00a"], "text": "I'm exploding with tears of joy, Reddit. I've never cried tears of joy in my life, but today is the day and I love it so much!\n\nMy girlfriend of one month just recently broke up with her boyfriend (one month ago), after some complications (we were still just good friends at this point). She was a little sad but clearly felt a lot better, as he wasn't the nicest man in the world and it was troubling.\n\nI told her that night I'd take her out to Panera Bread as it's her favorite restaurant to help cheer her up. On the way home with her, I was rear-ended harshly, and we had to pull over and follow the drill. I still remember it; I was panicked and afraid (as I'm 16, and just had gotten my license less than a month ago), and she just held my hand so tightly and told me it'd be okay.\n\nLuckily, no insurance was involved (as the people who hit me were also just kids, and they had a repair service to fix their car themselves, and my car wasn't damaged). As we drove home later that night, she asked if we could keep driving around a little bit as she didn't like being at home (little did I know at the time, it was because she just likes spending time with me). I told her we could go see a local lights show (it was around Christmas and there was a cool tour through a small decorated home).\n\nWhen we got out it was -10 degrees, and we decided its best to just stay in the car and observe from the street. I remember she said her face was cold, and I put my hands on it to warm it, which she thought I was going to kiss her (I wanted to, obviously, but was not sure about it all). She blushed like crazy, and I remember asking her what she'd do had I kissed her, and she kept being so blushy and so sweet, and we eventually pulled into a Church parking lot and confessed all of the feelings we had for each other. It was the start of something beautiful.\n\nFast forward, about one month.\n\nOur one month anniversary is in a few days, and today (our last day of winter break), we spent the entire day together. Over the past few weeks, I've spent nearly every day with her. Going out just her and I, with friends to the mall and study sessions, and just cuddling in bed with her, watching Stranger Things and Harry Potter like I told her I would (and loving them both!). I even played her her favorite song on the ukulele. She gave me my first kiss, and I remember it was while we were listening to Hallelujah by Paramore.\n\nToday we spent the day together, we went out to breakfast and spent the day goofing off at the mall, buying underwear and nice new shirts for school, with some food and novelty items and just enjoying each other. When we went home, we popped in a movie but didn't even watch it. We just spent the whole day cuddling and laying in each other's arms.\n\nShe does a lot of activities after school and soon enough, I'll have a job. This winter break has been a lucky time for us to meet, as I've been able to spend day after day with her. Now once school starts again tomorrow, we'll barely be able to see each other other than in school or after school once in a while; even weekends will be often full.\n\nSo on the way home today, she played Hallelujah, and we both got really teary-eyed (admittedly, I got REALLY teary-eyed, still am quite a bit). And then the unthinkable happened.\n\nWe got in ANOTHER car crash. This time, I accidentally rear-ended someone else (slowly, but it was still an impact).\n\nWe pulled over and, since we were already late to her house to drop her off, we were BOTH on the verge of panic on this one. We got out to talk to the guy, almost hyperventilating. A middle-aged man gets out of the SUV we hit, and we both ask if we're okay and begin inspecting the cars (everyone was just fine!). He told me he didn't see anything wrong with his car, and I said the same about mine. He told me I got off lucky today, and that I should be careful and drive slower. He winked and gave me a smirk as he shook my hand and waved goodbye.\n\nWe continued our teary-eyed adventure, flipping out about how our perfect break started and ended with a rear-end car accident. I got her home safe, and then got back myself (as the reason it happened was there's a ton of fresh snow and ice!) in one piece. I told my parents and we all had a great laugh.\n\nMe and her have had some emotional troubles before, even once on the verge of split. But at the end of the way we always make up, we always FaceTime until we fall asleep every night, and she calls me whenever she's upset, even at 4 AM on some days. I've never felt the way I have with her before, and no matter what issues and pains the future brings, I'll be here hand-in-hand with her, enjoying every minute we have together.\n\nSo what do you think, Reddit? If that isn't fate, I don't know what is. I told her we're destined for each other, and she happily agreed. I've got my concerns and fears but, in all reality, I love her to death and will fight to keep her. Whatever it takes.\n\nCheers, friends!", "url": "https://www.reddit.com/r/happy/comments/5n1t1n/girlfriend_and_i_just_had_the_best_winter_break/", "title": "Girlfriend and I just had the best winter break of our lives!", "social_network": "reddit", "user": "Arc_can_saw", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 36, "down_vote": 0, "creation": 1484010174, "permalink": "/r/happy/comments/5n1t1n/girlfriend_and_i_just_had_the_best_winter_break/", "nsfw": false, "first_save": 1635439354.4477496, "replies_charged": false}