{"id": "t5_2qh5i_t3_5m5c5d", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "I'll admit it, I'm an idiot.\n\nI've worked three jobs in my whole life, been to two diffrent colleges (One being a tech school) and nothing worked out. The first college I went to, I stuck with it for 4 years, and then a month before I was going to get my diploma, the campus shut down. Huge downer there.\n\nSecond campus (The tech school) didn't have my major, but I really didn't have a choice there as my student loans were about to go into repayment, and I was unemployed. I was forced to switch majors. It pretty much put me back into my first year with the exception of not needing to take things like math and english again.\n\nOnly, it really didn't work. None of my instuctors were really helpful, nothing of my new major really \"Clicked\" for me, so I just quit and started working.\n\nFirst job was at a gas station. I was a cashier. Everything seemed cool until I had a serious medical problem come up and had to miss work for a week. (Who knew a 140lb guy could be Type 2 diabetic, eh?) My boss called me and pretty much cussed me out for \"Failing\" when \"He needed to be able to rely on me.\" I quit on the spot.\n\nSecond job was a fast food place. We were not allowed to take breaks, and there were some days where they wouldn't even allow us lunch. To top this off, one of the managers HATED me because I needed constant runs to the restroom. (Anyone who has experience taking Metformin knows why.) I... didn't last long.\n\nThird job was a pizza place. I actually quite liked it. At first, I honestly even loved it. I was prep guy. All I did was toss frozen dough into pans and wait for it to thaw before tucking it into the walk-in cooler. The problem? That's *ALL* I did. For *MONTHS.*\n\nI was never really given a chance to move to any other the other stations. I would have loved to work on the \"Make table\" or the \"Cut table,\" but I was too important as prep and dishwasher guy.\n\nAfter a few months of this, I really didn't see the point.\n\nSo, I put in my two weeks.\n\nMy plan? Become a crazy man and work from home. I was going to make Youtube videos and stream to Twitch. I loved video games, and they've gotten me through a ton of shit. I figured if I could some-how get that feeling across to others, I could help them be happy. I could literally make people happy for a living. \n\nSo, today I check my Youtube Analytics.\n\nIt's been three days since my first video upload (I've been uploading daily.)\n\n[I MADE A DOLLAR](http://imgur.com/SdyCqC7)", "url": "https://www.reddit.com/r/happy/comments/5m5c5d/i_made_a_dollar/", "title": "I MADE A DOLLAR!!!", "social_network": "reddit", "user": "Detective_Hacc", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 6, "down_vote": 0, "creation": 1483605975, "permalink": "/r/happy/comments/5m5c5d/i_made_a_dollar/", "nsfw": false, "first_save": 1635440720.128638, "replies_charged": false}