{"id": "t5_2qh5i_t3_oqpe4b", "request": ["b3574414-2d10-4990-bb3e-d9be8a3b6716", "0c4243d9-adb2-4db8-bf87-57a87f62e968"], "text": "My dad passed away when I was 5 years old. \n\nSince then, I've lived my life along side my strong, amazing, beautiful, caring mom and my little sister.\n\nShe served as my boulder in hard time, while she was herself going through a decade long grief. She kept a stoic face for her children when she was hurting inside, working hard in order to give us the best future and the best opportunities as well as a comfortable lifestyle.\n\nMy dad had a best friend, my uncle (also my godfather). My uncle has children, and when he was still alive, we participate din everyone of his family event where I would hang out with my (non biological) 'cousins' all the time. My dad was a big family man and I consider my uncle to be my second father.\n\nGrowing up, I didn't think that having a dad was a big deal. I had lived my whole life (almost) without one, and in my head, I think that my mom serves as both my father and mother figure. But there were times where I would think about my dad, be sad, and wish that I was a daddy's little girl, had a protective father, a dad on whom I could lean on whenever etc... When I watched Disney's The Good Dinosaur or the Lion King I would break down crying because I could truly relate to the story on a deeper level. \n\nToday, my uncle gave me 200 euros and told me he was extremely proud of me as he hugged me. He said it was a present for my hard work throughout the years and for my BAC (a big test 12 graders take in France). I was not expecting this at all. I was happy that my second dad, told me that. And it felt like my own dad was telling me this through him. I felt really emotional. I was extremely happy, and grateful. \n\nI'm still crying writing this and people might not read this but I want to remember this moment forever.\n\nI", "url": "https://www.reddit.com/r/happy/comments/oqpe4b/i_cried_for_40_minutes_after_someone_very_close/", "title": "I cried for 40 minutes after someone very close to me told me they were proud of me", "social_network": "reddit", "user": "sunlight2ureyes", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 39, "down_vote": 0, "creation": 1627130933, "permalink": "/r/happy/comments/oqpe4b/i_cried_for_40_minutes_after_someone_very_close/", "nsfw": false, "first_save": 1635439589.6405091, "replies_charged": false}