{"id": "t5_2qh5i_t3_4660is", "request": ["c889a480-189a-4ed9-aa88-81c300413196"], "text": "Life is so hard sometimes, you know? But I keep having these moments where I just sit here and feel so goddamn lucky. \n\nI am so in love. I love my husband more than anything. My love for him is the strongest emotion I have. \n\nDespite feeling crappy today, I now sit here watching him sleep over skype with my fur daughter next to me sleeping as well and I keep thinking \"this is heaven\". \n\nNothing matters right now, not the problems I have, not the distance between my husband and myself. I get to watch his beautiful face relax in slumber. See his pink lips part ever so slightly so he can breath. Know that his blue crystal eyes are seeing dreams while hidden behind his eyelids. That is the man I love. And boy do I love him. I just want to keep him safe and happy forever. I just want to take care of him. \n\nI am so lucky. I am so happy in this moment. I can't wait for him to wake up so I can hear his voice and see him smile. He has the best smile I've ever seen. And he is smiling at me! Me! I don't know how I got him but I am grateful everyday that I have him. \n\nI love him so much. \n\nI love our little family so much. Just us and the cats. \n\nHe makes me want to be alive. I never thought I'd be this happy. \nThank you my darling. Thank you for everything. \n\nI just had to share with someone. I adore him. I love him so much. I can't say it enough. I'm in awe by how incredible and wonderful he is everyday. He is everything to me. I will forever work on being a better me so I can be better for him.\n\nI love you, I love you, I love you, I love you, it is as if those three words were made for you and yet they don't match how I feel. Every breath is because of you. I love you. \n\nThe cat just jumped away--", "url": "https://www.reddit.com/r/happy/comments/4660is/to_my_sleeping_darling/", "title": "To my sleeping darling", "social_network": "reddit", "user": "stapleherdick", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 10, "down_vote": 0, "creation": 1455675880, "permalink": "/r/happy/comments/4660is/to_my_sleeping_darling/", "nsfw": false, "first_save": 1635441458.6041486, "replies_charged": false}