{"id": "t5_2qh5i_t3_dskkmx", "request": ["23d40627-ba71-4806-9d30-ac350683ef35", "0c94ff33-4b20-4b3e-b14d-1e9d986c7181"], "text": "I met my boyfriend a little over 3 years ago.\nSince the day I met him, he's been the most amazing, kind, sweetest person.\nHe always makes me laugh, he's so supportive of me, he's smart and wonderful, I couldn't have found anyone more perfect.\n\n\n\nThis year, I've been struggling very hard with anxiety. I've had anxiety problems almost my whole life, but this year it's been worse than ever, and I've reached a point where I just can't manage it by myself anymore.\n\n\n\nI had a bit of a meltdown this week. I didn't sleep for a few nights, I was crying all the time, I couldn't eat. I went to stay at my boyfriend's for the night, and I finally broke down and told him what's been going on.\n\n\nHe was so amazing.\nHe told me he'll pay for any counselor or therapist I want to see, since I can't afford it myself right now, and he doesn't want me to worry one bit about the cost.\nHe'll even come along with me if it makes me feel less anxious.\n\n\nHe wrapped me up in a blanket, cuddled up with me on the couch and turned on Planet Earth to distract me. He was telling me so many sweet things all night, reassuring me of how much he loves me, and that we'll get through this together, as a team. \nHe went out and got my favorite takeout for dinner, and I had such a wonderful night with him.\nHe managed to make me laugh a lot, even when I've been feeling so awful.\n\n\nI slept like a baby next to him. I feel so incredibly fortunate and blessed to have such a wonderful partner supporting me. He makes me feel so loved and appreciated, and I feel like I can get through this with him by my side. \n\n\nI just needed to gush a little bit, because I love him so much, and I can't believe I got so lucky. He makes me so happy.", "url": "https://www.reddit.com/r/happy/comments/dskkmx/i_found_the_sweetest_guy_in_the_world_and_i_dont/", "title": "I found the sweetest guy in the world, and I don't know what I would do without him", "social_network": "reddit", "user": "HoundBerry", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 20, "down_vote": 0, "creation": 1573065613, "permalink": "/r/happy/comments/dskkmx/i_found_the_sweetest_guy_in_the_world_and_i_dont/", "nsfw": false, "first_save": 1635440867.1629, "replies_charged": false}