{"id": "t5_2qh5i_t3_fy8bel", "request": ["d9021d56-8bfa-490f-87b8-52154c0b1b05"], "text": "Over the last few months, I've been deeply depressed. This was due to a confluence of several factors, one significant one being the loneliness I feel at never having been in a relationship. I've only ever pursued a few relationships with close friends and not once has it ever worked out. I've tried a bit of casual dating here and there but I always felt a bit out of step with how the dating world works. \n\nThe biggest event that made me feel that something was a bit off was sometime last year, when some friends and I were at a bar. My friend was explaining how to go about meeting potential dates at bars and the like, and he was talking about how you just have to find someone attractive and go talk to them. He asked me about the qualities I find attractive in a person, or what my type is, and I just had absolutely no answers. I tried to explain that I don't really care about looks much, and that I care more about personality and how I connect with somebody. His response was that those are definitely important factors, but when it comes to initiating contact, there needs to be something that draws you together, something that intrigues you about the other person. Not once in my life had I ever experienced a feeling like that, of being drawn to a total stranger, so while I understood the concept he was talking about, the feelings he described were totally foreign to me.\n\nNow, a few weeks back I was browsing reddit. I wish I could remember what sub I was on, but I remember it was just some random, totally innocuous gaming or meme sub. I came across an interesting discussion where people were talking a little bit about this disconnect I've been feeling, and the tendency to be attracted to friends over strangers. That's where the word \"demisexual\" came up, a word I had never heard before.\n\nFor those unaware, a demisexual person is one who requires an emotional bond with another person before they can be sexually attracted to them. It's not a matter of the emotional connection being more important, or valuing personality over sex appeal, or anything like that; without the emotional bond, attraction just simply doesn't exist at all. It's a label that falls on the asexuality spectrum.\n\nI related pretty strongly to this sentiment, and I started reading more about it. The more I read, the more I could relate. It felt like someone was basically writing about my own life. There's quite a few experiences common to demisexual people, like being really uncomfortable when someone you don't know well shows romantic interest or flirts with you. Or finding it really, really rare to have a crush or romantic interest in someone, and feeling it *extremely* intensely when you do. Or just not getting it when people talk about others being attractive or unattractive. I related to all of these experiences completely. \n\nAt this point, I am comfortable with saying that I am demisexual.\n\nFor a long time, I thought I was in some sense broken, or emotionally damaged, for experiencing romance this way. For example, I would always be down on myself whenever something didn't work out with a friend I was interested in; I felt like part of my problem was that I was always getting too emotionally invested before even attempting to act on it. But I learned through all of the reading that I was doing that this is a common thing that demisexual people go through. Due to the way our attraction works, for some there is no middle setting between \"no romantic interest whatsoever\" and \"100% emotionally invested in the outcome of this romantic pursuit.\" It's more like a flip of a switch than a spectrum of attraction and interest. Reading about this, and about how this is more about how I am wired and that there isn't something wrong with me for always getting invested in this way, brought me a lot of peace.\n\nI learned through all this reading that this is an experience shared by many. I'm not broken at all, I just experience love and attraction in a way that's different to most people. There's nothing wrong with feeling this way; that's just how I'm wired. \n\nToday, I told my best friend about this. She's the first person I told, and in addition to wanting to share it with her, I also wanted to tell her as a way of \"trying on\" the label, if that makes sense. I know it felt right to me doing all this reading online, but I wasn't totally confident yet. I wanted to see if it still felt right when I described myself as demisexual to someone else, and explained my experience. And it really, really did. I felt like, for the first time ever, I could articulate exactly how I experience attraction to others, exactly what the disconnect I feel with how most people experience attraction and dating is, and exactly why I've had such a struggle finding someone to connect with in a romantic sense. Being the amazing friend that she is, of course she accepted all of this, asked questions, and listened to all of my experiences.\n\nIt felt *amazing*. I can't overstate how happy I am right now and how genuinely and completely *right* it felt to describe myself with the label of demisexual. I feel like I understand a huge part of myself that I didn't even know existed. I am happier right now than I can remember being in months.\n\nI still have a long way to go, of course; this wasn't a magical cure for depression, and I am still going to therapy to better understand myself and work through a lot of the other issues I've been dealing with. I'm not totally sure if/how to come out to certain family and friends. And looking for love as a demisexual person comes with its own special set of challenges that I don't yet know how to go about overcoming. But I feel like I understand myself in a completely different and deeper sense than I did before, and I feel belonging and validation in a way that I didn't before. Today is the first time I've felt good about myself in a very, very long time, and I'm just so, so happy. It's hard to believe all of this came out of a reddit thread completely unrelated to any of this, but that things like this can happen is one of the many reasons I love this website. Now I can honestly say that it's changed my life.\n\nIf you read all the way here, thank you! I'm just really, really excited about all this and I felt like I absolutely had to share.", "url": "https://www.reddit.com/r/happy/comments/fy8bel/reddit_helped_me_discover_my_sexuality_and/", "title": "Reddit helped me discover my sexuality and understand myself in a totally new way, and I feel incredible", "social_network": "reddit", "user": "SuperGanondorf", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 7, "down_vote": 0, "creation": 1586492887, "permalink": "/r/happy/comments/fy8bel/reddit_helped_me_discover_my_sexuality_and/", "nsfw": false, "first_save": 1635442652.224204, "replies_charged": false}