{"id": "t5_2qh5i_t3_6pdjiy", "request": ["4161666b-4b17-4c22-bb40-42efca26f347"], "text": "It's been a pretty hectic year for me. Last June, I started an internship at an analytics company. A couple of weeks in, my grandmother died and my parents decided to get a divorce. I was able to fly back to CA from Pittsburgh and be there for a few days. I flew back and was able to keep myself going by focusing on my internship and the help of my girlfriend. \n\nI kicked ass at the internship for the rest of the summer and had so much fun doing it that I asked to work part time for the coming semester. They agreed, but were clear that they didn't want to get in the way of my studies. \n\nBut school isn't that fun and I loved the job so much, that in November, I walked into the CAO's office and asked to be brought on full time at the end of the semester. Not only did they agree, but they knew how hard I worked and how adept I was at learning new material that I also received a promotion to the data science team where we use statistical theory and machine learning to build the databases our end users query from. \n\nI know this doesn't sound like the sexiest job in the world, but I'm a bit weird. I've literally wanted to be a data scientist/statistician since I was 5 years old. I would refuse to do art or read stories and instead would find whatever I could and extract/aggregate data from it. My daily routine from elementary school was to go play with my toys and tally all the events, then go onto the family computer, open up Excel, input the data and compare it to the historical data. I had literally hundreds of these spreadsheets by 5th grade. \n\nSo needless to say, I was floored by the offer and took it. Dropped out of school because I loved it so much. \n\nI moved into my girlfriend's place in January and got to work. The company is relatively small (we just hired our 66th employee) and everyone who doesn't work remote is in our single floor along the river in Pittsburgh. [My view](http://imgur.com/G8UUFNj) is possibly the best in the office and really helps me relax. \n\nAnd the people are just so wholesome and kind. I know everybody in the company and they all know me. Every last one of them is a wonderful person who loves their job and is genuinely interested in the lives of their coworkers. \n\nSo when my girlfriend if four years broke up with me in May, my coworkers were kind and understanding. They gave me a bit of space for a few days. And when I made a terrible mistake in my code that week, my boss just said that it happens and forgot about it. \n\nThe breakup has been really hard on me. And I do have a wonderful network of people outside of work, but I generally can only see them on weekends since work can randomly go late if there's an issue with the data. I don't really show how hard it's been on me at work, but mostly because it doesn't feel bad there. I love myself at work. I'm having fun, solving puzzles, and writing code. Sure, there's parts of it that aren't as fun. But the total experience is wonderful. \n\nOn weekends, I generally have fun on Saturdays. But by midday Sunday, I just can't wait to get back in the office. I often just pull up my computer and QC some code or something. \n\nSo today, when we were running up against the deadline and had to work late, I just didn't care at all. I was happy to do it until I became too tired to properly code (that's why this is such a ranty mess). We finished most everything and will wrap up a couple things in the morning. \n\nI always hear stories of people who work a job they hate and how it brings them down. So when life gets in the way, like it has for me over the past year, the negative effect of work on their life cripples them. And literally the opposite is true for me. Whenever things go wrong in my personal life, work is always there for me. It cheers me up, makes me feel meaningful, gives me a sense of accomplishment, and helps me grow as a person. ", "url": "https://www.reddit.com/r/happy/comments/6pdjiy/i_fucking_love_my_job/", "title": "I fucking love my job", "social_network": "reddit", "user": "Admiral_Yang_Wen-li", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 16, "down_vote": 0, "creation": 1500952671, "permalink": "/r/happy/comments/6pdjiy/i_fucking_love_my_job/", "nsfw": false, "first_save": 1635440990.086401, "replies_charged": false}