{"id": "t5_2qh5i_t3_p5lu10", "request": ["410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "I started college in August 2019 and had to take medical leave a few weeks before my first semester ended because I was experiencing severe psychosis and such.  it's been such a rough battle since then but I've started taking control of my life like I never had before.  I don't use eating as a coping skill, I don't self-harm anymore even when I have the urges, I've almost completely eliminated social media from my daily routine bc of how damaging it was for me and now, I'm able to bounce back from any issue with ease!!!  it's such a freeing feeling and it makes me cry tears of happiness!\n\nI'm beginning the process of returning to college and things are all moving so fast and I was worried that my boyfriend and I wouldn't have a place to stay there in town bc I'm going to live off campus until next semester.  we applied for a 3 bedroom house rental with my parents as cosigners and I was so worried that we wouldn't get accepted bc of how strict house rentals are, we have a cat and neither my boyfriend or I had stable jobs right now but we really wanted to avoid apartments bc he makes music and needs the space\n\nless than an hour ago, we got the email that we got approved for the house!!!!  we've been so stressed about it but now that we know we have a place to go, things feel like they really are falling into place!  it allows my ESA, it is less than 10 minutes from school, it's so spacious and an incredible place for our first rental!  my boyfriend have essentially lived together for the past year and a half but this will be the first place we live where it's just us and we have it for at least a year, probably more since I'll be studying!!!  away from both of our crazy families (that we love), back in a city that we fell in love with from the moment we first arrived, back to a school where I felt like I belonged.\n\nthere's so many good things happening but this news just makes me want to shout to the world about how happy I am and how accomplished I feel!!!\n\nthank you for reading :)", "url": "https://www.reddit.com/r/happy/comments/p5lu10/my_boyfriend_and_i_just_got_approved_for_our/", "title": "my boyfriend and i just got approved for our first rental right by my school -- it's a full house!", "social_network": "reddit", "user": "UniDuckaSaurus", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1629138031, "permalink": "/r/happy/comments/p5lu10/my_boyfriend_and_i_just_got_approved_for_our/", "nsfw": false, "first_save": 1635442834.9630947, "replies_charged": false}