{"id": "t5_2qh5i_t3_pn7wtn", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "At the beginning of the year I met a girl and starting on that first night that we met I could feel a connection. Two weeks after we met though, I had to move back home while she stayed at school. We talked every day that I was away until I got the chance to visit her for a weekend. That weekend I found myself realizing how much I liked her and proved to be one of the most memorable weekends of my life and I wished I could relive it over and over. At the end of the weekend, we had no idea when we would see each other again but we continued to talk with hopes that it would be soon. A few weeks later I was offered a summer position at a company located in her home state. I ended up living in a place 10 minutes from her house. This led to the perfect summer, one that you only see in movies. I fell in love, and I fell in love hard. I’ve had past relationships where I believed that I loved them but I now realize that I truly was not because what I feel now is much different than anything I’ve ever felt. After spending the entire summer together, seeing each other every single day except for a 6 day stretch where I went away, I find myself writing this. Now that my work is over and school starts tomorrow, she helped me move into my new apartment and spent the weekend here at school before having to head back home where she works. A few hours ago we said goodbye and she hit the road, heading home for the next few weeks. She’ll be back next month but for some reason this was still the hardest goodbye ever and the only reason I can come up with is that I truly do love this girl with everything that I am", "url": "https://www.reddit.com/r/happy/comments/pn7wtn/finally_realized_what_true_love_feels_like/", "title": "Finally realized what true love feels like", "social_network": "reddit", "user": "bandito692", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1631505475, "permalink": "/r/happy/comments/pn7wtn/finally_realized_what_true_love_feels_like/", "nsfw": false, "first_save": 1635440689.3434405, "replies_charged": false}