{"id": "t5_2qh5i_t3_7oa66y", "request": ["89f969a3-3a22-4eff-8a40-d1d5b9658c57", "c15214d3-1d77-40d5-ad12-df4ba3bdb7b2"], "text": "Like what is even happening right now? I feel giddy and happy. This is the first time I've felt like this since my ex and I broke up over five months ago. I felt like I would never feel like this again. I wanted to die after that happened. I didn't know how I could even function. But here I am. I'm happy. I'm really, *really* happy! \nI've gone on a lot of dates since the break up. A lot of dates. None have made me feel like this. Some were assholes and some were very nice guys. But all just lacked that spark that I felt with my ex. I really thought I would never find that again. \nMy first date with my ex was the best date I'd ever had. The next day, I was smiling and walking around my parent's house replaying the whole night over and over. It was so effortless. I just had genuine fun with him. I've yet to go on a date that gave me that same feeling and I felt like I lost that forever.\nI haven't even met this guy. We matched on Bumble. I had really sworn off online dating, but talking to him has been so much fun. Tonight I called him, and we talked for the first time. I was so nervous, because I hate my voice. But after a couple minutes that insecurity melted away, because we began joking and laughing. The whole conversation was so effortless. None of it was forced. I just am seriously in shock and pure euphoria right now that I'm seriously feeling this again. I've been walking around my apartment, smiling and replaying the whole conversation in my head. No, it doesn't mean something will for sure happen, but I'm really excited to see what could happen. And even if nothing comes of it, at least I got the satisfaction of knowing that I can find this feeling again. I have this satisfaction of knowing I'm not still attached to my ex. For the first time in months, I feel free from the pain that I've been feeling and instead I feel really, really happy. I feel a type of happiness I didn't think I'd ever feel again.\n\nTo anyone going through a break up, hang in there. These words don't mean shit to you, I know, cause I thought the same thing when I was in the thick of my break up. I couldn't get to this point until I worked on getting over him, so really do that. Take all the time you need. Seek therapy. Journal every feeling. Make new friends. Do things you've never done before. I can't tell you when you'll find it again or if you'll find again, but I can tell you that you **can** find it again. But you can't find it if you're still holding on to the past. The famous quote \"when one door closes, another one opens\" is an incomplete quote. The other half of it says \"but we often look so long and regretfully upon the closed door that we do not see the one which has opened for us.\" I wish you all happiness and love. \n\nSweet dreams.xx", "url": "https://www.reddit.com/r/happy/comments/7oa66y/i_just_had_a_two_hour_phone_conversation_with_a/", "title": "I just had a two hour phone conversation with a guy.", "social_network": "reddit", "user": "CreatingCait", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 17, "down_vote": 0, "creation": 1515144777, "permalink": "/r/happy/comments/7oa66y/i_just_had_a_two_hour_phone_conversation_with_a/", "nsfw": false, "first_save": 1635440652.5727265, "replies_charged": false}