{"id": "t5_2qh5i_t3_o4gyk8", "request": ["4f66c88a-a12d-4a1b-ba3c-c329c6b22b5e", "e9d5c1b3-4f2e-427b-a98e-af434f9cf1da", "e78e5c86-dbf1-4ab8-a98c-e9d544934b7c", "f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "Every summer I would get so depressed with trying to find some expensive camp to put her in and have to worry about getting her there and picking her up while I worked full time. Last year she even got kicked out of summer camp but paying  for it was so hard and picking her up with stressful.\n\nThis year her school took care of all of that. They are offering a free summer camp just for the smart kids AND providing transporation!! I really love the transportation factor because I just got a new job and i have no way of picking her up on time, thankfully... they have a special bus just for the kids that will pick them up and take her home. The bus stop is within few of my doorstep so I dont have to worry about her walking home alone either. \n\nIts really like God answered my prayers this year. I stress about summer almost all year and it was great to get a letter that she had been chosen for this special program. I think it was partly because covid had a every kid struggling a bit and left a lot of kids unprepared for advanced placement in their next grade level.\n\nThey will be feeding them for free as well.. another bonus for my pockets. I couldnt be happier for her or more excited!", "url": "https://www.reddit.com/r/happy/comments/o4gyk8/i_am_a_single_mom_and_i_struggle_with_what_to_do/", "title": "I am a single mom and I struggle with what to do with my kid on summer breaks. Well, my child is gifted and this year her school created a free summer camp for kids just like her. I couldnt be happier.", "social_network": "reddit", "user": "ProtocolPro22", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 45, "down_vote": 0, "creation": 1624228876, "permalink": "/r/happy/comments/o4gyk8/i_am_a_single_mom_and_i_struggle_with_what_to_do/", "nsfw": false, "first_save": 1635438827.17453, "replies_charged": false}