{"id": "t5_2qh5i_t3_vdaxa", "request": ["13a1dc62-9ccd-4970-8ffc-a9a073b3ec65"], "text": "shes sweet and beautiful and now she's mine! really excited for whats to come. \n\n  Full Story. I work offshore, and before my last stretch (two months ago) I broke it off with my ex of two years after a long fight of trying to stay together because of our history. There was lots of fighting, lots of arguing, and general anger between both of us. I finally made the decision that I was done with all of it. So I go offshore for a while and come home. Made it back at about 8am, went straight to bed, woke up around 7pm. come downstairs to find my roommate hanging out with two girls in the living room. Do the usual greeting slash my version of early morning banter. They invite me to go to dinner with them. I agree since no plans arose while I was sleeping, and were off. The girls are both absolutely beautiful. One is a small blonde (Karen) and the other is a normal sized brunette (Lacy). so we go to dinner and over conversation I learn that Karen and Lacy had seen My roommate Tommy at a concert the weekend before and knew him from high school. I also pick up that Tommy is hitting on Karen really hard. I talk to Tommy and he says that he though this was supposed to be a date between just him and Karen. I tell him I'll try to assist him with his goal. So I go into the scenario thinking that I'll entertain Lacy for a while so Tommy can do his thing. Basic wing man strategy.\n\n So we go to dinner, everything is going great, then go to a bar and then go back to our house to hang out there. Throughout this time I learn a lot about Karen and find out that she is not into the usual random hookups thing that my roommate is going for, not to mention that Everyone in our area knows of my roommates reputation. So we get a case of beer from the Store and start a mini party at our house. We are all hanging out on the porch swing in the front, listening to music and having great conversation between the four of us. Well we all go inside to take shots and when we come out I am the first outside and sit on the swing. Karen is second out and decides to sit next to me. The other two stay inside for a moment to change the music and mix a drink. I ask Karen about the date and she tells me Tommy has completely got the wrong impression and that she had no intention of this dinner being a date. Well I don't know if it was the glimmer in her eyes, or the beautiful smile she has that can light up a room, but I ended up kissing her on the swing. Just a peck, at least until she grabbed my shirt and pulled me closer. So Tommy comes running outside on the phone and asks us if we want to go to Destin, FL that Night. A mutual childhood friend of Tommy and Lacy had a condo for the weekend and it would only be about a 6 hour drive. So the girls go home to pack, and we pick them up for 1am. So being that I had slept all day, I agreed to drive to Florida since I wouldn't be sleeping anyways. \n\n  When we got out of the car to load the girls bags Karen blitzed the car and called shotgun after realizing I would be driving.  So after about an hour Tommy and Lacy are passed out in the back seat, and It's Lacy and I in the front. We talked all night long about life, music and whatever came up. We realized that we could not have been more different if we tried. The whole time she was clung to my arm softly stroking it. well she eventually fell asleep around 7 and we make it to the condo for 8. Well by that point I am dead, but the five hour energy I drank around 6 isnt letting me get to sleep. So we greet our hosts and then Tommy and I go to the store to buy supplies (booze) for the beach that day. During the ride I tell him what happened the night before and that I think she is into me. He acknowledges it and says he still has a thing for Karen. So I offer him good luck and no hard feelings if either of us come out on top. Well we get back to the beach and I am pooped. so all of that personality and energy that Karen was digging was much more subdued into witty short commentary on others conversations. Tommy Scoops her up and carry's her to the water, and is generally being overzealous about hitting on her. I stand back in the shade, allowing him his opportunity and being tired. well I go back to the condo early to take a nap and get ready for the long night of drinking. About an hour later Karen comes back to the room and snuggles in bed with me. A few hours later we wake up. go out drinking and get back to the room (Skipping lots of Shenanigans in the process here) Tommy is outside smoking a cigarette and Karen comes to me and says, \"Tommy was hitting on me all day, I don't like him, please sleep in the bed with me.\" so I say yes mam and get into bed. Tommy sleeps on the couch next to us and fall asleep pretty quickly. Karen and I stay up talking and hooking up until 3 in the morning. I ask her during our pillow talk if she would have a date with me, when we got back to the real world. She says yes and eventually falls asleep in my arms.\n\n The next morning I went outside with Tommy when he smoked his cigarette and told him that I won, and he graciously agreed to back down. We leave Destin that night and get back to the real world. I asked her to dinner Four days after we got back, because I didn't want to seem over eager. I didn't even text her for fear of scaring her off. The day after we got back she texts me first (never had this happen before) and we start texting back and fourth all day. She mentions that she wishes she could see me before our date. I agree and she comes over to watch a movie and we spend the night together. Our date comes around two days later and It was perfect. and We have been inseparable ever since. the night I posted this originally I was in my bed with her, and she turned to me and said let's make it official. So I agreed and made the original reddit post because I at the time felt like the happiest man in the world. And right now, I still do!", "url": "https://www.reddit.com/r/happy/comments/vdaxa/just_made_it_official_with_the_girl_of_my_dreams/", "title": "Just made it official with the girl of my dreams!!!!!", "social_network": "reddit", "user": "RHGuillory", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 14, "down_vote": 0, "creation": 1340256892, "permalink": "/r/happy/comments/vdaxa/just_made_it_official_with_the_girl_of_my_dreams/", "nsfw": false, "first_save": 1635442936.369785, "replies_charged": false}