{"id": "t5_2qh5i_t3_7cqdc9", "request": ["2778c73c-d71d-404c-b65e-4d85a23ff142"], "text": "I was in a not-at-fault accident just under a year ago and I've been struggling with memory ever since. My short term memory was awful, I forgot all of my friend's names, and it feels like I lost an entire year of school between the accident right before finals and struggling to remember new information. Professor pity and some doctor's notes got me through last winter's finals, and last semester was just me coasting through school and hoping that luck would carry me. It was absolutely horrible, and even though my marks were really good, I felt like I should've taken the year off because of the stress and self-doubt. I honestly told people around me that I felt retarded in the medical sense... slowed down, stupid, useless, and thinking like I was back in grade school and lost all my process from high school onward. I had to re-learn how to do basic math despite acing calculus in my first year of university, I had to re-learn all of my old courses based on old notes, and I spent more all-night study sessions in the living room than I care to admit because I completely lost my ability to focus. But the worst one, I think, was the first time I saw my friends after an accident and realized I didn't know what a single one was named. One of them even had the same first name as me and I had no idea. They tried to lighten the situation and poke fun at it, but I left crying. That came right after my make-up exams and it was the exact moment I realized how much I'd lost.\n\nWell, I'm approaching the one year mark, it's a whole new semester, I just finished my midterms... and I finally feel confident again! I'm able to go into midterms feeling pretty good and I'm getting A's in everything! I'm still struggling with self-doubt, but so far it's all been going fine. I'm not having nearly as much trouble understanding lectures in real-time, my courses are making sense even though they're harder, and I'm actually having motivation to do my work during daylight hours, which is huge. It's still a really big struggle to get anything done before sunset, and I'm still having a lot of moments where I forget how to talk for a bit, but I'm honestly doing so much better, and it's wonderful. I'm remembering things so much more than I'm forgetting them now. There was a long time where I wondered if I'd ever see this again. And it's right now. I never thought I'd be able to take something as simple as short-term memory for granted, but I never will again!\n\nAnother good thing... I got all those names back. I had to re-learn them, but I think I might even have a better grip on them now than I did before. :)", "url": "https://www.reddit.com/r/happy/comments/7cqdc9/my_memorys_coming_back_and_it_didnt_really_click/", "title": "My memory's coming back and it didn't really click until now!", "social_network": "reddit", "user": "TwentyfootAngels", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 42, "down_vote": 0, "creation": 1510607881, "permalink": "/r/happy/comments/7cqdc9/my_memorys_coming_back_and_it_didnt_really_click/", "nsfw": false, "first_save": 1635441325.2147338, "replies_charged": false}