{"id": "t5_2qh5i_t3_1d2jdb", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb", "b85b1267-81b1-400a-957b-30869b4736ea", "e0f6857d-9033-4376-bc53-a3925535aa11"], "text": "I really think he is the love of my life. \n\nIf I do post on facebook or twitter over lovey dovey stuff I keep it to an extreme minimum. People are so annoying with that stuff or are extremely jelly and secretly hate you for being happier than they are. These feelings are crazy awesome and I can't keep them in so this is the place where I can brag. And I am going to let it all out. I now know true love exists on some level. \n\nEverything about him gets me going. It has been 10 months together. We are both in our 20's. He's one of a kind, sassy, hilarious, philosophical, intelligent, and creative. We share similar spiritual, political, and humannist views and argue well. I love having someone to get into exciting abstract discussions with. Gosh, he's just wonderful; knows when to dominate as a man and when to be my equal. He cooks and loves veggies. He is just as excited as I am about hikes and nature and shit. He is so compassionate, honest, loyal, caring. He is the nice guy who he has a mischevious bad boy side.\n\nI love that he is internet culture savvy, as well as, into gaming and its dynamics. He has great taste of expression and style in art, movies, music, words, brandless clothes. His passion is music and it is awesome that he strives to create something new. I love that he knows who he is, is authentic and genuine, and that he has music to really find fulfillment with. Plus, I will always remember the moment of him serenading me in front of a fire place on a mountain of pillows, naked. He truly loves me for who I am, as I do for him. I am a weird, goofy, and unique nerdy, science girl so that really means a lot to find someone to be in tune with. It is so refreshing to have someone to be freely ridiculous and relaxed with. We make each other strive to be better, in an unconscious way. And he looks damn sexy in glasses.\n\nHe is realistic and balanced with his finances, spending within his means, while still enjoying life well. Oh and his beautiful blue eyes, curly dark hair, lips, sideburns, and strong body, arms and hands are the kicker. I just love the way he moves and talks and touches me and does his ridiculous dance moves and expressions. They are just so him... and his smile. I am smitten. Curling up in his arms and waking up next to him is true bliss. \n\nI know I care for him because I feel insecure and vulnerable around him, but I know he really cares for me because he makes me feel secure by doing little things (as I do for him too). He makes me feel like a woman. He'd rather call then text (rare for being 20 year olds right?), which he calls me everyday to tell me I am beautiful and that he loves me so much. Is this for real? Where did such a man come from?\n\nI can't believe he came into my life and that these things do happen. I think we are both so in love that we can't believe the other one loves the other as much as we do them. He is someone I ecstatically want to explore life with.\n\nI AM SO HAPPY ... and this is coming from a person that is very independent, I've been got. I am undoubtedly his =D\n\n\n\nTL;DR: love", "url": "https://www.reddit.com/r/happy/comments/1d2jdb/i_have_never_been_this_in_love_before/", "title": "I have never been this in love before", "social_network": "reddit", "user": "trackflash101", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 13, "down_vote": 0, "creation": 1366874464, "permalink": "/r/happy/comments/1d2jdb/i_have_never_been_this_in_love_before/", "nsfw": false, "first_save": 1635438963.0441208, "replies_charged": false}