{"id": "t5_2qh5i_t3_fogjbf", "request": ["608fc108-cf44-476e-8378-c59ee7483909"], "text": "The last few years have been rough as hell on me. Issues with depression, self harm, and suicidal tendencies, idealization, and attempts. But I survived. I got the right meds, met the right people. I’ve been happy for a long time now. A bit lonely at times, but I know I have people who are there for me. I even moved out, albeit a few years later than some (26) but that made me even happy. Parents home is just too loud, angry, and messy. I have my own place, and with a friend/coworker who cares about me so much. \n\nAnd you know what? For the first time in six years, that person, my friend/coworker/roommate kissed me and told me she was scared to move in with me because she’d fall in love with me, but it’s too late for that now. Y’all, that was the best feeling ever. Actually feeling wanted in a romantic sense? That pushed me over the edge and I’m fucking ecstatic, I’m giddy. Hell, that night my legs were jelly and quivering so bad I thought I wouldn’t be able to walk. And it made me realize just how happy I am with life again.\n\nToday, I got to thinking about everything. Everything that’s happened, and everything that’s going on in life. It’s not just because of the kiss and what she said, I have true friends and family that will always be by my side, I can look in the mirror and be happy, I can smile at myself and think “today’s going to be a great day.” \n\nIt took a long time to get here. I’ve had multiple hospitalizations, I have scars that might not ever fully heal, but I’m okay with that. I’ve had a lot of medication changes, and a couple different group therapy things. Heck, my psychiatrist even said I can call his office if anything is wrong and they’ll get me into contact with him right away. \n\nI’m happy. Truly, utterly happy.", "url": "https://www.reddit.com/r/happy/comments/fogjbf/from_thinking_of_myself_as_garbage_to_feeling/", "title": "From thinking of myself as garbage, to feeling happy and more confident in who I am, and actually dating again!", "social_network": "reddit", "user": "imnotathrowaway2020", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 9, "down_vote": 0, "creation": 1585095578, "permalink": "/r/happy/comments/fogjbf/from_thinking_of_myself_as_garbage_to_feeling/", "nsfw": false, "first_save": 1635441480.7823994, "replies_charged": false}