{"id": "t5_2qh5i_t3_ou9can", "request": ["2293bc08-7671-4d63-b63f-dbe4a3a4858a", "f27fc91b-beee-47e0-9d83-e66829b09dd7"], "text": "Man this is a rant but I'm happy and I just wanna share the story. \n\nSo, making friends as an adult can be pretty hard. Don't get me wrong, I have friends from high school and that I grew up with, but it's also hard to align all our schedules to hang out, or people move, or you just grow distant. My own roommate I barely see because we work opposite schedules! \n\nBut ONE person I kept in touch with, for some reason. We worked at a shitty bar when we were 18, they moved to another state, but we were well acquaintanted, not really even actual friends. And then they moved back like 7 years later and we caught up, acknowledging how odd it is that we stayed in touch. \n\nAnd then, out of ANYTHING, they posted on Snapchat about if anyone wanted to play *Among Us.* And I joined in, much to the mild chagrin of THEIR friend group who immediately were like \"Who the FUCK is TheVampirate?\" But for a time this was how I got to know them all, eventually even landing in their actual group chat. \n\nThis goes on for 2 months and, as they also all lived in the same general area, invited me to a house party. I show up late to a series of goofy drunkards who all lined up and asked me \"Guess who everyone is!\" Such a silly game for a first impression. I did okay. \n\nAnd it's all been uphill since that. I've gotten to know them all pretty well: we go out every week to the same bar, we have themed parties every month, constant random outings for food or park trips, deep and meaningful late-night convos, SO many photos - it's just, fun! A group of mid-late 20-somethings just living up their lives! It doesn't even matter that I only showed up a few months ago, or that some of them have been friends through high school or even elementary - they've basically adopted me in like I've always been there. It's not always perfect of course but, I mean, it's pretty damn good! \n\nThis group really works. And my heart and soul feel a fullness that I wasn't even aware was missing until now. All through sheer coincidence more than anything. Funny how that works! Serendipity or whatever. \n\nYeah, I don't have a good way to end this. I just wanted to share some wholesomeness that's been going on since the beginning of this year. Thanks for reading!", "url": "https://www.reddit.com/r/happy/comments/ou9can/i_accidentally_landed_into_a_great_group_of/", "title": "I accidentally landed into a great group of friends this year", "social_network": "reddit", "user": "LeVampirate", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 25, "down_vote": 0, "creation": 1627602650, "permalink": "/r/happy/comments/ou9can/i_accidentally_landed_into_a_great_group_of/", "nsfw": false, "first_save": 1635441056.6405172, "replies_charged": false}