{"id": "t5_2qh5i_t3_bc6u2u", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "Keeli is a shih tzu and is quite attached to me. The little pooch follows me around the house, to the bathroom, and snores next to me in bed. I love the outdoors and so does she. She's getting older now and can't go quite as far, but man she's definitely still kicking. I got her when she was 2 years old, for my 13th birthday. I'm 22 now. I have managed to keep her with me except for about a 1.5 year period (1 year in the dorms, 3 months in Alaska after graduation, and 3 months where I'm at now in the Turks and Caicos).\n\n&#x200B;\n\nI always feel really guilty about leaving her and can't wait to see her again (on Monday!). I just landed a permanent job in Alaska and that means she gets to come with me. I can't wait. Alaska is the most magical place, especially for dogs. They just roam free and romp through the most beautiful areas. Plus Alaska is pretty cool (physically), and she has a lot of floof. She thrives in cold weather.\n\n&#x200B;\n\nI'm just so excited to get up every morning and take her to Sandy Beach for a little walk, head to work, and come back home and take her for another walk outside. Alaska is the best place for me, and I can just absolutely tell that it will be the best place for her as well. We are going to thrive there together, and I can't wait to give the gift of beautiful walkies and happiness to the gal who has given so much to me over her short little lifetime. I can't count the number of times I've cried into her fur over a boy or been insanely thankful for her little presence when I was feeling too depressed to go outside. When you love something that much, you take it for a walk, depressed or not. She saved me in many ways :) Anything I can do to make her more happy is a fraction of what she deserves", "url": "https://www.reddit.com/r/happy/comments/bc6u2u/im_about_to_bring_my_senior_little_dog_up_to/", "title": "I'm about to bring my senior little dog up to Alaska to live out her golden years and I'm so excited for her.", "social_network": "reddit", "user": "invertednose", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 22, "down_vote": 0, "creation": 1555026079, "permalink": "/r/happy/comments/bc6u2u/im_about_to_bring_my_senior_little_dog_up_to/", "nsfw": false, "first_save": 1635440710.2923214, "replies_charged": false}