{"id": "t5_2qh5i_t3_9e0803", "request": ["d9021d56-8bfa-490f-87b8-52154c0b1b05"], "text": "I just thought I'd share this. No one cares, but I like sharing happy moments with people. \n\nReddit, my wife is so cute. She made my fucking day earlier. She got home from a long shift and just kind of collapsed on the couch. \n\nLast week, we'd gone to the store and she saw some buffalo chicken wings. She got really excited, which is rare. I guess she's been craving them. Anyway, we get home and she opens the container to dig in, but stopped after the first bite. She said, \"Yuck. These are bad,\" and threw them out. She didn't sound upset and even kind of laughed. \n\nSo, I look at her today and I think, \"This woman needs chicken wings.\"\n\nThere's a pizza place nearby our house that's a hole in the wall. Their pizza is amazing and their wings are baked all day. They fall off the bone. So, I discreetly ordered them on my phone. Then, I sneak out the front door. When she asks where I'm going, I just say, \"outside for a second.\"\n\nShe must've known. Because when I turned back around with the food as the delivery guy is leaving, she's at the door, a big smile on her face. I love that smile. \n\nI told her I got wings since the ones she had were crap. She lit up. Actually gasped and said, \"You remembered?\"\n\nIt was so strange. I'm like, yeah. That's such a mundane thing to not remember, but I guess it can go the other way too. \n\nAnyway, just wanted to share!\n\nEdit: haha, guys, she brought chicken wings home tonight because she felt bad for not letting me have any. So, she bought two orders and the kids and I get to share one. She gets the rest. What have I started?!", "url": "https://www.reddit.com/r/happy/comments/9e0803/chicken_wings_are_the_secret_to_a_happy_marriage/", "title": "Chicken wings are the secret to a happy marriage", "social_network": "reddit", "user": "TheRealJackReynolds", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 2205, "down_vote": 0, "creation": 1536367924, "permalink": "/r/happy/comments/9e0803/chicken_wings_are_the_secret_to_a_happy_marriage/", "nsfw": false, "first_save": 1635442637.8434193, "replies_charged": false}