{"id": "t5_2qh5i_t3_flf0yr", "request": ["258e332d-215f-495f-8bee-bccd57229f62"], "text": "So, last night I was playing fortnite with my roomie/our homie and decided to go outside for a cigarette. Sitting on the front porch of our apt complex just past 10pm, an older man walks up the sidewalk maybe 20 feet in front of me. \n\n“Excuse, me, can I ask you a question?” He says. “What?” I say back a little hesitantly, as my city is known for high rates of crime. “Listen, sir, I don’t mean to bother you or disrespect you in any way sir, I’d shake your hand but with all the virus stuff..” — “yeah that’s fine I understand. What’s up?” I ask him. He sits down, “So, I was just released from **** prison and they gave me this,” shows me his release papers and some piece of notebook paper with poorly scribbled instructions, “I just did 6 years and they let me out today and I was down the street at the bars and I asked this man if he could spare me any change, I just need 6.95 for the bus man and he threw a quarter at me and said “here you go n**,” I looked at him in horror as he said that last part, “dude what? are you serious? that’s fucked up man nobody deserves that...” I didn’t know what else to say. He said the bouncer came over and kicked the guy out after witnessing the entire thing. “So please man, I’m hungry, Im tired, I just want to go home and see my family..” he said as he started to cry. \n\nQuick aside, I’m not sure if any of you have seen a grown man cry, but to see that level of despair in a person is gut wrenching. \n\n“Hold on, Ill be right back.” I said “oh, okay, thank you sir.” he said, sitting on the bench still. I went into the complex and grabbed as much change as i could fit in my hand and then looked in my wallet. There was a 20$ bill in it. I stood there for maybe 3 seconds, before grabbing it and stashing it in my pocket. I went back outside, to see him still sitting there crying, head in his hands. \n\n“Hey man, this is all the change I had,” i said, pouring it into his hand “thank you sir really thank you so much,” he started to try and thank me, “but here,” i pulled out the bill, “go home and see your family.” He leapt from his seat and hugged me. “THANK YOU, THANK YOU SO MUCH OH THANK YOU LORD THANK YOU THANK YOU!!!!!” he couldn’t stop himself. “Go home.” I said kindly again as I patted his back, finally being released from the bear hug of a stranger. He started off, still hollering thank yous, literally jumping up in the air kicking his heels with excitement as I walked back inside. \n\nI didn’t tell my roomie or our buddy what I did. I have no idea what that man is going to do with that money. But, I have a feeling he wasn’t lying to me. To open up with honesty about having just been released from prison, I felt like what he said after that was sincere. He just wanted to go home and see his family. \n\nThe world is a very trying place, some of us have it much easier than others. And right now we’re all facing something exceptionally challenging with this global pandemic changing social life entirely. We should always remember to treat our fellow humans with dignity, respect, and kindness, ESPECIALLY, in times like these. We are being tested as a species and we must not fail. We have to work together in order to make it out of this. All over the world, people will lose loved ones. Brothers, sisters, mothers, fathers, grandparents, cousins, aunts, uncles, friends. \n\n“Be kind, for everyone you meet is fighting a battle you know nothing about.” \n\nWe are all entrenched in a battle right now. Divided we are weak, Unified we are strong. \n\nKEEP GOING! LETS GO CHAMP!  NOW GO, MAKE IT A GREAT DAY!!!!! ✌🏻🤟🏻🤘🏻\n\n-Space Jesus, reporting live from somewhere in the universe.", "url": "https://www.reddit.com/r/happy/comments/flf0yr/random_acts_of_kindness_make_you_feel_better_i/", "title": "Random acts of kindness make you feel better, I promise.", "social_network": "reddit", "user": "Spac3xJ3sus", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 17, "down_vote": 0, "creation": 1584642705, "permalink": "/r/happy/comments/flf0yr/random_acts_of_kindness_make_you_feel_better_i/", "nsfw": false, "first_save": 1635440699.855289, "replies_charged": false}