{"id": "t5_2qh5i_t3_psc53b", "request": ["2293bc08-7671-4d63-b63f-dbe4a3a4858a", "e9d5c1b3-4f2e-427b-a98e-af434f9cf1da"], "text": "I've had a fragile ego for a long time, and I've been very insecure about myself. This came with its challenges as I'd never want to be seen as weak. I want to show that I am good at things which made me extremely competitive.\n\nHowever, through differences in my outlook on life and my own growth as a person, I am fixing this. I'm so happy that I am seeking help and tutoring for school subjects that I struggle with, and I don't mind how others view me too much. A toxic personality trait that I had in the past was that I hated to lose to a girl in physical sports or activities: armwrestling or soccer or badminton etc.  It's not a trait that I liked to have, but it was ingrained in who I was. I felt so bad and angry in highschool when I lost my position as a golf captain to a girl who just started playing her senior year because she was naturally gifted, and picked up the sport easily, so much so that even after just one season, she was picked for D2 golf in college.\n\n\nHowever, today, in a small badminton tournament at school, I was obliterated by this one girl in fast badminton and lost 11-1, and I wasn't pissed off or salty. I had a lot of fun, and vsing her just motivated me to work harder and try to beat her next time. I'm not happy that I lost, but I'm happy that I had the opportunity to vs someone so talented. I'm motivated to work harder and get better. I don't mind being seen as weak anymore. I'm happy being who I am.\n\nNo one's good at the start, and sometimes people hit their limits and can't get better, but that's ok. I want to grow to be the best version of myself that I can be. I don't have to be the best person at anything. I just want to be the best me!", "url": "https://www.reddit.com/r/happy/comments/psc53b/im_on_a_journey_to_fixing_my_ego_and_insecurities/", "title": "I'm on a journey to fixing my ego and insecurities; Today, I had a breakthrough that never happened before", "social_network": "reddit", "user": "lazyboy9898", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 15, "down_vote": 0, "creation": 1632201384, "permalink": "/r/happy/comments/psc53b/im_on_a_journey_to_fixing_my_ego_and_insecurities/", "nsfw": false, "first_save": 1635441030.40236, "replies_charged": false}