{"id": "t5_2qh5i_t3_k08ttg", "request": ["1d9bc0bf-4a1c-437e-94e7-5a07c99811fe"], "text": "It makes exactly 4 weeks we met each other.\n\nOne night, I (19 F) was at a friend's place, together with other close friends of mine. We were having fun, until my friend Jo (let's call him that) starts receiving messages from a colleague of ours. He seemed quite lost and we didn't know what to do. He said he needed to leave in 10 minutes. 'Well, okay', we though.\n\nWe resumed whatever we were doing until he had to leave. Then he turns to me and says 'Oh, he (the guy messaging him) wants you to come too'. I was surprised, to say the least, but I accepted. We said our goodbyes and headed out.\n\nOutside, 4 people were waiting for us. They were super nice guys and explained what was going on (a story for another time). Among them was a guy we will call G. I took the time to know everyone (since we were from the same course and all that), but I ended up bonding specially well with G.\n\nHe's 2 years older than me (21 M) and a very interesting person. It was extremely easy to talk to him, which is nice to me since I find it very hard to talk to people I don't know very well (I've been working on it and I'm way better at it now :) ). We bonded over memes, the ultimate bonding material, and he told me some of his traveling adventures. We shares some more stories and all felt... so nice! It was amazing to be with him, like it was meant to be.\n\nLater that night, the group slowly disbanded and he walked me home since it was rather late. We kept on talking all night, it was just that natural. At some point there might have been some crying from my part and a very nice hug coming from his, but our convo was generaly nice and I learnt some very cool stuff from him.\n\nThe clock hits 4 a.m. and we had to say our goodbyes.\n\nThe following day we talked non stop. I felt like a little girl everytime I read his messages. It was such a nice feeling. We talked about how much we enjoyed our late night talk and how much we wanted to talk like that again.\n\nSomehow, I invited him to my house for dinner. We enjoyed each other's company for a while and it was so much fun! We were so very at ease, it was amazing.\n\nHe slept over that night. We cuddled like it was natural to us. And, on GOD, there were so many moments we could have kissed. It was the best feeling in the world, to feel so comfortable with someone.\n\nWe woke up the next morning and I was the only one that had classes, so we cuddled a little bit more. Needless to say I skipped the only class I had.\n\nCuddling eventually evolved to talking about our thoughts. \"Have you thought about kissing me?\", he asked. Thinking back, I would be lying if I said no. But it's not like I want to kiss everyone I cuddle with.\n\nI quickly realised in what situation I had got myself into. I felt so embarased I almost couldn't answer. To think I had fallen for him, specially that fast! \" Well, yes. What about you?\" \"I thought about it too. But do you want to kiss?\" I just nodded. It was all I could do. My heart was racing at this point. But he was super nice to me the whole time.\n\nDays went by and spend more and more time together. I feel like I fall for him more and more every single day. We started by taking things slow, as it should be. Today, we plan on buying promise rings this Wednesday.\n\nAnd that's is that :) He makes me the happiest girl in the world and I make him the happiest boy. Sometimes I think this is too good to be true, like a dream, but when I wake up next to him I want nothing else ♥", "url": "https://www.reddit.com/r/happy/comments/k08ttg/after_a_disastrous_relationship_that_made_me_lose/", "title": "After a disastrous relationship that made me lose hope in love, I finally found love again", "social_network": "reddit", "user": "_mari_fox_", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 8, "down_vote": 0, "creation": 1606237121, "permalink": "/r/happy/comments/k08ttg/after_a_disastrous_relationship_that_made_me_lose/", "nsfw": false, "first_save": 1635440605.4312308, "replies_charged": false}