{"id": "t5_2qh5i_t3_hwdaoc", "request": ["5bcd7a82-c8bf-45e5-9556-cc778b964467"], "text": "Hi everyone, I just wanted to say I am new here so sorry if the formatting is a bit off or any of this is weird but I needed to get it out somewhere. \n\nI (20F) have been dating my boyfriend (21M) for over a year and I can easily say this is the happiest I have ever been. I wake up every day and look over at him and cannot help but get the biggest smile on my face. He is so supportive with everything I do and he helps me work towards achieving my goals and keeps me grounded when my mental health is dipping down. I could go on and on and on for days. I am really insecure about my weight but he reassures me all the time that he loves me and how I look and he likes to make sure I never forget it. Yesterday morning, I woke up to a surprise breakfast in bed of homemade breakfast burritos with all of my favorite ingredients and later on in the day when I was having really bad cramps, he went out and got me “yummy comfort food” which made me feel better. We have spent the past week watching Avatar together every night because I have never seen it all the way through, and it is honestly one of my favorite activities we have done in a while. \n\nI’m really not sure if these are the types of things posted here, so I am sorry if this rambling nonsense is off, but I just can’t hold it in any longer. I am so happy for the first time in so long and I just wanted to share.", "url": "https://www.reddit.com/r/happy/comments/hwdaoc/i_am_blessed_with_the_best_boyfriend_i_could_ask/", "title": "I am blessed with the best boyfriend I could ask for and it has made me happier than I have felt in YEARS", "social_network": "reddit", "user": "istoleyourcats", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 14, "down_vote": 0, "creation": 1595499968, "permalink": "/r/happy/comments/hwdaoc/i_am_blessed_with_the_best_boyfriend_i_could_ask/", "nsfw": false, "first_save": 1635439142.8567545, "replies_charged": false}