{"id": "t5_2qh5i_t3_kccob6", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb", "608fc108-cf44-476e-8378-c59ee7483909"], "text": "When I was in high school I never learned to drive. My parents aren’t together and I think that they were putting the responsibility of teaching me on each other (think “if her dad isn’t contributing the. I’m not doing it” mentality). So when I left home to go to college and started living on my own, I had to rely on friends, walking and the extremely limited public transportation. Eventually I got a bike and used for literally everything for 3 years. Disclaimer: biking in the rain and attempting to go grocery shopping on a bike is not fun lmao.\n\nI moved in with my grandparents due to COVID and I was able to learn how to drive, save up, and get my ideal first car! Honestly, having a car feels so surreal. I don’t have to feel like a burden to people when I need to get somewhere. I don’t have to commute 30 minuted on a bike to get to my job that’s literally minutes away. Yesterday I went grocery shopping and just being able to fit everything in my car as opposed to balancing 4+ bags in my bike basket was enough to make me super happy. \n\nI’m basically at a point where I want to find any excuse to run errands just because I can. I’ve been wanting to get Coffee Bean for like 3 months but didn’t want to ask my grandparents to take me, so as a reward for myself, I’m getting Coffee Bean this morning. \n\nSorry for the long post, but I’m just so so happy I can finally drive!", "url": "https://www.reddit.com/r/happy/comments/kccob6/at_21_i_finally_got_a_license_and_a_car/", "title": "At 21, I finally got a license and a car!", "social_network": "reddit", "user": "veggiebuttt", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 15, "down_vote": 0, "creation": 1607874131, "permalink": "/r/happy/comments/kccob6/at_21_i_finally_got_a_license_and_a_car/", "nsfw": false, "first_save": 1635438940.318718, "replies_charged": false}