{"id": "t5_2qh5i_t3_5j6zoz", "request": ["cf382ebf-3ce7-40b7-a290-2028168701eb", "410541ae-d9ba-4732-8b05-a2de1b3d7065"], "text": "Like many of you, 2016 was not a good year. My girlfriend of 3 and a half years broke up with me [out of the blue](https://www.reddit.com/r/AdviceAnimals/comments/5ecv6h/to_be_fair_i_dont_use_facebook_anymore_so_of/dabqvhs/). In short, a week before we were to set out on my first European vacation, she shows up with a moving van, her parents, and a friend. She tells me she's not happy anymore and it's not my fault (fantastic...). That night they packed up and left my life forever. \n\nI never expected it and it left me distraught. Waking up on my side of the bed only to turn over and feel nothing on the otherside brought me to tears for the first month. Just months previous we were talking about buying a home, marriage, and kids. We did so much future planning together (I now realize how bad of an idea this is). \n\n**Speculation Time** I feel like for 3 years we were in a co-dependant relationship but after she started a new job and met some outgoing work/party kind of people, she no longer was depending on me for her happiness. I on the other hand was losing my friends left and right because I remained in my college town while my college friends left and started careers elsewhere. All I had was her. I spent months reeling in pain from going cold turkey. \n\n**SAD STUFF OVER. NOW HAPPY STUFF.**\n\nOver the past few months I spent time reaching out to my childhood friends who stuck together and all had careers in the big city over an hour away. Being dependant on my girlfriend for happiness, I was getting to the point of neglecting them. However, after the breakup we reenergized our friendship and they proposed the idea of me coming back home. Initially I waved off the idea but it only made sense. Now that she was gone, I had no real reason to stay where I was. The company I currently work for has been fantastic to me but very comfortable and at 26, I need to be more aggressive with my career. This is when I started getting my life back together.\n\nI started my plan of attack. I went to work during the day and studied for interviews in the evening. I learnt new and popular programming frameworks. I spent hours crafting my resume and cover letter (taking advantage of my university's resume review sessions). I scoured the internet for programming interview questions. I even missed out on the whole second competitive season of Overwatch doing this (I will have a gap in my competitive season badges :/). \n\nWhen I felt ready I started applying. Using five separate job boards and 3 talent firms I launch an all out assault on jobs that matched my skill set in that area. No posting went unscathed. It took 5 interviews before I nailed one. I mean, completely nailed. Like I had to design the architecture of a system this company was currently using and to paraphrase an interviewer it \"was almost an exactly replica of the system in place\". I was at the company for hours and met a bunch of higher-ups. A week later I received a job offer with a great pay bump. This company is doing well and the department I am going to work in sounds interesting. I let my current manager know about me leaving. He was knowledgable about what happened and even though he was sad to see me go, he was ultimately happy about me turning things around.\n\nI have made steps to starting my new life and working in the big city. I've learnt many lessons along the way and spent time reflecting on the past. It's a shame what happened but it made me realize the friends I have and how important they are. I am thankful to EVERYONE (yes, you too reddit) who had helped me and encouraged me. The amount of PMs I got were amazing.\n\nOh, and I lost 20 pounds, which is a nice bonus!\n\n**HAPPY HOLIDAYS EVERYONE!**\n\nEdit: For some reason I couldn't make up my mind on tense. Each one I spot I'll fix.", "url": "https://www.reddit.com/r/happy/comments/5j6zoz/after_a_brutal_breakup_i_am_getting_control_of_my/", "title": "After a brutal breakup, I am getting control of my life.", "social_network": "reddit", "user": "Waff1es", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 45, "down_vote": 0, "creation": 1482161889, "permalink": "/r/happy/comments/5j6zoz/after_a_brutal_breakup_i_am_getting_control_of_my/", "nsfw": false, "first_save": 1635438911.0326219, "replies_charged": false}