{"id": "t5_2qh5i_t3_cyf4h", "request": ["371c25be-a874-48a1-8b64-b892630c8aeb"], "text": "I think I can actually make a post now that life isn't so hectic :)\n\nBack in April I was laid off, just a month prior to a 3 week vacation in Sudan. I still went so I didn't look for a job until June. While I was in Sudan during May I spent quite a bit of time with a beautiful woman I had known since I was 8 (our families are friends and had been talking to quite frequently via skype/facebook over the last couple years. Just prior to leaving I more or less proposed to her and she happily agreed! Fast forward to June and I'm back looking at a stack of bills that total just over my bank balance, fortunately I had a friend who owed me money and he paid me back in full immediately giving me some breathing space to hunt for a job. My plan was to work and save up enough money to move to Sudan to be with my fiancée as there was nothing holding me down here except for ~4k in debt (I'm terrible with W4s), so I was going to pay that off then save up 6-8k to take with me to Sudan and get a job.\n\nWhile doing the job search and talking to family, everyone kept telling me not to move to Sudan. I eventually grudgingly agreed, reasoning was that unemployment is around 30% and there are some minor problems with the government (President charged by ICC, Rebels attacking capital, Darfur, etc). I found a job at a very well known company but once I started it was not what I expected, to be vague it was depressing and the work was not challenging. Additionally I worked grave which was not what I wanted when I brought my fiancée over here.\n\nOn top of that I was also working a part-time job, so in total I was working 60 hours a week with a 2 day overlap (most sleep I got on those days was 7 hours total). I was also technically abusing a prescription to be able to pull this off (unknown to everyone except my brother). My fiancée hated that I was working 2 jobs, she especially did not like the night job since I was always tired however I was saving up for a wedding, cost of visa application, and plane tickets for both of us which was quite a bit. I didn't care what it took to get her here so long as it happened as quickly as possible.\n\n\n\nFast forward a couple weeks into that new job and an old friend who I used to work with a few years ago called me up. We exchanged pleasantries and he asked me if I was still looking for a job, I told him I had found a job but it was not working for me, he then informed me that he was quitting his job and he had mentioned to his manager that he knew someone who knew the office and people who could work temporarily until they got someone full-time. I mentioned I wasn't moving to Sudan but actually bringing my fiancée here which sounded even better to him! He told me to send him my resume and he would talk to his manager.\n\n\nA few days later I got a phone call from a recruiter and we scheduled an interview for the following week! Upon arrival to the office I recognized many people as I had worked there before so many of them came up to me and said hello and wished me luck prior to me going in for it, this definitely calmed me down! The interview went amazingly well, exceeding any expectation I had for it and within a few days I got a phone call with an offer! They're paying me far more then I anticipated, to the point of where I'm no longer having to stress about being able to save enough for the wedding and expenses. My fiancée is ecstatic about my new job, especially since I'm not working nights :) I actually feel calm and much more relaxed then I have been in a couple months too! None of my friends have seen me in about 2 months since I was working so much, I was able to go to a barbecue with some friends last weekend and it was great to just relax and enjoy my time with them for once. Even the visa paperwork is mostly ready to be sent in, I'm currently waiting to get my fiancées side of the paperwork then it will all be submitted! After that it's just 6 months until visa approval and she will be here :D", "url": "https://www.reddit.com/r/happy/comments/cyf4h/unexpectedly_got_a_new_job_dont_have_to_stress/", "title": "Unexpectedly got a new job, don't have to stress about wedding now :)", "social_network": "reddit", "user": "Ashex", "subreddit": "happy", "subreddit_path": "r/happy/", "up_vote": 11, "down_vote": 0, "creation": 1281170533, "permalink": "/r/happy/comments/cyf4h/unexpectedly_got_a_new_job_dont_have_to_stress/", "nsfw": false, "first_save": 1635438965.1182022, "replies_charged": false}