{"id": "t5_2tand_t3_q35ayu_t1_hfrw0xn", "creation": 1633639563, "origin": "t5_2tand_t3_q35ayu", "height": 1, "replied_to": "t5_2tand_t3_q35ayu", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Sanne_Reddit", "text": "Hey,  \nit might be a good idea to read about schematherapy. Probably when you have something to do a 'schema' is triggered (a certain thoughts and feelings pattern). Eg.  We all have them, but we all have different ways of coping with them (modi) and yours seems to be avoidant.  \n\n\nExamples of schemata:  \n6. FAILURE: The belief that one has failed, will inevitably fail, or is fundamentally inadequate relative to one's peers, in areas of achievement (school, career, sports, etc.). Often involves beliefs that one is stupid, inept, untalented, ignorant, lower in status, less successful than others, etc.  \n7. INCOMPETENCE / DEPENDENCE ;The belief that one is unable to handle one's everyday responsibilities in a competent manner, without considerable help from others (e.g., take care of oneself, solve daily problems, exercise good judgment, tackle new tasks, make good decisions). Often presents as helplessness.  \n\n\n13. UNRELENTING STANDARDS: The underlying belief that one must strive to meet very high\r internalized standards of behavior and performance, usually to avoid criticism. Typically results in\r feelings of pressure or difficulty slowing down; and in hypercriticalness toward oneself and others. \r  \nMust involve significant impairment in: pleasure, relaxation, health, self-esteem, sense of\r accomplishment, or satisfying relationships. Unrelenting standards typically present as:\r (a) perfectionism: inordinate attention to detail, or an underestimate of how good one’s own\r performance is relative to the norm;\r  \n(b) rigid rules and “shoulds” in many areas of life, including unrealistically high moral, ethical,\r cultural, or religious precepts; or \r  \n(c) preoccupation with time and efficiency, so that more can be accomplished.  \n\n\n15. INSUFFICIENT SELF-CONTROL / SELF-DISCIPLINE: Pervasive difficulty or refusal to exercise\r sufficient self-control and frustration tolerance to achieve one's personal goals, or to restrain the\r excessive expression of one's emotions and impulses. In its milder form, patient presents with an\r exaggerated emphasis on discomfort-avoidance: avoiding pain, conflict, confrontation,\r responsibility, or overexertion---at the expense of personal fulfillment, commitment, or integrity.  \n([https://www.schematherapysouthafrica.co.za/](https://www.schematherapysouthafrica.co.za/) , Oct 7th 2021)  \n\n\nIn schema therapy you will work with a therapist to work on strengthening the 'healthy adult' mode, which you are probably looking to develop more.  \nReading up on this will already help, probably, but working with a good, specialized therapist on this will be greatly beneficial.", "permalink": "/r/DecidingToBeBetter/comments/q35ayu/i_suck_at_being_an_adult_please_help/hfrw0xn/"}