{"id": "t5_2tand_t3_q35ayu_t1_hgioiky", "creation": 1634151953, "origin": "t5_2tand_t3_q35ayu", "height": 1, "replied_to": "t5_2tand_t3_q35ayu", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Sanne_Reddit", "text": "You're welcome.I know the struggle first hand, feeling bad at adultering? adulting?For me a real chance was made when I learned to recognize why I am putting of my tasks. That way I can guide myself way more efficiently.\n\n'Just do it' apparently only works for brand shoes and not actual humans. So when you keep telling yourself that without result, you're only adding to the frustration with yourself.\n\nYou're not broken. You're not stupidly lazy. You just need to learn how your brain is functioning, where your weak spots are and how you can guide yourself on that. And if tools like task manager apps help you, or doing things together with someone, or adding motivation to do something (like inviting someone over so you clean your apartment), use them in your guidance.\n\nWe tend to think we need to be guided by adults when we're young. But when we reach a certain age, we suddenly need to be able to just do all the tasks we have to do. That's not how it works.We need to integrate the guidance we heard as children into our own self talk. When you lacked guidance as a child, or the people that were supposed to learn you to guide yourself (such as parent, teachers, therapists) did an especially shitty job and undermined your own innate confidence and motivation, you have to pick up that task yourself later in life and (re)learn helping and effective self talk, regulation and behavioural patterns.\n\nIt's not an easy job, but it is a rewarding one, since you get to know yourself better and see game changing progress, that you took responsibility for and made possible. That will lead to so much more confidence.\n\nAlso, a thought that helps me from time to time:Putting something off is not only not doing that thing, but it's also strengthening you neurological paths involved in procrastination.And vica versa, every time you do something you said you would do, strengthens the neurological paths corresponding to discipline.The road most travelled is the road that your brain will automatically activate. But these paths are not set in stone. When you use a neurological path less, it will weaken again.\n\nSo every choice does make a difference.\n\nAs you see, I've read a bit about it, since not long ago I've been where you are now. ;)I hope it'll help you on your way. And know that in every moment you can choose again.  \n\n\nThat being said, I'm procrastinating my own adult tasks of looking up job offers. Ouch, hahaha. So I'll take my own advice and go do that now. ;)", "permalink": "/r/DecidingToBeBetter/comments/q35ayu/i_suck_at_being_an_adult_please_help/hgioiky/"}