{"id": "t5_2tand_t3_hdanhf_t1_fvm3sk4", "creation": 1592807615, "origin": "t5_2tand_t3_hdanhf", "height": 1, "replied_to": "t5_2tand_t3_hdanhf", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Reisno", "text": "That is a long story...I was on 20 different medications in the last 10 years and other than modafinil none of them improved anything. I ended up with horrible side effects from most of them that almost completely ruined my life. Depression was a massive issue for me that depleted me on so many levels and I needed something to work, we were ready to try anything and our options were limited.\n\nWith tDCS, my partner and I looked up research and youtube tutorials and testimonials on it. With what we found it was a low risk gamble and some sources recommended it for severe depression.\n\nThen we purchased a tDCS device for $60 roughly, that is what we could afford at the time. It is basically a battery powered box with two sponges attached to it and a dial. Each sponge has a positive and negative charge.\n\nNext we purchased a low end eeg cap and a tight fitting polyester fitness cap, something that really clings to the scalp. I used the eeg cap to measure the specific points on my head to trace onto the fitness cap so I didn't have to remeasure the spot every time I used the device.\n\nI tried one configuration where the positive sponge was on my scalp at a specific/measured point under the fitness cap and the negative sponge was on my forehead but even after a few sessions I started to experience spikes in aggression and irritability. I tried a different configuration where the positive sponge on my scalp and the negative sponge on my upper arm and this set up worked the best.\n\nIt takes a lot of sessions to see any effects and if you don't have the sponges in the right marked places on your scalp then it doesn't work. It takes up to a month of everyday use to see any effects, but after that month of having the right configuration it was like the depression just melted away. It was incredible.\n\nGranted this didn't cure all of my depression related issues but it significantly reduced them and that's the same month when I dropped 20lbs.\n\nThere are a lot of specific details that I left out here or else this would be a much longer post, but this takes a lot of research to do on yourself. You will need to comb through actual academic research to learn how to use this thing properly.\n\nI have really big and fluffy hair so I needed to figure out how to work around that with this treatment, I used conductive gel and saline and parted my hair in that spot for it to work.\n\nThe only side effects I experienced was that I became more sensitive to flashing lights for some months and currently the area where I put the positive sponge on my head feels a bit different, not pain or discomfort but noticeably different.\n\nI haven't had a tDCS session in months now and my depression is still kept at bay. Nowadays I only use it as needed. I tried to get transcranial magnetic stimulation in the country where I am currently at but that was a wild goose chase.\n\nYou can use tDCS for a variety of things, there are so many configurations out there and studies done on them, but you really, really need to put in the time to do the research.", "permalink": "/r/DecidingToBeBetter/comments/hdanhf/i_used_to_be_300lbs_now_i_am_down_to_roughly/fvm3sk4/"}