{"id": "t5_2tand_t3_ik2d85_t1_g3loy5n", "creation": 1598975496, "origin": "t5_2tand_t3_ik2d85", "height": 1, "replied_to": "t5_2tand_t3_ik2d85", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "rock_kid", "text": "Oof, this hit hard.\n\nListen to actions! If they say they love you and don't want to lose you, but also refuse to act in the best interest of your relationship, they're lying on some level.\n\nThis dude. Ugh. He moved out against my wishes when the cheating came to light because he couldn't deal with the consequences. Mind you, I was justifiably angry but wasn't acting in anger when I could help it. I cooked for him, washed his clothes, did his taxes. But one outburst from holding the pain in, to protect his delicate feelings, and I wouldn't see him for a week.\n\nI didn't know where he was living. Still don't. I told him clearly that I believed he was still sleeping around and if he's not willing to come home and live in a separate room (in the basement) to give me transparency, then to please let this end. He would not.\n\nHe swore up and down he wasn't cheating anymore and didn't want to lose me. Wanted to change. Then he came at me with some real bullshit. \"I'm tired of sleeping on couches, but if I move into the basement, there'll be bugs. It's loud, it's dirty. I want to get my own apartment.\" FFS.\n\nHoney.\n\nThis piece of work was a serial adulterer, 13 women over the span of eight years *that he will admit to* and I'm very convinced he was still hiding something more. And then he comes at me trying to convince me to help him pay for a bachelor pad so he can probably keep fucking around, on the basis of \"bugs\". This man should have been begging me for another chance and instead of an apology or change I get, \"there's bugs\".\n\n\"I don't want to lose you\" is coward's speak for \"I'm not willing to change so you should bend for me\" if they don't back it up with actions. If he's not backing up what he says, don't believe him, plain and simple. And tell him that you don't, don't make him guess. I told my ex that I could give him an exact, simple roadmap to work back into our comfortable room together, given time. He was enthusiastic. And then did nothing I asked of him, which was simple stuff like stop fucking your ex and show me where you sleep at night, stop turning your phone upside down on the table the second I come into the room. He's just a mess I can't fix, and finally realized I don't have to.\n\n\"He's his own problem now\" is the most cathartic thing I've ever said in my life.", "permalink": "/r/DecidingToBeBetter/comments/ik2d85/i_decided_to_stop_giving_my_husband_chances_to/g3loy5n/"}