{"id": "t5_2tand_t3_ik2d85_t1_g3lubcj", "creation": 1598977531, "origin": "t5_2tand_t3_ik2d85", "height": 1, "replied_to": "t5_2tand_t3_ik2d85", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "rock_kid", "text": "Let me just say, the fact that you see yourself as having a problem and asking how to fix it is a big step that sets you apart.\n\nBefore I knew about the cheating, a few months back he did something so strange and pretended like it was fine. He got into the habit of going to the \"gym\" before I woke up, and even though his job ended before mine every day, he was never home before me during this stage. Usually didn't come home until sometime between 5-8, when his job let out at 3.\n\nBut we'd message during the day. One day, he just didn't. So I didn't initiate messages, and heard nothing from him. Then, he didn't come home until 11 at night as I'm getting ready for bed. Comes in, changes and gets in bed. No explanation, and went to sleep. Never got a clear answer on what happened then but it was becoming clear he didn't care about hiding his actions anymore. He didn't care that I knew he was constantly lying to me about where he was and what he was doing. That's when I started getting really deep into my depression because *what the fuck*. Who acts like that?\n\nAnyway, to address your question I'd have to understand, like someone else asked, what boxes you check. Because I don't know what you mean, the rest of this advice is generic, not meant as any kind of attack.\n\nOther than that, talk to her. Find out how she's feeling. If she needs more help around the house, talk about it. Rebalance your workloads.\n\nIf you're a gamer, that's great, I am too and think games are a great side hobby to have but that it shouldn't ever take over your life. It shouldn't be the first thing you think of when you wake up or come home, and if it is and you can't put it down after an hour, you probably have an addiction.\n\nThe biggest thing is to talk it out, whatever the problem is, and be willing to adjust to change. You cannot control the other person, and not meeting eye to eye can be really, really frustrating when no one will budge. If she's communicating to you, telling you what she needs and you're just not doing it, for the sake of your relationship and her well-being: examine why.\n\nBecause THIS is the behavior that made me want to kill myself. I did *everything* I could think of to calmly and lovingly, and at other times in pain and with desperation and tears, communicate that my needs were falling so short of being met and I needed help. He emotionally abandoned me when my mother died two years ago. He lost his job due to his own carelessness and wouldn't get a new one, playing games 16 hours a day instead while I grieved, ran a business, worked a job, paid so bills, cooked, cleaned and shopped, cared for his dying pet, and fought against suicide daily. I understand he was in a hard place having lost his job, but it was his in fault, and then he shoveled everything to support us both in every way onto my shoulders during the most difficult time of my life, and then would not help with any of those burdens. My requests were far from unreasonable. Wash your own dishes, get a job, do your own laundry, talk to me. That's it. He wouldn't do any of it and never told me why.\n\nHe sat there silently, every time I begged for change, no matter how I delivered it, and eventually he apologized and left the room. And nothing. Ever. Changed. If I could have harnessed the power of spontaneous human combustion and explode one or both of us, it wouldn't matter who, I wanted to do that so desperately.\n\nIf that's something you do when she says what she needs, maybe you don't know how to do it, or how to want to learn. If that's the case, start by talking to her and then involve a mutual or unbiased party or attend counseling because that relationship still has hope but needs help. But if instead you think her needs are unreasonable and she should just stop expecting things like that from you, you should divorce her before she's destroyed like I was. The only thing I'm upset about, really, is that he didn't let all this come out sooner so I could be less traumatized by the end.\n\nI hope this helps, I know it's a lot to read and it's not very fluffy but it sounds like you need help. I'd be glad to talk further if you want to.", "permalink": "/r/DecidingToBeBetter/comments/ik2d85/i_decided_to_stop_giving_my_husband_chances_to/g3lubcj/"}