{"id": "t5_2tand_t3_ik2d85_t1_g3j9pjp", "creation": 1598920116, "origin": "t5_2tand_t3_ik2d85", "height": 1, "replied_to": "t5_2tand_t3_ik2d85", "down_vote": 0, "up_vote": -1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "nixsee", "text": "First, thanks for a respectful and reasonable comment, even though it was critical of me. That's a rarity these days, even (especially?) here. \n\nMy intention with that obviously absurd comment was not to mock her book (though, someone with a shred of humility would never have any presumption that their book would ever be appreciated, let alone published, let alone be a classic). The goal was, through the absurdity of it, to have her recognize the sheer arrogance of her previous self-righteous dismissal - both of my perfectly reasonable and helpful advice, and of the notion that all-time classic books might contain some life wisdom, useful for both her and her writing pursuits. There's a reason we've been reading these for approx. 150 years each... they have timeless truths that we'd be wise to heed, especially if you have a desire to emulate them in some fashion (wanting to write a \"good\" book).\n\nStill, I think if I were truly, fully committed to being better - as I, and everyone, most certainly can always be - I'd probably better heed the wisdom that I've come across, which more or less unanimously says one version or another of \"don't give wisdom to fools\".  That's probably my single biggest, continued, shortcoming - I need to be better at saving my words for those who will hear them. I'm incomparably better than I once was though, so that's progress.\n\nMore than that, though, I need to be better at not saying things that I know will trigger insecure people's insecurities (as, to be perfectly honest, I knew the 150 years comment would do with her, even though I hold some hope that it will also trigger a reflection - if not today, then hopefully someday later on her own or in therapy or whatever). At the very least I should have said something like what you said to me - e.g. \"Does this strike you as a comment of someone deciding to be better?\" At least her ensuing indignation would have been all on her. \n\nAnyway, probably not what you were expecting from me here. It's a shame such discussions don't often exist given the knee-jerk, narcissistic cancel culture that's rampant here (and everywhere). Frankly, this sub and its moderators need to decide to be better and create a better space for respectful discussion and debate - no one is getting any better without it, especially not a huge group of Yes Men.", "permalink": "/r/DecidingToBeBetter/comments/ik2d85/i_decided_to_stop_giving_my_husband_chances_to/g3j9pjp/"}