{"id": "t5_2qh5i_t3_q865h3_t1_hgo410x", "creation": 1634252331, "origin": "t5_2qh5i_t3_q865h3", "height": 1, "replied_to": "t5_2qh5i_t3_q865h3", "down_vote": 0, "up_vote": 17, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Blackfatog", "text": "Well it’s a off the wall story actually. And I’m sorry to say that it won’t help much. \n I’ll keep it as short as possible. At 13, mom tells me that I have a different father then my brother and sister. She had given me their last name because she didn’t want me to feel left out of the family. (That was an interesting conversation. Which explained a lot!). Ok, so I have a different father then they do. And she tells me that I belonged to another man named, let’s call him Bob What’s his name. \n Armed with this information I searched for him as best I could when the internet came round. But didn’t get very far with that. And after awhile I gave up, and figured it was a lost cause. \n Fast forward a hand full of years. My older brother was bumming around the city/town we were born in. When he witnesses a car wreck. Him and some other passers by rushed in to help. Afterwards while shaking hands with some of the others that helped. My brother told another guy that helped his name. (Mind you that my brothers father’s name was fairly known in this small/mid sized town). So of course Recognizing the last name, the guy asks “which one are you?”. They have a pretty big family back there, so it’s a fair question. My brother then tells the guy mom’s name. And I guess that a light went off for this guy. \n Turns out that the person who my mother told me I belonged to wasn’t my father. And mom told me that it could very well be the guy that my brother had met. \n And that’s pretty much it. It was one of two incidents in my life that my brother played a very small but critical role in my life.", "permalink": "/r/happy/comments/q865h3/today_i_found_my_biological_mother_and_her/hgo410x/"}