{"id": "t5_2tand_t3_bgtlkt_t1_elrk5nu", "creation": 1556216282, "origin": "t5_2tand_t3_bgtlkt", "height": 1, "replied_to": "t5_2tand_t3_bgtlkt", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DWShimoda", "text": ">However, many people would not have been there, every day, for an entire year as things steadily worsened. In that way, I do feel like I've earned it.\n\nYou **did** earn it.\n-\n\n**End of life care** -- especially *personal-in-home/round-the-clock* care -- **is EXTREMELY expensive;** as in \"burns through ALL of your lifetime accumulated savings/assets\" level of expensive. (Heck, most \"assisted living\" places -- which are far SHY of the level of things you did for him {I'm presuming bed-pans, sponge-baths, and more} -- are often in the single if not double-digit THOUSANDS {$X,000 to $XX,000} **per month;** and \"nursing homes\" can be even worse: much MORE expensive, and a lot LESS \"home-like/friendly/personal\" or even actually \"caring\" {despite the label of being a \"care\" facility}.)\n\n-\nAnd that's not to mention the fact that turning over one's property (plus one's \"doggo\" friends) to someone you KNOW -- having them \"inherit\" it (and \"earn it\" via both work AND caring) is **immensely** more satisfying way to go -- than seeing it all \"sold off\" to pay some exploitative corporate bills (with the doggos almost certainly being \"put down\" instead of cared for).\n\n\n-\n> I may have been presented with an opportunity but I could easily have said 'no that's not for me'.\n\nLUCK is often a matter of \"seizing an opportunity\" -- grabbing on, **working your arse off,** and NOT letting go.\n\n-\nLots of people want \"opportunities\" -- but **they want them presented on a \"silver platter\"** (aka the \"lottery ticket win\" that /u/blgbird cynically & IMHO *mistakenly* labels this) -- that is they want the \"prize\" handed to them with little or even NO \"work\" involved.\n\n-\nPlenty of people ARE in fact \"gifted\" with **opportunities** -- which they then **REJECT** (or at least **don't** \"take advantage of\") -- usually because *it requires a substantial degree of* ***hard work*** *and then don't want/care to actually DO that* (much less RISK the fact that even after putting in the work, it might NOT \"pay off\" in the way or to the degree they expect or desire).", "permalink": "/r/DecidingToBeBetter/comments/bgtlkt/3_years_ago_i_made_a_decision_to_move_out_of_my/elrk5nu/"}