{"id": "t5_2tand_t3_bgtlkt_t1_elritn2", "creation": 1556215448, "origin": "t5_2tand_t3_bgtlkt", "height": 1, "replied_to": "t5_2tand_t3_bgtlkt", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DWShimoda", "text": ">I'm completely happy for OP here, it’s one of those turn of events we all dream about but what is the take away for an observer here? Move out and get ridiculously lucky and it will work itself out?\n\nYeah, you could **cynically** say that...\n\n-\nOTOH, he **does** note that the \"hard work on the farm\" (X years of it???) was a **necessary precursor** (training ground)...\n\n>>And all of the hard work I had done up to that point made sense, **it was all in preparation for the caregiving during the illness.** I had kept up such a wicked pace for the previous year (before moving in with my mentor/friend) that it was rather natural for me to continue on in that way... **it was hellish and difficult** but I made it through.\n\nErgo, had he NOT done the farm work, there is no way he could have handled the end of life care-giving...\n\n-\nMoreover, had he **not** already moved out from his parents home (and vowed to CONTINUE that)...\n\n>>...it [farm work + holding down job] was tough, but **I made a vow to myself that I would not live with my parents,** I was 31 years old at the time. My mindset was, \"I may still be broke, and I may not have any leisure time, but at least I got out from under their roof.\"\n\nThen he likely would **not** have even *considered* (nor been *offered*) the position that he (as you cynically state it: \"luckily\") then took on.\n\n---\n>It’s similar to the stories you see on clickbait sites: “I sold everything and traveled across the country, growing myself and now I’m a millionaire!”...How did you do it?..“I decided to travel the country, and then won the lottery”.\n\nThat seems a bit \"over the top\" -- OP doesn't seem to be claiming to have become a \"millionaire\" -- for all we know, the \"mentor-friend\" he moved in with and cared for, owned some rather \"modest\" place (which may or may not even have been paid off).\n\nAdd on to that, these kinds of situations DON'T always work out -- just because someone SAYS *\"I'll leave all of this to you.\"* doesn't mean they actually CAN (or will)... so I suppose in THAT sense, you are *somewhat* correct in that OP **did** take a \"gamble\" (albeit one with far better odds -- even if less of a dramatic \"payout\" -- than any \"lottery\"); add on it wasn't **simply** a matter of \"luck\" or buying some \"lottery ticket\"... he had to put in **substantial WORK** to \"earn\" what he eventually received (and to be blunt, given the EXORBITANT COST of most \"end of life critical care\"; especially *personal-in-home/round-the-clock* care, his mentor-friend may have actually gotten the better part of the bargain {besides, it's not like he could \"take it with him\"}.)", "permalink": "/r/DecidingToBeBetter/comments/bgtlkt/3_years_ago_i_made_a_decision_to_move_out_of_my/elritn2/"}