{"id": "t5_2tand_t3_bgtlkt_t1_elspc63", "creation": 1556242426, "origin": "t5_2tand_t3_bgtlkt", "height": 1, "replied_to": "t5_2tand_t3_bgtlkt", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "blackmer2010", "text": "Thank you for the feedback. Go for it, and build your habits first. It's funny when I read the part you wrote 'perhaps about as wonderful as your life is...' yes it does feel like I've made a lot of progress, but I took virtually no time off work over the last 4 years, it was so anti-climactic when my friend passed away and left me this place...it was like, 'Ok, time to pay bills now, time to clean up the inside and outside of this house.' That was it, just tying up loose ends. Things are 'wonderful' in a sense but it doesn't feel like a celebration or a party. I've had some great times inviting friends over and I have my own space, I'm going to slowly grow into the new reality...I did envision a dramatic new feeling of triumph, and that was somewhat foolish, life doesn't go down like that the way it does in our mental fantasies, at least not most of the time. I'm rambling a bit. I could say it thusly: I've just kept going on this path, it's 'wonderful' but it's not a feeling of ecstasy or anything, at least not yet, perhaps over time I can make this place flourish and really love life...for now it just feels like I work a ton as I always have, and I steal my moments of happiness and joy when I can, connecting with friends and playing music, etc. I really want to turn this place into a farm, it used to be an old pony and horse farm I think, it's 11.5 acres it's beautiful. Thanks for the love. I support you in your journey, my friend. You can become a nurse and be the best version of you, it takes a consistent approach and a daily focus, a Tim Duncan in-the-NBA Finals-approach to life every day, that's what it takes to really make an impactful change for oneself.", "permalink": "/r/DecidingToBeBetter/comments/bgtlkt/3_years_ago_i_made_a_decision_to_move_out_of_my/elspc63/"}