{"id": "t5_2tand_t3_n1mt2w_t1_gwec6ol", "creation": 1619766564, "origin": "t5_2tand_t3_n1mt2w", "height": 1, "replied_to": "t5_2tand_t3_n1mt2w", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Cogitoergosumgo", "text": "On average people who don't lift weights lose 10% strength every ever a decade after 30.\nInjury prevention-Light stretching and Proper warmup (like light easy jogging for 10 plus minutes before working out or running), if lifting weights don't attempt until mastering proper form and technique.\n\nDo physical activity everyday, even if it's just walking for 10 mins, just do something physical.\n\nIf you do stretches and notice you lack mobility now is the time to correct it.\n\nWear proper shoes to help prevent excess wear on knees if running (like new pair every 3 months if a regular runner). Think also about taking supplements for joints. \n\nIf you're like me and have back tightness and pain, foam rolled (curved to not have pressure on the spinal cord)- https://www.amazon.com/gp/product/B019F2V1BK/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1 , a spikey like tennis ball for weird tight areas on body- https://www.amazon.com/gp/product/B00ECASXAS/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1 , and Acupressure Mat and Neck Pillow - https://www.amazon.com/gp/product/B0049Q0P9M/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1 . They are uncomfortable to use but I can get rid of all my back pain without medication and I fell on my tailbone but due to using these things recovered and keep the tightness in my lower back gone. If you want links, I'll add it later on. \n\nNext if you're interested in scientific studied on what supplements to take and for what, I can go into detail of what and why I take the many I do (3rd party testing is what I use to pick the brand of supplement). \n\nContinuing on, take care of skin, apply sunscreen on face , neck, exposed areas and especially on the back of your neck and upper back (seems the most common area for skin cancer, people forget about this area). Also apply lotion to damp skin, not dry skin (dermatologist tip), to lock in moisture. \n\nThere's other things too that are very important, like being kind to yourself, healthy diet and probably many things I'm not remembering right now, but this might be a good starting point.\n\nEdit: Adding my supplement info:\nI add dark leafy greens to my diet, and healthy fats (avocado, nuts[I personally avoid these for reasons I mention below], and fish).\n\nAvocado oil brand- (out of 22 tested, only two are recommend because they are either not avocado oil or oxidized)\nBrands: Chosen Foods 100% pure avocado oil, or Marianne's\n\nI pick Sardines as my main source of fish fat, with the occasional salmon.\nBrand: Season brand, skinless and boneless sardines and water no salt added- taste great after lemon pepper and salt, browned in pan. Other brands have lead and/or high mercury levels.\n\nOsteo Bi-flex joint Health: triple strength - I've been taking this since I was 19, before that age just standing for 30 mins would cause my feet to hurt, standing for a work shift would end up with shooting pains through my legs into my hips, this supplement makes it where this doesn't happen, I always take 1 tablet 3 times a day to maximize absorption.\n\nCalcium citrate- I take 250 mg.\nHealth benefits: is needed to maintain your bones, nerve transmission, muscle contraction, cardiovascular system, getting adequate calcium is shown to decrease risk of dying from cardiovascular disease.\nSpecial Notes: You cannot absorb more than 500 mg of calcium at a time, you don't want to put more than 1000 mg in your body for safety reasons (some studies show that it may increase the risk of heart attack and stroke if you take too much calcium from supplements), and do not use products like Tums that has calcium in it (if you do use DO NOT take a calcium supplement). \nBrand: Solar Ray, calcium citrate, says 1000 mg (takes 4 pills to equal that dose, I just take a single pill= 250mg).\nTake with meal.\n\nMagnesium: I take 200 mg\nEssential for proper metabolism, nervous system functioning, maintaining the electrical stability of the heart- lack of magnesium may cause migraines, menstrual pain, constipation, can help pre-diabetics.\nBrand: Vitacost, magnesium citrate, 400mg (I take half dose).\nNeither water or fat soluble. Take with meal.\n\nZinc- 30 mg\nDeficiency can cause can impair the immune system, cause diarrhea, hair loss, reduced taste, cause acne, cause dry skin. It helps slow advance macular degeneration of the retina. There are scientific studies done where elderly take a zinc supplement and it helps improve their skin from lesions, dry patches and bed sores. \nSpecial notes: Do not take more than 40 mg of zinc, don't take with fiber which will inhibit absorption, some antibiotics interact with zinc (do not take together!), Zinc higher than 40mg can reduce copper absorption and lead to copper deficiency which will impair the immune system.\nI take it for my eyes and vanity lol. Optometrist recommended it.\nBrand: Bronson, Zinc Triple Play, 30 mg. Not really fat or water soluble, taking with something acidic, like orange juice or meal will help absorption.\n\nVitamin K- K1: 125mcg K2: 1mg\nDue to my research of how to stop bruising like a banana, I read online that elderly take vitamin k, it's been about year now and I do not bruise easily anymore.\nBrands: 365 vitamin k, 120 mcg\nAnd Thorne, vitamin K2 drops, I just drop 1 drop on my tongue daily, will last a long time. Fat soluble.\n\nB vitamins: I take a highish dose.\nTaking may help slow age-related decline in memory, people with genetic mutations affecting MTHFR enzyme would benefit from active form of folate known as methylfolate, high dose niacin can help lower high cholesterol levels, biotin may help strengthen nails, helps improve immune system and body functions. \nSpecial note most of the b vitamins and exit the body, except three can cause toxicity - niacin, folate, and B6.\nBrand: Jarrow formulas, low odor b complex, B- right.\nWater soluble, I take towards the beginning of my day.\n\nVitamin D3- at least 1000IU daily. Seems most brands are pretty good quality. Why to take this is pretty well know, I take it because I'm not outside much and can get seasonal depression. \nBrand: nature-wise, vitamin d3, 5000 IU\nFat soluble.\n\nLutein and Zeaxanthin: 25mg and 5mg\nSlows the progression of age-related macular degeneration, reduces the risk of needing cardiac surgery, and can improve some aspects of brain function. \nMy optometrist recommended supplements with these ingredients.\nBrand: Trunature, vision complex, Lutein and Zeaxanthin\nFat soluble.\n\nLycopene- 10 mg\nHigher intakes of (typically from tomato based products) are associated with lower risks of certain cancers, there is evidence that supplementation may also decrease the risk of certain cancers and/or death from cancer, there is preliminary evidence it can reduce elevated blood pressure and reduce elevated levels of cholesterol, helps protect the skin from UV light damage, may also be helpful in cases of male infertility.\nBrands:\nSpring valley lycopene 10 mg, or Swanson lycopene, 20 mg.\nFat soluble.\n\nOther random supplements I take to deal with individual problems, that others might not have:\n\nCranberry extract- 4200mg\nBeing female, I am prone to getting UTI after intercourse, so I take these and take these with a full big glass of water, and now no more UTIs.\nBrand: nature's bounty, cranberry fruit with vitamin c, 4200mg.\n\nL-Lysine: 1000mg\nPrevents outbreaks of cold sores, genital herpes lesions and canker sores. \nSadly I get cold sores, and this great animo acid, and I also avoids nuts and turkey, helps prevent them. Been taking this close to 15 years. \nBrands: doesn't really matter, I do pure powder form of L-Lysine and add to water first thing in morning.", "permalink": "/r/DecidingToBeBetter/comments/n1mt2w/which_aspects_of_physical_selfcare_should_an/gwec6ol/"}