{"id": "t5_2tand_t3_ndak7q_t1_gybweuf", "creation": 1621177145, "origin": "t5_2tand_t3_ndak7q", "height": 1, "replied_to": "t5_2tand_t3_ndak7q", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Kaffee147", "text": "You'll need to find something that works for you (whatever tricks you need, keep searching!), but for me these things worked;\n\n1. Find something you really like doing. You probably won't like starting it each time, but you'll enjoy it when you're doing it. For me, cycling. Love it so much, 10 years on. Running, meh, fine, I will but I don't like it really. Gym, bleurgh, good for strength but nah would rather not, if possible. So keep trying things til you find a special one, just for you.\n\n2. Put your exercise clothes on. Don't think about if you will do the thing or not, just put the clothes on. Chances are, by the time you're dressed and have your keys, water bottle, towel, whatever you will be ready to do the thing. This may not work for everyone, all the time.\n\n3. Think small and looooooong term. I said to myself, \"I want to exercise twice a week for the rest of my life.\" Fuck the short term goals, you need to exercise forever so go straight for it. This means it doesn't matter if you miss a week or a month, if you look back on your first year and have mostly exercised twice a week (or on average have done this) then you're good. If you've managed to stick it out for a year then amazing. It also means you can drop expectations, not needing to lose weight, gain muscles, get fit (tho these things happen) but if your goal is 'to exercise' then it's easy to see if you've done it. You can use the shorter term goals as mini motivation to keep things interesting (Can I cycle the whole way not just half without stopping? Can I cycle 5 times a week instead of two?) \n\n4. Make it part of your life, not an extra thing. Easiest thing for me was to cycle commute 2 or 3 times a week. Smashed my goal, and loved it. Mostly.", "permalink": "/r/DecidingToBeBetter/comments/ndak7q/regular_exercise_has_had_a_more_profound_impact/gybweuf/"}