{"id": "t5_2tand_t3_mjfcsk_t1_gta4lno", "creation": 1617482369, "origin": "t5_2tand_t3_mjfcsk", "height": 1, "replied_to": "t5_2tand_t3_mjfcsk", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "manyjournals", "text": "Hi there - thanks for sharing and being so vulnerable. It can be difficult to crack open the first time and you mentioned you wanted to write without judging yourself, which is a great start.\n\nI’ve been in therapy off and on for the last ten years due to trauma but experience a lot of the things you’ve written here. \n\nTo address your practical questions about therapy in medication, these can vary by person. A therapist typically will not prescribe you medication unless they are licensed to do so (assuming you’re in the US here). Your insurance can connect you to therapists in your network or you can also search Psychology Today - this is how I found my last provider. I tend to search for someone who is trauma informed and does “parts work” or “inner child work.” This sounds corny at first but I’ve found it to be the most helpful and transformative for me. If that sounds good to you, I’d consider it.\n\nAny therapist will likely have you do an assessment or intake and spend the first few sessions just learning about you and your life and the biggest things bringing you to therapy. I would recommend being very honest and patient with yourself. Therapy takes effort and time to start working. Of course if you don’t mesh well after a few sessions, you can always shop around. It won’t hurt anyone’s feelings.\n\nTo your concern about medication - that’s very normal and I was worried about it changing me too. When I needed it, medication was very helpful. It has its pros and cons like anything else. I was on some meds for a while but got to a place where I didn’t find them necessary but continued therapy even when I felt “better.” That’s been a good decision for me over time. Everyone is different, but I will say my sister and my wife both take meds that people think are “intense” but have made huge positive impacts on their lives. Again, it’s a personal decision and best made with a professional, but it can be helpful and not necessarily a permanent fixture of your health care plan.\n\nHappy to respond if you need more practical support on finding a provider - best of luck in your search! You deserve support, peace, and to be heard.", "permalink": "/r/DecidingToBeBetter/comments/mjfcsk/i_feel_like_its_time_for_me_to_address_my_mental/gta4lno/"}