{"id": "t5_2tand_t3_morgof_t1_gu7l8pk", "creation": 1618192845, "origin": "t5_2tand_t3_morgof", "height": 1, "replied_to": "t5_2tand_t3_morgof", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MyDogFkingLovesRocks", "text": "Congratulations OP for taking this act of self love for yourself. But. Baby steps. Don’t set yourself up to fail. Don’t try and tackle a mountain of study when you’re currently withdrawing. \n\nPeople view weed as harmless. It’s a drug that has the potential for dependence and addiction like any other drug. \n\nWhen you’re withdrawing from weed, common symptoms are: \n\nHeadaches, chills, irritability, anger, aggression, sensation of extreme nervousness or anxiety, depression, difficulty sleeping, insomnia, troubling dreams, nightmares, decrease in appetite which can cause a lot of weight loss, restlessness, malaise, abdominal pain, sweating, shaking. \n\nSuddenly quitting worsens the withdrawal process, compared to tapering off in a planned and structured way \n\nUnfortunately there aren’t specific medications which can help with the withdrawal process for weed withdrawal like other withdrawal processes (alcohol or opioids) so it’s really important to have support, be around the right people, not be around the wrong people, and have the right environment (if you can, have your bedroom and bathroom a clean, calm space. simple things can help). \n\nSymptoms peak within (normally) a maximum of 10 days of quitting. After the peak, things steadily get better really quickly. Picture it like a triangle where the day you quit is the bottom left corner. Maximum of day 10/when you peak is the top corner. Day 30 is the bottom right corner. \n\n If you start using marijuana again, the symptoms will go away, but you’ll have to begin all over again. \n\nKeeping a calendar and knowing you only need to get through a maximum of around 10 days (often it’s a lot quicker) and then you’ll feel a *lot* better *and* have got through the worst of the withdrawal and begun your sobriety from marijuana will feel fucking incredible. Put a giant red cross on the calendar for each day you have made it through. \n\nKeep doing it after the symptoms have eased. It’s soooo satisfying to see those crosses and be like ‘I have that big of a chain going, yes I’m feeling tempted right now but there is no way I’m going to break this chain right now. Not after ALL that’. \n\nPrint off calendar pages just for this purpose. Even write down how each day felt. Keep a journal. You’re going to be so proud to look back and say you have overcome your addiction. There’s no shame in addiction. I was addicted to opioids. The pride that comes in knowing that I can go through my day without thinking about that next pill is freaking fantastic. \n\nPlease consider seeing an addiction doctor. They can help you through this process. I’m really glad you’re doing this while under the support of a therapist. You can reach some pretty low lows in the depths of withdrawal. An addiction doctor could help you develop a tapering plan. if you need to be able to still get through studies, it might be a better option for you. They can also supervise you during the process and check you for dehydration, weight loss, and suicidal thoughts. \n\nIt’s different if you quit cold Turkey, where you’re going to feel it hit you like a truck, versus if you quit by tapering, slowing cutting it down at an agreed rate. \n\nWhatever route you take, we know that you will succeed. There might be some speed bumps along the way. That’s all part of the process, and makes your success and recovery all the sweeter. \n\nI am SO proud of you op. I hope you are too. \n\nI’m also very, very sorry for your loss of your cousin. How profoundly painful. I don’t know what your beliefs are, but I don’t doubt that your cousin would have been proud of you for taking this path and act of self love. \n\nThis isn’t about being better. This is an act of love for yourself. \n\nWe accept you, as you are. In this moment. \n\nPlease, if you feel able, keep us updated on how you’re going. Not only the good days. F toxic positivity. We’re behind you 100% of the way. \n\nYou can do this OP. If you need us, you know where to find us.", "permalink": "/r/DecidingToBeBetter/comments/morgof/i_am_deciding_to_be_better_for_her/gu7l8pk/"}