{"id": "t5_2tand_t3_bt3ay3_t1_eovktm3", "creation": 1558896830, "origin": "t5_2tand_t3_bt3ay3", "height": 1, "replied_to": "t5_2tand_t3_bt3ay3", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ThisIsHowItStartss", "text": "Thinking about what I look forward to as soon as I shut off my alarm puts me in a positive mind set for the rest of the day. It gets the ball rolling for more positive thinking. After the cup of coffee or whatever it is I’m looking forward to then it isn’t necessarily about the next thing but just looking for the good things in my day. A couple years ago I did a thought journal where I would basically just write down my thoughts and then look back at them like a month later. Looking back made me realize how negative, self-loathing, and simple my thoughts were. So I just started twisting my thoughts to be more positive. Some examples of actual thoughts and feelings I had 2 years ago and the ones I’ve been thinking since forming a positive habit: 1) “I have to go to work” < “My job has the best free coffee.” 2) “I only get paid $13/hr” < “I have a low-stress job in an air conditioned building where I’m basically allowed to do whatever I want” 3) “I must be trash if Michael stopped texting and calling me after the 3rd date” < “Being single means I get to go on many more dates with other fun and interesting men” 4) “bullshit spectrum keeps cutting out my Internet” < “Since the Internet is out again, I have time to get into that book I’ve been wanting to read” 5) “Karlie looks terrible in that black turtleneck” < “You do you girl” 6) “Fml, everything in my life sucks” < “My dog is the cutest little shit I’ve ever seen” It’s taken awhile but I feel I’m emotionally and mentally in a much better place since I started to critique my thoughts.", "permalink": "/r/DecidingToBeBetter/comments/bt3ay3/something_ive_noticed_that_has_truly_increased/eovktm3/"}