{"id": "t5_2qh5i_t3_c2it09_t1_erlzp6o", "creation": 1561001407, "origin": "t5_2qh5i_t3_c2it09", "height": 1, "replied_to": "t5_2qh5i_t3_c2it09", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Gswindle76", "text": "I don’t know why you would think that.  I spent 20 yrs in the Air Force, I have a love/hate relationship with it. I was never a “pomp and circumstance” type of person, I don’t have military memorabilia sitting around my house, or hang a flag. At 19 I was selling shoes and working at Walmart.  I joined at 19, I was lazy, didn’t know how to lead or even follow.  I had no direction in my life and was going to stay in for 4 years and get out.  It didn’t take long to figure out that I was working with some amazing people. \n\nI think most people see movies and think it’s all exercise and playing cards. But I cannot express enough the 12+ days that we spent just doing the job.  No one complained(except the new guys), we worked together to complete whatever was at hand and went home with a since of accomplishment.\n\nI went from being a teenager to handling very serious and consequential things.  Like a family you see someone accomplish some amazing thing and you feel pride, because we are all one team.  \n\nAbout halfway through my career I decided to change jobs. I was lucky and got an amazing one.  It stimulated me intellectually and I worked on some movie type stuff. I got to design and engineer equipment for our mission. I worked along side top notch organizations and I really truly felt like we made a difference in the world.  Everyday was amazing, I came in on the weekends with an empty building and it worked almost like it was a hobby that I loved.\n\nDon’t get me wrong there where shitty people some of them commanders and everyone just looked at it like another challenge. Some of them where people you supervised ( like me at 19 ) but most of them grew to be part of the family; the others just faded away.  \n\nI promise you the reward of feeling like you made a difference, whether it be to the mission or to the people you know and love like family is a sincere one. I don’t think I have ever gone to a retirement where the person retiring doesn’t fight back tears. You know what you are leaving behind and don’t want to leave.", "permalink": "/r/happy/comments/c2it09/as_of_5_minutes_ago_i_became_medically_retired_im/erlzp6o/"}