{"id": "t5_2tand_t3_oe0n7f_t1_h449k7c", "creation": 1625483328, "origin": "t5_2tand_t3_oe0n7f", "height": 1, "replied_to": "t5_2tand_t3_oe0n7f", "down_vote": 0, "up_vote": 20, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "emacsismyreligion", "text": "Hey!!! Around this time last year I made a post on this subreddit essentially announcing the same thing. I think you express well the potential for abject debasement that methamphetamine can bring you to. I found it helpful in my recovery to be driven by gratitude from the start, and a part of that was learning how to forgive myself for the time and personhood lost, and appreciate every small and tragic miracle, the likes of which come every day. \n\nThe neuropsychological changes that come from withdrawal can be hard to reckon with. I was also dealing with the gift of awakening and pain of loss that comes with withdrawing from antipsychotics for the diagnosis of schizophrenia, now in complete remission, which I and my psychiatrist have found it far more useful to describe as a \"mad\" or manic/psychotic reaction to real, complex/prolonged trauma. I mention this because so often the system and even recovery groups in 12-Step focuses on where we are at right now with zero concern for the reasons why we got there. \n\nPay attention. Everything matters. Time takes fucking time, but there is some singularity of awe, pain, and joy in our everyday that we literally forget while on meth or otherwise drugged. \n\nWhat you've described is a sharp loss in the capacity to feel human. I, myself, forgot social graces, forgot how to work, how to play, forgot how to love. In fact, I genuinely don't think I enjoyed literally anything I did while using. And the miracle of the birth of your child is a clicking-into-place of all you've forgotten. There's a lot of grief in that. But you will not regret keepin' on. I was like you too with relapsing every 1-3 months at first. Made my first year now. Even if you have moments where you're convinced the world is ending and there is no way out of the hell you've created for yourself, just stop, shut up, the truth is, it gets better. Sounds so trite. I say that from the testimony of my real fruits in recovery. But it is the real truth that a commitment to healing, betterment, and self-knowledge, all pushed into motion by the loved others in your life, is utterly unstoppable with the slow trickle of learning how to live like a human again. \n\nFeel free to message me.", "permalink": "/r/DecidingToBeBetter/comments/oe0n7f/40_days_clean_from_meth/h449k7c/"}