{"id": "t5_2tand_t3_ppei57_t1_hd4zbyg", "creation": 1631832196, "origin": "t5_2tand_t3_ppei57", "height": 1, "replied_to": "t5_2tand_t3_ppei57", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "hlohm", "text": "The most important thing is to develop an interest in learning. If you just want to learn loads of stuff to impress people you meet it will be a chore and disingenuous. You will only ever get a well rounded education if you first and foremost follow your own interests and curiosity. Nothing wrong with getting ideas but i'd recommend to start at what you're already interested in and expand from there. Look at things in more detail than previously; explore adjacent topics. Look stuff up zealously! Spend nights on wikipedia following links! Find specialised communities and websites for your areas of interest and engage in discussion, ask questions, be curios!\n\nIf you do that, you will always talk about stuff you know about because you wanted to find out about it and you will always be more engaged with the topics you explored out of your own curiosity. If you do this enough, just follwing the breadcrumbs of whatever tickles your nerve you will at some point almost always find an entrypoint into an ongoing discussion and you can bring in your own expertise. And if you don't know what people are talking about listen carefully and see what you can learn and if you can enter the discussion with a question rather than a remark. Just be curious and open and don't cling to idea that you need you need to be an expert in a topic to have a conversation about it. Knowledgeable people will be more than happy to share their expertise to somebody who's genuinelly interested, but nobody wants to listen to some smartass who grinded  through a \"100 books you must read to be an educated person\"-buzzfeed list and thinks he knows everything important now.", "permalink": "/r/DecidingToBeBetter/comments/ppei57/list_of_books_to_become_a_well_rounded_self/hd4zbyg/"}