{"id": "t5_2tand_t3_ppei57_t1_hd5yeeh", "creation": 1631849149, "origin": "t5_2tand_t3_ppei57", "height": 1, "replied_to": "t5_2tand_t3_ppei57", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "milobdenum", "text": "I have two recommendations for you, and much more importantly I have WHY I am recommending them. \n\n1. On philosophy/history/culture:\n\nTo preface, I find the best books on history and culture  to be books that examine something from a very narrow lens. Focusing closely on one aspect might seem like you'll miss the bigger picture, but getting that tight, thorough understanding of a single aspect of a culture will actually give you an opening to understanding the rest of the culture. An example of this is art history — I took a lot of art history classes in college (against my will) and found that focusing on that single aspect of the culture taught me a ton about every other aspect that art touches. (Which is basically all of them)\n\nSo, while this book seems very specific and kind of niche, the subject matter speaks to a LOT of other aspects of culture, society, and simply human nature. This one is a record of a week-long meeting between some of the most prominent Rabbis in the world and the Dalai Lama. It's about Judaism and Buddhism, but the discussion focuses on culture, history, oppression, and human nature. It isn't a religious text by any means.  \nThe Jew in the Lotus, by Kamenetz\n\nIf it doesn't strike your fancy, I'd simply encourage you to explore other historical works with tightly focused subject matter, it really is the best!\n\n\n2. Human nature/philosophy through Fiction:\n\nYES FICTION! To paraphrase Ursula K Le Guin, good fiction tells truths through lies. Works of fiction can weave stories that reveal truths that are otherwise very difficult to express and/or leaves the reader with a dramatically more potent understanding of the message than if you simply read the underlying message on it's own. \n\nIn my opinion, Ursula K Le Guin, in particular, is in a league of her own when it comes to that exact motive. Also, it's just an absolute delight to read her stories. From everything I've read of hers, I think the Hainish Cycle series accomplishes the \"truth through fiction\" goal the most and the clearest. \n\nWhether you decide to read her work or not, I would recommend always reading a really good piece of fiction alongside whatever non-fiction you happen to be working through. Pairing up your reading like this is great because no matter what those two books are, they're going to end up contrasting with each other in interesting ways, bringing out new aspects in each other — sort of like how complimentary colors make each other pop. It's also great to have a reprieve from your academic work that keeps you in the reading mindset, which can help with motivation!\n\nBest of luck, friend!", "permalink": "/r/DecidingToBeBetter/comments/ppei57/list_of_books_to_become_a_well_rounded_self/hd5yeeh/"}