{"id": "t5_2tand_t3_ppei57_t1_hd4pfz9", "creation": 1631827725, "origin": "t5_2tand_t3_ppei57", "height": 1, "replied_to": "t5_2tand_t3_ppei57", "down_vote": 0, "up_vote": 132, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "buttonbirds", "text": "I'm doing a pretty similar thing right now, so here's a few different suggestions that I've found useful:\n\n1. Look at good schools curriculums. This is useful for subjects you've never studied before, and for ideas on what the Elite (TM) think their children should have learned before leaving school.\n2. Look at good universities syllabuses and reading lists. I mostly check Harvard, Oxford and Cambridge. You don't have to read every book on them, but it's helpful to see what books you would be reading for (for example) a philosophy degree at one of the best universities in the world. You can get some ideas about the different aspects of a specific subject, too. And if you're looking at undergraduate it's mostly going to be designed for people without much, if any, knowledge, so it's a great starting point.\n3. Check out online courses, not just books: Coursera, Edx, futurelearn (meh), Khan Academy, even Youtube (Crash Course, for example) are all free. Wondrium and Pluralsight are a pretty decent paid options if you get them on discount. I like to use a different type of learning (reading, activities, online course, video series, etc.) for each subject I'm studying sim simultaneously.\n4. Don't do too many subjects at once! I've divided mine into five groups - Humanities, PSCHE, personal interest, worldliness, and science/maths, and focus on one subject per group (as well as learning a language on Italki). There's some overlap, but I base where a subject lies on why I'm learning it. For example, if I'm studying philosophy to learn how to better myself and improve my critical thinking it would go under PSHCE, but if I'm wanting to learn how a different culture or group thinks, it would go into worldliness. I try and pick specific subjects that work well together, and have some that I'm intentionally avoiding until I've learned others - such as wanting a good grasp of my own beliefs before I turn to understanding other peoples, especially ones I fundamentally disagree with.\n   1. PSHCE is basically subjects for personal development or life. It includes finances, nutrition, philosophy and psychology if I'm learning them to improve myself, the politics in my home country, and so on.\n   2. Personal interest can either be subjects that I just find super interesting, or things that are specific for my career/lifestyle. The rest I think are self-explanatory.\n5. Spend literally just five minutes Googling each author you read from. Check their Wikipedia page and website, see what controversies or debates exist about their views or books.\n\nSpecific suggestions of things you should read/watch/do:\n\n1. Memorise the world map. This is going to be way easier than you think (there are great apps) and will make it a lot easier to understand history.\n2. *Learning how to learn* is a great book and free course on Coursera. I'd recommend this being one of the first things you look at - reading is useless if it's just going in one ear and out the other.\n3. *Introduction to Philosophy* also on Coursera is a very good starting point for understanding basic philosophy. \n4. The *Think Again I-IV* series on Coursera is great for improving critical thinking.\n5. *Sapiens* by Yuval Noah Harri is a fantastic intro into human history. A must-read for everyone.\n   1. Actually literally read all his books.\n6. *Guns, Germs and Steel* by Jared Diamond is pretty similar to *Sapiens* in some ways, but is also an absolutely fascinating read on its own that looks at how different countries developed in different ways.\n   1. Reading all of Jared Diamond's books would also be a pretty good idea.\n7. *Before you know it* by John Bargh - not a book I completely agree with, but a very interesting look in psychology and why we do what we do. Great for personal development and introspection.\n8. *Cultural Literacy for Religion* on Wondrium gives a decent overview of all major world religions. It's not digging deep, but it covers the basics.\n9. *Crash Course: World History* on Youtube is a decent mini course on world history, but check out the TVTropes page if you watch it because there is quite a bit of misinformation in it.\n\nI hope that's a good starting point, good luck!", "permalink": "/r/DecidingToBeBetter/comments/ppei57/list_of_books_to_become_a_well_rounded_self/hd4pfz9/"}