{"id": "t5_2tand_t3_q6bazr_t1_hgdorr7", "creation": 1634060782, "origin": "t5_2tand_t3_q6bazr", "height": 1, "replied_to": "t5_2tand_t3_q6bazr", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "eirracarrie", "text": "(Sober, lol!)\n\nI think there's definitely a balance we can achieve. \n\nIn my view, there is huge difference between kindness that comes from a place of empathy (&, at best, strength as well), and the habitual niceness that I spew regardless of whether I mean it. I hope I can double down on the former & cut down on the latter. \n\nOne benefit I've experienced from being this way is that my flexibility has led to down some unconventional paths that became positive turning points for me. Saying nothing when I am uncomfortable occasionally works out, oddly enough, because sometimes I think I know what's best for me, when I actually don't. That's the positive part of the go-with-the-flow personality for me. I let go of ego & accept new things that I might have rejected otherwise. (On the flip side, this also takes me down some negative, totally unneccessary paths that I need to learn to RUN from as soon as I know something's wrong!)\n\nAnother benefit is that I will go to great lengths to help others. When I encounter people who truly deserve that kind of love, this is definitely a positive. I will stop at nothing to help those people & I feel great about it. However, I also find myself in situations in which I feel obligated to help those who feel they are entitled to my help. I trap myself in some awful situations & enable those people to take advantage of my kindness (&, more than likely, the kindness of others).\n\nEdit: Do you relate to those benefits?  \n\nIf you're like me...you probably will see standing up for yourself in a minor way as a big deal. That's what I've been told. What I think is aggressive or extreme is totally normal to others, apparently! \n\nWe can do it, little by little. I'm feeling hopeful.", "permalink": "/r/DecidingToBeBetter/comments/q6bazr/i_need_to_take_charge_of_my_life_i_need_to_be/hgdorr7/"}