{"id": "t5_2tand_t3_q6bazr_t1_hgbxu9x", "creation": 1634026141, "origin": "t5_2tand_t3_q6bazr", "height": 1, "replied_to": "t5_2tand_t3_q6bazr", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "eirracarrie", "text": "Thank you so much for your comment & for the award!! I'm so glad I could articulate these struggles in a way that was helpful to you (it was helpful to me as well...to get it off my chest). I don't cry too often these days but when I do, it's about this overwhelming weakness. I have one person in my life who (kindly) holds me accountable for my lack of self-assertion & I'm grateful for him...but at the same time, I feel so lonely in this struggle. I've been like this since childhood & I only seem to get slowly, incrementally better. I'm trying to have patience with myself, while also insisting on my growth. \n\nI have high hopes that we can change, despite the difficulty. There's this amazing quote (oops - kinda long) by James Joyce in the book A Portrait of the Artist as a Young Man: \"He did not want to play. He wanted to meet in the real world the unsubstantial image which his soul so constantly beheld. He did not know where to seek it or how, but a premonition which led him on told him that this image would, without any overt act of his, encounter him. They would meet quietly as if they had known each other and had made their tryst, perhaps at one of the gates or in some more secret place. They would be alone, surrounded by darkness and silence: and in that moment of supreme tenderness he would be transfigured.\nHe would fade into something impalpable under her eyes and then in a moment he would be transfigured. **Weakness and timidity and inexperience would fall from him in that magic moment.**\"\n\nI like to read this quote imagine meeting my future, badass self and dropping my weaknesses to the ground like some heavy, worn coat. That's not how any of this works, of course. But, I know that there's a strong person inside of me & she wants so much to see the light of day.\n\nOne day...for both of us!\n\nBy the way, I had some wine...sooo if this is a rambly mess...oh well! But, I won't apologize bc..self assertion! Hehe🤪🥴", "permalink": "/r/DecidingToBeBetter/comments/q6bazr/i_need_to_take_charge_of_my_life_i_need_to_be/hgbxu9x/"}