{"id": "t5_2tand_t3_ismrqr_t1_g5c1ss4", "creation": 1600153684, "origin": "t5_2tand_t3_ismrqr", "height": 1, "replied_to": "t5_2tand_t3_ismrqr", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Reisno", "text": "Oh genetics and culture are a major factor and that likely did carry over. And them being jerks to one another could also be culture. With my partner's culture, they are amazing towards foreigners and visitors but are a bit mean towards their families and themselves. \n\nMy partner's relatives all kind of laughed at me during an event we attended, his aunt and uncle were renewing their wedding vows, for drinking a fizzy kid's drink during a toast. They all fully expected me to drink a glass of champaign for this toast and it put me under an uncomfortable spotlight to decline it. \n\nI have been trying to teach myself my partner's language more with duolingo, and my god it is harder to learn than Japanese. But there is this fear with becoming more fluent, the more I learn the more I will understand his relatives judging me and the easier it will be for them to communicate with me to offer me booze or to pressure me to drink. \n\nEven with the last Easter we spent with them in 2019, his god uncle, who knows English well enough to chat with, kept offering me alcohol at least 5 times after I declined every single time. He talked of how happy people were while drunk during socialism, for him booze is nostalgic. He himself ended up in a horrible car accident as a direct result of drinking and driving. \n\nI ended up accepting an art project from him impulsively just to change the topic of discussion, this resulted in some months of stress making an art work that he didn't like. I was only paid for the materials, not the labor. \n\nDuring that same party, his sister poured 3 large glasses of wine with ice and left one in front of me on a table. I saw her and their cousin kind of gossiping and side-glancing at me from the patio, they were trying to bait me. We got up and left the party, that god uncle tried to guilt me into staying but his English isn't good enough to pull off that social maneuver. \n\nThe language barrier has been a strategic asset in my case, unfortunately. So I learn enough to do things independently, like grocery shopping and chores, but I can't really hold a conversation with anyone. Local alcoholics still approach me though, they get very close, uncomfortably so, and they will talk at me for hours if I let them. \n\nThe worst of these drunks, luckily I don't see him much, is over 6ft tall and he touched my ass when I tried to get into my flat, he was blocking the doorway to my apartment complex and drinking. I snapped, and pushed him backwards, looked him in the eyes and cussed him out in English. In that moment I was prepared to tear his face off if he tried anything else. He's not been drinking in front of my door since. I rarely saw that guy after that, but when I do I stare him down or I avoid him.  \n\n So, in general, I don't go out much. I only go out if I have a task to complete outside. I don't blame you one bit for not wanting to get drunk around people you don't trust, that is a good policy to have.", "permalink": "/r/DecidingToBeBetter/comments/ismrqr/ive_been_sober_from_alcohol_for_over_6_years_now/g5c1ss4/"}