{"id": "t5_2qh5i_t3_59d5gb_t1_d98evvs", "creation": 1477486877, "origin": "t5_2qh5i_t3_59d5gb", "height": 1, "replied_to": "t5_2qh5i_t3_59d5gb", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Daefish", "text": "Hi! I'll do my best, I can hardly say I'm an expert :)  \nI think I'll give you more my thought process vs the actual process of doing this - that was the boring bit, go to the store, and talk with the salesperson regarding the changes you want to make.  \n\nSome advice before the rest: Find a friend of your GF's that you trust his or her opinion on and bring them along.  It helped a lot to have a sounding board and someone who knew what she wanted at least as well as I knew. \n\nThings I knew I needed on the ring: \n\n* Morganite Stone - Thankfully my GF doesn't prefer diamonds for the main stone.  Not only is this cheaper, but I personally like a colored stone on a ring.  My original intent was an opal.  Don't do this.   Opal is a super soft stone, I would have regretted it.  \nIf we couldn't have found a good looking Morganite, I would have gone with an Amethyst or a Sapphire I think as a stone.  \n\n* White gold or Rose Gold.  This is actually the second revision of this ring - the original one I picked had one of the split bands in white gold and the one with the diamond chips in rose gold.  I personally liked the idea but the execution wasn't right based on the render.  - Here's the link to the original custom design with the Rose Gold on it - http://imgur.com/a/t0iGK\n* Not a Square Cut diamond - this gave me some flexibility in the stone shape and I actually personally like the oval shape we settled on. \n\nAnd that was it - those were the 3 things I needed to know and from there it was all personal touch. \n\nI started with a few ring designs the salesman picked out and after looking at probably half a dozen, I found a base design I liked but it wasn't what I wanted.  \n\n* The diamond chips leading to the stone were tiny (they looked like one solid band leading to the center stone) so I wanted them a bit larger to show definition.  \n* I saw a lot of rings with Halos around them - they're cool but I felt they overtook the center stone since I'm not getting a huge stone (it's a 1k Morganite, I know nothing about gemstones so I don't know if that's large or not).  \nAs we started talking about this, I wanted the band with the diamonds leading up to the center stone to wrap around the stone slightly - they originally stopped at the side of the stone.  \nWhen we drew the plans, I realized they gave a subtle \"haloness\" to the stone from the top, which you can see in the picture.  It ended up giving the idea of a halo without needing to line the entire stone in diamond chips.  I still might ask about the price to wrap the diamonds all the way around and make them part of the frame, I'm not sure yet.  \n* Originally both of the supporting arms on each side of the stone lined up and came to a peak together.  With the diamonds being changed to wrap around the stone, that allowed us to elevate one over the other.  \n* The stone set in the original band was a circular stone so by moving to the oval, we were able to achieve this haloing affect a lot easier.  \n* The original ring was yellow gold.  My girlfriend absolutely did not want yellow gold so we moved to white gold in place of it. \n\nReally the only thing that remains of the original ring is the concept that it splits off into two arms leading to the stone (and the general ring shape itself :P) beyond that, almost everything else was changed in some way. \n\nI had a lot of fun doing this - it was a look into a completely new world I knew nothing about and yet another one of those \"in another life I'd totally be a ring forger\" moments.  \n\nThe downside: Price - it probably added 50% onto the final bill of the ring to make changes.  Granted, I didn't have a huge budget, so if you had a larger budget, you'd notice the price of customization less since it seemed like it was a flat rate to customize the ring.  All in all though it was a minor thing for me since I'm ecstatic about the final result.   Since we went with Morganite, the stone cost itself was far less than a diamond which helped too. \n\nPlease ask anything else you'd like - I'm happy to share :) ", "permalink": "/r/happy/comments/59d5gb/custom_designed_and_bought_an_engagement_ring/d98evvs/"}