{"id": "t5_2tand_t3_aou6me_t1_eg47giv", "creation": 1549750629, "origin": "t5_2tand_t3_aou6me", "height": 1, "replied_to": "t5_2tand_t3_aou6me", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "anothercentennial", "text": "Congratulations on all those major wins!\n\nFirst, you need to define what success means to you. As a recent college graduate, there's a couple things to focus on: career, relationships, self and your hobbies.\n\nIt's important to find ways to stretch yourself. Career-wise, I'd say networking, asking for bigger projects, taking on those leadership roles even when you're not ready, pushing your idea forward, asking for feedback all the time. Also, you want to always keep asking yourself  (which I like to do on my commute to work):  Is this where you want to be a couple years from now? Do you want to pursue further schooling? Is this your dream job? If it isn't, what steps do you need to get there? Who can help you?\n\nIn your personal life, you need to ask yourself: What makes me happy? What is something that I've always wanted to do but never had the chance to? What does success mean to me?  And from there, find opportunities to pick up new hobbies & experience the world. You're doing great!\n\nAlso, keep reading whenever you can. One little thing I did start doing before I graduated was to write down a list of long-term career/personal goals I wanted to achieve for myself. The question header was: What/who do I want to be at 30? What do I want to have achieved under my belt? What makes me anxious now that I hope will be a breeze later? For me, I had becoming financially savvy, staying active, pick up the xylophone, give back to the community, being a motivational speaker, learning how to be more vulnerable, etc. I look at that list often and make sure that every month, I'm on a path of improving in one area or another. For the more introspective things, like learning how to boost your confidence/productivity, I lurk in the library often. I'm definitely a self-improvement nut. :)", "permalink": "/r/DecidingToBeBetter/comments/aou6me/what_else_can_i_be_doing_to_better_myself_and/eg47giv/"}