{"id": "t5_2tand_t3_hgqa9m_t1_fw72xr4", "creation": 1593287455, "origin": "t5_2tand_t3_hgqa9m", "height": 1, "replied_to": "t5_2tand_t3_hgqa9m", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bluMidge", "text": "I love this and had just recently learned about the importance of it. In fact, importance isn't a strong enough word.\n\nIt's such a commonality in a corporate office for example, especially if your position is in the realm of having goals monthly. Or technically any kind of goal/metric and after a certain amount of time being in this position you have not reached your goal, that is absolutely okay.\n \n\n It's not the way folks think, or better go about their lives in general for the most part until you have the awareness of what this thread is about.\n\nI have lost two to three jobs putting others before me.\nand each and every time over the last 10 years ish this has occurred, I have settled down the managers that had to sit down with me and tell me that I had to leave. \nIt had some shock value for about a minute and a half, then my soul spoke up and said this is just y opportunity to go find what I'm here for.\n\nAnd all this is doing and it's on its way, is going to allow me to run into (instead of using the word find or finding) what my purpose is in this temporary  body. And if it's a career, losing or getting fired due to your goals weren't met monthly over a period time, that means your dream job or again your purpose will show up when it shows up.\n\nWith that said all I do is go to source, and mine is God, surrender, ask for guidance, and understand if you're in proper alignment, it will happen.\nNever on your watch and there may be exceptions to that, however that watch on my wrist is attached to God's. \n\nI'm on my cell phone typing so possibly some things got out of order, but hopefully everyone gets the gist of this.\n💙 this subject matter.", "permalink": "/r/DecidingToBeBetter/comments/hgqa9m/im_gonna_stop_trying_to_one_up_everyone_and_just/fw72xr4/"}