{"id": "t5_2tand_t3_dkfwkb_t1_f4ge1a6", "creation": 1571580171, "origin": "t5_2tand_t3_dkfwkb", "height": 1, "replied_to": "t5_2tand_t3_dkfwkb", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "thintoast", "text": "TL;DR: First and foremost, go to the Dr, get your mental state leveled out. Get a job in a couple different trades to find something you like. Go through the process of becoming a journeyman. In 8 years make just as much as those with a bachelors degree, without the student loan payments. \n\nPost: \n\nHaving recently been out of work for a year (Its a long story and the circumstances were fairly unique) and having a depression melt down just three months ago, I simply cannot express how absolutely crucial it is to get into a Dr to talk about resolving your depression and anxiety. It seems like there are A few people here who just don't understand how debilitating those mental struggles can be. \"Growing up\" or \"manning up\" is just not a plausible solution. Depression isn't just being sad. It's something that goes against your moral fiber and still makes you do things that you wouldn't normally do. \n\nGo to the Dr and work with them to find the right medication for you. It may take time and it's not a fun process, but when you find the medication that's right for you, you'll notice how level the playing field is with everyone else. Its not a magic happiness drug, it simply levels the playing field so that you can make decisions with a clear mind.  \n\nI recently told my therapist that being on this medication was like having the fog lifted out of my head. Its so much easier to think clearly and make decisions that I couldn't make before. I occasionally look back and think \"that was so simple, why didn't I just do that?\" Depression is no joke. \n\nOnce you have that taken care of, finding a job will be easier. Working in that job will be easier.  If yippy want to study and get a degree, great! If anyone gives you shit about not going to school to get a degree, don't listen to them.  Getting a degree isn't for everyone and i despise the culture of telling others they're worthless unless you have a degree. Fuck those people. If you like working with your hands, try out a couple different trades. Journeyman plumbers and carpenters make some very decent coin without having to go into debt to get a degree.  I don't know if you're  in the states, but if you are, it takes about 7 years or so to become a journeyman. That's 7 years of on the job training, that you get paid to learn, to come out making a very livable wage and hopefully zero debt. I think you said you're 19. Let's say that you take a year to find whay you like. At 20 you start an apprenticeship in plumbing. By 28 you're making just as much money every year (maybe more) than most people with a bachelor's degree. And you also don't have $600 per month going to some financial institution to pay your student loan debt. \n\nSorry for the long post. I had a lot of ideas and wanted to make all of my points...", "permalink": "/r/DecidingToBeBetter/comments/dkfwkb/help_im_terrified_to_get_a_job_im_almost_21_i/f4ge1a6/"}