{"id": "t5_2tand_t3_cqw8ty_t1_ex5bso3", "creation": 1566020603, "origin": "t5_2tand_t3_cqw8ty", "height": 1, "replied_to": "t5_2tand_t3_cqw8ty", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Still_Flying_", "text": "Try not to let yourself get too isolated. Try to talk to a neighbor, spend in-person time on a regular basis with friends and family if you're on good terms, or reach out if you don't currently have any friends, and stay in touch with people on social media. Spending time around other people can make you feel less alone during the times when you actually are alone. A pet can be very beneficial as well, both for companionship and something to keep you busy, and dogs in particular are also beneficial for people who are isolated by forcing them to get out of the house on a daily basis, if that's something you're able to do. \n\nTry out different hobbies until you find something you like. Some things that can help keep your mind occupied: exercise, journaling, puzzles, cooking, building things, meditation (I recommend trying a guided meditation app like Headspace or Calm), learning a new language, taking an online class (some don't require a lot of reading), and audiobooks as someone else suggested. There are so many types of mobile apps and games to keep you busy as well. If you have an iPhone, check out the Today page in the Apple App Store for ideas. I'm assuming the Google Play Store has their own version of that if you use Android. \n\nWatching TV/movies/Youtube is what works best for me though. I'm not sure if you don't watch TV because you don't like it or because you can't afford it, but if it's the latter, there are a lot of [sites](https://www.lifewire.com/watch-free-movies-online-1356647) with legal free content. Even though I miss out on current movies and TV shows, it keeps me busy. If you just can't afford to buy a TV but would be able to pay for Netflix/Hulu/Amazon Prime, you can download things when you have access to public WiFi or a friend's internet and then watch at home. Ideally you'd do this on a laptop or tablet, but a phone works too, you can get a holder that will let you put the phone as close to your face as you want so your arms don't get tired. If your only option would be the free sites, I'm not sure if they allow offline viewing, but if your income is below a certain amount, some countries and ISPs have assistance programs that can help you pay for basic home internet.", "permalink": "/r/DecidingToBeBetter/comments/cqw8ty/what_do_people_do_to_keep_there_minds_busy_while/ex5bso3/"}