{"id": "t5_2tand_t3_kqubj6_t1_gi78k9l", "creation": 1609868741, "origin": "t5_2tand_t3_kqubj6", "height": 1, "replied_to": "t5_2tand_t3_kqubj6", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "RFCCoaching", "text": "I've lived this situation (following \"conventional wisdom\") twice- in two different areas of my life.  \n\n1. There's the saying \"follow your passion.\"  I graduated college and did just that.  I am a quick learner and have many passions and that led me from one \"passion\" to another.  I found myself jumping from job to job when things got boring.  I ended up in 8 different industries by the time I was 29 without a solid career.  I realized that saying was incomplete.    The \"conventional wisdom\" did not tell me how to narrow it down.  I'm sure you have some great soft skills from your travels.  You're probably great with people, know how to navigate new situations, and can probably stay relaxed under pressure.  These are great skills you have built.  They can be very useful in your career choice.\n2. The second time was when I thought \"if I hit all my goals, I'll be happy.\"  I achieved most of my goals when I was 36. I had a career I loved and fit 90% of my criteria. I was married to an amazing woman, had a house on the hill in one of the most expensive neighborhoods in Portland, a dog, 3 cars, and made some good money off of some real estate.  I \"had it all\" but it felt incomplete.  I realized achieving my own goals was not enough; living for myself was not enough.  I had to expand.  I had to now also live for others in order to increase my joy.  I wanted to be of service to others and continue to try to expand either the breadth or depth of my giving.  \n\nSo my advice to you: embrace this next stage of your evolution.  It sounds like you have realized that just living for yourself and doing things you want is not enough.  A life is ease is not all its cracked up to be.  Find your deeper passion that can serve others.  Your experience and talents and skills can be of great service to the world.  Here's a link that can be helpful to figure out what that is.  I guide a lot of my clients through this framework and it's super helpful.  [https://youtu.be/jpe-LKn-4gM](https://youtu.be/jpe-LKn-4gM).  If for some reason, the link doesn't show up, it's Scott Dinsmore on TedTalk.\n\n&#x200B;\n\nBest of luck in your journey!", "permalink": "/r/DecidingToBeBetter/comments/kqubj6/regretting_a_no_regrets_life/gi78k9l/"}