{"id": "t5_2tand_t3_q4f2tk_t1_hfzhlnc", "creation": 1633790051, "origin": "t5_2tand_t3_q4f2tk", "height": 1, "replied_to": "t5_2tand_t3_q4f2tk", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "capricorngal43", "text": "First of all, everybody’s life goes at it’s own pace. There are 7 billion people on this planet, not every single one of them will attend school, graduate, get married, and find their passion at the same time. \nJust because a lot of people do those things in their 20’s doesn’t mean that you’re a failure for not doing the same. There is no right way to do life. When looking at your life, dont compare it to the people around you. Compare it to what you want for yourself. That’s the only thing that matters. Screw what anyone else is doing.\n\nYou’re only 30, you have soooo much time and life left to live. People who went wild in their 20’s will settle down in their 30’s, maybe you’re the opposite! Sure the future may seem bleak now, but that’s only because you’re identifying too much with your past. Change the way you look at yourself. Maybe you WERE a loner, depressed, lazy, etc. but it doesnt mean you’re stuck and can never become a different person now. You can become whoever you want to be.  \nI could go more in depth but honestly I just recommend you read the book “atomic habits” by james clear, it explains this way better than I can right now haha\n\nAnd lastly, consider talking to a therapist if you’re struggling to get up each day. They can help you change your behavior and unlearn negative ways of thinking. Just a few weeks or months in therapy can really set you up for success, and will prevent a lifetime of self sabotage & regret. I know starting therapy can feel scary and embarrassing, so try the website BetterHelp if you don’t feel like physically going to a clinic. I had a good experience with it, and it helps to get things off your chest to someone who wont judge you.", "permalink": "/r/DecidingToBeBetter/comments/q4f2tk/my_wasted_youth_please_dont_make_the_same_mistake/hfzhlnc/"}