{"id": "t5_2tand_t3_q4f2tk_t1_hg1ea27", "creation": 1633821043, "origin": "t5_2tand_t3_q4f2tk", "height": 1, "replied_to": "t5_2tand_t3_q4f2tk", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "YourFatherHere1", "text": "Hey, man! Don't be down on yourself. And don't make the mistake of excusing yourself from taking responsibility to live your life *now!*\n\nBy saying it's too late, you're avoiding everything you've avoided up until this point - risk, fun, love, etc. - so *believe* it is not too late and start now.\n\nI think we often picture change as a drastic, dramatic shift in our lives, like selling everything we own and backpacking through China (and it totally can be!), but more often change is the result of small daily behavioral modifications (like going on a ten minute walk every morning). In the short term, these changes don't look like much, but in the long run, they dramatically change the course of your life and your story.\n\n*Please* don't dismiss your power to change your life today. You can start with anything.\n\nHow can you improve someone else's life today?\n\nHow can you improve your own life today?\n\nYou say you haven't found love - what is one concrete step you can take toward finding love? Well, let's see: you can join a dating app or website, you can go on a walk and make conversation with a stranger you find attractive, you can join a singles meetup, you can join a club or class and meet people through that.\n\nYou say you never had a hobby - what is once concrete step you can take toward finding a hobby today? You can go enroll in a class at a community college. You can try an activity other people tend to enjoy as hobbies (fishing, golfing, art, writing, etc.). You can buy a book on a subject you find fascinating and learn more about it.\n\nWrite down the areas of your life that are lacking and *list concrete steps you can take toward fulfilling them*. They must be concrete though. Goals like 'I want to take risks' or 'I want to find love' or 'I want to be happy' will never be reached; you *must* get specific and concrete and set deadlines. So instead of saying 'I want to find love', say 'I will talk to at least five attractive women every day', or 'I will join a dating app and go on one date by next month'.\n\nIt is not too late. You just need to start now.\n\nMuch love from a fellow human in this journey of life", "permalink": "/r/DecidingToBeBetter/comments/q4f2tk/my_wasted_youth_please_dont_make_the_same_mistake/hg1ea27/"}