{"id": "t5_2tand_t3_q4f2tk_t1_hg2hpbg", "creation": 1633841286, "origin": "t5_2tand_t3_q4f2tk", "height": 1, "replied_to": "t5_2tand_t3_q4f2tk", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "_fireintheattic", "text": "I'm 32. I tell everyone I was a zombie my whole life until about 28. I barely even remember anything I actually did or decided prior to my mid 20s. No idea how I got my degree lol ... Im intelligent yes but I didn't really do much in university and I get jealous of what others did because I know what I could have accomplished ... but o graduated and like you got a good job as a research analyst. In my late 20s I started to wonder why I was living and why I had to go through 50 or 60 more years of this. Lol. What was life even about? I remember thinking that life is way too long.\n\nI don't remember what made the change but I know that I started trying things even though they seemed completely pointless to me. Little by little over 4 years I've managed to develop a life of meaning.\n\nThat said, it hasn't rid of me of the overarching awareness that I'm really doing these things to pass the time lol.  But life's a whole lot more bearable than before when all I had was a job.\n\nI think for me that feeling might go away when I stop being such a huge loner. I've gone from someone who didnt want to be burdened with a family to seeing the value of living for someone other than myself (because honestly this planet does not have much to do that I think is worth existing for for me personally). I realized that the thing I've been avoiding out of fear is probably why I've felt that emptiness.\n\nAnyway the first step is realization. Which you have. The second step is taking the making very deliberate decisions about your life and trying things just to try them. If you regret not having done things in your 20s, then try putting yourself out there now.\n\nAll you can do is move forward. You're not even 30. You have lots of time.\n\nI have a lot of regrets about what I didnt do back then but the greatest regret will be letting that stop you from starting now. There's soooooooo much time. Lots of people dont start truly living the life they want til 40 believe it or not.\n\nSo you're not as behind as you think. And don't let social media fool you.", "permalink": "/r/DecidingToBeBetter/comments/q4f2tk/my_wasted_youth_please_dont_make_the_same_mistake/hg2hpbg/"}