{"id": "t5_2tand_t3_q4f2tk_t1_hfzf6dh", "creation": 1633788858, "origin": "t5_2tand_t3_q4f2tk", "height": 1, "replied_to": "t5_2tand_t3_q4f2tk", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CanadianFemale", "text": "I'm sorry you're feeling this way. It sounds like you're feeling really lonely and lacking in a higher meaning for life. I get the sense that you're just existing and that life hasn't worked out the way you imagined it might.\n\nIn spite of your struggles with what sounds like motivation, mood (possible depression?), and perhaps social anxiety, you have managed to become a software developer. And you're not even 30 yet.\n\nWhile it tends to be easier to make friends in our teens and 20s, you still have PLENTY of life left ahead of you. 30 is still considered a \"youth\" in many places.\n\nDoes your software developer job offer extended benefits that might pay for some professional support?\n\nThe first thing I'd recommend you look into is self-compassion. Check out [self-compassion.org](https://self-compassion.org) for more resources on the topic.\n\nYou have a lot to offer the world and you have accomplished a lot. It appears you're not currently able to see that or give yourself credit for it. You deserve some self-compassion. Life is hard. You've had your own challenges to overcome. Just because they might not look as big, tragic, or dramatic as some people have experienced, it doesn't mean those struggles don't count . You're overcoming challenges every day. Based on what you wrote, I'm guessing just getting out of bed and facing the world might be a challenge for you right now. Yet you seem to discount your struggles as not bad enough to be deserving of compassion. Your struggles are just as real as anyone else's. We all have struggles. Even the most pampered and wealthy people have struggles.\n\nAlso keep in mind that we've been in a global pandemic for nearly 2 years now. Even the most emotionally healthy and connected people are feeling it. A lot of people have died or their health conditions have gotten much worse, due to lack of physical activity, depression, social isolation, substance use, etc. You are not alone in this. Any feelings you might have had about not being good enough 2-3 years ago are only going to be exacerbated by the stress of the pandemic and all of the ripple effects of that.\n\nYou still have time to start building the life you want. You are just as deserving of love and friendship as anyone else. It is your responsibility to start building the skills to move in the direction of what you want. But responsibility is not the same as fault or blame. There is no judgement necessary in this situation. You have been doing the best you could with the skills, energy and motivation you had at the time. AND you want to do better. You CAN get there if you want. And it's going to take a lot of self-compassion and maybe a trained professional to support you in getting the life you dream of.", "permalink": "/r/DecidingToBeBetter/comments/q4f2tk/my_wasted_youth_please_dont_make_the_same_mistake/hfzf6dh/"}