{"id": "t5_2qh5i_t3_jjuzjc_t1_gag27kd", "creation": 1603934125, "origin": "t5_2qh5i_t3_jjuzjc", "height": 1, "replied_to": "t5_2qh5i_t3_jjuzjc", "down_vote": 0, "up_vote": 51, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheWalkingDead91", "text": "I won’t speak for her, But just to explain my reasons personally, as an almost 29 y/o who just sent in her first ballet today. The reason I’ve never voted before personally is because I didn’t think my vote would matter anyways. Being a liberal in Florida, at least in the area I live in, I’m surrounded by Trump signs everywhere I go. Even back in 2016 it was that way. So I figured “why bother, when he’s going to win the state anyways.” Also, back then, I honestly did think Hillary was going to win, so thought foolishly “there’s no reason to vote because no way someone like trump could actually win right?” I mean that’s what “common sense” dictated and all the “polls” were saying, right? I literally remember hearing about the access Hollywood recording and saying/laughing out loud “Trump is done for. There’s absolutely no way he’s going to win now.”\nYea.....I learned that year to never underestimate the stupidity/gullibility of the average person, and the power of free press. \n\nThat being said, I, like a lot of first time voters who have had the declined opportunity before, feel like there’s a lot more at stake now, (for obvious reasons) and that things have been going far too south the the last four years. Thanks to Trump and the varied and widespread media coverage he has created, I’m also a lot more educated on how the the government works overall and that the president isn’t the only thing you’re voting for when voting....think about it....how many people around my age back in 2012 and earlier could say they know details about as many people and as many names in the government? At least that’s one good thing that has come of all of this.....I think people are definitely learning a lot more about the system and paying more attention these days. It’s unavoidable. \n\nThat being said....screw the polls, my money is still on Trump taking it home again. I feel like as a pessimist; that’s the only stance/expectation I can reasonably make.....if I’m wrong, then yay! If I’m right, then at least the blow will be less disappointing, since I expect it coming.", "permalink": "/r/happy/comments/jjuzjc/i_am_34_years_old_and_just_voted_for_the_very/gag27kd/"}