{"id": "t5_2tand_t3_prvurc_t1_hdlig5m", "creation": 1632149707, "origin": "t5_2tand_t3_prvurc", "height": 1, "replied_to": "t5_2tand_t3_prvurc", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Cyberskating_lizard", "text": "Here's some info for victims left messed up by bad experiences & which made insecurities worse\n\nBullies like that pin prank are insecure. It's a part of human nature to have some weakness and flaw thus insecurities and they've chosen a wrong path to deal with these .They abuse people who obviously not as tough as they are so they \"are confident\" with the less tough BUT they are not confident in common sense ethics...they for some reason don't trust these to get socially wealthy aka popular or respected etc so they make some fear them or something. THEY'RE AFRAID to look stupid.\n\nThey don't distinguish the difference between socially HEALTHY & what I call socially \"wealthy\" \n\nYou see, it's an obvious red flag he wasn't adequate friend for you...and for that matter ,for anyone !!!\n\nTo make sense outta all which occured to you one can look at one self and hope to see so to banish from one's mindset anything unethical (when we attempt to get them into trouble for what they do, they'll use or invent flaws that annoy them to explain why they tempted )\n\nI too was victim of \"the cooler people\" & autism only made it worse exterior & interior harder to check if I'm making a mistake. \n\nOnce I cleared my conscience that I do/did nothing unethical THEN I could figure that I deserve better then that, so the blows of life taught me that at times one needs to burn bridges and live a \"me here, them there\" meaning \"they live their lives we live ours\"and have that gap between people who don't distinguish socially thus morally healthy and the socially wealthy aka popular or cool etc.\n\nIf it takes more than common Sense ethics to have people be comfortable with you, want to be your friend or close peer and even enjoy your company, it's a major red flag if they like you less or not like you because \"you're weak\"or scarce in a covetable quality (brave,strong,smart etc etc ) which is independent of how morally evolved you are and how ethically healthy your heart is towards your peers. They obviously are not good company if being good is not enough for them to like you or respect you. These are things that the blows of Life have taught me.", "permalink": "/r/DecidingToBeBetter/comments/prvurc/how_unprocessed_experiences_lead_to_addiction/hdlig5m/"}