{"id": "t5_2qh1i_t3_pi3u0i_t1_hc8dz26", "creation": 1631223360, "origin": "t5_2qh1i_t3_pi3u0i", "height": 1, "replied_to": "t5_2qh1i_t3_pi3u0i", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Confused-Moonin", "text": "This is the first time I’ve felt able to write my story.\nThree years ago I was newly married, I am the mother of a severely disabled teenager who I had when I was very young and have had to bring up complete alone. Life was so hard and although I adore my child I always dreamed of having the opportunity to have another shot of motherhood, do it as a loving couple and share the joy. I also possibly selfishly wanted to experience what it was like to have a child who wasn’t always sick and have the pleasure of seeing a little one thrive.\nIt had been so painful watching my firstborn struggle, it always will be. I wish I could take away all of the pain and suffering he’s experienced, watch him thrive, maybe grow up, make mistakes, have fun, fall in and out of love, have a job. It’s like grief I guess. I adore him.\nMe and my husband had always discussed having children, it was my dream. My husband got cold feet after we married, he’s an anxious person who worries about finances, we were not as secure as he wanted. He wouldn’t commit to having a baby, it caused so many arguments as I felt I’d been lied to. He married me and then reneged on our dream.\nI’ve always had thoughts of suicidal ideation but felt I’d never go through with anything because of my boy. It became too much, I couldn’t cope, I felt my life was just work and caring, no fun or new life.\nI took several packets of my sons medications. I hoped to go to sleep as they’d be better without me.\nI woke up in my own workplace in ITU 3 days later, I’m well know where I work. The shame and disappointment was horrendous. There were some alcohol rub and syringes on my table and I contemplated accessing one of my ports and injecting myself with alcohol rub as I didn’t want to deal with the aftermath.\nMy family were round my bed when I woke, I felt horrible for the pain I caused.\nThe following weeks I was angry I had failed and embarrassed. I went back to work and I still to this day wonder if any of the people I encountered regularly may have looked after me or know what happened. It’s been rough, it’s a stigma for me.\nThe story is not all bad though, me and hubby had counselling. We agreed to try, my baby is two, he’s healthy, thriving, his big brother adores him and he is my baby’s hero. Daddy adores baby, my life was worth something after all. I’m so glad I made it here.\nStay strong.", "permalink": "/r/AskReddit/comments/pi3u0i/suicide_survivors_of_reddit_what_is_your_story/hc8dz26/"}