{"id": "t5_2tand_t3_85n22q_t1_dvzhcpa", "creation": 1521535684, "origin": "t5_2tand_t3_85n22q", "height": 1, "replied_to": "t5_2tand_t3_85n22q", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "elsimer", "text": "Maybe it seems that way if you look at everything all at once, but that can be overwhelming. Don't compare yourself with others, it's innaccurate and a waste of time. It's a common misconception that creativity is natural to some people, it's not. It's a skill that needs to be trained just like running or mathematics. Just think about things you enjoy, no matter how small they are. Whether its drawing or playing video games or whatever it is, take pride in the fact that it gives you some pleasure, and take it seriously. Take the things you like seriously no matter how small they are, and put in honest effort to get better at it. You will get joy from it and you may even become passionate and have something turn into a hobby, which you can get better at and will last your whole life providing continuous joy no matter what anyone else has to say about it. You will notice how many things you learned from your interests that apply to life in general, and also other specific interests. You'll gradually have more and more things to say, and if you keep this up, you'll become the type of person who has something interesting and insightful to say about virtually any topic. I wish you all the best my friend and urge you to be selfish, and not pre-occupy yourself with how you might compare to others. You never know another person's life and they might seem good at something but feel miserable inside, either way you can't get joy from other people's accomplishments so measuring them is counter-productive. Focus on yourself, your own progress relative to where you were previously, and remember that joy & passion are the strongest motivating forces and will build on top of each other to provide you the confidence you're missing now. All it takes is for you to value yourself and dedicate time and focus on yourself.\n\nThe last thing I want to leave with you is some insight into Stoic Philosophy. Stoics believe one should refrain from extreme emotions because both extreme negative or extreme positive are equally distracting from the meaning of life. Also, any extreme emotion will be followed by an opposite reaction with equal force. To crudely paraphrase the Stoic view (which I have adopted as my own), the most important thing in life is the quality of your voluntary thoughts and actions, that they should be wise and good, healthy and praiseworthy in your own eyes.", "permalink": "/r/DecidingToBeBetter/comments/85n22q/i_cant_seem_to_make_any_sort_of_connection_with/dvzhcpa/"}