{"id": "t5_2tand_t3_85n22q_t1_dvyqh5b", "creation": 1521498507, "origin": "t5_2tand_t3_85n22q", "height": 1, "replied_to": "t5_2tand_t3_85n22q", "down_vote": 0, "up_vote": 69, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mobydog", "text": "I'm no expert, but when you say it doesn't take anything special to be in a relationship or have someone care about you, it sounds like you think that just sort of happens accidentally, or that it's really easy for people. But it does take something special, it takes someone with emotional intelligence to show real caring and concern for another person. It takes vulnerability and a willingness on your part to reach out and touch others. Isn't there anyone you've ever met that you wanted to have more of a relationship with? I'm guessing you're a lot younger than me, and it seems like younger generations are having trouble connecting in part because of social media or the instant gratification culture that we have, but it sounds like you also don't have the skills or haven't learned what it really means to expose your heart to someone else. You might try the book Daring Greatly by Brene Brown, or the book Emotional Intelligence by Daniel Goleman, but maybe try just talking to someone you're  interested in,  without any ulterior motive or goal in mind.  You say other people talk to you,  do you talk to other people the same way?\n\nSorry this is so long but I'll just add, I'm a big fan of getting therapy. In my family system we have experience with emotional abuse and what that means for social anxiety and the resulting difficulty with being  able to maintain healthy relationships. It's not necessarily the kind of thing you can fix on your own, because you don't know what you don't know. So I would recommend you maybe talk to someone who has an objective view point and can help you work on specific skills. Good luck.", "permalink": "/r/DecidingToBeBetter/comments/85n22q/i_cant_seem_to_make_any_sort_of_connection_with/dvyqh5b/"}