{"id": "t5_2tand_t3_qcebrc_t1_hhfq0mb", "creation": 1634778592, "origin": "t5_2tand_t3_qcebrc", "height": 1, "replied_to": "t5_2tand_t3_qcebrc", "down_vote": 0, "up_vote": 68, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bmathey", "text": "You are going to rock this.  I’ve interviewed and been the interviewee a lot in my life.  Can I offer some tips?\n\nWhen they ask if you have any questions for them ask the following: ‘what do they like most / least about the culture of the firm?’ … then your final  question is  ‘Did you have any other question about my qualifications?’ This question forces them to either concede you are qualified for the job or put objections out in the open for you to address.  \n\nSecond thought, if you have a friend, practice!! Interviewing is a skill like anything else. Don’t go crazy but take a few runs at it.x. \n\nFinal advise, prepare three or four anecdotes that can be used to answer their behavioral questions, then work to fit the anecdote to the question, not come up with the anecdote on the spot. So maybe there was a project you did well and were recognized.  If they ask about leadership bring up the project and how you had to influence others without authority, if they ask about creative thinking, bring up the project and focus on something you did creative.  We just don’t want to be stone cold going into these questions.\n\nBonus advice:  the interviewer is nervous / bored / human as well.  Try to make it a conversation not a call and response affair.\n\nBonus bonus advice (sorry):  when hiring I want someone who wants to be on my team not someone fleeing their old job.  So when they ask ‘why do you want this job’ you say something like ‘You know there is always a push and a pull in these situations.  If there wasn’t  a push I wouldn’t be looking, but you asked about this job and I want to focus on the pull….I’ve always been impressed by this firm, you do really interesting things and I want to be a part of that’", "permalink": "/r/DecidingToBeBetter/comments/qcebrc/been_poor_my_whole_life_passed_phone_screen_to/hhfq0mb/"}