{"id": "t5_2tand_t3_hfqs3j_t1_fvzoszo", "creation": 1593116783, "origin": "t5_2tand_t3_hfqs3j", "height": 1, "replied_to": "t5_2tand_t3_hfqs3j", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "furrysurender", "text": "It does feel that way sometimes doesn’t it. There are many many many people who have felt that way before and who are currently feeling that way. You’re definitely not alone. Even if you’ve convinced yourself otherwise, I want you to know it is not impossible to overcome. I think It’s easier sometimes to believe that we can’t, because then we don’t have to try. But eventually we all come to a point of rock bottom where we either climb back up or drown. If you don’t want to drown then you have to find the will to change. The will to change won’t come right away and it won’t be a walk in the park either, but you can at least have the intent in the beginning of your day to do something different that can possibly guide you in the right direction, just like making this reddit post. It’s a start and it’s a good start, asking for help and advice and insight imo is the best way to start, no one does this alone. But if you’re content on believing you are incapable of change then be content in drowning in the dark. My advice is to have awareness of where you’re heading, then ask yourself “is there where I want to be heading?” and then sit and listen to the voice in your head or the feeling in your gut/heart/body. If you don’t want to continue the path you’re heading, then focus on that feeling or voice that is there inside you to guide you. Please believe me when I say that things can still get worse. There is no limit to your rock bottom. The mentality of “it can’t get any worse than here” is a coping mechanism, and a dangerous one, because things can always get drastically worse. My advice is to not keep drowning. Take responsibility for yourself and your life because no one else will and you deserve to live a good life, everyone does. You’re no exception even though it feels that way sometimes. \n\nRussel Brand has been sober 15+ years from a heroin addiction and is imo a guru of some sort, someone I look to for guidance. I often watch his YouTube videos. Here’s one that’s relevant \n\n\nhttps://youtu.be/SonRJCCkJmY\n\n\nBest of luck", "permalink": "/r/DecidingToBeBetter/comments/hfqs3j/serious_question_what_makes_you_want_to_get_better/fvzoszo/"}