{"id": "t5_2tand_t3_o4dvrf_t1_h2h2msw", "creation": 1624226973, "origin": "t5_2tand_t3_o4dvrf", "height": 1, "replied_to": "t5_2tand_t3_o4dvrf", "down_vote": 0, "up_vote": 11, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Doxer", "text": "Honestly i dont think I have huge issue with porn standards effecting my standard with women. My problem was that my viewing habits meant I was pretty much always turned on when I was going on social media and I just view my friends in a very sexual way, even when just wearing a standard outfit. This is what caused the alarm bell when I noticed.\n\nTotally, as other said boredem seems to be the start of main issusing involving porn. It was somewhat an issue here, normally it was brief downtime such as waiting for a meeting at work or being on the loo where I would open up reddit for 2min intervals and just snowball from there.I've heard on here a couple of times that some people need to learn to be okay with being bored, you dont need to fill in those 2min with something. I have ADHD with makes this a bit more tricky but I want to try and get there. If I can avoid surfing the web in those small windows of free time, It will help massively.\n\nTo answer your question; Realtivity i wasn't too bad compared to some souls out there.  I think the NSFW gaming community is the best example of this and VR has just made it worse.  I dont want to tempt people but giving titles but If you want a glipse, send me a PM and i'll share some big ones.  I just feel sorry from them.  As I think this sub is revealing (to me anyway), that there a serious problem with Porn with insolated individuals, even so with one with limited, nonsexaully driven, casual contact with their desired sexual genders.  They are trying to fill in a hole which just keep on growing, I wish them the best and It was my motiviation to posting publically to maybe bring some back in.\n\n  \nEdit: spelling, reworded some bits.", "permalink": "/r/DecidingToBeBetter/comments/o4dvrf/deleted_my_200gb_porn_folder_leftunfollowed/h2h2msw/"}