{"id": "t5_2tand_t3_k8gaw4_t1_gexwgen", "creation": 1607349564, "origin": "t5_2tand_t3_k8gaw4", "height": 1, "replied_to": "t5_2tand_t3_k8gaw4", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "HyperThanHype", "text": "Your self confidence plays a big part in how you think other people see you and how they actually see you. \n\nI used to be awkward around the opposite gender also and I think when you're young that's natural because you have a fairly basic view of girls/boys, unless you have heaps of cousins or a big friend group or start work young you generally don't have lots of interactions with the opposite gender so besides our immediate family a lot of our inherited knowledge comes from books, TV, movies and music which generally paints a fairly black and white picture of what interactions are usually like, especially when being interpreted through our hormone driven brains lol. Especially for boys, for many of us at the ripe age of 13-21 if a girl even half smiles at us we remember that shit for a looooong time lmao. \n\nWhat helps is building that self confidence, and maybe trying to talk to others like you would your siblings. My siblings and I have great laughs and joke around all the time, and I eventually realised that if I stopped talking to girls like I was trying to be cool or confident, and just spoke to them like normal human beings like my siblings are, the girls would probably appreciate being treated just like another person instead of someone I was trying to impress. Obviously as you grow older you learn the difference between general friendliness and attraction and are able to behave based on what you feel.\n\nBut yeah, get that self confidence booming. Exercise is great for that, workouts are fantastic for finding a barrier then pushing through, and pushing past your perceived limits can do wonders for your sense of pride and accomplishment.", "permalink": "/r/DecidingToBeBetter/comments/k8gaw4/how_to_comfortably_talk_to_boys/gexwgen/"}