{"id": "t5_2tand_t3_ivunth_t1_g5wfzw7", "creation": 1600565032, "origin": "t5_2tand_t3_ivunth", "height": 1, "replied_to": "t5_2tand_t3_ivunth", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "GoodRetina", "text": "I know that feeling. The paralyzed feeling. I know my story sounds like I had the will of an ox but there was PLENTY of times I just didn’t want to study. Hell I have days where I don’t want to do my work and they are paying me for it!! \n\nWhat worked for me was setting my bar REALLY low. So if I needed to study, I didn’t say “okay I’m going to study for an hour”. I told my self “I’m just gonna study for 10 minutes”. Your brain is really good convincing yourself that an hour of studying is a large chunk of time. But everyone has 10 minutes. It’s hard to not do 10 minutes. But I promise you once you start... you’ll find the 10 minutes turned into 30 or 45. This is called the “2 minute method to better habits”. I’m sure there is a YouTube video out there that explains it better than me. \n\nThere is another method or saying that stuck with me called the frog method. \n\nIf you have to eat a frog every day, do it when you first wake up. If you have to eat 2, eat the bigger frog first. \n\nEssentially, tackle hard things early. And if they have more than one, do the biggest burden first. Again, you can google it and far better explanations are out there than anything I can say. \n\nAnd third, remind yourself that the thing you want to do instead of studying will be far more enjoyable if you don’t have procrastination looming over you. I remember I had a Japanese final (yes I took Japanese) the same week Pokémon Go was at its height of popularity. It took all my will power to study first before going out to the park with my friends. But I knew I wouldn’t have been fully enjoying it knowing I still had to study. Do yourself a favor and do the hard stuff first so the fun stuff is actually fun.", "permalink": "/r/DecidingToBeBetter/comments/ivunth/i_went_from_no_hs_diploma_job_or_car_to_working/g5wfzw7/"}