{"id": "t5_2tand_t3_ivunth_t1_g5weag6", "creation": 1600564509, "origin": "t5_2tand_t3_ivunth", "height": 1, "replied_to": "t5_2tand_t3_ivunth", "down_vote": 0, "up_vote": 30, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BoyIfYouDont_", "text": "I’m not OP, but one of the biggest lessons I’ve learned is that you must truly be a sincere advocate for yourself.\n\nThis means two things. A sincere self advocate has two qualities:\nThis is always honest internally and accepts the truth, always.\nThis person also never gives up on his or herself, and is kind to his or her self.\n\n\nA sincere self advocate is also willing to understand that everyone is in a unique situation in a unique path. Yet, there are also objective standards and means of judging others.\n\n\nAs for school: study to retain and comprehend the material for life. There are study methods which are proven to be extremely useful and time efficient, and those which are next to useless. Research them.\n\n\nLastly, self comparison may rob one of joy, but it is also a useful barometer for ones’ performance in the various arenas of life. This opens up the capacity to question how others think and how they act. This opens up all the possibilities for advancement and growth as an emotional, rational human being.\n\n\n\nTraining is for dogs, thinking and acting is for human beings.\n\n\nYou will find that it is easier to not be stupid than to be intelligent, and it is harder to be dumb than either.\n\nKnowing this, simply eliminate the activities which hurt you and inspire hatred for yourself.\n\nLastly, know that very many innumerable people struggle with taking action.\n\nWhat caused OP to take action is the realization that they’ve acted in ways which drove them into a bad place. \n\nBy simply eliminating hurtful or poisonous acts, your body and mind returns to a healthier state. It is your default nature to be happy.\n\nThen, slowly start taking action. At the end of every day, reflect and note down. Collect data about your life and your results and thoughts as if you were interrogating a most wanted prisoner. \n\nOver time, you will see patterns. You will see what causes what. one makes so and so easier, and that makes this and that difficult.\n\nIf you do not exercise, you will rot away. Give your body what it needs: training.\n\nGo for walks at least 30 minutes a day.\n\nAs for school:\n\nYou will have days where you will feel like studying and you will have days where you don’t.\n\nI don’t care if you can study only for 30 seconds a day. If that is what you have to do, then do it. The value of a man lies in his skill and his worth.\n\nIf day one is 30 seconds, then let day two be 1 minute. Then double it. \n\nOnce your reach the 30-50 minute mark, make sure you take breaks. It is important for your brain to be able to rest.\n\nSlowly increase the time.\nThink about how you can study effectively.", "permalink": "/r/DecidingToBeBetter/comments/ivunth/i_went_from_no_hs_diploma_job_or_car_to_working/g5weag6/"}