{"id": "t5_2tand_t3_ivunth_t1_g5wd7ee", "creation": 1600564182, "origin": "t5_2tand_t3_ivunth", "height": 1, "replied_to": "t5_2tand_t3_ivunth", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheBlankestPage", "text": "Starting from such a basic list and escalating to such a high place---I'm so proud of you, and moreover, *inspired*.\n\nI'm 20 and have lived my whole live battling mental illness, a lack of friendships of any kind, and poor parenting, but since I finally moved out this last month, I feel like I can start moving to tackle these things too. I want to be an actor, so like you I want to go back and get my missed high school requisites to enroll at Toronto Film School, here in Canada. I've never worked a day of my life but I'm determined to attend a program that will be getting me a full minimal 7 credits---better than a GED but not as good as a full 24 credit diploma, still, enough to attend the school of my dreams. \n\nFrom there I'll starting working and getting stronger and less detached from the world. I'm going to start leaving my apartment, I'm going to start earning money that isn't just being handed to be as social assistance, I'm going to send in more casting calls from my home studio (voice acting), and find my first theatre groups---once the world opens up again, anyway; I'm going to be proud of my accomplishments. All while working to chase my passion in life, no matter what it takes. Even if I never can act full-time, it won't have been wasting my life away like many others - nearly myself included - resign themselves to.\n\nThank you for sharing this. It was incredibly motivational seeing you become stronger and find friends and even a relationship, and build your career. I wish you the best of continued good fortune. I hope I can manage to follow suit, somehow...!\n\n🥰", "permalink": "/r/DecidingToBeBetter/comments/ivunth/i_went_from_no_hs_diploma_job_or_car_to_working/g5wd7ee/"}