{"id": "t5_2tand_t3_pm77dj_t1_hcgbmjp", "creation": 1631379020, "origin": "t5_2tand_t3_pm77dj", "height": 1, "replied_to": "t5_2tand_t3_pm77dj", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "tvbuzzinginthehouse", "text": "Hey there. I’m really sorry to hear about your situation. People are actually so mean. \n\nI’m going to suggest to you the podcast “You Need Therapy”. It helped me in my healing from my childhood trauma. A few things I would like to say:\n1. Vanity is a made up concept. Beauty and what is considered beautiful isn’t REALLY beautiful, it’s what society says. Most people do not look anything like models, it feels normal because all that’s pushed at you on IG is beautiful girls but look around in real life. Most people just look normal. Of course people are mean AFFFFFF and will let you know they don’t like how you look. I realized, once I became an adult these petty comments stopped coming so much. \n\nI think a big part in healing is self love and self acceptance. Once I heard that I was like “Well that’s actually impossible for me because I will always hate myself” My mom bought me one of the cheesy ass work books called “Self Love Workbook For Women 🌈☀️❤️” Barf. but…I was like loving myself would be cool so I am going to answer every question no matter how cheesy. And although I’m not perfect, I can say I’m so glad I did it because it showed me it is possible to love myself and it’s necessary for me to be happy. \n\nKindness with others will follow once you have kindness from yourself. \n\n2. Healing your inner child, from that trauma, is important too. In the podcast she says: “every problem you have developed over time to protect yourself” everything we view as bad/challenging. we’ve developed all of our behaviors in response to something. and a lot of these things we developed as LITTLE KIDS. \n\nSo this mean attitude you developed was literally to survive back then. It’s amazing you recognized it and want to change!! Once you start being more authentic and falling into yourself, you are going to attract people that are like you and will be better friends. It may take longer but will be more genuine I believe. \n\nI noticed you said in another comment journaling made you feel sadder, but if you don’t confront sad feelings, anxiety, it will continue to grow outside your control. Maybe if writing isn’t your thing work with a therapist, talk to yourself out loud. No one said Healing is easy, you’re going to need to cry. These are very painful real things, but if you don’t go through the hurt now you’ll carry it forever.", "permalink": "/r/DecidingToBeBetter/comments/pm77dj/i_want_to_stop_being_a_mean_cold_btch/hcgbmjp/"}