{"id": "t5_2tand_t3_qbx2td_t1_hhdbel6", "creation": 1634742555, "origin": "t5_2tand_t3_qbx2td", "height": 1, "replied_to": "t5_2tand_t3_qbx2td", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NotGonnaLightYouUp", "text": "Currently in medical school. No fuckin clue how i made it this far but i always believed i could do it. Maybe your problem is the belief that you cant?\n\nThese other people saying \"you had expectstions put on you and your aspirations arent coming from you\" i think is dogshit projection by them because based on your responses, It sounds like you wanted to become a doc. \n\nAnd that wasnt pushed on you by your parents, so the reason you bailed is internal. You even still have desires to make money and do something with your life. You think youll be mad as a parent that you didnt try, and i feel thst means you are called to do something. \n\nHow do you change? You just fucking go do the thing. You try. You put in effort. You fail sometimes and learn from it. You stop pitying yourself. You accept that failure is a possibility, but if you dont even try then youll certainly fail. You start thinking for yourself instead of asking strangers how you change, and you just take action.\n\nP.S. i also have ADHD, and took meds for the first 2 years of med school. It is a very real diagnosis but its manageable. Unfortunately lots of people look for excuses and cop-outs and let their ADHD define them, and use it as an excuse for why they \"cant do well\". In my experience when ADHDers get medicated and stop with the excuses and pussying out, a majority of them can actualize their dreams. You just have to want something bad enough.\n\nPlus, med school is the hardest fucking academia one can go through. Its straight competition the whole way, for 12+ years. That being said its doable. And Even if you choose something else, its better to choose something than nothing. nothing wrong with choosing a different path. \n\nYou are like a pluripotent stem cell rn. You could become anything. But youre scared to dive in and choose a path to differentiate into. But thats what being an adult is. It's sacrificing your potential in order to follow a path. Unless you want to always be just potential. A lot of people die that way, never having sacrificed their potential to become something and its sad tbh.", "permalink": "/r/DecidingToBeBetter/comments/qbx2td/im_terrified_of_my_extremely_average_and_lazy/hhdbel6/"}