{"id": "t5_2tand_t3_qbx2td_t1_hhea7pz", "creation": 1634756444, "origin": "t5_2tand_t3_qbx2td", "height": 1, "replied_to": "t5_2tand_t3_qbx2td", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MisterMoogle03", "text": "Do you keep track of what you want out of life? Like a list of things you’d like to accomplish by a 25. By 30. By 35+? \n\nI was in an eerily similar place to you, no thanks to my addictive smoking drinking and other hedonistic habits. I still fall to my own desires some days. We’re human.\n\nHaving a physical reference to visualize what you value and want from life will help you organize the steps needed to get there.\n\nYou don’t need to have your life figured out, most people don’t, but without a direction a lot of life can seem overwhelmingly pointless (except for pleasure). \nFor example, you’re interested in writing a book. Some of the best authors take years to write their ‘worst’ books. As the saying goes, Rome wasn’t built in a day. \nHowever, knowing this, you can include writing (simply for the sake of writing) as one of the things you do everyday. \n\nNo athlete became a pro practicing his/her craft once a month.\n\nLike many have said already, your daily habits will be what builds your future. So if you decide to devote 10 hours a day to gaming and socializing everyday, you’ll have close to 99 skill points in both in a few years but still be at 10 for both guitar and writing. \n\nLong story less long, even if you have to schedule time for yourself in your head “okay today Ima practice guitar for 30 min and write for 30 min” it might seem daunting on a day when you don’t wanna do it, but do it for you anyway. The little things add up over time. Soon enough, you’ll look back and go “wow a year ago I was such a noob at this” \n\nTime is valuable and you choose how you spend it, the only person who can stop you from living the lifestyle you want is you. Whether you have ADHD or are lazy (not saying you are) or lack ambition is HIGHLY IRRELEVANT when it comes to the choices you decide to consistently make. \n\nBasically, it’s on you to decide choosing delayed gratification, or the less easy path, over easily attainable pleasures like watching a season of a show in a day (as I’m currently doing while studying)", "permalink": "/r/DecidingToBeBetter/comments/qbx2td/im_terrified_of_my_extremely_average_and_lazy/hhea7pz/"}