{"id": "t5_2tand_t3_n398b3_t1_gwqkpjs", "creation": 1620008823, "origin": "t5_2tand_t3_n398b3", "height": 1, "replied_to": "t5_2tand_t3_n398b3", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "shredtilldeth", "text": ">you don't like or believe everything your friends like and believe in, do you?\n\nLikes? Of course not. It would be a very boring world if so. But core beliefs, yes. \n\nIf a friend of mine was a racist, or anti LGBT I absolutely would NOT be friends with them any longer. I would do my best to point out their fallacy, but it they continued to sit entrenched in their beliefs then my friendship would be over with them. Religion puts you right on the line. I don't respect religion and I don't respect what it does to society so I find it very difficult to be friends with somebody who is religious. Unfortunately, religion and the short, incomplete list of aforementioned examples often go hand in hand so...the vast majority of religious folks are and forever will be on my \"not friends\" list. I have held friendships with religious people before, but they're always at arms length. I don't respect religion, how can I respect the religious?\n\nI try to be cordial, I don't go out of my way to attack random people in public about it, but I'll never sugar coat my beliefs of religion and I know that people don't like that. I don't care. Religion deserves ridicule. It is illogical, irrational, unsupported, and outright harmful. If it weren't so pervasive people would think the religious groups were absolutely batshit crazy. But since they're a large organization I'm expected to give them respect? No thanks. I don't respect a group simply for the fact that they maintain a lot of members.\n\nIt's no different from ridiculing flat earth theory. Which is something that makes some people happy. Doesn't mean they don't deserve ridicule. They believe in some dumb shit. Well...I'm going to say as much if you bring up the topic. If they're broadcasting their beliefs, why should I hold back my own? For the sake of being polite? Well I don't care much about being polite when people are saying dumb shit that can (and does) harm others.", "permalink": "/r/DecidingToBeBetter/comments/n398b3/went_to_church_for_the_first_time_in_many_years/gwqkpjs/"}