{"id": "t5_2tand_t3_n398b3_t1_gwpu26h", "creation": 1619994346, "origin": "t5_2tand_t3_n398b3", "height": 1, "replied_to": "t5_2tand_t3_n398b3", "down_vote": 0, "up_vote": -9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Oberon_Swanson", "text": "Remember these people like you because they think you are like them. Try telling them you're gay, or an apostate, or some other thing their dumb-as-rocks religion forbids and see how welcome you are. You might be welcome still. You might be fake-welcome while they work on getting rid of you. They might stab you in the throat and feel like they're doing the right thing because God said so and all those loving and welcoming people will pat them on the back and pretend they didn't see anything when the cops come around. That pastor up front might rape your kid one day and the church will not report it to the authorities but instead keep it as hush hush as possible. The Catholic church spent over four billion dollars keeping their pedophile priests operational rather than letting them face justice. Not saying all or most churches are like that. But some are and they are identical to the others. You seriously can't trust a man of the cloth, it's a siren song for psychopaths. Stand in front of people and spew a bunch of baseless bullshit and your own dumb opinions and have people think you are a Good Person for it? So good that nobody will believe anyone who speaks against them? Good people may or may not be attracted to religion, or find wisdom or comfort in it, but downright horrible people LOVE IT.\n\nIt can be very addicting to go to a group of people who all agree they're the best and since you're there you must be great too. It can be very intoxicating to be told you are part of God's chosen people and are going to Heaven when you die because of what you do or believe. It can be very foolhardy to think you're a better person for going to church. Who are you helping? How many people there drove past a homeless shelter they don't donate too, a volunteer organization they'd never dream of volunteering at, only to go to church and feel like a good person because they're there, helping nobody? Then they go out and live the rest of their lives like shitheads *knowing* they are good people and better than everyone else.\n\nDo whatever you want but you should beware that religion is a scam, a lie, a fraud, and it tends to make people much worse, not better. Most people there use those moral teachings not as a way to help them decide what to do and be a better person but as a hammer to hit others with for not living up to, all while claiming to be good because society has spent so long saying the religion and morality are related in the slightest. You're on your way to joining a cult that society pretends isn't completely insane because they're old and have social influence. If you want to be a better person, do good things, help other people. Beware of pumping up your own ego and feeling like you're in a community because of the insanity you're willing to go along with for the sake of keeping those things.", "permalink": "/r/DecidingToBeBetter/comments/n398b3/went_to_church_for_the_first_time_in_many_years/gwpu26h/"}