{"id": "t5_2tand_t3_j0j72l_t1_g6v2x5p", "creation": 1601225326, "origin": "t5_2tand_t3_j0j72l", "height": 1, "replied_to": "t5_2tand_t3_j0j72l", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Economy-Category-936", "text": "Dude trust me it's so achievable, I've done the same as you and hid away from people. My mindset was forget everyone they've never cared for me. I felt so tired of trying to fit in.\n\nAfter a month or so, of working on things such as mediating, no fap lol , working out, reading self help books, cold showers and just realising I love myself and not just saying it, actually feeling the love for myself. I feel as I've rebirthed but truth is I just started enjoying the present moment and saw that my problems were my choice so I chose to have better problems.\n\n Coming on places like Reddit and asking and talking to people getting new perspectives has been a game changer for me. You need to consider the fact your wrong, you need to consider the fact that your thoughts are just that thoughts. You give power to what you believe in. Listening to new perspectives will give you tonne of help I advise looking up the YouTube channel after  skool.\n\nRemember the brain is so clever and when you bring in topics like your sub-concious and how your past effects the way you see the present you can kinda see how we can just get led in loops. Look up practicing mindfulness it'll be a tool you'll use for life.Start talking to yourself more positively aswell, if you go around calling yourself a piece of shit. Your brain will pick up on this so be nicer to yourself. With anxiety remember it's just your assumption you don't know the future. All you have is the present moment. Start challenging your anxiety do the things that you fear, see it as excitement rather than fear. The more you push yourself the smaller your anxiety will feel.\n\nStay at it bro, I'm still trying and improving and I believe I get stronger every day especially on the negative ones. You'll get there and I'm looking forward to when that happens for you. PM if you ever got any more questions my guy.", "permalink": "/r/DecidingToBeBetter/comments/j0j72l/after_neglecting_my_mental_wellbeing_for_nearly_4/g6v2x5p/"}