{"id": "t5_2tand_t3_m0a9w1_t1_gq7t4xt", "creation": 1615216072, "origin": "t5_2tand_t3_m0a9w1", "height": 1, "replied_to": "t5_2tand_t3_m0a9w1", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Skyplanteu", "text": "First of all, a big fat well done to you for being so strong and doing the best that you can right now. You really are a beast and are proving to yourself how you can get back from any setback. If no one has said it yet, I am so proud of you and you are doing really well man keep going you are going to be okay!! \n\nI am impressed you've even managed to go to the gym, drink water and eat as well as go to therapy. That is truly incredible and good for you.\n\nNow as for advice: \n\nBefore I start just know that it is okay to be feeling so many emotions right now. Don't be in a rush of diminish those emotions because they're totally understandable. Let them happen, accept them and then let them go. Slowly but surely, time heals. \n\nKeep going to the gym, eating and drinking well and trying your best to sleep. If that means drinking something that helps (like tea) or taking pills then by all means do so. Taking care of yourself is your priority right now in order to heal enough for you to feel more confident and comfortable in yourself right now. Make sure to pay attention to your own self talk and make sure it isn't too negative and toxic. It is important that you're your own best friend rn. \n\nTake some time to work and improve yourself or do something you enjoy doing whether that's a hobby or reading books or learning new things. Try to have things (even one is enough) that make you somewhat excited to wake up and live life. With time, the hole of emptiness from your partner will be filled with other things. But please be patient and don't rush the process. It'll make you stronger. Keep staying connected to your loved ones as well. \n\nOverall just keep going and even if some days you feel like that's too hard, go one step at a time and just do your best. \n\nSomething that really helped me get out of a rut was to everyday list 10 things I'm grateful for and try to say different things every time you make this list. Some days you can only think of 10 but others you might even put down 20. The more you focus on the good, the good grows. \n\nBasically be patient with yourself, stay positive, try your best, become your own cheerleader and keep going. You're doing really well!", "permalink": "/r/DecidingToBeBetter/comments/m0a9w1/5_days_after_the_worst_breakup_of_my_life/gq7t4xt/"}