{"id": "t5_2qpzs_t3_o4psnr", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "6/20/21:\n\nI(f15) fear that this may be all life is. It’s simply a collection of moments and experiences. If those moments and/or experiences are dull and leave you missing what you’ve never had then i suppose you’re a lot like me. It’s bittersweet. Yes, life can be beautiful, I’ve seen it first hand. My sister(f25), My brother(m18), and I saved a kid(m4) from the icy grips of death, I’d say that’s pretty beautiful. I have a wonderfully derpy puppy that I love to death, that’s pretty beautiful too. Cleo, Bella, my friends, my family, it’s all terribly beautiful isn’t it? That does not, however, negate the bad. When I say bad, I don’t really mean bad; I mean the twisted, the insane, the despicable, the horrible, the nightmarish aspects of life, of this existence, of this collection of moments and experiences. My scars, the very scars that I created, that cover my body like some sickly disease that I called upon to haunt me for the rest of my life; that’s bad. My rapists, BAS, those who I trusted with my life, whom I cared and loved for, who betrayed me bitterly without a second though; that’s bad. Anorexia, my ED, the thing that makes me anxious when I see food or even just think about the action of eating, the thing that makes me cry at the mere thought of stuffing that single chip into my mouth; that’s bad. So, life is a collection of moments and experiences. Maybe, the point is to aim for the good, the great, the happy. Maybe that’s all there is to it. Maybe not. Maybe life is just about trying, despite everything it throws at you, to try and never stop trying, even if all you can do is the bare minimum, so long as you try then you’ll always have that. Maybe life has no meaning, and maybe that’s the whole point. Life is what you make of it, after all. You’ll never be able to control others, your surroundings, your situations, none of it. All you can control is yourself. It’s kind of twisted in that sense, isn’t it? You can try all your life, do everything right, but if you’re dealt the wrong cards then their’s very little you can do about it. Maybe I should pray on it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o4psnr/thoughts/", "title": "Thoughts", "social_network": "reddit", "user": "Faithfulservant12378", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1624261057, "permalink": "/r/SuicideWatch/comments/o4psnr/thoughts/", "nsfw": true, "first_save": 1635422269.3817298, "replies_charged": false}