{"id": "t5_2qpzs_t3_l6hjw4", "request": ["56f46b9a-59d4-48f0-aed3-4247ea68706d"], "text": "Like one minute I think about what I'm going to do and i feel peaceful and excited, the next minute I'm really terrified and the idea of failing or being found out or anything going wrong or even being in unbearable pain stressing me out so much. And no it's not a sign that I still want to be here, because  we're in lockdown and I refuse to traumatize my family and do it in my home no matter what pain I'm in. And I barely leave my house at all so I couldnt randomly leave and get away with it. Well I'm planning to do it in the summer. But it's been an interesting shift going from \"I'm going to kill myself\" to actually researching methods and making a plan. I feel happy that its finally going to end, happy to take back control, when I think about doing it I get happy, but then other times I'm truly terrified of what I'm going to do. Because no method is truly guaranteed and the consequences of failing are baddd. I just know I'm going to be in agony in my last moments and its really overwhelming me, like I'm getting so stressed out and headaches and everything lmao. Because it's so scary planning this! Is anyone else this way or I'm genuinely just a pussy because I never read anyone being scared only that they're determined and they feel peace, which is me sometimes but I'm going back and forth like a yo yo. Considering all the risks and pain involved, I honestly am just shocked by people who are able to go through with it. I hope I can be one of those people too.", "url": "https://www.reddit.com/r/SuicideWatch/comments/l6hjw4/is_anyone_else_really_scared_and_stressed_about/", "title": "Is anyone else really scared and stressed about committing suicide?", "social_network": "reddit", "user": "gtomson26", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 33, "down_vote": 0, "creation": 1611789962, "permalink": "/r/SuicideWatch/comments/l6hjw4/is_anyone_else_really_scared_and_stressed_about/", "nsfw": false, "first_save": 1635428376.5053196, "replies_charged": false}