{"id": "t5_2qpzs_t3_luiys3", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb", "c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "How are most women straight?\n\n\nI recognize by the way that this is a question that probably arose entirely out of me currently dealing with psychosis, and a breakdown and buildup of my ego from that. I am a schizoid with schizophrenia and after nearly stabbing a tweaker while on a snap decision pilgrimage 3000 miles away from my home a mere three days after being released from an institution, I have been deemed bipolar as well. \n\n\n\n\nI don’t understand how most women are straight. The reason behind this is just that I think a passion for men and boys requires a more advanced pallet than most women possess. \n\nWhen I was sixteen for example, I had always been attracted to girls and lost my virginity to one, and exclusively hooked up with them for the next year. Then after that I dropped out of school and got a job at a chocolate factory where my male managers caring demeanor made me want to hug him and I felt attracted to him in a strange way that I think resembles a love for a father, except I have a present, caring father and I never felt this way towards him. The attraction was totally different from the girls who I’d only pursue as a way to play a game of social puzzle solving where the reward was sex, because that’s a game that society accepts while my feelings for my manager, where if he ever held my hand I’d faint, and sex would be a life changing, passionate and vulnerable act, felt completely wrong.\n\nThen I became obsessed with my own body, anorexia put me in the hospital and I narrowly survived. I don’t necessarily consider myself the same person after that. It caused hormonal issues and my body ceased to produce testosterone. Still obsessed with my new lightweight feminine figure, I admired other boys features as well. I was asexual but still felt a deep attraction towards boys and men that I’d never experienced in my cold friendless schizoid life. I was also depressed, and would have an encounter with the police during a suicidal episode. So I was put on clomid by a somewhat shady men’s clinic. \n\nIn the following days I was a mad man. Speed hadn’t ever done anything like this before. I was frustrated, and while I’d stock the freezer at work I wondered if schizophrenics like me could talk to god if we stopped taking vraylar, and if my family would still love me if I started murdering people. I was writing handbooks for myself that reminded me that I was a god incarnate while I was juggling tinder conversations with girls. I landed on one little Asian girl who was 26, much older than me, and she was a science teacher. She was actually a boy, a male to female transgender pre op. We had my first ever date where I was nervous, evasive, and turned down sex, was offered psychedelics if we continued to date and I have now given up on the idea of ever dating or having sex again. I am a recluse and go weeks without seeing another human being. \n\nBasically, I had to go through a hellish, disgusting mess of a life only to end up here, where I’m no longer attracted to having sex but just to being romanced, and I don’t have that same warm passionate connection with any female on the planet that I get from the cashier that looks like a young Axl Rose (Put me in front of him and then Mrs America and see which one makes me blush) and I’m never interested in talking to another girl again. \n\nAt the heart of the question is this: because I view being attracted to women as surface tier desires and being attracted to men as a more refined passion, I understand why few men like men, but it’s hard to believe that a vast majority of women pick up on it instinctively. Maybe I just think them being so prone to it is too beautiful because there’s so much of this passion the world, or maybe I’m bitter because half of humanity got their feelings for free and I’m going to shoot myself in my one room apartment damn anyone in the room on the other side of my head.", "url": "https://www.reddit.com/r/SuicideWatch/comments/luiys3/my_last_schizo_rambling/", "title": "My last schizo rambling", "social_network": "reddit", "user": "Lordd_Humungous", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1614527106, "permalink": "/r/SuicideWatch/comments/luiys3/my_last_schizo_rambling/", "nsfw": false, "first_save": 1635422271.6230092, "replies_charged": false}