{"id": "t5_2qpzs_t3_qenkhi", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "I don't think I have ever had a real friend.  I thought people were my friend but it was only because of what I could do for them money, drugs, transportation, etc. I wasted the best years of my life with these people only to find out they would not even take a few minutes out of their day to help me or think of me. I didn't even matter to them.  I had to take care of myself alone. I had to do anything I wanted to experience alone.  Yet I was always expected to be their mother basically and I ran their life and mine. \n\nI don't use social media because I think the goverment cares what I say or do it's because literally no one will accept my friend requests. It was so embarrassing to try Facebook or Myspace which had the top 8.  I was in no one's top 8 even the person I thought was my best friend in the entire world. Like he meant so much to me and I might not even be alive now if I didn't think I had him as a kid.  But looking back he never even got me a birthday or Christmas present even though I always did for him. I was so naive I thought maybe that does not happen in real life. I see people do it on TV but that's not real.  He would not even come to my house. \n\nReddit is my only way to interact with the world and all I do is make people angry on here. Even when I think I'm asking simple questions or making good observations they don't hear what I say.  I feel like I come across like an asshole.  They say mean things I get mean back. I can't do it anymore. I want to delete my account and myself. \n\nI'm on the spectrum and I think that is why. People have told me I write in a really strange way and mock me for it.  You probably don't even understand this even though it seems so clear to me.  They said I had a high IQ in school and English professors in school said I was a good writer but I guess that does not matter. \n\nI don't care if I get sick and die. I'm not gonna like get a gun or something tonight but I can't try anymore. I thought maybe if I got a pet I would have some companionship and a reason to live because who will take care of my dog and they will love me.  I can't even convince a shelter to give me a dog because I am such a fuck up. I wish I could trade places with some dying kid in a hospital. Someone who has people who care. Someone who has a future.  All I do is sit alone in my house and no one cares. I just don't see a point. I try to so hard to find the good in life and there is just none for me anymore. \n\nI just want to buy some heroin and OD.  It would be peaceful.  With my luck I would survive and become addicted but maybe that is a risk  I should take.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qenkhi/no_one_needs_me_and_i_cant_even_communicate_with/", "title": "No one needs me and I can't even communicate with society.", "social_network": "reddit", "user": "Logical_Vast", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1635061706, "permalink": "/r/SuicideWatch/comments/qenkhi/no_one_needs_me_and_i_cant_even_communicate_with/", "nsfw": false, "first_save": 1635427939.4188201, "replies_charged": false}