{"id": "t5_2qpzs_t3_hwwtal", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "So last time I expressed me wanting to die pretty much mid panic and same applies here, but I'm genuinely very confused. I have been getting more clear help for my problems lately. I'm currently taking a gap year to focus on my mental health alone because it's gotten to that point. I have self esteem lower than the deepest trenches in the ocean, and after someone else broke my trust again recently, it's been hard to trust fully. There was a point when my ex had my full trust, but she lost that eventually. Ironically, my therapist thinks my ex's constant suicidal behavior and morbid thoughts she shared with me have left me with some amount of trauma. I can't think straight. I'm so obsessed with her that it drives me crazy if I think she's going to leave me, but I'm partially the cause of her problems. It's crazy because I really don't want to die, I just want to disappear and everyone forget about me. Well, technically I do want to die, but I can already imagine what will happen to my mom. My mother is sweet, but married an abusive man and had me and my sister. I've always felt like a black sheep here because my mom and sister have very similar mental issues, but no one shares or understands my experiences the way my mom and sister understand each other. On top of that, I was a daddy's girl growing up, but now I've come to realize all the abuse he's put us through. I mentioned I have Bipolar 1 in my last post, but my therapist has also recently diagnosed me with DDNOS (Dissociative Disorder Not Otherwise Specified.) Basically that means I dissociate like crazy and can't listen or remember well. I never fully realized it until recently either, but I have a lot of repressed memories. A few examples include, the time my dad was so angry, him and mom got in a fight because she was afraid he was gonna hit me (4-5 years old) Him telling my sister and I he was gonna die of heatstroke if we didn't help him outside (I was 12, my sister was 8...) Literally using me for 5 years of my life by saying if I killed myself, he was gonna kill himself too (I was 13.) He used these things to control me, and sadly, they worked. The only thing holding me back from ending it all is knowing that if my mother comes in to find me dead, it'd cause chaos. Sure I'd be away, but my little sister needs me. She and mom would be stuck with my dad (who also, mind you, called my sister and I both \"abominations\" for being bi, and told me he failed as a parent for us being bi. He also told my mom he would blow his brains out when my sister came out... So all and all, a truly outstanding guy. God I hate him. I hate the bible belt. I hate seeing the damn abuse my friends and family go through everyday.) I don't want to hurt them. I just have this fear that if I kill myself, my family will drop like flies. My mom is already fucked up as it is. My dad's an asshole and also fucked up. My sister is doing better than me right now, but still has mental shit and has a high chance of developing an eating disorder due to our dad. My grandmother would end it because I'm the favorite (even though I hate it because that just means she blames anything she doesn't like about me on my mom.) Etc. Etc.\n\nThat's a pretty long intro but I guess I thought it needed to be said. My friend and ex lover might die tonight because some dumbass fucked her up... I'm scared shitless. I woke up and saw the texts from one minute ago and when I tried to contact her, I got nothing... I'll say it again, I'm so fucking scared right now. I panicked and almost snapped and tried to find my knife (I used to self harm and have been close to doing so again so many times, but every time, the thought that she'd come back and self harm herself right back and worse because I did so haunts me) Luckily, I couldn't find my knife and my boyfriend talked me down from it, but while I was up walking around, I caught myself midway to a dissociative episode and realized I was about to try to take a bunch of Advil and drink nail polish remover, and all I could think about was how much I wanted to die, but it was never out of, oh I'm worthless and the world would be better off. It's always just the same damn thing. \"I want to die.\" No other reasoning. Just that. Going through my mind. Thinking \"fuck it\" all the time and always feeling like I have nothing to live for, but keeping myself alive because I know damn well what happens to my family if I die. It's gotten bad enough that I've started to lash out and act out because I want people to hate me. I want them to hate me just as much as I hate myself. Maybe then when nobody cares anymore I can finally die. Maybe then, but my ex always came back with I love you. I never understood that. I barely understand what love is, and I have a hard time comprehending when someone loves me and cares about me. I never expect it. No matter how much love and praise I get, I can never feel it.\n\nI talked to someone over the suicide prevention/crisis hotline a while ago. The lady said after I tripped down the stairs and got back up laughing that it was a good sign because it's like when you fall in life, you pick yourself back up and laugh and keep going. I believed and agreed with her at first, but the next morning I realized, I laugh at everything, and I mean EVERYTHING. I laugh when people cry (I don't mean to), I laugh when I'm having a mental breakdown. I laugh when I want to die. I laugh and laugh and laugh but the pain is still there. It doesn't go away just because I laugh. It's like a numbness I've felt for a long time.\n\nI often want to go out of my room at night and just go walking outside. We live on the richer side of town but in a not as expensive house. There's big open plots of land out here and we are in between the interstate and the city. Some nights, I wish I could just walk outside at night. Just to calm down, but my mom sleeps on the couch (by her own choice) and she'd hear me if I tried to go out. I just want to get out at night and just go, because that seems to always calm me down. My ex and I have gone driving at late at night and it always makes me feel better just to be out there. I'ts beautiful out here where I live, but I can't go outside when I feel the most scared or upset, and the only other outlet I have is to play music, but that will wake everyone up, so it's either sit there and have such a bad panic attack that I start wanting to take my own life just to get away, or cut, but I can't cut. No no. I'll either get the \"eye for an eye, tooth for a tooth\" thing from my ex, of punished to oblivion and back by my boyfriend (he scary in bed when he mad.)\n\nI guess that's all for tonight. Just me ranting and wondering what the hell is wrong with me for wanting to die for no reason. Just wanting to get out. Not feeling like a burden, although I do have a shitty self esteem, so maybe that's it. Idk anymore. I just needed to talk about something to keep my mind off my girlfriends potential death. I feel numb yet scared and upset right now from it all, and thinking about it just makes me want to kill myself right here and now. I know my sister keeps melatonin because she has trouble sleeping, so I know I could steal those too if I needed. Life without my ex just feels meaningless. I love my current bf too, but I have a hard time forming close connections with people, and my ex was one of those people. Even if I am afraid of her or afraid she'll yell at me again or afraid I'll hurt her again on accident by not listening or my memory problems, I still love her. God damnit this hurts so bad. I hate the feeling. The first actual love I felt. My boyfriend is ok with this (we are all poly and she's also dating him) He knows I love him too and that I actually trust him with more than I do my ex, but I feel more passion for my ex. They both make me so happy, but she and I have a treasure trove of good memories. I just don't want to lose her.\n\nFor the love of a god I barely believe in, please let her be safe. I love you guys. Peace and please I hope you have a better night/day than I'm having right now. I know it's cliche, but take care, and if anyone responds to this, I hope to talk to you again anytime I can because everyone needs someone to talk to, and I may have memory issues, but I'll lend an ear if you need to rant. Love <3, -unoriginal-username.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hwwtal/my_second_post_on_this_subreddit_alone/", "title": "My second post on this subreddit alone...", "social_network": "reddit", "user": "-unoriginal-username", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1595572251, "permalink": "/r/SuicideWatch/comments/hwwtal/my_second_post_on_this_subreddit_alone/", "nsfw": false, "first_save": 1635425249.8481226, "replies_charged": false}