{"id": "t5_2qpzs_t3_qel8k7", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "I’m a college student. My T.V just broke, in a fit of rage i bloodied, maybe broke my right hand. It’s numb. Put a dent in my dorm wall, which I can’t pay for. Threw a bag of cups across my room, and forgot I’d stuffed my $100+ sunglasses in there one night after drinking. Broken. I just spent money on a new PC, which I can’t use anymore. I’m falling behind in my classes, and I’m pretty sure I’m going to get fired from my part time job Monday, and I still have to go into my shift which is tomorrow.\n\nThings have been bad this past week since I’ve been quitting cold turkey from Weed. Yes you can have withdrawals, yes you can be addicted. I don’t have the strength to get up tomorrow, but I have to. I know that’s the only thing I can do to continue, but I just can’t. I can’t even sob anymore, my throat is sore and my face is covered in snot and drying tears. I’m at my lowest point since I made an attempt on my life 1 1/2 years prior. If I weren’t so afraid of what’s waiting for me after this life, and the pain of putting a knife to my wrists, this would be the last fucking thing anyone ever heard from me. And yet I can’t. I can’t do anything. Quite possibly I will never amount to anything of worth in this world, since I’m such a fucking raging, pathetic cry baby. The only girl I’ve ever had enough courage to ask out rejected me, twice. We’re still very good friends, and yet we both know I like her, maybe even love her. This didn’t happen recently I just figured why not paint the whole fucking picture while I’m at it.\n\nI don’t even know why I’m posting this. I wouldn’t tell a soul of this to anyone, not because I’m proud, I just don’t want anyone to see how sad and pathetic I really am.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qel8k7/i_cant/", "title": "I can’t", "social_network": "reddit", "user": "DoctorButterMonkey", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1635051164, "permalink": "/r/SuicideWatch/comments/qel8k7/i_cant/", "nsfw": false, "first_save": 1635425185.2597265, "replies_charged": false}