{"id": "t5_2qpzs_t3_dac51y", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "So, I've read the \"The Interpersonal-Psychological Theory of Suicidal Behavior: Current Empirical Status\" and, for the record, it is amazing.\nBut it really just does not encapsulate at all what I'm going through.\n\nFor one, I don't feel burdensome. I know full well that my mental state makes me problematic and \"hard to deal with,\" but - fuckin' A - I'm a massively depressed human being. The pitfalls and challenges of these things are well documented and known. Depression/suicidal intent is one helluva bitch, but it's certainly not some arcane, unknowable, and insolvable mystery.\n\nSecondly, I don't feel alienated. I'm not a mystery to myself. The rest of humanity does not confound me. And I don't feel in any way 'removed' from humanity in general. If anything I feel *too* connected to, and aware of, all the glories and horrors being human entails. I, like everyone else, am just as capable of helping as I am hurting.\n\nWhat I *do* feel is overwhelmingly tired. I am so, so very tired. And I know that with effort I can \"get through this.\" But that's the rub. It takes effort. And I'm tired.\n\nI know that life holds more joys for me. That's great. Really, it is. But I just don't have it in me to create my own anymore. Which leaves just random chance and the good graces of others to attain those moments of happiness. And even when they come, holding on to them will take yet more effort. And I'm tired.\n\nThough it makes perfect sense, I just find it incredibly sad that maintaining a baseline of functional stability takes so much though, work, and effort... but it can all be undone by a moments laziness, or selfishness, or simple brain-fart. One single lapse of effort can destroy what it took a lifetime to attain.\n\nSo on the whole, I don't hate life. It's just that I'm tired. I can see the trajectory of my life if I fail to put the effort forth, and though it's not terrible, it's still not at all great. Quite frankly, I'd just rather not.\n\nLife feels like a really good party. I've had a lot of fun, and people are still having a lot of fun, and will continue to do so in perpetuity. But I'm tired, and continuing in on the festivities just seems exhausting. So before I just pass out on the dance-floor, I would really just rather go home an sleep.\n\nDo the books have anything in them that covers that?", "url": "https://www.reddit.com/r/SuicideWatch/comments/dac51y/is_this_experience_really_that_wierd/", "title": "Is this experience really *that* wierd?", "social_network": "reddit", "user": "RightAboutTriangles", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 17, "down_vote": 0, "creation": 1569649741, "permalink": "/r/SuicideWatch/comments/dac51y/is_this_experience_really_that_wierd/", "nsfw": false, "first_save": 1635425249.5500555, "replies_charged": false}