{"id": "t5_2qpzs_t3_pd3sz3", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "I’m sorry I’m going on a rant and things might seem scrambled, but welcome to my brain. I’m in limbo of too scared to live too afraid to die. I can’t take my own life. I believe I’ll go to hell for that. I’ve attempted once and couldn’t bring myself to it. Everything has been a battle for me. Right now the biggest thing on my mind is Afghanistan. I can’t go into detail but I wish I could do more than what I did. I want to go out there and do what I joined to do. I don’t feel loved by my family anymore. I’m home and nothing ever feels the same. I suffer from insomnia, depression, anxiety, and a cavalcade of physical issues. My parents are getting old and I am definitely homesick. I more or less feel like I’m going through a quarter life crisis (23 y.o.). My mental health has been nothing but a downhill slide. I don’t talk about my feelings because I’m a guy a no one cares about it. My girlfriend tries to help but can’t because she doesn’t really understand all that I’m going through. I’m crying pretty much every day at one point or another for various reasons. I’m not the guy I used to be. I feel like I’m in a rut with my job and I’m so fucking tired of covid stuff. Everything is being jammed down our throats all the time. I have a nicotine addiction, porn addiction (for serotonin). I blame myself for a lot of things in life. My gf says I’m too hard on myself. I’m in debt and I am fighting my way out of that. I have to put up a façade so no one asks me if I’m okay because I’m not. I’m not where I thought I’d be in life. I’m nowhere near it. I thought I’d be more successful than I am. If you say I have success I’d like to see where. I don’t have much to show for my career. Albeit, there are people who are worse off than me, but there are ones who are better than me. That’s what drives me crazy. There’s always someone over me. I’ll never be at the top, I’ll never be good enough. I have a lot of issues and a lot of demons I fight. I have a lot of things that I can’t find resolve to. I’m homesick beyond belief and I feel like a failure. I’m 23 with what to show? A failed marriage? A nicotine addiction? It doesn’t make sense to me. None of it does. Was it the way I was raised? Was it my own doing? I dropped out of community college. The easiest fucking thing there is. Still nothing to show. Something killed the motivation in me. Will I get it back? Probably not. I am just cruising through life with a half- cocked plan and praying that it works. I have nothing to show that I’m good and a lot to show that I’m bad. Well, not bad in the sense of a bad person. I’d like to think I’m a good person. Yeah, I fuck up and have made some terrible mistakes. Yeah, I’ve broken some hearts. But doesn’t everyone? I want to feel emotion. To feel something. I’m numb to a lot and when I’m faced with adult choices and decisions I approach it like a child and just shut down. Waiting for someone else to pick up the slack. No one does and I learn tough lessons. Tough love. They say what doesn’t kill you makes you stronger, but what’s strength in loss? What’s loss without love? What’s love without soul. I feel empty. Powerless. I opened myself up and I got hurt. Now I have to try and not hurt everyone. I’m scared for any girl I date because I know I’m going to end up hurting her because I always do. I didn’t want to be like this. I want to be happy, in a good relationship, it’s not that much to ask for.  Is it? Am I too expectant of life? I know God has a plan for me. I just want to know what it is. I find myself in this pit more often than not. I find myself searching for the answer- happiness- and cant find it. Is it right in front of me? I mean, I’d like to think I’m a smart guy with a lot ahead of me but that’s just wishful thinking. I’m still driving the same roads, the same mess that I was before I hopped in my truck. I say it’s therapy but it’s a distraction. I’m not man enough to face my troubles. I’m not much of a man come to think of it. I’m too emotional, I lack a lot of skills. I lack knowledge. I can’t retain much anymore. My brain is fried and I feel like it’s a sponge that’s full. It’s not taking any more information in. It’s just forgetting it. I messed up a lot during my developmental years and I haven’t recovered. I have a lot of shit that people don’t know. I don’t have that many people that I can turn to. I don’t feel like I have anyone and I’m not enough. They tell me I am enough. But how do they know? I’m disappointed in myself. My body image is awful. Most days I can’t even look in a mirror. Let alone face myself. I can’t be in silence for too long. My brain will start attacking me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pd3sz3/sorry_for_the_long_read/", "title": "Sorry for the long read.", "social_network": "reddit", "user": "justyn39", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1630127557, "permalink": "/r/SuicideWatch/comments/pd3sz3/sorry_for_the_long_read/", "nsfw": false, "first_save": 1635426588.2623396, "replies_charged": false}