{"id": "t5_2qpzs_t3_6y03wv", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "**NOTE:** This posting has been approved by the moderators of r/SuicideWatch.\n\nHi r/SW,\n\n\nMy name is Megan Rogers, and I am a graduate student in the Department of Psychology at Florida State University working with Dr. Thomas Joiner. Dr. Joiner and I are conducting a research study that examines risk factors for suicidal thoughts and behaviors. We hope that by understanding short-term suicide risk, we can work toward developing effective treatments and ultimately lower the prevalence of suicidal thoughts and behaviors.\n\n\nIf you are over the age of 18, fluent in English, live in the United States, and are currently experiencing thoughts of suicide, you may be eligible to participate in this study.\n\n\nIf you decide to participate, you will fill out a series of questionnaires online several times over the next 2-3 weeks. The first set of questionnaires will take approximately 30 minutes to complete, and you will be compensated with a $5.00 Amazon gift card. Note that you will also need to complete a brief (~5 minute) phone interview at this time (this portion is mandated by our Institutional Review Board; we will not store your phone number after this call and will take every step possible to ensure confidentiality). Each follow-up set of questionnaires will take no more than 10 minutes to complete; you will be compensated with a $2.00 gift card for each follow-up survey (5 in total, for a total of $10.00). If you complete all five follow-up surveys within 48 hours of receiving them, you will receive a bonus $5.00 gift card. Overall, you may earn up to $20.00 for participating in this study.\n\n\nRemember, this is completely voluntary. You can choose to be in the study or not. You can email us, message us, or post below if you have any questions or concerns about the study. I'm happy to discuss anything that comes up. If you would like to participate, please click the link below to see if you are eligible.\n\n\nhttps://fsu.qualtrics.com/jfe/form/SV_4VDAIH8CLVusKWx\n\n\nThank you so much for your consideration. We hope to hear from you soon!\n\n\nBest regards,\n\nMegan Rogers, M.S.\n\nFlorida State University\n\n**NOTE: This study will be open until this message disappears. If you happen across this while the post is still up, please feel free to participate!**", "url": "https://www.reddit.com/r/SuicideWatch/comments/6y03wv/please_participate_in_research_study_geared/", "title": "Please participate in Research Study geared toward understanding Suicidal Thoughts/Behaviors [18+, US only]", "social_network": "reddit", "user": "JoinerLab", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 68, "down_vote": 0, "creation": 1504529168, "permalink": "/r/SuicideWatch/comments/6y03wv/please_participate_in_research_study_geared/", "nsfw": false, "first_save": 1635425254.8526897, "replies_charged": false}