{"id": "t5_2qpzs_t3_nshx0n", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "First time poster, first time I have said most of this out loud, on mobile.  This is very hard to post so please bare with me and I hope at least one person hears my message.  Halfway thru this will appear it has a Disney happy ending but just read on\n\nI have dealt with suicide depression my entire life and hid it.  My parents and sister are amazing but my parents were young and party animals when I was born with my dad being a mean drunk and taking it out on me.  In that time there was also some sexual abuse towards me by an old lady babysitting me (they have no idea).  At age 13 my mom found Jesus which ment super religious household and we all better goddamn well find Jesus (oh well).  Was an outcast thru out school but kinda found a group but still didn't want to live.  After 9/11 I joined the Delayed entry program for the Marine Corps and infantry....finally found something I wanted and I thought War would be cool....well I was fucking wrong.  Keeping it short but it is the ugliest most awful shit I had ever seen.  Movies don't prepare you for the terror of every moment....when will I die, staring at your lifeless brothers, becoming numb and no longer able to cry, doing awful shit, writing your death letter.  After blowing my bestfriend, hadn't seen in months, off at Camp Falujah (because I needed to go buy cigarettes and \"would see him again\") he was killed a month before we were to go home.  We got hit every day but the final time getting hit and watching my brothers disappear from daisy chained 155 shells I snapped.  In total lost my Ssgt who was like a father to me and 11 men I viewed as my closest brothers.  When we got back I went off the deep end medicating myself heavily which got me into ALOT OF TROUBLE.  But even for those of us that got out our war was/is far from over.  Between PTSD and night terrors the suicides started and we became the top unit for suicides.  Seemed every week that same call came in and another name was added to the list.  In that time I was ready to quit but then randomly my first daughter was born followed by her sister 3 years later (my world).  Even with these two beautiful humans every second of life hurt and I wanted to be done.  Tried many meds that didn't work so drugs/booze it was. During this time got into a drunken blackout rage and put gun to my dad's head....when I realized what I was doing I broke down and cried.  Her forgave me but I didn't.  Next day home with my kids I tried to end it but as my finger pulled out the slack my youngest opened the bathroom door and said \"daddy daddy.\"  That hurt so bad!!   I married their mom (right thing to do but didn't love her I couldn't love anyone my heart was dead).  Left her in my late 20s cuz we couldn't get along and got 50/50 custody but still sat and peered into that abyss.  During this time I made a friend (we will call B)with a female who worked the same trade I do/same union.  She had two boys who were same age as my daughters so we hung around alot but only as friends.  From the start she seemed to be able to tell when I was ready to pull that trigger and would save me everytime.  Then one day B found out her bestfriend had taken her own life.  Everyone was too busy for B but I called and askEd if she was OK and ended up hanging/watching over her all night since she was in a bad way.  Next few months I spent every minute after work looking after her cuz she was in a bad place I knew all too well.  Turns out we had alot of same experiences with childhood trauma, trauma in general and became even closer.  One night I was freaking out and blurted out \"I wish I wasn't crazy.\"  She just hugged me and said \"I don't think you are crazy.\"  Then out of nowhere we both realized we were in LOVE....HOLYSHIT I COULD FEEL AGAIN.  B started helping me with my trauma and I helped her with hers, alone we were weak but together we were strong.  We were inseparable and we made a giant happy family but there was always a darkness lurking.  The next 4 years had its ups and down but I would not trade them 4 everything but things went south and one night/followed by the next day I MISSED ALL THE SIGNS and I watched screamed as she took her own life....if I had 5 more seconds I could have stopped it....5 seconds ruined my life.  My whole world crumbled everything was gone.....my unicorn died in front of me and I didn't fucking save her....I failed her. I sat and cried and will spare the details but it is burned into my brain forever.  I tried to join her in that moment as I held her but then some sort of panic/adrenaline set in.  This site is so much worse than war.  I always told her I would always protect her and I didn't.  I dont get to see her sons anymore and my daughters lost their true mom (real mom is not very good).  I let everyone of the people I swore I would die for down and will never see half of them again.  The next 3 months was in and out of mental hospitals, same pj's everyday, staying with my parents, drunk/lots of Xanax and spending alot of time on the floor crying.  I wanted to die and hate life and for finally for once letting me feel joy and then taking it from me.  Also most of those who I was loyal to (Marines, long time buddies, ect) were all the sudden MIA or said dude there is plenty of other women, or just be happy.  The one person who understood me was gone and I was alone/am alone again.  I quit my meds and all my counselors and said fuck life, any god there might be ect.  Nothing was gonna stop me.  The day I planned for it to be my last.  But as that day came out of nowhere a thought came into my head.....I thought of the day it happened.  I thought of my daughters faces and tears when I had to (while crying) tell them.  I thought of how the boys must feel, watching my mom and even my dad (who I had never seen cry) break down and cry (they loved B so much).  I thought of all the pain we all carried this last 1.5 years from that day it happened.  I saw how one persons pain became well over a hundred peoples pain..  And in this moment I made a decision.....I would be the sacrifice.  Meaning I will carry the pain and let it one day hopefully die with me.  So as much as I resent everyone for having to be alive I don't want then to feel even a fraction of what I feel every second of every goddamn day.  So even though I want to end it I won't because I will not let my pain pass onto them....I wouldn't wish that pain on anyone.  So every second of every day I get to relive it, i get to relive every stupid fight where I had to be right, every goddamn what if, tried to sell my soul to bring her back (crock of shit) any loud bang (or basically anything) brings me back to that moment, knowing at 35 I will never love anyone ever again (not even gonna try no one will compare) and will forever be alone is shit.  The whole Iraq thing is like a distant memory and I feel nothing about it anymore as she is all I see.  So every painful day I pretend to smile, pretend to be alive an ok, put on a false front for those I love, while I cry in the bathroom or whenever I'm alone, every second is awful and I'm sure since life hates me I will live till some long ass age but I will bury this pain (I hope) with me and let the chain reaction (I hope) die with me.....my sacrifice I guess.  I truly hope there is something after death but won't know till then.  I wish I could say life gets better....maybe it does maybe it doesn't.  All I know is at one point I thought life was awful and out of nowhere the most beautiful woman saved me.  Ya in the long run life kicked me in the teeth again and pushed me farther down but every second with her was perfect!  I'm sorry I no longer remember the point of even writing this (not sympathy)but thru tears I will leave you with this.  No matter how small you feel or alone unloved you feel, you matter to someone somewhere.  Even tho I don't know you you matter to me and I promise you at least in one instance in your life someone looked at you and was thankful for you and smiled!!  Believe me I get it life sucks and I don't have an answer for you, but maybe just maybe one day it will get better.  Maybe, as much as it fucking sucks for us, we have to stop the pain at us and be the sacrifice.  I don't know this got away from me sorry so long sorry\n\nEdit: *bear with me", "url": "https://www.reddit.com/r/SuicideWatch/comments/nshx0n/letting_the_pain_die_with_me/", "title": "Letting the pain die with me", "social_network": "reddit", "user": "Irondaddy_29", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1622847707, "permalink": "/r/SuicideWatch/comments/nshx0n/letting_the_pain_die_with_me/", "nsfw": false, "first_save": 1635428238.5298169, "replies_charged": false}