{"id": "t5_2qpzs_t3_nduwdq", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "How do I get past the guilt that holds me back from doing what I need to do? I’ve hit this calm where I could do it now if I wanted to, and I really want to, but the guilt of the mess that I’ll leave behind for others holds me back. I feel embarrassed that I’m even thinking of these. It feels like I’m not even trying hard enough at suicide. That my plans are less real, less valid, less concerning because the guilt has power over me to force me to hesitate. That I’m a coward who wants to die, but only talks too much and never does the thing that’s being said.\n\n- Guilt over how my parents will have to spend money on a funeral, or if I fail, hospitalisation charges. What if me doing this pushes them into financial debt?\n\n- Guilt over money spent on me for the new house. My family spent around $3000 for my room specifically for renovations, not yet counting all of the other stuff like flooring and blinds and the ceiling fan. We move in in two weeks. How ungrateful do I have to be to never make it to the new house? They spent money on me, yet I may never sleep in it. \n\n- Guilt over school fees. I’m at the tail end of my first semester of university. My exams are this and next week. If I do it before my exams, that’s another $2500 wasted because of me deciding to be an inconvenience even by not existing. \n\n- Guilt over work. My job exists purely as a means of taking on some of the portfolio that my boss has. She’s the only other person in this department. All of the work she has managed to offload onto me will fall back on her again once I’m gone. \n\n- I’m supposed to be a witness for my best friend’s registration of marriage, because her parents don’t want to come as they hate her boyfriend. She will have to find someone else. I’d ruin a happy event for her by simply ceasing to exist. \n\n- My other best friend is getting married this year too. I’m supposed to be her bridesmaid. I’ll ruin her wedding too because I’d be gone. \n\nIt’s so hard to know with my mind and body that I don’t want to be alive anymore, yet have all of this guilt holding me back and making me feel worse about wanting to end my life to make the pain stop, which all the more makes me want to make it stop hurting. It’s a never ending cycle.\n\nHow do I get the guilt to stop being so overpowering, so that I can finally leave?", "url": "https://www.reddit.com/r/SuicideWatch/comments/nduwdq/guilt/", "title": "Guilt", "social_network": "reddit", "user": "ennaxanne", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1621190690, "permalink": "/r/SuicideWatch/comments/nduwdq/guilt/", "nsfw": false, "first_save": 1635426189.7875628, "replies_charged": false}