{"id": "t5_2qpzs_t3_oak6za", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "Even if people are going through shitty things they have some things that hold them to try to stay alive. Friends. Family. Hope to be happy, be better.I have none. Friends? Whenever I talk about my problems they don't want to hear it because it is \"too depressing\" so I can't or don't hold any friendships. Family? My mom abused me and my father and siblings did the same or act like, no believed nothing was wrong.It is normal for me to abused because I deserved it right? I love my father. He was the only one with me, he talked with me showed that I could be worth something. But he broke me worse than my mother. I knew I shouldn't have any expectation on my mother so she couldn't hurt me that much. But my father hug me and cried when I said I cut myself. I felt like someone in this fucking world finally cared about me I wasn't expecting him to be kind. I thought I should keep on for him, he cared about me, someone didn't wanted me to be dead. Yeah that night I slept happy thinking I worth some thing. And tomorrow I wake up to my real family. My family, my father making fun of me, making jokes about my cuts. \"Oh you're angry, what are you gonna do go and cut yourself you crazy moron?\"Yeah I will. I did. And I was relaxed because they were acting like theirself. But fuck my father took me after they divorced. I thought wow he loves me. And he threatened to kick me out of the house, said I was the problem not my mother.\" Either you're gonna kill yourself or I am gonna kill you?\" I hate him. I hate how only person who shows me some kinda love is hurting me more than the person who broke my arm when I was 3. I hate how he said he wanna have some kinda parent-child relationship but still not admitting he abused me. He is not wrong, never and ever. He is an angel. He is the god. \"If it was any other children they would be workshipping me.\"He is not the one who is narcissist and sociopath. It's me. He dropped me at the hospital yesterday and said he had enough he is not gonna waste 40 min for me. I had to take my ass to hospital. It taked 3.30 hours and I was close to people who could've been covid. I have asthma. But yeah he is tired. I mean it is not like I have any kinda sickness I am just a person who thinks I am always sick, right? My doc said I have pulmonery nodules. Pretty big but not big enough to be lung cancer. He said we should check it so it wouldn't get bigger. Yeah I am not sick. Fucking ton of mental ilnesses and more fucking load of psychial illnesses. My whole body hurts.I can't walk much, stand up much, can not go out in cold, can not breath in every step, my heart is fucked up and my body is failing me worse and worse in every fucking day. I am in pain. I am in so much pain I just wanna cut my neck of so I won't feel anything. Docs doesn't believe that a 21 years old is hurting this much. I am making it up I am not old no need for meds that could work. Antidepressants doesn't work either. I am in pain every fucking day. I wake up from my sleep beacuse I am in pain. I can't take it any more. It is going worse everyday. I am living for a future that does not exist. I could get away from my family live normally?Fuck it my brain no not even my body doesn't wants me to be alive. I can't think how bad it is going to be if I survive to my 30's. I am gonna live for what? Living in this broken body that is hurting me so much that I can't sleep and with this brain that is bringing up my fucking memories so I have to hurt myself to feel safe. I can not even go and say \"hey I wanna stab my useless lungs, failed heart and asshole brain could you lock me up?\" Hah no I can't because I am scared they're not gonna give me a fucking driver license. They're not gonna let me be a doc after I finish my uni. What about right now? Could I survive until that times come? If I go seek help, I am gonna be a jobless crazy bitch and gonna kill myself. If I don't I am gonna kill myself because I can't take any more of this pain. There is no end that I could be alive. Crying is such a pain in the ass. When I cry my brain hurts like it is burning inside my head and feels like it's gonna explode, my neck is so stiff and painfull I wanna cut it of, my eyes hurts so much I wanna stick knife on them. I am crying right now. I hate crying. I don't know what to do. What I do is useless. Living for a couple of years or months in this much of pain for the same ending. It is useless. If there is a god he fucking likes to play with me. Nothing. No one. I have  nothing and no one. No mental health, no psychial health, no family, no friends, no one to talk to even if I had I can't I am scared of talking with people. I don't believe in them, I don't trust them. It is pathetic. I am. The only way I could talk, only way I can calm myself from my panic attacks is writing shits about my miserable life in internet to people that doesn't even speak my language anonymously. I am a coward so I couldn't kill myself until now but I swear to that bastard god if this pain will continues or I will get some kinda fricking sickness like cancer, alzheimer, failed organs I will do it. I will fucking kill myself. I can't live with much more pain.\n\nAnd I hate how jealous I feel when I read posts that people write in this subreddit. I feel like that people have at least some thing, family friends lover or health. I am an asshole. I feel jealous of people that is suffering, wishes for dead. I feel like I am hurting more than anybody. I am an selfish piece of shit who doesn't think about others feelings and acts like I take worst in whole fucking world. I hate how I feel. I hate how I am. I hate all of my existence. But mostly I hate how coward I am. I can not even take this fucking waste of space to hell.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oak6za/why_dont_i_have_anything/", "title": "Why don't I have \"anything\"?", "social_network": "reddit", "user": "notfetishshaming", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1625009060, "permalink": "/r/SuicideWatch/comments/oak6za/why_dont_i_have_anything/", "nsfw": false, "first_save": 1635426565.4621205, "replies_charged": false}