{"id": "t5_2qpzs_t3_q8k4ww", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1", "b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I couldn't think of a better title.\n\nI've struggled with mental health basically all my life. Anger issues mainly, but I was diagnosed with chronic depression and generalized anxiety disorder at 17, 6 years ago. I never took my meds for more than a few months at a time because I was living in the US and receiving support from my parents in Mexico, which made it economically impossible to resupply after my anxiety pills ran out, and the mood regulators didn't last very long either. I thought I had it under control for years, I have friends, I keep somewhat active even though I'm out of shape, and now I've been married for a year and change - my life is good. It's supposed to be good. I'm economically stable, I have people who love me. I have hobbies and school is - or rather was - going well.\n\nAnd now suddenly it's like I'm back in my absolute darkest days. I feel utterly hopeless. Like many, I had to switch to online classes for the pandemic. This allowed me to spend loads of time with my now wife, we moved in together, married, then moved to a city we absolutely love. I was on track to graduate cum laude in December of this year, and taking my classes online gave me the privilege of a very flexible schedule. And then, out of nowhere, for my last semester, for literally a single damned class, I had to move all the way back to the university dorms. A whole timezone away. My wife, my cat, my friends and basically my whole life might as well be on the moon while I'm stuck here, and I feel like I'm slowly crumbling into dust. \n\nSometimes I lay in bed for the entire weekend just wishing I was dead. I've come to absolutely despise my major. I can't focus on anything at all to the point where I'll fail to study for tests that I know are coming, or take 8 hours to finish a single homework. The food is so terrible that sometimes I go days without eating anything except popcorn and vending machine candy. The beds are of such poor quality that a back injury I got as a child has become intense, distracting and occasionally unbearable, constant pain. I have a permanent headache. I haven't had a restful night's sleep since mid August. My hair is falling out in clumps. My teeth feel loose. I have a constant metallic taste in my mouth that I can't wash out. I'm in danger of failing the last 5 classes I need to finally finish my stupid degree and I feel like I'm watching it happen from outside of my body without being able to do anything about it. \n\nMy parents have helped pay for my schooling through so much sacrifice that the mere thought of dropping out causes me intense suicidal ideation, just like the thought of failing my classes and being unable to graduate, or having to stay here another semester. The weight of everyone's expectations of me is strangling me. I was a fucking loser deadbeat in high-school and now my parents love me again only because I suddenly turned back into the overachiever academic child genius they pretend I was as a kid, and I'm painfully aware that telling my parents that I can't go on with this anymore would make them hate me just like they did before I surprised them with being admitted to University. My wife has been extremely supportive, but it hasn't been enough. We had plans for our lives that I'm completely ruining by being a useless sack of shit. Almost every day I end up muttering to myself that I wish I was fucking dead, and I'm genuinely worried that I'm going to do something stupid in a fit of desperation, which are becoming more common as the end of the semester approaches. I just feel like my entire life I've done nothing but cost people money and cause people problems, nothing but a constant burden on anyone close to me, and I can't break out of the thought pattern that my entire university experience was for absolutely nothing. That I made my parents sacrifice so much for nothing. I don't even want to work as what my major is, I want to be a fucking electrician, but it just seems likelier and likelier that I'm going to fail this semester and once again bring nothing home but a bunch of fucking bills with no way to pay them, and a big fat fucking sack of absolutely nothing to show for 5 years of effort and 80,000 dollars.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q8k4ww/falling_apart_right_at_the_supposed_finish_line/", "title": "Falling apart right at the supposed finish line", "social_network": "reddit", "user": "loudchartreuse", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1634287085, "permalink": "/r/SuicideWatch/comments/q8k4ww/falling_apart_right_at_the_supposed_finish_line/", "nsfw": false, "first_save": 1635425567.8970394, "replies_charged": false}