{"id": "t5_2qpzs_t3_kf6jo6", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "Or proto-villian. Whatever. I've got all the warning signs.\n\nI'm  a massively insecure person that also has an enormous ego, so I'm a  bang-on narcissist. I'm entitled as fuck, but also too weak to overcome  any obstacles whatsoever, so I'm always looking for the quick fix and  become angry if things don't immediately go my way.\n\nI'm  actually a terrible person deep down in my soul but I'm good at being  cordial and friendly enough to mask it. It's extremely rare for me to be  honest with anyone. I try to manipulate everyone around me by default. I  don't even know if I have ever truly loved or respected anyone--I am  either afraid of or in need of others for some reason (in which case, I  am a sniveling, cowering, sycophant that lets and encourages everyone  walk all over me building resentment all the while) or I barely see  others as real people (in which case I become a callous asshole 100% of  the time.) There is no \"equality\" between me and other people. I  inherently see other beings as either \"above\" or \"below\" me with nothing  in between.\n\nI'm afraid of  everything so I crave control and power (but not with the accompanying  responsibility, silly goose.) I hate myself and my life, but I usually  blame my situation partly on my own perceived powerlessness. For that  reason, I fucking lose it when I find myself in a powerful position.  Whatever thin idea of morality I had evaporates when I get a little bit  of power. Keep small animals away from me. And children. And weapons.  God forbid I ever get elected to public office. You think Trump was bad?  Lol.\n\nOn that note, I am a  habitual black-and-white thinker. I hate nuance, and get frustrated very  easily by the fact that the world usually doesn't work the way I want  it to. I'm very solipsistic and am prone to ruminating on what I think  the world \"should\" look like, which tends to be, clean divisions.  Straight lines. Neat little boxes. Everything in it's place. Order.  Yeeeesssss. I'm practically Emperor Palpatine.\n\nI  don't deal well with disappointment at all. I seem to have had this  vision of myself and how my life should have turned out. When that  didn't happen I both began to hate myself and the world for not living  up to what I'd expected. Hell look at this topic, written as if life is  supposed to follow the script of some fiction.\n\nI  have a chronically defeatist and pessimistic mindset. I spend all my  time ruminating about how inadequate I am and how this world isn't fair,  but I'm also too self-important to actually learn from my mistakes  (can't even admit them lol) so I just stew bouncing between secret  self-loathing for myself and resentment for everyone and everything  else.\n\nI honestly believe the world  would be a better place without me (which in and of itself is such an  egotistical narcissistic thing to think omfg I can't stop.) I'm pretty  much a ticking time bomb. Best case scenario, I don't cause too much  damage before I croak. Worst case I become the second coming of Hitler  or shoot up a mall or rape/murder somebody. Probably not intelligent  enough for the Hitler option tbh, but you never know. Suicide is  difficult, though and I'm a lazy, weak, coward.\n\nSo  if you've read this far, you're probably thinking \"this guy really  needs to see a therapist.\" Maybe you're typing that advice out now  buuuuut....I wont do it. Doing that in earnest conflicts with too many  of the issues I've written above. So I'll read your comments, do nothing  but distract myself with porn, videogames and food, and take a ride on  the suicidal depression merry-go round again.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kf6jo6/most_people_see_themselves_as_the_hero_of_their/", "title": "Most people see themselves as the hero of their own story. I'm definitely the villain in someone else's.", "social_network": "reddit", "user": "sketch162000", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1608240008, "permalink": "/r/SuicideWatch/comments/kf6jo6/most_people_see_themselves_as_the_hero_of_their/", "nsfw": false, "first_save": 1635428055.4368758, "replies_charged": false}