{"id": "t5_2qpzs_t3_q1a52u", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7", "4162f604-29a0-4041-a85b-c249e1ca13f8"], "text": "I know that the decision I'm making isn't good for my health. I'm not in a good headspace at all. I don't want to talk to my friends, or my family about it because they've already heard so much, and I don't want them to worry. I hate my body, I hate my workplace because it's become a personal hell. Every creepy man I've ever encountered somehow found my place of work. I see them everywhere now. \n\nOne of them is my most recent ex. We didn't have a great relationship. He works as a window cleaner. He cleans the windows of shops a few doors down from my workplace. Then there's Ash. Ash was a hookup that went wrong. I was adamant that I wanted to use a condom before, and during sex. Yet, he got on top of me without one and I felt pressured. I blocked him the next day and got tested. \n\nThen there's Matt. I thought Matt was nice. He wasn't. During sex, while I was in a position where I couldn't see him, the condom \"slipped\" and he didn't tell me until he finished inside of me. I felt used. I didn't feel like a human being anymore. I blocked him the next day. He came into my work the day after and told my manager everything. I had to get tested again a few days ago. \n\nMy ex from four years ago came into my workplace the other day. It wasn't a coincidence. Even though four years have passed, he still tries to call me. He's blocked, but I can still see when he calls. He lives an hour away. I can't afford leaving my job without finding another one. I haven't had any luck so far. Everyday I go in scared that one of them will come in.\n\nAt this point I genuinely don't care what happens to me. A different guy I hooked up with once messaged me out of the blue the other day and asked if we could again. He doesn't care about me, I know. He just wants me for sex. I met him a few days after I had gotten tested because of Ash. When I told him I was nervous to have sex again because of what happened with Ash, his response was \"Yeah, I'll use a condom.\" He did. He didn't pressure me. But he did other things that showed me he didn't respect me. \n\nThere are other factors playing into this, but I won't make this longer than it already is. I'm at a loss, and don't know what to do. I haven't spiraled this hard before. Does anyone have any suggestions on what I can do instead of these self destructive tendencies? Something I can replace it with?", "url": "https://www.reddit.com/r/SuicideWatch/comments/q1a52u/deep_depression_selfdestructive_tendencies_any/", "title": "Deep Depression, Self-Destructive Tendencies, Any Tips On How To Avoid/Replace These Tendencies?", "social_network": "reddit", "user": "throwaway702261", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 14, "down_vote": 0, "creation": 1633368125, "permalink": "/r/SuicideWatch/comments/q1a52u/deep_depression_selfdestructive_tendencies_any/", "nsfw": true, "first_save": 1635422533.5661736, "replies_charged": false}