{"id": "t5_2qpzs_t3_nvk9c2", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "All the bigotry, conceitedness and oppression in this world…I can’t handle seeing people suffer because it makes me want to die knowing I can’t immediately take their suffering away\n\nHearing my friends talk about the racism they experience makes me wish I was never alive because I’m white and was born with privilege everybody should have but doesn’t. They live with a kind of fear I will never have to live with and that’s not fair\n\nSeeing and hearing neurotypicals bullying neurodivergent people, calling them the r-word and doing stereotypical handicapped gestures to oppress them makes my blood boil because like…how fcking dare you!?!!\n\nAll the stories about parents hitting their children, forcing them to live a certain way simply because of what’s between their legs, shaming them for who they want to and not want to date/have sex with, calling them names and even slurs, and are able to get away with it but god forbid the child calls their parents toxic because they are and the whole world spazzes out on the child for being a “brat” and “insensitive” smh\n\nRecently seen a video of parents punishing their kids out of anger and like…how can you go batshit crazy on your kid, see AND hear them cry so hard they sound like they’re screaming at the top of their lungs and you just stand there with your finger up your ass watching them cry like you have no idea what’s wrong with them and are unfazed by what you just did!?!?\n\nThe amount of times I’ve seen homeless people on sidewalks and parking lots and hear them be told they’re faking it for “drug money”. Like nahhh fam maybe if you cultivated even a gram of this thing called empathy you’d realize that they actually are suffering and have nowhere to go smh\n\nI could go on with millions of examples y’all, I really could. I just can’t stand all the small-minded, conceited, materialistic bigots in this world anymore. It’s so hard not to end my life because how can so many people be so heartless?!!!\n\nThere’s literally no prize for being the biggest asshole. You also won’t be executed for being a good person. In fact it’s much easier to be a good person than a godawful one\n\nI know all of this seems super childish but it really does make me suicidal because I’m just so over this world’s toxicity. It’s so sickening and I’m over it", "url": "https://www.reddit.com/r/SuicideWatch/comments/nvk9c2/i_cant_stand_this_world_anymore_its_so_tempting/", "title": "I can’t stand this world anymore. It’s so tempting to just end it", "social_network": "reddit", "user": "bubbles2360", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 15, "down_vote": 0, "creation": 1623203057, "permalink": "/r/SuicideWatch/comments/nvk9c2/i_cant_stand_this_world_anymore_its_so_tempting/", "nsfw": false, "first_save": 1635423005.3365257, "replies_charged": false}