{"id": "t5_2qpzs_t3_p3rdiw", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I honestly don’t know how to make it through today or any days next to come. Whether it is large thing or seemingly small thing, we all have our limits with what we can handle. And I cannot live anymore, how do I just sit here like everything is fine and normal when I was crying on the bathroom floor last night wishing I had pills to od on. I feel like a waste of space, resources, and air. I am a burden and everyone would be better off If i was gone, hell I’d be better off.  While my roommates were my friends last year, they would frequently exclude me and leave without even saying anything to me. They made me feel like I was such a piece of shit and hindrance that I left. But now I have to go back and the school added a random so that there is 7 of us. Since my direct roommate left, I am the odd one out and everyone’s scapegoat. Three of us were put in a triple by the school and I do not think I can handle it but then it got worse because when I talked to my roommate about it they said they could not mentally handle it. But the other roommates refuse to have me with them. No one wants me and are pushing me around like pin ball. I feel so unwanted and thought since I have already compromised so much it would be nice if someone else could instead of me. but they are so selfish they fought against being the ones to make a sacrifice so now one of the roommates and I are fighting. I am the outcast, I will never fit in, and no one will ever want me. And other instances previously throughout my life confirm that", "url": "https://www.reddit.com/r/SuicideWatch/comments/p3rdiw/i_rather_just_die_than_keep_living/", "title": "I rather just die than keep living", "social_network": "reddit", "user": "peee-poopy-pee-head", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1628880211, "permalink": "/r/SuicideWatch/comments/p3rdiw/i_rather_just_die_than_keep_living/", "nsfw": false, "first_save": 1635428204.9587407, "replies_charged": false}