{"id": "t5_2qpzs_t3_7s12lx", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "Hi people,\n\nI feel like there is just not a way for me to look the way I want to, and I feel like life would be rather sallow not being attractive. \n\nI'm 24 now, and I had issues with my body ever since I can remember. \nI have wide hips and a rather unfortunate fat distribution, which made me always feel looking to feminine. Especially my chest was always a matter of great concern to me, for the persistent fat and what I suspect very light gyno i have on it.\n\nWith 16 I picked up lifting, in hopes to alleviate those problems. Being pretty oblivious to right workout routines, the first time I had noticable gains with 18. My body image improved, but I still hated my hips and my chest. After one more year of lifting, I decided to make a diet to reduce my body fat percentage, rather succesfully. While my sixpack was noticable and my chest wasnt as soggy as always, I had one of the first times of being happy with my body. But then some mania kicked in myself, I wanted to be ever stronger, I ate and worked out like there was no tommorrow and finally trained with the magic 100kg weights on the benchpress, but I was particularly proud of my squats, where in my best days I lifted more than 140kg in sets of 5. \n\nThe heavy weights gave me a boost in confidence and a sense of purpose. I was always the fattest and ironically the weakest in my social circle and classes, but now I was amongst strongest of my peers! Intoxicated by my newfound strenght the extreme soar of my body-fat-percantage and the severe stretchmarks which accompanied my weight gain went unnoticed. So unnoticed, that in retrospect this absolute blind eye to this developments induce great doubts in my sanity. \n\nOne day my knees began to ache, I was 20 or 21 by then. The  pain grew and didn't subside after a few weeks, so I consulted a physician. He told me I had acquired the patellar apex syndrome, what colloquially is called a jumpers knee. He ordered me to rest a few weeks, gave me prescription for both anti-inflammatory meds and physical therapy and send me on my way.\n\nI followed his instructions, but weeks and months went by but nothing I did abrogated the pain, it even seemed to get worse. I couldn't even walk stairs or do unweighted squats without it. \n\nSo the months went by and I fell into serious depression. I didn't even work out my upper body anymore. I don't know why I didn't, I very much should have. One day into my abstinence from working out, I looked into the mirror and was shocked and appalled by what I saw. It was the very first time I noticed the unhealthy and unattractive amount of fat I gained, as well as I noticed how deep and broad my stretchmarks were. My stretchmarks covered, or better cover my entire midsection, plus my arms and shoulders. They are not isolated faint red lines, but a dense network of canyons ripped into my skins. To this day I still occassionally shudder in disgust feeling them, and feel trapped in my body. \nI became very reclusive, lost many friends, didn’t leave the house and gravely neglected university. I didn’t want to live anymore. My kneeproblems persisted even two years after they began, and I thought they will never go away, or if they go away, I will be over thirty by then, and what good is it then to be attractive anymore. I thought my stupidity cost me being attractive in my youth, were it most matters, and I still have a feeling, if you haven’t had good 20s, the rest of your life will inevitably suck, too. I thought even if I got back in shape, my strech marks.  I didn’t want to make the best out of it, or play the cards I got dealt, I wanted to kill myself.\n\nBut alas, I eventually didn’t have the courage to so I tried to get back in shape anyways. I did not do any serious weight lifting, but I very eagerly biked and held diet.  I lost 90 pound over the course of a year, loosing my excess fat and much of my muscles, but I didn’t care about them anymore. After some other healthproblems which barred me from working out for awhile, 3 months ago I finally arrived where I wanted to be. I regained my sixpack, and my muscles, although drastically smaller in size, where quit toned. My lower belly was still a little bit saggy, but I was aiming to solve that by further decreasing body fat. But overall, I was finally happy again with my body, happier I have ever been with it. Even my knee problems seemed to have gone away, I even began to do unweighted squats again.\n\nBut then I got what was suspected to be a light case of epididymitis. Nothing to terrible, but I went to the doctor anyways because it made walking quite unpleasant. My GP said that he thinks that this very much could be the aforementioned epididymitis, he could to a urine test to determine it, but in the end he couldn’t be bothered to, prescriped me some Ciprofloxacin, said to wait and see i fit gets better on its own before taking it and send me on my way.\n\nEventually I took it, and I immideatly experienced weird psychological side effects. I felt like I was tripping, and had a hard time concentrating, but shrugged it of as being nothing out oft he ordinary for an antibiotic. Two days in I started to cry 3 times a day, was emotionally very weak, but still thought nothing of it. I finished the course,  and though it didn’t really alleviate my condition at all while taking it, it went away a couple days after the last pill. \n\nA week later the concentration problems still persisted, I felt and still feel significantly dumber, but alas, you cannot proof that and there’s no cure for that. I developed tendon problems, first in my achilles heel and then my whole foot. My knees now feel EXACTLY like two years ago. My wrist hurt very fast now, and I feel like the structural integrity of my body got compromised. Everytime I stretch and crack anything, it sounds very brittle and dry. I feel like my muscles shrinked, and my libido is on a low point. I feel like an old man. On top of that I developed numbness of sensation in my face, and the problems with concentration and feeling of dumbness dont go away. 6 weeks have passed since I finished the antibiotic, and I feel poisened. I read online about the adverse effects I experienced, and to my horror I read many stories of how they can very well be permanent.  \n\nI don’t want to shower anymore. Everytime I look in the mirror, I look less good. Today I even looked bad again. This inflicts an abnormal amount of pain on me. I don’t want to do sports out of fear of tearing a tendon, further inhibiting me from being active again. How can you deal with not feeling attractive? I don’t want to leave my house anymore due to feeling inferior. I’m already in psychiatric treatment as of now. They gave me antidepressants, which help me deal with it a lot better. But I still feel like my life cannot be worth living anymore, for I am doomed to roam this earth dumb and ugly forever. And even if my problems would eventually go away, it would be way too late in life.\n\nI’m sorry  this turned into such a long rant, I’m sure it is not easy to read such a long text from a non native speaker. But there is no need for anyone to read it, I just wanted to express myself and get it off my chest.\n", "url": "https://www.reddit.com/r/SuicideWatch/comments/7s12lx/i_cannot_look_in_the_mirror_anymore_without/", "title": "I cannot look in the mirror anymore without feeling disgusted.", "social_network": "reddit", "user": "throwitaway54654", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1516573553, "permalink": "/r/SuicideWatch/comments/7s12lx/i_cannot_look_in_the_mirror_anymore_without/", "nsfw": false, "first_save": 1635426477.1082423, "replies_charged": false}