{"id": "t5_2qpzs_t3_ddzd9r", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "So Ive been battling mental illnesses since I was a child in kindergarten. i used to have parasomnia as a child and a few symptoms of depression that later developed in my life. When I turned 16 I was diagnosed with major depressive disorder and then at 17 I got diagnosed with bulimia. My dad always told me that Ill be the end of him with my unstableness, he is a hard working CEO and we used to have a lot of money and basically at age of 13 I already had a room as big as your average apartment and 10 video game consoles and a ton on video games, I always had the expensive stuff and was always taken care of which sadly fed into my mental illnesses more and if I had a slight inconvenience I would get a mental breakdown. This year I found out my dad has stage 3B gastric cancer. I feel like I made him sick from all the money he spent on me and all the stress I caused him with my mental illnesses, he went in debt because he stopped working for the whole year even tho these companies are still operating but he is not really directly involved currently. I feel like my life completely changed, all of a sudden I dont have a dad to take care of me and I dont know how to function like an adult, I am trying my best to find a job but my depression has worsened and I relapsed into self harm again. Today my pc died and I just broke down because I dont want to cause more stress for my father (for context I need a pc for college I am a digital art student) and I decided to not tell him about it and Ill find a way outon my own to get stuff for college done, I just dont want to stress him anymore and I just feel like if I were to die he would be so happy that finally he got a leech off his chest. I don’t want to be his leech anymore I don’t know what to do I dont know how to function properly", "url": "https://www.reddit.com/r/SuicideWatch/comments/ddzd9r/i21f_think_if_i_were_to_kill_myself_my_dad_would/", "title": "I(21F) think if I were to kill myself my dad would become healthy again", "social_network": "reddit", "user": "Ember_tp", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1570341780, "permalink": "/r/SuicideWatch/comments/ddzd9r/i21f_think_if_i_were_to_kill_myself_my_dad_would/", "nsfw": false, "first_save": 1635422948.9067085, "replies_charged": false}