{"id": "t5_2qpzs_t3_ed6nli", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I have friends, family, hobbies, talents, I’m poor but I have a good life, I’ve seen most of the world and done things many people never get to, I just genuinely hate being alive and I always have. No part of the good seems to outweigh my will to die. I know how selfish that sounds, trust me, and I know how lucky I am, I also know how much worse it could be.... I’m just insane, and there’s a cruelty to enduring unrelenting insanity that I think people underestimate. I hate the human body, I hate how it works, I hate eating/shitting and sleeping, I hate having bones, digesting food, feeling my blood, my heartbeat, I hate getting sick, being trapped. I hated childhood, I never wanted to leave the house, I hated school, had crippling OCD and was socially awkward (never saw much purpose/comfort in friendship or new experiences) I don’t like this world, I don’t like any available options for existence (and trust me I’ve explored many of them). I hate time, structure, expectations, technology, cities, media, propaganda, the direction the world is heading. I don’t like TV or video games or movies or sports, I get no lasting sense of accomplishment from anything, no true purpose beyond constantly seeking peace. The things I do like, I only do because they bring me momentary peace. It all feels so foreign and meaningless. Assuming you don’t die unexpectedly, most everyone you love will die before you, your life will be in constant flux between grief, longing and decay until you finally cease to exist yourself. You’ll experience constant loss, illness, suffering and at absolute best monotony until you finally get to die. The more that you attach yourself to, the more you’ll lose. I’ve felt this way my entire life, I just kept holding out hoping it would get better or I would find peace, I’m almost 30 and if anything it’s only gone downhill. Considering all these things I dread/resent will only get more frequent and more intense as I age, I have a hard time justifying living.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ed6nli/want_to_die_for_no_other_reason_than_being_alive/", "title": "Want to die for no other reason than being alive feels horrible", "social_network": "reddit", "user": "saywhatevrdiewhenevr", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1576825460, "permalink": "/r/SuicideWatch/comments/ed6nli/want_to_die_for_no_other_reason_than_being_alive/", "nsfw": false, "first_save": 1635426648.385174, "replies_charged": false}