{"id": "t5_2qpzs_t3_peraoh", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "I really am so tired of living and just do not see a reason why I should carry on anymore. People always say that your late teens are the best years of your life... well if this is the best I'm gonna get I don't need to see the rest. \n\nI also feel like things are my fault so much. No matter how much people tell me it's not true I can't get it out of my head that my dad leaving us was my fault. For one, five years ago when the fights were really bad between me and my dad he told me \"You know if mom and I get divorced it's your fault, huh.\" And even though he probably forgot, I didn't. Also the fact that I was really difficult for him to be around, since everything I did irritated him or got him angry so it must have been my fault right? Because he wasn't so bad towards my younger brother. \n\nAnd I'm tired of never knowing whether I want hide how I feel and block everyone out or want people to understand me, because both are really fucking hard. My emotions are very complex and I'm very private so I never feel like anyone has ever really been able to understand me, not even my own mom... but I really really crave understanding so much it kills me. \n\nI also feel like I poison the minds of my friends, because they were relatively mentally stable before I opened up a tiny bit about how much I hate myself and want to die... and even with a tiny bit of information they all went downhill and now pretty much everyone around me is depressed and I really try to put all of my energy to help them get better, because thats my job, but I have so so little energy left in me. \n\nI'm done, I am just so done and tired... sorry", "url": "https://www.reddit.com/r/SuicideWatch/comments/peraoh/im_just_so_tired_and_guilt_eats_me_alive/", "title": "I'm just so tired and guilt eats me alive", "social_network": "reddit", "user": "Some_Grape_04", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1630357858, "permalink": "/r/SuicideWatch/comments/peraoh/im_just_so_tired_and_guilt_eats_me_alive/", "nsfw": false, "first_save": 1635426181.7932403, "replies_charged": false}