{"id": "t5_2qpzs_t3_qb4aj2", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "I feel like no matter what I do, I always end up hurting people. All my friends always come to me when they want help with their problems or when they want advice, and I always try my hardest to be rational about things and tell them how things are, but that only seems to sadden them. It's like they come to me wanting to hear something specific, but when I tell them what the best possible solution to their problem is, they get sad because they don't want to get told what the realistic answer to all their problems are. They don't want to get told how they can fix things because of how hard it actually is. All my friends who are into drugs are the one's who seem to be effected the most by this. I know how hard it is to recover from an addiction, and I know their lives are a living hell everyday, but I still give them the proper ways to fix things when they come to me. Am I a bad person for this? Should I be telling them what they want to hear? My genuine advice always seems to make everyone sad but I dont want to tell them that they should just give in to their addictions and risk their lives. And why do they keep coming back to me and asking me for more help when I just make them sad whenever I try? All of this constant pressure to help everyone and then making them all sad is really wearing me down and I just always feel awful now. Would they all just be happier without me? \n\nI've always started falling behind all my work in everything. My schooling, my job, my free time project, just everything. I used to be non stop working and always being productive because that's what made me feel good. Now its difficult for me to do anything other than lay around and do nothing. I feel like garbage for not being productive, but I also just can't seem to bring myself to do anything. All that work is now stacking up and its gotten to the point where I just feel hopeless about it. I went from getting 90+ on everything at school to failing because I cant seem to do anything. I've pretty much just given up at this point. Whenever I try to go to class I start to shake non stop, my stomach starts turning, and I feel physical pain. I'm never going to make it through school now. \n\nOn top of all of this, I just feel disgusting. I'm gaining weight again, my room is a dumpster, and I always forget to do basic hygiene stuff. I'm usually a pretty neat and clean person, but now I just cant bring myself to do anything cleaning, whether that be my home or just myself. I just wish I could end it all and not deal with any of this anymore. I thought things were bad when I was a kid living in a hotel room with my drug addicted mother, but now I wish those days were back because things were just easier. Sure I wasnt happy, but at least I didnt constantly have all this stress, pressure, and pain. I want to die because I cant see things getting better for me. I want to give up. But I know I'm going to hurt a lot of people by doing that and thats the last thing I want. I dont want to hurt any more people. I just dont know what to do", "url": "https://www.reddit.com/r/SuicideWatch/comments/qb4aj2/some_recent_thoughts_lol/", "title": "Some recent thoughts lol", "social_network": "reddit", "user": "DavDab", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1634619258, "permalink": "/r/SuicideWatch/comments/qb4aj2/some_recent_thoughts_lol/", "nsfw": false, "first_save": 1635427958.566561, "replies_charged": false}