{"id": "t5_2qpzs_t3_pyr37h", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "I’ve been struggling with persistent depression and ADHD for about 12 years. \n\nI come from an abusive family and was raised by a narcissist mother for 16 years before I got an emancipation. \n\nI’m only 20 now but I’ve dealt with abuse, cancer, constantly losing jobs, moving, and intense episodes of depression. \n\nI’m not sure why I’m including all that prior but I guess I’m trying to buy myself more time. \n\nLong story short: I’ve been working on my vet tech degree and I was working at my ER VA position when I got a call today on my day off saying I was being let go. \n\nWorking has always been very very very difficult for me unless I loved my job. And this was that job. \n\nI’ve been struggling financially for months and having constant panic attacks about barely barely scraping by every paycheck. I have debt from my credit card that seems to just fill up the same amount I pay off every month. I don’t enjoy doing anything anymore and I literally cannot function or make decisions for myself unless I have someone directing me. \n\nI’ve just cut up my ankles quite badly in the initial “lost-ness” feeling after that phone call. I feel like I have absolutely nothing to live for. I love my boyfriend and my dog and my 2 close friends. But that’s it. And honestly I’ve come to these crossroads of being on the verge of overdosing myself on my meds until my dog comes over and I realize I’d never want him to be abandoned because I did something so selfish. \n\nMy dog is my everything. He’s been the only thing to stop me from killing myself so many times over now. \n\nHe’s sitting next to me right now and has calmed me down enough to write this and ask for help. Healthcare here is nonexistent and I’ve been on a mental health waitlist for over 2 years now. \n\nI spent some time after self harming to look for jobs but it just created more stress because I realized I don’t have many options and I can’t be in a job I despise or else I’ll perform poorly and lose it. \nBut I also can’t be picky or else I’m going to end up without anywhere to live. \n\nI feel horrible because I just want the constant fearing for my quality of life to stop. I’m constantly in the state of “I wasn’t enough to even do something this small and now I could lose everything because of it” and the only thing stopping me from being a disgusting piece of shit who’s willing to end it all and make others suffer for my actions is that I’m worried about my dog. \n\nI literally could never express how much he means to me and how much he’s helped me through. I have nightmares constantly about him dying and I wake up in a full blown panic attack because of it. \n\nI’d be fully comfortable dying if I didn’t worry about him. I can’t have kids so I’ve always viewed him as my own. I struggle to go through with it because I’m so scared knowing he won’t be taken care of the way I do. He’s my best friend. No one knows me or him like we know each other. No one will know his quirks like how he needs to be praised the whole time to eat, he will make himself puke in the morning if he doesn’t get cuddled for 20 minutes because he thinks I’m upset with him, he has this one dense spot of curly hair under his ear that he loves having pet, he doesn’t understand body language of other dogs to the point he’s almost been attacked when trying to greet them and all he can think is “this is a potential friend!”, he watches TV but certain animation styles cause him to panic, he likes his ears to be rubbed when you’re telling him about your day, he won’t eat new food unless he sees you take a bite first, he won’t drink tap water or room temp water, he chews on my thumb to help himself calm down or sleep, etc. \n\nI’m just so stuck. I feel like I have nothing going for me in my life, I can’t find jobs that pertain to my skill level in the field I want more than anything to work in, I’m suicidal, and every time I think things get better- it ends up worse than last time things went south. \n\nCan someone talk to me, console me, give me advice, distract me, anything please. \n\nI tried to cut deeper and in more lethal spots but my dog kept licking at my hands and I didn’t want to push him or yell at him because I know he thinks he is helping me. \n\nMy next method now that I’m calmer would be my medication. \n\nI’m not scared of myself for these thoughts, just trying to hold on for my dog’s sake. I’m really trying.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pyr37h/i_need_help_i_feel_like_im_out_of_options_please/", "title": "I need help. I feel like I’m out of options. Please.", "social_network": "reddit", "user": "VIXITROPIC", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1633030405, "permalink": "/r/SuicideWatch/comments/pyr37h/i_need_help_i_feel_like_im_out_of_options_please/", "nsfw": true, "first_save": 1635427455.0622063, "replies_charged": false}