{"id": "t5_2qpzs_t3_qeh1ur", "request": ["69686dc6-5bf4-41ab-864a-231bdd6f02c9", "5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "Tw: descriptions of attempts and self harm \n\nI stayed home from school yesterday, I didn't have intentions of trying, I just genuinely didn't feel good. But I was home alone and just figured I'd try. \n\nI started off with trying to hang myself, I don't have a suspension point so I was just leaning forward and hoping I'd pass out. I kept backing out of it. \n\nI tried adjusting the length of the shirt I was using, I got to where my feet were still touching the floor but I didn't have to lean into it anymore. I kept backing out of that too. \n\nI got frustrated with myself and cut myself. After that I went looking for the key to the gun safe. I couldn't find it but I did find the shed key. So I went out there and rummaged around for an actual rope. I couldn't find one so I went back inside. \n\nWent back to trying to hang myself. Kept backing out of that. Then went back to trying to open the gun safe. Got frustrated again and tried to hang myself again. \n\nBasically, most of the day was just me trying to hang myself. My dad got home and I just gave up. \n\nI ended up texting the crisis line, I just said I was suicidal and had a short 10 minute talk with them. I never mentioned the attempts. It didn't help but it didn't make anything worse either. \n\nMy neck is pretty sore. I think I have a little bruising from it. There's a red spot on the side that hurts when there's pressure on it. The front hurts as well with pressure. \n\nI tried hanging myself again today, I didn't have any intentions on dying. I just wanted to see how bad my neck hurt and it does hurt quite a bit. So I don't think I'll be trying again for a while. \n\nI want to tell my school counselor but I have quite a but of trouble with talking about this sort of stuff so I'm not sure I'd actually tell her. \n\nI think it kinda seems like I'm scared to die but I'm not. I'm not scared of the dying part, I'm more scared of the process, if that makes sense. \n\nSo yeah, neck hurts quite a bit and I have massive headache. Although I'm not sure if the headache is from the attempts or something else because they are quite normal for me now.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qeh1ur/the_only_thing_i_did_yesterday_was_try_to_kill/", "title": "The only thing I did yesterday was try to kill myself", "social_network": "reddit", "user": "am_the_great", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1635034947, "permalink": "/r/SuicideWatch/comments/qeh1ur/the_only_thing_i_did_yesterday_was_try_to_kill/", "nsfw": false, "first_save": 1635425328.892691, "replies_charged": false}