{"id": "t5_2qpzs_t3_n23dvz", "request": ["ee176c24-5d0b-47eb-8f0f-71f3b585684e"], "text": "I was planning on posting on r/unpopularopinion as well but my account is brand new. Hoping it goes through here. I'm betting it will get deleted, though.\n\nDoes this society actually value human life that much to prevent people from leaving an existence they never consented to, while it does the bare minimum, and not even that, in terms of giving people any reason to keep on living?\n\nIf you value life so much, why is it always that the only valid reason for continuing to live is a shallow platitude or a baseless hope for the future? Platitudes that are not supported by science, current events, or even studies about the life narrative of many people? Every time I hear someone say \"life gets better\" I answer with \"yeah, it would if you paid housing for me and helped me create my own life project\", else I'm just back in square one, and the cycle repeats as I have no way out.\n\nIf you value life so much, why, instead of kind internet words and dogmas to make you feel important, aren't you creating a better world? Solving actual problems? Helping people access housing, psychological help? If you do, congratulations, but I know for a fact most people don't care, and that's how we got here in the first place. If you can't do it, then it directly shows how our world is harsh, and taking a condescending view of the experience of the suicidal becomes a form of oppression, of validating the status quo.\n\nWho are you, even, to question my bodily autonomy? All the talk about bodily autonomy on abortion, or legal rights, yet the only choice that matters, that of continuing to exist and subscribing to this hellhole, is not mine to take. If I go against the norm I have to put myself at risk of something much worse, like ending up paralyzed, or dying with the idea I'm a selfish monster. What does that say about us? That we live in order to make others feel good, even when we suffer, even when we have to endure wage slavery, trauma, hunger, stress, hopelessness, homelessness, anxiety, etc. Again, returning to consent, you don't have a say on being born in such a world, and you don't have a say about when or how to abandon it. Pray your exit is swift and painless.\n\nDo you care about making people's lives better, meaningful, or are you just here because you don't like people exerting bodily autonomy and making final choices? I'm sorry, but I don't owe the world anything, and if the world wants my labour, my motivation, and my participation in day-to-day society, it will have to make it worth the suffering. I don't think it does. Prohibiting suicide in this situation becomes cruel.\n\nTake care.", "url": "https://www.reddit.com/r/SuicideWatch/comments/n23dvz/do_you_know_what_would_be_real_suicide_prevention/", "title": "Do you know what would be real suicide prevention? Actual help. Housing, a meaningful job, good friendships, an education that doesn't make you anxious about deadlines, or fitting in a society that can easily throw you out. Not a single platitude or a telephone number has helped anybody.", "social_network": "reddit", "user": "Archeopteryx3745", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1619816639, "permalink": "/r/SuicideWatch/comments/n23dvz/do_you_know_what_would_be_real_suicide_prevention/", "nsfw": false, "first_save": 1635427840.0728176, "replies_charged": false}