{"id": "t5_2qpzs_t3_qg2o9f", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "For all of my life I was just barely keeping my head above water. I had nothing to keep me going aside from dumb little distractions, but it worked well enough because I had no perspective that life could be more. \n\nThen two specific things fell onto my lap out of the blue and elevated life to bliss. It wasn't just a reason to get out of bed anymore, I actively had a spring in my step every day. My mood was fixed, I began taking care of myself, I started planning how to improve my situation, it's like everything made sense you know? A piece of me missing all my life was filled in.\n\nThen, this year, both of those things were ripped away from me in the cruellest, most nightmarish ways I could ever have imagined, and I've never been given an explanation as to why. And now I've sunken farther than I have before. Every day of the past few months has been heartbreak and apathy, with tomorrow and every day after destined the same. That spring I had has gone. \n\nSo, what do I do? Because I'm incompetent at life, factually. That isn't just poor self image, I've literally never been able to do things for myself. As far as I can see I have three options. \n\nWait for it to happen again, which I don't have the energy left for, and I'd rather not settle for 'okay' in place of *perfection*.\n\nLive the rest of my life in this pain, which I'm not going to do. I'm tired.\n\nAnd the third option being the obvious.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qg2o9f/ive_fully_given_up_on_life_what_now/", "title": "I've fully given up on life. What now?", "social_network": "reddit", "user": "Cosmonaut-115", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635240766, "permalink": "/r/SuicideWatch/comments/qg2o9f/ive_fully_given_up_on_life_what_now/", "nsfw": false, "first_save": 1635427668.519938, "replies_charged": false}