{"id": "t5_2qpzs_t3_2ipylc", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "Hi Reddit, It's Rowan again. I posted yesterday about the times I had tried to kill myself, and I'm really glad to say that I was able to laugh later, one of the other redditors made me smile and took me away from it for awhile.\n\nAt the moment, I'm standing around at work. It's a mobile kiosk, so really I can't do much but stand. My shoulders hurt. my legs are sore. Hell, all of me is sore and I feel like absolute sod. \n\nWhy do I feel like absolute sod? Great question. My best guess is because I never talk to people. That's not to say I don't ever make conversation, what I mean is that I never go deeper than typical friendly bollocks. To start, I think I'm probably a basketcase. I'm completely buggered. It might be because I'm alone, I don't like to be alone. I also don't like people all that much. Like I said, buggered. I didn't have some sort of shite childhood, it was actually quite \"normal\".\n\nI grew up in a middle-class home with parents that liked to work, I guess they wanted out of the middle class. They also liked to move, because by the time I was 8 we had lived in 13 different households. My dad worked and drank, and my mum didn't work until I was about 12. I guess money gets tight when pints are a considerable expense.\n\nFast-forward to 2012. my Year 11. I had an, again pretty average education. I picked up smoking and didn't have much for a circle of friends. The ones I did have were a bunch of wasters, which is fine because I was one too. At the end of February of my Year 11, I moved out and away from my mum and dad. \n\nHold on, I should back-track. I dated this girl from August to November of 2012/. Let's call her Hope. She was absolutely stunning, captivating, everything I had ever wanted. Plus, she loved zombie films. Bonus. For our first date, we went bowling and had dinner at this shite diner, then drove out to the country and watched the stars on top of the bonnet of her Toyota. She was a photographer and I thought that was real proper. I had always been enthralled with how a camera could capture a moment in time and freeze it, you could relive that moment anytime you took a glance at that photo.\nAnyways, things got rough for both of us and we broke up, which was pretty devastating for me because I had loved her and she had loved me. Whatever. it's the past.\n\nAs I said, I moved out in 2012 and I started dating another girl, Ashley (not her real name obviously) We got on really well and I'll be damned if I didn't fall for her. We were together for 8 months and had an absolutely horrid time during the last leg of our relationship. I should have been glad we split.\n\nDuring this time, I started using oxy and ambien tablets to help me deal with a crumbling relationship and other stresses. This turned into a giant problem and those little tablets became my main resource when it came to trying to kill myself. A problem I eventually beat, but came back to in the form of bupropion tablets.\n\nNow it's October. I'm back with my mum and dad and I have a job. I should be really happy that I haven't ended up dead or bloody crazy, but venting on reddit may justify the ladder.\n\nI can't seem to find happiness, I usually stand around feeling bleak and lonely as all hell.\n\nI wish I could articulate myself better.\n\nCheers to anyone who reads this.\nTL;DR I think I hate myself\nEDIT: Apologising beforehand for typos.", "url": "https://www.reddit.com/r/SuicideWatch/comments/2ipylc/venting_feeling_low_and_prone_to_selfdestructive/", "title": "Venting, feeling low and prone to self-destructive behavior.", "social_network": "reddit", "user": "zombieknob", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1412819643, "permalink": "/r/SuicideWatch/comments/2ipylc/venting_feeling_low_and_prone_to_selfdestructive/", "nsfw": false, "first_save": 1635422560.7028153, "replies_charged": false}