{"id": "t5_2qpzs_t3_pfuixr", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "Today was my first \"real\" day going back to school and I'm on the verge of ending it all.\n\nI realize how stupid it sounds. I don't have bullies or anything so I should be grateful but to be honest... My mental state is extremely fragile. The smallest thing can disturb my mind enough for me to cry for 5+ hours and plan my suicide. But it's been a long time since I've gotten this close to actually doing it.\n\nI hate my school I fucking despise school work since I don't have the brain capacity to do good. AND. What I hate the most in the entire world is having to spend 8 hours surrounded by people in a classroom. I don't have real friends. I've had some people I used to talk to during the day but it's only because I was terrified of being alone and they are the kind of people who just love to talk. They didn't really care about me, we weren't friends like that.\n\nBut now I'm completely alone.i don't have the energy to interact with anyone anymore. \n\nSchool makes me so anxious. The past few days I had terrible insomnia and when I managed to sleep for Like 2 hours I had the most disturbing and terrifying nightmares about suicide. Like insanely morbid and soul wrenching. \n\nI can't help but fantasize about killing myself. It sounds so peaceful to not have to put up with people, family and work ever again. I want to do it. The only thing that's stopping me is that the only way I can do it is slitting my wrists since I don't have any more \"resources\". But I've already tried it and failed. Its harder than it seams. And if I fail I don't want to go to school with scars. I can't handle it. Ok there's another thing that keeps me alive. I know that if I start dying I will feel terrified no matter how much I want to be dead. And I can't handle being scared. So fucking ridiculous. Why am I even worrying about this? I won't be scared for long anyways. And then I won't have to feel any bad emotions ever again. It's worth it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pfuixr/going_back_to_school_feels_like_a_continuous/", "title": "going back to school feels like a continuous panic attack + a fever dream", "social_network": "reddit", "user": "throwaway005789", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 60, "down_vote": 0, "creation": 1630504930, "permalink": "/r/SuicideWatch/comments/pfuixr/going_back_to_school_feels_like_a_continuous/", "nsfw": false, "first_save": 1635426526.3110685, "replies_charged": false}