{"id": "t5_2qpzs_t3_isvyqb", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I am constantly ruminating on the past where I did something so fucking despicable that it shattered the fabric of my understanding of who I am as a person. I feel as though my brain is against me and that it is constantly punishing me unless I figure out what the fuck is wrong with me. I know what I did was awful and I would never do it again but why can't I move past it? Suicide always seemed like the appropriate response but I still wish to make things right. I can't contact the person whom I've wronged and I have absolutely nothing to offer that could fix this situation. \n\nI am a monster and I am too stupid to figure out how anything in life works. My brain always, ALWAYS chooses the worst options. Like, why the fuck do I do these things and hurt people? Why am I so focused on personal destruction 24/7? What the fuck caused me to end up like this and why am I still alive? \n\nShe did everything to help me and I threw her under the bus. She fucking poured her heart and soul into me and I ran away after I got what I wanted. She was literally an angel and I fucking betrayed her during her most vulnerable time of need. I am a monster that needs to die. \n\nWhy am I alive? Why do I exist? I literally cannot think for myself clearly and that has been my excuse. BECAUSE I CANT THINK? GOOD FUCKING EXCUSE YOU IDIOT. I tried hanging myself but I can't even do that properly. All I want to do is help her but after everything I have done, prison would be too good for me. What do you even say to someone who is a literal psychopath? I wish I had a gun. At least then I would have the balls to kill myself. \n\nPlease help. I am an abuser and I fucking ruined the life of those who gave a damn about me. How the fuck do I continue living like this after being a monster? How do I continue to breathe and eat when her face is all I ever see? I need advice.", "url": "https://www.reddit.com/r/SuicideWatch/comments/isvyqb/i_need_advice_i_am_an_abuser/", "title": "I need advice. I am an abuser.", "social_network": "reddit", "user": "fishlesspoke", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1600123266, "permalink": "/r/SuicideWatch/comments/isvyqb/i_need_advice_i_am_an_abuser/", "nsfw": false, "first_save": 1635428066.3773499, "replies_charged": false}