{"id": "t5_2qpzs_t3_prk08s", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42"], "text": "Sorry if there's any grammar mistakes \n\nI'm a 17 year old male, high school senior, and I have negative and suicidal thoughts every day. Is that normal? \n\nBeen like this since late sophomore year and I feel like getting worse and hopeless. \n\nDuring classes, during practice, and at home I just want to end it all. I see myself as useless waste of space that doesn't have no real reason to exist. I know that killing myself would devastate my family, but would my parents be slightly relieved? \n\nI know. I know it's sounds terrible. \nI have nothing going for me. Average grades. no car, in special education system even though I don't need extra help, haven't really been looking towards college. (Probably would do finance or economics and find a good paying job) and I literally no social life whatsoever. one thing I'm good at is history and geopolitics but no one cares about that. \n\n Ive been doing cross country since early middle school and I'm still terrible at the sport. so nothing special with that. Only do it because my friends do it and my parents wouldn't let me drop out. \n\n  If not at school, work, or practice. I lay on my bed for hours doing abosulte nothing. Not feeling motivated to do anything. Used to play video games mostly rocket league but generally have no motivation to play anything.  I find some joy in reading history (not really can be depressing) and current events. Have a really bad porn addiction I have tried to break out of it but it's only gotten worse. \n\nI written a couple suicide letters in case I actually commit. I don't want to die but I feel like if I don't I'll regret it in the future. Don't know if this makes sense, haven't told anyone about my ploblems felt like that could escalated into something badly. But wrote this post wanting help. How do I deal with this? How do I go by not hating myself every day.", "url": "https://www.reddit.com/r/SuicideWatch/comments/prk08s/im_a_17_year_old_male_high_school_senior_and_i/", "title": "I'm a 17 year old male, high school senior, and I have negative and suicidal thoughts every day. Is that normal? Need help.", "social_network": "reddit", "user": "ParticularOk1785", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1632097961, "permalink": "/r/SuicideWatch/comments/prk08s/im_a_17_year_old_male_high_school_senior_and_i/", "nsfw": false, "first_save": 1635427344.2562747, "replies_charged": false}