{"id": "t5_2qpzs_t3_qg026v", "request": ["5f7c2841-3f43-4682-8126-88825da57933", "5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "I don't know how to really go ahead and explain what I'm going through. Cause it's just too difficult and hard to explain. Sometimes when I try to express it out, it doesn't come out in the way I try too. It's almost two years now and I feel suicidal almost everyday. I don't know what really went wrong with me. I get these flashbacks of memories or thoughts I don't want to have. They come without any warning and at random times. If am at home I just break down. Sometimes these triggers happen while am working and then it's just me crying. I have serious adjustment, attachment and abandonment issues, coupled with chronic depression. So it's pretty fucked up. I didn't really have a safe space in home as a kid. So I was always suicidal for as long as I remember. I never really got along with my step mom, and she emotionally and mentally abused me a lot. Like just too much. I used fantasise killing when I was a kid. Or like running away from home. Or killing myself. But didn't do any of those. (Haha). These thoughts and numb feelings were temporary halted for like around 3 years in between. I think as a kid I never got that attachment which a child needs. So when I got that in my former partner, it just totally pushed those depressive thoughts far away somewhere where I couldnt see or feel them. But then they were still there, it's just that I could ignore them with ease. But then all good things come to an end i guess. That saying is true. My partner left me towards the end of 2019 for a guy, who is like similar version of me. I don't know why she did that. I had heard out such incidents earlier but never thought it would happen to me. Cause its super fucked up. Honestly at first, I just ignored it and kept other distractions like tinder and drugs. I am more or less perpetually high on some substance or the other now. But when the pandemic hit, everything just came back rushing again. The depressive feelings. The sense of loneliness. Everything. To make things worst I didn't have any friends anymore in the city I live in. All my friends had left for different places. And I got so comfortable with my ex that I didn't make any effort to make any new friends. And last year was tough. Honestly the suicidal thoughts aren't to get back with my ex. I don't want too at all. The very thought of it makes me nauseatic now. I just feel dissappointed that I laid it all in front of a person and then that person just exploited it and fucked me up at the end, like as if she didn't care and became a different person. The thing which i hate the most is i begged her to take me back or get back with me, that's the saddest point in my life. I should never have done that. \n\nLoneliness is tough. I have been living alone for like 2 years now. And I hardly meet people. I just don't feel like meeting people anymore. And I don't know anyone in my place too. Like I know I won't kill myself but the thoughts to self inflict it happen everyday and it's fucking hard to go through such shit every fucking day. I feel so dissappointed, hurt and pissed off everyday.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qg026v/feel_suicidal_almost_everyday_for_the_past_15/", "title": "Feel suicidal almost everyday for the past 1.5 years", "social_network": "reddit", "user": "neelavfrbarca", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1635228540, "permalink": "/r/SuicideWatch/comments/qg026v/feel_suicidal_almost_everyday_for_the_past_15/", "nsfw": false, "first_save": 1635421109.88819, "replies_charged": false}