{"id": "t5_2qpzs_t3_nc0an7", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "Hi, my name is Katina. I have been struggling for what it seems like my whole life with SI. I remember when I was just 8 I used to try and suffocate myself in my pillow every night. I hated myself so much and all I wanted was to just to go somewhere where I was not living. Freshman year my depression hit me harder than I could have every imagined possible. I made a pact to myself that on my 16th birthday I would just do it. I felt like I could not take the pain I was going through anymore. I remembered debating whether the pain my loved ones would feel when I was gone or the pain I had been feeling for so long was more important. I remember my 16th birthday so clearly I spent all day and all night crying in my room because I was so conflicted. As many of you know being suicidal is a really scary feeling. Sometimes I do not even feel like I have control over my body and I have to do nothing but focus on staying in bed and doing absolutely nothing. I, as you can see, did not end up doing anything that day. You want to know what really made me decide I could not do it? I could not stand the fact that if I had done it my dog would not know where I was and she had helped me survive through all of those years I couldn't just give up on her then. I made a new pact with myself that I could never commit because I know at least one person or animal out there is depending on me and I can't let them down. So now tomorrow is my 18th birthday and I am still standing strong. I still struggle....like a lot but I know that at least I am there for the people that need me. If you're reading this and you are struggling or have struggled with SI  I just want to say I am so proud of you. I know a lot of people do not understand what you are feeling or going through and you might feel so lonely but please know I am here with you. I just want you to know that you are loved and needed. It may not feel like it at all but I know you are loved and needed by me. You are so strong and amazing even though you might not feel like it. I promise you all that no matter how deep in the ditch I get I will keep getting up and surviving. It would mean the world to me if you did the same. Please keep going if not for me do it for you. I know you are doing amazing things in this world and I 100% believe in you. Thank you and remember you are loved! (I am so sorry there is so many grammar issues in this but I could not stop sobbing my eyes out while writing this)", "url": "https://www.reddit.com/r/SuicideWatch/comments/nc0an7/18_years_and_going_strong/", "title": "18 years and going strong", "social_network": "reddit", "user": "tiredandexhuasted", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 39, "down_vote": 0, "creation": 1620966547, "permalink": "/r/SuicideWatch/comments/nc0an7/18_years_and_going_strong/", "nsfw": false, "first_save": 1635427744.2389908, "replies_charged": false}