{"id": "t5_2qpzs_t3_f58g9b", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": " Just got completely blindsided by the person I thought was my best friend. \n\nI have a history of suicide attempts and stays in mental hospitals, but lately I’d been doing better. I managed to start up a business, work on my health, made some friends. And now it just feels... like it was all for nothing.\n\nMy best friend of 3 years, who I talk to literally every day, decided to not invite me to their wedding. It’s not a small wedding either, I think its about 80-100 people attending. His reason was that his fiancee feels weird about it because she doesn’t know me and my husband that well. We’ve met her once for a day of sightseeing, which was a nice day and we seemed to get along. Afterwards I tried to initiate more contact with her to get to know her better but she just wasn’t interested.\n\nAnd I guess he, he just didn’t tell her that he wanted me there. Or maybe he doesn’t even want me there himself. I just.. Don’t understand. I don’t know what I did wrong. Maybe she doesn’t know me well (not for lack of trying from my side) but she has no reason to dislike me either. \n\nI... I just really thought we were best friends. Maybe the notion of ‘best friend’ is childish, but close friends at least. He told me many times he cares about me, thinks of me as a good friend etc. Now I wonder if it’s all just lies. \n\nI tried to be part of this world. I rebuild my life from rock bottom and I tried so hard to fit in, to be loved, to matter. But if even someone I talk to every day for 3 years doesn’t want to include me, what am I even doing here?\n\nThere’s distant relatives coming, coworkers etc.. But not me. \n\nHe said he does care, that we can be best friends without all that. But I’ve never heard of a best friend who wasnt invited to a wedding with 100 other people there. It’s not just the wedding, I’m not welcome to visit his house either.\n\nI made a pact with myself to live till 30 and end it then. I’m 26 now, but I don’t know if I can do another 3,5 years. I’m just a nuisance, some random person. Never a true friend. Why burden everyone with my presence for 3 more years?\n\nGot some stuff to take care of first. But then I’ll just leave this world. I don’t see the point. I just wanted to be loved, to be part of something. But I should’ve known that wasn’t in the cards for me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/f58g9b/why_do_i_even_bother/", "title": "Why do I even bother", "social_network": "reddit", "user": "darkladysylvanas", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1581944662, "permalink": "/r/SuicideWatch/comments/f58g9b/why_do_i_even_bother/", "nsfw": false, "first_save": 1635427762.4595678, "replies_charged": false}