{"id": "t5_2qpzs_t3_q9q1rq", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "Just turned 21. I never thought I would make it, but I did. I did not want to make it to 21. I have a ton of unresolved childhood trauma, not willing to get any help for it due to how distressing it is. Constantly, all day, I think about it. My OCD and depression makes it absolutely unbearable, yet I still manage to hold my own job, unwillingly. At home, I just stay on my phone until I go to bed. My hygiene is completely neglected, I cannot stand looking at myself due to gender dysphoria, I do engage in self harm as a result of being heavily dissatisfied with my body and life, which is empty. Graduated with a 2.4 GPA in high school, barely made it, I am convinced that I have an extremely low IQ. Failed every college course I took, did my best, but combined with ADHD, there was no point. My life has no future, I cannot learn Jack shit. I am such a fucking pussy. People are going through worse, and I am willing to kill myself over this. \n\nLately, for about a month, I have not had the energy or will to chat with friends, or play videogames. I am really tired of them all, each day feels like the same, repetitive, dull routine. It is driving me insane, yet there is nothing for me to do, nothing interests me, at all. I have a firearm, and I am already so tired. I feel as if hospitalization is the best for me, but I do not want to lose my job, or my firearm. I risk losing my friends as well. I cannot trust anyone anymore, I am so sick of living in this loneliness.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q9q1rq/preferring_death_over_whatever_crap_i_am_going/", "title": "Preferring death over whatever crap I am going through.", "social_network": "reddit", "user": "basedthrowaway2042", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634438158, "permalink": "/r/SuicideWatch/comments/q9q1rq/preferring_death_over_whatever_crap_i_am_going/", "nsfw": false, "first_save": 1635427973.309029, "replies_charged": false}