{"id": "t5_2qpzs_t3_o5sv6f", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "I want you to really think about it. Is life really worth it? What do we do this all for? We spend so much time and effort endure so much pain but for what? All we ever end up doing is something small, a man born rich will never know what he has and a man born poor will never see what he could be the truth is we all live in an endless cycle of life and death. Knowing my name won't be known by anyone within the next century after my death is truly what does it for me.\n\nI know already I don't have the skills or energy or drive to ever truly do well in any field so what's really the point I've never done anything that truly will make an imprint on someones life.\n\nAll of my actions have been unimportant or useless and mt brain doesn't seem to want me to succeed because I'm simply too stupid to focus on tasks.\n\nSo, I'll never amount to anything so in truth what's the point once you've done bad in highschool your record is permanantly stained your chances of getting into universities shortened and your life is much less important than it would have been.\n\nTherefore, in my opinion suicide is not something that should be frowned upon or seen as taboo it's simply a way to end someones pain a way for them to  escape the harsh reality we live in. In truth it's a cowards way out but, it's a way out none the less and one that I and many others have debated taking for a long time.\n\nSo please don't frown upon someone who has or is considering attempting suicide. The truth is they;re already hurtinh enough inside if they did it and actually wanted to die because all you're doing is making it worse.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o5sv6f/the_truth_is_we_dont_need_to_live/", "title": "The truth is we don't need to live", "social_network": "reddit", "user": "taldop", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1624384079, "permalink": "/r/SuicideWatch/comments/o5sv6f/the_truth_is_we_dont_need_to_live/", "nsfw": false, "first_save": 1635428433.7065556, "replies_charged": false}