{"id": "t5_2qpzs_t3_jvmahe", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I’m constantly worried about something. Once my mind finally lets go of one thing, it finds the next thing to worry about. Recently I’ve been worrying about what kind of person I am. I know I’m a good person, I have flaws like anyone else but my mind has this amazing way of just torturing me honestly. \n\nI recently got a new job & I’m waiting to move forward in the hiring process. I’m happy I’ll finally have something to do with my time since I’ve been out of work & school for months. I’ve been working on rearranging my room & getting a new piece of furniture in. Today I didn’t have much to do, I’d gotten everything I wanted done for the time being. So, I watched YouTube almost all day. I ate with my family, spent time with them like I usually do. Rather than tell myself it’s okay to have a lazy day & that I’ve gotten quite a bit done recently, I fixate on what I did wrong. I spent way too much time on my phone, I was unproductive, I always seem to find something wrong with me even when I’m trying so hard to be positive. The littlest things will send me into a dark spiral I haven’t figured out how to get out of. For instance, I’ll hear something on a show I’m watching & start to feel guilty, wondering if I’m guilty of doing this when I know I’m not. I never used to be this way. What’s wrong with me? Can anyone relate to this? Does anyone have any idea what this could be? Anxiety, depression, both ?\n\nThank you for reading 🖤", "url": "https://www.reddit.com/r/SuicideWatch/comments/jvmahe/overthinking_has_really_started_to_take_a_toll_on/", "title": "Overthinking has really started to take a toll on me /:", "social_network": "reddit", "user": "xpurple-alienx", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1605586173, "permalink": "/r/SuicideWatch/comments/jvmahe/overthinking_has_really_started_to_take_a_toll_on/", "nsfw": false, "first_save": 1635428126.50163, "replies_charged": false}