{"id": "t5_2qpzs_t3_pztk56", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "Okay here goes. I've been in a very weird place mentally. By saying that I mean that the abundance of empathy and understanding and acceptance I have of other people's emotions, struggles and mental health does not align with the lack of empathy I usually have for myself. Don't get me wrong there are days when I am very accepting and compassionate of my struggles but usually I beat myself up every time I don't feel completely confident or happy or as emotionally stable as I'd like to. I wouldn't be posting this if it weren't for a comment I received on a post I made a couple of days ago. I had basically made a post asking if it meant that you were a weak person if you couldn't get through a mental health crisis by yourself and if you had to reach out to someone because you felt like you couldn't cope by yourself. This is ONLY the attitude I have towards myself when I'm in crisis, yes I may think it makes me a weak person for having to reach out in a crisis but does that mean that I think that other people are less strong for having to reach out for help in a crisis? Absolutely NOT. Never ever never. I actually think it takes a fuck load of strength and bravery to ask for help, I know that probably sounds really cringey but I really admire people who are able to ask for help/aren't afraid to show their emotions/be honest with other people about how they're feeling. But someone twisted the context of my post and basically said to quote their exact comment \"that it was disgusting of me to even question something like that and that I should be ashamed of myself\" what people don't understand is that the only reason I am asking that question is because I genuinely feel like I don't know the answer for my own mental health, I know the answer for other people, which is no it doesn't ever make you weak. This is something that makes me feel embarrassed because I think that because I lack empathy for my own problems, that other people see that as a reflection of my ability to empathize with other people. I know many people who lack empathy/compassion for their mental health but they are very compassionate towards other people's suffering. I know it might sound blunt but I would have guessed that the majority of decent people would have known that by now especially with how much mental health content there is on social media these days and on the internet", "url": "https://www.reddit.com/r/SuicideWatch/comments/pztk56/slight_rant/", "title": "Slight rant", "social_network": "reddit", "user": "turtleycool38", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 0, "down_vote": 0, "creation": 1633174757, "permalink": "/r/SuicideWatch/comments/pztk56/slight_rant/", "nsfw": false, "first_save": 1635422998.3734505, "replies_charged": false}