{"id": "t5_2qpzs_t3_pkfuz9", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "Hi,\n\nto get started, I'm a 30 year old male. I never had a girl friend or sex without paying for it.\n\nAs I was younger it was mostely sexual frustration but as I get older I just realize how lonely I feel. Most friends are now in more serious relationships and have less time to hang out.\n\nHow did it come to this situation as I clearly wanted to have a girlfriend my entire life?\n\nI was bullied and ridiculed a lot as teenager and even young adult, often about my looks. It affected me a lot leading to a lot of selfhate and depersonalization.I had a lot of problems with depression and anxiety from my early teenage years one, leading to a lot of unhealty coping strategies like drinking, gambeling, bulimia and smooking unhealty amounts of weed.I was able to quit all of these habbits besides smooking weed.\n\nI did never really try to date. A few half hearted attempts as I was younger but did not really do anything for the last 7 years or so. At some point I just gave up despite hoping that it would somehow change by some wonder.\n\nAs I was 25 I was at the end. I had developed a mindset of an incel despite not have beeing active in any community. I just projected my selfhate on women and I did know it was not right but it was the only way to get a pause of hating myself. But of course it just backfired in the end. After not beeing able to lead my life for months I decided to commit suicide. Waited for hours at the rails but was not able to do it in the end. So I decided to get myself professional help and got hospitalized. It somehow helped, especially the SSRI lifted me up again.\n\nI had 4 \"good\" years now, still beeing burdend by selfhate and beeing ashamed of beeing not able to attract women but at least I was able to enjoy life again.\n\nBut now it's going down again. As mentioned in the beginning I still haven't improved in this area of life and it starts to bother me really bad again. I don't want be lonely and feel very worthless because of it.Also there is narcissistic quality to it. When I think about that the most of my friends have been able to get into romantic relationships and to explore their sexuality it makes me sick because I feel very inferior then.\n\nI'm really worried I can't change it. I'm clearly not an attractive guy despite taking effort in getting better looking. And it worked to some degree. I'm clearly better looking as in my early tweenties. But it is still not enough, I'm still way below average I guess.\n\nAlso I have not been able to get over the selfhate and starting to search for a partner. Just by thinking about it I feel paralyzed and embarrassed. Most of my friends have found partners but I can see it also with friends who have been single for a long time. I just cringe when I see when they try to hit on women because it is so painfully akward. They act very insecure and even creepy. Women complained about it. I don't want to come into this situation.\n\nBut I want to overcome it because the only other option would be suicide which I want to keep away from me as far as possible.\n\nI have a active social life and a big circle of friends and most people like me I guess. They like to party with me and trust me. I'm thankful for that.I also had a lot of hobbies but most of them have been on the nerd side I guess.I used to produce hiphop instrumental and to programm video games.Also I'm into horror and thriller movies a lot.I would call myself well educated and beeing emphatic (but it's hard for me to show it).But I also have a dark side, I can get very angry and take joy in others suffering. But I'm working on it and reduced this character traits because I have a conscience and every time I take joy in these things I have to pay later with feeling bad about it.\n\nIt may sound  ridiculous but I feel these suicide thoughts coming everyday now again.It is just constant psychological and physical (locked jaw, face hurting, tired etc.) pain.\n\nI know I need to see a therapist again but I'm not sure if he/she can really help me.They just can't swap my body.\n\nIs there anyone out there who can give advice (and maybe even recognizes themself in this post and was able to change his life)?\n\nGreetings  \nJohn", "url": "https://www.reddit.com/r/SuicideWatch/comments/pkfuz9/is_it_possible_to_overcome_selfhate_and_to_find_a/", "title": "Is it possible to overcome selfhate and to find a partner (and if not to overcome the pain at least)?", "social_network": "reddit", "user": "JohnDeo2", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1631124477, "permalink": "/r/SuicideWatch/comments/pkfuz9/is_it_possible_to_overcome_selfhate_and_to_find_a/", "nsfw": false, "first_save": 1635422922.6905818, "replies_charged": false}