{"id": "t5_2qpzs_t3_ocnjcj", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "I don't believe that many of you here will understand me since you feel that USA is the worst place to live in but you can't realize how lucky you may are. I live in eastern Europe, to a country that is considered developed but it's not.\n\nMental health it's still a taboo, psychiatrists and psychologists are not well trained and very expensive, most of them just give you a bunch of pills there is no one to know erp for ocd, dbt for bpd etc. We have extremely economical issues, you can't find job anywhere, not even to a fast food and school s are crap the same goes with universities also. People here are extremely religious and superstitious and they can't understand how detrimental is that for someone with ocd.\n\nI destroyed myself for a useless degree because education system is so complex and stupid and because I never found proper therapy, I had only unhelpful medication. I feel doomed being here and trapped because I can't find anyone to understand me.\n\nI'm not delusional I don't think that my problems would dissappear if I lived somewhere else but I know for sure that situation here makes everything worse, makes me feel more isolated and anxious. I feel better when I spent time on reddit because I can find people who have the same thoughts but then they suggest me something that I can't apply here or a great advice that I can't follow because I live here.\n\nI have tried many times to explain in too many subs my problems but people seem to not understand my situation and it's logical, they can't even imagine how awful things are here. They take some things for granted when they are not here unfortunately.\n\nMy fears with social anxiety and ocd may seem objectivly irrational to most but they are completely rational considering my life. I live in a small town and everyone knows everyone, most people who have mental health problems they hide it to the point to be extremely careful to even visit their doctor. You must always have a good reputation in order to be a part of the society, if your neighbors hear you crying or screaming, you have been destroyed whole town will consider you mentally retired.\n\nI tried many times to share my thoughts in a local mental health forum but most people were so damaged to offer me a meaningful advice or they just told me to take medicines like this is the golden solution fir everything. Some of them they became extremely religious and they can't see any other solution. I don't judge them, it seems the only way to cope here with our situation.\n\nI can also go on and on about how corrupted our whole system are and how people use fake excuses to take allowances and other gifts etc but there is no point. Nobody can understand how its to be here except for someone who lives in one of those countries or in a Balkan country.\n\nI can't live like this anymore and I know there is no point to try to get better because my life will be crap either way. I used to believe that my problem is just mine, I have a different way of thinking not very similar to my culture and the way of living here but I realize that you must be delusional to feel good here.\n\nI'm sure that other people here feel the same way but they just try to ignore it or they just have faith in God.\n\nI don't want to die really but I think I have to. Not because of my country, I have many other reasons but there is no solution here. The only good thing is that when I will fall from the balcony, I won't be saved because hospitals here are so inefficient. I knew someone in my age who fell from much lower high and he still ended up dead when I have read for people who jumbed from much higher place and they lived probably because medical stuff reacted quickly.\n\nI wished someone here would understand but probably I will be ignored again.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ocnjcj/my_country_makes_me_suicidal/", "title": "My country makes me suicidal", "social_network": "reddit", "user": "Miss_miserable_", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 102, "down_vote": 0, "creation": 1625273121, "permalink": "/r/SuicideWatch/comments/ocnjcj/my_country_makes_me_suicidal/", "nsfw": false, "first_save": 1635428427.3649354, "replies_charged": false}