{"id": "t5_2qpzs_t3_md7yms", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I often wonder if there’s anything I’d still like to do in life, any loose ends I need to tie up, ‘unfinished business’ in a ghostly sense. Usually there is nothing. I’m unsure why I have kept going or trying but I have and some people may think that that is a good thing or something to be proud of when really it is pathetic. This naivety that things will change/improve. \n\nI don’t have anyone I’d be leaving behind. I don’t have \\~family\\~ and I’ve cut ties/distanced myself from friends. I’ve got a partner but he’s on the other side of the world anyway and I’ve not seen him for a long time and it is unknown when I’d be able to again. Feels like I’m alone a lot of the time. That’s not anyone’s fault though.\n\nI don’t have any responsibilities like a child or pet or a job that would be difficult for others if I didn’t show up anymore.\n\nThe only goals and aspirations I have are so simple and yet so unreachable. They no longer feel real or obtainable. \n\nYet again I’m typing onto some stupid document I’ll archive or delete or ignore because I’m trying not to cut or kill myself, but for what purpose? I’m only going to be feeling the exact same tomorrow and the next day and the next day… an endless cycle that I’ve suffered through for so long. I feel beyond help. \n\nI keep having the same visualisations. Cutting deep into my thigh, I see the blood and the fat and the blade in my mind. I also keep picturing myself drinking and overdosing. I can’t get the images and thoughts out of my head. I really want to let myself give into them but for some reason I hold back. I don’t know how I haven’t cut myself this year, I really don’t know what has been stopping me and yet still I haven’t. Typing this is calming, I don’t know why I do so… why I keep trying to tackle what will inevitably lead to my demise. What is the point of keeping up this tiresome fight? \n\nMy mind fixates on self harm and suicide. There’s no turning from it. I’m trying so hard to type these thoughts out and ride the wave yet again, I’ve done it countless times. It is getting harder and harder to do so again. \n\nThe suicide methods my head keeps going to aren’t always the same. Sometimes I slash my wrists deep enough, sometimes I drink and overdose then go somewhere to drown.. I picture jumping off a bridge into traffic, or waiting for a train to hit me. Sometimes I see myself hanging myself with that noose I have made. I don’t know why I am still here and I don’t want to be. I wish I could have someone just hold me and tell me everything's going to be alright in the end… but I’m alone, the only person I have for reassurance is myself and I just can’t anymore. I feel so bad for my younger self, I wish my first attempt at 8 worked. I wish the attempts following worked. I just wish I wasn’t here anymore. \n\nMy head is doing that thing where when I think about it too much my head gets so heavy and tired and I feel the deep need in my chest to die. It’s hard to hold my head up, gunna lie back down see if I can sleep more. I hope I don’t ever wake up even though I know that I will if I do get sleep.", "url": "https://www.reddit.com/r/SuicideWatch/comments/md7yms/i_typed_this_up_for_only_me_but_figured_may_as/", "title": "I typed this up for only me but figured may as well post it too", "social_network": "reddit", "user": "WPAttempts98", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1616705086, "permalink": "/r/SuicideWatch/comments/md7yms/i_typed_this_up_for_only_me_but_figured_may_as/", "nsfw": false, "first_save": 1635428131.426949, "replies_charged": false}