{"id": "t5_2qpzs_t3_pw6udw", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "My life is good all things considered, yeah I've had a lot of loss in my life, but I have family and friends that love me, I have hundreds of people in my phone that I can talk to at any moment, who all know what I go through and are willing to talk to me even at 2:00 a.m. in the morning. I have a good therapist that understands my financial constraints and works with me.\n\nI have a church that understands my issues and genuinely listens to me.\n\nI'm not a drag on society, I go to work, I provide for both my parents and myself, while buying a house and a car, I listen to all my friends whenever I can help them with their issues I don't ever want anyone to be where I am, I socialize in person, and online, I have plenty of fun hobbies, I SHOULD be fine.\n\nBut I'm not. I will go from being perfectly fine and laughing, walk into the other room from whoever I was talking with and immediately see every tool around me as a weapon of self-destruction. If I step outside while it's dark I get an overwhelming sense of melancholy and feel disconnected from all the people that I know care about me and it doesn't matter what I say I can't convince myself that they do.\n\nI'm teetering on a knife's edge, and any given day I am 10 seconds away from death. And I don't know why. Why can I be so okay sometimes, and so broken the next second? Why won't this stupid little meat bag in my head be convinced that life's going to work out?\n\nWhy do I feel so lost when I know everyone is the touch of a button away? And why is it so hard to reach out to them when they're so close to me?", "url": "https://www.reddit.com/r/SuicideWatch/comments/pw6udw/i_should_be_okay/", "title": "I should be okay.", "social_network": "reddit", "user": "Ph4d3r", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1632706026, "permalink": "/r/SuicideWatch/comments/pw6udw/i_should_be_okay/", "nsfw": false, "first_save": 1635427495.3141747, "replies_charged": false}