{"id": "t5_2qpzs_t3_cju02d", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "All I (15F) dream of all day is the sliver--the taste of a new home life. Don't get me wrong, I love my family for they are my blood, but a depressing tone flows between all of us. The downstairs area is where everyone congregates, but if found alone, you could tell my brother, mother, sister, father, whatever, is just barely getting by.\n\nWe live under a fair roof. A room for each of us, a yard of grass for the dog, and right now, the bathroom for the kitten we're considering adopting. It's disgusting; Piled plates, unwashed carpets, and the mass collection of blankets and pillows you may fall asleep on late afternoon if you do not feel the motivation to carry yourself to your room, 10 meters away. We have had the same maids all my life, and every week when I come home to a fresh bed and a kitchen counter cleared off, it gives me a sense of momentary happiness.\n\nI live heavy with my severe depression, and so does my mother. When I look at her, I can tell she wants to die. I know she only sees her life as a repetition: To work, to work, and to cook a finishing meal at the end of the day. It's a melancholy sight and somehow I know I'll crawl into her shoes and live a replicate life.\n\nMy father, and my sister, they live with debilitating ADHD that has mutated into many other issues. When I look at them, I can tell they worship their life for every second, but that they suppress the struggles above and underneath. They function as well as my mother and I, limited motivation with a lack of grip on reality. My brother is the odd one out, with the anxiety and mutism factors that meet for a lonely and melancholy social life.\n\nLife is bleak in my family. The cost of existence sees not that we teeter the line of poverty and privilege. It sees not we have lost our dog this February, that my father lost his only long-time stabilized job, that we have run free of money today.\n\nI think about helping my family in anyway with costs, although my talents are one to none. My education is still blooming and I have no money to offer. There is nothing I can offer excluding my presence and promise of my future.\n\nI consider suicide, but if gone through with, the rippling of suicides after mine will leave my family name stunted. My shoulders are heavy and I do not feel like I can carry them anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/cju02d/a_disheartening_family/", "title": "A Disheartening Family", "social_network": "reddit", "user": "_yogurtcloset", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1564503323, "permalink": "/r/SuicideWatch/comments/cju02d/a_disheartening_family/", "nsfw": false, "first_save": 1635427554.2531378, "replies_charged": false}