{"id": "t5_2qpzs_t3_pc172z", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I haven't spoken to my ex-boyfriend in almost a full year. I completely blocked him on all socials, phone, email, etc. I did it because I thought it was going to help me figure out what I need, without his influence trying to push me one way or another. I thought I'd be able to work through my trauma and pain and life decisions that were truly mine without his voice chirping in my ear.\n\nBut here I am, in the same emotional state I was almost a year ago. I haven't been eating, I've been oversleeping late into the day, I have no friends, I have no money, I am so deeply unhappy. I have one person who I am able to confide in, but they are currently in law school and do not have the ability to help me. I wake up alone, go nowhere, and sit in bed all day because its the only thing I can trust myself to do. I feel stuck to the mattress some days because I feel like if I get up i'll purposefully hurt myself. \n\nI miss my ex so much. I think about him all day and ruminate about how he is, I just want to talk to him, but I know I can't do that. I feel so alone. I want to talk to a friend or someone so that I dont reach out to him when I am vulnerable. \n\nI read books and try to understand my mental illness, my abuse, my parents, and why other people act the way they do, but just because I can try to logically understand my suicidal ideations, that doesn't fix the emotional pain that overwhelms me daily. Logically, I assume that this wave will pass like it has dozens of times in my life. But realistically, I feel like I've just been struggling for a very long time. The desire to hurt/kill myself has been present in my mind for about a decade, it started when I was 13 and now i'm 23. I have PTSD, depression, anxiety, and I've been getting frequent panic attacks for the past year. In regards to the PTSD, my nightmares and flashbacks have come back recently.   \n\n\nWhen I look back on my life, I see pain and mistakes. I don't have many happy memories. I don't have a support system. I know I can't kill myself, but I want to. I think about it every day. I am so tired of living when every day is a vast stretch of pain and meaninglessness.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pc172z/im_trying_so_hard_but_why/", "title": "i'm trying so hard, but why?", "social_network": "reddit", "user": "fatdachshund27", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1629989879, "permalink": "/r/SuicideWatch/comments/pc172z/im_trying_so_hard_but_why/", "nsfw": false, "first_save": 1635428016.32161, "replies_charged": false}