{"id": "t5_2qpzs_t3_8ph9zq", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "First off, this is going to be a long post.\nI want to preface this:\nI am writing to you guys, and to multiple reddits to get some help and advice on a situation I was involved in tonight (7 July, 1800 EST) about someone who may or may not be suicidal but definitely needs help. Most other options are unavailable right now. I hope I am posting in the right place and if I'm not, please tell me and point me in the right direction. I am just seeking advice on possible routes to take tomorrow and I will be getting professional help.\n\nLet me start by saying I'm in the military, but the person I am writing for isn't. I live on base in barracks and less than five minutes away across the street is a DFAC (dining facility to feed those in the barracks). I normally get my dinner there and head back to my room to eat, nothing special, quick trip in and out. The DFAC is staffed by contractors rather than other military personnel and they are always friendly, despite having rather long days as they feed the base. I always smile and thank the servers for the food. \nFor many of them, you can tell English isn't their first language, but I don't have any problems with communication as I request my food. There is one older lady (40s or 50s, I suck at guessing age) who right up until tonight has been very nice, but sometimes it's a bit hard to understand her, so I usually ask and use my hands to request which food I want. \nSparing unnecessary details, I get my food, she seems normal. She's talking about something and I can't quite understand her, so I just say the usual \"yeah, uh-huh, etc;\" However, when she hands me my food to go she says something to me with a smile on her face and I think I hear \"I want to die\" but it doesn't process in my head. I say the usual \"yeah\" with a smile, thank her and take my food to the register. \n\nThe entire time I'm thinking about what I thought I heard and as I set my food down, I tell the cashier that I'll be right back and head back to the lady. I ask her what she said, the last thing she said to me. She smiles and says \"oh don't worry about it\" At this point I'm fairly certain I heard correctly the first time and I ask her if she is ok. She confirms and I ask \"are you sure?\" \nIt's at this point she starts down a slope and begins with something along the lines of \"yeah it's ok nobody listens to me anyways\" I respond telling her that I am available to talk if she needs to and she breaks down at this point. \n\nShe begins to cry and tell me something about how her husband has been dead for 10 years and she talks about her kids, though I couldn't completely understand what she was saying, so I missed some, but I was trying very hard to hear and understand everything she was telling me. She talks again about no one listening to her and something along the lines of \"I want to kill myself\" were spoken. I try to talk to her more but another employee calls for her further down the line with a question and she responds and begins doing another task. It's hard to hear or really communicate because we're talking over a food line but I tell her that I am available to talk and ask again if she's going to be ok. She responds and goes back to smiling (or trying) and I wrap up the talk by letting her know I'm available to talk if she needs to. \n\nI pay for my food but before I leave I head to another wing of the DFAC and ask one of the employees to speak with the manager. The manager shows up and I let him know that this woman seems to be having a very hard time and he agrees to speak with her.\nI head back to my rooom and try to eat my food, but this woman is on my mind the entire time and I can't stop thinking whether there's more I could/should be doing. \n\nAfter I finish my food, I decide to head back across the street and check on her. I find her and as I approach she acknowledges me, seemingly slightly better. I let her know that I am just checking on her and again ask if she is ok. She says she is ok and that her boss talked with her. I acknowledged and let her know one more time that if she needs to talk I am available.\n\nThat was just a few hours ago and I'm up later than I should be typing this because I needed to get this out before I sought other sources of help, just to get some ideas/help for whatever situation I am a part of. \nThe woman obviously made a plea for help but it was so out of the blue that it completely caught me off guard. I feel guilty concerning her comments about people not listening because I basically acknowledged her first comment with a simple \"yeah\" before taking my food and leaving. It was a good 30 seconds before I came back to ask her about it.\n\nI did what I thought I could so far and will check on her again tomorrow but I was unsure of who to involve or if I should even take further action. There is a military chaplain who will be available tomorrow but I am unsure if he can work outside of uniformed military and if I should even involve him. There are a lot of options I have, but many of them are for military support (PTSD/suicidal behavior being a common affliction) and I am unsure what I am even able to do for this woman.\n\nI hope I explained the situation well enough and am just looking for advice on possible routes to take. I will be speaking with my supervisor tomorrow as well but honestly I'm not sure how involved I am able to get considering she is a contractor and basically in an entirely different jurisdiction. Anyways, thanks for reading and sorry for the play by play, I just didn't want to leave anything out. I am heading straight to bed after posting this, as I am up rather late but will check this in the morning before I head to work and will update it as necessary tomorrow (8 July).\nThank you for your help.", "url": "https://www.reddit.com/r/SuicideWatch/comments/8ph9zq/seeking_advice_on_a_situation_involving_another/", "title": "Seeking advice on a situation involving another person.", "social_network": "reddit", "user": "AlatreonisAwesome", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1528434732, "permalink": "/r/SuicideWatch/comments/8ph9zq/seeking_advice_on_a_situation_involving_another/", "nsfw": false, "first_save": 1635425263.3611162, "replies_charged": false}