{"id": "t5_2qpzs_t3_i2qnk6", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "Hi. These aren't really any new thoughts on my account, rather me coming to the sober realization of thoughts I have dealt with for a long time. I've seen where everything is leading for some time now, and I've known that there's no way out — but I've always tried to push back, to cling to some sliver of hope, to see potential lights at the end of the tunnel. I can't do that anymore. I can see some short-term hope — but I can see very clearly how this ends in the long term. And I'm not going to survive it.\n\nI've learned a lot over the course of the past year. In many ways, in spite of total financial meltdown, covid, the protests, and the shitshow that has been 2020 overall — I am doing better this year than I was last year. I feel more hopeful now than I have in a long time. It's strange to say, but a lot of the things which have made others depressed and fearful have made me feel hopeful — seeing the society that has stomped on me for 37 years begin to unravel has made me hopeful that *maybe* something better can come from the drastic change this will no doubt bring about. It's a long shot, but there's a chance.\n\nIt's also taking some of the pressure off of me. Though I've had no income in my own right, I have somehow managed to get by this year without totally starving, and my bank and others I owe money to have been less up my butt about that money than they would have been if we weren't in worldwide crisis. Without the job that made my life hell for 13 years, which I lost at the end of October of last year, I've had some peace.\n\nBut I have been incredibly alone. I have no in-person support network. I have friends online, and they have been incredibly generous — but they are also far away, both physically and relationally. And one thing I have learned from this year is that I can't trust anybody. I've watched people I was starting to get close to pick sides over the various issues that have arisen this year, and it has driven wedges between me and them. And I've come to realize how inevitable the blow-up will be. This isn't the first time. It seems like I always outgrow people. When I grew past religion, I lost all of my religious friends, and my marriage. I lost the only relationship I've had since then because I took a stand on some issues. I let two other potential relationships slip through my fingers by being my honest self. The more I seem to grow as a person, the more alone I feel. Now I'm on the verge of losing most of my closer friends because I've taken a stand against covid conspiracy theories and rejecting social responsibility — as it stands, I can't be authentic with them, and I have to walk on eggshells around them.\n\nAnd I have a lot of personal problems. I try to grow, but I have come to realize that I do not have the resources to overcome these problems myself. I am scarcely a functional adult — I write well, I have a knack for philosophy and other obscure things, but day-to-day survival stuff I am terrible at. I'm bordering on homeless, heavily rationing my food, and I have a terrible time navigating even basic things in life to better these situations. I am not mentally or emotionally healthy — or physically for that matter, as I have been struggling with health problems since early last year. It's wearing on me. I grew up in an abusive home, I'm autistic, and the few times I reached out for help, it either did me no good, or it did me more harm than good. I have gone downhill in my functionality over the course of my adult life.\n\nI'm writing a book. I have several in the pipeline, actually. Books on philosophy. I want to get my ideas written down. I've had a positive reception from them so far. At the risk of sounding like a megalomaniac, I feel like I have something value to offer, and that it's important that I finish these books. At least the first three I've planned. I'm about halfway through one of them, and I'm impressed with how much progress I've made. I believe I can change things with these books — but not for me. It's too late for me.\n\nI know I'm going to end my life when these books are finished. I've known that in the back of my mind for a very long time. I struggled just to get to the point that I can write them, and now I'm writing them. I've contemplated ending my life for so long, craved it, gotten the point where I could not stand my own existence so often — but I have always had this mental block that inhibited me from actually doing it. I can feel that when I'm done with these books, that mental block will be gone. It's like they are a task I have to finish, and I can't leave until I'm done. I want to leave. This isn't going to get any better for me. I'm broken, and there is no reasonable prospect of fixing me, and I don't want to live like this. I want to finish my task and go. I'm not going to be able to get close to anyone again, even in the off chance that somebody is interested in it. I will never be able to trust someone again. And I will never have a better existence than what I have now, because I'm not capable of sustaining it, and no one else is going to just hand it to me. The universe keeps gaslighting me into thinking this can all change, and then it completely blows up. I keep hoping, only to have the high from those hopes smashed, and then I have to deal with the hangover of the reality that that hope isn't going to come to pass. I'm just hanging on day by day at this point, doing what I can to keep myself alive and sane, until I don't have to anymore. I'm honestly looking forward to it on some level. I want to be rid of the burden that is keeping me tied to this world. I am no good to anyone, including myself, except perhaps what I can produce in these books — and if no good comes of them, then I was never good to anyone at all, and this has all been a waste of time. And that might be how it happens. I know I'm probably deluding myself in thinking that they are something I need to finish — but, in my self-importance, I can't shake that feeling. I have to finish them, if for no other reason than to rid myself of that delusion so I can rid myself of this existence.", "url": "https://www.reddit.com/r/SuicideWatch/comments/i2qnk6/i_know_this_ends_with_me_ending_my_life_and_ive/", "title": "I know this ends with me ending my life, and I've come to terms with that.", "social_network": "reddit", "user": "thelink225", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1596429077, "permalink": "/r/SuicideWatch/comments/i2qnk6/i_know_this_ends_with_me_ending_my_life_and_ive/", "nsfw": false, "first_save": 1635426419.833735, "replies_charged": false}