{"id": "t5_2qpzs_t3_l14l0x", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "Now I’m going to hope that maybe I just haven’t noticed the toxic effects yet... The medication j took is a prescription medication I am prescribed that is fatal in even slight overdoses as it is usually used as an anesthetic before surgery and I did my research and more than 2g or 2000mg at once it considered the range for fatality and I took 6000mg or 6g, and then some temazepam (benzo sleep aide) and zopiclone (also sleeping med) in overdose but not that big of an overdose, I passed out and woke up like 3 hours later still alive obviously all though in pretty spacey, still very sedative but at a somewhat functional level, but have trouble with walking somewhat... anyways I’m about to overdose on an OTC medication now too because I looked at the clinical studies and I have enough to cause fatality even though it’s at the lower side of the spectrum for fatality rates but I’m desperate, if I survive tonight, I will be getting another prescription drug that is also fatal in overdose and I’ll get 700mg and 900mg is the suggested fatal amount so mixed with everything in my system, I’ll likely be dead by today or tomorrow. I also plan to swallow a foreign object, likely razor blades because although they typically can pass on their own without issues due to personal experience, given the medications I’ve overdosed on and the fact that they likely can cause gastric/GI bleeding and perforation, why not add to the mix and increase that chance moderately or significantly. I’ve been through too much trauma in my life to go on... I have funded mental health services, I spend all my time in inpatient psych units typically, and now I have access to 2 social workers and 1 psychiatrist whom I all trust and know care but I have too much trauma I’ve experienced and am too emotionally hurt and broken and it’s not like I can just try to save myself and go to the hospital now because the ER staff’s treatment of me is literally a major part of my recent trauma to add to it all. The things they’ve said to and about it me aren’t things you can just shake off especially when you can’t avoid them bc for mental health and medical problems related to mental health, I am constantly in the ER or psych wards where I am also treated poorly  lot of the time although it’s many the ER staff who find amusement out of the things I do to hurt myself and say things like why doesn’t she actually successfully commit suicide already and it’s not just one staff, it’s all of them gathered around to joke and have amusement about my self harm incidents and overdoses...I was supposed to have a job interview tomorrow and though maybe just maybe I could turn my life around and especially with my further commitment to more religious life and studying religion which being me great joy, it just isn’t enough... there’s too much pain and suffering and trauma. Hopefully with the last enactment of my suicide plan, I will end up successful. If not I have another plan although it would involve saying up one of my medications for a full month but then it would be an I overdose that even if I made it to the ER, that kind of overdose almost certainly isn’t survivable due to what medication it is and if I take enough it. I guess benefits to knowing about pharmacology,eh? I hope the people who see this make it through life and find hope, happiness, joy and resiliency even it it feels like the smallest amount... hold onto it. I’m a hypocrite but I’m too damaged emotionally from trauma to go on and the only people I can go to for “help” even though I know it won’t help is the mental health services in my area which have contributed significantly to my trauma because of the horrendous treatment I’ve received there, some things that I have heard the staff say are incomprehensible. Of course I wouldn’t be this way if I never experienced childhood sexual abuse and the trauma that caused in the first place. I’m too groggy, exhausted and can’t think straight enough anymore to explain my situation more but I’ve covered all the bases. I wish you all the best, you are loved,you deserve to live in this world and find that things worth living for, I’m too tired to write more of this post that is already a novel. Thank you for letting me get my most likely final words and thoughts out here before I go. Peace, love, and hope for you all. Goodbye", "url": "https://www.reddit.com/r/SuicideWatch/comments/l14l0x/i_overdosed_already_and_it_didnt_work_despite/", "title": "I overdosed already and it didn’t work despite multiple sources of clinical evidence that my method would be fatal in the dosage I took, now I’ve done more research on lethal dosage of another medication I have so likely this is the end of my final words on earth", "social_network": "reddit", "user": "ultimatelyjusthuman", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1611128928, "permalink": "/r/SuicideWatch/comments/l14l0x/i_overdosed_already_and_it_didnt_work_despite/", "nsfw": false, "first_save": 1635427394.1116836, "replies_charged": false}