{"id": "t5_2qpzs_t3_1usqtd", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "Hi...guys?\n\nI don't cut,i've been threatening with suicide from when i was 11,nobody ever takes me seriously.\n\nI've had had a boyfriend for 3 years now,he left me 3 times,part of that was because i was suicidal over our fights.I never did it because i wanted to spare my friends and family of mourning and i always found reasons to stay\n\n...But my life is getting worse.The only person that actually cared about me just broke up 4 days ago and so i lost my hope..\n\nMy family never treated me the way i begged them to treat me,they are overly harsh and aggressive sometimes.We fight a lot,but most of my fights revolve around my father.\n\nMy father is insensitive and he verbally abuses because he can't physically abuse (i'm 22) I left college and now i am back with living with my parents.\nI'm thankful they brought me back in but at the same time i can't,just can't bear it anymore\n\nI've been depressed for god knows how many years and sometimes i just sleep around 16 hours a day and i dream that things are better then they really are.I regret when i wake up.\n\nI self harm by scratching,lighters,i used to hit my head to the wall and some other things i stopped, and all because my depression manifests in physical pain and torture that i can't explain.\n\nI cry way too much,I have an eating disorder,i smoke about 2 packs of cigars a day on my asthma,i used to drink a lot,and i used to do pop prescription meds like candy,also i blame myself for everything,and i'm not alone in that,everybody blames me too,and no matter how much i avoid being the victim i can't ,and so they blame me even more for that too.\nI get panic attacks,night terrors and i cry in my sleep.\n\nI keep a guitar string noose above my bed which my boyfriend threw away one day when he was staying with me but after the breakup i picked it up again...it will come in handy one day.\n\n", "url": "https://www.reddit.com/r/SuicideWatch/comments/1usqtd/im_tortured_emotionally_so_i_self_destruct_by_any/", "title": "I'm tortured emotionally so i self destruct by any means necessary.", "social_network": "reddit", "user": "I_Sludge_Factory_I", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1389278768, "permalink": "/r/SuicideWatch/comments/1usqtd/im_tortured_emotionally_so_i_self_destruct_by_any/", "nsfw": false, "first_save": 1635422564.4987483, "replies_charged": false}