{"id": "t5_2qpzs_t3_7p3qvv", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "Not a throwaway account, but I will keep my client anonymous. I live in Canada and I work with clients virtually all over. One such client lives in the Southwestern US. She's an intelligent but high-strung woman who has a good heart and tries to do good in the world. \n\nI know she has a past history of some \"abuse\" which she has not detailed to me, and has also told me over the past year of knowing her that she has been \"assaulted\" by her current boyfriend on more than one occasion. \n\nShe's been going through tough times with her family and her SO, and over Christmas \"jokingly\" told me she hated her SO so much she wanted to buy a gun and kill him and then kill herself. \n\nI said c'mon... you're joking? And she said there was a gun shop nearby and she'd driven by and even though of how she'd do it. But then she laughed and I thought... ok... ummm odd. \n\nToday had a call with her, she told me on Saturday she sat outside the same gun shop and that she keeps thinking that it would just be so much better if she either took her own life, or killed her SO and then took her own life. She cried a bit and I said - \"Are you serious? if you're serious you NEED TO GET help and I might be obligated somehow just to report this.\"\n\n(I also make a habit of recording my client calls and clients are aware of this, so this conversation is recorded, on video)\n\nThe thing is, what do I do? I've told her to seek help, to speak to someone, I told her to contact a suicide crisis centre and get help. I told her to promise me not to do anything, to harm herself or anyone else. \n\nI don't know if she's seeking attention/creating drama or not. \n\nIf I contact the police where she lives and say I know this person made what I think is a threat to another person (her SO) and I'm wrong and she'd never do it, do I risk getting her into a huge amount of trouble? \n\nI don't know anyone who lives near her, I know she feels isolated having moved away from her family... I am unsure the right thing to do and looking for some help. \n\nSorry if I've said anything here triggering or upsetting to anyone. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/7p3qvv/worried_about_client_me_in_canada_them_in_the_us/", "title": "Worried about client (me in Canada, them in the US) Keeps talking about killing herself", "social_network": "reddit", "user": "blocdebranche", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1515463060, "permalink": "/r/SuicideWatch/comments/7p3qvv/worried_about_client_me_in_canada_them_in_the_us/", "nsfw": false, "first_save": 1635426146.2511468, "replies_charged": false}