{"id": "t5_2qpzs_t3_q88tdq", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "Yeah, back again, two nights in a row. I don't care. I just need to vent.\n\nSo I overslept for work and made up some bullshit excuse about anxiety vomiting to try and get away with it. I don't think they believed me. I wouldn't believe me either. I even said this to my family and friends to try and cover up my lies, what is wrong with me?\n\nEither way I did get to work today, in the afternoon. Stress smoked some cigarettes and went in and it was pretty uneventful. My boss was there and I do not think that she's impressed with me at all so tomorrow, when I have my probation meeting, I am 90% sure that I'll be fired. I did get an immediate interview with another music company just to be sure, but they didn't call me back when they said they would. So if my probation goes as badly as I think that it will tomorrow, I'll call them back myself. If that doesn't work out... Then I can see myself doing very, very badly.\n\nIf both of these things don't succeed, I'll go on an epic bender for the weekend to see myself out. If I'm still alive, I'm going to go to the nearest major hospital and refuse to leave until I get sectioned. Cause otherwise, I will kill myself. Funnily enough, when I got to work I was looking around for something to harm myself with because I am way too low on funds for booze/drugs. Didn't find anything anyway (thankfully?). \n\nEnded up scrounging up a fiver for some wine for tonight so chairs fuckers. Hope other people don't find me too whiny in my partially inebriated state.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q88tdq/selfsabotage_is_the_key_to_selfdestruction/", "title": "Self-Sabotage is the key to Self-Destruction.", "social_network": "reddit", "user": "SuggestionExtension9", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634245490, "permalink": "/r/SuicideWatch/comments/q88tdq/selfsabotage_is_the_key_to_selfdestruction/", "nsfw": false, "first_save": 1635422530.5165894, "replies_charged": false}