{"id": "t5_2qpzs_t3_nzgmx0", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "So basically a few years back I took 3 shots of vodka, got a crowbar broke into the family gun safe, got a 45 caliber 1911 ( beautiful gun btw but significantly heavier than any other handgun I’d held before). I managed to somehow find one bullet in the gun safe even though I couldn’t see inside. The one bullet was the last inside the box I reached into. And as much as I tried to find more my arm was bleeding trying to reach into the small bend I created with the crowbar so I gave up. I then proceeded to walk back inside and load the gun. It all gets pretty blurry but yeah somehow my dumbass held the gun to my head and fucking missed. Yes I fucking missed lol like point blank, I think it could have been my subconscious like pulling it away or I don’t even know. I shouldn’t have drank and I think I would have done a better job. My parents did not wake up from this I was 16 at the time and so I scrambled back to the safe to find another bullet but I was hysterical and there was no way I was doing anything so I managed to put the gun back but when I went back inside to look at the bullet hole it hit my parents painting. I was so fucking scared so I did research on repairing glass in paintings but it was too late to try to do that and I was so scared so I gave up and told my dad. He didn’t say much but I have ruined him by doing that and I see the lasting effects of my actions(excess drinking, staying up past 3am) so I regret that every day he ended up just laying in bed with me till I fell asleep. When I woke up I went outside and my parents told me not to which was weird for me. But I went outside anyway and 2 minutes later there were two cop cars(I have nothing against cops) but I wasn’t gonna go willingly so I ran and hid for like 2 hours until this big cop(250 lbs) came around a corner and saw me and tackled me and then put me in handcuffs I then was sat in the car in the heat for many hours and then got taken to the hospital, the cop ended up being my school cop which caused many problems for me in school. He would bring it up every time I saw him. But I got taken to a mental hospital where I didn’t eat or drink for 2 days after the 4th day I went out side and long story short I made 3 friends and got to leave eventually. But I didn’t feel any different after leaving if anything having met all of those other suicidal people that were my age did not help at all. One of them is now dead, she was shot and her death highly publicized by the news, it was officer involved so there was video of her dying. After all of this I was put on probation for a year due to my crime for firing a weapon indoors. And now for the first time since then I have to go to court for jury duty and all the feeling of being in the courtroom is coming back. And I just am having an awful goddamn week and wanted to vent. I just want the sweet release of death but am unable because I have seen the effects on those around me. If I had succeeded I would have had no note and everyone would have been so confused so if I ever give it another good attempt I will do better to inform those around me. Anyways thanks forrrrr reading. I hope you day is going better than mine. But hey it’s one step at a time, and in time I hope my feelings  will change.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nzgmx0/i_fucked_up/", "title": "I fucked up", "social_network": "reddit", "user": "Creative_Bad4974", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1623652776, "permalink": "/r/SuicideWatch/comments/nzgmx0/i_fucked_up/", "nsfw": true, "first_save": 1635422311.0509558, "replies_charged": false}