{"id": "t5_2qpzs_t3_pyrwpi", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I’ve been in and out of two hospitals in the past year, basically everything that has happened to me in the last year has caused me major life changes. I got rid of toxic friends and I was lonely the friends I managed to have left all went away to college or they’re still in town we just never reach out. The only person I talk to is my childhood friend and I talk to her every day. I had a boyfriend for the first time that wasn’t over the Internet. It was such a happy moment in my life. He was very mentally ill like I am so we were very unhealthy and codependent on one another he had trouble with drug abuse and suicide attempts. He overdosed at my house and almost died I had to drive him to the hospital at 2:00 AM and wait in a car for him for 8 hours. But that’s just a general idea of his drug abuse. Anyways he went to a mental hospital for a length of 4 months in that time period he cheated on me numerous times. And my best friend found him on a dating profile because apparently once he got out he didn’t say a word to me and just made a new dating profile. My spirit broke at that moment and I was closest to suicide I had ever been before. I ended up getting admitted to a mental hospital as well and stayed for a week I made impressive progress and during that time I met another guy who treats me so well we are currently in a relationship but it’s got to the point where he has work and school every day and we almost never get to talk around this period of my life my dad also got remarried and moved away so now I live with my sister and her husband the only thing that genuinely makes me happy now is vaping or sleeping. I’m starting to wonder at this point if I really should just offing myself I know my pain would be inflicted on everyone around me but I can’t take this anymore. My dad has completely given up on trying to help me with my depression and still thinks I’m choosing to be gay. My boyfriend and I barely talk anymore I know he still loves me and he promised never to give up on us but today I asked if he could make some room to call me today and he sent me a paragraph about how stressed he is I felt so bad and I just feel like such a burden in his life. I’m still lingering on the thought of suicide but I’m indecisive in the moment. Nothing makes me happy anymore all I do is sit in my bed and cry or watch TikTok. And I work full time as well which even that doesn’t distract me from intrusive thoughts. I’m not sure what I’ll end up doing I guess I just needed to rant about this.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pyrwpi/should_i_end_it_all/", "title": "Should I end it all?", "social_network": "reddit", "user": "Lavorai", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1633032919, "permalink": "/r/SuicideWatch/comments/pyrwpi/should_i_end_it_all/", "nsfw": false, "first_save": 1635426612.1704292, "replies_charged": false}