{"id": "t5_2qpzs_t3_n0otqd", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I’ve felt pretty fine in this week and last week except my suicidal urges are still really strong. I’ve gone out more, picked up a new hobby, and even started cooking again. But I’ve also had a few moments where I really had to stop myself from going into the kitchen to grab something sharp to just end my life. \n\nI talked to my therapist about this last week, and she seemed skeptical in a way that really bothered me. Almost like she thinks I’m lying or exaggerating my feelings. She just seemed annoyed and suggested I go to inpatient. She said if I didn’t, they’d stop treating me as a way to “push me” to go to inpatient. \n\nInpatient place called me to get an evaluation appointment setup. I declined, and they said they’d have to tell my therapist. I expected a call from my therapist but never got one, an they’re still sending me links for virtual group therapy.\n\nSo now I’m avoiding inpatient, avoiding group therapy, and my urges are up and I haven’t told anyone. Luckily, my family knows I’m suicidal and are closely watching me. But fucking hell, this is all so frusturating. I know I should tell them but because my mood is better, they also think the urges are gone and I’m scared to say anything.", "url": "https://www.reddit.com/r/SuicideWatch/comments/n0otqd/need_advice_mood_is_better_but_suicidal_urges_are/", "title": "[Need advice] Mood is better, but suicidal urges are worse. My therapist says inpatient is the next step. I avoided it all, and now I’m stuck.", "social_network": "reddit", "user": "Sparabic17", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1619643998, "permalink": "/r/SuicideWatch/comments/n0otqd/need_advice_mood_is_better_but_suicidal_urges_are/", "nsfw": false, "first_save": 1635427619.1494937, "replies_charged": false}