{"id": "t5_2qpzs_t3_q53g3j", "request": ["5f7c2841-3f43-4682-8126-88825da57933", "f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "In the US, when you go to the doctor they assess for risk. 1) ask if you have thoughts of suicide- if the answer is yes that’s not enough to commit you involuntarily. 2) ask if you have a plan, if you do, you’re committed within hours. Why? Because if they don’t commit you, it’s a liability that falls back on the hospital/facility. \n\nI’d say I’m an attractive female, 20 years old, I’m a nurse. I have interests and hobbies. I don’t think I’m boring, however I do have a hard time connecting with people and I’ve always been that way. I’ve never had a single friend, just acquaintances. I don’t have any family aside from a mother I’m pretty estranged to- a lot of trauma there. On the outside looking at me as an individual you’d think nothings wrong with me- however when looking at the big picture; combine mental illness with a painful amount of trauma and complete isolation it’s a recipe for depression. \n\nI was diagnosed with major depressive disorder when I was 14. I’ve always had a little rain cloud hovering over me and some days it was worse than others. Around 16 I started having thoughts about killing myself. I’d think about how I would do it, what I would say in my note, what would happen afterwards. Hope is actually really hard to kill, and even when you think you have none left there’s still a fighting flame- I always wondered what success would look like for me, what a family would look like for me, I always wondered if I would ever get better. \n\nThey think the time to act is when you have a plan, if you’ve ever had a thought about suicide you of course have a plan to go with it. And it’s not about whether you have an intention to carry out that plan- because the reality is the intention isn’t there until you’re pushed far enough, just once. If you went to the hospital and said you wanted to kill yourself and had a plan that was the point you’d need to be admitted and they’d think the time to intervene was NOW. But that’s not really the case. When you think you want to kill your self is really the calm before the real storm hits. The time that you need immediate intervention is when that plan and want to kill your self turns into the idea of your suicide, note I said your suicide and not just suicide or the thought of suicide, it begins to permeate your mind. You think about it on the way to work, sitting at home, at school, when showering. In fact, you have to consciously put the thought out of your mind because it scares you, it’s scary to continuously play out your death like a movie in your brain and constantly fight that impulse. I wish I could have talked honestly about this before it got this bad without the fear of being locked away. I could have saved myself. I plan on hanging my self in the nature reserve close by my apartment. I have my notes written, no date set- but weirdly enough I have an outfit picked out. It’s like my final show, my last trick.\n\nMy worst fear is not being successful and ending up  a vegetable, paralyzed from the neck down, etc. The vision I have in my head for myself is gruesome because the job has to be completely done. I feel like I’m rotting from the inside out and don’t know how much time I have left. The flame is gone.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q53g3j/when_you_cant_talk_honestly_about_suicide_youre/", "title": "When you can’t talk honestly about suicide, you’re putting the gun in their hand.", "social_network": "reddit", "user": "silenceirl", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 260, "down_vote": 0, "creation": 1633851393, "permalink": "/r/SuicideWatch/comments/q53g3j/when_you_cant_talk_honestly_about_suicide_youre/", "nsfw": true, "first_save": 1635421084.4547029, "replies_charged": false}