{"id": "t5_2qpzs_t3_p4nmcp", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "My mother and brother love me so much, I feel so guilty every time I see the worry on their faces. She asks me if I'll be okay every time she leaves the house. She asks if I'm eating and taking my meds. I feel like I've failed her, she's such a good mother and deserved so much better than me. I'm 28 and useless, depressed and terrified of people I can barely function on my own. My life hasn't been easy but whose has? I'm just so tired and dread the thought of this being the rest of my life. As much as I want it death isn't an option because I'd destroy my family, I can't do that to them. It's horrible to say this but it feels like a burden, not being able to free myself because of what I'd do to them.\n\nI'm in the calmest time of my life and I feel the worst. I've yet to find a councelor or therapist that understands, but it's probably just me. I'm trying every day but the desire to go never leaves. I asked the nurse I'm seeing to please send me psychologist recommendations and she forgot to do it. She just increases my doses and sends me on my way.\n\nI want to be better for the few people I love. They say to practice self compassion and treat myself the way I'd treat a loved one, but I'm not any of them. They're wonderful and worthy of life. I just exist.\n\nI'm in the only healthy relationship I've had in my life but I've never met him in person. With how things are going I don't know if I ever will. He says I'm the kindest person he's ever known, it would be nice to believe him. \n\nI want to be able to walk the streets alone. To drive. To travel alone. To shop alone. To meet and make friends. To be normal. I want to want to live.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p4nmcp/im_loved/", "title": "I'm loved", "social_network": "reddit", "user": "Zozombly", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1629005066, "permalink": "/r/SuicideWatch/comments/p4nmcp/im_loved/", "nsfw": false, "first_save": 1635422999.603947, "replies_charged": false}