{"id": "t5_2qpzs_t3_n2r0gb", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "Turns out 8 year olds can comprehend the idea of wanting to die. \n\nIt's the same old story. Lonely kid who didn't fit in, and who didn't get the support she wanted or needed at home. I felt invisible and yearned for affection. I wanted to be famous simply for the adoration. \n\nTwelve years later, and I still think about suicide every day. \n\nI am just sad. I have this darkness that have imprinted upon me, and I can't seem to shake it. A sad soul, with a melancholy so profound it'll haunt me even after death if there's an afterlife. I never cry, despite the gnawing ache in my chest begging me to kill myself just to escape it. No matter the meds, therapy or any of my vices, the sadness stays. \n\nI have a good life, you know. My family supports me financially. I got into law school. I live in the utpoia that is Norway. It is 12 years since I was 8, and I now have little siblings who adore me and love me and shower me in affection, two cats whom I'd live for, and I have a few bright spots in my life. \n\nBut I'm still that kid. And I am so, so tired. I feel like a defunct whack-a-mole. I try ro beat my problems away, without them ever disappearing entirely, and another one pops up. And another, and another. A never ending emotional roller-coaster, which leaves me feeling dizzy and exhausted.\n\nI don't know what I have. Therapists have had their guesses, ranging from severe depression to aspergers. I guess I'm a mix of a lot. I definitely have OCD, and I definitely feel depressed. I suspect I have bipolar 2, but to be honest, I can't muster the energy to get a diagnosis. I just ride out my emotional swings, going from \"I want to die\" to \"I want to buy an apartment I can't afford\".\n\nLogically I know that I am loved and wanted. Emotionally I know that I love my cats and want to watch the next episode of my favourite TV show. Yet, I cannot stop flirting with fatal daydreams, and I wish I could just do it already. Maybe I will someday. Or maybe I'll graduate from law school, find a wife, adopt a few cats. I don't know. \n\nGuess I just wanted to vent. Apologies for the melodramatic language of my post. English ain't my first language.", "url": "https://www.reddit.com/r/SuicideWatch/comments/n2r0gb/the_first_time_i_wanted_to_kill_myself_i_was_8/", "title": "The first time I wanted to kill myself, I was 8.", "social_network": "reddit", "user": "maggiesbell", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 36, "down_vote": 0, "creation": 1619901818, "permalink": "/r/SuicideWatch/comments/n2r0gb/the_first_time_i_wanted_to_kill_myself_i_was_8/", "nsfw": false, "first_save": 1635427506.2576919, "replies_charged": false}