{"id": "t5_2qpzs_t3_eyfong", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "I always see the discussions about wether being trans is legit or not, if trans people should be treated like equals, or if people should try to \"cure\" them, since they can't reproduce or whatever.\n\nWhat's the point of living like this? How am I supposed to live a normal life, if I can't even have any agency over myself? I'll have to take hormones for the rest of my life, just to simulate the body that I should have been born with. And even then, I'm a biological outcast.\n\n\"Trannies, deluded gays&lesbians, confused teens, mentally ill something something.\"\n\nAnd it seems like the general view of those who aren't transphobes is the more or less scientific version of  \"idk, let the weirdos be weird.\" There's a whole thread where people discuss wether or not being trans is a mental illness, and they dissect it like some sort of asylum study. I feel so dehumanized and worthless.\n\nI just wanted to have a nice, and relatively normal live. But now I can't even have a nice and normal body, something that most people don't even have to take into account, ever.\n\nJust thinking that like 90% of the population won't ever have to worry about having to adjust their gender, and how they will never be ridiculed or avoided for it makes me want to just kill myself. They get their bodies, they get to be accepted as regular people, not as \"that trans person.\" They don't have to fight for that acceptance, at least. They won't be studied and questioned, thrown together with \"amputation dysphoric people\", because **there just has to be something wrong with them**.\n\nThis isn't worth it. It just isn't. I can't do this. I want to be the kind of person that can exist without having to worry about how my body functions, or how other's perceive it. I don't want to be a minority that people either actively hate, or not give a (scientific) shit about.\n\nIf anyone here thinks that being trans is just a dumb choice someone makes, then I envy you for being able to live a life that detatched from the issue. But I also think that it's unfair, since so many trans people have to feel worse because of this worldview.\n\n&#x200B;\n\nEdit: Basically, fuck transphobes. Because they inhibit me from living my life as a regular person. Which I apparently am not even allowed to do, due to my \"trans status\", as if being trans wasn't just a rare, but natural occurence, no, it's a whole fucking political and medical debacle, isn't it?", "url": "https://www.reddit.com/r/SuicideWatch/comments/eyfong/if_cis_people_are_the_ones_who_decide_wether_my/", "title": "If cis people are the ones who decide wether my gender identity is actually a mental illness or not, then I don't want to live anymore.", "social_network": "reddit", "user": "spiritshacklebob", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 29, "down_vote": 0, "creation": 1580770411, "permalink": "/r/SuicideWatch/comments/eyfong/if_cis_people_are_the_ones_who_decide_wether_my/", "nsfw": false, "first_save": 1635426418.010068, "replies_charged": false}