{"id": "t5_2qpzs_t3_q0dgew", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "The pain, trauma, hallucinations and constant, debilitating paranoia & psychosis have proven to be much more than I can handle.\n\nThis isn't merely some rash, spur of the moment overreaction to a minor problem. But rather a well and understood solution to a life where every waking moment is an endless dive down lower and deeper into despair and complete mental, psychological and spiritual anguish.\n\nI've been at my limit for almost two whole years now, and after careful consideration of my total array of options going forward, I've decided that meeting a swift and peaceful end is the most agreeable, rather than continuing my slow burn, losing parts of myself that I'll never regain, on a horrible crawl to my inevitable and likely awful demise.\n\nI'm making the conscious decision to end things before I lose what little remaining sense I have left, and before I lose any more of my personality. I'll extinguish my short, sad life whilst I'm still me, whilst I'm still the one piloting the ship, whilst my soul has the currently dwindling strength to hold onto the steering wheel for just a bit longer.\n\nMy decision has been made, I can no longer be talked out of going through with my plan. I always desired, ever since I was little that I'd go out on my own terms, that'd I'd be the one to extinguish the weak, flickering flame of my soul, and this is the last chance I'll ever have to do so before I'm past the point of no return and I lose the fraction of the sanity and reason that I once had.\n\nIt was a short life, one marked by an endless spiral into utter despair. But I want to make it known. Though sad, short and bewildering, I did exist. I was alive. I had a life and I lived it. Sure, I didn't accomplish very much, but I did exist, even for just a moment in geological time, a blip, a flicker that ended as quickly as it began. But no matter the shortness of the time I existed for, I did live, and did exist as a human being.\n\n\nAnd with that staked claim, I end this post. At the current moment I'm still alive, but my date of expiry is fast approaching, and I have just enough time to tie off any loose ends before I die. Set up a will, and make my final wishes known and to be met once my soul moves on and this relatively young body becomes a lifeless shell decaying in the ground somewhere, fertilising the soil for plants to take root in.\n\nMy final day of life will be my Birthday. \nNovember 12th, 2021. And I'll finally join all the people who have gone ahead of me. It'll be my time soon enough.\n\nThank you so much for taking the time to read this. ❤️\n\nー Jade Belvedere", "url": "https://www.reddit.com/r/SuicideWatch/comments/q0dgew/ive_made_a_decision_after_multiple_months_of/", "title": "I've made a decision, after multiple months of deliberation and soul searching, I have chosen to end my suffering. I'll finish off my short, horrible life while I'm still me. While I'm still able to.", "social_network": "reddit", "user": "Jadeisthecolourgreen", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1633248168, "permalink": "/r/SuicideWatch/comments/q0dgew/ive_made_a_decision_after_multiple_months_of/", "nsfw": false, "first_save": 1635425168.7293606, "replies_charged": false}