{"id": "t5_2qpzs_t3_cgkp5i", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I don't know how to begin this, where it began or why.   \n\n\nI've become a broken recorder, blinded to the truth of reality. Last night I had mental collapse, I let a relationship tear me asunder and somehow became the \"stalker/creep/pathetic\" guy. My continue frustration at my regret of not living life with this women whom I known for 17 years has driven the final nail in my thoughts. I feel constantly angry, irritated at my loved ones, unable to empathize or even direct an outwardly emotions of understanding. I get that it's alot of my own mental issue, this women tried for years to work through it with me. But I kept repeating, kept being stuck in the past, unable to present a future/present with her.   \n\n\nI became just like my older brother in this relationship, I shadowed him in life yet pathetically. Never completed college, never followed my own intuition, lost in the idea's of my own wants. I can't feel positive/direct positivity towards myself. All I do is just give to others in that outlook but when I look at myself I am ashamed. I spent the last 8 years slowly devolving, become \"incel\" as the internet folk state it. All because of my frustrations at this relationship, all because of my frustrations at doing the same mental emotional vomiting over and over again. Unable to find what it is I want to pursue in life, unable to feel genuine about connections with people. I've became a frenemy, spiteful, jealous, ungrateful towards my friends. My family.   \n\n\nI don't see myself as adult, I don't see myself as a creative anymore. I just have an underlying urge to die, my pessimistic thoughts have won in stopping me from living life. I'm 27 now, but I look at all the wasted time gaming, masturbating to porn, spending stupid money on cam girls because I was hurt/lonely by this person.   \nI spent so much time smoking weed, running away from things in life and not living on my own. I regret not taking college seriously, I regret not sharing that relationship and all this emotional vomiting I've done to her. ;\\_\\_; it really hurt, being told to grow up, to get away and never contact her or her family again. The threats hurt and it furthers me just saying why should I live? Also this person was states away, it was a internet relationship formed when we both 10/11 years old fucking via gaiaonline. Later down the road she had told me getting raped in the woods because she thought it was me, I felt guilty because I had lied and created a \"online persona of myself\" which I later removed the veil of that. But I had such a strong urge of guilt I got hit by a truck, hoping it would had ended me. Years later, I don't know how but things seemed improved, only till I graduated high school. There I waited a year in 2019 to go to her for first time, she was 18 and I was 19. I guess her getting raped in the woods was a lie? (2 years later she had posted an article about waiting to give her virginity till marriage, stating relatable) So I guess more lies from her side, but I had went out there that first time and was genuinely happy. Joyous to be spending time with this person, to love this person. But she put up a front, about her gay ex boyfriend and another love interest. I....didn't want to be an asshole and just have sex with her for the sake of it but that's what she wanted. In order to know I was committed but I was committed for so long. That's when it began, the slow downfall. I had went back home because at the time, I was doing community college, band, making a video game business with my brother while trying to take care of things at home. I recognized I failed at trying to bring her together in my community. I have rejugated many times to her about my failure to make her feel important/wanted in this relationship. I had put up a front after feeling rejected, saying lets just be friends, I'm going to be a manslut\\*to my hand sadly\\* and yea. Years passed, she ended up doing part of our discussed dream together in living downtown waterfront portland. I was crushed further, made even to feel even more pathetic as she was becoming a \"ethical slut\". I could keep going into this fucked up connection with this person, about all the small naunces and my \"perspective\".   \n\n\nBut regardless this has been a critical thing in bringing me down, every time I would be brimming with a optimistic point of view she would be able to get within my head and fuck me up real good. And it's my own fault for being weak, for not being able to follow my own decisions.  \n\n\nI am just tired of living at this point, I don't have the spark to make art, music. I am just constantly vying/seeking a relationship as my main point of \"woe\" and then that just triggers me to look at porn all day.  \n\n\nI've done alot, I tried alot. Shit I even drove half of the united states by myself, listening to Neitzsche Thus Spoke Zarathustra, Joseph Campbells Netflix deal and somehow things still didn't work out. \\*On the way back I almost died, I had crashed into a big wild deer, bigger than normal white tail forgot the breed while driving through the mountains of Wyoming. She was pissed when I left, I could tell by many small factors. From my indecision about moving out there, to being like I don't want to go to school its too much money and being told by her lesbian house owner that I reminder her too much of her first ex-husband.   \n\n\nAnyways I've been digesting lots of self help videos, been trying to find a way to iterate to myself I'm not a terrible person, not a \"stalker\" for trying to send out a message to her since she wouldn't talk to me anymore.  \nAnd yeaaaa it was cringe. I sent her message on facebook, linkend, snapchat, steam, email, hangouts. I even contacted the guy she had asked to be engaged with \\* i don't know whats going with that, forgot to mention she also is polyramous now\\*. Even that lesbian who disliked.   \n\n\nCurrently I've been living with my brother for last seems like 2 years in our old grandparents house. He's going to be turning 40 soon and...I just can't live life like he does. He's gone through alot and I feel that his need to have me be his best friend has taxed all energy out of me. I don't want to blame my family, especially my older brother who is just generally trying to be helpful and say hey you just gotta love yourself and things for yourself. But I am also tired of his shut in behavior, of looking at ourselves and feeling pathetic.  \n\n\nI think my biggest reason I want to die besides just the multitude of regret, pathetic feelings, negative thoughts, pessimism is to get my dysfunctional family moving. But they already are, I just can't see it in the deep part of mind.  \n\n\nI just think constantly this world would be better without me, that I'm just a problematic, stupid, unintelligent, monkey brained human. A cuck'd beta male. I hate myself, I can't find any hope in seeing a brighter future for my friends and family. It's like the my death will instigate the overdrive of them to living life fuller. And only reason I really side with that is I had a friend who committed suicide while back, then his father followed suit. Very loving people, sure he was a hard core romantic \\* he killed himself over a girl\\* but after his death several really close people started to get their shit together. Isn't that sad? And it bcame their carrying torch, a further reasoning to meaning in their life.  \n\n\nAnd I guess that's how I see it, I see my life as a big sparklingly ignition coil that will rev the hell out of this vehicle that my friends/family are riding in.   \n\n\nGod dammit I know I got things to look forward to in the future, I have a planned trip to japan coming soon. I've been trying to learn Wing Chun, にほご, fix up my grandparents house so my brother can live in it. Find a new path in life but.... I am just unable to be happy, to allow myself feel happy anymore. I just want to end it all so badly. I lived in such a dreamlike state with that women, \\*yes I was deep into mental delusions with her\\* and the fact that 8 years had passed since our first meeting. And the second, third, fourth just didn't pan out well. That she doesn't express herself to me like I try with her, that it's become a grow up, wait a couple years \"kid\" and get back to me when you fixed yourself.  \n\n\nI.....just...am....so....emotional in all  ways not thought plausible. AAAAAAAAAAAAAAAAAGGGGGGGGGGGGGGHHHHHHHHHHHH  \n\n\nAnd I guess thats how I see it, I see my life as a big sparklingly ignition coil that will rev the hell out of this vehicle that my friends/family are riding in.   \n society. All things I use to enjoy are no longer able to give me joy, my home town I've grown to hate and regret staying here. I look at all my decisions, all my behaviors, trying to appease so many people and not myself and for what. All my endeavors bare no fruit, all my wants, all my drives had gone to the ground. And I just truly want to die. And I've been repeating this tale, this broken record of myself for years. God fuck it all. God fuck it all.", "url": "https://www.reddit.com/r/SuicideWatch/comments/cgkp5i/broken_recorder/", "title": "Broken Recorder", "social_network": "reddit", "user": "MasterAsia69", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1563837711, "permalink": "/r/SuicideWatch/comments/cgkp5i/broken_recorder/", "nsfw": false, "first_save": 1635426683.2319036, "replies_charged": false}