{"id": "t5_2qpzs_t3_e1si7q", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Hi everyone. \n\nI just don't know what to do. \nI've, to my earliest memories always wanted to kill myself. Somewhere around the age of 3.\nWhen I was 21, I made a confused, drunk attempt.\nFrom childhood on I've had Fibromyalgia. Including severe depression, anxiety, fatigue and pain. Not just occasionally but every day except 3 days when I was 19 and was in ICU for anaphylactic shock. \nI just got told that I'm going to be fired. Again.\nI because of my depression etc. always had a hard time keeping a job. \nBecause of that I have always had less than optimal income. I get by but just barely. \nI have nothing to show for my life. \nI'm so tired of life.\nSo tired of having to fight. \nSo tired of hurting. \nSo tired of making problems for others.\nExhausted and empty.\nLaying in bed yet again crying out of frustration, anger and desperate to die. \nI for reasons that are too long to get into here only have a brother as family.  \nHurting him is the only reason I haven't done it. \nWhy can't I go one way or the other? \nEither be a better person or have the guts to end my life. Being in this position is absolute torture. It's tearing me apart. Again. \nI'm 41 now. Somehow. When I was a kid I swore that I'd never live this long. Unless I was wrong about that too and this really is hell. I guess it might be.  I can't imagine any more pain than this. I'm having to hold my arm over my mouth to keep from screaming.  I can't stop crying. I just want it all to end. The pain, all the pain. Physical, mental, emotional. It's all that I can see and feel. Everything that I've ever done wrong. Why can't I just do it? \nI don't care about conciquences. Religion says that I might burn in hell. Science says that there's just a nothing. How badly I wish I was in that nothing. No chance for happiness is such a small price to pay to not have to have this pain anymore. Even a eternal fire if you believe that...it simply couldn't be any worse than this, so why not put myself out of misery? Why can't I manage to do it?", "url": "https://www.reddit.com/r/SuicideWatch/comments/e1si7q/at_the_end_of_a_longer_rope_than_i_had_ever/", "title": "At the end of a longer rope than I had ever planned.", "social_network": "reddit", "user": "human2quats", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1574741361, "permalink": "/r/SuicideWatch/comments/e1si7q/at_the_end_of_a_longer_rope_than_i_had_ever/", "nsfw": false, "first_save": 1635422328.2906482, "replies_charged": false}