{"id": "t5_2qpzs_t3_lawwu3", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "For those who don't know, hypogonadism is when someone's body doesn't make enough (or any at all) testosterone. This has a range of effects on your body and it also affects your body in different ways depending on what age it starts.\n\nAs a boy going through puberty, the lack of testosterone caused me to develop breasts (severe gynecomastia) & completely inhibited any growth of my penis. Instead of getting testosterone shots ASAP my doctor decided to wait and see if I was just a late bloomer...\n\nI'm 26 now and only now getting hormone replacement therapy in the form of weekly injections of testosterone & hCG but it's too little to late: my body is permanently child like and there are no medical solutions to reverse the physical affects. (I should probably also include that this stunted muscle, height and body hair growth)\n\nWhen this first started happening to me the worst part was having to attend school every day as a male with boobs. The humiliation and anxiety I felt every day trapped in classrooms full of people who almost daily tried to rip my shirt off just to laugh at me is painful to think about even right now. I'd have to hide in the gym locker rooms as much as possible, I had to hide from everyone and everybody because even my own brothers would occasionally bring a group of friends just to humiliate me so even my \"escape\" from all this (locked myself in my room and played video games to distract myself as much as possible) I wasn't safe even in my own home. I completely stopped playing basketball even though I was so passionate about it back then. Still to this day I don't feel comfortable going outside to do shit as simple as go to the grocery store.\n\nThe worst part is that I still have this on my chest (literally) even at the age of 26. That means I've been living in a legitimate hell locked inside hiding from life its self for 14 years now. There are surgeries to remove the breast tissue and attempt to make my chest look as normal as possible and I actually did get this surgery when I was 13. Problem is my hormonal issue that caused this was never resolved, and my body simply kept making more breast tissue because I was still developing. Obviously considering how much this affects me I abandoned any idea of going to college or starting a career because whether or not it makes me a bitch I cannot handle being trapped like I was when I was younger. So I have absolutely no way to throw down $10k on a surgery that would at least resolve that part of my humiliation.\n\nBut even with all that said the thing that makes me want to kill myself the most is having a permanent childs penis and having nothing I can do about it. There are no surgeries like the gynecomastia surgery, there are no pills or methods to legitimately help resolve this problem. I already know what most peoples first reaction to hearing about my penis problem is because I've been told countless times it \"doesn't matter\". To me it does matter. I will never feel comfortable in my own skin, hell I don't even feel comfortable feeling like I'm my own gender.\n\nMost people don't pay attention to this but when you're someone like me it's hard to escape this as it's literally everywhere - small dicks are brutally made fun of even in a society that pushes against body shaming. Frequently attached to the worst people of our society - I've seen people attach the notion that criminals and even mass shooters are the way they are because they have a small dick. Almost daily I come across people making fun of me indirectly in the most random places even on reddit, and even though gaming is my \"escape\" the communities inside them and sometimes the actual games themselves (borderlands 3 for example) don't forget to remind me what a humiliating life I actually have all the time. There were times where my own friends would make a joke about it and I had to sit there laughing with them, at my own self, just to not raise suspicion. Shit's depressing.\n\nBefore anyone does give me the cliche responses or offers to tell me it doesn't matter because of x y z, I beg you to think of how insecure & scared men are about their penis sizes even if they are entirely normal. They are SCARED by the idea that they might actually have a small penis, imagine actually living with one. I can't wear even the smallest condoms the FDA approves for sale, they just slip right off, and every partner (3 total) I've ever had we could not get penetrative sex to work at all. So my advise is to start treating my medical issue like a medical issue, instead of trying to be a hero through words when my experiences contradict every fucking thing said to me so far. I'm even infertile because of this disease which is just another thing happily taken away from me to ever experience.\n\nAll this being said I'm beyond hopeless. I've been trying to get help through any means possible for years now. 4 ER trips, 1 inpatient hospital visit and a suicide attempt later I am still no where closer to getting help even after seeing therapists, psychiatrists, endocrinoligists, urologists. All of them  are so obviously unprepared to deal with my situation that it's been abundantly clear that there is a massive lack of understanding or knowledge when it comes to treating people like me.\n\nI don't have it in me to keep living like this, the humiliating and anxiety driven experience my life has been so far isn't going to end unless I end it. I tried as much as I could because I love the friends I have and the two girls in my life (gf & mom) love me so much but at some point I think even they will understand because they see what this is doing to me. I just hate the idea that this is going to hurt them so this post is my last effort to get the help I always needed I guess but if I'm being real with myself this is probably my suicide note or a way to get my story out there to people so this never happens to anyone ever again.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lawwu3/hypogonadism_and_the_doctors_who_forgot_to_treat/", "title": "Hypogonadism (and the doctors who \"forgot\" to treat me early enough) is the reason I've had such a miserable and humiliating life.", "social_network": "reddit", "user": "curiousfox25", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 530, "down_vote": 0, "creation": 1612276707, "permalink": "/r/SuicideWatch/comments/lawwu3/hypogonadism_and_the_doctors_who_forgot_to_treat/", "nsfw": false, "first_save": 1635426411.7400367, "replies_charged": false}