{"id": "t5_2qpzs_t3_qcx1l6", "request": ["69686dc6-5bf4-41ab-864a-231bdd6f02c9", "5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "I’d been suicidal all summer but I found happiness inside myself and started improving. I became confident and I radiated pure joy as I got into a good university to study law and got A+ in my A Levels. I finally made friends for the first time in my life and I even got a crush on a boy for the first time and I think he liked me back. I got along well with my family and I was doing well in my law class.\n\nToday though I went to class with a water bottle in my bag and it spilt all over my laptop. I can’t access my notes and my computer is ruined. I have all my assessments next week which I now can’t do because I don’t have my notes. My computer company says it won’t be fixed until Christmas which means without my notes my law grades will fall so bad that I’ll have to leave the school. My Mum is furious with me and everyone else is embarrassed for me. My crush was so embarrassed he left me to try fix my computer alone. The water leaked out of my bag all over the classroom floor as I was walking and it made a big mess and people recorded me and now I’m typing this in my room all alone as I plan to take my life tomorrow. I’m going to a cliff and it just sucks because I don’t want to die but now I’m going to end up failing law school and being a disappointment to myself. It’s going to hurt too plus it’s my birthday next Saturday. I wanted to be a successful lawyer and move to the US so I could start a family and be happy since Orlando is where I feel most happy instead of London. I just finished my note.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qcx1l6/18_f_i_finally_got_over_being_suicidal_and_i_was/", "title": "18 F I finally got over being suicidal and I was doing well but I fucked up and now I have to kill myself anyways", "social_network": "reddit", "user": "trynaimprove12", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634837735, "permalink": "/r/SuicideWatch/comments/qcx1l6/18_f_i_finally_got_over_being_suicidal_and_i_was/", "nsfw": false, "first_save": 1635425313.4816914, "replies_charged": false}