{"id": "t5_2qpzs_t3_iqx21l", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "My life has been a mess since the person I loved the most for 8 years left me for another woman 10 years ago, just few days before our marriage. We used to have differences but in the end he made me look like that I deserved it and turned our common friends against me. I didn’t care about the friends anyway since losing him was so painful that I couldn’t think of anyone else. I am not a very talkative person and can’t explain my feelings well. But i can write them down well i think so. He never understood what it did to me, it seemed like he didn’t think I loved him that much, i was devastated, i begged him but he didn’t listen. Very hardly i moved on, my parents supported me and convinced me to and I tried to find love elsewhere but perhaps I wasn’t ready, I got into a long distance relationship and I thought i knew him well but I married to a narcissistic person, I know I did a mistake but what was done was done, little did I know he had escaped from rehab after being a nelbin addict (he used to steal them from the hospital he worked in) and he started doing it again 2 weeks into marriage, when I discovered the syringes, we had a huge fight and he started beating me, i was too afraid to being called a divorcee as it is a taboo thing in my culture, i sucked it up for 6 months and every time we fought, he used to assault me, i involved his parents at sometime but we lived at quite a distance and he would straight up lie to them and accuse me of accusing him of being an addict instead, i beared so much perhaps and ultimately decided to expose him and leave him which I did both by calling in the authorities and get his blood tested and filing for divorce but I was more broken more than ever. Like a shard stuck in my heart forever, it doesn’t bleed out and kills me instantly but hurts forever and ever. Years later I found someone else and i thought he is the right guy, we dated for 3 years and we are married now, but days before marriage he lost his job, it’s been 2 years since he has no job and he is frustrated and he is not good with me anymore, he lashes it out all at me, he expects me to work outside and then come back and work at home while he watches Netflix all day. I have refused to work at home straight up since he barely moves his ass whole day and it is now coming to being abusive, blaming me for everything while I am the only one trying hard. Why is my life so messed up and extremely hard? I have been thinking of suicide since 10 years but I feel like now is the time. No body cares about me, Yes i know NOONE, I don’t have much friends since nobody is friends with a depressed loner. I just want to end my life. All i wanted was a happy family with kids. That’s all i wanted from life and everyone has it, and I have been trying so hard for it and life tells me to f* off, i want to tell life to f* off. I want this to end and die in peace!!!", "url": "https://www.reddit.com/r/SuicideWatch/comments/iqx21l/my_life_is_a_mess/", "title": "My life is a mess", "social_network": "reddit", "user": "DrLiaraTsonii", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1599851253, "permalink": "/r/SuicideWatch/comments/iqx21l/my_life_is_a_mess/", "nsfw": false, "first_save": 1635428495.2524004, "replies_charged": false}