{"id": "t5_2qpzs_t3_oro6t6", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "Just some thoughts - not really in any specific format, but just processing things as they came to my mind. So just a stream of consciousness. I write a lot that I will never share with anyone I know because I hardly talk to anyone anymore due to my anxiety and feelings of shame. I have not been ok for a very long time, and this does really feel like the end of things. \n\n&#x200B;\n\nI wish I would have done more acting\n\nI wish I would have gotten decent at drawing or art in general\n\nI wish I wasn’t so constrained in my action and expression because of how I thought people would look at me\n\nI wish I had learned to play an instrument\n\nI wish I could have made it abundantly clear how important the people in my life meant to me\n\nI wish I had reached out when I was afraid\n\nI wish I hadn’t disconnected from everything because of my shame\n\nI wish I did better by the people I care for\n\nI wish I could start over\n\nBecause there is nothing left\n\nEmptiness and loneliness pervade my every waking hour\n\nThe loneliness is killing me, but I’m afraid to speak\n\nI can no longer think, and happiness is rare\n\nTalking with people frees me sometimes, but I don’t know how to talk with people\n\nI wish it hadn’t gone this far\n\nI wish I were more\n\nI wish I were not so broken\n\nAll I wanted was to make people feel better\n\nAnd I’m just a burden on everyone’s life\n\nSo maybe it’s best I continue to hide\n\nAnd Disappear\n\nIt’s all I’m good at\n\nAnd I’m ashamed\n\nHope has left me\n\nI have escaped into distraction, and almost all that I do I can’t feel joy\n\nIt’s only you that helped me get through the day,\n\nI don’t know why\n\nI don’t know how\n\nAnd I feel so ashamed, and I cry about it\n\nAnd sometimes I can’t cry, because I feel so numb and disconnected\n\nBut not for lack of wanting\n\nThis life wasn’t meant for me,\n\nAnd I hope you’ll understand that I care\n\nI care so much\n\nBut it’s all dust slipping through my hands\n\nBut you are everything\n\nSo as long as you’re happy…\n\nI can only hope that you’re happy\n\nBecause I care so much\n\nIt’s the only feeling I have left sometimes\n\nday to day just hoping I can do anything to help me pass the time\n\nI mourn that elapsed time\n\nThere was nothing I could ever do\n\nThings don’t always just get better\n\nAnd I’m so very afraid\n\nSo lost\n\nSo ashamed", "url": "https://www.reddit.com/r/SuicideWatch/comments/oro6t6/a_collection_of_thoughts_on_an_empty_day/", "title": "A collection of thoughts on an empty day", "social_network": "reddit", "user": "TheDeadCry", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1627261387, "permalink": "/r/SuicideWatch/comments/oro6t6/a_collection_of_thoughts_on_an_empty_day/", "nsfw": false, "first_save": 1635426797.4197621, "replies_charged": false}