{"id": "t5_2qpzs_t3_ch13rb", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "My whole life has been pretty shit so far. Sold Meth and Cocaine for my brother at 11 years old. Got caught twice, went to Juvey for a total of 3.5 years. 2 days after I got out one of the old bloods I rolled with wanted to throw a rave for me cuz I got out, my little brother wanted to come. My stupid ass let him. Cryps rolled up on the party, as he was running away he got hit by a semi, I went looking for him. found him still in the street. no one else in sight, leg was about 5 feet away from his body, and he was just laying in a puddle of blood. flash forward to 17 year old me. One of my older brothers OD'd on Crystal. flash forward one more year, I'm the first in my family to graduate high school, I then join the military. I'm 19 now.... Last week my brother was diagnosed with brain cancer, and was declared brain dead yesterday, so they harvested his organs..\n\nEver since my little brother died, I've had night terrors every single time I try to sleep. so usually I stay up for 2-3 days before my body crashes for 4 hours then I wake up sweating and repeat the process of refusing to sleep. My Family blames me for the first two deaths, and so far no one has said anything about the third death. I've lost respect from my peers, and family, because I don't want to tell anyone about it in fear that I'll become some how more irrelevant in my job than I already am, and I've lost all three of my brothers.\n\nI've never been in a mental hole this deep before in my life, and I really can't see myself coming out of it.\n\nthe next time we have a four day weekend for labor day, that's when I'm planning on saying fuck it....\n\n&#x200B;\n\nEdit: Just need an answer. google or any of the other search engines aren't giving me shit.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ch13rb/someone_please_tell_me_how_to_effectively_commit/", "title": "someone please tell me how to effectively commit suicide so that there's not a chance of survival", "social_network": "reddit", "user": "mr-mcfckup", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1563929251, "permalink": "/r/SuicideWatch/comments/ch13rb/someone_please_tell_me_how_to_effectively_commit/", "nsfw": false, "first_save": 1635426276.076773, "replies_charged": false}