{"id": "t5_2qpzs_t3_kzm970", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I just need a space to get this off my chest. Because tonight i almost did something really bad, and I don't think it was worth it . I'm not advocating doing this at all and want to stress that, i just want to be honest with my thought process i had during this, even if it isn't good. \n\nYou might not wanna read this if you're as impulsive as i am. \n\nAnyways here it goes : \n\n\n\nI went to the beach around sunset and I've had this thought in my mind about what it would be like to just walk into the ocean and never come out. \nI know the obvious consequences would be i would drown and/or get hypothermia in the process. And it likely wouldn't be a painless death either. But I guess the idea of it almost seems \" poetic\" ( or just straight up stupid ). \nThis isn't new however, I've had thoughts of killing myself in numerous ways, arguing over which method was the best. \n\nTo be honest, most of the time my mind fixates of blood loss, Even if it isn't instant by any means. I can't do anything \" instant\" like shooting myself, the idea of failing and ending up  disabled or suffering alive with brain trauma is not at all appealing to me. I also am scared of leaving a mess behind for anyone who would have the misfortune of finding me if I was successful. \nBut lately the idea of just going out into the sea and freezing myself in the water, or drowning has been stuck on my mind. \nWhen I was a practicing pagan I used to give thanks to the ocean Everytime i went. And believed for a time i owed the ocean my thanks. So the thought has been stuck in my mind to \" give myself back\". \nI'm now agnostic, and don't know if anything I used to believe is true or not, i gave up hope a long time ago , but my mind still fixated on that thought regardless. That maybe i was wrong to leave that path and that maybe I'll have to give myself back to the earth to pay for all that ive taken up just by being alive. Who knows, maybe dying this way just seemed good for the time. \n\nI stayed until after dark after walking for a bit. There is an area with a bunch of high rocks to a cliff that sometimes can be accessed but is hard to see at night. I did start to climb some of them regardless. Mostly joggers and photographers go there just to take scenic pictures , idk how many suicidal people to there, but I was possibly about to get the first to die right there. \nIt never seemed very rocky right underneath, my thought was If I'm far enough from the coast, nobody can try and stop me, and if I jumped I could just go for it, and not chicken out.  \nThe cliff leads far out into the ocean in comparison to the main stretch of beach , it takes some skill and patience to climb up it cause the rocks are sturdy, but have gaps in-between them. \n\n so I was getting prepared to walk up and mentally prepared myself. I even decided to try filming myself talking to see if I wanted to publish a goodbye video, or just leave something in my phone for people who might care to watch. But eventually someone started coming towards my direction and saw me. I'm guessing someone going on an evening walk. \n\nI got scared , climbed down and ran. I probably looked so guilty but I kept running anyways. Eventually i slowed down , maybe saw 2 kids running around playing on the beach, and walked until I was in the dead middle of this beach, alone. \n\nIt was low tide, so I was far off from where any beach houses were, it felt infinite. I couldn't see anything except water. Everything was dim.outside except for one street light very far away marking where I got into the beach originally. \n\nAnd I kinda just fixated on the waves until I decided i was going to just scrap the idea of the cliffs, and just walk out into the water then and there. I was essentially alone , i didn't see that person I thought I saw, they likely weren't walking the whole stretch of beach , so why not here? \n\nI looked around again to make sure I was alone and started walking into the direction of the water. And just kept walking. \nI thought to myself that if I needed to speed up the process that I had a knife on me that I could use, which ironically I brought for self defense. So I took it out and had it in hand \n\nEventually the water rushed in my boots were submerged , socks were socked and my calves were as well. \n\nA few thoughts went into my head\n\n\" Should I post something to say goodbye?\"  And shrugged it off as not important. \n\n\" What about x\" \nNo, if they cared about me they wouldnt of dropped me when I was suicidal and needed support \n\n\nAnd A lot of other thoughts , i was still sure. \n\nBut I had one thought that was like this: \n\n\" What about what's coming up in a few days? Don't you wanna be there?\" \n\nI almost forgot about something very important and cool happening in a few days , so i stopped walking and thought it over for a bit. \nI realized that maybe , maybe holding out for a bit longer wouldn't hurt. The last thing I want is to possibly turn my life around in a few days, at that point it just didn't seem 100% worth it to kill myself. \n\nEventually i just sighed and turned around and walked out the water. \n\nI'd be embarrassed if someone saw me in the water, i eventually started walking fast to just get the hell off that beach before i changed my mind. I pulled my mask up just to hide my face in shame. \n\nMy feet felt fine once I was in the car with the heat on, and ended up taking a warm bath when I got home. So I'm feeling okay. I guess just sad? Confused? Why NOW did i almost give in, not even an explanation to anyone who might be curious as to why I wanted to leave. \n\nI hope that things work out for me in a few days, I've spent so long being suicidal, self harming and overall just hating myself for even being alive, i hope to have something to live for , soon. \nI hope that maybe i am right about this , that things might change for the better soon . \n\nAnyways if you've read this, thank you. \nI just want to confess this, because I don't plan on telling anyone in my life about this. It would only take away the opportunities I might have if I am sent to some mental health facility and just make things worse. \n\nI feel okay now. Even after what I was going to do. Might take a few days away from the beach too while I'm at it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kzm970/i_almost_did_it_i_didnt_even_think_it_through/", "title": "I almost did it - i didn't even think it through either", "social_network": "reddit", "user": "throwthrowaway3737", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 29, "down_vote": 0, "creation": 1610941112, "permalink": "/r/SuicideWatch/comments/kzm970/i_almost_did_it_i_didnt_even_think_it_through/", "nsfw": false, "first_save": 1635428127.5914688, "replies_charged": false}