{"id": "t5_2qpzs_t3_prqfr4", "request": ["56f46b9a-59d4-48f0-aed3-4247ea68706d"], "text": "In Secondary 4 taking my N-Levels and my emb3 is gonna have some failing subjects. I am flunking my French because I never learned anything cause I have no fucking idea and don't care. My Geog/SS is risky. Mainly is my Art exam in a few days and I never did anything for it. So I am going to have my emb3 with 2 subjects with U grade and possibly another.\n\nI think that having a course is a must and requirements for the ones I see need my emb3 to pass. I just want to be able to live normally and not feel that much pain. I'm afraid of my parents finding it out that I failed subjects that lowered my emb3 to so low.\n\nI am not a hard-worker and I am super lazy so I only have myself to blame.\n\nI expect that people will just say some kind words but I don't really need that. I have family and friends I will go to for that. I just don't think for the future.\n\nI just want to know where I can go to. A job or a course that do not require all emb3 to pass. I expect my other subjects to be okay because I only feel down because of my Art. I take physics fyi.\n\nI do not need words of encouragement. Just want to find a job that fits what I said.\n\nI am a selfish brat too lazy to do their own work and asks people on reddit to helo find him a job. Pathetic right?\n\nMy tito died recently. Money problems. Family in SG and the Philippines are feeling sad.\n\nI do not want to go sec5 and a job is a job. I like playing games and solving puzzles. I know finding a course that I like is best but I really do not have much of a preference than that.\n\nI don't know if sending this message here is the best idea. Well maybe the internet could helo", "url": "https://www.reddit.com/r/SuicideWatch/comments/prqfr4/feeling_depressed_and_thinking_of_committing/", "title": "Feeling depressed and thinking of committing suicide", "social_network": "reddit", "user": "-ISEN_", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1632125706, "permalink": "/r/SuicideWatch/comments/prqfr4/feeling_depressed_and_thinking_of_committing/", "nsfw": false, "first_save": 1635428326.3902612, "replies_charged": false}