{"id": "t5_2qpzs_t3_pvxgce", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "I'm a former musician. A very good one. This time last year I was set to finally achieve some life-long dreams, including scoring a game that I'm sure many Redditors will be all over when it's released. I had to step away from all of that, as well as a normal life in general, when I developed hyperacusis, a condition that causes my ears to be incredibly sensitive and easy to cause further damage. Long story short, doctors were of no help, and I now live a very quiet life, devoid of most social gatherings, out of fear that my ears will become even more sensitive and painful. To be clear, I don't have much in the way of permanent hearing loss. It's a strange condition.\n\nAfter suffering my second episode of Sudden Hearing Loss earlier this year, I was, as is usual for SHL, put on a high dose of corticosteroids. This had happened once before a few years prior, and after the dose pack was up, I was left with a wheat allergy. At the time I thought nothing of the coincidence. Earlier this year, though, after finishing the dose pack (thankfully returning my hearing for a second time), I was left with dozens of food allergies. Due to this happening twice now, I began to suspect the connection of corticosteroids causing food allergies for me.\n\nI can't find any scientific literature that supports that, and when asking doctors, all but one have said that's totally impossible. The other one (the best doctor of the bunch, I should add) said \"oh sure, that's totally possible!\" Considering the other doctors often didn't even understand what I was saying (stating things like \"maybe the steroids were covering up your allergies that already existed,\" ignoring the fact that I was only on the steroids for a week).\n\nRegardless, the development of now over 30 proven food allergies has all but ruined my life. I can't even begin to describe how difficult this is.\n\nHowever: I'm currently in a situation I've dreaded all year. Last night I suffered an acoustic trauma in my right ear. Upon waking up, that ear is basically non-functional -- near-deaf and the little that it does hear is totally distorted. So, I have a choice to make.\n\nDo I take the corticosteroids and try to save my ear, and risk developing so many food allergies that I literally can no longer eat? That's how close to the edge I am -- how few foods I have left.\n\nOr do I opt to leave it all alone and not take the steroids? Best case, my ear gets better on its own (highly unlikely), and I'm still left with an ever-increasing list of food allergies. I have testing in a few days to confirm, but my best guess is that I'm up to 70-some foods now.\n\nFor anyone who's in the know about this stuff, no, I don't have a Mast Cell Activation Disease. I'm a complete mystery, absolutely no one knows what's happening.\n\nThis is an absolutely insane situation to be in. I didn't know that life could be this shitty, in such a particular, interlocking, *personal* way. I'm doomed to a life of little to no social interaction, am essentially home-bound, can be kicked over the edge by what is to everyone else a totally normal sound that doesn't even phase their ears. I'm rapidly losing nutritional options, can't even meal prep that much due to the fact that food gains in histamine count as it sits in the fridge. I can't go anywhere even remotely loud, which is where all social interaction really happens. My ability to work is gone, not to mention that I've lost the only career I ever wanted and worked for my entire life, and was within inches of achieving what I set out to do. \n\nI'm not at risk for killing myself, but I am considering looking into medically assisted suicide options. This is not a life, it's a prison. I lived in fear for a year, only to have my worst fears confirmed.\n\nI sit here typing this with hearing protection on because even my laptop keys are too loud.\n\nI don't want to die, but I can't live like this anymore. This is the strangest, most vile form of torture anyone could have ever devised for me, a lover of music, food, and people.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pvxgce/life_devolving_into_a_catch22_from_hell_honestly/", "title": "Life devolving into a Catch-22 from hell. Honestly not seeing a way out at this point.", "social_network": "reddit", "user": "ASGTR12", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1632674648, "permalink": "/r/SuicideWatch/comments/pvxgce/life_devolving_into_a_catch22_from_hell_honestly/", "nsfw": false, "first_save": 1635427954.2565513, "replies_charged": false}