{"id": "t5_2qpzs_t3_oiy1b8", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "My life is going nowhere. I lost half the money I had been saving up over the past year from my full-time job in the stock market cause I'm stupid. I absolutely despise my work because all it's done is show me the lack of compassion in the caregiving world and how little I am valued as an employee. I've let it ruin me mentally because I'm scared of quitting and trying to find a new one, lacking any self confidence that I'd be able to do anything else. I've isolated myself and no longer have any friends or anyone I talk to outside of my family. I can't form close relationships and everyday am depressed, anxious, and stressed out about my life, the world, and the current state of my mind. I've failed at nearly everything I tried, and now have to work a minimum wage job because I blew the opportunity to graduate college and find a good career. I put off living life and becoming an adult. I have no skills, hobbies, or interests. I am awkward and can't express myself emotionally or intimately with another person, so I am a virgin who hasn't been in an adult relationship. I see no reason not to smoke, eat and drink myself to death. I'm such a fuck up and have shattered my hopes and dreams and ability to have any sense of normalcy for my life. The best option is to get the gun, go out in the forest, and shoot myself in the head before falling off a cliff. Everything about life is just so absurd and I hate it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oiy1b8/seriously_thinking_about_buying_a_gun_online/", "title": "Seriously thinking about buying a gun online.", "social_network": "reddit", "user": "monkeydogboy", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1626116731, "permalink": "/r/SuicideWatch/comments/oiy1b8/seriously_thinking_about_buying_a_gun_online/", "nsfw": false, "first_save": 1635423012.6148925, "replies_charged": false}