{"id": "t5_2qpzs_t3_kcdjek", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Does anybody else have suicide/ self harm dreams frequently?? I’d say the majority of my dreams consist of drugs and me being back in high school for some weird reason. Idk what that really means lol but my highschool dreams are literally nightmares lol. But anyway I’ll also have frequent dreams of suicide attempts or even me telling the people around me that I want to or am going to commit suicide. In some of them I’ll do a lot of drugs or take pills. But for the most part I end up finding a gun somehow. But then the gun will never fire when I want it to. And even in non suicidal dreams if I’m trying to shoot at someone else it either won’t fire or it will but it won’t ever effect the person I shot or maybe never hits them idk. Kinda like how you have dreams of fighting someone and your arms turn into noodles and your punches are landing so soft and you can’t run or move properly lol those are the most frustrating. But I just woke up from a dream where I was wanting to commit suicide and I told my sister I was going to and she started cussing me out and then I stole her gun. But then I woke up before I could try to do it. I always wonder what my dreams mean. The suicide ones and the highschool nightmare ones. I was in my highschool in this same dream I just had. But my highschool looked different and the people there weren’t people I went to school with. But in my head I knew what it was supposed to be. Any thoughts? Do you all have these kind of dreams or anything crazy, scary or weird? Tell me. I think dreams can mean more than we think.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kcdjek/suicide_dreams/", "title": "Suicide dreams?", "social_network": "reddit", "user": "randaniicole", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1607877058, "permalink": "/r/SuicideWatch/comments/kcdjek/suicide_dreams/", "nsfw": false, "first_save": 1635422317.401094, "replies_charged": false}