{"id": "t5_2qpzs_t3_khh6wg", "request": ["9cb7ef4e-af9d-4403-b84a-be5dd3f5e75c", "e79a79ca-6f5c-44ca-b1e4-309a4afa83c2"], "text": "\nWhen I was young I had an experience that made me lose all of my passion for life. I went from someone who read books, was popular at school etc. to someone who sat on the computer all day, grappling with anxiety among other as-of-then un-diagnosed issues. \n\n&nbsp;\n\nAfter about a year of dealing with extreme anxiety, I set some goals for myself and created this version of myself based on my hopes for my future and started a journey to improved my mental health with the help of some of the people around me. I hoped that I would spend less time on the internet. I hoped that I would hang out with my friends more often and take more initiative in that regard. I hoped that I wouldn’t feel lonely anymore.\n\n&nbsp;\n\nIt took me seven years, but I eventually became someone I could begin to be proud of:\n\n&nbsp;\n\nHe was outgoing.\n\n&nbsp;\n\nHe was responsible.\n\n&nbsp;\n\nHe was funny.\n\n&nbsp;\n\nHe knew what he wanted out of life.\n\n&nbsp;\n\nThe pandemic reduced him to nothing.\t\n\n&nbsp;\n\nThese days I only have a vague memory of the person I used to be before the pandemic. In January I started regularly hanging out with one of my friends from high school after us having not spoken for a while. One day in February we were talking and he mentioned that there was a new disease that was like SARS that was spreading around China. ‘I hope that gets under control like it did in the past,’ I thought to myself.\n\n&nbsp;\n\nOver the next few weeks, the things that gave my life purpose, specifically hanging out with friends, going for walks in crowded places, going to concerts, became inaccessible to me. The things that gave my life meaning could have me and my family taking our last breaths. I began to feel suicidal on a regular basis for the first time since my very first mental health crisis all those years ago.\n\n&nbsp;\n\nA couple months later, I typed the word “Suicide” into Google News. I read a story of a business owner with a wife and kids who crashed his airplane into a mountain at the start of the pandemic. They interviewed his wife and she talked about how he was feeling unsure about the future of his business, as well as the fact that he was upset at not being able to see his friends. I couldn’t help but think ‘Wow. That sounds nice,' I thought. 'Just get it over with at the start of the pandemic before you start to experience life really falling apart. A nice view of the mountains, and then that’s it.’\n\n&nbsp;\n\nI also read a couple articles about kids who were a little bit younger than me, who took their own lives for similar reasons; the pandemic had destroyed the lives they had as well. Reading all these articles, I couldn’t help but feel seen in a weird way. It validated my feelings that, given the state of the world, my thoughts of suicide aren’t as wrong as I was telling myself they were.\n\n&nbsp;\n\nI’m in purgatory. I lose days to suicidal thoughts stemming from the notion that I may never truly live my life again. Every-time I see a pair of friends standing six feet apart from each other outside, or a COVID-19 notice on the window of a small business, I get the immediate feeling that my best days are behind me, as are everyone else’s.\n\n&nbsp;\n\n\nThere’s lots of things that I will have to consider if I decide to make a plan to kill myself: \n\n&nbsp;\n\n\nHow my family will react. \n\n&nbsp;\n\n\nWhat will happen to me after I die.\n\n&nbsp;\n\n\nHow to minimize the possibility of survival. \n\n&nbsp;\n\n\nIf I killed myself now, everyone would understand. These are horrible times and nobody wants to live through them even if they don't want to kill themselves. But if I wait this pandemic out, my next chance to kill myself and have everybody understand will be when the climate crisis goes undoubtedly beyond the point of no return. \n\n&nbsp;\n\nAt my previous low point, during the time of my life I described at the beginning of this post, I only felt suicidal for a couple days at a time. Between April and July I had thoughts about killing myself every day at. Nowadays I’m not suicidal every day, but it comes in waves. Lately the waves have been much more powerful and I’ve felt them for much longer periods of time. Beforehand, the suicidal thoughts were just kind of running in the background, but these past couple of months have been the first time that suicide has been at the absolute forefront of my mind when the waves come. I just want these thoughts to stop. Sometimes my councillor helps. But in the end it’s hard for me know for sure whether talking to her on a semi-regular basis will truly be enough. The waves keep coming and coming and crashing harder and harder.\n\n&nbsp;\n\nI haven’t been talking to my friends very much. I’ve always hated talking to friends online. Especially now. I just have nothing to say. There is no part of our daily lives under COVID that is meaningful enough to warrant sharing besides news of COVID ravaging the earth. \"What did you eat today?\" \"Am I muted?\" “Hey did you hear about that new strain in the UK? The vaccines might not work against it!” The shallowness of the subject matter of Zoom conversations is a very prevalent reminder of the state of the world.\n\n&nbsp;\n\nThere are no emotional or moral leaders for these times. People share empty platitudes and generalizations because they cannot possibly have the perspective to guide their fellow human beings through the horror that is this point in history. There is no help. There is only commiseration via communal screaming into the void. I look around for someone who could be my guiding light but my search always leads me back to myself, and that does not bode well for me. Everybody is screaming. Some people are just better at hiding and denying it.\n\n&nbsp;\n\nI don’t know who I am anymore. There is nothing in my life to connect me with any sense of identity or meaning right now. Sometimes I cry thinking about who I used to be. The only things that have brought me joy and a sense of purpose could kill me and my family. I’m sick of being a shell of my former self. I’m sick of just getting through the week for weeks on end. I’m sick of keeping myself alive for no reason. I’m sick of living in the shadow of the life I spent years trying to build for myself. I’m sick of hoping that things will get better when they might not. This year, hope hasn’t done very much for me, or for anyone for that matter.  \n\n&nbsp;\n\nI used to go to various protests and demonstrations before COVID. I felt like groups of people assembled together could change the world. But now they're destroying it.\n\n&nbsp;\n\nSo now I suppose I just have to sit and wait for death. Or bring it upon myself.", "url": "https://www.reddit.com/r/SuicideWatch/comments/khh6wg/i_no_longer_feel_like_a_human_being/", "title": "I no longer feel like a human being.", "social_network": "reddit", "user": "throwaway2349823423", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1608556527, "permalink": "/r/SuicideWatch/comments/khh6wg/i_no_longer_feel_like_a_human_being/", "nsfw": false, "first_save": 1635425158.182803, "replies_charged": false}