{"id": "t5_2qpzs_t3_pkc13d", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "peace is required to learn anything with passion. the ability to fall in love with what your learning is what i wanted and had once.\ni picked the perfect time line, the age of information = ) but.\n\nbut i can not live forever -1. anyone can learn anything if they love it. anything can be loved. \n\npeople don’t seem like people, do you not remember how it felt as a child? did you forget what it was like to be a child? you gaved in to this world, but i still love you cause deep inside you, still lives that child, the true human.\n\nTo eat the apple and create your own world with the creators limit? \nor to live in happy land and enjoy the art of the creator who made you intrinsically love its art.\n\ni can not live forever but i live in checkpoints through books, wasn’t born a female to have a lil but more time. for the youth = ).\nwhy a girl? less human needs. more love.\n\ni have no peace anymore i can not learn anymore, the world is… gruesome and gory to those who are below. the crazy’s, the homeless and the poisoner.\ndisrespectfuls. the FAKE high and mightys ,but i still love you, your just blind. soon you too\n\nthe POLICE, the FAKE JUDGES, MONEY. ITS ALLLLL FAKE there is no law and order, i see it now, i did not believe, i refused to believe buts its true, corruption and plastics.\ndruged up doctors and therapist, moneyy ALLL moneyyy money turn up turn up\nyou keep giving in for the small feeling of the true feeling of happiness.\n\ngod has more experience and the devil learns from trial and error but he’ll get there slowly, till then he exploits gods art of music, appearance and influence. controlling you all one by one for the same reasons of god.\n\nto eat the apple or not\nmy world within his or his world.\n\nGoodbye  = P, i love you you all. we are all one mind literally. imposters everywhere, i sacrifice myself and see how it all gets inverted. don’t lose the child’s mind the true human, you’ll know how this goes too, they are all imposters. then its your turn again and again and again and again till the end and back again to the beginning have fun mes", "url": "https://www.reddit.com/r/SuicideWatch/comments/pkc13d/the_only_thing_that_was_keeping_me_going_the/", "title": "The only thing that was keeping me going, the ability to learn, read, write, draw. i was so pure, i really did once love everyone from afar", "social_network": "reddit", "user": "ZayInca2", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1631112680, "permalink": "/r/SuicideWatch/comments/pkc13d/the_only_thing_that_was_keeping_me_going_the/", "nsfw": false, "first_save": 1635428194.204133, "replies_charged": false}