{"id": "t5_2qpzs_t3_q6e67l", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd", "5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "I'm 24. I'm going through so much shit right now. So much. I will spare the details as it won't help you nor I. To skip straight to the point, I am trying to work up the nerve to end my life. I am scared of death 110%. But if I have control over it, it is a tad better. \n\nPretty much I lost the love of my life due to me accidentally running her off after 8 years... high school sweethearts. She was my best friend.  I'm alone now. When I was pre teen and early teens I was suicidal. I didn't want to live. Then she came along and just made me like.... the happiest man alive. \n\nPoint is... I was going through shit before her, lots of childhood trauma and abuse. Lots of current issues. Paranoia, bi polar disorder, numerous anxieties, severe depressive disorder etc. So to say the least I am broken and she isn't the cause of suicide. Straw that broke the camel's back though if you will. \n\nI worry about my grandparents(82&83). I don't wanna put them in the grave. Hell I don't wanna leave them I love them so much but my hurt is too much. Then I worry about my biggest fan(my 8 year old -9 in January  niece). She's just like me. I'm her idol. Kids nowadays are so fixated on electronics... I showed her things outdoors. Taught her how to catch crawdads in the creek, how to fish, shoot a gun, how to catch bull frogs and frogs, took her swimming in rivers and creeks, on long beautiful hikes, even walked at the school track just to bond. Sure, we did play mine craft together but I mainly showed her the outdoor fun. She looks up to me and loves me so much... so much. \n\nI have a question which was the point of this.... she's 8. That's super young. Super young. While I'm sure she'll remember me it'd probably be vaguely, right? Again I'm sure she'll love me and remember me-ish but she won't be hurting later on in life... and the memories won't be clear of me right..? Now obviously I know no one can tell me how she'll feel but I'm asking on ages. We'll say 9 since it's 3 months away. She won't remember me right? I'm just so focused on how my suicide will effect her. I don't wanna damage her as she loves me so much. But other people's feelings don't override my feelings...", "url": "https://www.reddit.com/r/SuicideWatch/comments/q6e67l/24m_suicidal_i_have_a_question_kinda_long/", "title": "24M.... suicidal... I have a question. kinda long", "social_network": "reddit", "user": "jelloJesse", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1634013222, "permalink": "/r/SuicideWatch/comments/q6e67l/24m_suicidal_i_have_a_question_kinda_long/", "nsfw": false, "first_save": 1635428087.9458387, "replies_charged": false}