{"id": "t5_2qpzs_t3_bn49ug", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "Standing in the rain chain-smoking with tears running down my face and ready for my heart to stop beating. I'm so utterly miserable, hopeless and filled with bitterness towards the world and hatred for myself. I am a 30 year old dude  and I am a total failure loser who is addicted to crystal methamphetamine and I still live at home with my parents because of my clinical depression, OCD and antisocial personality. I have always been an extremely self-destructive hedonistic person who is also very selfish. I don't want to hurt anyone anymore. I'm sick of being a worthless piece of trash and an utter disappointment to everyone I care about. I'm such a burden.   \n\n\nI went through a break-up with a girlfriend of nine years that tore me apart emotionally and my last girlfriend who I was deeply in love with now hates my guts and thinks I am the scum of the earth because of my hospitalization for my drug addiction and the fact that I can't hold down a job. I am scum. I'm a burden on everyone and just cause pain to the people I love. She is pregnant with my child and hasn't talked to me in months. She is going to give the kid up for adoption and says I will never be able to see my child cause I would be an unfit father. She is right. The pregnancy was an accident. I swore to myself I'd never have children because I have always been afraid I would pass down my poisonous genetics and tortured mind to my child. I feel like such a sadist. I never wanted this to happen. I want my child to know I am sorry. I am sorry your father was such wretched piece of garbage.  \n\n\nI was sober for three months but I relapsed like I always do because I'm so weak and pathetic. I don't have the strength to keep struggling through this cursed nightmare that is my existence. I can't find any joy or strength within myself and the only thing I'm good at is slowly killing myself. My brain is plagued and my spirit is deformed. I am beyond redemption and I know I will never be happy. My death-drive is on hyper-drive and I know I most likely will not survive into the year 2020.   \n\n\nI really wish that I could function as a healthy and responsible functioning adult in this society. I wish I could be a strong man for my ex-girlfriend and our child and provide for them. I wish we could get married and I could be her knight in shining armor and we could raise our child. I wish so badly for the whole fairy-tale happily ever after ending for myself but that is not in the cards for me. I can't take much more of the cruelty and despair of this world. I am marching into an apocalyptic abyss of oblivion that seems to be my only possible destiny.   \n\n\nWithin the next couple of months I will take my 12-gauge shotgun and walk deep into the forest at night. I will sit down against the tree and place in the woods where I use to drink vodka with my ex-girlfriend and we would make love under the stars. I'll remember how during those magical nights looking into her crystalline blue eyes I was actually happy and content for once in my tormented life. So hopefully I can have a bittersweet smile on my face before I work up the courage to shove the barrel of the shotgun in my mouth and pull the trigger. Then my pain will end and I will disappear forever. I'm sorry for all the tears and sorrow I've caused. I tried to be a good person but I failed and this is my judgment and punishment.  \n\n\nTo my son or daughter I am so sorry I couldn't be there for you. I will be dead and gone before you are born. I'm sorry but this is the best course of action for everyone. I hope the rich Catholic family who is adopting you gives you the infinite love, warmth and happiness you deserve. They seem like very good, kind and caring people. Better than I could ever dream to be. I love you. I love you so much for what that is worth.   \n\n\n In my suicide note I will tell my parents I love them and how they were great parents and it's not their fault. I'll ask them to take care of my German shepherd and to spread my ashes in my favorite forest. Time for another cigarette.    \n\n\nFlowers and Filth and Wine  \n\n\nThe Death of Dreams shall be a Beautiful End", "url": "https://www.reddit.com/r/SuicideWatch/comments/bn49ug/close_to_the_bitter_end/", "title": "Close to the Bitter End", "social_network": "reddit", "user": "MisanthropicLycan", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1557524794, "permalink": "/r/SuicideWatch/comments/bn49ug/close_to_the_bitter_end/", "nsfw": false, "first_save": 1635426248.0817065, "replies_charged": false}