{"id": "t5_2qpzs_t3_pd0z9i", "request": ["fa52eed9-681b-4f68-b3d1-78c0eec9a3d2"], "text": "In a way I'm actually relieved. Genuinely. Sure the fear of death gets in the way but honestly with that aside suicide seems perfect.\n\nI have nobody. My entire life was just pain that slowly got worse with time. I made a deal with myself when I was 13 that, before my 18th birthday, I'd be dead. Lo and behold, I'm 18, and as a matter of fact my life *did* get worse. It's actually comical how it managed to do that.\n\nI don't really have anyone to miss. People are adults. They don't care about you. Good for them given I don't care about them either. I don't care about anyone. We're all just blobs of carbon and hydrogen zooming across the celestial abomination we call our galaxy.\n\nThe human race is a joke. The very fabric of our history was paved with nothing apart from suffering in the name of the elite that managed to change every decade. I'm proud of *nothing*.\n\nI'm exhausted of thinking about how obscene our hellworld is. We are all a bunch of pathetic, disgusting monkeys who fight eachother on a whim just so our pathetic sense of greed and power gets satiated at the expense of other lives. I can't fucking wait to escape. I can't wait to be free of this disgusting mortal body that has kept me chained here ever since I was fucking born.\n\nMy body will be a pile of pulp and blood sitting on the floor. When I escape from it I'll look down and laugh. It's so hideous, disgusting, and putrid that even the owner of it would mock it's very existence.\n\nCan't fuckin wait. I'm gonna get a noose, wrap it around my neck like a boa constrictor giving me my final hug, and forever finish my biological processes as I shut down and never wake up again. I won't be found, and I'll be forgotten. I have nobody from my \"childhood\" to remember me, and the only few friends I have would probably be relieved of my death at the very least.\n\nI won't need to force feed substances down my abomination of an organism just so I can continue the existence I absolutely fucking **loathe**. I don't need to worry about caring for it. I don't need to worry about *anything*. I'll just go into a permanent state of absolute bliss and freedom, without the slow agonizing decay my body will force me through before I reach there.\n\nThat's all. Let's hope I'm not much of a coward.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pd0z9i/school_starts_in_around_3_days_my_birthday_comes/", "title": "School starts in around 3 days. My birthday comes in 2 months. I'll more than likely be dead by then.", "social_network": "reddit", "user": "Kwame_Brown_GOAT", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1630115703, "permalink": "/r/SuicideWatch/comments/pd0z9i/school_starts_in_around_3_days_my_birthday_comes/", "nsfw": false, "first_save": 1635425483.3130527, "replies_charged": false}