{"id": "t5_2qpzs_t3_mmil0k", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "Sorry I’m a mess right now and English is not my native language. As a matter of fact, I was going to jump off from the balcony of my apartment 10 minutes ago, the thought still linger tho and I will try to do it again anytime soon. I wonder how my life has come to this point. Ever since I was a child, I never have any hobby or interest in anything whatsoever. I have great parents, a great family that love me in their own ways and I will never blame them for whatever is going to happen. The thing is that I was always alone for many reasons, the only thing I learn growing up is to give up. I’ve given up on anything and everything I’ve ever cared for, and so it became my habit, I’ve never wanted anything for myself nor have I ever fought for anything in my entire existence. That was before she showed up. The only light I can see in the darkness that I called life. The only time I’ve ever felt genuinely happy. The one time I actually gathered enough strength to push myself to fight for the only thing I’ve treasured in the entire time I’ve been living. And to be honest it felt great, actually it felt so magical that I kept telling myself that I will never ever going back to my former hollow, void of life self. It was a miracle. She pulled me back from whatever pile of shit I was in. She taught me to respect myself. She gave me a purpose and motivation. She was all that I needed to be a fully functional person. But my only miracle ended a few days ago. I pushed her away. I couldn’t be a strong man for her. I let my emotion got the better part of me and that wasn’t the only time but it was the last straw. She still love me but it just too much for her. I can’t take it anymore, to be honest I’m scared, not of death but of having to go back to the old me. At this point death is a ticket to my freedom. I feel pain every second of living, I’m broken mentally and to the point that it affects me physically. I’m done. The reason I wrote this was simple for me, for a slightest hope that if she ever read this somehow, I love you T, til the last second of my life, til the last breath I take. Please don’t blame yourself for this, you’re just an unlucky person who accidentally got tangled in this life of mine. I wished we had met in a different condition, I wished I could be stronger for you. Please remember me as someone who loved you with everything he got. Goodbye for the last time.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mmil0k/i_cant_feel_anything_anymore_and_living_is_just/", "title": "I can’t feel anything anymore and living is just dragging my dead soul through life", "social_network": "reddit", "user": "xomrjay", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1617850979, "permalink": "/r/SuicideWatch/comments/mmil0k/i_cant_feel_anything_anymore_and_living_is_just/", "nsfw": false, "first_save": 1635425194.2898464, "replies_charged": false}