{"id": "t5_2qpzs_t3_ouge01", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "I am disabled from Cymbalta and Post Acute withdrawal syndrome. Don’t take antidepressants or they will make you worse. I have been suicidal my entire life but now that antidepressants gave me brain damage, heart damage, and nervous system damage i am ever more suicidal antidepressants cause suicide. By the time I found all this out it was too late. I was forced to take drugs since 17 abused in psych wards. I’m 31 now and nothing has changed only gotten worse since I have PAWS and can’t get off Cymbalta which is killing me. Theres no hope for me my heart is giving out and I’m dizzy all day every day having palpitations akathesia muscle brain fog convulsions insomnia panic attacks chest pain sweating nightmares anxiety suicidal ideation loss of appetite nausea brain zaps and I’m going to have a heart attack. I’m getting advice for it but now it’s too late I’m holding on my dose but nothing can help me now. I tried going to the hospital many times no one can help me. I’ve been in so much pain I think I am dying but I keep waking up to the same hell every day. For the past 6 months I’ve been bedridden and my mom has to take care of me. My entire life has been ruined because of Big Pharma and the psychiatric system which wants to kill us. By the time I realized it was too late. There’s no help for me now. Anyways I’m going to have to finally end it. I just need some extra courage and to get away from my family trying to watch me. I don’t have that many means and I’m scared it won’t work but I need to make sure it will work 100%. A lot of the time I’m so sick and disabled I can’t even carry it out. I hope someone will kill me or I die in my sleep because I can’t take the torture any longer and I don’t want to feel guilty for hurting my family. I’m also too disabled to do it most of the time I have a hard time even walking. Please let me die in my sleep tonight or I will have to do it myself soon.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ouge01/disabled_and_going_to_die/", "title": "Disabled and going to die", "social_network": "reddit", "user": "Damienslair", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1627632092, "permalink": "/r/SuicideWatch/comments/ouge01/disabled_and_going_to_die/", "nsfw": false, "first_save": 1635426581.607267, "replies_charged": false}