{"id": "t5_2qpzs_t3_pl0qkt", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "Hello Suicide Watch people!\n\nI think that I will make it through today but I feel like I am going to end my life sooner or later at some point! \n\nWhen it will be the time that I will do that I will write more about me and about my story to maybe get some help and hopes not to do it! \n\nBut basically, it's 7 years I live in hell! My insomnia degenerated to a deep state of depression and hopelessness that makes me completely a zombie! \n\nI took all the possible pills available, and nothing works on me, I can not sleep more than 2-3 hours a night taking a lot of shit, usually I sleep 1 hour if I go to sleep at 10pm if I go to sleep at 11 or midnight otherwise  I'll go straight! But for the past 15 days I am sleeping zero most of the nights! \n\nI can't function, I can't eat , my appetite it's more than a year that is completely suppressed, I force my self to eat, which is a struggle and still lose weight like crazy, I'm all day vomiting and with diarreah, I feel isolated and with no idea how to survive anymore! No pills are working , going to the psychologists twice a week was just blowing money away! \n\nI wonder how to keep surviving like this, I am 34 and all the doctors and hospitals I went gave up on me! \n\nI am looking for some hope, because I had an extremely beautiful life and I know that beautiful life is out there but now nothing brings me joy anymore and all I think all day long is how to kill my self because of this unbearable insomnia mainly ! \n\nThanks for your support!", "url": "https://www.reddit.com/r/SuicideWatch/comments/pl0qkt/it_will_be_not_today_but_soon/", "title": "It will be not today but soon!", "social_network": "reddit", "user": "EdwardVortigeern", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1631203455, "permalink": "/r/SuicideWatch/comments/pl0qkt/it_will_be_not_today_but_soon/", "nsfw": false, "first_save": 1635426548.232453, "replies_charged": false}