{"id": "t5_2qpzs_t3_q6g1wa", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "***There's no need to read the full thing, I basically just want some friends.***\n\nI've never really asked for help on much about this type of thing besides from a single person (that suddenly just left. Like completely dissapeared).\n\nThings are getting scary for me, like my life is at risk. Unstable family, living with Schizoaffective disorder and PTSD, and an absolutely dreadful on and off again confusing loneliness.\n\nI just want somebody to be friends with, like a best friend. I have quite a bit of friends, but none of them are really close, and I feel like someone else when I'm with them. I really want someone to talk to about anything, that can give me a little bit past the void of dread and exhaustion. \n\nI've been longing for some kind of attention, and I know I'm kinda selfish for it. I feel like my therapist has been kind of ineffective lately and I lay in bed in nights like this, at 2:16 AM, merely thinking about how much I want something to keep me from myself. \n\n*But you haven't heard the terrible part*\n--------------------------------------------------------------\n\nThe friends that I do have, the ones that I feel like I can't be myself around them, I've been getting more and more distant from them, and I've been feeling like I want to start on a new slate with different people. Not that I want to cut them off completely but I'm thinking our chemistry wasn't so compatible? Or maybe I'm just deluding myself with the false idea of what will bring me happiness.\n\n***Is this cruel?***\n\n~also~\n\nI feel like sometimes I'm the problem. I feel like I can be boring, or depressing, or maybe just in general a bore to the people I talk to. I swear the only time I feel \"happy\" is when I'm fucking horny or drunk at this point. I'm not \"numb\", I can feel happiness in the moment. It's only after the fact I reflect and think about everything. \n\n\n\n\n\nI haven't been taking my meds. I hate it, I hate it so much and I don't know why I just can't, I don't want to, I hate it. \n\nThey say it'll help me but I swear I don't fucking want it.\n\n\n\n\nOne thing I idealize is a relationship, preferably with a girl, I'm still only beginning to understand my sexuality after about 6 years. It doesn't have to be intimate, maybe it's the feeling of platonic affection that I romanticize, but I want it so bad.\n\nSo why do I reject every single person? \n\nI'm afraid. I'm afraid and I'm confused.\n\n\n\n\nI feel so scared of doing what I feel like would make me happier.\n\nDate someone? No they'll never truly love you and he heartbreak will be the thing that ends up killing you. Go outside? Nope, you'll have a panic attack. Exercise? No, you'll fall down an anorexic hole again, you'll just hate yourself and compare yourself to others. \n\n\nI took some pills a couple months ago. Wasn't the only time I've attempted suicide. I'm starting to feel like I'm at the end. I don't want to live, but I don't want to die just yet. At times like this, I can't control myself. I need a factor of stability in my life, such again the purpose of this rant, and also me again apologizing for the length.\n\n\nDoes anybody here want to maybe talk, just for a bit at least if that's fine?\n\n(Sorry for the disorder, it seems like things are all over the place, I'm just typing a lot of thoughts that are popping into my head. There's no way I can type everything, this is just the tip of the iceberg. I welcome any tips for dealing with some problems of mine, and am down to talk with anyone (co-beneficiary <3)\n\nIly, see you in a bit hopefully.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q6g1wa/coming_to_terms_with_problems_through/", "title": "coming to terms with problems through understanding them", "social_network": "reddit", "user": "Starbent", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1634020810, "permalink": "/r/SuicideWatch/comments/q6g1wa/coming_to_terms_with_problems_through/", "nsfw": false, "first_save": 1635427956.4380386, "replies_charged": false}