{"id": "t5_2qpzs_t3_q9grve", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "Hi everyone,\n\nI think I need help.\n\nI've realised that I've become a horrible person. And it just makes me sick. I don't know how to live with myself anymore.\n\nHere's the situation : I always considered myself to be a kind, polite, respectful and loving person. I have had a few romantic relationship, but nothing that impacted me really much. Last year, during the COVID shutdown, I started dating this girl that was my very good friend. We were getting along really great and I felt things I hadn't before : real love. But it didn't last after I learnt that she had seen her ex in my back (nothing happened but it hurt me). Then, one day, she proposed one of my friends to have sex with her at a party. That's when the shitstorm began. I lost trust and I stayed with her but I became kinda paranoid and it lasted long until I couldn't anymore and I told her we needed to break up. 2 weeks later, I learnt she had been seeing someone, and that she might have cheated on me.\n\nDevastated, I lived several off-sides events (I dropped out of med school, started being depressed, my house was flooded). I didn't contact her and I had blocked her temporarly. She reached out to me a few weeks later to ask me how I was.\n\n2 months later after the breakup, I'm at a bar and I see this friend who I know is also friend with my ex-lover's new boyfriend. And he tells me that he met her with his new boyfriend and that she seemed happy. This just triggered me. It lit an anger deep inside of me I didn't know I had. The idea that she was happy and I was miserable after what I went through was unbearable. I had just lived the worst period of my life and she had just moved on to somebody else. I had been/tried to be the best version of myself with her, bringing breakfast to bed every morning, helping her study, being there for her no matter the circumstances. The fact that it was over was already devastating enough because it made me realize i'll never be enough for somebody. But knowing she had moved on so fast and was happy just brought me down even more.\n\nOn an impulse, I tried to stay cool and just replied \"oh, well, you know, I slept with her two weeks ago when you guys were in Portugal\" (my friend and my ex's BF both went to Portugal with a bunch of friends). Which is total bunkers. Now, that guy told him (the ex's new BF) and they might be split up. She sent me a message saying I had to stop and blocked me. I denied doing anything, but the thing is, I did those things. I hurt her. I consciously hurt her.\n\nI didn't realize in in the moment, but that's what I intented to do deep inside of me. There's a part of me who wanted her to notice me again. To have just one thought about me. Even a bad one, but not be this non-existent person, this one person she used to hang out but then never saw again. I wanted her to be hurt like I had been hurt. To feel pain.\n\nThe thing is, she is a nice person despite her problems. She gave me love and I'm grateful for that. She is very sensitive and didn't deserve that. She has her own demons, but through that, I had seen a very beautiful person. The looks she gave me at the beggining of our relationship were the most beautiful looks I had received.\n\nSo here we are. I have become a monster and I can't live with myself anymore. How do you recover from this ? How do you get better when you've lost everything in the span of a month (house, future career, best-friend/lover) and you've turned into the worst version of yourself ? I can't see any way out but death right now. I don't know what to do.\n\nJust before she blocked me, I denied doing anything, but she knows the truth and so do I. Knowing she will never forgive me will haunt me forever, and I can't live like that.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q9grve/i_did_a_horrible_thing_and_now_i_have_very_dark/", "title": "I did a horrible thing and now I have very dark thoughts", "social_network": "reddit", "user": "Pterygoidien", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1634406199, "permalink": "/r/SuicideWatch/comments/q9grve/i_did_a_horrible_thing_and_now_i_have_very_dark/", "nsfw": false, "first_save": 1635426887.3720522, "replies_charged": false}