{"id": "t5_2qpzs_t3_qdlwau", "request": ["5f7c2841-3f43-4682-8126-88825da57933"], "text": "I haven't been able to find a job since I left a mental hospital 2 years ago. I was living with my parents and since then my girlfriend broke up with me, my father passed away, and I can tell my mother's patience with me is wearing thin. I don't have a single other person in my life except her. \n\nWhat am I supposed to do if no one is going to hire me? I have a shaky employment history to say the least. And even the times when I have found work, it is a miserable mess where I can't go a single day without embarrassing myself. I think I have social anxiety, I'm completely recluse and every interaction with any person is like a drawn out nightmare. Do I not talk at all? That's weird and people think I'm hateful. Do I talk to someone? Then I saw something weird and stupid and stumble my words, and people think I'm a dumbass and pick on me for it\n\nI thought going to find help would change something. Maybe someone could find me a job where I'm not constantly struggling to not be fired for incompetence. But nobody wanted to help me. I was kept there for two weeks straight and got to actually talk 1 on 1 with someone for a grand total of like 10 minutes. And then they treated me like I was just lazy and looking to use mental illness to get out of having to work or something. I realize I need to work to make money, I realize it \"could be worse\" and \"at least I'm not a quadriplegic\" or whatever, but that just makes me feel worse because I should be able to support myself but it's just not happening no matter what I do.\n\nIt really feels like society itself wants me to just kill myself, people can say all they want \"don't kill yourself, call this number\" or whatever but no one ever engages with what I'm saying", "url": "https://www.reddit.com/r/SuicideWatch/comments/qdlwau/unemployable_is_suicide_the_only_solution/", "title": "Unemployable - Is suicide the only solution?", "social_network": "reddit", "user": "Odd_World_6495", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 26, "down_vote": 0, "creation": 1634923816, "permalink": "/r/SuicideWatch/comments/qdlwau/unemployable_is_suicide_the_only_solution/", "nsfw": false, "first_save": 1635421091.3839831, "replies_charged": false}