{"id": "t5_2qpzs_t3_h95f4w", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "TLDR does anyone want to be an accountability partner to kms asap\n\nSo far I’ve been trying to get anorexia, bulimia and multi organ failure since my 20s which makes 20 years now. I want to be a roadkill as well. I was trying to prove a point to my libtard friend Dave who lives in Jersey.\n\n But because I live in a fucking libtard controlled place I can’t get a gun so I’ve been trying to punch my chest so hard I break my ribs and rip out my heart. Assholes and racist cops keep siphoning my taxes. Is there a way I can stab my heart with a machete? \n\nRight now ive burned my hair off with a cig lighter. I am trying to escape living In a 1 room apartment with 2 other guys. I hate this city so much because of the gentrification and Libtards. My phone is also a piece of shit and it constantly breaks down. I don’t know why I bought a Samsung galaxy 3 without a calling or data plan. \n\nNow that we are quarantined it sucks even worse. I’m trapped with my 3 hour a day commute which is made of aids and fail.  Because I’m under 60 I’m not even going to die if I get corona. Most people would think this is good but I think it sucks ass. Fireworks suck ass too and I hear them constantly in my town.\n\nI’ve tried using dirty needles to inject water to try to get aids but it didn’t work. My rent is insanely high as well. \n\nWho wants to join a pact. I am going to do rat poison and bleed out anyone want to hold me to accountability. I’ve been trying to psych myself up watching death vids on liveleak to figure out effective methods. \n\nHonestly nobody should live past the age of 40 because we’re just fucking worthless and spoiled pieces of shit that needs to be put down I wish Logan’s run was real.", "url": "https://www.reddit.com/r/SuicideWatch/comments/h95f4w/failed_to_become_anorexic_over_20_years/", "title": "Failed To Become Anorexic Over 20 Years", "social_network": "reddit", "user": "KillMeFastOrSlow", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 0, "down_vote": 0, "creation": 1592181396, "permalink": "/r/SuicideWatch/comments/h95f4w/failed_to_become_anorexic_over_20_years/", "nsfw": false, "first_save": 1635422948.60254, "replies_charged": false}