{"id": "t5_2qpzs_t3_mfkwob", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I’m a foster kid (16f,USA,OK), and I just don’t know how to live. I guess I’ll pour out my life story since I can’t sleep. \n\nI had my first suicide attempt at the age of 9, I’ve been in mental facilities upwards of 30 or so times, and this is my second time as a foster child. My first instance of abuse that I can remember was at the age of around 4, two teenage girls taught me how to French kiss as a joke. My parents divorced when I was four, they both have different reasons they tell me that they divorced. My mother says that he was abusive towards her, my father says that she cheated on him while he was in Afghanistan and got pregnant and had my brother. Basically, he doesn’t believe my brother (K) isn’t his. It makes sense. Once they divorced, he went and made another family two states away. My mother, brother and I moved to a more urban area and jumped from apartment to apartment for reasons I’m not really aware of. We weren’t poor. My brother was three years old when he was diagnosed with severe autism. He wasn’t verbal until the age of five, and even though I love and care about him so much, he has been the cause of so much sadness in my life. There was obvious favoritism from my mother. She would subtly neglect me and it really impacted me. She had me do beauty pageants as a kid, and I remember not really liking it. I also did dance from the age of three. The one guy my mom dated that treated me right, she cheated on and threw him out. I loved him so much and it crushed me. Around the age of six, my mom started dating a guy (S), he was 22-23 at the time and she was 30-31. S treated me right at first. One thing good about him that I remember was the ribs he used to make. One of the best things I’ve ever tasted. Him being nice to me was his start to grooming me. He would get turned on by the fact that I was a pageant girl and did dance. I can never dance again because of that. He sexually abused me for two years roughly. I told my mom around a year in about it, and she said I was attention-seeking. So she was of no help. She would have him beat me when she was angry, and he said that he didn’t want to do it because he “loved me”, but he had to. The abuse stopped because she broke up with him, and started dating a childhood friend of hers. He was a meth addict. I told him what happened and he’s the one who did something for me. S ended up on the news for some other kids that he had raped and abused, only two were mentioned, but there was more than a dozen. I was the only one out of all of them that was not believed by the police. It destroyed me. That’s when I had my first suicidal thought. My mom cut her arm on my name that she had tattooed, and said she wished she’d never had me. A few weeks later, I was put into foster care for the first time. My mom tried to stab her now husband at the time (which was boyfriend for around 5 weeks 😬), she ended up on the news as well. K and I were put into his special Ed teacher’s home, she promised our mom that she would keep us until she could get us back. I was practicing for a talent show, I did one every year no matter what school I was going to. I was so depressed that I could barely practice. When I finally did perform at the end of my second grade year, I did terrible. I almost started crying on stage, the last song I sang up there was in front of S. The girl that bullied me at this school told me after I performed that I was a rat with no talent. The whole school knew I was a foster kid now, which somehow made me worth less to them. Once the school year ended, I was still practicing for the last recital I would ever do. The recital was in June. I performed well, I was a wolf that was supposed to attack Belle from Beauty and the Beast. It was fun. After I performed, I saw my mom cheering for me. I went out to the lobby to take pictures with the cast and some friends, and I saw S. My mom thought it would be a good idea to bring S to my recital. That’s when I knew she would never truly believe me. He grabbed me and pulled me in for a hug. That’s when I knew I couldn’t dance ever again. The lady that took me in gave me up right after that, I was “raising her blood pressure” so she couldn’t keep me. I went through nine placements in my first 6 months, and then stayed with a family for the remainder. I did get abused at those homes, some were okay. One home I was at had me and the other girl fighting over ramen, her getting beat with clothes and spoons, and them walking around the house naked. I went back with my mom after 10 months. Everything went fine until around September of 2014. I started getting homeschooled, because of bullying. She got mad at me and almost choked me until I died. That’s when my attempts started. She was never caught for that. I was first hospitalized in December of 2014, two days before my tenth birthday. When I was discharged, we moved to Texas. I got hospitalized a few days later again, and after that one I stayed out one day, and got hospitalized again. I stayed out for a good bit after that. My uncle died in June of 2016. In July of 2016, I texted my dad for Father’s Day, because I didn’t understand why I wasn’t allowed to talk to him. I hadn’t seen him in around 5-6 years. My mom found out that I had texted him, and she demolished my room and beat me with a vase. It was a green vase with rhombus shaped indentations. I went to sleep feeling like I wanted to slit my throat with the broken glass. I woke up the next morning to see my room completely spotless and a note on my vanity saying “I love you and I’m sorry” with a pink heart next to it. I lit the note on fire. A few days later, I overdosed on all of my medications, and went into some sort of coma. I passed out near the pantry, and my mom told me I was faking it, that’s the last thing I remember. I remember one time where she invited me to watch a movie with her, and I fell down the stairs because I was still very intoxicated. I was out for a few more days after that. She never took me to the hospital. That was one of the closest times I’ve been near death. I started cutting in August because of my mother’s influence. That’s when my rapid-fire hospitalizations started. I think I went through my first ten or so in about four months. We moved back to Oklahoma. That’s when I started gaining weight. I started binge-eating. I was still getting hospitalized. I spent most of 2017 in mental facilities. In January 2018, I was walking to the store for new pencils, and I was sort of “kidnapped” by a guy and was raped by him and two other friends. I was dropped off where they picked me up from, and I ran home and never told anybody. This is when I discovered I had tokophobia. I was riddled with inescapable anxiety about whether or not I had gotten pregnant. I had actually gotten pregnant, and I did my own abortion by over dosing. I was 13 at the time. I was still being hospitalized. That summer, I went on a trip with my family to Sea World (San Antonio, TX). I attempted suicide on the seventh floor of a hotel building. I didn’t make it all the way over the railing because a cop grabbed my wrist. I still wish that I had made it over sometimes. After that, I moved in with my maternal grandma temporarily. She is a raging alcoholic who is an extremely toxic person. She verbally abused me the whole time I was there, and spit in my face and told me I was the “Devil’s best friend”. One day, I walked to our local pool (It was a Friday in July). A guy I had known for a couple weeks “lured” me away from the pool into a weird mushroom house thing with a bench in it and raped me. I wasn’t going to report it, but someone suspected something. I didn’t have the choice on not reporting it. I was taken to the hospital for a SANE exam, it was obvious I had been assaulted. But the police didn’t believe me. Of fucking course. So I made a vow to myself that I would never report a sexual crime on myself again if I had the choice not to again. I had another serious suicide attempt. And more after that. In November 2018, my mom started doing drugs and dating a bunch of people. She would make me do meth. She accused me of sleeping with two of her boyfriends (both over the age of 40). Obviously this wasn’t true but meth causes undying paranoia so, there was no winning that battle. She tried to tell the dude that left her because of that accusation that I tried to seduce S and that’s why she was worried. You can imagine how I felt about that. That night, I called the cops and told them she was doing drugs because I wanted to be petty. They said they couldn’t do anything and left. I truly felt helpless. I felt like no one cared if I lived or died, or actually wished for me to. I called the suicide hotline and drank a bunch of mouthwash and vodka. Paramedics showed up to my house and made my mom open the door, she didn’t know what was going on. They took me into the ambulance and asked her to come with them to the hospital. She refused, since K was sleeping. They said if she didn’t go with me, they would take K with them too. They took K and I to a hospital. That night I was admitted and all my mom did was complain that she didn’t have a body pillow. I spent another birthday in a hospital. I’ve spent a total of five birthdays in mental facilities. My 10th, 12th, 13th, 14th, and 15th birthday’s. I was officially taken from her custody three days after my birthday. My dad wanted custody now. I saw him for the first time in about 7-8 years Jan 2019. I thought I had finally found something I wanted. This is also when I became irreligious. I lost around 30-40 pounds and only gained back around 15. I stayed in a foster home for about 5 months, then went to my paternal grandparent’s house in Colorado. A few days after 4th of July, my dad got into an argument with them about punishment of my brother. It was very blatantly abusive. He took us from them illegally and took us to his girlfriend’s house. She is the mother of my half-sister he made a family out of after he left. This was the first time I ever met her. The next 3 months were absolute hell. I was never directly abused, but I watched it. The three pit bulls they had were beaten all the time, beat the kids all the time, loved humiliating them. Just horrible stuff. I was finally able to escape after I called my attorney and told her to make it required for me to come down for the next court date. I didn’t tell her why, just told her I needed her to. I unfortunately ended up leaving on my sister’s tenth birthday. I promised I’d be there for it. Obviously, I didn’t have control over that, but still. I went to a overtly Christian household. They didn’t understand nor like anything that I did. I hated being there. I wanted to leave, but then Covid put us into a lockdown and I couldn’t leave. I was miserable. I had a friend named Destiny through my mom’s best friend. She was only a few months younger than I was. She committed suicide on July 12th, 2020. The first time I ever met her in person was at her open-casket funeral. I could see the marks on her neck even though they tried to cover it with a scarf. She hung herself and was found hanging in her closet by her mom. I went back with my mom in September, but got taken again in mid-November. I stayed in a shelter for around two weeks, and then ended up where I am now. I was in a relationship in February into March, but I ended it. He coerced me into sex and had me believe it was me just losing my virginity. Because of my tokophobia, I’ve been absolutely exhausted with fear since then even though I know I’m not pregnant because I’m on the depo shot, and he used a condom. I’ve started having ovarian cysts, and have been in debilitating pain since around last Sunday. I can honestly say this is one of the sickest times I’ve ever been through, and I was a kid who couldn’t stay out of medical hospitals. I have to go to school today. I have to sit next to the boy that coerced me into sex just a couple weeks ago. I have also started questioning my sexuality. \n\nLife story over, now what I’m really here for! :/\n\nI’ve been having urges to kill myself again, and I’ve stayed out of the hospital for little over a year. I’m really depressed and bullshit going on. I got jumped at school earlier this month for no reason. I got diagnosed with Schizoid Personality Disorder in January. Main point of the story, I feel like rolling myself down the stairs at school or getting ran over by a bus just like Regina George. I look at my wrists and think about branding them, look in the mirror and see myself ripping my arteries out. Not hallucinations, just imagining it. I saw this subreddit mentioned in another subreddit I’m in, so I thought I could use my sleeplessness for “good”. \n\nSorry for the length of my rant...forgive me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mfkwob/i_dont_know_what_to_do_anymore_tw_sexual_abuse/", "title": "I don’t know what to do anymore. (TW: sexual abuse, graphic descriptions, drug use and domestic violence) Rant.", "social_network": "reddit", "user": "Meme_Brewery", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1617006625, "permalink": "/r/SuicideWatch/comments/mfkwob/i_dont_know_what_to_do_anymore_tw_sexual_abuse/", "nsfw": true, "first_save": 1635422313.2020879, "replies_charged": false}