{"id": "t5_2qpzs_t3_pov433", "request": ["4162f604-29a0-4041-a85b-c249e1ca13f8"], "text": "Hi there. I apologize if this post comes off as ignorant or a dumb question. I won't pretend I understand how it feels, or that I'm informed of how to deal with this kind of thing. Even though my girlfriend, best friend, brother, and others in my life suffer from depression, I still have no idea if anything I do helps at all. I just try to be there for them as much as possible.\n\nMy best friend who struggles with severe depression and anxiety has told me he wants to kill himself on Monday. The first time he came to was a lil over a year ago. Despite all my efforts in being with him during that time he told me that as much as he appreciated my support it was never enough. Thankfully he met a girl (his current girlfriend) which has given him purpose, love, and stability up until recently as he see his relationship falling apart.\n\nHe receives professional help, with weekly therapy sessions and Anti-depressants, which even after multiple switches, he doesn't see them help. He isn't truthful with his parents or therapist as too how bad it really is out of fear of being hospitalized which traumatized him before and made everything worse.\n\nI talk with him daily n check up on him all the time. I know I will never understand his pain. I know that no matter how well he hides his pain it still eats away at him. \n\nFor those who have overcome your suicidal thoughts, how did your friends' support contribute to it?\n\nFor those who currently have suicidal thoughts, how, if at all, do your friends comfort you enough to see another day through?\n\nFor those who have helped their friends through the darkest parts of their lives, how did you go through with it?\n\nMost important of all, what has someone said to you (in attempt to comfort you) that only made things worse? My biggest fear is that the more I try to help the more he feels his life is a burden to me and others.\n\nI understand everyone's case is different. But I'm desperate here, and anything will help. I appreciate all advice, thankyou for your time.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pov433/as_someone_without_depression_how_can_i_be_more/", "title": "As someone without depression, how can I be more understanding and a comfort to my suicidal best friend?", "social_network": "reddit", "user": "throwaway847620", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1631727997, "permalink": "/r/SuicideWatch/comments/pov433/as_someone_without_depression_how_can_i_be_more/", "nsfw": false, "first_save": 1635422907.7354906, "replies_charged": false}