{"id": "t5_2qpzs_t3_ot436e", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I honestly don’t know.\nI don’t know if contemplating suicide as an option relentlessly makes me suicidal or not.\nI don’t know what would happen if I committed suicide.\nWhat I do know is that I want to commit suicide, because damn, life is hard. Soaking up everyone else’s emotions is hard. Feeling like you’re too young to die is hard.\nLosing those that you’ve called friends is hard. Cutting contact is hard. Being called indecisive and unable to say goodbye and move on is hard. Being ignored is hard. Being in a relationship, romantic or otherwise, is hard.\nI’ve had really bad experiences in the past. One of who I thought were my closest buddies gaslighted me for years. I was always bullied and ignored. I’ve recently moved to another school and things have been easier, but I’m afraid to trust anyone, so I’ve been pushing people away because the easier it is to convince myself that I’m not their friend makes it easier when I mess up and the relationship burns down. And I’ve dropped hints everywhere that I want support but nobody ever noticed. Even going to a therapist is hard because I don’t trust the therapist enough to tell her anything about how I’m feeling because that information invariably ends up in my parents’ hand. And I don’t trust my parents with a single atom in my body. Because some part of teenage me doesn’t trust adults. Because I don’t want anyone to worry about me, because in the end this is my burden to carry.\nSo yeah. I’ve been contemplating suicide. I’ve even written a draft of a letter to share with certain people I have once felt even remotely close to trusting. Ive been getting no sleep at all lately. I’ve researched the afterlife to try and see what it may be like after I die. So what now?\nI guess there are two options. To do it, or not to.\nThat’s all I wanted to share. Thanks for bearing with me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ot436e/when_trust_issues_meet_suicidal_thoughts/", "title": "When trust issues meet suicidal thoughts", "social_network": "reddit", "user": "Belladonna711", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1627452434, "permalink": "/r/SuicideWatch/comments/ot436e/when_trust_issues_meet_suicidal_thoughts/", "nsfw": false, "first_save": 1635426624.2050936, "replies_charged": false}