{"id": "t5_2qpzs_t3_oy2l2e", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "I apologize first and foremost. I have been left alone to my thoughts for a long period now and hope that expressing me pain might, if only briefly, distract me.  I feel this is unfair to ask of so many experiencing struggles so similar and I'm sure in many cases, greater than my own. But I want to express myself in some way, in an attempt to fight off my own brooding misery and intrusive thoughts I have had. \n     I used to naively think I could change the world. I grew up very poor in the rural south. I was born a bastard child of a mother trying to run from her own demons and a father who believed the world owed him something and who I believe, despite my immense hatred for him, was trying to escape the reality of the world. Funny isnt it? We talk about life as this beautiful thing. Like it's a wonderful epic written by some great poet of a by gone era. We are told how we will experience all this beauty and wonder. How there will be times of strife and turmoil meant to be secret blessings that will make us grateful and appreciative of all life's wonderous moments. This was, atleast for me, what I was told life would be like. But I found a much grimmer reality. \n     Instead of these secret blessings enhancing my view of the world I found that that they were the only constants of this disheveled and cruel world. I admit to being young but I feel the things I have endured and seen have pushed my view and wisdoms beyond that of what is expected of youth. For how can I not see the world as this hideous and insidious beast when everytime I look upon it, when I live it, this is all I can find? As I mentioned growing up I was poor. Most my clothes came second hand. As a result little of my apparel fit me properly. This led combined with me always smelling like smoke from my mom and her boyfriends caused the other children to tease. I bring this up not for pity but to make a point. Children are often viewed as the light of the world. Yet, what does it mean when the light of the world is so cruel and unforgiving. I was made fun of constantly for being poor and my appearance. And this was not older children. This included children in my own grade. Children no more than 7 years of age. You can say \"oh well they are children they know no better,\" but people forget where children learn their behaviors... \n     One of the way I used to try to escape from the world was ironically through history. I used to revel in readings stories of just and stoic kings and warriors of bravery and compassion. Throughout history we find examples of illustrious compassion, solitary unity, stoic justice and abundant bravery. But the the other dark constant that stalks behind these beacons of humanity is that they are all fleeting. They last for as long as it took to create them and no more. That's why they stick out so much to us. Because the sardonic truth is for as much a we exalt these values and preach them, we rarely try to obtain them. \n     In my arrogancent discovery of human nature i have found three constants among humans. First and foremost we are creatures of hedonism. Like Hobbes and Rousseau I believe hedonism to be a indivisible part of our nature. Though I shy away from Rousseaus belief us being \"noble savages \" . I will admit it true that those belonging to what some would call \"unorganized society\" tend to trend at exemplifying the most desirable of virtues in humans. Yet they are not without flaw. At the end of the day all humans are bound by hedonism. Seeking pleasure above all else and we will use anything to justify that. Even the most radiant examples of \"noble savages\" harbour more awful aspects of our nature. For there is always some darker faucet of our inner desires. These tribal societies, in some way or another, justify acts that go against these virtues of compassion, bravery, and solidarity we so often like to exemplify. These societies always justify some type of violence maltreatment of some group, often in an attempt for us to remain on the right side of this flimsy construct we call morality. \n     This brings me to the second constant I have found among human nature. We are creatures of immense greed and envy. Look at every civilization from the dawn of man. You will find one thing to link all these the cyclopien empires of history and that is they were all undone by the greed of other humans. Whether it be through the leader of the empires own greedy actions in a desperate attempt to consolidate all riches and power unto themselves or the greed of other empires who wish nothing more than to taste the power and splendor of their neighbor. Ultimately every civilization crumbles under the enormous weight of greed caused by their rulers or neighboring civilizations which, despite our best efforts, there seems to be no way ward against. \n     This brings me to my final constant of human nature which is our universal language.  Violence. Human history is changed, and sealed through the use of violence. It seems to be the only language that is spoken universally. Perhaps this is a genetic remnant of our ancestors who evolved from the the old world monkeys and in this span of eons that had led to the evolution of humans as we we know it, we have found this to be the only reliable way of settling disputes. Though in hindsight it seems more of a way of postponing issues rather than actually resolving the problems.  \n     I apologize because I feel this has turned into a long blown rant seemingly without purpose or direction. I suppose this is a curse of those who isolate themselves. We have none to balk at our maniacal interpretations of the world. That being said I will make my last point of humans as a people and why I find it hard to carry on in this world.\n     I bring forth these point I have found on human nature because I find no way to escape them. Everywhere I look I find one of these abhorrent traits as one of our driving forces behind all we do. In my very short life I have found everyone to be a hedonist. For do we not seek to squeeze every ounce  of pleasure out of people all the while minimizing our connection to them? Take for example if you will modern friendships. People want to interact with others on there own time. Rarely a thought is given to the situation or condition of the other person. We only care to indulge others when it suits our whims. This is not to say I am absolved of this either. I too have through out my life engaged in this behavior. Caring only to talk to people when it suited me. But do we not all do this? And when we look at the grander scale of things we proclaim how abhorrent it is for us to do this but we never commit to change do we? No we rather slap a bandaid on it. We do something to feign the act of compassion but we never actually commit to it. Rather we make some promise or announce a dream we have of the future. Yet, within these dreams lay altier motives. For we dont do them because we actually believe in the ideals we put forth. We do them to satiate our own greed and desire for fame and power. We dont participate because we think it is the right thing to do. We do it so we can claim the moral high ground and make ourselves feel better. So we can stand on top of our precarious self built mountains and proclaim that we are examples of humanity. But the truth is we care about none of that. We just want to feel better than everyone one that. We want to believe we are Gods among men. But we are the furthest thing from it. And when we cant get what we want we resort to violence because we believe that all our earthly endeavors can be achieved if we kill all those who oppose us. For they know not of what they say and the seek only to stop us because they envy what we have. A narrative used by many kings and rulers.  \n    My point to all this being through thousands of years history we still have not changed. We have stagnated. We still do the same things we have done for millennium. We care not for our fellow brother or sister. Rather we are consumed by the all encompassing idea that we alone are all that matters. It has led us to where we are now. Bickering like fucking school children at who is right and why, and constantly reaching for more material gains, while the world and it's people die and suffer in droves around us. I have come to believe that we are a blight upon this world. We care only for ourselves and how we can bend the world to our whims. So much so that we have and still continue to this day focus on our tribalistic pursuits and refuse to embrace the the ideals of compassion and unity we so often like to exemplify. And frankly I dont want to live in a world like this. I was raised on the idea of compassion unity and honesty. But that is not how the world works. Which leads me to where I am now. I feel that we will never break away from our insidious and selfish behavior. So why would I subject myself to living in a world so devoid of commitment toward these greater values? I just do not know what to believe any more. With each passing day i believe we are bound to this cyclical hell we call life. Bound to the wills of other who care not about us and surrounded by people who only care about there own happiness and preservation. In constant pursuit of something we never actually want to catch.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oy2l2e/i_dont_know_what_to_think_anymore/", "title": "I don't know what to think anymore", "social_network": "reddit", "user": "Galactic_Punk", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1628111837, "permalink": "/r/SuicideWatch/comments/oy2l2e/i_dont_know_what_to_think_anymore/", "nsfw": false, "first_save": 1635423035.1397018, "replies_charged": false}