{"id": "t5_2qpzs_t3_pga7gd", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "I don’t know I’ve had to much and I wouldn’t rather be dead but I can’t keep going with the pain I constantly carry, I ordered heroin and it should be coming any day now I hope. Figured I’d just snort a gram and get it over and done with.\n\nI’m pretty young 18-20 but the pains too much and maybe there’s a good side if I keep fighting but it’s been so long and still have so far to go I know I couldn’t handle it. Worst part is my birthdays coming up in the next 10 days or so and that’s probably when I’ll do it because I’ll be alone with the house, I’m a fucking cunt and I hate it so much what I’m doing to my family it’s selfish of me and I wish people could see it as me finally not being in pain but I know they won’t see it that way.\n\nFeel stupid for even writing this but I guess it’s more so my suicide letter than anything I think if someone is home at the time I will have to go to the park because I’m not having one of my family walk in my room and find me dead I also would like to call an ambulance before hand so only they have to deal with it but I don’t think I can since they will most likely wake me up before you know\n\nDon’t have guns where I am which I find funny because I probably would of been dead long ago if we did, tried a knife a couple times but could never bring myself to do it just sat down holding it to me for a while crying. Tried heroin before didn’t do shit but got higher quality and I think when I did that I only took half a gram this is all in the past 2-3 years.\n\nI hate thinking about what my family’s reaction would be so I try not to but writing it out obviously doesn’t help all I know is I’m a cunt for doing it to them regardless of the past.  \n\nI will say part of my issue is the health care system. I’ve tried so many times to get therapy/psychologist but it’s such a long process and than I finally get one again and they start ignore my emails and not calling so I just gave up. I’ve got undiagnosed mental illness’s but because I’m 18+ I need to pay just to see if I have it like around 200-450$ just for 1 diagnosis. My gp is useless giving me melatonin when I keep saying I can’t sleep it’s not helping and my sleep cycles all over the place than there’s anxiety I barely leave the house I don’t even go to my gp I call them because I can’t go into it but everytime “here take these anti depressants” sure doc start taking for a few months call the gp because it’s not helping “oh just stick with it we will see how you go” keeps using no improvement ends up going off than starting a new anti depressant same shit than a new one. \n\nFuck I’ve walked into hospital a few times over being suicidal including the time I took half a gram of heroin they just made me sit down for hours waiting I ended up just leaving another time go in their hopefully I’ll get help stay for 6-7 hours get a bed than get told yeah they will take me but it’s not going to get me any medical help so I had to pretend that I was all fine just so I could leave. It’s like no one cares because I’m not bursting out crying. I guess I can’t blame them though I’m a high school drop out because I couldn’t focus and have never had a job so don’t get why I should expect them to care.\n\nSo yeah I’m sorry to my family when this happens not that means anything compared to what I’m doing to them. I wish so many things could of gone different but life doesn’t usually have a happy ending I guess.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pga7gd/tired_of_all_the_pain_plan_on_killing_myself_and/", "title": "Tired of all the pain, plan on killing myself and I hate the guilt that comes with it", "social_network": "reddit", "user": "Throwaway44422234", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1630555162, "permalink": "/r/SuicideWatch/comments/pga7gd/tired_of_all_the_pain_plan_on_killing_myself_and/", "nsfw": true, "first_save": 1635426179.2058756, "replies_charged": false}