{"id": "t5_2qpzs_t3_mnqjsb", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "I have been contemplating this for many years, and the notes in my phone that date back to 4-5 years ago showcase the inner turmoil that I have been going through. There were times when I would write notes to myself to stay strong and keep persevering, and then there were other notes that I filled with the hatred I have for myself. \n\nYesterday I went through all these notes, I laughed then cried some but nothing will stop me. I am still here feeling shittier than I ever have in my entire life and more hopeless then ever. \n\nI have deactivated all my social media accounts and began to get my hand written note in order. Do I feel bad? Sure, of course I do. I feel bad for when my family has to find me, I have been telling my mom so many times these past few days that she deserves better than me. She is the most lovely women in the world and It hurts me to know that the only I ever bring to her is more pain and suffering, but I know I cannot live for others. \n\nThere will come times when I am alone, and have to pick myself up on my own. I am too weak to do this. The last couple of nights I have had beautiful dreams with all my loved ones and friends in them. I am happy that in a way I got to experience this. I felt at peace in those dreams and after when I woke up. \n\nI am not planning on texting or calling any of my friends because I dont want them to be alarmed and try to stop me. \n\nI have cancelled all my memberships and subscriptions, something I never saw myself doing. I have notated where my Credit Card information is, my car keys, the passcode to my phone. \n\nIt hurts me to know that this is what my life has come to, I mourn the old girl a use to be.... Full of hope, aspirations, and beauty... only to have it slowly ripped away from her.\n\nI am glad that I got to experience some good before these past few years reeked havoc on me. I am scared and anxious for what may await on the other side. Will I go through constant more suffering for eternity? Or will it be a blissful sleep? My friends I do not know yet, but I will soon. Im sorry to everyone for being a weak human being. I admit that I am weak and too scared to face this world. I know my life will only progressively get worse and to a shallow early 20’s girl.... this is a tragedy. \n\nI want my loved ones to remember me for the good and not the bad that my life has become.\n\nToday I say bye to my mom before she goes to work in another hour or so. I plan to give her the biggest hug ever. I love this women with my heart, and just wished I could love myself the same way.... \n\nI am a worthless piece of nothing. A failure of a human being. I deserve to vanish, and wish that it would not affect my mom and brother. \n\nI am so scared to die. I tell myself, how could it be worse than this hell you live in now? \n\nMy dysphoria over my gender identity is killing me. I was born a female but have hormonal problems that allowed me to develop male secondary sex characteristic ie. coarse chest hair, facial hair, butt hair, deep voice, no breasts, and hair growing on every inch of my body. I am going bald now at the ripe age of 21. All of the money and time I will end up having to spend just to present as a female is too overwhelming for me. I just can not do it. I can not fight for the person I am supposed to be, but at the same time do not feel comfortable presenting with these features in public. \n\nSo this is it. Im terrified but in a way happy that I can put an end to my worldly suffering. I could have had it all. My mom deserved to be able to see her daughter walk down the aisle with children one day, but I can never be any of those things for her. I hope time heals for her an my brother and that they do not get too down about my loss. \n\nThey are strong and I know they can make it. I give up fighting, and accept my fate. To all the doctors who brushed aside my despair I would like to send a big fuck you their way. Fuck you, fuck you, fuck you.\n\nI have not looked at myself in the mirror for the past few days, i am too ashamed to see a monster staring back.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mnqjsb/todays_the_day_nsfw/", "title": "Todays the day. (NSFW)", "social_network": "reddit", "user": "Theend_official21", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 229, "down_vote": 0, "creation": 1618001963, "permalink": "/r/SuicideWatch/comments/mnqjsb/todays_the_day_nsfw/", "nsfw": true, "first_save": 1635426774.330764, "replies_charged": false}