{"id": "t5_2qpzs_t3_6q95uv", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I needed to say what I feel without feeling like a burden you know? I couldn't think of a title at all, I decided to simply write what I had to.\n\nI was diagnosed with clinical depression last year, though through observation of my behaviors in my late childhood to now, I learned I had been battling for far longer. On top of depression, I also struggle with anxiety panic disorder, severe social anxiety and ADHD. I'm quite the bundle. I've been fighting a huge list of problems from my own mind for a long time and it's gotten to be tiring.\n\nI eventually became a man of faith (not trying to convert or anything, simply trying to tell my story) and I became happier for the first time in a long time. I still had days where I could hardly go on but I was getting better. I had an incredibly strong faith for about 3 years and then she came into my life. We'll call her Caitlyn.\n\nI had bounced from abusive relationship to abusive relationship, always thinking I found something different until the truth bitch slapped me along the way. Caitlyn was different from everyone else though. She fascinated me. I had a deep sense of admiration for her and we started dating around the end of my senior year (she was a sophomore at the time). I loved that woman with all my heart and gave myself to her 100% to her. She was the first I ever laid with and I never knew what true love felt like until that moment. I gave so much to her, my relationship with God began to dwindle. But I wanted her. I wanted her more than anything. I even told her I wanted to make her my wife when we could and she was out of high school. And she felt the same. Call it dumb teenaged love if you want but it was real to me. And I never loved a woman like I had loved her.\n\nWe dated for a year and at about the 10th month or so, my depression came back with a fiery vengeance. Everything became harder for me, my anxiety kicked up constantly, I was negative more frequently. She didn't like it. And she didn't understand. Whenever I went to her with my problems, she proceeded to turn it against me, telling me how she's sick of being sad because I'm sad.\n\nAbout two days after our one year she told me a list of things she disliked about me and told me if I didn't \"fix\" myself in about a week, she wanted a break. That tore me apart. I dropped her off at a friend's house later that day and when I went home I tried killing myself. It happened so fast, everything seemed to fade away. I was going to slit my throat open with a pocket knife that happened to be in my room. I remember feeling the bite from the blade and blood come from my neck but I couldn't do it, no matter how deeply I pressed in. I just couldn't do it. Because I had her to think about.\n\nI told her the next day what had happened. I needed to be honest with her. She said she needed a break and dated some jerk the very same day. We'll call him John. My depression got even worse and I had more than a few attempts to take my life again but I still couldn't do it. I unfollowed her from every where I could think of and tried to keep to myself. She would text me from time to time as she saw what was going on in my life through social media, but I didn't reply. How could I reply to someone that shattered my heart but still held my emotions captive? I couldn't reply without hurting myself. So I didn't.\n\nAbout a week ago, she text me out of the blue. But this was different. Something was wrong, I could tell by the way she messaged me. We got to talking and she said she needed me. That she also tried to take her life because she's been feeling terrible lately. I stayed with her and talked with her. Her boyfriend later dumped her, just as she had done to me. Caitlyn was so hurt and I hurt with her. But I still wanted her back. After everything I had gone through, all of the pain and agony, I wanted her to come back to me. And I still do. But that's all been mixing with the depression and how it's been building up.\n\nSee, I feel like a burden to everyone. It's a common trait with people who are suicidal or depressed. I feel like the more times I go to my friends, the more I push them away because they won't want to be around me because I'm constantly in anguish. Work has been stressful and tiring me out. I feel like nothing but a burden. Tonight it became too much to bare and I tried to take my life the same way I had done everytime, with a knife. But I should have learned that I wouldn't do it. It hurts and I don't want to hurt anymore, emotionally or physically. My room severely limits my options on ways I can do it. I don't want to take my own life, but it just feels like my only way out of this endless cycle you know? When I sleep, I dream of what haunts me, when I wake up I go on through every day of my life hoping something would just happen to me so I wouldn't have to do it myself, but it won't. I search for the end of the tunnel and when it seems like I get close, the tunnel extends and grows past my reach. I talk to Caitlyn to make her feel better but it hurts me more and more knowing I can't have her back. When I'm not with my friends I am in a state of anguish. When I meet new people I get nervous and try to lock myself away somewhere because my anxieties are so bad. Every day in my mind is the battle of the Bulge it seems, and at night I storm the beaches of Normandy.\n\nI want it to stop and I needed to vent somewhere where I felt like I wouldn't burden people. Thank you if you've stuck around this far. Hopefully all of this made sense, my ADHD makes it hard for me to pair sentences together to make sense to others (as in my head it comes out crystal clear to me). I debated going to a hospital but I've heard so many negative stories about going inpatient. As well, I don't know how hefty the bill would look, and I don't want to put my parents under more financial stress as I could not pay the bill with my minimum wage job.", "url": "https://www.reddit.com/r/SuicideWatch/comments/6q95uv/im_not_sure_how_to_title_this_honestly/", "title": "I'm not sure how to title this honestly.", "social_network": "reddit", "user": "PM_4_Gravy", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1501304447, "permalink": "/r/SuicideWatch/comments/6q95uv/im_not_sure_how_to_title_this_honestly/", "nsfw": false, "first_save": 1635426348.3573613, "replies_charged": false}