{"id": "t5_2qpzs_t3_lc7jdt", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "At this risk of giving TMI/providing background info to fish for sympathy, I’ll try to give a brief synopsis on what led to the shit show that is life today. I just finished my second round of unsuccessful bilateral ECT (I have also unsuccessfully tried ketamine & TMS in the past). During my current round of ECT, I had ECT + Lithium-induced psychosis and ended up in an inner-city inpatient psych unit where a fellow patient threatened to rape me (I have previously been raped [I was transferred to the hospital's elderly psych inpatient unit the next day due to safety concerns]), and I was also given an IM injection of Thorazine without cause or my consent. I also witnessed several patients per day receive IM injections of antipsychotics almost always without cause during my stay. It was an extremely disturbing experience, and I have since been diagnosed with PTSD. I have struggled with BDD, bulimia, OCPD, treatment-resistant MDD, and GAD since age 13. I have been in and out of hospitals since age 15. I have been unemployed since 01/2020 and living at home with my parents. I have been given the world and am blessed beyond measure. I have no motivation to find a job or do anything with my life. I have no desire to live. My disorders have largely held me back. I have never been in a romantic relationship. I am terrified of interacting with men unless I am intoxicated because I cannot stand rejection or vulnerability, and I believe I am hideous. I turn 29 next week and do not intend to see 30.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lc7jdt/dont_know_where_to_go_from_here_how_to_come_back/", "title": "Don’t know where to go from here/ how to come back from this", "social_network": "reddit", "user": "gr8mile", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1612413084, "permalink": "/r/SuicideWatch/comments/lc7jdt/dont_know_where_to_go_from_here_how_to_come_back/", "nsfw": false, "first_save": 1635422931.7094393, "replies_charged": false}