{"id": "t5_2qpzs_t3_nvgtcg", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "Hello, I have been struggling with suicidal thoughts lately. While looking up ‘suicide hotline’ on this sub Reddit it seemed like those phone numbers were specifically if you are in the middle of a crisis and while I’m not in an immediate crisis, it feels like I could end up in one very quickly if I don’t vent some of this out. Is there a phone number where they will let you vent without it being a full on emergency or do I have to wait until it inevitably gets to that point? It really needs to be a phone call not a typing situation though cause I’ve just got too much to say and typing feels almost unbearable right now.\n\nLast night it was bad enough I actually began to carry out a plan but didn’t get very far before wussing out due to being afraid of what would happen if it didn’t work the way it was supposed to (life-long injury or brain damage etc). Today I was feeling somewhat better but I’m getting in my head too deep and honestly it just feels like I need to vent and get this stuff so it’s not replaying over and over and BECOMES a crisis.\n\nEdit: First, I wanted to add, even if you’re not seeing this post till days later, please still feel free to post a phone number if you know one! You never know when someone else might come across it and need it. \n\nSecond, I rambled about my personal stuff before getting to the actual question so I cut and pasted said question above the personal rant since the personal stuff isn’t really necessary.\n\nEdit 2: spelling", "url": "https://www.reddit.com/r/SuicideWatch/comments/nvgtcg/hotline_for_when_youre_suicidal_but_not_to_the/", "title": "Hotline for when you’re suicidal but not to the point you’re in a full blown crisis, yet.", "social_network": "reddit", "user": "WillAccomplished6970", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1623192356, "permalink": "/r/SuicideWatch/comments/nvgtcg/hotline_for_when_youre_suicidal_but_not_to_the/", "nsfw": false, "first_save": 1635426134.5646, "replies_charged": false}