{"id": "t5_2qpzs_t3_hyoo8j", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I love my little brother to pieces. I'd fight and kill for him, take a bullet for him, be a listening ear for him, and be a shoulder to lean on when he needs it... The whole 9 yards. I see so much of me in him and it scares me shitless. I want to kill myself but I'm so afraid he'll end up like me and be depressed and want to kill himself just like I do. At least if I'm around I can help steer him away from that path and help him through it. I'm afraid for him especially now that he's going to middle school next September. Thats when my depression really sunk in and freshmen year of high-school was my first suicide attempt. He had a good set of friends but since fortnight became popular his friends have just been playing without him (he doesn't like fortnight much like myself and thats maybe because he's looking up to me honestly... I kinda want him to get into it just for the sake of keeping friends intouch. Once you lose touch with all your friends its a lot harder to make friends and to keep your head above the water that is depression.) I taught him well when it comes to memes. He's not into the dead and or cringy memes that hit the mainstream and are over used and dead at that point. We play magic the gathering when I come over to visit my parents house. (I exclusively visit my parents house just to see my little brother.) He has an amazing sense of humor and is quite the charector despite his quietness that most people see. (Much like me he's mainly quiet when it comes to doing pretty much everything but when he's hanging out with friends and comfortable he can shoot the shit and can talk for what feels like forever.) He's encredibly smart and much like me was smart enough to not have to worry about putting in effort in school so when things actually get hard, he could just end up becoming depressed, feeling unforfilled, stupid, and frustrated because he was never challenged enough. For me that seemed to be maybe not the first cause of my depression but was one of the first. I'm so proud of him, what he could accomplish, the size of his heart, and the type of person that he his. He's my national treasure and one of the biggest reasons I'm still alive today and why I'm fighting my masive urge to just end it all. I'll protect him at all costs even if it means delaying my suicide for a bit longer.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hyoo8j/little_brother/", "title": "Little brother", "social_network": "reddit", "user": "Vaarune", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1595839981, "permalink": "/r/SuicideWatch/comments/hyoo8j/little_brother/", "nsfw": false, "first_save": 1635427158.2670224, "replies_charged": false}