{"id": "t5_2qpzs_t3_mjrrtd", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "TW: pedophilia, rape\n\nIf you have ever been sexually assaulted in life, I am so, so sorry.\n\nI don’t even know where to start\n\n&#x200B;\n\nI’m a 16 year old gay guy with OCD, and I’m primarily attracted to big handsome muscular men who are really sexual and horny, EXACTLY THE OPPOSITE of children which I have NO sexual attraction to them whatsoever\n\nI also have don’t have enough knowledge about sex, sexual assault, and pedophilia, because anything about sex is a taboo topic in my country. I always respect people’s feelings, because I don’t want people to hurt, but I actually didn’t know and *literally* can’t imagine how it felt to be sexually assaulted or exploited. \n\nEven then, I feel so fucking ashamed that I didn’t feel their pain and suffering. I feel like I’m a fucking terrible person.\n\n&#x200B;\n\nGetting back to the real story\n\nIt all started when a video about a guy who is arresting that Discord pedophile comes into my recommendation in YouTube. I decided to watch it cause I have nothing else to watch. I had almost no reaction to that video since I didn’t know much about the impact of rape, especially at a young age. \n\nBut then I think to myself “Wait, this doesn’t feel right. Pedophiles are supposed to be bad guys that a lot of people really hate, why do I not have any reactions? Why can’t I imagine the pain that this girl go through?”\n\nI don’t even know how that happened, but then suddenly, I feel a bit of… tingling. in my private parts while watching that video, and my legs begin to twitch. “Why does it feel like I’m… sexually aroused? Am I attracted to that girl or something?”\n\nI begin to panic a lot about my tingling feeling. When the video begin to end with the pedophile being arrested, I don’t even know why, but I feel.. sympathy, for the pedophile, even though I REALLY SHOULDN’T, my dumb ass heart said “Damn, I feel bad for him, what he did was wrong, but it isn’t his choice to be attracted to children”\n\nBut then I begin to panic even more “Why am I having tingling feeling in my private parts? Why do I empathize the pedophile instead of the girl? AM I A FUCKING PEDOPHILE? AM I GOING TO BE FUCKING SEXUALLY AROUSED TO CHILDREN, AND POTENTIALLY BE ARRESTED AND HATED BY A LOT OF PEOPLE? AM I GOING TO FUCKING HELL?”\n\nMy entire heart and mind become a fucking mess.\n\n&#x200B;\n\nFor the past 3 weeks in my life, it’s been ABSOLUTE HELL.\n\n&#x200B;\n\nNow almost EVERY TIME I see children, EVEN FEMALES, I feel... sexually aroused, even though I remind to myself that I’m not, it is just in your head, it's only groinal response according to internet. \n\nI absolute fucking hate it.\n\nI begin to fucking worry about myself becoming a fucking pedophile and being hated by people. I ALWAYS check my private parts to see if I get an erection or ejaculation.\n\nI sometimes get thoughts of sexualizing children, which I really fucking hate it, since I DO NOT want to be a pedophile and I will NEVER sexualize children.\n\nI became so FUCKING ANXIOUS looking at kids worrying that I might sexualize them, but at the same time I keep looking at children so I can try to stop this feeling and prove that I’m not a pedophile\n\n&#x200B;\n\nThat’s not even the worst part about it\n\nNot only I was anxious looking at kids\n\nbut I’m also anxious at fucking anything against pedophilia. \n\nWhenever someone talks about pedophilia. I get TRIGGERED for NO APPARENT REASON. Whenever someone or even myself said “Pedophilia is bad” (which it is of course), I feel butterflies in my heart, my heart pounds so hard, and I lose my breathe.\n\nEVEN SAYING “Child Molesters shall be arrested” GET ME PANICKED AND TRIGGERED SO HARD, EVEN THOUGH NEVER IN MY LIFE HAVE I MOLESTED A CHILD EVER. I DON’T EVEN KNOW WHY, WHY AM I LIKE THIS?\n\n&#x200B;\n\nI’m trying to understand what rape and pedophilia is and how devastating it is to be raped, but even then I sometimes, forgot, about it.\n\nI tried and tried and tried to remind myself, but I just, forgot about it instantly, and I feel like a terrible fucking person.\n\n&#x200B;\n\nI became so fucking depressed and anxious. I felt so shameful about myself, I felt like I’m a shitty person who doesn’t deserved to be in this world. \n\n&#x200B;\n\n24/7 I always fucking think about pedophilia and rape, and I absolutely hate it. I tried to forget about pedophilia and rape, but I just can’t, I really just can’t.\n\nEvery time I wake up I feel panicked and anxious so much, even if I don’t even think about pedophilia when waking up, I feel so threatened for no reason what so ever.\n\n&#x200B;\n\nI felt like I lost my soul.\n\nIt felt like my body has been cursed by the devil. \n\nI keep telling to myself that I am not a pedophile, but sometimes, the devil inside me said that I officially identify myself a pedophile, and I fucking hate it, why am I even feeling like this?\n\n&#x200B;\n\nIn just 1 month, my life has been ruined.\n\nMy entire outlook in life has been changed.\n\nWhenever I see someone or something who is openly against pedophilia\n\nI feel anxious.\n\nAlmost every fucking single thing in life that I *used* to really like, I became anxious at it.\n\nEVEN SEEING THE LGBT FLAG MADE ME FEEL ANXIOUS, SEEING HOW THEY ARE AGAINST PEDOPHILIA, WHICH IS GREAT, BUT WHY AM I PANICKING AT IT?\n\n&#x200B;\n\nI wanna fucking kill myself and get out of this world that I don’t deserve to be in.\n\nI wanna fucking stop this pain I’m feeling and be at peace.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mjrrtd/it_might_be_pocd_but_it_felt_like_im_a_pedophile/", "title": "It might be POCD, but it felt like I’m a pedophile, and I wanna be erased in this earth.", "social_network": "reddit", "user": "Ok-Individual-7386", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1617522426, "permalink": "/r/SuicideWatch/comments/mjrrtd/it_might_be_pocd_but_it_felt_like_im_a_pedophile/", "nsfw": false, "first_save": 1635428448.6567638, "replies_charged": false}