{"id": "t5_2qpzs_t3_2hyv94", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "I'd rather not get into the specifics of why I'm depressed.  Suffice to say, I feel very isolated.  I've told two people about my failed attempt this weekend.  One has talked with me about it but the other hasn't really talked with me further about it.  I want to talk about it more so I'm posting here.  I want to tell people I know, not in some cheap need for attention but because it's a pretty big deal.  However, I'm afraid these people will tell me they don't know what to say and that will be the end of it -- because that is what's happened in previous times when I've talked about suicidal thoughts.  \n\nI had a bit to drink when I did it.  Not totally drunk but enough to lose inhibition.  I was upset and walked into the house went straight to the bedroom where I had a rope waiting.  I tied it to a part of the closet and tried to get some sort of good knot going.  I had read a few weeks earlier there are ways of hanging/strangling yourself where you do more to cut off certain arteries than cutting off air supply.  So,  I was aiming to do that.  However, since this was spontaneous I didn't know the exact way to make it work.  I tried a couple ways out.  I tied the rope up and put it around my neck and knelt into it.  It cut off my air supply so it caused an involuntary reaction against it.  I tried adjusting it so it would focus the pressure on arteries, but that time it wasn't strong enough.    \n\nI didn't feel anything as this was happening.  I figured I was more trying things out to see what would potentially work, but at the same time I figured if I found a way to be effective, I wouldn't stop it.  I was hoping it would work.  Really hoping.  If I had found the right knot or right placement of rope, I would be dead right now.  And I felt nothing about it.  I felt nothing about it while I had a rope around my neck and I was leaning my weight into it.  \n\nI spent the next day feeling like a ghost.  I feel separated from other people.  They have an intention to live, and I had an intention to die.  How do you relate to other people after that?  How do you change after that?  I felt nothing except desire to put an end to what I've been going through.  I don't know how much of a desire I have to 'change' - other than through suicide.  Am I completely gone now?  Is it guaranteed I will die by killing myself?  I'm not completely sure.  \n\nI'm lost.  ", "url": "https://www.reddit.com/r/SuicideWatch/comments/2hyv94/i_had_a_failed_attempt_this_weekend_feel_lost_now/", "title": "I had a failed attempt this weekend. Feel lost now.", "social_network": "reddit", "user": "TAworldcomingdown", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1412143989, "permalink": "/r/SuicideWatch/comments/2hyv94/i_had_a_failed_attempt_this_weekend_feel_lost_now/", "nsfw": false, "first_save": 1635426485.3937178, "replies_charged": false}