{"id": "t5_2qpzs_t3_1ci0t4", "request": ["ecd4e9a1-2551-4506-a13c-95bd305e923c"], "text": "A plan. A date. A method. A note.\n\nMy birthday will be the day. \nAs for what \"drove me to this decision,\" well, that's too much to explain. Does this make me \"high risk\" now? Hm. If anything changes before or on my birthday, I mean, if I get some sort of \"sign\" that tells me to continue... I will. I know only a few things would change my mind, which no one on this subreddit can help with. I just wanted to share. If no sign, then oh well. A person dies. I don't think I was meant to live so long, anyways.\n\nI feel a sense of relief. I finally have a complete plan! I tried the parasuicide things, but nothing helped me, and I'm back here. I tried, really. I've been \"suicidal\" for years of my young life, but I gave life and experiences a chance. Will someone wish me the best of luck in the afterlife? I am not sure whether I want to cease to exist or find something \"better\"... my beliefs of the afterlife have changed a lot, due to identity issues of teenage years. \n\nEveryone here is wonderful! Some more wonderful, with their touching stories and personalized ways to help, but... you're all great and thanks for reading this and thinking about helping! I don't need the help, but I appreciate the fact that you considered it. Keep on trying, I used to go around the internet trying to help other suicidal people. I think I might have helped a few...given them someone who genuinely cared. I was pretty devastated when I was sure one killed himself...\n\nI guess asking for a sign to the Powers That Be, whatever they are, is ridiculous. If those Powers exist, why would they help me? I wish those of you that are suicidal the best, too. I hope you find something that makes life worthwhile and yes, I've considered all aspects of my decision. I hope you have not, so that you'll learn to love life and see the world differently or get on some medication or try therapy or get attention and love or whatever will help you the most. Good luck, everyone! You're all fantastic, beautiful, flawed human beings who deserve the greatest of what life has to offer.\n", "url": "https://www.reddit.com/r/SuicideWatch/comments/1ci0t4/what_i_have/", "title": "What I have:", "social_network": "reddit", "user": "ElJefeFinal", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1366159525, "permalink": "/r/SuicideWatch/comments/1ci0t4/what_i_have/", "nsfw": false, "first_save": 1635427789.8507931, "replies_charged": false}