{"id": "t5_2qpzs_t3_hguzxj", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I was always told that I could be anything I wanted to be, and now because I never got the treatment I needed for my mental disorders, there is nothing I can be. I'm 20, too old for a minimum wage job working at McDonalds, but I'm at an age where work experience is required for employment.\n\nEven if I could get employment, where is the joy in that? Slaving away each day for a corporate overlord so I can get my measly pay, just so I can do it again tomorrow. Gee, that sure sounds like a life worth living.\n\nI know I'm young, and for the past 10 years I've been fed the lie that it will get better and everything will work out. It won't. My problems continue to exist 10 years later, the debt that has been made my responsibility by my horrible family continues to loom over me, and I continue to learn more each day about just how horrible and disgusting my bloodline really is. Why shouldn't I end this trash fire of a family tree with me? I'd be doing the world a favour, so at least I'd be accomplishing one thing in life, right?\n\nI barely even made it out of school, just scraping out a passing grade due to my severe insomnia, and untreated bipolar disorder and depression. Of course, the grade isn't high enough for me to work with, to actually get a career out of, it was just enough to stop me from repeating.\n\nI attended secondary education after high school, two years of it, two wasted years as I got screwed over last minute and was denied my certification over not turning in an assignment that I had already turned in. Figure that one out. I feel like my teacher cheated me out of that one as I disagreed with him politically. Sorry Mr Green or whatever your name was, you're a sound engineer, I don't think you're qualified to lecture me on how good communism is.\n\nAnd to top it all off, what remains of my family has begun to tear itself apart. My dad has become a drug addict, and my mum is an unstable wreck waiting to kill at any moment. Both of them shit talk the other to me, tugging at my arms trying to get me to their side, I feel like I'm going to be torn in two.\n\nI know to some this seems like something I can live with, and really I should be able to. I can continue to mindlessly exist and simply suffer in my jocks, but my question is why? Why should I? My whole life has been controlled by others, this is the one thing I have, control over if I die right fucking now, or wander on into the next day, week, month, year, marching ever onward until the day I finally kick the bucket, or someone kicks it for me.\n\nWhat is even the point if we are just born to work? We are billions, what does it matter if one ant falls off the leaf into the abyss? We are born and then we die and that is it. There is no point, there is no greater purpose, and you certainly do not pass go.\n\nI'm just so tired. I sit here writing like a backyard philosopher, trying to see if typing this out might appeal to something inside of me, like maybe if this fancy writing will light a spark within, but all it does is remind me that there is no fucking point. Even if I did become some fancy writer, I still die. Even if I write the most amazing book, I will never be around to see my legacy. What is the point in even having one if I don't get to see it? Why would I give a shit if Chadwick McShaemus thinks I'm a terrible hack if I'm dead?\n\nMan I wish I was never born. To quote a great digital man, I never asked for this. And hey, I might understand if you think I'm not depressed, after all, this writing to me feels pretty light hearted given the subject, right? Well, sure, but that whole bipolar thing will be back in a few minutes, maybe an hour if I'm lucky. Right now I'm in a good state, that is, able to pick myself up and slam my hands on a piece of plastic in just the write order to form these words. Soon I'll dissolve back into the heaping mass of flesh they call [REAL NAME], and I'll just go back to sitting at my PC, getting up on occasion to eat or shit, and going to sleep, just to get up and repeat it the next day.\n\nI guess the point of this post is a few things. A vent first and foremost, a call for help in second place (like I'll get any from reddit), third is something for the police to help them rule it as a suicide, and in runner up fourth, a little last something for my sister, so she can see how fucked up I really was. I'm glad she got out while she could. She's the only one in my family who might accomplish something beyond rapid and ceaseless flailing.\n\nI think tomorrow I might visit the train tracks nearby. Those coal trains can really run a person over. \n\nEnd post.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hguzxj/im_so_tired_of_it_all/", "title": "I'm so tired of it all", "social_network": "reddit", "user": "Your_Pal_Kindred", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1593270003, "permalink": "/r/SuicideWatch/comments/hguzxj/im_so_tired_of_it_all/", "nsfw": false, "first_save": 1635422325.3796306, "replies_charged": false}