{"id": "t5_2qpzs_t3_lqi2ky", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": " \n\nThrowaway account because I don't want anyone I know to see this.\n\nFor context, I have been struggling with depression for 4 and a half years. Around June of 2020, I visited a psychiatrist for the first time and received a diagnosis. I've since been on medication, but I've yet to find one that works for me (I've tried 5 different ones so far). Only my brother and two of my friends are aware that I'm on medication, but none of them know how badly my depression affects my day-to-day life.\n\nFor the past year, I have been barely scraping by. I live alone in my university dorm and doing menial chores every day takes so much out of me that I avoid doing them until they become a problem. Twice my bathroom sink became clogged because I hadn't cleaned it for months; a few dishes in my room have been uncleaned since I last used them several months ago; so much dust built up in my room that it gave me a bad cough--the list goes on. Lately, it's gotten even worse to the point where not a day goes by that I don't think about suicide. Twice in the past 3 years I attempted to kill myself, but chickened out at the last second. That's the only thing stopping me from doing it right now--the fear.\n\nWhich brings me to my current dilemma: I want to alert someone that I am mentally compromised to the point of inhibition, but I don't know how to seek help. There's a health and wellbeing centre at my university (which has counsellors, but they are not people who can diagnose and such, only direct me to the appropriate professionals). I've had a few sessions with the counsellors there, and they have a strict confidentiality rule. HOWEVER, they will break confidentiality and inform my parents if they believe that I am at risk of harming myself/others.\n\nMy parents are very traditional and don't believe in mental health or depression. Based on how they've addressed my concerns in the past, I know they will not be supportive and, if anything, they will add to my stress and depression. I am not independent yet so I have to rely on them a lot financially, which means I can't avoid talking to them if they find out.\n\nHow can I alert someone that I am suicidal without letting my parents know?\n\n&#x200B;\n\nTL;DR My depression is severely affecting my life to the point where I am barely living and constantly contemplating suicide. I want to seek help by informing the wellbeing counsellors at my university, but they will break confidentiality and I don't want my parents to know about my situation since they aren't supportive and will make it worse.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lqi2ky/im_suicidal_and_want_to_seek_helpbut_i_cant_risk/", "title": "I'm suicidal and want to seek help--but I can't risk my parents finding out.", "social_network": "reddit", "user": "imatmywitsendhelp", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1614085825, "permalink": "/r/SuicideWatch/comments/lqi2ky/im_suicidal_and_want_to_seek_helpbut_i_cant_risk/", "nsfw": false, "first_save": 1635426416.5510826, "replies_charged": false}