{"id": "t5_2qpzs_t3_qh2c5r", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1", "0d51d2f7-1f44-49da-8589-08576e1a25e5", "e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "I have a lot to say, but I feel like I've already said it all. \n\nI thought I could be strong for my mom. I thought I could handle anything. I can't. I don't know how to do this anymore.\n\nThe same lyrics by Keane keep repeating in my head, again and again:\n\n*The more I look, the more I think that I'm*\n\n*starting to disappear*\n\nI had a way I wanted to die, but I don't know if I will be able to do it. But at least I would like to be outside, looking at the stars. \n\nI think I'm mourning myself. I think I am in the most danger I've ever been. I'm \"smart\". I have experience with suicide attempts so I know whar doesn't work, what might work, and what does.\n\nI don't want a third time. \n\nSo I think I'm starting to say goodbye to things. Writing letters. Working 9 hours and then just staring at the wall. Until I snap and I plan. \n\nI'm not dead yet because I'm not in a hurry. I know if I wanna do this I need to be smart and quick, or someone will come chasing me. I don't want anyone chasing me.\n\nIt's funny because I told my best friend yesterday. He's such a good person, but he can be so dense. He asked me \"what would you do if I told you I want to die\", and I said I would tell his parents and brother.\n\nIt was a call for help. I wish he had seen through what I meant. I meant call my mom, or I'm going to die in a few weeks.\n\nI feel sad that I'm unable to stand it for my mom. That's my only regret. I loved everyone as much as I could. I will leave behind things I miss until I can't miss anymore, because I can't feel anymore.\n\nIt feels like I've been drowning for 27 years and the surface is coming closer. The breath of relief that it's over. That there are no more things I'm supposed to be. I'll just be dead. \n\nIt is exactly like the lyrics. I'm starting to disappear. I've thought of contacting a lawyer about my will, if I even need one - I don't really have many possessions.\n\nI do wish someone realized. But I can't bring myself to say it anymore. I've done it before. I've called for help, I'm on meds, therapy. I know I could live a life in which I'm not unhappy - but that life is unattainable. \n\nI can't deal with the anger and disappointment that comes from it anymore. \n\nI'm an adult and I should decide, so I am deciding. It's hard and easy at once. My survival instinct kicks in because I think it knows I'm in danger. \n\nIf this is my last post, then I'll quote George Harrison in his deathbed:\n\n\"Love one another\"\n\n- Penelope", "url": "https://www.reddit.com/r/SuicideWatch/comments/qh2c5r/i_think_these_are_the_weeks_leading_to_my_death/", "title": "I think these are the weeks leading to my death", "social_network": "reddit", "user": "penelope_07", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1635357026, "permalink": "/r/SuicideWatch/comments/qh2c5r/i_think_these_are_the_weeks_leading_to_my_death/", "nsfw": false, "first_save": 1635425533.419678, "replies_charged": false}