{"id": "t5_2qpzs_t3_qg1uuo", "request": ["ee176c24-5d0b-47eb-8f0f-71f3b585684e"], "text": " \n\nI can't take this any longer! I'm at wits end and need help to get through this chronic shame.\n\nApologies if this is not allowed in this subreddit, but I don't know where to go.\n\nHere's the long story:\n\nI am an autistic 21 year old male, who from since the age of 9 years old has been suffering from anxiety, depression and what I believe was also OCD. 13 was the first time that I had discovered explicit pornography on mainstream sites after hearing students in my class discuss masturbation and porn. (I may have viewed softer porn when I was 12). It was initially the vanilla categories, but very quickly became cartoon pornography which is truly disturbing material which features all kinds of graphic sex acts. I have no idea how I could get off to that.\n\nJust before I turned 14, I first heard the term 'child porn'. The idea of CSAM existing frightened me and filled me with pure rage, yet I also looked the term up on google to understand what it was. About 6 months later, I think I masturbated to the sexual scenes in the ABCs of death. One of the scenes of course featured a child and an adult male, presumably implying pedophilia. From about 14-15, I watched a lot of anal porn and was obsessed with womens' big butts and I had a massive crush on a two different girls in my class at the time. I gradually ended up looking at weird (bizarre, but legal) pornography of all kinds a few months before I turned 15. Before this, I never had any sexual thoughts about children younger than me, but from then on, something happened and some of memories became sexualised. At around 15, I had started looking at cartoon drawings of children around my age for a few months, although for about a month, there were prepubescent children that I had looked at and I searched for CSAM on google on 1 occasion. This stopped for about 7-8 months.\n\nThen when I was 16, one of my followers on instagram made a post about this public account which was posting CSAM. I foolishly clicked on the @, and it lead to \\~2-4 CSAM previews of really young children being sexually abused by older men. I quickly clicked out, but then clicked back on to report some of the accounts. I feel sick saying this, but I also experienced intense arousal with anxiety and terror. I continued to report each of the accounts as the individual made them. I shamefully ended up masturbating to the previews several times that afternoon whilst reporting the accounts. It was so confusing because I had both hatred and this intense physical arousal response to it at the same time. For about a month or two, I found a google image of a screenshot which had an uncensored image of the account and viewed that several times. I stopped for another month or two before I came across sexstories on XNXX. For about 3-4 months, I had read several stories which depicted CSA. This stopped for about 8 months or so.\n\nwhen I was 17, I visited CSAM websites on the darkweb about a dozen times over 3-4 months. On one occasion, I had the intention to download 1 video, but fortunately changed my mind. This was the turning point, and I soon looked up the laws in my area pertaining to the legality of child sexual abuse material, which I was unsure about. I found out that deliberately accessing with intent to view any of these websites is a serious crime. I immediately stopped due to the paranoia of police apprehension, reading about 'porn addiction', and out of shame and moral reasons. I immediately told my mother and had a talk with my father about this. Ever since then, I have had only one moment of deviancy when I went on 4chans /b/ around my 18th birthday once to a cartoon generated image. It has been over 4 years since I have done anything like that, although I still check to compare my arousal to adults with children.\n\nEver since then, I feel intense self loathing and shame, self-hate because those children who are depicted in those images don't live a normal life, and by visiting a website I was complicit in the production and distribution of the CSAM on the internet. I am not a good person because of this. I'm sorry to all those out there who are victims of this horrific abuse. I have tried to do everything to make amends for this for the past 4 1/2 years, but how can you repair the harm that these children go through? I just want to die because I hate myself so much for this\n\nI have tried to right the wrongs by seeking help from professionals. I have, without viewing any CSAM intentionally or unintentionally, reported hundreds of accounts involved in CSAM, I have donated to CSA prevention and CSAM reporting hotlines, and contacted online sources for help. Although I haven't had any urges, desires or thoughts about ever looking at CSAM ever again or fantasizing about children in any capacity, I still scan my past to see if I have missed anything, check my arousal around children and of children in an advert (not CSAM) image, avoid children and read news reports about pedophilia which pushes me into a deeper depression. I am not sure whether I am a pedo or not, because the people I opened up to said otherwise. I need help to move past this, but I don't know how.... Nothing works. I hate myself!", "url": "https://www.reddit.com/r/SuicideWatch/comments/qg1uuo/im_probably_broken_and_worthless_tw_pedophilia/", "title": "I'm probably broken and worthless (TW: Pedophilia, CSA, POCD, CSAM)", "social_network": "reddit", "user": "Throwawaybrokenmind", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635236840, "permalink": "/r/SuicideWatch/comments/qg1uuo/im_probably_broken_and_worthless_tw_pedophilia/", "nsfw": false, "first_save": 1635427869.1558917, "replies_charged": false}