{"id": "t5_2qpzs_t3_poon6o", "request": ["fa52eed9-681b-4f68-b3d1-78c0eec9a3d2"], "text": "I am 15 years old and my entire life I always knew when I was dreaming. I could wake my self up, blink and get glimpses between the dream world and my real world, but I never could naturally control my dreams. Last year I tried to lucid dream, it took a few weeks but I had been able to do it pretty successfully most of the times it tried. A year goes by and I now lucid dream every single night. Every single night. I was a master at it. I was like neo from the matrix. I could fly, open doors to different countries and even the moon once or twice. One day about a month ago I was lucid dreaming and I was sitting in class. Untill the kid sitting behind me started shaking and black smoke came gushing out of his mouth and eyes I tried to fly off my the smoke had wrapped around my legs and I couldn’t move. Then for some reason I am lying down on the floor and I can’t move. I try to wake up but I can’t. That’s when I panic the kid had now turned into a black smoke demon with claws and teeth but everything else was smoke. Then I woke up. But the smoke demon was still there just watching me. Then he disappeared but I could not move I could hear my dad snoring so I knew I was awake. About an hours goes by and I still can’t move or talk. Eventually it turned into morning and I was lying like normal almost as if I had just woken up. I knew my dream about not being able to move was real and I kind of scared me. Then I go to school and at the very end of the day I trip and fall over. Then I wale up and realised that my entire day at school was a dream. Now it’s present day and I can’t sleep ever and I wake up randomly and have no idea of what is real or what is not. For all I know I could be dreaming right now. No way to tell. I see that daemon", "url": "https://www.reddit.com/r/SuicideWatch/comments/poon6o/i_might_be_dead/", "title": "I might be dead", "social_network": "reddit", "user": "UnderstandingLow5629", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1631706972, "permalink": "/r/SuicideWatch/comments/poon6o/i_might_be_dead/", "nsfw": false, "first_save": 1635425463.467168, "replies_charged": false}