{"id": "t5_2qpzs_t3_cmosbx", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "Hello. It’s past midnight here right now, but I might as well stay up to post. Sleep has become an escape, and there’s a bittersweet gratification from waking up at dinnertime. I’ve been looking through the posts on this sub for months but it never has occurred to me to make my own. Well, I was under the influence of alcohol a while ago, so it might be that removal of inhibition that gave me the idea. Alcohol is another way to feel better. My classy mom thinks I’m drinking it underage because I have a sophisticated tongue, and my cool dad thinks I’m trying to feel older, and my well- balanced sister thinks I really, really like to party. But really it’s just to stop the intrusive thoughts. Oh boy, those intrusive thoughts. They’re the most uncomfortable thing ever. All my insecurities and anxieties and morbid fantasies and dark thoughts, endlessly being played repeatedly without cessation. I’ve no idea whether suicidal ideation goes into that category of thought because I’ve come to indulge in it. Wiser people tell me that ‘suicide is not really the answer you’re looking for’ and ‘if you stay here things have to become better eventually’ and their points are perfectly valid. The conundrum lies in the simple fact that I have lost hope, motivation and even desire for a good life. I am like a tired chess player who wants nothing more than to lose the game and finish the exhaustion, even though the game is not inherently hopeless at all. Nothing is a profound, external source of distress at the moment— nobody is abusing me,  and I haven’t recently failed a relationship or duty. If I didn’t have such an unhappy mind one would conclude that my life is a beautiful one.  Internally however, the world is hell, because I’m a little bit dysfunctional. I was diagnosed with depression and Asperger’s syndrome, you see, and I fear that I might have an eating disorder. That’s because I struggle with eating like a normal person because of my family’s relentless body-shaming. I’ve been actively suicidal for eight months, depressed for ten and self-harming for eighteen. Let’s just say that the past three years have not been any fun whatsoever. There’s just too much debate about whether I should actually Hang On Until, or actually die. I tell myself time and time again that the end is definitely near, and I will definitely not chicken out, or definitely tell my therapist because deep down I’m terrified of the decision. To be sure, it’s one of the hardest choices around. On a par with the kind of grisly question a six year old asks when he’s bored, grinning like an absolute maniac. You can just randomly give an answer to him, or ignore the question, or reciprocate with an even more jarring one. But this— this is real. This is going to happen to you in actuality. It doesn’t really help to know the exact thought processes behind the making of these decisions, either— nearly everyone subconsciously simplifies their opinions on death when it seems like the only way out, because nobody likes to be trapped in an unpleasant situation. This phenomenon is largely viewed as negative by the mentally stable populace, but to me it’s a blessing because I’ve grown to love the idea of offing myself and I’m glad that there’s something that makes it easier to do. There is so much apathy surrounding existence, rather the lack of it, that I would be worried if I cared. My death affinities have landed me in hospital thrice since January and I think that I will be readmitted for a last time very soon, very briefly. Lost trust in the promise of recovery with treatment, and gained suicidal momentum through voluntary simplification of everything and triggering myself with Elliott Smith. Isn’t it funny how your perspective on everything changes when there’s no good feeling? For sure, there is a lingering part of me who knows that every single suicide is a bad, bad tragedy. My parents are going to be devastated and my classmates will now have the added element of a young departure to mess them up early. My siblings are going to grow into very different people— will they get bitter, or learn to cope with loss and grief? Will they get depressed themselves and... forbid it... suicidal? If only I had stayed for awhile, I would have blundered out of the woods. I would have been a real life, being there for no other reason than to fulfil, love and be loved. But I died... and now people in my vicinity have been damaged irrevocably. One more reason to be cynical has been given to the cosmic tally of reasons to be cynical. And now everything’s in shambles... But I don’t have to think about that. I can just focus on the optimistic things that being a non-perceiving, non-cognitive and non-interactive entity brings. Everything’s okay but it also totally isn’t.  [Thanks for reading this far— I know I’ve not been concise. It would, however, be fine if no one saw this thing. And it’s also fine if nobody comments, which makes for an extremely awkward social situation where one party gives TMI and the latter balks. I hope my writing is adequately interesting, though I do apologise if you feel unjustly coerced into a long reading session. Reading’s good! It’s the one thing that got me where I am today. Oh, wait.]", "url": "https://www.reddit.com/r/SuicideWatch/comments/cmosbx/life_is_kind_of_terrible/", "title": "Life is kind of terrible.", "social_network": "reddit", "user": "Lectorsaurus612", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1565086796, "permalink": "/r/SuicideWatch/comments/cmosbx/life_is_kind_of_terrible/", "nsfw": false, "first_save": 1635426430.0450797, "replies_charged": false}