{"id": "t5_2qpzs_t3_gq2l4t", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "My parents are making me feel like a shitty person. I opened up to them and I’m in a a really bad slump right now. I don’t come out of my room that much. My state hasn’t changed over the past year and a half but telling my parents makes me feel like I don’t have to hide it anymore. They keep trying to help me but don’t understand that this isn’t something I can just wake up one day and choose to conquer. I’ve dedicated my life to beating this. It’s all I live for. I only keep living because I feel like there is hope. My parents are trying to help me but they can’t help. They take away my video games which is my way of coping and it is fucking me up. It’s really sad but when I don’t binge play video games I get suicidal thoughts. My parents think that I can just decide to fight it and everything will be okay. They are unable to see that I’ve been fighting this for a year. This is my fucking life. I have nothing else to live for besides getting over this shit. They see me lying in bed and take it as a fact that I’m not trying and I don’t want to get better. They can only see the surface. They think if I get out of bed I will be happier. Being in bed is what keeps me from suicide. They only see the surface. I don’t know how to communicate the rest to them. They don’t understand how far they are from knowing everything that’s going on with me. They don’t know how much I haven’t told them. They don’t know what I’m really feeling. They don’t really even know me. I love my parents but they are making things so much worse. They think that I don’t want to fight but they don’t know how much I want to be better. They think that somehow my view of the world is impaired but it’s not. It’s crystal fucking clear. I completely understand how horrible my life looks from an outside perspective. All I want is to fix myself but they can’t see that in the slightest bit. I don’t know what to do. My mom came in today and started yelling at me. I told her to “fuck off” (I know I’m a fucking terrible person). She started crying. This broke my heart. They care too much but they simply can’t see the whole picture. It’s not that simple for me and they don’t get it. I don’t know what to do. I simply can’t communicate that they don’t understand to them. Every time I tell them this I think that they think that this is my way of self preservation. I just want more time to pass so I can be sad. I don’t even know how that’s logical. All I live for is to see a happier tomorrow they don’t get it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/gq2l4t/people_are_ignorant/", "title": "People are ignorant.", "social_network": "reddit", "user": "goodbyeillmissliving", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1590373392, "permalink": "/r/SuicideWatch/comments/gq2l4t/people_are_ignorant/", "nsfw": false, "first_save": 1635426239.928723, "replies_charged": false}