{"id": "t5_2qpzs_t3_m7ap3x", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I feel as if I have no one in my life that actually cares about me.. everyone is only pretending to care and then tells me they can’t help. It’s so frustrating. No one ever visits me, I live on my own & am able to do whatever I want.\nI keep thinking about overdosing and seriously injuring myself. I know I should probably get myself admitted to the psych ward if I’m feeling suicidal but my brain tells me that no one will take me seriously unless I do something to harm myself. I’m kinda afraid I’m actually going to hurt myself because I keep thinking about it. I don’t want to but I might give in if this keeps going on..\n\nNot only that, I also struggle with bulimia and I’m broke. I literally have 7 cents on my bank account and really can’t afford to be throwing up and wasting food but it’s hard to control it. I could also give myself permanent heart damage if I don’t get help.\nPlus nothing feels real to me anymore. I feel as if I live in a shitty videogame and everyone around me (including me) feels fake. I think I might be going insane.. and all the ptsd flashbacks. I don’t think I’ll be able to handle this for much longer\n\nThis has been going on for years & has only gotten worse so is it really worth trying to get help again and bothering everyone? I dunno.\n\nTbh, all I really want is for someone to cuddle with me and play with my hair and tell me everything is going to be okay. Is that too much to ask for? But everyone has became so cold towards me and it affects me a lot.", "url": "https://www.reddit.com/r/SuicideWatch/comments/m7ap3x/my_brain_tells_me_that_no_one_will_take_me/", "title": "My brain tells me that no one will take me seriously unless I do something stupid to seriously harm myself", "social_network": "reddit", "user": "achickenugget", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1616015247, "permalink": "/r/SuicideWatch/comments/m7ap3x/my_brain_tells_me_that_no_one_will_take_me/", "nsfw": false, "first_save": 1635422929.5978773, "replies_charged": false}