{"id": "t5_2qpzs_t3_q90kea", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "Hi all. \n\nAs of yesterday, I broke up with my boyfriend. My life has been going terribly, but I will spare the details. I felt I had nothing going for me but him, and that suicide could be my only option to be free of the pain. I made a plan. \n\nYesterday, I broke up with him. The main reason being that when he lost me, I did not want the grieving process to be so hard. I wanted him to see me as an asshole. I was much less caring the days leading up, when I am typically a sweet and attentive partner.  But when I did, I gave him a real and legitimate reason to break up, one that involved the only big fight we’d had that happened to be recently. The reason for breaking up is something I wanted to talk out, but in my suicidal state, I decided to break up instead. I thought it would be an easy out and less painful for him when he got the news. \n\nToday was my planned day. Again, I will spare the details. But it involved a chat with the suicide hotline after my dangerous failure and the police department calling me. \n\nI have since changed my perspective, I feel after that attempt it opened my eyes to so much I could have lost, and how badly I hurt him. As selfish as it is, I feel like a pathetic person for breaking up with him when he was one of the best things that has ever happened to me. \n\nI want advice. Do I tell him what happened? Do I explain it to him? I feel like doing that is manipulative and wrong and selfish, but I would do anything in the world to have this boy back. I didnt want to lose him, I only wanted to end my pain. I didn’t consider the repercussions of a failure", "url": "https://www.reddit.com/r/SuicideWatch/comments/q90kea/my_attempt_failed/", "title": "My attempt failed.", "social_network": "reddit", "user": "Ok_Dig3811", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634342194, "permalink": "/r/SuicideWatch/comments/q90kea/my_attempt_failed/", "nsfw": false, "first_save": 1635425565.443498, "replies_charged": false}