{"id": "t5_2qpzs_t3_mf0azr", "request": ["56f46b9a-59d4-48f0-aed3-4247ea68706d"], "text": "As of late I have been extremely depressed. I can blame it all on the fact that I am still in quarantine and my thoughts are getting the best of me. I can also blame it on having to listen to everyone in my household bickering and I have to watch the world and  my friends continue on with life while I’m still trapped inside this shit show with the responsibility of taking care of everyone including my 2 year old brother. Anyway, the point is that I took too many pills with the intention of inducing a comma or suicide. The next day I woke up and obviously it didn’t work. I told my mom that I need things to change because of my mental state and it turned into a yelling match until I told her what I did the previous night. This was the most vulnerable I have ever been because usually when I talk about my mental state it makes me feel worse and everyone gets in a fight. However, I thought it would finally give me freedom from feeling ignored. But, my parents just ended up taking me to my grandparents for a week and that was that. We haven’t talked about what happened or my mental state since then. I feel like I’m burying myself deeper into sickness so I can call attention to myself. I feel like I need to dive into the stereotypes of being super skinny or moody so that I can be seen if not heard. I just want to call out for help without it being ignored or a burden.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mf0azr/whats_my_options_i_told_my_loved_ones_i_tried/", "title": "What’s my options? I told my loved ones I tried committing suicide and I feel like they don’t care.", "social_network": "reddit", "user": "Mundane_Blueberry_71", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1616933550, "permalink": "/r/SuicideWatch/comments/mf0azr/whats_my_options_i_told_my_loved_ones_i_tried/", "nsfw": false, "first_save": 1635428371.494288, "replies_charged": false}