{"id": "t5_2qpzs_t3_mj0o1u", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "My SO broke up with me a week ago and originally he was going to wait until I got on my disability to move out so by then I can afford the rent on my own and he could find somewhere else. We had agreed to be friends at that point. Then I had a talk with him where I tried to tell him some things I realized and tried apologizing for my part in stuff. In that convo he confessed that he isn't in love with me and feels like he may never have been and that he's only been with me out of guilt or feeling sorry for me. I was taken aback but I told him I don't believe that. As you can't fake love and affection and everything he did for me to show me he cared for over 4yrs. And I felt his energy of love. He did have moments where he confessed he didn't always feel a connection to me or he was dealing with his own demons and I felt that too but I KNOW he loved me and showed me in so many ways. And I know the first year we were together I'll admit I pressured him a lot to be with me when he first tried to break up with me trying to convince of the good we were but then I got pregnant and miscarried and he left me the next day. We were broken up for months and when he checked in with me I'd be honest and tell him how miserable I was without him but he eventually cut contact when he said he was becoming exclusive with someone he was dating (he doesn't believe in friends of the opposite sex when in a relationship) and so he cut me off but then month or two later he called me and asked me to come over. I did and he told me he cut off all the women and so on weeks ago and decided to focus on his celibacy and dedicating his life to God again but that he felt like something was missing and he felt it was me so we got back together. We broke up a couple months later because I had some serious mental health issues and he basically told me I need to get help and can't be with me. So we weren't together for a bit then I called him crying one day because I had gotten beat up by some guy on the street (I was homeless at the time) and he invited me to stay with him as friends. I was fine with being friends and honestly just happy to have him in my life again but then he again asked me to be with him but we broke up again as we were fighting I think. Again we still decided to live together as friends. We got kicked out of our place and to make sure he had a place to go too I asked my dad to take us both in which he did. Again weeks later he came to me and which he calls when we came to a \"common ground\" and we got back together decidedly for good this time. And we continued pretty happily for the next few years. We had our spats and there was a time where he was desperately needing space but because he's an introvert and isolates a lot to gain clarity not because we were having too many issues. And other than one moment we almost broke up but worked it out. Anyways, that whole time he took good care of me and helped me get better. I'll admit I didnt always work on myself like I should of and I was in and out of the hospital for awhile. But he stayed dedicated to me. Even asked my parents permission to marry me Sept 2020. But the months before we left my dad's in I think oct 2020 we had been fighting a lot as he had a lot of insecurities about something I don't want to get really into. And I remember right before he left my dad's to go live on the streets because he couldn't stand my brother crossing boundaries continuously, he had told me I need to get my shit together or he couldn't do this anymore. When he left, I went to go be with him as I know he struggles with paranoia and so I didn't want him out there alone. Thankfully a few weeks later my cousin took us in. Even though we were away from that drama new drama began between us and eventually in Dec 2020 he broke up with me. Then we had decided to be friends still living together and being exclusive at least but no title or expectations from each other. Separate as to work on ourselves and our goals. It was hard at first because I'm an affectionate person and I missed his touch and him sleeping in my bed but I had accepted it as I at least had him in my life. But then again suddenly he told me that he feels like it's what God wants for us to be together and that we were married in God's eyes. So we got back together again at the end of Feb 2021. Things were generally good and he said he felt complete again and felt good sleeping in same bed again. Even when we'd fight sometimes still he'd tell me repeatedly he saw me as his wife. And he would remain dedicated to me and I was already devoted to him so it just felt right. We had rocky moments but the last week or so we were together things were damn near perfect. I hadn't seen him so loving and empathetic as he was since those beginning years at my dad's when we came to our common ground. We were happy and he repeatedly said that he knows we will fight but we will get through it together. But then suddenly literally out of nowhere, he I'm assuming was triggered and he said he can't be with me. He understood it was most likely his addictions that came back to haunt him and helped him make that decision but either way he seemed to get darker and darker as days went on. There was seemingly nothing I could do that was right. Either way he was adament that he needed to be away from me to gain some clarity. At the time he told me he would allow me to stay here and he would move out but I told him I couldn't afford rent if he left so I said I would leave. While making arrangements he said that he wanted to break up right way and not leave either of us in a dire situation. Kept saying he wanted to be friends still and wanted me apart of the podcast he was creating and we were planning still when we were together. But then that day happened where he told me he never loved me or wanted to be with me and I told him not in a pushy way but just basically said I don't believe it and I don't accept it and I will give him his space still and be his friend only if that's what he needs but I still saw him as my husband and I was going to remain faithful even if he didn't and I was going to remind him why he fell in love with me in first place. He didn't like that very much. He spoke to me after and said that I was out of the podcast and he wanted me gone in a couple weeks after my son's birthday party we had already planned together to have our kids over. But after that he wanted me gone or he was leaving. That was just Tues. I don't know why me saying those things made him flip the switch but he just told me he warned me if I was gonna make things difficult he would need to leave and I didn't understand how that was being difficult. But whatever I said I would go because I wanted our dog to stay here with her puppy friends and have a yard and be comfortable. And my cousin already said whoever could pay the rent could stay and I couldn't so I planned my way of leaving. That night he eventually came around and began talking to me and helping me out. The next day he even took me to my doc appt and was joking around with me frequently. That night we even watched a movie together. The next day I had an appointment I had to go to and when I came back he seemed distraught. Then eventually he started giving me major attitude. Then he went inside and I overheard him saying some things about me so I went inside and he told me his friend is on his way and he's getting pick up and he's moving out. He packed his things and refused to talk to me. I kept asking what I did and what about our dog and all the plans for me to leave instead and so on and he said he didn't care he just couldn't be around me anymore and needed me to leave him alone. I was devastated as it was so sudden and he knew I couldn't afford the rent and knew I didn't have anywhere to go yet or have anywhere for our dog and so on. So why was he doing this to me? What I do that was so bad to make him leave suddenly when we were friendly just the night before. We hadn't even interacted much that day so what set him off?? \nAnyways an hour or so later he left and I didn't stop balling until I eventually cried myself to sleep. Today was my first day without him and I could barely function. I finally ate for first time a little while ago but could barely hold it down. I've been either numb, crying like crazy or being in a complete panic this whole day and I've been fighting every urge not to call or text him because God forbid I ever want to feel like he only came back to me because he felt sorry for me. So I'm trying to give him his space.. but I'm utterly lost without him.. I know it would be the same feeling if it had been weeks from now but at least then I would have somewhere to go and my dog would be somewhere safe with him and we could hopefully get back together after some space which he did say was a possibility when we first broke up. But now I don't know what I did. I have zero closure. And am about to lose my dog and home and my mental health program I'm in because I'll have to move somewhere far away and out of their service area. I'll admit I am very codependent on him and so I literally feel like I can't function without him. At least if he would have given me the couple weeks I could have prepared myself better and also got that last day with us as a family with our kids together. Now I may never see them  again and my son never see him again and I'm gonna lose everything now.. \nA part of me is still praying he sees the error of his ways and realize the love we share and that were better together. Or at the very least live together as friends to help each other survive as he is currently probably couch surfing as I know he has nowhere to go right now.. \nI just feel like the inevitable of me wanting to die all these years is just coming to fruition and the end is coming soon but my only hope is that he'll come back..", "url": "https://www.reddit.com/r/SuicideWatch/comments/mj0o1u/lost_and_devasted_dont_even_begin_to_describe_how/", "title": "Lost and devasted don't even begin to describe how I'm feeling right now", "social_network": "reddit", "user": "Pr33ty3y3dmama", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1617421440, "permalink": "/r/SuicideWatch/comments/mj0o1u/lost_and_devasted_dont_even_begin_to_describe_how/", "nsfw": false, "first_save": 1635427139.2917325, "replies_charged": false}