{"id": "t5_2qpzs_t3_k9q6x6", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "Alright, part 3 time I guess. Been a few days without updating this sorta online diary, nothing much happened but I feel as though I gotta think some stuff through, which works best for me while writing apparently, so here we are... even though I should probably be rehearsing my presentation, but that can wait a bit.\n\nThis week has been odd. I saw her last saturday again and it was quite a bit different than expected. I probably should've written down my immediate thoughts, but oh well I'll try to recreate them from memory I guess. When I showed up she asked if we could stay outside a bit (in the bloody freezing weather) as her mother had... let's call it an episode. Anyhow, we talked a lot, and were very meta regarding the relationship and how we think about the future. She was very honest and I appreciate it, though I have a feeling she wasn't being 100% honest. And I don't mean with me, I mean with herself.\n\nAnyhow, eventually we went to her place and just lay on her bed for a few hours. When entering I got to see how deceptive her mother's behavior really is, she acted all happy and joyful like nothing was up, even though her daugther had just informed me of her earlier state. Quite interesting to see to be honest, but not completely unexpected.\n\nThe idea of breaking up had been on her mind for quite some time, she says she doesn't know why, but I think she does, and I told her so. I told her that I think she's probably lying to herself in some way, at least that's what it sounds like. And usually lying to yourself is because you're scared of something, though I only made that connection later. We still had a great time, and I'll see her again on friday, but there is something that's been on my mind today.\n\nBack in the clinic, there was this sports therapist, and he seemed a very respectable man, someone who would probably make a good role model. One day during my stay he told me that he's noticed something about me that might interest me. According to him, I was too nice. Now, he was right that it would interest me. I very much disagreed. I had read up on \"nice guys\" and people who aren't standing up for themselves and considering I had stood up for myself and my relationship in a way that resulted in a fellow patient having to switch stations (She \"attempted\" suicide twice infront of us and I broke my silence on that after she threatened to get one of us kicked out, for all I care she deserved it.).\nBut recently, I thought about again. Now, this may be taboo and rule and is you don't talk about it, but why would I lie, so here we go. I used to read a lot about the red pill, the subreddit and \"philosophy\", and for a while I believed it to be fully accurate, actually I still believe in it's accuracy. The stuff I have read and seen in other people, though maybe the result of some confirmation bias, seems to certainly validate the red pill as a useful tool. \n\nAnd a lot of the stuff in the red pill is tied to not being \"too nice\", though nice really means not having respect for yourself in this case. The idea of nice isn't usually even a useful one in my opinion, as many things which aren't \"nice\" but just plain pathetic are considered as such.\nAnyhow, I believe this sports therapist, whom I'll call Mr S from now on, saw this in me. At the time, I very much disagreed. If you asked any of my friends or fellow clinic patients they probably would've disagreed as well. But maybe he was right to some extend. That being that it was fundamental to my personality and that I may be able to hide it sometimes, but it's gonna come out from time to time. \n\nAnd recently, I think it did again. When I look back on these past few weeks, I have acted quite pathetic, cared way to much about the relationship, when frankly, why would I put so much effort in, why would I take responsibility for everything that went wrong, when clearly it's not my fault. Why.\n\nProbably because, as Mr S said, I'm \"too nice\", but not in a good way. i care too much what other people, mostly her, but in also general other people think. And like a catholic saying he's a terrible sinner and begging god for forgiveness I have done something similar with her. Obviously, this is not attractive, but ignoring that, it's also just pathetic and causes me to lose respect for myself and puts her on a pedestal which she doesn't deserve (she's after all also just a person).\n\nI should probably keep reading \"No more Mr Nice guy\", as I've noticed especially recently these trends emerging, maybe even read up some redpill but try to make sure it doesn't turn me bitter again, as it has done so in the past. Seperate the useful stuff from the ideology so to speak, as one should always do. \n\nAlso I've recently seriously considered breaking up myself, but this time not for any \"benevolent\" (fear of her breaking up if I'm being honest) reason, but just because maybe I don't actually like her like I thought I did. Anyway, all I got for now, maybe I'll update it later today if anything else comes to mind.", "url": "https://www.reddit.com/r/SuicideWatch/comments/k9q6x6/random_venting_by_a_fool_part_3/", "title": "Random venting by a fool (part 3)", "social_network": "reddit", "user": "throwaway_vent_19", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1607513035, "permalink": "/r/SuicideWatch/comments/k9q6x6/random_venting_by_a_fool_part_3/", "nsfw": false, "first_save": 1635428473.2351427, "replies_charged": false}