{"id": "t5_2qpzs_t3_q6h9qo", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "     I am a severely depressed 22 year old woman. My mom lost her mom in a tragic accident when I was 4, my mom was 32, and my grandma was only 52. I am now 22 and my mom is 50.  I cannot shake a nearly constant and extremely overwhelming fear that my mother will go at any time. I am so scared that she will die at any given time. My depression…. means that this thought looms so largely in my mind I am currently sobbing about the death of my mom as she sleeps in the room below me. This is a nightly thing for me now, ever since I turned 22 and my mom turned 50. It seems I am grieving or mourning a loss I have not even experienced yet. \n \n    All of this to say: I can say with near certainty that I will kill myself when my mom dies. Correction — I will HAVE to kill myself when my mom dies, because I cannot imagine the pain on top of the pain I already have. I have lost many many people over the years; all my grandparents, a boyfriend, a best friend, and other family. I have known death and loss since I was 4. I have known emotional pain and turmoil worse than these griefs. And yet, I know that I cannot live in a world without my mom. Not simply because I don’t want to, but because her death will be the last straw on the camel’s back. And how do you carry on once the camel’s back is broken?  \n     I am essentially now living with 100% certainty that I will die by suicide, and it’s both comforting and scary.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q6h9qo/cannot_live_without_my_mom/", "title": "Cannot live without my mom", "social_network": "reddit", "user": "noodlesandbeans", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 22, "down_vote": 0, "creation": 1634026053, "permalink": "/r/SuicideWatch/comments/q6h9qo/cannot_live_without_my_mom/", "nsfw": false, "first_save": 1635426727.3336916, "replies_charged": false}