{"id": "t5_2qpzs_t3_gwrr27", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I am a loser. I feel like a loser. I’m 21 in college never had a job for longer than 3 months, don’t have any internships coming (never had any either), never had close friends I could rely on, never been in a relationship let alone had sex. \n\nI’m asian, live in a upper middle class area and have had a silver spoon up my ass since I was in elementary school. You don’t have to feel much sympathy or empathy for me and I’m not asking you too. \n\nFor me, my biggest fear isn’t being homeless or dying, my biggest fear is being 30 years old having a dead end job, no friends, no family. I know what is at stake if I don’t become successful or make a 6 figure salary by the time I’m 30. I know what I lose. And I’ve become accustomed to a comfy standard of living. \n\nI’m a psych major. And I go to a cal state. Psych at my school is such a shitty fucking department. They never prepared me for anything. I’m taking a Careers in psych course my LAST YEAR. This is a class that I should’ve taken my first year! But nooo they only offered like 3 sections of the course to the entire department. And each class has a capacity of like 35 students. And bc picking classes goes by priority and how many units you’ve collected guess who’s dead last for the picking—you guessed it, THE FRESHMEN. Idk wtf I’m going to do with this major. I’m not interested in research. I’m not interested in doing a shit ton of extra schooling either. I’ve talked to counselors. I go to therapy. But I’m just so lost and indecisive. My family are pieces of shit and don’t understand even if I explain. They just give me the same trite responses as always. I’m feel so hopeless. I hate my brother. I hate him for choosing business bc a part of me wishes I could’ve just chosen an easy bullshit major with clear an direct paths for people to take. I would’ve killed it as a business major but I just had to choose  psych bc I felt like I wanted to help people. But my true self always get revealed. I want money. I want to have money and live a nice life. I will never make money and I will just be a fucking self pitying  loser all my life. \n\nI’ve thought about suicide. I’ve thought about killing my self and not having to live my life anymore. Not having to live up to my family but also my own high expectations. Being free of mental torture and envy and self hatred. But I can’t bring myself to do it. I saw a clip once from this show true detective where this guy tells his partner that he doesn’t have the constitution for suicide. And that resonated with me. I don’t have the ability to pull the trigger. I’d be sad for the pain my family would feel but also at the same time a bit happy that they suffer. And maybe they’d take their own life bc of their suffering. But I can’t. I can’t kill my self bc I’m selfish as well and narcissistic. I want to live bc I could maybe end up doing something with my life. It’s sad and funny to think that that small silver of hope is what is keeping me from ending it. But it’s so small. And if anything it’s more fantasy than realistic hope. \n\nI love and hate my family. There are times where I fantasize about beating up my brother and punching him in the mouth. Telling him that I’m  the better of us. And that I will always be smarter than him. That he chose the easy path and that if I were younger and able to see the mistakes of my older brother then ofc I could be successful. I hate mom. However I could never kill her or hurt her. I would just want her to suffer in some way. Financially where she doesn’t mooch off of my father. My dad is someone who understands me pretty well. But even he is short sighted and doesn’t understand what it’s like to be a non business major. \n\nThere’s so much anger in me. Anger in myself and others.  Anger that I’m a loser and on the path to become one fully. Anger that my friends  are doing better than me when they can be pieces of shit. I’m angry that I can’t get myself out of this self pitying and just do something with my life. Also there’s a lot of sadness. Im sad that I can’t get myself out of this thought loop. This whole suicide and loser stuff always surfaces whenever it’s triggered by too much time on my hands or someone Ik has done something good for themselves.\n\nI’m not gonna reread this. I wrote this without stopping and I’m sorry if it does t make sense or is too choppy. I’m not going to kill myself. And ik then that this is the wrong sub. But at the same time I feel like it’s the right one and idk why. I’m sorry for the long read and weird format bc I’m writing this on my phone. If you want to reply please go ahead. Don’t feel like you have to beat around the bush and don’t mince your words. You can be brutal and honest. Advice is welcome. Personal experience is welcome. I will read all responses but I don’t reply bc I feel like it’s an obligation to write something back that’s heartfelt and I don’t want to be repetitive with thank yous. So instead I will do this. Thank you for your replies and concern. I really appreciate it. I wish good luck to all of you on your respective journeys and hope that you all make it one day.", "url": "https://www.reddit.com/r/SuicideWatch/comments/gwrr27/i_dont_have_the_ability_to_kill_myself/", "title": "I don’t have the ability to kill myself", "social_network": "reddit", "user": "theblackestballon", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 23, "down_vote": 0, "creation": 1591309501, "permalink": "/r/SuicideWatch/comments/gwrr27/i_dont_have_the_ability_to_kill_myself/", "nsfw": false, "first_save": 1635426655.450468, "replies_charged": false}