{"id": "t5_2qpzs_t3_b7f87b", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I've begun debating posting here since it happened, but I know it's time now. A bit over two weeks ago, my fiance passed away. It was very sudden, one night we fell asleep in each other's arms, the next she wouldn't wake up. She lasted about a week in the hospital in a coma, and then she was gone.\n\nTo start, it was the sharpest pain I've ever felt in my life. I've spent so much time crying my eyes out, screaming in the shower, into pillows, etc. But it came in waves. There were times it didn't feel real, like maybe she'll walk in the door any moment from work and it'll all be okay. Of course, it never happened.\n\nNow, it's less screaming, more constant sobbing. Neglecting myself. Not going into work. Eating a shitty diet. Before, I lived my life with fire. Honestly, it was the best my life has ever been. Good job, my side business was doing well, good connection with my family, good time with my friends, and my fiance was the best part of all. \n\nWe were together two years, and we never fought. Not even once. We had disagreements, but it was never her against I. I loved her more and more every day, and she did the same. She was so supportive, and having recently just taken a better job, we were talking about me paying for her to go back to school to pursue her degree in pharmacy. \n\nSpending time together was always amazing, and something that was unique was that as both introverts, we could easily spend hours side by side doing our own things, and it was better than doing our own things alone. I don't know how to explain it very well, but it was incredible.\n\nI'm not inexperienced when it comes to love or relationships. I've been in love before, I've even been married before, but I've never felt what I felt with her. It didn't feel like the word love even did our feelings justice.\n\nNow, my world is empty. Hollow. I feel lost out at sea with no way back, and the waves are calling me to just let go and sink. I want to. I don't have any desire anymore. I don't want to be here. I don't want to spend the next couple decades here without her. So far, I feel it's been my stubbornness combined with the fact that I know she would want me to continue on and live well that's held me back from harming myself, but I feel my strength fading.\n\nI've made an appointment with a counselor for two weeks from yesterday, and I'm going to try to hold on for her, but I'm genuinely worried that I won't make it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/b7f87b/my_light_is_gone/", "title": "My light is gone", "social_network": "reddit", "user": "andeleidun", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1553975437, "permalink": "/r/SuicideWatch/comments/b7f87b/my_light_is_gone/", "nsfw": false, "first_save": 1635422331.8467045, "replies_charged": false}