{"id": "t5_2qpzs_t3_prdjhb", "request": ["0c6360e0-5fd0-41bf-97f4-d870570d8b8d"], "text": "Hello, I’m a female, 21 years old. Just another story, that will get burried in here. But I need to share it here, since I can’t share it with anyone else. \n\nI have a wonderful life, a wonderful family. We get along so well. I love them to death. I have a job, I am a nurse and I care for others. My career had just started. I have friends, few, but they are the close ones. They support and understand me. \n\nI feel sad, though. So terribly, utterly sad. I’ve lost someone so close to me, someone I let in, someone who saw all parts of me, and loved them. And then after 3 years I let them go… for god knows what. I just.. didn’t feel happy because there were so many things happening, we were so different. And now I hurt, he won’t let me close anymore after 3 months apart (i messed up, i dipped and did NC). I realised what he means to me, how much i care and love him, but he won’t come back. I messed up.. i try each day, each day to get closer to him, but… I give up. \n\nI was not made for this, I love too hard, and now as I lost the ground beneath my feet the only escape I see is suicide. The only way out… I can’t wake up anymore, or breathe, it hurts and burns me so bad. I can’t work anymore I lost all sense of meaning. There is nothing inside me anymore.. i am so empty, and so far gone. \n\nI will jump off a building, probably, sometime soon. As my pain boils over… and I am so sorry. I just want him to know, that I am so sorry. Someone get this to him please…", "url": "https://www.reddit.com/r/SuicideWatch/comments/prdjhb/i_am_suicidal_and_tired/", "title": "I am suicidal and tired.", "social_network": "reddit", "user": "PinxxDeath", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 10, "down_vote": 0, "creation": 1632076236, "permalink": "/r/SuicideWatch/comments/prdjhb/i_am_suicidal_and_tired/", "nsfw": true, "first_save": 1635426333.4023495, "replies_charged": false}