{"id": "t5_2qpzs_t3_pr2uk7", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "I can’t shake the feeling that I am pissed off at my mom for having me.  She is diagnosed NPD, so of course she would never acknowledge she made a mistake or did anything wrong.  To this day, she insists she should’ve had MORE children!  Thank god she didn’t, I barely made it through life as it was, I have all sorts of mental health issues, and have since the day I was born, but doesn’t acknowledge that has anything to do with her.  My dad didn’t want kids, she pushed the issue, to the point where she had multiple misscarriages, had to take fertility drugs (yup, she was hellbent on having a child, and ideally more than one) but after me the last one was stillborn and she gave up and blamed my dad.   (And yes my childhood was pretty horrendous as you can imagine) And she never, ever says, hmmm, maybe we shouldn’t have had children. Never, ever, not once!  Or even that she wasn’t a perfect mom!  It’s insane.  I would never have children, in fact never for a minute even considered it for this very reason!  I know I would probably be a terrible mom, I would never want to pass on my mental illnesses, risk putting a child through that.  I wouldn’t want to put a child through 1/10th of what I went through there is no way I would ever even consider it!   But yet my mom, never even thinks this way.  She did everything right, and somehow I just turned out fucked up, for reasons out of her control.  Mom, I would love to just hear one time that you’re sorry and you fucked up and probably shouldn’t have had kids.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pr2uk7/is_anyone_pissed_at_their_parents_for_having_them/", "title": "Is anyone pissed at their parents for having them?", "social_network": "reddit", "user": "SnakeyAce", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 41, "down_vote": 0, "creation": 1632033354, "permalink": "/r/SuicideWatch/comments/pr2uk7/is_anyone_pissed_at_their_parents_for_having_them/", "nsfw": false, "first_save": 1635427968.0897365, "replies_charged": false}