{"id": "t5_2qpzs_t3_43iio0", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I am a fifteen year old with dreams in wanting to do something creative with my life. That could be either creative writing, singing, acting, or even drawing. I would love a job in those areas but recently, the world has been shoved onto my shoulders. Sorry, this might be a bit long. You don't need to read if you have other things to do. I am really not worth your time anyway.\n\nEver since I was younger, due to family problems I always locked myself up in my room to play games and go online. I was young so I thought that this feeling of emptiness and loneliness was normal. Even when we went on holidays, the family would never be happy. There was always this mask of smiling faces that even I (at a young age) could read. This continued until my parents broke up. My Dad (the parent I liked) and sister moved away and I was left with my alcoholic mother. I thought I was going to get through - boy, I regret not leaving with them.\n\nI spent a full year switching between my dad and mother, spending more time with my mother as that's what the court said. I would hate going there and because she didn't care about me, my Dad and I walked miles to get to her house. After that, he would leave me there and the next few days, I would get shouted at by my mother, my grandmother (who supported her fully) and by myself. I felt worthless. That is when I first attempted to kill myself.\n\nI won't go into details, but it was using a chemical that was used to make crystals. After consuming it and awaiting a few hours, nothing happened. I felt that even death itself didn't want me.\n\nAfter a year of that switching and feeling of depression, I ran away - twice. I did attempt once before, but I came back to the house as I saw my mother crying. That was just a fake attempt to guilt me back and it worked. She tricked me and I felt so stupid.\nI tried again and got away, running up the road, through town, and to my Dad's house. A few hours later, my grandmother pulled me from my Dad's house and forced me home. At the age of thirteen, I was beaten with a ruler. This is why I flinch at the smallest of things.\n\nA few days later, I had enough again. I ran to my Dad's house and this time, my mother was ready. She drove the car after me and was trailing me. She beeped the horn, shouted and cursed me, and then revved the engine, threatening to run me over. She eventually gave up and I got away again.\n\nI only saw her two times after that - once when she came to my Dad's house (she has a restraining order) and trashed the place, and another when we tried to fix our relationship (it didn't). Now it has been two years and I never saw her again.\n\nNow I live at my Dad's and was happier. That is until a bigger problem arrived. Now, at fifteen, I have to do my GCSE's. I still haven't fully healed from the previous events and with this extra stress, I couldn't take it.\nIn 2014, I tried to hang myself. Something took over and I tried to do it, but the pain was too much. I stopped and began to cry on the stairs.\n\nI was so scared that the week after, I told my teacher that I tried to kill myself. They contacted the social workers (who were already giving my life a new taste of hell), some other people and my Dad. Finally, I thought, I would get help.\n\nSince then, I have attempted 10 plus times to kill myself. They did not help at all. In fact, they brought the problems from the dark place I stored them into the persona I always carried around with other people. Because of this, I have been a piece of shit to my friends and family, getting irritated and angry at everything they do. I know what I am doing was bad, but letting out my anger like that is the only slight pleasure I can get.\n\nFinally, my mind snapped. Now I feel apathetic towards everything: school, homework, hobbies, and even to my own life. Even with professional help (talks, other things that I forgot about) I still can't be helped. This last week was the worst as every attempt to express myself (singing online, drawing comics, writing short stories, voice acting) was met with a mental barrier. I have given up on all of that so easily. I have been told with a bit of practice on each, I could be a master at each. Of course, I don't believe that bullshit. I have no skills or anything that would make me stand out.\n\nNow for the conclusion: next week, I am going to do something that I can't reverse. As I could stop myself from hanging by simply falling off the noose, I will drink bleach - or something else extremely toxic. That way, it would kill me before I can have any second thoughts.\n\nThis is my memoir (I guess) and I thank you if you have read all of this. I will reply to comments, but my mind is set. I have been told a lot of things like 'what about your friends/family' or 'what about the goals you have set.'\nAfter hearing both of those things multiple times, I now feel like I live for other people's happiness. Ahaha, fuck that. I don't want to live for someone else, I want to live for my own purpose. I lived with my mother for a year for her 'happiness' and now its my turn. I will be happy in the void of death.", "url": "https://www.reddit.com/r/SuicideWatch/comments/43iio0/my_story_with_depression_and_suicide/", "title": "My Story with Depression and Suicide", "social_network": "reddit", "user": "Pwnixer", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1454232964, "permalink": "/r/SuicideWatch/comments/43iio0/my_story_with_depression_and_suicide/", "nsfw": false, "first_save": 1635426314.1640694, "replies_charged": false}