{"id": "t5_2qpzs_t3_8gc856", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I’m posting this as a lucid account of my experience, it’s effectively a test run for an email I’ll need to send tomorrow. So there’s no expectation for anyone to reply - though it’d be nice if others could chip in their thoughts or experiences :)\n\nHow I feel when I’m suicidal and how I feel when I’m wanting to self harm are very different:\n\nActively suicidal (vs just ‘pondering’ it): flighy (in thoughts), derealisation, diminished insight, extreme sensory sensitivity/overload, feeling of ‘losing’ part of myself, this leads to overwhelming fear and panic, crippling indecision to the point of effective cognitive paralysis.\n\nSelf harm: very focused, clarity, acts are planned, no impulsivity, anticipation and excitement in planning/preparation, an almost ‘mastery of self’ feeling, feelings of invincibility, meticulous planning, execution and ‘clear up’ processes, afterwards a calm, soporific serenity.\n\nThe thing that strikes me is the difference in the extremes of feeling in control. Suicide = 0/10, self harm = 10/10. Also, if I’m in one of these ‘modes’, I don’t think of the other.\n\nSuicidal thoughts can leave me feeling risky, fearful and cognitively paralysed. When self harm occurs, I feel motivated, focused and committed to the act.\n\nSo effectively, if I’m ‘active’ in self harm, it denotes I’m better psychologically than when feeling suicidal. OK, this might sound obvious, but for me that translates to self harm being an indicator of ‘coming back’ to myself.\n\nEffectively, my conversations can go as such:\nThoughts of suicide?\n- Yes\nThoughts of self harm?\n- No, in this scenario self harm would be a positive action as it demonstrates a return of autonomy and insight.\n\nDoes this make sense to anyone?", "url": "https://www.reddit.com/r/SuicideWatch/comments/8gc856/self_harm_and_suicide_relationship_between_the/", "title": "Self harm and suicide - relationship between the two or discordant?", "social_network": "reddit", "user": "Antimarwil", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1525211289, "permalink": "/r/SuicideWatch/comments/8gc856/self_harm_and_suicide_relationship_between_the/", "nsfw": false, "first_save": 1635426697.3121016, "replies_charged": false}