{"id": "t5_2qpzs_t3_cd4z4v", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I'm really feeling strongly about this. The dad will be a great dad and I love and trust him. I just can't keep doing this. I've Tried my hardest to try make myself better, I have been diagnosed with depression and bulimia in the past ,  Im not depressed anymore but I'm pretty much just done with life. No goals, nothing to show for myself, and its not even like i feel like a failure. i just dont care. Im not even sure if I want this baby.. even though I tried so hard for them , I’ve previously had 2 losses missed miscarriage and a miscarriage and I feel guilty and so crap about them ,But I can't take him  away from his dad ,So I'm going to give him this gift and I think I’m going to do what I've wanted to do for so long since I was in my early teens , I’ve already voiced what I’ve needed to say to my partner but they don’t understand how I feel and what it’s like , he has also said he doesn’t want to look after them if I’m not here and I feel like a person that is going to be trapped with everyThing and what happens if I’m not here , he will need to look after him . I feel guilty that I am already making myself sick all the time too , I think I’ve made up my mind and I needed to get it out there , I’ve already made a book with a few letters for my son to read if I do leave him explaining why .\n\nIts not that there is really something wrong. Im just not living happy . Its a conscious decision not made by depressed thinking. I just want to fall asleep in peace and never wake up. The whole thing just seems Easier to me ..I’m sorry \n\n\nJust needed to get this out. Thank you.", "url": "https://www.reddit.com/r/SuicideWatch/comments/cd4z4v/i_think_im_going_to_kill_myself_after_i_have_my/", "title": "I think I’m going to kill myself after I have my son", "social_network": "reddit", "user": "Cantdoitanymore222", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 30, "down_vote": 0, "creation": 1563121886, "permalink": "/r/SuicideWatch/comments/cd4z4v/i_think_im_going_to_kill_myself_after_i_have_my/", "nsfw": false, "first_save": 1635422944.4021788, "replies_charged": false}