{"id": "t5_2qpzs_t3_etonnr", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "I’m a 20 Y/O collegiate dropout, about to turn 21. I come on here every so often because my mind can sometimes get in this kinda rut. I spent a lot of my college career wasting my parents money and time. I left high school top 10% of my class and with a 1500/1600 SAT, but none of that ever really felt like it was my doing, more like pressure on my parents to do well. As soon as college came along and my parents weren’t around me everyday, I burnt out pretty hard. My failure to have a full successful academic year in college is reinforcement that nothing I earned in this life was because it was something I wanted, just something to show other people to let them know I’m ok. My passion and aspiration in life is to do comedy, which I was pursuing actively in college for 2 1/2 years.\n\nI don’t know where my life is heading. I’ve considered joining the navy, but idk how dedicated I can be to my dream in the service, and I’m worried if I join my opportunity at a comedic career will go up in smoke. I currently have no job but have been applying ever since I dropped out, and the service seems to offer a lot of benefits in exchange for your time and labor.\n\nI do not want to commit suicide right now. I know my life has way too much potential right now to just let go to waste. But I have set an ultimatum for myself. If, by 35, I’m unhappy with my life’s situation, I will kill myself without hesitation. By that age, I think life’s opportunities begin to narrow and you kinda set yourself along a path. People say life can change but, in terms of every ‘adult’ person I’ve known, they’re lives pretty much played themselves beyond the 35-40 point. I would rather end it knowing I gave it a shot than letting my defeated spirit linger on. I can tell when I’ve lost.\n\nI’m just curious as to wether or not you guys have ever thought about a long term pact, and also to ramble because I’m a little lost life wise right now. I’ve considered suicide in the past and have been diagnosed by my campus therapist with depression, but haven’t taken any medications or what have you. If anyone feels compelled to write anything, it would be much appreciated.\n\nThank you for your time.", "url": "https://www.reddit.com/r/SuicideWatch/comments/etonnr/anyone_set_a_long_term_date_and_stipulations_for/", "title": "Anyone set a long term date and stipulations for their suicide?", "social_network": "reddit", "user": "JDsDayOff", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 10, "down_vote": 0, "creation": 1579943605, "permalink": "/r/SuicideWatch/comments/etonnr/anyone_set_a_long_term_date_and_stipulations_for/", "nsfw": false, "first_save": 1635427754.4573588, "replies_charged": false}