{"id": "t5_2qpzs_t3_qbqoqk", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "I used to have have rising career in the audiovisual industry but it was destroyed by managers I encountered in former job, several years ago. Since then, my career is filled with shitty consumer services, moderation, and risk/fraud jobs. They are jobs were everything is done to avoid you to use your brain, you are just a robot who have to make an high number of tickets by day. If you don’t do them, you are harassed by your team leader and if you make them your target is augmented. Anyway, I’ve been depressed for years, now I just have the energy anymore. I know that I’ll never recover a interesting career; and the fact that I contracted I chronic disease because of the stress avoid me to return to school. I’m so depressed that I can’t concentrate anymore on my new job. The only thing who retain me to not kill myself is that I don’t want my flatmmate who is younger than me (25yrs) to have to deal with the discovery of my dead body. Because of my chronic disease I refuse to date People. Considering the goals of my life were to find a guy to whom I would have been devoted and then to add a career in a specific domain; but these two will never happens anymore. I don’t see why should I continue to live. Wake up every morning to be treat like shit by a boss who is probably less graduates than me. Being exhausted after my shift, with no strength to do nothing except watching YouTube. And also to have deal with all the traumatic memories of my life. I can’t anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qbqoqk/im_30_and_i_dont_have_the_energy_anymore/", "title": "Im 30 and I don’t have the energy anymore", "social_network": "reddit", "user": "JorisKs", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1634696016, "permalink": "/r/SuicideWatch/comments/qbqoqk/im_30_and_i_dont_have_the_energy_anymore/", "nsfw": false, "first_save": 1635427976.0728495, "replies_charged": false}