{"id": "t5_2qpzs_t3_qb9cm8", "request": ["fa52eed9-681b-4f68-b3d1-78c0eec9a3d2"], "text": "Happiness feels like some sort of fable or myth to me. I see people laugh, and smile, and seem so genuinely happy and enjoying life, and to me it’s just so bizarre. I can’t even seem to recall what that actually feels like. I can’t help but be so envious about it. And how I keep trying to reach for a taste of it, and only pull back sadness, or raw apathy.\n\nI’m trying so hard. I really am. I do my best to follow my doctors’ and therapist’s advice. I always try to push through my wretched life each and every day. But I just can’t find anything. I can’t find any enjoyment in any task or hobby. I can’t find motivation to follow up on anything remotely interesting or important. I can’t find a way to fill this gaping maw of loneliness in my heart, or to even feel like more than just a reject of a human being.\n\nI almost killed myself a couple weeks ago. The pain was just too much. I was going to just stab myself endlessly with a knife, until I couldn’t feel anymore. If my family wasn’t present at the time to calm me out of it, I probably would be in a grave by now. I want to keep going, to keep hoping in the future. But a part of me is disgusted at myself for cowering out of it. For choosing to continue to stay in this nightmare, rather than freeing myself for good.\n\nI’m trying so hard. But I’m so tired of trying.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qb9cm8/is_this_what_it_feels_like_to_be_completely_dead/", "title": "Is this what it feels like to be completely dead inside?", "social_network": "reddit", "user": "TheOverlordCrono", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 16, "down_vote": 0, "creation": 1634642259, "permalink": "/r/SuicideWatch/comments/qb9cm8/is_this_what_it_feels_like_to_be_completely_dead/", "nsfw": false, "first_save": 1635425427.2875285, "replies_charged": false}