{"id": "t5_2qpzs_t3_juh8w7", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "Hi...I know this question might seem strange to people but I’m wondering if a US citizen is allowed to get assisted suicide/euthanasia in a different country.\n\nWhere do I start? Ever since I graduated high school, I was always unsure on what to do with my life. Every time that my family asked me about my future goals and aspirations...I always ignore the question and reply with a simple “I don’t know.” or “I’m still thinking about it.” I noticed that I became extremely depressed around 9th grade but I never was allowed to talk about it with any of my family members. My family members see mental illness as some sort of “taboo” or something that disappears easily...Not only that, but it will lead my family to go into financial issues since my family didn’t have the money or the resources to afford healthcare. So, I have never received any mental health help or things relating to that...\n\nAt this point, I don’t even care about my life and what my family thinks about me. I just want an easy way out of life...I’m just so sad of waking up everyday and worrying about the next thing that will happen in my life. You know those dumb mistakes...that you make and just awfully regret it later on. I’m experiencing that but I just don’t want to think about these things anymore...and become a better person.\n\nPlease. I really just want to rest and just die peacefully without having to worry. I know some may call me a “coward” or “selfish” for my decision. However, my decision is not to hurt my family or anyone...it’s just that I want to be out of the miserable life that I chose. I made bad decisions that cause me to hate myself. I can never forgive myself till this day.", "url": "https://www.reddit.com/r/SuicideWatch/comments/juh8w7/assisted_suicideeuthanasia/", "title": "Assisted Suicide/Euthanasia", "social_network": "reddit", "user": "SadlyAlivee", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1605420388, "permalink": "/r/SuicideWatch/comments/juh8w7/assisted_suicideeuthanasia/", "nsfw": false, "first_save": 1635428488.2923977, "replies_charged": false}