{"id": "t5_2qpzs_t3_7lc1d9", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "Throughout middle school I was considered above average intelligence (Put into AP classes, accelerated classes, etc.). I maintained good grades through middle school but once high school hit things went south. My grades got worse and worse every year. The thing is my parents have extremely high expectations of me. So when when my grades started dropping they became really harsh on me. I have a hard time putting into words what I mean by that but the best I can say is that my life began to revolve around school. When I would get grades back they would yell at me and ground me and all of that. Which is understandable because grades are important. But I made a pact with them. I had multiple long talks with them and I promised that I would get straight A's in college and make them proud. But I dont know what it is thats wrong with me but not only did I not get straight A's but I failed horribly in 3 of my classes. I am so fucked up that there would just be days when I would lie in bed all day instead of going to class. I skipped all my labs and homeworks and pretended like my grades weren't beyond repair. I have had suicidal thoughts for a long time but in the past month it has been worse than I had ever imagined it would get. I think about going through with it at least 10 times a day. I fantasize about taking a fistful of Oxycontin and peacefully ending it all. Even with my friends I can't be happy. Im withdrawn and weird with my relatives and friends who I should be most comfortable with literally because I can't stop thinking about how much I hate myself and my life. Alongside my grades I have failed them many many times. I have had 3 speeding tickets, got caught throwing a party while they were out of town, and the biggest one of all was when they found my drug stash. I know that I am a fuck up and can't be convinced otherwise. When I checked my midterm grades I had an 8 in one of my classes.\n\nAn 8.\n\nWhen I saw that I just about made the decision then and there. How can I even begin to justify getting an 8? I have wasted my parents time, wasted their money, lied to them, and shattered whatever hope they had left in me. \n\nI feel like I did a bad job explaining how bad my situation is. It's not just bad grades. It's the fact that I have put myself in a position to fail as badly as I have. I failed myself and failed my parents. I put myself in this position. I didn't get paralyzed or attacked or anything else that isn't my fault. I simply did not do what I was supposed to do. I have no clue in the slightest of what to do with my life now that I have failed my parents as badly as I have. Because they won't understand. They aren't the type to say \"lets move past it and fix what went wrong\", they are more the type to say \"What is wrong with you? How the fuck did you fail 3 classes? And you got an 8% in one? You're a fuckup and you always have been.\". I literally do not understand myself or what is wrong with me. I am depressed because I got bad grades and I got bad grades because I was depressed.\n\nI'm just a failure as a person and no matter how hard I try not to be I can't not be. My room is a mess, I eat unhealthy, I hate my body and feel ugly all the time, I do drugs, I stay out late, I sleep til noon.\n\nI know that an Oxy OD is painless. Hell its probably even enjoyable. I know where to get it within a day. I'm atheist so the thought of going back to the nothingness of before I was born sounds much more enjoyable than what I'm going through now. \n\nI feel scared and cold and tired and anxious and depressed at all times of the day and it has been this way for a long time. I was never diagnosed with depression or anxiety but I know something is wrong with me. I can feel the fucking stress behind my eyes. The world feels cold and I just want to break down and cry. \n\nI don't even know why I'm posting this because my situation is pretty stupid.", "url": "https://www.reddit.com/r/SuicideWatch/comments/7lc1d9/i_fucked_my_life_up_and_cant_take_it_anymore/", "title": "I fucked my life up and can't take it anymore.", "social_network": "reddit", "user": "RedditIsAwesome888", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1513886810, "permalink": "/r/SuicideWatch/comments/7lc1d9/i_fucked_my_life_up_and_cant_take_it_anymore/", "nsfw": false, "first_save": 1635427777.509475, "replies_charged": false}