{"id": "t5_2qpzs_t3_q0clhq", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "Today I woke up to the sound of my neighbours bellow me screaming, arguing and slamming shit. It’s been happening more often lately, especially on the weekends. I have ptsd, bpd, & severe GAD & depression. I moved out of my parents 4 years ago to escape a toxic home. I was raised in a family who always screams at each other, constant bickering, slamming shit and breaking furniture. I have grown severe mental issues because of my childhood and flinch easily at loud noises. \n\nI live in a very old apartment building in a rough part of town because it’s all I can afford. Covid robbed me of my dream job & all friendships, so I have been a loser sitting at home playing video games all day to escape reality while living off EI. I’m pretty sure my benefits just ended today, idk, I’ve been too scared to look. I’ve saved up 3 months worth of rent and I’m too scared to spend any money because I don’t want to get a job because I’m too adhd for university and couldn’t pick a career for the life of me. Now I’m a jobless loser with 0 ambition to be a wage slave.\n\nI am stuck living in this apartment that *used* to be the nicer part of the shit area. Well thanks to covid, my rental management accepts anyone & everyone to keep rooms filled so now there’s lots of crackheads and sketchy people who live here. The lobby is always filled with garbage now, homeless peoples bikes and garbage bags parked INSIDE the lobby while they buy crack from suite 18 bc they marked in the elevator. Oh there’s now crackheads spraying grafiti on the inside of the elevator door too. I am living in a shithole, but this is what I get for being a useless loser living in poverty.\n\nThe walls and floors are paper thin so I awoke to the couple beneath me screaming and slamming. I left the apartment at 10 am to escape the incoming panic attack I would have if I listened to it any longer. I come back at 2pm praying they would be done, but nope. Still screaming at each other. I am broke and cannot afford a lot of furniture so I hear EVERYTHING. They always slam shit so hard it shakes my floors and triggers my ptsd very badly, I think the person is getting abused downstairs so I had enough and finally called the police on them to file a domestic abuses complaint. I packed up my ps4 and let the cops in as I made my way out.\n\nI’ve resorted to going to my parents on the weekends to avoid their slamming and fighting. I’m so sick of living in a shithole and being forced to stay away from home every fucking weekend. I miss my poor cat who is my lifeline, I don’t like having to leave her alone. But if I stay it triggers my manic depressive BPD and I’ll just lay in silence fixating on the thumping and arguing while I contemplate suicide bc I hate my fucking situation. \n\nNo one will probably read this because it’s so long, but I’m tired of being poor. I’m tired of having noisy abuso e neighbours triggering my BPD by slamming shit shaking my floors every fucking day. I’m scared of going back to my apartment tomorrow because even though the cops came, nothing will change. I still live in a shithole and a never ending nightmare of being woke up to slamming. I’m tired of careless people. A couple weeks ago they triggered a BPD episode to the point where I punched a hole in the wall. They love to blast music and movies with their big ass bass that shakes my floors. I wrote a letter to them begging them to stop. Nothing changed. The rental company will do nothing as always. Or they’ll kick them out so crackheads will move in.\n\nNo where feels safe anymore. I miss my poor baby cat who is alone at home now. Im scared to go back to my apartment tomorrow because they’ll probably just keep slamming shit. I CSNT afford to move to a new place. I can’t find a job.\n\nI am currently on risperidone (antipsychotic) at night time so I’m calm now, but during the day my mind is hell. My antidepressants don’t work and my doctors refuse to switch my to different ones. CBT works for a day or 2, but I’m back to a negative mindset when I have to deal with this shit at home 24/7.\n\nIf someone manages to read this all and can give advice … thank you. But I truly see suicide as the only way out of this shit life. Im tired of suffering bc other ppl are careless. Im terrified to go home tomorrow and be back to being alone with my horrible thoughts as my floors shake bc my neighbours will probably be fighting AGAIN.\n\nI just want it to be over. I wish I could just get it over with and kill myself. Im all alone, suffering always.\n\nTo the 0 ppl who read this novel, thanks. Maybe it will be the last I ever post. Goodbye.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q0clhq/i_wish_i_had_the_balls_to_kill_myself_already_no/", "title": "I wish I had the balls to kill myself already. No where feels safe and I have no purpose in life. I am a loser.", "social_network": "reddit", "user": "siliconexx", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1633244146, "permalink": "/r/SuicideWatch/comments/q0clhq/i_wish_i_had_the_balls_to_kill_myself_already_no/", "nsfw": false, "first_save": 1635428088.6164215, "replies_charged": false}