{"id": "t5_2qpzs_t3_nssobl", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I am just tired, 18 years old, and my life is really fucked up, I have friends, but I don't like being with them, because I think that I always need to fit in for them to continually hang out with me, I came from a lower middle class family and most of my family relatives abused or bullied me, only my mom is the only one that really do care about me, but she has her own problems and can't help me.  I am suffering from really bad depression, OCD, and social anxiety for like 6 years now since I was 12 and I can't really remember the time where I am really happy, I've done everything I could to help myself, meditate, exercise, do my best at school, find hobbies, read a lot of books, but I always kept on relapsing.\n\nI can't socialize and be myself anymore, my mind is just fixated to the idea that everyone will gonna be mean and will gonna judge me, just like how people treated me when I was young, I know it's not the case but even how much times I try to face my fears the fear is always there, and the OCD is becoming unbearable to the point where I can't do basic tasks without stressing myself too much, everyday is just pain. And I live in a third world country, where people that are mentally ill are frowned upon and there are a lot of toxic attitudes most people possess here and embedded on our culture, I honestly want to get the fuck outta here and wish I was never born here.\n\nAnd to make this worse, I am going to College and have to choose what is the path that I will gonna take, which is I don't know, my mental issues just took the life out of me that I am not interested about anything, I love music but I know I ain't gonna be making a living out of that, and my family is toxic, and they are pretty ignorant it always pisses me off.\n\nI am just tired, my mom did fucked up for making me, I didn't even fucking chose to be here, my life is just full of unfortune and tragedies, I am just tired, I think I am killing myself, it's becoming unbearable now and I think this is the only way I am giving myself a favor because I know there's a big chance things ain't gonna be better for me. I have no purpose here anyway, so fuck it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nssobl/i_think_that_killing_myself_is_the_only_way/", "title": "I think that killing myself is the only way", "social_network": "reddit", "user": "MessyNinja", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1622888320, "permalink": "/r/SuicideWatch/comments/nssobl/i_think_that_killing_myself_is_the_only_way/", "nsfw": false, "first_save": 1635428099.3651528, "replies_charged": false}