{"id": "t5_2qpzs_t3_k8idws", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "Hello guys. I am a 22 years old guy from an European country. \n\nRight now I am sitting in my rented flat and I am feeling totally worthless.\n\nI am a final year Bachelors student in International Relations. The last three or two years have not been very good for me, with the year 2020 being the absolutely worst in my life. \n\nI will start from the beginning. I have always been a great student, I went to elementary school for children with above-average intelligence and I was still one of the best there. I guess I could be labelled as ''the gifted kid''. Afterwards, I got into one of the best high schools in the country, and still was performing very well. Furthermore, I played football for my local team and did other sports too.\n\nHowever, everything changed around the age of 19. I experienced a rather big love disappointment as I was finishing HS. My thoughts were suggesting that with Uni life, my time will come also in this field I have not been very succesful in. I could not be more wrong. Not only did I experience even more failures, I started underperforming in other areas as well. I chose International Relations as my study field, cause this was the field I always inclined to, reading maps, historical and political books from a young age. For a moment, I considered studying natural sciences as well, but I told myself to follow my biggest passion. I moved to another country to study.    \n\nDuring my Uni years, everything started slowly declining. I started doubting my choice of study field. I considered studying law, but I stayed after the first year, reminding myself about my life goals and why I chose IR. During the second year, I had the same doubts and I was not satisified with the Uni itself and what they taught us there. Furthermore, IR is a very competitive field of study and I was afraid, that I could not match the best in my field. With my mind being overloaded with these thoughts, other aspects of my life deteriorated as well (I was always exhausted, my health became poorer, I stoppped doing sports to the extend I did it before). Anyway, I decided to finish my 3-years Bachelor, go for a semester abroad during that time and see if it works out.\n\nThe semester abroad was the best time of my life. Not only because of drinking and parties. What I valued the most there was what kind of person I was - the best of me. I did not think about my career at all, I just enjoyed Uni, friends, trips, extracuricullar events. I volunteered a lot. In the beginning of 2020, I returned home. I hoped, that I could keep the drive from this semester for the rest of my studies and I promised to myself, that I would carefully reconsider my study field during spring. I even applied for the law school, back in my home country.\n\nBut then, Corona came. I had some unexpected health problems. I received scholarship, but at the same time I did not finish my thesis and I had to prolong my studies. I was closed at home with no social contact. But what is the worst, I did not go to the law school - I was too depressed at that time and I just chose the easier option - to continue in my prolonged Bachelor and decide for the Masters next year. I was so close to starting law, I was even in the Uni building itself for the sign-up- but I ended up giving up on it. \n\nNow, this is what is killing me. I feel like I wasted my last chance for remedy. I knew what to do and I did not do it. I am hugely underperforming, because I don't believe in what I do. What is worse, this year even my friends and mostly family noticed my underperformance. Majority of my friends (from the elite HS) are doing just great. Suddenly, I am not among the best - it´s the exact opposite. Everyone is shocked and asking, what is happening.\n\nI feel the worst, because I fucked it up myself by indecision and fear of change. My parents always provided me with everything I needed, even though we were not rich. I am 22 now and around 24-25, I am expected to finish Uni and start earning real money. If I started a new degree next year, I would finish at 28, which seems totally late. \n\nI guess the biggest problem for me is that I have always been used to success. Now, that it's not coming, I have a huge problem accepting it. I am feeling like shit and therefore I am wasting my time in depression.\n\nWhat do you guys of Reddit think? It may seem like a stupid petty problem for you, but I makes me feel like a worthless person, who wasted his potential. Maybe you experienced a similar situation and could give me a tip? I am feeling really shitty, especially during autumn. Maybe I am just spoiled and I should get my shit together.", "url": "https://www.reddit.com/r/SuicideWatch/comments/k8idws/i_am_22_and_i_feel_like_my_life_is_falling_apart/", "title": "I am 22 and I feel like my life is falling apart", "social_network": "reddit", "user": "wintersun77", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1607354109, "permalink": "/r/SuicideWatch/comments/k8idws/i_am_22_and_i_feel_like_my_life_is_falling_apart/", "nsfw": false, "first_save": 1635426646.1208382, "replies_charged": false}