{"id": "t5_2qpzs_t3_qbclm4", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "I tried to end my life, again. I was ripped out of death's hands by my partner, who would have been too late if they'd been delayed by even a minute when they decided to come home early. They found me in the bath, choking on my vomit, urinating and soiling myself whilst seizing. I recovered, barring one kidney. It traumatised them. They say that my rugged breathing once they cleared my airways haunts them, and they can't look at the tub without picturing me in it.\n\nIn the past I survived an attempt involving a major fall, by miracle apparently. I did that because I was angry at the world, my family, my \"friends\", my abusers, everyone who hurt me and everything. But this time, years later, I did it because of myself. I think the world is a beautiful place,  with beautiful people and breathtaking experiences. I love it, I really do. My life isn't bad anymore, and I'm safe. At a place my young self could only dream of reaching when they jumped off the edge.\n\nBut I HATE MYSELF. I'm a burden. I'm disabled, I ruined my body through abuse, I have BPD, Anorexia, agoraphobia, and more. I cant do anything myself and I'm a cry baby. I think I'm fat, ugly, shallow and selfish and I don't deserve to be here with them. They'd be better off without me and having to care for me. I look in the mirror and claw at my face, wishing I could rip off my flesh. I did it for them. I did it to save them from me.\n\nWhy save me? Why tell me you love me and you want me here when all I ever do is take? Why would you do that to yourself? I don't deserve life and what it now gives me. I don't deserve to be alive. The guilt is overwhelming.\n\nThis kind of pain, it hurts me a lot more than simply being angry at the world did back then. I don't know what to do. I can't picture true happiness or a future for me.\n\nI just wanted to get this out somewhere. Thank you for reading.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qbclm4/why_do_i_have_to_live/", "title": "Why do I have to live?", "social_network": "reddit", "user": "BringmetheSerotonin", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 23, "down_vote": 0, "creation": 1634653512, "permalink": "/r/SuicideWatch/comments/qbclm4/why_do_i_have_to_live/", "nsfw": false, "first_save": 1635422247.8674352, "replies_charged": false}