{"id": "t5_2qpzs_t3_q555hg", "request": ["5f7c2841-3f43-4682-8126-88825da57933", "444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "I'm a loser through and through. My education and career prospects are sub-par. Not a single person in the world likes me. I'm constantly in pain, physically and mentally. \n\nWhat hurts most is that my family hates me and have told me that my drama, my attitude, even the sound of my voice, is abhorrent to them. They blame me for everything and their own advice to me is that I shouldn't speak to them. \n\nI'm obese and balding. I'm a woman. At 27, I have never had a relationship. People have asked me if I have a disease or if I look the way I look because of my own neglect. I don't even know. Anytime I have brought up testing, at the last minute, I am told that a bit of exercise could have fixed me right up. \n\nIt's too tiring. I feel like there's something missing in my soul that would make it possible for other human beings to recognise me as one of them. I have long suspected that I might be on the autism spectrum because of my extreme anxiety in social situations and my hypersensitivity to touch. \n\nI don't have much in savings, but enough to move out. My father has warned me against doing this. I am expected me to share my live location if I go out. I am encouraged to solely work from home or concede to being chaperoned. \n\nWhen I was younger, they took away my phone if I talked to a boy. My father threw away my lip balms. He threatened to throw me out as a teenager if I didn't study what he wanted me to. I internalised this threat to the point that leaving the house became scary for me. Last year, I had a panic attack in the gym and somehow left, but fainted on the bench in the park. This has happened multiple times.\n\nI don't switch on the lights in the bathroom because the sight of my body and face disgust me. \n\nI don't want to live like this. I'm not strong enough to leave and make another life for myself. I need much more help than anyone would be willing to provide. The only real option I see is to either continue like this in the hopes that with further education and career advancements, I will be able to improve my situation, or I take the lift to the terrace of my 20-storey building and jump. The possibility of survival is small. I could look up the tallest building in the city, or jump into the town's river. I can't swim and have breathing problems already. That would work too.\n\nA small part of me is screaming that this is my sickness talking. I bargain with myself all the time. \n\n\"What if I didn't eat for five days instead of dying? Would the hunger shush these thoughts?\"\n\nCurrently on day 2 of my fasting, thinking of continuing for a week to buy myself time, I have stumbled upon this subreddit. If anybody has any insights or advice, I'm listening, at least this week.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q555hg/for_an_agnostic_is_there_any_reason_not_to_commit/", "title": "For an agnostic, is there any reason not to commit suicide?", "social_network": "reddit", "user": "Psychophanta", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 57, "down_vote": 0, "creation": 1633859956, "permalink": "/r/SuicideWatch/comments/q555hg/for_an_agnostic_is_there_any_reason_not_to_commit/", "nsfw": false, "first_save": 1635421087.6637695, "replies_charged": false}