{"id": "t5_2qpzs_t3_nahlxi", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I can't stop thinking about suicide. I know there will be happier times in the future, I'll work through this and be 'fine', but I just feel so alone. My mind is a prison. I feel like I'm light-years away from other people; it's not just the pandemic. I've always struggled to make friends, but I've persevered and ultimately succeeded many times. In retrospect I've had to sacrifice a lot of who I am to get along with other people. I'm angry and broken and selfish. Who could ever get along with me?\n\nMy relationship with my partner has become increasingly unhealthy during the pandemic. Being trapped together 24/7 in a small apartment doesn't help. For the past few months I've committed to continuously trying new ideas to deal with my immediate problems. I'm just trying to make it to the next second, minute, hour, or day. A few of my ideas have helped -- but I still feel like I'm watching my life unravel.\n\nI'm exhausted just thinking about it. I have to live the rest of my life? And keep progressing the entire time? Why? So I can die at the end? Help a few people? Be remembered for a little bit? Maybe spread my ideas or have kids so that I can live for a little longer? Let's just get it over with. End my suffering now. Set me free.\n\nI've been trying to meditate more so that I can remind myself what it's like to not despise my existence and humanity's existence. I've had a few great sessions and a lot of good ones. No bad ones honestly. However, when I open my eyes I'm reminded of the path in front of me and how little I want to walk it.\n\nWe'll see how many more moments I can make it through. Thank you.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nahlxi/its_painful_to_be_alive/", "title": "It's Painful to be Alive", "social_network": "reddit", "user": "SimplyTesting", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1620798612, "permalink": "/r/SuicideWatch/comments/nahlxi/its_painful_to_be_alive/", "nsfw": false, "first_save": 1635428239.2693033, "replies_charged": false}