{"id": "t5_2qpzs_t3_pkn903", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "I think I'm going to kill myself soon. My partner has been on and off emotionally abusing me because we can't afford her medication, and I walked away from my family after they emotionally abused me my entire life. They reported me missing, and so I basically made an entirely new life for myself to ensure no information would ever get back to them.\n\nI feel very alone. I'm autistic and my partner has been abusing me because I can't perceive danger shes in when we're outside, I don't get angry at things like she does, and she feels I am neglectful. Today she lashed out at me, and said a lot of hurtful stuff that honestly just sort of feels like a drone of pain at this point. When I stood up to her, she asked me why I can stand up to her and not to strangers, and I honestly don't know why.\n\nI was gangraped a few years ago, but my attackers were absolved in court, final one wrapped up last Christmas Eve. My previous partner and the partner before both raped me, but I'm starting to wonder if this is a narrative I just make up out of a desire to feel abused.\n\nI desperately want to kill myself, but don't know an appropriate method to ensure lethality and lack of trauma. I am also polyamorous and my partner's spouse (please do not judge, I don't have the emotional energy) is going to go blind from untreated cataracts. Neither of them have the means to get this money together. I feel obligated to stay alive and gather this money so they can get the surgery they need before it's too late.\n\nBut I feel very alone. Along with the emotional abuse, I feel my partner is controlling, but I can't tell. She is very lucid and a good listener when she is not in these difficult emotional places, and medicated things were a lot better.\n\nI love her very much, and she needs these meds. She's not responsible for everything she says, but I don't know where that begins and ends. I only know I am hurting, and that I feel I deserve it. I feel I have been putting off suicide for a long time, and now that my life is almost entirely empty of others, this is the most ethical time to do it. But I also feel they need me, both my partner and her spouse. I don't feel hope anymore. My hobbies don't really bring me any joy. And if my partner weren't here, I think I'd lay in bed and ponder suicide most of the time. \n\nMy family and friends have been fairly shitty to me my whole life, but my partner is the only one who has validated that. I don't really care about myself. I'm not a good person.\n\nDon't know what to do. Don't know that it would make a difference. I don't see why I should give myself a shot.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pkn903/just_want_someone_to_hear_me_if_i_do_kill_myself/", "title": "just want someone to hear me if i do kill myself", "social_network": "reddit", "user": "wwwwvw", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1631148942, "permalink": "/r/SuicideWatch/comments/pkn903/just_want_someone_to_hear_me_if_i_do_kill_myself/", "nsfw": false, "first_save": 1635427466.3485584, "replies_charged": false}