{"id": "t5_2qpzs_t3_pafda0", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "I'd like to start this off by saying I have no plans to kill myself. No thought out method, no date, nothing. I'm not going to kill myself. But I don't want to keep living.\n\nI'm a trans man. I was born female. I'd prefer not to disclose my exact age, but I'm in my mid/late teens and I've been socially transitioned since I was 12 years old. A decent amount of time. \n\nI'm not one of those weird trans people either. I'm not a furry, I don't use 'it/they/star' pronouns. I'm purely transsexual. I know my brain is male and it's just the outside that doesn't match.\n\nFrom an outside perspective I'm actually living in good circumstances. My parents were, and are, for the most part, supportive of me. It's taken some time to wrap their head around it but they want the best for me and for me to be happy. I'm covered by my parent's health insurance until I'm 26. We have good insurance and are financially stable, so affording hormones and surgeries won't be a problem for me. I live in America so I won't be prosecuted due to my transition. I may not be accepted by everyone, but I'm protected by our government and I don't feel like I'm in any danger from outside forces. \n\nI look very much male. Even before I came out I was often called \"he\", \"buddy\", \"sir.\" I pass very well to others and I know they see a man when they look at me. \n\nIt's the internal dysphoria that's killing me.\n\nI'm on testosterone, but I've not yet been able to get top surgery and I do not qualify for bottom surgery for a few years. My voice is decently deep, I'm an average height for a boy my age. I have an unfortunately large chest that I have to both tape and bind to get it to look flat in a T shirt. I still have crippling top dysphoria. I'm constantly pulling and tugging on my shirt. Only very specific cuts and brands fit me. I know others barely notice it. But it's constantly bothering me. I'm always aware of it in the back of my mind. It's like a weight I have to pull, invisible to everyone else, but so draining for me.\n\nMy bottom dysphoria isn't as constant as my top dysphoria but when it hits, it hits like a truck. I'll literally walk up to a urinal before remembering I can't use it and it's like someone socked me in the gut. Having to use a stall just to pee when there's other guys in the bathroom, I can't help but feel like they notice, and they know. I don't know why it's so shameful but it is. \n\nInteracting with other guys feels so natural and calming until they make a comment, or a side glance, and I suddenly feel like they heard or they suspect something. Even if it's not very plausible, I can't shake the feeling. I get very anxious and panicky and usually have to end up leaving. I fear they may have seen a binder strap, or my packer shifted, and I spend a while after that picking my appearance apart. Trying to figure out what I need to do and what I even can do to stop feeling so shameful.\n\nMy dysphoria is getting worse by the day. It puts me on edge, and I find that I'm more irritable and have a quicker temper. I'm losing sleep. I'm terrified that everything I eat is going to make my body look more feminine. I can't even cry to let some tension out because of the testosterone, so I just sit in silence when it's too much, feeling fucking humiliated. \n\nI'm in three types of therapy and a support group. My friends don't know and I can't tell them. I can't tell anyone. It's too humiliating to say out loud. \n\nI don't even want to be alive anymore. I don't know what to do.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pafda0/im_a_trans_male_and_i_dont_have_any_will_to/", "title": "I'm a trans male and I don't have any will to continue living", "social_network": "reddit", "user": "RepeatUntil_Death", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 22, "down_vote": 0, "creation": 1629775737, "permalink": "/r/SuicideWatch/comments/pafda0/im_a_trans_male_and_i_dont_have_any_will_to/", "nsfw": false, "first_save": 1635425596.2698452, "replies_charged": false}