{"id": "t5_2qpzs_t3_o9ca5l", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "Sorry for the wall of text. You don’t even have to read it. I just want this out there. Into the void of internet. I guess it would be a letter of some sort if I died. \n\nBorderline Personality Disorder. One of the most painful mental illnesses. 3 words that define my life. Just over a year ago all I had to worry about was getting good grades in school. I was going to be a pharmacist and that would be my life. And then I had a breakdown over an exam. I started seeing a therapist who diagnosed me with depression and anxiety. If I could have gone back in time. I would not have sought help. 10 months ago I was forced to be hospitalized by my therapist. Little did I know that would be the first of many hospitalizations. 4 months ago I first attempted suicide. First of many attempts. 2 months ago I was diagnosed with BPD. It turned my life upside down. Something I would have to carry for rest of my life. Not even medications  could help. I was a good student. I studied hard and was on the dean’s list. I only had a year and half until I would graduate with my doctorate. But I can’t even get through classes that everyone can without having a breakdown. Everything that puts even a small amount of stress makes me suicidal. I’m about to drop out of school with no direction in life. I’m close to losing my job. I can’t go a month without having to go to the hospital. I’m a failure to my parents and to myself. All that years of education wasted. I make people around me worry. I don’t deserve their love. I detest myself. The way I talk, the way I look, the way I act. I’m a disappointment to my therapist and psychiatrist. I acted on my suicidal urges instead of getting help. I’m a horrible health care worker. People are better off without me. I wish I could disappear, like I never existed. I want my family to move on and not grieve for my death. Even when I die I don’t deserve their forgiveness. I don’t deserve a funeral. If I could sacrifice my life so that someone else can live, I would do that. There are little kids that die that don’t deserve that. I don’t matter because I’m a shit human being.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o9ca5l/some_thoughts/", "title": "Some thoughts", "social_network": "reddit", "user": "ileade", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1624851960, "permalink": "/r/SuicideWatch/comments/o9ca5l/some_thoughts/", "nsfw": false, "first_save": 1635428225.4247675, "replies_charged": false}