{"id": "t5_2qpzs_t3_qcmtpr", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "I'm really worried I'll sound stupid but I feel like I need to talk about this. It's going to be a big nonsense rant I'm so sorry. I got into a toxic relationship sometime last year, he was pretty frequently upset with aspects about me, my decisions, and not living up to his expectations. I have a history of having been abused in the past even when I was extremely young, and as a result I find responding to these sorts of things and being able to stand up for myself almost impossible. Every time this would happen I would always burst into floods of hysterical tears as he told me that he didn't feel like he was getting what he wanted and I needed to change my behaviour (not say no so much, be more lively, take more risks, move somewhere new, let him help me with everything like work and moving ect all of which really trigger my anxiety). I'd also like to add that he's quite a bit older than me and more stable and has often helped me with work, organising and taking control of things that were stressing me out and let me stay over when my fiancial situation was bad (I'm still a student) and he gets really upset when he's not getting enough back which makes me feel really bad. And he's better with decision making in a pracical sense than me so he gets angry when I don't \"include\" him in my choices. When I decided to move in with friends he got angry that I was moving somewhere other than where he suggested and that I wouldn't be as close to him (we'd only been seeing echother for about 6 months) and he said I was neglecting him and not making him a priority in my decision, which lead to a conversation about me being pathologically selfish. After months of believing so much was wrong with me despite feeling like I loved this person, I decided to try to leave, but since April it's still felt like he has a chokehold on me.\n\nI've been passively suicidal since around December mostly due to how he makes me feel, but I feel too deeply obliged to respond to him and pick up his calls so much so that I still can't block him. He still gets angry and upset with me for not talking to him everyday even though I've told him my mental health is in such a place that I don't feel like I can date right now. He also keeps asking me when I think I'll be better so we can date again because he wants some \"prospect for the future\" and gets angry when I say I don't know. He has asked me if I want him to leave me alone, but I felt too scared to be honest because he's been angry at me before for giving him a response he doesn't want, and he's told me that he feels like I'm just \"leaving him to suffer\".\n\nI want it all to stop but it just won't, he always needs to text and call and I switched off all my text notifications and deleted most of my apps to get away. I don't think he'd hurt me physically though he would slam and throw things sometimes, and I'm away from him anyway, but it's the mental stuff I just can't take anymore. I feel like a shell of who I was this time 2 years ago. I've fallen back into cutting again in the last couple of months, I want to go somewhere safe just so I can't be contacted anymore. I just feel like such a hopeless coward that I can't block because the guilt is so bad, and I think he'll find another way to ask me about it anyway. I don't know what to do. I have no motivation to get up in the morning, I'm lonely and I hate myself, my cuts are so bad they cover my arms and legs and I'm scared to let anyone see me, and particularly this week I feel like I'm a bad day away from giving up. I just want to be left alone and be quiet\n\nTo anyone who read this fucking wall thank you, whatever you think of my stupid ass I still really appreciate it and you're very sweet.\n\nAlso I know this probably sounds like a bunch of self-victimising bullshit, please just roast me or tell me to grow up if that's what's really needed", "url": "https://www.reddit.com/r/SuicideWatch/comments/qcmtpr/feeling_desperate/", "title": "feeling desperate", "social_network": "reddit", "user": "mournfulknightess", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634803434, "permalink": "/r/SuicideWatch/comments/qcmtpr/feeling_desperate/", "nsfw": false, "first_save": 1635427923.3342588, "replies_charged": false}