{"id": "t5_2qpzs_t3_qcjjc1", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "I'm a fucking leech. All I do is money, food, pot, tobacco and other things. I'm such a fucking drain on those around me. My partner clearly doesn't want to be with me, she wants a future. She wants someone who can provide, doesn't get upset easily over 'stupid' things and isn't hung up on how much he hates life and the rat race he's forced into. I'm isolated from nearly everyone except my partner and her guardian who I hate. It drives me batty, I'm alone for the majority of everday 7 days a week or I'm stuck with her guardian. Pot was helping me get through the boredom of having nothing and no for hours upon hours, but she doesn't want me to smoke anymore so I guess she'd rather I'm miserable and isolated rather than just high and isolated. I don't see my friends anymore, I used to go out every weekend but I've since realised it was putting strain on my relationship. I'm not sure if my partner is codependent, worried I'll cheat (I suspect this is a reason), angry I come home late or that I did drugs but honestly, even when I wasn't on drugs and come home earlier she still seemed unhappy. She's always sad about her lack of friends whenever I go out as well, but when she does go out I always see her talking to people or standing in a corner being bored, she's always ready to go home early and if I don't go as well she is never happy. And then I'll be upset if I go home early, so I've just stopped going out altogether. I went to a different city for this weekend and that was my first night out in nearly a month and I just don't find going out fun anymore. All my excitement and wonder has been drained away. I know my friends and family will all move on when I'm gone at least, I'm a worthless nothing.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qcjjc1/im_21m_nothing_but_a_worthless_addict/", "title": "I'm (21m) nothing but a worthless addict.", "social_network": "reddit", "user": "Cluelessrain461", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634790580, "permalink": "/r/SuicideWatch/comments/qcjjc1/im_21m_nothing_but_a_worthless_addict/", "nsfw": false, "first_save": 1635427006.1462603, "replies_charged": false}