{"id": "t5_2qpzs_t3_n1m8hy", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I'm supposed to die on July 3rd, 2021. I suffer from depressive psychosis and OCD with a fixation on certain numbers, hence that specific date. That is the one and only day I can attempt suicide, because if I try any other day, something really bad will happen. Not sure what, just... something. Bad luck, karma, something along those lines. Bad energy all around.\n\nI'm not an impulsive person. Half the reason I want to kill myself in the first place is because time and time again, I've had to bear the brunt of other people's impulsive decisions. That's why I set the date two years ago with the promise that I would only go through with it if things didn't get better in that time.\n\nOn the one hand, I love my job, and I've made two really good friends since I set the date. I'm on good terms with my sister and I have a cat who I love more than anything. On the other hand, I've experienced what feels like nonstop abuse from my peers and family (you can check my post history if you're curious). My parents constantly hold my housing situation over my head (I'm 21 and live with them), and I feel like I'm on the brink of homelessness all the time. I have a degree, but it's worth nothing compared to what I had to go through to get it. I was on medication, but it stopped working about a month ago.\n\nI used to be a bright, outgoing, and ambitious person. I wanted to get my Phd and teach literature at a university level. But now, I feel shy, weak, and hopeless. I look back at the person checking out grad schools and the only thing I can think is that she wouldn't recognize me. The only things I'm looking at now are jobs in retail and insurance claims departments. I know I'm better than that, but the only thing I can think is \"What's the use?\".\n\nEvery time I've tried to go above and beyond in my life, my efforts have gone unnoticed, or even backfired. It's been made clear time and time again that whether I give something my all or float along with the bare minimum, it doesn't make a difference, so why bother actually trying? Why bother living?\n\nAnd before anyone comments, it is extremely, extremely likely that this is the result of my meds no longer working to soothe my sick brain, but what if I'm going to be sick for the rest of my life? Of course I love my friends, my sister, and my cat, but can I really force myself to be miserable for sixty more years for their sake? I don't know... I'm just so tired. :'(", "url": "https://www.reddit.com/r/SuicideWatch/comments/n1m8hy/i_set_my_suicide_date_two_years_ago_its_now_two/", "title": "I set my suicide date two years ago. It's now two months away.", "social_network": "reddit", "user": "lolqatz", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1619756782, "permalink": "/r/SuicideWatch/comments/n1m8hy/i_set_my_suicide_date_two_years_ago_its_now_two/", "nsfw": false, "first_save": 1635428114.2196279, "replies_charged": false}