{"id": "t5_2qpzs_t3_pmnwyf", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Honestly my relationship with mental illness started way before I can even remember. I even remember writing suicide notes in the 6th grade, I had one of those little diaries with a lock and key. \nBut I feel like I’m super fucked by this one time in my life. \n\nI started dating this guy, who was a big manipulator and abuser, just after a massive surgery that caused me ptsd. Dropped out of high school for 2 years, switched schools 10+ times, and developed a ton of anxiety. Dated this guy from age 14-19, also a really big time in a young persons life. I don’t know why I stayed, I guess I thought I was in love lol. \n\nI was doing alright with myself near the end of our relationship, as I was pretty emotionally checked out. But I fainted, got a massive concussion, and had to drop out of nursing. I left him a few days after that happened. I got stalked for what felt like I year until I never heard anything again. \n\nI’m overwhelmed with flash backs of him. All the shit he did to me runs through my mind constantly. It’s been over 3 years since I’ve seen or spoken to him, and I’m in a decent relationship with a wonderful person, but I feel like I can’t escape. And it’s very hard to explain my feelings past this. Whenever my partner asks why I’m crying, or even when I ask myself, I have no answer. \n\nI feel like I carry this weight around with me and I can’t get rid of it. I have barely any motivation, I haven’t went back to school, I hate having to get up in the mornings for work, and I honestly just want to end it all. I stay awake at night itching to self harm, I haven’t in years but I’ve put a razor to my arm multiple times recently just to feel something. I also think about checking myself into psych all the time but can’t even muster up a bit of motivation to tell anyone.  \n\nI just want to end it all, I want this feeling to stop. I know I won’t do it though, but I think my fire is about to burn out. Thanks for taking the time to read, and sorry if there’s spelling mistakes, it’s really late and I’m ranting.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pmnwyf/i_feel_like_im_held_down_by_this_massive_weight/", "title": "I feel like I’m held down by this massive weight", "social_network": "reddit", "user": "aborg1999", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1631429936, "permalink": "/r/SuicideWatch/comments/pmnwyf/i_feel_like_im_held_down_by_this_massive_weight/", "nsfw": false, "first_save": 1635422307.983188, "replies_charged": false}