{"id": "t5_2qpzs_t3_phd1j9", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I am now unemployed again.\n\nI spent 15 months unemployed after the pandemic and dealt with depression, pain and stress throughout my job before.\n\nI had a damaging car accident in which my neck was injured and my car totaled and while it was replaced, I have also suffered a painful testicular infection that has never gone away, injuries to my arm and shoulder where I can’t lift or exercise or have sex or try to improve my body in any way without starving myself and feeling terrible.\n\nI have struggled so much in any relationships feeling alone and not really able to be valued or appreciated as far as relationships go. I want to get a dog so at least someone besides my immediate family can love me but I feel I am still not understood. I am alone.\n\nAdd in the crushing societal collapse and the extended pain and fact that I was not fired for lack of work or production (I have been grinding out 50+ hour weeks at a hard job and working to learn and improve myself and have tried over the years to continue in this but whatever I have done hasn’t been enough.\n\nEveryone tells me I am smart and work hard but I have been fired from almost every job I have worked and have no way for my parents to take care of me full time when I need to take care of them in a few years and even then my sister should be able to.\n\nI can’t imagine life after 30 and it’s just so much of a pain. Taking on a life that clearly doesn’t want me and nothing I do being good enough to just put food on my table and knowing the suffering will only get worse. Whether culture or climate change or struggling to spend another year without a job and the debt I face and knowing that no one will hire me ever again I see no point in living. I don’t want to hurt others and revenge or anger is out of the questions.\n\nSuicide would be easier and cleaner than struggling like this for no point. Family is the only reason I am alive now as I am just so tired of it all", "url": "https://www.reddit.com/r/SuicideWatch/comments/phd1j9/reasons_to_not_kms/", "title": "Reasons to not kms", "social_network": "reddit", "user": "yolotheunwisewolf", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1630700412, "permalink": "/r/SuicideWatch/comments/phd1j9/reasons_to_not_kms/", "nsfw": false, "first_save": 1635422309.308346, "replies_charged": false}