{"id": "t5_2qpzs_t3_p9pumy", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "Change fails to take the form of a switch one can flip whenever pain strikes. I am not someone who has yet to realise how privileged, fortunate, or \"blessed\" I am. No, I am someone who sees my opportunities and cares for none of them. I cannot express this feeling more succinctly than the statement \"I don't care\".\n\nOne would think I have nothing to complain about. I come from a well-off family, am attractive, talented, and have a future full of promise. I deny none of these traits, but such a statement does not equate to me being satisfied by them. I would rather have nothing at all.\n\nI have to die today. Not want to, but have to. I wish to escape my problems because, contrary to popular belief, dying is a solution--merely an extreme one. If I do not die today then I risk wasting time. I've already wasted enough of it. I can't live with myself if I've risked anymore. My first year of university starts tomorrow and I wish to have none of it. I can't even be in the dormitory without bursting into tears; everything feels wrong.\n\nI can't get myself to care about anything. Every second of my life is plagued by internal struggles. I am transgender and will never be seen for who I truly am; people can't seem to forget the child \"I\" used to be. I have had anorexia for six years because if I can't be happy then I can at least be beautiful. I can't figure out what I want my goddamn name to be; I'm stuck between three options and feel like I've lost myself in trying to decide who I am. People look at me strangely because I use umbrellas in the sun and wear large amounts of makeup. I don't need the assurance that I am valid or \"me\" or anything of that nature, for I stopped caring about myself far too long ago.\n\nWhenever I walk down the street I hope to be hit with an automobile. Whenever I take pain reliever I fight the urge to take down the whole bottle. Whenever I go grocery shopping I wrap the bag around my head. I want to die. I want to die. And now I have to. I have to die before school starts because I refuse every component of my future.\n\nI'm going to die tonight. I have hours left to live. I don't care about friendships or family or sex or success or education or any of that goddamn nonsense. I set out to do two things in life--change my legal name and write a novel--and I've done both. I can die happy with what I've done. I have nothing else left.\nI have pills in my home across the country and I can't bleed enough through cutting. I drank six litres of water in thirty minutes and I didn't even feel dizzy. I would starve myself to death if it didn't take so long. So I'm going to jump. I don't care if I merely end up breaking my bones; I have to do something.\n\nI hope this statement will be my last. If I can find a way to avoid university and work on myself instead then I won't mind living. But it doesn't seem like I can do that, for I'm tied down to my parent's support. I have no apologies to give them. I don't believe I've ever cared for anyone.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p9pumy/i_dont_care/", "title": "I don't care", "social_network": "reddit", "user": "bittersweetprick", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1629683352, "permalink": "/r/SuicideWatch/comments/p9pumy/i_dont_care/", "nsfw": false, "first_save": 1635422259.7184672, "replies_charged": false}