{"id": "t5_2qpzs_t3_p28175", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "I just fkn cant anymore. I cant handle stress , life, education, people. If Im on track to getting better, it takes one minor stressor for me to go to square one. I thought I  developed a sense of a routine but then if  I start  a course, boom!, back to insomnia and doing sht last minute (bc i feel dead in the morning) , i got adhd , im a night owl. and i have chronic fatigue so even if i have 1 lucky night of 7-8 hrs of sleep, i still feel like im in a daze. I cant stand or walk for too long or im out of breath. . I cant guarantee ill be able to sleep the next night. Well, of course, you would say, my circadian rhythm is fkn messed up, but yea it's been like this for mfkn years n it's not adjusting. one night i have good night sleep which is then followed by weeks of insomnia. Meds r not a feasible option for me. If i dont sleep well, i dont eat well either, i wake up with GERD. I get more depressed n the cycle just repeats. I feel cursed. I want to give up every mfkn second. Dump BDD, social anxiety and limerence on top of this sht. I cant move forward with my life , im failing classes bc of how sleep deprived i feel. Im lost, Im pursuing a useless degree n it's too late to switch. I thought i knew that i'd do well in my chosen path, but i made nothing of myself. I feel dumb asf and really ill.  I havent had any friends for my whole life, last time i had acquaintances was like 6 years ago. My hair is falling out. Im losing weight. Im prematurely aging, no matter what im doing nothing improves. Everywhere i go i meet narcs. Im so damn drained. send prayers, idk. Thanks.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p28175/insomnia_makes_me_want_to_die/", "title": "Insomnia makes me want to die", "social_network": "reddit", "user": "Letmetellyouabtlyfe", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1628665943, "permalink": "/r/SuicideWatch/comments/p28175/insomnia_makes_me_want_to_die/", "nsfw": false, "first_save": 1635426507.8382359, "replies_charged": false}