{"id": "t5_2qpzs_t3_pyaylw", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "I've had suicidal thoughts for almost my entire life. The first time I can remember thinking \"I wish I didn't exist\" I was 5. The first time I outright thought \"I want to kill myself\" I was 9. Now I'm 23. I've always had ways of giving myself reasons not to go through with it, and you'd think living with it for so long would make it easier to manage. But it's just getting worse. \n\nFor a little while I thought I was getting better, less depressed. I started looking for jobs, making new friends, learning to drive, I got back into school after a long break. It felt like I was slowly but surely climbing my way out of a hole I'd been trapped in. But suddenly I'm sinking back in, deeper and deeper, and it feels like there's no way out.\n\nFor practically as long as I can remember I've been able to keep going by thinking of my family, or my friends, or even out of spite against people I don't get along with. But the older I get, the more I start to believe that the whole world would be better off without me. I think about killing myself, and then I think about how that would affect the people I care about, and I imagine them mourning, and then I imagine them moving on. None of them really need me. My parents have other, better kids, my brothers have each other, my friends have other friends. I'm not special to anyone. I'm not particularly good at anything. I'm not smart, I'm not pretty. I hate everything about myself. I'm just completely worthless, and I feel like a place holder in my own life. Like I should just move out of the way, so everyone can move on already. \n\nI'm so tired. Most days I can barely force myself to get out of bed to eat. It's possible the only reason I'm not dead yet is because I haven't been able to work up the energy to go through with dying. I don't know what to do anymore. I honestly don't even know why I wrote this. I don't know if I'm just venting, or crying out for help. Either way, I don't even think it'll change anything.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pyaylw/its_getting_harder_and_harder_to_talk_myself_out/", "title": "It's getting harder and harder to talk myself out of it", "social_network": "reddit", "user": "wonderlandresident13", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1632970736, "permalink": "/r/SuicideWatch/comments/pyaylw/its_getting_harder_and_harder_to_talk_myself_out/", "nsfw": false, "first_save": 1635426739.4136744, "replies_charged": false}