{"id": "t5_2qpzs_t3_ps03y3", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "TL;DR at the bottom. \n\nI don't really know what I've come to ask for, I just want to hear something from anyone else. I feel like I'm going mad, I'm losing in almost every aspect in my life. I'm 16F, in the UK, and my home life is fucked. My mother is constantly making comments about my body and belittles me all the time. My dad always takes his anger out on me. Every single conversation we have will turn into an argument, it's so exhausting. I just wanna feel loved, for once. I have a boyfriend, but things went downhill yesterday and he hasn't even texted me today. For more info on what happened, see [my last post](https://www.reddit.com/r/relationshipanxiety/comments/prixf9/i_dont_know_if_im_doing_something_wrong_am_i/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). \n\nI don't really have anyone to talk to about this, and I'm honestly so close to just ending it all. I'm currently on this medication and, I have enough to overdose on it so that the effect will be lethal. I'm afraid to, but I think I may just go ahead. It'll bring me peace, that's all I want. There's so much I wanted to do in the future but, I don't know if I'm going to make it. What do I do? Does it ever get better?? Is it really worth living? \n\nTL;DR Things have been going downhill for the last few months and, today, I finally hit rock bottom. I don't really know if I can do this anymore. Does it ever get better?\n\nedit : It's evening now, and I still haven't heard from my boyfriend. I'm getting really worried about him because this isn't normal. Sigh.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ps03y3/i_think_ive_hit_my_lowest_and_i_dont_know_if_i/", "title": "I think I've hit my lowest, and I don't know if I can do this anymore. Does it ever get better??", "social_network": "reddit", "user": "throwaway1423322211", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1632160655, "permalink": "/r/SuicideWatch/comments/ps03y3/i_think_ive_hit_my_lowest_and_i_dont_know_if_i/", "nsfw": false, "first_save": 1635427457.937515, "replies_charged": false}