{"id": "t5_2qpzs_t3_p0xpdo", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "I'm writing this out of boredom, or perhaps there's a scream echoing from within, that this demon cannot bellow above.\n\nEither way, I'm not sure. \n\nI'm distancing myself from my girlfriend again. I'm pushing her away and accidentally starting weird arguments.\n\nI caught myself in the middle of it tonight and now I feel like shit, even though she's happy I caught it.\n\nI'm about to be fucked raw by the long dick of debt, as my rents going up, I can't get regular hours at work and these new mess are making it so hard to get up and to work on time.\n\nMy counselor canceled my appointment for this week and it'll be 3 weeks until I can see him again. 4 MO ths tk the next psychiatrist meeting. I finite to a psychologist because I can't afford that.\n\nI'm applying to a job in a country I'd rather be in, have every right to work in, and I'm qualified for. I know I'll get declined deep down, but right now it's the ember keeping the fire alive. It will solve my issues, getting away from these people, these thoughts, these low wages and isolating situations.\n\nBut, when I am denied the job, and I'm back to square one.. then I'm simply running on not killing myself because it inconveniences others, and thats a fast burning fuel if not supplemented. I don't think it'll last long.. it never has.\n\nI'm just going to stop. No one reads these posts, or these rambles. Back to a trusty pen and paper that I can burn, take with me to the grave.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p0xpdo/im_spiraling_out_again_i_can_see_all_the_warning/", "title": "I'm spiraling out again. I can see all the warning signs, but there's no one to help. I don't know what is going to happen a few weeks from now, and I don't even think I really care.", "social_network": "reddit", "user": "FirstandFinalResort", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1628499620, "permalink": "/r/SuicideWatch/comments/p0xpdo/im_spiraling_out_again_i_can_see_all_the_warning/", "nsfw": false, "first_save": 1635427020.2687843, "replies_charged": false}