{"id": "t5_2qpzs_t3_oad9ex", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "I believe heavily in fate and karma. If something fucks up multiple times, then I know that it was never destined for me. No matter how many times I try it, nothing good will ever happen. It's how it always goes.\n\nI take medication for BPD, depression, and anxiety. There hasn't been a single time when I've gone to refill it at the pharmacy that it's gone smoothly and normally. There's always a problem. They don't have it in stock, or the doctor wrote the prescription wrong, or they just refuse it for no real reason.\n\nI take HRT, I'm 3 months into transitioning. From the very start, there were issues. I even once got blood drawn to test my hormone levels, had to wait 2 months for results, and the doctor ended up testing every possible thing EXCEPT for hormone levels.\nNow I'm waiting for my prescription to be refilled, and I have nothing but silence from the pharmacy. I ran out of HRT completely a few days ago. I'm stressed and I feel ill.\n\nFor no reason, my stomach is refusing any food that doesn't have specific tastes/textures, and it's rare enough that I'm basically just not eating. It's not intentional, and I'm scared that it's going to make me relapse into anorexia.\n\nMy mental health clinic is moving me to a different department. I have to get used to new people. Thursday is my last therapy appointment for at least 9 months, assuming that the new department agrees to give me a therapist at all, because they might just not, and that's what I expect.\n\nI over-sleep and it's completely out of control thanks to a weird phase of paralysis that I keep getting stuck in through the day. Waking up at any time past 5pm makes me depressed, but alarm clocks are useless because I'll turn it off and just not be able to move. I end up just falling asleep again, even though I don't want to, I'm trying to move. I'm consistently getting up at 6pm and it's beating me up.\n\nEverything just... Goes wrong. And it's not going to ever stop. So why should I even try to fight?\n\nI want to throw away the meds, throw away the HRT, leave the mental health clinic, and just... Starve, I guess. That's how karma wants me to be, and I don't have the energy to fight a cosmic entity.\n\nI just want it to be over. I'll never have enough energy to make anything better anyway.\n\nThanks for reading. I don't want anyone to talk to, I just wanted to throw my thoughts out somewhere.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oad9ex/why_should_i_bother_putting_effort_into_making/", "title": "Why should I bother putting effort into \"Making life better\" when I could just end it instantly", "social_network": "reddit", "user": "twentyoneshitposts", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1624988514, "permalink": "/r/SuicideWatch/comments/oad9ex/why_should_i_bother_putting_effort_into_making/", "nsfw": false, "first_save": 1635422270.7107105, "replies_charged": false}