{"id": "t5_2qpzs_t3_ohckjc", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "You know how people say there is a lot of stigma around mental health right? I am a mental health nurse and I struggle with this shit. \n\nAfter helping people for years and just sort of getting by --as my relationships crumbled around me--- and as I felt like I was slipping down more and more into a deep abyss...\n\nI am finally on the path to getting help for myself.\n\n\nI realized I was in some deep shit when I was on a family vacation.  Looking around I saw everyone having a great time while on  a boat ride. \n\nMe, I just wanted to die and spent the day fighting back tears while thinking \"why the fuck can't I enjoy myself?\" \"What the fuck is wrong with me?\" And \"why can't I just be normal?\"\n\n A week prior to that moment I was looking off of the edge of a 4 story building waiting for some food at a rooftop restaurant wondering \" would the jump be enough to end my pain?\"\n\nWhile I have these thoughts, I know I would never act on them. \n\nIn my line of work I have seen what happens when plans go wrong too many times. (And more often than not it only leads to worse pain and suffering)\n\nOn top of that I recently heard of an aquaintance that ended their life, and I can see the pain their family is now feeling. I would never want to transfer my pain to someone else like that.\n\nFor me, I have already promised my family that I would never hurt myself. \n\nI tell my patients all the time you have to find your reason to fight through. Whatever your reason is, no matter how hard it gets, that reason will carry you through to the light of a better day.  So here I am, and my reason has kept me here. \n\nAnd now, I can finally admit that I need help. this is just too big for me to go at it alone. My partner was able to help me navigate my most recent crisis and get me set up with a psychiatrist and therapist. ( For which I am so thankful)\n\nI avoided this for years despite knowing I needed help ...I'm a psych nurse right? I know how to help others fix this sort of thing...I should be able to fix myself too...right?\n\nAnyway, I am writing this for everyone here that is struggling. To tell you it gets better.\n\n Find your reason, stay strong, and most importantly reach out. \n\nHelp is available. If you really feel like you are going to hurt yourself go to your local Emergency Room they will be able to help you through the worst and hopefully connect you to resources in your community.\n\nFor me right now just taking this \"little\" step of admitting I need help and making a plan has given me an unbelievable level of relief.\n\n Just knowing that I am finally trying to take control over this illness rather than let it control me is liberating!\n\n I feel like the pressure that was in my head has started to release. After months of feeling like shit and years of being 'down' I actually feel somewhat human again, rather than this empty void nothingness. Don't get me wrong I'm not 100% cured or better by any stretch of the imagination but I feel like it's a start in the right direction--- so much so, that I was even able to go out for a date with my partner tonight and actually enjoy it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ohckjc/i_feel_so_relieved_i_am_finally_on_my_way_to/", "title": "I feel so relieved I am finally on my way to starting therapy and getting help for my severe depression and intermittent suicidal ideation.", "social_network": "reddit", "user": "marutiyog108", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1625894115, "permalink": "/r/SuicideWatch/comments/ohckjc/i_feel_so_relieved_i_am_finally_on_my_way_to/", "nsfw": false, "first_save": 1635427229.2734168, "replies_charged": false}