{"id": "t5_2qpzs_t3_plgety", "request": ["56f46b9a-59d4-48f0-aed3-4247ea68706d"], "text": "I wrote a suicide note to my best friend and my little sister read it and told my dad and gave him the note, he called the police. I just turned 18 by the way. Police officers came and my dad gave them the note and they read it without my consent. My dad then proceeded to give me a long lecture on how I’m an ungrateful child since most of my note was about how emotionally abusive he is and I can’t deal with it anymore. A good part of the note was also about how I feel like now that I’m 18, nobody cares about me and society expects me to just fend for myself. Anyways, the police agreed with my dad and told me this exactly “well it sounds like your dad has some house rules and expectations of you and if you don’t like that, you’re 18 so move out. If you don’t want to move out, then you have to follow his house rules.” they said this even though my dad admitted to not allowing me to work so how the fuck am I supposed to move out? Like part of his house rules is making me work full time at his clinic and single handedly be a mom to my 3 younger siblings and upkeep the whole house because it’s my responsibility as an adult. I fucking hate it here I hate being 18 everything just gets worse and worse and I am going to kill myself I don’t know what else to do nobody cares about me at all not even the police they literally gave me an intervention and made me talk about my abuse in front of my abuser and then acted like I was just some overgrown adult that was being entitled and spoiled", "url": "https://www.reddit.com/r/SuicideWatch/comments/plgety/im_committing_suicide_tonight/", "title": "I’m committing suicide tonight", "social_network": "reddit", "user": "WoodpeckerFar3132", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 39, "down_vote": 0, "creation": 1631259586, "permalink": "/r/SuicideWatch/comments/plgety/im_committing_suicide_tonight/", "nsfw": false, "first_save": 1635428316.7158267, "replies_charged": false}