{"id": "t5_2qpzs_t3_br5eyy", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "I’ve been depressed and suicidal and had a plan for at least the last 3 years, I’m 17 and I can only really think back to the first time I tied a noose 3 years ago but it probably started long before that first incident. After my girlfriend broke up with me for being depressed two months ago my life has been an absolute hell. I tried to kill myself that night but I was never able to do it because I kept slipping down from the pull up bar I was trying to hand the noose from, that is still my biggest regret in my life because the breakup now looks like it was inevitable because I drive everybody away. I’ve now lost all my friends and everybody I cared about and I really can’t handle it. My girlfriend broke up with me over text and hasn’t spoken a word to me since even though we still have classes together and saw each other multiple times a day at school. With that she drew all my other friends away from me because she’s such a happy and fun person while I’m insufferable and suicidal, she didn’t even do most of it intentionally, people just like her that much and dislike me that much. I’ve tried everything, I’ve talked to the school guidance counselor, I’ve been going to a therapist, I’ve had a million psychiatrist and whatever appointments, I’ve been locked up in a mental hospital, I take medicine now, but none of it has made any difference and I can’t see any of it making any difference at all ever. Everyone says wait and it just takes time and that’s all they say, but it’s only gotten worse. One of my friends who I was talking to about it because they used to cut themselves told me that I shouldn’t have gotten help and even though they were the one that first dragged me to the school guidance counselor, they’ve since ditched me at a concert for my ex and we don’t talk anymore. I’m not allowed to talk to my other friend anymore after we made a suicide pact and likely would have caused another 2-3 people to commit suicide after we were gone. And I just lost my last friend, she was helping me because she has seen a lot and helped a lot of people but she hates me now because I’m non-stop and I haven’t gotten better, she won’t respond now and doesn’t care no matter what I say. I’m not well, I’ve stopped going to school or doing anything, I used to miss a lot of meals but now I do t even really eat at all, maybe one meal a day if I get out of my room. I can’t lock the door to my room so I usually barricade myself in with my dresser but then my parents threaten to call the cops on me. I tried to kill myself again last night but I can’t let anybody know because they’d try and lock me up in a mental hospital again and i’ll kill myself before I let that happen again. The only thing that stopped me this time was that it was starting to get light outside and by the time I finally found where my parents had hidden the rope from me I only had ten minutes to tie up the noose before my parents would be awake, so I put it back and locked myself in my room the entire day. I’ve tried everything, I’ve calmed the suicide hotline and all that, but after hearing that stupid song for ten minutes I couldn’t take it anymore. I know I’ve typed a lot and left a lot of pain out but I don’t care. I’m just typing this because I want a reason to live so badly, I’ve got a future and I’ve I lived I’d likely be a d1 athlete at an Ivy League school, but I have no friends and no happiness. This hell of mine has only gotten worse and I see no end to the pain. I have no idea what anybody could tell me but please, anything, anything, I just want to stop the pain. I don’t think i’ll fail a third time if I try to kill myself again.", "url": "https://www.reddit.com/r/SuicideWatch/comments/br5eyy/ive_tried_everything/", "title": "I’ve tried everything", "social_network": "reddit", "user": "swxm13", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1558409337, "permalink": "/r/SuicideWatch/comments/br5eyy/ive_tried_everything/", "nsfw": false, "first_save": 1635427718.7120194, "replies_charged": false}