{"id": "t5_2qpzs_t3_fnldja", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "I'm Tired\n\nI'm tired, very tired\nI'm tired of waking up tired\nGetting up, more of a chore than a necessity\nSnared  by the hopelessness I give in \nI fall into my slumber where I may not feel any scarcity\n\nI'm tired of not staying asleep.\nBarred by these feelings\nHeld me captive\nGetting ready to be thrown into the abyss of nothingness\nThe want of soaring by the means of a rope, failing\nFalling slowly yet fast at the same time\nUntil the person that I knew isn't the person I longer know\n\nI'm tired of feeling tired\nEvery motion, every blink passes by\nAnother time has been wasted\nYet the feeling still remains\nSlowly corrupting my exhausted heart\n\nI'm tired of feeling too much\nHeavy is an understatement\nTo such feelings I don't want to feel.\nTo such feelings that demands to be felt.\nTo such feelings of nothingness\nTo be a void is the only option\nMy luminosity has been clouded\n\nI'm tired of forcing myself to interact\nChoosing what mask to put on\nMy every vocabulary has been \"I'm ok\"\nTo conceal what's within\n\nI'm tired of explaining\nExplaining what I feel\nExplaing what is wrong\nExplaining that I don't even know what's wrong\n\nI'm tired of being tired.\nThe cycle that goes on and on\nThese shackles that I have\nThe constant \nThe overwhelming feelings\nThe me as of now.\n\nI'm tired of trying\nTired of dangling between the line\nOf raising the flag\nOr giving myself another chance.\n\nI'm tired of depending on medication\nGiving me the ecstasy of superstition\nRelying on a paper, another prescription \nNothing is working am I just an experimentation\nIn midst of the overwhelming reality\nThe only thing that makes me try to get up\nWhen can I have my salvation?\n\nIm tired of saying I'm tired\nThis constant state of melancholy\nThe answers of I don't knows\nThe seeking of solace through settling for less\nThe seeking of solace through harmful ways\n\nI'm tired of being I'm tired\nGuess it's still try and try and try\n\n- utterhin\n\n\nI've tried therapy, my psychologist made me write what I feel in the journal and still no progress has been made, I still write the same stuff. Im also taking meds, which just makes me either numb from feeling or emotionally suicidal. It supposed to make me gain appetite but I have zero appetite. I have work which I am slowly neglecting due to this whatever, my workmates are good people and the workload isn't too overwhelming. I've tried working out, but the mental tiredness is far more exhausting than the physical exhaustion I get from it. I have a loving family and friends. They support me in every possible way in my clinical depression. I've tried being religious, went back to church and is still praying but nothing really changes.\n\nWhy do I still feel like this? The loneliness, the pain, the constant. Everything feels overwhelming. I really just want to be gone. I want to cry but I can't shed a tear. I try to divert my attention just to not think I'm not ok. I am tired of being tired. I'm really on the verge of giving up. Hopefully this will no longer be a failed attempt.", "url": "https://www.reddit.com/r/SuicideWatch/comments/fnldja/im_tired/", "title": "I'm Tired", "social_network": "reddit", "user": "SereneGraceOP", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1584975730, "permalink": "/r/SuicideWatch/comments/fnldja/im_tired/", "nsfw": false, "first_save": 1635427543.1399226, "replies_charged": false}