{"id": "t5_2qpzs_t3_7c8xeb", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "I'll keep this short.\n\nI'm a 23 year old engineering student. No matter how much I sleep, I am never fully awake. Every single waking hour of the day I feel like sleeping. I can fall asleep anywhere and instantly at any time of the day.\n\nI've been this way for 4 years now and it's no way to live. I don't consider it worth living, so I've been fantasizing about and planning my suicide for the past weeks. I just want to be awake.\n\nDespite sleeping for 8+ hours a day, every day at university or the office is a pain and constant struggle. On the weekends, I sleep for 15-20 hours and still wake up sleepy.\n\nI don't have any friends and don't know anybody except coworkers. My hobbies have gone dormant because I lack energy. Everything is a grey void, I don't feel pleasure in anything. Every day is the same, I've gone numb and the only relief and happiness I feel is when I hit the snooze button and sleep for a few more hours.\n\nMy girlfriend of 5 years left me because I could no longer hide my lack of energy. My studies were taking too long, I was too tired for sex and had erectile dysfunction.\n\nI lift heavily for 3 times a week and eat over 4000 kcal, at least 4+ liters of water a day. I have tried up to 800mg of caffeine, Modafinil, Piracetam, Phenylpiracetam, Kratom and GHB. I spend 2€ a day on supplementation of every micronutrient imaginable.\nI can swallow 3x200mg caffeine pills, take a cold shower and take 200mg modafinil in the morning and go back to sleep until 4 PM like a baby, feeling tired and sick when I wake up.\n\nMy next step would probably Cocaine, just to feel fucking awake for once.\n\nI tested my testosterone and it's below 400 ng/dl. I will try to get on Testosterone Replacement Therapy, maybe this will improve my drive.\n\nI just want to be awake and alive. I've been hesitant to visit a psychiatrist because I don't want to be another victim of antidepressants.\n\nIf this doesn't improve, I've made a pact with myself to kill myself after my grandparents have passed away, because they've always looked out for me and it would break their heart.\n\nAny advice is welcome, I'd pay any sum of money to be awake.", "url": "https://www.reddit.com/r/SuicideWatch/comments/7c8xeb/engineer_23_considering_suicide_constantly_tired/", "title": "Engineer, 23, Considering Suicide - Constantly tired, never fully awake: Running out of Options", "social_network": "reddit", "user": "always_fucking_tired", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1510413690, "permalink": "/r/SuicideWatch/comments/7c8xeb/engineer_23_considering_suicide_constantly_tired/", "nsfw": false, "first_save": 1635427776.5823898, "replies_charged": false}