{"id": "t5_2qpzs_t3_fi4dre", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I could tell you knew. You saw right thru me. My wife went back for surgery. We had been fighting. You could see it. Yes she is abusive. Words and denials. Never physical violence. \n\nI was sitting there. Replaying our fight in my head when you walked in. A normal couple. I sensed you all looking at me before I saw you.  \n\nI’m used to that. I’m in my forties and autistic. You get used to people knowing you are different before they should know.\n\nThe two of you looked confused so I pointed you to the white check in phone. Now you know who I am. I watched you and thought how nice and normal your lives must be. I hope your wife is okay. The two of you reminded me of my Aunt and Uncle. Farmers. Your husband sitting there in his cowboy hat and boots while you snuggled into him nervously before your appointment. \n\nAfter my wife went back, the two of you thanked me and asked if I was okay. I made a joke. I always do. Then the room went back to normal. \n\nBelieve it or not. Your small interaction with me helped me. Reminded me there is beauty and normalcy in the world still.\n\nI was going to walk upstairs and jump off the roof. Locks are not a problem for me. I also had my fire arm with me and considered taking my life in my car but decided that would be too hard on my wife.\n\nThanks for keeping me strong in that moment. I’m at home. My wife is fine. My life insurance will go to her despite my suicide in a few moments. Yes it will. I read the suicide and incontestability clause so I know it will.  \n\nBe kind to people around you. Even the shitty ones like me.  \n\nI never mattered. I don’t matter now. Just wanted to say it before I die I guess. At least all of you will have some idea of how bad I feel.", "url": "https://www.reddit.com/r/SuicideWatch/comments/fi4dre/to_the_couple_who_noticed_me_this_morning/", "title": "To the couple who noticed me this morning.", "social_network": "reddit", "user": "under_the_horizon", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1584124452, "permalink": "/r/SuicideWatch/comments/fi4dre/to_the_couple_who_noticed_me_this_morning/", "nsfw": false, "first_save": 1635422303.273019, "replies_charged": false}