{"id": "t5_2qpzs_t3_kpfyld", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "Using a throwaway for obvious reasons. This will be very long and drawn out, so heed caution.  I’m a 19 year old female, and, as the title states, I’m insecure about my appearance and I often contemplate suicide over it.\n\nMy backstory is pretty simple, not too complex or complicated. As a child, I didn’t really pay any particular attention to my appearance and was even comfortable in pictures and videos that other people took—however I did wear a pair of pink rectangular-framed glasses that I despised and wanted to get out of.  I was, and still am, able to make friends despite my facial disfigurements due to my (former) confidence and outgoing/funny personality as well as my fashion choices (my mom used to be deeply involved in the fashion industry and set up my wardrobe from the moment I was born) and generally I am very sociable.\n\nAround fifth grade or sixth grade to seventh, I switched to clear glasses with thin frames and while I was offhandedly called ugly or otherwise had my appearance ridiculed by other kids, I didn’t care. I had my friends who defended me (it was nothing like the “popular girls invite ‘loser’ girl into their clique as an elaborate scheme then humiliate her” trope), and I was also really aggressive as a kid which scared anybody who attempted to bully me off.  The Snapchat/selfie era blew up when I was 13/14/15 and those were the years I was pretty okay with my appearance—in fact, I would say I was at my most beautiful when I was 13—but age 16 was when it all started to go downhill.\n\nI had a “tomboy” phase at 14/15 then grew out of it by 16 and promptly started to become more feminine, which included taking more selfies, and that’s when I began to notice various things about my face that I never did before.\n\nThe right side of my face is downturned, but my nose is pointy, like a beak, and tilts to the left side (I’m pretty sure I have a deviated septum).  It is also slightly downturned and looks simultaneously like it is bigger and smaller than the rest of my face.  I have a large chin that, when I smile, resembles an underbite, even though I don’t have one—and small (not thin) lips juxtaposed with it which I feel accentuate it even more, in addition to having a large forehead.  I have a crooked smile, my teeth downturn to the right and the right side of my top lip is upturned/bigger than the left side.  I have defined jowls and nasolabial folds that make me feel like I’m prematurely aged and wrinkly.\n\nI went to a doctor for an unrelated issue and found out that I have PCOS, which was causing me to grow very dark, coarse hair on the sides of my face and neck (like a beard), my chest, underneath my navel and around my areolas, which would return in a matter of days even after plucking and waxing, while, conversely—I have very little hair on my eyebrows and eyelashes. My head hair is not long or voluminous enough to distract from my face and not even my body serves as a distraction because while I am petite and pear-shaped, it is also hairy, I have small and saggy breasts and barely any butt. I was so accustomed to having a masculine face because of my past phase where I’d deliberately tried to be masculine, but right then and there it was the most disgusting and grotesque-looking I’d ever felt in my life.\n\nIt gradually started to become worse, though. At 17-19, I started excessively fantasizing about plastic surgery. Lip injections, chin reduction, a rhinoplasty, cheek fillers, a boob job. I started Photoshopping my selfies—shortening my chin and jawline, inflating my lips, lengthening my nose. I only ever took selfies with the front camera (P.S. that “you only look ugly/distorted because of the camera proportions” and the zoom-out-then-zoom-in trick doesn’t work for me, I look the same & it still sucks), and if friends wanted to take group photos, I’d insist on doing it with my phone so that I could edit my face in the picture before sending it out en masse or posting it to Instagram or Facebook.  I made sure to make these alterations subtle so that no one could confront me about it were they to encounter me IRL, but I still felt repulsed that I had to do it in the first place.\n\nI desperately want plastic surgery to at least configure me into some semblance of a beautiful person, but I can’t afford it even with my current job and I’m too ugly to find a sugar daddy who could.  The only surgery my mother’s willing to help me pay for is laser hair removal from the PCOS because she underwent the same procedure, but she completely frowns upon me having any kind of cosmetic procedure or even getting on birth control to (hopefully) enlarge my breasts/butt and halt the excess hair growth. But at the same time, I’ve never had surgery for anything before and I’m paranoid that when I do get the money for it, it’s not going to come out the way that I want and that I’ll only end up looking worse, then boom, thousands of dollars down the drain. So, I become hopeless.\n\nI feel hopeless when I see these Instagram models and celebrities—not the ones who had hundreds of unnecessary surgeries and are obviously photoshopped to hell—I’m rational about THAT—but the ones I know for a fact are naturally beautiful and had something to enhance with surgery in the first place. Even the ones who never had surgery of any kind but are ethereal, I envy because they won the genetic lottery and I did not. I feel hopeless when I look in the mirror and know that that’s drastically different than what I actually look like. I feel hopeless that no matter how many stylish ways I dress myself up or how much makeup I put on, it doesn’t detract from my ugly face and in fact it actually makes me look like more of a clown. I feel hopeless when I realize that I’ve never dated or hooked up with somebody that’s actually been attractive, or had anybody more attractive than me (or really anybody other than a family member or friend out of obligation) say I’m beautiful.\n\nI feel hopeless when I realize that the reason why people would always tell me that I “looked like my mom” (who is a very gorgeous woman and by the way, that’s a lie; I look like my dad.) was because it was a cop out and they could avoid actually having to call me pretty/beautiful/any other compliment. I feel hopeless and a tad bit resentful seeing gorgeous people become rich and famous off of their looks while I have to overcompensate with my personality and my intelligence just to get even a smidgen of non-obligatory acknowledgement. I feel hopeless that I can never find anybody who feels the way I feel without the moral of their stories being “oh I was so fixated on [imperfection] but I started to redirect my energy toward [insignificant/tolerable characteristics] and [mundane hobbies] instead and I came to accept my flaws and love myself!” and I feel hopeless that I can’t do a single thing about it or even talk to anybody about it because my mom is extremely prideful and she’s from a country/culture that frowns upon depression/mental illness in general and while I love her dearly, she’s never taken any of my issues seriously in any caliber and expects me to just magically get over them.\n\nAnd it makes me want to kill myself so fucking badly. I just desperately want to end my misery already and I’m not interested in living into my 20s at all, especially if I’ve stopped developing and this is how I’m supposed to look for the rest of my life until I’m middle aged and menopausal. The only thing preventing me from going through with killing myself is the fact that I can’t decide on which method I’d use, and I don’t want my mom to be hurt—that’s literally it. But besides that, I don’t know what else to do at this point.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kpfyld/horribly_suicidal_and_depressed_about_my_19f/", "title": "Horribly suicidal and depressed about my (19F) appearance. Don’t know where else to turn to.", "social_network": "reddit", "user": "throwittheshitaway", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1609657529, "permalink": "/r/SuicideWatch/comments/kpfyld/horribly_suicidal_and_depressed_about_my_19f/", "nsfw": false, "first_save": 1635428133.8465939, "replies_charged": false}