{"id": "t5_2qpzs_t3_qc88aj", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "Sort of at a crossroads right now, and not sure what to do.\n\nAlmost 30 m, just left from a date, where the person I was supposed to be on a date with had invited three other people from the same dating app they met me, everyone else seemed cool with it, but it was just so uncomfortable for me. Recently-ish out of an incredibly abusive relationship, so I'm already a little traumatized enough with my preferred sex, so having this be my first foray back into it is rough. I dunno if I'm just being too old school or what, but I feel so embarrassed.  \n\nAfter my last break up, I tried reaching out to a few friends, explaining a bit what happened, but it fell on deaf ears. At best a few pithy replies and 'I'm sorry's. I don't know what I was expecting, but I guess I assumed I'd have at least one or two people sort of care about what I went through, was a bit of a wake up call. Legitimately none of my friends care about what's going on unless it's good. I'm not even a debbie-downer type, I'm usually super positive, supportive, etc. so I guess I assumed I would be able to receive at least something somewhat uplifting back, but no. \n\nI'm religious, but due to some early mistakes, divorced, (amicably, it was essentially a convenience visa marriage for me), so I'm totally disconnected from that community. Have a beautiful family back home (I've been abroad for many years), but I've been gone so long that unless I chase after them there is basically no contact. Working a decent job, but completely soul-sucking, and a schedule that makes social life a nightmare. I haven't been out in the sun for weeks, can't meet anyone, and what close friends I have now are all too busy with kids or other life obligations. \n\nI need a change, but I've already tried 100 times, different jobs, different places, nothing helps. Just one humiliation after another, each time hurting worse than the last, I feel I'm slowly running out of options. I hate to say this, but I feel I've always been the stable, helpful person people come to when they're in trouble, letting people stay with me, helping out money-wise, lending an ear always, but now that its me that has the problem, the same people just don't care. I feel a bit idiotic, I wish I didn't need help now, wish I could figure out what the hell to do, but I'm so lost and so tired, as the days go by, it gets harder and harder to imagine a positive future for me. Whatever work I do to improve my situation just blows up in my face and I end up worse than before. I'm so tired,", "url": "https://www.reddit.com/r/SuicideWatch/comments/qc88aj/rough_day_rougher_year/", "title": "Rough day, rougher year", "social_network": "reddit", "user": "not-so-happy-ta", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1634756477, "permalink": "/r/SuicideWatch/comments/qc88aj/rough_day_rougher_year/", "nsfw": false, "first_save": 1635425188.5037935, "replies_charged": false}