{"id": "t5_2qpzs_t3_q7reww", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7", "929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I've done terrible things ([Heres my confession](https://www.reddit.com/r/Guilt/comments/pscvgc/how_do_i_know_it_my_teenage_sexual_mistakes_are/?utm_medium=android_app&utm_source=share)) and I could have seriously hurt people, and i'm not sure I can redeem myself. I feel the constant need to confess and I do on Reddit or on omegle pretty often. No matter what people tell me it never helps.\n\n\nI usually get told 3 things. Firstly i'll be it wasn't a big deal and no one was hurt so I should just move on. I can never convince myself what I did wasn't horrific and unforgivable, let alone something that \"wasn't a big deal\". Why should I be able to just move on when some people get put on a list and get there lives ruined for doing things like I have? It was a big deal, and I can't pretend it wasn't just so I'll feel better.\n\n\n\nThe next thing I hear is that my actions were terrible but that doesn't mean I can't be better and leave it all behind me. At first this seemed like a good option but craming it all down and acting like I'm not a peice of shit is so tiring. I look my friends and family in the eye and pretend they wouldn't be disgusted if they knew what I've done. It makes me feel like a fraud. They deserve to know, but I know telling them won't help anyone feel better.\n\n\nThe final thing I hear is actually the most uncommon thing I've been told, but it stays with me more than anything else anyones said. Basically I sometimes get told that I am eridemable, and I am too far gone, and I'm a vile scumbag whos only hear to waste the air around me. These are the things I ruminate on the most, I could get told by 9 people to move on and leave it in the past and told by 1 person I'm unforgivable scum that should burn in hell and I'll think about what the 1 person told me more than what everyone else said.\n\n\nI'm on the brink of a constant break down everyday and I don't know what to do anymore. I feel sub human and like i've wasted my chance to be a good person. About 7 months ago my best friend and former girlfriend took her own life and I'm pretty confident I would have to if I wasn't so scared of hurting people who care about me. She didn't take her life due to anything I did as I understand but I still blame myself alot for it, I tried my best to be there for her, I loved her and now shes dead. I give a person all my love and they take there own life, I think that's pretty good proof I am a poison to the people around me. We were really close and she genuinely seemed to care about me, she would always go out of her way to hang out and talk to me above anyone else I never understood why, I'm scum, I didn't deserve her compassion. I'm pretty sure i'm the last person she talked before she passed away, other than her immediate family.\n\n\nI don't think it's too late for me to die with her, I have a note she wrote me from about 5 years ago and I think if I hold it in my hand as I pass I'll be happy and finally feel with her again before I go. I know exactly how I would kill myself if I decide to and every day it seems like a better and better option, and I worry that one day I'll finally deicide to do it but it'll be too late for me to die with her, if I wait years then at that point shes so far in the past that I would just be dying by myself. I'm not sure if I beileve in an after life or reincarnation but I wonder alot about where she might be if eithet of those are real, and even if there not and she just fell into the void I still feel a little bit of happyness thinking that falling in after her, and being as close to her in death as we were in life.\n\n\nI know this is kind of just a rant post but I really needed to get all of this off my chest. If you think i'm eridemable then tell me, if I'm scum don't let me convince myself i'm not. I don't know what I am anymore and if I can convince myself I am too far gone then that will make my decision on what to do a lot easier.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q7reww/im_not_sure_i_deserve_to_be_alive_or_if_i_even/", "title": "I'm not sure I deserve to be alive or if I even want to be.", "social_network": "reddit", "user": "Bisdcatcat", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634182125, "permalink": "/r/SuicideWatch/comments/q7reww/im_not_sure_i_deserve_to_be_alive_or_if_i_even/", "nsfw": false, "first_save": 1635422994.5887887, "replies_charged": false}