{"id": "t5_2qpzs_t3_qh4l0r", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "I've been feeling suicidal lately.\n\nI'm not able to get the support I need.\n\nThere's only one therapist available at my college. Before, when I asked them for an appointment on call, they said they have one in like the next month. I emailed them later bc I didn't know where we would meet and I forgot the timing. They didn't respond. I felt so pissed that like a week later, I just emailed them to cancel the appointment. Then, they sent an email saying oh, you can talk to our director or whatever. I know they don't care. I've heard this woman's voice on call, and she sounds so apathetic. She never even bothered at least asking how I am feeling. She just went straight to asking generic questions like did you face abuse or do you have homicidal thoughts or do you have suicidal thoughts. I ended up lying about not having suicidal thoughts. It just felt like she didn't give a crap about me. It seemed like all she cared is whether I am a threat to others or I will ruin the reputation of the school.\n\nI used to take antidepressants and then I ran out of medication. The stupid service is so complicated. I tried contacting them numerous times through email and their website. That psychiatrist just doesn't take her job seriously. All she has to do is literally prescribe medication and pay attention to emails from her clients. But she can't even do that. And she even overprices appointments like it's 500 dollars. I just hate this whole system. They're all money-hungry pieces of shit that take advantage of depressed people. So, anyways, I have to wait for a whole month and a half just for an appointment to refill my medication. That stupid woman doesn't even realize how dangerous it is to abruptly stop medication.\n\nI'm just done. I hate this life. It's just hard to cope anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qh4l0r/no_one_gives_a_fuck/", "title": "No one gives a fuck.", "social_network": "reddit", "user": "forgot_username321", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635363158, "permalink": "/r/SuicideWatch/comments/qh4l0r/no_one_gives_a_fuck/", "nsfw": false, "first_save": 1635425589.0330353, "replies_charged": false}