{"id": "t5_2qpzs_t3_5oln3e", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I'm really only hanging on because of my mom haha. I already gave her a big shock before and I (or my ghost) would feel really bad to leave her with another big shock lol. It's just really hard to live to be honest. \n\nI'm really lazy and indecisive which pretty much causes soooo many problems with my life cos everything just piles up and up and up and so on. I'm just like paralyzed or something. And I can't even really bring these thoughts up to my therapist or anything cos then they'd put me on medication haaa. \n\nUgh everything is so hard to put into words. I just wish there was an easier and painless way of dying. It's like a cycle for me where I just bottle everything up for a few weeks or so (sometimes days) before I break down and just like research suicide methods. I know stress isn't good for your health and all but thinking about that just makes me more stressed haha. I pretty much cry every night even if I'm not feeling particularly sad. \n\nI just mostly keep everything to myself lol. URGH. I thought I was depressed but I read that depressed people don't feel anything but I do feel sad sooooo... \nThe worst part is that I think I like feeling this way haha. I fantasize about things getting worse for some reason. I love to daydream about getting with someone who treats me like trash. Like forcing me to wear paper bags over my head when they're around, beating me up frequently, not being allowed to sleep on the same bed or even speak when they're around, having to cook + clean + everything, etc like wth is even wrong with my brain. LOL and ofc it always ends up with me killing myself and then that random stranger will feel some sorta remorse which makes me feel even sadder haha. \n\nUGHHH IDK WTF IS WRONG WITH ME. Like I feel like I'm not even taking this seriously. I'm not concerned about dying really, I just wish it would be sooner. Not that I want my mom to die - I want her to live a long and happy life. It just means that I'm stuck like this for a little longer and I feel like I'm such a drain because I know I'm going to kill myself one day so why waste money on me? I hate eating out and buying clothes and whatnot because like I know I'm going to die one day. I don't know why you'd want to like waste money on me lol. \n\nI don't even know if this is the right place to post this to be honest. Like I'm not feeling like I'm going to kill myself tonight - I just know I will kill myself one day. I guess maybe this would've been better suited for like something like a rant forum or whatever. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/5oln3e/im_just_so_indecisive_all_the_time/", "title": "I'm just so indecisive all the time", "social_network": "reddit", "user": "mallory99", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1484695814, "permalink": "/r/SuicideWatch/comments/5oln3e/im_just_so_indecisive_all_the_time/", "nsfw": false, "first_save": 1635426633.2128618, "replies_charged": false}