{"id": "t5_2qpzs_t3_bnjt4k", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "Several of my friends have told me if I kill myself, they'll kill themselves. I didn't want to start a suicide pact. I don't want to hurt anybody. I just want to fucking leave everything behind and that be that. \n\nMaybe I'm a sociopath that doesn't care about other people. While I don't want to hurt others, life just seems too artificial. So what I kill myself? So what if they kill themselves? There's 7 billion people on Earth. People in general are fucking garbage. We don't matter. Nothing we do matters. \n\nMy therapist keeps telling me how I'll be able to help other people in the future, and I want to be a highschool guidance counselor, but why? Why should we put so much energy into people who are hurting? Recovery is so exhausting. Is it even worth getting to the day where I may feel occasional joy? I don't think so. I don't think any of this shit is worth going through. Therapy, medication, mood swings, hardships. \n\nSuicide is how I want to cope with everything. I want to get away from everything. I want to be free. If that's how my friends and family want to cope with my death then so be it. Suicide is an escape. I want to escape. \n\nI need to take some Benadryl and have some Lucky Charms. My allergies (and sweet tooth) are acting up. Not tonight, but one day, whether at my hands or someone/thing else, I'll be dead. And I can't fucking wait till that day comes. In the mean time… adios for now ✌️\n\nAlso, I'm done using my main account for posting here. This is my new r/SuicideWatch alt because of how often I want to kill myself.", "url": "https://www.reddit.com/r/SuicideWatch/comments/bnjt4k/how_can_i_lessen_the_impact_of_suicide_on_others/", "title": "How can I lessen the impact of suicide on others?", "social_network": "reddit", "user": "I_Want_To_Die_Alt", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1557625697, "permalink": "/r/SuicideWatch/comments/bnjt4k/how_can_i_lessen_the_impact_of_suicide_on_others/", "nsfw": false, "first_save": 1635427721.578403, "replies_charged": false}