{"id": "t5_2qpzs_t3_mqiorw", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I've been so unhappy for such a long time now. I just want to die, now. I think my dog Oliver dying in late February was just the breaking point- the straw on the camel's back. It wasn't always this way. When I think back to my childhood. I remember happy times. Genuine, innocent smiles, and unbreakable positivity. Things weren't perfect, though. I remember being bullied by my older siblings, and later by other children. Since I've always been sensitive, both to other people's feelings as well as my own, this hurt me terribly, and I have never forgiven either of the siblings responsible. I had such a sense of pride, as well. I don't know where it came from, but it was very strong. Since I was a smart kid, I presumed I was better than everyone else my age. I didn't treat them well, and it was a huge error in the long run. Though I had a few friends early on, those that weren't chased off by my nonsense and my sister's attention-seeking antics moved away or else found other people to befriend. I was alone. It's a feeling I know all too well now, to the point where being around others often makes me uncomfortable. My mother was, and is, a drug addict. Slowly she transformed from the person I loved the most, to filth I refuse to even acknowledge as family. I met Steven in third grade. We became best friends for a time, perhaps only two and a half years, until he moved away, but to this day I consider him to be the best friend I ever had. I remember happy times with him. I also remember awful times. Being pelted with rocks, getting beaten up, endless namecalling and mocking. Once he moved, I had no social contacts my age. I started to become somewhat neurotic, probably a sign of my at-the-time undiagnosed autism. Other people my age treated me terribly, and I was frequently mocked and bullied. Things only improved marginally in high school. While the physical attacks had stopped, because I had taken MMA and won a fight, I was still greatly disliked, at least by some, who made it very apparent. I was even spit on from an upper story at school, on Valentine's day. Here, too, were moments of happiness though. I enjoyed learning, and took up Japanese as a second language. I went to little Tokyo in LA many times with my favorite teachers and a small group of weeb students. Even then, though, it wasn't worth it. I was so alone, and hurt. All I wanted was a friend. I never got one. I nearly chose to end my life then, but I made a promise, to stick around and live for my father, the person I love and cherish the most. When I graduated, I did it with honors. Imagine my surprise when, accepting my award, I received a standing ovation from the students... I wasn't hated by them after all, but I was so untrusting of everyone that I never allowed myself to see that. This realization hurts to this day. I was alone and hurting for so long, and it was my fault, completely. In college, things never improved. I couldn't handle the work load, for one. A lifetime of being praised for the minimum excellent work that I did made me lazy. Then came one of the hardest hits. I had to move. The housing trap we lived in was becoming too expensive to stay after 20 years. I was forced to drop out of college, and the movers we chose ended up stealing or destroying most of our things. I lost so much. Despite that being nearly two years ago, it still hurts, like a wound. I am extremely sentimental, and losing these simple belongings hurt me at my core. Shortly after arriving at my destination, in NC, I had to be hospitalized for severe suicidal ideation. I hated it. I made a vow then, to avoid the mental hospital forever. I would try to hide my pain from others, pretend to be fine. Anything to avoid that place. I got a job, worked it for the past year until I fell and broke my ribs. I'm still here. Everything still hurts. I still hate my siblings for the way they treated me, their own little brother. I still hate my sister for driving away my early friends. I still hate my mother, for never being there when I needed her, and for being a narcissistic sociopath. I still hate those that bullied me for so long. Their names and faces are lost to me but their deeds still digging in. I still hate that I never realized how loved I truly was. I still hate everything, and everyone. I love everyone, too. I don't ever want to see another person suffering. The world is cruel though, intentionally. Those in power would not be able to create utopia, but they could make the world so much better and equal and fair and kind, if they collectively chose to. I am so tired. So tired. I am only 22 years old, and I feel as if I have lost everything and everyone. I had dreams, once. They changed as the years passed, until my illusions were finally shattered. I have learned. Dreams, and things like hope, only serve to hurt you. If you consistently hope that things will get better, you will be consistently hurt when they do not. Never forget this. If anyone ever tells you that \"Things always get better.\" know that they are one of two things. Either a liar, one who seeks to teach you an untruth, either for good or malicious reasons, or they are delusional. Things don't get better. Never. They only get worse, continuously. Sometimes, it may seem like things are improving. You may doubt these words, think things are finally on their way up. You are wrong. Things only improve in marginal or temporary ways, or as a reaction to something bad occurring. Stay safe, don't hope, don't dream, and certainly don't try. You will only get worse for it, like a divine punishment. I'm still here. I want to die. I want to die so badly. I have not wished to live in so long that I lost sight of why anyone would ever want to live. To live is to suffer, to be hurt over and over and over. There is beauty in life, yes! Love and kindness and nature- animals and plants and fungi of all kinds. Beautiful colors and amazing landscapes. It is incomparable though, to the pain. For every good thing in this world, there must be at least 10 bad. For every pretty bird you see, how many are killed by wild mangy cats we created, or left homeless for deforestation, or simply made extinct? It is hopeless. There is no change or recovery, no way back. If I had my choice, I would have been a miscarriage. No pain, no loss of innocence. Just peace, my mother's heartbeat, and then eternal darkness. Doesn't that sound lovely? I am tired of responsibility, even as simple as chores or simple obligations. Every day I walk home from work, I must force myself to not throw myself in front of a large vehicle. Were I an awful person like my mother, I would have done it long ago. The only reason I do not is because I do not wish to traumatize the driver. They would likely be too weak to end their own life, and thus be trapped with pain as I am. That is the only reason. The promise I made long ago, to live for my father? He, too, has changed. The strong man I once adored has withered into a crippled husk, his chronic pain and many disabilities leaving him in a worse state than I could even imagine. No, he will never be happy, not by any action of mine. If he finds his own happiness somehow, let him have it. I want no part of any of it, of anything at all. I want to be dead. The horrible thoughts that twist through my head repeat themselves, unendingly. I want it to be over. Even sleep is not a respite. There, nightmares and unpleasant memories linger and mix with unwanted fragments of pasts and emotions and smells I had long forgotten about. I want to die. This is not a situation where I hate myself. I was simply dealt a bad hand in life. I hold no ill will towards myself. I do not wish to live anyone else's life either, though. It is too much. I can't take it. Is it that I'm too weak to live in this world, or that maybe there is a happy life for me out there? I don't know. I don't care. I'm so tired. I'm so tired. I want to go home, but nowhere to go back to. All is lost. I'm still here. Every night I daydream of disemboweling myself in the back yard. Sometimes I consider killing my family first, so they won't suffer either. But in the end I never make a decision. I feel like I'm going to snap somehow, to go absolutely mad if I have to endure these ruminating thoughts and memories any more. I miss my dog. I'm typing through tears, and I'm sure none of this even makes sense, but it's how I feel. It's what I think about every single day. I'm so tired.\n\n&#x200B;\n\nYes, I am on medication. Yes, I have a therapist. Neither helps. If you made it this far, thank you. I'm sorry.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mqiorw/its_rambling_and_stupid_and_a_bit_philosophical/", "title": "It's rambling and stupid, and a bit philosophical, but I wrote it tonight instead of a suicide note. It'll probably just get deleted, but whatever. It doesn't matter anyway.", "social_network": "reddit", "user": "The_Kihng", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1618372492, "permalink": "/r/SuicideWatch/comments/mqiorw/its_rambling_and_stupid_and_a_bit_philosophical/", "nsfw": false, "first_save": 1635428042.021583, "replies_charged": false}