{"id": "t5_2qpzs_t3_ogejmd", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "[any personal/identifying details are removed]\n\nIf you’re reading this, then I’m sorry. Please forgive me, although I know that might take some time. This was purely my decision, and it’s not your fault, or anyone else’s. There isn’t anything that you could have done. I feel so broken and so lost, maybe now I can finally, *finally* find peace.\n\nI owe you an explanation: the longer my life goes on, the worse it gets. In regards to so many different problems in my life, all I hear is, “It will get better.” It’s not getting better. Any of it. Participating in life is tedious, draining, unfulfilling, and *incredibly* sad. Though you are now probably experiencing bewilderment, anger, and grief because of what I’ve done, please know this: I didn’t *want* to die.\n\nAlmost everyone and everything in my life was supportive of me. I wanted to “try” at life - to attempt to grow old. The world was truly a beautiful place at times. This was especially true because of my wonderful family (*all* of it), and because of [removed] friends in particular: [removed names]. To these friends: even though the time in our lives when we would see each other has long since passed, you were there when I was the happiest. You were rays of pure sunshine in an otherwise bleak world. To you, and all of the other extraordinary friends I’ve known along the way, thank you for being there for me. I was seriously lucky to know all of you.\n\nThe thing is… I feel emotionally unfit to keep wading against the currents of life. I am *so* sad almost *all* of the time, and I can’t do anything about it. Believe me, I’ve tried and tried. You name it: sobriety, exercise, mindfulness, meditation, self-help material, multiple medications, multiple doctors, multiple therapists, and even a psychiatrist. To me, suicide has been an insidious and ever-present mental, intellectual, emotional, and spiritual cancer ever since the first time I heard about it in childhood. I almost feel like this was inevitable. I have always felt like an outsider looking in on life - never a participant, only an observer. I have thought about suicide at least once per hour (excluding sleep) for over a decade. After trying to simply just *hold on* for years, I guess the final straw broke the camel’s back.\n\nThere were brief periods when I thought I might be able to overcome this feeling. When I was able to potentially envision a future, it was so liberating. These periods were always due to help from other people. I tried so hard to be my own source of light and strength, instead of looking to others, but that’s just not how I am. I’ve always needed some help. To be blunt, I never thought I would make it to [age removed]. Now, I’m [that age + slightly older], and as time passes, the relative stability and occasional optimism of my past has completely eroded into an existence that has no fulfillment, only despair and pain. After years and years of desperately trying to find meaning and motivation, there is no future. I can’t envision it. It’s just… nothing. I feel totally lost. This, in combination with the increasingly crushing burdens of being an alive human being, leaves me with only one option: to quit. This feels like the only thing over which I’ve ever actually had control. To stop struggling against the currents of life and let them overtake me sounds like the most appealing thing imaginable.\n\nI’m sorry to pass this pain onto you, but if you’re reading this, then you’re stronger than I ever was. I just couldn’t take it any more. Being the perpetual observer is **so** lonely. If *you* are lonely, then I’m truly sorry for you. Those moments when you have something that you’d like to share, but there’s no one there - I know that pain well. I have felt fundamentally alone and lonely since I started retaining memories.\n\nThe one thing that I always really wanted was to travel, but I never got to do that very much. The farthest I ever got was [location removed]. In the future, if you’re ever at a particularly beautiful place, or in a wondrous moment, maybe think of me - just briefly. If I’m lucky, I’ll get to be right there beside you. If I’m even luckier, I’ll soon get to surf the waves of spacetime.\n\nI am so sorry, and I love you - yes, *you* - so much.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ogejmd/fuck_it_heres_a_draft_of_my_suicide_note_see_if/", "title": "Fuck it, here's a draft of my suicide note. See if you can relate (hint: you can)", "social_network": "reddit", "user": "Successfool", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 820, "down_vote": 0, "creation": 1625772630, "permalink": "/r/SuicideWatch/comments/ogejmd/fuck_it_heres_a_draft_of_my_suicide_note_see_if/", "nsfw": false, "first_save": 1635426852.0712814, "replies_charged": false}