{"id": "t5_2qpzs_t3_f4oujx", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I feel hollow for a long time now. I'm unmotivated, I go to work, back home, eat when I feel like it, sleep a lot. I ve been waiting for death to come to me. I do remember I really dont want to live since I'm on 4/5th grade, I feel like there's nothing good will come out of living in this world. It become more intense 8th grade, my friend found out the book which I write how I want to die and dont want to live in this world anymore. But she didnt do anything, she just asked, and then seems to forget.\n\nMy mom always have such a high expectation from me, I never realized it until now. Top rank at school, I attended many private lessons, it just felt normal to me. I even felt sad or stressed out when my rank drop, eventhough they didn't say anything. It just already deep on my system. I dont have many friends, since I'm socially awkward and all, and I always embarassed myself. I do felt like I'm forced to bite off more than I can chew.\n\nI want to die so badly, and I feel I have nothing to lose, but people keep reminding me about my responsibility to this society, to my family, etc. As it isn't enough, these people keep pressing me about marriage, about child and family, those nosy neighbours keep staring strangely when I kept single at my age (late twenties), when I work from home sometimes (remote): they told me that I don't have 'real job'. I ignored all of these and try to keep my ground, I like my life and I dont feel I need a partner or a child. I want to live freely without any ties bind me.\n\nBut these pressure become so unbearable lately, they become worse, and worse. Its suffocating.  I feel like I'll be slipping soon. I even already considering searching for marriage deal/contract, where we pretend to be a couple with one just to make everyone happy. But I dont want the kid suffered.\n\nThe worst part of this situation is no matter what I can't bring my self to do it. The responsibility felt so heavy on my shoulder, and set so deep in my heart I cant even raise the gun, more over pulled the trigger, or sliced my wrist. I just can't. I think about poison myself, or drink sleeping pills so I can die on my sleep, but I dont have the prescription.\n\nOr maybe I'm just a coward.\n\nI dont know how long I can keep going. I seriously feel like empty shell, hollow, I dont have any plan for my life. I just work to pay all the bills and get something to eat.\n\nI just wish death come to me soon. Is it weird? Or is it just lazy? Should I see the brightside and feel grateful at least I can eat everyday and not homeless? Is this a serious matter or I just being dramatic? Is my situation actually not that terrible and more people have it worse than me? Should I live long enough to pay back all the kindness people and family gave to me?", "url": "https://www.reddit.com/r/SuicideWatch/comments/f4oujx/wanting_to_die_but_not_suicidal_indecisive/", "title": "Wanting to die but not suicidal? Indecisive? Dramatic?", "social_network": "reddit", "user": "MaccaHere", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1581848183, "permalink": "/r/SuicideWatch/comments/f4oujx/wanting_to_die_but_not_suicidal_indecisive/", "nsfw": false, "first_save": 1635426611.4058113, "replies_charged": false}