{"id": "t5_2qpzs_t3_ol644y", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "Hey guys, it’s me again. I had total insomnia 2 1/2 years ago caused by cbd oil and Flonase nasal spray interaction. Now I have total insomnia caused by doxy. Had it for 1 1/2 months. I get acupuncture 3 times a week which helps me from having to go up on my meds. I take 200 mg of Seroquel. Some nights are rough. I feel I’m up all night and sweat profusely. Other times my rest is better and I can get lots of dream state rest. Still I think of suicide. On the other hand I’m holding on. I feel like I’ll be like this forever but every one says I’ll get better that it just takes time. I feel my gaba receptors are damaged and will just take time to heal. I do sleep it’s just my mind doesn’t recognize it as sleep. I’m afraid I’ll be like this forever but on the other hand part of me hopes that my body can heal and I can start feeling like I’m sleeping again. My mind says I’ll never heal even though I healed from total insomnia last time. I’m just so scared and I stress out my family even though I don’t want to. I lost my independence again and I wonder if I’ll ever heal again. 😭\n\nOther symptoms I had were my brain and eyes feeling like they were going to blow, parathesia and joint pain in wrists and ankles, messed up throat and trouble breathing like heavy feeling, TMJ. All these symptoms actually went away though. The trouble breathing took a month to go away. TMJ isn’t that bad. I think to myself if all this was able to heal can my total insomnia go away?", "url": "https://www.reddit.com/r/SuicideWatch/comments/ol644y/total_insomnia_from_doxycycline_makes_me_think_of/", "title": "Total insomnia from Doxycycline makes me think of suicide daily", "social_network": "reddit", "user": "Catheg8", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1626397080, "permalink": "/r/SuicideWatch/comments/ol644y/total_insomnia_from_doxycycline_makes_me_think_of/", "nsfw": false, "first_save": 1635426507.5712163, "replies_charged": false}