{"id": "t5_2qpzs_t3_o5gx1d", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "17 nb\nI keep scaring myself with suicidal thoughts. I don’t want to die but I just feel so disconnected from life. My friends probably hate me because I’ve been so spacey and easily frustrated and cry so easily now with every little thing, I have a broken heart from a crush, and now I’ve finally pushed everyone away under the excuse “I need a break for my mental health”\nNow what the hell do I do\nPost here? Burden more damn people with my sorry existence?\nAbout 85% of my brain is filled with static or at least that’s the best way to describe it, 10% is heartache, and the other 5% is the small glimpse of happiness when people reach out and say they’re here for me. That’s the best way I can describe how I currently feel and I don’t know what to do. My parents are the sort of people who are trying to understand mental health but would probably be reluctant or ask a ton of questions if I asked to see a therapist again, and I certainly don’t want to be taken to a hospital or seem as broken for having suicidal thoughts. I’ve only been diagnosed with GAD but I feel like I could have some kind of attention disorder or very slight autism since I just can’t understand people sometimes (I hate self diagnosing but I worry so much I’d like a test to just… relieve that I guess?) and since anxiety and depression are in hand and hand I want to get diagnosed with that ASAP but I just can’t bring myself to ask for an appointment or ask for help outside of this subreddit where if I say the wrong thing I won’t be escorted to a hospital or seen as wrong or a liar\nI feel so disconnected and just can’t seem to find motivation anymore especially since it’s summer where there’s nothing to do to escape your thoughts \nI wish I had the balls to just take sleeping pills or od but I just couldn’t, not yet at least, my family needs my help and support and so do some friends\nI just wish people would say they dare more without me seeming needy\nI wish people would ask how I am\n Wish people would care and not make me feel so replaceable, like I’ll be here forever\nWhy is it so comforting to imagine people mourning me? Like I’d matter more in death and at least then people could really care\nI just really needed to get this out since I’ve pushed away anyone who would listen or even care at all thank you in advance if you read this far, I hope everyone has a wonderful day or night <3", "url": "https://www.reddit.com/r/SuicideWatch/comments/o5gx1d/increasing_suicidal_thoughts_and_numbness/", "title": "Increasing suicidal thoughts and numbness", "social_network": "reddit", "user": "anonymous183609", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1624345687, "permalink": "/r/SuicideWatch/comments/o5gx1d/increasing_suicidal_thoughts_and_numbness/", "nsfw": false, "first_save": 1635426801.1917732, "replies_charged": false}