{"id": "t5_2qpzs_t3_pjp6ph", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "After a long hiatus, I am back but much more broken than the first time i ever posted\n\nI am 24 years old but my journey began in my teenager years. platforms like these was the only gateway I had to release to my depression and anger that was built up ever since childhood. The bullying in middle school and high school didn't help as it drove me deeper into incel circles and more radicalize ideals about life.\n\nEventually I stop going any deeper and instead focus my relationships with my family since I had no friends. Overall this was good because at least I had someway to vent my problems or frustrations about the world to someone.  I became less radicalize and more open minded to people thru small conversations here and there. I started to attend college and was passionate to achieve my dreams, but eventually things started to collapse.\n\nNot long after I drop out of college due to complications of anxiety and I wasn't okay to move forward. I just couldn't handle the pressure of high expectations. in retrospective at least I don't have college dept. but still, there were a lot of people in my family who was disappointed in that decision. but I continued to move forward to find a job. During my work I became more lonely and bitter about the world and my depression started to rise yet again. Then covid happened and made it much worse for mental health.\n\nI just felt sad and depressed. I just wanted the pandemic to get it over with but instead it lasted a year of quarantine, isolation, and lockdowns. what's worse is that I now endlessly consumed a lot of content that developed into a parasocial behaviors just to cope with the reality of the world. I was so down bad that I developed a porn addiction in the process while having no gf or friends in general. I'm so ashamed of myself throughout the year and hate what I became this year.\n\nOn December of 2020 , my family receive the terrible news that my uncle passed away due to covid.\n\nThis broke me entirely because he was the wholesome person you met and was a good father to his 11 year old daughter and now he's gone because of covid. if only the vaccines were here early he would've still had a chance but unfortunately it was a month before when the vaccines were distributed\n\nAfter mourning a lost one for about a month now, I spiraled into sheer hopelessness cuz I just had enough of it. I thought I got under control but my mental health started to decline. I've began to hate everything that happens in my life that I developed suicidal thoughts.\n\nA day after my birthday, I experienced some form of a existential panic attack and it was the day that I was gonna end it. I contemplated and cried almost an hour whether or not I was gonna end it now in the shower with a knife in my hand. I've tried it before but I resisted to continue any further cuz i stared at my old scars of terrible memories i had trying to attempt it.\n\nthat day I thought about it and realized that I have so much ahead of me. I didn't want to end it now. but still, I been having these lingering thoughts of suicide in my head and it frustrates me the most. fuck man this depression sucks along with the parasocial behavior I have. Recently tho I been very careful with my urges, but perhaps it's will power that is stopping me or it's the fact that I don't want to be a burden to my family when I'm gone. but man these thoughts aren't going away.\n\nfor now I'm okay so far. I just wanted to vent my mental health state here cuz I might relapse again and this time I wont make it out. I'm not feeling it today nor these past two years. I'm praying good things might happen, but who know what the grim future might look like. anyways plz don't recommend a therapist. I know they help sometimes but not right now. Maybe in the future when I'm stable but plz that's just gonna give me pressure and then I might not go for it. Thank you for reading my post and Hopefully I survive another day.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pjp6ph/these_thoughts_are_killing_me_inside/", "title": "These thoughts are killing me inside", "social_network": "reddit", "user": "0ddzboi", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1631028143, "permalink": "/r/SuicideWatch/comments/pjp6ph/these_thoughts_are_killing_me_inside/", "nsfw": false, "first_save": 1635426757.1175356, "replies_charged": false}