{"id": "t5_2qpzs_t3_pajz8z", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "..in a limbo between not wanting to live, and not wanting to put people who care about me through the pain of losing another loved one. \nI dont want them to go through having to clean up the mess, arrange a funeral, deal with the grief.. it's like I'm waiting for everyone I know to give up on me before I can finally rest.\n\nI feel like a complete and utter disappointment to my mom, my partner, my whole family and my few friends.\n\nI'm about to lose my job because some days I'm too wrapped up in my own misery to go in. I cant even bring myself to get out of bed to clean the house or eat. It's like I'm watching myself wither away. (I'm down 20 pounds in 3 months, from 150 to 130 and I can see how unhealthy I look. I dont even care about how I look, my self esteem hit a low a while ago to the point where I dont care anymore. But I know 'unhealthy' when I see it.)\n\nHell I'm terrified of getting old too, medical problems run in my family and I know by the time I hit the age of 30 my body is gonna start shutting down. I saw it happen to my grandma, my mom, and now it's going to happen to me soon if I even make it that far. \n\nI dont know what to do, I can see that my mental health is taking a toll on people around me that I care about and I with I could get better. I feel like me being around is just prolonging the inevitable, I'm just making my loved ones suffer even more before I go. Like I'm questioning whether or not itll be better to just rip the band-aid off now and take my life and let them mourn because everyone can eventually move on from grief because death is a part of life.\n\nI keep having these little glimmers of hope that life will get better. But then reality keeps crashing back down and it hurts more and more each time. I'm so tired.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pajz8z/i_feel_stuck/", "title": "I feel stuck..", "social_network": "reddit", "user": "notfeelingwellanymor", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1629797850, "permalink": "/r/SuicideWatch/comments/pajz8z/i_feel_stuck/", "nsfw": false, "first_save": 1635426755.4416175, "replies_charged": false}