{"id": "t5_2qpzs_t3_mvqcce", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "I’ve been sitting with depression for 33 years. In the past 3 years, it’s been extremely dark. The tears, the loneliness, the mental breakdowns and physical pain have become my norm. I sought help in the past year by regularly visiting a psychiatrist. For a few weeks, it felt good and life was in technicolor. Then it got dark again. The darkness has completely enveloped me. I’ve always been different. I’m adopted and never fitted in my adoptive family. I’m an artist so perpetually poor. My brain is wired so differently so much so that I scare ‘out of the box’ thinkers. According to ‘New Age’ folks, I have a repelling aura that can trigger people just by me breathing. And I lost at the pretty gene lottery - I look hideous. I have no friends. Actually, that’s a part-lie. I have several acquaintances that hover around me for favors and freebies [I used to work at music concerts] but they magically disappear when I ask for help. I got retrenched from a job that I had for almost 8 years. And they let me go in the middle of a pandemic with half a paycheck and ‘good luck with finding a job’. The final cloud of doom arrived today. I had a mental breakdown in public while at the grocery store. I watched people talk to their partners/lovers/kids and I realized that I’ll never have a life like that. I won’t be a parent. I won’t be successful. I won’t be in a relationship. I won’t amount to much. No matter how much I try, I won’t be of any value. I will always be broken. My physical body is overweight and gross but my shadow and soul is shattered. I can’t pick up these broken soulless shards over and over again.\nI’m very much done with this world and I’d like to end my life.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mvqcce/my_shadow_soul_is_broken/", "title": "My shadow & soul is broken", "social_network": "reddit", "user": "hendrixwasgawd", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1619041764, "permalink": "/r/SuicideWatch/comments/mvqcce/my_shadow_soul_is_broken/", "nsfw": false, "first_save": 1635425191.9839802, "replies_charged": false}