{"id": "t5_2qpzs_t3_q75he7", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "I can't fucking do this anymore. Like I genuinely don't have a reason to be alive. I'm merely alive because two of the world's worst people decided to procreate and see how fucked up the children they spawned would be. I have so much trauma and genetic mental fuck ups, there was never a chance for me. I was doomed from the start.\n\nI have developed a debilitating crush on my roommate. I'm so infatuated with her. She's all I think about most of the day. She's the only thing that brings me any joy. I know it's not healthy, but my brain has latched onto her like fucking heroin. I've told her that I love her, and she told me she didn't feel the same. But she cares for me in a way no one else ever has. Last night she heard me crying in the bathroom at work and forced me into a hug because she knew it was exactly what I needed. I jokingly told her she's the only one who's ever proud of me, and she told me that no one else has ever been able to see my worth and appreciate me like she does. How am I supposed to interpret that?? How am I not supposed to fall more in love with her??\n\nTonight she brought a girl home. They're going to hook up. They're giggling in the living room now as I lay here mourning something that never existed.\n\nIf there's no future with her, I don't want to see what the future holds.\n\nI'm very close to the edge. This might be the rock that trips me off.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q75he7/i_am_genuinely_not_sure_if_i_will_be_alive_24/", "title": "I am genuinely not sure if I will be alive 24 hours from now.", "social_network": "reddit", "user": "v-i-o", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1634107719, "permalink": "/r/SuicideWatch/comments/q75he7/i_am_genuinely_not_sure_if_i_will_be_alive_24/", "nsfw": false, "first_save": 1635426731.3102384, "replies_charged": false}