{"id": "t5_2qpzs_t3_8juz3s", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "              I thought life finally got better. I’ve been on antidepressants for over a month now. Fuck the Jordanian society. I hate seeing my former friend (who I’m still in love with) in pain, I’ve been really mean to him lately to the point where he cried, I hate myself, I even cut myself today to punish myself for hurting him, I just broke down. \n\nLet me tell you the story of what happened today, (I’m a girl in a guy’s body btw) we were at gym class with the guys in my class, and they tried to get us to be friends again but we said no. And they tried to get us back to being friends again but we still didn’t want to, then they tried to get us to fight physically but we didn’t accept and they just kept physically pushing us to do it and we kept fighting against them, then i got out of the building and the coach fucking calls me and forces me to come back, and the stupid guys forced us fight verbally and we threw lots of insults at one another to the point where he cried, I didn’t apologize out of hate for him after the heartbreak he gave me, but seeing him crying (we’re both 14 btw) just burned my heart and I am crying right now because I hurt him and can’t apologize (due to certain circumstances) , I don’t know whether to blame myself or my classmates. I hate myself.\n\n        And another thing that happened at school today, the school counselor called me to her office today, and she has told me that my teachers told her that I am acting extremely femininely (I live in Jordan therefore my environment is very anti lgbt) and that she is worried about me, and that she kept questioning me about what’s going on in my life and I know I can’t tell her anything. she never got her answers and she’s gonna question me more tomorrow. School in general does nothing more than raise my anxiety levels. (On an unrelated note: my therapist said I’m vulnerable to developing anxiety disorder). I just recovered from anorexia and I wish it killed me, if you’ve read my previous posts then u’ll know I was already depressed and had anorexia. I just recovered from that anorexia and I wish it fucking killed me. Please someone say something.", "url": "https://www.reddit.com/r/SuicideWatch/comments/8juz3s/anorexia_i_wish_you_killed_me_sorry_this_is_long/", "title": "Anorexia... I wish you killed me. (Sorry this is long)", "social_network": "reddit", "user": "Omalk", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1526477919, "permalink": "/r/SuicideWatch/comments/8juz3s/anorexia_i_wish_you_killed_me_sorry_this_is_long/", "nsfw": false, "first_save": 1635422265.5867443, "replies_charged": false}