{"id": "t5_2qpzs_t3_iqzcia", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I've been battling with depression and anxiety my entire life, and not once have my parents believed me. My dad admittedly tried to understand, but my mother just firmly believes that in lazy and I just don't care about things when I should.\n\nI've been in college for 5 years now, pursuing a biology degree I not only don't feel any investment in but was pushed into by my parents. It was hard to argue with them since they helped me pay for tuition, at least in the beginning, but at this point I just despise the subject.\n\nIts so hard to fall asleep at night, and when I finally do drift off there isn't any escape. No dreams, just one moment of almost bliss and then its morning; its been nothing but years of feeling less rested and pain every single morning. And I mean actual, physical pain too. My joints have been popping and aching and locking more often.\n\nEveryone always asks me what my plans are after graduating, and it takes everything I have to not just say that I'm doing my best to not end it by the end of the week. I dont have any plans for the future because I can't picture myself in the future.\n\nI've never attempted suicide before, but thats exclusively because it takes all my strength, my attention my willpower to keep myself from doing anything. And its infuriating to see my peers, cousins, even sibling not only not struggling, but fucking thriving around me. I can barely get myself out of bed each morning and they all have their lives together, moved out, have a family, have great careers. But no, I must just be too damn lazy, not enough of a go-getter, thats the only explanation.\n\nI'm so sick of living with my parents still at 23, of being stuck in a major and career path that I loathe, of not even remembering what used to make me happy anymore, and of secretly hoping that it all just ends because if I'm being honest, I'm just not strong enough to actually go through with it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/iqzcia/im_drowning/", "title": "I'm drowning", "social_network": "reddit", "user": "Revelation_the_Fool", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1599858500, "permalink": "/r/SuicideWatch/comments/iqzcia/im_drowning/", "nsfw": false, "first_save": 1635427178.0717232, "replies_charged": false}