{"id": "t5_2qpzs_t3_i595fv", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I’ve been spiralling for a while now. Years. Everyone tells me that it “gets better” but it doesn’t. They don’t know the inner workings of my brain. \n\nI work for a certain corporate mouse. I just recently went back to work and I can’t handle it at all. Before I even got the call to go back I tried to kill my self by taking too much clonazepam. Three days in a row while my boyfriend just thought I was sleepy. Today I doubled down on my dosage last time and took thirty mg. I’m just stumbling around. I’m ducking stupid. So I’m trying to get the willpower together to just cut open an artery in my wrist and take a hot bath and just let it all leave me while I listen to the music that makes me feel... I don’t want to say happy, but content. Saturday is when I’m getting a refill on my clonazepam so I’m going to take all 60mg to numb the pain and do it. \n\nI broke up with the one person I saw a future with. Before him I saw nothing. But he kept making me feel worse and worse and worse as time wore on. Like I was a burden on him. He loves me but he makes me feel like a burden. My parents too, to the point where I was going to go no contact with them. They make me feel so worthless and small. All I fucking wanted was love and care and attention. \n\nOn top of that, I recently excavated repressed memories of being groomed and sexually abused as a minor as well. I must be the world’s shittiest archaeologist. I had to tell my parents three fucking times for them to have it sink in. My ex while I remembered yet another instance that was peticularly violating ignored me going catatonic on the couch while he angrily cleaned around me, making every nerve ending alight with fire until I said I need d to go lie down. I barely remember after that. I’ve been losing hours and days. \n\nIve managed to unintentionally build up a system as to where no one is going to call a wellness check on me. I can’t go to a fucking hospital again. Especially not in cuffs. I know this will hurt... I don’t know like five fucking people???? But every fucking moment of my life is screaming agony.\n\nMy boyfriend... well, ex at this point I suppose, is going through his own shit. I try to give him space but he wouldn’t let me. He always back burnered his shit to be there for me when he clearly didn’t want to. And when I confronted him about it to take care of himself, he told me “there’s always something” with me, so he can’t. \n\nI’ve been holding onto that. He is untruthful to me about his emotions but they radiate off him in waves.  If I apologize and ask if I’m interrupting or being ‘bad’ he would get this fucking wince and say what he wanted to do. This wince of “fuck here we go again I guess I can’t do what I want”. He’s been doing it for years. I’d confront him, he’d deny it, then months down the road he’d confess I was right. He’s been gaslighting me this whole fucking time. \n\nWe were together almost three fucking years. This past month I’ve been just sharply getting worse and I’ve talked to him about how he can’t fucking help me unless he helps himself multiple times. \n\nAnd it’s over. \n\nI don’t want my legacy to be killing myself over some guy. This isn’t what I want. I’d rather be forgotten. Blipped our of existence. I don’t want to hurt people but they’re all selfish for making me stay here on this plane of existence where I cry every single fucking day, or I’m numb, or I’m panicking. I don’t have a normal day. I can’t cook for myself. I can’t clean up after myself. I can’t even manage my meds on my own. Hygiene is out the window unless necessary (work) and my laundry is just a pile strewn around because I just picked all his clothing out of it. \n\nMy parents will probably find my body. It’s going to shatter my mother. It will destroy my father. But those two facts which have stopped me thus far cease to matter. I said my one goodbye. I held my dog in my arms and cried over him and apologized and told him he was the most important thing in the world to me. I sent my parents an email of my final wishes post-mortem. I’ve tried to tie up as many loose ends as I have the energy to. \n\n The rest of this week is just a matter of finding courage. Courage to face headlong into the unknown and hopefully find that my consciousness ceases to exist. It’s horrifying and scary, but it’s all I can do now. I have no real friends. Everyone leaves. I’m the common denominator. I shouldn’t exist.", "url": "https://www.reddit.com/r/SuicideWatch/comments/i595fv/i_think_ill_be_dead_by_sunday/", "title": "I think I’ll be dead by Sunday.", "social_network": "reddit", "user": "chuuyyxy", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1596783552, "permalink": "/r/SuicideWatch/comments/i595fv/i_think_ill_be_dead_by_sunday/", "nsfw": false, "first_save": 1635422320.7542374, "replies_charged": false}