{"id": "t5_2qpzs_t3_nl6l60", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "People tell you that you're worth someting and that they care, but the moment they find out you're too unmotivated, depressed, pessimistic, etc... to save yourself then they leave. I guess I can't be mad at them because with life being how it is you really can't sacrifice yourself for the sake of others. That's why I am doomed. I am stuck in a hole that I can't get myself out of. My grades are shit because schoolwork takes me forever and a half to complete and there's too little time for any fun when I power through work and I refuse to live without fun. You call it childish and I agree but idc I think living is overrated. I'm not gonna work hard to barely mean anything in a world where nothing matters and all I get in return is endless pain with very small (I'm taking microscopic, absolutely minuscule) boosts of positivity. You're telling me everyone REALLY expects me to go through hell and back studying/working just to see another day where things *might* be slightly better. Honestly that's not even true, cut the bs, really everyone wants us alive so that we can be slaves to the people that get to sit on their asses all day everyday having everyone else do their job for them. I don't even want to do nothing and be lazy I just don't want to do everything that is required of me. I want to just work alone doing manual labor without the hate of other people without being too rushed. But that's impossible.\n\nBefore you tell me to just \"pick yourself up and work hard to get better grades.\" That means you don't understand. I don't have what it takes to do that. I'm too weak. All I can do is sit on my ass all day everyday moping around.  I try coping but I still feel the pain of life. Sure it keeps me from having panic attacks but it doesn't take away the overall mental malaise that I always have. Even if it's small it's still stress and pain and I just can't handle pain. Yes call me weak and beat me down even more I don't care it's the truth. I really just can't do anything. I am not capable of handling life.\n\nTo be honest I still can't kms because of a few reasons. 1. I really am not a person that was made to give up. Everything in me is telling me to give up but I still have this spark in me that just won't let go. But said spark isn't enough to do what I need to do. I NEED to be more/do more but I really can't. People are discussed and look down at me because I just am not what I need to be but there's nothing that I can do. I really just wish I could truly give up and go through all my plans. I tried to leave this world a few times already but each time I just couldn't take that last step. 2. The fear of pain.\n\nIt's like a little kid helplessly lost in the store crying out for his mom. I'm that kid lost in life that's crying for an escape. I even tried getting high but I still felt too much pain. It made it hurt less but it still hurt.\n\n&#x200B;", "url": "https://www.reddit.com/r/SuicideWatch/comments/nl6l60/i_find_this_absolutely_fucking_hilarious_and/", "title": "I find this absolutely fucking hilarious and depressing at the same time", "social_network": "reddit", "user": "Cantevenexistright", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 24, "down_vote": 0, "creation": 1621997313, "permalink": "/r/SuicideWatch/comments/nl6l60/i_find_this_absolutely_fucking_hilarious_and/", "nsfw": false, "first_save": 1635428217.009148, "replies_charged": false}