{"id": "t5_2qpzs_t3_ph8k86", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "Dealing right now with a new physical ailment that is going to be costly to tend to and causing me daily pain. No matter whether I get treatment for it or not, either outcome will not resolve the daily pain. I am experiencing dental issues as a result of chronic dry mouth which I ignored and thought nothing of until 2020 when I started to see its effects on my teeth. My teeth are all still in place but my bottom front teeth are starting to not look good. And my gums have receded badly from all of my molars so the roots are exposed and even after stuff was applied my jaw still aches constantly. I am absolutely terrified of the prospect of having to get my teeth pulled and get denture implants as I have read about how changes in the mouth occur over time even then and cause more pain. I feel like absolute dirt. I feel gross at the thought of people seeing my teeth. Most of my top teeth are fine except for one canine, where just the tiniest hint of decay right at the gum line is starting to form, but it's like an awful monet painting where you might only notice if you look closely. So I am imagining now a future where I have to wear masks all the time to hide my deformed mouth, and a future with chronic pain. I am feeling terrible loss and grief, just straight up mourning my face. I already had body dysmorphia, so now I have this on top of it and it just compounds the feeling of being hideous and worthless. I don't want to give up and feel a tiny bit of optimism there is still time to save my face but i am overcome daily by heavy waves of depression and it's hard to do anything. This really hurts. I am also having suicidal thoughts. I don't know if I could live like this.\n\nI wanted to mention that I brush and floss daily. I was not as attentive to my mouth in my teen years though, I was a gross kid with untreated ADHD.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ph8k86/chronic_pain_and_grief_making_me_want_to_die/", "title": "Chronic pain and grief making me want to die", "social_network": "reddit", "user": "dustyatticwitch", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1630686361, "permalink": "/r/SuicideWatch/comments/ph8k86/chronic_pain_and_grief_making_me_want_to_die/", "nsfw": false, "first_save": 1635426761.624772, "replies_charged": false}