{"id": "t5_2qpzs_t3_hcc4ru", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "Me, 32 years old. lost dream girlfriend of 12 years relationship (2 years friends and 10 years gf/bf)\n\nGot together in 2010 after being best friends for 2 years. We were both in different relationships, so no friendzone bs. In 2013 i had an accident that gave me chronic headaches. in 2015 my allergy meds (cortisone shots) gave me internal bleedings in the stomach and intestines, making me unable to eat without almost shitting myself. but i kept working and landed a dream job that same year, the kind that would have made me an actual millionaire. \n\nThings were a bit rocky ever since 2015 because of my health issues limiting me in doing stuff like trips and sex. in 2017 it took a turn for the worse, i lost my job due to my health (not my employers fault) and gained 60kg due to depression.\n\nshe tells me she needs a break. I accept. we do agree to keep contact and stay exclusive. basically its like we are still together, just that we dont meet that often.\n\n2019. we've still talked like we are a couple. gave eachother gifts for holidays and birthdays, went on summer vacation together in 2018 etc. \n\nsummer 2019 i find out she has been seeing and fucking a guy in our friend group. a guy that has been trying to get with her ever since 2014. a guy i hate. a guy thats always boasted about his enormous penis.\n\nI confront her about it, she acts like our relationship was basically over anyway and why am i making a big deal of it. I tell her she knows damn well what our relationship is, and she kinda breaks down and admits she is in the wrong and that she is so sorry. but she needs to live her life and she cant do that with me. i cant satisfy her life goals or satisfy her sexually.\n\nIm fucking dead inside at this point. So i tell her that, and block her on snapchat and discord (only social media i have). a week passes and she starts to call me in the middle of the night. i decline it, but i get a sense of dread. so i text her \"what do you want\".\n\nShe tried to kill herself because she lost me. i drive like a madman to her place and finds her on the floor with a knife and slit wrists. not deep enough to bleed more than whats \"ok\" to loose without danger of loss of life. \"i cant even kill myself correctly\" is all she says. I stay with her that night, just holding my arms around her. \n\nShe wants to get back with me, but it takes her 4 months to cut contact with the guy she cheated on with.. and now, 10 days ago. we only met 5 times for that entire year after she said she wanted to get back with me. And she then tells me she doesnt know what to do. i tell her i want her, and thats all that matters to me. she says \"i dont know if that the right thing, i dont know anything anymore. your health is so bad. I want passion and lots of fucking\".\n\nAnd thats the last i heard from her. I feel literally worthless. less than worthless. All that i thought good about myself is gone. I feel like cutting of my dick and then my neck.  \n\n\nTLDR: 32 year old \"this close\" to being a successful millonaire, now a 165kg man living in parents basement that lost his health, gf and all selfworth.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hcc4ru/whats_the_point_of_continuing/", "title": "Whats the point of continuing.", "social_network": "reddit", "user": "Gregovania", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1592612150, "permalink": "/r/SuicideWatch/comments/hcc4ru/whats_the_point_of_continuing/", "nsfw": false, "first_save": 1635427171.1147087, "replies_charged": false}