{"id": "t5_2qpzs_t3_qeti6m", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1", "4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I've been dealing with suicidal thoughts for over 2 years. It varies but currently it's every other day, I've been put up to 200mg of Pristiq to get my mood swings from depression and anxiety under control.\n\nIt's worked for that but the ideations and thoughts don't go away. It's like smoking in a way - I quit over 2 years ago but still desire one every now and then. Will this ever go away without killing myself? I know how I'll do it, I flirt dangerously with proceeding but haven't had an attempt.\n\nI'm lonely, long term single - I have a fairly successful career and earn more than enough money but that doesn't really matter. I have nobody to share life with and nobody on the horizon. I've tried so many different things to improve my life but nothing sticks, childhood trauma sits in the background chipping away at my self worth. \n\nI see a psychologist once a month and Ive improved in many ways - I don't smoke weed any longer (was a daily smoker), quit cigarettes and haven't drunk alcohol in over a year. The only things keeping me going currently are my cat (adopted the adorable furball during covid lockdowns) and the fact my mother wouldn't handle it.\n\nThe more I think about it, being alone is a problem but primarily there's nothing to look forward to. Wish for the weekend all week and then get sad on the weekends. The planet is getting abused by capitalism and this same system holds me down like everyone else except the few. What is there to look forward to? Everything is fake and the cycle has ground me down. Everywhere you look, people are happy together. This isn't an incel situation, thank god, but you can kinda get how someone would end up in that spot. I don't hate anyone but myself.\n\nI don't know what I wanted to achieve here, I wanted to write and wanted an audience that doesn't know me. While this isn't a throwaway, nobody knows who is on the other end of this stream of consciousness. Peace.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qeti6m/just_need_to_blurt_this_out/", "title": "Just need to blurt this out.", "social_network": "reddit", "user": "ATiredPhilosopher", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1635086528, "permalink": "/r/SuicideWatch/comments/qeti6m/just_need_to_blurt_this_out/", "nsfw": false, "first_save": 1635425558.3368216, "replies_charged": false}