{"id": "t5_2qpzs_t3_djtiyi", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "Hello \n\nIDK what to do anymore I feel like a worthless POS. moments ago I was having serious suicidal thoughts. I am afraid on what to do next. I am stuck in a collage that I can't afford unless I get a scholarship from AFROTC and I in general have lost motivation for life. My dad once told me that all I do is complicate everyone's life and he evwen mocked me when I confronted him that I was feeling suicidal. To top it all of a probably won't even get a scholarship because of these thoughts once the DOBMERB comes around. I just feel like a waste of space and that i complicate everyone's life. I hate being a burden on people and I can't take it any more. One of my fellow wing men always looks at me with disgust when I pass him in my dorm. He probably thinks the same thing. I am just a waste of resources at this point and I hate it. I hate wasting mine and other peoples money, I hate giving people false hope that I will change, I hate having to go to the health center so often, I hate having constant thoughts of gutting myself and not going through, I HATE IT ALL. It is just that I have a little sister... I got a call from my mom saying that she did the sweetest thing. She took the same camouflage blanket that kept me held on during my high school years. She said she would keep it company until I got back and that it reminded her of me. I really didn't treat her as good as I could've while I was at home. I would hate for her whole life to not only be flipped around once because my parents divorce but twice because I left. I don't know what to do any more I always try to seem like the strong one but my friends see that I am not doing good and I push them away because I don't want to complicate their lives and I don't want them to be disgusted by what I truly am. A WEAK INDECISIVE SON OF A BITCH WHO CAN'T REMEMBER SIMPLE THINGS! I DON'T WANT TO TROUBLE ANYONE ELSE I AM DONE! But I realize I do need help. But I am so afraid to tell the people that I have suicidal thought because the will probably send me to a mental hospital. Then I defiantly will not get the scholarship. Just so you know I am not doing AFROTC only because of the scholarship it is also so I can protect people in what ever way I can. Or maybe change the ways things are handled so we can do it better. I am just lost PLEASE HELP.", "url": "https://www.reddit.com/r/SuicideWatch/comments/djtiyi/i_need_help/", "title": "I need help", "social_network": "reddit", "user": "Lone_Courier_6", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1571431283, "permalink": "/r/SuicideWatch/comments/djtiyi/i_need_help/", "nsfw": false, "first_save": 1635426692.2073789, "replies_charged": false}