{"id": "t5_2qpzs_t3_oigiz6", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "When I was young I made friends with a woman online who was soon to be homeless. She lived at a different state and I offered that she come stay at my parents place for a while until she got back on her feet. She took that offer and was at my place after a few weeks. I panicked not realizing the full gravity of the situation of what I've done and slammed the door in front of her face. I betrayed her by kicking her out and pretending that I never knew her. She trusted me, begged me, and desperately tried to have me take her in but I was an incredible coward who refused. \n\nHow did I cope with this trauma I induced on her and myself? I did everything in my powers to suppress all memories of her or that event. I ran away. \n\nYears later I was nearly graduating from a college and the suppressed guilt and shame exploded. Subconsciously I tried to ruin my life by committing a horrible crime on camera for the world to see. When reality of my actions slapped me in the face I did everything in my power to fight my case. I got friends involved and made massive promises of being reformed. I won the case and was given a second chance. \n\nI ran away again. Literally made everything worse and ruined multiple peoples lives, jobs, and burned every social bridge I had ever made in my life. I am thankful my family still supports me but I live like a leech. I don't contribute to society and literally put all my focus on the guilt and shame that I placed myself in. \n\nI have tried killing myself multiple times but I am afraid. I have no future. No career. Everyone wishes to harm me. I can do nothing but watch as my parents grow old and feel regret of having me as a child. I am so tired.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oigiz6/suppressed_guilt_and_shame_scumbag_who_should_be/", "title": "Suppressed guilt and shame. Scumbag who should be dead.", "social_network": "reddit", "user": "powermonday", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1626050946, "permalink": "/r/SuicideWatch/comments/oigiz6/suppressed_guilt_and_shame_scumbag_who_should_be/", "nsfw": false, "first_save": 1635426186.9412348, "replies_charged": false}