{"id": "t5_2qpzs_t3_pqfbuo", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351"], "text": "&#x200B;\n\nTLDR: I’m an idiot, a coward, a weakling and a dysfunctional human being who gets discouraged at the drop of a hat, and I’m sick with myself and don’t know if I’ll ever stop feeling this way.\n\nI don’t know how to write a post like this. Honestly, I don’t know what the hell I’m even doing. I just...don’t know what to do with myself at this point, and I don’t think I even want to make an effort to get help anymore. I’m depressed out of my goddamn mind, I fantasize killing myself several times a day and I’m convinced I’ll never stop being like this...but I don’t even have a good reason to.\n\nSome background; I’m a 21 y/o male, still living at home. I was diagnosed with ADHD when I was young and went through several medications without finding any significant improvement. I zone out without realizing it and have pathetic memorization skills. I graduated high school three years ago, got rejected from University three times before finally making it into a Social Work program, and now that I am here I’m already doing badly at quizzes and assignments. I used to be religious, but now...I don’t even know what I believe, really. I’ve had multiple therapists over the years, and each of them only seemed to provide temporary relief. I’ve struggled with suicidal thoughts since junior high, and a decade later my thoughts are still as tempting as ever.\n\nI’ve always been horrible at school; I went throughout both Junior High and High School without ever making the honor roll once, and it took my heart and soul to get marks in the C range. I forget the simplest tasks and miss details on exams and projects that normal people are able to do like second nature. During middle school I was bullied frequently for being a weirdo, and even when I entered high school I was unpopular as hell. I didn’t get a part time job during my school years because I couldn’t study efficiently even with the amount of time I had. Last year I only got through the Entrance Option class due to it being online and having notes to help me. I have two genius siblings (one about to graduate engineering and another on her way to med school) and here I am barely even able to get a half decent mark. With the grades I’m getting, I’ll never be able to land a good job, have a respectable career, find someone interested in me and settle down being able to provide. God knows I’ve tried to improve, but at the rate it’s going it’s just a wistful dream.\n\nEven outside of school I’m an incompetent moron. I have no special talents at anything. Sports, music, cooking, writing, etc. Nothing. During my gap years, I’ve gotten fired at 3 out of the 4 jobs I worked at (albeit I got rehired at one, but still) and I continued to make stupid mistakes despite working at the same places for months on end. I’m awful at answering messages, I’m by far the stupidest person in my friend group (as well as the least accomplished), and I’m positive the only reason my friends hang out with me is because they pity how pathetic I am and are too nice to reject invitations to meet up. I’ve only been in one serious relationship with a girl for like half a year (which fell apart due to me being an unreliable dumbass), and I have literally nothing going for me that could be considered attractive. I don’t have any meaningful hobbies and I waste time reading comics and watching videos to distract myself from reality. In layman's terms, I’m a loser.\n\nWhile I’ve had esteem issues for longer than I can remember, I only finally attempted suicide back in my senior year of high school, with my brother intervening and stopping me, leading to me getting thrown into a psychiatric hospital for an extensive period of time. When people ask me why I did it, I usually just tell them that I was simply in a bad mental state and let emotions cloud my judgement, stuff to just end the conversation. In reality, I did it because frankly...it just made sense. I wasn’t going anywhere. I didn’t have high enough grades to get into post-secondary. I had no great talents to land a job in the arts. Really, what did I have to offer the world? Who would hire a loser like that? Who would ever consider dating someone who couldn’t get his life together? The world losing someone that insignificant, would it matter at all?\n\n*“But your friends will miss you!”* Honestly...I can sort of believe that. But while I can imagine there would be a few people who’d be upset at my passing, I can’t think of a single person whose life would actually significantly alter without me. I’ve accomplished nothing. I’ve left not a single impact on any life I’ve encountered. I have an okay amount of friends, but I’m nobody’s “best friend.” I’m as expendable as they come, and I don’t have anyone who’s better off for having known me. Hell, my parents would have one less manchild at home to look after with more time for my siblings, and my friends would almost certainly realize how much better off they are without me in time.\n\nI’m sure this post will probably piss off a lot of people. I know these really aren’t good reasons to hate myself, much less consider suicide. I’m able-bodied, technically still young, and despite my mental drawbacks I can still somewhat function. I didn’t always get along with my parents, but they never horribly abused me or were addicted to substances or something. I got bullied quite a bit, but I wasn’t explicitly pressured to kill myself or anything. And while I don’t come from an extremely rich background, we’ve never had the looming threat of poverty over us. I imagine a number of you are rolling your eyes like “That’s it? *Those* are your problems? Get over it.”  I know a lot of people have it so much worse, and I have so little to complain about in comparison….and that’s the problem. I don’t have an excuse for being an absolute failure and getting dejected the way I do. The problem is just who I am as a person, and there’s no cure for that. I’m a coward, a weakling, and a quitter who doesn’t deserve to be happy, much less waste the world’s oxygen supply.\n\nI joined the program I’m in (Social Work Diploma) because I thought even if I myself am a worthless person, if I could at least devote my life to a greater cause and help others, then maybe I could have at least some sort of merit as a human being. But it looks like I won’t even be able to do that because I need a minimum grade to go forward, which I don’t even know if I can achieve. At this point, I don’t know what to do with myself anymore. Once again, suicide doesn’t just look like a solution or a “way out.” It genuinely feels like a logical idea to me, and if tomorrow was my last day alive, I’d probably die the same way I lived. Hating myself.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pqfbuo/i_hate_myself_so_much_im_bad_at_everything_and_i/", "title": "I hate myself so much. I'm bad at everything and I have nothing to offer. I don't know how to feel good about myself because I'm a fundamentally weak and stupid human being.", "social_network": "reddit", "user": "KJRex101", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 28, "down_vote": 0, "creation": 1631937506, "permalink": "/r/SuicideWatch/comments/pqfbuo/i_hate_myself_so_much_im_bad_at_everything_and_i/", "nsfw": false, "first_save": 1635423157.4143424, "replies_charged": false}