{"id": "t5_2qpzs_t3_pw355b", "request": ["0c6360e0-5fd0-41bf-97f4-d870570d8b8d"], "text": "Hi all,\n\nI haven't been one to go onto sites like these to talk about how I feel, but here I am. I am a young guy who seems to have it all together mentally and physically when seen by society, but inside I have been dying for a while. Right before I go to sleep, I keep having vivid thoughts of jumping off a bridge, or imagining a bullet pass through my head. It makes me sick, but the more I have the thoughts, the less I question them.\n\nAs an incoming college student, I have been overloaded with work, school, and do not enjoy life whatsoever. I have no friends, and it gets worse when I go into a coffee shop to study and see everyone enjoying time with their friends as I sit alone, screaming inside. I was a very popular student in H.S., top of my class, numerous leadership positions, varsity athlete, but once graduation passed, I have virtually no one there for me.\n\nPrior to my high school graduation, I had went in to a very deep state of a mental breakdown, drove for a long while, took my AR-15 out into a field where I shot bullets past my head and put the barrel in my mouth numerous times. So I have been at that stage already, but I fear I will go back to that state again and do not want to. I will not go very deep into every issue that is pressing my conscious and how terrible my circumstance are because frankly I'm sure you all have heard it a million times. I would like to receive help and just speak with anyone at this point. It is too hard doing it alone all the time and I don't like people in my daily life to know my weakness. Thank you", "url": "https://www.reddit.com/r/SuicideWatch/comments/pw355b/i_am_tired_of_it/", "title": "I am tired of it.", "social_network": "reddit", "user": "Grindstone13", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1632692907, "permalink": "/r/SuicideWatch/comments/pw355b/i_am_tired_of_it/", "nsfw": false, "first_save": 1635426343.3427267, "replies_charged": false}