{"id": "t5_2qpzs_t3_m9184r", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "Hi guys, I'm new here. First off, I wanna say explain why I want to kill myself. I'm a third-world asian dude (just turned 18) and life's not like I wanted it to be. I'm the type to genuinely enjoy the things i really want to, but I'm also the type that can't make any hard decisions and adjustments when needed. I grew up in a home full of memories about my parent's relationship conflicts. You could say I was given attention and love of a parent, but not as much as I wanted. I'm the blacksheep of my family and I feel so much shame, knowinf even my 9 year old brother is doing better than me. When I was in 2nd year of my highschool, I learned to play on net cafés, that's how i found my addiction, the biggest downfall of my life atm. I learned how euphoria felt like, how it's like to just chill playing games knowing you don't have to worry about the lame prison of a school you're in. This went on for a year until my parents decided I drop off. My grades and attendance was really horrible, I knew I made good friends, studying wasn't that hard, and staying in school isn't so much of a work. But i still preferred to let myself drown in addiction. After that, I started stealing from convenience stores to earn money. I would sometimes pick up some receipts and would steal the item from the list, and then I would ask for a refund as I show the receipt. This went on for half a year, I was completely blinded by this routine that I would only come home to sleep. I went on for half a year, eating stolen food and wandering the streets to spend time when I don't have the money to play. Until one day I snapped, I realized I wanted to change. I thought that school wasn't so hard after all. And so, when my parents agreed with my decision, I took an exam and managed to advance from grade 9 to grade 11, I was a year ahead of my batchmates, which was a really good achievement.\n\nI really tried to force myself to study and endure this crippling urge to give in to euphoria once more. I tried to make friends from my brother's batch that I am now in. But it didn't work, I was alienated by this whole another world that I again isolated myself and let my body do its usual work. Even though I stood out in class, even though I was capable of doing a great job, I couldn't bring myself to just do it. The boredom of school only contributed to my euphoria. Somehow managed to pass and still went on.\n\nI am now a 1st year college student, the course i took is information technology, although I would've preferred liberal arts or AB English, I knew myself that I have no rights to choose, I was the one who ruined my own credibility after all. My mother chose this course for me since the demand of IT's insane at this age. The university I am now in is the same one my Cum Laude sister graduate from. She expects good things from me, and her very image from the university depends on my performance. We don't live in the same house since I'm taking care of my father's autistic patient (he's an occupational therapist.) I have no one that will watch over me so I slacked off since I didn't really like the course I took. At first i tried, but I just got too bored. Everytime i think about this one responsibility, my body just turns off. I become so sleepy and my body would feel so tired. Even though I want to, my body won't just cooperate with me. That's how it has been for the past few years anyway.\n\nSince I slacked off, one of my professors withdrew her subject this previous semester. I dont have any grades yet but my brother does. He passed every subject with a 1.25 average and 1.5 at least. I love my sister and mother but seeing them say these things in our group chat just makes me want to kill myself. My brother is on the same house as I am (we both take care of my father's patient) and he's ignoring me. Sometimes giving me the look of seeing a shit on the street.\n\nJust when my sister encouraged me to actually try for once yesterday, just this morning, she ranted on my family's groupchat on how pathetic I am, and how much she's done with me, that she doesn't care about me anymore.\n\nI've already thought this through ever since I was in grade 11, I've done too much horrible things. But I'm so pathetic that I'm scared of the pain of the only choice I'm confident with. The country I'm in doesn't really provide access for firearms, or the ones that are effective for suicide at least. I also wanted to try cyanide pill or the pure helium/nitrogen thing. But I barely have any access to these things. I've also thought of jumping off a high building or snapping my neck by hanging, but these two is too risky if not done right. I've also thought of consuming pesticide, but as I've heard, it's not that effective. I just want to die, I've also thought of just enduring the pain and just suffocate myself or hang myself. \n\nI've read so much comments of people encouraging others to avoid killing themselves a lot, but I don't think it will do anything for me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/m9184r/peaceful_and_painless_way_to_die/", "title": "peaceful and painless way to die?", "social_network": "reddit", "user": "CaptainSpritez", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 14, "down_vote": 0, "creation": 1616221377, "permalink": "/r/SuicideWatch/comments/m9184r/peaceful_and_painless_way_to_die/", "nsfw": false, "first_save": 1635427055.954012, "replies_charged": false}