{"id": "t5_2qpzs_t3_qfu82y", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "My heart wants love, I’m 19 and I already hate life. My problem is that I am going to explode from the inside. In high school, I was a quiet and non-social kid to everyone but my two only friends, but once I got to college, I wanted a fresh start. Im extremely social and I thought I made a freiend group but the ditched me despite my attempts to stay in it and my roommate even abandoned me and left to get in an absent room. Despite all of my attempts, I have not been able to make a single friend and have been alone in my room for nearly a month now. Therapists don’t help me and I can hear my window cactuses calling my name in childish tones like im some sort of mental patient. Big problem is that ,y heart is much larger than a usual person’s. My heart is so large that the love it creates desires to be let out any way possible, and I just want friends and most importantly somebody to love in order to give my heart what it wants. Right now it’s driven me so insane that I’ve stacked my entire yard with at least 100 trees and 100s of flowers that anger my dad and that I protect with my life. I’ve resorted to having plants as my children and since im away from them and have ran out of yard room my het is bursting and I feel like im going to explode. All that’s holding me over is the fact that im going to get a car on campus next semester so I can use apps to find friends or lovers. I’m not even bad looking. I’m literally only 189 lbs and 6 foot, which is average, i just don’t have a six pack so nobody likes me.  Loneliness is making my brain hurt all day long and my grades have been suffering because I’ve been going to the gym over 3 times a day. I’m actually confident on the way I look but if exercising is my only way of getting others to recognize me  and possibly love me than screw the grades. I’ve been near starving myself too, only eating some scrambled eggs for breakfast and two meatballs for dinner with no lunch. I can’t believe I haven’t lost weight or found a single friend. This loneliness is literally going to kill me. I feel the constant stress in my chest where my heart is. Almost everyone in my dorm has found friends or love by now but not me. Despite actually trying, I’m stuck alone here in my room, slowly becoming the embodiment of darkness and sorrow. I just want what others have. Somebody to love, a  friend and a life. Right now the only things keeping me alive are several YouTube channels I like, HOPE, determination, the need to feel what it’s like to drive a Japanese sports car while playing eurobeat, and my parents.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qfu82y/im_going_insane/", "title": "Im going insane!", "social_network": "reddit", "user": "TheSovietOnion69", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1635207498, "permalink": "/r/SuicideWatch/comments/qfu82y/im_going_insane/", "nsfw": false, "first_save": 1635426838.5214858, "replies_charged": false}