{"id": "t5_2qpzs_t3_fu3e40", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "I've just made this account today as a means to vent, and I have never been on this sub before, so I'm not sure how to go about this. \n\nA little background information to give more context on my situation and mental health: I began engaging in suicidal behavior at a very young age, but didn't manage to wind myself up in the hospital until I was 15. I was diagnosed with PTSD and major depression at 16. When under abnormal amounts of stress I sometimes have auditory hallucinations and delusions (the most recent instance was yesterday night which consequently triggered this post). I don't want to get into the specifics of the traumatic events I've experienced, but I will say that I have experienced psychological, physical, sexual, verbal, and emotional abuse. I have self harmed on and off from about 9 years old. \n\nI know no one on this sub is a doctor or anything, I just want it to be understood what all is at play in my head here. \n\nMy present dilemma is this: I have almost no one. My father ignores me although I reach out regularly, I don't have a close relationship with my mother as she was very abusive towards me and my older sister growing up, and as for my sister, we communicate here and there but our relationship is beginning to feel more and more disconnected. So as far as my family goes, I don't have anyone I feel like I can truly open up to. I do have my boyfriend and a roommate who I do feel I can open up to, but at the end of the day, theres some issues they just aren't equipped to help me with. I'm also not able to start seeing a therapist as I just lost my job and insurance. \nI don't know how to word this next part other than that I really feel like I deserve to die. I've made so many mistakes in my life and am so undeserving of the little good that I do have. I feel like I serve no purpose other than to be miserable and make others miserable by being a massive burden. \nI'm also simply wearing thin. I can't sleep at night either because of nightmares or I become paranoid for some strange reason and start hearing a voice in my head. Last night I started to believe that someone was going to shoot me in my sleep for some reason and thus stayed up all night staring at my bedroom door and the voice was saying things like \"we need to get out of here.\"   \"they want to hurt us.\" And \"we can't do this. \" I felt like I could barely breathe and I tried to calm myself down by acknowledging that no one was going to hurt me, and that I was the only one there, there was no \"we\" but unfortunately it didn't help and I was stuck feeling afraid for my life over something that I was well aware was a delusion. \n\nI am so tired, I feel so useless and weak, but I am still reaching out because I want to be here for the people that do care. I know it wouldn't be fair to them if I killed myself, but I'm also being realistic with myself about how close I am to the edge and understanding that willpower alone wont keep me from going over. \n\nSorry if I rambled on or made little sense, I just need to get it off my chest.", "url": "https://www.reddit.com/r/SuicideWatch/comments/fu3e40/wearing_thin/", "title": "Wearing thin", "social_network": "reddit", "user": "aplaceformydarkness", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1585896057, "permalink": "/r/SuicideWatch/comments/fu3e40/wearing_thin/", "nsfw": false, "first_save": 1635425252.3014789, "replies_charged": false}