{"id": "t5_2qpzs_t3_q7o5pv", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "Hi\n\nI'm so sorry to make this post. I'm not sure what I'm trying to gain from it. Maybe it will make more sense by the end. I want to say I'm sorry too if my words trigger or burden anyone. I don't want that. I'm so sorry! \n\nI'm 30 years old. I've been battling chronic suicidality, and chronic extremely severe traumas, more than I have any ability to put into words. \n\nWhen I was 13 years old I made my first suicide attempt. I never thought I'd make it to the age of 18. I never imagined that I'd finish highschool. I never thought I'd make it to this age now. I've made attempts.  I've nearly died before. \n\nI don't mean harm to others, through this post, by still being alive or leaving. But others have deeply harmed me, and most painfully; they chronically don't show up, protect me. \n\nI can say this - severe long-term abuse and neglect, are killers. They take lives. People might think they didn't see a suicide coming, and they may think they can't make sense of why a person took their life. But this lack of awareness and understanding brings me to tears, because this is part of the main problem. Yet people don't seem to realize it. They won't realize from my death either. What I wish from others, is for is understanding about my death, genuine acknowledgment, and remorse/regret for the part they each played in it. I don't know if what I'm saying makes sense to anyone reading this, but maybe if you have experienced unrelenting interpersonal traumas that are soul destroying and strip away at the mind, you might get it, and if this is the case - I'm sorry with all my heart... You didn't deserve any of this. You don't. \n\nAnyway, I'm really sorry again if this post hurts or triggers anyone. I really don't want to hurt anyone through sharing my personal truth. This feels like the last place left that might be remotely safe and acceptable to express myself in, so thank you for reading this if you did. You may not feel like it's done anything, but for me it's like being given one last gift. It's like this; at least before I died, maybe someone actually heard my truth, choose to hear it, choose to read the cause behind my suicide. This feels so important to me... so important.\n\nYou don't know me, I'm just a stranger on the internet. My name is Sarah though, and I just someone to know, who might actually listen, that I have lost my life to a lifetime of severe, unrelenting neglect, abandonment and abuse... and I've tried my utmost hardest to hold on all this time. I just want someone to know the truth who might listen. So thank you. THANK YOU!", "url": "https://www.reddit.com/r/SuicideWatch/comments/q7o5pv/im_sorry/", "title": "I'm sorry", "social_network": "reddit", "user": "dear_pixel_heart", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1634170406, "permalink": "/r/SuicideWatch/comments/q7o5pv/im_sorry/", "nsfw": false, "first_save": 1635425188.1880403, "replies_charged": false}