{"id": "t5_2qpzs_t3_qgef2o", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "This post is mainly just to get this off my chest. \n\nI am diagnosed bipolar 2 among some other things (anxiety/panic disorder for example). This diagnosis is fairly new, it was made in February where I then began a mood stabilizer, sleeping meds, anti anxiety meds (I take a non-benzo daily, and a benzo medicine during panic episodes and I have recently been prescribed an SSRI along with it all which has sent me into a mania episode so I don’t think I will continue taking this one after talking to my psych. Before this I was diagnosed depression and anxiety. \n\nAnyway, I have been doing a lot of thinking and reflecting these past few days. I have struggled with my mental health for half my life (since 12, now 24)  and after my new diagnosis, I will struggle with it for the rest of my life. I have been constantly unstable in my mood this entire time, mostly being depressed. Up until a few days ago, it was hard to cope and deal with. \n\nMy suicidal thoughts in the past year have been daily, every waking moment I am thinking of it, thinking of the consequences and also thinking how I could do it. I was scared, I was sad, I wanted these thoughts to go away. \n\nI don’t know what changed, but I guess I decided that I will do it. I do not want to live as a burden and feeling trapped with my illness and the never ending cycle and mental pain. I now feel comfort in the fact that I have a way out when I am in a place that I can do it. \n\nI have a long term partner, i immigrated to his country to be with him, this of course has been hard due to my mental health but he is very supportive and helps me greatly. We also have a cat, and due to me currently being on sick leave, she is mostly the reason for me continuing to get out of bed in the mornings while my partner isn’t here. I have to take care of her, I love to take care of her - she is comforting company and very loving, I take care of all cat responsibilities :) if i died now, I couldn’t take care of her. I know I would hurt my partner deeply too. I do not want that. \n\nSo I am in a weird situation, I know it is not “healthy” to think if my relationship ends I will end my life. I don’t mean for that to be a bad thing, it is not a threat to my partner or anything like that, I do not use it and would never use it to manipulate him or make him feel trapped we ever parted ways. This is not something I have mentioned to him because of those reasons. I would also want to wait until after my cat passes away. She is 7 so that is probably awhile, thankfully. I am mainly estranged from family, it know it may be selfish but I do not really think of them when making this decision. When I am in the position to end my life where I feel it would not negatively impact lives then I will. \n\nI have been able to think a lot more clearly lately, regardless of the mania. \n\n\nTLDR (kind of?) \n\n\nI want to die and I will die on my own terms, when I am able to. It isn’t fair that I have to struggle the way I do, everything is hard, even the most basic of tasks and doing them takes up so much mental energy. I refuse to suffer longer when I have already suffered so much. \n\nI know it is unfair to others that I will die this way, but I also hope that they could understand my reasons and one day come to terms that I am not struggling and suffering daily. That is the reason why I will wait, at a point where it will not hurt people as much as it would at this moment. \nI don’t know if my thoughts are normal or common, but there they are. \n\n\nThanks for reading whatever this was.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qgef2o/im_starting_to_feel_at_peace_with_the_fact_that_i/", "title": "I’m starting to feel “at peace” with the fact that I will kill myself, I’m no longer scared of it. Is that normal?", "social_network": "reddit", "user": "polaroidsofpast", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 42, "down_vote": 0, "creation": 1635277283, "permalink": "/r/SuicideWatch/comments/qgef2o/im_starting_to_feel_at_peace_with_the_fact_that_i/", "nsfw": false, "first_save": 1635427609.7219954, "replies_charged": false}