{"id": "t5_2qpzs_t3_pvmxr4", "request": ["69686dc6-5bf4-41ab-864a-231bdd6f02c9"], "text": "I attempted a few years ago via overdose. A few weeks ago I was stopped by police from jumping off a bridge. There are other factors to why I want to die but the reason mentioned in the title is most prominent in my life. I've been lonely my entire life and I'm done with it. I'm \\*SUPPOSEDLY\\* average sized, at least in length, but the cruel reactions I've gotten from women have traumatized me to the point where I have a genuine phobia of sex and being naked around others, especially women. The last time I tried to be intimate with anyone was 9 years ago. But I can't take another humiliation.\n\nEven when I speak to people online they lose interest when they see my face. This can be devastating when you feel you've connected with someone.\n\nThe few people who have possibly liked me irl in the last 9 years, I sabotaged it on purpose by making out I wasn't interested. Due to fear\n\nI don't even want sex at this point. The thought gives me a panic attack. I do still want a partner but nobody wants an ugly 32 year old with no experience and a phobia of anything to do with sex.\n\nThe only physical contact I have is with a cuddle therapist. My life is a joke. If my mother hadn't already lost her daughter, my sister, I probably would have attempted a lot more times. But 99.9% of the time, protecting her from losing another child keeps me from doing it. I'm in that dark place more often than not now though that even that isn't enough to keep me here.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pvmxr4/32m_my_penis_size_and_general_appearance_make_me/", "title": "32M - my penis size and general appearance make me want to kill myself", "social_network": "reddit", "user": "squall89_", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 69, "down_vote": 0, "creation": 1632631169, "permalink": "/r/SuicideWatch/comments/pvmxr4/32m_my_penis_size_and_general_appearance_make_me/", "nsfw": true, "first_save": 1635425306.938429, "replies_charged": false}