{"id": "t5_2qpzs_t3_7edfnq", "request": ["9cb7ef4e-af9d-4403-b84a-be5dd3f5e75c", "e79a79ca-6f5c-44ca-b1e4-309a4afa83c2"], "text": "I'm gonna have to try to make it on my own soon. I've got almost no resources but I don't fucking care at this point. I'm slowly fucking killing my ties with my family and everyone else because I can't fucking maintain relationships. All I can do is destroy them because I don't give enough shits about anyone else to cater to their emotional needs, which is really shooting myself in the foot because now my mom hates me and is threatening to kick me out. I'll never get by though because I really, really fucking hate people and I really really fucking hate having to commiserate and level with them. Basically, I hate being a friend because it's inconvenient and too much damn work. But that's the thing. Life is ALL fucking work, and anything that could be considered play is just a monotonous waste of time. So with all that said, I basically deserve to be on the fucking cold ass streets. All I do is sit the fuck around and smoke weed and play the guitar. I have zero plans for the future and I'm not gonna fucking work. Every time life feels kind of appealing, it turns to shit. I just want to be able to be my own person without having obligations to others but that shit is literally impossible. Anyways I'm really going off the rails here but can someone fucking tell me why death isn't the answer? I was raised Christian but I'm starting to not believe in that shit anymore. I'm not going to hell because it doesnt exist. In fact, I'm starting to not want to exist. Life fucking sucks. I don't want to patch shit up with my mother either. I just fucking can't. I'm not man enough. If you couldn't tell, I'm a little bitch. So fuck. Why is sticking it out better than trying to climb out of a whole that has fists coming out of the wall to punch you on your way up? ", "url": "https://www.reddit.com/r/SuicideWatch/comments/7edfnq/fucking_ties_to_other_people_and_responsibilities/", "title": "Fucking ties to other people and responsibilities", "social_network": "reddit", "user": "PleasantView_5", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1511222302, "permalink": "/r/SuicideWatch/comments/7edfnq/fucking_ties_to_other_people_and_responsibilities/", "nsfw": false, "first_save": 1635425164.8376825, "replies_charged": false}