{"id": "t5_2qpzs_t3_i20r4h", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "Recently the smash bros sex scandals (particularly those surrounding Zero, who I loved watching ) have refocused my attention to the possibility that I’m a pedophile, which I questioned almost two years ago at the age of 17. Even from when signs of OCD first manifested at the age of 5 to my current age, 18, I don’t think I’ve ever dealt with something so depressing and appalling. I’ve seen a psychologist and psychiatrist for other forms of OCD while in my freshman and sophomore years of high school, and have taken Zoloft 150 mg for about 3 years.\n\nMost of my doubt comes from the strong arousal I had the few times I watched hentai of middle schoolers- those with underdeveloped bodies. Every time I do so, I fall into depression and experience a sense of queasiness- disgust in myself. When I think of elementary school girls I don’t get aroused, though I’m not sure I wouldn’t if I read/watched hentai sexualizing them. \nA fact I use to reassure myself is the exclusive attraction I had to developed bodies throughout middle school and most of high school. I also faced an obsession over being attracted to my father and feeling aroused while hearing his voice, but that faded away. Then again I’ve also read cases of late onset pedophilia. \nThe thought of being chemically castrated brings me great relief, and the exchange of facing lifelong side effects for being guilt-free seems worth it. It would be hard explaining my choice to my parents, especially since they want me to date and eventually have kids, but I ultimately prioritize my own desires for major aspects of my life. I also wouldn’t ever bring a child in this world at the risk of being attacked by me and inheriting my faulty brain. \nI’ve contemplated committing suicide at the thought of forever branding myself as a pedophile for masturbating to minors, even after being castrated. \n\nSorry if this all seems incoherent and sort of monotonous, I can’t think clearly right now and don’t have the energy to organize this", "url": "https://www.reddit.com/r/SuicideWatch/comments/i20r4h/pocd_or_pedophile_in_denial/", "title": "POCD or pedophile in denial?", "social_network": "reddit", "user": "wkww", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1596319328, "permalink": "/r/SuicideWatch/comments/i20r4h/pocd_or_pedophile_in_denial/", "nsfw": false, "first_save": 1635427180.2357287, "replies_charged": false}