{"id": "t5_2qpzs_t3_po1aji", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "Back in December 2015, I was taken to the ER for a psychiatric hold. Crisis workers arrived and asked why I was there. I explained how I had posted about wanting to end my life on Facebook, but I changed my mind after chatting with a close friend. They said I was not being cooperative, because I wouldn't tell them the truth (even though that was the truth). So they threatened to have me committed.\n\nAfter waiting for well over an hour, I was becoming anxious about the threat of hospitalization. So I started repeating \"I have the right to leave. I have the right to leave\". Finally two nurses and a doctor arrived at the doorway and told me they were going to have to inject me to \"calm me down\". So I explained that Illinois law doesn't permit forced medication of mentally ill patients unless they are an imminent risk of physical violence. The nurse then threatened \"You can either take this willingly or these security guards will restrain you. It's your choice.\"\n\nOf course I was confused and scared, so I agreed all the while crying because it felt like being r\\*ped as they penetrated me in my rear with a needle (an experience I know all too well). After about five minutes, I could feel myself becoming physically weaker, unable to sit up in my bed. I also noticed that it was hard to breath, and I started to have flashbacks to the choke hold incident in the ER just one year earlier. Except this time instead a neck lock, it was a chemical noose. I was helpless to say or do anything, just laying there counting each aching breath.\n\nThat was one of the most frightening and uncomfortable experiences, I've ever had in my entire life (even worse than all the times I've been r\\*ped). But that's mental health in America.", "url": "https://www.reddit.com/r/SuicideWatch/comments/po1aji/being_forcibly_medicated_in_the_er_in_violation/", "title": "Being forcibly medicated in the ER in violation of Illinois state law (because that's just what mental health professionals do)", "social_network": "reddit", "user": "No-Student-6624", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1631620593, "permalink": "/r/SuicideWatch/comments/po1aji/being_forcibly_medicated_in_the_er_in_violation/", "nsfw": false, "first_save": 1635427947.088488, "replies_charged": false}