{"id": "t5_2qpzs_t3_hb75by", "request": ["9cb7ef4e-af9d-4403-b84a-be5dd3f5e75c", "e79a79ca-6f5c-44ca-b1e4-309a4afa83c2"], "text": "Today I attended a funeral service of a young man my age, took control of a situation which left his remaining family and friends devastated.\n\nSo sad to see the photographs of this guy, someone the same age as me, pictures from an era I can relate to, the clothing, fashion, fads and trends and childhood play that I grew up with.\n\n\nReminded me that if our life can be summarised to photos and summaries from those whom grew up with, what does your story tell?\n\nHaving moments that can be captured and testimonies from people that know you, is our story.\nLife is too important to stress over the by things, yet we must focus on the little things around us that pass us by, how often do we appreciate life, the thing that is around us, the planet, birds, sounds, tastes, company of people, and the fluttering moments that only come once.\n\nI wonder who knows me, like truly, who will stand by me, and can share my life testimony.\n\n\nBeing a single child, with a sole parent (now passed), changing schools, moving a lot, different career paths, meet people as they/ I come and go. I don't think there are many/ any that have been with me throughout, throughout schooling, childhood, good times and bad, celebrations, and commiserations.\nWhat would be my story told be, would it celebrate or encourage or pity or null.\n\n\nNot only stories to feed the ego of character, but what has been my impact on this earth, what has been my footprint on this earth been?\nTo help or hinder the environment, diligence or disregard for life and earth?\n\nDo I bring happiness or hindrance?\nDo I contribute or control things around me?\n\n\nWe all live busy lives, and I know I let the big things get to me more than I should, but who is the person I'm forgetting about?\nThe person that would shatter me to be standing and sharing at their life end?\n\nAll deep questions I am contemplating about myself and others.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hb75by/attended_a_funeral_of_a_young_man_33_my_age_today/", "title": "Attended a funeral of a young man (33) my age today, made me think about my own stories and photos shared at my funeral.", "social_network": "reddit", "user": "danbarnsjolo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1592452630, "permalink": "/r/SuicideWatch/comments/hb75by/attended_a_funeral_of_a_young_man_33_my_age_today/", "nsfw": false, "first_save": 1635425160.2333672, "replies_charged": false}