{"id": "t5_2qpzs_t3_odzfif", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "So i first posted here back when i was 19, and a few years and a pandemic later here I am, 22 years old and tbh still struggling with a lot. I don’t lash out anymore or self harm or really abuse alcohol or drugs or various other things to feel something like I used to, but if i was an emotional wreck back then i’m now an emotionless one. The sometimes overwhelming and always constant feelings of loneliness never left me but that’s about all I feel nowadays, and even though I used to do some fucked up shit I still felt something, whether it be pain or sadness or a whole range of emotions. Now i just feel empty, and when I decided to change my life and take me off a path which was inevitably leading to suicide, I sure didn’t think this is where I’d be today. My insecurities about being alone and having no one who cares whether it be family or friends have grown massively to the point where I’ve sorta just accepted that this is how it’s going to be. In a post I wrote back then I said i was afraid of eventually pushing everyone away, now i’m afraid they’re just gunna leave. People who know me see me as being “better” because I’m no longer the guy who would get black out drunk and end up hurting himself or the ones around him, but tbh I haven’t sorted my issues out at all, i’m just better at hiding them even better than before. It’s not that I want to die, trust me I’ve been there and I know i never wanna go back to that, but I don’t wanna feel like this but the thing I have no idea what to do. Back at the start I had clear issues which I could deal with better (e.g don’t abuse alcohol at every opportunity), but now I have more different issues which are just as painful and make me just as sad. I know i’m just in my own head and its not real but honestly I don’t even know anymore. I think i’m pretty good at picking up on things and that coupled with my fucked up thoughts all in my head create scenarios and illusions, but it gets harder and harder to tell whats real and whats not, and so ultimately I guess i’ve been through so much pain and hurt that i just automatically have accepted i’m alone and no one truly cares about me just to end that suffering, and it just sucks a lot. Sometimes i wonder if life was better back when i was too fucked up and unstable to care about who loves me or whatever, because I didn’t plan on living much longer, or if I actually successfully killed myself, then none of this would matter. But suicide is not an option and its not like i don’t wanna feel better and feel loved but i don’t see any light at the end of this tunnel just empty, lonely darkness.", "url": "https://www.reddit.com/r/SuicideWatch/comments/odzfif/lost_soul/", "title": "Lost Soul", "social_network": "reddit", "user": "RandomGuy30000", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1625458051, "permalink": "/r/SuicideWatch/comments/odzfif/lost_soul/", "nsfw": false, "first_save": 1635425176.2194366, "replies_charged": false}