{"id": "t5_2qpzs_t3_ptv1u3", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb", "6470d5bb-3864-4a14-958c-1beac3ba4111", "f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "Every time I think about any aspect of me future, it just makes me wanna kill myself. If I think about an hour from now, I think about how bored I am, how I’d rather just be asleep cause there’s nothing I wanna do, nothing interests me, nothing is fun to me anymore, nothing feels even remotely worth the effort. And if I think about further into my future, on a more big picture scale I just think about how all my mental illnesses make it virtually impossible for me to ever have a life where I don’t feel like I’m treading water just to stay breathing, all the while never getting any of the things that might actually make some of this a little easier.\n\nThe list of diagnoses I’ve had thrown at me feels endless at this point, major depressive disorder, persistent depressive disorder, BPD, Bipolar Type 2, C-PTSD, anorexia, avoidant personality disorder, who knows how many of them are actually accurate. But if even half that list is real, it means that I’m basically gonna be spending the rest of my life learning how to just be “ok”. I might not even ever get there. From everything I’ve heard, it takes decades at the shortest. Just thinking about spending that long, it’s already exhausting me. Not to mention I’m probably gonna waste all the best years of my life getting that point. What, I’ll finally start to be able to live when I’m 50? 60? What’s the point?\n\nI can’t hold down jobs, I just can’t. I don’t know if it’s stress or boredom or what the reason is but I just either get so depressed I self harm in the bathrooms at work and usually end up having a suicide attempt, or I get so dissociative I can’t function, or I just go into a full psychotic episode. Either way’s the same, I either get fired or have to quit. And my savings account just gets constantly drained by all of life’s bullshit that I can never get ahead, I can never live anything but week to week. I’ll never have a house or a car or any of those sorts of things because I just can’t afford it. And if I could, I’d have to sell it before long cause I couldn’t afford the upkeep. It also means I can never afford anything but the most basic of mental health help. The only times I’ve been able to visit psychiatrists, for instance, was because I had savings and I still had to starve myself for a week to offset the cost. \n\nI’ll never have friends or a relationship or any of that. Not that I really care at this point, I guess, it’s just a choice I have to make because I can’t handle it. I’ve lived without friends my entire life basically, only ever had one person I’d consider a real friend and that was maybe the worst experience of my life anyway, because I fell in love with her and everything got complicated and messy and now I’ve lost the friendship. That’s also my only experience with love, given or received, so as much as I feel touch-starved and lonely all the time, I’d rather be alone forever than risk going through any of that again. And I know that’s my choice, and I think it’s still better than the alternative, but god do I just get so crippling you lonely. I hug a pillow every night in bed just to feel like I have a person next to me. But I know I’ll never be able to.\n\nI just don’t see a way for things to get better for me. Hell, I don’t even know what “better” even *looks like* for me. It’s not even an episode or a depressive phase at this point, it’s been years that I’ve been like this. All the therapists I’ve seen haven’t been able to help me at all. The dozens and dozens of medications I’ve been on have had zero effect whatsoever. I can’t afford ECT or any of those types of specialised treatments, I’ve tried psychedelics and weed and all those other “alternative medications” that people recommended and I hate how all of them made me feel. I just don’t know what else there even is to do about it, and every time I think about it, it makes me realise what my life’s actually gonna be like for the next couple decades at least and I just don’t wanna be here for it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ptv1u3/i_cant_think_about_even_an_hour_into_my_future/", "title": "I can’t think about even an hour into my future without getting massively suicidal", "social_network": "reddit", "user": "MyBrainsInPain", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1632402986, "permalink": "/r/SuicideWatch/comments/ptv1u3/i_cant_think_about_even_an_hour_into_my_future/", "nsfw": false, "first_save": 1635422253.994621, "replies_charged": false}