{"id": "t5_2qpzs_t3_bd0o4h", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "\\-I hesitated to post this for a while but I only now realized I don't have much to lose if I do-\n\n&#x200B;\n\nI find that I have a hard time conveying my thoughts through spoken words without undermining my worth and sparing everyone else that conversation. I can convey them a lot easier when I have time to think about them.  I wrote this over the course of a week. The countdown is supposed to be to help me keep track of when I finish but I guess it could be anything really. There is not supposed to be any real structure or form. This is literally me keyboard vomiting out my thoughts.\n\n7 days, 13 hours, 25 minutes, 45 seconds.\n\nI don’t care anymore. I wonder, is it okay to admit defeat? After all, knowing when to cut your losses is a large part of business. People keep saying that life is like a card game. Play the right cards at the right time and you’ll be coasting. Even if you don’t, just act like you do so no one knows. I however, have no interest in entertaining whatever creator initiated this “game”. I have given up on thinking about a future. I am humanity’s dead-weight. Every relationship I have formed up till now I have only ever served as an anchor. But instead of raising the anchor, I’d rather they cut the link and leave me at the bottom. I perceive myself in a higher light because that is who I’m most embarrassed to associate with and I don’t want anyone to see what I see.\n\n6 days, 4 hours, 53 minutes, 9 seconds.\n\nI often have visions. Most of those visions are usually violent. Most of those visions are of myself. Most of those visions are in first-person. Visions of slitting my arteries with a rusty knife and watching as my crimson life spews out of the foot long cut I created in my forearm. Visions like administering a .45 ACP round into my brain leaving my onyx-stained memories scattered all over the wall. I don’t care to live anymore. My life is no longer precious and can be seen as dysfunctional, expendable. Those who attempt to control my life usually find themselves with nothing to control. Those who try to be a part of my life usually finds that there is nothing to be a part of. But, I’m not talking about not having a life. No, I’m talking about the fact that the light of my life has been long extinguished and that anyone who attempts to shove their innocent, unassuming selves into it will find themselves lost in an abyss. The one person who managed to reach the bottom found nothing but disheveled papers and an old tome. There was nothing past the old book and papers, a mysterious road that leads to a dead end. Much like paper, my apprehension for life wears thin, like when the music thins out to accentuate the vocals; however only this time, the cacophonous, deafening sound of nothing is enough to flush out my meager whispers. I have episodes of obsessive tendencies where I pour out every ounce of passion I have mustered up to this point into a single subject. I obsess because I finally feel like I’m contributing to something. However, reality always hits and I never fail to break down when it does.\n\n5 days, 22 hours, 43 minutes, 23 seconds\n\nSound travels in waves. A wave can be any shape and could produce dramatically different sounds from saw to sine. The only sound wave I could consider music anymore is a flat-line. The disorienting and drawn-out melody only brings peace to me now knowing that everything is going to be okay now. I can finally be free, no longer trapped by my own inhibitions. I no longer wish for this life to perpetuate any more than it already has. Living is a twisted science experiment performed by God done only to prove a point that it isn’t all it has cracked up to be.\n\n4 days or something like that I don’t care anymore.\n\nI often find that pen and paper are my partners. The keyboard is my playground and my playmates are depression and anxiety. I often feel betrayed by my own emotions and that I can no longer trust myself to make sound decisions. I used to be fueled by art and music but neither inspire me anymore.\n\n3 days I think.\n\nI want to feel something.\n\n2 days.\n\nYeah…\n\n1 day.\n\n…\n\n13 hours.\n\n\\-----------------------------------------------------------------------\n\nIf you managed to read through to the end that is more help than I could ask for. Thank you.", "url": "https://www.reddit.com/r/SuicideWatch/comments/bd0o4h/just_something_i_wrote_in_hope_that_someone_would/", "title": "Just something I wrote in hope that someone would notice...", "social_network": "reddit", "user": "chimera1432", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1555229493, "permalink": "/r/SuicideWatch/comments/bd0o4h/just_something_i_wrote_in_hope_that_someone_would/", "nsfw": false, "first_save": 1635426427.5764716, "replies_charged": false}