{"id": "t5_2qpzs_t3_q0a6kq", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "Of all the very good reasons I have for concluding that suicide is the only way to end the charade that is a life I can’t enjoy I think the most compelling is the lack of connection to other people on a universal  level and no way to find it \n\nI’m a freak. I’m always “behind glass” no matter how close I might get to people. I just can’t connect to the world no matter what I do. This is more than just socializing. I enjoy socializing on the rare occasion that I do. But I just don’t feel connected enough. I’m not completely there. Everyone else interacts in a way I just can’t and never will be able to. This could be due to mental illness or other conditions but I’ve never gotten a conclusive or comprehensive diagnosis from any mental health professional I’ve seen\n\nThere is nothing I can find to solve this. I just can’t keep doing this charade of a life, even if circumstances are tolerable the total lack of meaning and connection negates everything. It’s like a dream I cant control even as I get older\n\nI think that what makes it worse is that the lack of it being a noticeable problem to others means it never gets addressed. I just have to pretend everything’s fine. Even if someone else notices they don’t care enough or don’t know how to tell me. Sometimes I feel everyone knows and just won’t tell me. \n\nTalking about  it with mental health professionals is a total waste of time both mine and theirs apparently. \n\nI feel compelled to suicide as just something has to be done. Not even a solution not because I’m sad. Just a  compulsion to fill a need I can’t fill any other way.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q0a6kq/no_connection/", "title": "No connection?!", "social_network": "reddit", "user": "PrimaryMiserable", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1633233343, "permalink": "/r/SuicideWatch/comments/q0a6kq/no_connection/", "nsfw": false, "first_save": 1635427624.2909129, "replies_charged": false}