{"id": "t5_2qpzs_t3_jyrakx", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I'm tired of my life as it is.\n \nI'm tired of who I became in order to survive.I'm tired of being treated like shit by my narcissistic mother. I'm tired of not being believed and understood ,I'm tired of not being loved and the first option. \n\nI don't see a way out ,I'm fed up of my mother destroying any sense of independence/individualism I have. \n\nI'm tired of not being able to meet any sort of expectations I have of myself (getting a job,doing better in college,dating... and what's worse I'm in my 20s,I'm a fucking adult)\n\n I'm tired of being me\n\nI'm tired of being depressed and not having energy for anything. I'm tired of feeling like I'm in a constant rollercoaster ,of feeling the fear of gravity but never being ready to feel the pain of the fall\nI'm tired of being scared in my own house ,of my own mother. \n\nI'm tired of walking barefoot on broken crystals,I'm tired of being lonely but I can't stop isolating myself either.\n\nFiction used to work to make me feel better but not anymore;everything is dark and gritty and I know first hand this world is cruel and ruthless;I carry those scars pn my skin: I don't need a reminder.\n\nI'm tired of hiding who I am,because I want to preserve a little of peace, I want to escape judgement for a little bit.\n\nI'm tired of not being able to have dreams because my parents made sure to destriy every single one of them and left me empty\n\nBut what truly makes me burn with anger is that all of these people who have hurted me are living better lives than me ,while I'm just slowly being consumed by this vitriolic poison that is my own self destruction.\n\nSorry for the rant", "url": "https://www.reddit.com/r/SuicideWatch/comments/jyrakx/im_tired/", "title": "I'm tired", "social_network": "reddit", "user": "Chaosandstars", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1606027659, "permalink": "/r/SuicideWatch/comments/jyrakx/im_tired/", "nsfw": false, "first_save": 1635426223.233552, "replies_charged": false}