{"id": "t5_2qpzs_t3_nfjy6o", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "For the last several months I’ve been sick. I won’t go into detail with specific struggles but they were related to doubts, sureness, and doubts again about my sexuality but especially my gender. I’ve realized slowly that I’m for some reason incredible at lying to myself. I somehow convinced myself that I was a girl, that I was bi, etc. but all of that was just that\nA lie\nI’m not invalidating others but for me, myself, I can tell that it was all made up out of some bizarre desire to be different or me part of a community. This wasn’t just a casual interest either. I’ve made sacrifices thinking I was part of a number of different identities, and some of those sacrifices are probably permanent. I’ve als received so much support from hose communities through my struggles that I feel awful that in retrospect every part of me they felt different wouldn’t have held up to much challenge. But in the act of lying so profusely to myself I’ve lost my own identity. I can’t and will never be happy as myself anymore. In terms of school I’vestarted dropping behind on assignments on every class and pay almost no attention because my internal turmoil screams louder than any teacher or student. I feel like a bland duplicitous hull, leaching from communities I want to be a part of and stealing every bit of my identity from someone else. I’m finished with the pain, and finished completely. I’ll probably be alive for a few weeks, maybe even a few months, but I’m going to be dying sometime in that range. I’m done cutting. I’m done hitting myself. I need something more final", "url": "https://www.reddit.com/r/SuicideWatch/comments/nfjy6o/a_bizarre_journey_nearing_its_conclusion/", "title": "A bizarre journey nearing its conclusion", "social_network": "reddit", "user": "walkerBee1", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1621366484, "permalink": "/r/SuicideWatch/comments/nfjy6o/a_bizarre_journey_nearing_its_conclusion/", "nsfw": false, "first_save": 1635428237.821002, "replies_charged": false}