{"id": "t5_2qpzs_t3_p5xzff", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "I’ve been struggling a lot and I wish I can just vanish completely. I wish dying wasn’t so hard and there was a button I could press that could erase my entire existence without having to kill myself. That way it’ll be easier for everyone around me and myself. Less painful. If I had that option I would take it in a heart beat. I’ve been going in and out of the prayers room (my family is Buddhist btw) to lit up incense and wishing that death could come sooner and take me away so I don’t have to. If that’s too much then at least give me an illness that can kill me so I don’t have to take my own life. Anything, even my brain having an aneurism. I don’t care if I go peacefully or painfully since everyday is already painful enough. I’ve done this about 3 times today because I’m tired of pushing myself. I know praying isn’t a wishing well, and it’s selfish to ask for death instead of strength, but I’ve been fighting for a long long time now. \n\nI’d also like to add on that I’ve had my first cat for 6 years. He has helped me throughout the hard times such as whenever I have anxiety and panic attacks, seizures, suicidal ideations, etc. Overall he’s been there forever since I’ve battled with depression. Recently I decided to get a new kitten and my other cat isn’t happy about it. Everyone say it’ll get better without time but he’s also mean to me. I even read that he will possibly never love me again. He even growls at me and gets aggressive with me because the kitten’s scent is all over me. He won’t let me hold him anymore or cuddle with him. He won’t sleep with me anymore or be there for me when I have a panic attack. I’ve been struggling with depression today and I feel so utterly alone. He has saved me from many suicide ideations before when I think about ending it but he won’t even come near me anymore. I’m crying my eyes out. I just want him to love me again.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p5xzff/i_wish_death_could_take_my_soul_sooner/", "title": "I wish death could take my soul sooner.", "social_network": "reddit", "user": "Tangliness", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1629180221, "permalink": "/r/SuicideWatch/comments/p5xzff/i_wish_death_could_take_my_soul_sooner/", "nsfw": true, "first_save": 1635425173.2926884, "replies_charged": false}