{"id": "t5_2qpzs_t3_p9824s", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "I havent been able to feel any emotion recently, I've only been either faking emotions or just being blank and monotone.\nIts the feeling you have if something boring just happened but its like whether sad or wholesome its that same feeling, as if something extremely  boring just happened\nI tried to show fake emotions, didnt work after someone found out I was faking those emotions, she's cut me out of her life completely now.\nMaybe thats why I've just been done trying, the only feeling I've had is to kill someone or myself\nI've lost all hope, faith, motivation.\nI feel as if my life has no purpose now, im as quiet and sometimes even motionless as a brick because im always sleeping or passed out.\n\nI don't know how much longer I can take this. But I dont wanna leave my, who I've considered service animal behind, I don't want him to be lonely.\nI just wanna run away and kill myself still, its not like I'm worth anything to the world anymore, not that it matters anyway.\n\nmaybe instead of a weapon I should just starve, its what I've been doing recently after all, I look like I could burst at any moment, well, in the mirror anyway, but I cant tell if its someone else im looking at, i never do, I always feel like its someone else there, but where am i? Anyway, Pica is just my biggest problem,  other than anorexia that is. Pica (I think its called maybe a different one I dont remember) but I think its the habit of eating things like erasers and clay and-uh yknow I should just shut up and get to the point I wanna just starve to death or at least never eat large portions, though its not like I can get any bigger, and even if I did eat, next 5 minutes I'd be hacking it up just to get it out of my system.\n\nThe possibilities are endless of what I can kill myself with, or just nothing at all, like I said, I can just starve, or I can try and figure out how to die in my sleep so its less painful perhaps? I'm still thinking, \"surprisingly\"\n\nI should most likely shut up now though I've done enough, would you really call this the right place for this message or me thinking im having a therapy session on a Sunday? Whatever it is its useless to actually read it all I'd just scan through. I'll see if I can sleep now. Goodnight/morning to you people.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p9824s/been_very_emotionless_and_my_insecurities_arent/", "title": "Been very emotionless, and my insecurities aren't any better, rather worse, Same goes suicidal thoughts. I tagged it cause, disorders and eating habits I guess-", "social_network": "reddit", "user": "ArtificalLlimeBrush", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1629616448, "permalink": "/r/SuicideWatch/comments/p9824s/been_very_emotionless_and_my_insecurities_arent/", "nsfw": true, "first_save": 1635422259.9514198, "replies_charged": false}