{"id": "t5_2qpzs_t3_cpafy5", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "All of my dreams and ambitions will never come to light. I struggled with existential depression years ago and almost killed myself, but didn't because I crawled out of it believing life will get better. Now I don't have that.\n\nIf it's not for the societal collapse due to global warming, it's the economy, the insanity of people in society, oppressive governments, deep state, pointless wars, multiculturalism, big corps, etc. It's anything that hinders quality of life for the individual or cripples humanity's progress towards a brilliant future that bothers me so.\n\nI have very little faith in humanity and I'm ashamed to be apart of it. I truly believe we could have been a brilliant species. We could have transcended into a scientific space faring civilization, a utopia. But we aren't intelligent, mature, or selfless enough, we couldn't overcome our selfish instincts. If we were more intelligent we would be a thousand years ahead of our time, but that's not gonna happen.\n\nAs a child, I used to love humanity. I wanted to be an astronaut just like everybody else. But I suppose I lost my innocence. I slowly realized that not only did humanity not live up to my hopeful standards, neither did I, I was just as bad. Just as insane.\n\nWhat's stopping me from shooting myself now instead of starving later?\n\nI'm not really in a terrible depressive state right now but I'm not happy either in light of my grim looking future. I've been through enough suicidal/existential depression that I feel I'm better equipped to handle episodes. This isn't an episode, this is just how I feel.\n\nThe thought of suicide arrives from the idea that I'm just fucking sick of not being happy and I'm not looking forward to being miserable later in life due to the collapse. I'm content with my current unhappiness only in the light that I'm slowly getting better and will have a future to achieve my goals. But as I've said, that isn't realistic.\n\nDeath doesn't scare me, well of course it does, but not as much as most other people are, I'd think. I'm a nihilist if my username doesn't give that away. That makes me an atheist as well, so I'm not looking forward to an afterlife. The greatest thing I can hope for is maybe something else does exist outside of this consciousness, like waking up from sleep, you never know you're even sleeping.\n\n...and this is long enough.\n\nA bit of background without giving my identity away:\nLet's say I'm M, 23yo, living in the US... Ya, that's vague enough to calm my privacy paranoia.\n\nQ&A:\n\n- Why not get some help?\nI've been to a psychiatric hospital under voluntary submission at the peak of my suicidal behavior in fear of my own life. I've taken medicines and been to therapy. None of this helps me, and especially wouldn't now. My depression arrives from existentialism mostly, this is solved though exploration, learning, self reflection, and positive mindset. As well as the obvious habits to deter low moods. Not medicine and some opinionated prick with a psychology degree.\n\n- Why the sudden pessimism? \nThis video, but I've always felt this way, just needed to say something after watching it. I've been thinking about ending things for about six months now.\nhttps://youtu.be/YsA3PK8bQd8", "url": "https://www.reddit.com/r/SuicideWatch/comments/cpafy5/thinking_of_suicide/", "title": "Thinking of suicide", "social_network": "reddit", "user": "NihilVix", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1565605054, "permalink": "/r/SuicideWatch/comments/cpafy5/thinking_of_suicide/", "nsfw": false, "first_save": 1635425253.941768, "replies_charged": false}