{"id": "t5_2qpzs_t3_p214jn", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "My mom just freaked out on me, telling me as soon as my birthday (right before the year ends) the health insurance will kick me off.\n\nI failed. I failed at being young, and I failed at being an adult. I have a lot of pills, I wish I could swallow them all right now, but I’m doubtful if it will be a fatal overdose. But I have 5 more months until the insurance takes away the coverage to pay for them.\n\nIf I don’t kill myself, the sudden withdrawal of three different medications probably will, at least I hope so, because the SSRI withdrawal sounds worse than dying.\n\nI can’t just keep trying to distract myself and ignore reality. It IS a ticking time limit, and at that deadline the coverage WILL END. My mom also just reminded me “this house will also not always be here”.\n\nI think that’s why she said I need another job that provides health insurance AND PAYS MORE.\n\nA bunch of idiots on the internet have told me “age doesn’t matter, life isn’t a race”, but now it LITERALLY DOES AND IS.\n\nI’m too broken, I can’t deal with this, but like everything else, I’ll probably wait until the very last second to kill myself.\n\nI’m probably going to either end up homeless or in the prison system in the not so far future.\n\nAGAIN, my mom is saying I NEED TO LET HER GO INTO THE DOCTOR WITH ME. Makes me want to go even less.\n\nI can run away, but it won’t be long until I end up homeless, in prison, and/or dead.\n\nI can’t function as an adult, and the system doesn’t make sense to me, I don’t really care if my family will be hurt if I kill myself, they’ve been mean to me a lot, my sister hates me, my dad did nothing but constantly criticize me, my mom is severely overbearing, step dad has severe anger issues and is delusional about conspiracy theories (IDGAF if this country does collapse, or the world, I don’t care anymore, it’s a terrible place anyway) and I just can’t compete in, life.\n\nI feel like even if by some miracle I completely flipped around, and everything was perfect how I want it, I’d still never be happy, just because how much has passed and how bad it was, and that it had to take such severe threats to get to a better position.\n\nI can definitely afford a gun. Maybe I’ll be able to rent my own place, and immediately kill myself there. \n\nI have no right to even think about having a girlfriend or anything romantic or sexual, I couldn’t even complete the basics in life.\n\nFuck the American healthcare system, being so “for-profit” obsessed we have such insane prices and “affordable” health insurance being tied to employment, CONDITIONALLY (you still don’t always get good, if any coverage at all).\n\nI can’t go from nothing to everything in just 5 months, I’ve barely made any real progress in job/career (no career at all) in the past 5 YEARS.\n\nI would never reproduce, whether any women wanted to do that with me or not. I’m more ANTINATALIST than I’ve ever been.\n\nWhy is it so hard to live in “the greatest most prosperous nation in the world”?\n\nMy only realistic options (no guarantees, but literally nothing is guaranteed in life) is try therapy (take Uber and go BY MYSELF, and start telling them EVERYTHING that I tell strangers on Reddit, and see if they have any realistic solution, keeping in mind that I can’t afford to wait for “long-term” healing like everybody always says you do in life).\n\nMy mom even told me “it only gets harder after the insurance cutoff”, I KNEW THAT WAS TRUE. People online LIED TO ME and told me there’s “no rush for anything in life” I KNEW THAT WAS A LIE.\n\nI hate American capitalism, I think this whole “survival of the fittest” game is EVIL, and not even technically correct in our “modern civilized” society.\n\nI can’t leave the US, because I have no education/degree which is required for citizenship.\n\nI’m becoming more and more shocked that people are just left to starve and go homeless here, and left to drown in 6-7 figures of medical debt from an EMERGENCY.\n\nI have nearly $10,000 in savings, is there anything I can do to quickly turn that into more or something? \n\nI can’t keep being a grocery bagger/cart pusher for less than $11 an hour, even if they did provide decent health insurance.\n\nI can’t learn to drive with someone yelling at me, and I can’t deal or react to anything normally when I’m having PTSD flashbacks and my entire body is shaking.\n\nI don’t know what to do. I don’t really WANT to kill myself, I just see no realistic options to fix my problem as soon as I need.\n\nIf it’s not already clear just from this post, I cannot join the military, I wouldn’t genuinely want to anyway, I’d probably be yelling in pure rage/fear back at the instructor and begging them to shoot me to death. Plus, I was already told I can’t join just because I need medication.\n\nSeriously, I hate this society and this system, that my family loves and praises so much.\n\nWhy did you bring me into this world? I could never do that to someone who can’t even consent to their own birth, it’s sickening.\n\nAside from all moral issues, it’s just too expensive to have kids anyway, too many people can’t afford to support THEMSELVES, even with more than one fulltime job……\n\nI don’t think there is a solution, not that will help me as soon as I need anyway. I’m scared, I’ll never be able to be happy even if it does somehow get better and I avoid any withdrawal and/or homelessness, because I’ve already been too traumatized to ever be able to just “live in the moment” even if my life was good and how I wanted it. \n\nI can’t trust anyone, so forget about any healthy long-term relationships just based off of that, without even counting the “being unable to be independent” factor.\n\nSeriously, fuck American capitalism, it’s nothing but a way to “kill the weak” who didn’t even consent to being born in the first place, and we don’t live in environments intended for us, religion and politics ruined the world.\n\nShould I just, throw all money on lottery tickets? Seems like winning the literal lottery is my only hope now, and it’s not as if my money will have value to me when I’m dead, so it doesn’t matter if I just lose it all.\n\nI don’t know what else to do.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p214jn/realistically_this_may_be_my_best_if_not_only/", "title": "Realistically, this may be my best if not only option at this point.", "social_network": "reddit", "user": "breakingpoint26", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 106, "down_vote": 0, "creation": 1628638608, "permalink": "/r/SuicideWatch/comments/p214jn/realistically_this_may_be_my_best_if_not_only/", "nsfw": true, "first_save": 1635426874.7618387, "replies_charged": false}