{"id": "t5_2qpzs_t3_68ldgr", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I'm 22 years old. Socially inept. Don't have any hobbies. Haven't been anywhere without my parents([post describing my situation with my parents](https://www.reddit.com/r/raisedbynarcissists/comments/627r7q/repressed_anger_keeps_me_from_being_productive/)).  DOn't have any friends. Can't drive. Can't talk to women.\n\nTo others it might seem that I'm an introvert who loves to read, sit all day in front of computer, listen to music and stuff. However, I'm consistently screaming inside my head. I stay suck on the same page of a book for day, because I can't stop having intrusive thoughts of blowing my head off(or sometimes killing other people, but mostly myself). Similarly, can't listen to a whole song without changing it. I can't pay attention to *anything*. I get some clarity after doing a silent yelling thing for some time, but after that I'm just tired and want to sleep. Thus, rendering myself completely unproductive. Although, /r/watchpeopledie calms me down, or numbs me at least.\n\nBut that's trivial. I've read a lot of self-help and even motivating books. I *understand* what I should be doing, how it will make my life better, give me purpose.\n\nThe thing however is, I don't see any point in going on anymore. I see around and people have done so much, developed so much, while I'm still the shy, suicidal, socially inept guy I was when I was a teenager. People have developed skills towards a particular passion. Have *lived*. Enjoyed the halcyon days of youth. While sexual gratification is still an alien concept to me. Along with love. Along with being happy. Being part of the crowd. Now I know that you'll say that I don't have to be frustrated because of my introvertism, that being social and such is just something that media is pushing onto me. But I've *craved* going on road trips, going to music festivals, going to raves, doing psychedelics and such. However, due to narcissistic mother, I wasn't able to do any of these things. Now, I feel that I'm to removed from society to fit back in. But that's not it. After craving something for so long and having it just reiterating inside your head makes it lose it's charm. \n\nI can't even write with structure anymore. My main point is, there's nothing left for me to do. I've been dehumanized. I don't have any skills at all. I don't have any experience in anything apart from sitting in my room and alternating between different forms of passive escapism. My mother's pernicious shadow has suffocated and strangled the life out of me. I've lost the will to live. \n\nI even get angry because I don't have easy access to fire-arms. because suicide in any other way is very difficult. When I'm on a commute I keep hoping for an accident. Something to impale me in a flash of a second. Hopefully through the rib-cage. This has been going on for *years*. \n\nIt seems that I've missed some sort of developmental phase where one is supposed to get out from a shitty parent's influence. Like there's something that all the people out there have and I don't. \n\n\nIt's best that I terminate this sad existence.\n\nPS: If anyone's going to recommend therapy, I've mentioned in previous threads, that *I literally fuckin can't afford therapy and don't have access to free resources where I live.*", "url": "https://www.reddit.com/r/SuicideWatch/comments/68ldgr/lost_the_battle_years_ago_went_into_a_fugue_state/", "title": "Lost the battle years ago. Went into a fugue state instead of accepting the result.", "social_network": "reddit", "user": "sociopathalterego", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1493637642, "permalink": "/r/SuicideWatch/comments/68ldgr/lost_the_battle_years_ago_went_into_a_fugue_state/", "nsfw": false, "first_save": 1635422304.7020495, "replies_charged": false}