{"id": "t5_2qpzs_t3_p8wl13", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd", "4dfd95d6-b32f-40a3-befc-5d1f918092b7", "35003726-80f4-4b57-a706-febe3655a157"], "text": "I'm a U.S male and turned 22 last month.\n\nI have a laundry list of traumas. It's not that I was just abused as a child or bullied or just had a touchy uncle. It's that I had an absent abusive father. That same absent abusive father had a temper and cheated on my mother who he would constantly fight with, cheat on, and do things like throw his wedding ring at and tell her he fucking hates her. That mother was addicted to drugs and was practically unconscious, leaving me essentially parentless from the age of 13 on, giving me the opportunity to experiment with drugs and older girls at an early age, including a physically, sexually and psychologically abusive girl who they allowed to move in at the age of 18 when I was 16. The same parents allowed a brother who was a foot taller and 100 pounds heavier than me to beat the shit out of me on a weekly basis to continue to do so, and only go so far as to ground him once, for a few days, and this was the one time he \\*accidentally\\* split my lip. I've witnessed things like broken phones and my dad fighting him and I've been stabbed and strangled and had my head stomped in and so much screaming and being cornered and screamed \"there's no snitching in this house\". My mom overdosed on drugs and died in front of me naked when I was sixteen. All the while the physical abuse was constant as well at school but not as severe but the bullying was relentless, by teachers and students alike. All throughout high school I was suspended and bullied constantly by an abusive principal who did the same to other students, but had a vendetta for me specifically. I can't get into everything she did but due to my insomnia I was late for classes (while doing things like maintaining As in AP classes and scoring a 32 on the ACT) and this resulted in constant out of school and in school suspensions, and of course suspensions just because she felt like it. I was socially alienated and this continued into adulthood where I was left alone by my father and my girlfriend and had no friends. Eventually my abusive girlfriend and I split up and I made social media and made some friends and I reunited with some people and I was sexually assaulted and got the shit beat out of me by a friend of ten years last summer and got bullied and called a psychopath and crazy and the girl falsely accused me of rape to cover her ass and everything and lost what friends I did have and my job out of stress and this is when I fucking lost it. My quality of life has gone to complete shit.\n\nI have no friends, I have no job, I got one but couldn't keep it down because I kept spacing out and couldn't keep my attention on anything and kept being consumed by negative thought. I have no family, I still live in the house my mom died in and I was abused in with bloodstains and holes all over the walls on every floor of the house, my dad is still never home. My step-mom is borderline mentally handicapped (is in her mid 40s and doesn't know what cocaine is), my dad is racist (George Floyd died of a drug overdose, the cop did what he was supposed to, all those black people are just baboons screaming, etc.), my brother is a psychopath (made a joke about our autistic step-sister being \"old enough for cock\" because she's \"on the block\" - she's ten). I have no energy to do anything, I'm socially ostracized completely because the girl that assaulted me is popular, I constantly relive trauma, I'm paranoid, I can't work, I'm afraid to go places, I NEVER sleep, I'm inside all the time glued to my phone, I don't even have the energy or attention span to play video games. I tried seeing a psychologist and they canceled my appointments three fucking months in a row. I attempted suicide last month and ended up in a psych ward and I had seizures and nearly died of Xanax withdrawals because the fucking medical staff was so incompetent they didn't give me my prescription until I got assigned a new doctor because the first doctor decided she just didn't want to see me that day. Oh, that's another thing. I'm helplessly addicted to Xanax, which got prescribed to me when I was 17, as it should.\n\nI've been in therapy for over half a decade now and nothing is working out and things only continue to get worse and medication doesn't help and I continue to become even more zombified. I have brainzaps all day long, I'm fatigued, I can't do basic things like clean the house or go to the gym or pay attention during fucking conversation. I'm completely done as a human being and I only just turned 22 years old.\n\nYes, I understand that some people have it worse but that doesn't make this okay. This isn't okay. There are a lot of reasons to not kill yourself, but in my case there are a lot more reasons for me to get the fuck out of this realm than to stay here. At this point I'm just going to continue to suffer and deteriorate and there's seriously no fucking reason to do that. \"Suicide is selfish\" is such a ridiculous notion, it is not selfish. I've been shown time and time again that I'm not cared for by anyone else on this planet, like if I were, my dad would have stayed with me when my mom passed away instead of spending the nights with my new step-mom, so I won't be hurting anyone, and if I do, it will only be for a passing moment. People will move on. What IS selfish is making someone fucking perpetually suffer so you won't be upset for a year or two.\n\nAnyway, I hope having been hospitalized doesn't prohibit me from purchasing a firearm because if I fuck up and end up in the hospital again I'm going to lose my fucking mind. I tried killing myself during the worst of my Xanax withdrawals in the psych ward with a towel and it's impossible. I've got to make things work out this time.\n\nI really do not see any other answer here, if you looked at me like a sick, old dog, the reasonable solution would be \"put it down\", it's just the humane thing to do in this situation. I don't deserve to suffer and be exhausted all day every day for the rest of my life. It won't get better.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p8wl13/im_going_to_commit_suicide_before_2022_ive_been/", "title": "I'm going to commit suicide before 2022. I've been thinking about it for ten years and I'm not dealing with this anymore.", "social_network": "reddit", "user": "Same-Shame4390", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1629570398, "permalink": "/r/SuicideWatch/comments/p8wl13/im_going_to_commit_suicide_before_2022_ive_been/", "nsfw": false, "first_save": 1635426559.284262, "replies_charged": false}