{"id": "t5_2qpzs_t3_pjagc3", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "Yesterday I turned 38 years old. It was a miserable day. I had nothing planned since I lost so much of my mental health and social network since I last celebrated my birthday, that any attempt at throwing a party would just remind me of how much I've lost.\n\nThe only good friend I have left did offer to take me out for dinner. But she canceled the day itself due to not feeling well herself. I lashed out at her. Called it a shitty thing to do on someone's birthday. She's blocked me now and doesn't want to hear from me again. I probably deserve that. \n\nSo I'm 38 now. I've been very unhappy for as long as I can remember. I wouldn't even call it a depression. I'm just miserable. And looking at the state of my life, I think that's justified. Many years ago I decided for myself that if things weren't going well by the time I'm 40, I would definitely pull the plug. I initially gave myself a lot of time. But that time is running out now. And things have consistently been getting worse every single year.\n\nI'm diagnosed with BPD, avoidant and dependent personality disorder, ADD and probably some sort of mood 'disorder'. In recent years I've started to suffer from derealisation. The world around me just never seems fully real to me anymore. It makes interacting with people even harder. The derealisation may or may not have been caused or worsened by recreational drug use, which I started around 5 years ago, after I suddenly developed chronic IBS. I found that it helped me to go out and have fun / be social at parties, despite always feeling fucking sick to some degree. \n\nI dropped out of a well paid IT job 3 years ago, shortly after I developed tinnitus. Presumably through prescription drugs, although the recreational ones might be to blame as well. Or just plain old stress. Who really keeps track. Nobody knows what really causes it anyway. There wasn't any hearing damage. Just a non stop beep that will never go away. I've gotten used to it mostly, but do fear it will suddenly get worse one day, in the same way it just appeared out of nowhere in the first place. \n\nAfter two years of sick leave they fired me. I'm on disability benefits now due to my poor mental state. I'll get re-evaluated yearly. But so far there's been no progress. I don't believe in it anymore. I've been trying to get 'professional help' for 15 years. None of it seems to click with me. Perhaps I'm just the most stubborn person on the planet. Perhaps some things just cannot be solved. \n\nI've got a big helium tank in my basement, it's hooked up to a bag with a tightening strap, ready to go. All I'm waiting for is the guts to do it. All it takes is one decision. A lot of guts, a little vision... etc. \n\nSo what's my deal then. Why am I so miserable. \nWell. I think it largely stems from chronic loneliness. In the romantic sense, of course, but also in a much larger sense. It's a spiral you get into. You get sad, therefore your relationships deteroriate and you get sadder, etc... and given enough time without any real positive or encouraging experiences, you just sink deeper and deeper. And boy am I discovering new depths every year. \n\nAt the point where you're an aging, severely depressed man, with no real prospects in life, you'll find that people aren't exactly queueing up to spend time with you. This just gets worse over time. I've now completely ruled out the possibility of ever finding a romantic partner who'd be willing to put up with this much baggage and I've lost the energy and ability to deal with it on my own. It's a dead end.\n\nI was admitted into a clinic full time two years ago for a 5 month group therapy program. So I did what any sane person, willing to truly work on themselves would do and tried to get into a relationship with one of the girls there. That ended worse than I could have ever imagined. Went from a lot of recognition and support initially and finally being able to bond with someone for the first time in many years, to something so hurtful and damaging it still affects me greatly two years later. While at the time I felt I was doing everything to try to avoid just that. I failed more than miserably and blame myself for it a lot. \n\nSo now I've reached this point where I just look at my future and see nothing at all. No possibility of anything good happening ever again. When I'm honest towards people about the way I feel I immediately scare them off. Potential friends. Potential love interests. It doesn't really matter. I stopped functioning on a very basic level. I still go to social events but cannot deal with any of them sober. I sometimes get away with it by being extremely sarcastic, making jokes and being self deprecating and get a few laughs here and there. But underneath, to no surprise, I'm really struggling. Drowning. So I just say random shit, which I regret the next day, and make no true connections to anyone. Ever. \n\nI can't live like this much longer. Life has nothing left to give me. I know deep inside that my capacity to make any real change has been severely crippled by the vast amount of failures I've endured. People say you shouldn't think of yourself as a loser, but what if you really do lose all the time. It becomes a fair assessment. It's just not realistic anymore. If it were up to me I'd pull the plug tonight. I'm 100% convinced it would be the right course of action for me. I even envy the people I've known who have been brave enough to go through with it.\n\nYet there's some sort of misguided dumb belief that, hey, maybe a miracle will happen, that keeps me from doing it. I don't even believe in miracles. I believe in nothing. All I believe is I shouldn't be alive. \n\nThanks for coming to my Ted Talk. \n\nThis isn't even a throwaway account but I'll probably delete this anyway. Who cares at this stage anyway.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pjagc3/im_nearing_my_deadline/", "title": "I'm nearing my deadline", "social_network": "reddit", "user": "IWantToGoBackInTime", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 15, "down_vote": 0, "creation": 1630968555, "permalink": "/r/SuicideWatch/comments/pjagc3/im_nearing_my_deadline/", "nsfw": false, "first_save": 1635427659.5098138, "replies_charged": false}