{"id": "t5_2qpzs_t3_p53mhi", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1", "f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "I’m Afghan. My family are stuck in Afghanistan while the Taliban are out there murdering those like them. I’m trying to get them out but nothing is really working. \n\nIm tired of living. I can’t take the pressure anymore. My mother keeps on showing me awful news about the situation. She breaks down due to the stress of the situation and beats the shit out of me. She tries to put herself in danger/kill herself a lot too. \n\nEvery single day, I have to wake up and spend hours trying to save them. The worst part is that they refuse every solution I give them because they’re too busy arguing with each other and believe that god will magically save them.\n\nI have no friends to talk to, my family are at risk of getting murdered and my parents are both narcissistic and abusive. I can’t take it anymore. \n\nI cry when I wake up because I know what the day will hold for me. I have to sit there and cry in the bathroom because if i start crying in front of my mom, she’ll start beating me. I’ve lost my friends because I’m barely stable enough to sort through an argument instead of just running away at conflict. \n\nIm not even in my own body. I have to completely numb my emotions if I want to get through the day. I wish I could sleep in for a moment and just get a hug but I have so many duties to fulfil. I have to go to places and build my skill set. I have to act professional, friendly and like I have it all put together.\n\nI can’t shoulder the responsibilities anymore and I hate myself for it. I feel ashamed and useless. I have to wipe my tears with the pads of my fingers because I know that I won’t be able to help scratching through my face if my nails touch my skin. I fantasise about just finally tearing through my wrists and my face just so that the thought of the searing pain will distract me from what is happening.\n\nIf I wanted to kill myself, I most definitely could. The only thing holding me back is the waste of a life that would be. Life, or rather my perception of it, is the only constant of my dubious existence so far. Willingly dying when I’ve experienced so little is a terrible shame, especially because rationally, things will change every single day.\n\nIf I were to do it, I’m sure it would be impulsive. I have frequent urges to just kill myself or days where all I can think about is my own death and how to plan it out. It looms over me, like a back up plan just in case.\n\nThere is a certain rush that comes with people not suspecting a thing. It’s like I can still cling on to the idea that it’s all in my head and that no one cares about me, therefore everything must be fine and I can fix everything on my own with no consequences.\n\nI just want peace, if that means ending my life then I’m afraid that I may take that route. And honestly, right now it is feeling like a real possibility.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p53mhi/my_family_could_get_murdered/", "title": "My family could get murdered.", "social_network": "reddit", "user": "throwaway20194747", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 102, "down_vote": 0, "creation": 1629067810, "permalink": "/r/SuicideWatch/comments/p53mhi/my_family_could_get_murdered/", "nsfw": false, "first_save": 1635425557.4581664, "replies_charged": false}