{"id": "t5_2qpzs_t3_52f3y5", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "Let me explain.  Mentally and emotionally I'm about to give up on everything.\n\nI am a Harvard and Stanford educated professional who has worked in Wall Street most of his career.  While I had great success for most of this run and have a resume including JP Morgan and Fidelity, I've had a negative run over the last two years.  First, I've worked in hedge funds, and if anyone here follows that industry, it has been and is on the verge of imploding.  My old big salaries probably will never come again.  Second, I'm 40 years old, which like professional sports is too old to get jobs in Wall Street.   \n\nMy fund shut down 2 years ago, and I've been unsuccessfully looking for jobs since then.  I've submitted over 1000 resumes, had over 300 interviews, and have made it to mid-late rounds more than 100 times.  None of these have worked out.  I've been willing to move to any city and am very flexible on salary.  Given this effort I've put in I'm just physically and emotionally drained.  At first I thought with all my interviewing and mid-round success that it would just be a matter of time to find something to support the family, and I was happily optimistic.  Now, after 2 years of this, I've done the math - I calculate a 1 in 500 million chance in a normal distribution that I would miss out on 100 jobs making it to the mid-round.   Therefore, mathematics says that THIS IS NOT RANDOM.  And that implies that either I am somehow hopelessly flawed, or, there is a vengeful God who is keeping jobs from me and my family.   When I came to the conclusion that math says that I am hopelessly screwed, I became incredibly depressed.\n\nI live with my family in a beautiful house in a NYC suburb.  I have 3 beautiful kids and am a great Dad.  Besides the fact that I have lost the ability to support my family.  My wife hates me since I lost my job and this gets worse every day though - she cries sometime and tells me she wished she had a better life.   I don't know how to answer that thought in a real way.\n\nThe one ace in the hole I have is that my life insurance policy pays in the multi million dollars.  If this were to kick in then my wife and kids would never want for anything, ever again,  Given the fact the world is telling me than I am hopelessly flawed and given the fact that I  am creating pain every day for my wife and kids, doesn't this plan make too much sense?  \n\nIf I did this today I would feel fantastic and filled with love.\n\nEarl", "url": "https://www.reddit.com/r/SuicideWatch/comments/52f3y5/if_you_are_worth_more_dead_than_alive_isnt_it_a/", "title": "If you are worth more dead than alive, isn't it a noble move to sacrifice yourself for your family?", "social_network": "reddit", "user": "earl98", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1473696641, "permalink": "/r/SuicideWatch/comments/52f3y5/if_you_are_worth_more_dead_than_alive_isnt_it_a/", "nsfw": false, "first_save": 1635428244.221975, "replies_charged": false}