{"id": "t5_2qpzs_t3_hzaeyt", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "Im so tired. I’m so tired of existing. I’m so tired of being mad. I’m so tired of being tired. It’s pathetic. I’m a 25 year old adult who’s stuck living at home with my family. I can feel myself falling apart and I’m reaching the point where I’m finally just going to take myself out of this shitty game called life, or I’m going to end up cutting ties all together with my family, which is where I’ll probably sink. If it’s sink or swim out in the big world. \n\n\nI am holding on to so many grudges. From so many years. That I clearly can’t cope with in a healthy way. My heart hurts so much but I’m such a glutton for punishment that I can’t bring myself to stop carrying around all this hate. And it is absolutely one hundred percent consuming me alive. I’ll try and use brackets to section off my thoughts since I doubt anybody cares enough to actually read this all the way through. \n\n\n\n {My thoughts on my father}\n\n{{{{As an adult now. I realize that I spent probably the first 18 years of my life. Living in literal fear of my pseudo racist father. I still remember being 6 years old or so and hearing my mother scream for my brother because my father was choking her in their bedroom. Was a big steroid fan back in the day. I spent most of my middle school and high school career grounded from one semester to the next one because I frequently got C’s in school which my parents would ground us for. Even one C on the report card and it was grounded for the rest of the semester. I still remember getting in trouble so badly for lying about doing my homework, not even so much for not doing my homework. But it was distinctly about lying about it. My father was beating me in our dining room and at one point was physically choking me against the wall, and I remember my mother saying “well Don’t choke him (insert name)” and him looking straight at her with his hands around my neck saying “I’m not choking him” I still remember that same night him having to come in my room to change my ice packs on my swollen face and how petrified I was that the gameboy sp I was playing was flung off the bed in a room with no carpet because I was certain I was going to get beat again. I remember going to school the next and having to tell my teachers (because all six of them forced me to stay after class and talk about it) that I was playing football with my brother and fell on a sprinkler. Funny how their response to me lying about homework was to in turn go to school and lie about why half of my face was swollen and black. I remember the first time i was ever caught shoplifting (was obviously my last time doing it too) when my dad came to pick me up, he was already so nasty to me before leaving the store that the police threatened to not let me leave because he was already trying to hit me in front of them. \n\nBut you know. Now that I’m an adult and have been jumped literally just because of my sexuality. If I’m going to get my ass beat I’m going to get my ass beat. I’m just not living in fear anymore. }}}}\n\n\n {my thoughts on my brother}\n\n{{{{Which brings me to my brother. Who as of lately might as well be dead to me. We have not currently spoken since April, and as far as I’m concerned we probably won’t ever speak again. Let’s start with me saying I feel like my brothers relationship with me has always been from the start. Me bailing him out when he needs it. I remember being in elementary school and him getting to go back to sleep after my mother woke us up for breakfast and would leave for work, because it was my job to “wake him up after rugrats” when he was about 12 or 13 he got mixed up with a bad neighborhood kid and ended up almost lighting an entire house on fire in our neighborhood. The police officers were nice enough to offer him the deal that if you stay out of trouble until you’re 18 this will be completely removed off your record with no trace of it ever even happening. Sure enough he starts smoking weed in high school (which is back when it was HIGHLY frowned upon) and guess who had to take every single drug test for his four years of high school. My dumb ass. Bailing him out again. Until finally he got caught coming back late from lunch (upper class men were at the time allowed to leave campus for lunch) and he came back with a hotboxed car and didn’t air it out. So when the principle stopped him to ask why he was late she was literally hit with a cloud of smoke. My brother was the sole reason my high school was no longer allowed to leave campus for lunch. My brother and father have always had an awful relationship too obviously all this places even more tension on it, and eventually lead to him either being kicked out or leaving. I don’t remember which. Being on the streets on his own he was arrested more times for carrying stupid large amounts of weed on him because he sells it, and eventually got charged I think with robbery. Then to top it all off, a few years ago my brother got mixed up in the flocka epidemic. And of course there’s my dumbass bailing him out again being forced to put two stolen bikes in my car and drive him to Miami. \nWhen I first started realizing how much I hated him was I think my senior year of high school. My parents had gone out of town leaving him in charge. I remember distinctly it was the night before vans warped tour he’s in a huge fight with his at the time girlfriend, because he was literally hitting either her, or her and/or her kid. And I remember he stormed into my room flinging open the door trying to use me as an excuse “isn’t this okay because it’s what dad used to do to us. “ of course having a criminal record he couldn’t find a job and was on probation at my parents house and because nobody wanted to hire somebody with his record they literally gave him a fucking job at the company my father works for. This job is 15$ an hour, gets benefit and vacation days. I on the other hand spent years being treated like shit in jobs. Two years ago I worked for quiksilver over the course of about a year, finally left because they told me and a coworker that we were the ones being considered for management and yet they brought in two outside hires after the second one the other coworker had the sense to leave. My dumb ass stayed thinking well now that she’s gone it’ll look better on me. Which is when they brought in another outside hire. Who I was eventually cool with. I just stopped offering to do the management work for sales associate pay. Until I finally got so fed up that I transferred to GameStop because they were willing to start me as a keyholder since I already had basic management training. So two years trying to work for a manager only to be shit on by my parents because it’s not full time and “at your age your brother worked full time” at my age y’all gave him a fucking career because nobody wanted to hire a literal criminal. Anything I do It’s just never going to be good enough. \n\n\nLet me talk about our most recent altercation, because it’s a fantastic transition into my mother, as of last April I was unfortunately unemployed thanks to this whole virus outbreak, and of course that sets off my family members because I sleep all day while they work. So my mother asked me on April 20th the day before my birthday (a day that I was operating on approximately 2 hours of sleep because I’m always up all night) if I could go help my brother in the warehouse where he works because he really needs it.  I have already had altercations with my brother there from helping him a previous time. It was so bad that they sent me home early. So being there in general makes me uncomfortable. Even when I go in to help my dads department. So of course I didn’t want to help which wasn’t an acceptable answer to my mother and after about the 5th time of her saying something obviously I snapped and agreed to which she responded “forget it” and slammed my door shut. (It should be noted that in my mother’s defense I’m a nightmare to wake up because of how little I sleep. There are times I wake up and am in a fight with my mother because she apparently tried to wake me up and I was nasty, meanwhile I have literally no recollection of even speaking to her ) so my dumb ass trying to bite the bullet agrees to go work for eight hours in a hot sweaty warehouse with barely any ac on my birthday of all days. I woke up that morning still mad about the fight I had with my mother the day prior because I feel like as a grown ass adult I should be allowed to say no I don’t want to do something. \n\nGet to the warehouse work the shift, I leave at five, which apparently was a mistake because I wasnt supposed to leave until 5:30 which I thought was fine because 1) I genuinely thought they left at 5 every day and 2) I didn’t take a lunch break because I was hoping if we happened to get everything done early we would just be able to leave. Obviously that was wrong and I got a shitty passive aggressive text message from my brother.\n\nHaving already been in a bad mood from my fight with my mother the day before partnered with my brother annoying me after I had left I stopped by aunts house to vent because I was literally seeing red. Wasn’t even planning on going home for my birthday because I just didn’t want to be around any of them. \n\n\nThe next day comes and I don’t show up because not only did I not want to be there, but when I had gotten there the day before another employee of that company said “we don’t know if we’ll need you tomorrow or not yet” so I just didn’t bother to show up because if y’all needed me you should have worked that into your text message when you were being an asshole in my opinion. So of course my petty ass isn’t going to show up.  My brother comes home through the door doesn’t even put his shit down and is in my face screaming at me for not showing up “why should I have to explain to my boss why you didn’t come” “why do you get to sleep all day while we work I’m sick of it” turning to my mother “I’m sick of him aren’t y’all sick of him” (to which she agrees probably just trying to get him to calm down, but I won’t ever for a second forget you just said you were sick of me. ) and of course I’m running my mouth back in return, which is when he decided to put his hands on me, shoving me literally to the floor. And this is about where I Black out with anger because I had my Nintendo switch in my hand. The limited edition no longer in production animal crossing themed one at that. So obviously I’m pissed and yank his PlayStation out of the wall and slam it on the ground. You can skip the next parentheses part if you don’t care about why a stupid video game console made me so upset.\n\n(A detour to mention about these video game consoles. My brother and I used to exclusively use Xbox but I made the transition to the PS4 when it came out. My brother didn’t. I had been asking for a PlayStation 4 since they came out for both my birthday and Christmas for I think like two years. Until the year my brother spent Christmas in jail because he was addicted to flocka. When my mom finally bailed him out because she felt like he was actually clean, he got a PlayStation 4. When I asked why he got one and I didn’t despite it literally being the only thing I asked for as a Christmas gift, she said “well he wasn’t here for Christmas so I had to make it special.” I think I eventually got the PlayStation for my birthday the following year. But this fucking switch man. I swore up and down when I was a GameStop employee that they were going to make an animal crossing version and they all laughed at me said if it was going to happen it would have already and talked me into buying just a standard switch instead. Low and behold a few weeks later the animal crossing one is announced and I’m lowkey heartbroken that I just spent a majority of my money on the standard one. I eventually get myself so worked up over it that I asked my mom to front me the money to buy the new system, and I will give her 200 when I sell my switch and the rest from my next paycheck. She’s talking some I can’t I don’t have that kind of money, which would have been totally fine. I was just embarrassed that I not only put my pride away to ask for money, but was also upset enough about not getting the animal crossing one to even be in this situation. So whatever whatever we end up agreeing on if I sell the console first and give her the two hundred she will give me the rest. Where as I was only asking her for the front because I didn’t want to risk selling my console before the new one came out and risk then not having a console at all. Especially since I had already missed like two years of the switches lifespan.  So obviously I’m super thankful to my mom and I literally spent like two days thanking her and talking to her about it, only for me to find out that she had given me my own money. I don’t know what it was for, possibly my unemployment since the console came out around the time the virus was starting to flare. And at that point all I can keep thinking is wow. You really kept my own money from me, made me gamble on being able to find a limited edition console without a preorder. And told me you couldn’t loan me anything. That makes me so mad. How are you going to lie about my own damn money. Serves me right I guess for not being adult enough to stop using our joint bank account.) \n\nAnyway. I slam his PlayStation on the ground after he put his hand on me the first time we get into a screaming match in his room to which I say something along the lines of “you’re allowed to knock my switch out of my hand so why should you expect any different of your PlayStation” to which he responds (talking out of his ass) “well you didn’t pay for it mom did!” Jokes on you asshole not only did I pay for it entirely with my money but our mother literally withheld my own money from me and made it more difficult for me to get an already difficult to get console. This ends up with him coming back into my room because everyone in my family (myself included) has to have the last word in argument. Which leads to him putting his hands on me a second time except this time since there’s not a 400$ gaming system in my hand I pull his disgusting ass down with me.}}}}}\n\nThis whole fight somehow ends with me being kicked out of my house by my mother. \n\n {my thoughts on my mother}\n\n{{{{Fun fact. Maybe about a week before this my mother was begging me to stop going out despite taking precautions with a mask and specially made sanitizer consisting of primarily alcohol. Because they had a friend in critical condition from covid. This is the same woman who threw her kid out into streets during the first peak of this epidemic. (I’m in Florida so it is at this moment higher than that first peak because Floridians are trash) so I spend the next three or four day sleeping in my car doing whatever trying to manage on my own, spending what little money I had fixing the joycon drift on my switch that was non existent until my brother attacked me with it in my hand. One thing leads to another and I eventually end up back home. I asked my mom if we could start family therapy because I’m literally holding onto grudges that I don’t know how to let go of. She says when all of this is over but I’m positive she’s forgotten about it and it might very well be what causes me to cut her out all together. \n\nA few days ago me and my mother got into a huge arguement because she woke me up to ask me to take her to firestone to pick up her car(I’m exhausted but totally not a problem to me at all) so I get right up get dressed grab my keys and when I walk out of my room she goes “are you ready now I’m not in a rush or anything” I was a little annoyed by the stupid question I’ll admit, like you just two minutes ago came into my room to wake me up and ask me to take you. Yes I’m ready to go lol. Otherwise I’d still be asleep. She of course takes my flat response (a slight mixture of both my annoyance and exhaustion) as me being in a bad mood. So we get into my car and she’s overreacting because my car is a little shaky (which I’m almost positive is just because I need air in my tires) talking some oh my god we have to pull over what if you have a flat. Like we definitely would know if we were driving on a flat tire. It’s been doing this since like the second week I got this car. So I’m just sitting there trying to get to the destination as fast as possible trying to hold my tongue and not cause a fight when she sets me off and says something along the lines of “you’re in a bad mood because I asked you to take me” my response being “oh what I’m in a bad mood because I got right up to do something you asked me to do???” which fucking infuriated me and caused a screaming match in my car. I don’t understand why she has this god complex where she thinks she gets to tell other people how they feel about something. She did it to me on my birthday too which I forgot to mention and am now too lazy to go back and add in. But like it drives me crazy. I don’t care if they’re right wrong or somewhere in between. Nobody has the right to decide how somebody feels about something except for that person. So when I sit there and tell you I’m not mad and you tell me “yes you are mad that’s why you’re being shitty” that’s a self fulfilling prophecy right there. Of course that shits going to make me mad. If you’re just going to decide I’m in a bad mood for me then shit I guess I’m in a bad fucking mood then. \n\nSo this screaming match in my car leads to her saying “I hope something happens to your car, and when it does DONT call me”. I will never ever in a million years forget she said that to me. I hope that when something does happen to my car, I’m inside of it, I hope it’s something fatal, and I hope she has to live with it for the rest of her life. And then of course after our screaming match she sends me a passive aggressive text message (because apparently my family is famous for doing that shit) talking some I won’t be screamed at in a car that I bought you, you are SO disrespectful the next time you talk to me like that you can find a new place to live! (As if she didn’t kick me out when I was 16, and 18, and 23. Like clearly I can manage in my car bitch try me. I would rather starve to death on the streets than feel like I need help from someone who treats me like shit) Skip the parentheses if you don’t care about context with my car history\n\n(Both me and my brother were fortunate enough to get cars for our 16th birthday. The difference between us is my brother has wrecked I think 2 cars my parents bought him, one car they gave him because my mom got a new car (which that one he wasn’t at fault for but still it’s a car to add to your tally) and ruined one of my dads trucks that he was using for whatever reason one day.  I on the other hand drove the same car that I had since I was 16 until literally this year when I turned 25 and was given a new one. But honestly my parents had been trying to buy me another one for a few years I just fought them on it because I didn’t want a new car which I will explain why later. )\n\nAnd then now just today, we are in another arguement because I think last night, my brother walked out our back gate to go sell drugs in our mailbox because he thinks he’s cool and tough and can handle jail as if he isn’t literally crying “mommy bail me out” when he’s in there. As he’s going out he knocks over the ashtray I had been using over there (which was admittedly in the walkway but only because that particular night I was in a hurry to relocate under my backyard awning because it was raining and I had all my technology on me) but when he walks back he has the nerve to say to me “your ashtray is knocked over “ as if i wasn’t outside and heard him kick it over like I’m supposed to lean up after him. Despite us having literally not a said a word to eachother since April. So I hid the ashtray that he normally uses with the mindset of “if he needs an ashtray he’ll have to go over and clean up the one he kicked over.” Only for me to find that my mother ended up being the one to clean up his mess. Which of course infuriated me. And then she had the nerve to defend him in a text message after we got into an arguement about it. “Well it is your ashtray...” okay did I kick over my ashtray or did my brother. Because that’s the person who should have cleaned it up was who knocked it over. \n\nIn regards to my mother specifically it hurts me the most. Because I often at times feels like she’s the only one out of the 3 of my immediately family that I could have a relationship with or that I actively want to have a relationship with and that bridge is so close to being burnt to a crips. I don’t want to appear ungrateful because as a mother she does go above and beyond. I’ve been spoiled sure. But my problem with it is, I feel like my mother only gives as much as she gives so that she has ammunition to hold over peoples head. I fought her for YEARS about getting a new because I knew she would just hold it over my head. Which obviously I was right about. I remember being kicked out when I was 18 because I wasn’t working and i had just gotten kicked out of college and she said leave your keys pack your stuff and find somewhere to live. So I did set off with no car no money no nothing ended up being taken in by my best friends family. Spent a year or two there, and I literally did not get my car back (the same one she had given me at 16) until the girl I was living with literally called her in tears asking if we could just borrow it so we could go see her mother who was in the hospital because she needed brain surgery. LITERAL BRAIN SURGERY was the only reason I got my car back. And it still took my friend like two or three times of asking my mother for her to let me use my car just to take her to see her mother. \n\nMy father has always babied me and let me get away with more than he lets my brother get away with I can admit that. The problem with it is, that because I don’t feel the same type of yearning for a relationship about my father that I do about my mother I don’t really care about him favoring me. And because my dad tends to let me get away with more my mom feels like she has to let my brother get away with more, which in turn causes me to always just feel like I’m chasing my mother’s approval or some shit. }}}}\n\n\n\n {thoughts on my own disgusting self}\n\nIt’s only been recently that I’m starting to come around to my father and that’s only because I think I’m starting to hate my mother. \n\n\nI know I probably sound ungrateful and entitled. And I can see why. But I am truly thankful for how privilege I’ve been and all that I’ve been given. But I don’t know how to not feel the way that I feel about these things. \n\n\nAnd that’s not to say I’m perfect either. I’ve caused plenty of problem for my family. So let me just skip to all my flaws now. \n\nWhen I was a kid like before I could even start kindergarten I was literally already sucking dick. My next door neighbor ( my brothers age at the time) used to make me do it to him and I used to agree because he was considerably nicer to me when I do would so. He was already a problem child too but that’s neither here nor there. I was pretty much only sucking him off because my brother always hated when I would hang out with him and his friends, and the neighbor always let me hang around (for obvious reasons) distinctly remember my brother catching us a few times but I guess nothing was ever done about it. Not even sure if my parents know about it. \n\nBut as an adult I can see that’s where I started getting fucked up. Idk if I necessarily blame my neighbor for me being gay, because I do firmly as a gay man believe that it’s just who you are and can’t be changed, but I feel like there will literally always be a part of me that questions it. Like what if I wasn’t sucking dick at five years old, would I be interested in girls? I remember having a crush on at least two different girls before i met (what I now as an adult realize was probably my first boy crush) like looking back on my child hood I vividly remember playing “doctor” with other kids or truth or dare that always ended sexual and I realize like damn. That’s fucking gross we were all kids. \n\n\nFast forward to me being in I think middle school, and I was caught sexually experimenting with my cousin. I was definitely old enough to know better so I take fault there, but I also wasn’t ever the one initiating it. You know. I was letting him suck me off for longer than I can remember honestly, but I also distinctly remember I wasn’t the one initiating it. I still remember the first night at his house when he asked me to go pornhub and grilling him about how he even knows about that. I don’t remember when I started letting him do stuff to me, but I know that I shouldn’t have. I remember well enough that when he would come sleepover there were times I would opt to stay up late with my father in hopes that he would fall asleep waiting for me to come in. I remember one time I was up late and he comes walking out like 2 hours after being put to bed because he was trying to get me to come in to bed with him. But again I was the older kid in that situation. So that’s my fuck up. Obviously when we got caught it put a wedge between that side of our family. I can see why, but in hindsight I always wonder. Would you have still distanced yourself if you knew it was your son who had been initiating it? Because he was younger all the blame was pushed onto me. And I can see why. Again I should have known better. \n\nThat’s probably around the time I started getting fat. By high school at one point I was over 300 pounds and openly gay. Never had a serious relationship. Never even had someone interested in a relationship with me. I can see why. Not only was I cringey in high school but I was literally disgusting. It wasn’t till about my senior year I finally got back under 300 pounds and started losing some weight and gaining some confidence. \n\nBut here’s the kicker. Before I started losing the weight I had become a literal serial catfisher. And I’m talking like anybody you wanted to see naked I would go out of my way to target. Friends, friends boyfriends. Nobody was off limits to me. It makes me sick thinking about the hundreds of people I’ve catfished because I was horny and lonely. Catfishing even basically got me kicked out of my college ( granted I was surprisingly innocent at that time but because the kid found out about me being a catfish he refused to believe it wasn’t me, despite me literally having to show my catfish accounts to the dean and them not matching up to whoever he was talking to. The college only realized their mistake a semester or two later because the kid was immediately put on academic probation the semester following my suspension, and then got caught trying to do the same thing to another gay student the semester after that. Which is when they were like wow we were wrong we’re so sorry don’t even worry about the requirements we gave you for coming back you can just come back never did though.) \n\nIt wasn’t only until I hit maybe 22 or 23 that it like clicked with how awful what I was doing was. And started making an active effort to stop it. And I feel like I was only even willing to because I fell in genuine love with somebody I was catfishing. When I finally told him, we were fine for a few days. He told me he didn’t care that I was a guy because he fell in love with the person behind a screen. But all of that quickly crumbled to ashes. That’s another one that’s my own fault. Not only was I doing something shitty but I was also in too deep. I think I still to this day get texted from somebody I started catfishing when I was about 15 or 16 that I just am too afraid to finally tell the truth to. \n\nBut since the recent heart break I’ve thankfully been able to almost entirely remove catfishing from life save for the one guy I was in too deep with, and the old catfish accounts that I occasionally log into when I’m desperately alone/horny/whatever it may be. \n\nI’m tired of feeling alone. I just want to be loved. I want someone to want me. To care about me.\n\nI’m starting to realize this world is awful. Almost every thing and everyone in it is bleak. Some people genuinely want to live long happy lives, me personally, I don’t think I can make it doing this shit for another 25 years. Self deprecating jokes and suicidal humor are my biggest weapons. Because I feel like if I don’t turn them into jokes. I’ll let them overcome me. Too many people in this world are awful. I don’t want to be one anymore. \n\n\nI doubt any of you will actually care enough to read this through. But if you for some unknown reason did, then I thank you. Because I could really use a friend. \n\n\n\nTLDR; I’m a scumbag. I’m starting to think my family is scumbags, and I’m genuinely losing my will to live. I’ve been holding on to grudges that are literally consuming me and transforming me into a being of hatred and it makes me sick to my stomach. I don’t know how much longer I can do this, but god I would absolutely love to just be taken out by a bus tomorrow.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hzaeyt/ive_bottled_everything_up_for_too_long_i_fear_im/", "title": "I’ve bottled everything up for too long. I fear I’m reaching the breaking point. Please, I’m begging for somebody anybody to make it through this massive wall of text because I desperately need someone.", "social_network": "reddit", "user": "SadPhish", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 18, "down_vote": 0, "creation": 1595922091, "permalink": "/r/SuicideWatch/comments/hzaeyt/ive_bottled_everything_up_for_too_long_i_fear_im/", "nsfw": false, "first_save": 1635427150.3276033, "replies_charged": false}