{"id": "t5_2qpzs_t3_p8ar3g", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "I'm 37 years old. Just lost the only reason I had to live. I go from feeling like a complete and utter failure and cringe with embarrassment and things I've done and people I've been in my life. I feel like an incompetent loser who doesn't deserve to live or at least wasted his life. But then I also feel like I've been wronged, and in some cases, I have been, and I want revenge, I want justice. So much so that I not only think about killing myself but I think about who I can take with me. I used to be a nice person, I think I was, could I have been lying to myself the whole time? No one loves me and most people seem repulsed by me. Although that's not even really true because I'm always home now, I don't like seeing people or going out, I'm just too embarrassed. I'm so tired. And the world has gone to hell, I don't know who the nice people are anymore, even the people I tend to politically agree with seem so fucking mean and judgemental. I don't know why I'm here. I guess I have nowhere else to go. \n\nI keep playing lottery tickets because it literally feels like it's my only hope. It's so fucking sad. I don't even know what to hope for anymore, there's no realistic chance for me. \n\nI think I'm trying to garner sympathy or something. I mean I should die. I clearly don't belong at least and feel only scorn from others. Why should wanting to die make anyone feel bad. I'm a complete fuck up. And then I go to violence again, there's no compassion in this world anyway, why should I go alone? No one is going to give a shit, I'm the same pariah either way", "url": "https://www.reddit.com/r/SuicideWatch/comments/p8ar3g/im_a_bad_person_and_a_loser/", "title": "I'm a bad person and a loser", "social_network": "reddit", "user": "Classic_Pollution993", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1629483301, "permalink": "/r/SuicideWatch/comments/p8ar3g/im_a_bad_person_and_a_loser/", "nsfw": false, "first_save": 1635423020.0936458, "replies_charged": false}