{"id": "t5_2qpzs_t3_qd9kzu", "request": ["4162f604-29a0-4041-a85b-c249e1ca13f8"], "text": "when the depression takes over, i forget who I am, I forget people love me. I think everyone is better off without me, I'm hurting people by existing and killing myself is a favour. I'm a leach, I'm no good I can't work, can't focus, I'm so delicate and sensitive, it's a dog eat dog world, I'm not meant to be here. I know that's not true. I'm in so much pain, but killing myself just spreads the pain to other people. I have neices, nephews, siblings, aunts n uncles, cousins, parents, friends who would all be sad if I died, some devestated. \n\nBut when I'm really, really depressed...really so hurt, suffering...it doesn't feel like people love me. I think, if you loved me, why would you let me suffer like this? Then everything feels fake. I feel like a puppet being used by everything and everyone around me. \"Why should I stay alive just for you??\" It becomes a bitterness. But it's only because I'm in so much pain, like I'm being held over a fire. I have to stay here, because if I don't people will be so hurt, so disappointed...but it hurts to stay here it Hurts! I wish you could understand how much it HURTS! \n\nI try to stay strong so that my pain doesn't spread to other people. \n\nBut life beats me down and I don't feel strong enough. \n\nIt's so strange being self aware of my affliction. I know this is depression. There are many things I love about life and I love, I LOVE my friends and family, but I'm on fire. I'm on fire, can't you see?? Please, don't call me selfish for wanting to put myself out. But I want to live! But I want the pain to stop!!! \n\nI'm suffering so much", "url": "https://www.reddit.com/r/SuicideWatch/comments/qd9kzu/depression_makes_you_lose_yourself/", "title": "Depression makes you lose yourself", "social_network": "reddit", "user": "sadboiproblems", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634878261, "permalink": "/r/SuicideWatch/comments/qd9kzu/depression_makes_you_lose_yourself/", "nsfw": false, "first_save": 1635422894.8443835, "replies_charged": false}