{"id": "t5_2qpzs_t3_p5ag2i", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "Is it selfish that I want to die out of laziness?\n\nI have dealt with passive suicidal ideation for years an years on end, but in recent time I can’t help but think “Would it be easier to just die?”\n\nThe more I look at and learn about the struggles of life, and the direction that world’s headed, the more I just dread life ahead of me, because I’m extremely lazy. I’m constantly shrouded in a constant cloak of dread and anxiety for the future, I have no idea what I’m doing.\n\n I want to end my life because I’m bored and because I’m lazy. It’s just “Ehh; why not cut it off here, I don’t really care.” And I’m scared of myself for those thoughts but it makes sense.\n\nMy nihilism and apathy towards practically every single aspect of life has dampened will to exist, I’m just lazy. Sometimes I just want to sleep and not wake up.\n\nThis has been going hand in hand with my desperation for love and companionship. I desperate want to find someone who is worth keeping myself alive over, but as all my friend groups have been disconnected and broken all over, there’s no one left.\n\nMy family has no bearing either. As much as I want to be connected to my family enough to gain the will to live, I just don’t get that. I’m disconnected from everyone.\n\nI just constantly want to die all the time out of sheer laziness and boredom, is that selfish? Just let the good times last then cut it off before I hit reality? The notion of going to sleep forever is extremely appealing to me.\n\nDespite all that, I know I won’t kill myself anytime soon. I’m a coward, I couldn’t do it. But due to my mental state I do know that if something bad happens and sends me over the edge, that’s when I’ll probably do it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p5ag2i/im_selfish/", "title": "I’m selfish", "social_network": "reddit", "user": "AGayFurryWeaboo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1629094955, "permalink": "/r/SuicideWatch/comments/p5ag2i/im_selfish/", "nsfw": false, "first_save": 1635427023.355687, "replies_charged": false}