{"id": "t5_2qpzs_t3_qh334b", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I'm just talking on here to vent and maybe hear feedback from like-minded individuals.\n\nI'm a 22m lucky enough to have a girlfriend right now who understands and is patient with me. Lately (last year or two) I've been going through intense episodes of internal discomfort and rage. I go through these almost daily and they completely interfere with my life (I remember not feeling as such most of my life).\n\nExample: Yesterday I was talking to a Walgreens representative after getting a call for a Pharmacy Tech Apprenticeship. Throughout all of the phone calls I had trouble breathing and just got so enraged for no reason even if I was calm on the outside. It seems like whenever I try to do something \"for my own benefit\" I get enraged and hopeless. I proceed to take a data entry assessment which spikes my anger and anxiety even though I did fine on it. This episode lasts for like eight hours after the fact\n\nI have been actively working on these issues for the last four years or so, which was around a time when they were more latent. Now it seems like they're getting worse, even though I've been putting in consistent effort to change myself. I know all of this information sounds vague I just don't know where to begin and I'm so exhausted.\n\nPsychiatric care was sought out by me back in Feb but my psychiatrist basically put me on Ritalin, and when it made me have massive mood swings, he pulled out an old dusty pamphlet and came to the conclusion I need to be on Strattera. Look that shit up and tell me if that should even be prescribed to a male anymore. Really look into that drug and tell me if it would help anyone with ADHD, let alone any other mental problem\n\nSorry for how vague this is again I'm just destroying my relationship with what little family I have, and I want to do my girlfriend justice by providing her with the life she deserves. I just don't understand how there can be so many self-set roadblocks in the way.\n\nI don't know what to do anymore but my mind and body just hurt so much. Nothing like being 22 and unable to take care of yourself, while also toiling away endlessly to what seems like no avail. I know a lot of people feel this way, but I've literally pulled out everything I've got over these last few years every single day and its gotten me nowhere.\n\nEvery single thing I do agitates me beyond belief 80% of the time and I no longer have the confidence or trust to try and set up more psychiatric care. Anyone else feeling similar?\n\nI also meditate actively and have for two years. It seems the more awareness I bring to myself, the worse off I am", "url": "https://www.reddit.com/r/SuicideWatch/comments/qh334b/why_is_everything_so_excruciating/", "title": "Why is everything so excruciating?", "social_network": "reddit", "user": "bigryanhater", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1635359044, "permalink": "/r/SuicideWatch/comments/qh334b/why_is_everything_so_excruciating/", "nsfw": false, "first_save": 1635427647.2157965, "replies_charged": false}