{"id": "t5_2qpzs_t3_poy0qn", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "I simply don’t have it in me to continue going. I’ve been suicidal but functional for quite some time but now I  just can’t take  it anymore.  For background info, I’ve suffered from depression and anxiety since my teenage years. I currently see a therapist and on medication but it doesn’t seem to be helping much. I’m a nightshift  RN with 3 kids and I’m BEYOND burnt out. The 12 hrs shifts, the constant stress, the insomnia, the patients, fucking Covid, I can’t stand it anymore. Also l, my 2yr old is non verbal and being evaluated for autism. He is in speech, OT, and development therapies during the week, to try to get him talking. So there’s the normal terrible twos on top of constant whining, watching for non verbal cue’s so he doesn’t get frustrated, planning and doing activities all day so he gets tired out by bedtime. Not to mention the clean up. It’s like I’m living with Taz the Tasmanian devil, he destroys everything. I can’t go to the bathroom without a mess being made somewhere. When he is finally in bed, I then have two other kids that need my help and attention. My whole life is taking care of people and I’m tired. Im so very tired. My husband shares in the responsibilities but even with his help I’m overwhelmed. I hate my life. I absolutely hate it. I wake up and I’m immediately ready to cry because my life is over yet. I have to wake up and do it all over again. I keep telling myself, my kids need me and I have to keep going but I’m slowly starting not to care anymore. I just want to die. I don’t know when I’ll do it but, it won’t be long though.", "url": "https://www.reddit.com/r/SuicideWatch/comments/poy0qn/waiting_for_the_end/", "title": "Waiting for the end", "social_network": "reddit", "user": "jessthedestructive", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1631736962, "permalink": "/r/SuicideWatch/comments/poy0qn/waiting_for_the_end/", "nsfw": false, "first_save": 1635426569.2267456, "replies_charged": false}