{"id": "t5_2qpzs_t3_ozubem", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d"], "text": "Hello everyone! This post is a story about one of the many reasons why I want to die. I must state, that right at this moment, I do not want to die, so if you are here to help the ones that really needs it, just pls do that, but I have this story I want to share, because it makes me feel like a failure, that should not exist. Also sorry, I am pretty bad at story telling, but here I go anyway.\n\nIt happened, around the time, when I was 17 yrs old (now I'm 23). I was waiting for my driving instructor, at a parking place in the city center. I usually arrived earlier, so I took a walk, in the nearby park. It was a sunny, silent, summer day, it was over all nice. Not many people were around. As I walked in the park, I heard someones...well struggling. It was a girl. She was trying to escape someone else. She didn't run, she walked, and her attacker just stayed close, and gropped her everywhere. I decided to follow them, because first I wasn't sure of what to think. From the distance, I couldn't hear what she said. As I followed them, She seemingly noticed me, because she stopped in a pretty open area, at the bottom of a statue. I got there, and now I see what is exactly going on. This guy just grabbed her everywhere where he can. It was a trully disgusting sight. I went after them with the intention, to help the girl, but now I was standing there, and this guy couldn't care less that someone is watching them. I stared right at them. I was in shock. \"how anyone could do this?\" I thought to myself, and I really wanted to help. But I wasn't able to move any closer. To this day, I can't explain it why. \n\nWe, the 3 of us stood there for like 5 minutes, then she decided to try again what didn't worked so far, and begun to walk again. And I stayed behind. \"Should I go affter them? what do I gonna do if I get there?\" By the time I was out of shock, they were pretty far, and I looked at my clock and it was time for me to get back to the parking place, where my driving instructor just arrived at the same time as I did.  \n\nI didn't even progress how big of a failure I were untill I went to the bed. The two of them, didn't seem to be older than 16. And I was deffenetly bigger, than the other guy, even tho he was also fat like me. I failed to protect someone. How am I suppose to be a man, if I can't even protect anyone? What would have happened if that girl was my sister, or someone else that I know? I have failed, not only being a man, but being a human. And yeah I should have called the police, only if I would have known their phone number. I were 130kg fat ,and 180cm high 17 yr old, and I failed at helping someone.\n\nI don't know how I could have been a bigger coward. I truly deserve to die, don't I?\n\nThank you if you've read it. And sorry for taking away from your time.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ozubem/i_am_a_failure/", "title": "I am a failure.", "social_network": "reddit", "user": "White_Ender", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 22, "down_vote": 0, "creation": 1628346700, "permalink": "/r/SuicideWatch/comments/ozubem/i_am_a_failure/", "nsfw": false, "first_save": 1635426943.1698194, "replies_charged": false}