{"id": "t5_2qpzs_t3_q1k7ha", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "Iv always had mental health and suicide attempts since I was 12 years old. Iv been inpatient 6 times as a teen to finally go to residential for 8 months. Iv always struggled with suicide and depression\nI am now 25 I have Panic disorder, PTSD, anorexia Nervosa, major depressive disorder, and generalized anxiety disorder.\nIv delt with depression suicide and anxiety since a young child.\nI am now a mother.\nI had y daughter at 20 years old and ever since she has kept me going her and my husband. I spent every ounce of my strength into raising my baby and taking care of the house and finances. \nI started using alcohol to cope with the stress.\nIt progressed over the last 3 years\nI got arrested a few nights ago because I got drunk and slapped my husband.\nThe police dragged me through the streets and bruised me from head to toe.\nMy husband left the house and says he only has hope if I stay sober for a long time a year he said.\nJust had a meeting with dcf and I can't be alone with my daughter I haven't seen her in days and iv taken care of her her whole life. She is my world and my life.\nIv been trying to get into rehab since I got arrested with no luck with insurance companies or open beds. Been calling nonstop all day and night every rehab in my state. I am no further than I was last week.\nToday having my daughter be told I can't be alone with her until I'm in treatment was the last straw for me.\nIv gotten beat up, my husband left, arrested, had my baby taken away all in a span of four days. Iv lost my life to alcohol. It's ruined everything. It's only fair it ends my life too.  All the hope I had the things that iv worked for and the people who I lived for are gone", "url": "https://www.reddit.com/r/SuicideWatch/comments/q1k7ha/had_my_life_ripped_apart_and_now_its_all_over/", "title": "Had my life ripped apart and now it's all over.", "social_network": "reddit", "user": "Screaming_Bear_320", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1633396848, "permalink": "/r/SuicideWatch/comments/q1k7ha/had_my_life_ripped_apart_and_now_its_all_over/", "nsfw": false, "first_save": 1635422255.338936, "replies_charged": false}