{"id": "t5_2qpzs_t3_d4wii6", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Sorry about this, it's long but I need to get the shit out there and off my chest. It kept me occupied long enough to at least get my mind out of the worst place.\n\nAlso I talk about abuse in here albeit in a condensed version so scroll to the bottom if that's something you don't want to risk bringing up memories of your own.\n\n\nIt's been a really long and fucked up journey to get to where I am today, and I feel like I have nothing to show for it anymore.\n\nMy father wanted nothing to do with me and left my mother when I was 6mo old. My now stepfather (who she got with a few months after) was about as bad of a match for her as possible.\n\nThey met at work. They're both federal correctional officers. You can imagine the level of constant stress I grew up with.\n\nEspecially when every single thing wrong with their lives (massive credit card debt, the stress of work, the fact that the two of them don't see eye to eye on literally anything and they piss each other off) they'd take out on me. It was ongoing  from the time I was 5 or 6  (basically shortly after my brother was born, an actual child that was both theirs) to the time I left their house at 18. The emotional and mental abuse and manipulation is still on going in ways to this day.\n\nBut the entire time there was filled with horrendous psychological abuse, some physical (although they both knew exactly how to hit without leaving bruises), and emotional. Plus just straight up purposeful neglect.\n\nWe're talking every other sentence degrading me in someway, reminding me how much they loathe my existence, how much money they waste on me (which wasn't a lot, I had to buy most of my things with money o got from family for birthdays, which they'd also confiscate most of), holding me in headlocks, arm locks, crushing me between their legs, backhanding me, throwing shit at me. Making me kneel on rice for hours as punishment for shit as stupid as \"breathing with an attitude\". Constantly breaking the things I bought myself, accusing me of doing things and then strip searching my room to verify I wasn't. You ever see a place after it was torn apart by people with a warrant? That, with every single thing in the room. Always took an entire day to clean up. Convieneintly always when I had plans.\n\nOne of their favorite things to do was to throw me out in the middle of a stormy day underdressed. I distinctly remember a day where it was 12° outside, a blizzard, and my mother threw me out the front door barefoot. I had breakaway basketball pants on (so the sides were basically just holes) with no shorts underneath, and a tanktop. She eventually threw a pair of holey shoes of mine at my head and the thinnest hoodie I owned and told me to get lost for the day. I walked around for six hours that day just to keep warm. Sometimes they wouldn't even let me back into the house and I'd have to sleep outside that night. Eventually I just started staying at my aunt's every time it happened.\n\nWhen I was 13 I started working odd jobs so I could consistently buy things I needed. Started with a paper route, they bitched about me having to get up every morning. Quit that, started mowing lawns in the neighborhood. Was good business, although they bitched about it not fitting into their schedule of me not being home. They also stole money constantly from me, usually in smallish amounts so I wouldn't notice. I used to keep track how much but gave up after a few years after it hit like $1500. \n\nThroughout all these years they'd constantly be fighting with each other which would always result in them harassing my little brother to take a side and trying to get him to stay in their bedroom with whoever claimed it that fight or leave with the other one for a while. I spent most of those fights (were talking three a week) trying my best to deescalate the situation. It was always fun when the firearms were brought out. You ever try to disarm intoxicated federal officers who are trained not to be disarmed? Oh, and the guns are their issued ones and have no safeties.\n\nI used to call my aunt and uncle up when shit got really bad, usually about three times a year. I remember the one time my stepfather went on a rampage with a sledgehammer, destroyed and entire freshly renovated room in the house and ran off I to the night. We called the cops that night and a few other times but \"professional courtesy\" made them let it slide.\n\nAnyway I eventually bought a car when I got a real job I had to drive to, but had to title it in their name as I was a minor still. Eventually bought a second one a few months later so I had something to drive in the winter. They loved using the fact of them being in their names as leverage, always threatened to call the cops and report it stolen if they were feeling like controlling me more.\n\n\nAnyway one time they did that I left my car in the parking lot at work and just stayed with a friend. Woke up to a full mailbox of nasty voicemails, ended up couch surfing for a week before my grandmother smoothed it out enough to go home. \n\nSix months later they did it again, two days after I turned eighteen. They told me I could stay out until midnight on weekends and 11pm during the week since I was an adult. I worked until 11pm every Fri-Sun. I wasn't allowed to make food after work those days, so I grabbed food on the way home. Got home at 11:37. We had code entry and they took the batteries out so I couldn't get in. They told me I was past my 11pm curfew (which I was at work at 11?) And told me to sleep in my car. It was -10° out as we were supposed to get like three feet of snow. I drove my car to my girlfriend's house and she gave me blankets to keep warm. They threatened to report the car stolen if I didn't bring it back. Eventually left it there and walked five blocks to my girlfriend's house and slept on her mom's couch. That led to me couch surfing the 5 of the last 8 weeks of my senior year of high school. CPS got involved but didn't really give a shit since I was 18 and about to graduate HS. HS principal told me I had to go home or I couldn't graduate.\n\nWent back, grandmother smoothed shit out enough again. Went to college in the fall (locally, as I had to go somewhere I could pay outright as they were not co-signing on anything). Moved out of their house as soon as I could swing it. \n\nMy best friend of 10+ years moved in with me to make it feasible for me. Her family was also kinda abusive so she was happy to get out. She bailed on me and the apartment a month in because she wasn't happy sitting around the apartment job hunting (she previously worked for her dad who fired her when she moved out). \n\nIt was the dead of winter. I had no money. My bank account was constantly <$5 after bills were paid. I kept the apt at 60° all winter to save money. I caught mono that winter. I almost died because I couldn't afford to see a doctor.\n\nMy situation at home eventually got better financially (even though I also totaled two vehicles with people hit and running me. Liability caused me to be at a total loss). I worked three jobs through school and graduated with honors with an engineering degree. I had a slew of high level internships that I worked my ass off to get. I had no student loan debt from working enough to pay it off every semester.\n\nAnd then magically: no one would hire me. For six months. Granted I still was working two jobs, but stocking shelves wasn't my life goals anymore. And oh yeah, speaking of that, I had a herniated disc for the last four years doing that job where I moved 10+ tons of product a day. Because again, no money for doctors.\n\nAnyway. Finally got a job at a local engineering firm, however not in my field. (I'm mechanical, they're civil). It's not even a job that requires an engineering degree, although I'm an engineer on paper. I hate my job, but at least it's something.\n\nAnyway I eventually got my back fixed with the money I made there. When I got back from disability leave my department ran out of work from the gas company who contracted us because they're going through a merger. That was six months ago. I've gotten paid probably three months of time to do absolutely nothing at work. It drains the soul.\n\nOn top of that I've been trying to move down south with my girlfriend (she's great and honestly helped me make it this far). She moved down three months ago for work, I had her take most of my stuff down with her so the move would be cheaper. I've been living in a barren apartment ever since.\n\nAnyway. I've been applying for jobs down there since I found out she'd be moving last December. Probably like 300-400 jobs at this point. I get auto rejected a lot by filters, probably because I'm out of state. I've had two interviews, both of which they were super excited about me and my qualifications just to be ghosted. No matter how I contact them, nothing.\n\n\nSo to sum it up. Currently, I'm getting really bad imposter syndrome because of no one hiring me. I feel like I must be a fraud and don't actually know anything because obviously if I did I'd be hired already. On top of that, my town is the poorest city in the state and the only pasttimes you can partake in here is bars, which growing up with alcoholic abusive parents makes me avoid them. So I stay inside my barren ass apartment. I've been going through the motions to pass time basically ever since life got super hectic senior year of college. Do whatever I have to that day, sleep.\n\nI haven't been an active participant in my life in two years, and it seems no one else is taking a particular interest in me either. Yeah, ik my girlfriend does but her being 1000 miles away makes it feel like it's not real.\n\nI guess it's just that I fought my entire life to get to a point where I could be this independent and actually make something of my life just to, I don't know, not actually live it and then not be able to find a job doing something I spent forever trying to do. Like I dealt with almost 24 years of hardships and downright abuse to what, sit around at a job I hate normally for 40+hrs a week, where I currently don't have work anyway right now, just to come home, do household shit and sleep? This is what I suffered and told myself \"you just have to make it to X thing\" for?\n\nI feel empty, barren, devoid of emotion except when my walls break down in private every so often and I cry for hours. Sometimes it happens at work and I hide in the bathroom until it passes. I absolutely hate my life and hate that I put up with so much shit throughout it just to end up here, broken and alone. I have nothing to show for it. \n\nI find it harder every day to keep on going. I almost ended it tonight, but I broke down so hard I couldn't move. But it'll happen soon at this rate. \n\nI'm not sure I'll make it to my 24th birthday anymore. I'm not even sure I'll make it to the end of this month. \n\nThe only thing I'm sure of is that I want this to end already.", "url": "https://www.reddit.com/r/SuicideWatch/comments/d4wii6/finding_it_hard_to_keep_on_going/", "title": "Finding it hard to keep on going", "social_network": "reddit", "user": "RecycledDumpsterFire", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1568613179, "permalink": "/r/SuicideWatch/comments/d4wii6/finding_it_hard_to_keep_on_going/", "nsfw": false, "first_save": 1635422332.8589826, "replies_charged": false}