{"id": "t5_2qpzs_t3_ovnnmq", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "A little context: I'm a 27 year old trans woman who's been in university for 8 years, my only break was a year after my first graduation where I tried (and failed desperately) to get a job in my field. I've known I was trans since I was 19, though had a feeling about it since I was 5, but still waited til this year to do anything cos I'm an indecisive fuck. I've attempted suicide twice, though only once was premeditated. I'm autistic so I don't know if I'll ever get work. I hate myself so much that I will exclaim it in a completely empty room, apropos of nothing.  \n\n\nFor the past 5 months, I've thought about suicide more and more. It's not an active choice, more like I'll be going about my business and feel the compulsive urge to jump in front of a train or out my second story window. When I walk across the street my brain screams \"hit me\" when I see a car. I frequently wonder what's stopping me from just downing all my medication at once. These thoughts used to be once a day, but now dominate my thinking so much I can't study or do these measly amount of writing I need to make cash. It's also getting harder to morally justify existing. I think about how much it takes for me to stay alive vs the deadendedness of my existence and feel unbelievably selfish. \n\nMy apologies for this post, I just needed to get it off my chest how bad I feel. I can't afford a therapist and don't need to stress out my friends. Thank you for reading.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ovnnmq/i_27f_keep_finding_my_thoughts_coming_back_to/", "title": "I (27F) keep finding my thoughts coming back to suicide", "social_network": "reddit", "user": "MtMihara", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1627801898, "permalink": "/r/SuicideWatch/comments/ovnnmq/i_27f_keep_finding_my_thoughts_coming_back_to/", "nsfw": false, "first_save": 1635426623.3841083, "replies_charged": false}