{"id": "t5_2qpzs_t3_pgaw2l", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "How do you stop suicidal idealation when therapy, coping skills, and calling the suicide hotlines constantly doesn't work? I've already attempted suicide 5 times in my life. Twice this past year. I get so frustrated when I survive. Last attempt I jumped off 70 ft bridge and somehow survived.  Yet, I still feel so desperate to die and cannot fathom or grasp how I actually survived the last one. I still think about attempting again constantly and there isn't enough therapy (I attend therapy religiously too) or coping skills in the world from stopping me to desperately want to die.\n\n I've called the suicide hot line so much, sometimes they recognize my voice even though I never disclose my name or personal info. I'm scared of myself. I'm scared I will attempt again and I don't know how-to stop these urges and thoughts. I have tried everything I feel like- i try to use therapy, meds, and coping skills but nothing eases the pain- I so desperately want to die.\n\n I had a severely traumatic childhood, traumatic adulthood and serious health problems that leave me in constant pain and illness. I'm so tired. I'm trying to hang on but that this point I feel all hope is lost.  I have no other options.  Despite therapy, coping skills, and medicine, I just want to be done already and am at a loss about what to do about it anymore.  I obsess over suicide. I drive myself insane with how bad I long for death", "url": "https://www.reddit.com/r/SuicideWatch/comments/pgaw2l/how_do_i_stop_suicidal_ideation_when_coping/", "title": "How do I stop suicidal ideation when coping skills etc aren't working", "social_network": "reddit", "user": "70ftTom", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1630557832, "permalink": "/r/SuicideWatch/comments/pgaw2l/how_do_i_stop_suicidal_ideation_when_coping/", "nsfw": false, "first_save": 1635427220.483532, "replies_charged": false}