{"id": "t5_2qpzs_t3_7uwvzq", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I don't really know how many times I'll pour out my life onto this subreddit. I just feel like doing it again, because I can't talk to my parents or friends, I can't deal with a psychiatrist or therapist, I just want to tell someone who can't throw me into a padded room. You can read my post history a bit, if you'd like.\n\nSo I have a weird philosophy, just like everything else it popped up sometime between mid-December and early January. It's like this, see. Everyone is born with a little crystal - true happiness. And those people, the normal ones, I mean, will always have it in their grasp. Despite how many times it is overshadowed by anger or fear or sadness it remains. And somewhere along the way, I dropped it down a sewer grate, or forgot about it entirely. I just don't have it. Without that, I have no motivations, nothing to focus on, no real desire to live - instinctual or not. At the same time, I'm not motivated to die, and don't think or feel but understand that it's... weird. Especially at 13. Oh. Yeah. I'm not even a 20/30 year old with horrific past or medical/physical condition. I'm 13. with caring parents - a working mother, a short-tempered father, but of no concern. Again. I don't have any innate feelings or anything. I don't know if I could say I love them. I'm incapable of it.\n\nEarlier I suggested you read my post history. Now let me say, really read it before you comment.\n\nPlease help me find my crystal.\n\nEDIT: Why do I patrol this subreddit. I dunno. I spend nights digging through it, listening to depressing musical soundtracks, sinking myself further into the ground.\n\nThe school dance was tonight. It was... an alternate to this. I guess. My friends enjoyed it. that's more important than me, considering my current state. I mean it was okay, until I sat down in a corner and 'he' was next to me (post history) before promptly walking out of sight and immediately disappearing.\n\nEDIT 2: I feel like I didn't make it clear... or maybe I did, and me repeating it is totally condescending, but what I was getting to is that I didn't post here out of a desire to live or because I was thinking of killing myself. I'm indifferent to it and saying \"people care\" or whatever isn't what I'm looking for. What I'm searching for is actual happiness, specifically without some oblong pill that makes me feel good - I'm not some robot, I don't have a USB slot labeled \"Happiness\" - Nobody does, it's not something that normal people have to do, or deal with, and if I'm not normal what's the point, I'm not religious but if God is all loving why do I exist? Ugh. I have a headache. I've gotten 5 hours of sleep this week. At least I can pretend to fit in with the outcasted, sad people from musicals.\n\nGoodnight.", "url": "https://www.reddit.com/r/SuicideWatch/comments/7uwvzq/hurt/", "title": "Hurt", "social_network": "reddit", "user": "sigilif", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1517628161, "permalink": "/r/SuicideWatch/comments/7uwvzq/hurt/", "nsfw": false, "first_save": 1635426274.2195883, "replies_charged": false}