{"id": "t5_2qpzs_t3_czihv3", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "Hello everyone.I've been feeling like absolute shit lately.\n\nThe thought of death by suicide has become incredibly attractive again.\n\nI'm 23, female, and I've already managed to completely fuck myself over, especially my body and my longterm health, but maybe just my life altogether.\n\nHere's what lead to this. Sorry that it's so long, but I need to tell someone, and there's no way to keep this short if I want to fully explain how it got to this point.\n\nI am transsexual, female-to-male. Or \"was\", depending on how you want to look at it. I am diagnosed with transsexualism in any case.\n\nI know \"trans\" is a controversial topic in itself, but **this isn**'t **about social justice or politics or anything of the sort**. This is just about my life and my horrendously bad decisions.\n\nI transitioned relatively young and relatively fast. I was 18 when I first  learned about the term transgender. I found it while googling if there was any way for a woman to get a mastectomy without having cancer. I wanted a flat chest, and I found sites about binders and transition. It all fit so perfectly. \"That's me...!\", I thought.\n\nI had always envied male bodies: muscles, a leaner physique, the active role in sex...And I had always been somewhat tomboyish and \"not girly\" in the way I  understood myself. I had no interest in becoming a mother, or like my mother. In fact I felt very alienated from that idea of \"womanhood\" as a whole.\n\nTo maybe better understand where I was coming from, let me tell you what kind of girl I was at the time: I had just restarted high-school, after wasting a year and a half of my life going in and out of eating disorder clinics. I had been anorexic and bulimic since I was 15, and while I wasn't underweight anymore at 18, my bulimia  was still absolutely rampant. I had always had huge issues with my  appearance and my body as a whole. I had a \"masculine\" face I got mocked for, and my eating disorder constantly in my head telling me to eat less and exercise more. I hated a lot of things about my appearance,  didn't feel like femininity fit me but felt \"ugly\" just being as I am, and was a mess when it came to self-image in general.\n\nI was also a closeted lesbian. That is another important detail. I was disgusted by myself though, only really seeing lesbians represented in pornography and having next to no irl lesbian friends I could talk to about any of it. To make things worse I only ever crushed on straight  girls and felt overall completely hopeless about love as a lesbian  woman.\n\nAnd then there was this guy I was \"friends\" with. One of my only friends left after my anorexia seriously impacted my social life. He was a couple years older and... Long story short, he liked to pretend I was his girlfriend despite us having constant arguments about me not being attracted to him that way. He never \"did\" anything. He didn't rape me. But emotionally and psychologically... He seriously manipulated me into so many things I wasn't comfortable with. Extremely long, uncomfortable hugs and cuddling (he would start to cry if I didn't), sleeping in my bed, telling me about his graphic sexual fantasies involving raping me, telling me how easy it would be because I'm \"weaker\" (telling me supposedly made him feel better about thinking about me that way. He called it having intrusive thoughts.)... No idea how I endured all of it with a smile, but I let him walk all over me because I was scared of being a \"bad friend\".\n\nThat's  where I was at when I first found out about transition. It fit together so nicely: My longtime envy of male bodies, my disgust over my own body  and my sexuality and being sexualized as a girl, my eating disorder, my  warped self-image, my fear of pregnancy, even my slightly more masculine face... everything. It's all because I am really a male inside! I thought. And becoming a guy was actually possible? That changed everything for me.\n\nSo I started binding my chest. A year later, I started therapy to figure out if transition was an option for me.\n\nBut by that point, I was already pretty far gone. A female friend of mine had come out as trans around the same time I first considered it. Without meaning to, we egged each other on by talking about it and about how we had always felt masculine and different, looking at information,  watching transitioned FTMs say how happy they were and show off how  masculine they now looked. In retrospect, it's so similar to  how my anorexia worked. The obsession with \"the before and the after\",  changing your body, even changing your name, becoming the \"real\" version of yourself, stripping yourself of all the bad you were before.\n\nI also had just started dating my (now ex)girlfriend. That was another mess and a half. She was bi, but had a boyfriend when we first met and got close. She had wanted to break up with him for some time as he was a  total jerk, and when she confessed her feelings for me I was overjoyed - I had fallen for her hard as well... Unfortunately, she changed her mind soon after, just a couple days after our first kiss, deciding she wanted to save the relationship with her boyfriend instead while keeping me as a best friend/quasi-girlfriend. A weekend with her boyfriend followed by hanging out with me after school, being all cuddly... that went on for months. It was just a mess and one of the worst times of my life.I was so heartbroken and fed up with... Myself. I felt unattractive, not good enough, like I couldn't even measure up to a guy who constantly guilt-tripped her into sex and made her cry.\n\nAll of it lead me to fantasize about changing who I am... A lot.\n\nHer boyfriend broke up with her months later, sick of the weird love triangle drama, and we officially got together then and I was happy of course, but it felt... Weird. Different. If her boyfriend hadn't broken up with her, what would have happened? She had always just told me to \"wait\" almost indefinitely. The whole time I had told myself not to wait around like an obedient dog and hope for her to \"pick me\"... and yet that's exactly what I did. I was very infatuated with her.\n\nOnce we were together, I constantly felt judged by everyone around us. A lot of people knew her ex boyfriend... Her whole friend group was essentially also his! I on the other hand was just some plain girl and never got properly introduced to them. Her mom wasn't too happy about us either. Being in a lesbian relationship was very much not what she had hoped for for her daughter and I felt uncomfortable whenever I visited. For example, she asked my then-girlfriend to keep taking birth control pills \"just in case she meets a man\".\n\nNeedless to say that was oil to the fire.\n\nAll of what I described just now are things I should have talked about in therapy. Even if I wasn't actually aware of how much they affected me on a subconscious level, which I definitely wasn't at the time - a good therapist would have made me figure it out, right?\n\nBut therapy was... Pointless.\n\nI live in a place where it is mandatory to have therapy before you can access hormones and surgery, which is a good thing, but the therapy I got was just completely pointless and superficial. While my therapist claimed he had experience with transsexualism, he really didn't know how to screen me for all my internal battles that influenced my decision... At all. We rarely talked about my sexuality, because I was so uncomfortable with it, especially talking to a man. We rarely talked about my relationship either. We never spoke about a lot  of things that I can say now really influenced me at the time.\n\nHe often just listened to me hate myself and my body. He was very focused on gender stereotypes in particular. And even though he knew I was bulimic, had obsessive compulsive tendencies (OCD) and had gone from being unsure about lifelong medication to constantly asking when I could start hormones in a matter of a few months, he diagnosed me and wrote me referrals for hormones and surgery about a year later.\n\nBy that point my friend group consisted of mostly other FTMs online. I was also \"out\" to my whole family and all my friends, and being from a small town, a lot of people I didn't  even know eventually recognized me as \"the local tranny\", especially at the gym and at school. Being out like that only made me want to transition faster. I felt like I had something to prove now - that I  could end up looking like any other man, that I wasn't just some delusional girl. I wanted to be male badly.\n\nI already \"passed as male\" most of the time anyway. I was athletic, had an androgynous face, naturally a small chest  and keeping my hair short usually did the \"trick\". And testosterone obviously pushed it to the next level. Friends and family were very happy for me. Telling me how \"brave\" I was for being who I am.\n\nI also applied for a name change that year, and got my breasts surgically removed by the end of it.\n\nMy parents, wanting to be supportive and progressive, completely supported me in all of it. I don't blame them, considering how obsessive I was, and how much they trusted the judgment of the therapist and doctors who  diagnosed me, approved my name change or prescribed me hormones. I don't know if they could have stopped me, but I wish they had sat me down and discussed the risks with me just once. But they didn't.\n\nThe more steps I took, the more obsessive I got.\n\nGetting my breasts removed made me more aware of all the other parts that were \"wrong\" and not male. My \"result\" from the mastectomy wasn't perfect either. It didn't look male, it looked like my chest just got deflated, on a  frame that was still short and obviously female, albeit masculinized.\n\nI got depressed and my feelings about my body got worse and worse. I still wasn't male yet and while I passed pretty much all the time, that just wasn't enough.\n\nMy relationship to my then-girlfriend deteriorated because of it as well. We had already been struggling at the time, after moving to different cities for college after graduating high school. Both of us felt very lonely and \"on our own\". As I became exceedingly disgusted by  the...lower half of my female body, my interest in being intimate decreased and I got scared of just the idea of sex - of being seen as a female by the person most important to me, which there was just no way around when I was naked. Looking back on it, it was so delusional and twisted - my then-girlfriend had met me as a girl and seen me naked many times, she was well aware I was female. I couldn't accept myself.\n\nI had also never addressed my issues with being a lesbian. They had only gotten worse, as now I was desperate to become a straight \"man\" and completely rejected being compared to lesbians. I remember my then-girlfriend telling me about something her therapist  had told her: that man and man or woman and woman would never be as close as man and woman... Referring to having sex in particular.\n\nShe was upset and so was I, but I still internalized it. I fully believed what he had said: That as a woman I could never measure up or be as good for my  girlfriend as a man could be. That sleeping with women as a woman would just be an imitation of something.\n\nBut living as a man while having a female body... It all felt like one giant imitation itself. Of coming close but never actually \\*being\\* it.\n\nEventually we broke up, still completely in love with each other. But I felt uneasy at the thought of being with women, seeing my own body as useless, and being completely depressed. I thought it'd be for the best to break up and remain friends. Keeping her trapped in an unhappy relationship with someone as depressed as me would have been unfair.\n\nIn the following months things just got worse, though I managed to seem happy and confident enough superficially that nobody seemed to notice.\n\nMore surgery. A revision on my chest. A hysterectomy and removal of my ovaries, just a month after the breakup. I cried in the hospital over it and yet I went ahead. I felt lonely and uneasy as I signed the forms and yet I went ahead. Nobody stopped to tell me that maybe it was a bad idea to do something so irreversible and so harmful to the body while being depressed and heartbroken.\n\nThe next year went by and my depression got worse and worse. I still felt horrible about my body and how female it looked, to the point that I only showered with the lights off. I compulsively exercised to build muscle. I still didn't feel like my body was male despite everything...\n\nBecause in reality it wasn't. How was getting organs and body parts removed supposed to make me feel like my  body was male, when they didn't actually give me anything male? I started looking into genital surgery, saw surgeons, put myself on a waiting list.\n\nBut then something changed. I can't really explain how or why.\n\nMaybe it was moving to a new city that changed my perspective.\n\nMaybe it was actually talking to people who were much more critical of transition and \"being trans\" as a whole.\n\nMaybe it was my ex girlfriend being in a new relationship with a man.\n\nBut over the course of 2018 I began to slowly realize what was going on with me.\n\nWhy I was still so unhappy.\n\nIt sounds cheesy as fuck, but it's like a lot of the suppressed memories came back all at once:\n\nBeing mocked for being gay, being an anxious and depressed teenage girl, being pressured into uncomfortable pseudoromantic/pseudosexual situations by my weird guy \"friend\", my relationship, how I felt about  liking women as a female... It all clicked. It felt horrible to realize but it all clicked.\n\nThe whole time I had fully believed I was just inherently trans. That's what doctors told me. What other trans people who fully related to how I felt about my body believed as well. Transition was supposedly the best way to treat this and yet I still didn't like my body most of the time and objectively I had only made myself more sick and dependent on medication.\n\nI cried a lot. Picked myself back up and then broke down and cried some more.\n\nIt has been about a year since realizing it now and on one hand, I have made progress. My eating disorder is under control for the first time in 8 years. My desire to be male no matter the cost has lessened. I understand myself much better than ever before.\n\nAnd yet I am planning to commit suicide.\n\nI don't think I can live with this. I think I went too far to live with this.\n\nKnowing that I gave myself all these health risks. Knowing I let myself get surgically castrated. Because of depression, because of trauma.\n\nI don't mind my masculinity or my deep voice. I don't even mind my flat  chest that much. I still call myself a guy sometimes because it feels comfortable. Maybe I could live looking like I do now if it was just about that.\n\nBut I mind being dependent on HRT forever, be it testosterone or estrogen, knowing that even that can't fully make up for what my body is missing now in terms of internal organs.\n\nI mind the knowledge of what happened and that I would have needed actual psychological help instead of... This?\n\nI mind knowing exactly what would have helped me now, and having no way to go back.\n\nI mind the trauma of surgery and everything that lead to where I am now. All the blind support, all the doctors, all the other suffering people...\n\nI am constantly stuck in nostalgia. It all happened not even that long ago!\n\nI had my surgeries around the time I was 20/turned 21. That's nothing. I'm just 23.\n\nHow am I supposed to live knowing I fucked myself up so much in such a short period of time?\n\nIt's too late now.\n\nIt feels like so many doors are closed. All the experiences I didn't make because I got stuck in this attempt to become  male... Even if I try to make up for it now, I'm stuck in this altered body that is a constant reminder of what happened. A body that is unhealthy and lacking organs it once had.\n\nMaking peace with this body is harder than it would have ever been when I was still completely naturally me.\n\nKnowing that I caused this myself is completely unbearable to me.\n\nEven if I lived with this body as it is now, and even if I continued to take testosterone and stuck to the path I chose, it wouldn't erase the memories and it wouldn't make it any less tragic, it wouldn't erase me knowing that I chose it out of trauma and depression.\n\nAnd it's not like I don't have things to look forward to. I do. But they're not enough to really keep me from planning when to kill myself in the near future. I just don't think I can live with this regret for much longer. I feel... messed up in so many ways.\n\nI keep thinking that maybe it'd be best to just call it quits here.\n\nI had a decent enough life, minus all the bullshit...\n\nThanks for reading this mess.", "url": "https://www.reddit.com/r/SuicideWatch/comments/czihv3/i_dont_know_how_to_let_go_of_regret_and_the_past/", "title": "I don't know how to let go of regret and the past without letting go of life itself. (transition/sex change regret)", "social_network": "reddit", "user": "femaleprince", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 27, "down_vote": 0, "creation": 1567589202, "permalink": "/r/SuicideWatch/comments/czihv3/i_dont_know_how_to_let_go_of_regret_and_the_past/", "nsfw": false, "first_save": 1635422945.736487, "replies_charged": false}