{"id": "t5_2qpzs_t3_o9gi4s", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "Needed to write the end somewhere so it may aswell be here..\n\nTo my Nan & Pop and my other Nan my Dad and my Daughter Savannah, I'm so sorry!\n\nI've tried for so long to be better and its clear I can't, I'm lazy and pathetic and clearly I have no motivation and no will I am so fucking sorry! \n\nMy internal pain to know I can't be any better for any of you hurts me so much. \n\nDad I kmow you said if I ever killed myself you'd shoot me.. Ironic really, im so sorry I just think of only this now. Its not that I even think of this its all I feel other than the guilt and remorse of not being able to do anything I cant accomplish anything I cant set a goal because I know I can't follow through with it.\n\nI'm so stupid \n\nTo my grandparents im sorry too I thank yous soo much for what you all did for me when I was abandond and I know what mum did will one day haunt her if she ever feels pain like normal people do im so sorry for what she did to all of us to yous and dad and Lachlan, Bailey and Jasmine! Im so sorry everyone sufferd!\n\nTo Jasmine R, you know how I feel you just always refused to acknowledge me because you think im always lying and you dont truly care about my feelings until its too late and maybe it iss now I would say I love you but I dont know if.i do anymore your always being so abusive and ignorant when I need you most.\n\nAnd im so sorry if anyone suffers more for me but its what I want and I just dont want you to mourn its no use when I cant cope myself just know if I do anything it was to finally help myself pain is just too much.\n\nSavannah, I know its been years since I seen you, I was and still am scared, I dont know what excuse I can give wich is also ironic as apparently thats all im full of is excuses.\n\nI really wish things between your mum and I could have been different but she had other intentions, the last thing I wanted was to lose my only child like my father did when I was born, and you lost a father and GOD I WISH things could have been different but god has plans I suppose, even tho I dont belive in him maybe I should have, even a glimmer of hope may have been able to keep me together!\n\nSavannah I dont have a right to call you my baby girl or daughter as I haven't been there for you and even tho you're MY DAUGHTER its clear I dont deserve you because I didnt try hard enough!\n\nSavannah I hope you grow to understand I am truly sorry some day I wish I could have met you again! Maybe in another life, I hope you grow youthful and strong and brave, dont let anything get in your way! I wish I was strong and had will!\n\nI know it sounds rich coming from me but baby girl im so sorry!\n\nAnd to Emily, I could write 5 books as to why my time with you was the greatest time of my life, nothing made me happier, noone made me happier and I was an absolute train wreck I thank you for the time and the lessons you taught me noone else will ever engrave their memory into my heart deeper than your smile, your eyes, your figure, your voice your adorable cheeks and your aura, the angels in heaven would cry at the sight of your beautiful heart! \n\nI cant begin to say how sorry I was how mich I wish things went differently but you are engaged and have a family now and I wish and pray for the best for you I and your Fiance and your new family!\n\nMay god bless you and tge ones you love, may god warch over you and pray as I do as I ask for hulis forgiveness. \n\nI unfortunately just cant say anymore its whats best probably to accept..\n\nTo Mum (Rachael), thanks for being there for any of us! (Insert sarcasm and anger here)\n\nMy family and Emily my daughter Savannah im so sorry\n\nI love you Savannah, Michael, Jill, Ellen, Louis, Lachlan, Bailey and.. Emily Gorman. \n\nJust know, years passed and nightmares never left every day i woke up with you in my head its been endless torture and I haven't found a way to rid of my horrible nightmares.\n\nBradley McKellar. Signing Off. \n\nGod Forgive and Bless Everyone I Name.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o9gi4s/im_sorry/", "title": "I'm sorry", "social_network": "reddit", "user": "McKellar-47", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1624871276, "permalink": "/r/SuicideWatch/comments/o9gi4s/im_sorry/", "nsfw": false, "first_save": 1635426790.3022707, "replies_charged": false}