{"id": "t5_2qpzs_t3_9rshh9", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "Despite a pretty phenom life in a few regards... I feel so fucking trapped in the confines of my body and mind. I constantly obsess over my physical abnormalities (ie Im a 27 y/o 6 foot dude with size 7.5 feet, small hands, boyish features... havent had the privelage of bcoming a man.. just a perma teen). On the inside i feel like a trex with stupid useless hands/arms that an't reach what I'm trying to touch. But the debilitations of the useless hands has dampened my spirit and I often struggle to feel the will to even take life on with ferocity anymore. I fried my brain with drugs when I was younger and despite my talents, abilities and streaks of intelligence... everything feels short wired and fleeting in every instance of my strengths surfacing. I have undiagnosed mental illness and I'm nearing the point where I think I should be seeing someone (but my bouts of sypmptoms clear up cyclically and I go back and forth unsure if I have issues or not). I have 90 percent of the symptoms of BPD, have associated lingering PTSD, I trigger into obsessive thoughts I can't control (scenario dependent) and these things are starting to cripple me. Except when they aren't, sometimes I feel great. But I'm reminded of the aspects of myself I wish I could run tf away from on a nearly daily basis. My interpersonal skills are so inconsistent and for the most part life has served me an endless array of incompatibility. To make matters worse these realizations are occuring after years of amazing opportunity (ie employment at a heli ski lodge, fishing lodges, ski towns). I was in the midst of peak young adult living being pushed toward reclusion. So it's almost as though I had the potential to make it all work out but instead I had to retreat because I dont hav the life skills to succeed in the world that I thought was \"the dream\".\n\n&#x200B;\n\nNow I can't get away from myself. I'm forced to continue operating as a person I don't want to be (and as the perso I made myself, which includes self sabotage through drugs, because at one point I thought the things I was doing would work out) and don't want to bring it to the world. I would love to live and be happy and engage with what's around me. But the tools I have to do that are so squandered and compromised that I progressively find myself thinking about suicide more and more. Just a blank faced empty stared \"I'd rather not be doing this\" vibe. I'm convinced I low key ruined my life and anything within my reach still doesn't feel right. I'd rather disassociate half the time until even that doesnt work and I just want out of it all. I feel ill fitted for everything and am definitely a misfit. Just like a weird artsy alternative person that has no direction or purpose or relationships that mean anything. I've never had a gf and have hardly been laid.... bettering myself seems pointless because my potential feels so inhibited because the things I want to change can't be changed. A handful of times a month I just want to smash my head into a wall and/or imagine killing myself as a means of relief. This is freaking me out because it's making me weirder and alienating me more than I already am. \n\n&#x200B;\n\nNobody knows this is how i feel.", "url": "https://www.reddit.com/r/SuicideWatch/comments/9rshh9/hear_me_out/", "title": "Hear me out?", "social_network": "reddit", "user": "splitdecision23", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1540624984, "permalink": "/r/SuicideWatch/comments/9rshh9/hear_me_out/", "nsfw": false, "first_save": 1635426467.4719782, "replies_charged": false}