{"id": "t5_2qpzs_t3_mktd4m", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "Im fat, ugly, bummy, stinky, nasty, i love beating off to things people would find sick and wrong, im quiet, im a push over, im weak, im not a people person, every where i go i bring an aura of  people looking at me like \"I want to do something to this guy but things are going good in my life and if i do something to him, im going to ruin what i have so im send subliminal shots and indirect shots at him\". Im ready to leave this body and never come back in it. I of course hate myself but i hate people the most. I always take the high road because if i followed through with my thoughts, it would be real life GTA klling everyone that is in my path until im \"WASTED\". You would think if you have nothing to lose and don't bother anyone, people will not bother you or try to make things worse for you. I say to myself if anyone idc about your gender bothers me to the point i snap, you deserved it in my eyes. I wont care if im wrong', i wont care if you play victim. I purposely burned bridges with the family i hated after my grandma passed. My name is Parish. And i have nothing else so if anyone feel the need to take it there with me even though you have things going for you, make sur3 its worth it. I ll never change because i dont want to change while in this body. Im through with this flesh. Certain things you do in this world CANNOT be forgiven. Especially if you are everything i just mentioned. F you Clinton Jones idc if u lived or dii eed. Everyone else 🖕but you in particular freemason Clinton Jones i ll sacrifice you to come up in this world.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mktd4m/my_flaws_my_truth_an_abomination_upon_the_earth/", "title": "My flaws. My truth. An abomination upon the earth. And a huge warning to everyone and the universe. Im not going to go on a rant of how bad i want to leave this body, im just going to put everything on the table.", "social_network": "reddit", "user": "spitinmyface67", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1617652603, "permalink": "/r/SuicideWatch/comments/mktd4m/my_flaws_my_truth_an_abomination_upon_the_earth/", "nsfw": false, "first_save": 1635428249.2021945, "replies_charged": false}