{"id": "t5_2qpzs_t3_qgr16d", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "So I did the stupid thing and went thru my bfs phone while he was asleep. Now before anyone tells me that this was stupid and that I am crazy, I will say you are right. However, he hasn't looked or touched my sexually in over a month. At first I thought it was the mourning for the cats. We lost two cats within a few weeks of each other. I knew that by going thru his phone that I would potentially make me worse mentally. But I just had to know if he was starting to talk to others in trying to get out of this relationship. He had some things pulled up. Adult content stuff. Now mind you, he recently told me that I was starting \"to get too fat for his taste\" knowing darn well that I have been having **SEVERE** issues with my weight and how I view that weight on me. I stayed up pretty late tonight. (Still am, tbh) They were skinny adult models. I honestly just feel numb right now. I relapsed on my self harm. I honestly had more graphic ideas about how to do this. I will spare them. \n\nI honestly don't know if it is the relationship that I can't live like anymore or my own actual life. I have been constantly loosing weight (4lbs in two days; mostly water) and I have been better about keeping things clean around the house and making food. Even got two jobs (because I wanted to, not because he made me). I feel like I want to die, but I know I could never do this to him. I love him so much, and I have literally dropped everything I was doing to help his dying relative because I love him so much. But honestly I don't feel like I am getting it back. I feel alone, and I am beyond depressed. I feel like I have no one in my personal life that I can call and talk to anymore. Mainly because that person for me has died. I almost went to an anon chat just to vent, but I know that isn't going to help. And it is almost 2am rn and I don't want to wake him up for he has work in the morning. \n\nI would keep going, but it is getting too long.\n\n&#x200B;\n\n**TL;DR** \\- I don't know if I am feeling like I can't keep living either in my relationship or this life. S.O. has made it clear I am too fat for his liking anymore, and I just don't really have anyone in my life to actually want to stay besides him (about 85% of the time.) Please help\n\nI will respond in the next 24hours. I don't know when due to a shared computer. I am honestly just going to try to sleep again. It is kind of hard to lay next to him and not cry my eyes out. After everything I have given up in this relationship...", "url": "https://www.reddit.com/r/SuicideWatch/comments/qgr16d/i_dont_know_how_much_longer_i_can_keep_living/", "title": "I don't know how much longer I can keep living like this", "social_network": "reddit", "user": "patchway247", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635319518, "permalink": "/r/SuicideWatch/comments/qgr16d/i_dont_know_how_much_longer_i_can_keep_living/", "nsfw": false, "first_save": 1635426726.0107224, "replies_charged": false}