{"id": "t5_2qpzs_t3_br4g1x", "request": ["8c1ff307-4217-4f27-b25f-fe2a745f5ef0"], "text": "Have you ever heard the saying: “People don’t have beliefs; beliefs have people.” The reasoning behind it is that the longest people live is like 120 years tops, and yet beliefs can continue for millennia. In the case of martyrdom, a belief has its grip so strongly on a person that they are willing to die for it. In that case in point, the belief drove a person to die, and other (generally more numerous than before) people are then gripped by the belief.\n\nI am being had by the belief that oblivion is preferable to continued life.\n\nHave you ever woken up from a dream and found yourself exhausted, wishing you hadn’t dreamt the night before? Have you ever woken up from a dreamless sleep and wish you had dreamed? In my case, I have many times felt more tired after a night of intense dreaming than a dreamless slumber. Countless times I have wished to not have dreamt even if the dreams themselves were pleasant, and not once have I woken after a dreamless night wishing that instead I had dreamt. I liken my ongoing suffering of life to a similar experience.\n\nLife can be good. It can also be very, very bad. Whether it is good or bad, there is one thing that is constant: effort. Currently, I have been scraping by on the borrowed strength of guilt at considering how my family, especially my mother, would react to my passing (not to mention suicide). And it works for now, but this is no way to live out one’s days.\n\nNext week I visit San Francisco for the first time. I’m excited to see and walk out on the Golden Gate Bridge. The solemnity of places like that have always touched me in a way I can’t fully describe. And when I’m out there on that bridge, on a place where so many finally had the gumption, facing the long walk back to a safe albeit exhausting life on one side, and the call of an endless dreamless rest on the other... it’s hard for me to guess in the moment which path I will choose.", "url": "https://www.reddit.com/r/SuicideWatch/comments/br4g1x/im_being_had_by_a_belief/", "title": "I’m being had by a belief", "social_network": "reddit", "user": "hot_and_crizzly", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1558403444, "permalink": "/r/SuicideWatch/comments/br4g1x/im_being_had_by_a_belief/", "nsfw": false, "first_save": 1635427481.1825004, "replies_charged": false}