{"id": "t5_2qpzs_t3_oonooj", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "I don't know what to do. This place I live in is a shithole. It's noisy. It's too warm. Dumbasses I live with won't do any of the following:\n\n\\- Install AC\n\n\\- Clean up their own mess\n\n\\- Won't repair the freezer draws, which all have that crappy flimsy broken front with a handle\n\n\\- Don't get another fridge freezer (which we really need for a house of five. Or just a big fridge and a big freezer). \n\n\\- People won't get out of my way despite knowing I have social anxiety and I don't want to be seen by anyone.\n\n\\- Live with an arrogant sexist asshole who is responsible for not cleaning up their own mess, 95% of the time. \n\n\\- Because most people are upstairs, the bathroom is quite frequently in use. Sometimes people take longer than they should. 5 minutes at most for a dump. 10-15 minutes for a bath or shower. Those are the most time they should take. But they take twice as long. Nothing to do with age. It's just incompetence or not knowing when to give up (Like I do when I lay logs and can't) \n\n&#x200B;\n\nI was cutting veg earlier, to have for lunch. I strongly considered ending it there and then. It's so despair enducing being around these people and in this shitty house. I just want a small, bungalo house to myself, and probably someone else, has to be a vegan animal rights activist, and a friend with benefits at the same time, and honest. Otherwise I wouldn't be able to tolerate them. \n\nOn top of that though, I have many issues. Cutiephilia, anxiety, autism, learning difficulties, PTSD, overweight, sensory issues, inability to read, overthinking, invasive thoughts, masturbation addiction, caffeine sensitivity. There's probably a whole lot more. \n\nA lot of this has made me question the illusion of hope. So far, I'm coming to embrace despair instead. There's no hope for an asshole like me. I try to do good, I try to help others. But that must always be outweighed by an equal bad. Why not feed two birds with one scone and end my life?", "url": "https://www.reddit.com/r/SuicideWatch/comments/oonooj/coming_dangerously_close_to_ending_it_because_of/", "title": "Coming dangerously close to ending it because of stress", "social_network": "reddit", "user": "_EeveeonE", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1626865664, "permalink": "/r/SuicideWatch/comments/oonooj/coming_dangerously_close_to_ending_it_because_of/", "nsfw": false, "first_save": 1635425515.678377, "replies_charged": false}