{"id": "t5_2qpzs_t3_ddio73", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I have been in the deepest darkest depressive episode I have ever been in during my mostly miserable 30 years of life on this fallen earth and I have been stuck in this abject pit of despair and misery for over a year and a half. After the death of two serious long-term romantic relationships and relapsing deeply into crystal methamphetamine addiction, severe alcoholism, self-mutilation and other impulsive self-destructive behaviors it is safe to say I am a total fucking mess. I'm hopeless as hell and I feel more alone than ever while I struggle and suffer through this dreary slow-motion torture that is my dreadful, sad existence. This is the most bleak period of my life I have ever had the grim misfortune of getting spiritually raped and mentally destroyed by. I feel so completely and utterly crushed and defeated by the horrible brutality of this fucking awful world. My life is in the toilet. I'm totally despondent and drained of all energy and vitality. It seems impossible to see any silver lining to this endless suffering. I cannot see any light at the end of the tunnel. Only an oppressive pitch-black darkness that extends far past the bleak horizon. I've lost the will to live.  \n\n\nI obsess and fixate over my own death. Fantasizing about the end of my suffering. Lying in bed staring at the shadows on the ceiling I imagine my own suicide over and over again. Killing myself in various creative ways. I decide on my suicide method-Shotgun blast to the brain. I always kind of knew shit would end this way.  I obsess over every small detail of the morbid plan to insure maximum efficiency when the time comes to pull the trigger. I do internet research on how to angle the gun with the barrel placed in my mouth to target and destroy the brain-stem causing an almost instantaneous and nearly painless death. I mentally begin working on the content of my suicide note. I feel guilty about the pain my self-inflicted death will cause my friends and family. I imagine my own funeral and wonder about the few people who might shed a tear or two about my demise. I imagine a small number of people would be sad about my death for a short time but they would get over it and move on with their lives and I would be mostly forgotten after a short while. I will die in winter and my corpse will be covered in falling snow. I eagerly await the icy cold embrace of the soil below.   \n\n\nI spend at least two hours every single night reading posts on this subreddit because this is the only place I don't feel so completely alone in my misery. You lovely melancholic comrades of mine wander in the bitter gloom just as I do. We are all lost and bleeding as we wander through this eternal night of dread as we desperately seek sanctuary in vain. You tragic suicidal strangers on the internet are the only people I can even begin to identify with and relate to anymore. The extreme desperation and hopeless sadness in your posts is so potent and overwhelming it causes a physical, visceral reaction in me of intense empathy for your pain and suffering. Being able to feel that heartbreaking sympathy and compassion for my fellow depressive suicidal people on this forum makes me feel a little bit better sometimes. The fact that I can feel that type of pity and sadness for other people. That the sadness and despair of others suffering with metal illness can bring tears to my eyes and a knot to my throat. Makes me feel like maybe my soul isn't %100 dead and gone.   \n\n\nI wish so badly I could take away the pain for you guys or at least ease your tremendous burdens a little. I wish I could rescue you from drowning in this raging black ocean of despair that drags us both deep down below the dark heavy waves of the vicious undertow. Sadly though I am weak and powerless in this cruel world and I'm seriously beginning to doubt if I can even manage to save myself from an early grave.  \n\nI truly am in a World of Shit. Fuck.....", "url": "https://www.reddit.com/r/SuicideWatch/comments/ddio73/it_seems_we_are_all_in_a_world_of_shit_my_friends/", "title": "It seems we are all in a World of Shit my friends. I'm sorry for your pain. None of us deserve this goddamn suffering.", "social_network": "reddit", "user": "MisanthropicLycan", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1570250598, "permalink": "/r/SuicideWatch/comments/ddio73/it_seems_we_are_all_in_a_world_of_shit_my_friends/", "nsfw": false, "first_save": 1635426236.3612163, "replies_charged": false}