{"id": "t5_2qpzs_t3_q6jgud", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "I was programmed for years as a child by a ritualistic cult. \n\nI was given a date to leave this earth and fulfill my purpose. \n\nI knew it was the 51st week of my 37th year. \n\nI have disassociative identity disorder. Some of my alters were not created organically by me. They were created by programmers. \n\nI was given the exact date, maybe a year ago. I felt like I had a lot of time to heal and get this horrible programming out of my head. Don't get me wrong, I do not want to be here. And I don't want to listen to them. But programming is a part of your subconscious... and it runs deep. \n\nI'm supposed to kill myself December 21, 2021.\n\nAt this point, everything they said would happen in my life has. This year. They told me that I would suffer more than ever. And lose things I never imagined possible. \n\nBig check on that one. \n\nThey told me that my life would become heavy with male energy. But not like a hot boyfriend. It is energy that is part of the rituals that we're done, and is linked to my ultimate purpose... according to them. \n\nAlso check. \n\nThey told me everything I love would leave in one way or another. It is happening... and I am also realizing that there is so much I mixed up and that the love of some of the most important people in my life has been gone a long time. \n\nI know this sounds nuts. I have to tell myself it is all the time. It is so deeply embedded in me. And as that date gets closer... other programming created alters have emerged to influence me to follow the plan. \n\nI find so much relief in the idea of being gone. But what they say I am... what waits for me in the afterlife... it seemed so amazing. But it's not. \n\nI would be reunite with my abuser. Who has been dead for 6 years. He ruined my life and robbed me of the ability to be a human. I am not normal or ok after years and years of therapy. \n\nYet, I love him. And there is so much bullshit in my head about him. I was on the path of literally removing him from my soul, when my therapist told me she was terminating our work together. The work stopped. It has taken 6 months to find someone who will take my case. \n\nA man. I have no desire to work with him. And also no other choices without making huge changes. \n\nNo one, therapeutically takes this seriously. My soon to be ex therapist called it psychosis. It's programming. But she isn't educated in this crap.\n\nI am feeling like it doesn't matter when I end my time here in earth. I will end up where they said. And I don't want that. But it is starting to feel like the lesser of evils.  \n\nMy life is a disaster. \n\nI feel like the programming is going to override me. And I will leave on December 21st. I don't want anyone in my life to know I'm considering competing this insane prophecy. And... it freaks me out. But nothing could be as awful as my current level of suffering. \n\nI have no idea what I'm going to do. But I'm pretty pissed, after years of being pretty sure I would die by my own doing... that I could be locked into this afterlife plan...\n\nYeah I sound crazy af. I'm actually not... I'm very aware of how crazy it sounds. And, unless you've experienced ritualistic programming... you can't possibly understand it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q6jgud/i_was_given_a_die_date_i_didnt_realize_how_close/", "title": "I was given a die date. I didn't realize how close it is...", "social_network": "reddit", "user": "Spades4DuecesWild", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1634035886, "permalink": "/r/SuicideWatch/comments/q6jgud/i_was_given_a_die_date_i_didnt_realize_how_close/", "nsfw": false, "first_save": 1635425189.9352663, "replies_charged": false}