{"id": "t5_2qpzs_t3_k45kja", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "edit: thank y'all for commenting! if you feel the way i do, i'm genuinely sorry because it fucking sucks, but i hope you can get therapy/whatever else you think would ease your problems. i'm going to look into bpd and bipolar disorder more, hopefully i'll be able to get some help (guess what mood i'm in lmao).\n\ni can go from \"there's no point in living\" to \"i am worthy of love no matter what\" (and the other way around) in a matter of seconds, and it's honestly making me so fucking tired i don't know what to do anymore. i never know whether i'm gonna feel like shit or like a god. i never know whether or not i'm going to try to attempt suicide. it's always the smallest things that flip the switch - i feel happy, my mom shouts something across the room and it makes me go into a depressive state so deep i want to get hit by a car (and that state can last either days or minutes, but when it's happening, EVERYTHING feels bad). then, something flips the switch and i go into some kind of manic episode, where i feel like i can do the unachievable. there's also the \"neutral\" mood (on-and-off, too), where i just chill, and i feel like i'm my true self, who's just enjoying being a teenager, but that doesn't last more than a few days, either. there's periods of time i spend daydreaming, or hyperobsessing about something (like a tv show - i love it to the point i plan my whole life around it), or just being depressed. my relationships are like moodswings, too - i either completly idealize them or loathe them, which makes it extremely hard for me to make friends.\n\nit's all just so... tiring. i wanna be in that neutral state all the time, and i feel like i'm being delusional, because even though now i feel like, shit, in some time - whether it be minutes or days - this will change to something completely different.", "url": "https://www.reddit.com/r/SuicideWatch/comments/k45kja/my_mood_swings_are_so_fucking_annoying/", "title": "my mood swings are so fucking annoying", "social_network": "reddit", "user": "ave_tte", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 62, "down_vote": 0, "creation": 1606771313, "permalink": "/r/SuicideWatch/comments/k45kja/my_mood_swings_are_so_fucking_annoying/", "nsfw": false, "first_save": 1635427627.1700125, "replies_charged": false}