{"id": "t5_2qpzs_t3_ouh230", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "I don't even know where to begin.\n\nI'm so unhealthy in mind, body and spirit that I feel so trapped. Even the most basic things like hygiene have been a problem for so long that they stress me out to say nothing of having a job and having long term plans. I just subsist here relying on people who now hate my presence and tell me so everyday. I hate my dependency, but I don't know how to handle things myself.\n\nOn top of not being able to handle my own life, I cannot stop thinking about the world. I cannot stop thinking about all the hatred, ignorance and power-tripping involved in the operation of the world. We're killing the planet and no one is actually doing anything substantial to stop it. The concept of truth and the foundations of knowledge have been eroded to the point where everything has become this Nietzschean competition to be or not to be on the basis of your very own rules.\n\nAnd I cannot make my own rules/meaning/goals. How can you strive for any dreams when your \"nose\" for happiness is gone? How do you move towards anything at all and commit to anything when everything normal and necessary in this world wears you out to the point of wanting to leave after five seconds?\n\n One day just slips into the next. I pass the time with passive activities and never leave the house. All my efforts to be employed have involved me quitting due to the stress of not being able to handle normal life. And I hate myself for it. I hate myself for my weakness. I hate myself because people taught me to hate myself. \n\nI lost my will to live over the last ten years. My self-respect is gone and there's not any fertile part of my being in which something like self-compassion can grow. People die for lack of love; you can wither from hating yourself. I've withered through my 20s and now my 30s are here for me to shrivel out of existence in. Will it be my liver or my heart that goes from my unhealthiness? \n\nNo, I just want things to be quick now. I've cut myself off from people. My family is sick of me, even the supportive ones don't know what to do. I don't blame them. Therapy doesn't help. Drugs don't help. You need something to keep going, to push back against all the grayness in the world.\n\nI don't have a part of me that wants to push back. I just want to be like dust in the wind or an echo that fades or a memory which becomes unremembered. \n\nI hate myself. I hate this world.Why do I have to hold on? I can't hold on for others. And looking at this planet, what good is there being alive when you're just fodder for a destructive cancer of unchecked economic activity? What's the point of making compassionate suicide so hard. \n\nIt's not like something acute happened. I became an adult and I've failed. I want out. I want a mutual divorce from this life without having to pretend superficially in hope. I can't believe in hope. Hope doesn't take root in me.\n\nI want to let go. I just want there to be an easy way to let go and be done with all of it. All the failure. All the health and mental problems. All the feelings of stress and shame swelling up in my body and forming the background state of my existence. I can't take this anymore. \n\nOther people can have the space, resources and energy I take up with my continued existence. This is a party I didn't plan and it's not one I want to stay at just for the sake of the thing itself. As for me, I just don't care. I never really did. And I don't know how to care or to learn to care.\n\nNothing gets my jazzed. Nothing gets me through. I can barely focus on an activity and don't get anything out of things emotionally or \"motivationally\". Lots of this is because I don't try hard enough (or is this my parent's talking in me?).\n\nIt's all been stuck deep into me that I don't deserve to be happy and that I make myself unhappy. If I make myself un-happy and can't change, then why not unmake myself. Continuing just seems like a lost cause which will bring down most of all the more loving and supportive people in my life until they hate me just as much as my parents. Call this an apoptosis of the individual human as opposed to a cell; I know I am dysfunctional so this is the process of limiting my effect on everything through self-destruction.\n\nThat's it. That's all I want to say. Life goes on and on too long for someone like me. I'm happy that other people find meaning here and can grow and can put aside the things they cannot control to \"keep on keeping on\" and otherwise find the joy in things. I just don't. Nothing has helped, and I always destroy any tiny bit of progress I can make for myself in the space of three weeks by falling back into terrible habits for spans of months to years.\n\nI'm tired people. I'm so tired of having so little to show for myself, no ideas on how to mange to get to get my shit together and no energy to change. I mean fuck, I'm even a waste of the mental health field's time.... that's how I feel.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ouh230/i_am_so_done_with_my_useless_life/", "title": "I am so done with my useless life.", "social_network": "reddit", "user": "MentalHealthAlt1", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1627635754, "permalink": "/r/SuicideWatch/comments/ouh230/i_am_so_done_with_my_useless_life/", "nsfw": false, "first_save": 1635423034.3819113, "replies_charged": false}