{"id": "t5_2qpzs_t3_jxl25d", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "For me at least, my depression and suicidal thoughts takes the form that blocks off all base motivation, meaning, even if I want to get better, I can't by trying harder. What's worse, is I am behind in schoolwork because the suicidal thoughts and depression make it impossible to get schoolwork done. But I am supposed to take more breaks and shut off my brain. But to do that I need to get more behind in school work. It's so fucking hard.\n\nI hate to say this, but this dilemma literally gives me no way out. I do not know what to do. Trying harder to get work done ends up making my brain just sorta crash, and causes stress problems which fuel depression and suicidal thoughts, and make me unable to work on stuff effectively the next time I work. But not working on school makes me get more behind, become more suicidal because I realize i am unable to get work done, and do not get anything done, but it gives my brain the rest it needs- just not the amount it needs. And I can't do anything about it, like, if it was just stress, i could power through it, do whatever it takes, but my brain just breaks when i try to do that, because there is no mental energy and the base-level motivation is impossible to get. And even if it does work to force myself once, I know it will get worse the next time i try from experience, making staying up to date in school basically impossible. Online classes makes it worse because, a. teachers don't know how to teach well, so i can't easily absorb info like i usually did, b. my hindsight bias, and lack of cognitive function and memory stemming from depression and insomnia make me retain like 50% of the info i normally would, and like 50% of the natural connections i should make. I need to somehow break from school and improve my mental health, but, im in high school and i can't drop out. Working on school makes me suicidal now. The sad part is, most of my teachers are pretty good and the online situation makes the class have less assignments and pretty much infinite time for assignments, which would be better than me just going to school normally, but i still have huge trouble. I can't join a study group because of corona, i am basically trapped in this stupid situation, where i know i won't suicide, but school makes me suicidal and worsens my condition, but i am left all alone to learn the content anyways and get the work done. I am losing a competitive internship i got that i really wanted, because of my declining mental health, I kept up with the work for the longest time, but because it was work i got suicidal thoughts trying to work, because i got suicidal, i couldn't focus and fell behind ultimately just withdrawing. I am literally in an impossible situation, and I know i am (or was pre-depression at least) incredibly smart, but because it affects my ability to learn so much and do academic work, i can't learn. It is so frustrating, i have tried literally everything i can do from a mindset perspective, and i don't have an obvious idea or habit to solve like it is in some cases, so i have no idea what is healthy anymore and what is not. I literally can't solve my way out of this problem through my own thoughts, and i'm pretty open-minded. I probably deserve this since in the past i have done some pretty shitty things. but i wish i could move on because i recognize that I am not that type of person anymore.  \n\n\nAlso fuck, in ap psychology i learned melatonin is a terrible thing to take as a sleep aid. If you don't take it the same time every night and go to bed at the right time, it screws up your circadian rhythm which effects sleep and everything. No wonder medicine stopped working eventually, and sleep problems are worse than ever before (aside from depression obviously, but that wouldn't give me weeks of insomnia).\n\n&#x200B;\n\nAnyways, i have kind of given up on life from a non-suicide perspective. Like I won't suicide, but i probably won't do anything either, which might get me kicked out. If i get kicked out, i might suicide maybe, but doing so when family is here to support would be dumb, but like it's impossible to keep up with school. At least i'm a senior so this is my last year. Probably should not have kept suicidal thoughts to myself for a year as they slowly debilitated me i guess, but in fairness i also am pretty open minded to new ideas, so i felt like self help would be an option, and was disillusioned that trying harder would somehow make everything ok, and that moving forward was a necessity, even though i knew base motivation was the problem and no matter what i tried it kept slowly declining.  \nI know all my problems effectively, or realize them when they come up, because i am way to self conscious and indecisive (i used to be decisive though), which makes it worse.\n\nThis is a pretty clunky rant i guess, idk if i'm one of the only ones caught in this sort of loop rn though or not. I wouldn't call my circumstance exactly common, but definitely not that rare i think. \n\nIf someone read this through I appreciate it because it was a pretty clunky rant which probably took some time to read, and someone understanding and reading it would just make me feel better i think for some reason. If not pretty understandable given the clunky sentence structure lol.\n\nHope I'm not the only one like this though", "url": "https://www.reddit.com/r/SuicideWatch/comments/jxl25d/being_depressed_and_suicidal_and_trying_to_catch/", "title": "Being Depressed and Suicidal and Trying to Catch up on School Sucks", "social_network": "reddit", "user": "Foghkouteconvnhxbkgv", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1605858822, "permalink": "/r/SuicideWatch/comments/jxl25d/being_depressed_and_suicidal_and_trying_to_catch/", "nsfw": false, "first_save": 1635426651.1822062, "replies_charged": false}