{"id": "t5_2qpzs_t3_b221tz", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "I just graduated from high school almost a year from now and I feel like absolute shit, I was a average Grade level student  and I have a very small friend group (edgy kids), I also have autism but I’m not some window licker,I can’t find a job either because I’m too lazy or no one wants me-I have four best friends and they mean the world to me I’d do anything for them-but I’m the butt of every joke and my jokes aren’t funny to any of them(at least they lead me to believe) we talk on messenger but sometimes we get together-but Jesus Christ I feel like absolute shit. I have a girlfriend and it’s been 2 years (anniversary was like a month ago) and she comforts me but nothing feels right. I’m not the best at describing stuff since my way of thinking is different and shit but it’s agonizing thinking that my friend pool either hates me or only puts up with me due to pity. Sometimes i wonder ( Ik original words ) how much do I impact people on their lives, Ik the memes “mom would be sad” “dog wouldn’t understand” I don’t want to be a edgelord, but I wonder who really cares about me-every time I go back and think about the events I do it seems melancholy, i won’t kill myself I have it too good to do it, only things keeping me afloat is JoJos Bizarre Adventure, my girlfriend, and my friend pool. \n\n\nLong story short: Autismo feels like shit for no reason\n\nEdit: I’m trying to understand music and movies better because two of my friends are in a band and want to be a director. Trying to get close to them as much as possible. But it’s low key backfiring at me because I can’t remember both passions that well.", "url": "https://www.reddit.com/r/SuicideWatch/comments/b221tz/i_dont_feel_right_i_have_it_good_but_it_feels/", "title": "I don’t feel right, I have it good but it feels terrible", "social_network": "reddit", "user": "abc123poP", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1552801366, "permalink": "/r/SuicideWatch/comments/b221tz/i_dont_feel_right_i_have_it_good_but_it_feels/", "nsfw": false, "first_save": 1635427574.4847493, "replies_charged": false}