{"id": "t5_2qpzs_t3_p4wd3o", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "Ok so me and my fiancee split up free 8 years together, we both made a lot of mistakes and we both did wrong.. not cheating or anything like that, but still..\nThat was 2 years after our son was born, we slowly just drifted apart\n\nI'm still completely in love with her but out families hate each other now and we just don't think we'll ever be together again, so that's number 1 of the list.\n\n(Had to move back in with family at this point btw)\n\n2nd is my work accused and sacked me for something I hadn't done, and went through a long horrible process of proving my innocence (which I eventually did)\nI was then welcomed back and day after day I have been treated differently.\n\n\nI feel like I'm failing my son on a daily basis, I barely see him anymore cause of work..\n\nMy suicidal tendencies have flushed back from my last attempt 10 years ago, but I dont give in because of my son.\nAnd as horrible as it sounds I often wish he wasnt here so I could actually do it.\n\nI died last time for a few seconds and I was brought back, and it was horrible being dragged back.. I miss it\n\n\nBut now Im finally admitting to myself and family that I need help, I need time off to get sorted... And all they did was complain about the money situation.\n\nHow I'll be only earning sick pay and they can't afford to carry me (hadn't even asked them too)\n\nNo hint of any care it compassion for me at all, just worried about their own asses. \n\nApparently I'm not allowed to be mentally unstable.\nI mean I have ADHD as well so I already struggle with all this shit anyway.\n\nI wish I could just get away from all of them, but I can't. \n\nI don't plan on killing myself, I just can't care about anything else right now besides me. I've put my issues off for a year nearly and it's almost killed me", "url": "https://www.reddit.com/r/SuicideWatch/comments/p4wd3o/i_sometimes_feel_like_im_not_allowed_to_worry/", "title": "I sometimes feel like I'm not allowed to worry about my own health anymore. I've been suicidal 10 years, the last year specifically has been incredibly difficult.", "social_network": "reddit", "user": "HolmfirthUK110994", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1629043965, "permalink": "/r/SuicideWatch/comments/p4wd3o/i_sometimes_feel_like_im_not_allowed_to_worry/", "nsfw": false, "first_save": 1635423007.4945188, "replies_charged": false}