{"id": "t5_2qpzs_t3_pj8fuz", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "I have suicidal thoughts now a lot of the time it isn’t over a girl I’ve accepted that it is what it is. I’m not on depression meds nor anxiety meds and normally do a good job of managing it through mediation and other things such as the gym. Recently though I have almost daily thoughts of hoping I die in my sleep or I get hit by someone while driving to and from work and tend to notice myself speeding more. Hoping that God or whoever will decide my time is up. \n\nMy question is what can I do I find myself looping or trying to research ways I can die slowly or suicide by accident in a way to lessen the burden on my Mom, brothers, ex etc. I have good friends and only told one about these thoughts but I don’t want to burden anyone else. I’m just tired of life I know things get better but there’s so much I need to do and get done and work for that I don’t really want to. I’ve started to try to find ways to escape i.e drinking, smoking occasionally and doing shrooms to try to solve these deep traumas. I guess I’m posting this to just be honest and leave a mark god forbid anything happens.\n\nI’m not trying to get attention or anything like that. I’ve just come to very melancholy mood and still can’t seem to get over a situationship that only lasted a month and three weeks. It’s been almost 2 months and tinder doesnt interest me. I’ve muted her stories yet still find myself trying to see what she’s doing or hoping for another chance. I’m 22 i know I’m just starting life and I’m not trying to be selfish or anything, but now I just don’t care I just want to find peace and finally let everything go. \n\njust wanted to be honest and get this off my chest finally.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pj8fuz/i_dont_even_know/", "title": "I don’t even know", "social_network": "reddit", "user": "NewsPuzzleheaded8436", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1630962118, "permalink": "/r/SuicideWatch/comments/pj8fuz/i_dont_even_know/", "nsfw": true, "first_save": 1635427496.846158, "replies_charged": false}