{"id": "t5_2qpzs_t3_k6sv1n", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "Alright, gonna dive right into it, hope this sort of multipart stuff isn't against the rules.\n\nAlright, today was a weird day. I still think it was successful though. Finally after 2 weeks of her not having time for me or wanting space we actually talked again, through text, but that was probably for the better as I feel the ability to be careful with your words really was quite nice. \n\nAfter not getting a response from her for quite some time regarding if wether or not we can see each other today (as she said she would have time following this last week) I became very antsy, probably borderline panic attack. I wasn't showing it as I had to do some stuff with my aunt, but I was basically having a mental breakdown in my mind, imagining the end of the relationship for the god knows how manyth time.\n\nYes, that is very unhealthy, I know. It's not her fault, I'm just very codependent and it's good that she's not. Keeps me in check. \n\nAnyhow, I decided to add onto some notes I made the last few days regarding our relationship and just put down everything that came into my mind. It was very pathetic really. I would give a rough overview if I wasn't too ashamed of how utterly ridiculous the extend of my ruminations were. Needless to say, they were unjustified thoughts. After finally deciding to message her a question mark as she didn't seem to remember that she wanted to let me know if she's free, she declined, sighting feeling like shit. \n\nNow, look, I know this sounds bad alright, but I took this to mean it's over. I had intented to show her my breakdown in text the next time I saw her believing full well that it will probably dispel all of her somehow still intact respect for me, but I figured  the truth can't hurt. Buuut I really couldn't take the maybes anymore, they really gave me axiethy. So I decided to give her a short warning text, that she might not want to read the following if she's feeling very shit and unable to, but I just had to get it out there. Force the issue rather than torture myself another day with possible outcomes. \n\nAnyhow, of course, as per usual she surprised me with her compassion. She took a while to respond, which was fair, it was a REALLY long note. Like literally the character maximum on the app. But after half an hour I got an almost as long response, trying to sooth me and explaining herself and telling me stuff we rarely talked about. Like how sometimes I hurt her (not physically) but with my words and she doesn't end up telling me, which builds resentment towards me AND herself. And how her selfhate and shame often causes her to retreat.\n\nNow, you may think that getting such a massivly long, deep, dark information packed response may cause me to freak out more. Funnily enough, the exact opposite happened. \n\nI've noticed this a few times. I'm often very panicky when I shouldn't be, but surprisingly calm and collected when most would be panicky. Quite interesting huh.\n\nAnyhow, I was back in the game, able to think things through. Sorta the state I'm in when I'm really focused in a chess game. It was very interesting. I actually kinda like myself when I'm in that state, a flow state so to speak. And liking myself is rare. \n\nI responded in a way I felt fit, asking her about further things that may have hurt her. She says she's already told them to me mostly and if I can tell what I've been to afraid to say. Turned out fine. In total we spend 2 hours just texting extremly long messages back and forth, and it was very exhausting, probably for her too I imagine, but I'm very glad with the result. I understand her situation so much better now and my fear and panic is, for now, reduced to a minimum. I'll see her tomorrow. I'll try to update these weekly or whenever I feel like shit and need to vent. Don't expect anyone will read them, but it probably helps me. Also rereading them will help me remember important points to talk to my girl about. Anyhow, \n\nCheers!", "url": "https://www.reddit.com/r/SuicideWatch/comments/k6sv1n/random_venting_by_a_fool_part_2/", "title": "Random venting by a fool (part 2)", "social_network": "reddit", "user": "throwaway_vent_19", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1607113756, "permalink": "/r/SuicideWatch/comments/k6sv1n/random_venting_by_a_fool_part_2/", "nsfw": false, "first_save": 1635428047.5661926, "replies_charged": false}