{"id": "t5_2qpzs_t3_ozaogv", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d"], "text": "I constantly feel like a shitty person because I should have transitioned to being a functional adult a long time ago and yet, at 23 y/o, I have done almost none of the things that adults are expected to do: I still live with my parents, have never had a job or any post-compulsory education, and don't even have a driver's licence or a car. The reason why I've failed to do any of those things is because I felt that I wouldn't have all the knowledge and skills required to live as an independent and functional adult because I've lived most of my life with my mother as my only guardian, who always coddled me instead of actually teaching me any important life skills, how to do anything by myself, or having me do chores, which left me with a somewhat lazy attitude (which is still somewhat present now) and inability to do certain adulting skills such as cooking (I have gained more of these skills since, but it was way overdue by then, and I still have some foods I don't know how to make properly, such as mincemeat which I would probably burn if I attempted to cook it, even after already having been shown how too do it once), and probably even some things I'm not even aware of that adults have to do, as there are quite a few like that that I've only learned recently. And the worst part is that I have two younger siblings, which means that even if I were to make a \"late launch\", I've already given them the idea that that it's okay for an adult to act like me (children follow the example of adults), so they will likely grow up to be just like me, which makes me feel really bad because it's my fault.😢 When it comes to my siblings however, my mom *does* seem to care about their futures as adults because she *is* teaching them the life skill needed for it. I also have certain interests which are propably not considered socially acceptable for adults (which I'm not even willing to elaborate on gor exactly that reason). Th\n\nAs a teenager the fear that I would be incapable of being a functional adult when the time came started (which, lo and behold, turned out to be completely rational), and even as a little kid I've always been aware that I was defective somehow. I have Asperger's (which actually is a contributing factor in developing FTL according to what I've researched about it), and everytime someone asked me what what my opinion was on something, I would always answer \"I don't know\" because, well, my mind genuinely couldn't figure out what my own opinion on something was, and I had a very poor anger management even in comparison to other little kids (whenever I got angry about something, I would yell at the person who angered me and when they told me to stop, I would just keep yelling until they answered, which even other kids my age didn't do, and worse, I still have this issue even now as an adult and I don't always even realize it when I've begun yelling, and I've even yelled when kids have been present and scared them as a result, which always makes me feel really bad because I know full well that's very very shitty behavior for an adult, but there's nothing I can do about it because I simply can't control my anger). As a kid, it was also nearly impossible for me to decide anything on my own, as my mind simply couldn't determine what choices where right for me to any degree. As a child and even as an adult before I started doing more stuff around the house quite recently, I spent a lot of time on the computer and playing video games, which I think has permanently ruined my brain to the point that I can no longer fully focus on anything IRL and am quite stupid in general (I have shown a lack of common sense on many occasions that would probably get me in trouble in the real adult world). It bothers me that I mightnever have discovered some of the things I like on \"fun\" sites like YouTube or DeviantArt with the free time I never would have had would never have had if I'd begun the whole adulting thing on time, as said things did give me ideas to create a few things of my own that people have liked/might like when/if I published them online, which, again, I come up with using free time that I shouldn't gave had if I'd \"launched\" when I should have.\n\nI'm not trying to fish you guys for sympathy or anything, because I know full well someone like me deserves none. If anything I feel that I'm actually *morally obligated* to kill myself because it simply isn't socially acceptable for a \"grown-up\" like me to exist and because I've already set a poor example for my younger siblings, and I came here seeking affirmation for that feeling. I should already have done it long ago when I first realized I wasn't cut out to be a functional adult.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ozaogv/failure_to_launch_syndrome_ruined_my_life/", "title": "\"Failure To Launch Syndrome\" ruined my life", "social_network": "reddit", "user": "Special-Brick", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1628268937, "permalink": "/r/SuicideWatch/comments/ozaogv/failure_to_launch_syndrome_ruined_my_life/", "nsfw": false, "first_save": 1635426948.0842214, "replies_charged": false}