{"id": "t5_2qpzs_t3_h9tdg1", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "I feel almost threatened when I’m reading about crisis textlines that claim they’ll call the police if they believe I’m ‘in danger’. I’ve heard about how police interact with the mentally ill, especially with suicidal people. I don’t want to be thrown in some sort of mental hospital and I don’t want the police to kill me, simply because I’m talking about my feelings. Whenever I bring up suicidal thoughts with my therapist it feels like I’m walking on egg shells because at any minute she can just decide that I’m crazy and lock me up. It’s almost like she thinks I’m going to die whilst we speak.\n\nI’ve tried hotlines before when feeling upset, but I usually get so choked up that I can’t even explain how I’m feeling, and since I’m not saying anything, the people on the other end almost make me feel like I’m wasting their time, in a way? But, I’ve tried crisis textlines before and they’ve been really helpful. Only problem is that they’re really expensive to continuously send messages, or they threaten to call the police. When I say threaten to call the police, I don’t mean to me directly. Just in their rules and regulations.\n\nIs there any crisis textlines or any sort of medium like that that I could use for free, without fear of cops treating me like a criminal? I’m not going to limit this to a certain location, because I sort of want as many as possible. Plus I don’t want anyone from where I’m from to find this and use it against me. I’ve had a similar experience beforehand where people exposed my posts where I talked about suicide, depression and anxiety to certain people, and those people threatened to send me to a mental hospital.", "url": "https://www.reddit.com/r/SuicideWatch/comments/h9tdg1/crisis_textlines_that_wont_alert_police_whilst/", "title": "Crisis textlines that won’t alert police whilst mentioning suicide?", "social_network": "reddit", "user": "cameheretomake1post", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1592270028, "permalink": "/r/SuicideWatch/comments/h9tdg1/crisis_textlines_that_wont_alert_police_whilst/", "nsfw": false, "first_save": 1635426152.7860527, "replies_charged": false}