{"id": "t5_2qpzs_t3_pq6z31", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d"], "text": "I’m almost 30. Wasted the last several years of my life of just working and playing video games and not doing anything else. Never got a degree. (Still no idea what to do for a major. I have no passion for anything) Hardly did anything to my savings account. I don’t have a car and no drivers license. I do live independently. \n\n I had a girlfriend and she was everything I was looking for. We both had insecurities that lead to a toxic relationship and it’s demise. I feel that I fucked it all up by taking her for granted. The break up made me realize what the fuck I have been doing with my life. This is the first time I’ve been having suicidal ideations and bad depression. (I am seeing a therapist and taking zoloft. I think it’s helping)\n\nI already have a foot in the door for a career in IT with 1 IT credential.  But I feel so stupid that I can’t accomplish anything more. When anything hard comes my way, I get so anxious that I want to give up. I feel like I want to give up in life now. \n\n\nI want to make changes in my life for the better but I’m so scarred. Everyone I see has it better than me. I’m so inadequate that I don’t think I can handle life. I’ve made too many mistakes. \n\n\nI’m writing this down to see if it helps. \nI know people have it worse and that makes me feel even more shitty.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pq6z31/failure_havent_amounted_to_much_and_i_wasted_so/", "title": "Failure, haven’t amounted to much and I wasted so much time. Death seems like a good out.", "social_network": "reddit", "user": "throwawaynumber11113", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1631907026, "permalink": "/r/SuicideWatch/comments/pq6z31/failure_havent_amounted_to_much_and_i_wasted_so/", "nsfw": false, "first_save": 1635426932.4262002, "replies_charged": false}