{"id": "t5_2qpzs_t3_odxbi1", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "I’m 32, I’ve been diagnosed with a terminal illness, after having suffered a lifetime of suicidal thoughts. I spent years in psychiatric care but was wrongly diagnosed and never got the help I needed. \nI was bullied and abused as a kid, I was extremely bright and sensitive and high hopes and a huge appetite for life. After I burned out it completely went away. Even if I could have it all I still wouldn’t be able to enjoy it because my brain is destroyed from trauma. Severe memory problems, emotional dysregulation that shifts sometimes several times a second. Chronic insomnia. It’s never ending. \nI’m incapable of doing mundane everyday tasks that can pass time\n\nMy life has been constructed to isolate me in the most profound way and I lost the ability to occupy myself with areas of interest because of chronic anxiety\n\nI started having breakdowns where I scream in despair and wake up neighbours who calm the police.\n\nIt’s happened so many times I know the staff who arrive and today we even cut things short because they know there’s nothing that can be done\n\nI can’t cope with the disappointment of what my life has become. \n\nI used to be a singer\nI haven’t sung in ten years and my fits of rage have destroyed my vocal chords. I can’t even hum to myself without triggering anxiety \n\nsevere ADHD ( medication doesn’t work, it usually ends in anhedonia and uncontrollable rage attacks, ASD, burnout syndrome, seasonal depression, tinnitus, ptsd, narcissistic personality disorder, hiv positive, I was wrongly diagnosed with borderline and I have been denied the social care and therapy for years because I’m labelled as a hopeless case\n\nI’ve never been able to work, I didn’t finish school. I used to have too grades and I have rare artistic talents and a deep understanding of art and science but I’ve never been able to build a context where I belong. I’m alone all the time, I often can’t even listen to music because of the sensory overload.\n\nI am so scared of dying but I have no realistic reasons to think this will ever change and I can tell I’ve gone far in the process of pushing myself to the edge and finally kill myself.\n\nI never have energy to do anything, I feel like I spent the last 20 years waiting for a bus that never arrives. \n\nThese days when I call my parents I end up screaming intelligibly outof sheer desperation and I dissociate. \n\nI can’t even externalise curiosity of the world because how the system destroyed me and how the planet is dying.\n\nI am chronically depressed in a way where I’m incapable of falling in love and meeting someone. I lost so many friends and opportunities. I wouldn’t even have been able to fantasise life would become so painful. The envy makes me physically nauseous and hyperventilate. \n\n\nI wanted to live but this life is never going to be good enough. What I need to sustain balance always overwhelms me and leaves me in deep fatigue.", "url": "https://www.reddit.com/r/SuicideWatch/comments/odxbi1/this_is_my_story/", "title": "This is my story", "social_network": "reddit", "user": "arasharfa", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 21, "down_vote": 0, "creation": 1625448950, "permalink": "/r/SuicideWatch/comments/odxbi1/this_is_my_story/", "nsfw": false, "first_save": 1635426583.2446008, "replies_charged": false}