{"id": "t5_2qpzs_t3_qcsykh", "request": ["4162f604-29a0-4041-a85b-c249e1ca13f8"], "text": "Is that everyone keeps telling you how you have to “pull yourself together” and “help yourself” since “no-one else can help you otherwise”.\n\nExcept, I feel like I’m nothing but a burden, no-one genuinely cares about or loves me, and I have like 2 reasons to want to keep going against a hundred million reasons just to give up. No-one understands, no-one can help me, and I feel so alone I can’t stand it. I never thought I’d have to live past 18/19, yet here I am, stuck here with maybe 2 reasons to be glad about it, or at least to keep drawing in air, one of which I may be forced to lose, the other I’ll lose one day anyway when my cat dies of old age.\n\nThe whole reason I feel like giving up on myself is because it feels like the world and everyone I know already has. Yet they tell ME to keep fighting! Fight with what? With what fucking energy do you expect me to keep going? For what reason should I stay, just so YOU don’t have to feel fucking guilty and get inconvenienced by my death, is that it? So all the assholes you know don't start gossiping about how your kid topped themselves? So YOU don’t have to feel like you were bad parents?\n\nI’m so tired. I’m alone, and I don’t know how to keep going in a world where the only two reasons I have to live could disappear on me at any time and leave me with nothing and no-one. I’m not strong enough for this, I’m weak and pathetic and nothing but a burden. I wish I was better, but I can’t seem to be, no matter how hard I try. I’m sorry. I’m sorry I’m such a fuck-up. I’m sorry I’m alive. I wish to God I had never been born.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qcsykh/the_real_problem_with_depression/", "title": "The real problem with depression", "social_network": "reddit", "user": "ShatteredStarlight45", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634826206, "permalink": "/r/SuicideWatch/comments/qcsykh/the_real_problem_with_depression/", "nsfw": false, "first_save": 1635422882.6601694, "replies_charged": false}