{"id": "t5_2qpzs_t3_dpxms2", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "Hello im a teenager i've been suffering from depression since i was really young. ALL of these years my life was a total JOKE. MY parents completely  destroyed me i forgive them, but my ego is destroyed. I can't make friends, im so awkward. I really don't want to blame them for what they did to me, but they just say \" its been years, get over it\" and it pisses me off .When I was 13 i started to be depressed I would cut myself, and cry at myself for being fucking ugly, and a worthless piece off shit. BY the age of 15 i would date some one beautiful ,the only person that was there for me, Nicolas, he was one of the nicest person that i've met, i loved him so much , and i still do. The problem my mental health fucked up everything . I would start feeling paranoid, and hearing voices of \"you should make a pact with the devil\" even more horrifying thought. One day i couldn't handle it no more and I WANTED help , having those thought would make me explode my brains. After getting help from a psychologist I would take prozac . When i started getting \"better\"i would stop talking to Nicolas and hang out with guys, then we broke up. In that day i've realized the damage that i did to him. I was so fucking stupid. I wanted to apologize but it was too late. Sadly i stopped visiting the psychologist in 2017 during 2017-2018 it was okay i stopped hearing voices. Unfortunately I realized how my life is a joke how everything is stupid. I stopped hanging out with my\" friends\", and stopped being interested in the things that i use to like. I've realized how im a problem to this world, and that my life have no meaning. I MEAN WHY WOULD I LIKE TO KEEP BEING ALIVE if i still have the same problem. I tried so many activities to stop those thoughts, but it doesn't work. WHATS THE POINT OF LIVING? i've lost the only person that was really a true friend, and i will never find someone like him. I want to tell him how much I LOVE him. Anyways my reason of my suicide is because im bored of my life like i said before i tried so many things to distract my self, but i can't anymore. I'm also leaving this shitty world because of the problems around me. I'm tired of hearing people's problem, and talking shit about other people. btw im 17 ( and yes im young) but i feel like that i've experienced enough, lol. When i die no one will give a shit maybe people will be like \" omg she was so young :(\". I don't even have faith anymore. anyways im leaving, but after that i want to know ur opinion, and pls don't be like \"omg don't kill yourself\"", "url": "https://www.reddit.com/r/SuicideWatch/comments/dpxms2/im_want_to_kill_myself_since_i_was_6/", "title": "I'm want to kill myself since i was 6", "social_network": "reddit", "user": "abee_jpg", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1572572500, "permalink": "/r/SuicideWatch/comments/dpxms2/im_want_to_kill_myself_since_i_was_6/", "nsfw": false, "first_save": 1635427768.12018, "replies_charged": false}