{"id": "t5_2qpzs_t3_nr962e", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "Hello everyone\n\nI'm a 27 year old female and I think I'm done with life.\n\nI have a great family and good friends. I love my mother to death and she is the only reason why I'm still here. I don't want to break her heart, I'm her only child. But besides that I would be fine with just going back to God. Sometime I even want to ask my mother to just let me go, give me her permission to die. But I know she never would agree to it...\n\nFor the last three months I was suffering with really bad HOCD or SOCD which made me severely depressed. I have very bad anxiety and panic attacks. Before that I was a \"normal\" young woman, outgoing and full of life despite having some issues (I suffered with depression multiple times through out my life, different types of OCD  and anorexia). But somehow I managed to pull myself out of it. But this time it was super hard on me. I always loved men and the thought of finding that spacial someone was the best feeling in the world. Now this feeling is gone.\n\nI experienced immense emotional pain in the last three months... Now this pain is not that intense anymore and I don't know who I love and who I am anymore. I'm human shell. To be honest I don't want to be with anyone anymore, I'm fully okay with staying alone and just live for myself basically. But OCD makes me think and feel things I don't like and gives me a feeling of I HAVE to do it and that I'm just denying. I'm afraid to act out on it or that I am just not gay yet because I haven't find the right woman yet (someone said that to me and my OCD latched onto it) even tough I have zero interest in women. I already feel the anxiety spiking up just thinking about it... I'm afraid to leave the house and live my life again. I'm so, so afraid. So the thought of just closing my eyes and never open them again gives me comfort and relief, I feel inner peace.\n\nSuicidal thoughts aren't exactly a new theme for me. Since I'm an adult they are like a safe and quiet place in my head. But ironically enough OCD made me anxious about death in the past. I thought I saw signs of me dying soon (cancer or car accident) or felt my body getting seriously ill. Now I'm absolutely not afraid anymore, still I don't want to suffer too much.\n\nI don't expect anything, I don't hope for anything, I just want to be left alone by (H)OCD and the world. I just want peace. And yes, I'm going to therapy but it kinda made everything worse because a lot of unresolved trauma resurfaced (including sexual trauma with the same and opposite sex).\n\nWith so many people dying without wanting to die I kinda feel bad sometimes, like I'm ungrateful. But on the other hand I'm just so tired of life, I'm so hurt and exhausted. I thought that at least what my heart wants is mine and can never be taken away from me but OCD proofed me wrong. It seems like suicide is the last and only thing that is mine. \n\nSometimes I ask God to finally take me back to him. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/nr962e/i_feel_inner_peace_with_the_thought/", "title": "I feel inner peace with the thought.", "social_network": "reddit", "user": "Radiant_Patient_292", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1622711937, "permalink": "/r/SuicideWatch/comments/nr962e/i_feel_inner_peace_with_the_thought/", "nsfw": false, "first_save": 1635422264.1665437, "replies_charged": false}