{"id": "t5_2qpzs_t3_7xwxq1", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "For quite some time now I’ve been thinking about hurting myself. Sometimes just fantasizing, sometimes wishing, sometimes planning. I struggle with severe depression, obsessive compulsive disorder and attention deficit hyperactive disorder. They always seem to compliment and thwart one another. When my depression is high my anxiety is typically low, when my anxiety is high depression tends to be low, all the while ADHD keeps me from being able to marshal my resources against them.\n\nI’ve ruined the greatest relationship I ever had by not supporting someone who took me in despite my own weaknesses. She wanted to be a friend and keep me in her life but after I realized the gravity of my mistake I smothered that connection by being unable to move on and trying to revive our romantic relationship.\n\nMy job is menial and dead end. Every time I try to improve my situation I end up sabotaging my efforts in some way. Whether it’s looking for more worthwhile employment or going back to school. Through tardiness at work, avoiding classes and escaping with recreational medicinals.\n\nMy parents have spent a fortune getting me treatment. In medication, therapy and general support. My brothers are not impressed with my arrangements, they know I’m a lazy fuck up and a wasted opportunity.\n\nMy friends are tired of trying to comfort and console me and I’m tired of putting them in that position. I feel like if anything should happen they would feel something of a loss, say it’s a shame but be able to move on fairly quickly if not immediately.\n\nI just want to go over all of this with someone objective. Someone who won’t try to convince me that things will get better. For thirty two years it’s been a slow but steady descent, the reprieves only serving to highlight little I have left, holding my face to everything I’ve ruined and squandered. I want to lay this all bare so they may look at the facts and the context surrounding them. That they may corroborate the evidence to not waste more time, burn others’ resources or hurt any more loved ones.\n\nI’m visiting the aforementioned friend and after inadvertently putting her through an emotional hell for the last week and a half, everything is starting to feel more crystallized than ever before. I could cocktail my meds and other substances but I don’t want her to have to address the issue in the morning. I could wait at the train station but I don’t want to subject witnesses to the grisly results or commuters to the inconvenience.\n\nI want to be told that it’s ok to feel this way. That it’s appropriate considering who I am. That it’s time.", "url": "https://www.reddit.com/r/SuicideWatch/comments/7xwxq1/its_just_so_logical/", "title": "It’s just so logical", "social_network": "reddit", "user": "thefirsttimeagain", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1518762686, "permalink": "/r/SuicideWatch/comments/7xwxq1/its_just_so_logical/", "nsfw": false, "first_save": 1635426282.1140769, "replies_charged": false}