{"id": "t5_2qpzs_t3_ldbdx8", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "Everything in life is like a weird chicken and an egg situation. I feel alone and so I feel desperate but being desperate is the reason why I will always remain alone. I'm trying to be happy alone but it is very difficult. it's difficult not to fall into rumination. It's difficult to believe whatever positive thought I try to hand fist into my brain whenever I start to feel so low. It just doesn't stick. How am I ever going to be with a woman if this is me in my life. I almost want to give up on dating completely. But that's not what I want at all. My entire life I've never been good at building intimacy or anything like that with women. I feel deeply deeply humbled/h humiliated by my previous failures at attempting to build romantic attraction. I catch feelings too fast now. I can't stop the scarcity mindset. It truly does not feel like there are a million fish in the sea. It feels as if there are maybe 100, and that I will be lucky to come across 10 of them within the span of 5 years. \n\nMy low confidence and my fear of social interaction are a horrible cycle and I can't get out of it. It is one of probably the two or three biggest reasons why I continuously give up and feel like just throwing in the fucking towel for good. I fear I will never be a strong enough person to consider suicide as a completely ridiculous option instead of possibly my best hope at ever being at peace with who I am, with what my life is, and with all of the work that I see before me to put in in order to get where I want to go, without also having any confidence in my ability to succeed. I feel pathetic and I feel like less of a man. I just wish I didn't feel so God damn desperate or have feelings for women I've already been rejected by. I can't stop myself from this fucking irrational thinking it doesn't matter if I can call it irrational. It doesn't stop and I can't stop making fucking impulsive decisions based on fear.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ldbdx8/i_wonder_what_use_it_is_to_live_if_i_truly_do_not/", "title": "I wonder what use it is to live if I truly do not have the confidence or faith in myself to get what I want out of life", "social_network": "reddit", "user": "Vast-Exchange3353", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1612543934, "permalink": "/r/SuicideWatch/comments/ldbdx8/i_wonder_what_use_it_is_to_live_if_i_truly_do_not/", "nsfw": false, "first_save": 1635428044.0209131, "replies_charged": false}