{"id": "t5_2qpzs_t3_p75q4b", "request": ["ee176c24-5d0b-47eb-8f0f-71f3b585684e", "b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I'm going to be regarding to my sister in ways I probably never would ever again. This is going to be really long as I would cover a lot of things here.\n\nI'm not talking about this because my sister is going to commit suicide, or she definitely ever will. However she seems to be on her last rope and if her upcoming job interview fails she might just do it. I am here to find closure to this in the case she ever does.\n\nI should explain my sister is a kind and amazing human being if she is being sane. She's insanely smart, \n pretty, talented, responsible, resourcesful. She also cares so much about everything- too much in fact. I actually love her. But she is often not sane unfortunately, especially recently.\n\nMy sister was heavily abused and bullied as a kid. She has aspergers and she was born in a time and place where anything that goes against the norm are heavily stigmatized. Growing up she felt like she was a failure, the black sheep of her circle and not human. This kinda manifested into her being absolutely obsessed with perfection, with overthrowing God and becoming God so everyone would love her she would talk about overthrowing God a lot too. Just extremely crazy things. Sometimes I don't exactly see her as human. More like a former shell as a human.\n\nNobody knows this side of my sister aside from me and her 2 friends I never know personally. To anyone else she is just a stable, awkward person . No one I know irl ever believes me if I share this to them either. Only my online friends ever believed me.\n\nMy sister is also really really easily threathened. If you disagreed with her, had different opinions with her, told her no at all, change the way you speak to her she would feel extremely threathened, talk about a small specific detail for the whole day. One time her crush said hi to her and she felt threathened. He never said hi to her and she feels like he now sees her as a stranger suddenly. \n\nIf you told her she was human, she doesn't need to be perfect or vent or talk about anything you were upset about even if it had nothing to do with her, she would react extremely, either screaming, getting mad, gaslighting you or start crumbling down into a mess, picking on every single (normal) flaws she has and escalating it.\n\nYou could imagine my toxic parents doesn't help.\n\nAll this time I'm trying my best to help her. I listened to her , I comforted her to best of my ability , I let her steal my antidepressants (like, I didn't scold her and just warned her to be careful using the medication as I was prescribed the medication and idk what it will do to her. Now she prescribes herself a higher dosage than me and drinks it at any minor inconvenience), I let her hit me, scream at me, gaslight me, I directed her to resources that could get her to feel better and resources to professional help. I disregarded my own mental wellbeing for her. I neglected my studies for her. Yet I keep failing to help her.\n\nShe continues to spiral downwards and downwards. Her obsessions are becoming more and more intense, she drinks more, she'd make her room and the bathrooms in our house reek of alcohol. She'd be extremely tipsy in front of me more. Her fantasies become more and more morbid. She once said she wants to be treated like an african slave bc that is what everyone wants, she then starts to want to have an AI replace her soul. She once even encouraged me to develope an eating disorder to kill me so she could starve herself in peace.\n\nThis was all really at its worst in June 2021-July 2021. I was always scared of waking up, reading her chats, having daily suicide prevention screaming matches. Being gaslit, physically injured everyday to let her fulfill her insane fantasies. Ofc in the end I stopped it all sucessfully but I almost failed a lot. Especially when she manages to convince everyone at home I am a freak and I am attacking her. She also admits she would give me a hard time on purpose to test if I am worthy. And also a manifestation of he issues ofc. \n\nSo you may wonder why I did not get professionals involved. It's because she doesn't want to and in my country, if she doesn't want to it is illegal for me to force her. I tried persuading her, being a bit more aggressive about it, providing possible alternatives. Ofc in the end it was pointless. \n\nI feel so hopeless. I often fear the day I'll just find her dead. As a coping mecahnism I followed a subreddit here called suicide bereavement to examine how I would feel if that day ever comes. I feel like I 'll blame myself for it. For not trying hard enough. At the same time I feel like I would peacefully just accept it and heal eventually. No pain no rage. Just empty. I didn't hate that thought.\n\nWhen she got news of someone possibly hiring her and she got into her antidepressants binge though things started calming down a little. But at this point I'm so burned out. I feel like I was doing everything wrong . I felt mad at her but also mad at myself for being mad at her. But eventually I stepped back from her life a bit and let myself catch my breath.\n\nI'm moving out bc of uni in a couple weeks and that caused her to feel like her life is crumbling down because she may not have moved out yet when I do and she believed that it would mean her life is over. She mentioned on many occassions that if she feels like her life is over she would take her own life. So the thoughts come back. What if she try to kill herself again? No one else is able or willing to stop her from what I know. All her friends live abroad and my family can't care. But even I cannot have the words or strength to stop her anymore. And this time she may be harder to stop.\n\nFor that reason I consider turning the blind eye this time with the thought she has suffered unimaginable pain, maybe death could lead her to a more peaceful place. However I know what I am thinking is immoral. And that is eating me away. For that reason, even though I know I am wrong, I pathetically turn to you guys to ask: would I be wrong? Thank you for reading.\n\n**TL:DR: sister mentally unstable from lifelong abuse and bullying. Trying to support her but she digs herself deeper into her mess. Last years spent trying to keep her safe and gets worse this June-July. Things chilled down a bit, but I am now really burned out and failing one class because of trying to keep her safe. When I have to move away I fear things may take a turn for the worst. I want to give up even though I know I shouldn't because I feel like I can't let myself sacrifice everything for her anymore just to keep her barely sane.**", "url": "https://www.reddit.com/r/SuicideWatch/comments/p75q4b/would_i_18f_be_wrong_for_stop_trying_to_prevent/", "title": "Would I (18F) be wrong for stop trying to prevent my sister's (25F) suicide?", "social_network": "reddit", "user": "VioletFlorence", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1629339312, "permalink": "/r/SuicideWatch/comments/p75q4b/would_i_18f_be_wrong_for_stop_trying_to_prevent/", "nsfw": false, "first_save": 1635427845.2106378, "replies_charged": false}