{"id": "t5_2qpzs_t3_nshh37", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I am not a victim. Everyone I ever loved and who loved me - theyre the victims of my attempts. I harmed them more than harming myself, *by* harming myself. I have no one left whom I havent pissed off, driven away, made myself difficult to love. The repeated, the routinized suicidalism is destroying basic fundamental fabrics between me and -- whatever makes humans *humans*. I don't know what to do to stop it. But I cannot try again tonight. I have seen people accept my death and nothing is more heart wrenching than that. If one could attend his or her own funeral and see the ones who dont cry, who bang in the funeral home bathroom, who make up dumb stories, who gaslight your corpse. It's agonizing because suicide is the ultimate illusion of control. It is and it isn't. It's ctrl a when we were seeking ctrl x. I cant control the story after I am gone. I cant control my story now. You know the nightmare of wetting your pants in public? Whoops it started: Should I squeeze it off or let it go. You're 6 years old and you realize you're already wetted. So..  in horror you watch your own body betray you and *keep wetting*. This is suicidalism to me. I started, its embarrassing. People detest me for it, say Im whoring and seeking attention. But I'm really just a 6 year old who waited too long to pee, and now he's peeing his pants during the school musical -- and worse: Horrified to see that it's still happening, cant walk and pee, cant run and pee. Letting it all out.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nshh37/i_keep_wanting_to_attempt_i_keep_getting_so_close/", "title": "i keep wanting to attempt. i keep getting so close. in an out of hospitals, changing moods every hour of every day.. I cant hold fast, and even after my last attempt, I want so badly to try again. My life is draining and I am outliving its value.", "social_network": "reddit", "user": "solvent_causis04", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1622846366, "permalink": "/r/SuicideWatch/comments/nshh37/i_keep_wanting_to_attempt_i_keep_getting_so_close/", "nsfw": false, "first_save": 1635427616.7033544, "replies_charged": false}