{"id": "t5_2qpzs_t3_oi53cw", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I wish I could be the \"life is meaningless so I can do what I want\" type of person and not the \"life is meaningless so I want to die\" person, but I just don't want to live anymore, I'm tired of being alive, it's so much work to just stay alive and I don't want to.\n\nI know, I'm just under 17, you all are gonna say \"you have so much to live for\", but what? A lifetime of adult responsibilities? Pressure not to be the failure I'm gonna end up? I was always the \"gifted kid\" when I was little, I never had to put any effort into school, so now I have such a shitty work ethic that fucking washing the dishes to too much effort for me to be bothered to put in. \n\nI have one real friend, but they're 3 years older than me, live 400 miles away, and I've never actually met them. I'm repulsive, nobody wants to be friends with me, and I don't blame them. I'm cynical, nihilistic, impatient, self-absorbed, self-destructive, narrow-minded, absent-minded, stubborn as fuck, argumentative, clingy, insecure, paranoid, lazy, short-tempered, unintelligent, and indecisive. I'm never gonna have friends, and my aspirations for the future heavily rely on having a network of friends. So yeah, I'm gonna fail, I'm gonna be the burnout gifted kid.\n\nSo what do I have to live for? Nothing; my life is just gonna end up being disappointment, loneliness, and misery. I just wish I had the guts to actually off myself and not just sit here and bitch about my problems to internet strangers who couldn't care less.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oi53cw/im_tired_of_living/", "title": "I'm Tired of Living", "social_network": "reddit", "user": "AceBuilder1109", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1626012493, "permalink": "/r/SuicideWatch/comments/oi53cw/im_tired_of_living/", "nsfw": false, "first_save": 1635426621.2349753, "replies_charged": false}