{"id": "t5_2qpzs_t3_qd6tyq", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2", "0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "Tbh I don't even know if I deserve to call him that. We hadn't been on speaking terms for a while. He had become paranoid and manipulative and even got violent with another friend, but before that we were attached at the hip. He called us soul mates. We were so close. To the point where we had became codependent due to both of us having our entire lives turned upside down around the same times. \n\nHe messaged me about a week ago. Just to say he hoped I was doing well. We hadn't talked in almost a whole year. I said I hoped he wasnt overworking himself and I hope school was going well and stuff. I thought it was the beginning of our reconciliation. I didn't know it was actually goodbye. \n\nI wish I'd been more patient with him when he was mean. I wish I'd had more to give you. I'd give anything for you to still be here. Anything. I forgave you so long ago and I should have told you. I always thought we would grow enough to be friends again. I never thought you were a bad person. You could've asked anyone. I cared so much and I feel like I lost you twice. Why did you do that? You didn't have to do that. I'm so sorry. I'm so fucking sorry. It's like I'm in a horrible dream and tomorrow I'll wake up and you'll still be here. I'm so, so sorry. Please. Don't be dead.\n\nI wish I could go to your memorial service but I think I'd made your ex or your family uncomfortable. We were too mean to each other. I don't deserve to be there. I don't even know if I deserve to mourn you. But, know that I dream of you all the time and being friends again. I still thought we were soul mates, just not in the way we thought back then. In the way that you always gravitate back to each other. I love you. I know neither of us believed in an afterlife but I hope I'll see you again one day. I hope we were wrong.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qd6tyq/my_friend_killed_himself_last_night/", "title": "My Friend Killed Himself Last Night", "social_network": "reddit", "user": "FellowofInfiniteRest", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1634868052, "permalink": "/r/SuicideWatch/comments/qd6tyq/my_friend_killed_himself_last_night/", "nsfw": false, "first_save": 1635425188.8131044, "replies_charged": false}