{"id": "t5_2qpzs_t3_ov5x7k", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8", "37248a85-36ad-4f27-afa2-d6240c3a39c2"], "text": "I tried to take my own life on Wednesday by crashing my car directly into a tree. I am okay, very bruised and regret wearing my seatbelt because that’s what saved my life. I could not have anyone visit my during my two nights in hospital due to Covid restrictions which I didn’t mind. \nI came home to my family (I Live with my parents and my siblings) snd there were no hugs, no “omg thank god you’re okay”, instead everyone has been very hostile and has just asked me not to do it again. \nI’ve only been helped once to get out of bed, the other times I have had to slide out on my left side which came better off after my accident. \nIt’s not that I want sympathy, bunches of flowers and to start getting affection I never had from my family to be begin with but I feel like I’m more of a burden and that it’s disrupted their life for a few days which makes me even more regrettable about not going faster or harder. I know they don’t want me to die but I thought their actions would match their first words after the accident a bit more. \nDad said on the way home from the hospital don’t do it again and definitely don’t crash a car again like that and that there’s other ways to do it and it’s making me think of another way… \n\nI can understand my family might feel hurt that I would do that to them BUT their hostility and inability to make me super glad I didn’t do it is exactly the reason I did it in the first place.\n\nDoes anyone understand me?", "url": "https://www.reddit.com/r/SuicideWatch/comments/ov5x7k/feelings_of_anger_from_family_members_after_a/", "title": "Feelings of anger from family members after a suicide attempt?", "social_network": "reddit", "user": "Expensive_Explorer_3", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 30, "down_vote": 0, "creation": 1627732938, "permalink": "/r/SuicideWatch/comments/ov5x7k/feelings_of_anger_from_family_members_after_a/", "nsfw": false, "first_save": 1635426812.4077506, "replies_charged": false}