{"id": "t5_2qpzs_t3_nvjj0o", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "Hello Everyone, \nI have an amazing Dad. We have a father-son relationship very few have. He passed away unexpectedly last month. My parents divorced when I was 2 partly due to a temper issue he used to have. I view it as his incredible passion, he was so loving of course he would blow a fuse every so often. My Mom and I always kinda butted heads, she struggled with alcohol and her own childhood issues while I was growing up, we always have loved each other and still do. But, my Dad and I have always been \"a team\" all my life, he was the stable north star that every person needs in their life, he was so loving, he was my biggest fan and I was his. \nHe worked six days a week as a barber for twenty plus years, (just about to get to his 50th anniversary) but he was always there for me. I have two brothers who are 8 and 10 years older than me and we are all very close but they moved out earlier in my life. So most of my life it's been me and him.\nHe supported me while I became a nurse and I stayed with him after I became a nurse because I was so comfortable being with him. I invested my money and bought crypto which he was so proud of me for. I'm in my mid-twenties now, he was in his late 60s. We always talked about him going with me on travel nurse assignments in the future, or eventually moving in with me in a mother-in-law suite.\nHe was the best to me, we said I love you a lot, we hugged each other a lot... We had a father-son relationship I have only seen one or two other times, I wrote him letters on father's day, and his birthday to tell him how much he meant to me, how much I loved him, how I would never choose anyone else as a Dad in the world.\nBut, in the day to day I think I could've shown him more effort and love. I calm patients before procedures and am compassionate towards them but I wish I showed that more to him.\nIt's tearing me up inside, he always put us before him and he loved us and me so much, I feel like he deserved so much more. I'm paying the bills on our house and I'm still living in our house now. I just wish I could've done that while he was still here so he could work less. I work in a heart-related unit right now (he died from a heart-related issue) and I never stop thinking about him, then I come home and all I see is him. I just wish I could've shown him that I would do the same that he did for me all my life.\nHe was just the best, most loving, positive, supportive, appreciative person I have ever met and I don't see living possibly 60 more years without him. I don't see getting married without him, having kids without him, buying my first house/condo without him. I'm so lost.\nI'm a very logical, pragmatic, realistic person but I have gotten these improbable, beyond belief \"signs\" from him. So I go through high highs like that to extreme lows of him being physically gone and not being able to hug him/experience his essence again. I view my death as a sweet reprieve of being able to be with him again or living without this pain. I don't have a plan or am even convinced of suicide yet I am just so lost and I don't see a way out. I feel like I've been more depressed in the last month than I have in all my life combined. This pain is just... Unbearable.\n\nAll my love always Dad.\nThank you for reading.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nvjj0o/my_dadbest_friendlove_of_my_life_died/", "title": "My Dad/Best Friend/Love of My Life Died", "social_network": "reddit", "user": "Conicey", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 28, "down_vote": 0, "creation": 1623200660, "permalink": "/r/SuicideWatch/comments/nvjj0o/my_dadbest_friendlove_of_my_life_died/", "nsfw": false, "first_save": 1635422996.120404, "replies_charged": false}