{"id": "t5_2qpzs_t3_ml4zns", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "I am posting to get more shit off my chest. I’m not expecting anyone to reply or do anything with this post, as was the case with my last one, but that wasn’t very surprising. Though expecting no replies doesn’t mean I don’t want any, because truthfully I do. Not because anyone can help me necessarily, but just so I don’t feel so alone. \n\nAnyway, I feel like annihilation is near. Sounds dramatic? Well it probably is, to you, but not to me, considering it’s my annihilating we’re talking about. I have had some pretty dark and immoral thoughts over the last few weeks..so dark that I can’t really admit it over the internet, yet somehow I plan to schedule another appointment with my therapist and tell him at least...some of it. I don’t know how I’m going to do it. The thoughts I’ve had go against everything I thought I was and stood for...I’ve never had much in my short life, nor looks, money, friends, or intelligence...but what I always had was my unwavering determination to push through anything, to rise above all obstacles, and that I was a decent, morally upright citizen. Physically that may still be the case, but mentally...I am terrified of my mind. I don’t know who I am, because who I thought I was never would have had the thoughts I’ve had, and because I don’t know who I am, I fear I am falling into the deepest well, the most dank and rancid pit I’ve ever fallen into. The light of day could never reach down this far, no amount of sympathy or compassion could save me, no one would ever come down to this shithole I find myself in to guide me back out. Honestly even if I could miraculously get out, I don’t know how to cope with my thoughts. To live with it for the rest of my life...\n\nWho am I kidding, annihilation isn’t anywhere near. I don’t have a gun, no exit bag or any reliable means of death. That’s got me thinking though, do I deserve death? Maybe that’s too merciful, too easy. I probably deserve to live with my inner filth, day in and day out, no chance of escape or reprieve.\n\nIt’s terrible, I used to be the victim, I had a right to complain and not feel good about life. But now the tables have turned (my understanding of this phrase is shattered after hearing so many people saying “hAha, hOw thE tuRnED tAbLEs!!¡1¡”) and I am no longer innocent. Blood is on my hands, metaphorically, it’s in my clothes and my hair, under my nails. It has stained my teeth, I can’t show my hideous face anywhere without feeling like everyone can sense my shame. \n\nI’m literally so fucking sad. I mean, it’s not like I was lying in any of my previous posts and comments about wanting to die and hating life, but goddamn this is a whole new level. I guess I’m just descending down all the rings of hell. \n\nMy heart, my chest, it feels unbelievably heavy. Waves of anxiety of the uncertainty of the future, of how I will cope and live on, of who this new, disgusting creature is that I have the very unlucky fortune to call me; waves of the most penetrating and soul crushing, mind bending sadness and despair over why I’ve done what I’ve done, how I could let myself slide this far, how I could have this level of evil inside of me, creeping and lurking beneath the surface. I’m usually quite a hygienic person, I was always on top of keeping myself tidy and clean. Could this be why? Was I subconsciously hiding an enormous storehouse of madness and insidious nature, and so to deal with this subconscious melting pot of insanity did I pretend washing myself clean with soap and water would be enough to remove it? I was always a perfectionist as well, I wanted to put 1000% of my energy into anything and everything. I didn’t just want to be the Jack of all trades, but I wanted to somehow be the best *and* be the Jack of all trades...fucking lunacy, who the hell can be perfect at everything they do? Somehow I thought I could, I guess. \n\nI stay home all day, **literally all day and I do nothing but stay up until 2, 3, 6 am and then sleep all day, and I get up at about 3:00 pm and just eat SUGAR COVERED FROSTED FLAKES, WTF apparently the sugar on the Frosted Flakes isn’t enough for me, goddammit**. I then proceed to eat ramen noodles, popcorn, some candy that my very lovely mother who I never ever deserved brought home after work, I eat clubhouse crackers plain because I’m a frickin nuthouse, not even with cheese on top or any sort of complementary (is that the right word?) foods like that. My mom thinks I have so much potential and that I am getting better, but that I’ve just opened up something inside of me that’s been needing attention for a long time...Yep that’s all I’m saying about that, I don’t know maybe she’s right, but from my perspective, way down here in the maggot infested, feces smeared dungeon, this holding cell on the way to hell (nice that rhymes), I’m not anywhere near getting better. I feel akin to a massive truck with tons of concrete stacked in the bed, stuck in a really wet, thick, muddy field, spinning it’s tires. All my efforts are just kicking up dirt and mud and grass everywhere, I’m just making things worse. Am I the only one who can see this? Sure I can try and talk to my parents, but them being really loving and kind makes it near impossible. How am I supposed to tell them their son turned out to be such a shithead? My mom thinks my heart is so big and that my ability to care for others will help me do great things...similar to the notion that I am actually getting better, that’s all I’m saying. Maybe she’s right, but again from my perspective...in the messy dungeon...on my way to hell.....probably not, same old same old. \n\nI feel like I had it, I legit had this life thing figured out. I grew up having the childhood everyone should get to have, having nice brothers that I actually got along with, never picked on each other, had good friends, playing tag at recess, decent teachers, amazing parents of course, no abuse or crazy family drama, no mental health issues, **MY LIFE WAS FUCKING INCREDIBLE, IT WAS DAMN NEAR PERFECT, AND NOW I’VE GONE AND FUCKED IT ALL UP**. Why, because I was “bored”? I legit looked at others and thought “hm, everyone around me has some issues, some sort of problem in their life that they have to work through, they have depression and anxiety and take pills, maybe I’m missing out on something?” Yeah, your missing out on all the fun, this is definitely some shit you wanna be a part of. Panic attacks, dissociation, depression, hating yourself (past and present), being anxious over the smallest little shit, and being anxious over serious issues like disgusting and perverted thoughts and being petrified of who you are and who you are becoming, low key not being able to tell the difference between reality and imagination, not sure if you’re actually transgender or not (just to add to the identity crisis), having some admittedly small health issues that are totally livable with but are still too much for me to cope with, not feeling like life is worth living, not being able to contort your mind to fit back in the box of go to work, get home, eat, shower, sleep, and fucking repeat, literally not having any stable ground to stand on, no one to pull you out of the emotionally turbulent seas of the mind, no one rescuing you from the demon inside, you’re just trapped there right with it, just you and it, this is it, one of you have to come out on top, and you’re not sure if you can make it, not sure if you can stick with it long enough. \n\n>“Life’s not about how hard of a hit you can give **(thought it was take honestly but I guess that’s the next part of the quote)**, it’s about how many you can take, and still keep moving forward!” \n\nThanks Rocky. I still love that quote and have almost always lived by it, or something like it, but it feels like this boxing match between me and the “inner demon,” me and life, sometimes me and the world, and everybody in it, this match is really dragging on. I honestly don’t care who wins at this point, can’t we just call it a fucking night and end this thing? I’m sure even the crowd is getting tired of watching at this point, two fuckers just slugging it out in the ring. One goes down, you think it’s finally over, but even spewing blood and spit and possibly some teeth onto the mat, the fighter who was knocked down gets the fuck back up again, how in the absolute shit is that even possible, we all saw, they were down for sure, absolutely out, no way they were getting back up, but here they come again. No breaks, no pep talks from any team or supporters, no wiping the blood away from the eyes or getting a drink of water, ding ding the next round is here, *fight*! Is this supposed to be my life now, a perpetual, unending match? So much for life being about thriving and not surviving, cause all I’m doing is picking up the pieces of myself, hauling my shell of an ass with me back to the center of the ring. I may or may not have been getting into law of attraction shit...who knows maybe I “manifested” all this. A part of me thinks I did, wishes I did, but I know there’s some kind of logical fallacy which quickly and easily dismisses the idea of the law of attraction, I just can’t remember what it’s called right now. \n\nLife is hell, I am in absolute agony at this point. I feel so pathetic, like the world’s biggest loser (luckily I’m not talking about being on the show here, I’m quite skinny actually) for admitting that. I was never someone who easily gave in or asked for help, toxic masculinity is what it’s called these days apparently. Well I suffer from it big time, because showing certain emotions in specific situations is basically illegal, so is ever even contemplating the idea of reaching out for help. Saying “I love you” explicitly and openly like that is really hard and awkward for me to say to my parents. No idea why on that one. \n\nAs I realize I need to wind down this post, and holy shit is it long, not a single soul is gonna read this dribble that’s for sure, I can feel the darkness, the void, the negative thoughts calling to me again. I’m sad. I don’t want to be alone, but I don’t have any friends to text, plus it’s 2:00 am anyway, no one is up, I don’t even exactly want to be up myself because I’m tired as heck, but again the scary bad thoughts and the darkness and inner demon blah blah blah...so stay up I must. Until I pass out or something. I’m so disconnected from the real world, from people, society, life... who knows, maybe all this is a simple fix, maybe I just need to get back out in the world, live with people, sleep normally, eat better, and shit will go back to normal. \n\nMaybe, maybe it’s possible, but it doesn’t seem likely. Where to go from here, not only with this post, but with my self, my life, that’s all I can think about right now. I was making this post to keep my fiery self hatred at bay, to keep my whole mind from erupting into a cacophony of self blame, hatred, criticizing everything I’ve done, while simultaneously getting the same treatment from the intrusive thoughts, and to top it all off of course there’d be the anxiety, calling forth emotions to increase the emotions to such a level I can’t sleep and feel panicky and sick and dizzy, to distort the things distorting and fogging up my brain. Which is essentially dissociation at this point, which can be of help from time to time..\n\nUnfortunately this post only delayed the inevitable, so now here comes all that mess. Wish me luck, wait what the fuck am I saying, I just wrote an entire novel, J. K. Rowling would be envious of how large this bad boy is, no one could ever read this entire nightmarish post. \n\nAt the end I am still all goddamn alone, and letting this all out for the internet to see didn’t help a single fucking bit. \n\nWell, **shit**, that’s my life.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ml4zns/already_posting_here_so_soon_again/", "title": "Already posting here so soon again", "social_network": "reddit", "user": "sOmwhereElse", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 10, "down_vote": 0, "creation": 1617689147, "permalink": "/r/SuicideWatch/comments/ml4zns/already_posting_here_so_soon_again/", "nsfw": false, "first_save": 1635423070.1898675, "replies_charged": false}