{"id": "t5_2qpzs_t3_nqyxl0", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "I am 33 years old. I was born jan 24, 1988, to a military family, both my mother and father would serve, my fathers father, and his father before him; i would be something like 5th generation military if I was serving.   \nMy mother as i remember her is a lesbian, after contacting my father after 20 some years he claimed he never really knew my mother, which both added to and complexed the ideas that I was probably a mistake.   \nI was kicked out of my parents house 1 month or less after turning 18, to the words I remember the most \"don't come back , there is no room in this house for bastards\"\n\nsince before then, since before my mother took me to a counselor for the first time and I can remember lying about thinking of hurting myself (which I have never really done to my own skin)  \nI remember at least the ideas of self harm being taboo, and knowing it was something I should not be sharing with people. \n\nmy mothers choice in partners turned to a lesbian relationship with a woman who would also abuse me, grabbing me by the scruff of the neck and forcing m to my knees as I aged to talk down to me, punishing me for things like sitting wrong at the table while doing my homework, my mother was usually away on course with the military, suffice to say my home life was largely unbearable.   \n\n\nand I say unbearable to my perspective, I have met people with far worse tales than my own and wondered how they has persevered, feeling like my own experiences are trivial in comparison to the abuses that some who I met had gone through, and would go through.   \n\n\nI think at some point I expected these thoughts to subside, to abate, to lessen as I found more purpose and more substance in life, but the truth is, despite the fact i have found work,. even career choices i enjoy, and a name for myself i am starting to be proud of, the ever drifting thought that i do not belong here to begin with has never really left, and I struggle every day to accept whatever place it is that i may assume in this place. A large part of the lies my own mind has told me is that i never wanted to be here, and there is nothing that can make up for the mistake that I was being brought into this world. Despite that, it hurts even still knowing that somehow, people who were capable and willing of love at some point, decided both that that offspring was no longer deserving of their attention, and no part of me has ever been able to console the fact that I did not ask to be here. \n\n&#x200B;\n\nsorry for who I am, who i was, and who i probably will become.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nqyxl0/ive_thought_about_death_almost_every_day_since_as/", "title": "I've thought about death almost every day since as long as I can remember.", "social_network": "reddit", "user": "locust115", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1622675007, "permalink": "/r/SuicideWatch/comments/nqyxl0/ive_thought_about_death_almost_every_day_since_as/", "nsfw": false, "first_save": 1635428435.3551664, "replies_charged": false}