{"id": "t5_2qpzs_t3_mlq4hp", "request": ["56f46b9a-59d4-48f0-aed3-4247ea68706d"], "text": "This sub reddit means a lot to me and have spent a lot of time on it last few years.  \n\nMental Illness stigma is a cultural plague and cancer. Young people are dying every day because of harmful prejudice.  They are abused, neglected, physically and sexually assaulted disproportionately to other sociological classes of people. \n\nThis is the issue.  Abnormal psychology and mental diseases like OCD and Bipolar in principal are no different than diseases of the body like diabetes and cancer. Unfortunately people outside of the medical community make a distinction.  This distinction often includes harmful prejudiced like OCD is a pseudo disorder and sufferers are pretending for sympathy and an excuse, mental diseases aren’t as serious as physical, health care for mental illness isn’t a human right, etc.\n\nIf my life means anything it’s to put in front of a few more people this urgent issue that effects thousands.  \n\nI’m not a psychology scholar but when I say mental illness I am referring to abnormal psychology disorders like OCD, schizophrenia, bipolar, psychosis, etc. I’ve experienced abnormal psychology and I’ve experienced other kinds of so called mental illness like depression and anxiety. While serious, depression and anxiety are universally experienced and are not as debilitating and life threatening.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mlq4hp/im_committing_suicide_causes_mental_illness/", "title": "I’m committing suicide. Causes: mental illness stigma, abuse and neglect, homelessness, chronic illness, poverty, america", "social_network": "reddit", "user": "lastdayonearth71", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1617755840, "permalink": "/r/SuicideWatch/comments/mlq4hp/im_committing_suicide_causes_mental_illness/", "nsfw": false, "first_save": 1635428364.195325, "replies_charged": false}