{"id": "t5_2qpzs_t3_l8y3v0", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "Suicidal ideation, depression, eye pain, insomnia, whatever other mental illnesses suck, but at least are tolerable (im not mad about).\n\nSomehow out of all of that on par with severe eye pain is the decline in work ethic depression causes. To be able to say, yeah i will dp my best to get that done, and just rush it as either late or last minute even though there is plenty of time. It eats away motivation and you know its not gonna magically get better after a certain amount of time. It has just become habit. And no matter what i try to structure my day and get work done my mind just doesnt care. Its an awful positive feedback loop between illness making work ethic worse, and getting less work done supporting poor work ethic through habit. Its awful espescially knowing it's going to continue like this even if i keep trying to change it. By far that is the worst part of my mental illness, letting othets done by being unintentionally dishonest and not being able to fix it through easy means. Right on par with severe eye pain i has at one point,  maybe a bit better, but still worse than not sleeping almost at all for a month. Yes its that bad; thats how much i hate it\n\nThe 2nd worst symptom is having so much but having access to help caring friends and family, good healthcare and not beong able to pull through and not having people hold me accountable when i dont get stuff done on time. It feels like im just being evil then because i am getting away with being dishonest and people are so nice when i actually complete stuff even though it is low quality", "url": "https://www.reddit.com/r/SuicideWatch/comments/l8y3v0/the_worst_part_of_suicidal_ideation/", "title": "The worst part of suicidal ideation", "social_network": "reddit", "user": "Foghkouteconvnhxbkgv", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1612047517, "permalink": "/r/SuicideWatch/comments/l8y3v0/the_worst_part_of_suicidal_ideation/", "nsfw": false, "first_save": 1635427287.1704204, "replies_charged": false}