{"id": "t5_2qpzs_t3_o27gf9", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "I am currently going through a breakup and having to be there for my sick mother in hospital. I've also had a nasty cough the past 2 days which makes my chest hurt really bad when I do cough... I think the worst part for me these past few weeks have been suicidal ideation and I'm not sure how much of it is just ideation or how badly I am at risk, a few months ago I purchased equipment for suicide which I really thought I'd end up using, but then a few weeks ago I was dead certain that I was about to do it, and as I sat in my second garage where I planned to do it, I just chickened out...\n\nI feel like some primal instinct in me told me to stay alive and I went straight to bed, but I ended up having the ambulance called on me, and in a moment of clarity I told them the plan I had and showed them the equipment and they basically told me that I would have probably caused myself serious brain damage if I had tried it and survived.\n\nThis whole time, though, one thing I cannot seem to ease without self harm is the constant barrage of images in my head depicting my graphic suicide or murder, I imagine myself having my head stomped, I imagine myself shooting myself in the head (firearms are not accessible where I am fortunately) and the other main one is imagining myself crashing a car into a tree and the vision of myself dead and bloodied in the car. The best way I can describe this is like watching a gif play in my head on repeat, it's just 1-5 seconds of imagery that I obsess over and the only time I find relief from it is during self harm where I can watch myself bleed or when I'm so tired that I can't think anymore.\n\nDoes anyone else deal with this same thing and have any healthy methods of coping?", "url": "https://www.reddit.com/r/SuicideWatch/comments/o27gf9/intrusive_suicidal_ideation/", "title": "Intrusive suicidal ideation", "social_network": "reddit", "user": "IreneNB", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1623962889, "permalink": "/r/SuicideWatch/comments/o27gf9/intrusive_suicidal_ideation/", "nsfw": false, "first_save": 1635427240.1329882, "replies_charged": false}