{"id": "t5_2qpzs_t3_kyxeon", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "Life is a game of chance and I got the short straw in almost every possible way. I grew up in a rural town in a second world country, where I suffered constant social isolation and negativity. My parents marriage was one held together only by the common belief that a broken marriage would ruin the happiness of their children. My father's bad mood and sadistic temper towards both me, my siblings and my mother was something I grew accustomed to. I can count the number of times I was praised by my father with one hand, I was unwanted, a freak in his eyes. When I was 16 my mother died from a progressing neurodegenerative disease and watching her worsen everyday, the only source of affection I ever got broke me more than anything else. I also grew up very poor, food and water on the table and not much left for developing passions. I always loved photography, fiddling with electronics and geography. However I could never follow these passions due to the cost of equipment (camera,lens, electronic parts that weren't rusted from a junkyard).\n\nI was the weird loner kid in school. From a young age, my facial dropping from Bell's palsy and muscular weakness isolated me a freak in the eyes of those around me. Even beyond my horrendous physical appearance, my personality was always different. I never liked sports and could not play many competitively due to muscular issues, and instead was always fascinated by the natural world, collecting insects and exploring terrain. I did not fit into any social groups and was a victim of bullying by both peers and staff during my time in education. \n\nMy main goal in my teenage years was to study as hard as I could to escape the social and economic situation I grew up in, but my undiagnosed adhd and learning difficulties meant I couldn't stand to sit the school leaving exams needed for 3rd level in my country. When I was 18, I left my town and went to the capital city, where I was taken on as a sort of apprentice by the friend of a kind man who showed my kindness and support in my teen years. \n\nI now work in repair and crafts, making enough money to pay rent, eat and pay learning classes, that's it. I'm 29 now and have accepted I will never have any form of romantic partner or close friends. What I wanted more than any material possession my whole life was the love of a partner, or the sharing of interests with a close friend, but I'm painfully weaning myself off these hopes. Sometimes in my dreams I fall in love with a girl and experience growing up through life together, all the happiness and love it brings, before crashing back down in pathetic melancholy to the real world.\n\nEvery day I suffer at my job due to worsening neuromuscular symptoms, putting myself through that pain just so I can still eat and be a living thing, without the any of the joys of human creation. I just see no point in carrying on. I can't escape my situation with living in a developing world country where people like me are actively avoided and my genetic inheritance of neuromuscular issues is likely to lead me to the suffocating slow death my mother experienced. I don't see how there can be light at the end of this tunnel. I've abstained from drug use my whole life, seeing it as the short term crutch it is. But maybe if it gives me some shot of comfort I've seldom experienced, it might be worth it, even if it kills me.\n\nI've lurked these subreddits for a while now and understand depression is very relative to your social surroundings, how great life is compared to them compared to you. But when you're at the bottom of the barrel like I am, those small defects in your life is only something I could wish for. Don't any of the sources of happiness in your life for granted and stay strong.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kyxeon/i_dont_see_the_point_in_keeping_going/", "title": "I don't see the point in keeping going", "social_network": "reddit", "user": "thiophene123", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1610850806, "permalink": "/r/SuicideWatch/comments/kyxeon/i_dont_see_the_point_in_keeping_going/", "nsfw": false, "first_save": 1635427521.326405, "replies_charged": false}