{"id": "t5_2qpzs_t3_7w055p", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "Hm.  Uh, I'd like to make it clear that I'm not in a suicidal crisis or in a position where self harm is imminent.  I promise.  If you were concerned about that, I'm pleased to tell you that it's not warranted. It is appreciated, though.\n\nI need to be careful of what I divulge here.  It isn't my intent to tell you my whole life story.\n\nAs of this time and date, I am 31 years of age.  I am currently unemployed and I live at home.\n\nAs of this post, I'd tell you that the biggest cloud or whatever in my life is trying to land some health insurance. That is such a depressing process that it makes me wonder if the people who set that stuff up would prefer I die.\n\nWhy don't I speak about the reasons that I'm staying?  That may lift my mood a little bit.  My nephew and I really enjoy the Marvel movies.  The next movie we're going to see together is Black Panther.  The movie after that is one of the overall bigger reasons I chose to hold on.  Infinity War.  I've had these thoughts in my head for the past 6 years or so, but I always promised myself that I'd at least wait until I could see Infinity War.\n\nThere are other reasons I'm sticking around, but my mind is spinning like a tilt-o-whirl right now.\n\nI won't lie.  One of the other reasons I'm staying alive is absolutely sexuality.  Much to my shame, I'm a virgin, but I've had thoughts and urges.  I'm afraid that if I get into specifics, I'll get myself going so to speak and I'll forget what the purpose of my post is.\n\nWith all of that aside, every single day, I feel like suicide is inevitable.  That kind of ties into death being inevitable in general, but I don't want to die.  I say that I do, but I really, really, *really* don't.  I've got things to do and experiences to experience, you know?\n\nIn closing, I'd like to kindly reiterate that I'm not in a crisis and I'll be here tomorrow.  I promise.", "url": "https://www.reddit.com/r/SuicideWatch/comments/7w055p/it_feels_inevitable_and_that_frightens_me/", "title": "It feels inevitable and that frightens me.", "social_network": "reddit", "user": "Idrathernottellyou", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1518043497, "permalink": "/r/SuicideWatch/comments/7w055p/it_feels_inevitable_and_that_frightens_me/", "nsfw": false, "first_save": 1635426143.5779653, "replies_charged": false}