{"id": "t5_2qpzs_t3_p2ts4q", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "I don't know where religion can put a place in here anywhere, but about 3-4 months ago, I was introduced to Christianity. I've been miserable since. It's shown me how horrible of a person I am, and how I'm never going to change. Sin will be a thing I'm supposed to fight all the days of my life. I'm a horrendous porn addict, and it's something that never gets better. I'm tired. I'm tired of holding onto the hope that \"it will get better\". It will never get better. God does leave those who can't listen to their own devices. To their sin, until they inevitably jump into Hell. The Bible even states that he himself \"will have mercy on whom I have mercy, and I will have compassion on whom I have compassion.”  I'm someone who doesn't have a place in that. I pray, and nothing changes. I'm not supposed to expect anything from God, but yet I'm supposed to believe that he'll help. I'm powerless to make myself better, but yet I am to follow his ways. It's all smoke and mirrors to me, and I'm suffocating. I've almost resorted back to cutting to take away emotional pain, but at this point, there is no real way for me to hide it from others. I just graduated high school and live with my parents, I see my girlfriend weekly, and I work almost everyday. I constantly hurt others with the way that I am. Maybe it's the consequences. I can't stand being in my own skin anymore. I can't stand doing anything. I can't stand hurting others anymore. If there was a way to end it all without hurting those around me, I'd be the first one to do it. I'm fucking worthless. I'm in too much pain to go on, but too careful to hurt others. Yet, that's what I do everyday. I hurt the people I care about, and those who care about me. Suicide is a sin, but I'm now convinced that Hell is better than this. Atleast if I was in Hell, I wouldn't have to grasp onto the false hope that I may be saved. A few months ago, I snapped. That was the first time I ever felt so numb. I had a plan. I wanted to get hit by a train. I figured it would be easier on everyone if it was harder for them to identify my body. All it was gonna take was a phone call for a ride into town.  \n\n\nI don't know if my want to not hurt others is gonna keep me alive.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p2ts4q/im_a_christian_and_im_not_sure_if_i_can_do_this/", "title": "I'm a Christian, and I'm not sure if I can do this anymore.", "social_network": "reddit", "user": "Wizard826", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1628747582, "permalink": "/r/SuicideWatch/comments/p2ts4q/im_a_christian_and_im_not_sure_if_i_can_do_this/", "nsfw": false, "first_save": 1635422999.9117358, "replies_charged": false}