{"id": "t5_2qpzs_t3_pya6h3", "request": ["4162f604-29a0-4041-a85b-c249e1ca13f8"], "text": "I have 2 diplomas about engineering and studying master. Yet for some different reasons, I earn so little. I'm just trying to survive. While my economic condition stresses me, my family and boyfriend says the problem is not about my broken dreams or no motivation to live. They say I am crazy. I make everyone around me angry. \n\nI think today my boyfriend and I broke. I'm not sure yet. But doesn't matter. He said I am a crazy person which never heals so he cannot let me meet his mom. So in any mean, there is no future about us. \n\nI already lost my future, probably at the age of 7 or something when the society stamped me as a genius yet crazy. Yet I tried everything to feel like a part of this massive humankind or at least the planet. \n\nI have no idea about what to do. I tried so hard until the age of 25. It doesn't seem like I will be able to change anything after these much years. \n\nToday I wrote my testament. I couldn't die yet. But I accepted that I am a broken animal that should be eliminated by the means of evolution. \n\nTomorrow I will take a report from doctor to send it to my workplace. Then I will see a psychologist.\n\nThere is nothing else about future for me. This is all that I can see. No dreams, no expectations. A great darkness that always help me to believe that I am not wanted in this planet. \n\nI will only miss my cats. So sad to be a disappointment for them. But be honest girls, I even cannot take care of myself.\n\nI guess some people here will try to help me. Please do not be angry if I answer you. I'm making everyone angry. It seems like i don't know how to communicate.\n\nThanks to countless internet individuals that read this nonsense.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pya6h3/depressionanxietyasperger_i_am_a_burden/", "title": "Depression+anxiety+asperger= I am a burden", "social_network": "reddit", "user": "kumonogatari", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1632967934, "permalink": "/r/SuicideWatch/comments/pya6h3/depressionanxietyasperger_i_am_a_burden/", "nsfw": false, "first_save": 1635422904.4648767, "replies_charged": false}