{"id": "t5_2qpzs_t3_i9bok6", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "First off all, I would like you to excuse any spelling mistakes. English is not my first language.\n\nI am currently 15 years old and living in Germany. I live with my mom, my dad left us when I was 4. (Don't mind that, he was an abusive asshole.)\n\nLet's start things of by saying my mental health is the worst it had ever been. I tried to kill myself multiple times with pills, have been self harming since I was 9/10 and had problems with bulimia in the past.\nTo be honest, most of these problems have been caused by my mother. She has always had problems with self hatred and stuff like that, but instead of solving them in a healthy way, she would make fun about other people (surprise, she is also SUPER racist.). I was always chubby, even when I was a young kid around the age of 5-6. She would constantly make jokes about my weight. At first I took it, thinking it was normal parental behaviour, but then later mentioned how it made me feel really really bad. There was a special reason why it made me feel so bad, one that could have been prevented easily: I was bullied through all of elementary school (was 6-10 back then). Mostly about my weight and my physical appearance in general, to the point where I can't look at a mirror anymore without feeling disgusted. She did absolutely nothing about that.\n\nThe 'it's actually a bad thing but you don't know because no one ever told you' thing hit quite hard later when I noticed her severe alcoholism. She used to go out and drink and I thought it's normal, until one night she didn't get back on time and I started to cry heavily. She came back the next morning and acted like nothing happened.\n\nYou see, I used to like my mom for not being one of those 'boring christian moms who won't allow you anything'. She even proudly claims, to this day, that we are more like roommates instead of parent/daughter. We also do get along nicely sometimes, making jokes and laughing, and I forget why I hate her so much. I would then feel bad for hating my own mother, because, HoW CoUlD YoU HaTe YoUR ParEnTs?????\nShe also doesn't have a job, so we never do stuff together. \n\nAs the time passed by, I also developed severe depression, was in the ward for a few months and she didn't seem to care. All she ever says is, that no one ever asks her how she is doing and I always make everything about me. Note to this, my mother DOES have severe mental issues which should get treated, but she actively neglects any help she gets offered. Even before I was born, my grandma questioned if she would be mentally stable enough to have me.\n\nFast forward to this day: I told my psychologist I can't live at my mothers flat anymore because everything triggers me way too much. She arranged a meeting with a guy from german CPS (Jugendamt). It looks like I will be moving out in the next 2-3 weeks, to a home for kids with troubled parents/homes. \n\nHere comes the actual problem: My mom is super against this and tries everything to keep my living here. She is super nice to my, cooks for me (which she never did prior to said event), even gives me money occasionally. Now I feel like she is trying to make up her past mistakes and I feel horrible for disappointing her like that. I am afraid of being treated worse in my 'new' home.", "url": "https://www.reddit.com/r/SuicideWatch/comments/i9bok6/i_feel_like_crap_for_escaping_my_abusive_household/", "title": "I feel like crap for escaping my abusive household", "social_network": "reddit", "user": "trashii_", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1597364434, "permalink": "/r/SuicideWatch/comments/i9bok6/i_feel_like_crap_for_escaping_my_abusive_household/", "nsfw": false, "first_save": 1635422935.2539647, "replies_charged": false}