{"id": "t5_2qpzs_t3_gr8vjj", "request": ["9cb7ef4e-af9d-4403-b84a-be5dd3f5e75c", "e79a79ca-6f5c-44ca-b1e4-309a4afa83c2"], "text": "Evening, folks. \n\nI'm a 28-year-old woman living in the southern U.S. I've had anxiety at all my life and have more recently been diagnosed with moderate-severe OCD and health anxiety. \n\nAs you might imagine, a global pandemic is my worst nightmare and personal hell. I'm terrified of this virus, of its randomness and brutality. I have convinced myself that I will die should I contract it, or develop lifelong, debilitating complications even if I do survive.\n\nI am currently quarantined with two roommates. We are all fortunate to be youngish, physically healthy, and able to work from home (for now). We have plenty of resources and comforts. I should be grateful, yet I am abjectly miserable (which of course is just compounded by guilt).\n\nI miss my coworkers, my office, and my friends. I desperately miss and am deeply worried for my mother, who, although healthy, just turned 59 and must continue going into her office every day. I fear for my stepdad, who is 74 with chronic heart disease. Every day, I am choked with panic and despair at the thought of someone I care for sickening and dying.\n\nI am also so, so fucking lonely. I had a partner I loved beyond measure and intended to marry one day. We were long-distance, and the hope of seeing him once things were safer gave me reason to try to carry on. Until it came to light that he had betrayed me in the cruelest way possible. I broke up with him two weeks ago. It hasn't been a clean or dignified break. I've reached out desperately begging for answers more often than I'm proud to admit. I'm in shock, hollowed out. This wasn't supposed to happen. Not with him. \n\nI have no coping mechanisms. Every single event I was looked forward from mid-March on has been cancelled or postponed indefinitely. I can't drink a latte on the patio at my favorite coffee shop. I can't go work out at my rowing studio. I can't cry on my mother's shoulder. I can't even try to meet new people, go on dates, and maybe begin to heal my heart from my ex. I miss sex and the warmth of another's skin and sleeping beside someone so goddamn much. I'm confined inside these four walls for the indefinite future. I know hundreds of the world's best minds are working at record speeds towards treatments and even vaccines for this disease, but science by nature is slow, and none of them are guaranteed. We may be trapped under the threat of COVID-19 for years to come.\n\nAll of this is enough for me to seriously begin considering ending my life. I feel like all I have to look forward to is daily terror, unfathomable loss, and loneliness so acute my body aches. It seems inevitable that I will contract the virus and die in some horrifically painful way, alone in a hospital bed. Or that I will lose everyone I care for before I can ever see them again. If that is truly all my future holds, why should I not take my fate into my own hands?\n\nPlease understand: I don't actually want to die. I'm terrified of death. Until this pandemic, I was functional and happy enough. These thoughts are horrifying to me, but I'm beginning to feel as though I have no choice.\n\nNote: I've been in CBT-based therapy since September and have continued my biweekly sessions through teleservices since March. I'm not medicated and am very reluctant to be due to the many well-documented side effects.\n\nPlease help. I would love hope, commiseration, or just someone to talk to. Stay safe.", "url": "https://www.reddit.com/r/SuicideWatch/comments/gr8vjj/28f_no_stranger_to_mental_illness_but/", "title": "28F. No stranger to mental illness, but experiencing suicidal thoughts for the first time. Help, commiseration, and connection, please.", "social_network": "reddit", "user": "AngelicParadox0392", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1590538150, "permalink": "/r/SuicideWatch/comments/gr8vjj/28f_no_stranger_to_mental_illness_but/", "nsfw": false, "first_save": 1635425154.6021433, "replies_charged": false}