{"id": "t5_2qpzs_t3_p36z5y", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I have a plan, I know when it will happen. I have almost everything sorted. I know where and to whom my valuables and possessions will go to. Almost everything is set. Shit, I’ve even already asked for the days off at work. I’m going to purchase a fire arm and drive to up to Colorado, then shoot myself in the head after spending some days enjoying the snow in the mountains. My panic attacks are always soothed when I think about killing myself. I always think, “yeah it’s fine, you’re gonna die in December anyway” and then I’m calm. It would be easier to do it if I didn’t have loved ones. I’ve successfully isolated myself from friends. Although I’ll still participate in my best friends wedding, I won’t be seeing him much before then. I’m a vain, selfish, egotistical, manipulative, grimy, disgusting, and repulsive person. Waking up everyday in my body and in my mind gives me an overwhelming sense of regret, fear, anger, and depression. I hate myself more than anything and anyone I’ve ever met. I do not deserve the good people around me. I do not deserve to be attended to or loved in any way.   People will start to see how badly I plagued their lives. In their last stages of grief they will come to realize that I was a disease. I deserve to die right this second, but I have to wait. Idk whether it’s selfishness or honesty. But I want to give them good memories of me in these last months. I want people to think that I’m turning my life around, taking time to heal myself, and making the right choices so that they don’t notice how bad things really are for me. No one can save me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p36z5y/planning_suicide_gives_me_a_purpose/", "title": "Planning suicide gives me a purpose", "social_network": "reddit", "user": "Known-Plastic2550", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 40, "down_vote": 0, "creation": 1628796577, "permalink": "/r/SuicideWatch/comments/p36z5y/planning_suicide_gives_me_a_purpose/", "nsfw": false, "first_save": 1635422298.6517599, "replies_charged": false}