{"id": "t5_2qpzs_t3_psqwz8", "request": ["0c6360e0-5fd0-41bf-97f4-d870570d8b8d"], "text": "I am 16 and idk if anyone would reply to this but i just dont have anyone else to say this to so imma say it here. Coming from a conservative  very very strict and toxic. household my mental health was always detoriating From when i was 12 i would slap beat and cry myself to sleep almost everyni8 back then i had no idea it was a problem and thought it was a thing everyone did and was part of growing up. My dad is very abusive my parents have the worst marriage but wont divorce they wud fight and the environment in the house was horrible since when i was a kid i wud see my mom cry get beaten up and the fights r always never ending though the beating has stopped.\n\nI always feel lonely i hate my body my face my hair basically every inch of me and it all rooted from my parents and families judgments. my parents r obviously not the best once u wud want to have i wud rather be an orphan. I have no future i have no freedom i cannot go out wid my frnds i cannot cut my hair to the length i want and i cant evn shave my own body hair on my will.When i did do it widout my moms permission she got really mad and beat me up so i stopped and i just feel so insecure about my body hair cuz evry girl shaves it and i feel like a man. my education was also stopped fr a year cuz my dad was mad at me for taking my moms side so he dint take admission and i missed a whole year.\n\nI just wanna kill myself if anyone got serial  killer tendency lol i will pay u to kill me cuz i am too scared to do it myself i hate evrything abt my life thr is no hope i will never be happy noone can evr love me i cant evn go to skll cuz i am scared of showing my ugly face to anyone.  I have panick and anxiety attacks my hands r filled with scars from self harm i am so tired of this cycle i try to start new to stop being like this but its not possible. I wish i cud die in my sleep and never wakeup.i dont wanna self diagnose or fish for compliments or sympathy. Maybe i do have depression and body dismorphia but i dnt wanna say it widout professional diagnosing. \n\nAll i wanna know now is how do i kill myself easily it doesnt matter if its painful or not. Or how do i escape from this cycle cuz it doesnt seem possible.", "url": "https://www.reddit.com/r/SuicideWatch/comments/psqwz8/can_smone_kill_me_i_am_tired_of_this_kife/", "title": "Can smone kill me? I am tired of this kife", "social_network": "reddit", "user": "bubblegumloathing", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1632255043, "permalink": "/r/SuicideWatch/comments/psqwz8/can_smone_kill_me_i_am_tired_of_this_kife/", "nsfw": false, "first_save": 1635426297.3820612, "replies_charged": false}