{"id": "t5_2qpzs_t3_q5c7fs", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "22M I've never had a girlfriend and most likely never will. Most of my friends have moved away from my hometown and I rarely ever see any of them. I have 1 friend who I do love dearly that I do see constantly but my family is moving 2 hours away and the only way I can stay nearby is if I get my license but I keep failing and just don't wanna try anymore. I've wasted over $600 on driving lessons and tests and the only thing I have to show for it are the cuts on my left arm. The only times I don't feel like a total loser are when I'm hanging out with my best friend and if I lose that then my life is over. I have 3 possibilities right now: 1 get my license, 2 move 2 hours away (by car so over 10 since I'm an idiot that can't fucking parallel park) or 3 kill myself and I'm NOT moving to that shit hole of a town. I just wanna get some fast food, guzzle it down and then jump in front of the 12:40 southbound train I live near and be done with this pathetic miserable thing that I call my life. I don't wanna hurt my friends and family but I'm sick of suffering. I've wanted to kill myself since early highschool and as the years went on my desire to end my life has grown and grown. At this point my biggest fear is that when I'm in my 30's I'll look back and remember how much happier I was now. What if I don't kill myself now and I regret it? I will have suffered for 8 god damn years for no reason. I have nothing to look forward to besides tv shows and movies. I am the prime definition of a loser and I think it's finally time I end this sad story that is my life. It won't be killing myself, it will be letting my soul rest in peace", "url": "https://www.reddit.com/r/SuicideWatch/comments/q5c7fs/im_a_loser_and_just_wanna_kill_myself_to_end_my/", "title": "I'm a loser and just wanna kill myself to end my suffering", "social_network": "reddit", "user": "barwhalis", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1633885838, "permalink": "/r/SuicideWatch/comments/q5c7fs/im_a_loser_and_just_wanna_kill_myself_to_end_my/", "nsfw": true, "first_save": 1635425185.54054, "replies_charged": false}