{"id": "t5_2qpzs_t3_lnxmh6", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "Around this time last year I got expelled from school because I was involved in a threat against it (kinda). It wasn’t actually that but my ex and his friends told the school that along with fake information. I don’t blame them, maybe they did think they were in danger. It actually was just a suicide pact, at least at first. We were going to some guns, some beer, and some weed, hangout one last time and shoot ourselves. Eventually some people in the pact thought “Fuck it! If we’re gonna die let’s bring some others too” so a list was made of hostages to bring along. I knew it was wrong but I wasn’t going to make to 15 so who cares? Anyway when the police got involved we were scared shitless so we went with saying it was just a joke. We had to fake evidence that it was just an inside joke so we didn’t get juvie or jail or whatever the fuck was gonna happen. I got so caught up in this web of lies that I started believing it. “I would never even think about hurting myself, let alone another person?!? I’m the victim here!! It’s the delinquents I surrounded myself with, not me!!” It actually took me until today to remember what actually happened...wtf is wrong with me? How could I forget? How did I just casually forget that I wanted to end somebody’s life? In hindsight, I probably would’ve had I not been caught, no matter how much I try to convince people otherwise. Ever since this happened my anxiety and depression have been crippling. I have so much trauma from all the interviews, phone calls, and searches. It feels so horrible when you’re the villain. Nobody cared about my side of the story, I’m just a monster. I want to die so badly. My life is a punishment. I’m such a disappointment. I had so many things going for me and I fucked it all up. It doesn’t get better. I’m the scum of the earth and I deserve to be purged from it. I’ve only gotten more suicidal and more violent. I need to be put down before I hurt someone. I can barely even function anymore", "url": "https://www.reddit.com/r/SuicideWatch/comments/lnxmh6/okay_hear_me_out_i_might_be_better_off_dead_vent/", "title": "Okay hear me out, I might be better off dead (vent)", "social_network": "reddit", "user": "MsKrabs", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1613790150, "permalink": "/r/SuicideWatch/comments/lnxmh6/okay_hear_me_out_i_might_be_better_off_dead_vent/", "nsfw": false, "first_save": 1635427702.8329647, "replies_charged": false}