{"id": "t5_2qpzs_t3_q8wh6n", "request": ["0c6360e0-5fd0-41bf-97f4-d870570d8b8d"], "text": "I don’t know what to anymore. I (20/f) have struggled with depression since I was thirteen, around 17 I got my ed and now it’s the worst it’s ever been. I am in nursing school in Germany and it’s so exhausting and tiring and it’s just too much for me. I have been home for 3 weeks with burn out now. To all that my gf got thrown out 4 months ago and has been living with me. There’s just the fact that I live with 5 other people in a shared apartment. (I was thrown out by my dad last year cause he choose his new gf of a year and their newborn son and didn’t want me there anymore so I had to take this place) 3 are over 40 alcoholics and harass us a lot. Im addicted to weed since I moved out and the pandemic startet. The last 4 months have been one of the worst times in my life. For 4 months we have been trying to get a place to live but no one wants us and I have to take care of all that, because my gf is majorly depressed ever since she came here, which I can understand to 100% and I have no problem with that but that doesn’t change the fact that it is exhausting. I don’t really have hope anymore and we’ve been in my room for 4 months it’s just getting harder and harder. My gf is also getting worse and worse and I also don’t know how to be a good supportive girlfriend since I don’t even know how to get out of that state myself. I think about ending it more and more, usually there is a little feeling that I don’t actually wanna die but it’s slowly going away. I feel like a failure, my mom treated me like shit my whole life, my dad threw me out after being my hero for all my life, my grandparents stick to my dad and just make feel bad about everything I do, I feel like the worst gf in the world, lost most of my friends this year cause of depression and I’m just tired. The only things making me happy are drugs and if that is the only good thing in life for m I don’t think I want it anymore. I’m done. Some people are just not cut out for it I think. I’m really just so tired of all this.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q8wh6n/i_dont_know_how_i_can_keep_going_on_im_tired/", "title": "I don’t know how I can keep going on. I’m tired.", "social_network": "reddit", "user": "Odd_Smoke9280", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 19, "down_vote": 0, "creation": 1634328784, "permalink": "/r/SuicideWatch/comments/q8wh6n/i_dont_know_how_i_can_keep_going_on_im_tired/", "nsfw": true, "first_save": 1635426287.2520807, "replies_charged": false}