{"id": "t5_2qpzs_t3_ab6bv7", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "Given the fact, most don’t succeed in moving up in social class but in fact stagnant, being born into poverty is a huge indicator of life as it stands to be, disfunction and discontentment, now that we understand poverty is usually a life sentence, for “normal people”. We can then look at my other inhibiting factors, I am quite ugly 4/10 to 5/10 at best, I am also below average 5’6”, 2 standard deviations below average height for a male. Height influences how you are seen, so this it has been shown to have correlation to election outcomes, promotions, attractiveness and how successful you look, so being a male cursed with female height is not exactly the best when coupled with the other two, furthermore, I occupy some shitty podunk county in New York State, so there is no opportunity. The cru de grau, of this hopeless spiral, I have ASD, given this information, I can’t make friends, despite my numerous attempts. For this reason I am largely isolated and alone, most people with ASD will be unemployed or underemployed. We can combine all these factors to understand, life for me as it stands is overly pointless, I would be living to run the fucking hamster wheel so that machine works, thrown to the wolves while expect to still provide what is remaining to some fucked up pyramid. I don’t There is a reason for me not buy a revolver in two years time and blow my fucking brains on the wall, I will never be sad and I won’t have suffer this way ever again, no more inferior genetics, fucked up body development and poverty, the move to neutral which is death, is better than the suffering that is my existence. If there is a god, he certainly hates me, he wouldn’t have created me so fucked up if he was benevolent.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ab6bv7/hopelessness/", "title": "Hopelessness", "social_network": "reddit", "user": "Therealreindeerlover", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1546255581, "permalink": "/r/SuicideWatch/comments/ab6bv7/hopelessness/", "nsfw": false, "first_save": 1635426448.5041444, "replies_charged": false}