{"id": "t5_2qpzs_t3_pr1j17", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "Since age 10 I've been begging to die in my sleep. Age 11 was my first attempt at suicide. Tried a few other times throughout my 37 years here. Man I can't seem to get it done right. Now I have a family,  and I still am disappointed every morning I wake up alive. The thoughts and fantasy of dieing never goes away. It has been an everyday thought my entire life. But the thing I hate more than not being able to succeed at ending it, is the guilt people put on me to stop me. The \"how much pain I'll cause those who love me\" bs guilt. The \"think about your kids\" guilt. I hate hurting others, and people play that guilt card because of it. So now I have no choice but continue to wake up everyday disappointed that I did and go to bed every night hoping that I don't wake up. It's a everyday cycle. Why can't I just be allowed to take my life if I want without the guilt of who feelings may get hurt? When does the dreams of death become that much closer to reality, that how others feel isn't even a care for me anymore and I'm actually able to succeed my goal. Or am I stuck here in the land of the living, where I wake up everyday breathing, putting on a fake smile and fronting like I'm happy to be alive. Ugh...it's so damn frustrating. People say there is a \"God\"...Well I've been begging him to die in my sleep since 10 years old and I still wake up everyday. So no I don't believe in any \"God\". The thought that I might have to live out this human life until I'm old makes me cringe. Makes me hate living even more. Listen I gave life to 2 people, who have a ton of support and family and will be loved and live great lives. I should be able to make the choice of letting my life go if I want to, without the guilt bs stopping me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pr1j17/why_do_people_guilt_me_into_living_when_i_just/", "title": "Why do people guilt me into living, when I just want Death", "social_network": "reddit", "user": "Different-Truth4137", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1632026896, "permalink": "/r/SuicideWatch/comments/pr1j17/why_do_people_guilt_me_into_living_when_i_just/", "nsfw": false, "first_save": 1635426175.9342847, "replies_charged": false}