{"id": "t5_2qpzs_t3_p6yp9c", "request": ["9cb7ef4e-af9d-4403-b84a-be5dd3f5e75c", "e79a79ca-6f5c-44ca-b1e4-309a4afa83c2"], "text": "And I don't blame them, either. I've seen a dozen doctors, tried as many anti-depressant medications, tried other therapies both well-known and experimental. I've tried making friends - still don't have any. I've tried dating - haven't had one in over 7 years. I've tried getting an education - dropped out of college for the second time 7 years ago and still in debt from the attempts. Tried support groups - couldn't relate, my problems weren't \"big\"/real enough, and now with the pandemic they aren't being held anymore anyway.  \n\nNothing has helped. I'm 29 years old, working a dead end job, with no friends, still living with my parents. Speaking of which, my mom was the last holdout but I can tell she's fed up. She thinks I'm not trying to get better, believes I can do more to improve my life. I don't think she'll ever understand how I feel, how every movement, every action, every time I get out of bed requires a monumental effort. Working 42 hours a week is all I can muster, and it's required just to pay what rent they do ask for, on top of car payments, paying down student loan debt, credit card debt, and for food because I'm a lazy fat fuck that eats out way too much but can't seem to stop that, either.  \n\nSo that's it, I have no one on my side. I guess not no one, there's one last person - someone I met here on reddit that cares about me. Unfortunately, she lives across an entire ocean and then some, so I will likely never meet her or be able to become IRL friends with her so really we just commiserate about how shit our lives are.  \n\nI think I've hit my wit's end. I'm done trying to improve my life. Nothing I've ever done has made me feel like there's any hope or happiness in this life for me. I'm just going to continue living the way I am - work, video games, sleep repeat - until my mind snaps and I toss myself off a bridge, or until my parents kick me out, at which point I know they've officially stopped caring for me completely, and I can finally end my life without any guilt.  \n\nI hope the former comes first. I really don't want to be here anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p6yp9c/literally_everyone_has_given_up_on_memyself/", "title": "Literally everyone has given up on me...myself included", "social_network": "reddit", "user": "ThrowAwayPillow123", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1629316089, "permalink": "/r/SuicideWatch/comments/p6yp9c/literally_everyone_has_given_up_on_memyself/", "nsfw": false, "first_save": 1635425156.8927913, "replies_charged": false}