{"id": "t5_2qpzs_t3_pjizb9", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "They’ll be upset with me to say the least. \nMy mom will scream at me for not thinking positive and not coming to her sooner, even though she’s emotionally unavailable. \nMy dad will berate me for not praying hard enough and will tell me to “snap out of it”. He will likely take/destroy/hide my things as punishment. \nThe only adults I trust are my teachers, ironically. But they’re mandated reporters. They suggested a mental hospital but I’ve been there so many times and it never helps. \nI don’t need a time out after a serious traumatic event, I just… I just need to die. It’s not a feeling of overwhelming pain as if something traumatic just happened. But a feeling of exhaustion and hopelessness after a string of traumas. \nJust a feeling of emptiness because I have nothing to live for. There’s no reason to exist and nothing to hold me here. If I don’t exist there’s no pain to be felt. \nI’ve tried everything I can. I’ve gone back to school, I’ve used the internet to meet others and find resources, I’ve tried looking for groups to join and places to make friends. I’m always alone. \nA hospital won’t help. I’m not in immediate danger. They’ll just tell me what I already know and up my dose of meds. That doesn’t change my life. \nA hotline won’t do me good because they’ll ask me to wake up my parents. The crisis text line just suggests coping skills and safety plans. I already know I shouldn’t cut but it’s the only thing that helps. It gives me dopamine and helps me sleep. \nI already know about meditation and breathing and meds and therapy… \nThat doesn’t change the pain in my life.\nEvery day I’m at school, my PTSD bombards me with horrible memories and intense feelings of fear.\nAt home, my parents fight and involve me in their petty games. They’re emotionally abusive and neglectful. \nI don’t have any friends to see or talk to. \nThe partners I had abused me and I’m left with the trauma from that. I know therapy can help heal those things but. \nI’ve been alone for so long. The pain has been here for so fucking long. I’ve never been happy. I’ve lived my entire life being abandoned and tortured.\nI just want out…", "url": "https://www.reddit.com/r/SuicideWatch/comments/pjizb9/i_want_to_commit_suicide_i_have_everything_i_need/", "title": "I want to commit suicide. I have everything I need. But I’m afraid to tell my parents.", "social_network": "reddit", "user": "moralmeemo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 277, "down_vote": 0, "creation": 1631003454, "permalink": "/r/SuicideWatch/comments/pjizb9/i_want_to_commit_suicide_i_have_everything_i_need/", "nsfw": true, "first_save": 1635425531.0350456, "replies_charged": false}