{"id": "t5_2qpzs_t3_pqebn9", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d"], "text": "I have been doing manual labor since the young age of 12 right before I turned 13. I always thought hard work would get me somewhere someday but I've been busting my ass for years. I'm now 26 years old and I have a wife and a beautiful baby I love so much that it hurts even more knowing I'm such a failure. I have bills that are just non stop piling up and no way to pay them as I'm jobless yet again. I know finding a purpose is what people do to enjoy life and that money won't bring happiness, but I'm apparently a clueless fool. I only want to be able to provide for my family and show my daughter that her father is successful and that she can be too. I have many ideas for buisnessess I'd love to try but horrible credit and absolutely no money. I'm sick and tired of renting and would love to have a home that my money would go towards but again horrible credit and no money so I have no way to get a loan or buy a home. I've felt like a complete failure for years. Started feeling that way sometime in high-school. I've had depression for years and I can't kill myself because people depend on me but I'm so useless I can't provide my family with anything that they deserve and I'm just a burden for them to be around. I want this all to stop but I've tried everything and can't succeed. They deserve better than anything I can provide. I regret marrying my wife because I've ruined her life but I hate thinking that if I didn't I wouldn't have this beautiful daughter but then I just think of how I'm failing her every day. I hate myself so much. I hate my life so much. I hate feeling so incompetent. I hate feeling like I can learn things so easily but not be able to figure out how to become successful. I hate trying to research how to start a business with nothing to always end up at the same place that it's impossible because of my bad credit and lack of money. I hate it all. Even when I had a full time job getting paid 600 a week, all I could manage to do was pay off my bills and barely be able to provide enough groceries to get by.  Being depressed for so long leaves me feeling exhausted as is all the time but throw in long hours with labor intensive work where you become physically drained as well just leaves me in an even worse mindset every day. I'm close to the edge. I know nobody can help me so I'm scared of what's to come. I'm already fucking my family over so I I'm gone how much worse will it be. But maybe that's the answer. Let it be worse for them for a little while knowing in the long run they will be able to turn it around without me dragging them into the mud. Fuck me. Fml.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pqebn9/failure/", "title": "Failure", "social_network": "reddit", "user": "TheProcras", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1631933271, "permalink": "/r/SuicideWatch/comments/pqebn9/failure/", "nsfw": false, "first_save": 1635426928.119957, "replies_charged": false}