{"id": "t5_2qpzs_t3_nl42ix", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "Don’t know if anyone will read this but I sure do hope someone will.\nI have a diagnosis for bipolar disorder. I was on meds for a year but stopped two years ago.\nI remember when I used to be naïve and I sort of wish I still were. There are so many problems in the world. Wars that will never end, a shitton of hate wherever you look, the pandemic and a massive lack of intelligence.\nI do not see a bright future. \nIf we’re talking about the pandemic - god, how much I hate the people who’ll believe anything. The longer people don’t get vaccinated, the more the virus has time to mutate. Soon enough the vaccines we have now will be too weak for the new covid strains and this will all start all over again. I kind of do not think the pandemic will be over for the next five years at least.\nI used to be a person who could find the good in the world. I am not able to anymore. So so much hate and differences and egoistical behaviour.\n\n\nI feel so lonely. I feel alone in my thoughts. From time to time I think about suicide again.\nI fantasize about it and I can’t decide which would be the best scenario - I die, all suffering ends, or maybe the scenario where I survive and hope that everything turns out for the best, I learn my lesson or some shit like that.\nI found some pills from when I used to be on meds. \nI had thought about what would happen if I took them all at once. \nAfter some googling turns out that the pills I have are advised to be used on patients who might want to commit suicide as they are relatively hard to overdose on. So that won’t work I guess. \nI’ve realized that I wish I wasn’t fully aware about suicide. I think that people who commit to it probably are not fully aware of what exactly they’re doing or what the impact will be. \nI am fully aware. That keeps me away from it. For now. \nHow do I escape the loneliness, the pessimistic feelings, the dread?", "url": "https://www.reddit.com/r/SuicideWatch/comments/nl42ix/loneliness_and_general_melancholy/", "title": "Loneliness and general melancholy", "social_network": "reddit", "user": "rhoema", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1621988918, "permalink": "/r/SuicideWatch/comments/nl42ix/loneliness_and_general_melancholy/", "nsfw": false, "first_save": 1635427494.0918345, "replies_charged": false}