{"id": "t5_2qpzs_t3_8zy19c", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "\n  I’m suicidal, I’ve wanted to die since I was little girl.  My depression has gone hand in hand with it.  Over the last few years it’s gotten worse and I’m at my breaking point. I know I can be rational and an intelligent person, but I’ve become my own worst enemy.  I’ve lost all inspiration and motivation.  A few weeks ago I was going to forgo all rational preparations and just end it.  I’ve made other posts about what I’m going through.  I was willing to crash my car just so I could die and that is not the death I want.  So, I’ve recently made a pact with myself.  I’m giving it 5 years.  I’m going to try my hardest and persevere.  For myself and my family, and also to prove that I have tried the hardest I can to make life and living work.  However, I can’t do it on my own anymore.  I need someone I can be accountable to, someone I have to be honest with when I can’t be honest with myself.  I do have family and loved ones but my spirit is dark and I cannot bare to put that on them as well.  I also want to allow myself to be anonymous but still open.  My biggest fear is getting help and having these thoughts and feelings used against me, taking away my agency.  \n   If you’ve managed to read all of this and lasted this long then maybe you can be that person, and surprisingly I believe I can be that for you, if you have a plan. I’m a lot better at taking care of others than I am at taking care of myself.  ", "url": "https://www.reddit.com/r/SuicideWatch/comments/8zy19c/honestly_i_need_helpor_else_i_wont_make_it/", "title": "Honestly, I need help...or else I won’t make it.", "social_network": "reddit", "user": "HuhmingBurrd", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1531938295, "permalink": "/r/SuicideWatch/comments/8zy19c/honestly_i_need_helpor_else_i_wont_make_it/", "nsfw": false, "first_save": 1635427775.6685138, "replies_charged": false}