{"id": "t5_2qpzs_t3_hs477o", "request": ["9cb7ef4e-af9d-4403-b84a-be5dd3f5e75c", "e79a79ca-6f5c-44ca-b1e4-309a4afa83c2"], "text": "I don’t have a shitty life, but I feel shitty all the time.  I feel shitty for having no reason to feel shitty.  I always wonder when the people in my life are gonna realize that I am shitty, but anything shitty that has happened to me has been a result of my own choices.\n\nWhen things get bad in my head I do shitty things on purpose to push people away or make them hate me.  I don’t want to hurt the people close to me but I feel like it’s inevitable that I’m going to end up killing myself someday and I’d rather people just say ‘good riddance’.\n\nMy dad killed himself, my uncle did, my grandpa did.  Idk about before that but I’m sure it goes back further.  I think about it every day.  I don’t let myself make new friends.  I sabotage relationships with old friends.  I never talk to any of my family.\n\nI don’t like feeling like this and I know I need help, but it doesn’t seem worth it.  I don’t think I want to kill myself, I just don’t want to live.  I don’t feel worth it and I don’t see a point in a life where I have to force myself just to exist.  It’s exhausting and I dread it.  I bought a gun just to always have the option.  I just don’t want anyone to miss me and it feels like I’m getting closer and closer to achieving that goal.\n\nI’m not on the verge of killing myself right this second.  I did put the gun to my head earlier tonight, but it wasn’t the first time and it won’t be the last.  Each time I can pull the trigger a little more.  And again, the thing that set me off was a result of my own doing.\n\nIdk what I’m trying to accomplish posting this tbh.  I never tell people this.  I’m not looking for consolation or commiseration.  It’s prolly just cuz at the end of the day, if I do end up pulling the trigger, none of you would know or care anywayz.\n\nSorry if you ended up reading all of that.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hs477o/dont_reply/", "title": "Don’t reply.", "social_network": "reddit", "user": "yepimbonez", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1594878695, "permalink": "/r/SuicideWatch/comments/hs477o/dont_reply/", "nsfw": false, "first_save": 1635425159.8289723, "replies_charged": false}