{"id": "t5_2qpzs_t3_p947ze", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "\nI (f19) was diagnosed officially with depression after a suicide attempt(I wanna say 2 years ago; early 2020) and epilepsy a few months ago (maybe 6?)\n\nI can’t get over the constant feeling that I now have a painless and easy way out (not taking my meds which prevent seizures and just standing by water, a stairwell, balcony ect) especially after I almost died on a stairwell last month had my parents not got to me in time (I usually live alone so this was especially scary for them). \n\nMy entire household has been on paranoia mode since then. But living like this I can’t get over the feeling that I’ll die, and I won’t care. I don’t care enough to remember my meds, I don’t care enough to avoid stairwells at times when my seizures are most likely. I barely remember to feed myself (I’m medically underweight, and honestly after being told to gain weight I think I’m developing anorexia in rebuttal). \n\nI thought hard about therapy again (I’ve been before many times) but nothing can help me get over the constant feeling and temptation of knowing I have such an easy and painless way out. \n\nI have tried it before and I was on a sofa so no harm caused that time, but if I attempt it again I know what time and where about I should be prior to the attempt. I’m almost scared I’ll be successful but also glad I know how ITLL feel as I’ve been there before nd I know how painless and numbing seizures feel to me. The perfect way out. \n\nHelp?", "url": "https://www.reddit.com/r/SuicideWatch/comments/p947ze/help_me_epilepsy_depression_easy_suicide/", "title": "Help me? Epilepsy + depression = easy suicide?", "social_network": "reddit", "user": "Purpleskybird", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1629598784, "permalink": "/r/SuicideWatch/comments/p947ze/help_me_epilepsy_depression_easy_suicide/", "nsfw": false, "first_save": 1635422258.2834053, "replies_charged": false}