{"id": "t5_2qpzs_t3_q9ozuc", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "I graduated highschool back in June. I \"plan\" on going to a community college spring semester, but I'm not registered for classes, don't drive, and don't even have a laptop. I don't even know what classes I'd take. Nothing interests me, and I have no real talents or skills.\n\nI work two jobs, both part time, but both are at extreme hours. One, I often have to work until midnight-12:30, and the other I wake up at 3 AM to go to. This morning, my alarm didn't go off and I was 3 fucking hours late. I don't know how I wasn't fired. I don't enjoy working. I don't even want/care about money, I'm only doing this because my family expects me to and I'd have nothing to do if I didn't work. I spend my free time either sleeping or just staring at my phone. I've lost what personality I once had to extreme social isolation, sleep deprivation and being trapped in the same surroundings for years. \n\n\nI've never been in a relationship I actually wanted. I dated a girl last year who I wasn't really attracted to, nor connected with on a deeper level, but she asked me out and since we were friends, I felt bad saying no. I got my first kiss, lost my virginity, and hated every minute of both of those events tbh. I broke up with her in January when I realized I never was gonna develop feelings for her. Since then, we've remained friends, and a few times we've done some \"stuff\" out of boredom, but once again I wasn't very enthusiastic about it. \n\nI'm so fucking lonely. I have no real life friends besides her, and the ones I have online, I talk to only rarely, and it's surface level shit. My work schedules, social awkwardness and the fact that I'm not in school means that I literally haven't met a new person my age in probably half a year or longer (even when I was in school, I was an outcast). I downloaded Tinder a month ago to see how I'd do, and I got around 20 matches, but only because I swiped right on literally everyone. The women I matched with were always absolute bottom of the barrel, shallow as it sounds. I don't even know what I'd say if I matched with someone who seemed alright.\n\nToday, I went to some Halloween event at an amusement park with my Dad and Stepmom, and it was kinda fun, but the amount of teen couples there were was just fucking depressing.\n\n\nFor whatever the reason, my sex drive has fallen off a cliff. And I'm balding. And my family never asks how I'm doing or talks to me on a deeper level. I hated my childhood. I hate my present. And I have no desire to see the future. I don't want anything anymore, not even companionship or to be happy. I just want to never experience or feel anything, or have to worry about anything ever again.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q9ozuc/i_dont_even_fuckin_know_what_to_do_anymore/", "title": "I don't even fuckin know what to do anymore", "social_network": "reddit", "user": "soesist", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1634434034, "permalink": "/r/SuicideWatch/comments/q9ozuc/i_dont_even_fuckin_know_what_to_do_anymore/", "nsfw": false, "first_save": 1635427005.348382, "replies_charged": false}