{"id": "t5_2qpzs_t3_oox7el", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "UPDATE: IVE WUSSED OUT AND FORCED TO LIVE ANOTHER DAY\nI’ve posted here many times before. Every time it’s been about planning to do it, but I end up backing out because I’m a fucking pussy. I won’t be hurting anymore. I saw a post a few days ago about mourning the child who had aspirations, who thought I would’ve done big things by now. That child would be devastated if they could see where I’ve ended up. I’m going to post my note here, my final bit of words:\nBreak. Clarification for false devastation, drowning by days, by mids, by nights. Yearn to cease from forced creation, rip the eyes, destroy the sight. Come none without ulteriors had, theatrics claimed by lot. No word for such abyssal sad. To recall is best to not. Grip lost, high cost candy for the brain. Beg for one to comprehend frustrating, grating pain. Fear too great, instinct still lingers, no knowledge of what’s next. For all required is a push of fingers, the spirit has been vexed. \nThough none of them can see, I’ll put the names anyway. Thank you Eddie. Thank you Blaine. Thank you Andy. Thank you Noah. Thank you Lex. Thank you Archie. Thank you Lily. Thank you Jamie. Thank you Claudia. Thank you Grandmother. Thank you Benjamin, and Raven, and Miss Kitty, and Mika, and Kira, my precious, precious furbabies. I’ll see you Max, my first kitty, my baby. I love you all.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oox7el/ive_decided_im_doing_it_tonight_and_im_not/", "title": "I’ve decided. I’m doing it tonight and I’m not wussing out this time.", "social_network": "reddit", "user": "ZennaWolf", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 15, "down_vote": 0, "creation": 1626896014, "permalink": "/r/SuicideWatch/comments/oox7el/ive_decided_im_doing_it_tonight_and_im_not/", "nsfw": false, "first_save": 1635426763.964135, "replies_charged": false}