{"id": "t5_2qpzs_t3_pg9vqe", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "uhh so yeah. The title\n\nIf you domt want to be burdened witj some random strangers thoughts then pleas edo not read\n\nI do have people I can vent to in my life, but I’m not comfortable telling them so im on a throwaway \n\nthis is my experience with suicide \n\nI am a 14 year old girl and I wish I was born male (Important later). In April I felt like shit for basically the whole month, I wanted to kms and when I hung out with my friends on the 11th of april or so they noticed a change in  my personality ig (last time i saw them was late january at that point). I felt like I had lost the self that I was before coronavirus—outgoing, funny, class clown type—and I didn’t like who I was. I also oddly felt a religious sorta pull to suicide??? I’m not sure. I am atheistic/vaguely christian ig but I for some reason felt extremely strongly that if I died I would become god and be able to create my own happiness???? I knew it wasn’t true but at the same time i genuinely believed it was true—it wasn’t like a “i thought X but on the inside i knew it was actually Y” it was just “I was thinking both X and Y were true at the same time”. April may have been the worst month for me. In may, I started to feel a bit better, but it was probably the weirdest month for me. I would have short bouts of sadness for a couple days and then a couple days of normalcy. I also for a couple days barely ate anything (though I dont currently eat breakfast on most days anyway). I felt better at the end of may. (Apologies for any misspellings, im on monile and my typing is starting to lag out a bunch) In june, i went to a summer camp, where i didnt talk to anybody. I was feeling even more suicidal but i felt like i was faking it i guess???? I was the stereotypical kid who didnt talk to anyone, i had hair that covered my face and worde a hoodie every day. I wasnt extremely edgy/emo or anything but I definitely didnt look inviting. I thought i was just faking it for attention and i didnt want people to think about me so i didnt. I dont now if im faking it still but i want to think i am because i am unable to get any sort of therapy bc my parents arent really that educated on mental health and would probably just think im faking it, which i dont even know if im doing or not. Anyway, july was mixed. I was okay in the beginning before wanting to kill myself even more than before because i wished i was born male. I am not transgender but j hate being a woman and i think i always felt more masculine. And if i were trans nobody would even see me as a boy ahnyway because i cant transition, so i cant do anything. Whever i see my body im disgusted and i wish i was born a male. (Im not trans tho). I still feel that april was worse than july despite being more suicidal; in april i felt more hopeless and i hadnt felt that much despair before so it was extremey scary, but in july since i had felt it before it was a bit easier despite definitely being a more suicide-inducing time for me. August was okay, i still felt really dysphoric (i think?) because i wasnt born male, but it was getting better for the time being. But then school started and it all started again. I had absolutely no free time to do anything but work—i am in all honors classes, in advanced band and marching band+choir, take piano lessons, and have a lot of art related work for commissions and stuff like that that i have been putting off for way too long. Ive started to completely forget parts of what i need to do which has stressed me out even more. Killing myself is extremely appetizing to me right now (i literally lost my airpods on friday and was extremely serious abiut suicide bc i was scared of my parents, until an hour later my sibling saw em in their car. I have only talked to a coupl friends about this (the same friends from the beginning actually) and another friend group i have at school (though not all of them) but thatw as because all the people i told were suicidal as well. I will most likely kill myself before i turn 18 because i cannot see any future for myself as an adult, even though ill have to be an adult if i ever want to get mental help or gender hormones or whatever else). I knoe im not depressed or have any other disorders because my parents say i dotn have those. So ill just have fun while im a kid and die later\n\nIts been almost exactly 5 months since it all started. an online friend of mine said that it would stop after 1-2 months, but it hasnt. I want to go back to 2019 (the peak of my existance) it was so fun i had so many friends  now im just a little pussy who cant talk to anyone but the people i already know", "url": "https://www.reddit.com/r/SuicideWatch/comments/pg9vqe/i_kindaw_anna_vent_ab_my_suicidal_ideation/", "title": "i kindaw anna vent ab my suicidal ideation", "social_network": "reddit", "user": "No-Opportunity6405", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1630553899, "permalink": "/r/SuicideWatch/comments/pg9vqe/i_kindaw_anna_vent_ab_my_suicidal_ideation/", "nsfw": false, "first_save": 1635427227.9746892, "replies_charged": false}