{"id": "t5_2qpzs_t3_hf0lmc", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "So, to be honest, I'm not comfortable with, but I don't know, I feel like a need to tell it, and it seems being the place to, so I will. And sorry for bad english, I try my best I promise  \n\n\nI don't know how to start, so I'll do with basics, I'm a male, 19, only since few weeks, and struggle, a little like everyone here. I tried to kill myself for the first time 5 years ago, and some others has come, almost 1 every years.   \nThe worst thing is that I don't have any reason to do such a thing, I'm pretty beloved by my family, even if it's not perfect, I was pretty good at school, when I was going to, before my school phobia, and have some friends to play RPG and video games together. I never could explain what I feel, and why I'm at this point extinguish or whatever can define such sadness , to my psychiatrist, and psychologist. Even my parents tried to, but it seems they a little abandoned, and now try to live like if no one was happening, and I'm pretty ok with that, just I know they don't understand, and can't totally support me. Every attempt I made, have lead me to hospital for few months, and after that, the ambient with my family is pretty strange for some weeks, I have to take my pills in front of my mother for more security, but it doesn't last a lot, because they estimate they have to trust me, and so, the cycle continue. I try to avoid sensitive subject like this when we talk, or it finish in a yelling competition. But this year was a little specific for a reason, exams.  \nI have to pass my last exam before university in a few months, in September, and the whole year, I don't feel to do it. I've don't worked at all this year, my family, and others who see me tell me to do it anyway because I can and have capacity to, but I don't feel it in the same way, and even if I got it, I don't even know if I'll can go to university and handle it. But I don't feel too to work now, I have no professionnal skills and need some mental stimulation to work without thinking suicide.  \nFor now I've survived by playing games, or trying to be game master in RPG games, I try to have some personnal projects, and it was working pretty good since 2 years.  \nBut now, I feel like step backward in comparison to before. I feel like I'll never can finish what I've started because of a lack of motivation, and maybe skills, but it's a personnal opinion, and not really  what think almost everyone else.  \nI trying to distract me from this thinking by doing some stuff I liked to do, but it seems it also become tastless. It was something which I used to feel, but maybe this time was enough.  \nToday, I've seen my psychologist, I wasn't in good mood at all, suicide thinking was strong since few weeks, I made a pact to not try anything before we see us again next week, and I've broke it 2 hours after. I'll not go into too many details, but it was a disaster, I missed miserably, and now, my neck hurts, I've some blood taste in my mouth, short breath, and I'm writing this  \nBefore today, my attemps was pretty always by meds, I fear hurting me, but don't die of it. Meds was a way to not totally do it by myself, a pretty painless way. I always was thinking I couldn't do it in another way. Now I tried, and don't know if I'll can retry again. I've seen a post here, which was saying '' Likely won't commit suicide, but if someone pointed a gun at my head, I'd probably let them pull the trigger ''. It was exactly what I thought, and what I'd like, but I'm not even sure now. I'm not sure of anything, don't know in which way to go, don't know what I want, I feel like my psychiatrist and psychologist deseperate, I'll probably ask for an internment, going a little better for some times, but it probably don't last unless a miracle.\n\nIf you have read all of this, you're a kind person, and even if you have not, you're here, in this sub, trying to help or just read, and that's a good initiative.  \nAgain, I'm sorry for taking your time, and my pretty bad written expression, feel free to do what you want with this, I just had an impulsion to do this post (but I took like 5 minutes before clicking on ''post''), don't really know why. Thank you for being here, and have a nice day.", "url": "https://www.reddit.com/r/SuicideWatch/comments/hf0lmc/not_totally_sure_about_this_and_probably_a_long/", "title": "Not totally sure about this, and probably a long post incoming", "social_network": "reddit", "user": "Arkoney", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1593003655, "permalink": "/r/SuicideWatch/comments/hf0lmc/not_totally_sure_about_this_and_probably_a_long/", "nsfw": false, "first_save": 1635427752.3114579, "replies_charged": false}