{"id": "t5_2qpzs_t3_q643wb", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351", "e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "Since I was little, all I ever wanted was for someone to care for me as much as I cared for them. I was bullied at school and had no friends because I was a “fag” because of my name and the fact I had long hair. At home, my parents neglected me because they were too busy fighting each other. My dad would beat me when I did something wrong, and my mom would slap me across the face to take her anger out at my dad. Of the 3 babysitters I had, only one treated me with respect and dignity. The other 2 Ridiculed me and isolated me from everybody else. When I was 7, I was molested in a bathroom at church but right before he could put it in my mouth completely, he backed away and said “I’m so sorry” and hurried away. I never told anyone about it, I simply just a tried on with my life. \n\nAll of these things that have happened to me, made me feel empty and alone. I tried hiding my pain through humor and doing stupid things that I know I would regret. \n\nMy closest friend, the one I would consider a sister, I think that the only reason why she’s my friend is because she pities me. Even so, I know that for her I would do anything for her, not because of romantic feelings but because she gave me something I never had before which was a genuine friend. \n\nYet I still regularly isolate myself and go days without going out in the world (besides work and college) and cut off all communication with everyone, including her. She has told me that if there’s anything wrong I could talk to her but I don’t know how to muster up the strength and tell her that when I’m isolate myself it’s because I’m starting to feel things I think I don’t deserve to feel. \n\nI am afraid to feel joy, I am afraid that maybe someone loves me for who I am, I am afraid that to feel anything because I think I don’t deserve it. The only feelings I ever let into my life sadness and loneliness. I think it’s because it feels natural and it feels like it’s something I deserve.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q643wb/im_afriad_to_feel_happy/", "title": "I’m Afriad to Feel Happy", "social_network": "reddit", "user": "TheDaphMaster", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1633981747, "permalink": "/r/SuicideWatch/comments/q643wb/im_afriad_to_feel_happy/", "nsfw": false, "first_save": 1635423135.5999744, "replies_charged": false}