{"id": "t5_2qpzs_t3_mn6m9c", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "I have clinical depression.  Had it for a while and Im on antidepressants for it. I've lost several very beloved pets of mine this year and I guess that aids in making me feel lonely, suicidal and self harm tendencies. I have a hard time coping when I am by myself (when my boyfriend is at work or busy with school) and I seem to desperately desire a pet that will be with me all the time to help with depression, self harm, suicidal thoughts.so \n\nSo some background: I have a cat \"Fern\" at my parent's house who is 12 and I call her my \"angel\" (she helped soothe sadness and suicidal thoughts, she loved me very much). But she has always lived at my childhood home and would miss my dad very much if I took her away, plus my boyfriend is allergic to cats.  I recently got a bunny thinking I could have a companion like I missed. I like him, he is cute, funny and playful, however, if you've ever had a rabbit I'm sure you know they can be hormonal, territorial, and destructive and I've recently been crying over him because I don't feel a connection like I had with my cat and he grows/hisses at me despite being rather friendly, doesn't like to be picked up and doesn't always want to be near me or be pet... My boyfriend has a rambunctious 2 year old german shepard. I have had a hard time with her in the past because she is incredibly anxious and sometimes too roudy for me (I am sensory sensitive and also have GAD). I am afraid I will never be able to have the bunny around me 24/7 because 1). He is not interested in staying with me like I want him to. And 2). I feel my boyfriends dog will be a threat to him. \n\nI am upset in myself for taking on a bunny expecting he will be something that he is not, I'm heartbroken by leaving my kitty behind, as well as heartbroken after loosing several other pets I loved to old age this year. I feel I want a service animal but can't afford one. I feel my boyfriends dog would never qualify as one as she is too anxious/animal aggressive and already bonded to my boyfriend. I worry I won't be able to have another cat like my Fern, my boyfriend said it would be okay even though he is allergic but I'm afraid his dog will scare a kitten or cat/be a threat. I've thought of getting a small or medium dog since his shepard used to have a other dog companion but I'm afraid it won't be the same or bond with my boyfriend more. \n\nSometimes I wonder if the \"loss\" of my kitty and other pets has created an obsession in wanting a companion pet... I barely know anything about service animals and Im sure I couldnt afford training for one or if I would even qualify for one... I'm so tired of feeling sad and unsatisfied in this part of my life...", "url": "https://www.reddit.com/r/SuicideWatch/comments/mn6m9c/suicidal_ideation_geting_worse_obsession_or_need/", "title": "Suicidal Ideation Geting Worse. Obsession or Need a Service animal?", "social_network": "reddit", "user": "cherrykayskinkyart", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1617931983, "permalink": "/r/SuicideWatch/comments/mn6m9c/suicidal_ideation_geting_worse_obsession_or_need/", "nsfw": false, "first_save": 1635427283.0635684, "replies_charged": false}