{"id": "t5_2qpzs_t3_njft7f", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": " \n\nI have had a weird 24 years on this planet since birth and today I basically want to be God.\n\nIt all started when I, as a child, used to help people a lot, make the depressed smile, go to various extents for friends and also sacrifice things that I own for other's happiness, not caring if I take a hit from it. People appreciated this behaviour but some labelled me as 'The Clown'. I had a tendency of not wasting any food sometimes even offering to finish the food wasted by a person eating along with me which got me the label 'The Dustbin'.\n\nAs I matured this CLOWN and DUSTBIN labels began to bother me and it still does. I can't stand a minute of any childhood videos that have still managed to survive despite me actively deleting them.\n\nI wanted a better label and to achieve that I developed an attitude through which I only allowed a few people to pass at a time. At any given time I only allow at max a couple of people and this number is taking my family of three into consideration. My dad often complains that I go days without speaking to him but when I allow him inside my wall of attitude we spend days like the best friends ever.\n\nThe people that I allow to get in have to be weaker than me, they must seek me as the smart, the entitled one. When they talk to me they must be wanting something from me because if they don't they won't respect me.\n\nNever did I realize, nor did anyone tell me how wrong I was, because on the outside this habit made me look like a saint on earth. The one who is actively helping the weaker. I had finally found peace in my life being a beacon of hope for all the lost colleagues I had during my graduate studies.\n\nI helped people get over breakups, prepare them for exams they were sure to fail and interviews they were afraid to go through. All I asked from them in return was to treat me like a God and this was completely subconscious at that time.\n\nBut when I reached the 21 y.o. mark, the bachelor's degree ended. College life was over and all of the people who I had helped through exams and interviews now had jobs. I on the other side never gave an interview because my attitude stopped me from being placed in a low paying job. I instead decided to study further and enrolled myself on a masters program.\n\nThose people who were once weaker than me were now worth way more than me and they didn't stop respecting me but I have a habit of breaking ties with people who I feel are crossing me in terms of value. So I just let the last remaining friends go away by avoiding talking to them. They already had difficult lives thanks to their jobs and they no longer needed me so they didn't bother to make many efforts.\n\nI did find new weaklings in masters but these weren't as weak as the bachelor ones, these people were here because they loved studying, they weren't forced to do it. Then the pandemic began and clearing exams became, even more, easier thanks to all the online tests. So I finally lost my last weaklings.\n\nA time has come when no one cares about whether I am alive or not simply because I just stopped caring for them when they were good enough to be alive on themselves. They don't wanna be my disciple anymore because they are doing way better than me and I am too hesitant to be a friend because being a saint or a God is the only thing that makes me happy. I even tried getting into teaching to solve this problem of mine but students barely need teachers today and for those who I really tried, I felt I was coming out as a pervert, especially to my female students so I stopped pushing.\n\nGetting praise or being treated as a God is my addiction and since I am barely getting any of it recently I have been suicidal. I know not a lot of lives will be affected if I die now, many will be sad but only for a few days maybe.\n\nNo, this isn't my suicide letter, this is a confession and I confess that I desperately wish those people who succeded in their lives because of me wouldn't have so they didn't stop treating me like a God.", "url": "https://www.reddit.com/r/SuicideWatch/comments/njft7f/this_is_not_my_suicide_letter_but_it_could_be_in/", "title": "This is not my suicide letter but it could be in the coming future", "social_network": "reddit", "user": "Open_Climate9386", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1621800059, "permalink": "/r/SuicideWatch/comments/njft7f/this_is_not_my_suicide_letter_but_it_could_be_in/", "nsfw": false, "first_save": 1635428241.5012915, "replies_charged": false}