{"id": "t5_2qpzs_t3_pr9701", "request": ["fa52eed9-681b-4f68-b3d1-78c0eec9a3d2"], "text": "Life is so hard and someone even recently told me life isn't easy oh god do I know how hard life is. I keep pushing through everyday and I honestly don't want to be here anymore at all. I just want to get it over with and die. Fuck collage fuck everything I never truly be satisfied in life. I probably won't do anything but I think about it everyday and always see it as a cash out option. Im on meds and see a psychiatrist from government aid I have some support but it doesn't change the cropping PTSD I'm getting or anything. The universe hates me and wants me to suffer or end it. Its the only explanation. I can barely function as a person I never make my bed, brush my teeth showering is pretty much it. I function for a few days try to get a job and then get suicidal again and want to give up because any amount of work makes me want to die. I feel crippled beyond repair like I'll never be able to provide for myself. Even onlyF is to much work for me and I don't have anymore motivation. I can barely commit to stupid shit let alone any job. I don't know what to do. I hate everything about life i fucking hate it here. Im convinced this is hell. I keep having ptsd flashed of my SA ontop of everything and hallucinating the person despite my antipsychotics. I feel like committing myself because I don't want any responsibilities anymore but they don't care because if covid and it'll just be another nightmare. Things keep getting worse and it feels like I can't find the right medication.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pr9701/i_honestly_always_wish_i_was_dead/", "title": "I honestly always wish I was dead", "social_network": "reddit", "user": "meleenea", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1632062482, "permalink": "/r/SuicideWatch/comments/pr9701/i_honestly_always_wish_i_was_dead/", "nsfw": false, "first_save": 1635425498.5763612, "replies_charged": false}