{"id": "t5_2qpzs_t3_q6dy43", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351", "69686dc6-5bf4-41ab-864a-231bdd6f02c9"], "text": "I’m an 17-year old high school student, and I turn 18 next week. I’m planning on killing myself before I go to college so I don’t waste any of my parents money. I was always a really happy kid when I was younger, and I never really understood the concept of depression, but now it is part of my daily life. I really really wish I did have a will to live but my only little last string of will is making a good lasting impression on my peers before I go. There’s a lot of reasons why I’ve decided to do this, I’ll say a few. I was always a super athletic kid, short albeit but very strong bodyweight wise, I could do 15 consecutive bar muscle ups with relative ease and bench 135 for reps at 135 bodyweight. My good health and strength was something I always took pride in. Around February of last year, I injured my left shoulder doing 1500 pushups in one week. I never fully recovered but I learned to block out the pain. In September of last year, I had a skateboarding accident and tore my ac joint in the front and back on my right shoulder. I still experience a great amount of chronic pain in both of my shoulders to this day, over a year later. I had a few more accidents after and now I experience chronic pain in nearly every joint in my body. Every single second of every single day nearly my whole body is in pain. I can no longer practice athletics and sports to the extent I once could, and that makes me very sad. My fingers, wrists, elbows, shoulders, neck, back, hips, knees, and ankles are usually always in a great deal of pain, and what a lot of people don’t understand is that joints don’t heal like bones. They’ll never fully be what they once were again. I don’t want to live out the rest of my life in chronic pain, one of the reasons I have decided to cut it short. Another reason is my troubles with relationships. Everyone I’m friends with always preaches to me how nice and well liked I am by everyone, which I like to believe to be true, but despite this I have only had one girlfriend when I was 14. I’ve never had a single sexual experience. It’s not like I have a problem talking to girls because I don’t at all, it just seems like they only ever see me as a friend. I really feel empty without someone to share and experience life with in a loving way. I have great parents who have always showed me love and support and I know it’s gonna destroy them when I go through with it, and it may sound cowardly to say this but I’m past that point, I just want to end my pointless existence. My father makes 6-figures from home and he is extremely intelligent and my mother is just a pretty average white woman. I decided I want to do it before college so I don’t waste my parents money on someone who is basically already soulless. This may sound like a sob-story at this point because I’ve had a much easier life in terms of a lot of things than a lot of other people, but I’m asking for no pity just some understanding. I am not the person I want to be at all, very far from it, and I know because of that I’ll never have the propensity to be happy. I wish I could just disappear or replace myself with someone else so they can be given the life I never deserved. My parents are purchasing me a new car as a graduation gift, but I don’t deserve it at all and it’s just going to get given to my sister anyway once I commit suicide, which I think is great because I used to bully her a lot when we were younger and I hope will make up for all of the emotional distress I caused her. I can’t see myself going to college just to get a job that I’m not happy to work for 40 years. I decided it’s better to just get it done with sooner than later so my parents don’t have to waste any more money on me. Nothing anyone says will change my mind on what Im going to do, but I would love to hear what your guys thoughts are.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q6dy43/i_am_going_to_kill_myself_this_summer/", "title": "I am going to kill myself this summer.", "social_network": "reddit", "user": "throwaway29374492", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1634012417, "permalink": "/r/SuicideWatch/comments/q6dy43/i_am_going_to_kill_myself_this_summer/", "nsfw": true, "first_save": 1635423131.2049038, "replies_charged": false}