{"id": "t5_2qpzs_t3_q27qls", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a", "bd24e5dc-1a86-4808-94df-346d0c1d2c42"], "text": "I have suffered with suicidal thoughts on and off for a while, pretty much exclusively tied to crises within my marriage/family. When we have significant problems I have pervasive thoughts about ending my life. \n\nFor the most part these have been reactionary and not progressed from thoughts, but earlier this year my wife and I separated and I did make an (unsuccessful) attempt. We reconciled a few months later but my wife has now told me she wants to end the marriage.\n\nMy wife was everything to me. I have always had issues with self esteem, though nobody would know this as people perceive me as confident and outgoing, but underneath was a different story. When I met my wife I felt like I had won the lottery of life. She made me feel loved and accepted and *comfortable* like never before. She made me feel like her hero. \n\nNow I'm having constant thoughts about ending my life. We have children and that is often enough to keep the thoughts at bay but other times I find myself rationalising or otherwise excusing the effect it would have on them. \n\nTonight I have been researching methods. I'm worried about what I might do. I don't feel normal today. I just walk from room to room not knowing what to do with myself, feeling like I don't belong. I don't feel loved, or needed, or that I have a purpose anymore.\n\nI do have f&f irl who care about me and who I know I should be telling all of this to rather than reddit, but I feel guilty about dropping such a massive burden on them. Thanks for listening.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q27qls/struggling_with_suicidal_thoughts/", "title": "Struggling with suicidal thoughts", "social_network": "reddit", "user": "No_Scheme7731", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1633474559, "permalink": "/r/SuicideWatch/comments/q27qls/struggling_with_suicidal_thoughts/", "nsfw": false, "first_save": 1635427101.9051025, "replies_charged": false}