{"id": "t5_2qpzs_t3_jak71t", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "Been suicidal for about 3 years now, I am 19 and the suicide intentions are at its strongest points.\n\nI have got 0 friends. My only family is my severely mentally ill mum (schizophrenia). I have no one to talk to, why do i have a phone? All i do is open up Instagram >>\"you've seen all posts from the past x days\", close it open it again, same thing, why do i do it? . I deleted all other social media because nothing but depressing ads, news and toxic society posts, i don't get any messages, any phone calls, the only notification i get is \"your battery is 5%\".\n\nI haven't got any hobbies, no skills, i wake up, fap out of boredom, lie in bed all day, don't even have motivation to play games, especially as I'm so bad at them, and it's just so repetitive. I am poor, i come from a very deprived area. I hate where i live (I do live in the UK) but i am really unhappy here, my home is very unclean and it depresses me. I don't earn much money. Living with my mum is very hard, it drives me insane, I've been in 2 different care homes. I can't read a book because i can't focus, I'm restless. \n\nWas physically abused as a little kid by much older brother.\n\nI am not loved. No one cares about me. I have nothing. I have nobody.\n\nIn school, i was happy, apart from the time in which these pretty girls called me ugly, that was the start of my suicide thoughts, because i would constantly obsess over how I looked, i would cry myself to sleep. I would not eat because my stomach was in such pain from crying.\n\nThen i was okay for a few months,  but now my suicidal thoughts have never been stronger. I am isolated, i am bored, i am alone and i am in so much pain (mentally). Knowing that I have nothing, knowing that no one cares or thinks about me or loves or likes me. Tinder? No matches. \n\nI have no education, can't have any nice things, work as a food delivery driver, and i dislike it, people are so unfriendly and toxic and unkind. \n\nYou know how sad it is knowing that the only one at my funeral will be my sick mother.. \n\nShe won't be alive much longer, she isn't in best shape and is mentally ill. \n\nI was dealt a really bad card. I tried counselling but they gave up on me, i was only offered telephone counselling, i got about 40 minutes out of it before they abruptly ended the sessions. \n\nSo yeah, j haven't been happy in a long long time. I am miserable, sad, depressed, lonely. No one to talk to. Nothing to do in my life, I'm just breathing, like??? What's the point. \n\nThe one single reason i haven't done it yet? Because i don't know how. \n\nBut I'm ready. Its not a question of \"if\" its a question of \"when\". I am so ready. I cannot take the pain anymore. My head hurts. I want out. I want peace. Because it only gets worse from here. \n\nThanks for reading.", "url": "https://www.reddit.com/r/SuicideWatch/comments/jak71t/im_going_insane_i_cant_take_it_anymore_im_ready/", "title": "I'm going insane. I can't take it anymore. I'm ready.", "social_network": "reddit", "user": "nb2001uk", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 68, "down_vote": 0, "creation": 1602616317, "permalink": "/r/SuicideWatch/comments/jak71t/im_going_insane_i_cant_take_it_anymore_im_ready/", "nsfw": false, "first_save": 1635427067.0029166, "replies_charged": false}