{"id": "t5_2qpzs_t3_mra7i0", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "I am not at risk of killing myself so please conserve your emotional energy for someone who needs it more than me.\n\nI'm 25 fucking years old but tonight I'm crying to my Mommy (who is not here) to make the pain go away.\n\n&#x200B;\n\n*I'm so sorry, Mom. I'm so sorry I can't be what you want me to be. I know you've worked so hard for me to be happy. I know my happiness is what you want more than anything. I know you would do anything, that you've worked so hard, sacrificed so much, to see me thrive. I'm so sorry I can't give that to you. I am trying so hard. I've tried so hard for so long. But I'm tired, Mommy. If I knew how, I would do it. I would do anything. I would do it all for you. To give you what you want most in the world, for your little girl to be happy. But I'm so tired Mommy. I won't give up, but I feel like I might just die trying. I'm so tired. I've worked so hard. But it hurts so much. It hurts so much. I don't know how to be better. I don't know how to be different. I don't want to hate myself, but I don't know how to be any other way. I would do anything to be happy for you. I am doing everything I can. I am working so hard. But I'm so tired. I'm so tired. I'm so sorry, Mommy. I know this isn't what you want. I'm so sorry. I'm so sorry I can't be what you want me to be. I wish I could give it to you. I don't think I ever will. I'm so sorry. I'm so sorry, Mommy.*\n\nEDIT: thank you all for the outpouring of support. I am so sorry that so many people can relate. Wanted to clarify that my mom is still alive, just literally not here with me. I know a lot of you are missing and mourning for your moms, and I don't want anyone to feel mislead. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/mra7i0/im_sorry_mommy/", "title": "I'm sorry Mommy", "social_network": "reddit", "user": "roobyroobyrooih8yoo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 740, "down_vote": 0, "creation": 1618473945, "permalink": "/r/SuicideWatch/comments/mra7i0/im_sorry_mommy/", "nsfw": false, "first_save": 1635426759.2751853, "replies_charged": false}