{"id": "t5_2qpzs_t3_b1mibf", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "I read something in one of the resources that suicidal thought is basically a response to our resources not being able to match our needs. This makes sense to me as I finally attempted when I was on steroids to heal from a surgery and realized I would never again have the brief moment of financial security I had after receiving a settlement that I failed to invest. \n\nHaving had that moment of knowing what not checking a bank account for overdraft every day was, I don't want to live like this anymore. \nI'm not going to be able to bear aging at all and menopause terrifies me. \n\nI want it to get better for all of us, but it won't get better for anyone and even if it does it's very temporary. I wish I had the courage to create a pact or get some already suicidal people aimed at the same world problems, but it's like why even bother with that? \n\nI know I feel this way right this second because my sleep routine is messed up and I haven't eaten right in several days. \nBut it doesn't change the fact that nothing is changing fast enough and the downward spiral is far too grim. \nI'm trying so hard not to kill myself before my mother dies, but I don't think I'm going to make it and it's scaring me because I'm ready but I'm not. I keep trying to focus on getting my affairs in order but I can't keep my brain on any of it and I spend time escaping either here or TV or literally anything so I don't have to exist in reality in any meaningful way and therefore feel like killing myself. \nI'm doomed and sick of feeling as doomed from birth as I have always been. My existence has been interesting in spots but it's really not worth continuing, it just isn't. \nI'm trying not to reach out to family but probably going to anyway because I'm crazy. How's your Friday going?", "url": "https://www.reddit.com/r/SuicideWatch/comments/b1mibf/struggling_with_never_getting_better/", "title": "Struggling with never getting better", "social_network": "reddit", "user": "suicideenby", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1552697011, "permalink": "/r/SuicideWatch/comments/b1mibf/struggling_with_never_getting_better/", "nsfw": false, "first_save": 1635427764.3581657, "replies_charged": false}