{"id": "t5_2qpzs_t3_pd0csr", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "A few hours ago my dad called me and told me to call him after we were done talking and said in a serious manner “And dont forget.” So I forgot to call to call him a few hours later as he told me to call him after I am done with my homework, so he texts me saying “hey (my name)” “wyd” and I say completing some homework and he says “oh ok, call me when you are done. Don’t forget.” And I call him expecting to be mad at me because usually when he says it like that seriously I usually end up getting in trouble for something, so I call him and he says “hey kid” and I say “yes” because I expect to be in trouble as he usually has that attitude with me when I am about to get in trouble, but we end up just talking about how I am currently sick and he says to call him if I need anything and I say “alright” then I say “did you need anything else?” And he says “no, why?” And I say “oh nothing I just thought I was in trouble” and he says “whenever someone tells you to talk to them on the phone you expect to be in trouble?” And I say “no” and he says “don’t be afraid to speak your mind, why do you expect to be in trouble when you are on the phone!?” In a rude manner, and I say “I don’t know” and he says “well stop thinking like that think positive!” Then he says “Jesus Christ” then hangs up abruptly on me before I could say bye. How is he going to be mad at me for expecting to be in trouble when he always does that shit when I am about to get in trouble? I can’t wait to leave this earth today.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pd0csr/call_with_my_dad/", "title": "Call with my dad", "social_network": "reddit", "user": "Southern_Ad3032", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1630113276, "permalink": "/r/SuicideWatch/comments/pd0csr/call_with_my_dad/", "nsfw": false, "first_save": 1635426844.1546712, "replies_charged": false}