{"id": "t5_2qpzs_t3_dl0dl1", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "Hi redditors,\n\nThis is my first post - so please bear with me.\n\nI've been living with Aspergers for a quarter of my life now - introvert, active listener, overthinker, very strategic, fixated on details, never had a fixed group of friends, because I always stood out & always refused to integrate into any group dynamics because I had self-respect, always struggled academically because I couldn't agree with the conventional methods of teaching.\n\nStill I managed to complete a Master level education, Met my best friend (who's currently working and living very far away from me now), and publish an academic paper & got admitted to a second prestigious, interdisciplinary Master program very few enter last year. This is my second year in which I need to orient my skills towards a PhD.\n\nIn the past two weeks, I've been dumped by the girl I was dating - later humiliated by her and her new boyfriend - also they are shocked by the fact that I quicky forgave her & want to be friends again, isolated by the people I thought were my friends( I met them when I was happy & things were going well - now they can't bear to be with the sad me ), many of my applications for an internship got rejected, got rejected in an important interview, forced to change my semester plan and validate courses which will be completely new to me - have to keep shuttling my main course & the courses I have to take & take care of a lot of legal stuff.\n\nMy life is too precious to me & I know if I wish to make a real difference in this world and be recognized for it - I will have to keep going.\n\nBut the daily stress and attacks on my self-worth are making it a challenge - the constant rejections, the lack of awareness, being left out of conversations & meet-ups, the feeling of exclusion and being out of loop with everyone's life is draining the feeling of belonging I had @ the same university before - despite me being incharge of a club and being very familiar with the staff and a lot of students.\n\nTo cope, I've been reading \" A survival guide for people living with Asperger's syndrome -  [http://www.autism-help.org/aspergers-guide-intro.htm](http://www.autism-help.org/aspergers-guide-intro.htm) \" for now & trying my best to concentrate on my courses & developing skills - but how do I bring back the same motivation & drive I had before?\n\nTime is running out - so please help me understand how do I get back on my feet.\n\nP.S Despite having Aspergers - I was never given any special treatment, often had to pretend that things were ok - when they weren't & lie compulsively, How do I become authentic - without being pessimistic & a dead-weight?", "url": "https://www.reddit.com/r/SuicideWatch/comments/dl0dl1/my_life_is_too_precious_to_me_at_this_point_but/", "title": "My life is too precious to me at this point - but I'm finding it a challenge how to live", "social_network": "reddit", "user": "Ask_me_anything8894", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1571663656, "permalink": "/r/SuicideWatch/comments/dl0dl1/my_life_is_too_precious_to_me_at_this_point_but/", "nsfw": false, "first_save": 1635427153.4055102, "replies_charged": false}