{"id": "t5_2qpzs_t3_oapb7m", "request": ["37248a85-36ad-4f27-afa2-d6240c3a39c2"], "text": "I had 2 failed suicide attempts in a months span. Normally I'm an emotional and passionate person. The world used to be so beautiful and intense.\n\n In April I tried to poison self. Got saved by two friends I didn't expect to save me. About a month later I jumped off a 70ft bridge. I survived with multiple rib fractures and a collapsed lung. \n\nAs I type this, I'm healed up. My broken ribs are stable, very little pain now, the hole in my side is now a sealed scar (from chest tube for collapsed lung). I joke to myself,  call it my \"immortality mark\", and laugh about it all. \n\nSince I survived that 70ft fall, something that I was 111% sure would end my existence as a conscious physical being, I haven't been the same. The world isn't the same anymore. My heart is beating. I have a pulse, I'm breathing, on a physical level I'm alive, but in every other way I feel dead. \n\nI used to be overwhelmingly empathetic. Now I feel more and more apathetic. I feel detached. I feel outside of myself, like an outsider peering into a foreign world. I feel like a ghost. I feel fearless. If you knew the whole story maybe you'd understand...\n\n. survivors of suicide, did or do you feel the same? I feel numb almost. I'm aware of my tasks and the people in my life but there is now a disconnect to emotion and empathy.  \n\nMy therapist asked me if I was depressed last week. I didn't know how to answer because I don't feel depressed..   I just don't feel anymore, or I'm losing the ability to. I really feel shut off from my own emotions. Logic tells me it might be a red flag but at the same time I don't really care too much. I'm fighting things I've learned in therapy with the reality of how I feel or lack thereof.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oapb7m/anybody_survive_suicide_attempts_and_lose_empathy/", "title": "Anybody survive suicide attempt(s) and lose empathy or ability to feel emotion appropriately?", "social_network": "reddit", "user": "70ftTom", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1625026446, "permalink": "/r/SuicideWatch/comments/oapb7m/anybody_survive_suicide_attempts_and_lose_empathy/", "nsfw": false, "first_save": 1635428587.3168197, "replies_charged": false}