{"id": "t5_2qpzs_t3_n12dku", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "I've been under the care of a good number of these clowns over the years and they have all been far more concerned about making bank than helping out people who desperately need it. Not one of them has shown any real concern or compassion and they never, ever have followed up just to see how I was doing despite me having paid thousands of dollars.   \n\n\nWorse than that they are complete hacks. Most of the time I'm telling them what medications to try or having to spell the names of meds for them. Their 'expertise' is laughable and consists of trial and error going through a list of meds that aren't tailored to individuals at all. To an extent I can't blame them for this because knowledge of true, clinical mental illness is still in the dark ages and the treatments available are completely hit and miss. Yet still they are almost universally pompous and see themselves as having great knowledge. I'm not even sure why they need to go to med school (I qualified as a doctor so know what it involves) - all they need to do really is learn how not to kill people by giving combinations of meds that would cause serious problems like serotonin syndrome.   \n\n\nThe consultations I have had are a joke and completely unnecessary, really just an excuse to get their $300 for 30 mins of chit chat. I would much prefer to just send them an e-mail, tell them what prescription to write and just pay for that. Surgeons may be pompous but at least they do actually have crazy amount of knowledge and skill.   \n\n\nAlso bear in mind that up until not too long ago, Psychiatrists were treating clinical depression through insulin induced comas, a treatment that is not only extremely dangerous but has been shown to have zero efficacy. The prevailing view is now that they did this because they wanted to feel 'useful' and like real doctors, lol.  \n\n\nAnyway, I can't hate them for not being able to cure depression. The brain is still probably less well understood than outer space. I hate them for being profiteering, pompous charlatans, only interested in lining their own pockets through exploiting people that desperately need help.   \n\n\nRant over. Hope it's ok to post this in this forum but yes I'm suicidal and just feel massively let down by these greedy quacks. Hope that some of you have had better experience with them than I have.", "url": "https://www.reddit.com/r/SuicideWatch/comments/n12dku/fk_psychiatrists/", "title": "F**k Psychiatrists", "social_network": "reddit", "user": "TonyStonum", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 17, "down_vote": 0, "creation": 1619696070, "permalink": "/r/SuicideWatch/comments/n12dku/fk_psychiatrists/", "nsfw": false, "first_save": 1635423044.4246264, "replies_charged": false}