{"id": "t5_2qpzs_t3_k8w9wb", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "So I’m confused , could anyone answer this question...  I don’t get why there so most a vast difference in the universe I watched all my friends have kids get married I’m alone single 26 no kids never had a girlfriend no chance of ever owning a house & just really everything I’ve watched in my life I feel like I’m spinning circles ... I’m not jealous of anyone I just feel like suffering with wanting to die everyday & everything that encompasses that is so uneven in this universe . Some people get it all but maybe not it all but a lot. Some people suffer a lot with no explanation. So FOR EVERYONE that reads this please know your not alone I suffer in my mind a lot with everything I deal with every day I think of killing myself  I’ve tried twice. Watching the show thirteen reasons why.... they had the BEYOND the thirteen reasons why ... if anyone has watched that exclusive ...there was a part on there were they had a mother On the show that had a son that lost him to suicide ... I remember it very clearly listing to her Story. She said it’s really rough you can be so close to someone & not no what they deal with... she attended to suicidal patients & survivors every day as a nurse. She didn’t see any signs from her son . My one thought that I can’t get away from when I heard that story is you never know what an individual deals with in there mind . I think of that kid a lot it’s sad I sympathize with him he probably dealt with something that is very unbearable in his mind & u feel like there’s no escape that it goes in forever RIP man.", "url": "https://www.reddit.com/r/SuicideWatch/comments/k8w9wb/confused_hurt/", "title": "Confused & Hurt", "social_network": "reddit", "user": "iamthegiant21", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1607397421, "permalink": "/r/SuicideWatch/comments/k8w9wb/confused_hurt/", "nsfw": false, "first_save": 1635427154.2251694, "replies_charged": false}