{"id": "t5_2qpzs_t3_pqzidg", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "So for context about 2 weeks ago I was hospitalized for a psychosis episode. I had locked myself in the bathroom and attempted to overdose, when the police arrived I assaulted 3 officers (they didn't press charges) I was taken to an ambulance by force and handcuffed to the stretcher and given multiple injections. Once they got to the hospital i was forcefully stripped, as a was being held down one of the police officers subtly sexually assaulted me. He put his hand between my thighs to \"hold me down\" and touched me. Eventually I was given anesthetics (Idk what it's called) and I was transferred to the psychiatric floor. I stayed up until 2 days ago. I got extremely dehydrated while i was there to the point of fainting. When I fell I gave myself a concussion. They didn't care, I was sent home dehydrated and with a concussion.\n\n\nAbout fifteen minutes ago I was cutting, and it was like every other time. I cried and laughed listening to music while I cut. What caused me to cut was binge eating. I struggle with bulimic tendencies (As i haven't been diagnosed with bulimia) and I ate several thousand calories worth of food, I tried to throw up after but I for some reason couldn't get anything out. The amount of weight I'm gonna gain from that upsets me. So i started cutting to punish myself. It was fine until I finished. I used an ENTIRE FULL BOX of bandaids. An entire fucking box worth of cuts. Just about every one of them were deep styro cuts too. I had just bought that box of bandaids and I used the entire thing. They're everywhere, my thighs, my chest, my hips. How did I come to this? How did i let it get this bad? I genuinely don't think i can do this anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pqzidg/i_think_ive_lost_myself_and_this_battle/", "title": "I think I've lost myself and this battle.", "social_network": "reddit", "user": "Milkbunnix", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1632018203, "permalink": "/r/SuicideWatch/comments/pqzidg/i_think_ive_lost_myself_and_this_battle/", "nsfw": false, "first_save": 1635422923.939407, "replies_charged": false}