{"id": "t5_2qpzs_t3_om3qvw", "request": ["4162f604-29a0-4041-a85b-c249e1ca13f8"], "text": "there's a old arabic saying that goes like this: \"You want to kill yourself? Throw yourself into the sea and watch yourself fight for survival. You dont want to kill yourself, you want to kill something within you.\"\n\nI have been suicidal and depressed on the latter part of my teenage years. Even now i feel depressed from time to time, we all do i think. But i want to flip the common thought of depression on its head, just to look at it from another perspective. Im not denying that suicidal thoughts and depression has neurological base but im not going to talk about brain structure and all that stuff. I think you can deal with depression here and now.\n\nPeople who are depressed and want to commit suicide are the ones that might love life too much. The universe is flowing through them at the speed so fast that they can't handle. They are too full of ocean of life and have too much feels. What they really are seeking for when they want to commit suicide is to return home, to the source, to rejoice with the vast ocean that is life. They very much want to live and they want to live authentically.\n\nWhat they really want to kill is the ego, which fabricates the story of their life which they now realize is bizarrely illusionary. The idea one has to end ones life is actually a point of awakening. They want to wake up and they want to reach the bridge of life and get to the otherside, which could also mean death. Death feels very certain and very real. Life on the otherhand intangible and uncertain, it's always moving.\n\nI think this is why many people have had experiences of awakening right after coming out of the darkest hours. Now when i feel sadness and negative emotions, i look them as an opportunity and an invitation to change the current narrative of my life that isn't working out for me, or to delete it completely.\n\nI try to face my emotions head on, rather than suppress them, by metitation. I sit, eyes closed, hold my thoughts and emotions like a baby. Bathe yourself in your emotions. Listen to them. Listen to the underlying intelligence beneath the sadness because it's there for a reason. It's there to try to communicate something. It has to be heard. Don't fight it. Witness it, be friends with it, laugh with it. Beacuse ultimately they are part of life and part of nature and part of you. If you can accept bad weathers like storms, hurricanes or earthquakes as part of nature, then there is no reason why you shouldn't perceive sadness under the same light.\n\nThe storm can only pass if you let it come first.", "url": "https://www.reddit.com/r/SuicideWatch/comments/om3qvw/depression_and_suicide/", "title": "Depression and suicide", "social_network": "reddit", "user": "saladfrogdog", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 111, "down_vote": 0, "creation": 1626526656, "permalink": "/r/SuicideWatch/comments/om3qvw/depression_and_suicide/", "nsfw": false, "first_save": 1635422902.5166008, "replies_charged": false}