{"id": "t5_2qpzs_t3_moj6n8", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I’ve had depression for many many years intertwined with years of bulimia and anxiety. The low feelings aren’t new but I’ve been really struggling lately with feeling like I’m never going to achieve what I want (not even sure what that is) or like I don’t have anything worth living for (like I just work, pay bills and exist, I hate it). Really struggling to find passion for anything or a desire to keep going.\n\nI’ve been close with my mom forever, talk almost every day. I am open with how I’m feeling and the last few weeks have been rough. She was blaming my need for dating / finding love / disappointment when that doesn’t happen for my depression and I was getting frustrated with the convo and told her not to contact me.\n\nFor context I went on a date today that didn’t go well and I was feeling extremely depressed.\n\nWas I over dramatic probably but I was frustrated that everyone thinks that’s the only reason for my depression.\n\nAnyway we hung up and she texted me “why do you hate me so much” ???\n\nAnd I called her back and she was upset as if my suicidal thoughts and wanting distance were because I hate her (which I have never expressed) and I’m sorry and sad I’m upsetting her but idk I can’t stand the guilt trips to stop someone from suicide “it’s a selfish decision” etc\n\nShe then expressed that she’s depressed but doesn’t discuss it because she worries how it will affect me and like yeah she’s right and now I feel like shit (work, lonely, ugly, mediocre)\n\nHonestly there’s a lot of things that contribute to my depression but I really think it would just be easier if I just died. Yes maybe some people would be sad but then they would grieve and move on and just enjoy their lives w/o me being a burden (I hate that phrase but idk how else to say it).\n\nTried a hotline and the lines busy so idk\nNot doing well", "url": "https://www.reddit.com/r/SuicideWatch/comments/moj6n8/im_tired_of_being_made_to_feel_guilty/", "title": "I’m tired of being made to feel guilty", "social_network": "reddit", "user": "inmychoose", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1618110891, "permalink": "/r/SuicideWatch/comments/moj6n8/im_tired_of_being_made_to_feel_guilty/", "nsfw": false, "first_save": 1635422930.2699587, "replies_charged": false}