{"id": "t5_2qpzs_t3_qec71j", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "I don’t wanna glorify suicide, and I don’t want to encourage anybody else with ideas. But the method I decided to use finally arrived, I got ahold of it earlier than expected, and I have everything I need to do it now. But I need time to finish writing goodbyes and recording videos. Yesterday I almost jammed a knife through my trachea and scratched my face until it nearly bled, I deeply cut both my thighs, and smashed my fist against my head a few times for good measure. My partner and I were supposed to go out of town for the weekend to the place that I love the most, heaven for me, but we found out all the hotels were sold out and the ones that weren’t were charging $450 for a two night stay, neither my partner or I could afford it, even though the night before we said we’d go stay for two nights, I got mad, and left the room and proceeded to stomp around the apartment like a child mad at the situation and then went and self harmed. My partner thought I was mad at them, but I tried explaining that’s why I left the room so I didn’t take it out on them (for reference we have a really solid relationship, but this autoimmune encephalitis I have is really messing with my ability to process emotions so instead of yelling or something I’ll leave the space). I still ended up making my partner cry, who thought I was specifically mad at them, I was upset they told me one thing the night before and then rescinded that they day after, but like we pool our money, so it’s like my partner not being able to pay their half of the hotel bill was an US problem not a them (my partner) problem, I explained that to them and they calmed down. That’s when I self harmed because I made my misery my\nPartners misery which just isn’t fair to them. We made up, and I deeply apologized for my unacceptable behavior (getting mad and raising my voice a bit when trying to explain that I wasn’t specifically mad at them but was mad at the situation that WE couldn’t afford to go.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qec71j/the_end_will_be_soon/", "title": "The end will be soon.", "social_network": "reddit", "user": "Automatic_Pipe_5139", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635018903, "permalink": "/r/SuicideWatch/comments/qec71j/the_end_will_be_soon/", "nsfw": false, "first_save": 1635425276.375148, "replies_charged": false}