{"id": "t5_2qpzs_t3_mx81ye", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "Hello everyone, I hope everyone is having a great day. I am 25/f and I haven't been okay mentally since January. It's gotten a lot worse over the past two weeks. It was extremely sunny in the place I live last weekend and I even went out with my friend, but I wasn't having fun. I felt complete loneliness and emptiness. Ever since that weekend, I've spent every day in bed. I find it hard to do small everyday tasks (brush my teeth, shower, overall cleanliness), and I just let the time go by while lying in bed. Just empty thoughts. This week especially has been hard for me. I've spent almost every day crying because I don't know what's going on with me. I've been trying to pinpoint it:\n\n1. I'm a natural introvert. Being anti-social is okay with me. Being alone is okay with me. I've recognized and been this way since kindergarten. All of a sudden I want people around. Is it for attention? I really can't pinpoint it. Why am I all of a sudden craving quality time?\n2. I have a great group of friends who I occasionally speak to (I prefer this style of communication), but one of my closest friends and I did have a small falling out (also okay with this because we need a break from each other). The odd thing is I'm all of a sudden getting upset/angry that no one is checking up on me, asking me to see me (I'm vaccinated), or takes the time to talk to me every day.\n3. My love life has always been in shambles. I've never had a boyfriend, but I've talked/dated/had sex with numerous men. The one guy I would say was closest to a boyfriend decided to \"cheat\" while we were dating exclusively and that really put a scar on me. I thought I've moved on and forgiven, but I found myself really really really hurt by his actions last week and cried a lot. But this happened last year? I'm not sure why it's reoccurring? We've also both received closure from that situation. I recently started dating a guy who wanted to date me, told me he wasn't ready to date, asked me to spend the night/see him multiple times after telling me he wasn't ready to date, then (the final straw for me), he asked to get food and one hour before meeting up he told me he couldn't come to see me. I really liked him. Why is this pattern of men treating me as disposable a thing? \n\nThose are the three issues that come to mind. When I'm looking back to what's going on...but it doesn't feel like enough. Why are things that usually wouldn't matter to me affecting me so much? Am I craving attention? I don't know what it is, but last night I cried for two hours and today I've been crying for about 4-5 hours. Then the thought of suicide popped up and usually, I can brush it off...but I can't. I heard an owl hooting at 5 AM, and it just seemed like more of a clearer sign. I don't know what's bringing me to this edge, but I am constantly thinking about it. I'm overall not happy in my life right now. I don't know what to do.\n\nI apologize if this was a waste to read...I just don't know what to do.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mx81ye/i_havent_had_intrusive_suicidal_thoughts_since/", "title": "I haven't had intrusive suicidal thoughts since middle school.", "social_network": "reddit", "user": "dolphins22forever", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1619221226, "permalink": "/r/SuicideWatch/comments/mx81ye/i_havent_had_intrusive_suicidal_thoughts_since/", "nsfw": false, "first_save": 1635427134.040538, "replies_charged": false}