{"id": "t5_2qpzs_t3_qhjh9s", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42"], "text": "So this might be a little out of the ordinary, but I'm writing on her behalf because she is far too anxious to make a post herself. We are both trans and have BPD actually so I can relate and understand her really well 99,9% of the time, but it seems this one time my help is just not quite enough. Maybe she just needs to hear the same thing multiple times from multiple people for it to really stick, or maybe someone can say something more impactful. She's been on HRT for years at this point and has fully socially transitioned as well, she's (in my and her friends opinions) very attractive and generally passing barring the occasional asshole and yet she's struggling with dysphoria to the point of suicidal thoughts. She feels as if she looks terrible and nothing she ever does makes a difference. She feels as if her friends, her ex-partners and me telling her how beautiful she is do not matter because it's not honest, even if not intentionally. She actually told me she kind of feels upset and that her feelings are invalidated when I say that it's just her perception that's twisted, and that she felt mad at her friends in the past for compliment her looks too. I told her that it's just a matter of dysphoria twisting her perception of herself and that even if there are things that she's still not perfectly content with about her looks that doesn't invalidate all of the ways in which she's already beautiful, but I can't get through to her at all. It's the first time I've seen her get this bad, honestly. It could be that the \"all-or-nothing\" thinking that BPD often causes is the reason for this, in her mind she's either looking perfect or awful with no middle ground. She wanted to post herself and try to see if someone could help but her social anxiety is strong even on the internet, hence why I try to find some help for her. She's going to read whatever messages\\\\comments\\\\etc so feel free to address her directly.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qhjh9s/trans_girlfriend_with_bpd_unable_to_cope_with/", "title": "Trans girlfriend with BPD unable to cope with dysphoria to the point of suicidal thoughts, needs help", "social_network": "reddit", "user": "Miriael_", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1635414781, "permalink": "/r/SuicideWatch/comments/qhjh9s/trans_girlfriend_with_bpd_unable_to_cope_with/", "nsfw": false, "first_save": 1635427308.2239418, "replies_charged": false}