{"id": "t5_2qpzs_t3_e3n4po", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "I was born with a chronic disease called glaucoma, which causes a build-up of pressure inside the eyes and crushes the optic nerves thus causing irreversible loss of sight if left untreated.  Since in my case the disease was caught early I managed to keep 10% of stable vision in my right eye which served me well for 29 years, at which point it started to deteriorate progressively eventually culminating in total blindness after 3 years, and this was 5 years ago.\n\nBefore going totally blind, and despite both my disability and a lack of formal education, I achieved moderate success as a self-taught programmer.  I had the raw talent, but I lacked discipline, and to make things worse I spent a lot of time reinventing the wheel, which resulted in a massive hindrance to my learning process.\n\nBlindness didn't stop me from learning, but it stopped me from coding, not because it's impossible but because it's uncomfortable.  However my passion for the subject remained, so I kept researching and learning, and since knowledge grows exponentially I know a lot more now than I did 5 years ago, especially since I've stopped reinventing the wheel and started reading up on things.\n\nThe problem, and the reason why I wish to die, is that I feel that, due to my dependence on the sighted for writing most kinds of software, and due to the discomfort that I feel about coding blind, my potential is severely reduced.  I've tried to reinvent myself by turning to music, but since I don't have the talent, the passion, and didn't grow up with it, I will never be a decent musician.  Without any other illnesses and with only 37 years of life, unless I do something about this I will live in this limbo for who knows how long, because blindness affects everything across the board.\n\nI believe that we come to this world to be happy, so in the face of a disability that has kept me unhappy for 5 years I think it's reasonable to wish to die.  I'm not depressed or anything, but I want to add life to my days, not days to my life, and since to me quantity of life is worthless without quality of life I see no option but to end it prematurely.\n\nI've already tried to kill myself once but failed, and now I'm ready to try again even if that lands me in hospital, because I'm THAT desperate for some action in my life.\n\nPS: Because I know someone will ask I will answer in advance.  I'm writing this on a Mac using [VoiceOver](https://www.apple.com/lae/accessibility/mac/vision/).", "url": "https://www.reddit.com/r/SuicideWatch/comments/e3n4po/stuck_in_a_limbo_of_boredom_due_to_blindness/", "title": "Stuck in a limbo of boredom due to blindness", "social_network": "reddit", "user": "Duriello", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1575070540, "permalink": "/r/SuicideWatch/comments/e3n4po/stuck_in_a_limbo_of_boredom_due_to_blindness/", "nsfw": false, "first_save": 1635427050.9418795, "replies_charged": false}