{"id": "t5_2qpzs_t3_7fkzt1", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I want to die. To fall asleep and never wake up. To fall headlong into the abyss of my dreams where there is no one for me to hurt and no one to hurt me. I want a fortune teller to drop her crystal ball and cry for the tragedy of a young death and turn to hold her children close before they turn to dust in her arms. I want to apologize  for what I've done and be apologized to for what's been done to me. I want to feel the love of my parents just once. I want to stop the bleeding but all that I have is broken glass and memories of bandaids with smiling little stickers. \n\nIn the end I can choose to die or not die but I'm tired of being hurt by my own mind and I'm tired of watching myself ruin my life and I'm tired of seeing myself drive my friends away and I'm tired of not being ready for death. Every morning it's a struggle to get out of bed and every afternoon it's a struggle to eat and every night it's a struggle to hurt myself and every second it's a struggle to stop breathing in and only breathe out.\n\n\n For 3 years. It's not a long time but it's enough time. Every moment of those 3 years has culminated into a grand total of nothing, with this spiteful mind of mine fighting tooth and nail with this selfless mind of mine and now both of them are just battered to hell and so fucking tired.\n\n Why push a boulder up a mountain when the chasm eating at my heels is calling me by name? Is this a suicide note? I might never know.", "url": "https://www.reddit.com/r/SuicideWatch/comments/7fkzt1/ramblings_of_a_suicidal_man/", "title": "Ramblings of a suicidal man", "social_network": "reddit", "user": "AcctForSaleOnly1Soul", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 10, "down_vote": 0, "creation": 1511674985, "permalink": "/r/SuicideWatch/comments/7fkzt1/ramblings_of_a_suicidal_man/", "nsfw": false, "first_save": 1635426280.2749436, "replies_charged": false}