{"id": "t5_2qpzs_t3_ezbf6t", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I surrender. I am giving up. \n\nShe can have it. All of it. \n\nI accept that she wins. That she is better than me. That I wasn't good enough for her love. That I wasn't good enough for her family. That I wasn't good enough... again. \n\nShe gets whatever she wants with blessed hands. That God has given to her everything she could have wanted or needed. That he gave her the winning path of this ended relationship. \n\nA quick to disconnect heart. Ease of finding a new love. Ease of moving on. Ease of letting go. Strength of self to just give up on someone who loves them. She has it all and has won.\n\nI accept the end of my life. Of my soul. Of my time. Of me.\n\nI accept it\n\nI surrender. \n\nI beg to the world, to God, to please just take me. To please just let this end. Let my misery/life end. \n\nI can't do this anymore.\n\nI won't do this again.\n\nI cant love with all my heart and soul, just to have someone destroy me. To destroy what I represent and all that I am. Then, from the rubble, having to rebuild my entire life. \n\nWhile they strike not a stone on their feet. God guides them from misery and sorrow. He gives them the best option and provides structure and love for their future. While I am left in utter destruction of a world I built with them.\n\nI kneel down on this scorched earth. With this world on fire, I watch the cities burn. The calls for mercy, the destruction of love, the end of a dynasty.\n\nThe memories flood me. They call to me. Begging for remembrance. Begging for forgiveness. Pleading for love. Pleading for this pain to stop. As if hoping, that if they showed me just the correct memory, that it would spur me to action. To cease this destruction. To find the one I built this world with. \n\nI, kneeling down on this earth, can do nothing. I can only weep, and hold these memories like small children, while they are here. I hear their cries for help, sooth their pain the best I can, and feel them fade to nothing in my arms. While tears stream down my face.\n\nOne after another comes to me. And dies in my arms. My heart heavy from holding these poor desperate beings last moments of life. And I'm powerless to stop the end that is taking them.\n\nI wave my white flag. I roll over. I succumb to this sadness/misery and accept that this is God showing me where I belong. \n\nLike God is determined to push me down. That I am to fight back against him to find love/happiness in others. Then when I find it, he rips it away, and while holding the key, he opens my jail cell.\n\nI bow my head, tears stream down my face, and walk slowly to my familiar doom. The door clangs shut behind me and I sink to the floor. This worn stone floor is familiar to my touch. The darkness surrounding me feels like an old friends embrace.\n\nI finally accept this place as my future, my being, and my home.\n\nI surrender to this dark home.\n\nI surrender.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ezbf6t/i_surrender/", "title": "I Surrender", "social_network": "reddit", "user": "LostKnight56", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1580917526, "permalink": "/r/SuicideWatch/comments/ezbf6t/i_surrender/", "nsfw": false, "first_save": 1635422330.6963108, "replies_charged": false}