{"id": "t5_2qpzs_t3_puznjz", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d"], "text": "My life was a constant series of setting goals. I joined the Marines at the first opportunity, got promoted ahead of peers, went enlisted to officer. Got married, had kids, bought a house, trained a dog, and thought I figured it out. On the outside everything was good. \n\nI lost my wife's trust with girls on the internet because I felt alone and unloved. I started drinking more and more. Eventually I left my career when I hit a point where I got put on thin ice, now I have a job that pays about 1/3 of what I was making.\n\nI hit my low point and accidentally hurt one of my kids really bad. I can't even look at them and not break down now. I have a dead end job thats barely making ends meet and physical fitness that's continually deteriorating because a gym membership would break the budget.\n\nI keep having thoughts that they'd all be better without me. Our fights turned from the sink being full of dishes and the house being a mess to talking about divorce. I haven't been able to wake up and look at the man in the mirror.\n\nMy wife tracked the cars GPS to find me and pulled the loaded gun out of my hands after she realized I left with it and a 12 pack of beer in the passenger seat. I'd driven out to the beach to just end it all and I'd do it today if I could and not leave them in financial ruin.\n\nI don't see good in my life anymore. Just a slow grind into the grave. I've hurt the only people I love and swore to protect. I'm a failure as a husband, father, man, and Marine. I never understood why people committed suicide, until I've been ready to do it  myself.", "url": "https://www.reddit.com/r/SuicideWatch/comments/puznjz/a_failure_in_the_making/", "title": "A failure in the making", "social_network": "reddit", "user": "ryannelsontalks", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1632544259, "permalink": "/r/SuicideWatch/comments/puznjz/a_failure_in_the_making/", "nsfw": false, "first_save": 1635426910.1068332, "replies_charged": false}