{"id": "t5_2qpzs_t3_j1rbob", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "TW for dysphoria.\n\nIt obviously isn’t but but the psychological effects are just simply ignored, not studied enough, let alone treated.\n\nWe are treated like a hoard of confused nuisances rather than an inevitable product of biology. There is so little accessible research about gender dysphoria, and viable new surgeries. Maybe I’m downplaying the work of many people but it just doesn’t feel like enough.\n\nI’m 15 and I feel like I have to do everything myself. I always have. When I started puberty I tried to starve myself to death because the dysphoria was so overwhelming. I very nearly succeeded. I didn’t understand it at the time. Only this year does it make sense. By now my bone structure has seen irreversible changes. My hips feel like they extend past my shoulders twice over. Speaking of bones I developed severe osteopenia. It makes it harder to see myself living into adulthood because I fucked up so bad. Also its bound to make hormone replacement therapy more complex.\n\nUnfortunately being trans is a fraction my trauma (abuse, neglect, adhd that wasn’t picked up because I hid it). I hide everything from everybody. I learned how to do that way too young.\n\nI need a job to pay for things to alleviate my dysphoria (clothes, binders, haircuts, and later on: hormone replacement, top surgery) but I cant get a job because of my dysphoria (and because everything is just too much) but I need a job to pay for things to alleviate my dysphoria.\n\nIt’s fucking insane that I’m still here. Everything is harder for a trans person. I’m in a ‘developed liberal western’ country and there is still no fucking support. Being trans makes your childhood hard, makes adolescence harder and I’m supposed to help myself???? People ideally from a physical perspective begin to transition in their early teens. How the fuck is a child supposed to treat themselves?? Higher rates of drug addiction, potentially crippling mental illnesses, all kinds of self destructive behaviour will inhibit a child from seeking help.\n\nThe neoliberal facade of screaming ‘trans rights’ along with ‘activism’ in schools reassuring kids that it is okay to come out to parents, then giving them a trans flag badge and a pat on the back is fucking infuriating. Never mind the hundreds of thousands of impoverished kids, some facing abuse. Even a slightly financially struggling, slightly neglectful or transphobic household cannot provide for their childs needs. There are so many goddamn hurdles.\n\nI truly wonder if it is even worth the trouble of starting testosterone. I think the fear of being an ugly dickless manlet is greater than being stuck in an oestrogen generating sack of fat. And it’s even harder because I’d like to be a feminine guy with a DICK, the opposite of pear shaped with useless genitals. If bionic penis technology becomes an industry in my lifetime, everything changes. I would literally exchange an arm to grow a functioning dick with my own cells or something similar. Please hurry up science.\n\nThis rant is the product of sorting through childhood memories, getting an adhd diagnosis, half-coming out to two family members, and really figuring out this stuff. I had an insane depression for a couple months at the start of quarantine. I felt psychotic, manic, and probably dissociated throughout. I was actively planning suicide. Im still recovering from that. For some reason, I don’t feel suicidal for the first time in my life. I think it’s because I can finally see some form of future for myself. Its going to be a shitty time and I’m angry and wallowing in self pity. But I genuinely just want to ride it out. Ive never been afraid of death and now I’m a little less afraid of life and thats invigorating.\n\nI feel like my childhood has been stolen and it’s so unfair. I don’t know how the fuck kids younger than me are able to balance school and work and still buy things and do things on the weekends and have normal friends and have a functioning attentive family. It’s all so overwhelming. I now have support with medication(which has been life changing) so I guess I just have to do it. \n\nNo one will read this. I felt the rage and the regret and self hatred well up and then I hyper-focused on this post for too long.", "url": "https://www.reddit.com/r/SuicideWatch/comments/j1rbob/being_trans_feels_like_the_hardest_fucking_thing/", "title": "Being trans feels like the hardest fucking thing anyone could live through", "social_network": "reddit", "user": "m0nkeysinthewalls", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 59, "down_vote": 0, "creation": 1601349497, "permalink": "/r/SuicideWatch/comments/j1rbob/being_trans_feels_like_the_hardest_fucking_thing/", "nsfw": false, "first_save": 1635426416.8519516, "replies_charged": false}