{"id": "t5_2qpzs_t3_q72e7p", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "I have a recent PTSD diagnosis, however, the PTSD was affecting me for around 2 years prior to my diagnosis. As such I struggled to find meaning in life, I struggled to find a way to make it worth living.  \nI languished and played video games using money from a sold business to supplement my girlfriend of then 6 years income and make ends meet like they did when I was working.  \n\n\nI struggle working any job that has any faucet of danger, as my PTSD stems from a workplace accident that I was involved in as a rescuer where I pulled a person out of a machine and stabilized them, getting covered/sprayed in blood and tissue and the agonal gasp I'm pretty sure is the trigger for most of my PTSD and the source of my ongoing... Flashbacks/Whatever you'd like to call them.\n\nMy girlfriend doesn't want to deal with me any more. She struggled to take care of herself, and I would try my best to motivate her and keep her on task with her mental state being much like that of someone who is ADHD. She's cheated on me, and I've begged her to stay with me as much as it's destroyed my pride and self worth because I can't imagine a world without her.\n\n&#x200B;\n\nI can't do this. I can't restart my life in another city with a father who abused me as a child, but he's my only family that is alive. All of my friends have ghosted me as they were her friends first and they all knew about it. I'm in a city where I know no-one. I don't have a job because I can't deal with danger without getting crippling anxiety.\n\n&#x200B;\n\nI'm usually pretty level-headed. And self-preservation is high on my list. I used to think people who wanted to die just didn't understand their options. But I'm pretty goddamn close to just saying fuck it.\n\n&#x200B;\n\nHelp", "url": "https://www.reddit.com/r/SuicideWatch/comments/q72e7p/the_light_has_gone_out_of_my_life/", "title": "The light has gone out of my life.", "social_network": "reddit", "user": "So_Uh", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634095107, "permalink": "/r/SuicideWatch/comments/q72e7p/the_light_has_gone_out_of_my_life/", "nsfw": false, "first_save": 1635425545.4741182, "replies_charged": false}