{"id": "t5_2qpzs_t3_pxscwb", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42"], "text": "I am in 10th grade and this online classes has completely changed me. Last year was ok but this year is torture. Now I just took a few weeks off cos I had headaches and now I am being bombarded with just notes and it's never ending. It's hard to stay up to date cos while I am writing the old notes teachers are still sending more notes. And finally I stopped writing and focused on studying cos an exam is coming next month and I didn't even study a single thing. And I am now tired of everything. I just want a month long break. All I have been doing now is study for 24 hours cos I haven't studied a single thing this year until now. I can't even have a casual convo with my mom without anything related to studies. Whenever I go to my mom the only thing she asks is what about my studies. And I just simply go back to my room and burst out with rage. Explaining online classes is hard to my parents. For them it seems normal classes. But I get bored a lot. Can't focus on the class for more than 5 mins. I really feel that somehow if I just died then all this would be over and I can finally sit peacefully without any studying. My mom says that she won't even let me enjoy Christmas vacation cos I just focused on completing my notes this whole year without studying a damn thing and teachers are throwing out assignments at left right and center. I always space out during online classes. Whenever I talk to my friends they just study for like an hour or two and I feel so jealous. Everyone is just binge watching stuff and talking about it while I just sit here and study. I can't even be free for more than 5 mins. I can't even play with my friends. Now I am punished with no break time other than now cos I forgot to wake up early to study. I can't write notes which teacher dictates in class cos I can't keep up. And now schools are opening up on Nov 1 and I didn't complete my notes still cos I had to study. My parents just think that I am lazy. I just donno what to say about what I am going through.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pxscwb/online_classes_has_lead_me_to_depression_and_this/", "title": "Online classes has lead me to depression and this is my first time having suicidal thoughts. My parents only care about my studies.", "social_network": "reddit", "user": "AnonymousArjun2", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1632910475, "permalink": "/r/SuicideWatch/comments/pxscwb/online_classes_has_lead_me_to_depression_and_this/", "nsfw": false, "first_save": 1635427373.0153832, "replies_charged": false}