{"id": "t5_2qpzs_t3_nxaf2j", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Warning: mentions of suicide and sexual abuse\n\nI feel as if, life wants to just throw all its documents at my face and say \"Your fired\" even though I never was hired to begin with. \n\nIm so so so confused. And angry. If I could i would rather just scream for the next 24 hours and let thr whole world hear me. But that's not how it works. \n\nI was molested growing up by eldest brother. From ages 4 to 11. Told my mom, she made him apologize to me, and told me to not feel sad anymore. That was it. That's all she did. Then age 14, my second oldest brother sexually assaulted me. Few months after, I tried to kill myself. I felt so broken. I was extremely close to my second oldest brother. I didnt feel as close with anyone in my family then j did with him. But then he just had to touch me. He just had to lock the door and close the lights.\n\nI did end up telling my mom again. And she told me this time around \"I won't do anything because then he will feel suicidal and want to kill himself. But he loves you. He always will love and care about you. He would never want to hurt you, the same thing with your other brother. He also loves you. Never tell your father what you just told me. Because then he'll get mad and kick them out\". And that was that. \n\nFor so many years I felt absolutely disgusting. I felt dirty and empty. Id take showers for hours at a time, with the highest heat setting trying to scrub off this disgusting sludge like feeling off of me. My hair became so dry, and my skin started to crack and peel from the constant washing. My hands are constantly dry and I feel so dirty even after hugging my freinds. I absolutely hate my body, and especially my hair. I used to have extremely long hair when I was little. But I cut it all off because it was the one thing my brothers always liked about me. They would tell me how beautiful my hair was and how it made me attractive. I hate it. I hate everything. \n\nBut I finally told someone last year. I finally told someone other then my mom. I was put in a behavioral facility for 3 days, and my brothers are no longer allowed near me, if they were near me then they could get arrested and my parents will lose custody. \n\nBut this happened years ago. Im 16 now, and when I told someome I was 15. Its basically my words against theirs. But the thing is, everytime I told my mom what they did. Everytime I told her I wanted to die, she said she believed me and understood me. She would tell me just how much my brothers loved me.\n\nBut its disgusting. Im disgusting. I dont even know if im a Virgin or not anymore. So many of my memories seem so hazy, and when it finally becomes clear I regret ever trying to remember. \n\nThe first time I attempted suicide I was 4 years old. I was tired, and noticed a lot of cars spending. I tried to jump straight into the road, but my sister grabbed my arm and continued to walk me to school. Next was 14 years old. St this time, I didnt try to kill myself because I hated myself or I hated my brothers. I never hated them. I loved them. They were my family. They weren't always terrible. They did help me in so many ways, and provided me with so many things. I cant just ignore the good things they did. I loved them and always tried to make them happy. Just like my mom told me to do. But in return id get hurt and constantly abused. Im so confused as to what I even was trying to go for. I hated what they did to me, but my mom said they loved me. Love became so twisted up in my head for so long I didn't even know what love was outside of what was happening to me. I was so broken. I wanted to die so badly just to escape. Id have bruises on my body, i eventually started to self harm, and id cut up my skin on the parts that they touched. It was so infuriating whenever I spoke up for myself, id be told it was normal and to just stop crying and get over it. \n\nI tried to kill myself that night, because I thought it was my fault. Because I thought that since I couldn't love my brothers the same way, and if I ever were to tell anyone, that it would be my fault. That it would be my fault they would get in trouble and go to prison. That i was problem. \nI thought that since I needed to fix this problem, that I needed to protect my brothers and the rest of my family, that I should get rid of the problem. That I should get rid of myself. That I deserved to die. \n\nObviously now, I look back and realize just how twisted and disgusting it all really was. How distorted my thought were. I know now it wasnt my fault. I know that very well. But I still end up blaming myself. I feel so paranoid about being in a room left alone with an adult. I feel so scared whenever i walk near a man. Everyday I hear such terrible things about children being kidnapped and then raped and then killed. Im scared that it will happen to me. \n\nI just dont understand why, now that I've told the police what happened, that now my mother knows that I tried to kill myself, why would she look down on me? Why does she choose my brothers over me? She called me a lier. And said \"if they really did that to you, why did you let them?\". I feel so broken. What was i supposed to do? Its not like u ever did anything. \n\nI get it, they are your sons. You love them. You raised them\nBut I am also your daughter. You are my mother too. I love you so much, I try always to make you smile. I am not as rich as my brothers. I can't buy you fancy jewelry or pay your bills. I can't contribute much to the house or finances. But at least I try to be there for you. Whenever you were crying, I was there trying to comfort you. Whenever you were in pain and needed help I was there. I was the one who took care of you when you were sick in bed unable to move. I was the one who stayed in the hospital making sure the doctors took care of you. \n\nBut what about me? Why did you leave me? Why are you calling me a lier when all these years you said you believed me? Denial is big. And I get you denied the abuse when the police confronted you, because you were scared. But can't you begin to think about how I've felt? All these years? I've cried myself to sleep for so many nights, and all I ever got from you was \"stop being a cry baby\". You took care of me, you fed me and put a roof over my head. Yes, and im extremely grateful for that. But what about me? I'm still a kid. Im still a child and im scared. \n\nIt hurts so bad. I miss my brothers because I still care about them. Im still scared it will be my fault that they go to prison. Im still scared for them. But I hate what they did to me. They broke me, and you left me. You left me for them. \n\nMy father was never really present in my life. He was there, but we rarely spoke. We rarely did anything together. When dad finally found out, after me keeping it from him. He was angry but, he still continued to talk to them. And told my brothers that he loved them. And told my sister, that she was a bad sister for not wanting to get along with my brothers. Told her \"we are family. We always need to be here for eachother\". But its all bullshit. Its all just a bunch of lies. Stay in denial. Go ahead. But you can't ever deny that I've told you the truth. I never lied to you. Never. I told you exactly what they did, you just never did anything about it. \n\nMy older sister is the only one in my family that believes, and actually is on my side. She argues with my parents all the time. Last argument, she had with my mom. My mom said \"she can say whatever she wants. Its not always true\". \n\nShe smiles more when she talks to my brothers over the phone, the she does when im near her. She smiles as she tells them she loves them, while not even looking me in the eyes as I try to have a conversation with her. She won't even tell me she loves me anymore. I think she doesn't even want me anymore. \n\nBut then there are days, where she hugs me and asks me to never leave her. I'm so conflicted. With myself and the people around me. I have a therapist I see once a week, but I feel like there's no advancement in my mental health. Though I've only just started therapy so I don't know what I was expecting. \n\nI just wanted to kind of rant. I didn't have anyone to talk to, so I just came here. Thank you, if you read everything, thank you for listening. Im not really asking for advice. I just wanted to get this off my chest.\n\nI hope everyone has a lovely day.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nxaf2j/i_wrote_my_feelings_out_but_it_turned_into_a/", "title": "I wrote my feelings out, but it turned into a goodbye note.", "social_network": "reddit", "user": "OpGenZA", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 30, "down_vote": 0, "creation": 1623397924, "permalink": "/r/SuicideWatch/comments/nxaf2j/i_wrote_my_feelings_out_but_it_turned_into_a/", "nsfw": false, "first_save": 1635422310.337911, "replies_charged": false}