{"id": "t5_2qpzs_t3_5x0xaf", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I’ve been sitting here, typing and retyping.  I’m having a hard time trying to articulate myself.  I’ve been debating posting here.  I don’t know if I belong here.  I’m sorry this is so long.  But I need some help.  \n\nI just want to hear some stories about people who had depression and suicidal thoughts, and overcame them.  Or is living despite them.  Please just tell me that there is a light at the end of all this effort.  I just need some positivity.  I need a lifejacket, I need a rope to guide me to safety, or a stick to fight the monsters, or a warm blanket to make me feel safe.  I can’t keep going like this.  Oh god please tell me that it can get better.  I need some positive words.  \n\nI have a support system but my family doesn’t understand depression.  I can’t talk about suicide with them.  I’m not saying their lives were easy.  But neither of them have hated themselves like I hate me.  I need to hear from people who have hated themselves that, somehow, they don’t anymore.  I want to hear about how that happened- if it’s a process that took seventy years or two months, I don’t care; I need some hope.  Because sometimes life feels like a series of rock-bottoms.  And each pit gets worse and worse.  \n\nSuicide pops into my head at least once a day, if not more.  Normally it was like a security blanket, like “well if I fail this test I’ll just kill myself.”  It made me feel better.  Or wishing for a truck to destroy my car in some sort of accident.  But I’m so unmotivated lately and miserable and empty.  I have a plan and a means to carry it out.  I’m just too cowardly to do it.  I still want to believe life is worth living.  So many people seem to enjoy it, at least.  And my family would be so upset if I was gone.  If it wasn’t for my family, I would be dead already.\n\nI guess, for context, I’m twenty-four years old and female.  I’m getting a Masters in literature, and I’m interested in queer theory and comic studies.  My first semester I had to drop a class because of unmedicated depression and ADHD, and I lost my GA position.  I worked hard, continuing to work for my GA professors unpaid, and have regained the position this spring and am back to fulltime.  But I’m slipping again.  I haven’t done two homework assignments for a class, and I can’t even explain why.  I’m sitting in front of the reading material for ten hours and I don’t get past three sentences.  I cut off distractions (internet, phone), but my stupid head can’t focus.  It’s hard to get out of bed.  I can sleep for over twelve hours and still feel exhausted.  Or I get insomnia and can’t sleep for three days.  I eat too much.  I eat until I throw up, then I eat more.  It’s weird; I want to feel happiness with food, but it’s also a way of punishing myself.\n\nI’ve been depressed since middleschool or maybe earlier.  I just remember discovering in 6th grade that it’s not normal to think about suicide every day.  Things used to be bearable but it’s harder and harder to move forward now.  I’ve been on and off medication since middle school.  Right now I’m on Zoloft 150mg.  My doctor doesn’t want to prescribe me ADHD meds until my mood has stabilized.  For the first time in my life I’ve been taking my meds at a regular time period, every night at 10pm.  I have a therapist, but I won’t see her for another two weeks.\n\nI like graphic novels and Overwatch.  I’ve always wanted to make my own webcomic, but I’m not very good at writing or at art.  All my ideas are childish and silly.\n\nI don’t know how much of that was necessary, but that’s about me.  I don’t normally talk about myself and am a little embarrassed to talk so much.  So please tell me about yourself.  I want to know it gets better.  I need encouragement from people who’ve been through it.  Please help me.  \n", "url": "https://www.reddit.com/r/SuicideWatch/comments/5x0xaf/i_dont_have_a_good_title_please_help_me/", "title": "I don't have a good title. Please help me.", "social_network": "reddit", "user": "muffinkiller", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1488425837, "permalink": "/r/SuicideWatch/comments/5x0xaf/i_dont_have_a_good_title_please_help_me/", "nsfw": false, "first_save": 1635422954.6414175, "replies_charged": false}