{"id": "t5_2qpzs_t3_m6rfhs", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "Hey there, I have an appointment with a psychiatrist here in about 3 weeks. I am going in because I am having trouble functioning in everyday life. Whole other post on a different forum about my difficulties. I always have had trouble functioning at an average level, but prior to recently have been able to cope myself out of it to achieve the bare minimum. I am 22, and suicidal thoughts have stuck with me since about 15 yrs old. The motives have changed, but from the outside looking in have become more serious. The thoughts have really never concerned me. I accepted death at a young age, and always felt an “intuition” that I wasn’t meant to live a full life. (It’s abnormal thinking, I know but it’s how I feel). My motives now are that it’s an ethical duty, a chore that needs to get done eventually, and that it would unmoral and selfish of me to think otherwise. I want to mention I think life is beautiful and not some frivolous thing. I have a true appreciation for life and humans with their flaws. But I obviously do not apply this to myself. I feel as though I am a some demon that needs to be slayed. Not human, not the same, separated. \nI’m posting this to see if anyone else has experienced this. Any insight is greatly appreciated. \nAlso, how do I go about telling my psychiatrist without getting institutionalized? I want to get a proper diagnosis for my issues so I can have some even little improvement in functioning so I can not only avoid a massive breakdown, but also so I can cope enough to get passing grades. It is passive at the moment, but if I fail my classes this semester I wouldn’t be too sure. \n\n*By the way, I have had nothing but a life of supportiveness. So no known environmental factors to contribute.", "url": "https://www.reddit.com/r/SuicideWatch/comments/m6rfhs/suicidal_ideation_motive_as_ethical_duty/", "title": "Suicidal ideation motive as; ethical duty", "social_network": "reddit", "user": "Hey_Makay", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1615952817, "permalink": "/r/SuicideWatch/comments/m6rfhs/suicidal_ideation_motive_as_ethical_duty/", "nsfw": true, "first_save": 1635427278.5264018, "replies_charged": false}