{"id": "t5_2qpzs_t3_pxr9o8", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "I’m sitting here watching my blood drip from the cuts I’ve made and as the blood slows down I make more cuts. \n\nEveryday I’m yelled at I’m called worthless, I’m told I’ll never amount to anything, that I’m just a waste. The only thing that helps is cutting. \n\nI’m tired of being alive I’m tired of constantly being put down and I’m tired of the constant pain. \n\nI just want to end it. I’m really thinking about just ending my life and getting it over with. I try to think of reasons to keep going but it just makes me realize how meaningless and pointless my life is. \n\nI’ve been through so much and my life is barely getting started imagine how much worse it’ll get.\n\nI’m honestly just thinking of popping Benzos with opiates and oding or cutting my wrist open and finally escaping. \n\nI don’t even have anyone to turn to or talk to. This is my last cry for help. If no one answers by the end of the night then I’ll know my life has no meaning and I’ll just get it over with.\n\nIt’s been a long bumpy rough ride and I think it’s time it came to an end. Thank you to anyone who showed me the slightest attention and may you be blessed. I think my life was one without meaning and it’s time for me to go. \n\nThank you to anyone who read this. As one of my favorite quotes goes “And when I'm gone, just carry on, don't mourn, rejoice\nEvery time you hear the sound of my voice, just know that\nI'm lookin' down on you smilin' and I didn't feel a thing\nSo, baby, don't feel my pain, just smile back”\n\nGoodbye friends.\n\nEdit: I’m getting comments but they aren’t showing up, it says there’s comments but when I go to check nothing appears so if you would like to reach out or talk PM or Start a chat if you would like.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pxr9o8/my_last_cry_for_help/", "title": "My last cry for help", "social_network": "reddit", "user": "Slideitinhoney", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1632905244, "permalink": "/r/SuicideWatch/comments/pxr9o8/my_last_cry_for_help/", "nsfw": true, "first_save": 1635426749.0406756, "replies_charged": false}