{"id": "t5_2qpzs_t3_q7823n", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "I’m exhausted. All I want to do is sleep. When I do get to sleep I pray that I won’t wake up. Sadly, life continues and I have obligations. I’m trying so hard but existing alone is hard… it takes all my energy. It wasn’t this bad before. I had reasons to stay alive and I chose to stay so that I wouldn’t hurt the people in my life. But as I slip deeper and deeper into my depression they all seem to not matter. I think “hey they’ll get over it eventually”. Every day I just wake up and it feels like I’m waiting for something. I just realized that I’m just waiting to die. I’m not going to harm myself because I’m honestly too mentally exhausted to deal with what that entails. I’m just… here. I think if I ever went to do it I would think about the people I would devastate and decide against it. But I’m not happy. I have never been happy. Nothing excites me nothing interests me. Nothing motivates me. I have started disassociating on purpose to pass the time when I’m doing things that take effort. Sometimes I do it while I’m working on an assignment so that I don’t have to actually experience doing it… if you know what I mean? I’m no longer interested in what I’m in school for so I have zero motivation to even do the assignments but I do… when I think of dying the idea of it feels peaceful… it feels like a giant weight off my shoulders. Anyways, I am here because I don’t want to hurt others but at my own expense. A couple of months ago I saw first hand what suicide does to those left behind… and I can’t do that. I don’t know what the hell to do. I have a therapist and someone who loves and supports me. I have friends and finally cut my toxic parents off for good. I used attribute my depression to that fact that I couldn’t find a relationship that worked out or that wasn’t abusive. Now I have someone who wants to share a life with me, have a family and this relationship is all I’ve ever wanted. The only thing I’ve ever been sure of my whole life was that I wanted a family. It used to be my only reason for living. I should feel better because I have so many things I used to yearn for. But now that I have these things I’ve realized that I still feel empty I still feel lonely if anything I feel worse than before. Life doesn’t interest me and living feels like a burden and thinking about it both fills me with dread and anxiety. I mo longer care about having a family. I don’t think it’s circumstantial… it’s just me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q7823n/alive_out_of_guilt/", "title": "Alive out of guilt", "social_network": "reddit", "user": "Numerous-Aside0830", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634120059, "permalink": "/r/SuicideWatch/comments/q7823n/alive_out_of_guilt/", "nsfw": true, "first_save": 1635426172.6660786, "replies_charged": false}