{"id": "t5_2qpzs_t3_lxv55q", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "Hi. Uh. Do I provide trigger warnings? I guess when in doubt I’ll put them anyway. Eating disorders, suicidal thoughts and self harm.\n\nSo, well, alright. How do I talk about this. Warning that this might get political I guess? I’ll try to avoid the root of it, but political dissonance in the household is one of the causes of conflict here that’s getting to me. I would like to be clear: the entire point of the argument is that I DON’T want to talk about it. \n\nIf you read my post history then, yeah, I broke up with my boyfriend recently. Sure, it’s a stressor, but not really as much of one as I would’ve thought. I feel a bit better with distance on that one, you can read the post for context. It’s been a week since I broke it off with him and he did previously happen to be the only person I really talked to, so while that may have some bearing on my current state, I do believe I am better off without him. \n\nAlright. Onto the real stuff. The more immediate stuff I guess. Over the course of this past week my anxiety’s gotten worse. I’ve started having all my classic “tells” that I’m stressed—muscle aches not explained my exercise, being unable to sleep at all (I’ve gotten a total of 3.4 hours of sleep in total according to my Fitbit for the past 7 days), eating disturbances (bulimia’s gotten worse, I’ve really been binging horribly and throwing it up but burns so much worse than it used to). so things are bad. Today I’m tired but sitting in a pitch black room after taking Benadryl and putting earplugs in for an hour didnt do anything to help me sleep. I’m still awake. I don’t consume products with significant forms of caffeine, so that’s not the problem. I’ve been taking my meds. Not really sure what the issue is. Anyway my head feels like it’s full of cotton balls and I can’t think. I’m starting to stutter again, which sucks. My parents make fun of me for that. Always makes it worse. \n\nSo today my father asked me if I wanted to go to a convention later in the year, I said I didn’t really feel safe doing that. This devolved into a conversation, then further into an argument that basically sums up to: \n\nMy side: I’m too tired to debate. I can barely do work and I’m obviously stressed and I’m trying to make it through the day. I do not want to talk about this. Please do not make me talk. Please let me eat my lunch so that I don’t starve myself and eat even more later. I have therapy tomorrow. Just let me get through this. I know we disagree on this issue and I know you will not believe anything I say and will argue that the burden of proof is on me, which I do not feel like I have enough energy to carry. I just don’t want to fight. Please don’t make me talk. Please stop laughing at my stutter. Please just stop. \n\nVersus \n\nMy dad, who thinks that I: -am lazy, stupid, and that the reason why I’m not talking is because I know my argument is indefensible. The fact that I refuse to engage the conversation means that I’m not even willing to talk to him, which is unreasonable and shows really how far this country has fallen because you’re not even willing to stand up for your beliefs and you’re extremely isolated just because you know any other viewpoint would absolutely obliterate your fragile viewpoint and ego. You’re ungrateful. You’re mean. This is abusive to refuse to talk to me. This is because you’re hormonal. Being tired is an excuse because we all know you do that intentionally so you can play the victim. Stop shaking, stop stuttering, we know you do that for attention, stop. \n\n\nAs you can see it’s a very productive conversation that ended with him less than a centimeter from my face telling me that if I loved masks so much that I should go... “suck Fauci’s dick.” They have a habit of calling me a whore. I’m not even physical in my romantic relationships but it’s still hurtful even if I know it isn’t true. \n\nAnyway my heart was racing and my chest hurt and I felt shaky so I grabbed a mask from our mask Laundry bag on the door and ran outside “for a walk” in my pajamas and without my car keys. It’s freezing here. I tried to stay outside for as long as I could but I can’t exactly do much. Eventually I was forced to return because they got the neighborhood to corral me back to the house. The only thing I could’ve said to stop them was that I need help and that I don’t feel safe. I would lose everything if I said that. So that’s not happening. Haha. \n\nSo now I’m locked in a bathroom upstairs with people yelling into the door. I don’t really feel like there’s a way out of this situation—not just being locked in a bathroom but in general. My bank accounts aren’t in my name and I cannot pull the money from them. If I leave here, if I do anything, I lose all forms of insurance, money, belongings, everything except my car, which is the only thing in my name (except the insurance). I don’t know. Even then, it’s not like it’s bad enough to even report. they’re not physical or anything. It’s my own goddamn fault and I know If I complain to anyone about it the answer’s always going to be “move out” and “how much of an idiot are you, just leave, when I was your age I paid off college and paid rent and got my own insurance and phone plan and everything else by pulling myself up by my bootstraps, that’s how parents are.” But I don’t HAVE a way out. The monetary cushion id have would disappear the minute I tried. All my paychecks got deposited in an account I don’t even own. I have nothing to my name. I have no way out. I don’t have friends, really, except for one that reconnected with me but it’s mostly an acquaintanceship. I dumped my boyfriend. At this point I’m kind of thinking my best course of action is to die. I won’t have to go through this anymore. I won’t have to try to ask for help and listen to the talk about how this is my fault anymore. It’s less expensive for everyone anyway as long as they don’t have some sort of fancy funeral for appearances. They’d have more money to help my brother move out and get married and give them the grand babies they want. They’d have more money to retire. Everyone would be happier. They’d fight less.\n\nI don’t know. I don’t really see a point in trying to walk outside anymore. I don’t know a way to move out. I’m a negative influence on everyone. I keep thinking about doing something specific but I don’t want to describe it because the rules say no describing plans I guess. But I am thinking about it. \n\nI don’t know. I think my therapist would say I am silly, I am just in pain and making a catastrophe out of a little thing, that I am being dramatic. Maybe that’s what I need to hear. I really don’t want to but maybe it is. I don’t know. I don’t really feel happy about much anymore, so if I make others so frustrated and even I’m not enjoying life, then I am really not sure how to justify staying. It doesn’t make any sense.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lxv55q/im_stuck_i_guess/", "title": "I’m stuck I guess", "social_network": "reddit", "user": "devastatedbeans", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1614891336, "permalink": "/r/SuicideWatch/comments/lxv55q/im_stuck_i_guess/", "nsfw": false, "first_save": 1635422931.3962097, "replies_charged": false}