{"id": "t5_2qpzs_t3_nz96mk", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "Hi everyone,\n\n&#x200B;\n\nFirst post I'm doing here. Haven't done any long Reddit post in a few years, actually.  Last one was in 2016 on /amiugly. It says it all. So, I read a few other posts and I relate to everything so much. Buckle up, because it's going to be a long ride. I am going to explain what others don't see.\n\nI am healthy, my parents love me,  I am just 20, college is doing okay, I am not underweight or overweight, I am very far from broke, I have some wonderful friends. I'm living in the city I've always wanted to live in, in a beautiful apartment. \n\nSo why, why am I still struggling every day? It truly feels like a never-ending battle. I don't think I could ever commit suicide, because I don't have the strength, and also because I know it would destroy my parents. And I know that life can be beautiful, I know. But I think my need for love and recognition is too big to ever be fulfilled. \n\nDuring my teenage years, I was hideous. I know that beauty comes in all shapes and sizes, but I had a huge underbite that I only got fixed after high school, I had severe acne, tried Accutane but was allergic, and was overweight. Looking at myself in the mirror was insanely hard. I thought things would get better after the surgery, and it did for a while, but now am just back at it. I know how vain and superficial it sounds, but I just want to be and feel pretty.  I know how easier life can be when you correspond to beauty standards, how people love you and respect you more. I hate that. I hate that so much. Even if deep down, I know that being insanely pretty would not help me, or barely. I developed an eating disorder at 15, became slightly underweight, nobody cared of course, then became bulimic, and now I struggle with binge-eating. Because of some family problems (one of my parents was alcoholic), I also developed this thing called maladaptive daydreaming. I spend so much of my time in this alternative reality where I am absolutely perfect and where everyone loves me that I can't stand looking at the way my life is in the real world. I've tried stopping it, it's so hard when it's one of my only sources of happiness. I've developed a fixation on a celebrity, and trust me, even writing these words down makes me feel incredibly weak, cringy, and stupid. Not only that, but I envy her so much, I can spend hours staring at pictures and videos of her even though it is hurting me, because I will never be her, or close to her. Maybe a kind of self-harm? Oh, I also have trichotillomania while we're at it. We could see my scalp from 11 years old to 13, now I still have it, but at least I can control it, so it doesn't show. At school, people would say that I had burned my hair with a hair straightener. Funny. \n\nThe irony? The famous girl I'm obsessed with also struggles with her mental health. But still, she is beautiful, lives her dream, and is adored by millions. I realize how superficial that sounds, and it costs me to write those words, to show how futile I can be. I haven't even talked about this to my therapist, and she is on holiday until next month.\n\nMy dreams could never be achieved, because I'm not good enough. I am lazy and envious, and I feel like I'm such a bad person. I want to write, and I just launched a blog, but I know that it will never really be successful because most of the things I write are mediocre. I want to make music and be in a band, I'm taking singing lessons but I can hear how bad my voice is, no matter the techniques I use. I need to choose a master's to study after my bachelor's degree in literature, and I am absolutely lost. I know I will never be happy in a 9-5 job, I need art to even start thinking about happiness. But I lack talent, and I feel like no matter how hard I work, it's useless. \n\nMy big sister  (2 years older than me) has, I suspect, an untreated personality disorder. She always feels the need to bring me down, I tried to stop caring, but I just can't. She used to call me a \"walking fat ball\" and last year she had a kind of hysteric crisis where she almost violently hit me, my dad had to intervene to protect me. I've been living 6000 km away from them for two years now, and I thought it would improve our relationship. It did not. \n\nI wish there was a button I could push that would make everything stop. The issue is, as I wrote above, I know how beautiful life can be. A good afternoon with your friends, dogs, baking with your mother, traveling, reading a good book on a sunny afternoon on my balcony, walking and getting lost in the streets. Also, somehow, I see that people know they can count on me, I am very involved in student organizations, I have projects and plans. There are many people I can count on as well. I love my friends deeply and would do anything for them. They would be very sad if they read those words. I just feel like it's not enough, like it will never be enough, because the expectations I set in my daydreams and through my fixation with this celebrity are way too high.\n\nOn my bedroom wall I wrote \"It's your own reality, your own simulation, create your own version\". I try to make my reality fit my dreams so hard, but I constantly fail, and when I try to make my dreams fit my reality it always ends up being out of reach. I don't feel like therapy is helping. In bigger letters, I wrote \"make me proud\". I really want to be proud of myself, to be my main and primary source of love and validation, but I can't stand myself. \n\nWith my first therapist a few years ago, we talked about dysthymia, something I might be having. Sometimes I hope I have it, so it means it's an illness I could heal. But he wasn't even sure I had it anyway. \n\n&#x200B;\n\nIs there an answer to this? Will there ever be an answer? I've been sad, insecure, envious and unsatisfied for so long now that I don't even know how it feels like to be happy, confident and content. \n\nSorry for this long text, I just needed to get everything out.\n\nThank you for your time if you made it this far, it means a lot if you cared enough about a total stranger to read her awkward words and thoughts. Thank you. And hold on, because no matter how desperate I sound, maybe there is a way out and an answer to everything, maybe it's just a few days away from us, a few texts or a few singing lessons, a few years, a few classes, a few people. Who knows. \n\n&#x200B;\n\nWho knows...", "url": "https://www.reddit.com/r/SuicideWatch/comments/nz96mk/i_seem_to_have_it_all_but_in_reality_every_breath/", "title": "I seem to have it all, but in reality, every breath is a struggle.", "social_network": "reddit", "user": "i-am-an-ocean", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1623627542, "permalink": "/r/SuicideWatch/comments/nz96mk/i_seem_to_have_it_all_but_in_reality_every_breath/", "nsfw": false, "first_save": 1635428106.3413444, "replies_charged": false}