{"id": "t5_2qpzs_t3_qbfb0s", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "I don't really know how to express these thoughts inside me. I feel like life at this point is dull and meaningless. Nothing I'll do will matter, nothing interests me, everything annoys me. Moreover, I have social anxiety. The human being is a social being, we need to interact with people for every aspect of our lives, and I can't even do that essential thing in the human being well. Having social anxiety you could think I fear social situations (and it's true), but I'd rather say that fear is more like hate. I hate how people behave, and I hate that I have to live with them.\n\nI'm 17 yo, and I'm going to high school. I don't see the point in going, I don't want to do homework. I don't want to waste my life studying things I don't fucking care about. The only thing I like is reading books and I can't do it because I have lots of fucking homework I don't want to do. And I'm tired of listening to \"It's all for your future\". **Bullshit**. Why would I want a future where I have to work every day till I retire. That's too long, and I don't want to live that long.\n\nLife for me is senseless. It's like a disease, a disease from which I can only be cured by dying. Do you know Socrates? His last words, when Athens condemned him to die, were: \"I owe a rooster to Asclepius.\" Asclepius is the god of medicine. Socrates understood that life is a disease and Asclepius cured him, giving him death. Consequently, Socrates had to pay the doctor, as was done at the time, for his services.  Life is a disease, one that corrodes you inside, slowly, without realizing it. Your lungs threaten to stop breathing, your stomach constantly tries to kill you, and the only way to calm it is by feeding it. Your own mind tests you with those intrusive thoughts. Everything in this life is a danger, you have to be attentive to everything, you have to make an effort in everything. And when you rest? Upon dying.\n\nAnd the solution seems easy, right? Just suicide. Why it has to be so easy? Why the human body has to be so fragile? I could just climb to the roof of my building and throw myself. But... I'm still here. It's easy and fast to do. Yet, I can't. And here is where I'm completely lost in my mind:\n\n1. What would happen to my parents and friends? They really care about me, they really try every day to make me happy. Wouldn't it be so selfish to just throw that away? I can still find something I like, work in that, find a SO, have a family and so more...\n2. Why would I care about the others? I'll be dead, I won't care about my parents and friends. I won't have to deal with life anymore. I won't have to study, I won't have to work, I won't have to try and find a SO, because I'll be dead. So, why would I care about all those things?\n\nThese two mindsets are continually exchanging throughout the day. Which is the good one? Which is the real one? I believe both. I have reached both mentalities and both are mine. Why it has to be so hard?\n\nDo I really look selfish? Why do I feel like this is all just arrogance, that I have nothing to be sad about? My life is good and yet I don't like it. Am I not very stupid?\n\nThanks for reading\n\nPlease if you know me irl, don't read this. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/qbfb0s/ive_lost_interest_in_life/", "title": "I've lost interest in life", "social_network": "reddit", "user": "SDDKun", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 54, "down_vote": 0, "creation": 1634661409, "permalink": "/r/SuicideWatch/comments/qbfb0s/ive_lost_interest_in_life/", "nsfw": true, "first_save": 1635425519.7737713, "replies_charged": false}