{"id": "t5_2qpzs_t3_eibxhs", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I'm not sure where to start but I feel like I don't have any other choice but to kill myself. \n\n\nI'm 22 and have been dealing with depression since I was 16 but it's been very severe the past 3 years. There's something wrong with me and I'm certain this feeling will never go away. I struggle with human interaction and can't form an emotional bond, not even with my own mother. I've never been in a relationship or have anyone I can rely on. My friends only see me as \"the girl who's always struggling\" and I can see the judgment whenever I express my feelings to them. I've tried to find a passion but everything feels forced. The only thing that has ever brought me happiness has been food. Food seemed to be the only thing I could live for but years of binging/bulimia has caused my digestive system to shutdown. I've been treated with a variety of medication in the past but the side effects were extreme and I can no longer afford to go. I've tried to stop but I fail every time, I'm a failure and don't know why I'm here. My body is disgusting and now I have severe acne. No matter what I do, everything keeps getting worse. I feel like I deserve this, I deserve to suffer but I'm not sure how much longer I can hang on. I'm in massive debt with no way out. My job is stressful and I fear that I'll be let go soon but the debt keeps piling up. I don't know what to do if I lose my job. I'm alone and feel exhausted waking up to the same shit everyday. I can't even look at myself in the mirror and when I catch a glance, I feel nothing but disgust. I tried killing myself with a bottle of pills a year ago but it didn't work. I have access to a gun. I've never shot one before but I'm not confident that I can slit my wrist deep enough to do the job. I'm scared and just want to feel better but nothing changes no matter what I do. I tried to tell myself \"hang in there for 10 more years, give it some more time\" but I don't think I can even wait another week. I don't know why I'm posting this. Everyone says the same thing. \n\n\n\"Try doing this\" \n\n\"It'll get better\"\n\n\"Keep a positive mindset\"\n\n\"This feeling will pass\" \n\n\nI feel so frustrated when people tell me this, like I haven't tried it before. It's been years now, how much longer? I'm not sure if God is real, I believe there is something out there but I feel like I've been abandoned or punished for being such a shitty person. I'm desperately hoping a miracle will happen, something that gives me the courage to keep going. But this emptiness keeps getting heavier every day. I can't do this by myself and no one truly understands. I feel so worthless, what's wrong with me? I don't want to die.", "url": "https://www.reddit.com/r/SuicideWatch/comments/eibxhs/i_feel_like_i_dont_have_a_choice/", "title": "I feel like I don't have a choice.", "social_network": "reddit", "user": "quest2be33", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1577841372, "permalink": "/r/SuicideWatch/comments/eibxhs/i_feel_like_i_dont_have_a_choice/", "nsfw": false, "first_save": 1635422949.3229003, "replies_charged": false}