{"id": "t5_2qpzs_t3_nlm39f", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111", "8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I didn't ever see myself using this app much, especially not for this, but reading through this subreddit myself in some strange way of coping has filled me with the urge to yell my problems at strangers in hopes that one of you relates.\n\nAs the title says, I'm not at all into my adulthood yet but I genuinely believe that I should die as soon as possible for the sake of my own health and wellbeing. My mental state is far from good and I suffer from a lot of seriously Bad mental afflictions like paranoia and psychosis, and on top of a lot of trauma I've had and the fact I probably have something like ADHD or Autism (all of which I am unwilling to get tested for thanks to said paranoia) it all makes my life miserable. A lot of my family members struggle with these exact issues even worse so there isn't even any hope in me that I somehow managed to avoid inheriting these things, it just feels like somehow this was done on purpose by God or something to make sure I have the worst and most horrible burdens on my mind 24/7. (Not to demonise these things, but they just bring me so much sorrow.)\n\nIn any case, whatever is fucking up my mental state really does make my life painstaking. I'm unable to feel any enjoyment from literally Anything, it's impossible for me to pick up any hobbies and on top of my genuine disgust and hatred of forming intrapersonal relationships with people or being happy it makes my life quite literally a living hell to deal with. Recently I've been getting more and more bored with everything around me, and sometimes it genuinely drives me to the point of tears. I can even physically feel the mental pain I get when I go through one of these boredom-induced episodes, it's like if all your built-up resentment and frustration with everything came crashing down all at once.\n\nThe only thing even close to an interest or some kind of \"hobby\" I have is my very specific fixation on someone I'm too embarrassed to name, (this very fixation also makes me want to rope,) but even then I'm mature enough to realise the happiness I get from that is never going to amount to anything useful.\n\nAt this point, I really do just feel like the best option is for me to die. And I welcome that idea too, this isn't my mental illness speaking but my own realistic outlook on life. There is nothing for me to live for and this is a fact. I don't want to get a job, I don't have any grand plans for changing the world or even making people happy- I live because living used to bring me joy, but now all it brings is sorrow. And if feeling sorrow no matter how much effort I put into avoiding it like the plague is hardwired into my brain, not with a chemical imbalance that can be curbed by pills, but with a genuine physical issue that will never be fixed, why should I let this painful life go on any longer?\n\nI know that all that sounds very edgy and whiney but I just needed somewhere to vent. I don't enjoy living, I hate everything this world stands for and I'd be more peaceful dead. I just want to let my soul leave my body and start again. Does anyone feel the same? I feel so alone right now. Not even my online friends feel this way.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nlm39f/im_still_young_but_i_honestly_cant_see_a_reason/", "title": "I'm still young but I honestly cant see a reason to keep living.", "social_network": "reddit", "user": "throwaway8892893", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 10, "down_vote": 0, "creation": 1622048986, "permalink": "/r/SuicideWatch/comments/nlm39f/im_still_young_but_i_honestly_cant_see_a_reason/", "nsfw": false, "first_save": 1635427053.0478692, "replies_charged": false}