{"id": "t5_2qpzs_t3_lyohk9", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "Life, despite it's hardships is so beautiful, so mesmorising, with so much to live for and experience if you know where to look\nYet, despite it all, my ever greatest wish is to be removed from this world, from any world, utterly deleted, gone!\n\nI fantasize, a lot actually about not partaking in this world as a conscious being, capable of thought, senses, memory or emotion.. \nI do not want to exist, by any means possible, I do not want to continue being someone who is conscious and it terrifies me even more that if I would ever die, I would wake up in another body where I can once again see through their eyes, feel through their fingers and live up to another journey that is so called life.\n\nI don't want to be alive.. I don't want to be alive ever, I'm not much of a religious person, but if it happens and there's an after life my first instinct would be to go on my knees and beg to not ever be born again, my only ever wish is just to be eradicated, deleted from existence in any form possible, if physical or mystical, it's all I ever want and have wanted.. It scares me to death knowing I could exist once again.\nI just want to be gone as if I never existed before.. \nAnd this is a difficult feeling, it's an itch I have been feeling ever since I have been a mere child, and it burdens me to live every second being shackled to being a conscious being, it's killing me. \nWhat's most difficult about this is that the core of this feeling is not unlike any other, most common reason for people to have the desire to end their life is because their life is not going well, either they are depressed, lost everything in their life, are not loved, lonely, plauged by mental issues that burdens their life and etc \n\nHowever it's not depression that is giving me this feeling, if anything it, while death is certain of you wait until you age, it yet still depresses me that I am unable to end myself sooner, every minute is a chore to go by\n\nMy life has been keen to me in the past, my family have abandoned me and used me for their own benefits of survival, reduced me to nothing and abused me, a lot of situations I was in were unlucky, I never been loved, I always lacked intimacy, real friends and my financial wasn't any better, I had nothing in my life but a computer I could socialize in. \nThis has changed, all that is in the past, I'm happier now, there's so many people who care about me, in real life and online, I accomplished things that meant a lot to me, I have had fans, I had people love my work, I am married and have a family I can finally call my own, I'm loved by so many \nAnd while life can be cruel and harsh, I am in love and fascinated with the world, I love learning about the earth and the cosmos, I love discovering new things and I always love finding the beauty in things!\nTake me to a walk in nature and I would always find something to be excited or mesmorised about, nature is so wonderful, so complex and learning about what makes them so complex to the point of science makes it such an experience to live for, life is so magical and so interesting, always making me curious for more, and I never regret to achieve a new piece of knowledge, the wonders of this world makes life so exciting and thrilling with so much to learn about, so much to enjoy!\n\nLife is truly beautiful when you choose to look at what makes it so pretty! I wish I could just live forever to learn every possible detail until I run out of things to learn, I wish I could even see what complex consciousness aliens look on other planets, but I'm never going to live this long to see it happen, unless I'd be fortunate! With how quickly our technology advances things that might seem as science fiction right could become reality very soon! \nLife is always improving, things today despite how bad things may be, have been much worse in the past, yet there's still so much to work on to make things better for ourselves and our society which will make the future a safer far better place for us to live in!\nI'm so fascinated with the world that I like to be philosophical and question the world so I could learn much more about it and as well live with a piece of mind, knowing how to love everything, others and myself. \n\nBesides that, life has endless opportunities, endless things to see and experience, depending on your will and the risk your willing to take, life can be taken to such great extents if things don't fail instead.\n\nYet... I still want to be dead, I crave death like I'm deprevied out of it..\nIt's like as if Im very dehydrated yet I don't get the chance of drinking water, but instead it's been like that for the longest time I have been alive, even at my most enjoyable moments, it's destroying me..\n\nThere are of course some things in my current life that may make a person depressed, but it is not the reasoning for my desire to be dead, maybe just an encouragement.\nIt's really tough because, I could be the happiest in the world and live every moment, every second of just being happy, and I would still itch to die, I want it more than anything in the world, and it's becoming so severe at this point I'm willing to sacrifice whatever is around me, even if it means leaving the people who love me traumatized or sad for the rest of their lives, however I still do wish and seek whatever way I can do minimalize the damage, nobody deserve such a shift in their lives, something like that to carry to their graves... But at this point it's becoming so extreme that I'm willing to even take that leap of faith, whatever the cost may be.\n\nI want to be dead regardless if I'm happy or not, regardless of if my situation was at it's finest or at it's worst, if loved by all or not, regardless of if things will be better or not, regardless of anything that could make a person feel like absolute garbage and feel the need to end their life....\n\nYet I cannot find anyone who shares the same mutual feelings about death as I do, I'm sure they probably exist, everything has a chance of existing, so I doubt nothing \n\nI'm worth, I'm important, my existence improves the world and those around me and I'm not a waste, this applies to everyone else! I'm just a human being, whom have been created from matter that once used to be other organic life forms, and I'll be returned back to give nature new life while once I'm gone, \nI'm just a bunch of complex cells working togethet creating the breathing person that I am, and I should not be expected of so I should not feel bad about myself because of some social norms, that I have inherited growing up, poisoned to think that I was born with the purpose to satisfy others, and neither should anyone else, everyone have worth and have any kind of qualities, even you! You deserve to love yourself! You're not pathetic for existing even if life may make it look that way! You're doing your best to make the world a better place whichever you're doing big things or small, even if you don't, that's fine too. \n\nYet with all these qualifications, I still want to be dead. \n\nIt's like a curse, while being plagued with the need to be erased from this world may sound like the curse,  the curse I'm living is being alive.\n\nIs guess that makes it subjective then haha!\n\nI dream of the day I'll be dead, I really want to be dead, and never alive again! \n\nI always look for ways to kill myself, but it corresponds with my body whom I share rooms with, I still have all instincts that will stop from killing myself. \n\nI'm afraid of dying painfully or uncomfortably, it takes a lot of courage for me to commit to taking the action of killing myself, and once I'll be in the process, I'm sure my body will kick in, panic and try to escape or fight it.. \nDue to my love to knowledge, I have become very capable, and that serves and a disadvantage if I ever were to kill myself, because I'll find my way out of it like fucking climbing the rope I'm hanging off, or if I were to jump from a high enough place, I would try and land on my feet or back instead of my head. \n\nIt is not because a part of me wants to be alive, it's just purely instincts, the brain will do whatever possible to maintain its own life, if I'll put it in danger, it will take the wheel and take control over. \nHell, my brain even clings to the possibility that if by a chance a place hell exists, I'd just be going straight to it after my death, spending an incredible time being tormented the same as prior to killing myself or if not worse \n\nThis not to mention how most methods are not success proof, any kind of method if failed can either end up you curling in pain for what it would seem eternity until you finally die, or turn you into a handicap or a vegtable and make your life worse than prior to your attempt to kill yourself, and it's not the way I want to live if my attempts were to fail. \n\nFor almost a decade I have spent an incredible research on all possible methods, I know almost every possible way to die, what are the phases, what pain you would experience or not, what should you use to increase your success, stories and studies of some deaths and really bizarre stuff. \n\nThe painless death I can think of is an exist bag, if done right, but I don't have access to high grade helium tanks, I can't carry any, I can't drive and I don't have anywhere private to do it in, yet. \nThings obviously will change once I'll be able to drive and such, well that's as long as I would still be able to afford an exit bag and hope to god that it wouldn't fail. \n\nA shootgun to the head is also a quick and pain less way to die. \nThat if I had access to such guns AND I had someone to assist me by shooting me in the head multiple times just to confirm my death. \n\nMost accessible right now is getting a sturdy rope and tie it around another sturdy thing, and then jump off a bridge or something high so the rope would just snap my neck. \nHowever I fear that if the rope would break free, I would end up taking a horrible landing destroying my body and keeping me very much alive. \nOr if my neck gets snapped, I'll still be conscious for a little bit until my brain is deprived out of all oxygen, probably still having some nerves attached and I'd be spending my last seconds watching in terror the feeling of the weight of my body straining me down. \n\nBest would be Death by a guilatine, hopefully I can bare the leftover seconds thst I have to die and not feel anything from the shock caused by getting sliced clean in my neck \n \nSecond best by the 3 way injection involving muscle paralysis medication and poison, but that's if you have access to the stuff and aid from someone near. \n\nAnyway it's probably against the rules to discuss those further, \n\nIt's just so hard, death while seeming easy, is so not guranteed and can end up catastrophically. \n\nThere's so escape.. I'm imprisoned in this body.. In this life.. Which I don't want to be in.. I don't want to be able to know, see, feel or feel \nI don't want to be able to enjoy stuff, I don't want to be happy, I don't want to be fulfilled. \n\nI just want my life to be over, I want this chapter to end... I'm living a curse.. \n\nThis is a torment.. I feel like rotting corpse, everyday.. I'm so drained.. \nThis is so severe.. I can't take being alive anymore.. I just want, to disappear.. Things are looking for me... and I still feeling like I'm burning alive without relief.. \n\n\nThank you for reading up to this far, I'm sure this was quite the bullshit to witness upon lmafo. \n\n\nTldr:\n\nI have a great desire to die, and nor being happy or depressed, loved or hated, lucky or unfortunate, rich or poor, fulfilled or lonely, I still want to be Death. \nI find life a beautiful thing, I find life worth living, Im loved by many and things are pretty nice for me now, yet I want to die, I want to be dead. \n\nI fear ever being alive again, so if I were ever to die and wake up in another body (obviously not remembering anything, starting off clean as if I were to live for the first time) that would be the absolute worse. \n\nI want to be deleted from existence and never be born again, never be alive nor conscious, to never exist.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lyohk9/this_lingering_feeling_im_shackled/", "title": "This lingering feeling.. I'm shackled", "social_network": "reddit", "user": "CosmicCloudness", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1614986130, "permalink": "/r/SuicideWatch/comments/lyohk9/this_lingering_feeling_im_shackled/", "nsfw": false, "first_save": 1635428259.2184417, "replies_charged": false}