{"id": "t5_2qpzs_t3_oegpvq", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351"], "text": "It's been pretty obvious for a year or so, about where I'm headed. I never chose to discipline myself, I never chose to succeed academically in high school (where I'm currently at as a junior) since I've never really put in any significant effort into my courses, and ultimately, I have come to terms with failing in life and living in absolute shambles - like, taking up some dead-end job like McDonald's or Applebee's for the rest of my life, with a wage that barely supports myself. \n\nI've also happened to act like a massive dick to my parents and my older sister - both of which have endlessly nagged and lectured me whilst pushing me into opportunities such as tutoring for improving my grades, and some math contests at a university I live close to. I don't think they'll regret seeing me go after countless shouting matches, fistfights, and instances of broken furniture, - all of which are a product of my uncontrollable fits of rage stemming from my recklessness, hatred, and ignorance towards them. I truly think that, while they still try to made amends for myself by lecturing me and giving me chances to improve my prospects for my future, they really shouldn't care about this little piece of 16 year-old privileged shit anymore, because I just won't listen. \n\nEverything I've done in my life, whether it be positive (if there's any I could genuinely think of) or negative (there *is* plenty that I could think of here), is the result of my own actions, where I've continuously failed to realize the consequences of my own actions. \n\nThat's all I have to say. I'm thinking of just laying on my bed until I starve or die of thirst in a few weeks or so. Or maybe slumbering into a deep sleep and never bothering to wake up again. I haven't put much thought in that department, since I've also never really thought of where I might be in 20-30 years. \n\nP.S. I could have added \"Nobody *needs* to care about me\" to this post. You can interpret this post as if it also had this meaning.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oegpvq/might_as_well_call_it_quits_nobody_needs_to_care/", "title": "Might as well call it quits. (Nobody needs to care about me, or feel pity for me.)", "social_network": "reddit", "user": "stonef3ce", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1625520307, "permalink": "/r/SuicideWatch/comments/oegpvq/might_as_well_call_it_quits_nobody_needs_to_care/", "nsfw": false, "first_save": 1635423115.6326778, "replies_charged": false}