{"id": "t5_2qpzs_t3_n1k7p0", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "I'm sorry in advance for any kind of mistakes in this post but i can't think straight right now and English is not my first language, and I'm posting from my phone.\n\nI'm a girl, almost 22. I am a design student but put my studies on hold for a while bc of the pandemic. I started working at a call center in February and quit about two weeks ago for a couple reasons. I've been working on starting my own business since I still live with my mom and live off of my dad's money (not rn since I have money left from my job and I'm not studying, but i usually live off of allowance).\n\nI have anorexia, depression and anxiety. I've been to a hundred therapists, tried different medications, nothing really seems to work. I'm okay for a couple months until I'm not. I've been in recovery for anorexia for a year and five months, pretty much doing it all by myself; i don't really receive support from my parents and i had treatment for about 8 months but it didn't seem to do anything. also bc of that we really can't afford to waste more money on my mental health.\n\n(tw eating disorder) Lately I have been losing my appetite idk why. I've been trying to work on building my brand and all that but the last week I've been declining and feeling worse everyday. Today I only had three buttered saltines and a mocha. It wasn't really intentional but also I can't deny it gave me a rush. I bought myself a top and some jeans and i got home to try them on and I've never felt worse. I'm disgusting even when I don't eat. I put on an oversized onesie and went to bed to try and stop thinking.\n\nMy mom came up to me and asked what's going on. I didn't want to talk i just told her I'm ugly and disgusting even when I don't eat. She said I should exercise and that's really triggering to me. Anyway it all escalated a lot and i said I will stop eating until I die. She said \"don't do that to me, I'm bankrupt after paying for your treatment, and this is how you repay me?\". I feel so bad, i know she's right but i can't help but wish she cared that I'm not eating and want to die.\n\nAnyway I kept asking her to just leave me alone but she was so angry at me for making her waste money and she kept yelling and telling me to just get over it and eat already and be ok. God I wish I could just be normal. I am so triggered i just keep thinking of jumping out the window but i know i won't die or anything bc it's only the fifth floor I'm sorry I don't know why I'm posting really. I googled how to kill myself if I'm a coward and a hotline popped up so I called it but turns out it's not a working number. This subreddit popped up below that so I figured I would just post here. I am so sorry I don't really know why I'm posting i guess I just want to let it out. I'm sorry I just don't want this anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/n1k7p0/i_am_not_okay/", "title": "i am not okay", "social_network": "reddit", "user": "titanicshittyflute", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1619749221, "permalink": "/r/SuicideWatch/comments/n1k7p0/i_am_not_okay/", "nsfw": false, "first_save": 1635422274.02485, "replies_charged": false}