{"id": "t5_2qpzs_t3_qfc3kn", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "one of my favorite movies as a kid. i watched it religiously/obsessively. I related to Matilda.\n\nnow i'm 23 (24 in 10 days). what is my excuse? a lot of people get dealt a bad hand. and grow up and realize they can't dwell on their childhood traumas and are able to continue on with their life. \n\ni feel physically sick from the emotional and mental pain. i've been crying for hours. i'm begging pleading for this pain to end. for me able to live a normal life. to work and be reliable. have healthy interpersonal relationships. to not have crippling anxiety, chronic depression, ADHD, PTSD. etc etc. i used to have so much ambition. people said i was smart. i didn't and don't believe them but it made me have hope. but now i fee like a failure unable to be a functional adult. i also never fit in and for some reason occasionally was targeted by bullies. and as a people pleaser, it breaks me when i do everything in my power to be liked only to be bullied and not accepted. i want to be wanted. i want to feel accepted. but i feel oh so lonely.   \n\ni've had a near death experience attempting suicide before and the pysch unit made a mark on me so terribly i never want to attempt again (so i guess they did the job of preventing me from trying to kill myself through horrible indirect ways). so i can't kill myself painlessly and successfully? i can't go to the mental hospital to get better because it feels more like a punishment and strip of your rights? i can't take psychiatric meds cause they don't work for me and i've tried them since the 8th grade? therapy is a slow process and this pain i have now is so immense that i just can't take it anymore. i feel stuck. no sympathy from work to call out or i'll get fired. no good healthcare to seek out good mental health services. insomnia to sit in my deadly thoughts.   \n\ni thought running away to another state and city for a few days would help me but here i am with a table full of pills sprawled out ready to die. and the only thing stopping me is that it probably won't kill me but leave me in physical pain and long term consequences on my body and let's not forget another stunt in the mental hospital. stuck. stuck in misery.   \n\nthank you for listening. really <3", "url": "https://www.reddit.com/r/SuicideWatch/comments/qfc3kn/i_wish_a_mother_figure_like_ms_honey_from_matilda/", "title": "i wish a mother figure like ms honey from Matilda could save me", "social_network": "reddit", "user": "badgalmari4", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1635150258, "permalink": "/r/SuicideWatch/comments/qfc3kn/i_wish_a_mother_figure_like_ms_honey_from_matilda/", "nsfw": false, "first_save": 1635426522.117698, "replies_charged": false}