{"id": "t5_2qpzs_t3_qhd2ii", "request": ["0c6360e0-5fd0-41bf-97f4-d870570d8b8d"], "text": "Thinking of asking my doctor for more medication or maybe a different kind to help dull my mind, i tried so hard to stop taking any type of drug but i just can't, i can't do it, i can't fucking do it. I was so confident I'd be okay, but i can't anymore, i'm losing my ability to control the sounds but i can't anymore, i want to fucking cry. It's like it's pulling me back everytime i try to pull away. \n\neveryday and night is a nightmare, the line between reality and my mind is becoming blurrier every day. I just want it to stop, I want everything to stop, i want everything to go dark and quiet. \n\nI'm about to force myself to sleep using prescription meds, every night like this i have to prepare myself for a nightmarish rollercoaster, like i have to psych myself up before working out. Waking up is harder, waking up in fear every day, not sure if I'm still inside some kind of hell scape or if what I'm seeing around me really is real, but I'm too scared to move Incase something tries to hurt me when i move. \n\nI don't want to sleep but not sleeping only accelerates the mental decline which is already declining having to experience life like this so no matter what i do I'm stuck in between pain and pain, only one pain is real and the other isn't, even if it isn't real, the fake pain still causes real pain. \n\n\nIts in my head and i want to let them free but I'm scared because what if that's what they wants me to do. I'm left to tell it to wait but they toy with me if i don't get hurt for too long. I want out of this cage, i want out of this stupid cage.\n\nGoodnight.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qhd2ii/so_tired/", "title": "So tired", "social_network": "reddit", "user": "long_shlong_mgee", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635388943, "permalink": "/r/SuicideWatch/comments/qhd2ii/so_tired/", "nsfw": false, "first_save": 1635426386.1348078, "replies_charged": false}