{"id": "t5_2qpzs_t3_o6gjix", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I have never been a suicidal guy. I've always tried to pull myself up no matter how hard things went. But i'm really considering doing it to make it look like an accident.. so thay my fiancee and my parents can collect the insurance money.. that way, I can pay back my fiancee for all the sacrifices that she made for me (quitting her job, moving back to our country to follow me after I lost mine due to covid, sacrificing her personal expectations of having a house, a fancy wedding, etc) in order to come home to a partner who is struggling to get back on his feet. I'm a failure. Not through lack of trying. I've been working non stop since i've graduated, i don't know why I have nothing to show for it. I have my savings which are slowly depleting. The investments i've made are all in the red. I can't even give the love of my life a good wedding, a comfortable life to start a family with, our own place. And she left her career to be with me. She gets here on july, and we struggle with our future plans. I want her to take the money so I can pay her back for the time she wasted on me and the sacrifices she made for me.. if only she'd known what a failure I'd turn out to be.\nI have a good loving family. Supportive parents and two younger sisters who mean the world to me. They have been trying their best to help me get back on my feet. I am ashamed. I fear they are wasting too much effort on a lost cause. I hate my mediocrity.i have been hard working me entire life. And now I have nothing to offer to anyone. People are making sacrifices for me. I don't want to burden people anymore and I want to pay them back. That's why it must look like an accident if I do push through. They must see it only as a tragic loss through bad luck. If they found out it was suicide it would destroy them all. I want to repay them. Not hurt them. If it could be some sort of heroic death, all the better. It would give them some good memory of me dying for the good of others. And me dying and leaving them something behind would probably be better than me living and hurting others with my existence of failure. I need to check the terms of my policy first", "url": "https://www.reddit.com/r/SuicideWatch/comments/o6gjix/i_want_to_suicide_but_make_it_look_like_an/", "title": "I want to suicide but make it look like an accident", "social_network": "reddit", "user": "triads", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1624466316, "permalink": "/r/SuicideWatch/comments/o6gjix/i_want_to_suicide_but_make_it_look_like_an/", "nsfw": false, "first_save": 1635428220.5105596, "replies_charged": false}