{"id": "t5_2qpzs_t3_jq2ekr", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "I really don’t know what to say but thoughts about suicide are getting in my head and I can’t stop thinking about it. I want to look for help but I don’t wanna live my life anymore. I’m doing my best to be the perfect daughter for my mother and be the perfect sibling but every time they don’t trust me and they searching everything in my room to find what they can use against me. \nBut in general I can’t talk with anyone in my family about my feelings. It’s like a taboo in our household. I’ve got anger issues and since a couple of weeks I’m getting panic attacks because I overthink too much. I’m stressing too much. I’m going on walks without anyone knowing so if I want to disappear for good they won’t know it.\n\nThe reason I don’t talk about my feelings with my friends is because they wouldn’t understand all the pain I’ve been through. I see my feelings as a weak point which I don’t ever have to share with anyone. The person I’m projecting is someone who doesn’t feel affected at all and doesn’t have much emotions to share but when I’m alone all those things are getting on me. \n\nIt has officially become too much to handle and I don’t ever want to share my feelings so I’m getting bad thoughts on how to end it all. I hope that if I’m gone someday they will finally accept that sharing your feelings will help others and that they learn a big lesson. My voice doesn’t count so why would I share my feelings with them?", "url": "https://www.reddit.com/r/SuicideWatch/comments/jq2ekr/i_cant_even_talk_with_someone_about_my_feelings/", "title": "I can’t even talk with someone about my feelings so why would I live longer like this (don’t mind my English)", "social_network": "reddit", "user": "wuppiebaby", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1604797278, "permalink": "/r/SuicideWatch/comments/jq2ekr/i_cant_even_talk_with_someone_about_my_feelings/", "nsfw": false, "first_save": 1635428481.699575, "replies_charged": false}