{"id": "t5_2qpzs_t3_b76x4o", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I feel ruined. No confidence, my grades are lacking, all I do is cry, I’ve become somewhat of a narcissist when I’m in front of the people I care for, my reputation is down the drain, I have no dignity left, I can’t trust anyone anymore. \n\nIt’s so hard being like this, I used to be kind, smart, I thought that I was pretty, I was in love with someone who seemingly cared for me. \n\nBut no, it was all a lie. \n\nThat special boy, the one who made all those sad thoughts evaporate into the air, moved to stormy clouds, built me the tallest towers: suddenly made the storm come back at full blast, knocking down “our” castle and leaving me with nothing. \n\nHe told me that he loved me, but it turns out he’s asexual and he never felt that way about me. He told me that he lied to me, and I just want him to come back to me and at least stay my friend. (I feel like the 14 year old girl faced up against Sbeve, and I feel so stupid)\n\nBut no, and I can’t help but feel so jealous when other girls talk to him, and he smiles and laughs with them, just like we used to, but I’m forced to just stay behind and watch. \n\nAll I wanted was to stay by his side, but it’s clear that I need to leave. I’m not needed here anymore. All my other close friends have lost interest with me, my parents and younger sister like to mock me and I feel humiliated. \n\nI can’t talk to my parents, when I did the first time my mom felt offended when she found out I was depressed. She told me that she tried her best and that I shouldn’t be upset over small things. Instead of therapy she bought be crystals and told me all about crystal healing and cleansing my soul. I don’t even want to bother anymore. \n\nI have it all planned out. \n\n1) On Thursday after school go pick up the prescription drugs that I ordered (painkillers)\n\n2) Choose a day when my family is coming home late \n\n3) Cover my stuffed animals and pillow with blankets to make it seem like I’m sleeping (I often take long naps after school and no one wakes me up until dinner)\n\n4) Kill time until I get to the beach at a later time\n\n5) Make sure there are no witnesses \n\n5.5) Maybe find a way to get very far away from the shore\n\n6) Go into the ocean with an open bottle of painkillers and bottled water, so I can over dose and then drown myself \n\nIt seems laughable but it’s worth a try. \n\nAll I wanted him to do is to come back for me and tell me that I’ll be fine. I don’t want anyone else to, I want him to do it, the one who broke me. I wanted him to help me fix myself. \n\nWhy is the only person I still trust the one who gave me these trust issues in the first place?\n\nBut he couldn’t, a few months back he said that I wouldn’t know what suffering is like, because he grew up in a very religious and abusive household, and he’s an atheist (along side of being an asexual), so to him my pain isn’t comparable or worth it. \n\nI talked to him later on and he said that it hurt him to much to see me like this and that he knows it was all his fault, but he can’t deal with it. He couldn’t wake up with the guilt of knowing that he let me down. So my favorite person feels pain from looking at me? I’m better off dead. \n\nHe told me long ago that he wanted me to live and that a living person is better than a dead one, but it’s clear now that he’s changed his mind about me. \n\nIf they ever do find my dead body, be it washed up on the shore, or recovered from the ocean floor, I kinda wish it’ll be him to be the one to lower my casket in ground. That way he can let me down one last time. \n\nI wonder if I can let go of my obsession with him, and finally turn my hatred into forgiveness, but until then, all I want is for him to remember my full name, that’s all I ask. \n\nPlease let him remember me. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/b76x4o/i_really_cant_do_this_anymore/", "title": "I really can’t do this anymore", "social_network": "reddit", "user": "not-your-furry", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1553918991, "permalink": "/r/SuicideWatch/comments/b76x4o/i_really_cant_do_this_anymore/", "nsfw": false, "first_save": 1635426244.4540186, "replies_charged": false}