{"id": "t5_2qpzs_t3_pyupyx", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": " \n\n(I'm under some distress right now but I've calmed down a bit and Ill try to make this readable and organized. I like I said my last post(on the drk sub) that's not related to this I truly am sorry for what I did.)\n\nWhat I did: I just thought of this today on my bus ride home. I've been suffering with constant feeling of guilt after the event in post I made last time ended. Now after I realized I didn't do anything wrong in that scenario I still had the guilt feeling but not knowing why I felt guilty. It felt like I was looking for something to feel guilty for and I think I have found a reason my mind has latched onto. I jerked off to loli hentai by accident. The 1st time this happened was when I was 12. (I'm 15m now.) I was jerking off to like a sonic character and most of the hentai I was viewing was aged up and tried to avoid images that looked young. But as I was finishing I swiped down to see more pics and one was the version of the character not aged up. the 2nd example was when I was looking at a phub hentai compilation most characters were not loli except one in the the compilation and the loli didn't look like one so I didn't know at the time. I viewed that compilation like 2 times and one day stumbled upon the vid of the one loli(in the compilation i talked about before.) and jerked off to it at the very end of a session I looked at the comments and the category and found out it was loli and felt bad. And like a month ago I found the video again forgot it was loli but caught it way earlier so I dont feel as bad for that one. I also remember 2 times were I jerked to this one shota manga online about dragon ball I jerked off though for the milf and not the shota. And this one time I was video hopping and found this one futa hentai loli thing and jerked off to it for a minute and just left the vid to something else. I didn't think much of these but after thinking about it I have felt the most suicidal in my life apart from my 1st year in highschool (2nd year now.) I read a reddit post that said if you jerk off to loli your a pedo and have watched cp and I agreed but I felt that since I didn't actively search for it that I was fine. I didn't do it on purpose so I'm not a pedo. But now I cant silence my thoughts and I feel so low that its too much. (This all happened like 12-13 maybe 14 idk and the one I caught early was like a couple months ago.) ( loli hentai wasn't what I watched almost at all only on accident and these are all; the cases I have.) (It was all accidental.)\n\nQuestions: 1: Are there certain things you can do that are unforgivable?\n\n2: Did I do an unforgivable act?\n\n3: Did I do a bad act?\n\n4: Should I kill myself. And If I don't how can I expect anyone to love me ever again? When I'm telling my future wife or something about my life in highschool this will come up and I'm scared she'll leave. 5: And if you think I did something bad or not bad do you think most people would say the same?\n\nSuicide Methods I'm thinking of: The only way I can do it is by using my moms keys to get in her car and crash it or jump in front of a subway. The other methods like shooting myself aren't available to me because I don't have the money and cant get one as I'm a minor. I cant do it anymore honestly I've been feeling suicidal for weeks now not even about this but just so much shit. This month has been one of the worst in my life and this I feel will push me over the edge. I'm crying while writing this because its so much and I wish I could enjoy life. I'm trying to get a therapist but if I'm unforgivable then I need to die there's no other way.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pyupyx/constant_guilt_makes_me_want_to_kill_myself/", "title": "Constant guilt makes me want to kill myself.", "social_network": "reddit", "user": "SPAINMORELIKEPAIN", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1633041716, "permalink": "/r/SuicideWatch/comments/pyupyx/constant_guilt_makes_me_want_to_kill_myself/", "nsfw": true, "first_save": 1635426175.0544322, "replies_charged": false}