{"id": "t5_2qpzs_t3_p90yuv", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "im 16, for the past year all ive been thinking about is killing myself. i dont see a future for myself, i disappoint everyone around me, including myself. so many things go wrong, went wrong, whether it be because of my own actions and words, or by things I can't control. my mom has been drinking since i was a child, which caused social services to intervene, and we had to flee the country, me, my dad and sibling to latvia, and my mom and two brothers to belarus. i now live in england, with my mom and older brother, and its been hell ever since we came here, around 2016. constantly drinking, shouting and arguing with us. for the last year she's had this on and off boyfriend who she constantly argues with, kicks out of the house and calls the police on - but the next day he's back inside. there's so much that happened and i couldn't possibly fit it into one post. she's hurt us so much, my brother the most, and i feel like such a fucking coward for not being able to help. she constantly targets him, shouts and argues with him for no reason at all, threatens to kick him out constantly. we've begged her to stop drinking, my dad has begged her, her boyfriends begged her, the police have, social workers too. she hasn't. she hasn't stopped drinking. i feel so fucking useless. why are we not enough to get you to stop? why am i not enough? what did i do?? it hurts. im a coward, there's so much wrong with me that I can't change. i know for a fact I'll never be truly happy in life, if I end up living to be an adult. I'll never be content, because there's so much I want to experience that i just cant. I'm just so tired of it all. i just wish there was an easy method, thats painless and quick, and 100 percent effective.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p90yuv/i_cant_stop_thinking_about_dying/", "title": "i can't stop thinking about dying", "social_network": "reddit", "user": "stickylobsteru", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1629585938, "permalink": "/r/SuicideWatch/comments/p90yuv/i_cant_stop_thinking_about_dying/", "nsfw": false, "first_save": 1635425564.0916634, "replies_charged": false}