{"id": "t5_2qpzs_t3_qczzmf", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "Bit of background: I'm a female in their early twenties, and I've been double vaccinated. In a way I almost feel selfish because even though I've had both my vaccinations now, tbh my anxiety around covid hasn't really decreased that much at all. This shit isn't like a stomach bug where everyone who gets the stomach bug recovers without the risk of deteriorating. Yes I'm young, yes I'm double vaccinated and yes I have a good immune system/don't get sick very often. But the way my brain is, with my OCD and health anxiety/death anxiety, I can't accept the fact that I will likely have significant protection from the vaccinations, instead I'm absolutely convincing myself that I must have some rare immunity dysfunction or defect that will mean that even though I've been double vaccinated, the vaccine will offer me no protection from the virus because of the immunity defect I'm so convinced I have. Im fucking terrified that I'm going to die before I've had the chance to do the stuff I want to do later in life, lose my virginity, express my sexuality, get into the make up artist/music industry,move out to London/Brighton, have my own small business etc. Some people might think that's a naive way of thinking but when I go on Instagram and see people going to loads of festivals and cool events it fills me with a sense of dread because I feel like covid will kill me long before I have a chance to do any of that stuff. I know life isn't about how many achievements you make, but when I go on social media and see these people leading such busy lives it makes me feel like I've failed if I die before I have a chance to do any of that. It's weird it's like I want to commit suicide so that I can make sure that the virus won't \"get\" me but I don't want to die at the same time", "url": "https://www.reddit.com/r/SuicideWatch/comments/qczzmf/my_health_anxiety_is_so_bad_that_i_would_take_my/", "title": "My health anxiety is so bad that I would take my own life just to avoid the small risk of getting covid and getting sick/dying of it. I'm fine with death from suicide just not death from injury/sickness", "social_network": "reddit", "user": "turtleycool38", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1634846127, "permalink": "/r/SuicideWatch/comments/qczzmf/my_health_anxiety_is_so_bad_that_i_would_take_my/", "nsfw": false, "first_save": 1635427901.2541673, "replies_charged": false}