{"id": "t5_2qpzs_t3_qe6a4x", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I really don't know if this is the right subreddit because I'm not going to kill myself at this moment. But I don't think I'm going to survive much longer. I've been fighting about 16 years (that's when I had my first anxiety attack and I was 6 at the time depression came later) and everyday it gets harder and harder to survive. I've been going to therapy for 6 years on and off and eating antidepressants for 4 years. And still I want to die every single day have been for the past 6 years at least. I'm tired of fighting every single day and not knowing what my mood will be an hour from now because I can be okay one moment and then something happens and I just want to kill myself the next. I never know what's coming next wether I'm relatively okay or if I'm just done with living.\n\nFor the past year I've gotten so much worse. I started really cutting, bruising my fists by hitting and started smoking so that I could hurt myself without visible signs. My suicide thoughts have become more and more harder to fight to the point I had to fight myself that I didn't drive in front of a truck. Everytime I cut my wrists I play Russian roulette (haven't had any luck yet if you could say so because I'm still alive).\n\nMy family has been the thing keeping me alive all these years but I don't think it will keep me alive that much longer anymore. I just feel like they and my best friend would be the only ones who would miss me. But it hurts so much everyday that I can't keep doing this that much longer I just want to end all this pain ones and for all. I just want to go to my medicine cabinet and taking so much pills that I won't ever wake up again. If I did that my suffering would finally end and I would be at peace. But doing that I would cause such pain to my loved ones and I can't do that. If my suffering gets any worse I don't think I'll come out alive because I just don't have any strengths to fight anymore. \n\nI'm just waiting for something bad to happen after which I will be done with this life for good.\n\n(Sorry for the grammar mistakes English isn't my native language)", "url": "https://www.reddit.com/r/SuicideWatch/comments/qe6a4x/just_ranting_about_wanting_to_die/", "title": "Just ranting about wanting to die", "social_network": "reddit", "user": "seriousotter", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635000635, "permalink": "/r/SuicideWatch/comments/qe6a4x/just_ranting_about_wanting_to_die/", "nsfw": false, "first_save": 1635427674.5642698, "replies_charged": false}