{"id": "t5_2qpzs_t3_f2wx6c", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "Hello [r/SuicideWatch](https://www.reddit.com/r/SuicideWatch/),\n\nI’m [Jonathan Reeves](https://www.dynamicpsychlab.com/read-me), a clinical psychology PhD student at the University of California, Berkeley (supervised by Dr. Aaron Fisher). I’m currently recruiting for a paid research study on real-time individualized monitoring of suicidal thoughts. My hope is to use this information to create more precise treatment strategies suited to each person’s unique experience. I’m specifically hoping to recruit people who (1) have engaged in suicidal behavior in the past year and/or (2) have frequently experienced suicidal thoughts in the past few weeks. \n\nIf you qualify, you’ll be asked to complete brief daily surveys (1 min to complete) ten times per day on your smartphone for a 15-day period. For this, you will be compensated up to $50. Please see a link to the study screener below.\n\nScreener:  [http://ucbpsych.qualtrics.com/jfe/form/SV\\_eOJrT77Pvyy1XAF](http://ucbpsych.qualtrics.com/jfe/form/SV_eOJrT77Pvyy1XAF) \n\nTo be eligible for participation, you must…\n\n* Be between the ages of 18-65\n* Be fluent in English (both written and spoken)\n* Currently live in the United States (we are hoping to expand out of the USA soon, but have not acquired the necessary approval to do so yet)\n* Have daily access to a web-enabled smartphone\n\nPlease let me know if you have any specific questions and I will do my best to answer them promptly. You can send those questions via direct message or email me at berkeleypsychstudy@gmail.com.\n\nBest,\n\nJonathan Reeves", "url": "https://www.reddit.com/r/SuicideWatch/comments/f2wx6c/recruiting_for_a_paid_uc_berkeley_research_study/", "title": "Recruiting for a paid UC Berkeley research study on real-time monitoring of suicidal thoughts", "social_network": "reddit", "user": "Berkeleypsychstudy", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1581537072, "permalink": "/r/SuicideWatch/comments/f2wx6c/recruiting_for_a_paid_uc_berkeley_research_study/", "nsfw": false, "first_save": 1635425249.1731322, "replies_charged": false}