{"id": "t5_2qpzs_t3_8dtkbh", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I have been suicidally depressed for months. Long story short, I lost almost everything and went through some trauma these last couple years. I have just been dragging myself through life because I couldn't hurt my family by offing myself. Meanwhile I'm grasping at straws trying to fix myself and better my situation. I went to a reiki spiritual healer who cleaned my chakras and called back a piece of my spirit that had been missing. I know this sounds crazy. There were even crystals involved. A couple years ago I would have thought this was all hokey. It still seems pretty hokey. But the way I've been feeling, I got desperate. \n\nNothing about my situation has changed. I'm not happy. I still feel sad about how things have gone in my life and like there is a big mountain in front of me to even potentially get my life back on track. I have some huge decisions to make issues to face that I don't wanna. But I don't feel suicidally desperate. I feel some bit of inner piece and strength that I'll be ok eventually. Although realistically that is very up in the air. \n\nI have felt broken. I have felt like I lost my soul. I have felt a void. I could not figure it out. \n\nThis has not resolved anything by a long shot. But it has made a difference. I do feel different. \n\nThere might be something to this spirituality stuff. Just wanted to throw it out there. It's possible that you are out of alignment or missing a piece of your soul. Apparently it will often leave you due to trauma or extended periods of sadness for example. Who knew? Might be worth looking into. Might be a tool to help you move in the right direction.\n\nAt the very least it's a cool experience and it's better than killing yourself!\n\nLove and light and best of luck to all. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/8dtkbh/i_know_this_sounds_crazy_but/", "title": "I know this sounds crazy but...", "social_network": "reddit", "user": "Pinklady7", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1524284845, "permalink": "/r/SuicideWatch/comments/8dtkbh/i_know_this_sounds_crazy_but/", "nsfw": false, "first_save": 1635426330.4800663, "replies_charged": false}