{"id": "t5_2qpzs_t3_pmtblu", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "I was overprescribed Lexapro at a dosage higher than FDA approved. The APRN who gave me it was rude and uncaring, and I had to go off it cold turkey because I gave up trying to schedule with her. She put me back on it at 10mg and I've felt mentally crippled since. I've posted so much about it in the past year and I'm sick of saying the same story over and over. \n\nI don't deserve to have the left side of my face feel like it's had IcyHot rubbed on it daily. I don't deserve to have constant neck stiffness and pain on the same side the face is feeling weird. I don't deserve to have breathing problems and sinus problems daily. I don't deserve to feel castrated emotionally where I don't feel anything when I laugh or cry. I don't deserve to have brain fog and memory loss that isn't improving. I don't deserve to have sexual dysfunction that could be permanent. This APRN saw me for over 6 years and basically dumped me at the sign I had a bad reaction to her drugs. My mom was dying at the same time of cancer and she offered no support, getting angry I called her early in the morning about it instead.\n\nI don't know what to do. I'm not getting better. Most SSRI symptoms go away at least after a few months. It's almost a year later and I'm the worst I've felt in a while. I don't get how an SSRI could cause what feels like damage from a stroke. I don't get any help. My primary care doctor seems to care, but the neurologist I saw was useless (refused to believe an SSRI could cause this, or that I possibly had serotonin syndrome) and ordered no tests. \n\nImagine if I had to work. I couldn't. My problems have inhibited my cognitive ability so much. It's such bullshit.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pmtblu/i_was_taken_advantage_of_by_the_medical_industry/", "title": "I was taken advantage of by the medical industry and now I've lost everything that made me happy.", "social_network": "reddit", "user": "sunflower_1970", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1631455699, "permalink": "/r/SuicideWatch/comments/pmtblu/i_was_taken_advantage_of_by_the_medical_industry/", "nsfw": false, "first_save": 1635426410.1083317, "replies_charged": false}