{"id": "t5_2qpzs_t3_pla5mr", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "When my depression and anxiety flare up it’s so bad I can’t move, can’t work, can’t function. My dad and stepmom are the opposite of supportive. They treat me like an underperforming employee. I’m not exaggerating; they treat my illness as if they were my boss at work and not my family. \n\nDad literally just responded to me opening up about my struggles with “that won’t fly in the business world,” and that “nobody cares, nobody cares about your health but you.” He added that stepmom’s boss gets seizures when he sees flashing lights and still manages to be a VP.\n\nAfter years of being treated horribly by my parents I now want to cut my dad and step mom out of my life except I fear what my life would become without their financial security blanket. I work full time and still can’t afford rent anywhere even if I have a roommate.\n\nI hate living. I hate that I work 40+ hours a week and I’m too poor for housing. I hate my disease. I hate that I can’t function when it flares up. I hate that every medication I’ve tried only works for a few months and then it doesn’t. I’ve been afraid to try suicide because I don’t want my life to get worse.\n\nI’ve heard dehydration is painless after the first few days, and it’s just a matter of will power. If I stop drinking it’s lethal after a week and a half.\n\nWhat else do you do when there’s no way out and even medication doesn’t work? Open to suggestions on how to keep living or improve my situation", "url": "https://www.reddit.com/r/SuicideWatch/comments/pla5mr/considering_death_by_dehydration/", "title": "Considering death by dehydration", "social_network": "reddit", "user": "anonygrim", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1631233405, "permalink": "/r/SuicideWatch/comments/pla5mr/considering_death_by_dehydration/", "nsfw": false, "first_save": 1635427470.3246927, "replies_charged": false}