{"id": "t5_2qpzs_t3_q3g6e1", "request": ["69686dc6-5bf4-41ab-864a-231bdd6f02c9", "b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "So yesterday morning I overdosed and drank a shit ton of vodka. It felt so real and I thought I was dead because I blacked out for about 3 hours before waking up and realising that it didn’t work. \n\nI just feel fucking awful, my best friend found me and I can’t imagine how shocking it must be having to get your best friend to the hospital quickly after finding them in a puddle of blood and vomit. They gave me a 12 hour treatment at the hospital that helped prevent any liver damage and just caused me to vomit and shake for 11 hours on end. \n\nThe worst thing of it all is that when I got home, my mum had told my dad (who is a shitty narcissistic addict), he called me and told me that after he found out about my attempt *I* had caused him to relapse on drugs and fuck up his recovery and gave me a lecture about how my actions causes him to do bad things and said so many of shit like how if I’d have died, he would have blamed and killed my friends even if they tried to help. \n\nSo not only do I have to feel shitty that I tried to kill myself in the first place, that my best friend found me and I put the shits up her, having to deal with my mother being upset but hey, I also caused my dad to fuck up his recovery and his girlfriend probably blames me too and selfishly my only way I can deal with this is thinking about killing myself because of how much guilt I feel.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q3g6e1/i_tried_to_kill_myself_a_day_ago_and_the/", "title": "I tried to kill myself a day ago and the aftermath is just so awful.", "social_network": "reddit", "user": "420mangolover", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 37, "down_vote": 0, "creation": 1633633630, "permalink": "/r/SuicideWatch/comments/q3g6e1/i_tried_to_kill_myself_a_day_ago_and_the/", "nsfw": false, "first_save": 1635425310.8776994, "replies_charged": false}