{"id": "t5_2qpzs_t3_jo4cd5", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I dont know where to start even, my Life is a fucking mess and it always has been. When I was a kid I always had to endure my Abusive drug addict uncles, my super manipulative Mother who loves to talk without consideration if that even could cause any problems. Also, my Stepfather who has always been a Dick to me in the Past. It's so much information in my head that it's difficult to pin Point my fuck ups.\n\nI am writing here cause I dont know where to write if I am Honest I dont have any friends at this point I gave most of them up after realizing that their Moral standards dont equal mine and in some cases actually fucked me over Bad circles I guess.\n\nI started Living with the state is sort of an Orphanage when I was like 9 or so for some of the reasons above and more that i haven't mentioned cause honestly I dont wanna write a Story for every little fucking thing just take my word for it.\n\nThe amount of disrespect Abuse ignorance and selfishness that i had to endure over all these fucking years has become unbearable. Anyways so I went to the Orphanage where stuff was getting somewhat decent in my Life except for the Part that i was getting mobbed so hard in school that I can remember clearly how about was fantasizing in just going there and fucking everybody up they drove me to my Limits back then. Then my Mother decided that she wants to go to Germany and that her son, can not let her Mother go alone to another country without me, HOW dare I to do that.\n\nShe talked me into it so I went with her, I stayed there for 2 Months I had bullying problems again but this time it was a racism Problem I am from Venezuela, and where I moved the People where super Racist on top of that I had already beginning Depressions as a kid (where my mother refused to give me Meds because she didn't want me to become a Zombie). My stepfather wasn't making stuff easy on me Either every day there were fights punishment and I became a very submissive person that could never express truly what they think.\n\nI was Done and I ran away from home stole some money and my Passport took the train and I went to my Grandmother who I had a good relationship with for the most part. I stayed there for a while until the state realized that I was not with my mother anymore so they caught up to me and put me in a place which is like a pre orphanage you basically stay there until they find an orphanage that you can stay at normally Max 3 months.\n\nWell in my case, it took 7 months and a lot of different Pre orphanages, until I got somewhere.\n\nOne of the Pre orphanages where terrible everybody was older than me (14 at the time) took drugs and was borderline criminals they regular stole shit from me ganged up on me 3 5 people etc. almost every single day...\n\nThen it finally happened they found an Orphanage and god damm it was such a shithole they literally brought me there cause there was no place anywhere else and for 8 months they have been tossing me around like a hot Potatoe. Everybody was like before but 10x worse\n\nWe had literally criminals there the supervisors of the institute were scared of the people they are supposed to supervise we had refugees everything and it was just a mess. My life was hell there until some guy stood up  to me and protected me from them he did it for like a month. Until he came to and he was like \"hey all this time I do this for you what do you do for me\" then he invited me to someplace where after like 10 minutes 2 people got stabbed and killed and I am not joking it was like in that john wick movie where they came like in 5 min cleaned everything up and went there way.\n\nI got forced to sell drugs as a 14 year old for exchange Security. And I did my job well for like a year until  got robbed of so much money which didnt belongs to me. That my \"Boss\" at the Time said yeah no worries you pay it back and we will be fine I was like alright.\n\n1 Day I had 2 customers but I didn't have anything on me so some smaller bosses called me to there apartment before I continue I want to clarify that at that point I have never touched drugs I only sold them I just wanted to leave peacefully and if that was the price so be [it.](https://it.So) So i went there and the 2 Guys had to wait outside.\n\nSo i go in and what do I see a bunch of people like 15 Afghanistan people with scars and shit and looking like not very nice people. I took my stuff as they were building a Joint and as I was about to leave they said you cannot leave its bad manners when a joint gets build and you dont smoke it they were, very pushy about it. So I smoked it and it knocked me out basically it all ended in me getting raped by 4 of them. As the last one was about to leave and I almost had my full consciousness back I jumped up full of Adrenalin punched him like 7 times in the Temple witch such despair and I ran out of the house through a pitch-black forest while they were chasing me like 9 people Ia lot was so fucking scared at the time. Turns out they were like a small mafia who controlled alot of the City so I went to another City in secret for 1 Year and lived in the Streets. I was almost 16 at the time.\n\nMy Depression has gotten its toll on me at this point I am counting the days until there is nothing more left of me so I can finally bring myself to do it. After almost 1 year of being in the streets, I was at my lowest I had some weed that I have gotten from someone and i exchanged it for 1 line of Crystal Meth.\n\nAt that point I, knew if i continue that Road i will Die and there will be no coming back from it. So i went back in hope that the Police stopped searching for me Because I left the orphanage like that and also the fucking Mafia people. I had the luck I started to live with my Gm again and my Uncle gave me a job as a Barkeeper. I did finish my school as positive as it could be at the time but not enough to study. And supposedly I was registered at Bar of my Uncle. Turns out after 3 years of Working there I never was Secured nor registered which whichs means when I turned 18 I haven't done anything in my life Officially.\n\nIt seems to go up I met this girl which she was like a light in my life Everything was so garbaged around me that even tho she wasn't the best Woman I heightened her to a Pedestal. We were together 6 years but over the years I wasn't able to sustain a job in Combination with Insomnia and Depression boost that came sporadically. And I just didn't have the strength nor the courage to get my shit together I just couldn't and I really tried but my depression was getting so out of hand that I left the bed maybe 1 every 2 days to take a piss.\n\nMy Mother came back from Germany and after getting older as aswell my Stepfather we were starting to get along and find some mutual understanding. the only downside they hated my girlfriend for reasons that I dont even gonna bother to mention cause that's another long story that in the end, they were wrong anyway so it doesn't matter. So it was only me and my Gf I struggled every single day since I turned 18 and it has gotten worse I cannot describe the feeling that I have in my Heart. I feel rejected betrayed by everything that could have been and after so many years of Abuse, I am burnedout. Over the years i started talking about this with my Gf and what i was feeling she helped me an Lil bit in the beginning, she paid so, I can get checked if i have any Mental issues. Turned out i have an evolution Personality Disorders which is mainly caused by too much stress over the years and traumatic events.\n\nAt the time I was like FUCK yeah that's a good start I can now go to therapy and get my shit done the Ionly problem i have no healthcare so I have to pay for it myself. Which i cant cause i dont have a job nor are people really willing to employee me anyways and I am also not able to sustain it cause of my Condition. It all ended with me and my Gf breaking up I lost my Home my Dog my Cats and i had to crawl back to my Mother in hope that she might help. What followed was months of Arguing cause they were treating me like a crazy Person that cannot put together 1 Rational thought. The moment I told them about my condition no matter what I did or say it was all based on that and constantly used against me. Months of fighting\n\nand feeling like garbage until we finally came closer and they actually apologized it was like a godsend my MOTHER has never apologized for anything so that was for me as a first good step. As i was feeling somewhere Home again and actually feeling that things are going up again. She told me yesterday that they are going to leave the country because I and my Brother are old enough that we dont need them anymore. As a matter of fact, I never asked for money in my entire Life from anybody who never asked for help. Now I am 25 I concluded, that I cannot help myself but all Doors are Closed. I am going to be honest with you guys.\n\nI think it's time to go and if any of you have a peaceful solution for me feel free to Pm me.\n\nI am gonna do it probably anyways so might as well with the least pain possible.\n\nThis life gave me never a chance to actually become someone since my birth everything was one sinkhole to another I only was scratching the tip of the iceberg here I could write a book of all the shit I have seen or lived through and honestly it's not worth it. I am a burden for myself and others at this point and I am 100% sure that everyone would be better off if I was just dead. Sure it might be sad for a while but that will heal but the pain that I have been carrying around for years won't.\n\nI apreciate that you read this far i hope that you could get something good out of this and that you had the strenght to do which I couldn't . If there is any Advice i could give it would be using the Chances you get, you dont know if it's the  last you Get.", "url": "https://www.reddit.com/r/SuicideWatch/comments/jo4cd5/i_cant_anymore_its_just_to_much_and_i_want_to_go/", "title": "I cant anymore its just to much and i want to go.", "social_network": "reddit", "user": "Backarok", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1604521882, "permalink": "/r/SuicideWatch/comments/jo4cd5/i_cant_anymore_its_just_to_much_and_i_want_to_go/", "nsfw": false, "first_save": 1635426221.6988838, "replies_charged": false}