{"id": "t5_2qpzs_t3_n5f0jt", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "I’m not sure how to convey the level of absolute misery I have been feeling for the past 5 years, nor how to express how deep my hopelessness is.\n\n5 years ago, I started feeling a very persistent, strong strangling sensation in my throat. I, as any google expert, thought it was something serious for my immediate health. It wasn’t. Turns out, I have LPR or silent acid reflux, which turns my throat highly sensitive, according to numerous specialists. I’ve seen seen many specialists due to how bad the sensation has made my quality of life. But that’s what it is. And there’s no fixing it. I am stuck with this for life and there is no treatment that 5 different specialist, all specialising in the digestive and throat areas, could’ve given me. This sensation is ever-present, whether I am trying to read or lay my head on the shoulder of my date at the movies. It’s constant. It’s agonising. It is, in all fairness, and without exaggeration, an incredible form of torture. And I want it to stop, I want it to stop so badly.\n\nTo add further, I, as a gay male, prefer to emotionally satisfy myself by being receptive in sex. However, unlike most healthy male adults, I completely bleed and cut open when I engage in such practice - something that is absolutely not normal, for those not experienced in anal sex. And my proctologist can not do anything about it. Some might think it’s not detrimental, but it quite is. I just have no pleasure, neither sexual or emotional, from engaging in any position than receptive. Long story short, to add onto my misery, I can not do anything about trying to fix my body to be able to get truly intimate, in the exact way I want, with someone I’d potentially love.\n\nAnd, I kind of let life pass. Crying most days, but that has genuinely become my norm. I don’t think much, except how I hate life. And I don’t think I ever genuinely didn’t. Then, I noticed a very hard bump on my body (not interested in specifying further), for which I know I should go to the doctor as soon as possible. But I haven’t called, and I don’t want to. I want it to be cancer, or whatever else serious. I am scared of it, obviously. But I want it to be my end. I want it to kill me, so that I do not have to.\n\nI thought about how people say you can climb out of this state of mind. But how, if it’s physically induced. Imagine, constant agony. I genuinely do not know how I have no shot myself in the head so far. I don’t know what keeps me going? But, whatever it is, its slowly, but surely, fading away - along with me. I’ve found myself searching suicide topics online quite often, and I often fantasise about death itself. Relief. Genuine relief. Peace. End. \n\nI use the train often. I’ve come to realise there’s only a rare occasion where I don’t imagine myself throwing myself under it. Not because because I’d actually throw myself under it, but because I’d want to take the taboo out of death for myself, so that I could actually one day kill myself with certain means.\n\nI am not in imminent danger of killing myself. However, I know that I will one day. I just can’t do it forever. Do you know, do you know how it feels to be strangled 24/7, as you write this, as you re-read it, as you think about it, as you correct it, as you think about it, as you cry about it? I might use my words good enough to explain what I am, in basic principle, going through. But I can not put you in my agony, and I wish I knew how to. Because I am suffering. Genuinely. And I want someone to understand. Not only to understand, but to be able to cure my malfunctioned, degenerate nerves in my throat that are, as my doctors put it, “constantly yelling”.\n\nI’m not sure why I’m writing all this. Maybe I want help? But I know, for certain, that there is no help for the actual cause. I like the structure of my life, I have absolute all reason to enjoy it - and I do, as much as I can, with the physical detriments I have. But those detriments will soon dull any joys I might have that keep me from truly ending it.\n\nI guess my post is really a question, one might even say a philosophical one.. which is quite ironic, since I love philosophy… but, why would I keep on going if I physically can not take it anymore and I want to rip my hair out every living moment?\n\nLeon", "url": "https://www.reddit.com/r/SuicideWatch/comments/n5f0jt/extremely_poor_quality_of_life_medical/", "title": "Extremely Poor Quality of Life (Medical)", "social_network": "reddit", "user": "leony11", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1620218594, "permalink": "/r/SuicideWatch/comments/n5f0jt/extremely_poor_quality_of_life_medical/", "nsfw": false, "first_save": 1635428434.6364017, "replies_charged": false}