{"id": "t5_2qpzs_t3_lz0qfz", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "I would like to apologise for the bad grammar I feel unable to think straight. so my typing is all muddy and over the place  \n\nFor as long as I can remember I have been extremely self destructive, destructive with my friends, my family,  my education and my job I don't want a live a life where I'm destroying everything Im just so tired of being alive. Honestly I've wanted to die since I was a kid I've always felt like a part of me is dead and I want to join that part. \n \n\nI am currently 22 in university studying game design but because of my self destructive behaviour I am repeating the year although this course makes me happy and I would love a career in the game design industry,  im often in a depressive state asking myself what's the point to this or anything I do.\n\nAbout 2 years ago I met the love of life being with her made me so happy, made me feel loved In a way I have never felt before but she didnt like the idea of talking about death which made me unable to tell her about being suicidal but because its always in my mind but often I would end up just talking about death which would make her unhappy because she's  terrified of death  which I understood its a scary subject so I tried my best to stop speaking about it but honestly it was incredibly hard, I promised her I would stop but I a few months later I broke that promise. But other than  I wasn't the boyfriend to her and I hurt her alot to be honest, although we were talking as friend, I slept with someone else which has always made her feel insecure during our relationships but she's been nothing but amazing to me and she's been so sweet but  she reached the point where she couldn't take it and well last month we broke up. I hate myself for destroying one the best relationships I have ever been in\n\nI am currently trying to get help, I've gotten into meditation,  I have a support group and I'm trying to live a healthy life style but I still have these moments where I'm just tired of everything, where I want it all to end.\n\nI feel like one day  im just going to end it all but  maybe I wont I don't know my mind is so cloudy but my question is this should I ask her to take me back? Knowing if she takes me back and I killed myself she would be extremely hurt and broken or should I just leave her alone and be done with the relationship, happy that i got to be with someone as amazimg as her because more than anything she deserves to be happy, I want her to be happy even if its not with me", "url": "https://www.reddit.com/r/SuicideWatch/comments/lz0qfz/self_destructive_first_post/", "title": "Self destructive - First post", "social_network": "reddit", "user": "tsuini-Chapter", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1615034201, "permalink": "/r/SuicideWatch/comments/lz0qfz/self_destructive_first_post/", "nsfw": false, "first_save": 1635422544.341761, "replies_charged": false}