{"id": "t5_2qpzs_t3_jw41sg", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I can't get over something that was sais to me online from February 2019. \n\nI was 23 at the time now I'm 25. \n\nI commented something on a Facebook post, and this person wrote. \n\n\"you are a I can't even say it, I was always told not to say anything if I didn't have anything nice to say but damn dude really\"? \n\nOption A - Say something nice\n\nOption B - Say nothing at all \n\nOption C - Say something mean (what they did) \n\n\nNot only did they choose to say something mean, but they choose not to even mention the insult the where referring to. (This would mentally ruin/fuck up ANYONE! not just me) \n\nMy life has never been the same since I read this persons/strangers comment. \n\nOf the 1,440 minutes in a day, I spend almost all of them when I am awake dwelling/ruminating on this comment. \n\nWhat was that person going to say? \n\nI have a strong feeling they were referring to the word/term \"retard\" (or \"retarded\") \n\nSo I spent hours googling that term, I am almost certain that this is the mystery word they were thinking of after writing (you are a) and before writing (I can't even say it) so I can finally let it fucking go (I can't let it fucking go). \n\nWhoever wrote that comment to me, I'd hope they die a a slow and painful death. \n\nIf I do get to outlive them, I'd go piss and shit on their grave for making my life that much more unpleasant. \n\nFucker should kept scrolling. \n\nThis was in February 2019, it is now November 2020.", "url": "https://www.reddit.com/r/SuicideWatch/comments/jw41sg/i_want_this_pain_to_stop_but_it_wont_i_think/", "title": "I want this pain to stop, but it won't, I think about it every time I wake up, and before going to sleep, I don't wanna live anymore.", "social_network": "reddit", "user": "cw9595cw", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1605655074, "permalink": "/r/SuicideWatch/comments/jw41sg/i_want_this_pain_to_stop_but_it_wont_i_think/", "nsfw": false, "first_save": 1635428068.4431336, "replies_charged": false}