{"id": "t5_2qpzs_t3_qbcnhi", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "I know comparing our suffering is pointless and I don’t need to justify how I feel to anyone but sometimes I feel like I’m just faking it for all the stupid reasons people don’t believe me. That I’m just lazy or pathetic and use mental health as an excuse to get away with not trying even though I feel like I try really hard and get nowhere. \n\nProblem is this mindset of thinking I’m just not depressed enough to warrant care or treatment has resulted in me ramping up the self harm. It used to just be hitting myself or walls but now I’m actively trying to bruise myself. I never was a cutter, just don’t like it, but the blunt impact of a hit soothes the tension. It is surprisingly hard to bruise and I don’t even know why I want to. I guess just like cutting I want a visual indication that I’m fucked up. Heck I know I’m fucked up but my mind keeps rocketing between extremes of “I’m fine, I’ve always been fine and I can be better anytime I want” and “I am going to kill myself. It’s not a question of if, only a matter of when.” \n\n\nGonna end this with a lyric like a proper angsty teen, even tho I am no longer the latter. I like Penelope Scott a lot and I really resonate with the line “I would give anything to look the way sick people are supposed to look”\n\nHope you’re all doing okay tonight ❤️", "url": "https://www.reddit.com/r/SuicideWatch/comments/qbcnhi/guilty_about_not_being_sick_enough/", "title": "Guilty about not being ‘sick enough’", "social_network": "reddit", "user": "DonTacheMii", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 71, "down_vote": 0, "creation": 1634653674, "permalink": "/r/SuicideWatch/comments/qbcnhi/guilty_about_not_being_sick_enough/", "nsfw": true, "first_save": 1635426194.3611922, "replies_charged": false}