{"id": "t5_2qpzs_t3_pq1mg9", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a"], "text": "So my best friend has some serious mental health issues he has been neglecting for a long time. He moved to Texas about 10 years ago after graduating college mostly to escape his abusive older sibling who also suffers from severe mental illness and drug addiction. He had a buddy living out there wnd he found a job. \n\nFast forward 10 years later, his mother (who also had drug addiction and biopolar disorder) passed away suddenly amidst COVID. Whether or not it is Covid related, no one knows. Only one person knows: his brother. And he won’t tell anyone what happened to her. There was no funeral or service due to Covid. Ever since, he’s been a wreck. He admits to attempting suicide twice since then, and is talking about it again. Except this time he to plans to try to attempt an overdose on heroin/fentanyl. \n\nI’ve been thinking of calling in a wellness check to his local PD, but I’m scared to. We both are born and raised in New York where there are laws protecting people from criminal action in the event of an accidental overdose. I want to call in a wellness check but I also don’t want him to go to jail if he does actually have drugs. \n\nSo now I don’t know what my options are. Is there anyway I can get him checked on without getting him in trouble?\n\n\n\nnow I’m at a crossroad of call the wellness check anyway and risk his arrest. I’ll end up calling someone today, I just want to minimize harm on him", "url": "https://www.reddit.com/r/SuicideWatch/comments/pq1mg9/my_friend_is_suicidal_and_i_dont_know_what_to_do/", "title": "My friend is suicidal and I don’t know what to do - Need advice - Texas", "social_network": "reddit", "user": "Ron-Loves-Twizzlers", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1631890215, "permalink": "/r/SuicideWatch/comments/pq1mg9/my_friend_is_suicidal_and_i_dont_know_what_to_do/", "nsfw": false, "first_save": 1635427962.3473155, "replies_charged": false}