{"id": "t5_2qpzs_t3_osfpjz", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "Hello. I've read alot of people on here(suicide and depression groups) who actually encourage suicide and that's never okay. I'm not wanting people who can relate to these feelings but rather hoping someone who's online is an advocate or something who can give me hope. \n\nI'm in a very bad/dark mindset and I'm contemplating suicide. I have been for over a month but tonight I am truly having the mindset to go forth. I have a legit(to **ME**) reason as to why I'm contemplating. I don't want to go into details on here as I got hate earlier for reaching out with my reasoning. I was told I was pathetic and ridiculous for wanting to end my life over said reason and was told to get over it and move on when I strictly asked for that not to do be mentioned.\n\nThe suicide hotline isn't cutting it... it makes me uncomfortable. I wanna be able to talk about my issues but I can't as I have no one. The one person I did have.... is gone and now I'm like this...  Alone and contemplating ending it all.(°get help °seek a doctor °seek meds °move on °get over it °quit relying on someone else for happiness °time heals etc) are all things I don't need to hear. They make matters worse. They're cliche and there's a reason why therapists avoid using those.\n\nOne, I'm seeking help on here. Two, I reached out to a new therapist. Three, I don't like meds. Four, I can't move on or get over my situation. Five, I don't rely on someone else for happiness they just so happened to be the only shred of happiness I had in life. Six, time doesn't heal. Sometimes time will cause things to fade to a certain extent... but it isn't that way for EVERYONE. If time healed and people got over everything(cliche) this group wouldn't exist. Suicide wouldn't exist. \n\nSo to be as short as I can. I'm going through the biggest/worst event of my life. I am alone. I am sad. I am heartbroken. I have no one and I mean that. Family told me to \"either kill yourself or shut the hell up I'm tired of hearing crying and about you being sad.\" I don't get out of my house much. I'm an introvert with super bad IBS who's scared of everything... literally. So no I don't have any friends. I *had* one true person in life. Anyways, I've gone through death. Watched some of the closest people to me die awful death's. The worst being a death brought on by cancer. Watched her deteriorate after the diagnosis-radiation and chemo, and within a year of diagnosis she died in hospice. Last moments with her she wasn't there. She was so doped up on pain meds she couldn't talk and didn't know who we were. And STILL this pain I'm facing now as awful as that sounds.... doesn't even begin to amount to this pain I'm feeling now. I'm wanting to end my life. I can end my life so easily right now but a small piece of me wants to hang on or I wouldn't be on here. Sure it's sad and pathetic I'm on here for help but IT'S HERE FOR A REASON because some people still care about others in life even if it's strangers. Is there a safe video chat or some kinda chat(not suicide hotline-convos too short) that doesn't have a time limit? If not, I just need hope. I need to hear that there is always hope. I know you don't know what my situation is or why I'm asking for hope, but if it's true, my situation doesn't matter. There IS hope. I need just a small amount. Just a tad so I can NOT go over the edge. I wanna talk about why I'm feeling this way SO BAD but I know I'll get hate... even if it's one person out of 10 or so. Someone is going to give me hate and make me feel more like shit or they're going to say the one thing's I've said I can't bare to hear anymore. Please... anyone? Hope. I'm alone and broken...", "url": "https://www.reddit.com/r/SuicideWatch/comments/osfpjz/is_there_anyone_who_is_an_advocate_online/", "title": "Is there anyone who is an advocate online? Actively feeling suicidal", "social_network": "reddit", "user": "jelloJesse", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1627359292, "permalink": "/r/SuicideWatch/comments/osfpjz/is_there_anyone_who_is_an_advocate_online/", "nsfw": false, "first_save": 1635427991.6452692, "replies_charged": false}