{"id": "t5_2qpzs_t3_pm7zdl", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42"], "text": "Although I've never gotten a formal diagnosis for anything due to growing up in a migrant household where mental health isn't taken seriously, I have suffered from severe depression since the age of 10 as a result of unfortunate life circumstances. For six years, I have been dealing with suicidal ideation and have had countless suicide attempts and plans. My plans over the years include hanging, drug overdose, self-strangulation, drowning, self-poisoning, self-stabbing/cutting, railway and vehicular suicide etc.\n\nFor context:\n\n* grew up in abusive home where I was the main target of my female biological parent's aggression (possibly as a result of undiagnosed neurodivergence but that's a story for another time)\n* other kids weren't too kind towards me \n* social isolation and being unable to form any platonic relationships after moving schools at age 10 (note that I only really had one close friend from kindergarten up until the move and the few other friends i had weren't close at all and i only really knew them through this same close friend)\n* development of severe depression (age 10) and social anxiety (age c.11-13)\n* grew up as a generic gifted kid and had naturally high expectations of myself so not getting a high enough score to gain acceptance into my dream secondary school continues to affect me to this day (just thinking about the school is enough to trigger an outburst unfortunately)\n\nI no longer view suicide as an emotional thing but rather an action I need to take in order to punish myself for the countless failures I've made in my short time on this planet. They say adolescenthood is supposed to be the best point in one's life but it just isn't. At age 14, I was hospitalised after a hanging attempt in the school bathrooms and was subsequently hospitalised. I felt trapped in that place and as someone who has always been critical of authority figures, I was in a constant state of annoyance and frustration over the seemingly arbitrary rules and systems in place. To escape, I downplayed the severity of my issues and it worked I suppose. I was only in there for about a month so happy ending right? Well no. I still suffered from constant suicidal ideation because mental health support for young people is still quite shallow in some aspects and mostly consists of phrases such as: \"Look on the bright side\" or \"Just practise mindfulness\" but I digress. \n\nBeing put on medication didn't help much either. Although I technically felt happy, there was a still a feeling of emptiness within me that left me feeling like a cardboard cutout. Although I technically felt happy, I still longed for the sweet release of death especially since I still had social issues that didn't vanish. It's funny how the people around me (well at least the adults) think I'm just another teenager with surface-level mental health issues that can easily be resolved through shallow therapies. I feel like an anomaly, a mistake. Something that needs to be terminated immediately. Nothing in this world will ever get rid of this feeling. By not getting into that dream school all those years ago, my brain views everything I have done after that point as irrelevant. I wish my thinking wasn't so black and white but unfortunately I'm not someone that can easily 'go with the flow' and due to that, these thoughts may never subside.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pm7zdl/is_it_normal_to_have_suicidal_thoughts_nearly/", "title": "is it normal to have suicidal thoughts nearly everyday", "social_network": "reddit", "user": "TheFloorMayBeLava_02", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 18, "down_vote": 0, "creation": 1631368945, "permalink": "/r/SuicideWatch/comments/pm7zdl/is_it_normal_to_have_suicidal_thoughts_nearly/", "nsfw": false, "first_save": 1635427331.0194266, "replies_charged": false}