{"id": "t5_2qpzs_t3_qfh47r", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351"], "text": "My birthday is coming up. I used to love birthdays, but now I have nobody to invite. Last year my sister held a (badly disguised) pity party where we ate from a chocolate fountain and watched movies together. I don’t know why this birthday is getting to me so much. Maybe because I’m realising that this is how my life is going to look, forever? And I can’t do it.\n\nI was 16 during my first attempt. 9 years later and not a day goes by where I don’t regret failing. I’ve never been grateful for the second chance and I’ve never let go of the desire to try again. \n\nSomething’s changed. For so long I had told myself I wasn’t allowed to die - the one thing I wanted most in the world, more than anything. It felt so concrete, this unbreakable rule that seemed to be justifying my ongoing existence.\n\nBut now I look around and realise I have no friends, no coworkers, nobody who relies on me. That’s just as well - I’ll never be the friend/sister/daughter/partner anyone deserves. \n\nI’ve deleted my Facebook and Instagram. I quit smoking purely because I couldn’t be bothered anymore. I’ve had these phases in my life before but it’s like I’m always tricked into staying. This time it feels unshakable. \n\nI thought it would get better. Now I see that it will only get worse. My relationships have deteriorated around me, I’m out of options, and the effort/energy it would take to dig myself out of this hole is effort/energy I don’t have. \n\nI’m so tired.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qfh47r/to_what_end/", "title": "To what end?", "social_network": "reddit", "user": "coolforcatsmp3", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1635169627, "permalink": "/r/SuicideWatch/comments/qfh47r/to_what_end/", "nsfw": false, "first_save": 1635423136.428305, "replies_charged": false}