{"id": "t5_2qpzs_t3_qga21b", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2", "69686dc6-5bf4-41ab-864a-231bdd6f02c9"], "text": "I am 19. I have been cheating on my significant other for about a month with somebody we'll call Dale. Dale got me into LSD and coke and has run me out $700 and is refusing to pay me back. Last night Dale promised me he loved me, he was going to leave his girlfriend, and we have future plans for a better life and a better world. He endlessly told me how I was such a genuine and good person, that I had a beautiful soul and I was gorgeous and loving. He told me today he's staying with his girlfriend, he is not going to pay me back, and that he just used me to get back at her. I plan on telling my boyfriend that I cheated, telling my best friend that I had been talking to Dale even though she hates him. Then once the confessions are over and my final words have been heard, I have two bottles of extra-strength Tylenol hidden in my bathroom, I believe they both have 100 pills each.\n\n&#x200B;\n\nEDIT: TURN OF EVENTS\n\nDale actually didn't say any of that, it was Dale's girlfriend logged into his Snapchat trying to get information out of me and convince me to not talk to him anymore. Since I thought it was him I was like fuck it and confessed to his girlfriend on messenger, then he messaged me on messenger too going \"wtf why'd you tell her that?\" but immediately was like \"oh shit I'm so sorry I would never do that to you\" after we cleared up the confusion and both realized that she was pretending to be him. I managed to wiggle my way out a little and tell her he didn't actually cheat with me, that I was just jealous and liked him and upset ab the money but that he didn't do anything. He apologized multiple times (even though it was her doing) and assured me he meant all the kind and good things he said, and that he will figure it out. I feel horrible and like I've done nothing but make awful rash decisions today. I confessed to my boyfriend who said he wanted to be alone for a while and when he returns I don't believe he will be my boyfriend anymore. Then my best friend said she sides w my boyfriend and will stop being friends with me if I date Dale. I don't know what I'm doing and feel I've somehow lost even more, yet at the same time, I'm comforted that it wasn't Dale telling me the nasty things I thought he did and it was his girlfriend. I'm going to see him later to talk it all out, hopefully.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qga21b/im_finally_ready_im_going_to_kill_myself_tonight/", "title": "I'm Finally Ready, I'm Going to Kill Myself Tonight.", "social_network": "reddit", "user": "By_Talos_Im_A_Whore", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635265301, "permalink": "/r/SuicideWatch/comments/qga21b/im_finally_ready_im_going_to_kill_myself_tonight/", "nsfw": false, "first_save": 1635425177.7161214, "replies_charged": false}