{"id": "t5_2qpzs_t3_q0t1mx", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "I fucking hate it all. I recovered in love for a boy. Welp, turns out he just used me to see, if he can love a ,,man\", even though I am a boy. The first three months were good, but the rest he was becoming more and more uncaring ununderstading and rude. *Chuckels morbidly* I recoverd in love from my anorexia. A love that was false. I have lost my o' so beautiful body, to be covered in flesh, fat and muscles again, to show him I loved him and that he meant more to me than death, perfection. Oh, but the love died, so, too, did the friendship steadily. He muted me, showed no interest in my topics nor me in any regard, besides ,,Haha, funny meme\". I gave it all to him. My love, my friendship, some of my secrets, but I guess it doesn't matter. We joked about him breaking me in regards in love. I always deniend it, but he has. He bloody has. He threatend me to not kms due to him doing the same. I see it as lie now, remembering how uncaring he was the last months, even going as far to tell me to starve, if he is the only reason i am not starving, and that it would bother him anymore. Rules after rules were given. *Chuckels loudly* I.gave.it.all.up.for.him. My anorexia is so fucking high that it is impossible to bear. I desire to kms, yet I can't do to my body becoming sleepy when I am extremly stressed, and promises. I-I....I just feel so wanting to be perfect again...due to the memories of what I lost due to promises to him. I-I am doing so well in regards to my ED..., just the memories...It brings it all up again.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q0t1mx/memories_of_what_has_been_lost/", "title": "Memories of what has been lost", "social_network": "reddit", "user": "SturmReaper3188", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1633302428, "permalink": "/r/SuicideWatch/comments/q0t1mx/memories_of_what_has_been_lost/", "nsfw": false, "first_save": 1635422254.314229, "replies_charged": false}