{"id": "t5_2qpzs_t3_q4kte5", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "I honestly hate my life and my own existence on this earth. My entire life has been nothing but trauma and pain. Always been bullied throughout childhood and as an adult. My sister died overseas when I was young, she passed away while pregnant, and I became a full time carer for my mum at age 16 up until her death in 2015.\nI spent almost a decade of my life taking care of her and living anxiously and unaware about mental health support.\nBefore she passed away, I felt so close to telling her about what my brother did to me as a child, but I couldn't tell her, she was dying, and I never came forward to very late in life and hate myself every day for pretending like he didn't do anything to me. I have chronic insomnia that came on when my sister left Australia and passed. I have lost so many friendships and get hated on for my depression. I'm just so damn tired and exhausted with living. I have been told by a toxic cousin that 'others have it worse' and what happened to me wasn't real. People literally support this disgusting person and no one supports me as the victim. I don't mean anyone harm. I am kind hearted and giving. All the ones who cut me off and walk away from me I showed so much kindness. I was excluded and even bullied by them, too. \nI feel like a failure. I have never worked, besides being a full time carer, which many forget was actually work, just not in their eyes. And I won't ever be able to hold a job with these mental health conditions and I am so tired of being hated on for trying to maintain the work of my mental health and catching up on it after years of not recognising how desperately I needed the support. I give up trying to apply for a payment to give me support and help me hold on because the government doesn't care about people like me.\nI have to be forced into work and I can barely survive a day of feeling good. I don't sleep much. I stay in bed as I make that my safety net when I feel at my worst. I don't really eat much and it's a big struggle to function this way.\nI could go on and on, as there is so much. I don't drink alcohol. I am nearly 4 years sober from drinking. I don't smoke. I don't touch weed anymore. I don't abuse medications. I'm just so depressed and feel like I don't matter, or never mattered to some people. Maybe the world would be better off without me. I wish at times my mum aborted me. She couldn't do it. So I am here and I don't know what my purpose in life is. Was I just born to suffer?\nI had to put my cat to sleep in March. I have to face what happened to me in court next year and I'm so scared and lonely. I'm just so so sad inside. I don't want to end my life, I've had attempts before and I've overcome so very much.\nI feel on the verge of tears. I just want this pain go end and I want to be happy. How can anyone be happy when there is too much pain and no cure for it?", "url": "https://www.reddit.com/r/SuicideWatch/comments/q4kte5/i_hate_my_life_so_much_and_feel_so_alone_with/", "title": "I hate my life so much and feel so alone with everything I'm feeling", "social_network": "reddit", "user": "xtremehedgehog", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1633784267, "permalink": "/r/SuicideWatch/comments/q4kte5/i_hate_my_life_so_much_and_feel_so_alone_with/", "nsfw": false, "first_save": 1635426553.4482143, "replies_charged": false}