{"id": "t5_2qpzs_t3_bkapx9", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "Yesterday I got triggered by finding an empty bottle of liquor in my husband's backpack. He drinks way too much and he denies drinking full bottles of hard liquor, but I know better... Anyway, I was already depressed and that sent me into a full suicidal crisis and panic attack. (It's not like this came out of nowhere, it had been building for months.)\n\nI called the VOA crisis line. First I was told to go to the ER (unsurprising), but I just wanted to talk. I was in the middle of a panic attack. They told me to hang up and call my doctor's office and ask for an emergency appointment. I did, but my therapist doesn't work on Thursdays and Fridays and no one had any openings. So I gave up and called the crisis line back. This time they told me to sit in a dark room for an hour and relax. So I did. Still pretty suicidal, but the panic attack went away.\n\nLast night I just couldn't sleep. I kept having to fight off these thoughts of ending my life. I didn't fall asleep til 5am, and then I woke up at 8am... Still thinking about suicide, still pretty anxious.\n\nCalled the crisis line back. They told me to call another provider's office and ask for an emergency appointment. So I called there - they told me they don't set them up, only the crisis line does. I should call back the crisis line. \n\nThat's where I am. I don't think I'll be giving them a call back... Clearly there is major miscommunication there. I'm at a loss of what to do because I don't want the cops called on me and I don't want to go to the ER. I know myself and I have been through many crises just like this. I've been through FOUR hospitalizations and I know they won't work for me. While I am ambivalent on suicide and I don't want to die, this is Red Alert.\n\nI just wish there was a \"Mental Health ER\", y'know?", "url": "https://www.reddit.com/r/SuicideWatch/comments/bkapx9/suicidal_and_the_suicide_crisis_lines_are_a_joke/", "title": "Suicidal and the suicide crisis lines are a joke", "social_network": "reddit", "user": "turmericproteinpowdr", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 14, "down_vote": 0, "creation": 1556902551, "permalink": "/r/SuicideWatch/comments/bkapx9/suicidal_and_the_suicide_crisis_lines_are_a_joke/", "nsfw": false, "first_save": 1635426126.3830163, "replies_charged": false}