{"id": "t5_2qpzs_t3_d312bs", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "I've had depression for as long as I can remember, and so has my fiance. Despite this, Things were getting good in our lives: i got a stable job, she got promoted. We moved into our own apartment, got away from the most toxic people in our lives, namely our parents, and she got on antidepressants. We have an amazing support group, met some friends that we both adore and love having around, friends that understand what its like to go through depression, anxiety,  eating disorders, and helped us through some low points.\nBut lately things are getting really bad.\nBarely more than a month ago, my fiance planned and tried to kill herself. At the last second she backed out, but it wrecked me, and i know she hasn't been getting better either. I couldn't eat or sleep for weeks, and we both started cutting again. It's hard for me to go to work when i feel this devastated and hopeless. \nSeveral times during this month, we both agreed that if one of us goes, it'd make the other want to go too. So now we have a plan to kill ourselves together if it comes to that. We keep making lists of things to do before that happens, as its only the very last resort. Hence we call it Plan Z. We keep talking about it, about how badly we want to escape all this pain and torment we feel. Last night we both realized that we don't want to die, as there's still things we want to do in life, but that this pain is getting too much to cope with. We talked over methods of suicide based on a couple of factors: pain, time it takes, the possibility of failure, ect. \nI've never had the motivation to come up with an actual plan for myself. Putting so much thought into this suicide pact is terrifying me to my core, because to me, this feels like the benchmark for no return. No matter how long i delay things, I'm only going to end up killing myself. I have no chance to make it far with this mentality, being confronted with the control of my mortality is horrifying, and yet so tempting. I can't see it getting better. I'll have a few more days where i can smile, but at the end of those days, I'll still be faced with the monster of depression i house in my head.\nWe're trying to stay strong, but with the severity of the pain and depression, in my head it feels like its only a matter of time. Im coming to terms with that.\nI have suicide notes written up. I started drafting a will. I'm spending more time with my fiance trying to enjoy whatever small, unknown amount of time left together. \nI don't want to die. I don't know what comes after death, what will happen to me or her. Im afraid. I don't want to fail because that would put us through the awful ordeal dealing with hospitals and doctors and trying to cope not because i want to cope but because I'm being forced to. \nI don't know how much longer i can keep pushing myself to stay alive. I don't know if i want to die, but if i did, i want to do it while holding the love of my life as we go. I don't want to be alone when whatever happens next comes.", "url": "https://www.reddit.com/r/SuicideWatch/comments/d312bs/how_am_i_supposed_to_keep_going/", "title": "How am i supposed to keep going", "social_network": "reddit", "user": "MayhemMadam", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1568254012, "permalink": "/r/SuicideWatch/comments/d312bs/how_am_i_supposed_to_keep_going/", "nsfw": false, "first_save": 1635427717.42242, "replies_charged": false}