{"id": "t5_2qpzs_t3_p4aoh9", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "At my last doctor visit I was declared absolutely healthy and that \"whatever it is, it mustn't be too bad!\" All based on because I got rid of most of my binge eating tendencies (turned into anorexia and a lot of people have been happy about it), moved away from my parents and was able to hold a conversation fairly normally. To me describing loneliness and being a societal outcast, the doctor said \"But you must be the lonely type, so you actually enjoy being alone!\" \n\nNo. I'm disgustingly self conscious. I know exactly what is wrong with me, I have every negative claim about myself supported and backed up. Positive things are merely speculations. They don't exist, so to say. I'm nothing but a burden. I cannot get with the standards nowadays, I can't shake off the consciousness that people will always know of something better. Anything I do is in vain.\n\nThey'll probably kick me out soon for being SO healthy. I have the tendency to get all happy-go-lucky when I talk about serious matters concerning myself. \"Haha, yup, suicide, sounds like a good Tuesday plan! Wouldn't that be crazy or what?\" Not crazy at all. I crave it. \n\nI don't want pills, I got yelled at. If I quit therapy, I'm gonna get yelled at again. Their goal is to deem me healthy and kick me out, but I think I have the personality of someone doomed to have depression their entire life. I'm rather impulsive and while my constant pain throws me to the path of killing myself often, I decided I should wait over Christmas at least. 1.1.2022, does that sound good? Maybe. I'm planning then. \n\nI could tell them. But then what? They force pills down my throat which I'm immune to and nobody around me knows because they wouldn't believe me, force me to a ward again which turns me into an excellent liar because my state worsens there, and I need to get out. After that, I'm back to the same. I'm way too conscious of all the interviewing techniques they use, what the point of the questions is, what lands you in a ward, how the workers are behind your back. Easy for me to say, I'm one of them. \n\nI've seen the action as a patient and as a worker. I've sat next to someone who cried to my shoulder saying \"I want to die.\" But I couldn't convince them that there was anything good in this life, not truthfully. Their life was as empty as mine. Theirs adorned with broken love and alcohol, mine...well, probably heading down the same way some day. I break everything and I don't drink, but I just might. \n\nI don't want people to be tired by me anymore. I think it's easier for me to live \"happily\" this remaining time because I know disappearing is not so far away. But really, nothing feels like much. The reminders creep up no matter what, I can't escape. I can't remember how food tasted, how music sounded, what games were like and what was it like to watch anything. I do all of those, well almost, but it's as if I'm watching behind a wall. I find no reason to \"celebrate the tiny victories\", those are the bare minimum I should do anyway. Even the \"bigger ones\" after all just are things I have to do anyway. \n\nWhat a long post, ha ha. I tend to yap a lot, I apologise. Why not have this out somewhere at least, you know? Thanks for reading, although I'm already like a senior member here. Sorry for bad English and for any typos. Let's just smile upon meeting and celebrate the days left.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p4aoh9/quitting_therapy/", "title": "Quitting therapy", "social_network": "reddit", "user": "kinkkuaivo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1628956909, "permalink": "/r/SuicideWatch/comments/p4aoh9/quitting_therapy/", "nsfw": false, "first_save": 1635422258.9238527, "replies_charged": false}