{"id": "t5_2qpzs_t3_pekr41", "request": ["5f7c2841-3f43-4682-8126-88825da57933"], "text": "It hits me every once in a while that normal people don’t think about suicide as often as I do. I’m not even actively suicidal right now, but I consider it often enough for me to realize that I’m one of the outliers in society. So, over the years suicide has become more and more realistic, and has almost become a part of my daily life.\n\nWhat gets me though is how that’s *totally* not the case for everyone else. If you mention suicide, people either freak out or just play it off as a joke as if the concept of “suicide” only exists in movies and books. And while it is sad, I actually find that kind of funny.\n\nFor example, I hate working. I fucking hate getting up early to sit at a desk doing shit I don’t want to do for 8 hours straight. But if I tell anyone about that feeling, guess how the conversation will go?\n\nMe: man, I really don’t want a job. I wish I could just sit around doing nothing all day.\n\nThem: well you need money, don’t you?\n\nMe: yeah but I don’t want to get a job.\n\nThem: tough, that’s the way the world works, you lazy fuck. You’ve gotta work if you wanna live.\n\nMe: well technically I don’t *have* to, because i could just kill myself and not have to deal with it.\n\nThem: seriously? You’d rather commit suicide than get a job? That’s pathetic.\n\nMe: yep, I’m pathetic. Thanks for reminding me, that’s another reason why I should just kill myself.\n\nThem: wait, you’re serious? Nooooo don’t kill yourself you’re loved and you have so much to live for!!!!\n\nI just find it funny that people don’t consider how all of this bullshit could just stop immediately If I put a gun in my mouth. They’re like “if you don’t want to live by the world’s rules, you don’t get to live at all >:(“\n\nBut when I decide “yeah that sounds fair enough, guess I’ll just off myself then :)” their tune changes and they can’t fathom that anyone would choose to not live in this vicious cycle of suffering and guilt.\n\nOf course I can’t say any of this shit in real life, because I don’t think this attitude helps in the slightest. It’s nice to think and rant about online, but if I started telling people how I really feel I’d get thrown back into the psych ward. Or worse, people I care about would get tired of my moping around and they’d cut me off, and then I’d *have* to go through with it.\n\nEverything’s fucked, and the only *”real”* solution I can come up with is just opting out of life. And if I bring it up before actually going through with it, I can only expect to be mocked or bombarded with insincere attempts at “helping”.\n\nIsn’t life fantastic? :D", "url": "https://www.reddit.com/r/SuicideWatch/comments/pekr41/i_find_it_kinda_funny_that_normal_people_see/", "title": "I find it kinda funny that “normal” people see suicide as unimaginable or something that you’d “never do”.", "social_network": "reddit", "user": "JarJarJacobs", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 863, "down_vote": 0, "creation": 1630338513, "permalink": "/r/SuicideWatch/comments/pekr41/i_find_it_kinda_funny_that_normal_people_see/", "nsfw": false, "first_save": 1635421088.0030036, "replies_charged": false}