{"id": "t5_2qpzs_t3_pprkk1", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "I’m fortunate enough to not feel the need to commit suicide myself, but I have met people who did.\n\nI say did because I met those people a long time ago on the internet. There’s a chance that those users were faking it but there’s also a chance that they weren’t.\n\nI look back on my attempts to make them feel better and I realise I most likely didn’t help them at all. I had no idea what to say to them so I just said whatever I could think of. Compliments, good things to appreciate in life, my own experiences feeling sad, anything. As I’m writing this I’m crying because I’m pretty sure those old internet friends are dead now, and I was one of the many reasons why. I didn’t understand, and so I couldn’t help.\n\nI have 2 old vent drawings somewhere in one of my sketchbooks. One is of me crying behind a wall of glass looking into a room filled with corpses.\n\nThe other is of me in a dark room filled with other people. I’m the only one in the spotlight, alive and well. The others are in the dark, suffering or dead.\n\nThose drawings were representations of how I felt. I found myself frantically begging and pleading my friends to live behind my screen but was ultimately powerless to stop them. It seemed to me that I was the only one who could be considered happy, and because of that I couldn’t offer any help at all.\n\nI feel guilty and afraid. What do I do if I make a new friend in real life and I find out they were suicidal? What do I say? I’m scared I’ll make the same mistakes I made back then.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pprkk1/dealing_with_the_guilt/", "title": "Dealing with the guilt", "social_network": "reddit", "user": "UsefulEnthusiasm7651", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1631846014, "permalink": "/r/SuicideWatch/comments/pprkk1/dealing_with_the_guilt/", "nsfw": false, "first_save": 1635426178.8987954, "replies_charged": false}