{"id": "t5_2qpzs_t3_cxf1c3", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "This will be a little bit of ranty text, don't read if you don't like disorganised sputtering tirades. \n\n\\>TLDR; Have continuously half-failed throughout school and higher education. Don't feel like I will surmount to anything. Will be tested for neuropsychological disability (ADHD) soon, already tested positive for GAD and depression. Will not kill myself, but I get strong urges to. \n\nI don't know where to start really. I have over the last couples of years just felt that I've cumulatively failed my prospects of the future, or at least sabotaged them pretty badly. Primarily due to my education. I've always been a kid that have tried in school and done my best, with varying degrees of success. Already there I felt like I was falling short: If I was doing my best, why weren't I at the top of my class? My degrees were satisfactory enough to begin studying at uni. I was thinking doing pol. sci and economics as major and minor respectively. Pol. sci has been going fine and I love it, but whence I began studying econ I got anxious, freaked, and dropped the course, 2 weeks in. The problem is that I'm only good at soft science and laughable at math; I'm just so freaking embarrassed about it and I had hard time writing this because I'm afraid of being judged. My self-esteem and sense of self-value is just at rock-bottom and I don't know what to do. Everybody else manages to study, even harder subjects than mine, why can't I do it? I feel as if nothing good should ever come my way, I don't deserve it. \n\nMy parents support me way too much and primarily out of pity. I know they love me, but I feel like I'm a burden upon them, something they will never admit, but I know they feel badly about me. I'm a black hole of wasted effort and money that don't amount to anything. \n\nMy counselor advised me to be tested for ADHD, so I'm in the process of doing that. It's just so fucking upsetting if it is this that have inhibited me from performing like I feel I should. I'm already diagnosed with GAD and depression, so ADHD would just be an additional flair to the mix of my increasingly damaged mind. I will not kill myself, I'm not at that point. But I have this very strong sense that I don't deserve to live and that I have ruined my life.\n\nAny encouragement would be appreciated.", "url": "https://www.reddit.com/r/SuicideWatch/comments/cxf1c3/want_to_kill_myself_over_being_a_failure/", "title": "Want to kill myself over being a failure", "social_network": "reddit", "user": "qndry", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1567160782, "permalink": "/r/SuicideWatch/comments/cxf1c3/want_to_kill_myself_over_being_a_failure/", "nsfw": false, "first_save": 1635426435.4922266, "replies_charged": false}