{"id": "t5_2qpzs_t3_qdtcs9", "request": ["ee176c24-5d0b-47eb-8f0f-71f3b585684e"], "text": "Even though I am perfectly capable, I simply have no desire anymore. Things are way more difficult then they should be. I am almost 30 years old, i was supposed to spend my 20's figuring my shit out, figuring out how to be in this world. All of the things I love are out of reach. Music, violin, simply making sure I feed myself and drink enough water. Excercise.\n\nI have wanted to die for a decade now, I have a partner who supports us both financially. It honestly kills me, I basically leech off of him. He is normal, neurotypical, hard-working. I am suicidal, can't hold down a job, and waiting for proper resources such as psychiatric help is taking a huge toll on me. I feel so incredibly helpless and Impotent. I could start studying for my Learners License, but I keep not doing it. I am losing faith in myself daily, everything I want to do I never persist in doing. I haven't followed through in ANYTHING since i was 18 years old. I've accomplished nothing academically, and whenever I reach out to local resources I find myself disheartened and underwhelmed. I call in to a suicide prevention hotline to simply talk, and they try to refer me to other places. I am jumping through hoops. I started seeing a local therapist, so thats really the only good thing happening. I can't express how incredibly tired I am of existing like this, I am already dead inside. I feel like I'm already dead.\n\nI keep doing what I can but I have nothing left anymore. I wish so so so much I would just die. I beg of life to off me, I don't understand why some people who actually want this life have it ripped from them so abruptly while I get to slowly watch myself become something I hate more and more every day. I just need to fucking die already.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qdtcs9/cant_seem_to_provide_for_self/", "title": "Can't seem to provide for self", "social_network": "reddit", "user": "Uniomentalis", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1634946576, "permalink": "/r/SuicideWatch/comments/qdtcs9/cant_seem_to_provide_for_self/", "nsfw": false, "first_save": 1635427874.283998, "replies_charged": false}