{"id": "t5_2qpzs_t3_lwnfhl", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "I've been very melancholy for a long time, possibly forever. I started to fantasize about my death around my late teens because I was very depressed after graduating high school. I honestly can't remember much from the years I was 18 through 21. I think there were months where I would cry myself to sleep every night. I started to get better when a friend convinced me to go to community college. Things seemed ok for a while and I didn't have the thoughts anymore telling me to kill myself. Around my late 20s, the thoughts came back. Every day, my own head would tell me this. I would sit in bed and think of what my funeral would be like and how people would find out. I was very depressed when I realized that my ability to distance myself from friends for months at a time meant that they would likely not even know I had died. That made me even sadder. Plus, when I was young I would joke that I would jump off a cliff before reaching 30 in an effort to stay young forever. \n\nSuddenly, 30 was looming and my deadline was near. I realized I had not accomplished anything that I had wanted to do at 30. Somehow, I made it to 30 and decided that I was only going to stick around because I did not want to traumatize my parents or siblings with grief. I've been living life on auto-pilot sometimes. I'm here but I'm not here. I've started to relapse back into a melancholy state and felt that I could just work my way through it. But tonight, the ideation came back again. This morning I had my first therapy session on BetterHelp but I feel that it may be too late. I wish there was a way I could pay someone to fix me immediately. I reached out to a friend and opened up about what I was going through - the trigger that led to my sadness - and instead she essentially told me that our friendship was over. She said I lived in my head and never opened up to her in person, only through letters as if I was telling her a story. The thing is, she's right so I don't blame her or anyone of my friends that have felt this way. It explains why I am so alone.  \n\nIf the technology existed where I could gift my life to someone who needed it more than I did, I would.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lwnfhl/ideation/", "title": "Ideation", "social_network": "reddit", "user": "Breaddystix", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1614753919, "permalink": "/r/SuicideWatch/comments/lwnfhl/ideation/", "nsfw": false, "first_save": 1635427519.306064, "replies_charged": false}