{"id": "t5_2qpzs_t3_prx7lq", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "Same old story I’ve lived through before but worse in every metric for me at least and a tale as old as time. My coworker flirted with me, we got together. Here’s where it splits. She told me she was fucking me and two other guys, we weren’t exclusive so nbd. Then she told me she’s pregnant and I’m the most likely father. This was last July. January roles around she finally decided to abort and then I got into a car crash and she broke up with me over text (even told me how proud she was she “grew” enough to not *have* to do things in person.\n\nI stuck with her through all that and she dumped me like a sack of shit.\n\nThen after months she starts trying to hang out with me and makes me sell her booze when I’m at work even though I was a recovering alcoholic. \n\nI got caught drunk at work cause she pushed my buttons one two many times and I snapped. Lost my job, my living situation is that I’m on a couch and about to be homeless and now I make 60% as much as before working at a gods dammed circle k and I hate it. She’s moved on just fine and still works her cushy job. I’m out of options, at least any good ones and I know what I need to do to show her what kind of person she is and what she’s done to me but occasionally I feel happy and don’t think about her and it makes me rethink my “final solution”. I don’t know, I’m not miserable every second of the day but the amount of time I agave to work and the poverty I’m facing now is unbearable long term and I don’t think I can get out. Do you think I should just bite the bullet and be done or should I let another person get away with taking my whole life away from me again?", "url": "https://www.reddit.com/r/SuicideWatch/comments/prx7lq/my_life_has_gone_to_shit_due_to_falling_in_love/", "title": "My life has gone to shit due to falling in love. Again.", "social_network": "reddit", "user": "masterchris", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1632151840, "permalink": "/r/SuicideWatch/comments/prx7lq/my_life_has_gone_to_shit_due_to_falling_in_love/", "nsfw": false, "first_save": 1635427102.7055724, "replies_charged": false}