{"id": "t5_2qpzs_t3_mts8eg", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "April 18, 2021 marks the very first time in my life I said “I love you” back to him and felt myself not fully mean it. I feel guilty and horrible.\n\nI loved him so much. Everyone around me saw it, and wondered why I stayed through the pain the relationship brought on. I went to the ends of the earth for him in every way possible. Where did my love for him go? I feel it dwindling. \n\nHis mental health is so horrible and is entirely the reason we had to break up. He refuses to get help. He goes down destructive paths/courses of actions. It makes me see him differently and honestly makes me want to be done with him. I feel so bad for even thinking this but it’s so unattractive. The haphazard disconnected thoughts and lack of confidence and deeply rooted insecurities and overthinking over the smallest things all really repulse me. The lack of motivation and pro-activity and ambition and drive turn me off more than I can explain. For so long I put him on a pedestal and looked up to him— even to the point of bending over backwards changing myself to appease him— but now I see him as someone broken and crippled on the ground who I look down to for not being able to pick himself back up. Every time he tells me he desperately needs me I get the ick. The delusion he lives in thinking we can be happily in love one day scares the living hell out of me. I don’t have it in me to tell him any of this and shatter his desires of living to see another day. But I dread picking up his calls and I’m typing this sentence because he’s calling me right now.\n\nHe constantly cries, which is great for him actually! Men should be encouraged to cry and I’m so happy he lets out his feelings. But it’s the perpetual sadness that almost impedes on weakness in my eyes. It’s his addiction to porn and use of it as a coping mechanism that partially destroyed our relationship and makes me feel disgusted by him for still succumbing to it on a daily basis. And I am expected to soothe him like a baby until his mind calms down. After everything he’s done to hurt me, and the pain I’ve endured, I still have no choice left but to be there for him.\n\nIt’s confusing looking back because the only reason I jumped into this whole thing was because he was my best friend for the longest time who I’d known to be the complete opposite of all this. He was the confident, happy, stable, driven, and secure boyfriend. But his suppressed demons came back for another showdown and it looks like the demons are winning.\n\nI didn’t know what I was signing up for and now I feel trapped. I can’t cut off contact because I’m so afraid he’ll kill himself if I do. But having contact open keeps me on edge. And not because I want him back but because I feel solely responsible for him staying alive. It’s a constant source of anxiety and fear that sucks up hours of my day when he reaches out which is everyday. \n\nI got handed the role of therapist and doctor and lifeline all at once when all I want is to be the ex girlfriend who never speaks to him again. Or at least doesn’t speak to him for a very long time. \n\nI tried handing him off to his friends and family to watch over his mental health. But he keeps coming to me while pushing away everyone else trying to help.\n\nI feel horrible because I don’t want to catch up or make inside jokes like he does. I don’t want to have small talk. I don’t get excited to tell him about my day anymore, I don’t look forward to hearing about his anymore, and all I want is some peace and quiet for myself to heal. But the small talk and glimpses into our past relationship is something he seems to rely upon to keep going, meanwhile it singlehandedly makes me want to run as far away as possible.\n\nThe bottom line is I can’t move on. I want to be done. I don’t want to move onto other people I really need a lot of time because I’ve truly felt traumatized by this whole experience. But I’m so afraid of the day that I decide to move on later down the road, because I know it will break him. I hope it doesn’t make him more suicidal. Sometimes I fantasize about the day I meet someone else who’s stable and happy and can give me the healthy love I’d like to have. And hopefully that’s a day where I can finally be free from all of this. But then I feel horrible and hypocritical for even having those thoughts, because if he were to fantasize about all that, I’d be a little hurt by it I think.\n\nBut how does it get better? How does it all stop? Even when I pull away ever so slightly, he loses his mind and starts freaking out. But I can’t keep this up forever. I just don’t know where this all comes to an end. I can’t be his emotional support for life.\n\nThe worst part of all this is that I have no control over my feelings fading. I can physically feel myself falling out of love. It’s all so scary because for the longest time, I saw him as my whole world and the man I wanted as the father of my children. I now see him as an anchor hindering me from being present in my world. And I now see him as someone I don’t trust to live a healthy life with, let alone raise a child with. I feel so fucking guilty because I wonder if he’d have these feelings if it were the other way around. Part of me thinks he’d still be able to stay in love with me if I was the suicidal one. I don’t know. Maybe I’m an inherently selfish person. Maybe I’m a judgmental bitch. Or maybe I’m just past my breaking point and completely deserve to dream of a better life without his mental health bogging me down.\n\nFor the first time in my life, on April 18 2021, I had to almost force myself to say “I love you” back for his sake since he said it to me multiple times. I know I felt head over heels in love with him up until just a couple weeks ago, but I’ve been feeling a bit turned off and apathetic as his mental health has been plummeting. I don’t wish for affection from him. I don’t wish to kiss him or get intimate with him. I want to hug him at most. But is it wrong of me to say “I love you” back? I don’t want to be disingenuous and lead him on. At the same time, this lack of romantic feelings is brand new and I don’t want to tell him if I’m unsure and risk him being even more suicidal and depressed. He relies on me telling him I love him to feel safe. But I feel guilty giving him a false sense of security. What do I do if I’m 100% sure I’ve fallen out of love with him? How do I break it to him without utterly shattering him? He talks about wanting to kill himself and having a plan to carry it out and how horrible he feels all the time. I really don’t think I should say anything to him that could hurt him. But I feel horrible saying it when I don’t think I fully mean it anymore. I feel so stuck.\n\nHe always asks me if he’s a burden to me and if he’s overwhelming me and if this is all too much for me. I always tell him no, because I don’t want to hurt him. Him asking in the first place breaks my heart because I don’t want him to feel like a nuisance. I want to care for him and make sure he’s not alone through this. \n\nAt the end of the day, I care for him immensely and have so much love for him regardless of whether or not I feel in love with him anymore. I absolutely cannot abandon him at a time like this when he needs it most. But I also don’t know where to draw the line for my own sake.\n\nI know what I deserve in a partner, and I know it’s not him. I deserve someone who loves me for me. I deserve someone who accepts me for my faults and positively encourages me to learn/grow, instead of constantly grilling me and criticizing me. I deserve a healthy love full of small gestures and acts of kindness. I deserve someone who respects my time by showing up on time instead of constantly being late/making me wait hours for texts/phone calls. I deserve someone who can show me off to the world without a second thought about what anyone would think. I deserve someone who’ll plan dates and surprises once in a while instead of me being the only one. I deserve someone who’s proud to be with me. I deserve someone who wants to introduce me to his friends. I deserve someone who doesn’t cuss at me and lash out at me. I deserve someone who wants to get intimate with me consistently instead of pushing me away sometimes when I initiate. I deserve someone who’s unafraid to show me mild forms of affection in front of our friends. I deserve someone who shows appreciation for the hard work and sacrifices I put in to the relationship. I deserve someone who once in a while will buy me something as small as a $5 bouquet of flowers on a bad day. I deserve so much more than what he was able to give me and I feel guilty for saying all this. I spent our entire relationship thinking I wasn’t good enough for him, but I’m starting to think he wasn’t good enough for me. I know he always wanted to be, but I don’t think his mental health or thoughts will ever allow it. I just don’t think he’s “the one” and I feel immense guilt for it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mts8eg/suicidal_ex_falling_out_of_love_guilt/", "title": "suicidal ex & falling out of love + guilt", "social_network": "reddit", "user": "burner371", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1618803310, "permalink": "/r/SuicideWatch/comments/mts8eg/suicidal_ex_falling_out_of_love_guilt/", "nsfw": false, "first_save": 1635428262.2883086, "replies_charged": false}