{"id": "t5_2qpzs_t3_ozm8ze", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "Here’s the dark secret about suicide: it always feels a bit like a joke. \n\nThis is what I went through in 2020. I was on the brink. I wrote a suicide note to leave behind. I contemplated attempting several times, and I contemplated self harm like cutting myself several times. I stopped myself because I knew that if I even made a small incision I might like it and then do something irreversible. I slapped myself in the head again and again until it really hurt. On the morning of May 8, 2020, I was about to leave my apartment and leave the note on my bed - and I have no idea what was going to happen next. I think I wanted to either run in front of a car or run away. \n\nAnd yet, it always felt surreal. And I think that’s because the human condition is designed for self preservation. So every time I thought about jumping out a window, or cutting, or buying a firearm, or whatever else, something inside clicked like a tripwire and immediately shut me down. One day I was fantasizing about running in front of cars while I was walking outside and I suddenly broke into a panicked frenzy and ran home until I was under the covers of my bed. I called a suicide crisis hotline 14 times in the worst month of the crisis, as well as therapy sessions twice a weekS But don’t mistake this as a total positive - because I was already psychologically primed for an attempt or at least a self harm episode, when I then didn’t go through with it I felt worse. As if I was not only suicidal but also a coward.\n\nAnd this spiral just kept adding onto itself. The cowardice just added more pain, which created more reasons to want to die, which led to more plans, which triggered the tripwire again, which led to more cowardice. And eventually, even while I was woozy from slapping myself so much, I felt that I was just being melodramatic. Like I was trolling. Like I was doing it for the attention. Like it was a joke. \n\nIt has been months since then. I’m much safer now than I was then, but I’ve had to remind myself constantly that no, I wasn’t doing it to grab attention. I lost multiple friends during that time, some of whom literally told me that I was either complaining or intentionally pressuring them. I had to remind myself that I was making plans to attempt without telling any of them. I had to remind myself that I never hit myself on a video call - I did so when I was all alone. \n\nIt was real. I wasn’t making a damn scene. And I never threatened anyone. \n\nBut it felt so fake. Because nothing happened to me. And I guess I should be happy about that. But for some of the people around me, and maybe even for me myself, I think I would have had to have been hospitalized or worse before they would believe that I wasn’t doing it as a show.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ozm8ze/it_always_feels_like_a_joke/", "title": "It always feels like a joke.", "social_network": "reddit", "user": "Equivalent_Dot_1013", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1628308849, "permalink": "/r/SuicideWatch/comments/ozm8ze/it_always_feels_like_a_joke/", "nsfw": false, "first_save": 1635426130.98818, "replies_charged": false}