{"id": "t5_2qpzs_t3_p2pzu0", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "So, my little sister has been struggling with depression for a while now. she tried to jump off our room's window, harmed herself in various ways (she cut herself with knives, razors, drank disinfectant, stuck needles in her arms etc...) and had numerous panic attacks. After therapy and after she spent some time in a clinic with other teens she seemed to get better. She was eager to improve her mental health and always took the medications that they prescribed to her. She had stopped harming herself for almost a month and I thought she was feeling better. However, yesterday night she fell asleep with an ASMR video and, when I went to check on her, her cellphone was still unlocked and the video was still running. Well, I wanted to send myself some videos that she took that day (I didn't wanna intrude her privacy) so I closed youtube. I found on her home screen a sort of timer. It said \"56 days till death\". And it completely shocked me, like, I cried like never before. I was and still am scared af. Why has she set a date for her death? Is she really gonna do it? what can I do? I can't tell her that I looked through her phone without permission, so how can I introduce the topic? I thought she was slowly healing, but now I don't know what to think anymore. Like, I don't know what to do. We've never really been close enough for her to open up to me about her problems, but I deeply care about her. I wanna try and say something to her but I'm afraid it will sound awkward or inadequate. What if she doesn't like it? I'm afraid she will think that I only care about her when her life is in danger.  but that really isn't it. She's still my little sister. I want her to know she can count on me. what can I do? Also, should I tell this to our parents or to someone?", "url": "https://www.reddit.com/r/SuicideWatch/comments/p2pzu0/what_do_i_do/", "title": "what do I do?", "social_network": "reddit", "user": "cldymn", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1628728425, "permalink": "/r/SuicideWatch/comments/p2pzu0/what_do_i_do/", "nsfw": false, "first_save": 1635427639.6427503, "replies_charged": false}