{"id": "t5_2qpzs_t3_k3xf7p", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846", "da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "Two years back (2018) my buddy (Not real names) Carl and I were at the skating rink with our friends and he was looking for a girl to meet. There was this girl skating around on her own out on the floor and he decided he would go and talk to her. Jump forward about a week they go out on a double date with Carl and I's friend, so the girl wouldn't feel as awkward cause Carl isn't the most talkative person. Because of this double date my friend posted the girl's snapchat on her story and I said screw it lets just add her. Well adding her turned out to lead to a solid week of both of us staying up until 7am texting or calling (once even just talking in a Fortnite lobby not even playing). One night she told me she broke up with Carl and she liked me and I said I liked her so we met at the movies and saw a horror movie. I met her mom that night after the movie and her mom liked me from the start. This little date led to many more and a relationship that lasted over a year. It was the happiest I had been but there was a huge thing that caused the break up.  \n\n\nThe breakup: My girlfriend was Rebecca, her best friend who moved to my school was Tess, and my best friend at school (who to for the longest time was into girls)\\*yes it is important to mention this--was Quinn.  An underclassman who was in my choir named Abby as well.  \nSO\n\nTess/Abby apart of the story\n\nI became friends with Tess because she was dating my bestfriend, and then they broke up which led me and her to get a little closer ish cause she went to me asking about if she should break up with him etc. cause I was his bestfriend. So we became friends and it worked hand in hand cause she was rebecca's friend too! So yay right? Wrong. I didn't know that her friend Abby that she would walk around with at school, liked me. We became friends and then she told me she liked me and asked me out (knowing I had a girlfriend) and I said sorry no, I have a girlfriend and also she was too young for my interest. (she was a year younger and I personally only go older for relationships) She was sad and decided to start telling people I said yes instead, and that news got to Tess who loves drama.   \n\n\nQuinn part\n\nMy bestfriend I became close with in Math class when we were seated next to each other and it was just our desks at the back of the room together, while everyone else had rows of 3+. So after her gf broke up with her, she sort of shut down and wasn't paying attention in classes anymore and her grades were slipping so in math I would take her sheets and do the work for her so she could just focus on getting better. The point we started really talking was one day the back of her hand had a bandage on it and I asked if she was okay and she said yes but the next day it was off but she had new marks on her other hand so I knew something was up. I asked her to stay after class in the room (THE TEACHER WAS THERE STILL but is chill and knew it was a sorta like important private conversation) so I talked with Quinn and she told me about it all and that she had depression and fought with suicidal thoughts and harming herself with fire or cuts. We talked and we hugged it out cause I know it's not easy being depressed cause I had issues with it myself for years. That sparked the friendship then we just would hangout in school when we had classes and didn't know other people and crap. this went on for a long time until one day I saw she had a new bandage on her hand, and I asked her what was up but she just walked away leaving me confused. I texted her that night asking if she was okay and she said yeah it was nothing. I decided to ask if I needed to tell someone this time (an adult) and she said no its okay. She started wearing long-sleeved shirts that week and it was winter so I didn't think it was other than being cold.....Well...We go up to my locker in a study hall one day and she follows me but I didnt ask her. She shows me her arms were really hurt and said it was because I didn't give her the affection and feelings back to her (I didn't pick up on anything cause I am just a moron) and she said she would keep doing them cause she couldn't have me as her boyfriend...So on a shitty day for me, my friends, and just everyone I was close with I decided to make one person happy even just a little bit and to try as a way to get her not to hurt herself over me. I kissed her right then and there...This is when I was already a year into dating Rebecca (who btw went to a different school). Quinn started telling her  friend who was also Tess's other friend that we kissed and Drama Queen Tess started telling people I was dating an underclassman, that my bestfriend moved her seat in all our classes to sit next to me (INCLUDING CHOIR????? but they were sopranos and I was bass across the room?) and then talked to me and saw that I had cut my forearm length wise and deep with a  pen that morning. She said she understood and wouldn't tell Rebecca but I would have to and I agreed to.   \n\n\nWhen I was on my way home I decided I would tell her on our call that night. But an \"anonymous\" account on Instagram DMd Rebecca about it all....and we all know who that was...and I was in the car with my mom who just found out her brother tried to kill himself. (I just realized there is a lot of depression and suicidal behavior in people around me...but welcome to my school. You think someone is a happy person they are not..) So I denied that the account said I was having stuff with 3 people...cause the drama just started that it also was my friend Erin ( who i was in a fight with anyways during all this and we were not speaking) I said no thats not true because erin and I were in a fight. So I told the truth there but not the full truth. And she said okay etc. I didn't know how to then tell Rebecca about Quinn. So I didn't.... But i slowly distanced myself from Quinn but she tried to be more clingy. I gave the cold shoulder and then we sort of drifted and it hurt to lose my bestfriend like that. Jump another week I am in an auditorium about to perform with choir and I get a text from Rebecca saying that Tess had texts from a person who said we were dating (abby) and she was pissed. So I was like \"Oh fuck\" cause I had to perform in five minutes. I told her I can text after we perform she said okay. SO after the performance I text abby and bluntly ask (this is word for word) \"are we dating\" and she replies \"No you said you wanted to just be friends\" I reply \"Okay thank you, why did you tell people we were\" and Abby replied with \"Because I wanted it to be true\"...I took a screenshot of this and send it to Rebecca and Tess with proof of Abby saying herself we were not dating and I declined the offer. No one cared. I was to them, lying about it. I skipped school the next three days. Got super depressed and didn't even leave my room for meals. I had a few bottles of water and some gold fish in my room. yeah.   \n\n\nRebecca and I argued for a while and we went on break so she could figure it out. Then the next week in school I get a text saying we need to talk immediately. I couldn't at the time and told her when I could, at like 11:30. In my tech class I asked the teacher if I could take an important call in the hall (we are at a far end of the building by a parking lot door so not a main hall) Rebecca calls and tells me that we are done. That I was lying about it all and said don't talk to her for a while. I lost it. I texted my friends in the class asking if they could bring out tissues and I sat there in the hall my head between my knees crying my eyes out for half an hour. Tess's ex that was my friend was one of the two guys that are my buds that sat there and I told it all to. Worst moment of it all to this point was her saying \"Im breaking up with you.\" it was over a year of dating gone...After this we didn't talk for a few weeks, but Tess video called me, In her car outside of her new boyfriends house (She dated this guy before my buddy and now after) and she was sitting in her car crying saying he knew he made it all up about me and Abby and that she was the anonymous account on Instagram. And added more to the rumor about Quinn and I. She cried her eyes out saying sorry and the reason was because she loved me and if I wasn't with Rebecca she would have asked me out and try to hook up with me (meaning sex yes). I was so pissed off I punched my wall till my hands bled from every knuckle.  \n\n\nAfter not having talked with Rebecca her and I started talking and just every time it was about the breakup and I wanted to get back together and told her about Tess in the car. But it never mattered. We had these back and forth fights for 6 months. She made a friend during this and she said they were just friends until the last day. On the last day we were not fighting and I was saying I was thinking about joining the military, and she said cool, and then said that the friend was now her boyfriend. I was so hurt by that part and I lost my cool. We got into a big fight where Rebecca proceeded to say things like \"I don't care about what you do with your life\" \"Go and join the military for all I care. I dont give a fuck.\" and then the one that hurt pry the most was \"You think you were special? Everything we did I have done before. Even stuff in the bedroom!\" and emphasized the point of I wasn't anything special to her....She gave her boyfriend my number and he told me to fuck off or he would come beat the shit out of me or something...I only replied with \"It's alright. You won't have to\"...he didn't respond to that, and she was still flipping out on me and I said \"You don't have to worry about me anymore..\" I threw my phone and opened my desk drawer where I have random stuff, for making sculptures!!! not originally for any other use.  \n\n\nThere was a piece of broke glass in there and it was sharp to the point of light drag of the tip would cut you...So I did. Alot. I started from my fingertips and let it all just drip onto the floor (there are still the bloodstains on my floor to this day...7 months later) then I slowly worked up my hand more. I knew at this point I coulnd't just leave my best buddies without saying goodbye. So I sent each of them a message (while still losing blood) saying like they were my best bud and like personalized stories of us growing up together like we did the past 6 years. And I said that this was goodbye at the end. Quentin called me then and there while the other two made a groupchat of us all and were looking for my address in our messages on discord (we had talked about my houses after I had moved the past year so I showed them where I was at now) Q called me and was literally crying. I only knew him once before to have cried. He said something Ive always thought but never wanted to be weird and say but He said him self we are like brothers. That just made me so fucking sad cause I wanted to leave. They had said something to one other person to get them to tell their parents and get them to text my mom and dad. I was getting texts from so many people who I didn't even know I existed at school. I always felt so invisible. One of the people called the cops. My mom called my dad and woke him up at 1am and he was pissed he was woken up before he saw me in my room, crying, on the phone with Q and dripping blood down my hand still. I told Q i had to go as my dad came in and sat down. My sister came down saying she got a text from my friends younger sister who we grew up with...This was beyond my friends and school at this point, it was to old friends from other schools I havent talked to in years at this point, and then the cops showed up. They said they did have to mark it down as an attempt but they didn't need to take me away cause my family was there and everything etc. My family sat at the dinning room table and I cried. I just cried. Then my doorbell rang...The three best buds, all of which absolutely hate driving....and all lived different amounts of over an hour away. Chuck woke up his mom said \"we need to go.\" and he drove and got Q and Bren. They showed up for their first visit to my dad's house at 3am to be there and check on me. They knew I was more likely to talk to them over my parents anyways. I can't tell you how much that hurt and also was comforting. Hurt cause I tried to leave this and was willing to hurt these three amazing fucking people. And comfort cause ya know they were there. That night I had to make a promise that I wouldn't text Rebecca ever again or try to talk to her. Then the next day I also had to do situation control and repair to anyone who messaged me. I didn't go to school for a week and when I came back not much changed. Teachers that were chill knew something happened but not exactly, so they were fine with me putting my head down and just shutting out the world. I was very clear I wasn't going to do work in classes, and I slept. I ended up telling only three teachers who asked if I was okay, I basically said \"Im getting better, but just so you know- it got to this, suicide attempt, bad\" They were understanding and gave hugs. I liked it but hated it. I hated the stares from people in the halls and I hated the whispering in the halls. I put in my earbuds and just drowned out the noise. Its been 7 months now and I am happy I didn't finish doing what I wanted that night. But it all still is present in my mind and I never got to fully vent it like this. But don't make someone your one source of happiness. Don't try to make everyone happy. Don't put yourself out there for everyone. Worry about yourself and immediate situational help people but thats it....I sorta became jaded and cold to people since then and now I only talk with Q Chuck Bren and a few other people who are online friends. I have met someone else and she is amazing but she doesn't know all what happened back then she only knows I had an attempt. I don't need sympathy from people here or anything I just need to get this off my chest in full.", "url": "https://www.reddit.com/r/SuicideWatch/comments/k3xf7p/my_suicide_storyand_no_one_cared_about_anything_i/", "title": "My suicide story-And no one cared about anything I said.", "social_network": "reddit", "user": "Chulumpus", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1606748652, "permalink": "/r/SuicideWatch/comments/k3xf7p/my_suicide_storyand_no_one_cared_about_anything_i/", "nsfw": false, "first_save": 1635422316.801862, "replies_charged": false}