{"id": "t5_2qpzs_t3_2hujtp", "request": ["ecd4e9a1-2551-4506-a13c-95bd305e923c"], "text": "Okay I'm going to paraphrase a lot of things in this, this is only going to be my 1 dilemma and nothing else, no real backstory, at some point it will come. Essentially i know beyond reasonable doubt that I suffer from quite bad depression. I'm currently (para)suicidal, and want to kill myself pretty soon. That's NOT what I want. I want help -- but I do not want a councillor. I want something to take the pain away before I end it all. The main problem: I'm not going to tell my parents, nor will I let anyone. I tried calling the doctor's today when my paremts were out, but they shut st 5:30; when I get back from school. That means that essentially I could only get help with the corroboration of my (private - might be a blessing) school not to ask why I'm off for 1/2 a day, which I'm sure might be possible. I'd bring it up with my 'house' leader, Mr R, whom is very nice and understanding. My main fear of going to the doctors is if they just send me off to some do-little councillor - the last thing I want. But if I don't get help in the next 5~ days I'm going to do it, be it parasuicide or otherwise. My method would probably be this: today, I took all medications out of the cupboard that I know to be lethal. I stashed them in my computer I built - I bought a massive case and it's got lots of nooks and  crannies. My inventory is as follows:\n\nParacetamol: total ~ 10-15 GRAMS.\n\n14 Nytol tablets.\n\ntiny amounts of codeine in some paracetamol compounds (a few neurofen tabs)\n\n~~~~4 grams of aspirin total.\n\n(I have access to pff 10 grams of ibuprofen but I know it's not very lethal)\n\nApparently, doctors need a suicide attempt in order to prescribe anti-depressants. For me these are the best option as I don't want counselling, I don't want to talk to anyone etc, and I just want the pain to go away. Oh yes 1 more thing, would taking all those tablets at once be lethal? (Just fkin tell me please)\n\nTD;LR What should I do? Doctors, suicide or corroboration? (My parents wouldn't be very accepting if they found I was depressed severely) and DO DOCTORS NEED  a suicide attempt on record to prescribe anti-depressants?\n\nRegards, \"K\"\n\nNB I LIVE IN SCOTLAND AND WOULD USE THE NHS.", "url": "https://www.reddit.com/r/SuicideWatch/comments/2hujtp/14_and_need_help/", "title": "14 and need help!", "social_network": "reddit", "user": "ineedhelp_suicidal", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1412041504, "permalink": "/r/SuicideWatch/comments/2hujtp/14_and_need_help/", "nsfw": false, "first_save": 1635427789.2295036, "replies_charged": false}