{"id": "t5_2qpzs_t3_orjhfq", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I haven't made new friends in years. This is my last year before I'm supposed to be in university, and even after being in summer camps for the last 4 weeks, I just end up alone and uncomfortable, left out and painfully obviously alone and out of place. Because I can't displace my thoughts with media feeds, I'm left to my stream of thoughts on how unbelievably lonely, wimpy, and drab my life is going to be, how incredibly degraded living conditions on Earth are for inconceivable volumes of people, how I'm slowly and exclusively failing each of my opportunities one by one, how I enjoy practically nothing, how overwhelmingly pointless \"fighting through it\" is, and perhaps most of all, how badly i hate me for all of the aforementioned and more. I struggle to go through a full hour without concluding that I should and wholly wanting to be dead.\n\nSo I figure it's probably high time to get some help before I seriously start drawing up plans, at least for my family's sake. I've done research on methods and effectiveness so I probably wouldn't get a second chance if I really went for it. Only problem is I have no idea how to go about getting help. I'm told that if I am to go to therapy, I'll have to actively work towards bettering myself. That's going to be a problem, considering that at this stage I just want to die, not be convinced to complacently stick around around and pay bills and taxes for another 60 years. Do I need a will to live to benefit from therapy? Is it worth a shot to go? Is my only option to get prescribed anti depressants? Or does my stubbornness render my only choice being choosing one way or another? Simply put, how do I get help?", "url": "https://www.reddit.com/r/SuicideWatch/comments/orjhfq/how_should_i_get_help/", "title": "How should I get help?", "social_network": "reddit", "user": "Medothelioma", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1627245564, "permalink": "/r/SuicideWatch/comments/orjhfq/how_should_i_get_help/", "nsfw": false, "first_save": 1635427118.2742574, "replies_charged": false}