{"id": "t5_2qpzs_t3_q7psbx", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "Consider this my suicide note.\n\nA year and a half ago, at the age of 16, I had a few friends. With one of these friends I had a strange relationship. I found myself very smitten with him. Eventually I asked him if he wanted to be in a relationship. He said he wasn’t really sure, that he’d been in a relationship before that was abusive and that he didn’t really know if he wanted another one.\n\nWe would go on to have some situations where he showed a sort of sexual attraction towards me as well. I won’t go into them, but at the time I thought they were advances.\n\nEventually I became desperate in trying to get into an official relationship. He rejected my advances, but at the time I didn’t think anything of it.\n\nI did a lot of creepy things. I remember specifically getting paranoid when he changed his bio on social media to something sexual-esqe. I thought he was being serious about a relationship with another person and I pressed him about it by saying I would do that with him.\n\nI remember when he had me over after that, I tried sitting next to him, and him moving away. This happened at least twice.\n\nThe most horrible event, and the apex of this situation, I believe, was when I wanted hold him while the three of us (us + the other friend) were watching a movie. I never really asked, but everyone went along with it. In short, I got a hard on and I’m pretty sure he was aware.\n\nI remember at the end I just… kept trying to contact him. He ultimately responded saying that he didn’t want to talk to me, citing a few specific incidents. A few days later the other friend found out and they both left a group chat that just the three of us were in. I panicked and tried to contact them, and eventually the other friend told me why, detailing everything above. I remember her saying that I would need to change a lot about myself. And to that, I just decided to call myself an awful person and shut myself out.\n\nI tried to contact them and apologize a couple times. They blocked me, understandably. I honestly would have too if I was in their shoes.\n\nThat happened a year and a half ago. Tonight I remembered everything and got concerned only because I thought it might come back in the future and ruin my career.\n\nI contacted the other friend tonight and tried to apologize again. They blocked me as expected.\n\nAnd now, this.\n\nI’ve acted so selfishly. I did these horrible things and up until now I’ve only considered myself. My own well being.\n\nAs I’ve written this down for the first time… I’ve realized that until now I haven’t considered the weight of my actions. How uncomfortable I made him. How terrified of me he must have felt, and must feel. It was like I was trying to forget, to protect myself from the horrible reality of the person I am.\n\nThis whole time I’ve been trying to convince them that I’ve changed, and tonight I tried again just because my own well-being was at play. Because I realized that there might be further consequences for my actions. Until now I had only thought about protecting myself. Now, for the first time, almost two years later, I’m considering what my actions did to other people.\n\nMaybe it’s because this will eventually come out and ruin me. Maybe it’s because I just want to experience sympathy and justify my behaviors one last time. Regardless, I can’t undo what I’ve done, and this story ends the same way.\n\nSee ya.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q7psbx/i_ruined_my_own_life_a_year_and_a_half_ago_theres/", "title": "I ruined my own life a year and a half ago. There’s nothing I can do to repair it, so I’m taking my own life tonight.", "social_network": "reddit", "user": "CumFunny", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1634176241, "permalink": "/r/SuicideWatch/comments/q7psbx/i_ruined_my_own_life_a_year_and_a_half_ago_theres/", "nsfw": true, "first_save": 1635425275.3576694, "replies_charged": false}