{"id": "t5_2qpzs_t3_pej89v", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "I don't really know what I'll accomplish posting here, but I just need to tell someone. I'm 30 and if you're reductive enough my life sounds fine, but I've been suicidal since I was 12. I've thought of suicide at least daily but more than hourly since then, with some nights ending with me hating myself to sleep. I've never made an attempt and I don't have plans to (besides a vague \"ideal\" way to do it).\n\nI hate my body. I hate how fat I've let it get, especially after I somehow got skinny for a good part of my 20s. Even when I was under 200 lbs, I still hated my body.. I hate how unmotivated and undisciplined I am when it comes to anything. I hate going out because I only have a few shirts that fit me well anymore and there's only so much you can do to hide yourself.\n\nI feel like a burden to everyone. I'm not the most clever person at work and I always need help with something when I can actually get some work done and I'm not just sitting on my phone. My car has been sitting unused roughly since March but the lack of driving really started around last September. I don't want to deal with getting it jumped and figuring out what to do if the fuel is bad in it. And every day I want to deal with it less because it gets worse every day, but now I'm dependent on others for rides anywhere.\n\nI see this sentiment expressed a lot on here and it's true for me too: I don't necessarily want to commit suicide, but I do wish I could just stop existing. \n\nI don't expect anyone to read all this, but if you did, thanks I guess. Time to get back to work.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pej89v/suicidal_ideation_since_i_was_12/", "title": "Suicidal ideation since I was 12", "social_network": "reddit", "user": "need-an-outlet", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 9, "down_vote": 0, "creation": 1630333801, "permalink": "/r/SuicideWatch/comments/pej89v/suicidal_ideation_since_i_was_12/", "nsfw": false, "first_save": 1635427208.3878148, "replies_charged": false}