{"id": "t5_2qpzs_t3_f96w9c", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "I don't feel like I can really empathize with people or my friends anymore, and I have reached out to closer friends about my suicidal tendencies who can only seem to agree with me on their thoughts about the world and the peak of the anthropocene which we have reached and how we feel it is \"do or die\" time for humanity, and, well, they want to die as well. Essentially I'm talking about climate change and how our efforts (as environmental science students) will be null and void, so what is the point anyway? There's also living in this society which we've created which leads to all sorts of health conflicts and for me conflicts of interest. In general I feel I would do better living in nature or on a farm – not because I want to be isolated but because I have an addictive/materialistic personality and I find all of my bad traits are brought to the surface when I'm trying to integrate myself into this idea of what I know people would like me to be which is just perfect across the board.\n\nBesides that, I just feel relatively empty. I don't really laugh or smile anymore, and when I look in the mirror I'm disgusted with my appearance. I feel like I look terrifying and sort of empty, like a skeleton with all the meat but without the expressiveness that makes humans approachable. The other day a Mom grabbed her kid when I was walking down the street because she probably perceived me as some kind of danger.\n\nShe wouldn't be wrong to think that either. Not that I would do anything or have a reason to cause harm, but I often times feel a pent up rage inside of me that tempts me to do things that I wouldn't do otherwise. To hurt people because I feel hurt and rejected constantly by the people around me including my own family. My mother is about the only person who I felt truly cared about me until I opened up to her more about my issues and it lead to her becoming extremely judgmental (probably because she became so worried, which is the positive yet negative silver-lining of it all). My parents in general are just very childish and ridden with their own problems which I was aware of even from a very young age. I was always a good child and tiptoed around my father because he has an extremely explosive personality. I didn't have much guidance when I was young either nor many friends, and the friends that I did have took advantage of the fact that I had money but only because I initiated these kinds of transactional friendships where I never felt my \"self\" was enough. I always had more to give. Although I've reached a point now where I am not so self-sacrificing, at least with friends. If anything I'm a bit more blunt/don't give a fuck attitude about it all.\n\nAnd now I don't even know why I'm in school anymore. My dad lost his job this Winter so I am in constant anxiety when it comes to finances and although I am the youngest of the family I'm the only one who is capable of keeping everyone grounded emotionally (it seems) and I feel that I will have to take care of everyone. My mother doesn't have a job and neither does my father. My father is an alcoholic and my mother has been having an affair since I was a little child (which I'm not that mad about honestly, it just points to her inability to deal with adult situations/decisions imo). My oldest brother is schizoaffective and my other brother who is in the middle can't find a job because he picked a bad degree in regards to finding jobs.\n\nSo I'm kinda just here like, well I gotta do something to make sure everyone is taken care of but why am I here otherwise? I always thought if I was in a relationship again I would be driven to live for the other person, but not for myself. My previous ex was highly suicidal and that's part of the reason why I stayed with him. At one point he threatened to throw himself off the balcony of an apartment we were staying at while shit-faced, which is when I drew the line. And it's weird because I have empowering moments like that, like where I was able to get out of the relationship and move on with no tears, but for every \"good\" peak like that things seem to just stay the same and I just don't find joy in things like I used to. I used to love to draw as a child and was quite good at it and thought I'd go to art school and do animation or something crazy like that, and I love to sing and dance but I feel even art has become something where I have to do it perfectly or I'm not motivated at all. Smoking weed was good for a time as it provided me with instant gratification but now I just become really paranoid because I know I'm not doing my schoolwork and I feel like a piece of shit for it (I have one more year of university after this semester).\n\nAlso going back to the title of the post, I have some really bad coping mechanisms that make me hate myself because I am extremely vulgar and hurtful online in communities where I shouldn't be, and I won't elaborate on it any further than that. I also have a tendency to be fake in social settings and just very non-genuine and psychoanalytical. I can read micro-expressions well and I tend to look people in the eye which seems to freak them out.\n\nI also have trouble getting a good night's sleep. I wake up but I don't feel rested. I've been doing this technique called mewing for the past 8 months and I've become so compulsive about it that I avoid people because I don't want to open my mouth to speak (not that I have anything to say anyway or an interest to converse). Pretty much the only thing that has been keeping me going is exercising but I've become pretty weak the past few days and can't seem to run as much as I used to.\n\nI also procrastinate to the point where I feel extremely unprepared in my classes and am essentially just trying to scrape by because I don't see the point of getting my degree at all when I will probably just move to some location to work on a farm for the rest of my days in relative solitude, hopefully going on lots of walks through nature, taking care of myself, and doing shrooms or something while mitigating my carbon footprint as much as I can. Travel would be nice too but unlikely.\n\nI am trying to motivate myself more tonight instead of getting in the suicidal thought rut. So for example I told myself if I can get all of my work done tonight I'll allow myself to start producing some music or using a synthesizer or something. Singing has been the recent thing that makes me feel more human again so I thought making some music would be fun. We'll see how it goes.\n\nMy close friend from home wants to do shrooms in about a week, though, which I've never done. She has dealt with depression all of her life and is someone who I feel I can trust and we don't sugarcoat things around each other which I like, but she's not like other friends where when I come to her with my own emotions she just ends up relating but not offering advice. She has been through a lot and tries to keep me on the right path it seems.\n\nI can't even cry about how I feel because every time the negative feelings well up it's like they get plugged inside of me or packaged. Like my brain is just accustomed to rejecting my own sadness because it has no use when I have all this work to do. I just feel tired and I feel done, and if no one would care if I was gone I would be gone already. Probably in some kind of relaxing fashion at least, but I have fantasized about more morbid deaths like stepping in front of a speeding metro or train. I like the idea of just exploding into a million pieces.\n\nI try to be resentful of people around me for not noticing my condition, but I don't really reach out often because I don't know many people that well at my university, and I tend to put on a happy face whenever I can (which is usually when drunk or high). Anyway my main point was I don't feel I can be resentful of not receiving help out of the blue (which, you can see that this is a weird thought to have to begin with)  because it seems like a lot of people around me are depressed as well. I feel like I can see it and even smell it, especially when I walk into some of my friends' rooms and it smells and looks like a shit tornado blew through (I won't disclose my university though for fear of being expelled).\n\nIn general I feel very vain as well and stupid, and just disconnected from the world as least from a sociopolitical standpoint. My memory has become terrible and I've begun to lose important things. My friend told me what to get for a curry she was making us the other day and as soon as she had told me what to get I had to ask her to tell me again because I didn't register it. I remember confirming what ingredients she needed right after she told me and then having to ask her again. It really is like I'm not there when people talk to me, I just generate the appropriate response but my mind is elsewhere. I'm not even sure where I am or what I'm thinking about. Usually it's about my posture since I've become pretty obsessive about it and I suspect I may be obsessive/compulsive.\n\nI just had some more coffee and I'm going to study for the rest of the night. I'm trying to make life easier in other ways so that no matter what I can make it to class without worrying about stupid stuff like fixing my hair, wearing the right clothes that are comfortable and stylish etc. So I shaved my head yesterday and then my entire body today and I have a tendency to eat a lot when I'm stressed so I'll do intermittent fasting if I can't make it to the gym anymore. I'm really starting to hate the feeling of being in my own body so I'd like to lose weight to the point of being very thin without compromising my health. I have a big problem with my appearance and I'm never satisfied so if I ever move \"backwards\" it really becomes an issue where I can't focus on anything else but improving my appearance. I grew up as a pretty ugly/fat child and have always been very self conscious. I feel I had been looking much better until recently but even when people reach out to me who I think are sexually interested in me I have a tendency to reject them with my body language or just not pursue them because I feel they are not on my level and I feel bad about this because I'm rejecting them on a physical basis and not for who they are. But then I think they're only reaching out for me because I've worked on myself and my body and present myself in a particular way that I know people will like. But the people who I want never end up interested. I've done a few stints on Grindr but I try to stay off the app because I don't like the idea of fast-food sex with strangers and it always becomes an issue of people liking my body but when I show my face they block me. I know I look really young for my age and I'm trying to change that but it's hard. My ex boyfriend was actually 45 (I was 21 when we were together and I'm 22 now –– my mom says I look like a boy though so like 15 or 16) and I confirmed that he was a pedophile but I still felt I wasn't good enough for him because I wasn't his ideal age (14). I try to sympathize with him though because he went through a traumatic experience when he was young which he claims is his reason for having the desires that he does. I was aware of my sexuality from a really young age (I believe 5 or 6 if that is possible) and tried to do all sorts of things. Sometimes I wonder if I was touched but don't remember. I'm certain that I've repressed some trauma but I literally can't remember what it was but it was something that happened more recently. I know it wasn't anything super dramatic like abuse but I just remember not wanting to remember it and then I forgot what it was. It sounds kind of funny when I put it like that, though. In general though I'm drawn by taboo as one of my bad coping mechanisms. I've had all sorts of submissive and dominant fantasies that defy societal norms and would be illegal if I acted on them.\n\nI'm going to try to go back to therapy, though, but I'd rather allocate the money to a myofunctional treatment that will allow me to swallow properly and have better breathing so that I can hopefully sleep better at night and improve the way that I look. My mom doesn't see it as a necessary cost though and isn't sure that she'll let me do it which makes me upset considering part of the reason I may need the treatment is because I grew up a mouth-breather because my parents are smokers and I remember as a child not wanting to breathe with my nose because the smoke smelled bad. I feel like if I could improve my facial appearance and health in that way I may be able to heal some of my emotional issues as well. Or be perceived as more attractive and enter a relationship with someone who I'm actually attracted to, and in that way be driven to live even if it's for a more superficial ideal. It is $2500 for the treatment whereas therapy is $90 a session but it is covered for 12 treatments I think so I may as well do it whereas the treatment is not covered, but I find it crucial to ending my obsessive thoughts over my facial appearance because it will force my face to grow correctly as much as is possible now.\n\nBut if anyone can make sense of my thoughts I would appreciate it. I don't know how I became to be such a shell of my former self, but I'm starting to think there wasn't much there to begin with. Also I'm not looking to be validated more so analyzed.", "url": "https://www.reddit.com/r/SuicideWatch/comments/f96w9c/i_feel_im_a_bad_person_at_my_core_and_am_no/", "title": "I feel I'm a bad person at my core and am no longer driven to live", "social_network": "reddit", "user": "OddSoft", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1582617242, "permalink": "/r/SuicideWatch/comments/f96w9c/i_feel_im_a_bad_person_at_my_core_and_am_no/", "nsfw": false, "first_save": 1635428493.5136642, "replies_charged": false}