{"id": "t5_2qpzs_t3_nomg05", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "I just failed nursing school by less than half a point. My husband was hit by an 18 wheeler and can’t support my family. I can’t support them either, too anxious to get a $7 an hour job around here and my associates is worth nothing. No job, can’t stop binge eating or panic attacks even after years of therapy and medication. I can’t even make myself cook for my family or clean. I’m useless. I keep writing letters bc I’ve known kids who have lost their parents to suicide and idk any of them that ever ended up okay as adults. Most of them deep down wonder why they aren’t enough or want to die, too. I don’t want that for my kids& I’m anxious about after I die. That’s pretty much the only things keeping me in this endless hell. \n\n-ptsd \n-pots\n-bulimia/BED \n-everyone that raised me died around me\n-raped so many times\n-incest \n-multiple failed attempts since my childhood, my mom would usually cover them up and shame me or whip me\n-so much abuse\n-completely tired\n-so many plans to die, but I’m so anxious about what would happen if I failed again. The mental facility was torture last time, with shots in my butt any time I looked sad. \n-I can’t do anything right& I’m huge, always scared, always exhausted \n-I feel so bad for my kids\n-multiple therapy types, years of different medications& treatments have not worked\n-I’ve had life insurance for long enough that if I killed myself at 24 years old that money could support my kiddos\n-you’ll probably ignore this bc I’m so boring and not at all important lol", "url": "https://www.reddit.com/r/SuicideWatch/comments/nomg05/fat_failing_anxious_mom/", "title": "Fat Failing Anxious Mom", "social_network": "reddit", "user": "Raynesalot4u", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1622414309, "permalink": "/r/SuicideWatch/comments/nomg05/fat_failing_anxious_mom/", "nsfw": true, "first_save": 1635422927.5083418, "replies_charged": false}