{"id": "t5_2qpzs_t3_lj8ukb", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I've realized recently that my pain has become an inseparable part of me and part of my life. I feel like an alien that was put here by mistake. With Valentine's Day tomorrow it just makes everything so much worse, at least I can sit at home all day tomorrow so I don't have to be constantly reminded of what a hideous freak and of how lonely I am. Probably always will be. Even if I could magically feel better I don't even know if I'd want to, I'm fortunate in the fact that my life is perfectly bearable, even if it's hard sometimes. The fact remains that I just really don't care to be here anymore. To me, life and death are pretty much the same, so if life is difficult, why bother? I've tried medications, and they made me feel so horrible I couldn't handle them, they made me feel like I wasn't real, like I was dreaming. Maybe I didn't take them long enough to feel the full benefits but I would much rather be dead than feel like that for any significant stretch of time, even if they did make the \"pain\" go away. In fact, the more I think about the more I realize that in my case, there is no pain, only me. The Canadian government is deciding on whether to allow medically assisted suicide in cases of exclusively mental illness, it honestly gives me alot of hope that I could, in 5 or 6 years decide to reliably and humanely end my own life. I guess the silver lining is that if life is a lonely dissapoinment, it can at least, end.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lj8ukb/most_people_who_consider_suicide_want_to_end/", "title": "\"Most people who consider suicide want to end their pain, not their lives.\"", "social_network": "reddit", "user": "methylphenidate1", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 21, "down_vote": 0, "creation": 1613249149, "permalink": "/r/SuicideWatch/comments/lj8ukb/most_people_who_consider_suicide_want_to_end/", "nsfw": false, "first_save": 1635427130.197787, "replies_charged": false}