{"id": "t5_2qpzs_t3_dec5c4", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "\n[EDIT. OG POST BELOW]: If you somehow see this, wow. This is almost 300 days old and has no upvotes, so I’m impressed you scrolled that much. \n\nAnyways. If you’re in this tag, I’d like you to read what I’m about to say, and then my OG post from a year ago about. \nIt’s been like ~250 days and my quality of life has improved so much. I’ve grown more comfortable with my sexuality, I’ve confronted and started over with my mother, my sister is in therapy. I no longer think about the assault all that time ago, (I still fear men to a degree, being alone with older men makes me itchy). I do not cry myself to sleep, I don’t hurt myself. Things aren’t perfect, I just got hurt pretty badly working out, and I have issues with body image and weight, and anxiety over my future, but I know I can make it work. It does get better, it really does. I’ve come to terms with the fact that I’m happier by myself and have let go of the stigma that comes with being a ‘loner’, and I graduated! I have that associates and my diploma, and I’m headed to a four year to start to bachelors. Sure, maybe my funeral would still only be my mom and sister, but that’s enough for me. I am happy, even when it gets so tough. I have control of myself, of my body image and my future, instead of feeling hopeless.\nIt does get better, and if you think no one cares- I do- and someone you know does. Promise.\n\n\n————-\n\n\n\nI hate writing. I don’t want to write all this out but I can’t fucking keep it in anymore. My life is worthless, I am worthless, there is not a soul who would notice if I was dangling in a noose in the fucking dining room. No one would bat an eyelash. I do not matter. I’m 17, f, lesbian. God where do I BEGIN? Ten I started to be really sad a lot, I quit playing with friends and going to the playground, i stayed on the school steps and half-slept by the gate. At twelve I’d lost all my friends and the middle school bullying for weight and appearance began. I knew I was gay around then. That didn’t have much to do with my depression until lately though. I haven’t had any true, non-talk-behind-my-back-friends since then. My middle school years saw the onset of insomnia, and a botched spinal tap when I had seizures at 8 has left me with constant tension headache, and migraines daily. I am in constant pain. I’m too afraid to get on drugs because it’ll ruin my kidneys or make me gain weight or something. That’s just my health issues though. The bullying was hard for me and having no friends sucked, yea, but that’s life, I was depressed, i cried myself to sleep and wondered why no one liked me, i was never close to my parents Because my dad is really quiet and my mom is very narcissistic. That was okay though, I was fine. And then in 7th grade I got molested and raped at school and then it was all downhill. Any hope I had for it to even out eventually was gone. Nobody knows to this very day except for one ex of mine. Not even my mom. I drug myself home and acted normal as possible and my anxiety, fear of others, men especially, and depressed worsened a TON. I didn’t feel like I could tell anyone. I felt like I would be degraded. Who’d accept a friend or a daughter who’d been degraded and violated? So I gave up on reaching out and being optimistic. I quit crying even. I had no more tears left. I grew further from my mom, who only grew more hostile. I left school and joined an online program for ninth grade because I couldn’t take going to school anymore. The hatred, the name calling, the exclusion. It was nice to be locked in my room doing school, my depression wasn’t too much to bear if i never had to get up and get ready or let anyone see me or risk being hurt again.", "url": "https://www.reddit.com/r/SuicideWatch/comments/dec5c4/i_cant/", "title": "I cant", "social_network": "reddit", "user": "stopitgerald", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1570409259, "permalink": "/r/SuicideWatch/comments/dec5c4/i_cant/", "nsfw": false, "first_save": 1635427160.2990725, "replies_charged": false}