{"id": "t5_2qpzs_t3_pc0p3j", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "I woke up this morning feeling nothing but convinced there’s no purpose in me living, my heart was beating fast and i was nauseated too. I think this is the closest ive been to being ready to die. I felt similar level of readiness on a different morning back in 2017, and that wasn’t even the worst time in my life yet. My bed is facing directly to my closet. Instead of getting up to go for it. I imagined myself holding the gun and squeezing. I thought about the freedom i was feeling and boy did that shit feel good. It felt right. I imagined being able to see and hear without being able to move, after i shot myself in the head. Being unresponsive. To anyone and anything. I also thought about it as a shortcut to being able to finally meet God. I just want to feel his love and compassion as soon as i can. He’s probably the only one that can fully understand how im feeling and i just wanna hear what he has to say.\n\nAnyway i kept figuratively pulling the trigger and started tearing up. At times i’m not sure if ill ever be able to find consistent happiness. I thought about my mom and my girlfriend, and how much turmoil they would be in after figuring out i have killed myself. Started crying some more... I love them both so much. \n\nI thought back to how i was feeling in 2017, that morning. I reminded myself of how convinced i was in that moment that suicide was the right decision. But i didn’t do it. I just went to work and started feeling better a few days later. \n\nThis morning was the same. Im at work sitting in this FedEx truck. I drank me some coffee, and im sitting here typing this.\n\nDidn’t go to my closet.\n\nTL:DR - Felt convinced i was ready to go this morning. Didn’t do it. Now im at work.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pc0p3j/didnt_touch_my_gun_in_the_closet/", "title": "Didn’t touch my gun in the closet.", "social_network": "reddit", "user": "ongod7", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1629988299, "permalink": "/r/SuicideWatch/comments/pc0p3j/didnt_touch_my_gun_in_the_closet/", "nsfw": false, "first_save": 1635423002.368435, "replies_charged": false}