{"id": "t5_2qpzs_t3_ihdsq7", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "BDD/Insomnia has ruined my life. I literally stopped going outside and doing the things I like to do (working, art, hanging out with friends). Depression hit hard and I literally did nothing all day. I used to love reading and writing and watching comedy shows. Now, I do NOT get enjoyment out of much of anything.  I went 2-3 weeks without sleep and I lost my beauty.  I'm only 21. I went from an attractive woman to an ugly duckling. My health has depleted significantly and I did not listen to medical professionals. Why? Because my internal bully told me that I wasn't good enough or deserving enough to do anything and that I should just drop dead. We live in such a superficial society that is obsessed with appearance. I became obsessed with appearance. Unfortunately, severe insomnia and depression accompanied this and I did NOTHING to improve myself. Men are no longer kind to me. In fact, one dude was super rude to me. The only reason I am alive is because of my mother. If it weren't for her, I'd be dead by now. Also, internet addiction and having no purpose in my life basically sucks too. \n\nGuys that are not attractive complain about it but OMFG it is harder for a woman to be unattractive imo. This disorder tricks you into thinking you are ugly and makes you become ugly because it can  stop you from enjoying life. So stupid. I refused group therapy because I thought i was too ugly. BDD sucks.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ihdsq7/might_commit_suicide_because_of/", "title": "Might Commit Suicide because of Insomnia/Agoraphobia/Body Dysmorphia", "social_network": "reddit", "user": "MoodyBuzzKill", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1598499364, "permalink": "/r/SuicideWatch/comments/ihdsq7/might_commit_suicide_because_of/", "nsfw": false, "first_save": 1635426520.520603, "replies_charged": false}