{"id": "t5_2qpzs_t3_lab0lr", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I’m just tired. This past year has been the worst of my life and I feel bad for saying that because I know a lot of people have gone through worse than me. I can’t remember a time when I was truly happy. Maybe if I really tried it would be when I was like, five years old or something like that. For as long as I can remember, people I’ve just been shit to me. My parents, my supposed friends, siblings, everyone. I was only ever praised in school for being well, not myself. Teachers praised me for being quiet and obedient and always doing my work but I only did that because I was scared to be myself. At home I was constantly told it was too loud and annoying I will get fixated on things (I later found out I had OCD and anxiety and a whole host of other things). Now I’ve been diagnosed with anxiety and depression and I’ve been trying to get better and I tried to take medication but it’s not working. I don’t wanna be on the medication anymore. I used to be able to drink alcohol to help me cope. I know it’s not a good coping mechanism but it’s the one I had and now I can’t even drink with this medication. I care so little about myself now that I probably would drink if I didn’t live with my partner, who would almost assuredly find out and put a stop to it. I would also spend money on things I didn’t need or eat excessively to feel better but now I’m broke and I can’t afford food (my partner pays for everything now and I feel like shit about that too, I can’t hold a fucking job) and I can’t afford to spend money on dumb shit that would make me happy for like, 3 whole seconds before I felt like crap again. All I do is lay here and feel miserable and I’m tired of it. I’m supposed to call my psychiatrist if the medicine makes me suicidal but I don’t feel like I’m more or less suicidal than I was before I started the medicine so, what the hell am I supposed to do? I’m tired. I’m just tired. I’m tired of being rejected and emotionally abused by everyone around me. And the emotional abuse led to other kinds of abuse and relationships with people who took advantage of me. I put myself in dangerous situations where people took advantage of me sexually and I hate myself for it. I hate my body, I hate my personality, and I hate that I just can’t seem to get better. I don’t even know what the point is. I’m never going to get better. I try things and they don’t work. I just wish I knew how to end everything without causing extreme pain to myself or causing emotional pain to the few people who actually care about me. I mostly worry about my partner. We live together and I would hate for them to come home and have to deal with the aftermath of what I’ve done. I think that that is the main thing that’s stopping me. I just wish I would fall asleep and never wake up", "url": "https://www.reddit.com/r/SuicideWatch/comments/lab0lr/i_want_to_end_it/", "title": "I want to end it.", "social_network": "reddit", "user": "Medium-Thought8260", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1612206034, "permalink": "/r/SuicideWatch/comments/lab0lr/i_want_to_end_it/", "nsfw": false, "first_save": 1635428141.2588162, "replies_charged": false}