{"id": "t5_2qpzs_t3_ocvoao", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "I just wish I could take all the hate I have for myself and wishing I was dead and put it into a different compartment in my brain…channel it towards something useful but still fueled by that hate…like…What if all of us depressed people United and fought for freedom from the system. Isn’t that what’s really doing this? We are conditioned to believe we must be a certain way and achieve certain things, have money and just work eat sleep repeat. Pretend we are happy…hold in our feelings. Be someone we’re not…What if we all came together and fought this???? We can…think about if every one of us “mentally ill” people fought the wardens that made this hell for people like us? I believe depression is our spirits mourning for freedom. Our spirits have a heightened awareness of the world around us and we just can’t be truly happy in this place as it is. We are oppressed and have been continuously…they say happiness is internal and to not rely on the external but sometimes the external wins. What if we really just have been through so much unnecessary evil that all the meditation in the world couldn’t fix it? We can’t always rely on a “spirit guide” or someone else to give us the answers; how did they get their answers? What if we decided to fight back… \n\nwhat if we had the energy to even act on such a feat? Because it sounds cool but my motivation is so shot even if I knew it was possible; could I? \n\nNah…\n\nWhat if.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ocvoao/what_if/", "title": "What if…", "social_network": "reddit", "user": "Mooglefartss", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1625308858, "permalink": "/r/SuicideWatch/comments/ocvoao/what_if/", "nsfw": false, "first_save": 1635426783.130541, "replies_charged": false}