{"id": "t5_2qpzs_t3_e3bbg6", "request": ["9cb7ef4e-af9d-4403-b84a-be5dd3f5e75c", "e79a79ca-6f5c-44ca-b1e4-309a4afa83c2"], "text": "I spend a lot of time thinking about what the reason is for being here and being alive. It usually starts when I’m up late (due to my anxiety) and I start to think about my financial situation. I’m by no means in trouble. I’ve got stable income, I can pay my bills, maybe save a little, and sometimes I get in trouble but I always pull through. \n\nI’ve got a great husband and he’s the most enriching part of my life. It’s so fun when we’re together. He’s a person who knows my brain and my soul so well. \n\nMy family is great. I have wonderful relationships with them and with my in laws. They’re all accepting and supportive of whatever we may go through. \n\nThat’s where I get stuck. I have these nights like tonight where I start to think: but what else is there? I have to somehow make a big enough impact on this world for some reason until I’m old enough to sit and enjoy old age in retirement. Then I just die? Maybe if I have children I can enjoy watching them grow and have children of their own. But it’s just so pointless-seeming if we know it’s all going to end someday anyway. \n\nWhy stick around and play this game of making money and pretending that jobs are supposed to give us some kind of “purpose” in life. I don’t like thinking that my purpose is to give massage. I love what I do and it makes me feel good knowing that I’m helping someone in pain, but what else? I’m just on Earth to be in a loving relationship, make people feel good through massage, have kids, and die? It just seems like I’m missing some major point that everyone else either all gets or don’t even see. \n\nI’ve tried ACT therapy which focuses on living a life of values rather than goals. IE: choosing to be a loving partner everyday instead of a goal of getting married and doing things that couples do just because. \n\nWhen I focus on that and live my life through my values of being a good wife, daughter, sister, and massage therapist, I feel really good and everything is peaceful. But is there no final boss battle? It’s just some crazy ride we’re trying to maneuver? Humanity is so clunky and it just seems so silly that everyone falls for this trick of “getting money so you’re successful”. So what if you’re successful? You can’t take it with you when you die!\n\nTLDR I’m looking for commiseration about how much of a phony and random shit show life is like.", "url": "https://www.reddit.com/r/SuicideWatch/comments/e3bbg6/what_is_the_reason_for_all_of_this/", "title": "What is the reason for all of this?", "social_network": "reddit", "user": "Kayteal93", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1575011255, "permalink": "/r/SuicideWatch/comments/e3bbg6/what_is_the_reason_for_all_of_this/", "nsfw": false, "first_save": 1635425160.9526305, "replies_charged": false}