{"id": "t5_2qpzs_t3_ogus3i", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7", "22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "Rambling combination of previous comments seeking attention, answers, pity...Parents were married 1 year, then dad died of brain tumor..I'm a golden child. When I was 5, mom and I were walking down the street, a man lept off a 30story hotel and swan dived into the pavement nearly landing on us..at 6 my mom got terrible breast cancer. I lived with my rich grandparents. my grandfather had remarried years before i was born and thus my friendly yet very day drunk grandma was my step-grandma. She never had children due to a condition requiring hysterectomy. Allthough well meaning..she would spoil me. In fact, I was spoiled rotten..i remember her giving me \"presents\" nearly every day. In fact, she would hide them in their walk in closet. Which I would subsequently find/steal. This more than likely contributed to my shoplifting in adolescence.. she would give me gifts because my mom was sick..my mom and I witnessed a man die by suicide when I like 5 or 6.. we were walking down the street in SlC and he just fuckin splattered in front of us,, off a 30story hotel...his head must hurt mommy.. i don't exactly recall it.. so after my moms cancer and never remarrying.. I was fucked up as a teen.. I went to a military school from age 12 to 18.. then things stabilized all because i had found a good career I excelled at. Then tragedy struck... fast forward to nowish..\n\n After 8 years of caring for my mom, no other kin..well. the local nursing home home with the help of a crooked doc duped my mom into their \"care\".. she was only supposed to stay there 1 night..and well, I felt some relief because I thought well atleast she can be better taken care of...afterall, how can I,  her 30 year old son, how can I really be of help? Except to be bankrupted financially and emotionally and to complete fulfillment of the jung'\ndevouring mother archetype..so I went out and found a gf..the first I'd had in years...not counting the failed engagement to my mom's nurse..which had subsequently led to nervous breakdown..wow..dodged a bullet there...so here I am, lovely couple, playing house..she thinks she's done well, got a great guy, only a little baggage, just visit his mom at the nursing home...boy...was she wrong! We were supposed to go to Paris, etc..here's how things ended up shaking out..spoiler alert:total misery.. \n \nTurned out the nursing home, instead of caring for my paraplegic mom, decided instead to take an active interest in killing her off..because after 6 months of \"care\" they then file a Lien on the home...she lost about so much weight. She got soo much sicker.. it was so sad. They straight up wouldn't feed her. They just locked her up in a little room at the end of the hall and forget about her, basically just left her for dead...monstrous. she never went outside for the 7 months she was there. Not once.. the only doctoring that was done..was doctoring her medical record to appear as if they weren't heinous criminals..they tried to kill her off with antibiotics, she got thrush, ring worm, ecoli, cdiff, there was much more more but frankly I've tried to repress it all as a much as possible...I would have to ask my, now, exgf for the gory details..considering her position in life became sorting through the mountains of papers, while her dreamboat hubby to be , withdrew, and very unfortunately  took advantage of her sweet kindneess. preoccupied with obsession of hanging himself...but she won't talk to me..\n \n \n \n.and when it became clear that my mom would surely die if she remained there.. my gf orchestrated her coming home...one of the tipping points was when visiting my mom, I discovered the her oxygen nasal candula had been raised to 100% o2. And had been for a week+... naw, mom your bloody nose may have not been merely from the \"air being dry\"...i swear it messed up her mind too.. \n \nso we got her back home...afterall, why not? Considering my life had already been throughly destroyed years ago. Plus we had already spent nearly everything we had in handicap modifications to our home.. thus making it in effect, a nursing home..even perfect strangers, who were potential clients of my home business seemed to think so..when they would remark, \"it would be great to do work here with you..but it..is this a nursing home?..  \n \nAnd then life became a genuine living hell.. the prison was complete...\n \n \nBelieve me, the worst is ALMOST having it all...within reach..just close enough to touch it.. a happy healthy successful life filled with productivity, dinner parties, and total sexual satisfaction. Not just \"keeping up with Jones'\" white picket fence nuclear family bullshit, I'm talking about a unique partnership in life sculpted into a fine masterpiece filled with security, unity, growth, curiosity, special moments, tenderness, accomplishments, inside jokes, multiple squirting ogasms, laughter, charity, compassion, and eating big dinners late into the night. The works.. right there..so close...we're talkin'...Making out while Finger blasting her..on a sail boat..while we watch the sunset over the carribean ocean.. shit like that.. \n \nAlmost having this ^..grasping at it.. while drowning, being sunk down into a bottom less mire of quicksand and personal tragedy, the weight of my mother's terminal Illness, cancer and paraplegia. Having all of that..just able to touch it..and watching it all fade to black.. extinguished into a mushroom cloud of sadness..and even worse...seeing the only woman whom you really loved. Best sex ever.. (and i should know, remember when u used to be popular and successful? Ladies liked you...) Seeing her attached at the hip, cuz she's like the best Lil wifey ever..and seeing her drown with you.. along with her youth and hopes and dreams, cuz remember she's 6 years younger and quit college to help you and your mom..\n \n.. \n \nook care of my mom's paraplegia/terminal cancer while i was age 24-34...put brakes on good career in hollywood..no siblings...for thr last 3 years, had a wonderful fiance...she dropped out of uni to help my sick ma and me..,she and i were so trapped, living in my moms basement that i had to move back into...having such great things just outside your reach is torture, agony...i built a high quality business, now attached to the home..world class.but was simply unable to get in biz..clients would remark, that it is a nursing home etc..i dont blame them..they didnt 'get it'..seeing how miserable my girl was, wasting our lives and future..it was hopeless..i didnt know if it would last 5-10 more years...i withdrew..and regressed..after carying the burden of my mom's domestic care (she had cna/home healthcare...most were horrible...stole..hit my car..hurt my mom..etc.) for 8 years alone...well,,when i saw even a little respite....i took advantage of my lover's kindness.. her soul and dreams were actively being crushed..i was already dead inside...she and i never had a single fight in 3 years..except \nto withdraw and isolate myself..i couldnt bare the idea of losing the only woman who ever truly loved me... \n \nnowadays...i wonder how much my mom really loved me..if she had any idea how damaged i am now...and so one day, i broke up with my gf..i had a bizarre moodswing and told her fckyou, we were supposed to be working on the biz, nothing's been done.. get out! (internally, it was..*wtf* i love you. i cant see ruined by this..its not fair at all! run! save yourself!!) she was crushed...she left..left half of her stuff....sent me a frustrated breakemail, said she would never talk again....6m later my mom died..on my birthday..two days after xmas...and my dog was taken by an evil nurse..now my entire family is dead.. but then....i got a bill in the mail from medicare for 700k saying that because i co own the house...i am responsible \n \n..i had land in az..it was foreclosed on by the hoa over a bogus $600 debt..it had no mortgage. neither does my home..land had $350k paid equity..i was told to send a cashiers check to the sheriffs office that sold it for 40k..they would not take a wire..,i made a pact with myself several years back..(if you lose this land you inherited from grandpa, that is too much shame..off yourself.).and so..i..not wanting ro die, i used that as my primary motivator to even be able to go to the bank/post office..i had the money for weeks even...but just crippling self sabotage...they told me to. send it fedex...i did....fed ex 'lost ' the envelope.with the 40k cashiers check…there’s more..but who cares?\n\n\n\n\n\n\n\n\ntaking care of my mom with cancer/paraplegia from age 24-34...ive altruistically robbed myself of the coping skills and milestones enjoyed my peers.she died..i have zero family...and lovely fiance i had..she gone..nowhere to go but down .\n\n\n\ncan confirm. took care of my mom's paraplegia/terminal cancer while i was age 24-34...put brakes on good career in hollywood..no siblings...for thr last 3 years, had a wonderful fiance...she dropped out of uni to help my sick ma and me..,she and i were so trapped, living in my moms basement that i had to move back into...having such great things just outside your reach is torture, agony...i built a high quality business, now attached to the home..world class.but was simply unable to get in biz..clients would remark, that it is a nursing home etc..i dont blame them..they didnt 'get it'..seeing how miserable my girl was, wasting our lives and future..it was hopeless..i didnt know if it would last 5-10 more years...i withdrew..and regressed..after carying the burden of my mom's domestic care (she had cna/home healthcare...most were horrible...stole..hit my car..hurt my mom..etc.) for 8 years alone...well,,when i saw even a little respite....i took advantage of my lover's kindness.. her soul and dreams were actively being crushed..i was already dead inside...she and i never had a single fight in 3 years..except \nto withdraw and isolate myself..i couldnt bare the idea of losing the only woman who ever truly loved me... \n\nnowadays...i wonder how much my mom really loved me..if she had any idea how damaged i am now...and so one day, i broke up with my gf..i had a bizarre moodswing and told her fckyou, we were supposed to be working on the biz, nothing's been done.. get out! (internally, it was..*wtf* i love you. i cant see ruined by this..its not fair at all! run! save yourself!!) she was crushed...she left..left half of her stuff....sent me a frustrated breakemail, said she would never talk again....6m later my mom died..on my birthday..two days after xmas...and my dog was taken by an evil nurse..now my entire family is dead.. but then....i got a bill in the mail from medicare for 700k saying that because i co own the house...i am responsible \n\n..i had land in az..it was foreclosed on by the hoa over a bogus $600 debt..it had no mortgage. neither does my home..land had $350k paid equity..i was told to send a cashiers check to the sheriffs office that sold it for 40k..they would not take a wire..,i made a pact with myself several years back..(if you lose this land you inherited from grandpa, that is too much shame..off yourself.).and so..i..not wanting ro die, i used that as my primary motivator to even be able to go to the bank/post office..i had the money for weeks even...but just crippling self sabotage...they told me to. send it fedex...i did....fed ex 'lost ' the envelope.with the 40k cashiers check.,..it arrived 2 day late..,i lost the land and my marbles...whats worse...my neighbor there was gonna buy it from me for $465k...that was only chance of getting my perfect little wifey back...i am such a..ruined man.,..if i have no family..no job...and no house.or dignity....what else is left to lose? i am not sad..to be sad..would require having feelings...we are wayyyyy past that point now...I met the love of my life. I was so happy. So was she...but my mom was terminally ill with paraplegia and cancer. And I had been living in her basement 8 years..since age 24, not because I'm a loser.. my whole family is dead otherwise..and this love of mine she helped so much. But I couldn't handle it...if couldn't handle seeing how miserable it made her and myself.. and how much we dreamed of a future together. I had never even considered marrying another woman, had dozens of gfs over the years..So I broke up with her.. never saw her again...my mom died. I have nobody. I'm 34. I'm so sad. So fuckin miserably sad...of course she went running screaming, anything would be better compared to the nonstop tragedy of that house...I never thought 💭 to myself \"that bitch\" etc. When we were together. We never even had 1 real argument. And now she's gone...she ghosted me.. I'm not that bad, I'm a great guy.m.wtf. I am so so so hurt...really don't see how I can recover from this one \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhen I was 24..I came home from a being best man at a wedding/vacation. As soon as I walked in the door.. My mom told me should had just woke from a nap and ..hmm. it's weird but.. couldn't feel her legs. She had an undiagnosed tumor on her spine, the breast cancer she had when I was a child..it returned.. metastisized. That was the day my mom and my life was totally fckn ruined... Being her only child..and the fact that my father had died when I was 6...also of cancer.. This meant I had to move back into her basement..there i stayed for 10 years..as \"caregiver\"..she died last year on my birthday.. Not sure what else to say.. except that is fckd me up immeasurably.. There was one shining 🌟 moment of happiness..3 years ago I met the sweetest gf ever, an angel.. she helped me and my mom immensely.. But soon.. I could see how it quickly affected her in very sad ways.. I became very distant. And seeing this woman I loved..and was going to marry..seeing her so broken...I couldnt handle iy... .and there was a few times..I damn near asked for a early checkout via shotgun mouthwash...... I just couldn't handle it all.. couldn't handle this woman I loved..being reduced to nothing.. she was 25, she had quit school to help my mom..😭😭 I became distant. Truly depressed.. Having no respite for 8 years.. I was so relieved..but also was burned out . This all evolved into me taking her for granted at times", "url": "https://www.reddit.com/r/SuicideWatch/comments/ogus3i/my_very_fucked_up_story_hopefully_coming_to_end/", "title": "My very fucked up story. Hopefully coming to end sooner than later..34M", "social_network": "reddit", "user": "InfraredStigmata", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1625834625, "permalink": "/r/SuicideWatch/comments/ogus3i/my_very_fucked_up_story_hopefully_coming_to_end/", "nsfw": false, "first_save": 1635423053.3420107, "replies_charged": false}