{"id": "t5_2qpzs_t3_q2masz", "request": ["4162f604-29a0-4041-a85b-c249e1ca13f8", "4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I have schizophrenia and I think I made it worse by doing cocaine for a week and half everyday. My chest hurts. I don’t want sex anymore. I’m trying to lose weight (starving myself) in hopes when I’m skinny I’ll get more opportunities. BUT THIS GETS SO LONELY. I don’t have any friends since I blocked most of them. They were bad and stole from me. I’ve had a bad week. I got raped, i almost kidnapped(I jumped out the car) I think I’m talking to a catfish online but they never respond back until a day later and I’m in love with this person. He says he’s a famous rapper that died. Since I’m schizophrenia I can talk to him through the tv. My heart is broken. I don’t think the pills I have will kill me. I have klonopin, antipsychotic, mood stabilizers, and something for my pseudo tumor (living hell, I see black dot faces…long story) I’m a drug addict and I’m so unhappy. I’ve been to rehab for three or four years in and out. Nothing helps. My friend (boyfriend? Idk) is coming to pick me up. He lives 5 minutes Away but he said thirty min. I hate the shadiness. I wanna kill myself. I don’t even want sex anymore and I’m sure that’s why he’s coming to pick me up. But he’s married. Ouch my heart hurts. I’m suffering alone. I don’t know how to kill myself. I think my best bet is jump from the roof of a building.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q2masz/depressed_28_year_old_girl/", "title": "depressed 28 year old girl", "social_network": "reddit", "user": "Whatkindacatisthis", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1633532610, "permalink": "/r/SuicideWatch/comments/q2masz/depressed_28_year_old_girl/", "nsfw": true, "first_save": 1635422886.240274, "replies_charged": false}