{"id": "t5_2qpzs_t3_loyr4u", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "I don’t even know where to start or if this is gonna be coherent, but here goes\n\nI’m 21 with inattentive adhd, anxiety, depression, and i’m a trans guy (2.5 years on T, and post op top surgery, no desire for anything else). My parents are amazing, i have friends who i love and cherish, i have a decent low stress job that pays more than minimum wage, and yet, despite all of this, i hate living. \n\nI was born 3.5 months premature (likely what caused my adhd) but luckily no debilitating physical issues. I survived through my heart stopping multiple times a day, and surgery to fix it when i was an infant. I wish i didn’t survive.\n\nI’m so tired and sad and i don’t even know why, i hate myself so fucking much, i feel like a burden to everybody i care about, despite technically being post-transition i still see a fucked up looking girl while i pass 100% as male in society. I wish i saw what everyone else saw.\n\nI feel like all the good i have was completely wasted on me. Wasted on someone who knew he was going to kill himself when he was 8 years old. Someone who always knew he was gonna throw it all away eventually. I wish i suffered more so i didn’t feel this fucking guilty for feeling this shitty.\n\nI love my parents, i love my friends, theyre the only reasons why i haven’t died yet. It would destroy them. I can’t do that to them. But i want to so so bad, i just.. i feel like i wasn’t built for life. My adhd makes me feel so stupid and sensitive and lazy and incompetent, my anxiety tells me i’m an idiot, my depression tells me i’m worthless, and they have all been telling me this my entire fucking life. Suicide had never been an “if”, always a “when”.\n\nOn the outside, everything’s amazing\nThe problem is my brain, always has been, and i feel.. so fucking bad about it\n\nI can’t stop thinking about just tying a belt tight around my neck to suffocate me in my sleep, or wandering in traffic to make it look like an accident, or going out and putting myself in dangerous situations to get myself hurt or traumatized \n\nI’m so tired all the time despite being in therapy and on meds and trying so hard to appreciate what i have but i just feel trapped here\nAll the good i have is trapping me here when i should have fucking died as an infant\nLosing a premie infant is hard but it can’t be as hard as losing a whole adult child who you raised and grew to love, right?\n\nI’m sorry im sorry im sorry", "url": "https://www.reddit.com/r/SuicideWatch/comments/loyr4u/howdy_not_in_immediate_danger_just_need_to_get_my/", "title": "Howdy, not in immediate danger, just need to get my thoughts out", "social_network": "reddit", "user": "ruination-rumination", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1613919651, "permalink": "/r/SuicideWatch/comments/loyr4u/howdy_not_in_immediate_danger_just_need_to_get_my/", "nsfw": false, "first_save": 1635425555.7830155, "replies_charged": false}