{"id": "t5_2qpzs_t3_c9pyyl", "request": ["5e2030fb-1f0d-4c7d-819d-8770b2522e87"], "text": "To cut an incredibly long story short, I've been dealing with depression, self harm and suicidal tendencies for the past 7 years. I've been stuck between dysthemic to adamantly suicidal and it's been an incredibly exhausting push through all of it. I've always been eager to find ways to help myself and I've always strived towards recovery. I've been through some really fucked up shit with my ex girlfriend of 5 years on and off. She suffers from bipolar and refuses to get proper treatment. I've done everything I can to help her. I've burnt myself out trying to keep her safe and now she doesn't want anything to do with me. My friends dont want anything to do with me because they hate her for the hell shes raised amongst all of us. My family are fed up with me and extremely hurt by my constant misery. They love me very much and have supported me with all their might for my entire 21 years of being alive but theres no being on earth that can help me. I cant put them through this shit anymore. Usually when I have a suicidal crisis, it's a short period of time from an event or failure to function and the suicidal thoughts come from a sort of impulse. I still had the attitude that I want to carry on and recover. This time, nothing major happened. I just felt it build up over time and now all my will to live is gone. I went home early for uni break and eventually my spirit died. I've been here for 6 weeks now. \n\nI'm currently in a psychiatric ward. I like it here because it feels like I dont have to face the world. They're wanting to discharge me in less than 2 days though and I'm absolutely not ready. I cant go back to uni where im completely alone in a different city surrounded by cruel memories. However I cant be with my parents in an isolated house where im in a cramped spare room, my whole family out all day. I dont have any motivation or will to live. I dont see any way out this time and I know full well that even if i get through this period, it'll all come crashing down harder and harder like it's done for me these past few years. \n\nThe brain fog, the static in a broken radio, the miserable black cloud won't go away. It just gets worse and worse. I live less and less. I dont know what to do with myself anymore. I think I'm finally done.", "url": "https://www.reddit.com/r/SuicideWatch/comments/c9pyyl/how_do_i_make_myself_want_to_live_again/", "title": "How do I make myself WANT to live again?", "social_network": "reddit", "user": "Sonicslazyeye", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1562390967, "permalink": "/r/SuicideWatch/comments/c9pyyl/how_do_i_make_myself_want_to_live_again/", "nsfw": false, "first_save": 1635426138.9732063, "replies_charged": false}