{"id": "t5_2qpzs_t3_lna1en", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "So I (24F) went to the ER 7 months ago because my body was going numb & my limbs were giving out (I later find out it was a reaction to pedialyte - weird, I know). At the hospital, they give me an MRI because I have a bizarre history of neurological conditions and quite frankly, I wanted to be sure I didn’t have something dangerous. I did NOT realize that their MRI “contrast” is actually a toxic heavy metal that they inject into you and it NEVER comes out. Doctors/pharma lie and say it is totally safe. I have at least half a dozen friends who have had MRIs without contrast, and I always wonder why the f*!$ did those doctors insist upon injecting that stuff into ME?\n\nEver since the MRI, I have been in so much excruciating pain that I have wanted more than anything in the world to die. Unfortunately, there is NO cure to pulling this metal (gadolinium) out of your body. The medical community literally POISONED me and left me to deal with the mess.\n\nPrior to this, I struggled with TEN YEARS of narcolepsy, 2 years of carpal tunnel, chronic UTIs, and digestive issues and I am only 24!!! I conquered those issues like a badass, but I am struggling with the fact that I was medically poisoned by people who I TRUSTED & PAID to help me during a very vulnerable time. Why is our society so messed up? Why is this allowed?\n\nI am in a nightmare and I can’t wake up. At first after the MRI, I thought about killing myself every second. Now it’s about once every 10 minutes. Crazily, no history of depression before this. Life is not worth this amount of suffering. \n\nMy symptoms if anyone is wondering:\nfeeling like skin on fire,\nrashes,\nwrinkled skin/ lost collagen,\ninsomnia,\nbreast pain,\nmuscle twitches,\norgan stabbing,\nheadaches,\nbody nervous system flashes,\ncracking bones,\nbone pain,\nno period,\nvertigo,\nacne,\nconvulsions,\nseizures,\nburning of scalp,\nloss of muscle control,\nless thoughts,\nspine pain,\nneck pain\nstutter,\nback pain,\nworsened memory,\nnumbness in my limbs, feet arms,\nsevere depression,\nsuicidal ideation,\nbuzzing in my nerves,\nfeeling of rods stabbing into me,\nfeeling of pulling in my organs,\nperilstasis\n\nOpinions? What would you guys do? It literally burns & hurts to be alive!", "url": "https://www.reddit.com/r/SuicideWatch/comments/lna1en/poisoned_with_toxic_metals_i_want_to_die/", "title": "Poisoned with Toxic Metals - I want to die", "social_network": "reddit", "user": "chr0nicallychill", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1613720063, "permalink": "/r/SuicideWatch/comments/lna1en/poisoned_with_toxic_metals_i_want_to_die/", "nsfw": false, "first_save": 1635422315.1458924, "replies_charged": false}