{"id": "t5_2qpzs_t3_2di94l", "request": ["e79a79ca-6f5c-44ca-b1e4-309a4afa83c2"], "text": "I have had opportunities. Plenty opportunities. The surroundings were right. No civil unrest, no unstable family, no poverty. Three meals a day and an afternoon snack. Traveling. Toys. Many others would have done much more than I have with the opportunities I have had. Something isn’t right. I am not right. Please do not mistake this for an attempt at self-pitying or self-commiserating. The cold hard facts are clear: I am a bum. I have no real desire to do anything in life than to seek all forms of readily available pleasure known to man. I am work - and effort - averse. Everything in life that has ever made me stand out of a crowd (like speaking another language), I have had a natural ability for. In fact, up until a few months ago, at the age of 22, I had never had a honest day of work in my life. I have slowly realized I don’t really want to become a doctor, or a pilot, or a chemist. What I want is the status and the prestige that comes with it. But show me the work necessary to attain such goals, and watch me bullshit and charm my way away into nothingness. No, I want to be loved and appreciated, and eat, and fuck, and relax.\n\nDon’t jump at my throat. I know it isn’t right - that’s no way to go through life. Life is for who knows how to do the hard things - but I can’t do the work. I envy those people that can just FOCUS. I never could. I’ve always been easily distracted.\n\nThis is probably a good time to also mention that I don’t really care THAT much for my next of kin, save for close family and friends. And even then - most of my interactions will still be governed by a will to take advantage of anything. And it does not matter to me if my actions leave the world a better place or not. Every single one of my actions is intended to benefit me or my ego. Preferably both. Global warming? Boko Haram? Bloodbath in Gaza? If I can’t see and feel it, I don’t care.\n\nAnd I feel quite shitty for it.\n\nWhat I am getting at here is that I can’t do it. I can’t do life at all. I can’t do empathy. I can’t do delayed gratification. I can’t do working my butt off now in pursuit of a much more excellent good in the future. With all of your support, maybe even your prayers, I can’t do it. My mind wanders, my will fades away, and my races are finished before they start.\n\nThis is my first year out of college. After mediocrating my way into a worthless chemistry degree, I landed the prestigious position of public phone bitch in a local phone company. My first experience with the realities of the real world! Hardly the worst job in the world, decently paid at that - but even then, I can’t be bothered to get my ass to work on time.\n\nI AM ALL OUT OF FIRE. I have no desire to go on. At this point it seems I have no motivation left in me to do anything worthwhile of myself. I feel done.\n\nI have had a good and privileged almost 23 years on life. I really have. I have great memories of family christmases, times out with friends or simple joys like enjoying ice cream on a sunny afternoon. Given the circumstance of being a useless bum, I’d say life has dealt me a pretty good hand. \n\nBut I think there will never be a better time to write the final chapter of my life than now. Before I turn 40, and become a living warning for what happens to bums in life.\n\nSome consider suicide the chicken way out of life. I agree. I have lived all my life in a chickenmost manner, it only seems fitting that it ended in the same way\n\nThis is the evident solution.\n\nI am so very sorry if this hurts you. I don’t expect you will understand, but I hope someday you will find it in you to forgive me.\n\nIt was fun.", "url": "https://www.reddit.com/r/SuicideWatch/comments/2di94l/parting_words/", "title": "Parting words.", "social_network": "reddit", "user": "suavistique", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1407988568, "permalink": "/r/SuicideWatch/comments/2di94l/parting_words/", "nsfw": false, "first_save": 1635425221.71698, "replies_charged": false}