{"id": "t5_2qpzs_t3_q7u2gn", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "I feel like I have always been broken and I have never been able to fit in or interact with others.\n\nI have always been mentally less developed than my peers in anything that wasn't stem and I can't understand other people's emotions or even my own and I don't understand how I'm seemingly doing everything wrong....\n\nI want to die, I want to not have to deal with all this but right now the only thing holding me back from that is a mix of being afraid and loving someone else who I think loves me. Even though I also usually feel like I'm not able to get along with anybody even her. I just know I feel safe with her like I'm not in danger and I love spending time with her. But I feel like I am mentally and emotionally incapable of being in any kind of relationship even though not being in one kills me mentally. \n\nI'm just so irritable anymore and I'm also worried that would be how I get with her and I'm trying hard not to let myself be irritable all the time because she's done nothing wrong. \n\nI know its all in my head, but that's part of the problem. I can fight a physical problem, I can figure a solution to physical problems but I haven't a clue how to fight a mental health issue like my depression and Bipolar and CPTSD and anxieties and seasonal depression...\n\nAll I know is I'm broken and I can't see how things are supposed to work but I'm trying I guess....\n\nJust worried I might kill myself I guess. I don't want to hurt others, especially not the girl I love. But, I also don't want to continue suffering like this...", "url": "https://www.reddit.com/r/SuicideWatch/comments/q7u2gn/i_feel_broken_and_hopeless/", "title": "I feel broken and hopeless", "social_network": "reddit", "user": "Alexisaurusrexis", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634193168, "permalink": "/r/SuicideWatch/comments/q7u2gn/i_feel_broken_and_hopeless/", "nsfw": false, "first_save": 1635425560.424513, "replies_charged": false}