{"id": "t5_2qpzs_t3_okef1o", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "\nI am a 22 year old female. I just graduated from U of T with the most useless degree ever: gender studies. Only went to university because of my parents, and took gender studies because it seemed to be the easiest and most lenient major. No real interest in it tbh. I’m fresh out of university, and now there are no jobs out there for me with such a useless degree. Even if I did have a job I’d be too depressed to work, based on my past experiences with working part time, where I only lasted a few months. Currently a freeloader at my parents house and sleep 16+ hours a day to make the day go by faster. Not sure if this excessive tiredness is from medication or boredom/depression or both.  (I have no physical illnesses that would cause this as I have gotten multiple blood tests) \n\nI’ve been depressed and socially anxious since middle school. I’ve been on different antidepressants for a few years now. Currently on 120mg of Cymbalta/duloxetine, the max dosage, and have been doing therapy for 2 years-ish. None of these work. Still feel like shit and suicidal everyday. \n\nI used to have a lot of hobbies, drawing, crocheting, bass guitar, piano, dancing etc. Now I am just a former shell of my self sleeping my life away with no interest in anything. Can’t even listen to music anymore because I can’t enjoy it/ don’t have the attention span. \n\nUsed to dream about being a mother one day, and that kept me going, but after working at a daycare and actually experiencing the hardships of taking care of children, I am having second thoughts, as I would be so stressed everyday, I would even cry. I am also not mentally capable of caring for a child 24/7 and probably never will be. \n\nI really have nothing to live for. I have no friends at all. Can’t make any/maintain them because I am too socially Anxious. I am just a burden to my family, both financially and emotionally. I have a dog but I am guilt ridden for not being a good owner, as I don’t have the energy to take him out to parks, trails, the beach etc., and let him experience life to the fullest. \n\nWhat’s the point of living if I will feel like this for the rest of my life? It is not a passing depression. I’ve felt like this for years. What’s the point of living if I am just a burden on others and sleep 16+ hours a day? I am not capable of working due to this deep depression, and will never be independent. I just want this to be over. The only problem is I was raised catholic and am terrified of going to hell. If it wasn’t for that I would have been dead long ago. But at this point, I don’t feel living is worth it anymore. \n\nDoes anyone else relate to this? \n\nTLDR: going to kill myself as I am too depressed to function in society, am too socially anxious to leave my room. I am basically a hikikomori/shut in.", "url": "https://www.reddit.com/r/SuicideWatch/comments/okef1o/ive_seriously_had_enough_im_going_to_kill_myself/", "title": "I’ve seriously had enough. I’m going to kill myself tonight", "social_network": "reddit", "user": "razberryjamjam", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1626298989, "permalink": "/r/SuicideWatch/comments/okef1o/ive_seriously_had_enough_im_going_to_kill_myself/", "nsfw": false, "first_save": 1635427030.3101609, "replies_charged": false}