{"id": "t5_2qpzs_t3_qadrh8", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "Fuck the system and psych wards. No help but restless legs and insomnia forever. I constantly feel like a numb robot with horrible cravings for freedom and drugs that even follow me in my dreams. My thoughts race all the time with no control over it. Like I just want to be in a coma until the pain is  gone and I can at least self-medicate. I don't even get substitution for opioid addiction or proper ADHD meds because of psychosis or whatsoever. A gun is an easy way out I guess because I tried everything chemically I could do. A stable k-hole with lots of DXM would be great because I wouldn't have restless legs or akathisia... Can't even feel love for anyone. It's just a waiting I know but my impatience grows stronger every day it's like mental torture and one day I'll be gone forever and disappoint my loved ones. I wish I felt like a burden to everyone so that I could do suicide. I just want to be endogenius me again and sleep 16 hours a day but I can't... Subjective it's so much worse than objective but nobody cares until it's too late. The mixed emotions are hell. Like there's too much pressure to keep living I can't take. The worst is I want to die but I know it's no solution and it's temporary even if it feels like forever. But then one day I might have enough of everything and borrow a gun and tell my loved ones goodbye before. But I can't even talk properly and I don't want to survive broken bones or severe brain damage. I don't even get fucking nicotine or alcohol. I feel like faking my depression all the time it's making me act manic the akathisia.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qadrh8/its_like_it_will_never_end_because_apparently_its/", "title": "It's like it will never end because apparently it's too late", "social_network": "reddit", "user": "nonae9q47", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634525450, "permalink": "/r/SuicideWatch/comments/qadrh8/its_like_it_will_never_end_because_apparently_its/", "nsfw": false, "first_save": 1635426532.1605287, "replies_charged": false}