{"id": "t5_2qpzs_t3_qfj6bv", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2", "da59145b-e03c-41fa-81a8-791cf9f7ecbf", "69686dc6-5bf4-41ab-864a-231bdd6f02c9"], "text": "My wife broke up with me three days ago and tonight i broke down to her again. And shes the only person i feel comfortable telling my worst emotions to and i asked my wife to let me kill myself because im so so so drained and i just dont want to be here anymore, i dont want to kill myself because she broke up with me.\n Ive had alot of time contemplating what i would do if we had seperated and i had to start fresh and i decided a long time ago that i wasn't going to be going all the way back to the start line, i was just gunna skip out where it ended and leave the whole game.\n\nI fucking HATE myself for putting this on my wife. In no way was this a final plea for her to come back or i would kill myself and im absolutely terrified that she would think it was.\n\n In honestly i will never try to guilt my wife into being with me because i want to be loved because they love me. \nNot because i forced them too or they think ill kill myself if they dont. \nShe said that she would fly back here asap to support me and i told her i wouldnt let her do that.(i tried explaining over and over that im just a fucking wreck right now that unfortunately has one person to confide in who i should be giving space to, and i just neeeeded to have it out. ) \n\nI very much want to die and im so so so overwhelmed with everything that i just cant find where one thought is starting and another begins. Its all a clusterfuck of horrible thoughts screaming at me every second of the day and i just want it to stop.\n\nBut I also very much dont want to die.\n\nI want to continue growing into this person ive been quite fucking proud of becoming in the last few months and ive been making such progress within myself and with this breakup its actually been the tipping point of me actually being disgusted and appalled at my addiction to weed for 15 years so much that  honestly i dont see myself touching that shit for a long long long fucking time and thats an insanely giant step in a direction ive aimed for for years. \n\nDespite my erratic behavior and constant breakdowns the last few days i have been quite productive in doing everything i shohld be doing to live like showering and cleaning, taking care of pets and basically not being a puddle in bed crying and its been really good. \n\nAnd then it all hits like a meteorite and i cant breathe or think all i can do is cry and cry and cry. And then i somehow tear myself out of it for another half hour or hour to start all over again. \n\nI am a complete an utter goddamn basket case lately and the only reason i havent ended this shit is because\n i refuse to be such a selfish cunt that i kill myself and leave my wife to pick up the pieces of a life she is leaving and break her like that. Not to mention the financial strain and the strain of having 3 cats to find homes for all while still dealing with this breakup herself because, \nyes she has broken up with me, but\nNo im not so narrow minded that i cant\nUnderstand the incredible amounts of pain and hurt she is feeling from having to actively walk away from a life she has put her soul and love into to create.\n\nI just have no idea of how to act or process this let alone somehow being able to do this in a way that will keep as much friendship intact as possible with my wife. Im very conflicted and i feel like im going crazy, not goddamn blackstreet crazy but fucking Wesley willis crazy. Im sacred and i have very very little support in a house completely alone struggling with finances and just falling deeper and deeper into this pit of hate and hurt.\n\nI have no money for a therapist right now and ive been calling a suicide hotline when things are getting really really bad but i dont know what the fuck im doing here guys.\n\nCan someone please help?", "url": "https://www.reddit.com/r/SuicideWatch/comments/qfj6bv/i_told_my_wife_i_want_to_kill_myself/", "title": "I told my wife i want to kill myself", "social_network": "reddit", "user": "saveknees-slapbees", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1635175562, "permalink": "/r/SuicideWatch/comments/qfj6bv/i_told_my_wife_i_want_to_kill_myself/", "nsfw": false, "first_save": 1635425184.00743, "replies_charged": false}