{"id": "t5_2qpzs_t3_qg3zay", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "I've struggled all my life with depression, racism, homophobia, child abuse, poverty and much more.\n\nIt's true, life doesn't get easier you just kinda learn to cope with it somehow.\n\nI've tried many medications, and exhausted all possible FDA approved treatments for depression. I've had good therapists and not so good ones.\n\nI asked for help from my sister and was told never to talk about that to her ever again. I asked for help from my family members but i'm quickly shut down because they get uncomfortable with talking about mental health. However, when I'm accomplishing something big like graduating from Stanford or winning awards, they'll be there in the limelight. But when i'm at my lowest, they have literally left me in the waiting room at the ER with a broken neck so that they can attend a play instead.\n\nI don't wanna go on and on about how horrible life is because it's not horrible all the time - it gets tiring when your will power starts to diminish and you try to find an emergency battery pack of it somewhere deep inside of you.\nMy problems in life have been social,  physical, mental, emotional, etc.\n\nI'm just exhausted. I've grown indifferent to the idea of death and have been slowly planning my emergency exit. I just don't know when i'm going execute the eject button - but when gave it your all in life, strived for the best, achieved many many fears by yourself but your body and society fails your miserably and your resilience starts to fade because it's been your backbone for so long...you get tired. You get tired at a soul level. \n\nI'm tired of people talking at me, inadvertently invalidating my feelings and experience with unsolicited advice they themselves wouldn't even take because they don't know what it feels like to walk in my shoes.\n\nI'm mind, body, and soul is tired. I'm just putting this out there to the universe that i really tried. I really did. Sorry if my best was not enough.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qg3zay/ive_been_thinking_about_it_for_several_years_and/", "title": "I've been thinking about it for several years and have been slowly planning it out. I've asked for help from friends and family and met with discomfort and silence.", "social_network": "reddit", "user": "BrickUpset889", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1635246363, "permalink": "/r/SuicideWatch/comments/qg3zay/ive_been_thinking_about_it_for_several_years_and/", "nsfw": true, "first_save": 1635425198.1121774, "replies_charged": false}