{"id": "t5_2qpzs_t3_lsnbrw", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I've come to a point within myself where I am ready to die. Emotionally and psychologically I feel like I have no mental barriers left. \n\nSometimes I don't have enough emotional energy to do anything except keep myself alive. Everyday I think about going to the subway and jumping on the tracks. I think about whether I should sit upright on the tracks or whether I should lie horizontally across. I think about what it will feel like. I think about whether my organs will get crushed or will I get decapitated. I think about these things every day. And I'm just fixated on this.\n\nWhen, and if, I die by suicide, I plan on going to the subway in the early morning. Around 5 or 6 am. I would only jump on the tracks at a time when there are no other people there. If there are people there, I would go every morning until there is no one else and I am the only one. I want to minimize the amount of people that would have to witness the aftermath as much as possible. \n\nI've already written a note and it is in my wallet now. The note is to the subway train driver. Before I jump onto the tracks, I would make sure to leave my wallet on the subway platform. Once I'm dead, they would obviously want to ID me, hence they would look through my wallet. The note essentially tells the subway train driver that I hope this doesn't haunt them since there is nothing they could have done to prevent my death, and I'm sorry that they had to be the one to hit me.\n\nIt was my brother's birthday 2 days ago. And this is all I could think about all day. Suicide. And that's it.\n\nI don't know how much longer I will be alive on this Earth and I don't know if I'll be alive in a year from now for my brother's next birthday. I'm trying to keep myself here so that I won't hurt my loved ones by killing myself. But I've been in so much pain for so long. I've been tormented and haunted by my past for years. I really don't get a break. There's no \"off\" button for my intense self-loathing.\n\nI can't undo the pain I've caused others in my life and that hurts more than anything. I've caused others a tremendous amount of pain. And no matter what I do now, I can't take that pain away.\n\nI desperately want to be a good person, but I've crossed the line. I've done such unforgivable things that no matter what I do now, I'll never be a good person. \n\nThere's a real hollowness to how I'm living now. \n\nI know that suicide is permanent. I know that you can never undo it. You can never come back from it. But I've spent hours, days and months considering the implications of it all. And I'm ok with that. I'm ok with not existing and not being able to come back. I'm okay with permanent nothingness and having no spark of consiousness. In fact, I'm at peace with it. I'm ready to die.\n\nI'm only still here for my loved ones but I don't know how much longer I can survive with these suicidal thoughts.\n\nToday is February 25th 2021 and in March I will be starting therapy. I want to do therapy so that I can process my past and then that way I'll be able to write about it in a suicide note to give my poor mum closure. Answer all her unanswered questions. Right now I have a mental barrier to writing about my past and I think I need to process it with a therapist first in order to write about it. \n\nI think my death is inevitable simply because this amount of pain is intolerable. I am trying to stay alive for my loved ones. But my mind torments me on a daily basis and my self-loathing doesn't give me a break.\n\nI have done horrific things in my life and caused others so much pain. I never intended on hurting anyone. The situation is layered and nuanced. I was under immense pressure at the time and I was dealing with debiliating shame. I was not able to comprehend the gravity of what I did. But my intentions do not change the fact that I ended up doing unforgivable things. Truly unforgivable things.  And I do not use that word loosely.\n\nThere's no coming back from this for me. My past is just too dark and nothing I ever do now can change what happened.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lsnbrw/it_was_my_brothers_16th_birthday_two_days_ago_and/", "title": "It was my brother's 16th birthday two days ago and the only thing I could think about all day was suicide and whether this would be the last of his birthdays that I'll be alive for :((", "social_network": "reddit", "user": "vgn-bc-i-luv-animals", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 15, "down_vote": 0, "creation": 1614305742, "permalink": "/r/SuicideWatch/comments/lsnbrw/it_was_my_brothers_16th_birthday_two_days_ago_and/", "nsfw": false, "first_save": 1635428122.3044338, "replies_charged": false}