{"id": "t5_2qpzs_t3_owr1sx", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "Some people will definitely think i'm a fucking degenerate incel when they read this, fuck it, leave a negative comment, it might make it easier to just fucking off myself and take this away, some aspects of this....well all aspects of this are my own fault but I was fucked up in the head, I genuinely didn't wanna live and was tryna fuck my life up so bad that it would be easier to end it...Ok so this requires a bit of backstory so please bear with me, a couple months ago due to the covid outbreak I ended up severely depressed, I am diagnosed with GAD (Generalised Anxiety Disorder) and having so much time pent up in a fucking uni dorm with nothing to do made that go completely haywire, the isolation, boredom, insecurity, self loathijg all eventually led me to self deprecation and self destruction. Due to the lockdown I had already ended up with a porn addiction amongst other things (self harming, drug abuse, eating disorders) it was like I was doing everything I could to ruin my life so I wouldn't be too afraid to kill myself...i'm awfully sorry for the pity party but I have no idea how to better explain my current mindset and situation. So as I said I was looking for ways to basically ruin my own life and make myself hate myself more and more, I discovered Findom.....I have no knowledge of it aside from you basically give girls money to treat you like shit and take your cash as well as humiliating you a bit, my initial plan was to get drunk as hell, meet this girl, give this girl money, have her humiliate me, make me hate myself as much as possible by feeling emasculated like that then maybe I could finally end it....but I still couldn't. This is all relevant because now with a good support group I have strongly improved my mental health and outlook on life, my sex/porn addiction is almost beaten I think, no drug abuse at all since March, drinking and smoking are now social only (used to be a pack of marlboro and a 6 pack of beer a day at least) my self harming has stopped....or had until tonight. Without my knowledge or consent this findom woman filmed the encounter, me handing her money and kneeling in front of her, kissing her fucking shoes for gods sake, now if you are into that fair enough no judgement but I am not, I solely did it to further destroy my mental state through the illusion of inferiority and now everytime I see that clip I truly want to die, she posted it on Twitter, again without consent, when I asked her to remove it and explained my story she basically laughed it off, in fact called the story \"pathetic incel shit\" and is now saying if I want it removed from Twitter I have to pay her because \"no one escapes findom, your life is over now\". Someone who's pretty clued up on law, is there anything I can do?? She hashtagged the name of my local city, a lot of people are seeing it, sooner or later a friend or god forbid family might, I don't want to die anymore but if this doesn't stop i'm scared I'll do something stupid, I feel like it's gonna ruin my social, financial and personal life and don't know what to do...please help me, i'm scared.", "url": "https://www.reddit.com/r/SuicideWatch/comments/owr1sx/im_being_blackmailed_after_months_of_repairing_my/", "title": "I'm being blackmailed, after months of repairing my mental health it's got me sat here with a fucking death wish, i'm afraid to die but I can't do this anymore, please help me.", "social_network": "reddit", "user": "LilBitchBoi98", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1627948129, "permalink": "/r/SuicideWatch/comments/owr1sx/im_being_blackmailed_after_months_of_repairing_my/", "nsfw": false, "first_save": 1635427025.5210907, "replies_charged": false}