{"id": "t5_2qpzs_t3_q5nkgs", "request": ["f704b85c-a9c0-4902-a44d-d5b6bd9ee82a", "56f46b9a-59d4-48f0-aed3-4247ea68706d"], "text": "Hey hey! I understand that this is typically a grave topic, and in no way mean to disrespect the tone or values of the community. I truly had no where else to go.\n\nBackground:\n23, CS college student, “busy” schedule (I don’t mind the busy, but others point it out), and recently diagnosed with lifelong disease. Will already prepared, finally!\n\nNeeds:\nI’ve had suicide on the mind since I was 11-12, but I’ve struggled getting what I’ve needed to do it. I’m old enough to purchase the tools I needed to, but I can’t officially complete my purchase because my ID expired. Since renewal will take a year (the DMV system is backed up), where can I find a relatively painless, if not quick (under 30 seconds of consciousness), method to commit suicide. Trying to finalize plans has been a pretty irate journey for the last 1-2 years, so I would appreciate any help! Thank you!\n\nNote:\n- I have been trying to get therapy, it isn’t all that helpful for me.\n- I have talked on the suicide hotline. Not interested (and I feel phony for calling and not following through).\n- I am in no way moved by the appeals for/against suicide. I don’t attach meaning to it or its consequences; I want to get it over with as simply and nonchalantly as if I decided to take a nap.\n- I do not intend to give additional information on my reasoning and circumstances; I really don’t want to risk being talked out of this.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q5nkgs/just_want_help_committing_suicide/", "title": "Just Want Help Committing Suicide", "social_network": "reddit", "user": "thrwawy5800", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1633924253, "permalink": "/r/SuicideWatch/comments/q5nkgs/just_want_help_committing_suicide/", "nsfw": true, "first_save": 1635427950.5850203, "replies_charged": false}