{"id": "t5_2qpzs_t3_o3sdsh", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "Emotions are for idiots But we can’t control them. So what is the point of this essay you mask? Well good question, its more of a place to rant on my feelings. Yep feelings, something I despise since young since they put logic aside and make you act on your immediate needs? I guess so, they can bring you down, up and away. But anyway I uh don’t know anymore, I guess I fell subject to them. Subject to being addicted to a single person.\n\n Is that love? Probably, but she was the oonly who would give me anttention and compassion. Nobody else really could give me that, since most people just didn’t care enough or didn’t know enough to feel relatable. I mean to be fair, she only had a small disorder but I guess she has had her share of rough times. Something we can both relate to. But what is it really that drive these emotion for socializing.\n\n I’m here, alone, as usual feeling shit because I have nobody to talk to, or anyone that I can just feel free with to be honest. I don’t know how to put it, its just, that I never ever felt I could be this open with somebody before. I would just share my insides to her and she would accept it? I don’t know how to say it, she was the only one to care for me and go beyond a certain extend to do it I guess :/.\n\n But what is really happening with me? Why am I depressed? Why do I have to have these disorders for fucks sake. Why can I not go back to 2 years ago where I was a happy person, alone but I didn’t care at all for going out. Why do I have to have touched this socializing part of me and not be just productive? Why do I have to involve myself into group affairs into social groups which are no more because of some, drama…………………………………… \n\nAn environment, I used to be in, surrounded with happy friends and people around me. Somewhere I could just type whatever I wanted, gone. And why? Because people tend to act purely based on emotions with absolutely no fucking filter. Like holy shit how some people can be this incompetent when it comes to socializing? Like jessus fucking christ. We have both sides fuck up in argument because they are both idiots. I want to be with both of them and neither of them. \n\nCause it hurts, it really hurts but in reality I have nowhere else to go :( so I’m stuck with these I guess? :( I sometimes just walk down the stairs and hope that the house exploded. Killing everyone inside, or everyone except me. To give me a start of just disappearing, forever. And go where? I don’t know. I really don’t know. Actually fuck it let the house take me with it. I just feel shit. \n\nI really want to do something but don’t. I sometimes stand there in the kitchen, with a knife in my hand thinking whether its better to takes everyones lifes away, or my own or both in turn. Because fuck people. I just hate humans, I hate emotions, we are mechanical beings and I happened to have 100 manufactoring errors. \n\nLike ranging from mental to physical ones. I hate it, I hate it, I really hate this that and everything. It really hurts, it just hurts, it just hurts the screams, the voices, the illusions, they are just there. They are just there making me suffer cause fuck me that’s why. It pains me so much but nobody out there can relate. Nobody out there can just give me a hug and say “I know”. Is it that hard anymore, is it that hard to exist in peace. Is it that hard for me to stop pretending that I’m ok? \n\nI have no reason to be sad, I have no reason to be depressed. I work out, I have a social circle, I have hobbies, skills, “good” grades but yet here I am. Waiting for me to say one final “fuck it” and end it, because there is no point. I don’t want to live anymore, I don’t want to burry this burden of pain and suffering going constantly in one constant cycle. I need help, I need help because I’m ill. I just need helpppppppppppppppppppppppppppppppppp. \n\nIt hurts, it hurts so bad. I mean what would happen if I cut my wrists? Nothing because that is the least effective way of dying. I should hang myself and be done with it. I just want it to end. I want it to end. I want it to end. I really do. I need help :| Dissascoiation exists as a self defense mechanism, so a disorder to combat a disorder, heh I can’t I just can’t do this anymore\n\n I should just update the note and be done with it \n\nIt hurts\n\n :(", "url": "https://www.reddit.com/r/SuicideWatch/comments/o3sdsh/emotions_are_for_idiots/", "title": "Emotions are for idiots", "social_network": "reddit", "user": "whoamitoknowyou", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1624144812, "permalink": "/r/SuicideWatch/comments/o3sdsh/emotions_are_for_idiots/", "nsfw": false, "first_save": 1635423068.6233888, "replies_charged": false}