{"id": "t5_2qpzs_t3_mysf5x", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Hate Reddit, all the karma and stuff, so no one probably would see this. I'm not even sure what to do. So my friend and I, let's just call him Dave for now, are desk mates, and we knew each other for a few years by now, and from the beginning of this school year, he had always wanted to go to the top floor. You know, I thought it was a typical student's thought. I even made a promise with Dave to go up there together sometimes, because the security should loosen up at the end of the year. I, just didn't expect him to have rash decisions like that. We first noticed him having gone missing in the third period, and someone pointed out that he changed his birthday on Facebook to, today. It wasn't that all related though, so I was pretty calm. But also, he posted his last words on the platform. \n\nWe rushed out. I didn't think much of it. I mean, he was always the cool type of person, a bit amtroverted, and always making friends here and there. Dave isn't the most positive person, but still the most rational person I know. His mom and dad are all young and cheerful, and though Covid made it bad for them, they were still staying strong. His grades, no, he doesn't even care that much about learning. Working? Perhaps, but Dave was working part time online with a decent salary. I could casually see a few hundred dollars being transferred to his PayPal account from time to time, and being overloaded shouldn't drive he to that point.\n\nI tried to dial him. Numerous times. At that moment, I finally saw him, sitting with his feet dangling midair on the rear of the top of our school. With the phone having been thrown down. Shattered.\n\nWe didn't have a lock for that floor. I always wondered about why the school is not blocking student entrance to a highly sucidical spot like that. Some buildings do, but others had nothing to prevent students from going up. No fence either. There should have been a similar instance like this, or at least, someone should have anticipated about this beforehand, but the only thing they did was setting up regulations and surveillance cameras. Obviously, he got up there quite easily. Not like it matters if they had done more, as he could pick the lock, as he used to show me the tools before. \n\nI'm a shithead, having suggested we could buy a new lock, sneak up there, pick it and just chill there some day. And replacing isn't even necessary, no one bothers anyways, but just in case. Apparently, his reason is a bit different from mine.\n\nLong story short, he blocked the door, one friend went up through the emergency stairs, and the rest broke in. We talked for, what, more than an hour. Haha, I didn't even know what to say. On one hand, I thought we could pull the trash cart near his spot, so it could minimise the damage, or gather people around there, so though he would break our bones, it's still gonna be better. On the other hand, I know there's nothing we could do. It's the fifth floor. And he didn't let anyone goes near his jumping spot down there, or else. Luckily, Dave hadn't gone to that point of giving up yet, or he could have jumped anytime before we had gone there. The fire department got there in time, talked a while alongside us, closing the distance, and pulled him down from there.\n\nI didn't think I would be the type to cry when something like that happens. But, we all did, especially our teacher. She patiently stood there, opening her arms, under the burning sun, at 37 degrees of Celcius, and talked to him gently, while keeping an eye on the rest to make sure we're not doing anything stupidly. After waiting him to be controlled and brought down, she only cried at that point. We had a similar case before,  but it was the typical love reasons. So when Dave came to such decisions, I could only imagine her feelings. She gently scolded the other student that wanted to suicide once, and said we should never have such a thought for the rest of our life. \n\nI'm confused. Please tell me what to do for him. He doesn't deserves this. No one does. Not when we're this young. He would find out if I were to post anywhere else, except for this, so I'm trying to find out what to do right now.", "url": "https://www.reddit.com/r/SuicideWatch/comments/mysf5x/my_friend_was_trying_to_jump_down_today/", "title": "My friend was trying to jump down today", "social_network": "reddit", "user": "meowounce", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1619423456, "permalink": "/r/SuicideWatch/comments/mysf5x/my_friend_was_trying_to_jump_down_today/", "nsfw": false, "first_save": 1635422313.5182617, "replies_charged": false}