{"id": "t5_2qpzs_t3_ov1oc8", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "This is all jumbled but idc anymore. \n\n\nI hate it. I hate that life will only get more stressful from this point on. I feel like I can barely handle all the responsibilities placed onto me already. \n\nMy mother and I have always struggled with finances. Always stressed about having our basic needs met. We always have to sacrifice something in order to pay the bills or put food on the table. \n\nTo top it off I have no social skills and I think this is the most insecure I've ever been. I'm not at peak health, making me look unattractive, which is extremely important at this age. I'm too depressed to do basic things like brush my teeth and work out consistently. It's never consistent. \n\nMy grades are the lowest they've ever been. I've had decent grades but keeping them up put me through so much mental and emotional agony. \n\nI'm so lonely. I can't see myself in any career because I have zero energy and motivation to actually attain one. I just...I'm so angry. Angry that I have to put my blood, sweat, and tears into making a life for myself when I get nothing out of it. Just surviving to suffer.  It's been like this for years. I've been so lonely and isolated that I actually feel insane. \n\nNo man will ever look at me with desire or love. Not the real me. I'm not one of those chicks going through PMS or BDD. I actually am unattractive. I hate that I feel like I have to have a partner or be attractive to be happy. To enjoy living. But it's true. I'm a fat, and pimply with an overbite. It's not helping that I'm a POC surrounded by white people who prefer other white people. I'm desperate and insecure and have no self-esteem. Who tf wants a girl like that?? No one! No one wants me. No one will ever look at me with desire or lust/love.\n\n I can't give up on picturing the life I want to have. I just want it so badly. And if I can't have it I just don't wanna live anymore. Idc if I sound silly or selfish. I'm getting nowhere in life and life is so painfully boring when I'm not crying in self pity. I'm stuck. I've been stuck for so long. Stagnant. There is no meaning or purpose in my life. I feel so insignificant, like a grain of sand in a desert. I don't wanna get up to work for it either. I'm angry that I've been putting my back out for this long and nothing has happened. Nothing has gotten better. Now I just want everything to come to me. But it won't. \n\nI'm so tired. I wanna nice long sleep. I just want a break from it all. Where no one can judge me or look at me. A nice relaxing, nourishing sleep where I don't have to lift a finger. Where I don't have to overthink or feel anything anymore. Where my worries and anxiety will just disappear. One that won't ever end. I think I've earned a good life...so why is mine still so shitty? I don't wanna try anymore. I'm angry and I'm done.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ov1oc8/being_an_ugly_poor_teenage_girl/", "title": "Being an Ugly, Poor, Teenage Girl", "social_network": "reddit", "user": "p34chbunni", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1627710128, "permalink": "/r/SuicideWatch/comments/ov1oc8/being_an_ugly_poor_teenage_girl/", "nsfw": false, "first_save": 1635428213.3031118, "replies_charged": false}