{"id": "t5_2qpzs_t3_ckz81p", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "Cons\n1. He makes my heart hurt in unhealthy ways\n2. He’s aggressive\n3. He’s stated rude comments like: I’m dumb, dress like a hobo, I should know how to do my makeup, I’m pushy, I’m embarrassing, threatened to ghost me on more than one occasion, called me an only child, says gross things, criticizes me, harping on every detail, saying IM RUDE AND BIPOLAR, sexist remarks, embarrasses and shames me, called me gross\n4. He’s hard to please\n5. Didn’t hang out with me on his birthday weekend..been cold af \n6. Hints to have me leave him alone\n7. It’s always at his schedule\n8. He’s a Trump supporter....how many “legal” purchases of assault riffles have there been and how many mass shootings in the past year let alone days?\n9. Won’t explain shit at the time\n10. Presumptuous close minded\n11. Bad intimidating energy\n12. Watches shitty movies \n13. Dirty apartment\n14. He’s not going to be satisfied \n15. He said it won’t work when I was told I had a mass..cervical cancer\n16. Nothing is clear\n17. He’s increased my desire to kill himself\n18. No respect to me\n19. Petty\n20. Anger issues\n21. He pressured me and gave me triple anxiety\n22. Yelled at me before during and after camping trip\n23. Treats me like a slut\n24. Lost interest\n25. Assumes “I’m that type”\n26. Has made gfs suicidal \n27. He hates when I talk about celebrity men\n28. He resents little behaviors or things I said and will use silent treatment when I can’t read his mind - patience is needed\n29. Feel like I’m being criticized by his looks\n30. Disrespects my mom and my home had himself over without invitation last minute\n31. Was grossed out by my blood\n32. He’s a drunk \n33. Hates my music and style\n34. Makes me feel like shit in general\n35. Brings out a lot of good or a hell\n36. Could further my mental illnesses and has me fucking losing it\n37. I begged like a pathetic bitch to him\n38. His apartment makes me depressed\n39. I feel so suspended and not worth anything\n40. Questions my many talents\n41. Says I need new clothes and wants a bad bitch\n42. Won’t refriend me on fb\n43. Doesn’t seem to remember shit I say only the bad shit\n44. I think he’s the devil\n45. Never opens up\n46. Not satisfied when I ghosted him or I was talking too much \n47. Pushy with the staying over\n48. His cooking and taste sucks\n49. He doesn’t like cats and called MINE fuckers \n50. He’s not worth it to me and won’t appreciate who I am. \n51. Dumb \n52. Defense mechanisms\n53. Hasn’t introduced me to mom\n54. Fucking selfish no consideration\n55. Makes me want to kill him with insults \n56. Hates steely dan \n57. Boring\n58. Shames my substance use\n59. Swears too much\n60. Wears shorts and doesn’t do laundry\n61. I can’t \n62. I think he’s the devil\n63. Shallow and sucks with his music \n64. Gives me shit about not cooking\n65. Violent\n66. Mentally ill\n67. Hypocrite\n68. Indecisive\n69. Takes advantage \n70. Is a sadistic narcissist \n71. Dishes insults but can’t take it\n72. Texting is hell\n73. Can’t understand him and it’s my fault\n74. Has had gfs call him abusive\n75. He’s made girls desperate\n76. Is a Leo\n77. Pain\n78. I’m under his evil spell\n79. He loves hell I love angels\n80. Texts me late for a ride but not to spend time together at his birthday\n81. Was going to give him awesome birthday gifts that I couldn’t afford\n82. Shames my eating disorder\n83. Is critical of others\n84. He’s an illusion\n85. If I try to nip a misunderstanding in the bud he gets angry and shuts me out\n\n\nHe’s the first man I have really felt strongly in extreme ways since my man died June 17 2016 and several grievances since. I’m open minded and can take a lot of tough comments to keep myself in check. Don’t tell me to shut up and look pretty. Doesn’t give a fuck. He reached out to me in June and I feel like he’s murdered me. He’s 37, I’m 32 but don’t let my age fool you by the hell I live.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ckz81p/ugh_he_will_be_the_death_of_me_i_feel_stupider/", "title": "Ugh he will be the death of me I feel stupider than ever and I take Xanax for PTSD, smoke weed wanna quit, smoke cigarettes.", "social_network": "reddit", "user": "TruthNotSorry", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1564719565, "permalink": "/r/SuicideWatch/comments/ckz81p/ugh_he_will_be_the_death_of_me_i_feel_stupider/", "nsfw": false, "first_save": 1635426702.2337341, "replies_charged": false}