{"id": "t5_2qpzs_t3_on43tu", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "I'm sorry I can't be the child you dreamed of having.\n\nI know you deserve everything, and I can't give you even the simplest of things.\n\nI can't even fucking clear an exam even on second attempt. I'm a fucking idiot.\n\nY'all give me everything I want, sacrifice everything for me, and in return I give you NOTHING. \n\nDo you look at other children and wish I were them? \n\nDo  you wish you'd have raised me better? 'Cause it's not your fault. It's mine. I AM THE DUMBEST PERSON ON THE PLANET. \n\nI sometimes wish I was never born, why did you give birth to me? How does it feel? Raising a disappointment of a daughter? \n\nI know you'll never tell me you're disappointed in me, but you'll hurt inside. Mom will start recklessly driving again. Dad will start drinking on week nights again. All because of me. \n\nI wish you were abusive, I wish you were even a little bad. So I could blame you for my declining mental health. But I only have to blame myself. \n\nYou don't know that for the last one and half years, there hasn't been a single night when I didn't think of ending it all. I have the equipments stored in my cupboard. I'm such a fucking coward that I can't even kill myself. I can't... cause the last time I failed, you consoled me and told me I'm all you have. \n\nI knew I wasn't going to succeed in the endeavour, I was never stable enough to give my best. But it hurts knowing that ya'll thought I can. Stop overestimating me, I'm not that smart. Not all fucking Asian kids are smart.\n \nI have no future... Right, mom and dad? \n\nHow will I ever make you proud?\n\nWhat's the point of living anymore?\n\nBut you told me I'm all you have... but do you sometimes wish you never had me?\n\nI think it's high time for me to not be a coward. I'm a waste of space.", "url": "https://www.reddit.com/r/SuicideWatch/comments/on43tu/im_sorry_mom_and_dad/", "title": "I'm sorry, mom and dad.", "social_network": "reddit", "user": "girldoesstat", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1626658481, "permalink": "/r/SuicideWatch/comments/on43tu/im_sorry_mom_and_dad/", "nsfw": false, "first_save": 1635428209.073735, "replies_charged": false}