{"id": "t5_2qpzs_t3_lf2k4x", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I need help, I feel like I really need to kill myself and I will tell you why. \n\nImagine some total stranger wrote this to you online (They were a random person online and I am Canadian). \n\nThe person wrote this comment to me: \"you are a I can't even say it, I was always told not to say anything if I didn't have anything nice to say but damn dude really?\" \n\nThe past year especially, I dwelled and rumiated this person was that person about to call me the R-Word. \n\nAnd this wasn't last year, but TWO years ago, and not only I cannot enjoy the quality of life since. \n\nThe dwelling/ruminating was worse and worse. The word drove me crazy my entire life. And I don't know why, but not to this degree. \n\nIs it possible there was any other word, phrase or term they couldn't say/choose not to even mention? \n\nFor example They truly could've been thinking of stupid f****** idiot? Same meaning (stupid or foolish) and thought it better not to say that and the R-Word has possibility to have never even slipped their mind. \n\nBut still the R-Word absolutely fits at this rate, it is highly like and probable. \n\nIt's not what this person said that hurt, it's what they DIDN'T say that hurt. \n\nI need Psychiatric Help \n\nI think about this all the time now, and the 25th of February marks two years since this occured in 2019. \n\nIt bothers me 10/10 on a scale of 0 to 10. \n\nAbsolutely Dreadful. Autism and OCD don't help, if anything make this all so much worse.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lf2k4x/i_have_zero_reason_to_keep_living_but_a_tragic/", "title": "I Have Zero Reason To Keep Living, But A Tragic One For Sucide.", "social_network": "reddit", "user": "RailSail95", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1612753806, "permalink": "/r/SuicideWatch/comments/lf2k4x/i_have_zero_reason_to_keep_living_but_a_tragic/", "nsfw": false, "first_save": 1635428046.2400863, "replies_charged": false}