{"id": "t5_2qpzs_t3_j1jqvy", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Wandering around these winter woods. A blank, white space and jet black scratches from the trees' branches. Small, similar-looking, lifeless houses, blending in with the background, scattered all around.\n\nAnd there was Hope. A young, dainty boy, with a scrawny body, bones poking through his translucent, porcelain-looking skin, wavy, white, silky hair covering his piercing, yet kind, grey eyes and thin neck. He was footslogging barefoot through the heavy, fluffy snow, looking for a door to knock on. The checkered, white and grey, wool blanket, barely keeping him warm, was weighing on his shoulders and making it even harder to walk.\n\nHopelessly waddling around, waiting for a blocky silhouette of someone's home to be seen in the distance.\n\nHe could hear the distant whistling and screeching of an upcoming snowstorm. The clacking of the branches hitting one another, as if in a bloodthirsty fight without a purpose, numbing his hearing. Nothing but white noise was on Hope's mind. White noise and white chunks of snow aggressively dancing in the air, getting swirled around in a deadly waltz. Snowflakes bumping into each other, trees swaying, threatening to hurt with their big, sharp movements and loud groans, the painful screaming of the wind.\n\nWhite noise and white chunks of snow in a dark, black void.\n\nHope found himself in front of a door. He got all the little energy left in his body, kneeling on someone's doorstep, raised his trembling, purple-tinted arm, and knocked twice. A dark grey figure opened the door and dragged him inside.\n\n\"Thank you for taking me in.\" Hope said, barely able to get any sound out of his voice.\n\nA deep, husky, worn out voice responded: \"No need to thank me, boy, who wouldn't take ya in?\" the figure said as they were wrapping Hope in blankets and sitting him in front of the fire.\n\nHe didn't respond.\n\nThe storm was slowly passing. No longer were there loud noises coming from the outside.  \n\"When you asked me... Not everyone acknowledges my existence and decides to welcome me in their home. I have to get going soon, so I'll leave a piece of me here with you to show my gratitude. As long as this house is here, I'll be here.\"\n\nThe figure sighed and uttered, \"Thank you, boy. You see, I'm old and need no such valuable gift. Give it to another.\"\n\nHope looked at them, then back at the fire, wrapped himself in his checkered blanket and left, gently closing the old wooden door, drenched in water.\n\nWandering around these winter woods. A blank, white space and jet black scratches. No footsteps left behind, all concealed by the falling snow.", "url": "https://www.reddit.com/r/SuicideWatch/comments/j1jqvy/winter_wood_hopes/", "title": "Winter wood hopes", "social_network": "reddit", "user": "imagineifiwashappy", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1601323645, "permalink": "/r/SuicideWatch/comments/j1jqvy/winter_wood_hopes/", "nsfw": false, "first_save": 1635422320.4602764, "replies_charged": false}