{"id": "t5_2qpzs_t3_lkyad9", "request": ["ecd4e9a1-2551-4506-a13c-95bd305e923c"], "text": "I have had suicidal thoughts on and off since I was about ten. I've never had a serious attempt. All my attempts were either parasuicides intended as a cry for help or just experiments to see if I could eventually go through with it if I finally couldn't take it anymore. I knew none of them would actually kill me. \n\nI  dont really want to kill myself. It would mean never experiencing the people I love or my hobbies or beauty or my favorite media ever again. I just want my pain to stop. \n\nI keep hoping one day, shit will turn around and I'll be happy I never did. I'm not ready to go through with it but its comforting to know it's an option. It makes me feel like a fraud, like I'm not really suicidal and therefore am not worthy of being listened to.\n\nDoesnt everyone have a fleeting thought of suicide at once? Isnt it normal for the thought to cross your mind even though you know you dont have it in you? I feel like such a selfish asshole for venting on a forum intended for people who's lives are actually on the line. However its lonely to experience these thoughts and I have no one to talk to. \n\nI've made plans but I dont have the energy, don't want to traumatize loved ones, and am afraid the attempt will fail yet cause permanent damage that would make me hate myself even more \n\nI just popped a xanax so I can fall asleep and stop thinking about ending it all. I'm going to wait for it to kick in so I'll pass out before I get the chance to mix it w/ booze", "url": "https://www.reddit.com/r/SuicideWatch/comments/lkyad9/idk_why_im_posting_here_i_dont_deserve_to/", "title": "Idk why I'm posting here I dont deserve to", "social_network": "reddit", "user": "xanaxandbooze", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1613458812, "permalink": "/r/SuicideWatch/comments/lkyad9/idk_why_im_posting_here_i_dont_deserve_to/", "nsfw": false, "first_save": 1635427785.9042885, "replies_charged": false}