{"id": "t5_2qpzs_t3_ig54pz", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "To start off, I’m a 22 year old normal working class guy.\n\nI got a remote job recently working for a software company, I make decent money and I’m in a field that is interesting. I don’t leave my house though, unless to go to the gas station for cigars or beer. I also don’t have a vehicle to drive to places with. I’m so goddamn bored of life.\n\nRight after I got said job, the girl I’d planned on spending the rest of my life with (saved up nearly 10-15k to move us to a better city, to start a life) broke up with me. I wanted to marry her, not out of real love or anything but we were compatible and worked well together. I figured that there would be some stability with us as a team. She needed more out of the relationship though, more emotion and care (which I should’ve been able to give her). She pretty much told me she’d rather be single than working through my lack of empathy and emotion. As she was crying about our breakup I just felt numb, and really questioned what the fuck was wrong with me.\n\nFor a while because of childhood trauma, I’ve been a very impartial person, it’s how I used to cope. Through childhood mental abuse by my racist, controlling stepfather, and watching my mom become a similar emotionless husk due to pills, I lost so much of myself. That’s pretty much led into my entire being, I quite literally don’t care about much of anything. My entire emotional circuit is just a buzz of grey, literal nothingness, and has been since a young age.\n\nEven after breaking up with my girlfriend of 2-3 years, do I feel sad? Not really. Do I feel happy to have my own new apartment, my own things, and my own path I can literally do anything with? Not at all. These days, I just literally fucking smoke/drink until I go to sleep, and then go to work and repeat. I have no friends because I live in a small town, and the people I grew up with are just doing hardcore drugs these days.\n\nI honestly dread waking up, just to face a loop of nothing for years and years until I retire and die. I don’t even want to have a family anymore. I wouldn’t even be able to provide love to my kid.\n\nIt’s been 7 months where it’s been very rough like this, and it’s felt like weeks. Time doesn’t even feel like it actually exists, it feels like a construct that I notice at times, and let go of at other times. I recently saw my mother, and felt numb after seeing her for the first time in 2 years. I thought I’d be excited, or happy for that, but no emotion came when I saw her, or spent the day with her. So many people don’t even have that luxury as their mother isn’t there at all. What is wrong with me?\n\nI’ve been literally thinking that if I ever am in a situation where I can save someone’s life while losing mine, that I’d do it with 0 regrets. I’d be so fucking happy in that situation that they get to experience happiness, sadness, and love again.\n\nAt this point I’m having an existential crisis at 22, and I’m supposed to live until possibly 60-80? Fuck that honestly.\n\nWhat should I do? If I go to a therapist, they’re just going to prescribe me a bunch of meds, and I’m not doing that after seeing my mom fry her brain off of random quack doc prescription drugs.  If I really tell them about the suicidal thoughts I have, they’ll just try to fucking put me up somewhere.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ig54pz/i_think_boredom_and_some_undiagnosed_mental/", "title": "I think boredom and some undiagnosed mental health issue are leading me into an existential crisis", "social_network": "reddit", "user": "Visual_Degree9170", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1598328984, "permalink": "/r/SuicideWatch/comments/ig54pz/i_think_boredom_and_some_undiagnosed_mental/", "nsfw": false, "first_save": 1635427026.324248, "replies_charged": false}