{"id": "t5_2qpzs_t3_iw8eck", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "Title summarizes my situation. My boyfriend attempted suicide but luckily was not successful. However, after he woke up from the fog of trying to overdose on pills his mentality and perspective on our relationship took a 180 and he started hating and resenting me and blaming me for his suicide attempt. He cheated on me and after a year now he has finally owned up to it, only after lying to me. I’ll spare the relationship details of our current issues but the primary one of course is his depression. After confessing his infidelity to me his suicidal thoughts have come back because he’s overcome in shame. I have urged him to seek help ever since he attempted a year ago and he’s finally seeing a psychologist. He wants to work on our relationship together but I’m urging him to seek and prioritize his individual health first. Especially because all of this shame and suicidal behavior just ends up hurting and damaging me and it creates a vicious cycle of toxic unhealthy behaviors.\n\nI was hoping to better understand how one feels after a suicide attempt and to try to see his perspective if there is mental damage from the trauma of attempting suicide that helps explain the erratic decision behind his infidelity that he feels so remorseful and ashamed of now. I have never pushed myself to the point of actually attempting to take my life so it’s hard for me to understand and see this viewpoint. If I can understand it I can forgive it and I want to support him and help him break out of this prison of shame he’s keeping himself in. \n\nBecause of all the damage from infidelity and his recent behavior from suicidal thoughts and the shame of everything, I don’t want to be romantically involved anymore. But I care deeply for him and don’t want him to hurt himself, and if I can in any way still continue to be supportive but with healthy boundaries. Does anyone have experience or advice for how to do so? I’m so scared", "url": "https://www.reddit.com/r/SuicideWatch/comments/iw8eck/boyfriend_attempted_suicide_and_cheated_on_me/", "title": "Boyfriend attempted suicide and cheated on me - trying to understand his side", "social_network": "reddit", "user": "lalalalagarbage", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1600581542, "permalink": "/r/SuicideWatch/comments/iw8eck/boyfriend_attempted_suicide_and_cheated_on_me/", "nsfw": false, "first_save": 1635425248.6073694, "replies_charged": false}