{"id": "t5_2qpzs_t3_mnozl6", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "I am unemployed. 4 years now. I have 27 years old, gradueted on college and I live with my parents. I simply dont leave my room. And it is not because of the pandemic, was prior to it (to be fair the pandemic didnt change nothing to me). I dont now how to do anything. I dont have any skills. I tried to learn some things in that time, but I keep giving up. I spent most of my days in my bad. I used the pandemic relief money to buy a console and sign up game pass and for a time I just played. I am not addicted or anything, but at least I wasnt in my bad look to the ceiling.\n\nBut I am bored. My days are the same since I finnished college and didnt found a job, I tried, my country was in a recession, I think that got a little in my way. But I am bored. My days are the same for 4 years: nothing. I became kind of paranoid that time too. I deactivated all the phones and keep my smartphone on airplane mode 24 hours. Everyphone call made me nervous. Every car parked in front of my house I watched just to see if they were planning something on me. That time was terryfing, but at least I felt things. Now I just dont do that, I am bored. My days are the same, I dont have any skills, I am not good in anything, I dont now how to do anything.\n\nSo I started thinking: why keep living like this? If my entire life will be that way, I just prefer abbreviate. O dont know, I dont think of suicide, I just think antecipate something that someday will happen anyway and my life is just the same everyday, so, yeah, abbreviate. There is nothing to happen to me anyway, I will not losing anything. \n\nI dont think activelly on that. Is more like a passive thought that come time to time. I dont want to fail in that (very likely) and become a vegetable or destroying my parents life, creating some drama or something like that.\n\nSo I just stay in my bad looking to ceiling or playing something sometimes.\n\nIs normal someone abbreviate their lives just of boredom?", "url": "https://www.reddit.com/r/SuicideWatch/comments/mnozl6/i_feel_bored_some_years_ago_i_had_that_phase_of/", "title": "I feel bored. Some years ago I had that \"phase\" of pain and sadness. But today I dont feel that anymore. I barely feel anything, I think that is called \"apathy\" or something like that. I am so bored that I keep thonking \"well, thats it? If is to live like this I just prefer not keep going\"", "social_network": "reddit", "user": "f0lk_blues", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1617997289, "permalink": "/r/SuicideWatch/comments/mnozl6/i_feel_bored_some_years_ago_i_had_that_phase_of/", "nsfw": false, "first_save": 1635427077.9585354, "replies_charged": false}