{"id": "t5_2qpzs_t3_pp1em5", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I will never have any sexual experiences with any women. My dreams are torture. I wish I wasn't capable of having dreams, because they will never come true. I am incapable of making them come true. Without any intimate connection, my life is meaningless. So many guys can just get what they desire. I cannot. I have tried, and the brutal, painfully process of trying to learn how is too much for me to bear anymore. The thought of anyone enjoying each other sexually has become like poison for my mind. The image of it creates a pit in my stomach and makes me want to vomit. It is even worse knowing that those few women who I actually liked are so deeply with others when I am unable to. Sexual fantasy has become torture to me, but I cannot choose to continue to live a life without it. I am always on the outside looking in. \n\nAll I can think about is putting an end to this life already. I can't focus on work. Socializing has become more difficult than it already is. I can't keep my mind focused. I can't stop the rumination. The excruciatingly painful images of that kind of love, pleasure, and connectedness... just being genuinely desired by another person... I can't take it anymore. \n\nIt is all so hopeless. I'm NOT strong enough to keep going. I'm a weak man. A very weak man.  Not strong enough to deal with this anymore. I refuse to masturbate anymore. I am so lonely. There is no cure for this.  I can't do this anymore. I see the sunset and I begin to cry. I wish every day could be my last, so that I would not wake up to experience the next. I am desperate. I am pathetic. I am too depressed and socially anxious  to connect with any woman. The pain of this is too much to bear. There is nothing in life to sufficiently distract me from this.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pp1em5/i_will_never_get_what_i_want_out_of_life_it_is/", "title": "I will never get what I want out of life, it is too painful to live with", "social_network": "reddit", "user": "Vast-Exchange3353", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1631747814, "permalink": "/r/SuicideWatch/comments/pp1em5/i_will_never_get_what_i_want_out_of_life_it_is/", "nsfw": false, "first_save": 1635427997.578775, "replies_charged": false}