{"id": "t5_2qpzs_t3_ozifxs", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d"], "text": "Background info:\nHaven’t had any friends since age of 16. Have social anxiety. Low self esteem. Dislike my appearance, no motivation to improve it.I’m also gay and have never been in a relationship.\n\nIn feb 2020 last year I realised I needed to make improvements in my life. Realised I couldn’t be a loner forever. Decided to apply for university which I will be starting this year September 2021. Whole point of going to university is to become more sociable and make friends and also hopefully find a boyfriend eventually. Stupid me forgot to signup for accomodation though and the good accomodation (I’m talking about how sociable the people are),has been snatched up and the only accomodation left to choose from is reviewed as having people not as social. Feel free disappointed in myself for not missing the opportunity to book better accomodation and therefore have the chance to make friends. \n\nFeel really hopeless and disappointed in myself. Feel very alone inside my head and all i wanna do is cry.\n\n==========\n\nEdit - Please Read:\n\nHi everyone, I might be able to change my uni accomodation but only if I have extenuating circumstances. I don’t think I have any 😥 \n\nPlease can I have some help with coming up with some extenuating circumstance excuse as to why I should be able to change my selected uni-owned accommodation? \n\nI would be eternally grateful if anyone could help, I would be the most thankful person in the world and if there’s anything I can do to repay you, please let me know. 🙏", "url": "https://www.reddit.com/r/SuicideWatch/comments/ozifxs/21_yr_old_failure_at_life/", "title": "21 yr old Failure at life", "social_network": "reddit", "user": "Low_Pepper6450", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 52, "down_vote": 0, "creation": 1628293617, "permalink": "/r/SuicideWatch/comments/ozifxs/21_yr_old_failure_at_life/", "nsfw": false, "first_save": 1635426912.0660117, "replies_charged": false}