{"id": "t5_2qpzs_t3_pl5mq7", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "Hi guys. Quick backstory.\n\nWas on citalopram for 5 years, worked a charm. For some reason this march i decided to come off them. Tapered down, gradually got there, minimal withdrawals and it was all good. Was happy, bits of anxiety here and there but by and large happy, living well and life was tolerable.\n\nThen there was about a month span in which i had multiple job interviews, i was drinking too much, bit too much caffeine, and I was getting vaccine (fear of needles) to 'cope' with these stressful events (my reasoning) by really just to do recreationally, I ended up on a benzo binge. Then I ended up having a massive anxiety attack due to what I believe were benzo withdrawals, about 3 days after my last xanax. The idea that they werent and werent and were in fact the result of my brain on its own is too scary a thought for me to face.\n\nSo, I restarted citalopram on only 10mg. Fine for 5 days or so, actually feeling almost happy, then side effects hit like a tonne of bricks. Insomnia, anxiety, fatigue, muscle twitches, dry heaving in the morning. Would gradually get better at nights. At night id say I hope i feel like this or better tomorrow.\n\n6 weeks later and its the same, its been hell. I have sometimes almost a week of feeling like Im maybe getting better. I still feel shit, but not overwhelmingly, life fuckingly shit. Yesterday was even mildly enjoyable, especially at night. Then a day or two will hit where I sleep fitfully, and barely, am wide awake early, 6 or 7 am, and it is TORTURE until 7 or 8 am, at which point it eases off a bit.\n\nI have decided to taper off the citalopram. Tuesday was so bad that for the first time in my life suicide is something I cant stop thinking about, not just an abstract thing I have a premonition I might do.\n\nI have felt so awful, existence so unbearable, and having no control over it. It just comes and goes. I am desperare for it to go for good soon, because if this is living then i cant do it. I love my family and friends, I have a beautiful lady, but if life is this painful and its torture to get through the day, i cant do it. Its not living, its just surviving.\n\nPlease, if anyone has similar experiences or advice, help me. Its been a month and a bit of so few bright spots and I just want my life back. Am terrified at the idea that this will continue after stopping the medication.\n\nThank you", "url": "https://www.reddit.com/r/SuicideWatch/comments/pl5mq7/close_to_throwing_in_the_towel_losing_hope_any/", "title": "Close to throwing in the towel. Losing hope. Any advice?", "social_network": "reddit", "user": "Oscar_Dondarrion", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1631218394, "permalink": "/r/SuicideWatch/comments/pl5mq7/close_to_throwing_in_the_towel_losing_hope_any/", "nsfw": false, "first_save": 1635426554.2654328, "replies_charged": false}