{"id": "t5_2qpzs_t3_ci6w9e", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I went to a park at night with a foldable chair and an improvised noose.\n\nRepeated myself \"everything is a lie, just go, you have 1h of life left, this is over, just go, don't listen to the reasons to stay,  just go, just go\" in my head.\n\nFelt weird to walk around with a chair under my arm and see all the people and feel like I'm never going to see them again.\nI would be out of their fucking mess.\n\nFound an isolated tree, realized the chair wouldn't work because the floor was at an angle and it didn't give me support.\n\nI had to climb the tree in order to put the \"rope\" in place.\nI failed to do it correctly, sat down for some minutes, then got up and readjusted the rope again.\n\nClimbed the tree in order to put the noose around my neck.\nI then went ahead and left my legs suspending while I was hanging still with my arms attached to the branch.\n\nI was breathing really hard and my hands were sweaty.\nInstead of letting go and saying goodbye, I climbed again with my arms and while holding my body with one arm, I used my other free arm to get rid of the noose. \n\nThen I landed on the floor.\nWalked around a bit, thought about my stuff.\n\nI got back home, with the chair and everything.\nThe next day I went to work as if nothing happened, feels weird.\n(got fired a couple of days after since I didn't pass the test period, so funny)\n\nI still look for good trees to this day in case I want to try again.\n\nCurrently taking paroxetine pills to help me out a bit, I go to the gym and it cheers me up a bit to see my body grow in strength, it's nice.\n\nThe rest of the things that make me feel depressed stay kinda the same. I'm just tired and I feel like I'm pretending to care about life when in reality I don't.\n\nIt's like I'm sleepwalking through life.\nFeeling anxious and sad over things I don't give a shit about. Why bother, right?\n\nAnyways, thank you for listening, you are not alone, at least we have this place to talk about our shit.\n\nPeace.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ci6w9e/tried_to_hang_myself_but_didnt_let_go/", "title": "Tried to hang myself, but didn't let go.", "social_network": "reddit", "user": "empty_01", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 49, "down_vote": 0, "creation": 1564167362, "permalink": "/r/SuicideWatch/comments/ci6w9e/tried_to_hang_myself_but_didnt_let_go/", "nsfw": false, "first_save": 1635422328.6739645, "replies_charged": false}