{"id": "t5_2qpzs_t3_lr1wu4", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "I no longer care if I die or not. The only thing stopping me is that it requires some steps and I don't have the motivation for those steps. I have otherwise watched my life wither away and felt the pain of dying many times. \n\nThere are people in my life who know I'm depressed and that I don't want to do anything with my life. They have tried to save me. Some have tried to give me motivation and hope that I'll find something that will make me happy. \n\nSome have created problems for me to make my life more difficult, feeling proud that they made me come alive with stress and fear. I hate those people. Why do you think that I want to get injured? Why do you think that I want more problems? Those people try to fool me into living with pain and difficulties, but I am now at the point where I almost don't care what they do to me. I just want to be dead already. Life was stupid and pointless. A rat race to nowhere.\n\nI don't want to be here tomorrow. I want to die without moving.\n\nI don't want to be here ever again. If I were to stay alive, I don't want what anyone says to make me live. I don't want to be afraid, to get startled, or to get angry. I don't want to be happy. I don't want to feel love or joy or anything. I'm tired of seeing things and hearing things. I'm tired of tasting and feeling things. I don't want to smell anymore, either. I'm sick of it all.\n\nThere's no one I want to write a letter to. I don't care about any of them. \n\nI want to lean back, fall into a black hole, and be done. \n\nI'm so sick of the voice in my head that tells me I should or shouldn't post this. I'm sick of wondering or worrying about everyone's replies. I'm sick of worrying about whether someone will try to save me and prevent me from finally returning to the Earth.\n\nI've worked my whole life for this. I did everything I wanted to do. Now I want to go back to wherever I came from. I want this life to be over.\n\nI'm sick of it. I'm sick of it. I'm sick of boredom. I'm sick of everything. I don't want to find another exciting thing. I don't want another mystery. I don't want anything interesting to happen. I don't want to save lives. I don't want to be on the run. I don't want to get the girl or have kids or anything else.\n\nI just want to go home. God, please let me go home. I just want to go home. Thanks for the adventures and the experiences. It was a fun little game and mystery. Now I just want to go home. Please take me back. You can have everything that's left. I'm no longer interested in it. Please let me go.", "url": "https://www.reddit.com/r/SuicideWatch/comments/lr1wu4/im_not_afraid_to_die_but_i_dont_have_the/", "title": "I'm not afraid to die, but I don't have the motivation to die", "social_network": "reddit", "user": "imthinkingaboutit3", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1614135445, "permalink": "/r/SuicideWatch/comments/lr1wu4/im_not_afraid_to_die_but_i_dont_have_the/", "nsfw": false, "first_save": 1635427086.4266956, "replies_charged": false}