{"id": "t5_2qpzs_t3_5otebw", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "I guess to start off everything, I'm a 21 year old guy and I have recently been put on medical leave at my university. I was once part of a combined physician assistant BS/MS 5 year program. I had pretty good grades (mostly As with a few Bs) and was very active as a student. But due to an incident involving alcohol and suicidal behavior (which resulted in me being put on medical leave), I have been kicked out of the 5 year program but will be able to finish my bachelor degree next year at the university.\n\nI've known for a long time that I have some sort of depression and anxiety related illnesses, probably since even Middle School. I went to the behavioral hospital for a week of IOP therapy and was diagnosed with PTSD and MDD. A few weeks later I went to another clinic and was diagnosed with GAD and Bipolar type 2. So I guess I'm a medical mystery but the point is something is wrong with me.\n\nA few months in I've completed a DBT program and have been regularly taking my medications as prescribed and haven't touched any alcohol (nor do I plan to). But the thing is, even with all this treatment, I still experience suicidal ideation around every few hours. My psychiatrist has been changing the medications and dosages, and I tell him that I do feel better, but the reality is I just tell him and my parents that so they can feel confident that the treatment is working and get off my back.\n\nIn my mind I've already given up. I'm back at home and have absolutely no friends here, while my best friends, who are at uni on practically the other side of the US, are actually accomplishing their goals and moving forward. They've been very supportive and said they look forward to seeing me in the Fall, but I honestly just feel like all I'm doing is burdening them.\n\nMy parents both work and are still very pissed off that I basically threw away my future and that now I'm simply sucking their money dry with the cost of treatment. The worst part isn't them feeling angry though, it's having them feel disappointed in me and feeling hopeless knowing that every time I've had the chance to succeed and excell I've always thrown it all away.\n\nNow I've gotten to the point where I truly believe that committing suicide isn't only the best decision for me, but for my friends and family as well. I'm not some heartless bastard (or not totally heartless anyway), I really do love them very much and wish the best for them. I feel like all I'm doing is wasting people's time and energy by having such close relationships with these people and knowing in the back of my head that that time and energy would be better spent on someone who isn't suicidal and can provide more for them than I ever could. Killing myself will also relieve my family of a financial burden, and that they can spend more money on themselves and my little brother who's current attending college.\n\nNow this might sound kind of weird, but right now I think of all my loved ones as a single person and myself as a leg with sepsis. They try so hard to fix me and take care of me even if all I seem to do is hurt them and cause pain and exhaust resources. But eventually, they'll have to come to realize that no amount of treatment can save the leg and the limb will have to be cut off in order to stop the infection from spreading and save the person, no matter how much it hurts.\n\nNow, I'm not saying I'm for sure going to kill myself and if I do commit suicide it likely won't be any time soon. But when I have suicidal ideations, I don't think to myself \"what if I committed suicide\". Now I think to myself \"when, where, and how will I commit suicide\", and I have come to the realization that I have been thinking like this for years.\n\nI have come to the conclusion that as time goes on unless something changes and I find some meaning in myself and my life, I'm going to do my loved ones and myself a favor and finally cut the fucking leg off.", "url": "https://www.reddit.com/r/SuicideWatch/comments/5otebw/suicidal_ideation_replacing_if_to_when/", "title": "Suicidal Ideation: Replacing \"if\" to \"when\"", "social_network": "reddit", "user": "BB22981", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 17, "down_vote": 0, "creation": 1484786637, "permalink": "/r/SuicideWatch/comments/5otebw/suicidal_ideation_replacing_if_to_when/", "nsfw": false, "first_save": 1635425259.8677394, "replies_charged": false}