{"id": "t5_2qpzs_t3_n4ny4j", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "I have a good amount of them (100+ I think) as my psychiatrist has been prescribing them to me on a monthly basis to be taken as needed, but I haven’t needed them to sleep so far. I’ve been collecting them for half a year, determined to get as many as possible so that it’ll be enough for me to successfully kill myself. I plan to just down them all with one of those little convenience store shot bottles of alcohol. Or take all of them with water and get zonked out of my head, and put a belt around my neck before then so that I’ll be able to hang myself while overdosing. Or slit my wrists while feeling all woozy from the overdose because the pain that’d stopped me before will go away on this med. \n\nI’m just so done with feeling so exhausted and hopeless all of the time. I feel like I’m endlessly carrying an insurmountable amount of unexplainable pain in my body, and it’s hidden somewhere within me that I can’t find. I’m not doing this out of resentment for the world or because I think that nobody loves me, because I know now that I have friends and family that do love me (please don’t guilt-trip me as an intervention strategy). \n\nI guess I’m just so tired of feeling so awful all the time, of being scared of everyone, of expecting myself to be raped and having that fear in my head 24/7 following me around like a shadow. I’m tired of the constant intense urge to ruin myself, whether through self-harm or suicide, or more recently, selling my body and giving consent to ‘buyers’ to violently rape me because I know that I deserve it, and because I’m tired of fearing it. At least if I make myself want to be raped, and put myself out there to be, then it’ll hurt less because someone will do it anyway because I asked for it. I’m exhausted over feeling triggered with every piece of media online and in papers, talking about cases of sexual assault and rape, and having to feel this horrible feeling in my chest where I feel like I’m the one that’s been violated. Like I want to be. \n\nI know that these are just responses to my sexual violence trauma; I just can’t see myself coping with this much longer anymore. Even with seeing a therapist so often. And trying to cope with an eating disorder that’s basically being trivialised as ‘fat people anorexia’, and honestly crippling depression.\n\nAnd the psych wards here are so unhelpful and have only made things worse for me in the past, so those aren’t really an option for me right now. \n\nI have the zopiclones ready. I have my plans. I just really want to know how much I need or if they’re all already sufficient for me to end this heaviness once and for all. Please let me know.", "url": "https://www.reddit.com/r/SuicideWatch/comments/n4ny4j/how_many_sleeping_pills_will_kill_me/", "title": "How many sleeping pills will kill me?", "social_network": "reddit", "user": "ennaxanne", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1620133765, "permalink": "/r/SuicideWatch/comments/n4ny4j/how_many_sleeping_pills_will_kill_me/", "nsfw": false, "first_save": 1635422275.4067888, "replies_charged": false}