{"id": "t5_2qpzs_t3_qdbad8", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "This is going to be a long one. \n\nIn November 2018 I reconnected with a friend from my childhood. I haven't seen or spoken to her since age 9 just popped up on Facebook one day. \n\nShe had no limbs. Quadruple amputee. She lost her limbs from misdiagnosed with the flu while she was really suffering from pneumonia. Illness advanced and she passed out from something related to it. Her blood pressure dropped dangerously low, they put her in a medically induced coma, administered something to increase her blood pressure and failed to monitor her. Her limbs started slowly rotting off and by the time the hospital staff noticed it was beyond saving. \n\nPost operation and after she is stabilized after spending a few months in the hospital, she is booted on the street with her mom and three kids. Forced to live in a Motel 6, while slowly starving to death. Completely unaware that she could file a lawsuit, file for disability, and other benefits. \n\nThis is where I reconnected with her. At the time I was working in Afghanistan, so I had the extra money. I helped her find a lawyer, file for disability and gave her approximately $60,000 to help with medication and living expenses. \n\nFast forward to June 2020 and she is awarded $8 million in a structured settlement. $750k upfront and $20k per month for 15 years. She gave me $200k for my assistance. I am still in Afghanistan at the time and the money hit in August 2020. \n\nIn November 2020, she asks me for help because she paid cash for her house and was low on cash. She is on approximately $8000 per month of medication, so it seems reasonable and I am still in Afghanistan at the time making decent money. I can afford to help and she has a plan to sell part of her settlement to J.G. Wentworth. \n\nJ.G. Wentworth totally screwed up the paperwork and issued a bad check for approximately $500k in March 2021.  Sets off all kinds of fraud alerts with Bank ofAmerica. Wentworth insists it is not a problem on their side. We worked with a SVP for Bank of America for two months trying to figure this out. \n\nMeanwhile J. G. Wentworth is taking her $20k a month as part of the contract. She is bleeding me dry financially over this. \n\nShe hires a lawyer in June to review everything. He finds multiple errors on J.G. Wentworth and Bank of America's part. \n\nJune 2021, I lose my job in Afghanistan because of the withdrawal.\n\nShe is constantly in and out of the hospital because she can not afford her medication on a consistent basis. Bank of America schedules appointments and cancels constantly. I think they are trying to kill her to avoid a potential lawsuit. Her lawyer is fighting as hard as possible but since it is a business transaction and she is of sound mental capacity Bank of America requires her presence at every meeting to try to resolve this. Hard to do since they are the gatekeeper for over $500,000 and she can't afford her medication to get discharged to make it to the meetings.\n\nAnd my wife left me over this because she swears I'm fucking someone with no limbs and an oxygen tank. I have my kinks but that is not one of them. \n\nTLDR; trying to take care of a disabled friend has put me on the verge of financial ruin and suicide.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qdbad8/tried_to_be_a_good_person_ruined_myself_and_want/", "title": "Tried to be a good person. Ruined myself and want to eat my gun.", "social_network": "reddit", "user": "jb1708", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1634885890, "permalink": "/r/SuicideWatch/comments/qdbad8/tried_to_be_a_good_person_ruined_myself_and_want/", "nsfw": false, "first_save": 1635425540.6314518, "replies_charged": false}