{"id": "t5_2qpzs_t3_qh381b", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "My friend is suicidal person with autism. She had a routine of following a particular podcast on a tiny Youtube channel, until the hosting couple found it suitable for entertainment purposes to brutally mock a person with diagnosed neurological disorder who had a meltdown in a public space and specifically attack on and laugh at her neurological symptoms. Meltdowns are relatively common for people with autism and certain other neurological conditions, and are not a choice; they occur when one’s body goes to fight or flight mode and are rarely preventable. My friend was quite hurt by the hosts’ actions and left a couple of very polite comments trying explain from a medical perspective and her own experience what the person they were mocking was going through.\n\nMy friend’s commentary was immediately blocked and all her comments removed, followed by a new podcast where the hosting couple was raving about their ideas being attacked on the comments and they went on a long rant on people with “mental illnesses”. They included thoughts on how mental symptoms are nothing, but “woke”, there is no excuse for abnormal behavior and people with “mental illnesses” should “simply” get help to fix themselves and should not roam in public. They specifically claimed the people like the woman with the meltdown (and all with such symptoms) are dangerous and unfit for society. They had encouraged their viewers to film any abnormal behavior and show it to the public to “shame” these people so that it might help them become better. They announced that “it’s never bullying when you’re calling someone out”. It was an hour long podcast filled with devastating ignorance and misinformation. Much of it was directed at my friend who was specifically referred and “apparently behaves this way” with multiple references of her being unfit for society and a worthless being.\n\nI am not saying this was the only reason, but it was enough to be the last push to my friend with suicidal thoughts and she is currently in the hospital fighting for her life. I nearly lost her. She still feels like a completely unwelcome being in the world, “faulty” and hurt beyond words by the hosts’ commentary. \n\nI sent a message to the main host of the podcast and gave her a piece of my mind of her recent podcast and explained what had happened to my friend. I wanted her to realize the impact her mockery has on people. I wasn’t anywhere near as harsh with my words as I could have been (this person is far more harsh with her words and critique towards various people on her channel), I recall the most forceful sentence I said was that she should be ashamed of herself. This person responded to me, saying she has “never” said mental illnesses aren’t real because “we all feel down sometimes” was adamant that she has done nothing wrong and that I have simply “misunderstood” her. I told her to have a long look into the mirror and made a reference to her earlier words about her encouragement to call out on people.\n\nMy friend almost died. There is no misunderstanding there and the situation is as concrete as can be. Everything she said earlier is on video, in her own recorded words. Anything else reeks of gaslighting to me.\n\nAnother podcast followed which was about the host having been attacked by a “fake woke warrior” and how she heroically survived this horrendous event. The hosts were smirking and literally laughing about my friend nearly dying. The main host ranted in the hour long podcast about my mental incapacity, madness and lack of values (which are due to wokeness, according to her) and how she never should have lowered herself to respond to someone like me. She encouraged her viewers to verbally attack me.\n\nMy friend is as sweet and harmless as can be without a malicious bone in her body. I fail to see how treating and acknowledging her as a human being is “woke”. She’s had therapy and medication for the suicidal thoughts for years now (no lack of effort there), but it’s a long and difficult path even without the ignorance, bullying and stigma that makes it all worse. I never used any foul or inappropriate language when messaging to this person, I gave her critique and my opinion. One doesn’t have to agree with me, but laughing about my friend nearly dying and creating an hour long podcast to badmouth and insult me and encouraging people to attack me feels extreme to me. \n\nI honestly don’t feel bad about messaging her; I absolutely defend any friend or family member of mine at any given time.\n\nI feel helpless and crushed. Any advice how I can help my friend? I just had to share this somewhere with understanding.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qh381b/i_confronted_the_person_that_nearly_caused_my/", "title": "I confronted the person that nearly caused my disabled and suicidal friend’s death. She laughs at her and created a public podcast to badmouth me.", "social_network": "reddit", "user": "No_Place3089", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635359423, "permalink": "/r/SuicideWatch/comments/qh381b/i_confronted_the_person_that_nearly_caused_my/", "nsfw": false, "first_save": 1635425590.3208573, "replies_charged": false}