{"id": "t5_2qpzs_t3_gc8fup", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "I can't rant to anyone or at anyplace else, so I guess this is now my place.\n\nI've been suffering from chronic pain issues my whole life, but never realised that it's something normal people don't experience. The past two years it got worse and worse, to such an extent that I've lost my passions due to being in pain, both in the things I love to do and my study. I can't continue my studies, I can't find a job that provides me with enough money to live - I can't even enjoy life anymore, because everything. hurts. all the fucking time. Going out with friends? Enjoy being in pain for the next 48 hours. Celebrating a nice evening with board games and some beers? Say hello to a few more days of being barely able to move.\n\nI don't even know if I'm clinically depressed because to me the reason behind my depression is some form of grief (grieving about what I lost, I guess), which is one of the exclusion criteria of a depression. I've tried to find any help when I went to a psychologist for some unrelated issues and answered all questions on the questionnaire (standard practise) before the intake took place truthfully. He didn't even mention it (!) so I had to bring it up. He asked me to send him an email after two weeks, basically to make sure I still was alive by then. I send him an email saying things were okay, my mood differed a bit by day and that was it. His respons? \"Oh, I'm curious as to what causes you to feel differently. Send me a message if you want to talk.\"  \nThat's..... not exactly how these things work. I might get help, but it feels like it's miles away. And even then? I won't be able to live my life. I won't be able to hold a job. I can't get an own place to live, I will never be independent, I am probably not able to get children and be a parent - I can barely take care of myself.\n\nI just want this to end. I don't want to live this half-life, this... parody of what life's supposed to be. The only reason I'm still alive is that I take care of my neighbour, who is too old to get his own groceries and who has no family left. If I die before he does I'll probably kill him.   \nBut I want to die. Or I don't want to live anymore, I guess - not this life, anyway. My issues won't go away and the only things I can do are \"learn to live with it!!\" and \"learn to enjoy life in a different way!!\". But I don't know how. I've tried to get pain killers, but couldn't get any because I'm too young and my issues are chronic, so that means opiates are a no go. Very, very few things actually make a change these days.  \nI've given myself a year and I'm already a bit into that. If things don't change after that... well, I kind of hope my neighbour won't live for another few years or I need to find someone to take care of him. I can't go through this for much longer. My depression is obviously making things harder - it's a challenge these last few days to get even out of bed - but it's not the main reason for me wanting to not-live. I know people care about me. I know people will feel sad and/or guilty if I take faith into my own hands, but... I know I feel like shit if I keep living like this.\n\nI just don't know anymore. I can't talk about this - I tried and it didn't end well - with anyone I know, so I guess posting on an anonymous site with a throwaway account is all I've got left. I feel so fucking guilty because I do not want to hurt people, but living this half life is not what I signed up for. I want it to be over with.", "url": "https://www.reddit.com/r/SuicideWatch/comments/gc8fup/life_feels_like_its_too_much_right_now/", "title": "Life feels like it's too much right now", "social_network": "reddit", "user": "ThrowAwayMySam", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1588433809, "permalink": "/r/SuicideWatch/comments/gc8fup/life_feels_like_its_too_much_right_now/", "nsfw": false, "first_save": 1635427162.4215715, "replies_charged": false}