{"id": "t5_2qpzs_t3_q8522a", "request": ["bb7832fd-0306-444d-8835-3c87888dc029", "bd24e5dc-1a86-4808-94df-346d0c1d2c42"], "text": "As the title states, I've always wondered if it could be better for me to just stop existing. I've thought so much about the meaning of death, what would come after it, why I should do it and why not. \n\nI've always tried to stop these thoughts and subsequent actions because I knew (and know) how everyone around me would take it. \n\nWhat's stopping me to do it is basically who's around me, if I were alone, I basically would've done it already. \n\nMaybe I'm scared about what others would think of me after my death; even worse, that my parents would feel the blame for something they couldn't do anything about.\n\nI'm stuck in a limbo. I'm in a state where I'm not even depressed about life, sometimes I'm happy about it, for a bit, but then I realise how calming would be to just die and leave everything behind. \n\nI'm not sad most of the time; I just would like to get a chance to die. An accident, a sickness, something that wouldn't raise suspect about my desire to die. \n\nI know I sound dumb, maybe I am, but that's how I feel. Right now I'm just living a life that is meaningless to me, no matter how many achievement I get, how many blessing I have, after a second I realise that I would be better dead. \n\nThe real problem here is that I can't decide whether just dying, and make everyone around me sad, or keep living, just not to upset others. I've always been like this, I can't decide between two paths, and I always keep my feet on both. \n\nMaybe my real problem is the way I look at life, maybe I can't find the real beauty behind it, maybe I just need someone to fill a hole in my heart, maybe an ideal to follow. \n\nI'm just a mess who's indecisive and a whiner.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q8522a/ive_been_having_suicidal_thoughts_since_young_age/", "title": "I've been having suicidal thoughts since young age, never done anything about it", "social_network": "reddit", "user": "JeanwhyImhere", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1634234268, "permalink": "/r/SuicideWatch/comments/q8522a/ive_been_having_suicidal_thoughts_since_young_age/", "nsfw": false, "first_save": 1635426608.3476784, "replies_charged": false}