{"id": "t5_2qpzs_t3_pwtcsg", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "i think about killing myself too often.\n\ni am 16 years old. and yes, i know i have my whole life ahead of me, but it doesn't really feel like that will be too enjoyable.\n\nI have a little amount of friends because i am terrified of social interaction and tend to repel people because i have bpd and lash out sometimes at people for nothing. it's super, super difficult for me to make friends and when i leave my school in 2 years time I'll have nobody, and I'll have to start all over again.\n\nMy self esteem is low again. I no longer think I am attractive physically or emotionally, and I don't see myself having a partner who really loves me, and who I really love back. All the boys that go to my school are very unattractive to me and I don't see myself with any of them, and it's difficult to find anyone else. I feel stuck. Seeing happy couples and attractive boys who are taken on social media really doesn't help. The stress of feeling like i have to look good every day at school makes me panic whenever I am there, and sometimes I have to go home early because I am so emotionally overwhelmed. \n\nI've had anorexia for a year and a half now, and it doesn't sound that long, but it feels like I've had it my whole life. I go through periods of recovery, but at the end of the day it never truly goes away.\n\nI feel so trapped in my everyday life. I wake up and get ready, go to school and then go to work and go home. Make money, then spend it away. Do work, then hand it in. It feels like an endless cycle, and I'm not enjoying it at all. Most of the time it feels like I'm just waiting for it to be over.\n\nI don't know what to do. I long for change, but I'm not even old enough to drive yet, let alone move house or leave school or get a proper job. I feel like I'm wasting my time away and I want to be out experiencing the world and all the people in it, instead of spending most of my time in a school I have been in since I was 11. I can't move schools either, because I have to walk to school and it is the closest one.\n\nIt feels like waiting for a life I actually enjoy is a horrible process. I'd just rather it to be over.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pwtcsg/rant/", "title": "rant", "social_network": "reddit", "user": "pastelwaxcrayons", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1632785278, "permalink": "/r/SuicideWatch/comments/pwtcsg/rant/", "nsfw": false, "first_save": 1635422253.1967266, "replies_charged": false}