{"id": "t5_2qpzs_t3_pnssug", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111", "86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "It would've been the fourth or fifth attempt, but this was going to be the time when I finally did it. I realized that I have access to a method that will be highly lethal if done correctly. All I need is a few hours in which people wouldn't interrupt. But I digress because I got interrupted by a call and decided to give it one more go at life.\n\nIt's been ten years of being a hermit, not using my degree and driving my parent's (others, frankly) crazy with my presence and emotional neediness/impulsivity. I've pushed away my friends by my inability to grow past all the negativity. I lie in my bed most of the time staring at this screen in boredom to pass the time, but my un-stimulated moments are all dread of myself, the world and the prospect that I can ever be happy.\n\nIt also happens to be the first times in months I applied for a job. I was getting things ready for my attempt when they called back. After setting up a virtual interview, part of me is thinking that I don't even want this barista job even if I can successfully land it. Part of me really just wants to die and I came that close today. Most of the other times, I abandoned the attempt or cried out for help before and went to the hospital. This time, I was really just going to lie down with some music and a blanket and fall asleep when I knew no one would be home for hours. Looking at when someone did arrive home, I know I'd be dead right now if that call to setup an interview didn't come in.\n\nBut how is my attitude ever going to change? Therapy hasn't helped. I'm really not willing to live. The question of willingness and existential stuff has come up at various junctures throughout my decade of struggling with serious mental illness.\n\nI'm willing in a passive sense, so not really willing. I'm willing to see what happens, but I don't really have it in me to invert the whole dynamic of my existence and MAKE myself do positive things. I'm just really out of it. Maybe the new antidepressant (a totally new class for me) is starting to have the affect of motivating me a little more, but what I felt most determined to do was kill myself as soon as I put that online application in.\n\nWhy? Because I can't envision anything good ever coming from anything I do. I can't envision anythng but me being a failure. I can't envision anything but me NOT being able to detach from the stress of work to pursue hobbies or goals like grad school applications even if I get into the rhythm of a job. I can't imagine not being nervous about making mistakes to the point that I'll be constantly making them. I can't imagine NOT fucking everything up and just going through another cycle of loathing myself. \n\nI've been so close to snapping for years. My life is unmanageable and a burden on others. I just want to be done with it and let go finally. All the negative experiences and feelings of the world? I feel them, I experience them. But the positive side of things? The determination, hope, reward, comfort, confidence, satisfaction? That's all completely alien to me, like an exoplanet said to support life. \n\nI don't know how to get out of who I've become. I've had every level of mental healthcare imaginable except residential, which is frankly for people with really great insurance or swimming pools of money. The problem is me though.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pnssug/almost_did_it_today/", "title": "Almost did it today.", "social_network": "reddit", "user": "MentalHealthAlt1", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1631582265, "permalink": "/r/SuicideWatch/comments/pnssug/almost_did_it_today/", "nsfw": false, "first_save": 1635427021.101346, "replies_charged": false}