{"id": "t5_2qpzs_t3_gk7spi", "request": ["ecd4e9a1-2551-4506-a13c-95bd305e923c", "35003726-80f4-4b57-a706-febe3655a157"], "text": "I would literally attempt suicide right now if I thought it would work, but I just feel like I would just end up with permanent damage and be accused of being an attention seeker, when in reality, I just want to die quietly without any fuss. \n\nI hate hearing stuff like, *\"if you fail, it's just a parasuicidal gesture\"* and *\"there are lots of ways to make sure it works,\"* because sure-fire suicide methods are obviously not readily available to the vast majority of people. \n\n* Do I try to poison myself with household products and probably just end up screwing up my organs?\n* Do I try to hang myself and risk brain damage? \n* Do I jump off a tall building and freak out a bunch of people who don't deserve it?\n* Do I kill myself in the bath/pool and make everyone else feel weird about using it afterwards?\n* Do I lie to get a prescription I don't actually need and potentially get someone in trouble?\n* Do I gas myself and put others in harm's way?\n* If I write a note, would that comfort people, or would it just make them feel like they could've \"done something\" and make it worse?\n* Should I ghost my friends before I do it to minimise the casualties? \n* Is it better for my family/friends to find me, or some rando?\n* What place/time would be best to prevent me from being interrupted?\n* Should I endure the pain and wait until I'm a bit older to kill myself so that I'm not seen as some immature, self-centred kid and people in my life don't blame themselves?\n* If I survive, do I lie and say it was impulsive, and not like, years in the making?\n* Should I delete my SNS pages and all the messages that I can before doing it?\n* Should I try between semesters in case I fail and need to take a break because I've messed up my health?\n* Would me killing myself destroy my religious extended family? \n* Should I quit my job beforehand, or do I keep it just in case I survive?\n\nThere is no doubt in my mind that I'm going to do it, but I don't want to before I have a proper plan in place. Partly to minimise the damage, but mostly because I'm just so very worried about the consequences of potentially screwing up. I don't even question whether or not this is what I really want anymore, it's just a matter or how and when. \n\nI wish this self-righteous society didn't censor 99% of helpful information that'll actually let me die instead of end up sick and injured. I wish I didn't have to feel guilty or selfish for wanting this. I wish people would stop spewing their spiritual and philosophical ideologies at me when they have f\\*ck all to do with my personal situation. I wish people would admit that it's possible and even sometimes reasonable to want to kill yourself but not be depressed. I wish people would stop changing their tune about whether or not this will get better or worse with age when it's convenient for them. I wish it wasn't so hard and so morally taboo and so painful and so contentious and so risky to choose what I do with my own freaking life that I never even wanted in the first place.", "url": "https://www.reddit.com/r/SuicideWatch/comments/gk7spi/the_logistics_of_killing_yourself_are_so/", "title": "The logistics of killing yourself are so endlessly, frustratingly complicated", "social_network": "reddit", "user": "Vegetable-Echo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1158, "down_vote": 0, "creation": 1589544010, "permalink": "/r/SuicideWatch/comments/gk7spi/the_logistics_of_killing_yourself_are_so/", "nsfw": false, "first_save": 1635427786.3238482, "replies_charged": false}