{"id": "t5_2qpzs_t3_opmryq", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "I am in an increasingly bad mental state. I just moved to Austin, Texas a few months ago with my girlfriend and things have been spiraling out of control for the both of us and I'm starting to feel there's no fixing things. I'm terrified of being alone, I have social anxiety, and I have become too dependent on her which has taken its toll on her mental health. I am facing repeated thoughts of just wanting my life to be over, I'm so tired of feeling like such a worthless piece of garbage, I'm tired of feeling so alone all the time and that nobody cares. I have debated trying to OD on my seroquel, or OD on drugs like cocaine, I really wish I could just go to sleep and not wake up. I don't know anyone here, my girlfriend wants to leave me, I'm just a fucking mess and I hate myself so god damned much.\n\nI'm trying to do the right thing, I've been getting denied insurance coverage for TMS and EDMR therapies to deal with my mental illness and the longer it gets drawn out the worse things have been getting. I'm tired, I just want to be loved, and I don't even love myself, how can I?? My mom died of suicide at a far younger age than I am now, and I also think I just wish so much that I could be with her. If she was still here my life would not have turned out so shitty, I wouldn't have had to deal with emotional abuse and neglect from my other family members after she died, I wouldn't be a fucking alcoholic addict that can't handle just day to day living.\n\nWhat sucks the most is that I know what I'm capable of, I know I'm an intelligent person with a good job, but this depression, this trauma, this anxiety, it makes me step in my own way and I'm losing that battle a little bit more every single day. I know I'm the only one who can truly overcome this, but in actuality, I don't think I am capable. I don't know what the tipping point will be but it feels like its getting close, I'm one tragic event away from just blowing my brains out. Nobody would even know, I don't want people to mourn me when I die, if I felt otherwise, I'd be much further off from suicide. I'm so far from home, my girlfriend doesn't love me or want to be with me anymore, I have no friends here, I'm like a literal fucking ghost. I have two cats and a dog at home that I love so much, but my girlfriend would care for them if I were gone, she loves those animals to death.\n\nI am running out of reasons to stay alive and it is scaring the hell out of me.", "url": "https://www.reddit.com/r/SuicideWatch/comments/opmryq/inching_closer_and_closer_to_ending_it_all/", "title": "Inching Closer and Closer to Ending it All", "social_network": "reddit", "user": "dudevill666", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1626986992, "permalink": "/r/SuicideWatch/comments/opmryq/inching_closer_and_closer_to_ending_it_all/", "nsfw": false, "first_save": 1635426779.132962, "replies_charged": false}