{"id": "t5_2qpzs_t3_8ucfho", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I am ashamed to admit that I view people as possessions or my friends at least.\n\n When I see them moving on and forgetting about me (even if they’re not) I want to dispose of them. This last year my role in their lives has did a complete 180•, I made everyone laugh, i was swole and a lot louder etc. I’m so fucking frustrated because I can tell they know I’m mentally ill now and they’re leaving me because of it. They cannot even make jokes or just shoot the shit anymore with me. Everyone conversation is relating to my life circumstances or them just making sure I haven’t killed myself, even then it’s just them asking what happened and not responding when I tell them \n\nIt causes me so much pain because I feel the most normal (which isn’t much at all) when I’m with them and they’re the longest i have had friends without moving or just me outgrowing them.\n\nI don’t know if I want to be left alone or if I do anymore.\n\nI know killing myself just places my pain on to other people but I have reside in my mind and I have to deal with this noise every single second I live\n\n(I have been dealing with a lot more this last year than just this, this is just the point of no return for me emotionally I feel like)\n\nMy mother doesn’t love me, I have been homeless for the past 2 years because of her. She says she does and tries to put on a face like she does but her actions have said everything to the contrary. I told her about my sexual assault and she uses it against me at least once a week (is that why you want to wear nail polish? Put your hair in a bun? Etc, I’m a guy)", "url": "https://www.reddit.com/r/SuicideWatch/comments/8ucfho/indecision/", "title": "Indecision", "social_network": "reddit", "user": "Trashacc0921", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1530126617, "permalink": "/r/SuicideWatch/comments/8ucfho/indecision/", "nsfw": false, "first_save": 1635426614.273671, "replies_charged": false}