{"id": "t5_2qpzs_t3_kor3lp", "request": ["56f46b9a-59d4-48f0-aed3-4247ea68706d"], "text": "Sorry if there are grammar mistakes. \n\n\n\n   The sky at around 11:00 in the night looked different. The sky looked like coke had spilled on it. Staining the lighter blue color with now a darker color.\n   The stars were always hard to see, I always wondered why. Why were the stars so hard to see now. In pictures, or television, the stars were all grouped together numerously. They always seemed to sparkle, and twinkle. So how come I could barley see any now. Did I not deserve to see the stars? It felt like a pit in my stomach to not know why I didn’t get to see the stars like everyone else. Was I blind? What am I even being blinded by? It was unfair. Is that why in school they make everyone share? \n  My cheeks turned warm, and my hands started sweating even though it was visibly cold outside. I couldn’t even feel my nose, I could only feel the pain in my chest.\n   What led me to this point. A point where I felt disappointed, disappointed in nobody but myself. I was ashamed. I was embarrassed. I was hurt by my own self, why would I let myself go on like this. \n  My thoughts kept talking to me, talking to me while I slowly guided myself across the pavement. My eyes cluelessly wondered past the street lamps, and signs. There was signs of where I heard cars passing by, flashing their front lights, and their whooshing sound. Somehow though It felt as there was nothing surrounding me. It felt empty, everything felt empty, even though I am surrounded by air, lights, buildings. It all felt empty. \n  Did I feel empty because there were no stars to wish upon? That there were no stars no guide me in the right direction? How could I ever know where I am going if there is not one star to guide me. Where was my south located again? I sighed, and a puff of cold air left my mouth. \n  I felt like my own burden, I felt as I was a weight I had to personally carry around. I felt heavy. I felt like a little kid trying to lift one of their parents weight tools. It was tough, but I pretend I was strong enough to manage. All I am filled now is constantly rambling to myself. All I do is complain. My legs just kept walking, and walking. I cant feel myself moving anymore, and I felt my eyes get filled with liquid. They were so warm, the only thing that comforted me now. The only warmth I was able to grasp was my own tears streaming down. I felt it drip onto the side of my nose, to my quivering lips. \n   It’s funny how crying works, once you allow one tear to slip out, the rest pour like no problem. \n   I say it’s funny, but in reality i’m not even laughing. I guess it’s funny in concept. \n   My eyes blur, and everything mixes together.\n   Stop crying already. Seriously. Shut up. I said shut up. Be quiet. Hush. Please. Please. Please I’m begging you. Please.\n   I kept repeating the words aloud, I begged myself, but I think it was worsening my emotions. I squatted down because I was unable to support my own emotional weight any longer. Tears felt so heavy on my face, my eyes felt like they were sagging. My lips felt plump, and chapped. All I could hear was my own sobs. It was always like that. I was the only one who could always hear myself so clearly. I could taste my own tears as they ran across my lips. What a bitter salty taste. How pathetic. \n  My nose started getting clogged, and that was my cue to take a deep breath. Take a deep breath, and stop crying. Please.\n  I got up slowly, I wiped all my fluids on the sleeve of my sweater. I liked this sweater, it was so soft. I hope the sweater didn’t mind the mess I rubbed onto it. \n  The feeling after crying, was possibly the worst experience I can have. It always felt like a brick, a heavy brick. A heavy brick who was hollow inside. It all felt useless, it didn’t fail after every cry. It just reminded how pathetic I felt. \n   My eyes had cleared up a bit, and I was able to see around me again. I was at a bridge, and the sky looked crisp. The air smelt like pavement, and salty. It was a relaxing smell. I wonder what bridge i’m at, though I didn’t care to much. Just a careless thought to pass by in my head.\n   I walked a bit closer to the railing of the bridge, admiring the rustic stains on it. It smelled of coppery metal, I scrunched my nose at the distinct smell. I turned my head up to look at the dark sky. I sighed once more, I felt so relaxed. Oh, I see a star. I see one star. The star is incredibly tiny, I then noticed how the star was moving a bit fast? Do stars do that? \n  Stars don’t do that, I know they don’t move that fast. It’s a plane isn’t it. I smiled, it was a plane, not a star. I looked around the moving plane, to just see more darkness. So that was it? That’s what the sky is made out of I assume. Black voids of colorless nothing. Is that where we are headed, all of us? I stifled a giggle, how careless I am to think I saw a star.\n    I looked straight again, I could see the river, it flowed slowly. It flowed nicely. \n  I rubbed my face, relieving an itch. I noticed how wet it felt, was I crying this entire time still. My sleeve had soaked up all the liquid on my face. I sniffled, I didn’t even notice the tears still streaming. I really am oblivious. Though now I was aware that i’m still crying. I don’t think I will be able to stop. \n  Why was it so silent tonight? It doesn’t matter though, I really didn’t care. I liked listening to the wind. I took a deep breath in. I attempted to slip off my shoes, I struggled to. I was getting a bit restless. I then thought of what my teacher had said one time in middle school to the class though, “Patience is key.” \n  My shoes finally slipped off after some effort, I decided to fix them up a bit neatly, near the edge of the bridge railing.  There you go, hopefully someone more deserving will put them to good use. \n  I span around, enjoying the air filling my lungs, and how everything turned into a blur.   It was an adrenaline filled moment. Though I had to stop, because my stomach started feeling uneasy. The moment was over, not that it lasted long. Like everything else in this world, everything comes to an end. I focused back to the river. I blinked once more, I wanted to look at the sky once more, but I couldn’t bring myself too. I didn’t want to give myself hope.\n  The tears were still falling, and my face didn’t stop feeling puffy. It’s fine, i’ll stop crying eventually, right...?  \n  I gripped onto the railing, I whimpered at the cold feeling. I made sure both hands were tightly on there, I want to make sure I do this properly. I lifted my right leg over the railing, leaving very little space for my feet to have support, I don’t know how long I could support my feet. I started feeling a song of nervousness. It’s fine. I ignored my own thoughts, and focused on bringing my left leg over. I made sure I was facing the bridge, I wanted to be backwards of the river. \n   I ended up succeeding, but my whole body felt shaky. I honestly think i could fall any second now. My toes were the only thing on a platform currently, so of course I would be a bit scared. It’s only normal.\n  My bottom lip was shaking, so I chomped on it. No matter how hard I bit it, it wouldn’t stop shaking. I felt an immense amount of tears leak from my eyes, to where sobs could be heard loudly i’m sure, but who would listen to my cry’s, no one would. My voice of sobbing was shaky, and my eyes got a bit blurry, so I tried to calm myself down. I convinced the wind was speaking to me. I pretended the wind was someone who was caring for me. I closed my eyes, so I could listen better.\n   “Listen closely child, your in my care now.” I heard the whooshing sounds fill my ears. “You must be tired.” I was tired, really tired. I was starting to feel calmer, and my grip on the rail lightened. “We should made sure you get a good nights sleep, it is very late.” I still felt tingly in my stomach, so it will be better if I let the wind put me to sleep. “Here come, relax. Tomorrow will be better.” I felt happy, even though I wasn’t smiling. I didn’t need to show anyone a smile. I knew I was yearning for a new day, a new li- \n  “Come now, I will treat you like a treasure. I will take care of you on your sick days. I will be there with tissues on your sad days. I will be ready to congratulate you on your proud days. I will be there to support you on your difficult days. I will be there to smile with you on your wonderful days. I will always be there on every single day.” \n  My grip loosened, it was like slow motion. I could feel the rail slipping out of my hands. It was to late, It’s always been to late. Like the wind said, tomorrow will be better. I should try to trust people more, there’s no reason to make things harder for everyone. My feet lost their support, and I leaned backwards. I felt the wind hit my back, I was now falling. It scared me. I wanted to scream, but my throat was dry. It felt like I was choking with one big ball in my throat. I opened my eyes quickly to see the sky one last time, and what do you know. The stars were all there. All of them glistening. I couldn’t get a good look, but I saw them. They were everywhere, just like the pictures I saw. \n  I closed my eyes once more, and sniffed my last breath of air. Goodbye wind. I know I won’t see you tomorrow. Sometimes it’s okay to lie, because I understand it’s for the sake of others. I really do understand.\n  I felt a freezing splash hit my back. It hurt, it hurt a lot. I felt, and heard my bones crack. My ribs throbbed in pain. I couldn’t move at all. I was stuck, just how I was before. I was stuck in a never ending cycle of despair.\n  The water started filling my mouth, and lungs. I couldn’t bare to open my eyes. I wanted my last vision to be of the beautiful stars. My nose burned, and I felt deafening. Everything inside my body burned as I felt my body sink and struggle. \n  I wanted the pain to be over already, it was unbearable. Though, nothing will ever compare to the pain i’ve felt in my chest. \n  I was willing to suffer for one thing to be over, and that one thing was my life. There would be no pain, and that had to be a promise. I felt my conscious dissolving, I was like a piece of chocolate melting. I was drifting away like the next thing on the news. It only last for a couple of days, soon to be discarded. I was trash. I couldn’t feel anymore, the pain my bones went away. Maybe the wind really is putting me to sleep. I can hardly think. I feel like my brain is made out of putty. I made whimpering noises of suffocation. I’m glad things ended like this. I couldn’t have asked for anything more really. I’m grateful. \n  You know earlier when I saw all those stars, I made a wish.\n   My only wish was to become a beautiful star like the ones I saw.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kor3lp/corny_story_i_wrote_about_committing_suicide_just/", "title": "corny story i wrote about committing suicide, just want somebody to read it.", "social_network": "reddit", "user": "alo3vura", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1609563081, "permalink": "/r/SuicideWatch/comments/kor3lp/corny_story_i_wrote_about_committing_suicide_just/", "nsfw": true, "first_save": 1635428404.5269606, "replies_charged": false}