{"id": "t5_2qpzs_t3_q8wd8p", "request": ["4162f604-29a0-4041-a85b-c249e1ca13f8", "ced7dee5-3c4f-499e-9148-47c2a28dc4d7", "21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "It's a stupid thing to write (Part 1). But I need to write this. Don't want to stay with intrusive thoughts alone. English is not my native language.\n\nI'll start with the story of a patient from the USSR.\n\n\"A difficult patient is sent to the doctor. Everyone calls him a neurotic. The doctor is warned  that his next patient has: Melancholy, depression. Even tried to kill himself\n\nThe doctor tells the patient:\"There is  a Soviet humorous writer, his name, if I remember correctly, is Mikhail Zoshchenko. All of us, doctors, nurses, all the staff laughs from his books. He writes such books that you will fall off your chair. Read it and immediately the whole melancholy will pass.\"\n\nThe patient answers: I am this Mikhail Zoshchenko (This is his photo:\n\n[https://phototass3.cdnvideo.ru/width/1200\\_4ce85301/tass/m2/uploads/i/20190810/5123340.jpg](https://phototass3.cdnvideo.ru/width/1200_4ce85301/tass/m2/uploads/i/20190810/5123340.jpg)) \"\n\nMikhail Zoshchenko is one of my favorite writers, not because of his comedies (Honestly, his comedy is outdated. For people who have not lived in the USSR, they will not really understand his humor. I adore him so much, but I still don't love him because of his comedic prose. But because of his book: Before Sunrise.( And because of the story behind that book.)\n\n&#x200B;\n\nBefore Sunrise is  introspection of depression. The book discusses his life and in search of the cause of depression. This post is not an advertisement and this is not one of those books after which: PROBLEMS IN THE FAMILY? BUY THIS BOOK! Problems with the girl. Buy this book. IF YOU WANT TO KILL YOURSELF, BUY THIS BOOK AND YOU WILL WANT to use this book only for reading, and not as a stand for a chair so that you can reach the rope. YOU'LL BE HAPPY 24/7\n\n&#x200B;\n\nThis book is just introspection (one of the first and yes , it's much superior to any Sigmund Freud work . For Its profundity and its beauty. The book is not scientifically reliable. For several reasons\n\nA) A book from the 20th century. Outdated after all\n\nB) He  wrote with the psychotherapist, but still he is not a doctor himself\n\nC) This is a great description of what a person with depression is thinking about. Every psychotherapist should read this book, every person who wants to understand what and how a depressed person thinks should. I am absolutely sure that if a lot of thoughts from the book coincide with a suicidal person.\n\n&#x200B;\n\n\"I began to think: was I born so weak and sensitive, or did something happen in my life that damaged my nerves, spoiled them and made me an unhappy speck of dust that is driven and shaken by any wind? And suddenly it seemed to me that I could not have been born so unhappy, so defenseless. I could have been born weak, scrofulous, I could have been born with one arm, with one eye, without an ear. But to be born to mope, and mope for no reason – because the world seems vulgar! But I'm not a Martian. I am a child of my land. I must, like any animal, experience the delight of existence. To experience happiness if everything is good. And fight if it's bad. But mope?! When even an insect, which is given only four hours of life, rejoices in the sun! No, I couldn't have been born such a freak.\"\n\n&#x200B;\n\n&#x200B;\n\nAfter reading his book in the most terrible condition in your life, you think that he blames patients with depression for depression, \"Reason conquers suffering. But the \"sufferers\" do not want to give up their positions at all. It was they who declared woe to reason and began to fear it, deciding that all suffering comes from it and nothing else.\"\n\nWith depressive eyes you will wrongly perceive his words.  No, he is not blaming us, the sufferers. The mind is above depression. Almost all of your thoughts in depression are not correct.  Of course, life is arranged easier, more offensive and not for intellectuals.  With wrong thoughts no matter what you see you'll end up with a wrong/irrational world. Nobody wants to live in that world. BUT \"Reason\" gives you a glimpse of the truth, which we do not accept.\n\n&#x200B;\n\nI had a suicide attempt  when I was 16, but unfortunately or not, the car stopped. I still don't remember for what reason. Furthermore, I remember everything vividly .3 years after my first attempt,  war started in my region. I went to the funeral and saw the funeral of a soldier (who was a 19 years old child (I was 17 back then). The most terrible scene in my life. I still remember the distinct cry of the old woman: It should have been me, not you, my child.\n\n&#x200B;\n\nAfter that, I often think about how much death hurts others. I want and can only think about the end, but I don't want to leave anyone with a scar.   Going to fail in everything that I pursue in my life, but don't know how to accept this loses again. I receive news like he did. Mikhail Zoshchenko at a young age receives 2 for an essay  and mad an attempt to finish his writing career without starting it by killing himself\n\n&#x200B;\n\n\"May 2, 1913\n\n&#x200B;\n\nI'm lying on the operating table. Under me is a cold white oilcloth. There is a huge window ahead. There is a bright blue sky outside the window. I swallowed the crystal of sulema. Now I'm going to have a gastric lavage.\n\n....\n\n\"Calm down, calm down, young man,\" the doctor says. - Well, aren't you ashamed… Such cowardice... for nothing.\"\n\n&#x200B;\n\nFor nothing, maybe.  You know how you want to end everything but this thought which drives you everywhere, but the truth says to you: Everybody suffers more than you.  You give up when they suffer. I just said to a person whose hometown seen war that I want to kill myself, and she was amused .\n\nSo scared, I am going to lose again, I don't want to. I am going to, but I have to accept my life, myself, Don't want to. Just peace. If somebody would like to read continuation or discuss him/artwork doesn't matter just you know, now I am tired, Can't continute", "url": "https://www.reddit.com/r/SuicideWatch/comments/q8wd8p/how_writers_depressive_thoughts_resembles_your/", "title": "How writer's depressive thoughts resembles your thoughts. A long stupid esse", "social_network": "reddit", "user": "MikhailDovlatov", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1634328439, "permalink": "/r/SuicideWatch/comments/q8wd8p/how_writers_depressive_thoughts_resembles_your/", "nsfw": false, "first_save": 1635422899.3416135, "replies_charged": false}