{"id": "t5_2qpzs_t3_pzjlvz", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351"], "text": "So im 31 years old , lost wife dog and house to addiction from alcohol and drugs. It took all of this to finally be sober ( 46 days ). I live alone in my appartment and have no real friends. I think I look ok but no way stud like my ex new bf. I work for a funeral home transporting dead bodies. I see suicide weekly and often wonder how young and seemingly looking fine people kill themselves.\n\nWell I finally understand. I lost all my friends because  Im a crazy addict even family members are not talking to me a lot. I see the look of pity in their faces. Im so lonely now.\n\nI had to borrowed so much money , im 15 000k in debts and the pantry/fridge is so sad looking. Bread and peanut butter. \n\nOn the positive side im back in the gym since getting sober ( theres a 10$ a month gym in front of my appartment )  and lost a good couple of pounds. Also im finishing a quick class on construction security that will allow me to work on construction sites without any experience. The pay is amazing but the work is tough. I heard its a dog eat dog world.\n\nI had to let go of my current work, Ill be missing a whole paycheck for the class im taking. Its making me nervous so bad , I wonder if I made the right decision.\n\nIf construction doesnt work out I dont even know how Ill pay my appartment , bills and food. Ill have to find another job while missing months of paycheck. Im still so fucking heart broken , I miss my house and my dog Toshi. I miss my ex so much but for all the pain that Ive caused I know karma is getting back at me.\n\nWell this is it. If things dont get better in a month or so im ending it , ill hang myself by the door with a belt or a rope. Im sick of being lonely and unloved , I know all of this is my doing but damn it hurts I feel like crying most morning and nights. \n\nThanks for letting me vent.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pzjlvz/one_last_bet/", "title": "One last bet", "social_network": "reddit", "user": "l0st_in_my_head", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1633130529, "permalink": "/r/SuicideWatch/comments/pzjlvz/one_last_bet/", "nsfw": false, "first_save": 1635423168.3755882, "replies_charged": false}