{"id": "t5_2qpzs_t3_n68hfu", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "Today, I thought about dying peacefully so that the people around me can keep going without having to drag me through life with them. \n\nThe last year has been hell for my mental health. I'm more isolated and lonelier than I've ever been and that caused me to abandon one of my best friends in a time she needed me and I've irreparably damaged our relationship. I loved her more than I think I ever could romantically because I told her my flaws and fears and she accepted it in the way we accept that gravity exists. She was a true best friend and I traded that in for self pity.\n\nMy mum lost her job last year, she was caught stealing food and groceries so she could fund her drinking. One night afterward she came into my room and sat on the bed and cried about how she'd let me down and how she was no mother. I'm ashamed to say I gave her little comfort. I've never felt truly close with her, but still it was callous and heartless of me. For once I empathised with her for feeling so low and for feeling overwhelming guilt for ones actions. To exacerbate this, and add insult to injury, my mood swings and depressive moods have strained our relationship. She now openly tells me she doesn't like me and that I need to leave the house for her own good.\n\nI graduated in December of 2020, with a first class honours in Accountancy. It should be a moment to celebrate as no one from my family has ever been to university before. I must say I am proud that I finished it. I distinctly remember telling myself in high school that university was too tough for me. Here I am several years later with a degree. The trouble is though, that I've come to the conclusion that accountancy is no longer what I'm interested in. This has caused a lot of disappointment among my family. I feel guilty for not living up to their expectations of a smart and capable young man with a promising career. In reality, I'm a socially inept and Introverted young man, who can't control his emotions and has no zest for life.\n\nIn general I feel bad. Even writing this feels like a pathetic plee for help or forgiveness. My mind tells me I deserve none. It tells me to write notes to everyone I love, expressing why I loved them so, my deepest thoughts and feelings around them as well as what share they would have of my possessions and assets as a final parting gift. I would then post these. Drive out to a peaceful spot I know, bring something pleasant to eat and then pass away quietly by some means. I'm exhausted with living, with indecision, with living in my skin.", "url": "https://www.reddit.com/r/SuicideWatch/comments/n68hfu/i_dont_want_to_keep_living_so_i_can_give_the/", "title": "I don't want to keep living so I can give the people I love a rest", "social_network": "reddit", "user": "Icy_Yogurtcloset_264", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1620311157, "permalink": "/r/SuicideWatch/comments/n68hfu/i_dont_want_to_keep_living_so_i_can_give_the/", "nsfw": false, "first_save": 1635426632.400718, "replies_charged": false}