{"id": "t5_2qpzs_t3_pipbe9", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "I have health anxiety, and I’m so fixated on issues that it is LITERALLY ruining my life. I’m only 16 I really can’t take this anymore.\n\nAll started when I got constipated back in 2019 freaked out and because of that got stuck with IBS-C from the stress of that started developing eczema which got me freaked out thinking it was psoriasis which in turn would turn into arthritis. My latest obsession is my eyes, after watching a video about keratoconus I start getting all these symptoms, ghosting, starbursts, that were either A) there before but I just ignored it or B) actually developed them in a 5 day period.\n\nWhat sucks is that if I didn’t have anxiety I know I wouldn’t be dealing with these fucking issues which makes me more depressed about my situation. Sometimes I’ll rely bits and pieces of how I feel to my friends, family, etc... and they’ll think I’m going insane or over reacting. The only one who believes me is my GP who told me to go to therapy (which I am actively pursuing).\n\nThe fear of death has caused me so much strain that any minor inconvenience preventing me from leading a normal life is automatically a death sentence to myself. What’s worse is that all this is actually making me what to kill myself so it’s like I’m being shot back right in the head.\n\nI want someone to give me a hug and tell me it’s gonna be okay, because I’m really at my limit at this point. I’m so tired, so anxious, I cant do this anymore. Seeing my friends so happy and healthy makes me so jealous, why me, why can’t I be like them? I just want to be happy.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pipbe9/i_wish_i_could_just_end_it_all/", "title": "I wish I could just end it all", "social_network": "reddit", "user": "Outrageous-Injury-25", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1630890461, "permalink": "/r/SuicideWatch/comments/pipbe9/i_wish_i_could_just_end_it_all/", "nsfw": false, "first_save": 1635428091.8054883, "replies_charged": false}