{"id": "t5_2qpzs_t3_ps807p", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "Everything was fine until I was 12.  After that i struggled from being popular in elementary school having a lot of friends to having them reject me for having a congenital teeth disorder where i was missing my adult front teeth.  I had to hide in the bathroom for lunch with my retainer with false teeth that i had to take out, where i still retained some popular buddies but feared rejection from them as much. \n\nThis led to some self medication for my anxiety through drugs like MJ, which largely helped me make friends.  Society rejects mj And jobs will discount you for it so i turned to oxycodone for It’s quick half life.  Then i turned into an addict.\n\n&#x200B;\n\ni graduated college with a great degree in engineering.  Co ops turned sour due to office politics, where i wirked full time  and part time throughout senior year.  I get unemployed for 1.5 years after graduation and turned. Into full fledge drug addIcition to oxys To mask the pain, shame, guilt i was feeling.  \n\nI finally get my dream engineering job and fucking bring my self to that new state.  I realized when I’m off drugs, my mind pesters at myself in the past.  I gained confidence i lost in middle school/high school in college with co-ops, but rejection in the workforce permanently fucked my psyche up real bad.  After the unemployment and rejection from what I. Felt was adult  society (lots of failed interviews in final rounds), i thought something was just wrong with me.  I had a huge imposter syndrome there and inferiority complex and felt behind other new associates, espescially with the 1.5 year gap and told myself they only hired me because I’m a massive bullshitter/manipulator smooth talker.  I’m a bad person i told myself.  I ended up graduating to fentanyl there and somehow keeping everything afloat.  Quit fentanyl in December 2020 and got my life back on track then this fucking pandemic hit.  I quickly relapsed as i had no support group there, got in an accident and fucked up my teeth, decided to check into rehab.  went on fmla for a couple months and the shame guilt Was so bad i resigned upon my return.\n\ni worked out for a couple monthis to gain some confidence in myself and pursue another career in hospitals.  Maybe go to school again to become a HCP.  I realized now that i made the switch and worked in this field for 6 months this was me just running away from my past and pain again.  Me lying again.  And when my co workers ask me why the hell would i leave a job like that i too cant believe it.  I ended up relapsing over 1 year clean.  I’m back on oxy s only though.  I tried crystal meth and it was surprisingly spiritual, but my depression was so bad last month where i thought about ending it all.\n\ni feel the depression creeping back in, when the crystal kicked depression out, now i am having anxiety.  I feel some real shame and just feeling fake all over again.  Why do i have such poor self respect for myself and its no wonder why people dont respect me outside.  It’s why i only have one real friend.  It’s why I’m a loner.\n\n&#x200B;\n\nsometimes i think about ending it all, or regressing to some serious drug addiction to fucking hide the noise and pain of my mistakes.  I hate being a failure man… I hate feeling judged in everything i do, maybe even if its not intentional but i feel like it is… like the worlds out to get me… if i go back to engineering only to be rejected by companies raising their eyes to a person that left that world for a year.\n\n&#x200B;\n\n9 months into sobriety i was fairly happy, then just things kept piling up and resentments and my mental health just went piss poor.  I stopped my exercises my habits and now i feel like I’m starting over again.  Self sabotage 1 on 1.  I seriously hate myself sometimes and my parents dont know that my overdoses were intentional last year.  its always my mental health that slips then goes into drugs.  I dont know why my mind is like this.  I dont know why i cant be strong or i dont know why my past makes me judge my self esteem so harshly.\n\n&#x200B;\n\nI know i dont even have it as bad as others its just my perception of me being me is just so fucked up, sorry for ranting\n\njust wanted to get this off my chest guys. Thanks.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ps807p/inferiority_complex_drug_addiction_trauma_rant/", "title": "Inferiority complex, drug addiction, trauma Rant", "social_network": "reddit", "user": "tangyjam", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1632185910, "permalink": "/r/SuicideWatch/comments/ps807p/inferiority_complex_drug_addiction_trauma_rant/", "nsfw": false, "first_save": 1635426212.795279, "replies_charged": false}