{"id": "t5_2qpzs_t3_ob37nt", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "Alright folks, not sure where else to post this, so I'm doing it here. No one gives a shit about my life story, and I have to tell someone so that they understand why I wish I was never born. I am at what feels like an all-time low. I am 22 years old, and was an extremely sheltered child. I was abused as a kid, but only had one abusive parent--the other one, my mom, is very loving and healthy. But with all the abusive drama growing up (my mom just trying to survive my awful dad, who never stopped causing her nonstop problems even after their divorce) I felt like my upbringing fell by the wayside. I was a troubled kid, with a porn addiction that started around late elementary school, though I was always sexually fucked-up as a kid (always obsessed with sex and aroused by it way before I ever hit puberty, not sure what went wrong there). I hid the weird sex obsession from my parents, but the porn addiction starting in late elementary school made everything much, much worse. I was constantly isolating myself, I was a sullen, mean kid who pretended to be nice and polite to adults, and I spent tons of time ruminating and stewing in my own negative thoughts.\n\nThe reason I said I was sheltered was because I never had to work hard or do anything difficult. Even though I was abused, with everything that was going on, I was mostly left to my own devices. I never had to do anything hard, not even regular chores. I stayed up late into the morning and deprived myself of sleep, played video games around the clock, and spent tons of time on the internet watching youtube and looking at porn. School was easy for me, and I almost never had to study to keep decent grades.\n\nWhen I eventually moved out of my mom's house (at around 20 years old) I had a job, a decent amount of savings, which was good, but I'd had almost no experiences of actually doing something difficult and especially not of succeeding. I was depressed and terrified of life. When I moved out it only got worse. I completely isolated myself from friends, family and roomates. I wasn't going to college. I showed up and exhausted zombie at my work shifts and spent all my time off work playing video games and mindlessly surfing the internet and playing video games. I got more and more depressed. My room became filthy, and the idea of cleaning it filled me with paralyzing, unspeakable dread, as did the idea of getting better sleep and running basic errands.\n\nPorn lost its' appeal. Eventually I stopped wanting to even play video games in my off time. All I wanted to do was mindlessly rewatch the same youtube videos over and over. I almost lost my job because of how often I was late to work.\n\nFinally, in Feb of 2021, my family sent me to a PHP (partial hospitalization program--an addiction recovery center). I went for my technology and gaming addiction. I stayed there for three months, and loved it. Being off the games felt amazing, having a structured life that was enforced by staff--I know that to some people, they would hate having their freedom stripped away, but it was such a quality of life improvement for me, I loved every second of it. I felt alive in a way I hadn't ever. I finally felt like I had a chance at life.\n\nBut when I got out, I went back to the structureless life I had before. Immediatlely, having choice and no structure enforced by someone else filled me with the same dread of everyday life I felt before. I was terrified to go back to work, and relied on padding I'd gotten from short-term disability my work had given me when I went to rehab as padding to live without working for a while. With nothing to fill my days, I fell back into my internet and porn addictions. I stopped communicating with my friends. \n\nNow my mom and I want to try having me live at home again, and she will structure my life and teach me valuable life skills that I never learned. I will live like that for a couple of years while I mature and learn about life and do difficult things and learn how to live on my own, until I can eventually move out. It won't be easy--they expect me to work at least full-time, maybe another part-time job on top of that to save extra money. I will be paying rent and working at least one addiction recovery program pretty hardcore.\n\nWhen I first heard this idea this morning, I felt terrified and hopeless. Life seems so overwhelming. I entertain suicidal thoughts, but not seriously, because I don't want to cause the awful grief my family and mom would feel if I killed myself. I just wish I had never been born so that I didn't have to endure this awful, difficult existence. Now that I have been born, I'm trapped. It's so bitter and hopeless.\n\nI actually feel a lot better about the whole situation now that I've typed it out. I feel some hope that maybe it's possible for me to face this new life. But I just need someone to know how I've felt this morning, because the trapped, terrified feeling will return--I can guarantee it. So often, I feel paralyzing, existential dread at the idea of going to work every day, running errands, refraining from using the internet, all things I will be forced to do if I start this new life being structured for me. And worse still, I'll have to actually show up--learn life skills, work hard at jobs, work my addiction recovery programs proactively and thoroughly and honestly. That's absolutely overwhelming and terrifying. I just need someone to know why I wish I was never born. I've thought before that it would be a relief to die in a car crash or something, something that wasn't my fault, or at least something that I didn't do on purpose. That said, I've wanted to crash my car and on purpose before. I dunno how I'm going to cope with life every day, leaving my addictions behind and actively participating in life.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ob37nt/wish_i_was_never_born/", "title": "Wish I Was Never Born", "social_network": "reddit", "user": "sandOsiris", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 161, "down_vote": 0, "creation": 1625077276, "permalink": "/r/SuicideWatch/comments/ob37nt/wish_i_was_never_born/", "nsfw": true, "first_save": 1635428000.5507514, "replies_charged": false}