{"id": "t5_2qpzs_t3_kpqkgx", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "This is long I’m sorry, I’m new to the community so if anything’s not OK please let me know\nI’ll try to sum it up the best I can\n\nI (F/late 20s) no longer have the will or motivation to do anything. I don’t want to say I’ve had a bad life, just a sour enough of one to leave me unable to look forward.\n\nI grew up in an unstable home life - usual never met dad, alcoholic mom, abusive and racist step father (I’m ‘only’ half white) - had my runs in with verbal and sexual abuse as a child and bounced between family members.\nI developed numerous chronic health conditions, all of which inhibit my life and are painful.\nI began engaging in self harm and it’s been a struggle since. I was diagnosed with depression/anxiety but never saw therapists long term.\n\nFast forward and I thought id “beaten it” living to most what appeared as a productive and busy life. But I still constantly struggled with thoughts of self harm, made an attempt on my life (was back at work in 48 hrs), couldn’t make friends, and felt so overlooked and unwanted. I was put on lexapro.\nThan I began succumbing to substance abuse as I realized I’d put my all in it but still felt so insecure, isolated and hated. Like everyone was biding their time till I “disappeared” so they could move on, I was simply an annoying roadblock to dispose of. I began feeling relief from these thoughts with alcohol and inevitably lost all control\n\nThan 2020. I was fired from a long term job (my fault), destroyed a long relationship (Also my fault), and began engaging in a highly volatile relationship - both of us substance abusers, we swung from “your my soul mate I love you” to “who can leave the biggest bruise this time”. But I remember how desperately I just needed to feel wanted - I just so badly wanted to feel like someone wanted me around. He did that\nI had managed to isolate myself - with no contact from anyone I’d previously surrounded myself with. Than the pandemic and the only person I had to support me through was this abusive partner. Both lost jobs, left financially with nothing, unsure how to even eat. \nThis continued before I was found with a .34 BAC in the middle of an unknown lawn - id been sexually assaulted. \n\nIn august I’d been baker acted (3rd time in the year) diagnosed with PTSD, BPD, and severe depression complicated by anxiety. Now I was put on Effexor, Remeron, and Prazosin \n I lost everything - home, car, no job. My family found out about the abuse and helped separate me. They’re now trying to be of support; worried about how I’ve always repressed emotions in an attempt to ignore everything starting from childhood - if it hadn’t been for my siblings they would’ve never gotten the “full story”. \n\nMy previous ex reached out and we began seeing each other again after rumors that I was involved with a known domestic abuser got back to him. (Apparently how volatile this man was was common knowledge in our area unbeknownst to me). He’s trying to offer support as best he can and has openly helped me cut contact.\n\nStill it’s gotten no better, I feel like everyone around me is annoyed waiting for me to get up and do something - to “get back”. But I have no will to do so. I felt like I’d built myself up, like I was in the brink of possibly having a ‘successful life’ (top achievements at work, making steps in my dream career, lots of hobbies and exercising) and even than I was being eaten on the inside, and had so easily destroyed it all in the matter of months. I don’t have to energy to try again. I have no hope for what my future but hang around to “not be selfish, to keep my head up, it gets better etc”\nI feel like I’ve completely lost the ability to swallow my emotions and have been left completely raw where every emotional touch fucking hurts. I’m so all over on a day to day basis until i finally feel shut off and numb\nI’m terrified of going out in public and purposely try to shop at female dominated stores. I’m constantly in this fog. I have constant panic attacks, can’t stop replaying events and how awful id been and how quickly I burned my life to the ground.\n\nI wake up and cry that I’m waking up. My entire insides ache at the thought of trying to push through another day. Went from being independent to “babysat” constantly. I’m resentful towards everything and everyone because they’ve already proved how much they can live life when I’ve just “vanished” - I’m not even a second thought which isn’t even their fault but I’m angry.\n\nI can’t get a therapist (turned down, health insurance doesn’t cover) and the one I had a session with asked if I’d spoken to my assaulter..... to Get a better understanding or his thoughts on what happened.\n\nI don’t want to keep going. I don’t want to try anymore. I’m exhausted. I feel so used, gutted and discarded. I’m sober since august but feel no better - I miss how nothing mattered when I drank and the days all blurred together. I feel like I’m simply burdening everyone, completely unable to try and progress past this. I just can’t seem to find it. I just don’t want to participate in it all anymore - I want to be alone, away from everyone, left to rot by self somewhere. \nI’m not even sure why I’m here - just hoping if maybe I lay it all out there... idk. \n\nI’m so sorry for this dump, if you read it all thanks.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kpqkgx/i_dont_want_to_participate_in_life_anymore/", "title": "I don’t want to participate in life anymore", "social_network": "reddit", "user": "Astrugglingnobody", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1609700659, "permalink": "/r/SuicideWatch/comments/kpqkgx/i_dont_want_to_participate_in_life_anymore/", "nsfw": false, "first_save": 1635426417.27692, "replies_charged": false}