{"id": "t5_2qpzs_t3_oanbyr", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "Hey, I’ve been stalking SuicideWatch for a very long time and have always been scared to post. Today I saw my ex boyfriend in my home city and was hit with some really bad anxiety. I was essentially in a really unhealthy relationship with that guy from 8th grade to around 11th grade. We had always had this frail relationship and would constantly break up after 7 months or so. I look back and truly realize that the relationship was awful because both of us had been awful to each other. I had lost my grandmother (who was my legal guardian since birth) and my mother went to prison, later found out to be for 5 years, in the beginning of our relationship. I was constantly depressed and severely insecure about myself and I constantly felt worried my ex was gonna leave me. I had pushed a lot of his girl friends away because I had been too scared to trust him. One girl that was a mutual friend had an extreme crush on him but it didn’t bother him as much as it bothered me. It was so horrible of me to do and I have spent years apologizing to him. During our relationship he had lied multiple times to me, ignored me when I needed someone I could go to, and let his grandmother be openly rude and racist to me. The relationship ended and I started dating a new guy that completely stood by my side despite me being extremely insecure and scared of dating for the initial 5 months in our relationship. It’s been a year and 8 months since that point and I am so grateful that he has pulled me out of my depression, bulimia, and horrible relationship. But I was recently told by someone else that my ex-boyfriend had been telling everyone that I physically abused him. It’s far from the truth and I want to confront him. I understand that I hurt him but why would he lie about me? People have been calling me horrible names ever since we broke up yet we were both victims and abusers… I constantly engage in abusing myself physically in order to forget some of these things. I’ve contemplated on overdosing many times and now have my boyfriend monitoring me when I take medication. I don’t want people to attack me for my mistakes in the past and I don’t want to push all the blame onto my ex, what should I do?", "url": "https://www.reddit.com/r/SuicideWatch/comments/oanbyr/zero_to_100_and_back_to_zero/", "title": "Zero to 100 and back to zero", "social_network": "reddit", "user": "Alaygator-", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1625019507, "permalink": "/r/SuicideWatch/comments/oanbyr/zero_to_100_and_back_to_zero/", "nsfw": false, "first_save": 1635422926.1850588, "replies_charged": false}