{"id": "t5_2qpzs_t3_ijb7fr", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "I've only attempted on my life once, in May of 2016. I was left with a short-term speech impediment and over 90 days in an inpatient psychiatric facility. I was 22.\n\nYour parents have an idea of what kind of adult they want their child to be when you're born. They want the best for you. They see you graduating school at the top of your class. They see you excelling through college, or in my case the military. They see you finding a good steady relationship and having children. They see you visiting on the holidays with smiles on your faces. \n\nI want to open up to my family, but it would destroy the imagine that they have of me. I haven't followed the standard conventional plan, but I've done well enough for myself. They have known of the the numerous psychiatric inpatients, but only through phone calls that were masked with humor and light-heartedness    (\"heeeyyy, I'm in the hospital. Haha, I'll be out in a few days. No, everything's fine. You know the military, always over careful. Love you, talk to you in a couple days!!).   Even through impatient, I've always presented extremely positive. My family believes that my mental health problems are genetic. The maternal side of my family is drowning in mental illness. My parents have never seen me cry. My parents have only heard me cry once or twice over the phone. I've hardly ever cracked in front of them. \n\nIf I opened up to then, they would have to live with the knowledge of the \"why\" behind my actions. They would have to live with the knowledge that their child was a monster. They would blame themselves. \n\nHowever; if I live, they would still be forced to live with the \"why\". All their images of me would be shattered.\n\nI need to know that someone unconditionally loves me, and I'm scared that my parents would prove that to be untrue. \n\nI present well on the outside. I smile through my therapy sessions, with my suicide risk level at \"intermediate\". I don't open up and they don't know why I keep coming back for treatment is I don't open up and I wear that positive persona. If I crack, I won't be able to put myself back to together. I can never take that \"why\" back, after it comes out. \n\nI've had a plan for some time. There isn't a time frame behind it, the act will be impulsive because that's the kind of person that I am. I will have a low emotional point, probably something minuscule that I would be able to pull myself out of, but it will be the breaking point. My boyfriend and a few other friends will understand, but many people won't. \n\nI have a lethal plan. It's easy and simple. It's not involving a firearm, because I don't have the mental fortitude to go through something so traumatizing to whoever finds my body. \n\nMy mental health team will impatient me for a long term stay if I open up my mouth. Maybe worse. \n\nIt definitely won't be today. And definitely won't be this week. Not this month. Maybe a year, maybe next year. But I can *guarantee* that suicide will be my end. My grandmother killed herself in 2016. I've seen it done correctly. I know that I won't live pass 30. It's been too heavy lately. The plan is too lethal. I won't be able to hit the eject button. It'll be like a scary LSD trip. I just have to hold on for the ride.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ijb7fr/i_wont_open_up_to_my_mental_health_team_because/", "title": "I won't open up to my mental health team because of the lethality of my plan", "social_network": "reddit", "user": "ALaModeAnxiety", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1598786632, "permalink": "/r/SuicideWatch/comments/ijb7fr/i_wont_open_up_to_my_mental_health_team_because/", "nsfw": false, "first_save": 1635427436.3238208, "replies_charged": false}