{"id": "t5_2qpzs_t3_33wa07", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "I am at my last straw and decided its better to try and say something instead of just giving up. \n\nI'm 23 and I'm just so damned lonely and useless. I really have no idea how to start this. I guess the beginning. I grew up middle class until 11, and then my mom got into meth. From 11 until I left home at 17, I took care of myself. I never got the whole family thing because I was raised by a single mother methhead and I feel that inhibited me quite a bit. I can't form meaningful relationships with people due to my fear of abandonment, not to mention I can't eat in front of people because of my feelings about food. I want to get a real job and fall in love and settle down, but my anxiety with people gets in the way. I cant even answer a phone without coaching myself into doing it. I break into bouts of crying and fear, but I can't tell the few friends I have about how lonely I am because of the stigma attached to it. In order for me to be around people, I need at least two beers to deal with them. I've had girlfriends, but I can't commit or connect because of my fears. I haven't had a job since I was seventeen, so ive played street music to scrape by, which I'm only able to do because of wine. I've attempted suicide twice, but only managed to leave a few permanent scars. I bought a needle and heroin today as a way to kill myself if things don't turn for the better. I just wish someone could hold me and tell me I'll be alright.  I fucked up my teeth and body from all th drug and alcohol abuse, so I feel completely unattractive and make people think I'm a creeper and untrustworthy.what do I do?", "url": "https://www.reddit.com/r/SuicideWatch/comments/33wa07/23_unemployed_and_couchsurfing_since_17_alcoholic/", "title": "23, unemployed and couchsurfing since 17, alcoholic and severe social anxiety.", "social_network": "reddit", "user": "theriddler41", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 23, "down_vote": 0, "creation": 1430028221, "permalink": "/r/SuicideWatch/comments/33wa07/23_unemployed_and_couchsurfing_since_17_alcoholic/", "nsfw": false, "first_save": 1635426454.2327363, "replies_charged": false}