{"id": "t5_2qpzs_t3_op3oxu", "request": ["37248a85-36ad-4f27-afa2-d6240c3a39c2"], "text": "For the last couple of days or a week ago my mental state starts to wavering. I have a habit of bottling things, and I am incredibly ashamed of not being functional nor useful. My partner, knowing that one of my episodes was coming up, tried his best to be there, comforting me, and given me a reality check. The more he cares, the more I am ashamed of being so low and useless. It was also a coincidence where we decided to stay an entire night through to restart our bio-clock (due to us being night-owls, it’s an eventual fact that we would end up waking somewhere between 3-5pm before) and also taking care of packing and preparations for university.  The morning after making the night through I had an embarrassing panic attack while in a crowded open market. My boyfriend was beyond amazing at handling the mess that was me, and it helped for quite a bit. However, my mood soon went down again, with a phone call from my sibling broke me to my end. I became a leech, refusing to tell my bf what’s wrong, getting irritated when he tries to show me something (we were playing chess), and overall I was trying my best to not makes him more worried, with that backfired horrendously. My bf end up getting sick of my misery, said he tried everything but nothing worked, and he is beyond drained. I started getting angry and spiral even harder, thinking that I was right for bottling myself up, to not share my problems because of the damage I made. When I saw that he threw the chessboard in the trash, something snapped. I self-harmed, weeping for apologies, and upon seeing that I was only a nuisance, wanted to flung myself out of the balcony. “That’s the kind of things a 17 years old girl would do, and besides we live on the 4th floor, so you won’t die. Also I have to clean the mess (my corpse or blood) afterwards, and I really don’t want to. There is the next building which you can jump off from the 7th floor, and if you want I can walk you to there, but I’m not cleaning the mess up.” quote from my bf, which he is right. That unfortunately makes me spiral even harder, feeling like a defected tool, and must be eradicated. Afterwards, even now I’m trying to find a suitable cleaning group, so my bf won’t need to clean up my mess if I did end up jumping. I am now in an ultimatum where if I leave the bedroom or from his sight, it’s a clean breakup. I am still confused why he is more upset when I said he doesn’t need to take care of anything, he doesn’t need to clean my mess. At the end, the two nights to restart our bioclock was a failure, my bf is burned out entirely and it was my fault and my unnecessary drama. I am sitting here fighting in my head in shame a guilt, trying to not kill myself. But knowing that problems, nuisances and burdens need to be eradicated, so everyone around me (including my bf) would be happy again I am constantly crying and trying not to kill myself.\n\nI’m not sure if he would break up with me, and I won’t blame him if he does, but I am desperately need to be the functional and hard working gf again, or I have to eradicate myself for good to contain the failures and burdens from spreading again to my bf.\n\nLong story short, shitty depressive gf bothers her bf to the mac with her pretentious suicide attempt. I feel like my logics have some hole on it currently, so I really need some perspectives.", "url": "https://www.reddit.com/r/SuicideWatch/comments/op3oxu/stupid_suicide_attemptself_harm_with_tired_partner/", "title": "Stupid Suicide Attempt/Self Harm with Tired Partner", "social_network": "reddit", "user": "darlingmartyr", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1626916963, "permalink": "/r/SuicideWatch/comments/op3oxu/stupid_suicide_attemptself_harm_with_tired_partner/", "nsfw": true, "first_save": 1635428578.2061439, "replies_charged": false}