{"id": "t5_2qpzs_t3_lsd54y", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "Hi since i have no one to talk to ( as i have no friends since i was manipulated into having trust issues that led to me not having friends at all and my relationship with my family is questionable) i made an account since i really wanted to share my life without filters and sorry for burdening you ( of course i won't share anything revealing my privacy). Well anyways I was born in a pretty wealthy family as both my parents are retired politicians and are now business people owning construction firms and plenty franchises as well as buildings. But before they retired me and my siblings were nannied at home by abusive maids. Mostly me and my older sibling since the youngest was still a baby. I was forced to be fed with spicy peppers and pinch or beaten but my older sibling was there so she would try to get beaten for me so she also got beaten (keep in mind i was not pass the age of 5 and the oldest was 2 years older) so anyway both of my parent arent home as often since they were working but one day my mom spotted them as they were abusing my older sibling so they fired them( but they did have the audacity to come back just to see the youngest since they favored it, they retired being politicians after) but anyway when i was 5 i started having thoughts on suicide. And when i was 7 i started trying to do it i would try to hang myself with shower curtains but it would break i would drown myself but the thing that i used to drown myself in was cracked so unknowingly water flowed out. I tried to suffocate myself and plenty more when i was 12 my addiction to pills (any kind started) i would drink up to 30 pills and would wake up at 3 or early in the morning just puking (keep in mind nobody in my family knew about my depressive state). You might be wondering why i am like this, having all the wealth and not having to worry about meals well my parents are the main cause. They would bury us with these expectations ever since we were young like bitches think we were royalty or som like in my city yes we were knowed but as time pass by our fame or som dwindled and they still think we were royalties or something. Whenever we went out we would need to mind what we were wearing. We needed to be this perfect little angels like the expectations bruh. but  what really hit home were the expectations on my grades. They will belittle people who had a lesser salary than them (janitors teachers etc.) they think that owning companies were everything and when we grew up we need to be successful like they already mapped out our entire lives (were asian) my oldest sibling a doctor me a pastry chef( since i wasn't as smart and because my mom wanted to be one but couldn't) and the youngest either a lawyer a engineer or anything he wanted he could choose cause he was favorite the firms my parents had would be given to him since he was a guy and that is how asian parent are i guess the guys first. Well anyway i was called all kinds of stuff by them ( keep in mind that after that protection stuff from the oldest when we were younger they have transformed into a total bitch) witch, bitch, asshole etc. and the whole dictionary was said before i turned 14. When i was younger up till my early teens i was sexually assaulted by my uncle and i would constantly feel weird around him having that weird vibe he would touch my butt and so and every one would disregard it as a joke and as a young me even though i knew it was wrong i still regarded it as well as a joke.( i briefly told my sibling now as in in the present about this like i said that our uncle blank was sexually assaulting me and they got angry and said how could i think of that and stuff so the whole day i flt really bad and just told them that it was dark humor) i was then approached by a predator online in omegle i entered that site when i was younger because on that specific day i felt really depressed i was 12 (i remember everything since it emotionally and mentally traumatized me not what the predator did but how my parents mostly my mom reacted) but anyways i went to omegle and talked about my shit to this guy and i was manipulated to contact him through my personal insta acc. It was at 3 or 5 am my mom knew about this and barged into me and my sibling room and shouted at me on how could i do that on how could i be so stupid keep in mind that in those chats i mention how i was depressed and suicidal and all she cared was how could i contact a stranger. She never even bother to acknowledge that. The next day she shared it to every one to the groupchats she was in to my family and my older sibling shared it to her friends and at school so all her friends just looked at me in disbelief and fake pity and i fucking hated that like i begged my mom to not tell anyone i literally begged her for forgiveness and not to tell anyone. Well yeah that happened ohh how can i forget the physical abuse haha when i was younger the youngest was mocking me constantly like making faces and such and i did it back and he did it worse and i slapped him he then had a nosebleed ( he was prone to nosebleeds the slightest touch of the nose can make him have one) but yeah he had a nosebleed and he cried and my father came. He came with a belt the strong hard leather one he then smacked me in my legs with it haha you might think its just that but he smacked me with the metal of the belt which left my legs bruised and bleeding that it had scars he got so angry at me that i wasnt even allowed to have dinner and left facing the wall with my untreated legs you may be wondering where was my mom well she was obsessed with my dad and would back him up in everything but yeah. I then needed to show up in school all bruised up. There is this one incident where i accidently stepped on my father while he was sleeping and he got really angry that he held me by my arm and started slapping me but then he went out to get a gun and pointed it at me while my mom luckily enough told him it was too much. ( my sibling never got any of this treatment) if not by my father with his belt it was my mother slapping me in the face for having grades lower that 85. My mother always got angry at me for no reason at all. If she had a bad day put it out on me if she saw m she would scream at me even my sibling admitted that her hatred on me was far from normal she would scream at me daily punch me body shame me etc. well anyway i now have trauma anxiety attacks adhd panic attack suicidal depressed etc. now that it is quarantined i cannot breath in my home i already had fears of them like i would constantly have anxiety attacks if i was near my mother i would feel heavy discomfort if my father touched me. And not to mention their thinkings like me and my sibling were always manipulated that we had to be perfect like we never were allowed to have friends because my mom would manipulate us and say that they were fake theyw ere only being our friends for our money or that they are using us and as stupid as it ay sound we more particularly i trusted what she said she ddnt have friends so she constantly told us that we all we needed was family blehhh. She also told us that women should stay in the kitchen serving men that whatever men thinks should be first priority. Etc. basically belittling women. Bruhhh sorry but i am having an anxiety attack….. Okay sorry i tend to have anxiety attacks whenever i am in my room and i hear noises especially at night because my mom would just barged in my room and shout at us ever since every single sound is like a sound of my mother coming near me. Well anyway one good thing i guess have happened i am now near to having no emotions at all when it comes to my parents scoldings since i hear them every single day but it just extends to the scolding i still have anxiety attacks as stupid as it may sound if i see anything related to school. I also indulge myself with crafts to keep myself busy and my mom doesnt like that. I am very keen on killing myself in the future once i finally leave the house you may ask why when i leave not why when i am still here its because i want to experience living even for a day. I already know what my parents would think if i would kill myslef they would get angry at me like they wont even be sad just angry. ( my father is a trump supporter even though we are not americans or from america but he is and my mom as well since she will do anything for my father their ideas on the victims is questionable they blame the suicide victims they belitlle them the raped victims the assaulted victims any victims they would belittle them so i know) i told the oldest abut my depression and suicide a year ago the first time i opened up and all she said was me and didnt even care and today my mom was shouting at me and was so angry that she almost cried ( oh did i forget to mention that one of her tricks is she cries guilt tripping us or just guilt tripping us saying that we should be lucky that we were born to them and stuff that we should be with them up until they are old ) she punched me and imma admit today did hurt but it only did for a little bit and i was shocked by that i told the oldest myplan of killing myslef when i got to live and when we leave the house and she got angry at me she called me selfish and how could i do that because my parents anger would be directed at the oldest like bitchhh imma kill myslef and your worried about you well anyway wish me luck tomorrow as i head into a battle field of modules like bitch in the first time in mylife i had an 81 on my card for 1st quarter and she freaked out she slapped me and stuff aghhhh i just want to die but i cant. Well yeah this is my story i guess maybe half of it sorry for the wrong spellings or grammar english is not my first language.  and i know i need to be greatful like i have it easy but i just dont know just you know die and all your problem will go away right. and forgot to mention i have heavy Christian parents who tell me i will go to hell and i tell them i know. ohh one last thing if you read up till the end we were also manipulated to think that we were poor my mom would literally cry when we said that we were wealthy. ( i think that she is bipolar and is suffering from  ocd)", "url": "https://www.reddit.com/r/SuicideWatch/comments/lsd54y/a_little_peek_in_my_life_cause_i_had_a_shitty_day/", "title": "A little peek in my life cause i had a shitty day", "social_network": "reddit", "user": "trashadumpsterina", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1614277400, "permalink": "/r/SuicideWatch/comments/lsd54y/a_little_peek_in_my_life_cause_i_had_a_shitty_day/", "nsfw": false, "first_save": 1635422315.4573627, "replies_charged": false}