{"id": "t5_2qpzs_t3_q74ooe", "request": ["66d5e2cc-881e-4049-9e68-c9e08c3bb5cb"], "text": "i'm only 19. i have chronic joint pain in every joint in my body from a physical disability. i have BPD, bipolar 1, MDD, severe PTSD, pain disorder, anorexia, and adhd. i have no family, i had to leave and cut them off so that i could try to live and get better, but it's been over a year now and it keeps getting worse. i wasn't prepared to move out and i've been barely staying afloat the entire time, i left my retail job for a better 9-5 which is great but now i have no way to go to therapy. i can't go anywhere to get better because i am 100% financially independent and barely have money so i can't take time off of work. my friends tell me that they love me and that they're there for me and that i can't die, but i can't go on much farther and they're not going to carry me. i had someone who was fucking incredible and i love her with every fiber of my being and when things got really bad for me she was there, she carried me because she loved me. but then the weight was too much and she told someone\"it took every inch of me to keep her alive\". it was hurting her too much and she couldn't take it, no matter how much she loved me. she's the only reason i didn't kill myself and now i feel guilty for being alive because of what it did to her. she loved me so much she tried so hard and did so much, i took more than she could give and after a while i wasn't giving her anything back. i know it was a hard decision for her and that it hurt her so much, but i was bringing her down with me when she has issues of her own. so i told her i would get better. it's been almost 3 months now and i actually have, i got a better job and apartment and started meds and by all means have gotten better, but i don't want to do any of this. i'm so tired, i'm so ready to be done. i starve myself constantly to reach a unattainable false sense of perfection/control and to slowly kill myself. i keep living for my cat and i'm trying to find a way to live for myself, but i just don't want to. it's a different kind of suicidal from before, it's a sense of eternal exhaustion. i know it's not good to live for other people but i could live for her, we were going to make a life together and be together and i would be happy. but i lost that. i have this painfully optimistic voice in my head that is stopping me in case i find my \"purpose\" or in case she comes back, but i don't know when it will run out of breath. i know i'm young, but it's too much and it's BEEN too much and i'm so fucking tired.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q74ooe/just_so_fucking_tired/", "title": "just so fucking tired", "social_network": "reddit", "user": "corewaterbottle", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1634104132, "permalink": "/r/SuicideWatch/comments/q74ooe/just_so_fucking_tired/", "nsfw": false, "first_save": 1635422252.3727336, "replies_charged": false}