{"id": "t5_2qpzs_t3_p9mda7", "request": ["6470d5bb-3864-4a14-958c-1beac3ba4111"], "text": "My last suicide attempt was in April 2020. I am not going to describe the method because it is irrelevant. I woke up in the morning and went to the bathroom as I always do. I had absolutely no idea what I had done the night before. Only when I returned to the bedroom and noticed the “equipment” lying around that I realized what I had done. I froze in terror. \n\nAt that moment some crazy thoughts struck me. \n\nWhat if I really died and now I am living in another alternative universe?\n\nWhat if death is not the end as I had hoped it would be? \n\nWhat if I had died and I would reincarnate as the same person and would have to relive my life exactly the same way till the day of the suicide? \n\nThat thought of having to go through a depression again and all the madness I experienced in my life, shook me even more.\n\nI stood there staring on the bed trying to comprehend what had happened and what had gone wrong. I am an architect by profession so I plan things properly before I execute them and yet I had failed. \n\nOn that day I decided that before I try again to end my life, I would spend every second I have to understand first what life is, what it means to be a human being, what is reality and what am I doing here. How did I think death was the end without knowing for sure that it really is? How stupid of me. No, I am not religious and I can not tell you what awaits us after death.  \n\nThat day was the true beginning of my life because I went into a treasure hunt and one and half years later I can tell that it has been the best time of my life. This journey will continue till death finds me but I know that till that day comes, I will find no boredom, no depression, no disappointment because millions of people have gone on the same journey before me and it is the most exciting life one can have. Discovering the nature of reality. There is so much knowledge there on this topic that it will take several lifetimes to consume it all. Who cares!? I finally found meaning. I hope you do too.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p9mda7/my_turning_point/", "title": "My turning point", "social_network": "reddit", "user": "TheArchitectCode", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1629670937, "permalink": "/r/SuicideWatch/comments/p9mda7/my_turning_point/", "nsfw": false, "first_save": 1635427029.3902662, "replies_charged": false}