{"id": "t5_2qpzs_t3_dxda1q", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "I'm really sorry for posting but i don't know what else to do. This is going to be a long post and i'm so sorry but i also feel like the context is very important and the situation is genuinely tearing me apart.\n\n&#x200B;\n\nMy \\[22 F\\] partner \\[24 M\\] and i met online about 5 years ago. We live in entirely different countries and due to other difficulties we have never actually met IRL. We became really good friends and then about 3 year ago we started dating. It's been a very difficult relationship with many ups and downs and we have broken up a couple of times within the last 3 years.\n\nHe has several severe mental illnesses (i feel terrible about posting and talking about this without his consent so i'm not going to include details on this. If it's needed for further/better advice let me know and i'll edit the post) and trauma. Because of this he has difficulties trusting me and often keeps things a secret or lies about stuff. I've been aware of this but i never wanted to push him or make him feel uncomfortable so i've tried to create an environment where he could open up to me on his own terms.  \nBecause of this i don't have a lot of his personal IRL information. I don't have any contact to any of his IRL friends or family. I actually don't even know his phone number (neither mobile nor house phone) since we use Discord to talk. I DO know his legal name because i've accidentally seen it (he is not aware of this) and because of that i also know his adress. I feel awful admitting it but because of the current situation (i'll explain further below) i looked up his name and found his adress.\n\nHe's expressed suicidal thoughts since we met 5 years ago. It took a while but eventually he had explained to me that he formed something like a suicide pact with his ex and planned on committing suicide on his 25th birthday. Throughout the last 5 years i've never forgotten about it and i dread his birthday every year but i thought the situation had gotten better. We don't really talk about it anymore. He sometimes jokes about suicide but as stated above i never wanted to be pushy so i often don't question it much since he also doesn't really open up to me much. I have tried a few times to talk about it and he gets very hostile and angry whenever i try to bring up the topic. When this happens he often starts ignoring me afterwards, sometimes only for a couple of hours and sometimes for days so i usually leave him be out of fear of just making things worse.\n\nI was under the impression that he was doing better until about 3-4 months ago when his depression hit him really hard. I tried to help the best i could but he kept pushing me away and tried to distance himself from me and eventually i tried giving him some space because nothing else i was doing seemed to be working. Eventually he started talking to me a bit more again and i thought things were mostly fine. He had also stopped talking to the ex a long time ago, at least to my knowledge, so while i've never forgotten about the suicide pact and it's definitely been a big concern for me i didn't feel like it was an immediate threat.\n\nThings started going very bad recently when he made a lot of new friends. While i am insanely happy for him whenever he does make friends he also often starts neglecting me in those times. He ended up talking to his friends often 8-12+ hours a day, several days in a row even and in turn would ignore me. When i would ask if he wanted to call me or hang out he didn't want to but he would go hang out with all his other friends and not reply to any of my messages anymore. When i asked about it lightly he would get angry at me. I would ask him to come play some games with me and he would decline, then go play the same games with his friends. He overall treated me a lot worse than them. I also struggle a lot with my own mental health and i genuinely try to deal with it on my own as best as possible. I don't want to burden him because i know he's suffering but sometimes i need a bit of support myself and maybe just vent some feelings out or just want to hear him tell me that he loves me and things are gonna turn out okay. He used to do this but in the recent months whenever i would bring up something that was hurting me he would just tell me \"whatever, you'll get over it\" and meanwhile he would be there listening and talking to his friends when they needed to vent.\n\nHad this all only been happening for a week or maybe two i wouldn't have said a word but it was happening for more than a month and with the months before that also being very difficult i felt like it was straining the relationship a lot. I felt alone and just very sad and it hurt me to see him be so nice to everyone else while being so dismissive of me. So when i couldn't take it any longer i decided to bring the whole situation up to him. It took me several hours to put together a message and i was very careful, trying not to make it seem like i was blaming him for anything. I definitely was and am not mad at him and i do have understanding for his situation. Essentially what i was telling him is that i just wished we could spend a little more time together, maybe a few hours every other day at least and just do something nice together because i really missed him. He got very angry at me again and eventually stopped replying to me entirely. Again, as said above this usually happens and that's why i don't generally bring issues like this up until i've tried everything i could to fix it on my own. He ended up ignoring me for several days and then eventually came back telling me he wanted to break up. I asked him to at least tell me why because it seemed very sudden and he told me he \"just doesn't like me anymore\" and then continued to ignore me afterwards.\n\nWe talk on and off now and some days are very nice and some are horrible. Some days he's very kind and some days he insults me and just gets mad over and over again. Yesterday was a pretty good day and we talked a lot until i asked him if he was feeling fine which he got angry at and told me to stop asking him how he was doing because i was annoying.\n\n&#x200B;\n\nNow, the reason this all concerns me so much is that we had similar situations to this before. We had broken up a couple of times over arguments similar to this but we managed to talk it out a couple of weeks to a couple of months after the initial argument and then ended up back together. After trying to talk it out he would often tell me that he knows he treats me very badly and that he hates himself for it. He has told me that he often treats me badly on purpose, especially when i seem to be sad, because he thinks he doesn't deserve me and he thinks if he treats me bad i will hate him and leave him. After he told me he wanted to break up i mentioned this to him. I asked him quite directly if he genuinely didn't want to be with me or if he was doing it because he knew he hadn't been treating me well and was trying to get rid of me so i wouldn't be sad. He never replied to me. At the same time he has often expressed that he loves me and doesn't want me to leave him.\n\nThe whole breakup thing was insanely sudden and it's really scaring me. We did have that \"argument\" but a few days before that he was talking to a mutual friend about how he really loved me because i \"get him\" and i'm kind to him. He was also talking about having kids with me in the future and having a family and talked about raising the kids etc. I don't see how someone who \"doesn't like me\" would bring up these topics and talk about them if they wanted to break up a few days later.\n\nI fear that he was being and still is so hostile because he plans on killing himself and he's trying to get rid of me so that i won't feel bad. This is something he had mentioned to me as well many years ago. He's been distancing himself from his friends as well and has told a few people privately that he was indeed going to kill himself on his birthday to a point where several people have asked me what's going on because they see his behaviour as worrisome as well. A mutual friend (who wasn't aware of this situation prior) asked him if he had any plans for his birthday and he told our friend that he was planning to commit suicide.  \nHe hasn't gotten me any gifts in more than a year but a few weeks ago bought me and some of his friends some stuff and told us all it was our early christmas presents. I'm scared he's doing this because he doesn't plan to be alive by christmas.  \nOverall there is a huge shift in his behaviour and him constantly talking about how he is definitely going to commit suicide just really aligns with everything else and it's terrifying. His birthday is in just a few days and i've tried just being friendly and checking in on him in hopes of him just opening up a little bit and every time things go well he suddenly turns very mean the day after. The fact that he has mentioned for 5 years that he was going to commit suicide on his 25th birthday and then starts behaving in this way just a few months before exactly that birthday while expressing the wish to commit suicide so much just genuinely is something that's scaring me. I'm having nightmares about him dying and it's tearing me apart. I constantly look to see if he's online, if he's playing any games to just make sure he's still alive. I feel like to a lot of people this situation might not seem very serious but things were fine before this and the second he started mentioning the suicide pact again a few months back everything just started to escalate.\n\n&#x200B;\n\nI just really don't know what to do anymore. I really love him so much and i just want him to be happy. I feel really selfish for saying it like this but i don't want him to die.  \nWhat can i do at this point? Should i bring all of this up to him and tell him how i feel and what i think is going on? Should i just sit by and wait?\n\nWhen i took psychology in school they taught us that when dealing with someone who is suicidal the best approach is to ask them directly if they want to kill themselves and then go from there. I'm honestly not sure if that's the right way to go about it. I'm scared it's gonna make things wrose, i'm scared hes gonna get angry at me again and i'm scared he's gonna just block me and leave.  \nAt the same time my attempts to lightly bring up things or just trying to create a happier environment have gotten me absolutely nowhere. I try to check up on him every day, ask him if he's doing alright and as said above that's just made him angry as well. I tried inviting him to stuff he might enjoy and sometimes he goes along with it and laughs and seems to have fun but then suddenly snaps and gets mad again.\n\nI feel like i'm failing him and with only a few days left until his birthday it's all messing me up. I feel like i can't do anything to stop him, it's not like i can just go to his house or call him real quick. If he goes through with it i'd never even find out cuz his family doesn't even know i exist. With me accidentally finding out his legal name i've been thinking maybe i just wait and see and if i don't see him on his birthday maybe i can somehow contact the police where he lives? I don't even know if this is an option since i don't live in the same country and i don't think i could even afford that phone call (not being stingy, i have no income). \n\nI'm so heartbroken over the whole breakup thing. I'm so scared for his safety. I feel like such a failure and i just don't know what to do. I can't ask anyone for help. I feel like my time is running out. I wanna help him so bad and i wish we could just talk it out. I wish he would just tell me what's wrong. At this point im hoping he just genuinely hates me and that's all there is to it. Even tho it breaks my heart i'd rather he hated me than him being dead.  \n\n\nI'm sorry this was so long and messy.", "url": "https://www.reddit.com/r/SuicideWatch/comments/dxda1q/i_think_my_partner_is_in_danger_and_i_dont_know/", "title": "I think my partner is in danger and i don't know what to do", "social_network": "reddit", "user": "StreetTarget", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1573940908, "permalink": "/r/SuicideWatch/comments/dxda1q/i_think_my_partner_is_in_danger_and_i_dont_know/", "nsfw": false, "first_save": 1635427715.1265337, "replies_charged": false}