{"id": "t5_2qpzs_t3_2z1eoa", "request": ["35003726-80f4-4b57-a706-febe3655a157"], "text": "Seriously, it just seems selfish that people don't want to clean up the mess. What about me? What if I don't want to live anymore? Life has nothing to offer me.\n\nI'm only getting older and gradually, my energy and youthful appearance will fade away. Why should I have to live through that? Things will only get worse before they get better. I haven't even truly been happy since I was 12 years old, and now I'm 26.\n\nThe world just keeps trying to invent ways to make it impossible for a person in my situation to even get out of it. It expects you to puts lots of work in, but even when you do, it just shits all over you and gives you nothing. People on /r/jobs won't even properly give me advice on what to do to find a job. I need a real job. My student loans are eating me alive, and their answer is always \"Fuck you, I got mine.\"\n\nI'm done living in this world. I'm done living this life. I just hope there's some form of afterlife or that I'll be reincarnated and have a better chance at another life, but even I'm skeptical of this.\n\n**Edit:** I appreciate all the replies, but honestly, nothing has convinced me that I should keep living.\n\nOther things I'm dealing with:\n\n* I'm 5'5\", 130 lbs, and look like I'm between 12 and 16.\n\n* I've never had a girlfriend\n\n* Still a virgin\n\n* Never kissed a girl sober\n\n* I have so little life experience beyond actually having some friends between 22 and 24. I have not many fun memories I can look back on. And all everyone my age wants to do now is get married and start a family, things I don't want to do.\n\n* I hate that I'm 26. I wish that I was a teenager again and could do things that I missed out on.\n\n* Overall, I just fucking hate myself and my life. I just want to die. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/2z1eoa/why_is_killing_yourself_seen_as_taboo/", "title": "Why is killing yourself seen as taboo?", "social_network": "reddit", "user": "psn22556", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1426355738, "permalink": "/r/SuicideWatch/comments/2z1eoa/why_is_killing_yourself_seen_as_taboo/", "nsfw": false, "first_save": 1635428441.4006867, "replies_charged": false}