{"id": "t5_2qpzs_t3_mo0jx4", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "Seriously, is there any fucking point continuing to exist. Your body is essentially a machine for capitalism to grind down. Capitalism is completely out of control and is unstoppable at this point, and owns and controls everything, yes including every \"SoCiAlIsT\" or \"CoMmUnIsT\" country, which are exclusively state capitalism. \n\nClimate change is already here (fires, floods, etc) and it's too late already to do anything that will stop it, yes theoretically if the whole world banded together to stop emitting totally by 2030 the worst impacts could be stopped, but half or more of the world still doesn't think it is even fucking happening, and the other half is placated by Joe \"Nothing Will Fundamentally Change\" Biden or their country's neoliberal equivalent. There's frankly not enough time. If let's say we had 100 years instead of 10, in that amount of time we would be able to get our shit together and fix it, but it's too late now to do anything. And spare me with the \"net Zero by 2050\" BS, the oil companies actually plan to emit MORE, but it being \"OfFsEt\" because they're planting some fucking trees.\n\nSuicide could be considered the ultimate rejection of capitalism and \"work-till-you-die\". If tens of millions of people died, capitalism would immediately collapse. In fact, my prediction is this is what will happen, after decades of extreme suffering and death caused by climate change, followed by centuries of just barely struggling to survive. What's the point of existing and worse potentially reproducing if this is what's going to happen?", "url": "https://www.reddit.com/r/SuicideWatch/comments/mo0jx4/capitalism_is_unstoppable_and_climate_change_is/", "title": "Capitalism is unstoppable and climate change is unavoidable. What is the point of continuing on?", "social_network": "reddit", "user": "lever69", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1618041409, "permalink": "/r/SuicideWatch/comments/mo0jx4/capitalism_is_unstoppable_and_climate_change_is/", "nsfw": false, "first_save": 1635427133.2347918, "replies_charged": false}