{"id": "t5_2qpzs_t3_p06s9d", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "idk i overextended myself with a friend i'd caught feelings for who turned me down. we're really close, so i've been working overtime to remind myself that whatever I might think are \"mixed signals\" are just indicators of our already intimate friendship - nothing else. overextended myself, spent too much time with her, had a little trauma response, got a little irritable, and now i wanna die cause i'm so ashamed i didn't set better boundaries and she saw it happen. just never wanna leave someone else alone, cause i've felt so alone. i think she's is actually totally 110% fine being alone. i'm the one who's filled with dread at the individual responsibility of keeping myself going and coming up with stuff for myself to do. just having a dark day. She's moving to take care of lots of different stuff soon too, and i just wanted to be like a normal, reliable BFF. not get suddenly heartbroken and distant. and i'm worried for her too, even though it'll all be alright eventually. \n\ni'm pretty good at being alone. just would be nice to be close with someone in that way who wanted to be close to me in that way. and wasn't just gonna suck my life force and leave me a shell of myself. sometimes being gay is exhausting, and i want straight stuff like prescribed dynamics and \"owning\" land and having a free baby. feel like i just have to plan for being alone because I don't know how else to plan. i know i'm supposed to have compassion for myself in this moment but i don't. wish i would shrivel up and die honestly.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p06s9d/i_take_pretty_good_care_of_myself_but_i_still/", "title": "i take pretty good care of myself, but i still wanna fkn kms sometimes", "social_network": "reddit", "user": "froopy26", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 6, "down_vote": 0, "creation": 1628391027, "permalink": "/r/SuicideWatch/comments/p06s9d/i_take_pretty_good_care_of_myself_but_i_still/", "nsfw": false, "first_save": 1635423015.0712821, "replies_charged": false}