{"id": "t5_2qpzs_t3_qf45wi", "request": ["5f7c2841-3f43-4682-8126-88825da57933", "da59145b-e03c-41fa-81a8-791cf9f7ecbf", "e90ed7cd-6d5b-453d-b307-06c2035916a8", "5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "Here's a list of things that I do from time to time depending on the severity of my depression. Maybe you relate:\n\n1: Risky behaviors. Sometimes when I drive on a clear road with no cars or people I'll close my eyes for a few seconds. I'll also keep thinking how tempting this tree looks or mountain cliff.. How easy I could die right now. Every time when I put my head underwater I think of staying there forever. Or taking drugs, etc. \n\n2: When I eat I'll take my steak knive and put it against my throat thinking how easy it would be to slit my throat and die.\n\n3: I keep saying that there's no way I'll get to this age or that age. I have a new deadline off course. Yeah deadline, pun lol. I'm a real procrastinator. \n\n4: I write extremely sad lyrics or poetry without even trying. It's extremely easy for me to be poetic with dark shit.\n\n5: Regret all the time I've wasted with addiction and just not having normal experiences growing up. For example no relationships,no sex, my first kiss happened super late and it was horrible.  Never kissed another girl again. I'm just so far behind the curve it's silly at this point. Not choosing the right careers or building myself up to make actual money, yada, yada, yawn. \n\n6: I tend to think of all my bad memories which consists out of so much awkwardness in social situations and me being a fuckin idiot when it comes to fixing shit with my hands. I'm retarded.\nHave aspergers and some executive dysfunctions. I have this weird ass brain profile where I can sometimes be quite smart. Overall I just feel retarded though.\n\n7: When I'm laying on my bed I'll think of ways I can kill myself. Lately I've been thinking of getting a gun, but getting it where I live is quite a process. So suicidal ideation. \n\n8: This is a weird one and doesn't always happen. Sometimes I'll have the need to cry when I speak to people for no reason. The convo will be about every day shit and I'll just want to cry. So weird but off course I keep it in.\n\n9: Also a weird one. I'll have this intense appreciation for small shit. Like I'll see 2 sisters gyming and bonding together and in the moment it overwelms me so much that I want to cry. I think it's because I know I may not be able to stay alive forever and suicide may eventually win.\n\n10: Anger when people are very harsh towards people that committed suicide or are just plain ignorant. My friend once said, \"I don't get why Chester committed suicide, he was so successful\". Omg literally kill me now, please. At that moment I knew he has never been suicidal in his life.\n\n11: Massive fear of being in my 50s or 60s and still being suicidal and not dead. Massive cringe. Shoot me now.\n\n12: Some of us are great at acting. I'm completely normal in front of people and can hide it. I can even enjoy some moments here and there. The only hint is I'll be very self deprecating but many that aren't suicidal are too so not really a giveaway I guess.\n\n13: Hermit at times. I decline many offers to do social shit because I feel like my presence will be completely unnecessary. Would rather rot at home in peace. \n\n14: At different stages in my life I rate how bad the consequences would be when I'm dead. I rate it based on the people closest to me and where they are in life. Right now is actually one of the best times to kill myself. Not that it ever is, thinking of the pain I'll cause helps me stay alive which is not fun. \n\n15: Not understanding why I have to exist and what my purpose is. Feeling like I'm a mistake.\n\n16: Intense feelings of isolation and loneliness. So I read through this sub to see what you people write to feel some sense of connection. I also listen to dark songs at times.\n\n17: Staying in the bath or bed for hours. Putting my head under the covers and wishing it can all end already.\n\n18: Going to therapy just to realize that no one can help you. It's all on you to stop feeling suicidal.\n\n19: Eating unhealthy and not caring much about how I look or dress. I'm actually not that bad with this one as I have a job but I have times when I let go.\n\n20: Extremely negative thoughts and regularly calling myself a worthless piece of shit that needs to die.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qf45wi/20_things_that_suicidal_people_do/", "title": "20 things that suicidal people do", "social_network": "reddit", "user": "takemeaway16", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 68, "down_vote": 0, "creation": 1635118943, "permalink": "/r/SuicideWatch/comments/qf45wi/20_things_that_suicidal_people_do/", "nsfw": false, "first_save": 1635421080.459854, "replies_charged": false}