{"id": "t5_2qpzs_t3_msbuyh", "request": ["6a3a22ea-a63d-4c77-abec-8837c7ab4dc0"], "text": "TW: discussions of self harm, alcoholism/substance abuse, eating disorders\n\nFor as long as I can recall I've had mental issues. I think my earliest memory of this kind of shit was being 8 years old and crying about how depressed I was and how much I wanted to kill myself, because I was a bad person that didn't deserve to live. My mom just told me \"this is normal and all smart people feel like shit\". My family doesn't understand mental illness at all. They just make me feel more guilty for being depressed when I have all these privileges. Saying that I just feel sorry for myself, that I'm ungrateful. As if I don't know. As if that's not part of what makes me feel so shitty. Don't they know I think about that every day? I have a super privileged life, my family is quite well-off, and the place where I live is safe and prosperous. My family even bought me my own house when I moved out. Of course I am very grateful. I am grateful every day for the privileges that I have. But at the same time I hate myself so much for it. I have all these great, amazing things yet I can't appreciate them, while there are people out there suffering who deserve these things much more than me. I don't deserve this. I don't deserve any of the nice things in my life.\n\nI even get to go to a very good university that I barely have to pay money for. But do I appreciate this opportunity? No, I just sit at home alone being depressed and useless, failing my classes not necessarily because I don't understand them, but simply because I don't do the work or go to class. I spend so much time sleeping the entire day away, knowingly missing classes and assignments. I used to be very good at school and get good grades. I used to have big dreams and achievements and my family was proud of me. Now I just want to drop out of university because I can't fucking do it anymore. I want to kill myself with every single little thing. Every single part of my life reminds me how I'm just a fucking piece of shit that doesn't deserve to be alive. I can't appreciate or take advantage of the many amazing things in my life. All I do is wallow in my own pathetic sadness and feel sorry for myself.\n\nEvery day I think about how much better off the world would be if I wasn't in it. How much of a burden I am on everyone around me. The first time I tried to kill myself I was in early high school. I've had one more attempt since then and many more close calls. There are times when I've felt better, when it seems like I've managed to beat the beast called depression. But it always inevitably comes back to this. My short life is a long history of self harm. My alcoholism is probably as old as I am, considering how it runs in the family. I've managed to beat the alcoholism back somewhat, for now at least. But every time I beat back one addiction it springs up somewhere else. Now I'm addicted to weed. I simply can't be sober, ever. I hate having to be alone with the clarity of my thoughts because they'll always just spiral around how terrible of a person I am, how much I hate myself, how much I deserve to die. I need to be fucked up somehow, at all times. It doesn't make the thoughts go away (no, they never go away) but it makes them quieter. Easier to ignore. I've experimented with and been addicted to many different substances and drugs over the years. I've starved myself, developed bulimia, struggled with cutting on and off for years and years... I've been on a slew of different medications for my personal brand of mental fuckeries, and each time it helps for a little before it stops helping anymore. I have a facial birth defect which makes my mouth and face look incredibly fucked up when I talk or make facial expressions. For so many years I told myself I was a freak. I even carved it into my skin.\n\nEither way, every time I think about my life it just boils down to this. I'm an inherently bad, awful person. Selfish. Ungrateful. A burden. I've been through a roster of therapists and psychiatrists, none have helped. It's like I was destined to feel this way. I don't believe in a higher power but I'm pretty sure my existence was a cosmic mistake of some sort. I was never supposed to be. And in that manner, I will simply fold to the wishes of the universe and cease to be.\n\nIdeally I would just like it to be quick and easy and shoot myself in my bathtub. But unfortunately things are never so simple. I want to make things as easy as possible for my friends and family. I need to write up a will. I need to figure out which of my possessions I want to give to who. I can already start now giving away stuff. While I'm figuring it all out maybe I will try to live life one last time. Spend all my money on the things I want, take time off university to travel. Go and finally meet the close friends I've made over the internet. I've always wanted to do a road trip of the U.S. Maybe I will do that before I go.\n\n*Will I live tomorrow? Well I just can't say.*\n\n*But I know for sure, I don't live today.*", "url": "https://www.reddit.com/r/SuicideWatch/comments/msbuyh/i_was_not_meant_to_be_on_this_earth/", "title": "I was not meant to be on this earth", "social_network": "reddit", "user": "lightandempty", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1618605197, "permalink": "/r/SuicideWatch/comments/msbuyh/i_was_not_meant_to_be_on_this_earth/", "nsfw": false, "first_save": 1635422929.3531518, "replies_charged": false}