{"id": "t5_2qpzs_t3_m6j73v", "request": ["b9855f9e-f397-420b-b12f-8fcc4099acfc"], "text": "Sorry for the possible errors. While fluent in english, I am far from being bilingual.\n\nI have a good life. I have loving parents, a good financial situation, few friends but ones that i know i count on, an engineer degree. I don't have anything to complain. I have all the opportunities in the world to succeed.\n\nAnd yet, I can only think of myself as a failure.\n\nI only succeed because of the help of others or because others pitied me, even my degree. I don't have any real accomplishment of my own. I am just a leech that will suck the life of my close ones and be their downfall. I don't deserve the life that i have. Every day, I can't help but think that this is the day that my boss will know that I am a failure and she made a mistake. Every day, I think that all the efforts and sacrifices made by my parents and friends are all for nothing. Every day, I think it will be easier for everyone if I just disappear.\n\nAnd yet, I can't do it.\n\nI have tried two times (one with medicine and the other by hanging). I failed because, everytime, I think of my parents and the suffering I would inflict to them. It would kill them. I think it's the only thing that keeps me going. Without them, i would have killed myself a long time ago. If i could give my chances to someone that truly deserved it or make my closed ones forgot about me, I would gladly do it and die without hesitation. And even that, I don't know if this is the real reason or if I am just a coward that is too afraid to complete the act and just wants some attention. In that case, writing this rant is also just the desparate call for attention from a pathetic man. \n\nMy only wish is that I am once again wrong and won't be their downfall. But, in every moment, I live with the fear that it will be the case. And I can't forgive myself for that.\n\nI don't know if this rant makes any sense. I just wanted to write this just in case. Sorry for the inconveniences.", "url": "https://www.reddit.com/r/SuicideWatch/comments/m6j73v/i_am_not_worthy_of_life_rant/", "title": "I am not worthy of life (rant)", "social_network": "reddit", "user": "hatemylself", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1615928194, "permalink": "/r/SuicideWatch/comments/m6j73v/i_am_not_worthy_of_life_rant/", "nsfw": false, "first_save": 1635428266.4866238, "replies_charged": false}