{"id": "t5_2qpzs_t3_gk3uya", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "No joy. Absolutely no joy is there to find in anything that inhabits this earth anymore. Not even the simplest things anymore. Can’t find myself to like any new music, new shows, do anything new. Anything that requires the slightest energy in doing. All I do is lay in bed and wallow in my own misery and self pity. I stare at the wall for hours getting nothing done while ignoring every person that still even tries to communicate to me on my phone. I should be grateful i’m still even working during this time getting a paycheck and having something to distract myself from while living in this miserable toxic house that I live in. Anything that can get me away from this house, will bring me peace for just a second. The thought of death crosses my mind all the time. I’m just a shell of the girl I once was. My soul feels empty. My heart aches for eternity.\n\nI was once SOMEBODY. I was the biggest extrovert, just a free spirit to anyone I encountered and I had the world at my grasp. People fighting over wanting to be friends with me and guys fighting over wanting to be with me. I really did have it all. But nothing can change your family situation. That is something that is permanent. As I got older, the reality of everything just started sinking in more until I finally came to the ultimate realization that my life has always been a complete pile of shit. My twin brother is severely mentally disabled and can’t do anything himself, my dad has been an alcoholic my whole life, and my mom has been depressed pretty much my whole life and is borderline suicidal, actually tried committing suicide around this time last year and I live everyday in fear that she’ll try again, I just fucking constantly walk on egg shells around her. She explodes over any little thing I say and I’m constantly depressed so I don’t want to talk often and she somehow takes that as a threat and starts coming at me calling me a bitch and even satan once just for not wanting to TALK TO HER. I know suicide is partially a hereditary thing and her father (my grandfather) killed himself and i’ve had suicidal thoughts for years so it all just scares me. My parents are just so so so fucking draining man. They suck the life out of me every time i’m around them for more than a minute, always having to find something to argue about. It’s not so much my dad as it is my mom though. I wish I could move out oh so terribly, but I look at things very realistically and although I do have a few thousand in my savings I don’t want to be 19 worrying about those kinds of bills yet when i’ve been doing a really good job saving. I don’t want to live paycheck to paycheck at a young age but I wish more than fucking anything to be on my own and free away from this prison fucking cell. \n\nUp until the age of 17 I really didn’t prioritize my home life because I kinda already had an idea of how shit it was but ever since I turned 18 it seems like life hit me with a brick, idk if it’s because I became an adult and started college or what, but like I stated previously everything kinda just started making sense in my life and it made me more depressed knowing how shit it was so i’ve just been sinking in a hole of despair since. It doesn’t help that I really don’t know what I want to do with my future i’m constantly switching majors and indecisive as fuck. I just wanna fucking be somebody in this world. I once wanted to be a rich lawyer living in a huge mansion with a big family and now I see nothing for myself. Something changed in me. I think the relationships i’ve been in play a lot of part. I just got out of an extremely toxic and emotionally abusive 2 1/2 year relationship and although i’m so relieved, he made me worship and prioritize him the whole time I was with him so I lost everything I had left and now i’m completely alone. It’s such a fucking lonely road I walk on now. All I used to want was to be alone just for a second because I was always in the company of others or getting asked to be in the company of others. Now that’s all i fucking want. I’ve pushed so many people out of my life it would hurt my head to count. The weed and drugs over the years probably didnt help either. Just made me want to push everyone away more. The depression alone I could’ve lived with, but when i developed anxiety at 17 it’s been a fucking nightmare ever since. To live with crippling anxiety everyday is indescribable and i’m so fucking sorry for anyone that has to as well. Medication only helps so much. I’ve already written too much but after reading this sub for so long I needed to vent. Sorry I kinda went all over the place. \n\nThank you for anyone who took the time to read this, really. You don’t have to respond, just that in itself is enough.", "url": "https://www.reddit.com/r/SuicideWatch/comments/gk3uya/no_joy/", "title": "No joy.", "social_network": "reddit", "user": "sadgypsygirl", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1589523992, "permalink": "/r/SuicideWatch/comments/gk3uya/no_joy/", "nsfw": false, "first_save": 1635426663.4328628, "replies_charged": false}