{"id": "t5_2qpzs_t3_oqnh7c", "request": ["b026bb6b-a591-459c-9396-7545c3e7f3fb"], "text": "Didn’t know a better way of phrasing it as a title. I wanna pre-face not exactly and suicidal state right now I have overwhelming wait for depression but the urge to go ahead and actually take my life has since passed, after i had overcame and pulled out of my attempt last min. so am not in immediate danger but i feel like this is the only semi private place i can ask for help since non of my friends and family know my reddit account.\n\nI, F22,Have always been depressed and being in a on/off suicidal state ever since I was 12 years old and got sexually assaulted by a family member. In the most recent year i found my self back in that scary place and bc of that i thought if i “burned a bridge” if wouldn’t hurt as bad of them when i was gone. When i was planning my attempt I noted that i should break up with my then Boyfriend. I was madly in love with him but i had this since of guilt that it would be selfish if i took my life while we were still together bc i was too embarrassed to tell him that i had been feeling like that and i avoided telling him about my depression out entire friendship and relationship. So when we broke up I created a bullshit reason just for the situation to be over and we haven’t really spoken since the break up happened in february. oh now I feel like if I myself in a better place soon I’ve been getting therapy I can’t help but feel so guilty I’m feeling like I need to apologize because i miss him, not even really as a romantic partner but genuinely as a friend.I just can’t help but feel so selfish because I purposely burn a bridge with someone i loved so much bc i so scared of causing pain by proxy. i want to apologize and tell him the truth but i’m scared i’ll come across as emotionally manipulative. I dont know i just need advice of what to do bc this weird feeling of guilt has been kicking my ass for the past few months and i just don’t know what to do and ive been crying over it it for ages now", "url": "https://www.reddit.com/r/SuicideWatch/comments/oqnh7c/im_stuck_in_my_own_loop_of_post_attempt_guilt/", "title": "i’m stuck in my own loop of post attempt guilt", "social_network": "reddit", "user": "localmeme", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1627122564, "permalink": "/r/SuicideWatch/comments/oqnh7c/im_stuck_in_my_own_loop_of_post_attempt_guilt/", "nsfw": false, "first_save": 1635426186.6280231, "replies_charged": false}