{"id": "t5_2qpzs_t3_g7ipya", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "Every day is a struggle to not hurt myself and not get wrapped up in negative thoughts. It feels like my negativity is constantly 2 feet behind me tapping me on the shoulder trying to get my attention. So that’s my new resolution is to not get angry at myself anymore. I’m at this point now because about a year ago all was good in my life and I was happier than I’d ever been seriously, then I got erectile dysfunction. I’d been doing some stuff and I probably gave it to myself and it was my fault but it took a mental toll on me. It sent me into what I’d describe as a neurotic state for a while where I obsessed over it and it consumed me. I saw urologists who all said I was fine. I didn’t really have bad Ed it might have been psychological but I know my body and something was different. After that I felt better until the fall when I got depressed again and self isolated and stopped going out as much. I just wasn’t as confident as I once was and my social life died. I spent lots of time researching things on the internet and self diagnosing which was bad and I even had insomnia for a while. I quit vaping for a month to get my health and sanity back. I was in a really bad place and felt like I didn’t recognize the person in the mirror he was a stranger who I had no control over. I would have fits of rage frequently and my dad would try to calm me down but I was so miserable and uncomfortable in my own skin I wanted to be someone else. In the spring I got a little better but then my girlfriend left me. That was the final nail in the coffin and sent me into even more of a depression. It felt like my heart plummeted into my stomach. It was the longest relationship I ever had with someone and all of a sudden it was over. She told me she hoped I would get better. I don’t blame her for leaving me I blame everything on myself. I think she left because I totally lost my personality and we didn’t laugh and have as much fun as we used to that’s really an important part of any relationship is having fun together. Just thinking about how happy we were and what could have been drives me crazy. I feel like even if I get better and this problem resolves I’ll still be alone and the girl of my dreams will be gone and I’ll have to remember this miserable time for the rest of my life no one should have to go through this. This whole experience has been psychologically scarring and everyday I’m reminded of how shitty things are and how little control I have and I get angry. So angry I hit myself and yell I think about killing myself just so I don’t hurt myself anymore. I don’t want to die really I just want to get better but it feels impossible. I’m 24 and still in college and have no idea what I want to do with my life and that stresses me out I’m also a musician but don’t feel very creative anymore. Every time someone tries to console me it just sounds like white noise no one really knows what I’m going through. I think about how I used to be and how I used to be happy and I feel like my life has been cut short. I think I might have Peyronie’s disease and I’m gonna talk to the urologist yet again about it but I’m not gonna wait any longer to get better I’m going to start living my life the problem is I just can’t go a day without losing my shit my default setting is ruminating about things I can’t control so I’m going to try and change that.", "url": "https://www.reddit.com/r/SuicideWatch/comments/g7ipya/every_day_is_a_struggle/", "title": "Every day is a struggle", "social_network": "reddit", "user": "getslostinmusic", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1587769581, "permalink": "/r/SuicideWatch/comments/g7ipya/every_day_is_a_struggle/", "nsfw": false, "first_save": 1635428074.0975268, "replies_charged": false}