{"id": "t5_2qpzs_t3_p7m5f2", "request": ["1173e488-95e0-4209-9b6a-de23c11c251d"], "text": "I'm completely directionless in college. I'm literally just taking classes at this point just to say I'm doing something with my life, when in reality I'm doing absolutely nothing but wasting money on tuition for classes I never pass. I'm well overdue for graduation but don't do anything about it. I've been telling my parents everything is fine and it's getting to the point where I'm going to have to be honest and tell them I've effectively wasted the past 3 years doing absolutely nothing. I can't even say I really tried, I always end up dropping classes the moment I start feeling overwhelmed, and I have a very difficult time keeping up with material so it happens easily. \n\nI spend all my free time just playing videogames. I have a part time job but I could easily be doing full time with all the free time I have. I'm just too lazy to, I hate working and interacting with people. My job is literally to sit in a chair in a store that doesn't get much traffic and that's still more human interaction than I want to deal with. I have no friends and have a very difficult time in conversation, I get very uncomfortable and struggle to fit in. I always feel really alienated, even in classes I always felt out of place and dumber than everyone around me. Just sitting in a classroom was a stressful experience a lot of the time.\n\nI can't see any situation where I can get a job and be okay with working every day with people when I have zero friends or ambitions to make it worth it. I've also been lying to my parents about school and I know they'll be disappointed with me, and I feel horrible and guilty over it. I don't feel like I have any future, I feel like killing myself is how things have to end.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p7m5f2/im_an_irredeemable_failure/", "title": "I'm an irredeemable failure", "social_network": "reddit", "user": "maaaelynx", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 26, "down_vote": 0, "creation": 1629402451, "permalink": "/r/SuicideWatch/comments/p7m5f2/im_an_irredeemable_failure/", "nsfw": false, "first_save": 1635426926.431801, "replies_charged": false}