{"id": "t5_2qpzs_t3_q3294v", "request": ["4dfd95d6-b32f-40a3-befc-5d1f918092b7"], "text": "I lack the ability to preform the basic tasks I need to do in order to function as a human being. My mood swings intensely and when it is good I feel like nothing needs to be fix, and when it is bad I feel as if my problems are beyond repair and hurt myself/scream/cry. At least that's how it was in the past, but now it's pretty much all lows plus emotionless disassociation with no end in sight. My friends from high school have all abandoned me and moved on with their lives, ones that actually have value. Nobody cares about me other than my emotionally manipulative parents who I can't stand and whose words of affection physically hurt me. They completely ruined my ability to healthily express my emotions and to trust other people. I've only had one friendship where I could actually express myself and that was when I was like 13. At this point my development is too fucked up for me to fix myself. That was the last time I felt consistently happy. I've never been in romantic relationship because the idea of being rejected is so painful for me that I literally can't fathom it. Everyone hates me because I am a weirdo who doesn't conform to societal expectations as to what I enjoy and who rapidly goes between hating and loving everyone around me. I have been on this earth for two decades and what have I accomplished? An arrest that cost thousands in legal fees and a car accident that cost even more, all despite being given everything I could ask for. The counselors at my university are useless and I can't afford a real therapist. Even when I did go to therapy I unintentionally misrepresented myself to the point where it was pretty much useless. I am ready to be at peace. I just want to fucking kill myself so fucking bad.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q3294v/ive_had_enough_im_ready_to_leave_this_world/", "title": "I've had enough, I'm ready to leave this world", "social_network": "reddit", "user": "twaytway73", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1633584805, "permalink": "/r/SuicideWatch/comments/q3294v/ive_had_enough_im_ready_to_leave_this_world/", "nsfw": false, "first_save": 1635427643.4339373, "replies_charged": false}