{"id": "t5_2qpzs_t3_k3pvq3", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "Please don’t take this as self pity but as self-awareness. I genuinely genuinely hate my life. I grew up without a father with a younger sister (by  a year) and a mother who had the mentality of a teenager and always chose men over her children. I was raised by my grandparents most of my life. My grandfather died last year, it was rough. My mother (much better now!!) was neglectful and extremely verbally and physically\nAbusive. One time my sister cried because her toothbrush fell on our filthy floor and my mother threatened to beat her over it and then did. My sister was four at the time. \n\nI grew up in Two very Raggy and dilapidated apartments caused by our filth. My mom cleaned nothing and was lazy, we never cleaned either. We got bed bugs when I was in highschool. I’ll never forget opening my back pack in history and seeing one in there. Scars you for life. I don’t want to blame my mom fully because we knew that we were messy; (we as I. My sister and I), but it’s the fact that we were never taught how. I was AND STILL AM so ashamed of the living conditions (they are better now). It’s so embarrassing. The air was plagued with second hand smoke and not an ounce of love. I grew up poor as well. My clothes never fit. I was made fun of for wreaking of cigarrette smoke all of my school time and for clothes that never fit.\n\nI was never paid attention too (not saying this caused this btw) but I think it led to my ADHD being undiagnosed. I have super bad ADHD. It affects everything, I cannot focus or think straight, I’m impulsive, indecisive and irritable. I was made fun of this as well for my hyper ness. I was never told I was loved or that same one was proud of me.. explains my low self esteem.\n\nI’m the black sheep, no one acknowledges me and that’s ok, it’s my fault. I’m stuck in this pessimistic mindset due to depression and Borderline Personality Disorder. It’s a lot to explain and get into but if you have it; I’m so fucking sorry, it’s the worst. My emotions are EXTREME. When you’re  happy, Im ecstatic, when You’re  sad, I’m despondent. It feels like the world is always ending, my heart always feels like it’s sinking, my chest is burning. I long for attention for the existence to never fade, but once it does I’m in utter rage, I’m uncontrollable; uncontrollable mood swings, panic attacks, anxiety attacks, anger, impulsiveness, irritability, suidical thoughts, fear of abondonnement... this HURTS MY MIND. THIS HURTS MY\nBODY. THIS HURTS MY SOUL.\n\n\nMy family shuns next when I go to them because I have pushed them so far away when I was a teenager. I took all my anger out on my grandmother. I want to die I regret this so much. I hurt her so bad and Just can’t live with it. She’s so affected by it and I don’t mean to sound selfish but so Am I. There is something WRONG with me. I could not control this anger I literally could not ground myself. I feel so guilty, I wish I could give my lofe for my grandfathers I don’t deserve to be here. I dont. I feel as if the impact I leave in everyone is negative. I feel as if I can’t overcome these hardships and that they do define me. Soem days I feel so numb I can’t see, my brain feels floating. Soemtiems I wish it were that way. \n\nI have no one to talk to and don’t have insurance to actually get the lrofessional help I need. I’m a college student doing this all on my own, after this semester I’m homeless with my dog, with no family and no friends, no love and no confidence. I don’t wan to be here anymore, that’s how I feel, it feels intense.", "url": "https://www.reddit.com/r/SuicideWatch/comments/k3pvq3/never_used_reddit_before_so_i_dont_know_if_im/", "title": "Never used reddit before so I don’t know if I’m doing this right kinda desperate on what to do (I am Fm(21))", "social_network": "reddit", "user": "Jhamilt420", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1606715251, "permalink": "/r/SuicideWatch/comments/k3pvq3/never_used_reddit_before_so_i_dont_know_if_im/", "nsfw": false, "first_save": 1635426653.2843444, "replies_charged": false}