{"id": "t5_2qpzs_t3_qaif9v", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "Buy a gun. Wait 10 days. Shoot yourself.\n\nLiving on the other hand? I have to deal the with constant apathy, unable to enjoy anything I used to. I have to accept the fact that I will never beat my porn addiction, that I'll never date again, and that my treatment-resistant depression will never be treated. I'll never leave the nest again as I approach the ripe age of 30--I'll never have autonomy over my life. In fact, I've never had it to begin with. \n\nSo I'll steal it. I'll do something good for myself for once by putting myself out of my misery. Mental health professionals have failed me, psychiatry has failed me, and I am a failure to myself. The only way out is death if I want to reclaim my honor. That's what the samurai did anyway.\n\nFor I have nothing to show for. No reason to continue. A wife, career, some friends, and a car? Those worldly pleasures are trivial and impermanent... But I will leave a permanent mark on the world as an erupting noise penetrates the air and my soul is torn from my body. My only regret will be that I didn't end things sooner.\n\nI don't enjoy anything. I feel nothing. I am not moved by emotional TV shows or movies. I will disappear into the depths of the ocean and become another statistic. \n\nThere is no hope, though people are quick to offer it with their rose-colored glasses. What do they know about me? They've never met me or lived in my shoes for one day. They never call me or open the door for me. When I am bleeding on the ground, they'd look and maybe offer to help. But when I am bleeding from inside, they'd never help. They've never been there. All of humanity.\n\n10 days. What fun. That's all the time I have to wait for until I meet the cold embrace of death...Death is the cure to depression.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qaif9v/its_so_effin_simple/", "title": "It's so effin simple", "social_network": "reddit", "user": "hopelesspeasant", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1634545449, "permalink": "/r/SuicideWatch/comments/qaif9v/its_so_effin_simple/", "nsfw": false, "first_save": 1635425194.6460922, "replies_charged": false}