{"id": "t5_2qpzs_t3_biwda2", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I apologize in advanced. This just happened and I’m in shock and I’m not sure how to deal with it. So if this comes off as an unfocused ramble, I apologize. I think part of me making this post is trying to collect my own thoughts. I also wasn’t exactly sure where to post this because maybe r/depression would be more appropriate. \n\nMe [28 male] and my girlfriend [35 female] both suffer from depression. Though they have different sources and I think perhaps express themselves differently. Yet I’ve always tried to make it clear that though we are both going through difficult things I am here for her as best as I can be. Despite both our busy schedules I make myself available when I can both physically and emotionally. She just got back from a trip with her roommate and her kid, whom she serves as a nanny and a parent for in place of the child’s father. \n\nI’ve always been comfortable and supportive of that relationship because they are really the only family she has. I thought that this beach vacation with the three of them would be helpful. She and her roommate do occasionally get into fights and arguments. For the most part she depends on her roommate for housing and in exchange she helps take care of the child, which seems to be very hard work that the roommate appreciates. My girlfriend has anxiety about one day her roommate kicking her out over one of their disagreements.\n\nI understand and respect that anxiety. Though I try to assure her that it’s obvious that her roommate and her child loves her, and that logically speaking I am confident her roommate saves more in childcare than the cost of her living with them. My girlfriend still pays a portion of the mortgage with her job as a professor. I think part of it is that my girlfriend has severe abandonment issues. \n\nThe day after they got back from the vacation, I got a message from her roommate that she had gotten a call from my girlfriend saying that she had called 911 and is waiting for the ems. The roommate emphasizes that they had been in an argument but she isn’t sure what’s going on. So we exchange numbers and I go into a panic trying to get in contact with her. My girlfriend does not answer her phone or text messages. Eventually I was able to contact her over Facebook.\n\nMy girlfriend had attempted suicide and had a gun, which they took from her, thank god. She tells me she is with the ems and that she is on her way to the hospital. I am now waiting to hear back but I know that she is safe and I don’t think she was able to physically harm herself.\n\nMy depression can get bad but I’ve never attempted suicide. I know she has attempted suicide before and I don’t know what to tell her but that she has people that love and care for her, and that I am here if she ever needs to talk. I offered to come get her wherever she was but she said she was already in the EMT. \n\nI guess what I’d like to know is how to go forward from this. Honestly I’m scared she might do this again. I’ve never been in a relationship with someone who is actively suicidal. I am afraid one day I’ll wake up and call or message her and she will just be dead. I’m not really sure what to do or if there is anything I can do. \n\nI’m worried also because she has little health insurance and I don’t want them to pile onto her stress by dropping a bunch of expensive medical bills on her. \n\nI’m happy she didn’t hurt herself and that she is now safe but I am very concerned for her future.\n\nTldr: my girlfriend just attempted to kill her self, she is safe and receiving treatment but I’m not sure how to respond besides being there for her actively and emotionally", "url": "https://www.reddit.com/r/SuicideWatch/comments/biwda2/my_girlfriend_attempted_suicide_today/", "title": "My girlfriend attempted suicide today", "social_network": "reddit", "user": "tres_ecstuffuan", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 4, "down_vote": 0, "creation": 1556580904, "permalink": "/r/SuicideWatch/comments/biwda2/my_girlfriend_attempted_suicide_today/", "nsfw": false, "first_save": 1635428075.43024, "replies_charged": false}