{"id": "t5_2qpzs_t3_pkltje", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "31m I’m tired of life being disappointing, tired of putting forth effort to pull myself out of this hole only to find another waiting for me when I get out. It’s exhausting. I drown myself in escapism movies/tv/games because I can’t stand reality anymore. Don’t really have much family anymore because they were either abusive or harmfully ignorant. The ones I have left are younger adults that don’t deserve having all this pushed on them. I don’t have any friends that I can really depend on any more because they are either busy, moved away, or are starting families and I’m left alone not really knowing who to turn to. Therapy has been somewhat helpful like learning to set healthy boundaries but doesn’t really solve the problem of people only assigning worth to you based on what you can do to benefit them. I’m tired of being the one that pretty much initiates all communication with friends and family unless they want something from me or need a shoulder to cry on. I don’t mind helping others through difficult times but a) I deserve to be part or the good times in their life as well and b) I should be able to receive the same compassion and effort when I need a shoulder. Boundaries have helped with my sense of worth but not really about how people treat me as it just seems like a revolving door. People drop off I make new friends but the same thing happens and I don’t know what to do. I don’t really want to die but I’m really tired of life being so awful and lonely and feeling like people don’t even want to try to understand me or what I’m going through. I just wish my life wasn’t something I wanted to escape from 😔", "url": "https://www.reddit.com/r/SuicideWatch/comments/pkltje/just_tired/", "title": "Just Tired", "social_network": "reddit", "user": "Vyndria2", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1631143788, "permalink": "/r/SuicideWatch/comments/pkltje/just_tired/", "nsfw": false, "first_save": 1635423004.5192184, "replies_charged": false}