{"id": "t5_2qpzs_t3_hw4l39", "request": ["9d930438-ca47-40f3-96b8-216c0cb0d846"], "text": "I'm currently taking care of my mom, and driving her car for errands. She wasn't the best of drivers and people seem to remember her car in my neighborhood. Some people swerve out of the way, but others drive into my lane, and I'm becoming more and more brazen, I came within arms distance of a crash today on purpose. I'm worried that other people will get hurt. I keep my window open incase I want to throw something at them, but I feel like I would beat them to death and suicide by cop. I'm so stressed out by these events that my heart won't stop racing and I get tremors in my arms and my head bobs uncontrollably. I don't know if they intend to kill me with a heart attack or what, I'm so stressed from getting her meds every other day and getting her snacks, its like she wants this for me, she sees how badly I'm shaking after driving. She also told me that her liability insurance would cover it, but I'm not on her policy I need to get away from her, but I'm afraid I'll just see every mistake as a slight against me. She won't buy a dashcam for me to show her what's happening, and I see no other way for these people to take responsibility for the conclusions they jump to. I feel like my personality is changing, I've been fired from my job because a coworker was threatening me, and had a nervous breakdown on my commute because everytime I hear someone talking about violence my mind starts filling in what I can't hear with personal attacks. I know I need to leave and be put on medication, I can't function like this", "url": "https://www.reddit.com/r/SuicideWatch/comments/hw4l39/im_afraid_im_going_to_crash_into_the_next_person/", "title": "I'm afraid I'm going to crash into the next person who drives into my lane.", "social_network": "reddit", "user": "No-Independence6902", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1595460112, "permalink": "/r/SuicideWatch/comments/hw4l39/im_afraid_im_going_to_crash_into_the_next_person/", "nsfw": false, "first_save": 1635422325.5888064, "replies_charged": false}