{"id": "t5_2qpzs_t3_i68yxy", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "   Fuck, I know what this shit is all about. No one will see this so I have the stage to myself, before an empty auditorium. It's fine, I always talk to myself and this shall be no different. It's fine.\n\n   I am so fucking pathetic. I am such a fucking loser. 21 years of age with the social skills of a scarecrow. Not good at connecting with people at all. Socializing is impossible. Anxiety is always groping me. Conversations die faster than they begin. Never approach anyone I may have interest in because I'm a freak. Never been in a relationship and it eats away at me. I feel so far behind. So left out. So invisible. I see people out and about with their friends or partners and I get so unbelievably jealous. So filled with rage and self-hatred. I hate that I care so much and I actively try not to, but it gets to me nonetheless and makes me feel more pitiful. So sad and desperate and disgusting. I just don't understand how they do it. I don't feel anything when I talk to anyone, even if we have something in common. Every interaction seems fraudulent. I feel like there's a transparent wall between myself and others. I just don't understand. I don't know how to be a proper friend to anyone. \n\n   I can feel my intellect dwindling. I used to be very curious and academic. Artistic and articulate. I loved learning new words and solving problems. Now I know nothing. I am interested in nothing. Everything either bores or angers me. If I try to learn, nothing sticks. I go to work, make a fool of myself, and come home. I smoke weed to cope (if you can call it that) and that's about it. I sit in my room all day, every fucking day. I don't want to see anyone or hear anyone. I don't want to do anything. \n\n   Family fucking sucks. The only ones I care for are my sister and mother, and my pets. The rest are self-serving tools who walk around like they're better than everyone else whilst simultaneously holding their hands out. Assholes who can't take care of themselves yet have the audacity to stick their noses up. They can all get fucked. All of them. My life has been worsened every time they try to insert themselves. I always thought that this was a normal dynamic. Boy, was I mistaken. This just adds to my general anger and frustration. Why couldn't I have been born into a better functioning family? Why me? Though, I suppose it had to be someone so...why not me? \n\n   I hate my life. Could it be worse? Surely, but it could also be better. I, however, do not possess the drive to make a change anymore. Nothing seems to have changed at all in my life. Not in the slightest. Well, not for the better at least. Everything seems to be getting worse by the day. When a problem is solved, two more take it's place. Bless my mother and her heart and soul. She's come so far, she tries so hard. She's trying so hard. And here I lay, making everything more stressful and needlessly difficult. Wasting time, wasting money. Doing nothing. It has to end soon. This needs to end soon. I can't do this anymore. Everyday is like an increase in resistance that I am not equipped to challenge. I think about people long after our paths have parted, yet I'm sure they don't even remember my face (which is okay, because that's how normal people function. I'm the one with the problem).\n\nI try to tell myself to let it go. Let shit go, but it just sticks to my fucking brain. Why am I so pathetic? Why? If I had to born at all, why like this? Why a spastic with more psychological issues than I can count on my fingers? I am trapped here. From birth, we are all trapped. Ripped from the peaceful, quiet, warm void that offered nothing but solace. A crime, in my opinion. I am not prepared for this life.\n\nI have had a headache for a few days now. I hope it's something that will kill me. If it doesn't, then I have some decisions to make. I've written down 19 reasons to die and 3.5 reasons to live. Not a lot of room for indecisiveness there. I've given myself until the end of the month, after my mother's birthday. I will find peace one way or another.", "url": "https://www.reddit.com/r/SuicideWatch/comments/i68yxy/i_am_so_defeated/", "title": "I am so defeated.", "social_network": "reddit", "user": "sayzi", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 11, "down_vote": 0, "creation": 1596928641, "permalink": "/r/SuicideWatch/comments/i68yxy/i_am_so_defeated/", "nsfw": false, "first_save": 1635426656.3700266, "replies_charged": false}