{"id": "t5_2qpzs_t3_q2geiv", "request": ["e4f86eb2-5fad-469d-993a-ab206502e351"], "text": "I'm recruiting for full-time roles after college in management and economic consulting, and I've done 16 interviews so far. I've gotten rejected from 8 first-rounds and did 1 final round interview recently. I have another final round at the end of October.\n\nI was really interested in the company that gave me the final round, but obviously I could be rejected after the final round interview (haven't heard back).\n\nMoreover, I have a midterm this week that I have to do much studying for THURSDAY AT 8 AM IN THE FUCKING MORNING and will likely fail, whereas my roommate and my friend at my college both have great job offers in tech (Microsoft, Apple, etc). My roommate often talks about other peers who have great offers in hand, too, when she's on the phone.\n\nI feel like a bumbling, idiotic, awkward, stupid, currently unemployed failure and I want to kermit sewer-slide. If only I had access to a weapon or pills that would let me do that and ensure that I'd be successful. I don't deserve to be alive, anyway.\n\nMoreover, I have 2 interviews today and I have no idea how anyone expects me to stay alive in this mental state, much less excel in the interviews, much less wake up for my fucking midterm on Thursday.\n\nI guess this is adult life, lmao, right? One thing I've learned is that as an adult, you have to push through and no one gives a fuck about your mental health. I have depression and fail an interview? No one cares. I have anxiety and a panic attack in the middle of a midterm? I fail and that's my fault.\n\nAfter I got rejected from an interview last week after only making 2 math errors, my friend (who has a great offer in tech), said, \"Just give them less reasons to reject you!\" This week, I made sure I nailed my math and didn't make any computational errors, but that's so fucking insensitive. I mean, everyone tries their fucking best, and yeah, sometimes it's not enough, but just because you make 2 errors doesn't mean you'd be shitty at the job when you get to use Excel.\n\nMoreover, I attend a college where everyone has MBB and FAANG offers in hand and majors in EECS/CS with starting new grad salaries of 200k, whereas I didn't even make it past the first-round interview at an MBB :)\n\nEveryone is so successful at my school that they'd just feel pity for me :')))))\n\nSeriously, give me 3 reasons why I should stay alive.\n\nMoreover, my parents don't really have sympathy for me either, as they're traditional Asian parents and would just say shit like, \"Your cousin's classmate at Stanford works at BCG; why can't you?\" LMAO, I DIDN'T EVEN GET AN INTERVIEW FROM BCG. Should I kill myself because of that or something? That someone can get an offer from BCG but I can't even get an interview?\n\nI'm spiraling downwards and want to slit my wrists, but you know, no one cares :')))", "url": "https://www.reddit.com/r/SuicideWatch/comments/q2geiv/job_hunting_makes_me_want_to_die/", "title": "Job hunting makes me want to die.", "social_network": "reddit", "user": "Competitive-Bug6409", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 65, "down_vote": 0, "creation": 1633509935, "permalink": "/r/SuicideWatch/comments/q2geiv/job_hunting_makes_me_want_to_die/", "nsfw": false, "first_save": 1635423124.2342677, "replies_charged": false}