{"id": "t5_2qpzs_t3_oeqydn", "request": ["0d51d2f7-1f44-49da-8589-08576e1a25e5"], "text": "My mom was my only other teammate in life. She died suddenly and unexpectedly. She was 57, and I am 28. \n\nNo father. I’m alone. I am stressed from life, loss, and handling her things without a will. \n\nOne other person close to me; spends time with me but not “present” in my mess with me. Unable to be communicated with currently. \n\nIt’s been almost 2 months and I somehow feel worse than I did the week of her death. \n\nI have a lot of regrets about our relationship. I know I am only human, but she deserved more in life than what she got and I should’ve given more. I was pretty selfish in my youth. We were just starting to mend our relationship when she died. I brought her a Mother’s Day gift just a week before. \n\nI hate knowing that after all of her life, she went back to the nothingness that we were in before we were born. \n\nI don’t want to die because I think I’ll be reunited with her. I want to die because I won’t be without her anymore.\n\nI’m 4 days shy of not having SH’d for 1400 days. I am struggling tonight. Alternatively, I want to drive away from the city and turn off my phone for a day. Stop being a mourning daughter, an invisible girlfriend, a tired pet parent of ill animals, a lawyer’s client, an executor, etc. Not have a check list of things to do for her house, or my job, that no one can help me with.\n\nI truly believe I’ll take myself out one day. Maybe I’ll give myself the same amount of time as she had. Sometimes, I just don’t see how I can make it that long, though. I don’t know how I can love the same things I loved before she passed. What did I even love? I foolishly gave a lot of my heart to others. That’s about it. \n\nI don’t have the energy. \n\nI don’t want advice or solutions. Thank you for reading.", "url": "https://www.reddit.com/r/SuicideWatch/comments/oeqydn/my_mom_died_im_finding_it_difficult_to_keep_living/", "title": "My mom died. I’m finding it difficult to keep living.", "social_network": "reddit", "user": "eleshikebi", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1625560881, "permalink": "/r/SuicideWatch/comments/oeqydn/my_mom_died_im_finding_it_difficult_to_keep_living/", "nsfw": false, "first_save": 1635426786.1970892, "replies_charged": false}