{"id": "t5_2qpzs_t3_n9jut9", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "A few days ago, I read this very triggering article regarding suicidal and homicidal murder. I won’t go into it so as to not trigger anybody. I haven’t been triggered by things since I was a kid. Generally I analyze every single thing all the time (might be an OCD characteristic). And usually if I’m anxious ab something I ruminate until it becomes “old” or I have a new conclusion. But this story legitimately terrified me bc...I related so much to the person. Like, way too much. Not just in the mental illness aspect, but in their analytical manner of thinking and even their demographics. I’ve been trying for so long to hold on, but when I read this article, for the first time in my entire life I felt truly hopeless. I’m scared that I shouldn’t hang on anymore because it CANT get better, no matter how much I hope that it will. I always want to help people and improve the world but I don’t know how anybody would be able to help me. I truly feel powerless. And ive written things on social media in the past to raise awareness for social justice, as well as to share my open thoughts ab some intriguing topic. But I can’t do it about this because it would freak people out. It’s freaking me out and I’m the one who understands it. I want help and I want to feel okay but I don’t know if it is possible anymore. And I don’t know how I will “conclude” something about that article anytime soon, if at all. and the truth is that I think it’s going to stay with me for awhile", "url": "https://www.reddit.com/r/SuicideWatch/comments/n9jut9/terrified/", "title": "terrified", "social_network": "reddit", "user": "marie_purr", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1620691138, "permalink": "/r/SuicideWatch/comments/n9jut9/terrified/", "nsfw": false, "first_save": 1635428041.2945454, "replies_charged": false}