{"id": "t5_2qpzs_t3_q9dwcs", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "I'm going to try a different slant on this for people not familiar with the terms used in my last post.\n\nHas anyone else experienced a fear that is attached to all conscious beings?\n\nLike you're constantly aware of the aggregate suffering in the world and you're afraid anyone might get hurt at any moment?\n\nThe woman who scanned your groceries this morning; you're afraid she might get hurt. She might get sick, or someone might hurt her.\n\nThat zebra is being eaten by a lion.\n\nThat squirrel might get sick.\n\nEvery conscious being will get sick and die.\n\nOnline I have seen a wilderbeest with it's leg half torn off still trying to fight, an antelope with it's guts hanging out still trying to run, a man pull the fur off a rabbit while squeaks in pain. Human depravity of all sorts, paedophilia, zoophilia and pro-rape propaganda.\n\nThe fear and danger is just everywhere for everyone. Life is inherently bad. Life is suffering. It's not worth living. I want a way to understand this pain, but I feel I never will and my only option for not suffering is to die.\n\nI want to know if there is a better way, a reasonable, rational response to this pain. I want to know if there's anything worth living for.\n\nI can't see anyone living \"normal\", happy lives. I see that everyone feels pain at some point, and eventually dies, there is no normal for me to compare to. The entire entire world just seems insane.\n\n&#x200B;", "url": "https://www.reddit.com/r/SuicideWatch/comments/q9dwcs/has_anyone_experienced_feeling_like_everyone_is/", "title": "Has anyone experienced feeling like EVERYONE is in constant danger?", "social_network": "reddit", "user": "OC-alert", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634397098, "permalink": "/r/SuicideWatch/comments/q9dwcs/has_anyone_experienced_feeling_like_everyone_is/", "nsfw": false, "first_save": 1635425512.1953132, "replies_charged": false}