{"id": "t5_2qpzs_t3_orbq41", "request": ["514a3403-b999-41f0-a27f-7c65ea859d8e"], "text": "Hello everyone. I've been dealing with chronic back pain for the last 3 years and had surgery about 6 months ago for it. Unfortunately it didnt help much with the pain and I'm looking to go into another surgery. This injury has taken everything from me. I use to deal with all my anxiety and depression through physical activity and now I'm unable to use it as a coping mechanism. Suicide is always on my mind and I've already made a coupple pathedic attempts at ODing and cutting myself.Throughout trips to the hospital and psych ward, I still haven't been able to find the proper resources I need to help me mentally. I've been on and off medication for my depression but they just seem to make me more suicidal... like I said, physical activity was always the best outlet for me. I've tried the hotline many times and I find that this resource is very limited. The help you recieve is far from what you'd get from a real psychologist. I'm hoping that once I get on disability more resources will become available to me.\n\nIts absolutely amazing how your perspective on the world changes when you're going through something like this. My dad had taken 2 weeks off work to look after me post surgery. When I woke up after day one post surgery, I was screaming in pain and couldn't feel half of my leg. It took about 40 mins to get into my dads car. Once I got to the hospital he dropped me off, left, and shut off his phone. I had to taxi home and get friends to take time off of work to look after me. After a couple of days he contacted me saying that I could come back under the condition that I \"don't cry and act like a pussy\". I had told him before hand that I'd need help getting dressed, going to the washroom etc. multiple times leading up to the surgery. He has always been toxic but I thought he'd hold it together this time as this has been one of the most difficult periods of my life... I trusted him. I had to decline his offer as I knew I couldn't meet his \"conditions\".\n\nMy best friend had taken time off work to look after me and decided to hurl a bunch of insults at my dad one day after leaving my house. That incident has now made my entire family shun me. None of them respond to me anymore. I have also cut ties with that friend because what he did was careless ruined my relationship with my family.\n\nBesides from that, when you're in a position where you cant do anything for anybody (besides talk to them, make them laugh, give them advice... on a good day), and they have to help you selflessly... you realise that it's very hard to find someone willing to do that. All my friends have distanced themselves from me despite my best efforts. This is the most alone I've ever felt in my life.\n\nThroughout my disability I havent able to get disability payments from the government as my girlfriend had been looking after me. Unfortunately it's been a toxic and terrible relationship. She had came into the relationship with terrible insecurity issues derived from her previous relationship and things kind of came to a head when my back went out three years ago. I've been ridiculed and tormented for \"cheating\" while I'm laying on the floor withering in pain barely able to do anything. I'm now at a stage where I cant take it anymore, shes out of the house, and I am now waiting for my disability payments to come through. In the mean time I'm sure my landlord will understand that I cant come up with rent on time, but I need money for my medications and food. A friend of mine started a fund raiser for me and I would love if any of you could help in any way. I really appreciate it.\n\nI'm in a crisis mentally, physically, and financially. Any support whether it be through advice, just chatting, or if you choose to donate, would be greatly appreciated.\n\nhttps://www.justgiving.com/crowdfunding/chelseee?utm_term=M3ZypzdnD\n\nI've been taking deep breaths and just trying to take things one step at a time.\n\nEditx3- added more information/Grammer, punctuation and spelling.", "url": "https://www.reddit.com/r/SuicideWatch/comments/orbq41/dealing_with_chronic_spine_pain_which_has_lead_me/", "title": "Dealing with chronic spine pain which has lead me down the path of suicidal ideation", "social_network": "reddit", "user": "Potozny", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1627220327, "permalink": "/r/SuicideWatch/comments/orbq41/dealing_with_chronic_spine_pain_which_has_lead_me/", "nsfw": false, "first_save": 1635427230.0041394, "replies_charged": false}