{"id": "t5_2qpzs_t3_pr2uri", "request": ["5f7c2841-3f43-4682-8126-88825da57933", "e90ed7cd-6d5b-453d-b307-06c2035916a8"], "text": "If you wanna make sense of this, read my history/profile. its pretty self explainatory and litrally has only 2 posts other than this one, I was 16 when I figured out what I did was what i did .im 17 now and currently im waiting till im 18 to kill myself because if i die a minor there is a high chance my parents might be held for neglegence and i dont want that. So currently im doing everything in my power to act normal till my 18th birthday on 16 may 2022. \n\nSo my note of goodbyes\n\nMom dad, (Amma ,Appa)\n        Dont ever blame yourself,none of this was your fault , sure, all this wouldnt have happened  if i had told u what was happening when i was 6 but that, thats on me. And, no, there is no way you could have known what i went through. I wanted u to see me as the good moral and innocent boy u raised till the end. I can act very well and if you are reading this and im already dead, and none of u noticed how bad my mental state was , it was because i wanted it to be that way.so no u did nothing wrong. I love you and u are the best parents i could have hoped for.goodbye\n\nDear little sister,\n\nIf your reading this im most probably dead, iv been trying to spend time with u as much as i can for 2 years before im 18. I watched you learn to cycle read run and im so proud of u for everything u have done., im writing this note in advance because i dont know how my mental health will be as the date i choose to kill myself comes closer but know this.\n        I love you from the bottom of my heart, i wanted to protect you form things like what happened to me,\nBut i cant when im dead but please know that i will always be watching over you. I want you to live a beautifull life, finish college, get a job ,learn to drive, see the world, learn to defend yourself physically and mentally and last of all ,be happy. Goodbye.\n\nDear  mama:\n        You are the closest thing i had to a brother/uncle /mentor/and friend. You are a wonderfull person and thought me so many things. Youve been in a wheelchair for 30 and odd years and still manage to go through every day without anger or resentment, and i wish i was like u, but i hope you live a long life the same way you have lived till now filled with peace, tell patti thata i love them. Goodbye.\n\nLast of all koushal.\n\n    My dearest friend , you never knew about any of this and it wasnt because i didnt trust u but rather because i couldnt bear to even think of how youll see me. You are my best friend and i hope you have a good life full of happiness .\n\nNow apologies\n\n    To the two boys, im sorry . I know what i did was beyond wrong. I dont ever expect u to forgive me.\nI may have been a kid but that justifies nothing. I wish u all the best and no this isnt your falt. Its all mine\n\n   To my family and friends\n\n    Im sorry i took this way out, and if i could go back to when i was 6 and change it all i would. Im sorry and i love you all.\n\nNow forgivness.\n\n    To the two girls who did what they did to me,\nI spent my whole life hating you without realizing i became somewhat like you and i hate you for what u did. Again there is no chance you two would ever read this because we havnt seen eachother for more than a decade but ..... i forgive u , you were children after all.\n\n\n GOODBYE.\n\nAnd to the kind redditor who eeplied to my previous post saying i desearve unconditional love and happiness, i know i dont and i know i was just a kid but, thankyou anyway for every word of your comment made it easier for me to sleep.ill remember you .\n\nok then,to all the people who read this (even if its only a few). I hope and pray none of you experience what i have, and that you choose better than me. I am sorry if i  triggered anyone . By the time i realized what i did i already built a very strong moral concience and when i did realize, i could no longer function as it went against the very thing i built. But i hope anyone who ever thinks of suicide , not to go through with it like i will in a few months. Love you all. Good bye.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pr2uri/my_last_goodbye_actually_a_suicide_note_really/", "title": "My Last Goodbye. Actually a suicide note really", "social_network": "reddit", "user": "Potential_Bet945", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 85, "down_vote": 0, "creation": 1632033385, "permalink": "/r/SuicideWatch/comments/pr2uri/my_last_goodbye_actually_a_suicide_note_really/", "nsfw": false, "first_save": 1635421108.6058702, "replies_charged": false}