{"id": "t5_2qpzs_t3_qd6wwo", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "I'm 25F I've been struggling with depression for 10 years now. Actually if I look back in time I've been always been an unusual girl who doesn't know how to deal with life. Childhood full of traumas cause my father has always been an emotional wall, he was there but not really there, like emotional unavaliabe. My mother always worked too much and always criticized everything I wanted to do or be.  I suffer a lot of bullying in my childhood and teen years by the point of ruining complete my self steem  as I've always seen myself as a burden, a failure, an ugly worthless piece of shit.\n\nI've been diagnosed when I was 15 years old, just because I've started self harming and my mom saw my scars and was worried. I tried to kill myself a bunch of times, one time with pills, but i didn't work. one time, I tried to drown myself in the beach going too far into the sea, it didn't work (i was \"saved\" by my cousin), i tried to cut my wrists but the pain stopped me and i wasnt able to cut deep enough.\n\nYears and years, my life has always been this urge fight against depression and anxiety. I actually thought I'd be dead by now. I was actually seeing another theraphist and the meds seems to be working this time and I think I'm finally finding my way in life. But I'm 25 and depression has made me uncapable of living in the world, I don't work, I'm trying to go to college, My parents pay for everything  I feel grateful but at the same time I feel suffocated. They're very religious and they think only Jesus will \"fix me\". I'm bissexual, I've never went into a real relationship with another girl because I think it wouldn't be fair with her cause I can't really be her. I tried to come out to my mom and she said that I was delusioning.\n\nBut every time I think I'm getting better my mom comes to me like \"how can you not be over it yet?? c'mon we should try another theraphist cause it's taking too long\". I feel angry, like do I need to be dying, literally bleeding, freaking out, losing the rest of my sanity for them to see that I'm suffering? yes, it's been 10 years and i'm still struggling. \n\nI wish I could kill myself. I'm tired, I'm done. I had a plan where I'd go to a very distant part of the city I live that is actually dangerous to go without a car, I'd go there, go into the woods and drink poison and die. And nobody would find my corpse and my mom wouldn't be one to find my body and know I did kill myself. I was kind obsess with these thoughts but I know it won't work. I just wish there was a way, a way I could do it. I think I'm damned. It's been 10 years and I'll never be free from depression or my parents, I'll always be this miserable useless that don't even have control of her own life. I'm tired, I just want to disappear, I just want to die. I tried everything, but I don't see a way out of this., if I knew how to just end it all, I would.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qd6wwo/im_tired/", "title": "I'm tired", "social_network": "reddit", "user": "a_departure_", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634868317, "permalink": "/r/SuicideWatch/comments/qd6wwo/im_tired/", "nsfw": false, "first_save": 1635425592.5359778, "replies_charged": false}