{"id": "t5_2qpzs_t3_o4e40h", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I've always thought of my mental health as like an ocean. My depression and anxiety are crashing waves. Most of the time I'm treading water, but I've been sinking for some time now.\n\nIt was getting better. Things were working. I thought, finally, I had some control over my life. But I've been slipping back under those waves without noticing. I didn't realize how much deeper things had gotten until I started sinking entirely. When I'm alone, when I finish work or I return home, I just sink. I go from being happy to just an endless, sinking sadness. All I want to do is sleep because sleep is the only time where I'm not ruminating and sinking. Even then, I have bad dreams all the time. Dreams that just make me think more. Panic more. \n\nThat's what my life is right now. Just, panic. \n\nI panic about everything. I panic so much I do nothing, and then I end up panicking even more. The future and what I'm doing with my life is creeping up so fast and I just can't keep up. It's like a tsunami I know is coming, and I just don't have the strength to face it. But then, if I'm really honest with myself, I'm not convinced I want to face it. I think I don't want a future. I don't want to feel like I'm sinking all the time, I don't want to throw myself deeper into the ocean. I'd rather just drown than keep going on like this.\n\nAnd that terrifies me. \n\nIf I'm honest again, I think if I keep going all I'll do is drag everyone around me under with me. I'm so draining, so much to handle. I'm a leech, and I suck the life out of everyone I care about. I'm tired of being a bad daughter, girlfriend, friend. I'm tired of making everyone else's lives worse. \n\nThere's just so much and it's so overwhelming, and I don't know what to do. All I ever do is turn to strangers online, and it's not like these people know me. They know nothing about me, they know nothing about what a bad person I am. I've been through three medications and they've made things worse, I tried to talk about other treatment options but I have to wait weeks because the doctor said I wasn't ready. I have to talk to someone about CBT and therapy and it's scary. I hate talking, I hate being forced to share my feelings like that. I hate all of this. But there's no way to stop it. I'm sinking, and there's no way to stop it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o4e40h/sinking/", "title": "Sinking", "social_network": "reddit", "user": "sincerelyannoyed", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1624220355, "permalink": "/r/SuicideWatch/comments/o4e40h/sinking/", "nsfw": false, "first_save": 1635428036.3879235, "replies_charged": false}