{"id": "t5_2qpzs_t3_qae8bi", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "You are not wrong about me. You never have been. I would really hate to admit this to myself. Truth is I have been fighting it ever since. How can I expect forgiveness for my actions and words? How could I think this was ever going to be something I felt that I truly wanted? I sometimes have a really hard time separating the assumptions that people understand my emotions and the things that I am doing, but I truthfully do not. I am truthfully not in control of my emotions. I have lost sight of myself. I also find it very difficult to understand that people do not know the things that I know. Peaky blinders if you will. Call it a mental illness, call it Asperger’s, call it craziness, base it on whatever societal standards you must but It alludes me and that would be judgmental upon my behalf with things you do not understand either. Just labeling my behavior. I thought everything, I was doing was normal.\n\nDo you ever think you can let go of this idea that you have of me and my struggles and understand that this is apart of who I am and look past it to man underneath?\n\nThe negative emotions your encompassed were created by you because all my intentions were sent with positivity and met with negative feedback. That in turn led to negative emotions and distress on my part because I did not know how to handle them. It is hard being told that I do not know how to handle my emotions, when someone is reciprocating the same behavior and not handling the emotions themselves. Returning things with a negative connotation and attitude towards something that was a gesture of kindness.\n\nI am starting to accept the fact that I am neurodivergent and do not rationalize things as what is deemed “proper”. I just wish It wasn’t met with so many aggressions and negative energy. It made me become so introspective of my thoughts, that I was internally immobilized. Again, not your problem, right?\n\nFor someone living inside this idea that I am self-absorbed and only worry about what affects me, I sure do think about others often. Especially you.\n\nMy behavior and thoughts have drastically changed since meeting you. It is fucking remarkable. It is going to be hard for me to let go of the idea of love considering this idea of change in my life and how much it impacted me. It is going to be really hard to truly get it together without knowing that I truly did find myself and try and try and change for the better because of meeting you.\n\nI guess everyone just wants to be heard. Yet, I am not being heard.\n\nI KNOW THAT I HAVE CAUSED YOU PAIN AND I HAVE APPOLOGIZED ABOUT IT EVER SINCE. BUT YOU HAVE CHOSEN TO IGNORE ME.\n\nTHAT IS EVEN MORE FUCKING PAINFUL BECAUSE I FIND MYSELF CURIOUS ABOUT EUROPE WHERE YOU TOOK OFF TOO LEAVING ME BEHIND EVEN THOUGH YOU SAID YOU WOULD FLY ME THERE.\n\nWith great joy, there is always even greater sadness. With every single waking breath, every thought is about you.\n\nPlease don't make me internalize what is wrong with me man. I already think that I am a terrible person for the things I have done and said. But right now, it would be hard to really think about not communicating. I really want to work through my mental anguish. Like badly. But it has been 10 months and I am still capitulating all these thoughts. I would love it if you could show me sympathy and know that I am just a guy going through a lot and the loneliness is really taken hold of me. I know I tend to do this often and I recognize it, but please do not let another person suffer . I am not blaming you. but there is a lot unspoken, and I must confront it, and I truly know I can not do it without saying it to you. You have cost me my life bro. You literally can not stop and think about someone else’s mental status long enough to give a shit. You will never cry over this because you did not care. That is the real fucking pain of it all. That is the truth of how fucking morbid your mind is. And you did it on purpose. TAKE CARE OF YOURSEL- YOU DESERVE IT.\n\n  \n\nA lot of people feel suicidal. A lot of people feel sad. It is always met with so much haste because no one really knows how to deal with the depression and sadness. But most people have people. I am not special. But I really wish someone would have treated me like I was. Fuck. \n\nMy suicidality was not a scare tactic to keep you around in my life or make you feel sorry for me. It was a thought process about being alone. Then when you were gone, leaving me completely alone. You did not have to deal with it anymore. ", "url": "https://www.reddit.com/r/SuicideWatch/comments/qae8bi/i_want_to_tell_her_everything_i_finished_the_note/", "title": "I want to tell her everything. I finished the note that no one will read.", "social_network": "reddit", "user": "Mydepressinglife2334", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634527150, "permalink": "/r/SuicideWatch/comments/qae8bi/i_want_to_tell_her_everything_i_finished_the_note/", "nsfw": false, "first_save": 1635425273.3924332, "replies_charged": false}