{"id": "t5_2qpzs_t3_qhhsm0", "request": ["0c6360e0-5fd0-41bf-97f4-d870570d8b8d"], "text": "I’m 17, I live alone with just my single mom and all I do is work everyday with one day off a week, I’ve been hospitalized twice for attempts but I honestly need to man up and just finally do it properly. The only thing I want is to find someone who loves me. The only girl I have been with was a 27 year old single mother when I was 16 and looking back she was only grooming/using me. I told her I had a cucking kink but I never wanted her to sleep with any of my coworkers that would break my heart. She slept with 3 of my coworkers after I said that without telling me. Every single day I would buy her, her favorite candy, drinks, or snacks without fail. I would give her like half my check every month because I loved her so much and I would do anything she asked me to because she loved me too!! And shes the only girl who doesn’t think I’m ugly so how could I not do what she says? After all this happened I found out she kicked me out on her birthday (Valentine’s day) to fuck one of my coworkers who has a teenage daughter the same age as me 🤢🤮 and she invited me over afterwards to eat her out. I only put the pieces together months after but I threw up when I found out. She also told my whole workplace personal things about my sexuality and tons of other horrible things that make me cry just thinking about. She told all my adult coworkers about how she pegged me and I found out afterwards they would make fun of me for it :( I freaked out and tried to fight the guy that she invited over at work and they fired me. I hate being fucking ugly and worthless. Everytime I see a couple I start thinking about ways I could buy a gun to kill myself because if I’m not good enough to be loved at all then I don’t wanna be alive 🤷🏽‍♂️ it might sound selfish but I’m tired of having to act like this is normal and ok. I’m tired of being forced to only observe happiness and being loved. I just wanna experience it :(((", "url": "https://www.reddit.com/r/SuicideWatch/comments/qhhsm0/im_tired_of_waiting_for_things_to_get_better/", "title": "I’m tired of waiting for things to get better", "social_network": "reddit", "user": "SajThrowaway", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1635407254, "permalink": "/r/SuicideWatch/comments/qhhsm0/im_tired_of_waiting_for_things_to_get_better/", "nsfw": false, "first_save": 1635426383.2660947, "replies_charged": false}