{"id": "t5_2qpzs_t3_q6zjed", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42"], "text": "I wouldn't say I'm smart person, mainly for the fact that everything I do either seems wrong or not at the right time. There's lots of evidence to prove this is the case, but I want to talk about a different subject that links towards this.\n\nI'm an easy target for bullying. I can't control my anger and I'm extremely sensitive, but sometimes it's the people around me that are wrong. People in general suck. They mock you, call you names, and make fun of your personality. This is the case for me.\n\nThe people in my environment are very smart. They know more than me and like to correct any small mistake either I do or somebody else does. This type of behavior leads to arguing and fighting, and can you guess what happened to me? A 3 year long fight that's still going on to this day that's gotten worse and worse over the months.\n\nNow you may be wondering, why is this fight bad? Is said individual telling others to pick on you? Yes. I've been called every name in the book, a retard, autistic, a dumbass, a goldfish surprisingly, it hurts, especially when I've been called those names so much to the point where I'm starting to believe it.\n\nWhy out of all people does this have to happen to me? Am I seriously that much of an asshole? Did I hurt your family? I can't ever get answers. I can't avoid this behavior either because I've tried everything and nothing will fucking work.\n\nI'm not planning to kill myself anytime soon, but I've had those thoughts. What's the point of living when you're going to get harassed the next day? What's the point of waking up and going to school only to get insulted?", "url": "https://www.reddit.com/r/SuicideWatch/comments/q6zjed/constant_harassment_led_me_towards_suicidal/", "title": "Constant Harassment Led Me Towards Suicidal Thoughts", "social_network": "reddit", "user": "trdrones", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1634085105, "permalink": "/r/SuicideWatch/comments/q6zjed/constant_harassment_led_me_towards_suicidal/", "nsfw": false, "first_save": 1635427375.9046416, "replies_charged": false}