{"id": "t5_2qpzs_t3_bar0o7", "request": ["21acfd9d-efc3-4a00-8159-c2d147c4dbaf"], "text": "So many people have told me the same exact thing. Accept myself, love myself, be myself. When you've walked the path I have, Myself is all I've ever had. No Mom, No Dad, no family...and sure...friends come and go. In the end, it's always been me...left alone. And being alone with my thoughts through years of abandonment, chips away at your confidence and self esteem. Answers to impossible questions remain unanswered. Why didn't they want me? What did I do? Why does it seem like nobody cares? Self pity can only get you so much sympathy, that I have learned at 32yrs. Pity & sympathy are something I resent because it gives the false impression that I'm unequal or not good enough. Eventually the self pity goes away...except it's replaced with: \nSelf hatred.\nSelf Doubt. \nSelf Sabotage. \nBecause logically there must be a reason they didn't want me? Perhaps I wasn't good enough in there opinion. \nVitriol sets in...\nSour grapes become the mindset. \n\"Who needs them anyway? I don't need anyone. I've only ever been able to depend on myself.\" \nLive with no expectations. Depend on no-one\nisolate\nmaintain. \nPeople begin to annoy you, their very presence is an inconvenience. Others successes become my own shortcomings. The what if's could go on for miles. Still...maintain.\n I no longer fear death, but I don't welcome it either. It's life that I fear, this endless...never ending empty life. Yes it's a view of pure melancholy, but when you've lived through it...it's simply just another day...", "url": "https://www.reddit.com/r/SuicideWatch/comments/bar0o7/another_day_stuck_being_me/", "title": "Another day stuck being me", "social_network": "reddit", "user": "DoctaJa", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 5, "down_vote": 0, "creation": 1554710054, "permalink": "/r/SuicideWatch/comments/bar0o7/another_day_stuck_being_me/", "nsfw": false, "first_save": 1635427576.2325156, "replies_charged": false}