{"id": "t5_2qpzs_t3_entqq4", "request": ["ced7dee5-3c4f-499e-9148-47c2a28dc4d7"], "text": "I saw a clip from the perspective of some guy - some American tourist - live-streaming from japan where he was speaking English to some stranger, clearly not being understood, and this woman was still basically throwing herself at him.\n\nmy mind has been particularly bad this week. I can count a few times where I had to fight back tears at work - apropos of no immediate problem - just dissatisfaction with my life, and dwelling on it. I’ll never be that guy. I’ll never be that attractive or that outwardly confident. I’m 5’10”, severely balding at 24, unable to put any muscle on my arms (despite weight training every other day for the past 4 years and consuming a shit load of protein powder), and with an extremely mediocre face. I’ve consulted a cosmetic surgeon about the balding and was turned away because I’m literally losing too much hair.\n\nI thought that I could compensate for my physical shortcomings by just having a really successful career and making money - that’s the conventional wisdom anyway. So I studied a ton and got a good job. A week ago my salary got raised into the six-figure range. None of it has made a difference. Since getting hired and becoming “successful” nothing has changed. I just have more money and nothing to do with it.\n\nI know it’s dumb to get hung up on a 20 second video for which I have almost no context - but it so perfectly crystallized all the shit I’ve been feeling for a long time. There are people who are just hot. It’s just easy for them to meet and date the kinds of people they want. I’m not. I won’t be, regardless of how much effort I put in. And I don’t want to live the life implied by that fact. I don’t want to be alone. And I don’t want to settle. And I don’t want to keep putting in effort without any kind of hope or validation that it’s not being completely wasted. It’s become painful. The things I used to like now just make me sick. I just want to die.", "url": "https://www.reddit.com/r/SuicideWatch/comments/entqq4/stuck_with_the_mind_and_body_i_was_born_into/", "title": "stuck with the mind and body I was born into; realizing the limitations of my immutable flaws; I don’t want to live my life", "social_network": "reddit", "user": "_up_and_get_me", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1578864361, "permalink": "/r/SuicideWatch/comments/entqq4/stuck_with_the_mind_and_body_i_was_born_into/", "nsfw": false, "first_save": 1635426241.2547286, "replies_charged": false}