{"id": "t5_2qpzs_t3_jkew92", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "I’m a 18yo girl and I’ve been wanting to do it for a very long time now with the only reason i haven’t being my family. I know my mum could not handle it and trigger so much upset that it would just not be fair. \nI’ve thought so much on this and how I would do this and the best way for me is to distance myself from them and to make it so that if I died they wouldn’t care but with me still being young and still living at home I don’t see how this is possible. \n\nI’m very sure I have a hpd a personality disorder that makes me completely reliant on peoples opinions of me and I’m easily influenced. I cannot think for myself and I’m incredibly indecisive which leads to and has led to me being in a lot of bad situations. \n\nI’ve never really had friends or anyone that I haven’t manipulated to be there for me. To my friends I am extremely generous as they all come from rough backgrounds and I give them everything they need, whenever I can, just so they don’t leave which I don’t mind because I like giving but no one does it back for me which understandable but it’s just like I’m holding on to people just so they don’t leave and I’m on my own. I can not stand being on my own and that’s when I get my worst and I really start to think.  \n\nI take a lot of drugs regularly so that I don’t have to think. I am only here for my family and I just want someone to be there for me, someone I can talk to and be with without the fear of them leaving.", "url": "https://www.reddit.com/r/SuicideWatch/comments/jkew92/can_someone_just_read_this_please/", "title": "Can someone just read this please", "social_network": "reddit", "user": "fuckinspack", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 18, "down_vote": 0, "creation": 1603993837, "permalink": "/r/SuicideWatch/comments/jkew92/can_someone_just_read_this_please/", "nsfw": false, "first_save": 1635426643.2568944, "replies_charged": false}