{"id": "t5_2qpzs_t3_nqb1vl", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": "I know how selfish and evil this sounds but I ruminate in my mind about it and I think about how much it would hurt the people who have hurt me. I feel so lost and every time the world lifts me up, it's just some cruel joke to throw me back down again. I got into an argument with my mom, who was physically and verbally abusive growing up, because I told her how much her actions have hurt me. I thought I found an answer in meditation, but her worlds just wouldn't let me find peace. She started blaming me saying that I was trying to make her miserable and that I was bringing stuff up from years ago, but it still hurts and affects my mental health. She just goes on about how ungrateful I am and saying this is why I don't have any friends and how no one likes me\n\n&#x200B;\n\nYoutube kept recommending me videos about manifestation and how your subconscious could give you anything. It's all a sham. I tried to manifest an apology from her but that didn't come. I'm just tired of it all. Tired of everything and I feel like I can't take much more. If she saw my body after getting off of work I know it would destroy her. She couldn't even handle seeing a dead cat in the yard one morning and she's already lost a few people close to her so this would ruin her life. Make her regret how she treated me and let the world know that it can't keep tossing me around anymore. Spite isn't the only reason I have these thoughts but it's very motivating right now.", "url": "https://www.reddit.com/r/SuicideWatch/comments/nqb1vl/i_cant_stop_thinking_about_spite/", "title": "I Can't Stop Thinking About Spite", "social_network": "reddit", "user": "Manga-k4", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1622600575, "permalink": "/r/SuicideWatch/comments/nqb1vl/i_cant_stop_thinking_about_spite/", "nsfw": false, "first_save": 1635428034.3408415, "replies_charged": false}