{"id": "t5_2qpzs_t3_ouyfj8", "request": ["984215fa-c11f-4227-9099-1707eb1ddba9"], "text": "(Throwaway account (23/M)) I have been struggling with depression, anxiety, ADD, BDD, and OCD for many many years, but I have managed it decently well in the past few years. I was actually in probably one of the best mental states of my life a year ago; that was until I noticed I was losing my hair (plus covid ruining the world, but that's another conversation). My hair has always been one of my greatest features, people used to tell me that all the time. It practically defined my personality. About 8 months ago, I started using minoxidil and finasteride (only two meds FDA approved for growing hair). For a while, I was pretty optimistic because I know that my hair wouldn't regrow overnight. It got a smidge better for a little while, but now it is back to the baseline from 10 months ago, if not worse. All day, every day, its all I can think about. I applied for 15 jobs today (I graduated college last year), and all I could think about the entire day was my hair and how awful I feel about myself. I am constantly check my hair in the mirror and feel like shit, or see myself on snapchat. If im not doing that, im probably reading up about something regarding hair loss in a attempt to feel better about myself. I want to find a way to feel better about this. I NEED to find a way to feel better about this or I fear I will go way off the deep end. This issue has consumed almost every waking hour of my life for the past year; spent doing research on hair loss, researching any potential contributing factors, watching youtube videos, reading articles, spending hours on r/tressless etc. I'm so tired. I would do anything to get my hair back to where it was two years ago. I would trade legit anything. I don't think shaving my head is a viable option for me, I think that would legitimately break my brain and make me much more suicidal, depressed, dissociative, etc. I have a constant thought: if I killed myself today, at least I would still have hair during my funeral. I don't know what to do with myself. I hate how I look and I spend every waking minute thinking about it and feeling the need to stare at myself in the mirror. It is inhibiting my social life, I actively avoid meeting new people and seeing friends as often as I used to (Yes, I am seeing a therapist and yes she knows how much I am struggling with this.)\n\nI quit vaping in February of this year, but I picked it up again when I moved in with a friend by hitting his vape almost daily. I feel like this has contributed to my hair loss and makes me feel like absolute shit. I pledged to quit for good last night and I am praying to sweet jesus that my hair might start to grow back and be healthier (nicotine is a vasoconstrictor, so stopping smoking should help me get more blood flow to my scalp). At the same time, I am really itching for a fix, I just know I really shouldnt and I am trying to quit cold turkey, I fear I might lose more hair if I continue my habit.\n\nI don't know why I am posting here, but I just really REALLY needed to get this off my chest in some way. I'm so fucking tired of everything. I hope everyone reading this is doing okay mentally and physically, feel free to reach out to me if you need to talk about anything.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ouyfj8/hair_loss_ruined_my_self_image/", "title": "Hair loss ruined my self image", "social_network": "reddit", "user": "TacoTuesday-97", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1627695934, "permalink": "/r/SuicideWatch/comments/ouyfj8/hair_loss_ruined_my_self_image/", "nsfw": false, "first_save": 1635426411.015076, "replies_charged": false}