{"id": "t5_2qpzs_t3_qcnd19", "request": ["5f7c2841-3f43-4682-8126-88825da57933", "444f139e-44b6-48f7-bc1a-53fc0ad9ead2", "5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "Think about it. No one truly cares. Everyone is too fucking busy with their own agenda. No one wants to listen to how hard life is for you and it is painful. This is why so many suicides happen. If you are like me and only want the right person to listen, and they refuse- it makes it even harder. Well, I am here to tell you that in my final day of life- I FUCKING CARE. I will lend an ear and call you and let you tell me your reasons. I will send you a meme. Send you a song that changed my life. If I could send you a hug, I would. Because No one fucking cares. I CARE. I am not trying to be special. I am not trying to pigeon hole everyone. It is just starting to feel this way. I will listen. I will give you every ounce of empathy in my heart and soul. Because, if you know-you know. I am there now, in that mindset. And people are too damn busy. It is driving me crazy and further off the ledge than I ever wanted to be. So I CARE. Today is my last day on earth. I had a really close friend who was hospitalized for an attempt tell me that no matter what, they would be there if I ever felt this way because I drove them to the hospital. Last night, I got hit with such urges and I text them. Their response was, \"I am free on the weekends, but I got to much going on.\" So no, they weren't there. I AM HERE. Then this particular person that I really want to hear from wouldn't even let me say a goodbye. Just blocked me. NO ONE FUCKING CARES. I DO. ✌☮ They used to send me these exact emoji's and I think they truly knew that I was going to die even if they had communicated with me. Please do not do it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qcnd19/no_one_cares_that_you_are_suicidal/", "title": "No one cares that you are suicidal.", "social_network": "reddit", "user": "Mydepressinglife2334", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 22, "down_vote": 0, "creation": 1634805837, "permalink": "/r/SuicideWatch/comments/qcnd19/no_one_cares_that_you_are_suicidal/", "nsfw": false, "first_save": 1635421102.502519, "replies_charged": false}