{"id": "t5_2qpzs_t3_p6lp1", "request": ["a42602bd-4070-4888-8239-2ce8ca426dd7"], "text": "Everyone here has it so much worse than me. I feel like a spoiled brat. I am a drug addict, but high functioning. Drive brand new BMW (paid in cash), parents still support me, work at a hedge fund, but feel the draw back to the college drug dealing says. After a couple years of hiatus and going legit, I want to move beyond weed and start on the higher margin stuff: heroin, special K, prescription benzodiazepines and pain killers. The online market and ease of anonymity make it an attractive venture to enter into and frankly life as a criminal was much more exciting and lucrative (if you can, buy all of your cars from a dealer using a suitcase of money.) \n\nI heard about rich kids getting high at boarding school and drug use at the Ivys. Having supplied such clientele (coming from such a background), I've seen many lives ruined as I happily at the time took their money. Which was probably embezzled from their parents, proceeds from a stolen XBOX craigslist sale, loan from a trustafarian brethren.\n\nCollege stopped. I got a serious girlfriend. We feel in love, deeply. I had no desire to go back to my old ways and was clean of all narcotics for over 2 years. Then, she dumped me. \n\n3 months later I'm IVing heroin and at a real low point. I got some help, moved, did rehab, got out, got a good job, won the respect of my Father again, and continue to get on my feet. Until I relapsed recently and got back into the habit.\n\nI don't know if it's the winter weather, but every day the suicidal feelings become more paramount. I want to do it, but I don't want to hurt those around me who care. I want them to know it has everything to do with me and nothing about them. I want to die of an \"accidental\" drug overdose and not a suicide attempt. People around me can live with that sort of thing and attribute it to the problem I've been struggling with for years.\n\nIt's also hard to ignore the allure of going back to a criminal lifestyle. Selling lbs per week of weed in college netted me some cool cash and an equally cool and laid back lifestyle. Since then I've acquired knowledge that could make my criminal enterprise much more sophisticated. I view this as another means to my own self-destruction--die, get into jail, die in jail, or die avoiding getting into jail. \n\nIt is really odd for me to type all of this and realize that some of my best friends growing up were children of the most influential investors and NYC movers and shakers. I went to private school, got a great education, did OK in college, bullshitted my way into a comfy management job at 26, and now find myself thinking of ways I can shoot up in my office at work. \n\nAnyone else in the same situation? I've been to plenty of NA meetings and while they say they view all participants as equals, my background is not at all like those who attend the program. I couldn't find a sponsor to empathize with, only someone who could repeat the tenements of the NA program, which in analysis is one of the largest cults on the planet.\n\nI talk to close friends about this, but they all come from the same socioeconomic rich white dudes background and seem to avoid the \"disease\" (a term I use reluctantly) of addiction. \n\nJust got a Xanax refill less than 2 hours ago and already downed 10MG. Excess isn't for sucidal purposes. I'd need to consume several hundred MGs of Xanax to even reach LD50 levels. I just want to escape permanently. Life has too many pressures.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p6lp1/any_empathy_for_a_pillpopping_opiate_addict_upper/", "title": "Any empathy for a pill-popping, opiate addict upper middle class self destructive 20-something on a path of no return?", "social_network": "reddit", "user": "heyzeuschristo", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 12, "down_vote": 0, "creation": 1328128378, "permalink": "/r/SuicideWatch/comments/p6lp1/any_empathy_for_a_pillpopping_opiate_addict_upper/", "nsfw": false, "first_save": 1635422557.936616, "replies_charged": false}