{"id": "t5_2qpzs_t3_piwydw", "request": ["444f139e-44b6-48f7-bc1a-53fc0ad9ead2"], "text": "I mean think about it. When you go in a coma? Go under general anesthesia? Faint? Lose consciousness? You lose  concept of that time. Like it disappeared. When people have traumatic brain injuries/brain damage? They can change completely/forget who they are. One second somewhere/someone, next second somewhere else.\n\nAll dying is, is returning back to where we were before being alive, which is eternal oblivion. I certainly don’t remember anything before I was born. Do any of you? No, because there’s nothing before birth and after death. \n\nMy personality, habits, the way my brain works, my thoughts, etc have all been developed as I’ve grown. They didn’t magically happen when I popped out my moms vaginas. When I was born, I didn’t know how to speak English/languages or what the fuck suicide was. Everything has been taught to me. \n\nAll we are, are just intelligent animals who gained the ability to experience sentience. But once your brain loses oxygen, or you have a traumatic brain injury, or your heart stops pumping. It’s done. Or when you get Alzheimer’s. Your thoughts, personality, memories, etc. just disappear when certain parts of your brain stop working. \n\nThe simply point is; to be able to breath, think, feel thoughts, pain, emotions, memories. You need a brain. And once you’re dead you don’t have a working brain anymore. \n\nA baby doesn’t know what a soul is... what spirituality is... what religion is.... what manipulation is... because it’s all fucking taught to us. Humans just think we’re more important that we are.\n\nHopefully I’ll get the courage to do it soon. And finally end this futile existence of suffering.", "url": "https://www.reddit.com/r/SuicideWatch/comments/piwydw/ive_just_realized_dying_isnt_actually_as_bad_as/", "title": "I’ve just realized dying isn’t actually as bad as it seems", "social_network": "reddit", "user": "fruitloopconnoisseur", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 294, "down_vote": 0, "creation": 1630924665, "permalink": "/r/SuicideWatch/comments/piwydw/ive_just_realized_dying_isnt_actually_as_bad_as/", "nsfw": false, "first_save": 1635425173.8588748, "replies_charged": false}