{"id": "t5_2qpzs_t3_jr69jn", "request": ["bb7832fd-0306-444d-8835-3c87888dc029"], "text": "Im not gonna explain the context. It's a long and complicated backstory you can check on my profile (first post). But it is the main factor.\n\nI have a relatively good quality life, aside from the people in it. My mother especially...she's always putting me down and these days I feel so hurt Im not sure if I believe her statements of saying she cares. Every time Im sad she downplays it, saying how I have a roof over my head, clothes to wear, food to eat, etc. \n\nIve fantasized about my own death so many times. It seems like the only way to get the truth out is to just not be there. But then I wouldnt know the truth, but why live this lie anyway? \n\nIve always planned on using pills. But the thing is, Im afraid of dying. I dont want to exist but the fact that I am and already have makes me afraid of my end. And I feel guilty because it’s like Im \"wannabe\" suicidal. Not to mention, will my death make anything better? Id be abandoning my little sister. Id break my partners heart.\n\nBut I really wanna show my mom, that she did this. I want her to cry for me and realize where she went wrong. But that's unrealistic and Im not getting it now anyway. God, Im indecisive. \n\nSuicidal but afraid of death. But just giving up like that...man I dont know. I just feel so depressed, even on my good days where I try to be happy and one thing shuts it all down for the next few days.\n\n*sigh*", "url": "https://www.reddit.com/r/SuicideWatch/comments/jr69jn/i_feel_guilty_for_wanting_to_end_it_even_though_i/", "title": "I feel guilty for wanting to end it, even though I dont want to", "social_network": "reddit", "user": "iputmytrashhereTA", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1604955654, "permalink": "/r/SuicideWatch/comments/jr69jn/i_feel_guilty_for_wanting_to_end_it_even_though_i/", "nsfw": false, "first_save": 1635426659.2920473, "replies_charged": false}