{"id": "t5_2qpzs_t3_puhdg0", "request": ["e90ed7cd-6d5b-453d-b307-06c2035916a8", "5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "Sorry if this is a bit long. \n\nLately, anything that goes wrong makes me feel like I should kill myself. I can't handle chaos in my life anymore. And it seems that the more I grow up, the worse it gets. Like many people have experienced, I fantasize about being dead the entire time. I really fancy the silence that it brings. Even though I don't think I have enough courage to end my life, I always wish that an accident will happen to kill me. \n\nI have been contemplating why that I feel like this for a while now. And I truly believe I'm emotionally broken. In a sense that I have anger issues, I'm extremely insecure, very clingy with abandonment issues. It's a struggle for me to identify any of my feelings. Which results me to hate myself a lot. To the point where I hurt myself. \n\nI always think that my childhood could be the reason ( and sometimes it makes me feel like I'm blaming other people, like my parents, for my problem and not taking responsibility, which results in me hating myself even more). My mom used to beat me a lot. But it wasn't even disciplinary. It was just here releasing her anger from the abuse she got from my father. They always fought, they rarely spoke to each other, and when the physical fights happened, I always watched. They never divorced tho, and I still don't know why. Outside the house, being bullied was a casual part of my life.\n\n I also remember that I got molested as a child. And for the longest time, I suppressed that memory. I never told my parents at the time, because maybe I didn't even understand what had happened. I'm 21 now and I never got any therapy for this, nor for my family issues. Maybe because therapy is expensive or I just never cared to do it. And I feel like those scars, however I try to hide them with laughter and jokes, keep on bleeding. \n\nThank you for taking the time to read this.", "url": "https://www.reddit.com/r/SuicideWatch/comments/puhdg0/i_think_im_emotionally_broken_and_its_driving_me/", "title": "I think I'm emotionally broken and It's driving me to be suicidal", "social_network": "reddit", "user": "NormalBasis8242", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 30, "down_vote": 0, "creation": 1632481215, "permalink": "/r/SuicideWatch/comments/puhdg0/i_think_im_emotionally_broken_and_its_driving_me/", "nsfw": false, "first_save": 1635426864.0550966, "replies_charged": false}