{"id": "t5_2qpzs_t3_qd41wf", "request": ["4840fa65-b559-4db3-936a-2b5e68a4bac1"], "text": "\nHey Reddit family,\nHere’s my history.\n\nThe night of the 22 July 2019 \nAfter a suicide attempt, and the fact that my heart stopped and I was led to reanimation... \n\n(My father destroyed me mentally and beat hurt me physically. I had no more confidence in myself, I had no more esteem of myself.  He is an extremely violent man which when you are not in private has normal behavior, but then, his face changes he swaps his attitude and becomes a very dangerous man. Psychiatrists had analyzed him (from far, my father would never see a psychiatrist, it would hurt his fragile ego) As someone who has very disturbing and violent temper traits and who is very dangerous to society, he should not, I quote “be outside”. \nHe raped my mother (I'm not sure but maybe several times)The police, apparently knew it but did not do anything about it, probably because he has some power and a lot of contacts as well. \n\nMy father did everything he could to get my brother to commit suicide. What was to happen happened he committed suicide by jumping off from the 4th floor\n\nAs my mom being the contrary on a financial level (almost only 400€ a month, we struggled to eat every day btw )\nHe raped my mother.\nHe also, according to her and as far as I know, attempted to murder my mom.\nAnd I would truly believe her, But I have no proof... \nFrom the moment I left my mother to live with him at 7 years old my life was a continuous hell and I have never been happy in all those years, NEVER. \nI do not even ask to be happy but just not to be unhappy and suffer and in any case not to be in a psychological state, or rather without a psychological and mental state. I was annihilated, decimated.\n I acted almost like I got no mind \n\nHe made his move and the pattern with his two children and what was supposed to happen happened, I attempted to unalive myself, with antidepressants and alcohol.  I had to take 120 pills. My heart stopped. I was dead, no more life signs... but they managed to reanimate myself When I knew I had failed... never mind\n\nI hope you’ll get the life YOU DESERVE.\nI love you my friend.\nTake Care.\n\nRobin SÉRY, 21. FRANCE", "url": "https://www.reddit.com/r/SuicideWatch/comments/qd41wf/back_to_life/", "title": "BACK TO LIFE", "social_network": "reddit", "user": "Pretend_Story_5595", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1634858497, "permalink": "/r/SuicideWatch/comments/qd41wf/back_to_life/", "nsfw": false, "first_save": 1635425593.2923028, "replies_charged": false}