{"id": "t5_2qpzs_t3_kpyaa3", "request": ["929a0190-46da-4c11-8a4d-9e750cae60df"], "text": " \n\nI  started trading during downtime and depression from surgery 8 years ago  and since then I've managed to deplete my 100k+ savings on three  occasions trading stock markets and crypto.  Mostly want to short  everything because my depression fuels hate and the markets are fucking  rigged to go up.\n\nI should have  made a million dollars twice in crypto, but cashed out too early and  lost it all in other investments. Should be a bitcoin millionaire, but  bought other coins that lost 98%.\n\nI  put everything on hold for almost 3 years of my life to save as much as  possible and buy bitcoin, only to fuck up royally and buy other coins  that are now worthless, just like my soul.\n\nI  took out debt that I can't repay (half of that was on purpose cause  fuck the bankers).  I have no job now because of previous work  disability and everything is going to shit.\n\nI  must have OCD on top of anxiety/depression because I can't stop trading  and staring at charts all day trying to make it back.  Ive ruined my  life and there is no going back or starting over past 40 years old.  I  have lost all confidence in my abilities to be successful at anything.   I'm not going to become a truck driver either after working a corporate  job. I cant even fathom about going back into business industry after  losing so much money.  Id be faking it the entire time. And I cant bring  myself to get a $12/hr job at this point after thinking I was \"smart\"  in the corporate world.\n\nSeriously been thinking about buying a rope with the little money I have left.  I keep ruminating on it for months.", "url": "https://www.reddit.com/r/SuicideWatch/comments/kpyaa3/ive_lost_my_financial_worth_multiple_times/", "title": "Ive lost my financial worth multiple times", "social_network": "reddit", "user": "lost_civilizations", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 13, "down_vote": 0, "creation": 1609724727, "permalink": "/r/SuicideWatch/comments/kpyaa3/ive_lost_my_financial_worth_multiple_times/", "nsfw": false, "first_save": 1635428045.471524, "replies_charged": false}