{"id": "t5_2qpzs_t3_ncudq4", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "It seems that a high dose of a potent benzodiazepine (such as midazolam) and an opioid (fentanyl or heroin) are used for death by lethal injection in America. \n\nI’ve been thinking this may be the best way to go. I previously had an addiction to Xanax and worked extremely hard to get clean and remain clean. I even have weekly urine drug screens. Unfortunately all of the damage from the addiction seems to have already been done and my ‘friends’ have abandoned me and regardless of the results from the drug tests my family don’t even believe that I’m clean. \n\nEvery time the smallest thing happens such as forgetting part of a conversation that took place weeks ago my family automatically assumes that I’ve started taking Xanax again and start accusing me. The main reason I tried so hard to get clean was because of the emotional pain it was causing my family. Benzodiazepines are an extremely difficult addiction to cease. They are an anxiolytic meaning they block feelings of anxiety and are mildly sedating. Ceasing them through a tapering regime over months causes anxiety to come back even stronger than it was prior to taking them in the first place. \n\nAfter all the hard work I put in to come off of them, nothing seems to have gotten better. It has been over a year now and has been a constant battle to resist the urge to take them again. That is why it hurts soooo much when my family assume I’m still taking Xanax! When I’ve done all this for them in the first place and worked so hard, for them to not even believe me I can’t help but wonder, what is the point? If I was continuing to use they’d look at me the same anyway!\n\nI’ve just returned to having anxiety and depression worse than I did prior to the addiction because now I’ve lost friends and my family can’t look at me the same way. I just keep wondering ‘what is the point?’ \n\nI feel like if I commit suicide via a cocktail of sedatives and opioids everyone will probably assume it was an accidental overdose. It’ll probably still put them through emotional pain but at least not as much as if they knew I intentionally committed suicide.", "url": "https://www.reddit.com/r/SuicideWatch/comments/ncudq4/suicide_by_self_administered_lethal_injection/", "title": "Suicide by self administered lethal injection", "social_network": "reddit", "user": "Aggravating-Bat-7931", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 8, "down_vote": 0, "creation": 1621068653, "permalink": "/r/SuicideWatch/comments/ncudq4/suicide_by_self_administered_lethal_injection/", "nsfw": false, "first_save": 1635427391.5804799, "replies_charged": false}