{"id": "t5_2qpzs_t3_d6tua6", "request": ["da59145b-e03c-41fa-81a8-791cf9f7ecbf"], "text": "Little backstory, I'm 17. First time I had suicidal behavior was when I was 13, few years later found out I have depression, anxiety etc. Again few years later, I got into drugs, though had to quit them for my mental health. I got my diagnosis for many things, still getting more and more meds too. They worked for some time, now they are losing their magic, but I never wanted help for depression anyways. My mind was strong enough, key word. WAS. Anyways, I haven't had school for 6 months because I went to get help, doctor's gave me break from school for severe social anxiety, depression and panic attacks. Anyways, I'm afraid that I get back to drugs again, that aside. I cut, punch the trees, suffocate myself, burn myself with a lighter, I use to beat the shit out of myself, I'm falling in the hole but still standing up so I can be there for others. Which is the reason I'm actually writing this right now, I have some personality traits people consider \"good\" but for me, they are bad, they are burden. I get people around me, they trust me a lot, they open up to me, come to get my support. I rarely feel shit nowadays, but when I do, it's anger or love. About love, I hate that feeling, it makes me so sick, it's painful as fuck. Others suffering is my suffering, I love people, I love to help and be there for others, but yeah, they suffer, I suffer. Their pain is my pain. So, why am I telling this? This one girl, let's just say, she's depressed, very suicidal and her meds don't work. She keeps harming herself, but today, for some reason. She texted me something not so usual, after her depressing messages. Something that no one wants to get, you'll see.\n\n&#x200B;\n\n\"Sorry and thanks for everything if something happens to me, I'll get this all out with a knife. I love you\"\n\nFew more messages and pictures from her, I can't basically help, I'm not there, she doesn't answer some of my questions and shit. She was in a sauna, with a knife, cut her wrist (over the important veins), and yeah, I probably forgot something but idk what to do, what to tell her because she doesn't listen and so on.\n\nEDIT: She sent me, \"I just want to be dead, I don't want more disappointments, I don't want to feel anymore, I want to die\"", "url": "https://www.reddit.com/r/SuicideWatch/comments/d6tua6/i_dont_know_how_to_feel_what_to_do_or_how_to_deal/", "title": "I don't know how to feel, what to do or how to deal with this.", "social_network": "reddit", "user": "IwasChosenn", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 1, "down_vote": 0, "creation": 1568980696, "permalink": "/r/SuicideWatch/comments/d6tua6/i_dont_know_how_to_feel_what_to_do_or_how_to_deal/", "nsfw": false, "first_save": 1635425254.4548438, "replies_charged": false}