{"id": "t5_2qpzs_t3_qel8dk", "request": ["bd24e5dc-1a86-4808-94df-346d0c1d2c42", "5f467b61-8d4f-49ce-8264-8a9864cde71f"], "text": "For the past two months I've been dating an awesome 21 year old girl, but I'm leaving the city and I already told her we basically wouldn't be in a relationship once I leave (because of the distance).\n\nAs I began to know her better, she confessed several mental and physical health issues, and she feels like trash,  even though she has family and friends who want her to be fine. \n\nShe is tired of going to doctors to get diagnosed and tested, she says she is giving up and won't be doing that anymore, nor will she accept going to a psychiatrist to get meds prescribed for her mental health.\n\nI try to convince her and cheer her up because I don't want her to kill herself, but nothing seems to get her. \n\nMy questions are:\n\n* What can I do to help her besides trying to cheer her up?\n\n* Do meds and psychiatrists actually help? \n\n* Ideas on how to convince her to go to one? She says for now she isn't ready\n\nI'm extremely worried about this, because I barely know her and I think once I start leaving her life she may fall apart and commit suicide. \n\n\n-More background on her life:\n\n>Her dad abandoned her and her mother early in life. She clearly has lack of affection issues.\n\n>Her mom has her own dose of emotional drama, so she doesn't want to be a weight on her life\n\n>She says at some point during her childhood her cousins abused of her. Didn't get into detail, not sure how much is true, but she kind of supressed that drama and still has a good relationship with them.\n\n>Physical problems are mainly gynecological. She can't have kids at least for know. Her legs get numb out of nowhere sometimes, and she can barely run slowly. Feels like her body doesn't work at all\n\n--------\nI must confess I'm kind of angry with her too, even though I would never let her know. Feels like she will blame me once I leave and therefore I feel like a piece of trash like her father who left her. I'm just a guy who she met on tinder and from the beginning just wanted to go out and have fun while I was here visiting, as I made it clear from the start.", "url": "https://www.reddit.com/r/SuicideWatch/comments/qel8dk/help_the_girl_im_dating_is_having_suicidal/", "title": "Help! The girl I'm dating is having suicidal thoughts", "social_network": "reddit", "user": "Martind279", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1635051141, "permalink": "/r/SuicideWatch/comments/qel8dk/help_the_girl_im_dating_is_having_suicidal/", "nsfw": false, "first_save": 1635427297.9575253, "replies_charged": false}