{"id": "t5_2qpzs_t3_p5gqfj", "request": ["c8bd2d08-af10-4079-a5ce-a24bb7f99b0a"], "text": "Hi guys, I currently have a rather unique problem in that... Well let me first begin with my background.\n\nTo begin, I am a 24 year old male, grew up very poor, without a father (so certain life skills are naturally eluded), an alcoholic mother, an abusive older brother who was an addict, a sister who is currently an addict, etc. From a young age I always knew I wanted to pursue a college education/degree and to live a normal life instead of worrying about if I'm going to be able to eat, if I was going to be out on the street, etc. Being poor made me so miserable and sad and I often times felt like I was born to suffer when I had to constantly go through this stress. I struggled to do well in school from the violence in my home and losing sleep and having constant anxiety for my safety. My brother ended up going to prison so I was finally free from the abuse (for reference he is 8 years older and this was happening when i was 11-16). I had to drop out of high school freshman year because I couldn't function under all the stress/trauma, etc. \n\nFast forwarding a little... I met a girl that I really liked and we had a good relationship for awhile, I liked her so much (we had been together for about nearly 3 years now) that I decided that I wanted to build a life for us. I saw an opportunity in that the Air Force would help me with my childhood goal (of getting an education reasonably), I also knew I lacked self discipline/structure from having a dysfunctional home and that this would help me a lot outside of the financial benefits, so I pursued it! Things were going well for awhile, I worked as an avionics specialist for bomber aircraft in a combat coded unit and got to be a part of a real world operation during the \"World War 3\" Iran scare which was really cool! Anyhow, my wife started being very abusive/toxic after we got married (she started this as soon as we got married which was before I entered basic training). She started talking to other guys while I was at work, throwing tantrums  and smashing my things, not letting me associate with my family/talk to them, she stole my money (emptied my bank account) and my truck when I was at work and did all kinds of things to mentally destroy me. The abuse was so much that my mental health dipped and I had to enter inpatient because I wanted to commit suicide and I was unable to perform my duties at work, etc. I was demonized at work and hated for being \"not a great airman\" because I had to seek regular mental health appointments and some days I honestly couldn't meet the high expectations that were needed of me. Eventually I ended up being released from the Air Force due to my mental health being so bad that I couldn't be trusted to do my job. I feel like such a failure even to this day and my wife dipped out as soon as she saw that my ship was sinking (for better or for worse wasn't something she cared for in the vows). Because of my service, my body as a 24 year old is a little messed up \\[aircraft maintenance is brutal and my knees are pretty messed up for a 24 year old\\], along with my mental health recovery, etc. \n\n&#x200B;\n\nThe pros are that I have my education payed for like I wanted to, I have no debt, am financially quite literate, etc. The cons well... Mental trauma/physical damage to my body and the feeling of failure and not being able to look at myself in the mirror everyday without wanting to die. I wanted to retire, become an officer, do great things, and I got with someone who tore me down so much and left me like nothing that I trusted everything to. I can always make money, make a life, etc. But my service was much more to me than just a dollar sign. I felt purpose, a sense of belonging, a sense of pride, and all of that just kind of went. \n\n&#x200B;\n\nANYWAYS ... Aside from that my situation is that I am scared. I am a computer science major in community college (had to start somewhere because high school drop out). I currently have a 4.0 going into my 3rd semester... However, I am so stressed out feeling that my GPA is everything and if I don't get into an amazing school like UT Austin that I'm doomed for a life of mediocrity. Admittedly my older brother always competed with me and tried to make me feel like shit at every opportunity so it is indoctrinated into my brain that if I am not THE BEST or incredible at what I set my mind to then I am literally a failure. I cannot change this at this point and this is a huge cause of my modern dilemma. This causes me so much anxiety to meet this standards/expectations I put on myself. I have always been fairly technology savvy; however, I have never done programming. I am nervous that college will not be enough to make me even decent at coding (ESPECIALLY if I don't get into a good school). I have tried to dabble a little to try to watch beginner YouTube videos on it to understand it but it's like the \"basics\" are these people speaking foreign languages and it makes me feel like I am going to be so screwed. I'm just trying to stay positive and hope that it'll click eventually and I've yet to take any of my comp-sci classes to know if maybe those will shine a huge light on all of this.... \n\n&#x200B;\n\nLastly, I have a healthy/unhealthy relationship with investing right now. I focus so much on investing and living below my means that if I continued this i'd be a millionaire at 39. To me this makes so much sense, but then I can't help but to wonder... Why am I doing this? I understand this is the most efficient way to use my money... But aside from that... why?.. A part of me really would like the really cool car (honda civic type R), new tattoos, friends, a relationship... Just a normal life... But it's so glamorized and I know I would love obviously being a millionaire later but it's all so stressful. I had to grow up so fast that I have ALWAYS had to prioritize survival/acquiring more income in fear of being homeless that it still affects me to this day. I feel like part of my unhealthy investing habit is the feeling of security \"easing\" my mind; however, it's at the cost of living a normal life. \n\n&#x200B;\n\nI know reddit probably can't \"help\" me but I thought I'd ask if you guys could provide any useful advice. I just lost my therapist because he had a terminal illness and I am in search for a new one (I am currently on meds for my mental health) and I just want to cry  because I have no family support to get me through these times, it's always just been me having to figure out life.  \n\n&#x200B;\n\nTLDR: Had a rough childhood, joined the military and \"built\" a foundation for myself to begin life on the right track, toxic wife ruined my mental health and eventually I was unable to continue service, currently a comp-sci student in college \\[3rd semester\\] (overly stressed about GPA/having to get into the best school/have no idea how to program yet), because I grew up poor I have become so obsessed with personal finance/investing that I am not \"enjoying\" my young life per say and living exclusively for the future almost in which I would be a 39-40 year old millionaire. I had a therapist who recently died and am looking for a new one and I just feel so unhappy for being \"successful\" at my age per say.", "url": "https://www.reddit.com/r/SuicideWatch/comments/p5gqfj/life_has_been_so_hard_lately_to_endure/", "title": "Life has been so hard lately to endure", "social_network": "reddit", "user": "Sunbro888", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1629122730, "permalink": "/r/SuicideWatch/comments/p5gqfj/life_has_been_so_hard_lately_to_endure/", "nsfw": false, "first_save": 1635427103.5252788, "replies_charged": false}