{"id": "t5_2qpzs_t3_q23roe", "request": ["d75c9fa6-ec88-4682-9188-597fe766a0dd"], "text": "(I just want to say that these are my thoughts and of course if this sentence helped someone I did not come out against him)\n\nI have heard this sentence so many times as a reason why it is not the solution and I feel that this sentence is not necessarily true.\n\nIn my case if I disappear no one will care, my family may not have physically abused me but since I can remember they have broken me mentally to the point that today I live with an eating disorder, anxiety disorder, depression, suicidal thoughts, insomnia and OCD and I am only 20 soon .\n\nNo matter how much I think about it if I die they will probably say how much I fail and move on.\n\nI have no friends and never have, since I was little I was bullied at school so I do not trust anyone and also because of my social anxiety that prevents me, so it is not that there is anyone who will care.\n\nI find myself fantasizing about the moment when I will no longer exist because no matter how I look at it it is only going to get worse, it is getting worse day by day and I am already tired of fighting with myself and so many psychological problems.\n\nPsychological treatment is not currently possible financially (I am a college student).\n\nI really think that if I was not afraid of the pain I would not be here to write this messy post.\n\nI tried before when I was 13 but did not succeed, I tried again at 15 and even then I did not succeed and now I have a little trauma from the pain that accompanies it so I do not think I will try but the thoughts about it are still there.\n\nThanks to whoever read this awful post hoping your day is better than mine.", "url": "https://www.reddit.com/r/SuicideWatch/comments/q23roe/suicide_doesnt_end_the_pain_it_just_passes_it_on/", "title": "\" suicide doesn't end the pain, it just passes it on to someone else\" my thought", "social_network": "reddit", "user": "Unlikely_Self_2561", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 3, "down_vote": 0, "creation": 1633462487, "permalink": "/r/SuicideWatch/comments/q23roe/suicide_doesnt_end_the_pain_it_just_passes_it_on/", "nsfw": false, "first_save": 1635426546.0588045, "replies_charged": false}