{"id": "t5_2qpzs_t3_h09qod", "request": ["86cc7700-ca86-40f7-89bb-4e4c46de1b41"], "text": "im a 17 year old queer autistic kid whos deluded himself into thinking hes a man. im receiving support through the NDIS to help me with school and basic tasks i cant do properly because im autistic. i hate getting help. i hate NEEDING help. i feel infantalised and emasculated by the way teachers and mentor figures have to treat me so i dont fucking cry and have a breakdown because i dont wanna do my homework. or my schoolwork. or work in general. or improve myself in any fucking way shape or form.\n\nim a creative person. i like to write and draw. im a good singer. i had a main role in last year’s school production. but im burned out. i only ever wrote shitty explicit fanfic, i cant be bothered drawing unless im tracing something in ms paint, i cant write song lyrics, and this years production has been cancelled for obvious reasons.\n\nive been struggling with school for years. i was in year 11 VCE last year, but i didnt get enough assessments finished for a passing grade. ive been moved into year 11 VCAL. to non-australian people, this means that not only have i been held back a grade, but i’ve been moved into a program designed for people who want to join the workforce as soon as possible. carpenters, mechanics, you get the idea.\n\neveryone in VCAL acts like a fucking crackhead all the time. my school is already full of bogans but jesus fucking christ it’s a warzone in there. no one ever shuts up, they all just run around the room and talk to their friends, ignoring the designated seating arrangements (even before social distancing was a factor. yes, VCAL locks us into assigned seating in high school. again, i feel fucking infantalised.)\n\ni hate VCAL. i hate being associated with these people. i hate that anyone i couldve called a friend last year has moved on to year 12 VCE like normal, competent people who i can never talk to again. i hate that i cant talk to people at school because i have been bullied for as long as ive been in the education system and now i always feel like i’m imposing myself on people if i so much as look at them.\n\ni hate that i’m no better than anyone else in VCAL because i dont do the work either. at least everyone else can fuck around with their friends all day. i’m just the fat douchebag tranny who frequently bursts into tears and never even takes my books out of my bag. i think most of the teachers have given up on making me engage in classes. at this point they’re just keeping up appearances when they acknowledge my presence.\n\nim only in VCAL because the school counsellors all told me i should and i never say no to their ideas because theres no fucking point. im only in VCAL because the workload is meant to be lighter and more bearable and i can tie my projects into my special interests. if only i could talk about my interests without fucking cringing until i implode because what self respecting teenager fucking hyperfocuses on splatoon? who fucking cares?\n\nim probably only trans because my dad died when i was 5 and now i have daddy issues. my two older sisters are both living shitty lives. my eldest sister is 22 and still lives at home playing video games in her room all day. she has no friends. the second oldest is 19 and lives with her boyfriend in a shitty relationship shes not happy with, but they both smoke pot and vape and whatever so they dont have to care. i hate knowing we’ve changed so much. we’re not kids anymore and i wish we were just so i didnt have to worry about getting spat out of mandatory education as a directionless burnout who would rather die than disappoint or inconvenience anyone ever again. i dont want to end up like either of my older sisters\n\nbut i have a little sister as well. shes 11 years younger than me. i was almost just like her when i was her age. an annoying tech-obsessed brat with violent outbursts. i cant stand being around her. no one in the house knows how to deal with her and i know from experience its going to fuck her up forever. the thought of ruining her life fucking hurts more than anything. but just like everything else, i dont know how to stop it and i cant be bothered to change that.\n\ntl;dr at school, im an inconsolable douchebag who assumes the worst in everyone and makes a point to never engage in school even though i constantly get help for that. at home i’m a lazy asshole who distracts myself with video games, discord and youtube all day and rages at my little sister for being just like me as a kid. im all too aware how shitty my habits are, but i’m too lazy to improve, too lazy to learn, too lazy to live.\n\nthe only upside is that im too lazy to kill myself for now. i cant be bothered buying anything to mix with the eucalyptus oil so i dont puke it right away, and im pretty sure i would just fail and make everyone miserable and waste space in a hospital. but im going to kill myself at some point. every day that i dont is just delaying the inevitable.", "url": "https://www.reddit.com/r/SuicideWatch/comments/h09qod/i_have_a_potentially_lethal_case_of_cant_be_assed/", "title": "i have a potentially lethal case of “can’t be assed”", "social_network": "reddit", "user": "grimdarkpixels", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 7, "down_vote": 0, "creation": 1591791501, "permalink": "/r/SuicideWatch/comments/h09qod/i_have_a_potentially_lethal_case_of_cant_be_assed/", "nsfw": false, "first_save": 1635427449.3293638, "replies_charged": false}