{"id": "t5_2qpzs_t3_o71us6", "request": ["3b45ce6e-094e-407b-835b-bd9785eb59e7"], "text": "So it turned into a shouting match as expected. She caught me the day before but handled it calmly, then caught me again and blew up. She said she couldn't believe how bad I was and that the last few days were the worst days of her life because I got a 1130 on an SAT practice test, which is average and not enough for me to get into college and survive. She claimed that she's pushing me because she loves me. This is the same person who screamed \"I hate you\" and called me disgusting for accidentally making us late to school one day.\n\nMy mom asked me if I wanted to end up like my best friend who lives in a small house and shares a room with her brothers. I decided to test the waters by saying I wanted to end up 6 feet under. She yelled at me not to threaten her, and said that if I really did she would send me to a mental hospital for treatment. Exactly what I feared and suspected. She then asked \"IS THAT WHAT YOU WANT?\" so I played it off like I was just testing her reaction. \n\nAt least I have a clear answer now: there is no hope of me getting help or medication. She went on to assume maybe I don't care or maybe I do, but never asked why I wasn't studying efficiently.\n\nI was crying from suppressing everything so my mom asked me why. I obviously couldn't tell the truth so I said I don't know. She got annoyed and told me \"it's ok to have a nervous breakdown. But you can't get worse than this, right? SO GET UP AND GO BACK TO WORK.\" Weirdly, she has offered to help with my suspected social anxiety but seems to have no respect for depressed/suicidal people. I remember she once called suicide \"silly.\"\n\nThis happened yesterday and today she acted like it didn't happen. She did create a strict study plan though, and was like \"I'm working with you as a team! You can get there! :)\"\n\nThis vent got much longer than I expected, but thanks for reading if you did.", "url": "https://www.reddit.com/r/SuicideWatch/comments/o71us6/my_mom_caught_me_lying_about_studying/", "title": "My mom caught me lying about studying", "social_network": "reddit", "user": "napalmcider", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 22, "down_vote": 0, "creation": 1624544446, "permalink": "/r/SuicideWatch/comments/o71us6/my_mom_caught_me_lying_about_studying/", "nsfw": false, "first_save": 1635422995.5060065, "replies_charged": false}