{"id": "t5_2qpzs_t3_noimpp", "request": ["22c18d9e-fa72-4e08-af3e-5780abc274f3"], "text": "Hi.\n\nI've been abused online, at school, and at home. I'm 16 and coming closer to my date. I made a pact with myself on my 18th birthday that I will commit suicide. I made back when I was 12. After I first went through puberty, it was utter hell. I was making >!20 cuts!< every week, I ruined the muscle on that arm, it hurts to touch. I was taken advantage of by people online, I was emotionally abused both at home and online- I had no friends. But i never saw myself dying then.\n\n&#x200B;\n\nNow, 2 years away, I see how hopeless it is, I tried to improve in school, I tried to see what I could do with my life.. But I think, that truly is the end of my rope. \n\n&#x200B;\n\nAll I ever wanted to be is someone who could make my mom proud, to make people happy, to show everyone how much they are worth, because in truth, I could never see any value in myself. So I try my best to make people happy, I try not to let my toxic behavior slip through and ruin what I try and build. I try and see meaning and hope in my art, but the universe hates me.\n\n&#x200B;\n\nI get a partner? My mom shits on me for no reason and takes the only reason I'm living away from me.\n\nOne good thing can happen, and everything goes to shit. I live in this constant state of trying my best to be happy, I find a reason to be happy, and then I or the universe ruin it. It's my fault for exiting anyway- it's my fault for even trying. Now I'm being threatened to get kicked out because I'm not doing anything. I can't, I can't even get myself to draw anymore. But, I guess- I deserve it.\n\n&#x200B;\n\nI deserve it for being a burden, a waste of space, unhelpful, useless, a waste of potential, a waste of money, I waste of life. I deserve it. I'm not like my mom, so I should leave, I'm not productive so I should die. I'm not who she wants me to be. I never have been. So I'm a burden, I'm annoying, ungrateful, selfish, disrespectful, manipulative, uncaring. I'm horrible, I'm utterly horrible.\n\n&#x200B;\n\nMy problems don't matter, they never have and they never will. Why am I writing when no body will see, when nobody will care? Because I want someone to know, that I'm still trying, that I'm still wanting to find a reason. My need for survival is huge, but I'm getting closer.. Closer to doing it. I'' keep trying when I can't anymore.", "url": "https://www.reddit.com/r/SuicideWatch/comments/noimpp/just_writing_my_life_story_idk_anymore_i_want_to/", "title": "Just writing my life story, idk anymore, i want to vent", "social_network": "reddit", "user": "Upstairs_Umpire4624", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 65, "down_vote": 0, "creation": 1622403182, "permalink": "/r/SuicideWatch/comments/noimpp/just_writing_my_life_story_idk_anymore_i_want_to/", "nsfw": true, "first_save": 1635427743.4157426, "replies_charged": false}