{"id": "t5_2qpzs_t3_pjydpa", "request": ["8fcf1aa8-72c6-4f2b-91af-c4af1f54b7cd"], "text": "As selfish as it may sound, this question's been running on my mind on loop for months now. Why me? Why my family?\n\nI grew up (and still live) in a third-world country. My mother works as a factory worker abroad while my dad decided to cheat with several women and pack his bags leaving my mom to fend for the whole family alone. We grew up without her as she broke her back working just to make sure we had a roof over our heads, warm food to eat, and a good education. I guess she was too fixated making sure our short-term needs were met (as a good parent does) that she forgot about the long-term (she didn't really have a choice). Take note of that because that shit will bite us in the ass later.\n\n*Maybe it was my parents separating. Maybe it was the feeling that I never belonged anywhere. Maybe it's just shit genetics.*\n\nI started having depressive symptoms when I was about 13 or 14 years old. I remember the first time it happened so vividly. It was one night, nothing really happened that day but I was lying in bed crying and writhing for no particular reason. It was the first time I felt that clawing feeling in my chest. My ribcage was hollow and empty. I just felt so alone, worthless, and angry. Eventually I started cutting myself. Then I tried to kill myself twice my senior year of high school. I survived so I went to college as expected. Still depressed as hell and several episodes of self-harming still, but I found great friends, had the energy to pursue my passions, and experienced what I thought the \"real world\" was like and found it exciting.\n\nMy eldest sibling died a few years back while I was in uni. They were one of my role models and parental figures growing up (as they were about 10 years or so older than me). They were the kind of older sibling who protected the family, kept everything in order, made us feel safe and that everything will be okay. It was devastating. I hope you never have to experience holding your loved one and feeling their dead weight fall on you or how their skin have gotten cold so fast or see their lips turn blue. It was like watching the life literally leave their body slowly-- then all at once.\n\nI still get flashbacks sometimes when I'm in elevators-- the doors opening, me walking this long hallway to the ICU, entering my sibling's room and finding my father wailing over their body. Somedays I hallucinate smelling that stale antiseptic scent all hospitals just seem to have but I've gotten used to it by now and it doesn't bother me much anymore.\n\nEventually I got diagnosed with Bipolar Disorder. Not really surprised there. I dream about overdosing on my medication a lot. Some days I wish the mania lasted longer because I got more shit done. The crash after always felt like ass though. -12/10. Would not recommend.\n\nRemember how I mentioned that my mother (and technically my father too) forgot about long-term needs? Yeah, we're going back to that now. We found out that the house I've been living in my whole life is not really ours and that the mortgage has not paid in decades. Now, the lending company is raising hell and is making us pay the whole damn thing in full and if not, then we're going to be homeless. My remaining sibling and I have been losing our minds for the past 2 years trying to figure out what to do. Our mom is nearing retirement and we're assuming that she'll come home in less than 5 years. While that is the dream (hell, my mom deserves the best fucking retirement we could ever provide her), my sister and I are still pretty early in our careers and not earning that much yet. Loan applications get rejected and there is literally no money to invest for a business venture since it's just perfectly enough to support our little family at the moment.\n\nNow I'm trapped.\n\n*I'm trapped. I'm trapped. I'm trapped. I'm trapped. I'm trapped. I'm trapped.*\n\nI'm currently employed in a good company but in a job I've grown to hate. My workload plus the added stress of the pandemic and the more frequent demand notices we receive for the house payment is crashing on me like tidal waves. I can barely function in anything at all. Not in my work, not in my creative projects that have been my saving grace for years. Nothing. Almost every waking moment is spent on me just looking up cheaper houses in our area (there are none), part-time jobs for supplemental income, other jobs for career and pay growth, and just about literally anything ELSE but what I'm supposed to be doing at a time. Before I would lag behind my workload and just pick-up after a few days and clear my tasks. They've always been manageable before. The past two weeks, it's gotten so bad that it would be a miracle for me to be even able to muster at least 2 hours of continuous focus to do literally anything. Today I spent my working hours just having random crying fits and throwing up from extreme anxiety that my poor performance will lead me to lose my job.\n\n*I don't deserve to be here. I'm a fraud. Someone else could be doing my job so much better. I'm a fake and I got here only because I was lucky. I don't deserve to be here.*\n\n*I hate that they died instead of me. I wish it was me.*\n\n**So why me? Why my family? When will the continuous suffering end? Trauma has plagued my family for decades and we can't catch a break. I swear to god my mother's a good person, my siblings are good people, and I'm trying so. fucking. hard. to do good and yet... why?** I see people who have perfect mental health and never had to experience any sort of financial hardship in their life and it fills me with rage. I know it's not their fault they were born rich or mentally healthy but why can't I be like that too? Why can't I just be mentally ill OR poor? Obviously I'd be able to deal with either of the issue if I wasn't dealing with the other too at the same time. Nowadays I just feel hopeless and angry towards everything. I've been snapping at my family and friends. I feel guilty about it but there's so much rage in me that I feel that I'd just implode and have a heart attack. I spend hours just thinking in great detail of the most violent ways I could kill myself. Maybe if I could just let myself hurt, I could spare my family more suffering. Does universal karma work that way? Probably not. Maybe I just want to punish myself for not rising up to the level I should've been by now. My doctor should know all of this, I know but I do not have the time to be involuntarily committed right now. Why?\n\n*Did you forget already? I am trapped.*\n\nI can't die. I'm not ALLOWED to die. My whole family will suffer even more because of me if I die. I'm trapped. I wan't to die. God, I want to die so bad. I wish I didn't care enough. Maybe if my eldest sibling was still alive, I'd have tried killing myself again. Have you heard a mother's wailing after finding out her child died? It haunts you and that's not the kind of sound you'd ever want to hear escape someone's mouth. I'm trapped. I want to kill myself but I can't put my mother through that again. I'm trapped and there is nothing I can do about it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/pjydpa/why_me/", "title": "Why Me?", "social_network": "reddit", "user": "whyamistill-here", "subreddit": "SuicideWatch", "subreddit_path": "r/SuicideWatch/", "up_vote": 2, "down_vote": 0, "creation": 1631056271, "permalink": "/r/SuicideWatch/comments/pjydpa/why_me/", "nsfw": false, "first_save": 1635428095.4729357, "replies_charged": false}