{"id": "t5_2tand_t3_nspb9d_t1_h0t8wiy", "creation": 1622998844, "origin": "t5_2tand_t3_nspb9d", "height": 1, "replied_to": "t5_2tand_t3_nspb9d", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "IAMSTILLHERE2020", "text": "The problem I had for over a decade (probably more) was Sleep Apnea. I didn't know about it. I used to go to sleep at 9 PM and wake up by 7 AM and 2 hours later I felt like a train hit me. I used to fall asleep standing up, in meetings, in my desk and even eating..everywhere. it wasn't until my body gave in while walking in the hallway at work and someone took me to the nurses station and the nurse told me to rest and put me in a bed...after all said and done I slept about 2 hours. Once I woke up he said\"I think you need to sleep and rest. Ask your Dr for a sleep study\". Sure enough. I was waking up about 65 times a night. I never went to deep sleep. I never rested. Once I've heard sleep apnea I started reading about it and learned as much as I could about it. During those years of hard struggle I went from 162 lbs to over 330 lbs. I needed energy and coffee with sugary drinks were my energy suppliers. It was bad. However, once I figured Sleep Apnea I have lost 50 lbs. Started exercising. Feeling more rested. I've tried machines (didn't work). What works for me is sleeping on the left side. Yes it has its drawbacks but I am trying my best to make it work. I used to feel and look swollen (inflammation) now I am just overweight but not what it was before. \n\nWhenever I see someone falling asleep I usually tell them to figure out their sleep. It all starts there. I think now they are figuring that out. I don't judge people at all anymore on anything because I know how difficult it is to figure yourself out. When I see drug addiction,  morbidity, bad health habits...etc. I can see how it started from nothing and maybe we didn't pay attention because of being overwhelmed with work or stress or lack of sleep..self induced or in our cases due to the way we were born etc. We can fix ourselves somewhat but it is a very difficult journey. Nothing is as simple as flipping a switch. Well, maybe at the end of the day it is but it can take weeks, months or years to get to flip that mindset. For me it took about 15 years to be able to flip that switch. It has been a struggle but now I am a little bit more in charge of myself. \n\nBest of luck in your journey and hope you are able to find yourself or more like fix yourself to a more normal day to day functions.", "permalink": "/r/DecidingToBeBetter/comments/nspb9d/sleep_schedule_crisisagain/h0t8wiy/"}