{"id": "t5_2tand_t3_flxu10_t1_fl3klbx", "creation": 1584788355, "origin": "t5_2tand_t3_flxu10", "height": 1, "replied_to": "t5_2tand_t3_flxu10", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rosesper", "text": "My man thanks for being open with us I have some great advice. \n\n1 - don’t get too consumed on the fact that porn addicts your for real. I watch porn and don’t feel like this anymore (21y) but I used to feel like this before (14-18y). You’ll probably get more addicted thinking it’s addictive than it really is you feel me ? \n\n2 - please search Rsd on YouTube (real social dynamics) these guys will teach everything you need to know how to deal with yourself and girls and be a cool dude so you can get plenty of more girls again and never feel bad if you girl leave you. \n\n\n\n3- a little trick of mine, I usually cum pretty fast too man on the first time on sex. What I usually do is tell the girl I’m fucking “ hey I just need to be honest on the first round I cum pretty fast, so I just need to cum before we really start fucking” if she’s a girl you will want to hang around and a cool girl she’s probably gonna be really ok with it. Just don’t be insecure about it just say it open and honest. \n\nSo I just cum and continue with the sex even if my dick isn’t as hard just keep kissing and licking the girl even if I’m not feeling like it in the 2-3 minutes after cumming. I just keep going, soon I get my ding dong hard again and can fuck without any anxiety.\n\n\n4- Just a little advice on girls. They are amazing and can be a huge font of joy in your life. But don’t be depend on any girl. Really it’s like business the more dependent on a girl/client you are the more fragile and weak you are going to be. \n    When you are with a girl listen to every feedback, but as a feedback not as something that defines you. Cumming fast doesn’t make you less of a man you feel me ? Being insecure about it does. You can find plenty of solutions on cumming fast and girls. But no technique will fully replace true confidence and no dependence on girls opinions and girls in itself .", "permalink": "/r/DecidingToBeBetter/comments/flxu10/how_pornography_changed_me_and_my_relationship/fl3klbx/"}