{"id": "t5_2tand_t3_g60gtb_t1_fo7oyl4", "creation": 1587582050, "origin": "t5_2tand_t3_g60gtb", "height": 1, "replied_to": "t5_2tand_t3_g60gtb", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "GlowReaper", "text": "I must, in some way, devalue my own career and say.. Anyone is able to do \"psychology\". Sometimes it's done right and some not. It's a service career and it depends on how well you use your resources and tools to diagnose or treat any patient.\n\nIn this case, what you're doing it's what I've done in 5 years, learn by applying methods to myself and evaluate from that, so I can do the same with others. It's just the first steps in order to become a great psychologist o psychotherapist which is the more accurate term in this scenario.\n\nI'm not gonna say it's what you should do and I'm fully aware of the economy aspect. But seeking Profesional advice besides your own self work is the best solution. There's always friends that will look after you, but not even them or your partner have to deal with your problems.. They don't know how to deal with their problems aswell, keep that in mind. Also you started this because you wanted to understand yourself, don't forget that you have limited knowledge and don't overestimate a professional.\n\nI'm glad to see people taking the initiative to take care of their mental health. Even us psychologist need another Profesional for our own matters, and it's hard sometimes do admit you need help (because you think you know everything, but you don't) it's not the same to see another person and see yourself, it takes years of self reflection and a good emotional stability to reach that goal, but it's possible even for non professionals, simply because you are not born a psychologist, and you may have the attributes to be one, you just need the formation and ground practice to apply in theory what you already have as a person.\n\nGood luck my friend and stay home.", "permalink": "/r/DecidingToBeBetter/comments/g60gtb/i_started_studying_psychology_in_my_free_time_to/fo7oyl4/"}