{"id": "t5_2tand_t3_g60gtb_t1_fo7z66v", "creation": 1587587066, "origin": "t5_2tand_t3_g60gtb", "height": 1, "replied_to": "t5_2tand_t3_g60gtb", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "babamum", "text": "May I recommend my faves, Feeling Good:The New Mood Therapy and The Feeling Good Workbook, both by Dr David Burns; Self-Esteem by McKay and Fanning; Learned Optimism by Seligman. I hear Self Compassion by Kirsten Neff is also good.\n\nWhat you're doing is called 'distancing'. It makes the upsetting thoughts and bad feelings further away. Counting them does the same thing, as does mindfulness. It makes you realise it's a thought, not necessarily true and stops you getting sucked into a spiral of believing it, getting upset, catastrophising it etc. Another good way to do this is ask yourself \"what is the evidence this is true\".\n\nThat technique is good for reducing painful emotions. Another way to reduce depression and build happiness is to build positive emotions. Two good books are Positivity by Barbara Frederickson and The How of Happiness by Sonja Lyubomirsky. There are also lots of free websites and apps around. Come back to me if you want more information.\n\nI succeeded in becoming happy after years of depression doing what yr doing - reading books and applying what they said. Now there's so much stuff online plus apps it's a lot easier.\n\nI also did a lot of therapy, for free whenever I could. Look around - it is possible to get. Or call helplines and talk to them about what yr learning or ask them to help brainstorm any issues. Other people can be good at helping you see the blind spots in yr thinking.\n\nThe one thing that I think is most important is to do the things that appeal to you, that you like doing. It will make it easier for you to keep doing it. Plus there is research showing it's more effective in creating happiness than doing things you don't like.\n\nYou're in an exciting journey. Good luck! Feel free to ask me questions.", "permalink": "/r/DecidingToBeBetter/comments/g60gtb/i_started_studying_psychology_in_my_free_time_to/fo7z66v/"}