{"id": "t5_2tand_t3_cmc1u2_t1_ew26m7z", "creation": 1565039437, "origin": "t5_2tand_t3_cmc1u2", "height": 1, "replied_to": "t5_2tand_t3_cmc1u2", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Your first step is to stop caring what people think. If they dont like you, so what? That is their loss. Plus its just life and we all die eventually, nothing that happens in our life actually matters in the end. Most people are too consumed with their own lives/problems. A lot of people are actually shit and if they judge you etc its usually because of their own insecurities, we all have them. Were all human. I guarantee whatever your feeling right now, plenty of other people are feeling as well - you are not alone.\n\nOk, now the next thing you need to do is accept yourself, you will never be anyone else so you might as well love the one character you get to play as. Accept how you feel and come to terms with it.\n\nNow, you need to start setting goals and finding things that interest you. Forget about passions for a minute and just try to find things that you enjoy doing, even if you get absolutely nothing out of it. I love watching sports, and my closest friends are people who also enjoys sports - its a big part of what bonds us together. Im also a huge gamer and whenever I meet someone else who likes gaming I guarantee you we can talk for hours about our favorite games. You see, the best relationships you will ever have are with people who you can relate to. If your not a relate able person, it will be very difficult to develop connections. Eventually, you begin to lose connection with yourself and you end up depressed.\n\nThink of every person you meet as a new opportunity to create a personality, take some risks! At worst you offend somebody, big deal. tell them to shove it. You say you are all of these negative things but none of those thoughts actually exist and only the people you have already interacted with may think those things about you. FUCK EM! Find new people and make a good first impression! If you wanna talk send me a message. I was in the deep dwells of depression and i was all alone. Remember, you dont owe anybody shit and please do not let other people decide how you should feel about yourself.", "permalink": "/r/DecidingToBeBetter/comments/cmc1u2/what_do_i_do_with_my_lifeself_when_i_got_no/ew26m7z/"}