{"id": "t5_2tand_t3_qgu9s6_t1_hi96lhq", "creation": 1635347024, "origin": "t5_2tand_t3_qgu9s6", "height": 1, "replied_to": "t5_2tand_t3_qgu9s6", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Korroboro", "text": "This is a guess.  \n\nMaybe at some point, you realized you needed more control over your own behavior. You made some little efforts, here and there, but the problem persisted. Then you got more serious. You really, really needed to have more control because you made plans and then you didn’t follow through.  \n\nWhat has really changed your behavior in your past? You might have remembered your parents and teachers. When you didn’t comply, you were punished. And a series of punishments (and also threats of punishment) really did change your behavior.  \n\nSo naturally, you resorted to that. You started being more demanding towards yourself. You started scolding and demeaning yourself. If this is true, you started this not as a strategy to hate yourself or feel disappointed about yourself. You started this as a strategy to make of yourself a better person.  \n\nBut it’s a strategy that doesn’t work that well because it backfires. All the pressure that you put on yourself generates fear. Then unplanned things start to happen. For example, you plan to study at five o’clock, but then you find yourself doing everything but studying when the time comes. This is you protecting you from yourself. You want to avoid the impositions. You want to avoid being scolded and calling yourself “useless” or “lazy.”  \n\nYou need to find a way to take the proper action (that is: studying or working on a project) while feeling safe. And you need to achieve consistency.  \n\nTry studying for fifteen minutes and then take a five or ten-minute break. Do this to make studying more tolerable.  \n\nBefore you study, you can relax and listen to three or four of your favorite songs, and maybe sing along. Do this to put yourself in a good mood. Then study without pressure. Just do your best calmly. Minimize the stress. If you compare where you are with where you want to be, you will probably get the feeling that what you are doing is useless and that you will end up failing. So change your focus on your progress. You are learning new things that you didn’t know before. You are polishing some new skills that make you better than last week.  \n\nAnd be on your side, instead of against you. Get to know yourself better without judging yourself and without comparing yourself to others. Explore different ways to ease yourself into action, instead of forcing yourself into action. Say to yourself: “This will only get better. These are the steps that will take me to my goal. I’m glad I have the power and freedom to take these steps. Everything is fine. I’m on my side. I’m with me. Let’s find out how far we can get today.”  \n\nI hope this helps.", "permalink": "/r/DecidingToBeBetter/comments/qgu9s6/how_do_i_stop_hating_and_cringing_at_myself_for/hi96lhq/"}