{"id": "t5_2tand_t3_q1ba0v_t1_hfe8gpn", "creation": 1633378356, "origin": "t5_2tand_t3_q1ba0v", "height": 1, "replied_to": "t5_2tand_t3_q1ba0v", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "EP4D", "text": "It's pretty dumb that schools teach us what to learn but now HOW to learn.  A good book that helped me is Limitless by Jim Kwik.  He actually teaches you HOW to learn and I'm sure it'll help you here.\n\nAlso, as a transformational coach, I recommend you take care of your thoughts because they dictate the results you see.  I say this with experience, my educational journey consisted of me in a vicious thought cycle that my math was terrible.  This resulted in me graduating with grade 10 math.  And man did I beat myself up for it.\n\nThe model of thinking is simple.  It's called the self-coaching model (feel free to look it up).  The basic premise is this, CIRCUMSTANCES trigger THOUGHTS that produce FEELINGS that generate ACTIONS that cause a RESULT.  The result goes back to the thoughts because it starts the vicious cycle.  Be more self-compassionate and self-loving.  Anything worth learning comes with its own challenges and requires persistent effort.\n\nI also happen to be a language learning expert.  I'm a Canadian-born Chinese who has spent time in Venezuela (7 years) and in China (8 years), both places I had no basic understanding of the language.  The most important thing to learning a language is its usage.  Knowing how to use a language provides our mind with context and forms a connection in our minds.  In my own experience, once I understood the usage, I was able to think in that language, and it no longer required me to first translate in my head what the word was in English; it became its own.  And I'd go out of my way to USE the words I just learned to solidify it.  So along with learning how to say something, I always ask them to describe to me how it is used.\n\nHope all this helps you.", "permalink": "/r/DecidingToBeBetter/comments/q1ba0v/how_do_i_get_rid_of_the_negativity_cycle_when/hfe8gpn/"}