{"id": "t5_2tand_t3_kat3fw_t1_gfcq0em", "creation": 1607655755, "origin": "t5_2tand_t3_kat3fw", "height": 1, "replied_to": "t5_2tand_t3_kat3fw", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mammalianmindmeld", "text": "No, everyone doesn't need to switch. If you keep up this cocky attitude, you're going to fall back into your trap the first time life throws you a curveball. Some people can't handle it and have to cut it out completely; other people can do it only on the weekends or every once in a great while. But some people - like myself - use it to manage illnesses like epilepsy. Plus, it feels really fucking good. I have an extremely, extremely mild form of it so cutting it back was rough the first few days, but for me, the benefits outweighed the negatives. I've managed and so far I feel as great as you do. No more brain fog, I'm more productive, and I'm more present than I have been in a long time. So far so good.\n\nStill, even though I see and feel the benefits of cutting back, I'm not about to point the finger and say, 'this is the only way.' It's not. Even though it's a habit that I feel got out of hand for a while, marijuana is a wonder drug that helps so many people around the world. To look down on that is ignorance. It eliminates seizures for some, gives cancer patients an appetite again, and can put you in a great mood after having a shitty day. Show some respect to the people that actually need to smoke or are having a hard time kicking the habit like you are (not were, are - you're still in this). You were smoking nonstop for a reason, and it sounds to me like you haven't addressed that problem yet. Be humble and address those issues and work on yourself instead of pretending like you've discovered the meaning of life just because this is the longest you've been sober in three years.", "permalink": "/r/DecidingToBeBetter/comments/kat3fw/finally_cut_off_marijuana_now_life_is_on_easy_mode/gfcq0em/"}