{"id": "t5_2tand_t3_p967xa_t1_h9wzncx", "creation": 1629644570, "origin": "t5_2tand_t3_p967xa", "height": 1, "replied_to": "t5_2tand_t3_p967xa", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "2Old4Shenanigans", "text": "Same technique here. Turning all notifications off was the beginning of the end to my social media obsession. Notifications went first and downloading other apps scroll through to fill that void was second. I would scroll through NPR articles. Local goings on and things to do in my area. Or things I want/need to learn more about; currently all the research possible about window replacements and companies. Probably super boring to most people, but it’s my next life goal and I’ll be totally prepared when the time comes.\nI have a FB account for the Marketplace and because my kid’s school (for whatever trash reason) post important info the their page and only send out a monthly email. It’s been years since I have posted anything. My habit now is to open the app. Immediately click on the Marketplace or immediately type in the search for the school. \nNot being on FB, Instagram, Twitter and so on was the most amazing thing I’ve ever done for my mental health. I felt a noticeable change for the better about myself and my life within days. \nI’ve actually tried to just scroll though FB once or twice since then. I can feel the weight of insecurity and self doubt after just a few minutes. Social media is actually scary to me now. I think about when my kids are old enough to open their own accounts (they currently are not allowed on it) and how it will affect the way they see themselves, their mental health, and the way they think I see them. It breaks my heart to even try to imagine how social media could change a child, teen or young forever when they log in at the wrong moment of their life.", "permalink": "/r/DecidingToBeBetter/comments/p967xa/theres_one_more_vice_to_get_rid_of_reddit/h9wzncx/"}