{"id": "t5_2tand_t3_pt8t30_t1_hdurng3", "creation": 1632324397, "origin": "t5_2tand_t3_pt8t30", "height": 1, "replied_to": "t5_2tand_t3_pt8t30", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "redubshank", "text": "Ex-personal trainer here.  First off, fucking amazing job on that weight loss.\n\nFor resistance training I am of the opinion that the best bet for beginners is full body work outs 3 times a week.   The reality is starting out you don't need an insane amount of work in order to achieve gains because your body really doesn't need that much stimulus to grow.  If you do to much you are more likely to get injured for no huge benefits.  After about 12 weeks then switch up your routine.  The reality is despite what 'influencers' want you to believe fitness is dead simple.  You can just find a well established routine, do it for 8-16 weeks and then switch it up.  It can get a bit more complicated for competing bodybuilders or powerlifters but those guys are putting in about 3x more effort for the sake of like 5% more gains(not counting steroids).  If you are into getting advice from Youtube my favorite fitness youtuber is Scooby since he gives no-nonsense advice and isn't selling anything.  He doesn't really make fitness you tuber videos anymore but that is mainly because after like 10+ years he decided he didn't have much else to cover.  \n\n\nCardio you can do everyday of the week if you wanted as long as it isn't high intensity.  If you are doing really high intensity then, imo, do the high intensity 2x a week and do lower intensity stuff in your other workouts.  Lower intensity would be like running at a pace where you can still have a conversation with someone else, albeit with having to pause between some sentences.  \n\n\nNutrition is the big thing.  You will want to start concentrating on getting more protein.  The general rule for max gains is 1g per 1lb of body weight(or about 2g for 1kg).  It's not an exact science but getting into that area is what you want.  It would also be a good time to focus on  whole foods in general  and making sure you are getting some veggies in your diet.  Calorie-wise, you are going to people tell you to eat more to 'bulk'.  People who are new to lifting don't need to worry about bulking, just eat around your maintenance calories and you will be fine.  When I first started lifting I was eating at a caloric deficit for over a year but still managed to go up to a 300lb bench press and had plenty of people comment on my increased muscular mass.", "permalink": "/r/DecidingToBeBetter/comments/pt8t30/im_changing_things_up/hdurng3/"}