{"id": "t5_2tand_t3_mfokox_t1_gsonmru", "creation": 1617024108, "origin": "t5_2tand_t3_mfokox", "height": 1, "replied_to": "t5_2tand_t3_mfokox", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Flappityassfwap", "text": "Awareness is the first step and for some, it's the biggest hurdle to doing better. \n\nYou sound like you have a good sense of self-awareness. You've identified a problem, you have specific examples of where negative behaviors manifest, and you have a desire to change these behaviors. \n\nYou've also identified some of what triggers you, specifically, other toxic or frustrating relationships/family situations. It's possible that your own pain and disappointment from other relationships is making it a challenge for you to regulate your emotions in such a way that you don't lash out at your friends.\n\nIf this is the case, my advice to you is to first address any healing that needs to take place from any harmful relationships you are in. This is much easier said than done. \n\nIf you have been on the receiving end of any abusive relationships (including financial, emotional  or psychological), I would try to identify the specifics and then go from there.\n\nFor instance, a close friend of mine is recovering from a toxic and on-going relationship with narcissistic parents. He would like to go to counseling but that's not an option for him. Because he is unable to have professional one-on-one intervention, he watches YouTube videos made by psychologists on how to heal from narcissistic abuse and seems to have found a type of emotional balance from educating himself. \n\n\nTo sum things up: \n\n1. You've already made a huge step in that you are aware of a problem and you have a desire to change.  \n\n2. The next step - Acknowledge and allow yourself the opportunity to heal from any hurts you have suffered or are suffering. \n\nAs you allow yourself a chance to heal, hopefully there will be positive spill-over into the relationships you have with your friends. It's at least a start \n\nBest wishes to you.", "permalink": "/r/DecidingToBeBetter/comments/mfokox/how_to_stay_positive_and_treat_my_friends_better/gsonmru/"}