{"id": "t5_2qh5i_t3_cp6nlv_t1_ewoysin", "creation": 1565629706, "origin": "t5_2qh5i_t3_cp6nlv", "height": 1, "replied_to": "t5_2qh5i_t3_cp6nlv", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Casehead", "text": "I had a teacher do this to me in the 8th grade. My parents felt I should go into “Honors” English starting freshman year (honors leads to AP), as I had advanced reading and writing and grammar skills, etc, and had scored super high on all the state testing we did. To do that, they required a recommendation from your 8th grade English teacher. She told me “No.” She said, “ I only do those for students that are worthy, and you aren’t one of them. You aren’t smart enough for that.” \n\nI was crushed, and I figured that was it then. I went home and told my parents, and they were *piiiiiiissssssssed*. My brother was a boy scout back then, and they had their meetings at one of the other local middle schools, so my mom dragged me along to a meeting and went to speak to the principal there who she knew through Boy Scouts. He was able to tell my mom that we could just show them my test scores and they would take me on that instead. This wasn’t anything anyone else seemed to know, so it was lucky we had an insider to help us.\n\nAnyway, if it wasn’t for my parents really caring and believing in my potential, I wouldn’t have been on the right track in school, I would have been bored and things just would have been very different. I also would have fully believed my teacher that I wasn’t smart, or capable. Not everybody has parents who are behind them or invested in them, or their parents aren’t around enough to be able to help. I can only imagine how many kids out there had a shitty teacher like this who convinced them that they weren’t capable of something, and had no one to tell them that it was bullshit. It’s very sad to think about.\n\n BTW, I went on to get a 5 on my AP test, which was the highest score you could get.", "permalink": "/r/happy/comments/cp6nlv/a_year_ago_i_was_told_by_this_math_teacher_to_not/ewoysin/"}