{"id": "t5_2tand_t3_gqpwuu_t1_fruks3l", "creation": 1590477451, "origin": "t5_2tand_t3_gqpwuu", "height": 1, "replied_to": "t5_2tand_t3_gqpwuu", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "It's time to start your process of recovery. As someone who has been where you are, there's a trifecta of mental health which I follow and when I do I feel much better than when I don't. It's not a cure but it helps a lot to make things less bad\n\n1) Gratitude. List out 10 things per day that you are grateful for. It can literally be \"oxygen for keeping me alive\" or \"grilled cheese sandwiches\" to \"the love of my daughter\" or something deeper. Start this exercise and gradually you will feel better. Don't take my word for it, here's an article from Harvard; https://www.health.harvard.edu/healthbeat/giving-thanks-can-make-you-happier\n\n2) Eat well. I'm not talking about the perfect diet and losing weight or anything. I'm saying eat three square meals of quality nutritious food each day. Eating well will make you feel better. Here's an article from UK mental health charity Mind about food; https://www.mind.org.uk/information-support/tips-for-everyday-living/food-and-mood/about-food-and-mood/\n\n3) Outdoors. Being around nature improves your mood. Especially being under trees. If you can muster the energy to exercise outdoors then even better. https://www.sciencealert.com/increasing-urban-tree-cover-gives-community-mental-health-a-boost-says-new-study\n\nAnd remember, you don't have to be insanely consistent with these! You can have days, weeks, months etc off. Just know that those things are easily accessible and will improve your mood.\n\nTwo other worthy mentions are meditation and counceling. Doesn't work for everyone like I believe the above would. But helps me a lot. \n\nThe battle you face is with your own brain chemistry. Anything you can do to improve it will help you.\n\nGood luck.", "permalink": "/r/DecidingToBeBetter/comments/gqpwuu/update_one_upvote_and_ill_admit_myself_to_the/fruks3l/"}