{"id": "t5_2tand_t3_pnwg65_t1_hctk2ep", "creation": 1631628067, "origin": "t5_2tand_t3_pnwg65", "height": 1, "replied_to": "t5_2tand_t3_pnwg65", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "milobdenum", "text": "I've been struggling with this intensely for years. I'm 28, I have a career, I build furniture for fun, and I can't fuckin do my dishes. There's something about those basic level tasks that make my brain explode, and I can't even explain it. I desperately WANT to do them, it just feels like scaling a mountain for no logical reason. So you know what I did? I hired a nanny. For myself. Just this past month. :)\n\nThe thing is, you aren't lazy!!!! (Imagine me shaking you by the shoulders here because I know people have been telling you you're lazy for your whole life) Brain fog, physical fatigue, those aren't the qualities of a lazy person. You WANT to take care of yourself and these things stopping you are outside your control. That's not laziness: that's illness!\n\nI did some hard thinking on ~society~ and realized that the whole reason humans thrive is because we chip in with the things we're good at and get help from others who have the skills we lack. That's why you have the sales department and the engineering department, no one would expect those people to be interchangeable. You've got the baker and the blacksmith, both relying on each other and no one bats an eye at that. I don't know where you are, but in the US we have this poisonous and completely false emphasis on individuality and Independence that just a flat out lie. Nobody actually lives like that.\n\nSo bringing it back: I'm not bad at doing chores, per se, but it takes me an absurd amount of energy to do what others can do easily, so I thought, why am I killing myself? I know my problems stem from my ADHD which I can only control so much, and I've tried everything I could possibly think of to make it easier, so why am I counting this as a failure? Why should I even NEED to be fully independent on these things when someone else actually could help me? \n\nI had to wrangle my ingrained humiliation, but I went online and hired someone with the understanding that I have several fairly insurmountable problems and need assistance to thrive (as all humans do with all sorts of different things). \n\nIf you can afford $30/week to have somebody nice come over twice a week for an hour and help you catch up on chores, I can tell you it is absolutely life changing. Simply having that safety net has even made me able to handle some of the things I previously couldn't.", "permalink": "/r/DecidingToBeBetter/comments/pnwg65/why_is_is_to_hard_for_me_to_take_care_of_myself/hctk2ep/"}