{"id": "t5_2tand_t3_pnwg65_t1_hcsqqa4", "creation": 1631608726, "origin": "t5_2tand_t3_pnwg65", "height": 1, "replied_to": "t5_2tand_t3_pnwg65", "down_vote": 0, "up_vote": 35, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "someChunt", "text": "Sort of...but you cannot be a tyrant to yourself, or just 'will' yourself to do better. That's just the equivalent of shouting at someone until they do what you want and it's not sustainable. Instead, try negotiating with yourself. Tell yourself if you do yoga this morning you can watch an hour of Netflix later guilt free. And just strive for minimal improvements. It's near impossible to switch your habits and lifestyle overnight, just like you couldn't get really good at a sport or any other skill overnight. Just try to make a small bit of progress each day, with the aim of being able to say that each day there was a small positive change or you tried something new.\n\nYou might want to look up the idea of atomic habits too. This is where you set things up to be easy for yourself. Small stuff like laying out a glass of water on the table and your yoga mat next to it, so in the morning you see them and it's like an instruction or trigger to yourself to first drink some water and then do yoga. You can then link lots of triggers together to help build a routine.\n\nIt seems a little but cliche, but you need to measure progress against who you were yesterday or last week, not compare yourself to an unachievable, idealised version of yourself. That idealised version should be an inspiring goal, but not a benchmark to feel bad when you don't meet it.\n\nAs someone else said, the reason you may be finding it hard is because it is hard! But so is learning anything (badminton, speaking Russian, knitting, mountaineering) , so think if yourself as a person learning to look after yourself as that's the correct way to look at things. You are a beginner. In mountaineering terms, one day you will be able to climb to Mount Everest, but today you just need to learn to put your boots on and take a couple of steps. For you mount everest might be a whole month of sleeping well, easting right and doing daily yoga. But today just worry about one step like laying your yoga clothes out at night.\n\nI also liked the advice someone gave of saying things out loud.", "permalink": "/r/DecidingToBeBetter/comments/pnwg65/why_is_is_to_hard_for_me_to_take_care_of_myself/hcsqqa4/"}