{"id": "t5_2tand_t3_pnwg65_t1_hcufb8o", "creation": 1631640800, "origin": "t5_2tand_t3_pnwg65", "height": 1, "replied_to": "t5_2tand_t3_pnwg65", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "someChunt", "text": "Thanks, I hope it works well for you. Another good tip is to and treat yourself like you would treat someone else who you cared for. Extend to yourself the same care you'd want for them. \n\nIf you have a family member or friend who was feeling a bit low, imagine what you might say to them, or how you'd treat them. You'd probably not be harsh with them, you'd be encouraging and gentle. You'd praise them when they do well, and not be too hard when they weren't perfect. That's how you should treat yourself. If you know something was bad for them, you'd try to stop them doing it, or if you knew something was good (like yoga) you'd find a way to make them do it...so find a way to make yourself do it!\n\nYou'd still be honest with them, and if they needed to hear they truth you'd tell them, but if you saw someone being mean or too critical to them you'd be furious! So don't be too critical of yourself, but be firm and hold yourself accountable where appropriate. Where you know you can do better, write it down or take note of the habits which cause you to waste time.\n\nAlso, worth knowing is that the same way a trigger can cause you to do a good habit, a bad trigger can cause you repeat a bad habit. So if you spend too much time on social media in the morning, try putting your laptop away in a cupboard so it's less easy to just switch it on and start binge watching. People tend to run on habits, so doing things which break bad habits can be powerful. \n\nSelf-help and improvement can be a like a hobby if you get a taste for.  My other recommendations are minimalism - stuff like Mari Kondo and The Minimalists bloggers which can give you a worthwhile project and can get you out of a rut and help you simplify things around the house. Also, while he's not everyone's cup of tea, I'd check out Jordan Peterson - lots of the advice I've given you about how to treat yourself and how to measure your progress is the type of stuff he encourages people to do.", "permalink": "/r/DecidingToBeBetter/comments/pnwg65/why_is_is_to_hard_for_me_to_take_care_of_myself/hcufb8o/"}