{"id": "t5_2tand_t3_q4d755_t1_hfymn8w", "creation": 1633769731, "origin": "t5_2tand_t3_q4d755", "height": 1, "replied_to": "t5_2tand_t3_q4d755", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "labdog", "text": "That was me some years ago. Now I'm still alone. But I'm not miserable and I feel pretty good. In fact - I'm happier than I ever was. I'm free from seeking of other people's validation. I don't need it anymore.\n\nThere is a little known law of physics. You are a part of the world that surrounds you. I don't exactly know HOW it works, but when you're good to yourself, everything and everyone tends to be good for you too. If you like yourself, the others don't really have a choice and they have to like you. It's not their whim. Not their call. It's just a simple law of physics.\n\nWhen you're young you have plenty of time to test it for yourself. I test it for a couple of years and it works. Both ways. Try to do anything bad to yourself and you also get a hose from everyone else. Not to mention that feeling bad makes me being a shit person to others.\n\nWe need other people, and at the same time we don't need them. The only way not to be alone is to make others need us. And that happens when we are more on credit than on debit side, and I'm not talking only about money here. Have a smile, you're a walking positive value.\n\nI figured out that doing the things I like to do, just feeling good is the best thing to do. Being better is not about forcing myself to do things I don't want to do. It's just the opposite. It's having fun. People are so wrong so often! They think they should punish themselves, or force to do things they hate to get what they want.\n\nSo I'm keeping to get better for years and it's all fun. Yes, I work out, not because \"I have to do hard manly stuff\" but because it's fun and pleasant. It sometimes indeed hard or even hurts a little, but it's still way better pain than the pain from neglecting myself and bad health.\n\nDon't think of yourself as worthless. It hurts you. Makes you weaker. No profit. If you struggle to get your shit done - maybe you're not getting enough fun to do it. All work and no play makes Jack a dull boy.\n\nThat was blocking me all the time. The fear. That I'll do my best, but no one will give a shit. I can do everything right and still lose. It happens. However, it's not the most probable outcome. The laws of physics work. The world is not perfect, nothing is sure, but come on, do the right things and most of the time it will pay off. It's just obvious and simple.\n\nYou're not lucky if they love you. It's just obvious consequence of correct choices you make. Yes, sometimes it's just pure luck, but that's really rare. Most of the time - it's choice. A lot of small, seemingly insignificant small choices.\n\nAnd if you made some really bad choices recently - it means only one thing - it's time to reconsider your choices and do things a little different from now on. It's almost always on the table, even when you think it's not.", "permalink": "/r/DecidingToBeBetter/comments/q4d755/i_feel_horrible/hfymn8w/"}