{"id": "t5_2tand_t3_2nxtw2_t1_cmi5pxw", "creation": 1417464124, "origin": "t5_2tand_t3_2nxtw2", "height": 1, "replied_to": "t5_2tand_t3_2nxtw2", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NEVERDOUBTED", "text": "People that take nothing and turn it into something great (which is measured in both personal and business development) are the gems of the world. \n\nThese types of people should be put under a microscope and examined molecule by molecule. Learning what they learned along the way, and what was easy and what was hard, is information that is invaluable to a teaching institution and/or a budding entrepreneur. \n\nEven some of the high level documentaries that I watch about Elon Musk and Tesla were mind blowing. I never knew how much hardship they (he) faced and how close they were to never making it...and what it took to make it all happen. To break that down even further would be invaluable. \n\nAnd...to get into the head of someone like Musk would be amazing. To really learn what he struggles with and how he deals with it. Wow...that would be cool. And/or...a collection of guys like him...at any scale.  \n\nSometimes on Shark Tank they do this, when they profile where someone went once they received their money. But...the show tends to sugar coat things. \n\nI'm always amazed at some of the stories of some of the most successful people on the planet. There is so much that you never hear about...(the bad) and this leads us to believe that it's all easy. To hear about the hardship that people face everyday, and then how they resolved it, or how they might have resolved, would be good stuff. \n\nNo one does that?!?!?! Doing this shows compassion. I mean...when I went to college I had no idea what to expect. When I came out of it, I had tons of stories and had learned a lot, little of which had anything to do with the classroom. That \"stuff\" is what we need to get out there...and at just about all levels. \n\nEven a 5 year old would benefit from knowing/relating to how \"rough\" the kindergarden experience might be, and how to deal with certain situations. Sure...they are only 5, but to them...it's tough stuff. I mean...how should a 5 year old, 10 year old, 15, 30, 40...etc. deal with someone that is a bully? That's the stuff that knocks you down when you don't have those tools. Just knowing that you will face bullies at any age is good information. \n\nSo...what you are covering is good stuff, but it's fluff, when you layer it onto the real day-to-day world. \n\nFor me, I need precise answers...and often, examples of what others did educates me the most and I relate to it the best. \n\nI read some stuff the other day that says that only 5% of entrepreneurs that set out to raise money for a business, get the money. WTF!! I had to dig deep to find that information. But now that I know that, I can relate to the hardship of so many people telling me \"no\"...and I understand the importance of tactic and strategy and preparation in my presentation. Basically, what it comes down to is a big disconnect between those that have money and those that need it. All of that could be looked at with an examination of both sides, of someone that goes through that process. \n\nBut...deep stuff. Perhaps, the focus, of what people need the most...is just a happy go-get-em pep talk. I don't know. But being new at anything is hard...and just hearing, \"you can do it\" may not be the best fix. \n\nBest of luck!\n", "permalink": "/r/DecidingToBeBetter/comments/2nxtw2/we_become_what_we_think_about/cmi5pxw/"}