{"id": "t5_2tand_t3_q2sl89_t1_hfnxzyo", "creation": 1633562406, "origin": "t5_2tand_t3_q2sl89", "height": 1, "replied_to": "t5_2tand_t3_q2sl89", "down_vote": 0, "up_vote": 22, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "imbuedgreen", "text": "Great to hear that you're learning to trust in your own decision-making abilities. I've experienced something similar at times before. The funny thing about confidence is that it's entirely up to you, and in your hands (even when everything inside of you is screaming otherwise).\n\nA few things to keep in mind, that I hope you may find helpful. The intention is not to reiterate the obvious, but to share some friendly reminders...\n\n1. At times, you will make a decision / listen to your own opinion, and things may \\*NOT\\* turn out as you had anticipated... or they may not turn out well at all. Remember that sometimes, things are NOT in your control, or are otherwise unpredictable. Take responsibility for your own words/actions, yes, but otherwise don't take on the burden of responsibility for every circumstance and consequence. That's not your burden to bear.\n2. Eventually, you will make a decision / listen to your own opinion, and it may be YOUR fault that it goes badly. That's okay. We all make mistakes. That is what it means to be human. Learn to forgive yourself, and to apologize / remedy any situation that has affected someone else. Learn from your mistake. Then move on, and don't dwell. One bad decision does not directly affect your ability to make decisions in the the future. You must give yourself (and others) grace.\n3. While I think that it's AWESOME that you're practicing not asking for help / the opinions of others... remember that it IS okay to ask for help, or advice. The key is, seeking out others' opinions should be supplemental information. View their thoughts as ideas for you to consider. Sometimes there may be a perspective you just hadn't considered. But don't let it pressure you. The decision is yours, and others should not make the decision for you.\n\nFor now, as you implied, you just need to get out of the habit of not trusting in yourself. Consider being open to asking for help / advice from those you trust, but minimize it to very important or life-changing events.\n\nI wish you all the best.", "permalink": "/r/DecidingToBeBetter/comments/q2sl89/im_not_going_to_ask_for_your_advice/hfnxzyo/"}