{"id": "t5_2tand_t3_b7j9v7_t1_ejspok5", "creation": 1554030390, "origin": "t5_2tand_t3_b7j9v7", "height": 1, "replied_to": "t5_2tand_t3_b7j9v7", "down_vote": 0, "up_vote": 31, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "josski32", "text": "one of my best thoughts on this is that usually when you are very judgmental towards others, you are also very judgmental towards yourself. imo it is nearly impossible NOT to be judgmental of others if you are judgmental of yourself. if you stay in on a friday night and you brand yourself “loser,” for instance, it would be unfair not to brand others “loser” who do the same thing. true empathy starts with compassion for the self.\n\nthe problem with giving up judgments on the self is that if you are used to doing it, it is how you get into action. following the example, if you called yourself a loser, it is a way of motivating yourself to go out. calling yourself fat may be a way to start working out or losing weight. this is actually your deeper problem, and you should switch out these arbitrary and unkind judgements for judgments based on values and what you actually want or is actually important to you. \n\n(very helpful for changing your mindset on this:https://waitbutwhy.com/2014/06/taming-mammoth-let-peoples-opinions-run-life.html)\n\ni am working on doing this by only allowing myself to make a “judgment” if it leads me to action. no labels. for instance, instead of calling myself lazy, i would notice that i feel gross and make a “judgment” to get out of bed and go work out. this solution is actually two fold because you are not only cutting out your unkindness for yourself but tapping into a deeper well of motivation for self discipline. make sure to be kind to yourself through it though and don’t forget to treat yourself like a human and acknowledge your feelings (basically, if you feel lazy and don’t workout, don’t kill yourself over it.) this process of changing how i see judgment has definitely been a long haul. it does NOT happen overnight. but even putting in a bit of effort had proved to reap great rewards. ", "permalink": "/r/DecidingToBeBetter/comments/b7j9v7/when_i_have_a_judgmental_thought_about_someone_i/ejspok5/"}