{"id": "t5_2tand_t3_l6jfrk_t1_gl7wi9s", "creation": 1611915383, "origin": "t5_2tand_t3_l6jfrk", "height": 1, "replied_to": "t5_2tand_t3_l6jfrk", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "asecuredlife", "text": "I second /u/wh0_RU 's comment but I'll break down in usable chunks for you, with some specifics. These will be prompts to help you think about things. I'll add that I'm not a therapist or anything, but I'm great at helping people figure shit like this out because reasons.\n\n>and things seem to be going well; until they’re catastrophically not.\n\n* Can we define *catastrophically* not? That's pretty strong language. How old is the tiny human and what does *catastrophy* mean to You? What does it mean to your partner? \n\n> used to drink to turn off the negative voice in my head, or to stop my mind from racing.\n\n* Have you been able to cut back from this? Do you drink often or for any other reasons? At what point did you find that you started drinking for this *specific* reason? \n\n>Negative Voice\n\n* So, *apparently* not everyone has a critic in their head (this concept is *crazy* to me, but I feel it's due to those people having serious trauma or deciding they don't need it). I recommend being deeply introspective, and **not** drinking and thinking about *why* you have this critic and perhaps *why* it's **negative**. In fact, ask your negative critic directly why you even *need* it anymore. You may find that the negative thoughts may decrease dramatically.\n\n* What are the negative thoughts/voice? How often do they occur? Is there a catalyst? Not exactly in line with /u/wh0_RU but I recommend looking into Internal Family Systems/IFS and applying that to your own worldview. There are 'sides' to us with everything we process and think. What does each side of you think of this negative critic? Also, [see here and take this](https://selftherapyjourney.com/Pattern/Description/Inner_Critic_Pattern_Description_Marketing.aspx) -- in fact, take *all* their exams -- they are awesome! \n\n>extreme lack of impulse control make it very easy to abuse them.\n\n* How extreme are we talking? Are you able to control this at all? Do you neglect duties in order to do other, more fun things? Do you find you're in a thrill seeking mode, or just looking to pass the time?\n\n>use my extreme drive to my advantage at home\n\n* How *extreme* is this drive that we're talking about? Are you say, [super extreme smiling motivated drive like this](https://www.youtube.com/watch?v=n-MA50it3_w)? Or something else?\n\n> I’m so used to physically demanding jobs that it’s hard to focus on simply folding the laundry, or putting dishes away. \n\n* To be honest, it sounds like you're looking for something to do with your time or to deal with that energy. Is there a work from home job you can do to make some extra cash, while taking care of humans? Are there doggos in the house that need tending to and to go on walkies to keep you busy in-between house duties? \n\n* I hope all of this helps. You got this :)", "permalink": "/r/DecidingToBeBetter/comments/l6jfrk/i_want_to_be_a_better_dad_but_i_cant_get_out_of/gl7wi9s/"}