{"id": "t5_2tand_t3_h9t3fl_t1_fuytkc8", "creation": 1592271513, "origin": "t5_2tand_t3_h9t3fl", "height": 1, "replied_to": "t5_2tand_t3_h9t3fl", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "asinglepeanut", "text": "I like Reddit because I don't give a flying fuck what anyone on here thinks about me lol\n\nI hope that I stick with it. I'm a little scared of how strong the compulsion is to check it, not even 6 hours after deleting it. Especially my ex's social media pages. I have a feeling the compulsion is going to get worse before it gets better, but I've replaced the spots where I had my social media apps on my phone with news, book and language apps, so when my fingers go through the pattern on their own to open Instagram/Twitter, I open those apps instead. \n\nFrankly, I've hemmed and hawed about doing it for about two years. My excuse was always that I like to see what everyone I went to high school with is up to, and that it was harmless. It wasn't harmless, and knowing what people in my past are up to did nothing but make me compare myself to them in unhealthy ways. \n\nI don't think social media is a true reflection of the reality of the world. It's a carefully curated representation of the most interesting aspects of the world, whether those aspects are positive or negative is irrelevant. Being bombarded with such concentrated media is overwhelming and unhealthy in my opinion. I don't plan on hiding away from the world, but I do plan on getting my news from reputable sources instead of my twitter feed and spending my free time scrolling through a book rather than through the fiftieth wedding shower post-stream on Instagram this month. \n\nI'm going to be more selfish, in the healthiest way. Making myself a better, happier person without worrying about how other people perceive my life is the goal, and social media was hindering that goal.", "permalink": "/r/DecidingToBeBetter/comments/h9t3fl/deleted_all_social_media_except_for_reddit/fuytkc8/"}