{"id": "t5_2tand_t3_cc5g9e_t1_etlqffw", "creation": 1562942990, "origin": "t5_2tand_t3_cc5g9e", "height": 1, "replied_to": "t5_2tand_t3_cc5g9e", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "It’s ok, I just felt the need to defend myself.\nI get annoyed at people who find simple self improvement tasks “too hard” as well when they have time to do everything else.\nHave a family member who cries and complains about money, but is constantly out and about, getting their hair done, vacations etc. but then calls me bawling that they’re broke and don’t have enough money to afford a place. They’re 27 and live with parents, but instead of saving money each month, they (somehow?) got into credit card debt and now can’t find a place they can afford to live so they hop from family member to family member. I suggested side hustles to her and she cried “I dont have TIME!!!” When all she has is a full time job, no kids, nothing else. Just wants to go be social instead. I couldn’t take her serious because my social life is usually the first thing to take a hit when I need $$. Do I want to do doordash and shit all the time or hustle all the time? No not really lol. I’d love to kick back too. But I have to work hard to get through my period of life right now as I have these buildings, I’m getting my RE license, and can’t have a job with set hours right now as I have to work with these properties and it’s unpredictable. I just don’t understand people who think having an easy, average work ethic is going to get them an amazing life. She thinks she’s going to find a millionaire to take care of her still. Honey, you’re 27 and make no attempt to fulfill this dream. It aint happening. Like anything else, that goal requires steps to reach it (looking great, being intelligent, spending time where millionaires spend time, engaging with them, keeping up on $$ news and networking events which she does not do) Lol.", "permalink": "/r/DecidingToBeBetter/comments/cc5g9e/grant_cardone_ten_steps_to_be_a_millionaire/etlqffw/"}