{"id": "t5_2tand_t3_3r2jf0_t1_cy7h0vo", "creation": 1450760898, "origin": "t5_2tand_t3_3r2jf0", "height": 1, "replied_to": "t5_2tand_t3_3r2jf0", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Republic_of_Ash", "text": "I don't think your friend John was magnetic in the sense that it was inborn. I think he read the Game, practiced what it preached, and gained confidence in himself over time to approach women. \n\nAnd actually, if you do it enough times, that fear of rejection becomes smaller and smaller because you realise that rejection is not a bad thing. It tells you that you weren't good for eachother at that particular point in time.\n\nBut anyway, coming back to John, I honestly believe he had a certain level of confidence that men attain after having a string of successful dates, etc. It's like a booster - underneath the surface he may be quite a tragic figure, but not fully aware of his shortcomings, or just indenial, but having this confidence to pick up women easily to him becomes like a drug - it's what keeps him \"magnetic\", if he stops sleeping around he'll lose that magnetism, etc. So it becomes a reccuring theme in his life, ultimately not building real confidence himself. \n\nJohn has a strong belief in himself but it treads a fine line of instability, and so it is not true magnetism. Or so I assume. I've known guys like him. \n\nI do feel however that true magnetism can be something you learn, and it isn't necessarily anything to do with physical attraction. I've known many people, who on the surface, looking at them as objectively as I could weren't especially attractive, but who they were and how they carried themselves made them more attractive than physical appearances ever could. Looking good would just be a huge bonus.\n\nI do believe I possess a magnetism myself, and I believe magnetism is something you learn subconsciously from an early age; at school, in the park with friends, through your interactions with adults even right up to your teenage years which is usually the make or break stage for everyone. Some people will continue to be successful with their personality, and others will unfortunately succumb to pressures they didn't expect, or perhaps a tragedy, or just anything that can derail a person into a world of anxiety and depression. \n\nWhich is what happened to me. Before that, I had all the characteristics. Although I wasn't aware of it AT ALL as a kid/teenager, infact, I was a massive dumbass, and behaved likr a moron a lot of the time but looking back on all of that now, I was actually loved. I had many friends, I was one of the most popular people at my schools, and I was the sort of guy who would mix with every clique - I had no set group of friends. Everyone was my friend!\n\nI'm not gonna give you my life story anyway, but to cut it short: shit happened in my early teens, and everything I was, or learned, seemed to slip away and I didn't even know it was happening. I stopped going out more, spoke to friends less, and became a hermit essentially and being aware of that now, fills me with some regret, I admit, but it's been a good learning experience too.\n\nSo.... back to my point. I really DO believe magnetism is learnt. It never truly left me, but was hideously dormant for a few years, and actually it's something that... if you have it, you can improve upon it, but it requires absolute commitment to the cause, and dedicated action towards trying to remove your fears, anxieties, etc. Those should not exist in your mind. To do it though, will be a lengthy process, but a worthy one as I'm sure you'll agree. \n\nAim towards these vague goals:\n\n1. Rid yourself of fears; take steps to do by checking out 2.\n\n2. Learn as much as you can, and try everything you can. Confidence is having trust in your abilities, whether that's social, physical, academic, and just anything. You must expand your mind.\n\n3. Really turn negativity into positivity. It can be hard as fuck to do this, but complaining ALL of the time is not something people are drawn to, and negativity is like cancer - once you start, it begins to grow within you. Just be aware of it and stop yourself.\n\n4. Exercise. Just do it, as Nike says.\n\n5. Eat right. (4 and 5 aren't essential, but it helps to feel good about yourself and maintain that shit).\n\n6. Laugh, make others laugh. Make as much noise as you want or can, even if you look mad because eventually you'll learn not to give a shit, and that sort of behaviour will become \nmuscle memory, and you'll become more convincingly confident, rather than awkward or cringe. The reason you cringe at some people's behaviour is because the cringey person in question is not confident or experienced in behaving in certain ways, and you can always spot it a mile off.\n\n7. Learn to deal with cringe until it becomes funny. Everyone has awkward situations daily, but magnetic people rise above it, rather than linger in it uncomfortably. If you feel yourself in a situation like that, always be honest. ALWAYS. If it's you being weird, make sure you let others know you're aware of it and LAUGH, next time you wont be so cringey. If it's them; then laugh it off, or just pretend it didn't happen and carry on as normal. As long as you're not making them feel bad about it.\n\n8. Listen to people. The trick to actually doing this is not by staring at their face trying to process every word that comes out of their mouths, it's rather simple and you learn it the more you practice. It's just good eye contact, which becomes second nature, and immersing yourself in their stories. Talk about what they're telling you. It's easy, really.\n\n9. Dressing nice helps.\n\n10. Be honest with yourself, show people who you are and wear your character with pride. Never lie to yourself. You like what YOU like, no matter what others think. And just another tip: if you begin to become magnetic, and charismatic, you will not even see it coming... it will just hit you one day; after all the hard work, and struggling through all the awkward bullshit, but when it does happen, you will feel at peace. \n\nIf any of my pseudo-psychology helps you guys, then I've done my job. We're not all the same, just take the steps to be who you really were born to be. 'Cause it's in there. We all have it.", "permalink": "/r/DecidingToBeBetter/comments/3r2jf0/how_to_be_magnetic/cy7h0vo/"}