{"id": "t5_2tand_t3_ppcf8t_t1_hd3fms1", "creation": 1631809072, "origin": "t5_2tand_t3_ppcf8t", "height": 1, "replied_to": "t5_2tand_t3_ppcf8t", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "The_Dude_of_Pala", "text": "Here's a little advice from an old guy who's been around the proverbial block. I've always been \"a go getter\" I only slept a few hours a night for the first 30 years of my life, when I wasn't sleeping I was doing something \"productive\" I was never idle. Before I went into the military I was a welder, worked on farms and built houses. Then in the military I was pretty technical, IT, systems, computer hardware, databases, etc. Then got out and got a job in IT, I kept learning and got two masters in Engineering and Computer Science. I've programmed in just about every language from BASIC to C++. I've designed and built million dollar systems for the military. I've worked my way up to the Directorate level. In my \"spare\" time I use to weld, rebuild engines, build furniture, sew, draw, write, do composite photo and video editing, and a myriad of other things... for 40 years I was the living embodiment of \"Jack of all trades, master of none\"... \n\nBut... with all that knowledge, all those skills, occupying ever minute of my life with something \"beneficial\" it was never enough. Even when I was making $250K (USD) a year I was still seeking more, doing more. Then the Universe finally smacked me in the face and I decided to reevaluate my life and go a different route, step away from all my intellectual learning and doing to something else. I tried meditation and mindfulness, something I had tried many times before, but this time I was \"just\" doing it, not trying to perfect it. I just sat with no goal, instead of trying to meditate with a goal.\n\nSo, my advice to you young friend is if you want a new skill that will make you happier, healthier and more whole, give meditation and mindfulness a try. Just remember it's not a test, there's no goal, so to speak. Learning to sit quietly with yourself and your thoughts without reacting is an invaluable skill that will benefit you throughout your entire life. I would never recommend meditation and mindfulness as a way to become better, smarter, richer, etc... that's absolutely the wrong approach. But, if you can learn to quiet your mind and be more mindful other tasks in your life will be much \"easier.\" You won't stress as much, you'll learn to observe and grow, and your mind will be much more fluid and capable of learning and adapting to situations.\n\nIf you're looking for a challenge and something that you'll benefit from regardless of your job title, living conditions, family situation or anything else... explore and experiment with meditation and mindfulness.", "permalink": "/r/DecidingToBeBetter/comments/ppcf8t/how_to_stop_feeling_like_i_am_wasting_my_time_and/hd3fms1/"}