{"id": "t5_2qh5i_t3_7zwczv_t1_dusepxe", "creation": 1519531474, "origin": "t5_2qh5i_t3_7zwczv", "height": 1, "replied_to": "t5_2qh5i_t3_7zwczv", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "KindaCrypto", "text": "I know what you mean. Ten years ago I had a dream of going to this island with all these old ruins on it. It's a pretty small island and everything feels kind of eerie but I just kind of explore around a little. I make my way out of the small decayed city to the other beach. Even though it's starting to get dark I make out three human figures where I was exploring previously. Despite being all alone and somewhat hoping I would run into someone else, seeing these figures slowly walking over my tracks filled me with unspeakable dread. I calm myself and let the rational part of my brain take control. I'm stuck on this island with these previously unseen inhabitants and with the light waning fast, they would soon be my only source of shelter. \n\nAccepting my fate, I start walking back to the ruins. I can feel them watching me even as the twilight makes their shapes indistinguishable from the half fallen stone pillars in the ruins. In the near dark, the dead city is far less welcoming then during the day. Uncertainty hollowed out any chance of calling out to attract attention. I have never felt more alone. The illumination of the moon and the dead silence is my only comfort being that I could hear or see anything that tried to approach. I climb the small cyclopean wall and wait. Vigilance will preserve me.\n\nMotion. Half the path to the ocean is now glittering with a crawling blackness drawing closer. Bodies. Thousands of them. Shambling slowing, blackening out the landscape, eating the moonlight leaving only festering shade. I'm surrounded. One steps into the light and it's human form is as decayed as the ruins around me. I try to climb a pillar but one grabs my foot and then another. They pull me down to the ground. I feel the white hot pain of flesh being torn from my body. I wake up.\n\nToday I take REM blockers and that's been going pretty good.", "permalink": "/r/happy/comments/7zwczv/20_years_ago_i_dreamed_of_traveling_the_world_but/dusepxe/"}