{"id": "t5_2qh5i_t3_aysz8y_t1_ei5aj34", "creation": 1552148565, "origin": "t5_2qh5i_t3_aysz8y", "height": 1, "replied_to": "t5_2qh5i_t3_aysz8y", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "litespeed68", "text": "Congrats to you! Here is my advice to new fathers, take it for what it is worth, which is probably nothing but my son is now 25, a university graduate, and he teaches children with autism. He is a happy person.\n\nWhen they are babies, do not concern yourself with “milestones” or percentile charts. Your friends and family will ask about first words or first steps, how big, how does he compare. Potty training also. It is easy to get caught up in and all that is pretty meaningless. \n\nDon’t react when they fall down (actually and metaphorically) unless there is something to really react to (actual injury).  When they fall, which they will do often, and you have a big reaction, so will they. Kids are pretty tough. If I saw my son fall but knew he was ok, I’d look away. If he cried, I downplayed it. Eventually he’d just jump back up and keep playing. Still does. \n\nMake them advocate for themselves at a young age. My son loved McDonalds Happy Meal toys. If he got something he already had and wanted something else, I made him go to the counter himself and ask, by himself. If they can tell you they can tell the guy at the counter. This is the single best thing that I did for my son. To this day he can instigate and carry on a conversation with anyone. He is intimidated by no one.\n\nDo not push them to grow up to fast, this is not a video game you are trying to level up. It will be over before you know it. If they are not ready for something, don’t push. \n\nTry your damndest to be he house that he and his friends want to hang out at. Have what it takes to make the kids want to be there and then take a step back, be available and participate but know when to give them their space. \n\nYour not his friend, your his Dad. Being a Dad is better and will ultimately lead to a better relationship as they mature.\n\nHe may hate you as a teenagers. They will do and say things that hurt your feelings. Don’t take it personal (almost impossible to do) Do not overreact or become overprotective. Keep a close eye but let them figure out who they are. Remember your not their friend. They will have a bunch of friends, some will be idiots, some will be great, but you can’t pick their friends. Just be that occasional voice of reason, guidance and love. You have to navigate this minefield carefully.\n\nEven when they are grown and on their own you will never stop worrying about them, so get use to that part. \n\nBest of luck to you, let me know how it goes!\n\n", "permalink": "/r/happy/comments/aysz8y/hi_rhappy_im_dad_my_wife_showed_me_the_test_last/ei5aj34/"}