{"id": "t5_2qh1i_t3_2ohecq_t1_cmndp5d", "creation": 1417915162, "origin": "t5_2qh1i_t3_2ohecq", "height": 1, "replied_to": "t5_2qh1i_t3_2ohecq", "down_vote": 0, "up_vote": 40, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "JawnyTheIgnoble", "text": "It was 4th April of this year (2014) when I decided that today was the day I was finally going to embark on my self-indulgent journey to the wonderful void that is hereafter. Firstly, let me preface this by saying: I had been heavily weighing the pros and cons of suicide - the negative and positive connotations that would follow suite, very extensively leading up to the incident. I, being an unemployed, unearned, frivolous nineteen year old, staring the imminent approach of losing my residence at the house I was then renting, and having a negligible reason to pursue any further endeavour on this mortal coil, decided to die with an astute mind - on my own terms. That morning, coincidentally, my long time girlfriend had decided that it was no longer of interest of her to perpetuate the lie she had been living via being with me; That was one less sorrown heart I would leave deficit upon my death. Having done the research, I knew precisely the dosages that I would need to take in order to cause cardiac arrest, and or onset organ failure, allowing for a 20% dose increase to refute any possibility my body had to fend it off. 120 extra strength Aleve at 500mg per tablet, 90 25mg Celexa and 30 25mg tablets of Diphanhydramine Hydrochloride to ensure I was high as I took my final  moments in stride.   As I sat on my front porch, having ingested the aforementioned, the birds flew hastily with their unmitigated range and scope, the neighbourhood kids played basketball in the carefree manner that only an adolescent can muster, and for the most brief of moments - almost like the flash powder of an antiquated camera, the world around me was, for once, beautiful. All this time, my perceptions had been shrouded and relegated by the negative and unsavoury, leaving me with the inability to see the joy and insurmountable beauty of the world.  The final thought I can recall before my memory vignettes is: \"At least I will die having once seen the world for its cathartic beauty, and feeling the resolve of knowing that all of the unblighted populous will be left here to enjoy it as it was intended.\"\n\nMy brother found me unconscious, writhing and as cold as a porcelain statuette lying on the porch, who then called 911. I awoke two days later, alive, but only just. After a week in the behavioural unit on suicide watch, I was once again released into the world, but there again was no pristine beauty as before I had seen, leaving me remorseful that I had failed.  Although I struggle still, I trudge on knowing that one day I may see the world for how it truly is, without my vision being obstructed by these sunglasses that are my depression. \n\nTL;DR: Upon nearly completing, I saw the genuine luster and beauty of the world that had, until that moment, abhorred me.  I was content with dying with the knowledge that everybody living could, and hopefully would, experience the world in it's unadulterated glory. ", "permalink": "/r/AskReddit/comments/2ohecq/suicide_survivors_of_reddit_what_was_the_last/cmndp5d/"}