{"id": "t5_2qh1i_t3_2ohecq_t1_cmni60a", "creation": 1417924703, "origin": "t5_2qh1i_t3_2ohecq", "height": 1, "replied_to": "t5_2qh1i_t3_2ohecq", "down_vote": 0, "up_vote": 82, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Made_you_read_penis", "text": "So my dad was a pedophile, a meth cook, and his enabling parents had amazing lawyers.  After surviving two years of brutal rape, being around/being forced to help cook meth, and being kidnapped once I was living a crippling life of anxiety and insomnia.  My dad never saw any jail time, especially because I was intimidated into silence.\n\nHe showed up at my school to say hello a few times, because meth addicts are paranoid, and I guess he thought I would talk.\n\nAfter years of not sleeping, I decided to end it in Highschool.\n\n***\n\nWell, I was panicking as I took the pills.  I was worried that a) my family or girlfriend (she was our neighbor) would come into my room and catch me, or b) I wouldn't have enough pills; it took a long time to squirrel away the pills I could.\n\nThe split second after the last one I took went down I was instantly calm.  I wasn't high or anything.  I just reached some sense of peace, and euphoria.  It was finally over.\n\nI climbed into bed, and actually felt like I could sleep.  Nobody could hurt me anymore.  I felt a little anxious about how my youngest sister would do, because by then I was already acting as her sole parent (my mom had huge psychological problems, I was only physically safe, but it was an emotionally fucked situation), and how my girlfriend would handle it.  \n\nThe pills kicked in, and I sunk into unconsciousness.\n\nMy second fear was spot on.  I didn't have enough.  We didn't have internet.  I couldn't research beyond movies.  Nobody had checked on me, but my girlfriend had tried to visit.  *They didn't even know I was home.*\n\nI was so sick I couldn't move.  I *literally* felt like I was hit by a truck.  I had vomited in my sleep, and it was cold.  I couldn't move for what felt like hours.  Then I got up, took a shower, vomited some more, and washed my sheets.  \n\nAfter that I checked on my little sister.  Nobody had changed her diaper.  I couldn't kill myself after seeing how dirty she was, and how happy she was to see me.\n\nFuck.\n\nOkay, good news, I'm happy I didn't die, I raised my sister as my own child, after drifting apart, my girlfriend and I met up again and have been married and happy together (16 years).  I got counseling, but the insomnia was still rough.  I almost killed myself again, then suddenly found a medication that works.  My life has changed for the better.  My wife and I own our own house, and my sister/daughter is in her second year at a state college and loves her sorority.", "permalink": "/r/AskReddit/comments/2ohecq/suicide_survivors_of_reddit_what_was_the_last/cmni60a/"}