{"id": "t5_2qh1i_t3_2ohecq_t1_cmn5mj5", "creation": 1417897474, "origin": "t5_2qh1i_t3_2ohecq", "height": 1, "replied_to": "t5_2qh1i_t3_2ohecq", "down_vote": 0, "up_vote": 829, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BantamBasher135", "text": "TL;DR: **\"Why should I endure this when nobody else even cares?\"**\n\nWoke up one morning in agony. I had been hit by a car the night before on my way to work (nothing happened to the driver because she was some stupid bitch with her kids, blamed me for it, and I was already late for work so I just left), was forced to work for several hours before I physically could not anymore due to the pain. I couldn't go to the hospital because I hadn't been able to pay off my bills from my previous two visits, one for another bike accident (also not my fault) and one for severe depression.\n\nMy girlfriend at the time was over in Europe fucking another dude, which she didn't hide very well. My birthday had come and gone and not even a call from my dad, my only family member. I had a knife under my pillow to protect myself from my psycho roommate who had already threatened violence against me.\n\nI was certain I was crippled, and would never again be able to do the active things that were basically at that point the only good things left in my life. My last thought before I grabbed the knife was  something along the lines of: \n\n**\"Why should I endure this when nobody else even cares?\"**\n\nI was going to slit my throat with the knife, but my arms were so fucked up from the crash that I couldn't get a grip on the knife handle. In high school a friend of mine had shot herself in the mouth, but was still alive and alone for six hours before she died. I did not want to botch the job and suffer like that, so I just gave up entirely.\n\nLater that day, my fucking crippled ass got out of bed, packed up my laundry (screaming and crying from the pain) and walked it all to the laundromat and back. That simple, everyday task reminded me that if you have no better reason to do something, do it anyway because the alternative is failure. Do it through the blood and tears and sweat, and do it as best as you are possibly able. Give no fucks, and just fucking do it.\n\n11 years later and I am finishing up my PhD in chemistry, and I am a mentor for just about everyone around me.\n\nWhy should you endure it? Because you fucking can, that's why.", "permalink": "/r/AskReddit/comments/2ohecq/suicide_survivors_of_reddit_what_was_the_last/cmn5mj5/"}