{"id": "t5_2tand_t3_ox1d92_t1_h7jj5db", "creation": 1627991206, "origin": "t5_2tand_t3_ox1d92", "height": 1, "replied_to": "t5_2tand_t3_ox1d92", "down_vote": 0, "up_vote": 102, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "phylemon23", "text": "So, a few things to unpack there.\n\nFirst regarding college and career accomplishments. I felt the same way. I kept feeling like I was behind because I’ve been in and out of college a few times, but still don’t have a degree. I’ve worked all sorts of jobs, travelled the world, but I still don’t have a career. Then I started to realize a few things.\n1. Many of my friends who burned through and got a degree right after high school don’t have a job in their degree field.\n2. Many extremely successful people didn’t achieve their success until their 30s and 40s at the earliest.\n3. All my time outside of a career has allowed me to gain a wealth of experience to draw from for life, family, and career!\nThere’s a reason the minimum age for President is 35, yet most elected Presidents are well into their 50s or older.\n\nRegarding sex:\nJust like career, people progress at their own pace. There is nothing wrong with taking things slow. I was a little on the later end, too. I was 19 when I lost my virginity. I’ve dated plenty of people, but I’ve only had a handful of sexual partners.\n\nThings you might consider:\n1. Know how to take care of your pleasure. Learn your body and what feels good. Become comfortable and confident with what you look like. You don’t have to be an expert in sex to be completely sexy. There’s nothing hotter than someone who is confident and eager.\n2. The only way to have sex is to actively look for it. That doesn’t mean you need to be bar hopping. People are naturally sexual animals. I met my wife at a Barnes and Noble. But you won’t find sex if you’re not looking for it, even in a committed relationship…\n3. Sometimes sex gets elevated above a reasonable level. If you find that you’re having anxiety or concerns that are preventing you from going out to find a partner, speak with a therapist. There are therapists who specialize is sex counseling.", "permalink": "/r/DecidingToBeBetter/comments/ox1d92/how_to_get_rid_of_the_feeling_that_time_is/h7jj5db/"}