{"id": "t5_2tand_t3_p0byal_t1_h8dt9zi", "creation": 1628578390, "origin": "t5_2tand_t3_p0byal", "height": 1, "replied_to": "t5_2tand_t3_p0byal", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "LooseToday110", "text": "That’s amazing, I like Waldos quote of you are what you think about all day long, I hope i didn’t ruin your viewing of hammocking lol. I often don’t like being alone, and i also don’t like being around people because i have to think of things to say. In middle school an beginning i used to distract myself from those bad thoughts by being around people. Now i feel that those same people lost respect for me for not being able to be funny and stand up for myself. I’ve almost forgotten how to be ina group setting. I was the fat kid that did the bullying in elementary, i still judge people harshly, always hated the way i looked and dressed goofy but still had buddies, but always felt limited by the things running through my head of feeling inadequate. I now weigh 35 pounds less than what i used to 3 years ago at 16, i feel pretty good about that. Have done weight lifting since 7th grade, never saw any improvement my body ALWAYS stayed the same. Now i’m not even trying and i’m losing weight and looking better. Please recommend all the books you can i will look into them. Do you like gyms? or at home. I feel like everybody is watching me at a gym because i don’t know exactly what i’m doing. Also lmk if you’re around colorado, looking for friends too. Kind of a slim chance but eh still a possibility. I work until 10:30pm so hardly get to hammock and it’s always wayyy too hot during the day to really enjoy it, then winters coming along and it’ll be too cold😂 It’s like would you rather only drink ice or only eat coffee. Neither", "permalink": "/r/DecidingToBeBetter/comments/p0byal/i_dont_see_myself_ever_being_happy/h8dt9zi/"}