{"id": "t5_2qh1i_t3_bcrxa7_t1_ekt7tkb", "creation": 1555178133, "origin": "t5_2qh1i_t3_bcrxa7", "height": 1, "replied_to": "t5_2qh1i_t3_bcrxa7", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "OffbrandNihilism", "text": "Whenever I'm suicidal I think of all the ways it can go horribly wrong. It's not so much that I want to die as it is I don't want to live and no other options seem reasonable or valid. It's more that I don't want to suffer any more and it's normally after a prolonged incredibly stressful period that the thoughts become so intrusive that I can't function. \n\nWhat works for me might not work for others, and what works for others might not work for me, so this might not help as much as I'd like it to. Someone posted about attempting to OD on paracetamol and while that's not what my attempt was, one of the things about attempting is that the pain will kick in and your brain will tell you you need to survive, and when you survive you're going to still be depressed. You might feel worse for living because you might think that you can't even do that right and be angry at yourself. You might feel guilty or like you're being selfish for not wanting to be in pain. In that case, you need to work out the issues that are making you feel this way- is it stress at work, school, with family, feeling isolated and rejected. It really does depend on the individual and the situation but you aren't as powerless as your depression might make you feel.\n\nPart of the thing that stops me is the idea that I'll mess up and make it worse. What I'm suffering now is much more manageable than if cause brain damage and I'm trapped in a state where I can't communicate with those around me but still feeling the way I am or my body won't respond. I won't be fixing my problems by poisoning myself and doing permanent damage to my organs. You're not going to do any better by upping the difficulty if you're already struggling. \n\nIf you need to, allow yourself to grieve for a bit, but then try and take on what you can to get to a better place. Force yourself to do what's best for you, even if you don't feel like it at the time. There is no more solid foundation than rock bottom. You can acknowledge your suicidal thoughts, they're there, but they aren't your only option. Maybe you're thinking about suicide because it feel like it's the only thing you can actually control and you don't enjoy anything you used to anymore. Maybe it's time to do something that you haven't tried yet that you might be interested in that you don't already have a connection to. You might be bummed that you don't enjoy drawing anymore and you used to love it and be so good at it but now you're out of practice- Then do something else, maybe learn an instrument or try to engage with people you trust. You don't need to tell them anything that you don't want to disclose, but just having caring people around you can help. Don't have any friends, family or co-workers you feel close to? Then find a completely new group of people, maybe a knitting group, sports club or meet up group?\n\nThis might not work for you, but it helps to monitor how stagnant you are- sometimes you need a break to recharge and not burn out, but if you haven't left the house for a few months I'm gonna guess it's not helping. Listen to your body- if you're feeling jittery, agitated, frustrated, restless, can't sleep- do some exercise. If you're feeling run down, exhausted, mentally blank- rest up. Variety is the spice of life and it comes in ebbs and flows, sometimes things will be hard, but things will also get easier.", "permalink": "/r/AskReddit/comments/bcrxa7/serious_suicide_attempt_survivors_of_reddit_what/ekt7tkb/"}