{"id": "t5_2tand_t3_3ecbgw_t1_cteak81", "creation": 1437717213, "origin": "t5_2tand_t3_3ecbgw", "height": 1, "replied_to": "t5_2tand_t3_3ecbgw", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "reeblebeeble", "text": "I think age 25-28 is very hard for a lot of people. If you expended a lot of energy and didn't look after your health 100% in your youth (as most people don't, let's face it), that's often the age when it suddenly starts catching up with you. It's also the age where you're moving into a new stage of adulthood and starting to feel like \"I gotta get real\" about being responsible about life. That comes with its own set of challenges. That youthful carefree feeling of \"fuck it, I have heaps of time\" starts to fade. You become a lot more aware of the power of habit, as your habits or lack of habits start to catch up with you. \n\nAll I really want to say about this is that I think you're absolutely not alone in feeling this way. There's lots of advice out there on habit forming and the like, I won't rehash that for you, I just want to say to be patient with yourself and just keep trying. Try not to be too hard on yourself, no matter the number of times you fail at implementing the good habits, the important thing is that you keep trying. If you keep trying consistently eventually something will stick and suddenly it will get a lot easier. Work on your health. \n\nI'm 28 and I'm just recently feeling like I'm finally almost free of a depressive feeling about life that's been hanging around since I had a major energy crash / depressive episode shortly before I turned 25. I've managed to change/implement some key habits - I'm still working on it - but as a result my confidence and energy is coming back. I would say just don't lose hope that things will get better. And do think about therapy if you can. Depression can affect sex drive, or some people just have a naturally low sex drive and that's fine, but you might have some unresolved issues to work through. ", "permalink": "/r/DecidingToBeBetter/comments/3ecbgw/how_do_i_get_out_of_this/cteak81/"}