{"id": "t5_2tand_t3_3ecbgw_t1_ctdqvcm", "creation": 1437681671, "origin": "t5_2tand_t3_3ecbgw", "height": 1, "replied_to": "t5_2tand_t3_3ecbgw", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mnemoniker", "text": "First of all, you have plenty of time to turn things around. As a friend once told me, you spend your 20s learning, and your 30s earning. And learning isn't just school. Learning is growing up, figuring yourself out. While it's a bit crass, it's something I needed to hear at the time. But just because you are still young, that doesn't mean you should wait to change. Change now while the iron's hot!\n\nThere are a few books I've read that have helped, and I strongly recommend you do as well:\n\n* [Start with this](http://waitbutwhy.com/2013/10/why-procrastinators-procrastinate.html) to clarify what's going on in your mind and get you pumped about changing\n* **Getting Things Done**. Teaches you how to make the most of your days (and beyond) with to do lists.\n* **The Feeling Good Handbook** OR **The Now Effect**. Teaches you how to fight the illogical, bad thoughts that are sabotaging your mental wellness. The latter teaches you how to rein in your focus as well. The former is the best substitute for counseling I've ever read. Heck, maybe you should read both.\n* **The Power of Habit**. How habits are formed and how to break free from them and start new ones. Bonus: you only really have to read the first third because most of it is about organizational behavior.\n* **10% Happier**. A biographical manifesto on the benefits of mindful (read: stripped of religious mumbo jumbo) meditation.\n\nWhen you read these, I strongly urge you to highlight the important bits. The main problem with self help books is you finish reading them and then resume your normal life as scheduled, nothing learned, nothing embraced. Self-help concepts don't stick with you like a tattoo. They are written on your body in marker, and will disappear soon if you don't revisit the concepts frequently. So read these books on an e-reader that lets you export your highlights if you can (I read things on Moon+ Reader for Android, then export them to OneNote for further distillation). Or type them up when you are done. Then clean up your notes to give yourself a nice little bullet-pointed synopsis that will remind you what those books are about whenever you forget. Now that I am on the To Do List system, every morning one of my first to do's is to revisit one highlight from these books, almost like a passage from The Bible, because they're that important.\n\nAfter all this, now that you're practicing getting things done, positive thinking, controlling your habits, and mindfulness, you are in a position to change. You're halfway there. All that's left is the secret to achieving:\n\n1. Set a goal, no matter how big or how small\n2. Write down the goal\n3. Break down the goal into discrete, achievable steps\n4. Start with step one, and expand it to a list of tasks. Enter these tasks into your daily to do list. Parse them out over multiple days if necessary, and be realistic.\n5. When you finish a task, pat yourself on the back and move on to the next task. When you finish a step, pat yourself on the back and move on to the next step. When you finish a goal, pat yourself on the back and move onto the next goal.\n\nDo at least one task per day, no matter how small. If you are having trouble doing them then the tasks are too big and must be broken down further. I'm not saying it's easy, not at all! But that's the blueprint.", "permalink": "/r/DecidingToBeBetter/comments/3ecbgw/how_do_i_get_out_of_this/ctdqvcm/"}