{"id": "t5_2tand_t3_hrdk07_t1_fy62s39", "creation": 1594836784, "origin": "t5_2tand_t3_hrdk07", "height": 1, "replied_to": "t5_2tand_t3_hrdk07", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "gnolnalla", "text": "> It goes without saying that all mental illnesses are neurologically instantiated, but this says nothing about their causation. If it is true, for instance, that depression is constituted by low serotonin levels, what still needs to be explained is why particular individuals have low levels of serotonin.\n\nThis quotation by Mark Fisher (from \"Capitalist Realism: Is There No Alternative?\") is relevant. It's nonsensical for a person to be depressed without their physiology reflecting that - as far as anyone can tell, mental illnesses are \"neurologically instantiated\". I think that what Dr. Burns is saying with that 16% number is the same thing that Fisher is saying here: the physiological effects are generally caused by something else rather than being the initial primary cause.\n\nBurns wants to talk about cognition, behavior and small scale environmental factors, whereas Fisher wants to talk about larger scale environmental factors (namely, capitalism), but they both seem to be pushing back on the narrative that says \"ope, this brain is just no good, that's why you're mentally ill, other factors outside of that aren't relevant so take these drugs to address the physiological symptoms in your brain\". \n\nI think they are both right, but it's also still important to emphasize that mental illness is as legitimate as other health problems, and \"there are measurable brain differences\" seems to help with that. There's still a lot of stigma against anything mental health related; that's still a bigger problem (by far IMHO) than the problems caused by focusing too much on brain physiology*.\n\n`* which, to your point, I think the top level comment does`", "permalink": "/r/DecidingToBeBetter/comments/hrdk07/quit_social_media_drugs_alcohol_video_games/fy62s39/"}