{"id": "t5_2tand_t3_pwihvl_t1_hei4kqr", "creation": 1632769056, "origin": "t5_2tand_t3_pwihvl", "height": 1, "replied_to": "t5_2tand_t3_pwihvl", "down_vote": 0, "up_vote": 53, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "queenie3087", "text": "Will readily admit that I did not read all of the post. HOWEVER, OPs use of the word introvert caught my attention. Introversion is not being shy. You cannot tell yourself you’re an introvert and become one, anymore than you can tell yourself you’re an extrovert and become one. \n\nThe difference between introverts and extroverts is where they get their energy from. \n\nMyth: introverts are shy and extroverts are outgoing. \n\nReality: There are outgoing introverts and shy extroverts. \n\nCheck out this list of successful introverts\n\nhttps://www.inc.com/john-rampton/23-amazingly-successful-introverts-throughout-history.html\n\nIntroverts get their energy from doing things on their own or with someone very close to them. When they have to do things with other people, it takes more energy from them to do it. It has NOTHING to do with how well they socialize. Many of you will have heard someone say after a group get together, “I’m going to need a few days/week to recover from that”. That’s introversion. \n\nExtroverts get their energy by doing things with other people. When they have to do things on their own, it takes more energy from them. They may be able to do things very well in their own, but they still need to replenish their energy afterward by doing things with other people. \n\nLastly, introversion and extroversion are on a spectrum. Very few people land at the extremes. Most people land nearer the middle or leaning one way or another. There is no such thing as an ambivert, although the term is quite popular. I used to call myself an ambivert but learned that I was an introvert that ran near the middle of the spectrum. This means that it doesn’t take as much energy to do things with other people and sometimes I even get energized from it. But more often, it does take energy from me. \n\nFor more information check this out \n\nhttps://www.prevention.com/health/mental-health/a24068521/introvert-vs-extrovert/\n\nAside from that (again admitting I didn’t read the whole post), I agree that our use of words is incredibly impactful. We become what we think and say. If you want to be something else, we need to start with our language about it. 😊", "permalink": "/r/DecidingToBeBetter/comments/pwihvl/if_youre_deciding_to_be_better_start_with_this/hei4kqr/"}