{"id": "t5_2tand_t3_8osyyv_t1_e06t0ec", "creation": 1528254799, "origin": "t5_2tand_t3_8osyyv", "height": 1, "replied_to": "t5_2tand_t3_8osyyv", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "shibobcat", "text": "You can do everything possible to mitigate perceived problems and still feel like nothing is working. My therapist told me this story, which when I googled the catchphrase, found it as told by Gregory K. Jones:\n\n“Apparently, once the English had colonized the country and established their businesses, they yearned for recreation and decided to build a golf course in Calcutta. Golf in Calcutta presented a unique obstacle. Monkeys would drop out of the trees, scurry across the course, and seize the golf balls. The monkeys would play with the balls, tossing them here and there. \n\nAt first, the golfers tried to control the monkeys. Their first strategy was to build high fences around the fairways and greens. This approach, which seemed initially to hold much promise, was abandoned when the golfers discovered that a fence is no challenge to an ambitious monkey. Next, the golfers tried luring the monkeys away from the course. But the monkeys found nothing as amusing as watching humans go wild whenever their little white balls were disturbed. In desperation, the British began trapping the monkeys. But for every monkey they carted off, another would appear. Finally, the golfers gave in to reality and developed a rather novel ground rule: __Play the ball where the monkey drops it.__\n\nAs you can imagine, playing this unique way could be maddening. A beautiful drive down the center of the fairway might be picked up by a monkey and then dropped in the rough. Or the opposite could happen. A hook or slice that had produced a miserable lie might be flung onto the fairway. It did not take long before the golfers realized that golf on this particular course was very similar to our experience of life. There are good breaks, and there are bad breaks. We cannot entirely control the outcome of the game.”\n\nWhen I get a bad break, I try not to get into what Hyperbole and a Half calls a Sneaky Hate Spiral. In that case, my therapist would say, “Get off the bus.” Bus routes are normally run on a loop, and you’re free to get on and off whenever/wherever you’d like. Pay attention to when you feel yourself get stuck on the damn pessimism bus and get off.", "permalink": "/r/DecidingToBeBetter/comments/8osyyv/two_questions/e06t0ec/"}