{"id": "t5_2tand_t3_kquu9c_t1_gi6biv1", "creation": 1609851382, "origin": "t5_2tand_t3_kquu9c", "height": 1, "replied_to": "t5_2tand_t3_kquu9c", "down_vote": 0, "up_vote": 31, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kirschwurm", "text": "Sorry you have to deal with anxiety and depression, it's especially hard during Covid. \n\nWhile I was reading your post, I was asking myself why you would go to the gym if you don't enjoy it! There are 10000 different ways of staying active, it doesn't have to be the gym. Staying active is something that you do for YOU, not for anyone else so you can be incredibly self-indulgent and do whatever you really want to do. \n\nSomething that has helped me tremendously is setting goals that are not just \"go to the gym x days of the week\" or \"having a six pack\" and instead set skills best goals, like \"being able to do a handstand\" being able to run 30 mins without stopping\" etc. Your goals might look entirely different, but they're very specific while still allowing for some flexibility or even some laziness. \n\nTo give you an example, I've been doing the Couch to 5 K since early October, which has been 13 weeks. I'm still on week 8, but that's fine because in the beginning running 90 secs was hard and now I run 25 mins without stopping. I've also been doing a lot of online barre and ballet classes for strength and flexibility and my fitness have slowly been improving even though there were some \"slacker\" weeks. \n\nIt's important to keep in mind that anxiety and depression are mental illnesses that affect all parts of your life negatively. You wouldn't expect someone with a knee injury to run marathons, so be kind to yourself and take baby steps. A brisk walk gets the heart rate going, 10 squats after going to the toilet are better than 0 squats, and 1 push up is the first step on the way to 50 push-ups.", "permalink": "/r/DecidingToBeBetter/comments/kquu9c/i_stopped_going_to_the_gym_because_anxiety_and/gi6biv1/"}