{"id": "t5_2tand_t3_l117fj_t1_gjz2kat", "creation": 1611168958, "origin": "t5_2tand_t3_l117fj", "height": 1, "replied_to": "t5_2tand_t3_l117fj", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ladyinblack27", "text": "Thank you so much for your words , I love mental hugs. It wasn’t my grandma that I was close with, actually she lived 8 hours away growing up, it was my brother from another mother;  he showed up at my house one day with toxic brother, and never left like a few kids because our house was “safe” for them. \n\nHe stopped my toxic brother for beating me, every change he could get. When he wasn’t at our house we talked on msn about life, dreams, escaping that town,  but mostly music. He died a year later a few months after saving me from a suicide attempt. He was an incredible person who was put in a really shitty place but he got sent to live with his bio father for a while. Got sick one day while his father was working a double and fell asleep, he was diabetic and couldn’t get up to take his insulin. I am resilient because I lost everything the day he died, my protector, my best friend, my coping mechanism. I got someone to boot me alcohol so I spent the next 7 months drunk constantly and then I went to band camp and decided to get sober.\n\nI realized he never would have wanted me to grieve like that for sure. He wouldn’t have been on my ass about drinking actually and being angry. He would have wanted me to live better than he did, he didn’t get the same opportunities as me or and always said to go to uni because I could be somebody.  It was a really hard week getting sober while trying not to shake too much so I could play my part. At camp I realized I wanted to believe I’d see him again some day. And when I do I want to sit down and tell him incredible stories of adventure  that he inspired me to live. I live a little extra each day in his memory even if my depression didn’t want me to. \n\nI am the incredibly interesting person with an over abundance of compassion and kindness for life because if him. Thinking of him got me through the worst times, but I held true because sometimes you gotta baton down the hatches to get through the storm to see a sunny day. He gave my the grit it took to do a fuck ton of things people said would be impossible for me. His life and memory have made me the human I am today. \n\nI only got to know my grandma  more because I ran away at 15 and wound up only 1 hour from them, so I got to spend so much more time with her. She made me the woman I am, but that’s only part of my identity.  She taught me all the things I didn’t think I wanted to know. Cooking, baking, sewing, knitting.. but these things have helped me get through adulthood so far and her kindness inspires me daily to be more like her. \n\nDeath has given me a huge gift of perseverance and grit but taken the 2 people who looked into me and seen how kind I could be to the world then gave me the tools to show that kindness.. I live a little extra every day for my brother, kicking myself through depression states to do things instead of sleeping. To talk to random strangers, and my grandmas lessons taught me to not only talk to strangers but buy them coffee and hear their stories and treat them with honest respect. My brothers death (and a few other friends) forged me to be able to run away from a small town life, my grandmas heart made sure I would keep my eyes and heart open to see how incredible the world can be.", "permalink": "/r/DecidingToBeBetter/comments/l117fj/i_thought_i_used_reverse_psychology_on_my_mom_to/gjz2kat/"}