{"id": "t5_2tand_t3_qf3fh1_t1_hhxymsv", "creation": 1635131049, "origin": "t5_2tand_t3_qf3fh1", "height": 1, "replied_to": "t5_2tand_t3_qf3fh1", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MattTheMentor", "text": "I am glad it was helpful, and happy to provide book recommendations. A high level summary of my personal philosophy is \"There's certain things humans need and certain things that make humans miserable due to our evolutionary path. Those needs aren't up to us, but the better we understand them the more we can get out of life.\" These books help guide the understanding of our human needs so you can meet them yourself instead of relying on religion.\n\n&#x200B;\n\n**The Book of Joy** by the Dalai Lama and Desmond Tutu\n\nWhile this book is written by two religious figures, it's actually the common wisdom of two people from different religious backgrounds that gives it the most credit to me. They both see compassion, gratitude, and close friendships as essential for humans to enjoy life, and the fact that they both feel that way motivated me to apply these more. The audiobook version has endearing recordings of both and the ideas in this book made my life significantly better in many different ways.\n\n**Philosophy**\n\nThese all have incredible wisdom which can be applied without any supernatural assumptions, and are very practical support systems I lean on heavily\n\n* Meditations by Marcus Aurilius\n* Tao Te Ching by Lao Tzu\n* Awareness by Anthony de Melo\n* How to Solve Our Human Problems  by Kelsang Gyatso\n\n**Origins of Virtue** by Matt Ridley\n\nHumans live in groups, and organization/pro-social behavior is critical for the survival of the group (and for members to get along and benefit each other). This book tells this story with a lot of data and helped me understand \"why many religions recommend the same behavior, often virtues that benefit a group but more importantly benefit the individual too.\" When you start to see yourself as a member of a incredibly interdependent group, you can let go of moral ideas based on the wellbeing of any one individual. Said differently, \"good\" and \"bad\" in our society is more about the best interest of the group rather than it is any one person. The values individuals are raised into are the operating system that makes the machine run smoothly. That's not a bad thing, but you need to understand why those values sometimes feel wrong and you need to set boundaries with society. This is a pretty academic book, so should play well with a rational mind.\n\n**Religion for Atheists** by Alaine de Botton\n\nThis book describes itself as \"All the things secular people should steal from religion.\" It's a bit snarky but makes great points that certain things are essential for human happiness, and even though religion packages it up conveniently we can seek those things in a secular way without adopting all the supernatural aspects.", "permalink": "/r/DecidingToBeBetter/comments/qf3fh1/learning_to_believe_that_the_universe_is_kind/hhxymsv/"}