{"id": "t5_2tand_t3_oll3ow_t1_h5gq9d1", "creation": 1626482860, "origin": "t5_2tand_t3_oll3ow", "height": 1, "replied_to": "t5_2tand_t3_oll3ow", "down_vote": 0, "up_vote": 12, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Dontinquire", "text": "I will channel the spirit of the very much still alive Brene Brown for your benefit. I'm gonna break some shit down for you real quick. There are 2 things you should be aware of as it pertains to regret.   \nGuilt.    \nShame.   \nGuilt is good! Shame is bad! Easy, just saved you years of therapy. Guilt is 'I did a bad thing or things'. Shame is 'I did a bad thing or things and I AM bad because of it'.    \nGuilt can be productive. Shame can only be destructive.    \nDevelop a resiliency to your shame. Learn to resist that negative self talk. Here's what you should be saying to yourself 'I fucked up' rather than 'I am a fuck up'.     \nContrary to what your brain might be telling you, you are not just 'what you do/did'. You are a whole and complete person and there is so much more to you than 1 or 2 or 100 a actions you have taken.   \nAnother baller quote I love... \"Forgiveness is giving up all hope for a better past\". Forgive yourself and move forward. Because if all you do is despair and feel ashamed, you're just deciding to keep repeating the behaviors you regret in the first place.   \nHere's some original advice from me directly. You have fucked up. So what are you going to do about it? Sit around and allow your failure to define you? Or are you going to boldly dare to not only BE different but more importantly BELIEVE differently about yourself? Don't waste your life looking backwards and seeing failure and never daring to turn your head forward and embrace what you might do next. Don't be like my brother. Be better than the past versions of yourself, accept him, love him, and move forward to somewhere better. If you have any hope of showing acceptance/forgiveness/empathy to others then you absolutely must show it to yourself first. Be the version of yourself Mister Rogers envisioned. Not just toward everyone else but toward yourself as well.   \nThanks for coming to my TED talk.", "permalink": "/r/DecidingToBeBetter/comments/oll3ow/i_regret_my_past_and_it_kills_me/h5gq9d1/"}