{"id": "t5_2qh5i_t3_9lqoqj_t1_e7a17vf", "creation": 1538841577, "origin": "t5_2qh5i_t3_9lqoqj", "height": 1, "replied_to": "t5_2qh5i_t3_9lqoqj", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Sreyglo", "text": "Were you there as a tourist? I think it’s a completely different vibe when you live there! I loved my neighborhood, and the people in it...my sweet and thoughtful landlady, my fresh coconut lady who always picked out a coconut just how I liked it, the coffee cart on my corner run my two giggling sisters, the cobbler who fixed all my shoes for 50 cents a piece. I adored my regular Tuktuk drivers who would pick me up from anywhere in the city at all hours of the night, and always wait by my gate until they were sure I was inside safely, or pick me up from the airport with a big smile and excited wave. I loved getting my hair washed and scalp massaged for a dollar at the market. I loved wondering through the local markets and being surprised at the the obscure things you can find—I once found a stall that sold only glitter!! All the cheap delicious local food, but also incredibly affordable and high quality western food that you could enjoy in funky, stylish restaurants. I loved all the cool little bars with generous happy hours on top of the already cheap prices, and I enjoyed the fun nightlife. I loved all the beautiful pools dotted around the city that are  either set in a lush garden oasis that makes you forget you’re in a noisy city, or on a rooftop with a city view where you could lazily  wash the weekends hangovers away.  I liked that movies only cost $4-$7 and I saw more 3D movies than anywhere else I lived. I also liked that when you needed a break from the noise and chaos of PP you could easily escape to Kep or Kampot for nature and relaxation! Or if it was a bigger city you were after, you could be in Bangkok or KL in an hour. I did find it a bit sad that I was not able to connect with the majority of locals on a more than shallow level because of the language barrier, however I met a lot of interesting young expats from all walks of life. I particularly liked meeting Cambodians who had grown up overseas—mostly France, Australia, New Zealand, and the US (as their parents had fled during the war) but  has decided to move back and start up different businesses in Phnom Penh! I could go on but I think I’ve rambled enough! Of course there were things I didn’t like, but the positives far outweigh the negatives and I feel so lucky to have lived there when I did! ", "permalink": "/r/happy/comments/9lqoqj/my_mom_is_one_of_the_hardest_working_individuals/e7a17vf/"}