{"id": "t5_2tand_t3_iz7raj_t1_g6k0kg5", "creation": 1601055919, "origin": "t5_2tand_t3_iz7raj", "height": 1, "replied_to": "t5_2tand_t3_iz7raj", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "erinpanzarella", "text": "Hi there! I’m going to copy and paste something I messaged out to someone asking a similar question! \n\nMeditation is often such an illusive concept but it is very simple. I started off in the beginning just taking a minute or two first thing in the morning sitting upright in silence and noticing my breath. We often think that if thoughts arise in this time that we’re doing something wrong but I’ve heard time and time again even the most masterful meditators have thoughts! We’re human after all :) it means our brain is working! After sometime I increased the increments from 1 minute to 5, then 10 and beyond. \n\nI use the app insight timer for my guided meditations that a person speaks in the background and guides you through a visualization or introduces a mantra in which you silently repeat. I believe insight timer is still free (although there is a paid version that I use) where you can both time your meditations and find tens of thousands of different guided meditations of different lengths for anything you want. My favorite on insight timer is Davidji who is well known for mantra meditation- they are often 15-40 mins in length so I recommend that down the road. There are so many meditations you can sort by length (some for 1 minute- all the way up to hours (I do the very long ones sometimes before bed and fall asleep to them as our brain still absorbs the content while sleeping). If you find it hard to carve out time then I recommend before/during sleep OR you can choose by section (like sleep, stress, happiness, grief, anger, enlightenment). There’s so many options and I find the key is making the time yours- seeing what works and what doesn’t. \n\nHope this helps!", "permalink": "/r/DecidingToBeBetter/comments/iz7raj/i_missed_meditating_for_a_day_and_instead_of/g6k0kg5/"}