{"id": "t5_2tand_t3_pm89om_t1_hchhvxh", "creation": 1631396941, "origin": "t5_2tand_t3_pm89om", "height": 1, "replied_to": "t5_2tand_t3_pm89om", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "cr994", "text": "Hey!   \n\n\nSo i totally get this and am very similar. I struggled a lot in relationships and my ambitions (in previous relationships, i was managing a full-time job, a side business, writing a book and teaching, so I really struggled to be present). I would try to ask what's at the root of the over-work. Is it anxiety about 'failure' ? For me, I know a lot of what I did came out of a fear of not being able to be a provider for the future - I knew that I needed a fair amount of income if i wanted to buy a house or be able to raise a child, look after my parents when they hit old age etc. And so it didn't feel like i was putting my ambition \"above\" my partner, but setting the conditions necessary to be present and give love.  \n\n\nIn reality, I think I was catastrophising, and so I decided to be more strict with myself and assess how i use my time. So for example, if i was spending 4 hours writing, I broke down what i was doing, realised i was wasting a good amount of time 'researching' and then reduced it to 2 hours. I found that those 2 hours were more than enough to get the bulk of it done. I also planned my week to include gaps where it would just be family time or relationship time, which was non-negotiable. When i set those blocks in place, and planned things around that, I found that I could still do most things.  \n\n\nIt is really hard - because to do this requires a big shift in mindset and an acceptance that you have limitations, and that those arent just about physical performance, but also, your obligations to the people you love, and human relationships that can't be applied to standard productivity metrics. But I think it really does help.  \n\n\nFinally, I would be honest with your partner about this and let them know youre struggling, but you still love them. It may be that she can really help you see the bigger picture that perhaps you can't and allieviate the fears that often lead us to getting lost in our work.", "permalink": "/r/DecidingToBeBetter/comments/pm89om/how_do_i_24m_balance_being_very_ambitious_and/hchhvxh/"}