{"id": "t5_2tand_t3_kodv07_t1_ghqee36", "creation": 1609521145, "origin": "t5_2tand_t3_kodv07", "height": 1, "replied_to": "t5_2tand_t3_kodv07", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "gigachadhd", "text": "I get satisfaction from career accomplishments and appreciate how my work allows me to learn new things but it is not pleasurable except the times when I actually am doing the work activities that I enjoy, I’m a software developer so that’s when I’m coding.  The time at work I spend in meetings and doing administrative stuff is not pleasurable.  I’d estimate probably 50% of the time is not pleasurable on average.\n\nAny time I spend on my side business, which I’m counting in the total hours I spend on work activities, is not pleasurable all of the time - although the ratio is probably more like 60-70% pleasurable or meaningful for my side business.\n\nI’d estimate I work 70+ hrs on average between the two jobs per week.\n\nI’m in the US.  I appreciate you and I hear what you are trying to say.  My hobbies and my family are as important to me as career and money.  But I consider trying to uplift my family’s financial situation and provide for my kids as part of being a good father.  \n\nAlso I am well aware of my history of - patterns of workaholism and long hours inevitably leading to a crash of some kind that erases any progress that I have made.  For instance a few years ago I experienced some medical problems and had an operation that looking back were most probably linked to my stress, this set me back a lot in several projects at work and was a big factor in why I left that particular job.  I’ve also had experiences where my relationships were negatively affected by my workaholism.  That is why I am asking this question.  I want to establish a schedule that will enable me to make steady and sustainable progress with my career and side business while maintaining balance in my personal life and relationships.  I have not been able to do this on my own and I honestly don’t even know what that looks like for me.", "permalink": "/r/DecidingToBeBetter/comments/kodv07/how_much_downtime_does_a_person_need/ghqee36/"}