{"id": "t5_2tand_t3_kodv07_t1_ghqp6ot", "creation": 1609525170, "origin": "t5_2tand_t3_kodv07", "height": 1, "replied_to": "t5_2tand_t3_kodv07", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AshOrMania", "text": "I see what you're saying in your post below and here, and I think you're totally right that this is a destructive cycle. The thing to focus on here is that the activities you're doing aren't harmful, you're doing your best to solve some kind of problem. So what's the problem? Or what are you trying to solve? That is to say --\n\nYou seem like a guy with many talents and not enough time in the day. You have a job plus a side business, are good enough at your hobby to be doing something with it (most guys I know who mess around on the guitar don't put out albums or singles), actively pursue your interests intellectually, set goals for yourself, etc. You know when you need help and reach out to try to get it. You have a family and you want what’s best for them. I’m sure they love you and want to spend more time with you, and your wife/partner/whoever must think you’re incredible for all these traits and more.\n\nI think you need to take some time with yourself and think about what your priorities are. There's not enough time in your lifetime to do all the things you personally are capable of doing, unfortunately. You just have to choose the things that are most important. You can't max out all your stats in every skill you ever acquire, you have to pick a player class and go with that, you know?\n\nThe problem I'm talking about is, what's going on underneath? Like what's driving this? It’s okay not to achieve 100% of everything all the time. What will it say about you if you don’t put out a new single? Or what does it mean about you if you lie around on the couch all day one Sunday? Or what kind of person are you if you just meditate to unwind rather than researching the Buddha? The answers to those questions are where you have to start. \n\nMy guess is that you’re afraid of those answers and you’ve been working tirelessly, probably for most of your life, to avoid them becoming true. I think that’s the root.\n\nThis is your life though, and you get to pick who you want to be and what you do with your time. That’s the ultimate gigachad move and fuck you to everyone else, you don’t have to play by anyone’s rules or achieve anything that you don’t personally feel like achieving, even if you could.", "permalink": "/r/DecidingToBeBetter/comments/kodv07/how_much_downtime_does_a_person_need/ghqp6ot/"}