{"id": "t5_2qh5i_t3_aleviw_t1_eff5dgw", "creation": 1548914185, "origin": "t5_2qh5i_t3_aleviw", "height": 1, "replied_to": "t5_2qh5i_t3_aleviw", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Evelyn1225", "text": "Hi. \nI’m in your mom’s situation \nI’m a foreigner. I didn’t have a job when I have my son. My son’s father slept with a hooker 10 days after I give a birth. He thought I would put up with him since I don’t speak good English \nI argued for custody for over 2 years. I spent so much money on the lawyer. \nAfter I left him I become a mental health counselor, now I’m doing social worker job. \nI did join custody with him for almost a year \nDuring that time. He took me to court every month. Called ACS on me every 3 month.  I was paying 88 dollars a day for daycare. \nHe thinks the daycare was torture my son! All daycares are torturing babies. Even I picked the most expensive one in my area. \nTo let him leave me alone I didn’t ask him for any support. I used to work 15 hours a day to pay for everything. \nI was mentally exhausted. \nHe doesn’t have a job but having 3800 a month from disability. He had the time to take me to court and causes trouble in my life. \nLast year in July for some reason he sued me 3 times in 2 weeks. \nI was stressed out because of my relationship issues and my son’s father and work \nI didn’t know how to handle it. \nAt that point I just want to leave New York \nI decided to give him custody. Otherwise He will use my son against me for next 16 years( my son was 2 years old)\nI don’t want ACS worker take off my son’s clothes to check his body whenever they start a case. \nI don’t want his father takes him to the ER whenever I return him back. \nThat’s not good for my son’s mental health. \nI said ok. You can have the full custody \nI was crying and signed the paper. \nI agreed to give him 17 percent of my income. \nI was willing to show him my W2. \nI just want him to stop taking me to court. \nHowever. He decided to take me back to court again. \nLast week. I was in court for child support . \nJudge asked him why don’t you get a job. He said he choose to take care of my son full time \nJudge said: he needs to interact with other kids. \nHe said: he doesn’t trust any daycare. \nJudge rolled her eyes. \nHe was mad after the court. The Judge only ordered 400 a month for support which I offered 600. \nHe told me he will take me back to court for education fee soon. \nI still visit my son every sat. New York is so expensive, I have to work on Sunday as well. I take him to indoor playground and have a nice lunch before I return him back \nI keep telling him I love him so much. I kiss him a lot. \nI buy him toys whenever I see him. \nI’ve tried my best. \nI live in this country without any Family members. \nMy son’s father still sending me nasty emails to show me he is in charge \nI ignored it most of the time or reply him one word”sure” \nWhen I left his father he didn’t have a job. \nNow he is the same. \nI’m not saying I’m so awesome but I’ve tried the best to reach where I am. \nI want my son to be proud of his mother one day. \nI want him to know that I will be here for him no matter what. \nHe is 3 now. He is lovely and he loves his mother. \nHis father wasn’t nice to me but he is nice to the son. \nI don’t hate his father at all. I won’t say anything bad about him. I want my son to learn how to love. \nI know he is safe and mentally ok. \nWe all learning from life. I give up and let it go not because I don’t love him. \nI love him. I want him to stay in a stable place and  be happy. \n", "permalink": "/r/happy/comments/aleviw/i_went_from_living_with_my_dad_and_his_stripper/eff5dgw/"}