{"id": "t5_2qh5i_t3_2k3zqf_t1_clif2ju", "creation": 1414151287, "origin": "t5_2qh5i_t3_2k3zqf", "height": 1, "replied_to": "t5_2qh5i_t3_2k3zqf", "down_vote": 0, "up_vote": 11, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "I_Conquer", "text": "Right... so first things first: congrats!\n\nSecondly, this is a common misunderstanding. In much of the world, \"American\" means \"from the Americas\" which includes North, Central, and South America, whereas Canadians and Americans, somewhat distinctively, call people from the USA \"American\" and people from North America or South America \"North American\" or \"South American\".\n\nThe confusion, of course, is that there's no simple term for someone from the USA. A person from Berlin might be correctly identified as a Berliner, a German, and a European and this would all be relatively straightforward. A person from Little America, Wyoming, USA will have a tougher time being so clear.\n\nNow Canadians and Americans are no doubt thinking that this would be clearer if everyone adopted their system. And in some ways that's true, *except* that the majority of people who *we* call \"South Americans\" or (somewhat wrongly, interchangeably) \"Latin Americans\" tend to self-identify as \"American\". So where Canadians (like me) get sort of put out when you call us \"American\" (much like saying someone from New Zealand is Australian or a Scot is English, etc.), someone from Brasil might get upset, equally understandably, when someone from Canada or USA tries to explain to them that they *aren't* \"American\" (\"... because that's someone from the States, d'uh\").\n\nThis is not a new problem and not one that will be solved any time soon. Might as well have a laugh about it.\n\n---\n\nThe upshot is this: if any of you people are from someone other than Canada or USA and in the tourism industry, a great way to increase tips is to ask someone who appears to be from the USA if they're Canadian: Canadians will be impressed that you can 'tell' the difference and people from the USA will think it's cool that you think they're friendly or exotic (or, more likely, won't care).", "permalink": "/r/happy/comments/2k3zqf/in_2012_one_of_my_best_friends_asked_me_to_be_his/clif2ju/"}