{"id": "t5_2tand_t3_pj221w_t1_hbxlf49", "creation": 1631023829, "origin": "t5_2tand_t3_pj221w", "height": 1, "replied_to": "t5_2tand_t3_pj221w", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "dogislife420", "text": "I totally understand where you’re coming from. I’ve had similar feelings and experiences with my friends when they get into a relationship. It‘s hard to accept that the person you put first in your life isn’t doing the same with you anymore. However, I wouldn’t take this personally. Starting a new relationship is exciting but also time consuming. You become infatuated with the person and at the same time you want to prove that you’ll be a good partner. If you had started a new relationship and your partner was constantly on their phone and computer talking to other people (even if it’s just a friend), you might assume the other person isn’t as invested in the relationship as you are. \n\nAlso, at least in my experience, older adults and parents aren’t hanging out with their friends nearly everyday like us younger people do. They have partners, jobs, and other adult responsibilities which can make it difficult to keep up with friendships. Your friend is growing up and taking on bigger challenges and trying to figure out the future they wants for themselves. Unfortunately, they won’t have as much time for you as you do for them but that has to be ok if you want to continue to possibly have her in your life at all.\n\nI’m sure  they do want to talk and play games but they’re caught between wanting to make you and their new partner happy. They say yes to hanging out and then “forgets” because they want to spend time with their new partner as well and doesn’t want to say no to them in the moment. Even though they are being a bit rude, with my friends I usually try to be the bigger person, and I tell them to let me know when they want to hang out so I’m not the one sticking my neck out all the time. They might also feel internal guilt by talking to you because you both had feelings for each other at some point and they doesn’t want new partner to get jealous, but that’s just speculation. However, even though you might not be in her life as much as you’d like, you’ll always be the person who helped them during a confusing part in their life and I guarantee they will always be thankful for that.\n\nAs far as trying to make the friendship work—I’ll usually send my friends a text along the lines of “Hey, I know we’ve both been busy and haven’t talked in a while but I still think of you and hope you’re doing well! Let me know if you want to hang out and catch up sometime.” Friendships change over time just as romantic relationships change over time. Yeah, it sucks and you’re allowed to be a upset that someone so important to you isn’t as close as they once were. I’ve felt the same way you do but it’s a part of life you have to accept. I know it’s hard to build such a strong connection and friendship but if you did it once, you can do it again.", "permalink": "/r/DecidingToBeBetter/comments/pj221w/i_feel_hurt_because_i_feel_forgotten_in_a/hbxlf49/"}