{"id": "t5_2tand_t3_miaxrz_t1_gt45nqt", "creation": 1617342301, "origin": "t5_2tand_t3_miaxrz", "height": 1, "replied_to": "t5_2tand_t3_miaxrz", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Moonlight-Rain", "text": "Know that you're not alone, I can relate to where you're coming from and there are many of us who feel similarly. With everything that's going on in the world it can leave you feeling as if it's falling apart - it's disheartening and soul crushing to say the least. There's some great advice in here - as one person suggested practicing gratitude can work wonders and there are various gratitude journal apps available if you decide to explore that further. If apps don't appeal to you, you can also try thinking of at least one thing you're grateful for everyday - say it outloud, in your head, or write it down; place it somewhere that you can look to regularly. \n\nAnother poster mentioned getting rid of Facebook and staying away from other negative communities and avoiding the news. Doing those things has helped to increase my own well-being significantly. In addition to the aforementioned, being aware of the people you surround yourself with. If you're often around people that are negative, bitter, and cynical - you may reflect that within yourself. Negativity can be mentally draining and it doesn't do any good for your well-being. \n\nTry to be the best version of yourself; continue growing and learning, be conscientious, practice kindness - both to yourself and to others. Help where you can, i.e. giving back to the community through volunteering (when it's safe to do so) or simply lend a listening ear to someone in need. \n\nDon't forget to take a little time to yourself each day doing something that uplifts you and brings you joy. If you are struggling, don't be afraid to reach out for help.\n\nConsider creating a vision board. Either virtually on a website like Pinterest or the old-fashion way using cardboard paper, markers and photos from magazines. Create a board that includes things that inspire you or uplift you. I personally find that utilizing my creative side relaxes and comforts me.\n\nHere on Reddit, reading subs like r/upliftingnews can be helpful as well. Although it may seem fleeting, there is still good in this world ♡\n\nSending you virtual hugs and well wishes.", "permalink": "/r/DecidingToBeBetter/comments/miaxrz/how_does_anyone_stay_optimistic_when_the_world_is/gt45nqt/"}