{"id": "t5_2tand_t3_p2btw4_t1_h8l9nlf", "creation": 1628720789, "origin": "t5_2tand_t3_p2btw4", "height": 1, "replied_to": "t5_2tand_t3_p2btw4", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "B6E9D", "text": "Hey OP if you want to talk, I think I can help. I do career consulting and planning and have worked with quite a few folks that were in pretty bad places. A mother who hasn’t worked for 16 years to take care of her dying husband, and people who have lost motivation throughout their careers. \n\nThe most important part is perspective. Everything has multiple “truths”. I don’t have much detail about your situation, but based on what you’ve said so far, I can think of the following:\n\nYou’ve changed majors 6 times, so you have a wide grasp of several industries\n\nYou’re creative - or at least have been - and that isn’t something you can ‘teach’ or ‘unlearn’. So I bet you still are creative. You just need some motivation.\n\nYou know how to write. And I mean that in the way of communicating an idea to reach an objective. You were once good at that. Again, that is not something you can ‘unlearn’ and that is a skill that many people who are working high positions don’t have. (Example 2 days ago I asked an executive when he had time to discuss some proposals that we received. His answer was “Yes.”) \n\nOne thing that gives me hope in terms of helping you is that you say everything you try you feel exhausted. What I hear is that at least you’re trying stuff. Whether you finish or make it to the end, we can help with that. But the hardest part is taking the first step, and it sounds like you’ve taken many ‘first steps’. I’m really happy to know that you haven’t given up yet. \n\nFeel free to reach out. My services are “free”. You can choose to pay whatever you want if it helps. All I ask in return is that I can use you as a success story to help others if we do end up working together", "permalink": "/r/DecidingToBeBetter/comments/p2btw4/nearly_30_years_old_and_i_still_have_no_idea_what/h8l9nlf/"}