{"id": "t5_2tand_t3_p2btw4_t1_h8laa37", "creation": 1628721068, "origin": "t5_2tand_t3_p2btw4", "height": 1, "replied_to": "t5_2tand_t3_p2btw4", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "double_chicken", "text": "My parents really wanted me to go to college, but I never thought it was for me. I tried and failed 3 times. I changed my mind twice before going back to construction. There are college courses I can take that would keep me in the field, but it’s not something Im interested in. In reality, college isn’t for me and it took me a long time to realize it’s okay. Not everyone needs to go to college. I think that too many people go to college for the wrong reasons and most are better off taking an alternative approach to entering the workforce. \n\nI can completely relate to being exhausted from everything. I’m constantly stressed out from work, wondering if I’ll have a job and can pay the mortgage in a month or year from now. Sometimes I’ll feel almost paralyzed  and can’t motivate myself to even was 1 dish in the sink. I think for this you have many options. I’m a terrible writer, but I love having a journal. I try to write a little bit every night and just use it to talk to myself. I write how my day went, what I want to achieve, any problems I have, etc.  \n\nYou can also try therapy. Just having someone to talk to and help put things in perspective can be a huge help. \n\nI think the biggest thing that helped me was when I started asking myself, “what’s stopping you?”  I keep asking that to myself until I can no longer come up with an answer. Most of the time the answer is either that I’m getting in my own way or a solution to my problem. \n\nAnyway, I’m 32 and I’m finally happy with my direction in life. It took me a long time to get where I am. I always hated that I felt I was behind my peers. I hated that I had to do X because that’s what my family and society expected of me. I’m on my own path now and I’m doing a lot better than I ever expected. It feels really good to say that. I hope you find what works through all these comments and things start to work themselves out.", "permalink": "/r/DecidingToBeBetter/comments/p2btw4/nearly_30_years_old_and_i_still_have_no_idea_what/h8laa37/"}