{"id": "t5_2tand_t3_p2btw4_t1_h8jk6lq", "creation": 1628695084, "origin": "t5_2tand_t3_p2btw4", "height": 1, "replied_to": "t5_2tand_t3_p2btw4", "down_vote": 0, "up_vote": 138, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Readinger31", "text": "I’m 32 and still have no idea. The difference between you and me is that I don’t place my self worth in a career or doing this whole adulthood thing perfectly.\n\nWe grow up learning that you have to do x, y, and z to be “successful”, to be happy; that there is a certain way to do things, and that anyone who doesn’t follow that way will be miserable and unfulfilled. In short, we’re taught that we have to be “perfect” by western capitalistic standards.\n\nGo for a walk through the woods and you’ll realize that nature doesn’t follow western capitalistic standards. It’s enough to simply exist here and now, as you are. That’s where happiness and fulfillment are.\n\nMaybe stop with the whole college thing and just work for a bit, even if it’s at a “dead end” job at a McDonalds. Get out of your head for a while. Explore some hobbies, get outside, try mindfulness meditation. \n\nSmile at people when you pass them on the street, give something to homeless people when you drive by them. Have a small positive impact on your immediate environment whenever you can; over time it’ll all add up to help give you clarity and peace of mind.\n\nPractice getting to know yourself deep down. Practice giving yourself compassion as if you were your own best friend in need of support, instead of constantly judging and blaming yourself. Judging and blaming get you nowhere and only make things worse, as you might be aware.\n\nAfter all of that, you still might not know what to do with your life in the future, but you’ll at least know how to live this moment well right now, and the next moment, and the next moment…", "permalink": "/r/DecidingToBeBetter/comments/p2btw4/nearly_30_years_old_and_i_still_have_no_idea_what/h8jk6lq/"}