{"id": "t5_2tand_t3_q18fov_t1_hfeif11", "creation": 1633382002, "origin": "t5_2tand_t3_q18fov", "height": 1, "replied_to": "t5_2tand_t3_q18fov", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "EP4D", "text": "Thanks for sharing openly first of all.  That takes a bunch of courage even if we don't see or know you.\n\n1. Don't overthink it.  You distanced yourself and are going through something very human.  Circumstances hit people differently.  What affected you others may brush off.  Have compassion and understanding for yourself first and foremost.  I'd recommend you initiate the conversation and be ready to divulge why you did what you did.  Any compassionate human being would understand your vulnerability and candor.\n2. How do we enjoy life externally if our internal world is in disarray?  I ask this because it sounds like there's not a whole lot of love/compassion if you're describing your internal world as a deep dark jungle.  As for the how, I'd start by reprogramming the brain, tearing down the negative pathways, and rebuilding new positive ones.  The way I did this was through a video that gave me 5 questions.  The video I'm talking about here is by a guy named Struthless called \"5 Questions That Changed My Life.\"  I literally have all 5 on a piece of paper to remind me constantly to look at life from positivity than negativity.  And it's actually biological.  If we start looking for positivity in our lives, our Reticular Activating System in our brain will show us more positive things around us.  And this is key because it's not that they weren't there, to begin with, they were always there except we never clued into it.  You'll suddenly see more positivity everywhere you go.\n3. Do you welcome yourself?  Do you feel you are welcome?  Our internal world dictates how we see ourselves in the external and who we want to bring out for society.  And remember the RAS I mentioned above?  How we think about ourselves will dictate the results we see.  Because if you say you're welcome, you're right.  If you say you're not welcome, you're also right.  Either way, you get to decide what you want your reality to be.    \nAlso, know that there are way too many circumstances to know the answer here, but we can't control others and their welcome-ness (if that's a word), we can only control ourselves.  Yeah, they might not welcome us but it ultimately shouldn't change the fact that we choose to be loving with ourselves.\n\nHope this helps and I know it was long but hopefully, you distill what you need from it!", "permalink": "/r/DecidingToBeBetter/comments/q18fov/what_to_do_and_how_to_proceed_with_my_life/hfeif11/"}