{"id": "t5_2tand_t3_oo14sk_t1_h5vwgxo", "creation": 1626795423, "origin": "t5_2tand_t3_oo14sk", "height": 1, "replied_to": "t5_2tand_t3_oo14sk", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "JMCochransmind", "text": "Look life is life and it is full of negative things that can keep you feeling like crap. If all you do is pick out the negative things to look at. I know exactly how you feel, I was so afraid of life in general I couldn't get out of bed most  days to even eat breakfast. I would shiver at the thought of going to the grocery store and being around anyone. Just because I was afraid I was failing at life and everyone noticed it. I took a class on meditation and mindfulness and it really changed my life. Look up mindfulness and try to find a weekly devotional or something to it. A lot of people don't believe in meditation and energies, but after the mindfulness got me to actually go outside and say I can do this, just going through my chakras and telling myself it's okay allowed me to be in situations and not be nervous about them. Looking back I probably seemed crazy, and I was for thinking like that. But we push on and find whatever will help us to keep going to find ourselves. Take a breath and tell yourself it's okay to just be okay. You don't need to be ecstatic all the time, and don't feel you need to or you will be depressed. We can't win everything and shouldn't fault ourselves if we fail, because we fail at a lot of things and that will keep us down. It is okay to just be okay. From there you can build on yourself and find paths that make you feel good and that get you further down the road of life. Keep applying to colleges. Take the A.C.T. again, try for a better score. Never be afraid of failing, if you don't fail you're not trying. Focus on what you do have and what is going right, but always remember, its okay to just be you. Good luck kid, I'm rooting for you.", "permalink": "/r/DecidingToBeBetter/comments/oo14sk/feels_like_life_is_blocking_every_step_i_take/h5vwgxo/"}