{"id": "t5_2tand_t3_q5zu77_t1_hgbie5n", "creation": 1634014080, "origin": "t5_2tand_t3_q5zu77", "height": 1, "replied_to": "t5_2tand_t3_q5zu77", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "LowRepresentative843", "text": "Hi OP ✌\n\nIt sounds like you are being self aware and really wanting to take control of your life & that is an awesome first step! \n\nI'm 23 & I have recently encountered the same issues of feeling alone due to outgrowing people and friendships/always feeling a bit different to everyone else. Learning to enjoy my own company was difficult but the best thing I have ever done.\n\nAt 21, I would definitely focus on friendships over having a partner as there is plenty of time for that still. I'm speaking from experience, as it is very easy to pour too much energy into your partner & romantic relationship, and if things don't work out then there is nothing left to fall back on and you have to start from scratch again.\n\nMy best advice would be to be brave and put yourself out there (I have recently done this with Bumble BFF) - focus on falling in love with yourself, building self esteem and work based on how the things you listed (meditation, working out, walking in nature, being creative etc) make you feel instead of how they make you look or appear to others. Do everything for yourself and nobody else. \n\nI can assure you, this will raise your vibration & good things will be attracted to you. The timing of your life may seem wrong but good things are coming and if you focus inwards on yourself, they will make their way to you sooner than you think. \n\nAlso, the way you speak to yourself or about your situation can make a huge difference. For example: Instead of saying 'I have no friends' 'I am unlucky with relationships' 'I am going to be alone forever' try saying 'I make space in my life for new people & relationships' 'I am loveable and deserving of good friends & relationships in my life' 'Loneliness is a blessing and gives me time to enjoy my own company & learn about myself'\n\nYou will always have yourself at the end of the day, so be your own best friend and treat yourself how you'd treat a good friend - with kindness, patience & love.\n\nHope this helps & all the best with your personal journey 💕", "permalink": "/r/DecidingToBeBetter/comments/q5zu77/i_wanna_learn_to_be_alone/hgbie5n/"}