{"id": "t5_2tand_t3_akgc2j_t1_ef5qjhm", "creation": 1548661044, "origin": "t5_2tand_t3_akgc2j", "height": 1, "replied_to": "t5_2tand_t3_akgc2j", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Zomni_83", "text": "I feel for you brother. At 35yo, I've been with my wife for 12 years. I'd be crippled if we ever parted ways. I've heard it takes twice as long as what you've been with someone to deal with the separation, so for me it'd be 24 years... \n\nWith that in mind, and assuming you'd been with yours for a long while, I'd suggest you make a proactive effort to instill some healthy habits as soon as possible. Start small and build slowly. The closer you get to your best version of you, the better equipped you'll be to deal with the loss, and create a meaningful life.\n\nSome key focuses; \n - Quality sleep (read \"Sleep Smarter\" by Shawn Stevenson - it's an easy read and is also in audio format of that's easier for you), \n - Exercise / Lift weights (YouTube ATHEANX, or Google is your friend.)\n - Meditation (read \"The Quiet\" by Paul Wilson, or use the \"Headspace\" app on Android or iOS)\n - Learn how to cook healthy, tasty food (I have no guide for this other than Google and experimenting - at least that's what I do!).\n\nLegit, life falls into place when you look after yourself. If you find you are struggling with depression or general poor mental health, seek professional help (start with a trusted GP, AND talk to a trusted family member or friend. Don't do this shit alone.\n\nThe mantra I used to crawl from my dark place was as simple as \"I deserve a good life\". Despite all the shit I'd been through and done, that was the feeling I could never escape. The hard part was figuring out what a \"good life\" meant to me - but as above; the better your overall health, the better equipped you are to figure that out. \n\nI hope it works out for you. ", "permalink": "/r/DecidingToBeBetter/comments/akgc2j/34m_i_have_no_idea_what_i_should_be_doing_with_my/ef5qjhm/"}