{"id": "t5_2tand_t3_akgc2j_t1_ef4pxw9", "creation": 1548630763, "origin": "t5_2tand_t3_akgc2j", "height": 1, "replied_to": "t5_2tand_t3_akgc2j", "down_vote": 0, "up_vote": 90, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lshifto", "text": "1. Find a counselor. A good one can offer advice and listen to what you have to say.\n2. Make lists. Write out what you like most about life, things, people, movies, kids, sports, all of the details that help you see who you are. It will help you recognize the things around you that make you smile. It will help you see the good parts of yourself. Keep a pocket sized notebook to make a list of 10 thankful things throughout the day.\n3. Exercise early every day. Early! Feel like you are getting stuck during the day? Drop and do 20 pushups or situps or jumping jacks or squats to clear your head and get your blood moving.\n4. Keep your hands moving. Seriously, keep them moving! If you are working on something, don't let them stop. If you are relaxing then find things to do with them that requires at least part of your attention. Want to watch TV? Juggle or draw or crochet or sharpen every knife in the house or disassemble something broken and try to fix it. You can get a surprising amount of things done while sitting around doing nothing. Be honest, watching the office for the 10th time doesn't require your full attention.\n5. Make your mom's life wonderful. Not all of us have our moms around and get the chance to see them every day. You want a job? Take over every chore in the house and keep that thing spotless. Find out what games she likes to play and make it a point to play a few hands or whatever a couple nights a week. Being a good husband starts with being a good son. Make the most of it.\n6. Get a haircut, find a new cologne (even just a small tester) and deodorant, and hit a second-hand store for at least 1 new outfit that makes you look good. Looking, smelling, feeling good and new can help you with the other changes.\n7. Volunteer somewhere on a regular schedule. It gets you out of the house and into a new group of peers. Often there are groups of seniors who are very organized and volunteer together. They are usually welcoming to young helpful volunteers and thanks to their age they have more years of experience than you will find elsewhere. I don't mean volunteer at an assisted living home (though that is wonderful too). Find a group that works at parks or with city beautification, at performance arts centers, libraries, museums, food share, meals on wheels (you will never find people more grateful for a dishwasher), or Habitat for Humanity. Some animal shelters need dog walkers and kennel cleaners and people to give the animals regular love and attention. \n\n&#x200B;\n\nGood luck man.\n\nIt all starts with standing up and moving, you can do that. ", "permalink": "/r/DecidingToBeBetter/comments/akgc2j/34m_i_have_no_idea_what_i_should_be_doing_with_my/ef4pxw9/"}