{"id": "t5_2tand_t3_akgc2j_t1_ef4obgv", "creation": 1548629511, "origin": "t5_2tand_t3_akgc2j", "height": 1, "replied_to": "t5_2tand_t3_akgc2j", "down_vote": 0, "up_vote": 594, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AtticSquirrels", "text": "I can empathize with you brother. \n\nWhen I was 25, my dad died. He was hit by a guy illegally street racing, so completely out of nowhere. I moved my mom into my house with me and my wife and a few years after that, she gets brain cancer. Glioblastoma to be exact, which is the fucking deadliest human cancer there is. While she is on hospice and I’m working only a few days a week to care for her, my wife leaves me taking my 1 year old son from the house of his dying grandmother. My mother dies shortly after this and I’m in a fucking tailspin. \n\nI’m paying a grand a month on child support, I’m an alcoholic, and the only thing I have in life is my son and my dog. (I was lucky enough that she never tried to take my son from me. I get him every weekend Friday to Sunday).  To top it all off, she marries one of my closest friends in the world. This man went on vacations with us, worked out with me 4 times a week, was always at my house. \n\nToday, I’m 33 and married to the love of my life. I have a great job, an incredible son and even a wonderful step son. I fucking got threw it all, and you know how?  Out of motherfucking spite. \n\nEvery day I thought about all the excuses I had not to make it and about all the people who bet against me and decided to fuck them all over. I’ll be honest, the smart man’s bet was on me becoming a fuckup drunk but I have never been a smart man so I beat the odds. When you have nothing else, spite and pride are the best motivators out there. Remember the Og Mandino quote, “I am a lion and I refuse to walk, talk, or sleep with the sheep. The slaughterhouse of failure is not my destiny. I will persist until I succeed.”  You got to be Russia in WW2 brother and win the war of attrition because you are a bad motherfucker. \n\nDM me and I will give you my number if you want. We have to fight for each other man and I feel for you bro. Just knowing strangers are out there pulling for you can really help. \n\nEdit: Thank you so much for the Gold and Silver!  Woke up to see the response to this and it is awesome. ", "permalink": "/r/DecidingToBeBetter/comments/akgc2j/34m_i_have_no_idea_what_i_should_be_doing_with_my/ef4obgv/"}