{"id": "t5_2tand_t3_4s9fr1_t1_d58ccxr", "creation": 1468269766, "origin": "t5_2tand_t3_4s9fr1", "height": 1, "replied_to": "t5_2tand_t3_4s9fr1", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "jpw93", "text": "The scientific term for the sleep patterns of regular people (that being, what time they fall asleep and when they wake up) is *chronotype*. As one commenter mentioned, there are genetic components to one's chronotype. Chronotype can be influenced by one's respective gender and their age. \n\nTo understand differences in gender for one's chronotype, it's easier first to describe how age affects the time at which one falls asleep and wakes up. While young children (Newborns - 5 years) require more sleep than those in [other age ranges](http://www.helpguide.org/articles/sleep/how-much-sleep-do-you-need.htm), major changes in chronotype are heavily associated with adolescence. This is why you will often find that teenagers can stay up all night with ease, and adults complain that they \"can't do that anymore.\" The trend for adolescents to fall asleep late and wake up late is natural, and is most likely (but not conclusively) caused by hormonal changes.\n\nNow how is this related to gender? If one takes the emergence of puberty to be the beginning stage of adolescence, as researchers often do, than women typically enter adolescence earlier than men. Interestingly, the age at which girls enter adolescence has been dropping steadily [in recent decades](http://www.nytimes.com/2012/04/01/magazine/puberty-before-age-10-a-new-normal.html?_r=0). \n\nThus, there are genetic influences for one's chronotype. But most importantly, one's chronotype is heavily influenced by behavioral patterns as well. Research also finds that changing one's chronotype is possible by [controlling one's environmental factors](http://www.washingtonpost.com/wp-dyn/content/article/2010/06/28/AR2010062803820.html). Light exposure plays a role in when we fall asleep, hence the recommendation not to sleep with the lights on. One should also avoid stimulants and depressants close to bedtime, which can affect the body's natural circadian rhythm cycle. \n\nBeing an \"early riser\", or as researchers call it, a *lark*, has the correlative benefits that the OP shared. However, there are some correlative associations that [can prove advantageous for \"night owls\"](http://www.fastcodesign.com/3046391/evidence/morning-people-vs-night-people-9-insights-backed-by-science), or *owls*. You can naturally be either one, but by your behavior you can adjust whether you wake up earlier or stay up later.\n\n**TLDR:** There are pros and cons to being an early riser or a night owl. Your chronotype (one's regular sleep pattern) is partly genetic, but also heavily influenced by your behavior. Research shows that changing your behavior can affect your chronotype, but it easier for some than others.\n\nEDIT: Formatting changes", "permalink": "/r/DecidingToBeBetter/comments/4s9fr1/the_unfair_advantage_goes_to_the_early_bird_why/d58ccxr/"}