{"id": "t5_2tand_t3_kpyb88_t1_gj8j4qj", "creation": 1610638790, "origin": "t5_2tand_t3_kpyb88", "height": 1, "replied_to": "t5_2tand_t3_kpyb88", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Cat_Eyed_Goddess94", "text": "I've dealing with a few things recently, but I followed you and hope to connect soon to let you know how things progress when they do. I am glad you reached out:)\n\ndo you have a job right now? I've looked at your page and am not here to tell you what to do but just wanted to say that obviously since we have a similar situation, and since I've actually had a friend with a baby might have have been  in the exact same shoes(got into a situaition with an ex who kind of take advantage of her and now they have a baby together who she loves) just wanted to recommend that perhaps looking for a job before studying..I studied under the control of my father and it was a completely different experience than when i had all A's& admission to an ivy league school before I studied under his control\n\nnot here to tell you what to do but I just wanted to say that I highly recommend working/having own place before anything! studying can be hard, studying while being a mom is serious business, let alone studying and being a mother with the added (and unnecessary) stress of a toxic person! It \\*might\\* be a victim mentality to give up, but becoming financially independent so one is less dependent on toxic people isn't giving up, it's actually creating a productive environment to succeed so you can study after that, **because abusive families tend to normalize toxic environments, which are not normal.**\n\nAgain, im not here to tell you what to do so im sorry if  comes across that way. it's just that im speaking from my experiences of studying while being in a simlar situation as a student, and would always encourage anyone's financial independence as a good first step.  My experiences as  as a student have also shown me that when toxic people are involved in your education, it can take longer to finish the education because of the problems they cause(witholding finances from you, making it hard to study, etc) a**nd for me at least, that has been counterproductive in the long run.**  your situation also sounds like that of my friend's, so it kinda feels like im talking to her lol. Whatever you do though, just know that you can always finish your education.", "permalink": "/r/DecidingToBeBetter/comments/kpyb88/i_started_getting_anxious_because_theres_a_huge/gj8j4qj/"}