{"id": "t5_2tand_t3_7gbnsm_t1_dqit1hu", "creation": 1511985607, "origin": "t5_2tand_t3_7gbnsm", "height": 1, "replied_to": "t5_2tand_t3_7gbnsm", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "jdarbuckle", "text": "Scrum-half playing out in Florida here, cheers. \n\nHave you heard of the hero's journey? It's what you are in right now. The reason all the ancient stories are still told today, the reason all the stories about Greek gods exist, is because it's YOU. \n\nEach Greek god is a stereotype of a human emotion or trait we all have. Anger, fear, seduction, etc... And they can control us. They've controlled you! \n\nThe hero's journey can be seen everywhere from Star Wars to the Illiad. \n\nHero exists. \nHero encounters a problem.\nHero finds a helper or a guide (who can help you?) \nHero enters the unknown, the darkness.\nHero battles through trials. (YOU ARE HERE.)\nHero achieves his prize (YOU WILL GET YOUR LIFE BACK). \nHero returns back to the world to share his gifts. \n\nEvery story ever. You can be the hero of your own story. You're in the pit right now, Mordor, the cave, the upside down. It sucks and it looks like there is no way out. \n\nIf you can see yourself as the full journey, know this: \n\nBy 45, you will be as physically healthy as you've ever been again. You will be financially stable, but not so wealthy that you lose sight of the real world. You will have positive relationships with people YOU care about, not just people who care about you. You will have passions, and tribes, and you will be able to return to the world to share this stuff with others. I'm doing it with you now. \n\nSounds like you're getting your ego crushed, or it has been already. Good. Now, you get to rebuild the real you, someone you're proud of ON YOUR OWN MERIT. It's the best feeling in the world. You've learned all the lessons you need to learn, now it's time to rebuilt. \n\nPractical advice: \n\nSmall, daily habits. 10 pushups, one phone call, two pages of a healthy book. Accomplish these small things every single day, and you will feel so much better and make more progress than getting all fired up and trying to change everything at once. \n\nSobriety. I'm sober and it sucks and I'm bored. But I don't have crazy mood swings, and I don't make bad mistakes, and I can look myself in the mirror, and it's worth it. \n\nCommunity. Get involved. Join a non-profit, volunteer. These people will accept you, they will not judge you, and you will find a great place to be a real, down to earth person. Don't try to impress them, don't be an ass. Be kind, learn. \n\nI'll see you on the other side my friend. \n\n\n\n", "permalink": "/r/DecidingToBeBetter/comments/7gbnsm/anyone_else_screw_up_your_life_like_me/dqit1hu/"}