{"id": "t5_2tand_t3_ilwt2a_t1_g3w19le", "creation": 1599161062, "origin": "t5_2tand_t3_ilwt2a", "height": 1, "replied_to": "t5_2tand_t3_ilwt2a", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ocean_view", "text": ">advice on how I can get started with learning to respect myself? Maybe I could change up my daily routine? Maybe I could be more active? I need to find a way to have a different (more positive) perspective on myself.\n\nChanging your routine or being more active are behaviors. Having a different perspective will not be influenced by behavior changes alone (and maybe not at all). It is tempting to believe \"if I just worked out every day I'd feel good about my body\" or \"if I just learn to speak in public I'd feel more confident.\" These become lifelong feedback loops that don't actually create anything better. They are symptoms of something else. What is the something else? \n\n>my opinion on myself is (very) critical and I tend to look at myself as...\"lesser\" than others\n\nThis is based on a real characteristic: you are able to know, or personally experience, value or self-worth as a broad spectrum. So you know what self-worth feels like, but you don't always have it. That alone isn't a problem. But when you interpret that fleeting self-worth as scary or it makes you feel less-than others, THEN it turns into a problem, and your fearful or 'small-self' response is to grasp for it, and/or give up trying altogether.\n\nSome people wake up every day with a pretty clear sense of their self-worth. They don't have this problem. For the rest of us, a very common response is to spend a little or a lot of energy in mistakenly trying to fill this perceived hole with accomplishments. \n\nThe trick is to realize you are already perfect without a steady sense of self-worth - that your openness and lack of personal consistency in this area enable you to perceive value and worth in others at any time - and that a person's very real 'value' (including yours) can be measured in different ways.", "permalink": "/r/DecidingToBeBetter/comments/ilwt2a/i_need_advice_on_how_to_respect_myself/g3w19le/"}