{"id": "t5_2tand_t3_e48z50_t1_f98az35", "creation": 1575176078, "origin": "t5_2tand_t3_e48z50", "height": 1, "replied_to": "t5_2tand_t3_e48z50", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lliearnia", "text": "I read everything, and I can totally relate (minus the example because I don't really have a similar experience). I'm kinda amazed that you wrote something really long, I hope it left off some baggage off your chest.\n\nOkay, to the thick of the comment, I had a similar experience. But as for me, being an very early self aware child of below 10 years old, I killed it immediately. To this day, I still get y'know bitter, but very rarely because I have taken everything not emotionally or deep in. Though I would NEVER recommend my method because it was too much and it turned to another issue, I'd say you need to be aware of what is causing this.\n\nLike, ask. Were you least praised? Or not really given attention? Those are  basic from my outsider's perspective, you can go deeper to know. Upon knowing, I want you to recognize what you want to do afterwards. What now? If you want to stop, then what? I think its better to set \"I want to be more [trait]\" or \"I want to be [fill in this]\" than \"I want to stop being like [this].\" Primarily because in my experience, it led me to nowhere. The second (or third) statement is not a goal of any sort, its just a state (which you can stop being in,) and the first (two) statement/s are something achievable, or is a goal you can go to and stay.\n\nPersonally, if there was one thing I wished I did instead and maybe it will help you, then it would be mindfulness and gratitude. Be mindful and snap thoughts of toxicity as much as you can, forgive if you go into deep and try again. Be grateful of what others accomplished and take in what they learned and mistakes to learn. I kinda get the vibe you took the \"make everyone your rival to be a better you\" too far. I think its more healthy to instead of treating as a rival, one can learn from each other and be happy at both sides. That's my cent/s and I hope you find a way out.", "permalink": "/r/DecidingToBeBetter/comments/e48z50/how_do_i_stop_seeking_praise_or_attention_from/f98az35/"}