{"id": "t5_2tand_t3_jl2v8q_t1_gamqa3d", "creation": 1604086375, "origin": "t5_2tand_t3_jl2v8q", "height": 1, "replied_to": "t5_2tand_t3_jl2v8q", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "seekindivid", "text": "1. Depression\n2. Emotionally neglectful parents\n3. Being 20 years old\n\nI didn’t read your whole post, but the length and what I have read indicate a high degree of insight and introspection.\n\nPeople act out for a multitude of reasons, including when they are ill, in need, or simply at a confusing stage of life. Can imagine that growing up wouldn’t have been particularly easy for you. Family turmoil is also one of the toughest issues to deal with—many complicated emotions involved.\n\nAnd sure, maybe you do fit the profile of a narcissist. That’s one perspective.\n\nBut you’re also at a stage in life when your brain, cognition and self-awareness have advanced enough for you to feel shame and regret about how you acted as a child. This is extraordinarily stressful because you are also too young to grasp what this means about who you are and who you’ll become.\n\nRight now is a turning point, where you begin the process of learning healthy patterns and leaving old, unhealthy patterns behind. At 20, you’re also much more capable of choosing your environment, hopefully one with good influences and emotionally intelligent people you can model. Individuation is critical at this stage.\n\nHugely important: you will not discover any productive path forward by focusing on how you fit into a DSM diagnosis. But you will be able to grow and take responsibility for yourself by identifying unhealthy relationship patterns, negative environmental factors, and poor responses to these—then you can go about deciding what you need in order to be a good person.", "permalink": "/r/DecidingToBeBetter/comments/jl2v8q/intense_perpetual_fear_of_being_a_covert_narc/gamqa3d/"}