{"id": "t5_2tand_t3_o9w0xl_t1_h3erduz", "creation": 1624944750, "origin": "t5_2tand_t3_o9w0xl", "height": 1, "replied_to": "t5_2tand_t3_o9w0xl", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "gillmanblacklagooner", "text": "I’m not young (in my early 30s and a lot\nof relationships) but I’m here to say: nice tips!!!\nI used to read Models by Mark Mason and he has nice things to say (and it’s far away from the pickup lines and bullshit).\n\nMy turn:\n\nAlways check your real feelings and intentions. Guys, this is deep shit. We are “trained” to shut our feelings up and being honest and vulnerable are precious skills.\n\nDon’t be rude to yourself. By now, write it, save it, whatever... but no meed to treat yourself less than kindness.\n\nIncompatibility is a real deal and it’s sucks. It can appear by cultural, belief, social status... some girls will love us, some girls will not even look or respect us. Don’t take it too personal.\n\nDo not compare yourself and your relationship with anyone else. We try to bring other’s money and lifestyle to the table. Just. Don’t.\n\nIknow it’s already said: focus on your life. Go to the gym, improve your hobbies and develop skills. Study hard in some area you like. If it can bring you some money, that’s cool! But don’t forget to do and improve your likes. And take care of your health. Please.\n\nThere’s A LOT of girls and it’s a big, big world with internet here to give us a little hand. Have in mind that people have different choices and likes: you can’t be Superman to a girl without being a pitiful shame to another girl, right? Girls in surf/reggae festival probably/usually won’t fall in love for the most popular Death Metal Headbanger in your underground scene... ok, you got it.\n\nAnd the last one: everything changes with the time. Good times, bad times. Everything changes.", "permalink": "/r/DecidingToBeBetter/comments/o9w0xl/12_dating_principles_for_young_men/h3erduz/"}