{"id": "t5_2qh1i_t3_m62l31_t1_gr3rb0u", "creation": 1615884953, "origin": "t5_2qh1i_t3_m62l31", "height": 1, "replied_to": "t5_2qh1i_t3_m62l31", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CoolTrainerFoxx", "text": "Heavily consider what will happen if you fail or back out. It is extremely easy to have the mentality that your goal isn't to fail so who cares? But there is ALWAYS that chance! Gunshots have been known to completely miss any vital areas of the brain and only manage to destroy your face. Wrist slitting rarely goes deep enough to actually cause death and will just hurt until you pass out, then will hurt for days afterward. Self harm scars also mean a lifetime of owning up to it with healthcare workers, and believe me that sucks. Hanging often fails to break the neck and results in a very slow suffocation that can mess up your mind permanently loooong before you die. Most options are NOT immediate and you can never be sure that someone won't find you, leaving you to deal with the fallout for years after.\n\nI failed an overdose of 160,000mg of OTC painkillers. Ended up at the hospital with an absolutely horrendous experience including having my nostril stretched open until it bled, coating the windows of an ambulance with projectile vomited charcoal, and being detained in the hospital for almost a week. Humiliating to say the least. Over a decade later and I know I have liver damage from the whole ordeal but have been too afraid to get tests done to know the extent. Thankfully the worst symptom I have is that drinking leaves me needing to pee every 15 minutes or so, but it could have been so much worse.\n\nJust take things day by day. Savor the small moments of happiness and try to focus on them. Talk walks in nature, play a game with friends, adopt a pet. Start a diary, or pull up Word and write your thoughts as they come if they're too much to handle; it doesn't need to make sense, you only need to release them. You'll make it through, just keep going. [Just stay alive.](https://youtu.be/7sNakKm3Pr0)", "permalink": "/r/AskReddit/comments/m62l31/suicide_attempt_survivors_of_reddit_what_message/gr3rb0u/"}