{"id": "t5_2tand_t3_ppei57_t1_hd3i77p", "creation": 1631810104, "origin": "t5_2tand_t3_ppei57", "height": 1, "replied_to": "t5_2tand_t3_ppei57", "down_vote": 0, "up_vote": 19, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "redubshank", "text": "> At the moment I feel I'm very introverted because of my lack of educational and not being able to join in on a lot of conversations people may have.\n\nWhile I wish it was otherwise I can't really remember the last time, in a casual environment, anyone wanted to deep dive into philosophy or history.  Sometimes politics comes up but I would guess 80% of the time it's more gossipy then anyone wanting to deep dive into actual issues.  Basically what I am saying is if you are trying to improve your social skills you might be better off starting with someone like Dale Carnegie's How to Win Friends and Influence People.\n\nThat being said for politics just follow various news articles.\n\nPhilosophy is a broad subject.  You could look into ancient Eastern philosophy which tends to meld into more of a spiritual and holistic realms.  Ayurveda, Hindu, Buddhist, etc.  Western philosophy maybe start with Stoicism since aside from being able to talk about it most people would be helped by learning how to implement it in their lives.  I'm also a bag fan of objectivism albeit that's a bit more modern.\n\nSlightly dove tailed here but you could also read something like Henry David Thoreau's Walden which is am amazing book but it's of an antiquated writing style so can be hard to read.\n\nHistory is even a broader subject and you can get very, very detailed.  That being the case there isn't really a simple 'go read this and you are good'.  I'd just pick a time period that interests you and find a book on it and read it.  Think Vikings are cool?  There are probably hundreds of books written for that era.  Curious what Polynesian life was like pre-European contact?  There are books on that.  Pirates?  Plenty of books on that.  I think the key is to only read things that kind of interest you so it's not a chore but something to look forward to.  If you don't care about Republic of Venice then why bother learning about it for conversational purposes?", "permalink": "/r/DecidingToBeBetter/comments/ppei57/list_of_books_to_become_a_well_rounded_self/hd3i77p/"}