{"id": "t5_2tand_t3_nzbwut_t1_h1r6lra", "creation": 1623693108, "origin": "t5_2tand_t3_nzbwut", "height": 1, "replied_to": "t5_2tand_t3_nzbwut", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lightingal", "text": "3 things:\n\nFirst, I'm **proud of you** and you should be, too! \n\nSecond, if possible, please do NOT \"blow it out\" before going. My nephew was in his mid-30's and completed rehab successfully (not the first attempt) and was mentoring a friend who was going in the program. His (the friend) girlfriend started calling my nephew, afraid the friend was going to die because he'd bought $100 worth of heroin to use before going sober. My nephew was trying to wait for his own partner from the program to go and help the fellow to talk him through, but the g/f kept calling and freaked my nephew out so much that he left work and drove down to help him, without his partner.  \nMy nephew was not a strong willed individual and should have waited. He was going to be a Preacher and had been accepted into school to become one, as well as a Drug Counselor. He never made it. He caved to the friend and to the heroin.  \nAfter he stuck the needle in his arm, the friend said he felt so much shame for breaking everyone's trust in him - his new wife and 2 sons, as well as her own other kids. Letting everyone down was more than he could handle, so he hit it again.  \nThe \"friend\" dropped him out of his vehicle at the ER and fled. My nephew died with a needle in his arm. He was a good kid.   \nYou're a good kid with a better head on your shoulders than he had. He was twice your age and still acting like he wasn't.\n\nThird, please realize you are going to be vulnerable. Please do NOT get into a relationship while you're in (or shortly after) rehab! It won't be a healthy relationship and you'll more than likely relapse because you'd thought you'd met someone who had been through the same thing and survived. Learn to live by yourself and love yourself, but it won't be easy (I'm still working on loving myself and I'm 54). Nothing worth having is ever easy!   \nAs for my nephew, he was a newlywed. Left 1 son of his own, 1 he called his own because SHE had gotten pregnant in her own rehab situation, and 2 others - all 4 from different men. She's gone on to marry again and have 2 more. My nephew has been gone less than 3 years. She also traded one addiction for another.\n\nRealize please that **every single person has an addictive personality**. What YOU CHOOSE to be addicted to is what you're about to determine. Maybe it's music, painting, reading, writing, exercising, rescuing animals that need help, helping the elderly (so you can see what life has in store, and how to avoid some things life will throw at you), and just enjoy \"being\".\n\nI wish you SO much luck and love throughout this and the rest of your life! Please make a difference in the world, even if it's just your section of the world. You have SO much to offer!!! I hope you'll update us when you're feeling up to it! I'll include you in my prayers!! \n\n***You've got this!!!***", "permalink": "/r/DecidingToBeBetter/comments/nzbwut/headed_to_rehab_saturday_morning_not_sure_what_to/h1r6lra/"}