{"id": "t5_2tand_t3_nzbwut_t1_h1qw94k", "creation": 1623688557, "origin": "t5_2tand_t3_nzbwut", "height": 1, "replied_to": "t5_2tand_t3_nzbwut", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "pizzaforce3", "text": "I just celebrated 21 years clean & sober and I can honestly say it was both the hardest thing I've ever done and the best decision I've ever made.  \n\nIt's okay to be nervous.  Yes, keep an open mind and stay positive.\n\nMy own experience was this - I had to surrender every last one of my assumptions about who I was, what was 'wrong' with me, and, most importantly, surrender my ideas about what the world was like and how I needed to behave in order to survive.\n\nMy discovery was this - my assumption that we lived in a zero-sum game, wherein for every winner there was an equal and opposite loser, was wrong.  My assumption that people were essentially reward-driven, and would only assist me if I offered compensation of some sort, was wrong.  My perception that I was one of the losers and had nothing of lasting value to offer to anybody else, was one of the root causes of my alcoholism and addiction.  Shedding those mistaken ideas went a long way towards allowing me to embrace the new, sober me, and I became free to discover ways to be altruistic and useful to others.\n\nBased on your brief description of your predicament, it's likely that you also have a warped perception of self, and your potential to contribute to the world around you, much like I did.  Most addicts and alcoholics show up in treatment with a fear-based worldview, as I did when I started out on this journey.\n\nYour job in treatment is to identify and shed the unreasonable fears that you now have, and replace them with newer healthier fears.  What, new fears?  Yes.  A fear of relapse is healthy.  A fear of letting yourself down is healthy.  They are healthy because you can take positive, proactive steps to allay those fears, whereas the unhealthy ones tend to be unstoppable and spiral out of control.\n\nYou got this.  Thanks for posting.", "permalink": "/r/DecidingToBeBetter/comments/nzbwut/headed_to_rehab_saturday_morning_not_sure_what_to/h1qw94k/"}