{"id": "t5_2tand_t3_pupcph_t1_he797s4", "creation": 1632561128, "origin": "t5_2tand_t3_pupcph", "height": 1, "replied_to": "t5_2tand_t3_pupcph", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheBackstreetNet", "text": "There is a certain inertia that comes with beginning a task that is hard to get over. Maybe you're worried that what your making won't be good. Maybe you were excited to do something, then you sit down and think, nah I don't want to do this anymore.\n\nWell this is difficult to get rid of, but here's some advice I can give you.\n\n1. Be like Stephen King. George R.R. Martin once asked him how he writes book so fast. His response is that he just sits down and writes everyday. He writes 6 pages a day. They don't have to be good pages. They just have to exist.\n\n2. Motivation comes with action. Not the other way around. You CANNOT wait to get motivated.\n\n3. Routine. This is the thing that REALLY makes people do things. It's not motivation or willpower or being so in love with your project that you wake up with joy each day. No. It's doing something every day no matter what. But that's hard to do. My recommendation is that you start by listening to episode 18 of the Becoming Better podcast where they interview the author of Atomic Habits. In some ways the podcast is better than his actual book.\n4. Don't do it alone. If somebody asks you to do something then you need are more likely to do it. But doing things WITH someone is also great. There's a reason study groups work. Have a composing group. Or a work group of some kind. This might be annoying to set up, but it sorts out so many of your problems. It creates a routine where you guys meet regularly, it creates an environment where you HAVE to work on what you're supposed to, and it creates accountability!\n\nI'm not saying any of this is easy. But it is achievable. I did it after being depressed for 2 years. You can too.", "permalink": "/r/DecidingToBeBetter/comments/pupcph/this_post_by_a_random_internet_stranger_has_been/he797s4/"}