{"id": "t5_2tand_t3_dygyro_t1_f82a5c6", "creation": 1574187187, "origin": "t5_2tand_t3_dygyro", "height": 1, "replied_to": "t5_2tand_t3_dygyro", "down_vote": 0, "up_vote": 64, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "butwhatsmyname", "text": "Definitely. The first thing is actually really important because it's vital to make this a success: don't punish yourself, tell yourself off, or talk badly to yourself when you're not doing great at this. Seriously. Your behaviour right now isn't \"bad\". What you're aiming for isn't \"good\". You're going through a process of change, one thing to another. It's brilliant, it's positive, it's healthy and it's **hard**.\n\nAnd that's ok. \n\nBut take your time, be kind to yourself, be patient. You're doing this for yourself and for your future self as well as the people around you, so don't make this any harder than it needs to be.\n\nThe first part of making the change is to start restraining yourself from speaking. If you're in a group conversation and you feel that urge to lunge in to complain about something, pull back. Hold your tongue. Let the conversation carry on around you. If you feel like complaining to a colleague or friend about your shitty day at work or the crappy traffic... don't. \n\nThat's it for the first part. And sometime you won't manage it. And that's ok. If you find you're hardly saying anything now, then that's good. You're cutting out the dead wood, pulling out the things you don't want to keep. \n\nOnce you've started to get the hang of it, you can start listening more. When I did this I felt a bit terrified because *I didn't know how else to communicate*. It was all I'd even known. I didn't know how else to express myself. But now that I wasn't complaining all over every conversation... I got to start really listening to them. I started to make an effort to listen to how other people did things like respond to something they found funny, or found doubtful. I got to watch how people expressed their interests and views. I started to pick out things I liked - I saw ways to make people laugh, or to change the subject politely, or even to express that I was unhappy about something without just moaning about it \n\nIf you're struggling to make the leap into conversation without a complaint to interject (and I found that hard. When you can't open with \"I really hate it when-\" I was suddenly dumbstruck.) then you need to try out some new ways of opening or moving into a conversation.\n\nI started out clumsy, but in a way that I got much better results from than I was expecting. Previously, when I was grasping for a new topic of conversation I'd pull out a comment about how much I disliked something, or how annoying something was. So I started to do the opposite. I'd try and pull something out of my head that was interesting to me or which made me smile. \"You know, I was reading about octopuses this morning-\". \"Hey, I saw a trailer for A Particular Movie the other day and it looked really interesting-\"\n\nIf that sounds lame, ask yourself: who would you rather be stuck in an elevator with, someone who is curious about sealife and would like to chat amiably about how interesting or unexpected that is, or someone who bitches and moans until help arrives?\n\nThis is not about being cooler. It is not about being smarter. It is not about winning at conversation or about making everyone around you think they shouldn't mess with you. This is about growing into a person that you like. Becoming a person you yourself would like to have around.\n\nI used to complain and trash things all the time because I was insecure and didn't want to say I liked or enjoyed things in case people picked on me or made fun of that. But it gets easier once you're on your way out of high school and into the world. I realised that I didn't like being around people who made fun of everything, and actually hanging out with people who wanted to share their excitement and interest in things was so much better.\n\nFiguring out why I complained all the time was important. Figuring out the way I was using that instead of having the kinds of conversations I really wanted was important. Learning new techniques and replacement behaviours was important.\n\nBut the key thing that pulled it all together came when I'd got the hang of biting back a complaint.\n\nI would stop myself. Look at what I was going to say. And then look at why I was going to say it. What did I want? What was I trying to make happen? Did I want to feel less left out? Did I want to look like I knew what was going on, and that I was smart and had something to add? Did I want to make people laugh? Make them feel sorry for me? Make them validate my feelings of hurt or injustice?\n\nIf any of those stung when you read it? That's where you need to look.\n\nI'm not here to tell you that you have to stop wanting, have to stop needing those things. I'm telling you that there are so many other ways to get the things you need - healthier ways. Ways that make you feel whole. Ways that make you feel relaxed, accepted, appreciated.\n\nI'd say that it probably took me from the age of 15 when I decided I wanted to make this change until I was maybe 22 to feel like I had beaten this. It wasn't a continuous, consistent process for me. I'd try different things, hit dead ends, go through a phase of fast and satisfying change and then slow down for a while as things embedded in my head and I strengthened new habits. My mental health was fucked and I was going through hell from several directions. But I stuck with it. And now I can complain about things again when I need to let off a little steam, or I can make people laugh with a ridiculous pantomime of offended drama that the world should inconvenience me so. \n\nIt changed my life. It was worth every minute. It was the road that started me off learning how to like myself and how to be likeable, and how to relax and just be around people without feeling twisted up in insecurity.\n\nTL;DR: \n\n1. Stop talking. Hold back every time you are about to jump in and complain.\n\n2. Listen to how other people make conversation without complaining.\n\n3. Learn some new ways to start and make conversation. Talk about something you like. Ask a question.\n\n4. Figure out what it was you were seeking when you complained.\n\n5. Try out new conversational tactics and approaches until you hit on something which gives you what you were seeking.\n\n6. Take your time. Stick with it. Accept that some things will fail and some will frustrate. This is the work of your life. You are building yourself. It will come together. You will learn and grow. You can do this. You can do this.", "permalink": "/r/DecidingToBeBetter/comments/dygyro/i_am_a_chronic_complainer_and_it_affects_me_at/f82a5c6/"}