{"id": "t5_2tand_t3_oioi3o_t1_h4wry68", "creation": 1626090288, "origin": "t5_2tand_t3_oioi3o", "height": 1, "replied_to": "t5_2tand_t3_oioi3o", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "obsequeeuqesbo", "text": "Hello internet stranger, hope you’re doing well. \n\nAll advice is personal, so if this doesn’t help you I understand, but hope it does! \n\nI too struggle with self-hatred/or doubt as I like to call it: doubting myself that I will lead my life the way I wish, living my life in a way that makes me feel complete, whole, and loving towards myself. It sounds like your parents were hard on you (maybe in twisted ways, and that just sucks :/ ).  \n\nWhat I find is that I have to practice diligently: both in moments where self-hatred is not present, and when it is present. All moments are connected in the here and now, ie, working in this moment will help future moments, and not working in this moment will not help future moments. \n\nWhat I’ve found that I need most, is peace during my practice. Inner-peace to be able to confront the harshness that my thoughts and feelings sometimes exhibit, as well as inner-peace which does not become reliant on feeling good or peaceful, but rather remains content with practicing. To put it simply, I would offer this advice (somewhat of a Buddhist perspective but can be applied universally no matter what one believes:) \n\n“””\n\nMay you be free from your suffering;\nYou DESERVE to be free from your suffering. \nYou possess the faculties which will free you\nFrom your suffering. \nYou will free yourself from your suffering.\n\nWhen self-hatred (suffering) arises \nUnderstand that it is not eternal. \nThrough the non-action of peace \nBe mindful of how you treat and think \nOf yourself. \n\nTo be peaceful does not require any effort\nBut to understand this and employ this method \nCould take a lifetime of practice. \n\nAnd a lifetime of practicing peace\nIs still disturbed by thoughts and feelings \nOf suffering (self-hatred) \nBut by means of practice \nRemains steadfast, and pursues self-love\nKnowing that self-love is innately present.\n\nTherefore: \nSimply know that self-hatred \nIs like a temporary illusion. \nIt shall not last forever, \nonly for as long as you give it strength. \n\nTherefore: \nSimply know that self-love \nIs ever present, only clouded \nBy the illusion of self-hatred \nWhich is as breakable as fog. \n\nWhen one cuts through the illusion \nOf self-hatred and realizes self-love \nEven by the mere recognition of \n‘I deserve to be free from suffering’ \nOne takes a giant leap on the path \nTowards a self-sustaining practice \nOf inner peace. \n\n“””\n\nI’m no monk or priest or scholar or anything. I’m not qualified by any degree. I have my own therapist and my own means of dealing with my problems. I suffer, and find freedom from this suffering in my own way. There is no difference between me and you, other than where we are physically, and who we believe we are, and what we believe to be our specific reasons for suffering. Suffering is universal, and so is love. You deserve to be free from suffering", "permalink": "/r/DecidingToBeBetter/comments/oioi3o/overcoming_selfhatred_need_advise/h4wry68/"}