{"id": "t5_2qh5i_t3_gj1xlf_t1_fqkoxep", "creation": 1589432355, "origin": "t5_2qh5i_t3_gj1xlf", "height": 1, "replied_to": "t5_2qh5i_t3_gj1xlf", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BryCart88", "text": "I'm very happy for this outcome! It's a fate I wouldn't wish on anyone... I was not as fortunate :(\n\nFor several months I chased symptoms related to pain in the lower abdomen, even going to the ER at one point to be told it was in my head. Eventually I got scheduled to have a colonoscopy, and I remember before going under for it I complained about pain in my testicle... The nurse shrugged and off to lala land I went. Hours after the procedure, which itself showed nothing, I started to feel extreme pain in a testicle and called my doctor's emergency line. She told me to go to the ER. I drove over and painfully walked in, slowly seated down in the intake care where the tech even said, \"Gosh, you look like you're hurting...\"\n\nA doctor got called in and had a resident in tow. Having them gawk at my balls was pretty rough, but then the doctor tried twisting it and I screamed more loudly than I thought possible with blinding pain. Soon a blur of more techs, I remember a nurse who was in Afghanistan was trying to encourage me by saying his buddy had the same thing and he was able to save his. I appreciated his sentiment, but I knew deep down it was too late. Woke up in a bed hours later, then and forever a one-ball-wonder. Torsion got it.\n\nI was offered a prosthetic, but between the idea of a secondary surgery and just the idea of a fake ball wasn't appealing. The months afterwards, and spare moments now nearly a decade later, I experience phantom pain like it's still there with screaming pain. The brain has some weird mechanics...\n\nSo yeah, that's how I lost my ball to torsion. Life is totally fine now, though! AMA, I guess?", "permalink": "/r/happy/comments/gj1xlf/yesterday_reddit_saved_my_brothers_balls/fqkoxep/"}