{"id": "t5_2tand_t3_mf2j8a_t1_gsmj0lm", "creation": 1616969950, "origin": "t5_2tand_t3_mf2j8a", "height": 1, "replied_to": "t5_2tand_t3_mf2j8a", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "technitaur", "text": "The fact that you've made up your mind about it is a *huge* step forward, and that will help you a lot. Until a person truly *wants* to be off of something, they'll probably keep going back to it - I feel that this may be the reason behind a lot of cases of people repeatedly going in and out of rehab.\n\nThe following is some information that I don't know if I should share with you or not. I don't want to scare you, but I also want you to be prepared for this feeling during withdrawal, if it should happen to you. I'll put it behind a spoiler so that it's your choice.\n\n>!When I quit smoking, the process took about a month in total. The first week was the worst part. I genuinely believed that something had been broken in my mind, and that I would never be able to experience happiness again without nicotine. It felt like I was being punished even for doing good things, because I had a habit of lighting up a 'victory cigarette' after accomplishing a task.!<\n\n>!That caused me to basically just avoid doing things altogether, and I did nothing but sleep (or laying there feeling sorry for myself... but the important thing was that I did not light up). This nasty state lasted for several days, but eventually it began to fade, and I found that I was able to breathe easier... sooner than I thought I would!!<\n\nIf you get the same bad feelings I did, good luck to you - it was harsh. But I made it through, and I've been cigarette-free since November 2020. I still get a craving once in a while, but then I remind myself of all the money I've saved by not smoking. I also remind myself that if I relapsed, I would inevitably end up having to quit at some point *again*, and I don't want to have to go through that experience again!", "permalink": "/r/DecidingToBeBetter/comments/mf2j8a/smoking_my_last_cigarette_today_excited_to_wake/gsmj0lm/"}