{"id": "t5_2tand_t3_mj0sje_t1_gt85nc9", "creation": 1617436291, "origin": "t5_2tand_t3_mj0sje", "height": 1, "replied_to": "t5_2tand_t3_mj0sje", "down_vote": 0, "up_vote": -14, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ClicheChe", "text": "\"Listen up, old bad-karma Patrul,\nYou dweller-in-distraction.\n\nFor ages now you've been beguiled, entranced, and fooled by appearances.\nAre you aware of that? Are you?\nRight this very instant, when you're\nUnder the spell of mistaken perception\nYou've got to watch out.\nDon't let yourself get carried away by this fake and empty life.\n\nYour mind is spinning around about carrying out a lot of useless projects:\n\nIt's a waste! Give it up!\n\nThinking about the hundred plans you want to accomplish,\nWith never enough time to finish them,\nJust weighs down your mind. You're completely distracted\nBy all these projects, which never come to an end,\nBut keep spreading out more, like ripples in water.\n\nDon't be a fool: for once, just sit tight.\n\nListening to the teachings — you've already heard hundreds of teachings,\nBut when you haven't grasped the meaning of even one teaching,\nWhat's the point of more listening?\n\nReflecting on the teachings — even though you've listened,\nIf the teachings aren't coming to mind when needed,\nWhat's the point of more reflection? None.\n\nMeditating according to the teachings —If your meditation practice still isn't curingThe obscuring states of mind—Forget about it!\n\nYou've added up just how many mantras you've done —But you aren't accomplishing the kyerim visualization.\n\nYou may get the forms of deities nice and clear —But you're not putting an end to subject and object.\n\nYou may tame what appear to be evil spirits and ghosts,\nBut you're not training the stream of your own mind.\n\nYour four fine sessions of sadhana practice,\nSo meticulously arranged —Forget about them.\n\nWhen you're in a good mood,\nYour practice seems to have lots of clarity —But you just can't relax into it.\n\nWhen you're depressed,\nYour practice is stable enough\nBut there's no brilliance to it. \n\nAs for awareness,\nYou try to force yourself into a rigpa-like state,\nAs if stabbing a stake into a target!\n\nWhen those yogic positions and gazes keep your mind stable\nOnly by keeping mind tethered —Forget about them!\n\nGiving high-sounding lectures\nDoesn't do your mind-stream any good.\nThe path of analytical reasoning is precise and acute —But it's just more delusion, good for nothing goat-shit.\n\nThe oral instructions are very profound\nBut not if you don't put them into practice.\n\nReading over and over those dharma texts\nThat just occupy your mind and make your eyes sore —Forget about it!\n\nYou beat your little damaru drum — ting, ting —And your audience thinks it's charming to hear. You're reciting words about offering up your body,\nBut you still haven't stopped holding it dear.\n\nYou're making your little cymbals go cling, cling —Without keeping the ultimate purpose in mind.\nAll this dharma-practice equipment\nThat seems so attractive —Forget about it!\n\nRight now, those students are all studying so very hard,\nBut in the end, they can't keep it up.\n\nToday, they seem to get the idea,\nBut later on, there's not a trace left.\n\nEven if one of them manages to learn a little,\nHe rarely applies his \"learning\" to his own conduct.\nThose elegant dharma disciplines —Forget about them!\n\nThis year, he really cares about you,\nNext year, it's not like that.\n\nAt first, he seems modest,\nThen he grows exalted and pompous.\nThe more you nurture and cherish him,\nThe more distant he grows.\n\nThese dear friends\nWho show such smiling faces to begin with —Forget about them!\n\nHer smile seems so full of joy —But who knows if that's really the case?\nOne time, it's pure pleasure,\nThen it's nine months of mental pain.\nIt might be fine for a month,\nBut sooner or later, there's trouble.\n\nPeople teasing; your mind embroiled —Your lady-friend —Forget about her!\n\nThese endless rounds of conversation\nAre just attachment and aversion —It's just more goat-shit, good for nothing at all.\n\nAt the time it seems marvelously entertaining,\nBut really, you're just spreading around stories about other people's mistakes.\n\nYour audience seems to be listening politely,\nBut then they grow embarrassed for you.\nUseless talk that just make you thirsty —Forget about it!\n\nGiving teachings on meditation texts\nWithout yourself having\nGained actual experience through practice,\nIs like reciting a dance-manual out loud\nAnd thinking that's the same as actually dancing.\n\nPeople may be listening to you with devotion,\nBut it just isn't the real thing.\n\nSooner or later, when your own actions\nContradict the teachings, you'll feel ashamed.\n\nJust mouthing the words,\nGiving dharma explanations that sound so eloquent—Forget about it!\n\nWhen you don't have a text, you long for it;\nThen when you've finally gotten it,\nYou hardly look at it.\nThe number of pages seems few enough,\nBut it's a bit hard to find time to copy them all.\nEven if you copied down all the dharma texts on earth,\nYou wouldn't be satisfied.\nCopying down texts is a waste of time(Unless you get paid) —So forget about it!\n\nToday, they're happy as clams —Tomorrow, they're furious.\n\nWith all their black moods and white moods,\nPeople are never satisfied.\n\nOr even if they're nice enough,\nThey may not come through when you really need them,\nDisappointing you even more.\nAll this politeness, keeping up a Courteous demeanor —Forget about it!\n\nWorldly and religious work\nIs the province of gentlemen.\nPatrul, old boy — that's not for you.\n\nHaven't you noticed what always happens?\n\nAn old bull, once you've gone to the trouble of borrowing him for his services,\nSeems to have absolutely no desire left in him at all—(Except to go back to sleep).\n\nBe like that — desireless.\n\nJust sleep, eat, piss, shit.\n\nThere's nothing else in life that has to be done.\n\nDon't get involved with other things:\n\nThey're not the point.\nKeep a low profile, Sleep.\n\nIn the triple universe\nWhen you're lower than your company\nYou should take the low seat.\n\nShould you happen to be the superior one,\nDon't get arrogant.\nThere's no absolute need to have close friends;\nYou're better off just keeping to yourself.\n\nWhen you're without any worldly or religious obligations,\nDon't keep on longing to acquire some!\n\nIf you let go of everything —Everything, everything —That's the real point!\"", "permalink": "/r/DecidingToBeBetter/comments/mj0sje/i_underwent_ego_death_without_even_knowing_what/gt85nc9/"}