{"id": "t5_2tand_t3_os25f7_t1_h6n06xi", "creation": 1627337791, "origin": "t5_2tand_t3_os25f7", "height": 1, "replied_to": "t5_2tand_t3_os25f7", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Natalia_Simpson", "text": "Hey there-- first of all, it sounds like you have a lot of things on your plate. I know that when I get my inner critic going, it doesn't stop and creates a whole list of things I need to be better at. We all have countless things we could do to be more successful or attractive or even happy. But the truth is that even if we did all of those things, we would just come up with another list. Having aspirations and healthy goals and dreams is a very *good* thing. But accomplishing any and all of that is not what makes you worthy or enough. You are good as you are right now. \n\nNow if you do want to do these things not to gain worthiness but because you ARE already worthy, then start with one thing at a time. None of us can do a lot of things at the same time well. But if we focus on one step at a time, we can get there without feeling drained or burnt out. Do some soul searching to find the one thing off of that list that means the most to you right now. Then start with that. Give yourself a deadline, do your research and read books by people who have done what you want to do. Put little steps under that one goal to achieve it. I promise, doing things one step at a time is way more productive and sustainable than trying to tackle it all at once. Be gentle with yourself-- you are only human. Your friends may look like they are living their best lives, and its really tempting to fall into comparison, but I promise they are struggling with the same questions you are-- who am I? What am I supposed to be doing? What is my purpose? You are not alone. And you are worthy just as you are. I hope you come to see that. I recommend reading \"The Gifts of Imperfection\" by Brene Brown. That book changed my life and how I saw myself.", "permalink": "/r/DecidingToBeBetter/comments/os25f7/how_do_i_go_about_reinventing_and_changing_my/h6n06xi/"}