{"id": "t5_2tand_t3_2jgxsw_t1_clc6zri", "creation": 1413565772, "origin": "t5_2tand_t3_2jgxsw", "height": 1, "replied_to": "t5_2tand_t3_2jgxsw", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "petrus4", "text": "I should get rid of /r/worldnews and my entire news multi entirely.  It doesn't represent anything close to balanced news; it gets dominated by about five key memes/events at once.\n\nAfter that, /r/atheism is of course the most obvious one, which I suspect everyone will mention; that sub is a cesspool.  I joined /r/TrueAtheism a bit back, but it isn't all that much better.  It is less openly hostile, but it is still full of the usual pseudoskeptics and related fools.\n\nI've also got rid of /r/Socialism, /r/Anarcho_Capitalism, /r/Libertarian and /r/programming.  The reason why is because all four subs are nothing more than echo chambers, filled with incredibly sensitive individuals who only go there to either have their pre-existing opinions re-inforced, or to complain about how they view themselves as being victims of someone else.  The way it's going, /r/hinduism may end up being dropped as well, as any post I make there seems to be subject to downvote brigades.\n\nAlthough for me this is so natural that I didn't remember it without looking at other posts in this thread, I also removed /r/AdviceAnimals, /r/funny, and any other similar subs which are devoted to mindless, anti-intellectual rubbish that is disguised as humour.\n\nI should also remove the few Linux related subs that I am subscribed to; since in my observation, Linux users are probably the most brainwashed, ideologically restrictive people in existence that I know of.  The Linux community is absolutely vile, everywhere I have encountered it, and it has been for its' entire history.\n\nMy favourite subs here are probably /r/startrek, /r/DaystromInstitute, /r/unix, /r/*BSD, and /r/learnprogramming.  I also like /r/Anticonsumption.\n\nReddit in general is a deeply authoritarian place, however.  I don't recommend going anywhere to seek quality debate, because you won't find it.  Every special interest sub that you can name here is a circle jerk, where said sub's readership are exclusively looking for other people who agree with them.  Dissenting opinion in any form is generally not tolerated.  The reason why I don't have a problem in the Star Trek or BSD subs is because I usually agree with the consensus opinion already expressed there.\n\nI also like /r/conspiracy and /r/911truth, although it must honestly be said that they are still focused on problems.", "permalink": "/r/DecidingToBeBetter/comments/2jgxsw/i_decided_to_be_better_by_unsubbing_from_many/clc6zri/"}