{"id": "t5_2qh5i_t3_eq03mo_t1_fep0ti1", "creation": 1579309608, "origin": "t5_2qh5i_t3_eq03mo", "height": 1, "replied_to": "t5_2qh5i_t3_eq03mo", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "RecursiveRhetoric", "text": "Okay!!\n\nFirst of all, is your child disabled in some way? Note that I'm not just asking whether they use a wheelchair. I am disabled, but it manifests itself in the form of exhaustion and dizziness.\n\nRegardless: make lots of use of Fast Pass. Fast Passes let's you enter your guest number, tell it the ride you want to go on, and it reserves a time for you. (You're limited to one Fast Pass at a time — if you get a second before using up the first one, it tells you that the the first one will be cancelled.)\n\nIf you go to that ride after the ticket's appointed time on the same day, you can use the much faster Fast Pass line. This is handy, but it also enables you to use this trick: get a Fast Pass for ONE ride, hang on to the ticket for later, then wait in the *regular* line on a *different* ride. (I hear that this does not work with the new Fast Pass+ bracelet.)\n\nThere's also a website called touringplans.com that tracks line length. If you enter your desired rides, it tells you the best order to ride those rides, and when to get a Fast Pass. You can also tell it to minimize walking distance, if someone has mobility issues (like I do). \n\nIf your group is flexible, you can use the ride planner to save a lot of time. Now, it *is* a subscription service, and it costs $16 a year, but you can simply tell it not to renew, meaning $16 for the entire trip.\n\nI hope this doesn't sound too much like a plug, but  I want your daughter to get as much out of it as possible. I've seen a 3-year old visit Disneyland for the first time, and I also proposed to my wife in Disneyland, so I know how special it can be. ❤️", "permalink": "/r/happy/comments/eq03mo/my_daughter_got_her_wish_granted_from_make_a_wish/fep0ti1/"}