{"id": "t5_2tand_t3_auo8jj_t1_eh9nyy2", "creation": 1551125426, "origin": "t5_2tand_t3_auo8jj", "height": 1, "replied_to": "t5_2tand_t3_auo8jj", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "improvementedward", "text": "I'm really glad that you had such a positive experience with LSD. I had a similar mushroom trip, and I can honestly say it changed my life.\n\n&#x200B;\n\nIt sounds like you're starting a journey that could really set you on a trajectory for a fulfilling life. You're super fortunate to recognize this at such a young age. Part of getting answers to the questions your asking is to just exist and have life experience. As you do more things, you will find more clarity and purpose, and you will develop yourself further. With that being said, I think there are some things you can do to speed up the process. Here's whats worked for me:\n\n* Taking action and doing stuff: The more you put yourself out of your comfort zone, and the more things you try, the more of an opportunity you have to develop and discover your wants and passions in life. Join a club, try a sport, meet new people, and just generally put yourself out there!\n* Read and Learn: We are super fortunate to live in an age with more knowledge readily available to us than at any other time. Starting the habit of reading books, taking courses, and just generally educating yourself can help you to discover your passion as well. If you're looking for a place to start, I recommend a book called \"The Happiness of Pursuit\" by Chris Guillebeau.\n* Self Reflection: It sounds like you're already doing this to a much higher degree than most people your age, which is awesome. I set aside a few hours every month to just reflect on the previous month, set goals for the upcoming month, and do a little introspection. Setting up a similar system for yourself can help keep you on track and make progress factor.\n\nIts awesome that you're already pursuing personal development at your age, and I'm stoked to see where your journey takes you. Good luck with everything!", "permalink": "/r/DecidingToBeBetter/comments/auo8jj/i_took_lsd/eh9nyy2/"}