{"id": "t5_2tand_t3_lpgf5p_t1_goc85el", "creation": 1614001676, "origin": "t5_2tand_t3_lpgf5p", "height": 1, "replied_to": "t5_2tand_t3_lpgf5p", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CamelCamelFrog", "text": "Is it normal? To be honest, I don't know what normal even is anymore. Is it what most people would do? Probably not. \n\nDoes that mean there is something wrong with you? Heck no. \n\nI personally think it is a beautiful thing. I really think the world would be a much better place if we all felt more empathy towards each other. \n\nThey say that life is suffering. I don't know if that is necessarily true. \n\nWhat I do know is that we are all going through something. And although our bullies (I was bullied to) may have caused us pain, it is only because they were trying to relieve their own pain. \n\nWe are all motivated to run from our pain, and to find ways of burring it. Sometimes that means we hurt others. Other times it means we turn to drugs and alcohol. Some of us turn to food, or tv.\n\nDistracting yourself from your pain, be it by bullying others or by some other means, has the potential to cost you everything. Hide from the pain once and there is a pretty good chance you will do it again. Do it again and there is a pretty good chance you will keep hiding. Eventually hiding from your pain becomes a habit. \n\nA habit that leads you to make costly mistakes and choices that end up costing you a lot more than you bargain for. \n\nIt is always better to deal with the pain instead of trying to numb it. \n\nI too have forgiven my bullies. In part because they have played a roll in creating the person I am now. And also in part because I realize that they are and were tortured by their own inner demons, as I am tortured by mine. But I have found a way to make peace my demons, and they are still trapped in the cycle of running from theirs.", "permalink": "/r/DecidingToBeBetter/comments/lpgf5p/is_it_normal_or_ok_to_feel_empathy_for_my_past/goc85el/"}