{"id": "t5_2qh5i_t3_mfpf9q_t1_gsqhams", "creation": 1617054860, "origin": "t5_2qh5i_t3_mfpf9q", "height": 1, "replied_to": "t5_2qh5i_t3_mfpf9q", "down_vote": 0, "up_vote": 29, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ohno_not_another_one", "text": "Not the same person you commented on but I can share a little insight.\n\nThere are some very pervasive beuty standards in Asia, from China to Korea to Japan to Southeast Asain countries like Indonesia, Vietnam, Laos, Cambodia, etc. A lot of the time they start with online trends in Japan, China, or Korea.\n\nThe big standards today to be considered \"beautiful\" in those regions are light skin (skin bleaching lotions are sold all over Asia), heart shaped faces with narrow jaws and chins (plastic surgery is big business in Korea especially, and you can buy all kinds of crazy products to take your skin back to create the illusion of a narrower jaw), double eyelids (eyelid tape is a pretty normal beauty product for girls over there), being small and thin, and most recently, insanely long legs and a tiny head (go check out r/instagramreality for examples, they frequently find weirdly photoshopped images from Asian clothing retailers), and hyper-femininity (someone on here once commented how they worked as a teacher somewhere in a city in China, and her female coworkers were shocked she didn't wear high heels and skirts/dresses to work every day).\n\nAll of these things are very difficult to attain; even famous beautiful mobie stars in Korea and Japan often have to resort to plastic surgery to achieve this signature look. It's the same as how all the Insta influencers will go to crazy lengths to get that \"Kardashian\" look in the US.\n\nUnfortunately, some of the trends can be straight up dangerous. A few years ago the \"A4\" challenge started getting passed around, and made its wsy out of China to the US. The idea was that if you could hold a standard piece of A4 paper (approximately 8 1/2 by 11) up to your waist and your wasit was completely concealed behind the paper, you were thin and attractove enough. If your waist showed on either side, you were too fat. Obviously this was only physically possible to achieve for very small individuals, and was even less achievable in the U.S. where women are, on average, at least two inches taller than Chinese women. Caused almost as much drama as the thigh gap fiasco.\n\nSo essentially it just comes down to a very pervasive cultural concept of \"this is what pretty people are supposed to look like\", and the stress that comes with not fitting in with those things. The intense lengths many people will go to to fulfil those expectations just makes everyone else even more self-concious, reinforcing the idea that this IS a big deal, because who would have plastic surgery if it wasn't? \n\nAnd with the global nature of the internet, these beauty standards from one or two countries can easily affect girls and woman on the opposite side of the world. Again, on r/instagramreality, you can see how the Korean tiny head trend is affecting influencers in the US, Mexico, Brazil, everywhere. Even Kylie Jenner does it.", "permalink": "/r/happy/comments/mfpf9q/ive_been_hating_myself_for_my_whole_life_i_was/gsqhams/"}