{"id": "t5_2tand_t3_n070p3_t1_gw8g5ky", "creation": 1619652975, "origin": "t5_2tand_t3_n070p3", "height": 1, "replied_to": "t5_2tand_t3_n070p3", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Lassen2660", "text": "I'm so proud of you! My father is 60, and he is still drinking and has no self-awareness. I don't write this to get pity, but to say that you should be really proud of yourself. It's not an easy thing to quit your vices. You have so many amazing years ahead of you, and sobriety will be worth it in the long run. Maybe some therapy to learn how to give yourself some love and compassion. You are not your parents. You are much better than them, and for that you deserve all the love and compassion, you can possibly give to yourself. \n\nAlso, who we are is a narrative that we build, and this narrative is highly influenced by the experiences that we have had in our lives, especially experiences in childhood. \n\nFor example, let's say your narrative goes: \"I was abused by my parents. Therefore, I am not worthy of love and happiness. I became an addict because of my own inadequacy. I am just like my parents. I am worthless.\" \n\nTry changing that to: \"I was abused as a child, and that should have never happened. I was never the cause of what happened in my childhood. I am still good enough and worthy of love. I became an addict to cope with the pain of the past, because I needed something to numb out the pain, but that doesn't mean that anything is wrong with me. I am still enough, and I have always been enough.\" It's quite hard to change this, and it takes a lot of repetition, but it can be done. We can also get to know ourselves better by having some new experiences, so we can figure out, what we like, and what we don't like. \n\nI know this is not entirely what you meant by writing you don't know, who you are, but it's just a little food for thought. I also use the word addict a little loosely, like you can be a Coca Cola addict or a video game addict, so it's not to say anything degrading about you. \n\nI don't really know, if this is all that helpful, but I wish you all the best in the future. You have made a huge step, and you can be very proud of yourself.", "permalink": "/r/DecidingToBeBetter/comments/n070p3/i_almost_died/gw8g5ky/"}