{"id": "t5_2tand_t3_mubjog_t1_gv5dj8s", "creation": 1618879610, "origin": "t5_2tand_t3_mubjog", "height": 1, "replied_to": "t5_2tand_t3_mubjog", "down_vote": 0, "up_vote": 19, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Amberthms", "text": "It’s all about momentum. Momentum can be made from even the smallest change.\n\nSome advice i’ve used personally : do things one by one. If you make a list of goals and try to tackle them all at once, you’ll end up either feeling overwhelmed and having no motivation as a result or burning out very quickly. \n\nFor example, a year ago I was having depressive episodes, had a really bad diet, inconsistent sleep schedule, toxic friendships, no goals, no good habits, etc. Recognizing those problems is the first step. But the moment I tried I saw all those things I needed to change, I felt so overwhelmed I ended up not changing at all.\n\nUntil I was reading around and came to a conclusion that no matter how insignificant it may seem, I will begin to change. Out of all those things I needed to change, I decided to start drinking more water. Yep. I made that small change and nothing more for two weeks. I began feeling a bit more energized and that small change brought momentum with it. I started taking consistent showers. Then cleaning my room once every two weeks, then every week. Then sleeping a bit earlier, pushing back my AM sleep times by 20 minutes every few days until I was sleeping at 10PM. All of these seemingly small changes compound and improve your wellbeing enough to take on bigger goals. \n\nI started eating more. Back then I would only eat one meal a day, not because of image issues, but because I was so out of it and depressed that I didn’t care much for food. Then I ate one meal a day — plus a snack. Then two meals. At some point I was eating three. Then I quit instagram and facebook. I started reading books. I cut off some toxic friendships, and built new ones through common interests. These things may seem great or insignificant depending on the person, but it took me a long, long time to get here, and it wasn’t a consistent road up, there were many downs.\n\nSmall, incremental, and seemingly insignificant changes. Small habits built over the course of months instead of weeks like how I idealized. And yet when I look back, all these things came together and have put such a big gap between who I was and who I am now. You may regret a lot of things, like not having done “enough”, but the biggest regret of all is never STARTING.\n\nFor goals, I started thinking outside of the box. Outside of the flow of what was ‘probably’ going to be the path of my life. Never have I thought I was even going to move abroad if I could live comfortably in my home country, but here I am decently speaking another language. To have goals you must learn what your options are. Expand your knowledge on the exciting things out there. Marathons, volunteer communities, getting a pet, reading more books, learning electric guitar, travel, connecting with more people outside of your friend group by putting yourself out there, doing something unexpected of yourself, everyone has the innate desire to simply explore the world in which they are in, but not everyone finds those things immediately. And that’s okay.\n\nThe extreme demotivation you are describing may be a sign of a deeper mental struggle. Therapists are a godsend. There are affordable therapists online and in apps. There are communities of people going through things similar to yours that you can connect with and vent to — for free. The internet can be a wonderful and powerful tool, you just gotta look at the right communities and places.\n\nWrite down some of these things :\n1. What are you dissatisfied with in your personal and professional life?\n2. What are your vices? Why do you use these vices? What would you, ideally, replace these vices with so that you can cope in a healthier manner?\n3. What are things that you have been putting on the shelf, and can be done in a day or week? These are the things that can help generate some momentum without being to overwhelming.\n4. Why do you want to change? Think very hard about this one. Make it specific and honest. Look at this reason whenever you feel demotivated.\n5. What are some things you struggle with mentally/cannot let go of? Any past trauma? Issues with your appearance or yourself in general? Toxic relationships? Depressive episodes/anxiety/etcetera. \n6. What kind of person do you want to be (your ideal)? What values do you want to uphold, and what kind of life would you find truly fulfilling? \n\nConfront all your emotions. Confront yourself. That is the true first step to change. Pry those reasons and repressed thoughts from the deepest part of your mind. Lay it all out there, then make a game plan. That is how you begin to change your life.", "permalink": "/r/DecidingToBeBetter/comments/mubjog/how_do_i_break_this_cycle_of_me_doing_nothing/gv5dj8s/"}