{"id": "t5_2tand_t3_lhaixp_t1_gmw6c4l", "creation": 1613010648, "origin": "t5_2tand_t3_lhaixp", "height": 1, "replied_to": "t5_2tand_t3_lhaixp", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Hey! First of all, PLEASE calm down!! Yeah you made a mistake but honestly... Not even a big mistake? Like, ripping off books is LAUGHABLY common and while that doesn't make it okay, it's 100% not an indication of some impossible to fix moral failing, okay?\n\nI try to look at it this way:\n\n1. What did you REALLY do?\n2. What effects did it cause?\n3. Who did it hurt?\n4. What did you do to make it right?\n\nBy the time you get to nr 4 you should already realise that the proportion of hurt caused to reparation made is completely skewed and NOT the way you think!!!\n\nIt sounds like you did what you can to make it better and fix things. Maybe when you're a bit calmer you'll be able to think of more you could do, but honestly you've already taken important steps to make it up. One of the only ways to send someone to jail FYI is to prove damage was done - and you've made up for that already. I can't see anyone even trying that over something so...... minor.\n\nLike, I write for a living (journalist) and honestly, copyright claims and the laws behind them are mostly just crap anyway. Like yeah obviously people have a right to have their work protected and it's wrong to take it without permission or profit from it, but it's about as 'morally bankrupt' as jaywalking is 😂😂\n\nI honestly wouldn't even be particularly mad if someone stole my work. It's happened a few times. I have a default letter I send when I happen to see it, and so far I've never done anything else, and never needed anything else... And I couldn't tell you details of even a single instance of when it did happen it's so minor.\n\nYou don't need to somehow correct your character for making a mistake or whatever, but maybe it'll make you feel better to 'punish' yourself, or to deliberately add some good to the world if you prefer to look at it that way.\n\nIdk where you are but maybe there's a soup kitchen, a shelter, a charity you could donate a few hours of your life to helping people at. You know, make a net positive, and hopefully accept that you can't change what you've done and you can only accept it, make reparations and MOVE FORWARD.\n\nEdit: because I forgot this - you say you're desperate for money and idk whether that means paying rent or getting food or whatever, but that's a POWERFUL motivator and if someone stole my work so they can feed themselves I can honestly say I'd be fine with that. Highly unlikely in all fairness, but still. Trying to keep your life together isn't a moral failing at all. It's unfortunate, but assuming you needed the money for a 'good' reason rather than idk buying a new PlayStation or drugs or whatever, you also have to remember that motivation for actions matters, and for what it's worth, yours sounds reasonable.", "permalink": "/r/DecidingToBeBetter/comments/lhaixp/did_something_illegal_and_stupid/gmw6c4l/"}