{"id": "t5_2tand_t3_gm6adb_t1_fr28ah0", "creation": 1589832866, "origin": "t5_2tand_t3_gm6adb", "height": 1, "replied_to": "t5_2tand_t3_gm6adb", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I want to tell you about someone I knew to give a perspective, but I am not judging what kind of a person you are. I simply wouldn't feel okay providing you with nothing but kind words. Your ex-fiance's perspective is his perspective and he has his reasons, it doesn't make his perspective wrong, and it doesn't make your perspective wrong either.\n\nI used to know a girl (I literally banned her from my life) who suffered from pretty heavy depression, anxiety, she had a mother that basically hated her for being a woman. She had physical health problems but nothing that'd make her incapable of working, yet she still refused to find a job and found many excuses for it (I believe anxiety had a lot to do with it). First, I had a personal problem with her because she'd call me and some of my friends awful names, she wouldn't accept kindness from me; and even though we had clash in the very beginning of being acquaintances and both made mistakes, I think she was unnecessarily reactive and rude. After this one time she hated me and it was very visible. After she found out that the guy she was crushing on started going out with me, it was even worse, she was livid, and she accused me (in front of other people) of taking the only person who cared about her from her life, but it didn't stop her from blackmailing him that because of him she will commit suicide, and she made him look like a complete asshole to others. I remember her saying she can't control her emotions because no one can, I saw some of her conversations with others, and I eventually asked my boyfriend to block her because I thought she's too toxic to keep her around.  But my last act of kindness also got rejected because she had to throw a huge tantrum in the company of other of our friends, and then... I banned her from my life.\n\nNow, it's simply a perspective of a story about someone with depression. I don't you're nearly as bad as her because she seemed incapable of admitting such things. \n\nIt's not unique for people struggling with depression to play a victim. Actually, it's a very common practice/coping mechanism. If you've been doing it, it's okay. You can always improve. I recommend talking to a support group and/or therapist about it. Depression and anxiety are shit, and people with depression and anxiety tend to do weird shit. I've done it too.\n\nBeing a liar... It may happen. Perhaps your ex remembers something you don't remember or didn't see in the same light. Being manipulative happens as well. I don't know you, I don't know how you talk to people and deal with social interactions - so it's like Schrödinger's cat. I believe there's at least some truth to what your ex has told you. We tend to exaggerate things when we're emotional, but we exaggerate things and not create them out of air (ok, sometimes we do, but I myself don't see it often).\n\nManipulating people or situations to serve yourself doesn't have to be intentional to be a shitty behavior, btw. I know it sounds harsh, but if you really *want* to improve and become a better person, you will be ready to face the discomfort. And I don't see it improving with assistance of a therapist. And be honest with them. You know what feels great even though it scares us? - talking honestly about everything that is shitty about us.\n\nIf you managed to read all of this, here's a flower for you: ❀", "permalink": "/r/DecidingToBeBetter/comments/gm6adb/how_to_be_a_better_person/fr28ah0/"}