{"id": "t5_2tand_t3_fuwslj_t1_fmjtlv3", "creation": 1586137481, "origin": "t5_2tand_t3_fuwslj", "height": 1, "replied_to": "t5_2tand_t3_fuwslj", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BrunoNasc_EngMec", "text": "English is not my first language and I ramble a lot, so bear with me :p  \nI had the same problem... Once I grew up I realized I had no passions. I hadn't experienced the world enough for me to understand what I really like, so it was hard for me to choose a hobby, a passion, a profession, or anything. This exercise has help me a bit to understand the \"drive\" I didn't comprehend at the time:  \n\n\n  \nImagine that you decided to go on a trip, without destination and without any planning. You have enough money, water and food, so the only thing you need to care about is the journey.  \n\n\nAhead of you there are two paths... one leads to the coast, where you can see beaches on the distance, the other leads to a dense florest. Any of these can give you good or bad surprises, but there is no way of fully knowing without walking them.   \nOnce reach the place (or at any point during the journey) other paths will appear in front of you, that were hidden from your previous perspective, and you can choose to stay on the path you choose before, or deviate to a new path. Some paths feel better than others, some give early surprises but are tedious after that, some require you to walk the entire path for a big surprise. Some will be full of small surprises.  \n\n\nIf you stay where you are you'll only experience what is already around you, and this is very limited. At any point you have multiple choices on what paths to take. You don't like where you are at? Take another path that feels nice and see if that is a good path for you.   \nAfter a while you will understand on your guts that some paths are more enjoyable to you, and you will likely start to choose these. Some you will really enjoy, and will become your main path. Others you will enjoy for a while, but you get bored and eventually choose another path. That is how life is...\n\n&#x200B;\n\nMy point is: you need to experience life to understand what about it makes you tick. For every person is a different thing, and it may even change during ones life. Some people will find a new passion every week, some will take a while to figure it out. If you just do the same stuff over and over again you will never confront new cool stuff that you may like, so try new stuff and seek discomfort.", "permalink": "/r/DecidingToBeBetter/comments/fuwslj/deciding_which_path_to_take_in_life_after_leaving/fmjtlv3/"}