{"id": "t5_2tand_t3_7ri5p0_t1_dsydkcw", "creation": 1516421522, "origin": "t5_2tand_t3_7ri5p0", "height": 1, "replied_to": "t5_2tand_t3_7ri5p0", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "pyramidscheme562", "text": "I quit for 30 days and got in my first serious relationship. I wet dreamed once during that entire period. It sounds crazy I was 21 yo virgin (just 2nd base stuff before then). Was in to all kinds of fetish shit from 10 years of daily masturbation and porn hunting. I did a cleanse where I disconnected my internet completely (and only had shitty 2g so phone browsing was near impossible, also I didn't have a TV). I started spending more time with my friends and coworkers cause I didn't have shit to do at home. Ended up staying after work one day and talked to a 6/10 coworker who I had seen around but didn't have any interest in her. But after a full month of no masturbation I just didn't care anymore. I don't want to say \"desperate\" cause it's not the right word. It's more like the flaws I would pick out of her when I was jacking off everyday to hot porn stars just didn't bother me anymore. Anyway we hit it off personality-wise immediately. She was the coolest girl I had ever met. We were both immature so the relationship didn't really work in the long run, but we dated off and on for years and it changed my perspective on things. \n\nIf you really really really want to quit masturbating, you have to sacrifice more than just pornhub man. You gotta disconnect from technology for a while. Movies, tv, games, instagram, reddit, snapchat everything media related revolves around sex in one way or another. It's not about just getting rid of the temptation to look up porn, it's getting rid of the constant subliminal and direct sexual influences you come across. Watching a cute girls snap or watching an episode of Friends and seeing a young Jennifer aniston make urges start coming back. You have to cut that shit off completely it's the only surefire way. All I had was basically friends, books, music, and texting. I would hang out with a different person everyday. I went to so many stupid kids parties and weddings and shit cause I had nothing better to do and didn't want to be stuck at home (made a lot of new friends this way too). When you are in public you might get urges but obviously they are controllable, as opposed to being alone in your room. If I didn't have anyone to hang out with I would be a pseudo-hipster and read harry potter at Starbucks for a few hours just to stay out of the house. Trust me your dark fetish shit will start to fade away. A month without porn and seeing Emma Watson on a vanity fair cover in a 7/11 will get you rock hard, no need for loli hentai tentacle stuff. It's not like quitting masturbating will turn you into some testosterone super hero who works hard and gets straight A's and picks up 10/10 bitches all day, it just takes you out of the sex reinforced life style, which in turn let's you focus on more productive things including potentially healthier relationships with women. 9/10 slutty drug girls start to look worse cause you focus more on their personality/moral flaws while the 6/10 nerdy girl at the library starts to become your dream woman. If your phone is a problem, and this is going to sound crazy as fuck, downgrade to a shitty blackberry or flip phone. You don't have to sell your phone, hide it away somewhere and stick with your new shitty brick phone for just texting and calling for a month. Sorry for ranting so long, this was a huge turning point in my life and if you are considering doing it I extremely highly recommend it. 3 days is a start but a month will change your life forever, then you can assimilate back into media with a new mindset. It WILL \"cure\" you.\n\ntl;dr\nDon't quit just porn, quit all media (except for basic communications). It is waaayyyyy easier to quit when your not being constantly reminded of sex. You still will get urges, but they are more easily manageable and you will be way past the point of fapping to twincest stuff.", "permalink": "/r/DecidingToBeBetter/comments/7ri5p0/quitting_masturbating_for_3_days_more_than/dsydkcw/"}