{"id": "t5_2tand_t3_q2ctyt_t1_hfkq3i5", "creation": 1633501313, "origin": "t5_2tand_t3_q2ctyt", "height": 1, "replied_to": "t5_2tand_t3_q2ctyt", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "UnleashtheZephyr", "text": "This honestly just sounds like I'd written it. I'm literally so much like this. \n\nI haven't found anything that could help with this feeling of being on the road I've chosen just because I want others to validate me. \n\nI feel like I live my life for others. I got a bachelor in CS and now I'm doing a master in Data Science but honestly I just want to be seen as intelligent and have a comfortable wage to spend on good clothes, buying shit I like, having a good home, but I feel like all this stuff is just to be seen attractive; I struggle so much when studying it, takes me 3x the time others need for understanding concepts and I sometimes have big troubles with motivation issues regarding what I'm doing. I'm costantly complaining about classes and the fact that I waste so much time in class and then I still need to spend time searching for resources to study cause the class wasn't clear enough. It really got me thinking if this stuff is really for me and if I should be just doing something easier. \n\nI honestly only care about going to the gym and spending money on clothes, I dread the fact that studying and eventually having a corporate job will probably make it difficult to take care of my body and I'm scared I'll just waste away.\n\n--\nI look at all the time I study during the week and really wonder if this shit is really what I want or if there wasnt this need of being considered intelligent if id still do it and I'm not sure. Maybe I'd take an easier career with less anxiety, less work, less money. Maybe I'd do some social kind of work getting to know people, having an easier life, having fun. Do you really need all those material things money can buy? If it wasnt for this deep deep feeling of needing to appear attractive and well rounded I see through all the social norms and society imposed rules and I fucking hate them; I'm not a material person and I'm not about flexing expensive stuff or all that other bullshit people do all the time. \n\nWhat I came to the conclusion is that I'd be second guessing myself anyway every choice I'd end up making, so I'll try this path for now and then see if its still doable in a couple of years.\n\nThe downside is that I'm wasting so much time if it doesn't work, I wont be young forever.", "permalink": "/r/DecidingToBeBetter/comments/q2ctyt/everything_ive_done_in_life_has_been_in_the/hfkq3i5/"}