{"id": "t5_2tand_t3_f3028s_t1_fhhc7zk", "creation": 1581600568, "origin": "t5_2tand_t3_f3028s", "height": 1, "replied_to": "t5_2tand_t3_f3028s", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PornSuperhero", "text": "I know what you're going through. This was me in my early 20s. It started innocently enough over a holiday period where I didn't get out much. At the time I was perfectly happy being some sort of social Haley's comet but it spiralled out of control and went on far too long.\n\nWhen I realised how long it had been since I had spoken to my friends, I was too ashamed to even reach out. I convinced myself they would hate me for abandoning them.\n\nI didn't leave the house. I spend all my time playing single player games or reading. I was too scared to turn on my phone or check my emails and \"face the music.\" Too scared to log on to Steam, or anywhere someone could ask me questions. When the landline rang I would get *so* anxious it someone was calling to speak to me that I'd convince myself I was too tired to speak right now and would go to bed and sleep.\n\nAfter about 18 months of this, the loneliness was too much to bear and the fear of being alone forever overpowered my anxiety and embarrassment. I told my family I needed to see a doctor and booked a psychologist. Her guidance gave me the confidence to reach out to one of my old friends. He brought me back into the fold slowly, just online at first, and things improved rapidly. I'm forever thankful how understanding he was about the whole thing.\n\nThings have been normal for years but I won't ever forget how damaging and overwhelming that level of loneliness can be. It really creeps up on you. If you are on the fence about reaching out to an old friend, I hope I can convince you to make the first step. It changed my life almost immediately. I'm rooting for you, good luck.", "permalink": "/r/DecidingToBeBetter/comments/f3028s/the_importance_of_maintaining_a_social_life/fhhc7zk/"}