{"id": "t5_2tand_t3_p6dub1_t1_h9co9us", "creation": 1629244717, "origin": "t5_2tand_t3_p6dub1", "height": 1, "replied_to": "t5_2tand_t3_p6dub1", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DrHugh", "text": "I would suggest that you pay attention to yourself. What do you feel about relationships? How would you want them to progress?\n\nYou may think you want to be a casual-sex kind of guy, but then find you want to know more about someone, develop more of a rapport, before you get into sex. It is important to know yourself, and what matters to you. When you do, then it is something you can talk about.\n\nFor instance, let's suppose you find you want to develop a relationship over time, instead of jump into sexual activity early on. If you have an otherwise friendly relationship, you may find that some topics come up which are more provocative or suggestive...like what clothing you wear when you sleep (if any), or comments on the fact that both of you seem to single. I suspect that friendly hanging out -- like \"Hey, there's a new ice cream shop downtown, shall we go try it?\" -- occurs with greater frequency. There would seem to be more interesting in spending time together.\n\nWhen you have such a pattern -- and I think it is a pattern, not just a one-time thing -- then you have a basis to say, \"Is this heading to be more than a friendship?\" I think such a clear question is worthwhile, because it can avoid confusion.\n\nI had an encounter with a classmate in college who never directly indicated she was interested in me or seeking anything, but one night she and a friend stopped by a room which happened to be the dorm room I was in with a couple of guys. The floor had been for women the prior year, and her friend had stayed there. I was asked to come with them while they went to my classmate's dorm room and waited for her dad to pick her up for some holiday. I did, and she gave me a flower she had, but while she talked plenty, it was like she was trying to show she wanted me around through sheer silence. This was a person who hadn't even spoken to me outside of class before this night, and now was grabbing my arm while we walked, gave me the flower, and so on. It never went anywhere from there, either. I couldn't tell if I was just being used as a token or not.\n\nSo if you feel attraction for someone, and overtures of friendship are returned and encouraged, then you've got some reason to think maybe something could happen here. If you are unsure, you can ask for what they'd like in a relationship -- did they see themselves dating sometime? Did they want to get into an exclusive relationship someday? -- and then ask how they'd want to show they had such an interest. You give an opening for them to say, \"I'm telling you: I am interested!\"", "permalink": "/r/DecidingToBeBetter/comments/p6dub1/advice_for_going_to_college_and_putting_myself/h9co9us/"}