{"id": "t5_2tand_t3_p6dub1_t1_h9cexxm", "creation": 1629240104, "origin": "t5_2tand_t3_p6dub1", "height": 1, "replied_to": "t5_2tand_t3_p6dub1", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DrHugh", "text": "My college experiences go back to the mid-1980s, so Your Mileage will Certainly Vary.\n\nI went to a state university in the USA, so there were all sorts of activities available. I would be that new students will get invited to all sorts of things. Pay attention, and be selective. It is OK to explore new ideas, but you will probably be fine if you stick to activities that interest you.\n\nYour bigger challenge, actually, will be to not let these extra-curricular activities interfere with your studies. Make sure you keep your priorities straight. There are a lot more possible distractions these days than we had in the 1980s; heck, your cell phone is a procrastination dream machine. Don't surrender yourself to it without limit.\n\nAs far as talking with women (I'd suggest you get \"woman\" and not \"girl\" in your head, as it is safe to assume almost everyone is 18 or older), the secret is...don't treat them differently than a man. If you are simply being friendly, you don't have to do anything differently: Be respectful and interested, don't ask super-nosy questions, etc.\n\nIt is when you are interested in more than just being friends that the differences matter. That's where \"consent\" is going to be the important concept. Don't assume you know the answer; ask the question and find out what the answer is. \"Would you like to go to the student union and get some coffee?\" is better than assuming no one would want to spend time with you. But also, \"Would you like to have dinner in the cafeteria tonight after class?\" is another way to get consent to be together.\n\nAgain, you can look to how you deal with people you know. There's a concept of \"micro-consent\" which can work. Imagine you have a visitor. You may do things like, \"Do you have enough time to sit? Would you like me to take your coat? Can I get you something to drink? Would you like ice in that?\" You can see how you are nibbling at the information you need in order to handle the situation. You can do a similar thing with any person you talk to.\n\nThere are several questions you can always ask in college.\n\n* What's your major?\n* What year are you?\n* Where are you from?\n* What made you choose this school?\n* Do you live on-campus or off?\n* Do you have a job?\n* What do you want to do when you graduate?\n\nAny of those can produce all sorts of follow-up questions. For instance, \"What's your major\" may be easier if you find they share yours, you can then talk about classes of interest, or what the professors are like, and so on. But suppose they are doing something very different from you. You might then ask things like these:\n\n* What sort of classes do you have to take for that?\n* What kinds of higher-level classes do you have in that major?\n* What building do you spend a lot of time in for your classes?\n* What's the toughest class you've got right now?\n* Is it as good as you thought it would be?\n* What do you think you'll take next semester?\n\nAsking someone about themselves usually means you will get information that you can use to figure out another question.\n\nThese questions are the sorts of things people already have some answers to. You don't have to ask them if they plan to invest in 401(k) schemes, or where they want to live when they retire. (Though, my favorite question is always, \"What do you want to be when you grow up?\")\n\nIf you approach women as human beings -- in other words, just like men -- then you should be able to start and hold a conversation with a woman you've just met before class starts, or in some activity, or a party. You don't have to be suggestive or coy; while some people may be trying to have sex that night, you don't have to be one of them, and you will find women who are equally willing to develop a friendship before heading towards romance. (Though romance isn't a given, and some friendships are just that, and won't become anything more.)\n\nPerhaps the most important question you may encounter with anyone, male or female, is when you have a conversation that seems easy and enjoyable, and you'd like it to continue. In which case, you may say some variation of this: \"I have to get back to my room and study for a test tomorrow; I lost track of time talking with you. Do you want to exchange contact information? We could talk more about X sometime.\" If they do, great, but it doesn't mean they want to have sex with you. If they don't, they may just be private, and it doesn't mean they don't want to talk with you again; they may just prefer it be spontaneous rather than via some method where you can send them messages or calls. Learn to be gracious. \"I understand. If you see me around, say 'hi' if you like; I hope you have a goodnight! Take care!\"\n\nIn other words, let your interactions with other people be positive for you and them. Don't assume you know how they feel, and try to take the best approach to what happened.\n\nI hope this helps; feel free to ask questions.", "permalink": "/r/DecidingToBeBetter/comments/p6dub1/advice_for_going_to_college_and_putting_myself/h9cexxm/"}