{"id": "t5_2tand_t3_i9d7dm_t1_g1firnw", "creation": 1597404362, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Vanes-Of-Fire", "text": "You are obviously an intelligent and courageous person because you're not afraid of calling yourself into question and exposing your weakness.\n\nThat is a major step.\n\nHowever, the real work begins now. Not for the sake of your wife and family, *but for your own*. Being emotionally mature means opening the door to inner peace and happiness, though it may be a long process to finally reach there.\n\nStart with tiny steps every day. Here's one little exercice called the three C's : Co-operate, compliment and comprehend. They don't need to be followed in order or in any strict fashion, they're just examples to inspire you.\n\n**Co-operate**\n\nYou might want to ask your wife what you can do for her today. You might want to take out the garbage, but she may ask you to mow the lawn or get some groceries. Do it with a smile without making a big noise about how hard you worked. Don't expect to be thanked profusely, take it as a natural cooperative attitude towards your partner.\n\n**Compliment**\n\nPick up nice things about your wife and mention them to her. Notice her. Smile at her. Give her genuine spontaneous compliments. With time, these will come naturally to you.\n\n*Examples*\n\n\"Hey, that colour really suits you!\"\n\n\"My, that dish was so tasty! You cook this dish really well\"\n\n\"Thanks for your help\"\n\n\"Love your smile!\"\n\n**Comprehend**\n\nAsk her opinion about things without disagreeing immediately if they don't correspond to yours. Encourage her to express herself freely. This will help you express your emotions better as well.\n\n\"You didn't like this film? Was it due to ......(fill in any relevant subject).\" If her reply is unexpected, simply say, \"Hmmm, I never saw it this way...it's nice to have another view about this\"\n\n\"You don't like chocolate eclairs? Ha! ha! Those are my favourite! You prefer vanilla eclairs? Looks like we'll be buying that too from now on! I love it when you enjoy your favourite dessert\"\n\n\"Tell me more about your fun times when you were at school, I don't know much about this period of your life\"\n\nWishing you and your wife a happy life together.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1firnw/"}