{"id": "t5_2tand_t3_i9d7dm_t1_g1fh2qm", "creation": 1597402928, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 14, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "1seconddecision", "text": "R/emotionalabuse, r/abuse, r/justnoso are subs where you can start. Don't post or comment, but read what other's post and comment. The best way to learn and change is to learn and be active about it.\n\nPersonally I don't think you want to change, I think you want people to not see you as an abuser. All you talk about is about yourself, not how you've failed your wife. No, it's *I* feel sick, *I* don't want to be seen as an abuser. Fact is, you are and even in this post you continue to be by being selfish even though you're attempting to manipulate reality by saying it's for your wife but nowhere in your post you mention how your wife feels and how you've hurt her or affected her. You probably also think that if she doesn't \"nag\" you about certain issues, the issue is resolved. You probably think that if she \"starts up about it again\" is her creating drama and attacking you instead of her trying to resolve things. I wouldn't be surprised if your wife has a whole lot of pent up resentment towards you for every time you failed her as  husband. And the worst thing is is that you probably don't even care to realize this. For her it was a heartbreaking moment which she will carry around for days, weeks, months to come, you've already forgotten it because it was a moment between taking a shit and putting on shoes on a regular tuesday afternoon for you. \n\nYou want to be better, good. Start with accepting the fact that you are an abuser. How you feel about it is irrelevant. When you drive drunk and hit a pedestrian nobody cares how bad you feel, it's the same for this. Work from the ground up, don't put focus on how you feel and then claim you can't deal with emotions and feelings. You have no problem with emotions and feelings, you have a problem with the feelings and emotions of others. Anger is an easy emotion because it's easy to react to and it's justifyable to react to anger with anger, while anger in this case probably comes forth from resentment and pain. If your wife is angry at you, it's because you refuse to hear her, see her, value her, respect her. You abuse her and then stomp down her being upset at the abuse. Do with this what you will, but if you really want to be better, you'll have to acknowledge that you abuse her and then double down on abusing her when she gets upset about your mistreatment of her.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1fh2qm/"}