{"id": "t5_2tand_t3_i9d7dm_t1_g1erz5x", "creation": 1597380228, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 65, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "realperson67982", "text": "Let me start with the bad: in which I will present to you a radically different way of interacting with the world to underscore how unhealthy and painful the way you have been acting is. This comes from  years of working on myself, reading about psychology and spirituality, a psychology degree, ~3 years of therapy, 2 years of daily meditation, 10 days of living as a monk would, and a month of living in a community focused on close relationships, mature communication, emotional vulnerability and authenticity—up in the mountains with no cell service. And 6 months working in mental rehabilitation for juvenile offenders.\n\nSo,\n\n1. It’s abusive to go through your wife’s search history. Absolutely not okay.\n2. I find manipulation of any type morally abhorrent. If I catch a friend attempting to manipulate me, I immediately lose all trust for that friend and drop them from my life all but for superficial purposes. This is what healthy people do.\n3. \n\n> I have always thought highly of people who could bend the will of others in their favor. I thought that as the manipulator, you were always the smart one. You were in control. You make it a point to win. Always one step ahead of others.\n\nThis is extremely worrying to me. It’s a very selfish way to live. You probably, as you said, picked this up from your family as most people who think like this do. It’s not your fault, or theirs. But you are absolutely responsible for your actions and the immense pain that you have likely caused your wife and others around you. As well as yourself—all those emotions you’ve been ignoring. Fulfillment does not come from winning, but relating. That’s a scientific fact, for your rational mind. I’d actually recommend studying psychology if you want to understand these things more.\n\n4. Acknowledging this pattern may be extremely hard to move on from. Your wife will deserve lots of apologies, listening, and trying to understand. Allowing her to be emotional and withholding your anger. You’re honestly probably not at a point where you can do this with integrity. And that probably won’t go over well. You’ll make mistakes, and you’ll have to be accountable for those mistakes. It won’t be easy. \n5. If she stays with you, you should consider yourself incredibly lucky. You are the man, [edit: to clarify, you are more physically imposing, dangerous, disposed to violence, and given more power in our society.] You have a responsibility to [use this privilege] to protect and lead your wife in a safe and loving direction. You appear to have taken this power given to you by nature [and society] for no merit of your own and used it irresponsibly, manipulating her as an object rather than relating to her as a human.\n\n\n> The descriptions fit me. I felt nauseated. I was tensed and felt like shit. \n\n> I was overwhelmed by emotion and felt sick to my stomach. I've never wanted to be associated with any form of abuse..\n\n6. Let me be brutally honest: I’m skeptical. You were overwhelmed with emotion... because you never wanted the term emotional abuse associated with you? Not because of the pain your wife is probably in as a result?\n\nIf so, this is nothing more than manipulation and reputation management. Be honest with yourself. How much of this emotion comes from damaging your reputation both to others and yourself?\n\n> I want to be better.. I want to change.. I want her to be happy.. I want to be the person she deserves..\n\nHere’s the thing about not manipulating: you don’t get to decide if she’s happy. And she won’t be a lot of the time, and that’s the thing. You learn to love that, in yourself and in others. \n\nBeing the person she deserves? That’s much better sounding. It sounds like you may actually care about her. \n\nCaring about others is not what many people in the states (idk what country you’re in) believe it is. Lots of relationships are unhealthy. Caring about others is wanting them to express themselves and find fulfillment in the ways that are best for them, according to them. It is letting *them* decide what is best for them. It’s not up to you. It is accepting them exactly as they are. This is why manipulation is quite literally the opposite of love in my view. Manipulation is trying to mold someone to who you want them to be, or assuming, arrogantly, that you know better than them on the one thing they know most about in the world: themselves. And taking power over them through dishonest means to arrogantly exert power over them. Stop. Manipulating people. Period. That includes yourself.\n\n\n\nThe good news:\n\nI’m so surprised to hear you say all of this, because people that act the way that you have described, manipulating others, always trying to win, and eschewing emotion, never seem to admit these things—much less express a desire to change. That really is huge. It is an act of vulnerability even to begin this. Great job on that. This shows hope, and you do seem to, on some level, not understand what you’re doing.\n\nEdit: continued in reply below.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1erz5x/"}