{"id": "t5_2tand_t3_i9d7dm_t1_g1fakdv", "creation": 1597396654, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "notsopumpkin", "text": "Good on you for recognising that you need to do better for her.  Not going through her search history, so she can feel comfortable and secure that her privacy will not be invaded/ used against her may be a good start.\n\nI think communication is key, if you aren't comfortable with it at first schedule it.  Make an \"appointment\" if you have to *Sunday night is communication night* for example.  On this night you force yourself to step outside of your comfort zone and share things like thoughts and feelings that you wouldn't normally.  \n\nI suggest you start with *\"I am sorry I feel like sh*t, I went through your search history and found........ It made me think about myself and how I have behaved up until now.  I will try harder, I will research this and try my best to change these behaviours.  From here on I'd like you to work with me.  If you feel I am using manipulative tactics, let me know, if you see me shoot off the deep end for no reason, kick my ass out the door to go for a walk to calm down.  \n\nI'd like Sunday's to be communication night, where we can each share our feelings and thoughts in a safe environment, not to be used against the other or to upse the other.  If one of us starts to feel attacked or upset, we have the right to end the conversation so that we don't go to bed angry.  I want to be the best man I can be for you and for us.\"*\n\nI think you'll need to engage her help with this if you aren't in a position for therapy at the current time.  \n\nI'd also speak with your GP, lots of places can provide you with 5-10 free therapy sessions if referred by a GP.\n\nThe internet is full of support groups, subreddits and other random areas of other people with similar issues that are also trying to be better.\n\nFeel free to DM if you ever need to blow off steam or want to chat to someone anonymous about it.\n\n**Good luck mate.**  It's great that you want to be better, rather than accepting this or using your new knowledge to your advantage.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1fakdv/"}