{"id": "t5_2tand_t3_i9d7dm_t1_g1gmjht", "creation": 1597425356, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "YardageSardage", "text": "It's okay that you feel shitty and lost right now. This is part of the process. \n\nStart by thinking about the emotions that you're feeling right now.  Could you point them out on a chart like [this](https://thewritingchimp.files.wordpress.com/2015/07/gpabwox-imgur.jpg) or [this](https://blogs.flinders.edu.au/student-health-and-well-being/wp-content/uploads/sites/71/2019/06/The_Junto_Institute_Emotion_Wheel.jpeg)? Could you rate them on a scale of 1-10? Try writing it down in some kind of journal; or if that seems intimidating, even in a text document you can delete or on a piece of paper you can throw away. Just start practicing noticing the things you are feeling, and describing them to yourself.\n\nNext, instead of running away from an emotion that feels bad, try just sitting with it for a moment. Do some reading about [emotional awareness](https://kidshealth.org/en/teens/understand-emotions.html), and think about what you think your body and mind are trying to tell you with this feeling. Is something bothering you that you don't want to admit to yourself? How could you describe what's bothering you using [\"I\" Statements](https://www.goodtherapy.org/blog/psychpedia/i-message)? You might find that, like getting a shot, the fear of actually experiencing the feeling is worse than the actual feeling itself. Let yourself feel it, and then let it go.\n\nThere are lots of great resources and exercises out there for understanding your emotions that you can find on the web and try out, even if you don't have a therapist to guide you through them. And don't shy away from ones for kids or teens, either - you might genuinely find something helpful, so don't be proud.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1gmjht/"}