{"id": "t5_2tand_t3_i9d7dm_t1_g1fdjlw", "creation": 1597399569, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 16, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "roxieh", "text": "Feeling like a child regarding emotions is natural in your position - it's okay, try not to beat yourself up about it. It's the emotional equivalent of the guy who never moves out of his parents' place and has his mum and dad look after him while he just plays video games all day. It's going to be a learning process, and at times it's going to be painful or difficult or you'll get it wrong... and that's okay too.\n\nFor what it's worth, I'm really proud of you. It can't be easy coming to those realisations.\n\nThere are a lot of lessons regarding emotions that no one can teach you and that you'll have to learn yourself. But try to remember that painful (\"negative\") emotions are not bad. If you burn yourself on the oven and feel the pain of that, we don't say that's a negative reaction to being burned - it's a normal one, one we cannot help at all, and the best we can do with a burn and the pain of it is soothe it. The pain itself is the body's way of saying \"ALERT, SOMETHING IS WRONG\", and it's similar for the painful emotions. Sometimes that thing that's wrong can't be helped - like a loved one dying, or losing a job. Sometimes it's something simpler, like someone cut you up while you were driving, or you forgot about an important appointment. Or maybe there is no \"something\" and you just feel a bit crap - that happens too from time to time, because emotions and hormones are complicated!\n\nMy point is that, try to separate the word negative/bad from painful. The painful emotions - anger, fear, sadness and all of the devolutions or combinations - serve a purpose, just like feeling physical pain does. It's not always pleasant to live through, but you can't help your emotional feelings to stuff, and it's important to let yourself feel those things when they happen. it's *okay* to be angry, or sad, or embarrassed, or upset, or grieving, or whatever it is. What's not okay is to lash out (with actions) because of the way you feel. Actions are controllable, emotions are not. And it'll take you a while to learn how best to cope with your emotions, but you've made a great step here. \n\nAcknowledging how you feel out loud can be good \"I'm really angry/upset right now, give me some space to calm down\" etc. It can help.\n\nYou can do it! Good luck.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1fdjlw/"}