{"id": "t5_2tand_t3_i9d7dm_t1_g1g42re", "creation": 1597416993, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "YardageSardage", "text": "If you ever want real change, here is the thing you're going to have to do: you're going to have to become okay with being vulnerable. Emotionally, and socially, and intellectually. \n\nThat feeling when you \"win\" an encounter with her by manipulating her into what you want? **Every single time you do that, you are _losing_ the opportunity to build a REAL RELATIONSHIP with her.** The kind of relationship that you probably find hard to understand since you unfortunately had no one to model it for you growing up. A mature and healthy relationship levels up and becomes stronger every time you are able to openly share your needs and emotions with each other, because trust makes trust and love makes love, and because by sharing your flaws with each other you can cover for each others' weaknesses both become stronger. Every time you pick the easy road by covering up your vulnerabilities with manipulation, you are throwing a chance to grow into the garbage, as well as actively hurting your wife.\n\nYou've got a lot of emotional growth to do, as you know. And that's scary. It's going to feel terrible. You're going to have to face all those feelings that you thought you were \"throwing away\" all those years, because it turns out that you were really shoving them all into a box and hiding them in a closet of your mind. You're going to have to *truly* humble yourself, and give up on all of your notions that you're better than other people. You're going to have to catch up on those 20 years of emotional development that you missed out on. Are you ready to commit to these things? Are you prepared to swear off of the path of least resistance (i.e. manipulation), for good? How badly do you want to change?", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1g42re/"}