{"id": "t5_2tand_t3_i9d7dm_t1_g1g1bzp", "creation": 1597415678, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "coffeeTTTandthee", "text": "This is fascinating, and I applaud you for reaching this level of self-awareness and recognizing that there is a problem.  \n\nThis will get buried, but I just wanted to emphasize the point of examining your past through therapy and/or self-reflection as others have encouraged.  \n\nYour sense of safety and comfort in the world seems to be built around your ability to think and manipulate yourself out of any situation, but there are two things that you might want to consider.  \n\nOne, by reaching out to Reddit, you have already short-circuited this cycle, but I want you to be cautions about the temptation to think and manipulate yourself out of this.  If you believe that manipulation equals power, there tends to be a resistance against others manipulating you, which can make it hard to accept therapy.  Why?  Because you might believe that a therapist will manipulate you.  In other words, when you grow up normalizing manipulation, you recognize it all around you.  But, in reality, a lot of what you are doing on a macro level is manipulating YOURSELF with this mindset.  \n\nIt is like the movie Fight Club - Tyler Durden does not want the narrator to recognize that he is manipulating himself, because then the narrator could reject Tyler Durden and short-circuit his plans.  \n\nTwo, as you noted, this behavior is not learned.  I would bet your mother treated you the same way, which is not a judgment against her because she did what she had to do.  You probably mean well too.  But, as you are finding out, it is your behavior, and not your intent, upon which you get judged, and no amount of manipulating the world will create a dynamic where you can dominate people for the sake of \"meaning well.\"  \n\nGrowing up in the environment you did, I think it is helpful to examine whether you had to be responsive to your mother's emotions (including rage, which is designed to create false urgency).  I think it is also helpful to examine the pain of never truly having a voice and free will while being manipulated at home, because this can manifest itself in present-day.  In other words, if you feel like you have paid your dues being manipulated, there is a certain entitlement you start to feel in which you take it as your god-given right to treat others the same in order to atone for your past suffering.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1g1bzp/"}