{"id": "t5_2tand_t3_i9d7dm_t1_g1gh1ta", "creation": 1597422920, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bananaphonezone", "text": "Well, this brought up a lot for me as someone who grew up seeing a father emotionally abusing my mother and later on had an emotionally abusive partner...\n\n* **Yes, you are harming your wife** \\- If I knew someone in a relationship like the one you described in the position of your wife, I would probably recommend they leave tbh. Your wife may leave, and if she does, she is justified. You have to remember, this didn't just pop up now or the last few months. It's been building over the course of your relationship. If she does leave, understand it, and still committing to working on yourself, for the sake of your children if nothing else, but also for yourself. If she doesn't, have humility and gratitude she's willing to stay. Honor that by committing yourself to being better. This isn't about you and how you are labeled or seen. It's about the impact you are having on her.\n* **You are also harming your children** \\- Being present for your children and providing for them materially is important. But just meeting that low bar doesn't make you a good dad. The relationship you model for them and the lessons you teach them about emotions and how to treat others will impact their lives. Also, in the way you shut down your wife, you likely also do that to your kids or teach them they can't be their full selves with you or maybe ever, whether you know it or not. \n* **Prepare for a long journey of self growth, this will not be a quick fix**. - It's great you realized you are emotionally abusive! But your work doesn't end with a realization or even an apology. Buckle up for the coming years of work on yourself. Like you acknowledge in some comments, when it comes to emotions you are still at the level of a child who has never been taught. So you have decades of \"growing up\" to do in the emotional realm. Not being taught as a child wasn't your fault, but what you do now is your responsibility, especially when it comes to how you treat others.\n* **Your worldview and value system need an overhaul** \\- The fact that you see feeling emotions and expressing emotions as weakness is a deeply entrenched value system you have that needs to be unlearned. We all have emotions. They give us important information. By feeling them- the painful ones and the pleasurable ones- we connect more deeply to the fullness of life. We also connect more deeply with others when we (healthily) share our feelings and hold space for theirs. You definitely don't get to control/shut down someone else's emotions or how they express them. The fact that you see your wife expressing hers and crying as \"baiting you\" is very disturbing and, yes, abusive. Many of the traits you describe are sadly rewarded by unhealthy societies and men in particular are taught to be cut off from emotions, to be focused on winning and power over, to value logic only, etc. We do a disservice to men in this. Also you, like many men, may believe you are only \"logical,\" but all of the (mostly) men who claim to only be logic driven are also being driven by emotions - ALL humans are- but are just not in touch with that process, unlike how most women are socialized to be. The dichotomy of logical/rational vs emotional is a myth. It's also of note that many of the so called \"logical, not emotional\" men just funnel all their emotions into anger, an emotion that is a mask for many other emotions often... It is mentally and even physically unhealthy to repress emotions. Also, the point of life isn't to \"win\" over others or to have control (or a false sense of control, because we don't have 100% control in life, and yes that's scary). In the end, that is a salve for an insecure ego (whether you are in touch with that insecure, scared, sad part of yourself or, more likely, not), but in the end it does not lead to deep fulfillment, joy, connection, and meaning in life.  \n* **Therapy** \\- It is really unfortunate that therapy is not easy to access. But this is an emergency. You need to work with your wife to see where you can adjust your budget to be able to go. What things can you personally give up? You may chafe at this, but I would recommend highly going to both individual and group therapy. For individual, don't do CBT, though it may help other issues. You need something that will help you explore your past and how it got you here and help you build a connection to your emotions and the skills to express them, perhaps psychodynamic therapy. Finding the right therapist is hard work, but it is critical; utilize the free consultation call they offer. For group, maybe a men's specific group that is working on these issues or a therapy group called a \"process group\" where group members will give you feedback about how you show up with others. Again, therapy isn't a quick fix, you will likely need to be in it for years, if not decades.\n* **Read, read, read (& reflect & write)** \\- Read books on relevant topics such as: the impact of emotional abuse, those targeted towards abusers, trauma and cptsd, attachment and attachment trauma, emotional intelligence and how to feel/accept your emotions, self compassion, interpersonal skills, etc. And yes, it will take years to get through all these books. As you read, take in what your reading, journal about what it brings up for you, how it relates to you, and how you can use your learnings to shift your behaviors. Share your thoughts in individual therapy and group therapy.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1gh1ta/"}