{"id": "t5_2tand_t3_i9d7dm_t1_g1f19uc", "creation": 1597387553, "origin": "t5_2tand_t3_i9d7dm", "height": 1, "replied_to": "t5_2tand_t3_i9d7dm", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Benvolio_Knows_Best", "text": "Reading your comment I’m struck by how much it reminds me of my ex. He would probably have the same opinion as you about manipulation and intelligence and he 100% was shut down in terms of emotion. I am a human that expresses my emotions quite freely and fully, he was not. I’d be faced with a shut down stare, and then some advice about practical solutions - much like yourself. There were other reasons why we broke up but before we did my counsellor suggested a book to me that really opened my eyes to the dance my ex and I were doing, what was going on in the space between us that meant I was searching for emotional attachment in him, where he felt unable or unwilling to provide that. The book was called “How We Love” by Kay and Milan Yerkovich. I will preface this recommendation by explaining that they’re both counsellors/therapists via a church (and so their background is a religious one) but at no point do they try and preach to the non-religious reader. I highly recommend this book as it will be an eye opener. I recommend your wife (if she is comfortable and able to, and if the situation is such that she feels she wants to carry on with the relationship) also read it. \n\nThis is not to say that it will solve all of your problems straight away, BUT it will give you insight into you’re love style (how you approach relationships), it will get you thinking about your beliefs around emotions and how they impact your relationship and might actually start to help you express more emotions (other than just anger). \n\nYour problems may go deeper than this book can provide answers for so therapy, if affordable, is a must. That said it may be helpful to you. I wish you and your wife well.", "permalink": "/r/DecidingToBeBetter/comments/i9d7dm/i_recently_found_out_that_i_am_an_emotional/g1f19uc/"}