{"id": "t5_2qh5i_t3_eka2lr_t1_fdad9t8", "creation": 1578244765, "origin": "t5_2qh5i_t3_eka2lr", "height": 1, "replied_to": "t5_2qh5i_t3_eka2lr", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Lord-Smalldemort", "text": "Well... since you asked haha. Enjoy your novel.\n\nIn 2019 I had work problems, like dealing with violent schools and being trapped in them as a “Teacher“ where they were gun threats, teachers getting concussions, all sorts of stuff. 60 day resignation was my only option to leave. Or I’d be faced with being blacklisted and incurring a good deal of professional consequences. I was thinking, “how is this awful place going to ruin my opportunity moving forward? I guess I just need to show up another two months and literally risk getting hurt, not to mention I’m complicit in child abuse by working here. But I will risk my future opportunities in my career if I don’t come to work every day.” So I finished my 60 day resignation period on January 3. Part of 2020 being such a refreshing new opportunity is leaving behind a job that tore me apart every single day. \n\nIn 2019 my estranged best friend killed herself in early June in a really brutal way, making it even more tragic. It compounded into incredible guilt because I was the one who made the relationship nonexistent. She was extremely sick and I couldn’t be close to her, which is why it wasn’t a surprise when she ended her life, but didn’t take away from how bad it made me feel that I abandoned her. But it was like an episode of intervention, I can’t love you to death kind of thing. It didn’t matter. \n\nIn 2019 I fell in love with someone who sold me on mutual love, but it turned out he was in another relationship and living with her and lying to me every single day. It felt like something out of a movie. He had been with someone for over 2 1/2 years, dead bedroom, probably still headed for marriage anyway, but was kind of secretly planning to escape that life and then come be with me eventually. The cowards way, about as cowardly as it gets. I found out he was living a double life eventually and exposed him. However, the distrust and anger it left me with is unlike anything I have experienced, even if it was a brief relationship compared to the 2 1/2 years that other chick wasted.\n\nIn 2019 I slipped in my kitchen and hit my head on my counter while falling backwards to the ground July 28, and sustained a gnarly little concussion. Besides having severe cognitive issues, I couldn’t really recover since I was going to an environment where I was almost hit in the face every day, and I was in a good deal of emotional distress. I’m still having memory issues. It also messed with my emotions. My recovery has been hampered by my job and buy the consistent stress I was put under by some piece of trash who I never should’ve dated in the first place (but I maintain I only dated because I was suffering from a severe concussion when I met him lol)\n\nFinally, I’m already full-time manager of major depressive disorder so all of that should I just described, it was just probably worse because I’m already likely to feel like garbage about everything or fall into a really nasty little episode where I’m dead inside and numb. I manage things really well for the most part. But the day you find out you’re a side piece to some jack ass living a double life, you just can’t help but get depressed. And then knowing that your best friend died of depression and you abandoned them because their depression was killing you and have made your depression worse, well let’s just say that was like a depression orgy in my head. \n\nTo be clear though, I’m not a victim, I’m not a sap, and I don’t feel bad for myself. 2019 was rough. I picked some real winners to date, I had some really unfortunate circumstances happen, and I worked in some places that really chipped away at my professional worth and career. I’m already set up for difficulty with having a long-term struggle with depression that’s sort of always going on in the background. But I don’t have time for pity, because I know my mindset is everything. I’m not a defeatist even slightly.\n\nI can and I will make this year better. I don’t believe in feeling regret. I think it’s a wasteful feeling. Turn it into growth and move forward. So that’s where I stand.\n\nThanks for asking :)", "permalink": "/r/happy/comments/eka2lr/2019_was_incredibly_rough_but_im_feeling_really/fdad9t8/"}