{"id": "t5_2tand_t3_k3i8n4_t1_ge3mlld", "creation": 1606697109, "origin": "t5_2tand_t3_k3i8n4", "height": 1, "replied_to": "t5_2tand_t3_k3i8n4", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DiscoButterfly", "text": "Starting out at the level you described, your workout should be very simple and only consist of pushes, pulls, legs, and mobility. You should also do basic cardio on the side to help you build cardiovascular endurance and lose weight. It should look something like this:\n\n**Pushes:** Wall push ups 3 sets of 40. (Find an angle on the wall where you can do 40-45 maximum in a set). To do this, stand in front of a wall, lean towards it slightly and then push back to standing position. \n\n**Pulls:** Get a thin resistance band that weighs 20lbs (it will say on the band), sit down, attach it to your feet and pull it back for as many reps as you can, then repeat for 3 more sets. If you're not flexible enough to sit down in an L shaped position then put some books or boxes between your feet and the band so you can bend your legs while keeping the band far away from you. \n\n**Legs:** Do 3 sets of 3-50 (as many as you can) bodyweight squats, try to go all the way down when you do them. Again this number is variable because it depends on you. If you cannot do a squat or find it too difficult, try climbing up stairs 2 at a time (slowly) or sitting down on a low chair and getting up without using your hands to help you then sitting back down\n\n**Mobility** is also important so make sure you are doing the upper body exercises correctly for maximum effectiveness and lowering chance of impingement or injury. Look up video examples of \"Scapular mobility\" during pushing or pulling exercises and make sure you do that while doing your wall push ups or band rows. \n\n**Cardio/endurance:** After your workout, go for a walk as far as you can go and back, then speed it up every time. Time yourself and try to beat your record by a few seconds each time. \n\n**Diet:** Eat less. It's simple as that. Try intermittent fasting and lowering your meal portions for every meal. Do not snack too often, do not eat junkfood, do not eat too much sugar. Focus on eating complex carbs (whole wheats, grains) and lean protein.\n\n**Do this routine every 3 days to start off, then eventually every other day. Keep active on rest days and don't be a couch potato, just stand up and walk around your house and do chores for the sake of activity rather than sit down all day.** Let me know if you have any questions.", "permalink": "/r/DecidingToBeBetter/comments/k3i8n4/im_looking_for_an_absolute_beginners_guide_to/ge3mlld/"}