{"id": "t5_2tand_t3_k3i8n4_t1_ge5ibl9", "creation": 1606748535, "origin": "t5_2tand_t3_k3i8n4", "height": 1, "replied_to": "t5_2tand_t3_k3i8n4", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SpideyTingle", "text": "Go to a gym that has fitness classes. Look for a class called Body Pump. You can start at any level you want.  It uses weights on a weight bar, as well as dumbbells etc.  When I started, I literally started with no weight on the bar.  Body weight squats are a lot when you are starting at ground zero, which is where I started.   You do legs, back, abs, biceps etc. It's an hour class and there is about 5 minutes on each body part, along with a warm up and a cool down. For each move, you put an appropriate amount of weight on the bar.  For example, when  you do squats, you're working with your thighs, which are your largest muscles on your body, so bigger weight there (once you're ready). Biceps are smaller muscles, so you need about 1/2 the amount of weight to be able to complete the move over the duration.\n\nFor almost every move, there are options. More advanced options if you want to go harder, but more importantly from your perspective, LESS advanced/easier options.  Just show up 3x a week and do more weight as you can.  There is a social aspect too.   You'll make friends (just gym friends maybe, but it's better than nothing) and you'll progress and learn about how much you can do and you WILL surprise yourself in how hard you can go, once you've been doing it a while (a couple months at 2 or 3x a week).\n\nYou'll be sore after the first time you do it. So do it Monday and then Thursday or whatever. Once you get used to it, I just do Monday, Wednesday and Friday.  There is some cardio in it too, so it's one of the best bang for the buck exercises you can do.  No thought required, just show up a few minutes early, get your stuff ready, stretch a bit, then do what your instructor tells you. Bring water also. You'll need it.  Good luck! PM me with any questions. I started with Body Pump (aka Pump or BP) in 2006.  It changed my life. YOU GOT THIS.\n\nYou'll be confused and intimidated, there will be fit people in there that know what they are doing.  EVERYBODY STARTS THERE and no one will look down on you. Once you've done it a couple times, you'll have it down.", "permalink": "/r/DecidingToBeBetter/comments/k3i8n4/im_looking_for_an_absolute_beginners_guide_to/ge5ibl9/"}