{"id": "t5_2tand_t3_gal9nu_t1_fp2kd7j", "creation": 1588263250, "origin": "t5_2tand_t3_gal9nu", "height": 1, "replied_to": "t5_2tand_t3_gal9nu", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lavendrambr", "text": "I needed this too! I take this as yet another sign. Since I started thinking about college sophomore year of high school I had no idea what I wanted to major in or what career I wouldn’t mind slaving away in. Since age 10 I knew I wanted to be a writer but as I got older I saw how much my parents struggled from dead end/odd jobs (my dad didn’t get his GED and my mom was in college part time from 2003-2014 to get a bachelors) and how hard it can be to make money from writing, so I decided back then I needed to go to school for a backup passion in case writing didn’t work out. I’ve struggled a LOT finding just the right subject to major in as my backup. People put a lot of importance on STEM majors and make the arts seem exclusive and unattainable, so most people ignore their artistic passions and try to go for more socially acceptable jobs. Thanks to that I haven’t been focusing on my writing that much the last 5 years, instead focusing on working full time since I’m on my own and my nutrition major that I decided to pick because I’m interested and can see myself doing that as a job. Now in quarantine I’ve been doing a lot of thinking and I’ve realized minimizing my writing to just a hobby instead of my passion has been detrimental to my skill and improvement. Writing and creating is what truly makes me happy and fulfilled, not sitting at my desk taking phone calls, not 8 science classes I still have to take for my major, not making coffee for entitled people, not cleaning up after others, etc. So because of these factors I’ve been pondering recently, I’ve really been considering switching my major to English/lit/creative writing (something along those lines) and just focusing on my writing so I can improve again, and then hoping I can get a job with my degree when I eventually graduate. Really the only jobs I know of English majors getting are teaching or editing jobs, so does anyone have any suggestions for me for after I finish school? I wouldn’t mind editing at all but I don’t really want to be a teacher anymore. Anyway, thanks OP for the sign and inspiration :)", "permalink": "/r/DecidingToBeBetter/comments/gal9nu/what_do_you_want_for_yourself/fp2kd7j/"}