{"id": "t5_2tand_t3_p5e57j_t1_h97w5ko", "creation": 1629154394, "origin": "t5_2tand_t3_p5e57j", "height": 1, "replied_to": "t5_2tand_t3_p5e57j", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Thick-Resident8865", "text": "Short story. 18 years in the wrong relationship. He wasn't good for me. I met him coming out of a drug detox, big no-no.\n\nHe was smooth talking, a gentleman, sensitive, generous, and caring. \n\nAnd then a nightmare. Controlling, manipulative, self-absorbed, he was emotionally detached. The latter the biggest issue of all. \n\nI stayed in because of passive/aggressive manipulation. He pushed and pulled each time I tried to get away. I admit I was vulnerable and weak. \n\nHe asked me to marry him in 2007 when I was trying to get my head together and break away. Interestingly enough he never followed through (luckily) and still talked about it to the end.\n\nI moved, changed jobs, self-medicated, did some stupid financial moves, and did not respect myself in any way. I set boundaries for him and ran over them myself!\n\nSick stuff.\n\nFinally in 2019, 18 years later, after tremendous emotional pain manifesting into physical pain and malady (yes this CAN AND WILL happen eventually) I found the courage (big girl panties, balls, courage, fortitude,  however and whatever you need to do it) to walk through the pain and guess what? I'd been mourning and grieving for so long, and living in self induced (and his stuff) pain for so long it took about a week to look myself in the mirror and say \"I'm not so bad after all, I can do this...\"\n\nIn late 2020 I reconnected with a high school crush. We married. I'm living my version of happily ever after. \n\nHad I not found the courage my world would have stayed toxic and small. \n\nThat old relationship robbed me of some of the best years of my life. I'm 63 years old. It took me a lifetime of bad relationships and the final one prior to marriage breaking me to the core. I was prepared to go the rest of my life alone. If I had to today I could do it.\n\nNo it isn't easy. But the reward of walking through your pain will yield you opportunities you can't see or take advantage of right now. Take the step. You won't regret it.\n\nGood luck. I'm rooting for you.", "permalink": "/r/DecidingToBeBetter/comments/p5e57j/how_do_you_let_go_of_a_person_you_know_is_not/h97w5ko/"}