{"id": "t5_2tand_t3_p5e57j_t1_h99kagt", "creation": 1629187790, "origin": "t5_2tand_t3_p5e57j", "height": 1, "replied_to": "t5_2tand_t3_p5e57j", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Lost-Organization405", "text": "A few things…\n\nFirst off, trust your instincts. If it doesn’t feel right… it’s time to walk away. As much as it hurts… keep reminding yourself that you deserve happiness. \n\nSecond, I would absolutely go see a therapist. It’s always good to have an impartial voice to help you sort through the tricky gray area parts of life. I know it has been an enormous help for me to gain an outside perspective on some situations that I really really needed it. \n\nIf I could give one piece of advice for an exercise, wait until you are feeling particularly unhappy with this person’s actions or behavior. At that moment, write yourself a letter explaining why you are upset with them, and why you know that leaving is the right thing to do for your own sake, and that you deserve better. Don’t be afraid to be as real and visceral and unfiltered as possible… it might just save you later. \n\nI have done this exact exercise for a similar reason, and I still to this day find it extremely helpful to go back and read the letter to myself when I am starting to once again doubt if I made the right call.\n\nLastly, I just want to say that you have done a great job in acknowledging that this is not working for you, and for seeking help. It takes a long time to get to that first part, and sometimes even longer to accomplish the second. You have taken some amazing first steps just by questioning, and you should be very proud of that. Your desire to love yourself if a powerful thing, that desire is what will lead you to a better life for yourself.\n\nKeep fighting. Keep working. You may be further along this path than you realize, I speak from personal experience. There is a light at the end of this tunnel, and you are already pointed in the right direction.", "permalink": "/r/DecidingToBeBetter/comments/p5e57j/how_do_you_let_go_of_a_person_you_know_is_not/h99kagt/"}