{"id": "t5_2tand_t3_q33ihh_t1_hfpwdow", "creation": 1633608364, "origin": "t5_2tand_t3_q33ihh", "height": 1, "replied_to": "t5_2tand_t3_q33ihh", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Youarethebigbang", "text": "Totally respect your thoughts on meds, you know you better than anyone does. I'm more familiar with their effects on anxiety than depression, and I've seen them help with short term anxiety just to get through a crisis period. Since some of the same drugs treat both conditions, maybe there's a spill over effect for some people that buys them time till they find an alternative solution, I don't know. \n\nAnd regarding alternative medicine in general, and maybe supplements in particular, personally I use Chinese herbs for an unrelated chronic illness that happen to be much more effective, but also stronger and potentially more dangerous, than many Western rx pharmaceuticals. \n\nThere absolutely could be supplements out there that help you, you just have to be cautious, and likely none of them are a substitute for professional help as soon as you can/however you arrange for it. If you're truly deficient in something that helps with depression, let's say a vitamin or mineral or whatever, obviously you'd want to find that out and get that level up somehow through diet, supplements, or whatever it takes. Generally though as you experiment, the best idea is \"Everything in moderation\", as they say. \n\nI don't know if I was ever depressed by definition, but I definitely had symptoms for years and had a completely negative outlook on nearly everything in my entire 20's. Then I moved from a northern environment where the sun rarely shined to an extreme environment in the desert where we get sunshine 350 days of the year. I went from feeling depressed every single day to literally not even remembering the last time I felt that way. And it stayed like that for years with really only that one change. \n\nWhat confirmed it was I looked back and remembered I vacationed here twice a year pretty much throughout my twenties and I always felt great when I was here, but simply attributed that to the fact that I was on vacation. Really I think the sunshine was the majority of the reason. Just a long story to prove at least in a moderate chronic case, didn't even need supplements, mother nature provided all I needed just fine. \n\nObviously we're all different and can have way different levels or degrees of any condition that afflictis us. I hope you find what works for you.", "permalink": "/r/DecidingToBeBetter/comments/q33ihh/how_to_stop_feeling_nothing_and_depressed_all_the/hfpwdow/"}