{"id": "t5_2tand_t3_p8kns9_t1_h9wxmbg", "creation": 1629643662, "origin": "t5_2tand_t3_p8kns9", "height": 1, "replied_to": "t5_2tand_t3_p8kns9", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "RoomForImproov", "text": "I'm hoping to improve on my entire life structure. I didn't really develop the independence and sense of self that comes from encountering life on your own and doing what you want to do. I know I'm far behind  just the general feeling of being an adult and obviously a big part of that is relationships. I never had a scenario where I could take a woman home from a bar/club/party, or just being able to go on dates without my mom asking me \"where are you going\".\n\nThere were numerous times where I wanted to do things and my mom made me feel guilty about it. She was/is one of those overprotective parents who tried to guide my life path subtly in a specific direction. I guess it's her projecting her fears onto me or me being an only child, but I lived a relatively sheltered existence until I went to college (which fucked me up when it came to girls).\n\nOne example was me wanting to solo travel in 2016. At that time, I had the money I saved up, I took the time off from work so I was just going to go to a destination - solo. I don't really see any problem with this, it's more of a thing where why wait around for people to make up their minds whether they're coming or not and just go yourself. Well, she had a problem with it - she gave me an earful and made me feel as if it's a stupid idea.\n\nSomething similar happened recently where she said something along the lines of \"why would you travel all the way out there\" (I wanted to go vacation in California), it's COVID, the delta strain is rising, you're going to get it and bring it back home - blah, blah, blah. Basically an excuse.\n\nIt's not that I don't love my mom, but I know I need to create a sense of separation. I think it's a slightly codependent relationship where I was used to fill the vacuum of a grounding, masculine presence albeit unconsciously. (my mom and dad split when I was little) And the worst part of it all is I know that I could stay here -- forever. She even said that I'm welcome to stay forever. But I know that my opportunities for growth, for expansion are stifled here.\n\nSo now that I have the money and a remote job, I'm making plans to move next year. But like I said, I know I'm behind - I just wanted the best way to still get some form of those foundational experiences without trying to play \"22 year old in a 30-something year old man's body\". Does that make sense?", "permalink": "/r/DecidingToBeBetter/comments/p8kns9/missed_out_on_my_20s_need_help_on_where_to/h9wxmbg/"}