{"id": "t5_2tand_t3_qglwyz_t1_hi861gz", "creation": 1635326141, "origin": "t5_2tand_t3_qglwyz", "height": 1, "replied_to": "t5_2tand_t3_qglwyz", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AngryChaChi", "text": "I have been single for three months now. At first, I wanted attention and validation and I felt so alone. So fucking alone... But I have come to realize that this heartbreak for me was necessary. I miss and love my ex but now understand that she was a necessary part of my story. She had to be so amazing and special that the void n my heart would give me the motivation I needed to work on myself. The being alone part is hard at first but honestly looking back - it was s the best thing for me. I needed time to think, reflect, and be honest with myself about where I needed to grow. \n\nI've heard the term \"Sitting with myself\" and love it. I put a pause on dating and have turned down several requests because I have become so involved in my growth that I no longer want/need another. Here are some things I have been doing and I admit, some started as ways to distract myself but have evolved into hobbies I love and enjoy. \n\n\\-Running with my dog several days a week\n\n\\-Hot Yoga\n\n\\-A boot camp gym\n\n\\-Swing dance lessons with friends \n\n\\-A 5 month intense growth and Leadership Program (this one has been huge at facing my self limiting believes and changing my mindset) (I will not date until I have completed this)\n\n\\-Therapy\n\n\\-A Codependent Anonymous group\n\n\\-A Men's Group for Church focused on living as a Man with Integrity\n\n\\-Skydiving to face my greatest fear (happening this weekend)\n\nAll of these have vastly improved my social circle, self love, confidence, happiness, and lifestyle.\n\nI kept hearing Trust the universe or Trust the Process and thought it was such a pile of shit. Now I understand it and full heartedly believe that what we go through is a necessary part of our own growth and is all a blessing. It's amazing how once I set my mindset to improve, doors and opportunities just opened up all around almost inviting me to embark on my journey. \n\nIf I ever see or hear from my ex again, I will tell her I love her and that I hope she is happy and  will wish her well. \n\nI know it seems bleak now but I hope you can \"Sit with yourself\" - Grow - and Trust the Process yourself. Commit to yourself. It's the first step to loving yourself and that is truly the only way you'll start to really grow.", "permalink": "/r/DecidingToBeBetter/comments/qglwyz/how_to_decide_to_be_single/hi861gz/"}