{"id": "t5_2qh1i_t3_b75gpg_t1_ejpx17o", "creation": 1553929706, "origin": "t5_2qh1i_t3_b75gpg", "height": 1, "replied_to": "t5_2qh1i_t3_b75gpg", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Juicy_Tooty_Fruity", "text": "Freaking out about my mum and family finding out that I tried to do it. \n\nI’ve attempted a few times and chickened out countless times but only once actually landed myself in a life threatening situation. \n\nAt a time in my life that I was severely depressed and suicidal but my family didn’t know about it (they thought that I was happy again and was safe), I decided to hang myself from the ceiling fan, which was working until the fan decided to fall apart just at the point that I was passing out.\n\nI remember hanging there waiting for it to be over but starting to panic because the rope was getting really tight around my neck, and at that point I started to fall asleep then suddenly I was on the ground with the ceiling fan barreling towards me. Scariest shit I’ve experienced in my life. \n\nI woke up in the hospital 11 days later, my skull had fractured, combined with the lack of oxygen in my system had sent me into a coma. When I woke up I couldn’t remember anything from a few weeks before it happened except I could remember everything from when I first kicked the chair up to the point the fan was rushing toward my head. When I woke up I remember feeling really worried that my family would find out that I had tried to take my life because I didn’t want to hurt them, which made me realise that the pain may end for me but not for them if I had actually succeeded. \n\nWith copious amounts of therapy and memory recollection training I managed to remember the time I had lost and I’m now happy again, after years of being depressed. That experience really made me realise that life isn’t about having a purpose or ascending to heaven, it’s about enjoying the time you have here and that there really isn’t any point to your life if you were sad the entire time. The only way to make your life meaningful is to make a good impression on as many people as possible", "permalink": "/r/AskReddit/comments/b75gpg/serious_suicide_survivors_of_reddit_what_was_your/ejpx17o/"}