{"id": "t5_2tand_t3_qcxd9j_t1_hhnr1am", "creation": 1634931550, "origin": "t5_2tand_t3_qcxd9j", "height": 1, "replied_to": "t5_2tand_t3_qcxd9j", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DrDarkDoctor", "text": "Foremost: big kudos to yourself for undertaking such efforts to turn your life around. Quitting smoking, drinking, and ending your dependence on substances is a major accomplishment. I hope you are proud of yourself for making such strides.Same goes for taking a job in a career that puts you out of your comfort zone. That takes a lot of courage and determination. I am glad to hear you cherish the \"rush\" of your job.\n\nDo everything you can to ensure that the fear of failure does not weigh on your mind and become a negative vortex. Prepare yourself for the worst, and realize that a job and material success are but small parts of life. Your mental peace and sanity are far more important. Approach your job with a perspective of maximizing your sanity... don't compromise on it.\n\nBeing bipolar, the negative weight of your job can quickly add up, leading your mind to depressive depths that eventually flip into a manic state filled with destructive decisions. I'm sure you are more than familiar.\n\nLoneliness is a difficult thing to contend with. It is borne out of a variety of desires, but in this case, the root is sexuality. I would suggest coming up with a strategy to put those desires out of your mind. They do not help you attain peace. Finding a relationship does not mean peace.\n\nFocus on other things, on doing: maybe playing video games, or pursuing a side-project. Perhaps some kind of art.\n\nBoth the pursuit of a partner and being in a partnership tend to be sources of discord within oneself. Recognize that. You do not need anyone else, but you think you do. In truth, being with another is vanity; people end up feeling just as empty inside, but cling to the notion because it is so very material and \"real.\"\n\nWorking on your own projects or hobbies may seem empty at first, but you will find in their  simplicity a freedom and release. Cultivate that.\n\nThese dating apps are a travesty upon the already complicated human-condition. The statistics are fairly clear; only about 10-20% of all males get the attention of 80% of females. Those statistics are made-up, but not far off the mark. In such a system, you are chum at the bottom of a chum-bucket.\n\nBut that is not who or what you are. Your worth is not defined by something like this.\n\nIf you truly want to date using these apps, then you need to up your game and become superficial. You'll need to begin having interesting photos of yourself that you can talk to women about. Photos of things like... running in a race, driving a Ferrari, doing martial arts, or traveling. Things that make you look like a well-accomplished maestro of life.\n\nIntegral to a dating profile is a well-dressed 3/4 profile photo where you are well-groomed and thin-looking. No sunglasses. Ditch your friends. You'll need to take effort to produce a good mix of additional shots that show you pursuing your goals and illustrate a man who is well-liked by others and has control over his life.\n\nThere are other approaches. You can also hunt for meetup groups to socialize with. Take dance and cooking classes. Make friends with people at bars. Network and attend as many parties and social functions as you can. Hone your ability to dispense with empty conversation.\n\nEventually, your friendships will help you collide with someone with whom you get along.\n\nWhatever approach you choose will take effort and commitment. You won't see results in months... it could take over a year or more.\n\nNo matter what, always remember... it's about self-control. It's about holding the reins on your life rather than letting life drag you along. The more you desire something but believe it's out of your reach and your control, the harder it will be to attain it.\n\nPut aside your desires. Don't be driven by them. Instead, gain control over your desires, and make calculated and conscious choices to fulfill them. Not because fulfilling your desires will make you happier – but because you are more fulfilled when you have that sense of control, when you are in the driver's seat.\n\nLastly... you're right. Move out of your sister's place, but don't rush it. She is clearly a lifeline for you... cherish that and be sure to not let it spoil or rot.", "permalink": "/r/DecidingToBeBetter/comments/qcxd9j/rebuilding_myself/hhnr1am/"}