{"id": "t5_2tand_t3_mn7dpg_t1_gtzaita", "creation": 1618005505, "origin": "t5_2tand_t3_mn7dpg", "height": 1, "replied_to": "t5_2tand_t3_mn7dpg", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ex_MJ_Guy", "text": "You're absolutely right.  I've had issues with depression since I was a Sophomore in high school and I didn't start smoking regularly until I was a Freshman in college.  A lot of my depression issues were related to my social situation (basically didn't have friends or date).  I have quit weed a few times, but it was solely for the sake of job hunting since I knew places would drug test, and in both cases I ended up compensating to some degree by drinking (would have 3-6 drinks on weeknights and more on weekends).  I can't really recall what happened the first time I quit (it was only for a month) but the second time (\\~3 months) I recall feeling good and I had my first and only long term relationship.\n\nI suppose a big reason I thought things would change this time around was because of the fact that I stopped smoking solely to address my depression issues and cut out drinking (except on weekends and even that's been in moderation).  And like I said in the original post, I felt a lot better those first few days which really hyped me up.\n\nRegarding your last statement, I admittedly don't always get outside during the day due to my job and the fact that the gym I go to is indoors, but I have been working out 6 days a week and 2-3 of those workouts are usually in the form of running or biking outside.  As far as meds go, you're probably right.  I was hoping to avoid them because I don't like the idea of being reliant on another med and I know from prior experience that I don't react well with SSRIs (which seem to be the main form of anti-depressants), but I was told about a seizure medication that also has anti-depressant qualities.  Main reasons I haven't tried it is because there is a low risk it can kill me or cause severe rashes, plus I was told marijuana negatively effects the efficacy of anti-depressants.  At this point though, I find the risks acceptable and don't really need to worry about the marijuana thing.  Unfortunately I won't be able to talk to the neurologist today or tomorrow since it's the weekend, but I'm going to message them right after sending this to schedule an appointment and try that medication.\n\nThank you stranger for taking the time to listen and provide some advice!", "permalink": "/r/DecidingToBeBetter/comments/mn7dpg/recently_quit_marijuana_and_seemingly_reverse/gtzaita/"}