{"id": "t5_2tand_t3_qbif4m_t1_hhco1s4", "creation": 1634731357, "origin": "t5_2tand_t3_qbif4m", "height": 1, "replied_to": "t5_2tand_t3_qbif4m", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ok_Hamster3522", "text": "There are a few things that you said in your post that tell me you're on the right track, but just need a bit more guidance.\n\n\"I want to do better for myself.\" Amazing! Let's get you there!\n\n\"I just realized after my last relationship, I was just hooking up with people to make myself feel better.\" This is an extremely important thing to understand and realize. What is it you're trying to feel better about? are you hooking up in order to avoid feeling an emotion? It appears that your sex life to you is similar to over-eating, or over-drinking.  You do this in order to escape something, to escape a feeling that you're having.  This is important to reflect on and dissect. Understanding what feeling you're trying to avoid is the first step to solving this. Is it sadness, rejection, or some other sort of pain? \n\n\"I did it to forget that I was hurting and it helped in the moment, but it never fixed anything and changed my relationship with sex.\" Usually eating and drinking help us in the now, but set us back int he long run. We are able to escape what it is that we are feeling now for a temporary pleasure, but ultimately, after it wears off, we are back with ourselves again. This is why eating and drinking to cope (and in your case sex) can be a slippery slope where more and more is needed to cover up the feeling as we grow tolerate of the \"norm\" (1 drink a day doesn't do it so now we need 2 drinks a day...etc). \n\nMany times the world around us conditions us to want to feel good all the time.  If we are feeling sad or down, then there is something wrong with us.  This is not true.  Life is 50/50 when it comes to emotion. We are on our \"good\" emotions half the time and our \"bad\" emotions half the time (you decide what's good and bad to you). Issue that arise, like yours, is when we want to feel good when in a bad state.  Instead of processing that emotion, why we are there, what is it trying to tell us, what are we thinking about that puts us in a bad mood, we want to find a false pleasure to make us get back tot he good half of the emotions. This is the trap that we all fall into. This is the binge eating, the binge-working-out, the binge stay in bed all day, and the binge sex. These are false pleasures. The issue is, it's a do-loop, meaning that when you do this in order to feel better, you're ultimately right back where you started and not any better off.\n\nHow you can work to fix it: I'm not a doctor, but you may want to have your bi-polar looked at and treated. It make be a root cause. Outside of that, don't be afraid of negative emotions. It's part of being human and part of this amazing life journey.  Would you want to be happy 100% of the time:  At a loved one's funeral?  When studying hard for a test? When being chased by a bear?  No.  who wants to be happy being chased by a bear?  Fear would serve you well in that instance.  \n\nLet the negative emotions dwell in your body and mind.  It's ok. It's human, and you're just another one like the rest of us.  Don't seek false pleasures as you'll never be able to process that causal emotion, just cover it up. Thus you'll never be able to move on. \n\nCaution: When you cut out the false pleasures, you may have a lot of negative emotions that surface, and you may feel worse.  This is ok, it's just part of processing the emotion.  Feel the emotion and process it. It's ok. \n\nAfter a while, the need for the false pleasures will subside, but it probably won't go away.  The brain is always in search of something that feels good.  When you kick the sex habit, your brain may be searching for something else. Be cognizant of that and recognize it.  It does get better. \n\nI hope this serves you, you're amazing, and I love you!", "permalink": "/r/DecidingToBeBetter/comments/qbif4m/how_do_i_stop_using_sex_as_a_coping_mechanism/hhco1s4/"}