{"id": "t5_2tand_t3_mdi64n_t1_gs9yi5i", "creation": 1616754578, "origin": "t5_2tand_t3_mdi64n", "height": 1, "replied_to": "t5_2tand_t3_mdi64n", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Callmepanda83744", "text": "We might as well be twins! I have always been my own worst enemy but this year I decided to do something about it! And at least with all the covid crap A lot of therapists have stared doing online situations. So now I make my self a weekly appointment and it’s so nice to be at home In my safe place usually in my pjs talking stuff out. One thing We are working a on is not being so mean to myself all the time and to quit listening to that stupid voice in the back of my head telling me I’m not good enough because you know what I deserve to be loved too. And while I can’t I’m having a hard time letting my guard down and quit being so mean to myself. I’m finally getting to the point that I think I will be able to learn to love myself too! I don’t know if this helps you at all but please if you feel like talking to someone please feel free to message me any time of the day or night! And I will try to help you in anyway I can. And maybe with a little luck I can help you find a online support group where the people thing the same way you do too! I was lucky enough to find one that really helps me and honestly sometimes it’s the best part of my week! And it’s so nice to know that other people have the same kind of problems you do and you aren’t just a freak! Sorry for rambling on but if this helps in anyway I’m happy I did because you deserve so much more than what your stupid brain is tellIng yourself! It’s taken me Amir if work to start to Like myself and I can still can’t sleep worth a damn which is one of the reasons I’m up at 5 am. But it feels so good not treating yourself like garbage", "permalink": "/r/DecidingToBeBetter/comments/mdi64n/an_attempt_to_take_control_of_my_life_with_my/gs9yi5i/"}