{"id": "t5_2tand_t3_qc1gdc_t1_hhkjd81", "creation": 1634868613, "origin": "t5_2tand_t3_qc1gdc", "height": 1, "replied_to": "t5_2tand_t3_qc1gdc", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PC_query_man", "text": "Ok, so my trick is, rather than forcing myself to study *in spite* of my anxieties and negative emotions....I work *with* them to acheive my goals, using:\n\n* Reverse psychology\n* Tricking my short-term emotions (anxiety, frustration) into \"playing along\" with my long term goals, which leads to nicer emotions taking over, making the task fun and an easier ride overall.\n\nSo first, I'll explain the techniques, then I'll provide an intial plan of action for your assignment, applying the the techniques.\n\n**Reverse psychology**\n\nTell yourself that the assignment doesn't matter too much. All you need to do is get it finished with a passing grade. It doesn't matter what grading band you get. It's just a series of tedious tasks you have to do, just like washing the dishes. And, to look at it another way, washing the dishes can be quite calming - it doesn't matter if the dishes aren't perfectly soap-free after you rinse them. Even a bit of dirt doesn't matter. It's just a task that has to be done, nothing more.\n\nPretending it is isn't important reduces the initial barrier to starting. You're more free to be messy and get stuck in, less scared of it not being perfect or not understanding something. It doesn't matter if you make a big mess initially because you have a month and can do multiple revisions, and actually, in order to produce a good piece of work, you *have* to get messy, that's part of the process. You can't know everything before you start. Plus, once you're stuck in, your emotions will change. You might even catch yourself enjoying it.\n\n**Mobilising negative emotions in your favour**\n\nWhat happens when we're confronted with the source of our anxiety? Fight or flight. At the moment you're fleeing (avoidance). But how about, since you can't \"get away\" from that essay, fighting it?\n\nSo whatyou can do is notice the anxiety right now. It won't hurt you. No one ever died from an emotion. Let the anxiety express itself a bit and let it see that there's no real danger right now and you're in an advantageous position. So now, see if you can muster up some aggression/anger/frustration. It could be even anger at yourself for procrastinating - Now direct that anger towards the stupid assignment.\n\n\"Stupid f\\*cking assignment, f\\*cking hate you!\"\n\nNow, out of sheer anger, proceed to aggressively type out a whole paragraph of the essay. A horrible, sloppy paragraph. Anything. Tell yourself \"I'm going to smash out a paragraph in 15 minutes\". If it's crap, who cares, because you already agreed the assignment wasn't important.\n\nThe above techniques are just ways of getting over the initial hurdle, because once you've got something down on paper, you've got the ball rolling and other emotions will take over. It doesn't matter how you do it, even if it involves expressing feelings of frustration and rage (which can accompany dissapointment and sadness).\n\n\\-----\n\nSo, to a plan of action. The report you linked. It's not actually too long and you can build a first draft from even a skim read. So I think your next task is as follows:\n\n* In a word document, write \"introduction\", \"current situation\", \"reasons\", \"solutions\", and \"conclusion\". This is your basic structure. at least for now.\n* Now, write an introductory paragraph. Doesn't matter if it sounds like a child wrote it and/or if you didn't even fully understand the topic. Get it down in a Word document. You have plenty of time to polish it later. I literally write my first drafts like this, like I'm just rambling: \"There is currently a crisis in care in the UK and this is a bad thing.\" Even a couple of sentences is fine. You want to be able to tick one item off the structure of your first draft so you feel you are making some progress. Use the reverse psychology and channelling negative emotions tricks above to write it if neccesary.\n* Stick a statistic in there: \"according to the Care Crisis review (2017), numbers of children going into care has risen by x in 20 years\" or whatever. Put your reference in brackets after the sentence. Adds extra gravitas to the paragraph, feels good.\n* Now state that there are various reasons for this state of affairs and that people on on the lookout for solutions. Be as vague as you want, because you don't know what to say yet! It's just a placeholder.\n* Tell yourself stuff like \"yeah, bit of that, that'll do...good enough\" and keep moving on and on relentlessly till you finish the paragraph.\n* Now admire the look of the paragraph you wrote and feel like you've ticked off something off the list. Go have a cup of tea.\n* Doesn't matter that it's badly written and is grammatically incorrect. You'll be revising it once you've finished anyway. An intro is kind of like a conclusion anyway, and requires the body of the essay be written already - the conclusion just assumes the reader has read all the middle stuff while the intro doesn't.\n\nNext step:\n\n* Read the first part of the report (section 1: The Care Crisis Review). Just go fairly quickly through it to get a sense of it. Your looking for **key points** about the **current situation** of care in the UK. Write questions to help you: How bad is it? Who does it affect? Where is it? Who's involved? several points, to give the reader a clear idea. Underline or mark parts of the text with those points if necc.\n* Now write a few paragraphs or so under the \"current situation\" header,  summarising what you've read, **in your own words**, using the key points you gathered above to organise the paragraphs and sentences.\n* If you feel like it, search out a few choicy quotes from the text and places them in your paragraphs/sentences, with the reference in brackets like: (Bloggs 2017: p34). Always put the reference there so you don't accidentally plagiarsim anything.\n* Admire new paragraphs briefly and take a break.\n\nSo, go and do that and come back here in a day or two when you've done it, with any questions.\n\n\\----\n\nThe \"reasons\" sections will go into more detail about why things are in this state in the care sector, and \"solutions\" will look at those offered in the report, plus additional ideas you have from other sources perhaps, and your own ideas (this should you a first class grade, depending on the academic requirements).\n\n\\----\n\nRemember it's a first draft, doesn't matter if it seems rubbish to begin with. Be aloof and don't get precious about it! The fun and satisfying stuff comes later, when you start to make real progress. Then you can start caring about it more (it'll happen automatically anyway as you get more interested in the topic, or at least invested in your work). You can look forward to polishing and tweaking things with plenty of time to spare befroe submission.\n\nThe above techniques are how I got first class grades for pretty much every assignment as a mature student. My first degree I totally ballsed up due to severe procrastination...cracked it in the end though, sure you can do it too.", "permalink": "/r/DecidingToBeBetter/comments/qc1gdc/how_do_i_start_my_university_assignment_that_ive/hhkjd81/"}