{"id": "t5_2tand_t3_ovvj05_t1_h7evrxc", "creation": 1627898782, "origin": "t5_2tand_t3_ovvj05", "height": 1, "replied_to": "t5_2tand_t3_ovvj05", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "camelCasedAtBirth", "text": "The Joy of Movement and the Willpower Instinct, by Kelly McGonigal are both great reads.  \nMoving with other people is such a good way to feel connected to others, and the more you do it, the more likely you will find meaningful relationships that **won't** leave you exhausted.   \n\n\nWhen you don't feel like being active though, I can appreciate that it's tough to do, but understanding WHY movement is good for us, can make a difference between not going out and doing something, and staying home, so taking the time to read and learn about how our body works when we move is fascinating, and the more that's in your mind, the better chance you have of improving your quality of life.   \n\n\nReading these books is a small part, but practicing the way of thinking of what you read is the other 70%. You have to practice what you read. They give a great insight into how our mind works at certain times (hungry, tired etc), so if you can practice reading your internal thoughts, they can be very helpful. \n\nYoga is also great, I don't do enough of it myself, but when I do I feel more relaxed and at ease in my own company. \n\nRemoving yourself from social media is the biggest positive step you can take (at least until you're able to be comfortable being alone). I can now sit, travel or walk for hours again with just my own thoughts, while I watch the world around me glued to their devices because they can't stand boredom for 3 minutes. \n\nYou will have to actively practice being alone with your own thoughts. Each day, start with 5 minutes still. Sit for 5 minutes and focus only on your breath, let thoughts come and go, and as soon as you notice yourself thing about them, go back to counting your breath. \n\nYoga courses are great for this. Just start little and often.  \nDon't compare yourself to anyone, ever. Just focus on you, and focus on being a little happier or better than you were yesterday.", "permalink": "/r/DecidingToBeBetter/comments/ovvj05/anyone_know_how_to_combat_loneliness_when_alone/h7evrxc/"}