{"id": "t5_2tand_t3_b8yfdv_t1_ek2vxj6", "creation": 1554351897, "origin": "t5_2tand_t3_b8yfdv", "height": 1, "replied_to": "t5_2tand_t3_b8yfdv", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "iron_sheep", "text": "Has he tried therapy or medication?  I was emotionally tormented by my alcoholic mom growing up.  I think it’s the cause of my anxiety, as my brothers have it as well, but I try not to put the blame entirely on my mom, even if it’s the truth.  I looked at my problem as a result of my moms actions, but now it became MY problem.  I could wallow in my own wake and blame her for affecting my life, or I could take control and overcome it.  I look at it like someone giving you the flu.  You know you got it from them, but you’re still going to take medication/steps to fixing it.  That was my first step into taking action after failed attempts at going to therapy, as I think my idea of what they offered wasn’t the same as what they actually did, which was to try and help me.  Therapy has helped.  My wife recommended it to me and I went a couple of times.  I cried my eyes out almost every time I was there, but it definitely made me feel better.  I stopped going because the therapist wasn’t in my network, but I’m scheduling one that is this week.\n\nThis is just coming from me, his experience may be different, but I’d strongly suggest therapy.  I have the sense of impending doom, the anxiety out of nowhere, but I’d say my social anxiety is more of a burden on my life.  If he can approach situations differently and change his mentality on how he sees things, it may prove to be helpful.  I’ve tried dealing with my moments of impending doom by questioning where these thoughts are coming from, why I’m feeling like that at this moment, and if something would happened, I’d still be standing.  I try to frame things in a more positive, yet realistic view.  The alternative is grim, not helpful, and most likely hurtful.  ", "permalink": "/r/DecidingToBeBetter/comments/b8yfdv/if_you_constantly_feel_bored_you_probably_need_to/ek2vxj6/"}