{"id": "t5_2tand_t3_b8yfdv_t1_ek2keh2", "creation": 1554341747, "origin": "t5_2tand_t3_b8yfdv", "height": 1, "replied_to": "t5_2tand_t3_b8yfdv", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "KellyJoyCuntBunny", "text": "Thank you for sharing. I am very glad to hear that you’re not as anxious as you were, and that you’re seeing someone about it. That’s excellent, my friend! \n\nI’ll share my experience as well. I’m not the one with anxiety- it’s my man. And for him, this is different. He doesn’t get anxiety that is related to anything that is happening or that he needs to do or deal with. What happens with him is that he gets overwhelming anxiety for literally no reason. He feels a sense of impending doom come out of nowhere. It’s a result of having a mother with a personality disorder who was emotionally abusive and maybe even physically abusive. I mean, she didn’t hit him, but he does have physical scars from her not getting him proper medical attention many times when he was sick or needed medical attention. Therefore, he is physically damaged as well as emotionally. Sorry if that’s TMI, I’m just trying to explain the way he experiences anxiety, and be as open as you were with me. But she was so harmful that it’s almost like he has internalized a sense of when to expect the chaos- like her moods are a weather system or the tides and he can feel when something is overdue for some total insanity. But we have cut her out of our life, and we don’t need to be hyper vigilant and watch for impending drama and pain anymore. And yet, he gets this feeling like things are about to go off the rails. \n\nSo you can see why I am critical of the idea that he is nervous that he doesn’t have the skills to handle something or he’s in over his head and that’s what is causing anxiety. So, my comment was basically just me saying sometimes people are just anxious, and it doesn’t logically follow that he must have something to worry about. \n\nThanks so much for reaching out and sharing your experience with a stranger! I’m totally open to continuing to chat about this, and/or to hear advice on what people think we could do to help his anxiety. ", "permalink": "/r/DecidingToBeBetter/comments/b8yfdv/if_you_constantly_feel_bored_you_probably_need_to/ek2keh2/"}