{"id": "t5_2tand_t3_lretii_t1_goldtg5", "creation": 1614182286, "origin": "t5_2tand_t3_lretii", "height": 1, "replied_to": "t5_2tand_t3_lretii", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Korroboro", "text": "Explore ways to know yourself better.  \n\nWatch what you do and what you avoid doing. Consider what results you got from your actions and inactions.  \n\nWhile you do this, don’t berate yourself, don’t call yourself names, don’t identify with any label (like “idiot” or “worthless”), don’t compare yourself to others, don’t give importance or attention to arguments that make you feel disappointed about yourself, don’t judge yourself.  \n\nThe more you get to know yourself, the more you will understand why you are like you are. The more you understand why you are like you are, the more clear it will be that it was not your fault. The more you understand yourself, the more you will accept yourself. The more you accept yourself, the more you will like and love yourself. If you travel this path, forgiveness will not only be easy, but even a natural consequence of self-knowledge.  \n\nYou might have a concept in your thoughts of your ideal you. You can use this as a reference, to know what to aim at in your quest to become a better person. But beware. The ideal you does not exist. It is not a person. It doesn’t need your love and affection. It’s just a concept.  \n\nOn the other hand, your fallible real self does exist. You want love and affection. You have this awesome capacity of generating love. Pour this love on yourself: the current, real you.  \n\nLearn to distinguish between what you know and what you think you know. Supposing is not the same as knowing. Truth is not the same as what looks like truth. If a person tells you you are an idiot or that you are worthless, does that make you an idiot? Does that make you worthless?", "permalink": "/r/DecidingToBeBetter/comments/lretii/how_do_i_forgive_myself/goldtg5/"}