{"id": "t5_2qh5i_t3_lr1bz9_t1_gok5ki6", "creation": 1614150996, "origin": "t5_2qh5i_t3_lr1bz9", "height": 1, "replied_to": "t5_2qh5i_t3_lr1bz9", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "tallerThanYouAre", "text": "If you like burger, here is how to make steak!\n\nGet an iron skillet if you can (they rock, you should own one, if not totally cool!)\n\nGet a steak sirloin, ribeye. Choice is the quality you want, or Prime, but that’s expensive. \n\n1/2-1lb for one person. Price, your appetite, all these are up to you (does it look like a steak of the right size and can you afford it?)\n\nIf the steak isn’t thawed, leave it in a metal sink for a few hours to thaw. It should be not hard, like soft meat. Keep it in the wrapping when you thaw. \n\nPut the pan on a medium to high heat for a few minutes (2-3, maybe 4) so it’s hot when you throw the steak on. You want it hot, but not smoking. If it smokes that’s too long, just take the flame away and cover it for a sec. \n\n\n\nTake the steak out, and with a paper towel, pat both sides dry of the juice\n\nPut lots of pepper (lots, like a rub) and a good amount of salt on both sides and rub them in. \n\nThrow that seasoned steak onto your hot pan, hear it sizzle!!!\n\nTurn the flame down. \n\nLet it sit on that side for three minutes. \n\nUse a spatula or tongs and flip it over. By now, the pan is smoking (do you have a vent? Turn it on. No? Open a window) - smoke detectors go off sometimes, it’s ok, just push the button. \n\nSear (sizzle) the second side and let it sit there for two minutes. \n\nOnce that’s done, turn off the flame, put the steak on a plate. \n\nPick the pretty side, that will be the top. \n\nOn the bottom, cut it about an inch in the middle. Is it pink, like a cooked steak, or red like raw meat? If it’s raw meat, put it back on the pan for two minutes, bottom side down. \n\nIf it’s ALMOST pink, let it sit. It will cook on the late for five minutes. \n\nAfter letting it sit, or cooking it two minutes more put it pretty side up. \n\nMicrowave some peas in a bowl, put butter on them. Or whatever vegetable you like. \n\nBoom - full blown grownup dinner, easy. Total time, 20 minutes. \n\nI promise you - that’s the tastiest steak you’ll ever make yourself - because you did it. \n\nBonus: 3 minute eggs for breakfast\n\nTwo eggs in a bowl, scramble them with a fork\n\nMelt a pat of butter in your pan\n\nWhen the butter is melted, pour the eggs in. They will sizzle a little. \n\nStay with them, you have about a minute or so. \n\nUse a spatula - as they solidify, flip them and stir them.  When they are the right visible moistness to you, take them out. Salt and pepper. Breakfast. Boom. Add toast.", "permalink": "/r/happy/comments/lr1bz9/i_know_its_kind_of_lame_but_im_too_old_to_have/gok5ki6/"}