{"id": "t5_2tand_t3_opdgv5_t1_h6586x4", "creation": 1626972270, "origin": "t5_2tand_t3_opdgv5", "height": 1, "replied_to": "t5_2tand_t3_opdgv5", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CheekyRafiki", "text": "Eh i don't really agree. As someone with ADHD who also supports capitalism.\n\nMany successful people have ADHD. And anecdotally, the people I know with it tend to think outside the box and take more creative approaches to problems, which is a highly profitable skill if applied wisely. And among the people I know, myself included, we with ADHD have overwhelmingly found ourselves in independent work situations, mostly self employed, either running businesses or finding niches that allow us to be our own boss and decide our own time.\n\nThis is not at all to minimize the experience of others who suffer from the condition and have extremely difficult hurdles to overcome in climbing the socioeconomic ladder, but just my from my experience, which obviously may not be very representative, we thrive in less conventional life paths and become overwhelmed in the more traditional \"school - job\" pipeline.\n\nI don't think it's that we aren't compatible with capitalism. I think it's that we start our journey in educational environments that are simply constructed along the lines of neurotypical behavior and psychology - which makes sense, if the goal is to prepare as many people as possible for the world. So yes there are unique and difficult challenges, but the beauty of capitalism is that I don't HAVE to go work for some company I can't stand, or go through some pipeline that doesn't fit who I am. I can use my intense curiosity and dread of the mundane as an asset and develop skills in things that interest me and sell my services myself, on my own time in a way that works for me.\n\nI recognize the privilege and fortune I enjoy, but I also recognize the potential of those with less fortune and it's not capitalism that holds us back. Capitalism is what gives us the freedom to create our own paths and not be stuck in institutions that don't vibe with us.", "permalink": "/r/DecidingToBeBetter/comments/opdgv5/you_dont_need_motivation_you_need_to_work/h6586x4/"}