{"id": "t5_2tand_t3_opdgv5_t1_h65nf7l", "creation": 1626978689, "origin": "t5_2tand_t3_opdgv5", "height": 1, "replied_to": "t5_2tand_t3_opdgv5", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CheekyRafiki", "text": "Assuming we are talking about the US - I mean last year Entitlements spending (socialized safety nets) accounted for 47% of federal spending, so I wouldn't say there is an active denial of basic human needs, which have all been increasingly met since this great experiment started. In fact, I'm pretty sure entitlements have been the plurality of federal spending for some time now. The standard of living on the whole has only been increasing thanks to capitalism.\n\nThings could always be better, and some people are stuck in places they don't like, but history paints a very clear picture that economic freedom of the individual is a better recipe for a prosperous society than government control. The importance of private property and ability for individuals to create business and wealth cannot be overstated.\n\nBut even people living paycheck to paycheck can still make choices to better their situation, and yes it's hard and requires sacrifice, and people in those situations might not even know what those choices are. And there will always be those more fortunate than others. Equality of outcome is the wrong metric to consider when evaluating a free society - and my comment was specifically addressing ADHD and capitalism, and speaking for myself I am happy to have such freedom. It is a delicate thing that many have sacrificed their lives for, and what many people fail to recognize for all of capitalism's shortcomings is how much worse it could be, and probably would be, under regimes with less individual freedom. The default is poverty and authoritarianism for most places throughout most of history. And not poverty like I can't afford whole foods, poverty like there is no food and disease is rampant. Starvation is virtually not a thing here, even among those who have absolutely nothing.\n\nNo idea what mortal threats you are referring to.", "permalink": "/r/DecidingToBeBetter/comments/opdgv5/you_dont_need_motivation_you_need_to_work/h65nf7l/"}