{"id": "t5_2tand_t3_n3wiw0_t1_gx7hgus", "creation": 1620340724, "origin": "t5_2tand_t3_n3wiw0", "height": 1, "replied_to": "t5_2tand_t3_n3wiw0", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "pabosano", "text": "Damn, you are one hypocritical piece of shit. What the fuck is wrong with you. You come onto reddit, read into shit and attack people for said shit that is entirely in your fucked up head . Who the fuck do you think you are? YOU need the shrink bitch. Maybe they can figure out your triggers. You're a cringey, judgemental bitch. I've looked at your shit and will continue to. No, your dog is not pretty, or cute, or anything for that matter. Just a literal basic bitch. Just like you. Which is probably why you refer to it as your 'daughter' which is just absolute cringe not to mention pathetic and a bit sad. Keep your pasty plain basic bitch face off of reddit. You're not selling any girl scout cookies with it  And no one gives a fuck about your adventures with your dumpy cottage cheese fat ass. Remember me bitch? You defended the dumb bitch who was karma whoring about her dog. She posted the same shit twice more and it all got removed by reddit. Because reddit doesn't like karma whores that exploit animals and people for votes. You should get along great with her. She's got a face like expired plain yogurt just like you. And you're a fucking hypocrite for making up shit about me and here you are doing the same shit you had such a problem with. Glass houses bitch. You've earned this shit. Let me help you with some downvotes you miserable hypocritical judgemental fat ugly fucking stupid piece of shit. I'd call you a cunt but, fuck, I don't want to even think about that when dealing with you. 🤢🤮 Pull out the rag, pop your pills, scoop out the yeast, shave and wipe your ass and don't forget to flush. Back to charm school bitch. You're disgusting.\n\nHow did you put it? Oh yeah: Ta da!", "permalink": "/r/DecidingToBeBetter/comments/n3wiw0/in_april_of_19_we_lost_our_youngest_son_sent_me/gx7hgus/"}