{"id": "t5_2qh1i_t3_4e8oip_t1_d1yf00e", "creation": 1460382194, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Theist17", "text": "The first time, I tried to hang myself with a length of chain, which slipped and pinched my neck--the pain of that was worse than dying, apparently. It shocked me into survival mode, I lifted myself up and breathed. After that, I heard my dad talking upstairs, and I panicked to get the thing off. \n\n\"I can't even hang myself right. What a failure.\"\n\nI cried for about an hour. Dad still doesn't know.\n\nThe second time, I was going to shoot myself. I'm not sure if it really counts as an attempt because I never pulled the trigger, but I had the barrel of a loaded 30.06 in my mouth, and I had written my note. I started thinking about who would find me--it would probably be my dad, my mom, or one of my brothers. My sisters would have been at school. I started thinking about that, and the thing that drove me off it was that Mom would be cleaning up her baby's brain off the wall. I couldn't handle that, so I took it out of my mouth, ejected the round, and hid the bolt someplace. Still haven't found it, to this day--I think I blocked it out or something. But this is what I thought, then:\n\n\"They can never know, and these bullets aren't allowed in my room anymore.\"\n\n\nMy older brother knows I've attempted, but no one else in my family does. A few close friends, too.\n\nEdit: Just because someone's funny, seems laid-back and lighthearted, and smiles all the time, it doesn't mean that they are happy. It doesn't mean they aren't struggling with their demons. Both of my attempts were partially vengeful acts against my parents. I was really messed up during those times in my life, and nobody would have guessed that I was suicidal, but I was.\n\nDon't ever be afraid to ask someone how they're really doing. If I'd had that chance to be honest, I could have avoided some horrible things.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yf00e/"}