{"id": "t5_2qh1i_t3_4e8oip_t1_d1ybta7", "creation": 1460374885, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheSurvivorofHathsin", "text": " I'm late here but yeah this is my story. I didn't really do straight up suicide attempt, I first went for a full walk for some part of the city from morning to night and came back at night. I don't know why but I just walked the whole way looking at everything, the people and the next day I took some clothes and some money I saved up and got on a bus.  This is a 3rd world country so I couldn't really escape to  another state. My plan was to go to wild part of the world and just die there while enjoying some moments of my life left to me.\n\nAfter almost 200 miles away I got off in a middle of nowhere and lied to the driver my family had estate around and just went to the forest. I had really warm clothes and it was spring almost early into summer.  So I got to the forest and enjoyed the sense of being alone where no one could see me you know? It felt so good and scary but at the same time... so free.\n\nI walked about 5 miles off the road and came by a small waterstream in the forest, just put off my backpack. I had a very scarce food, embarassed to admit I only brought a premade food and ate a food while we were going on the bus (bathroom break with restaurant) and only a big can of Pringles with a jug of Cola. \nI didn't plan to live there forever so it was fairly simple, I brought something I'd enjoy and not last for long. That day I set up my things and ate half of my food and just sang like a crazy person doing stupid things because no one could see or hear me.\nI enjoyed myself, I masturbated and just did everything you could do. After some time, this things have decayed I felt very alone, forest was silent. I wasn't afraid of the night but that terrible silence actually got weird, summer wasn't exactly there yet so bugs weren't out and birds seem to have avoided me.\n\nI went onto different set of enjoyment, the subtle feeling of where I am and the raw nature that I am in. Felt good to be honest, I got my big winter jacket out and used it as a blanket and my backpack as a pillow and slept. Woke up in the morning at like dawn, it was fucking cold and I was all soaked up in damp on face and my pants, my winter jacket held out most though.  I knew it wasn't enough and planned to make some kind of roof just so I won't get damp because I hate that feeling. \n\nI had nothing to do, so I just tried to wake myself up a little and ate the remainder of my food and went on for the shelter. I thought I could just build roof but abandoned that idea because damp would be everywhere so I made a little shelter out of dead branch, dry plant, whatever it is I'm not sure what its called in English.  I got a really shitty shelter done and slept in it, it was pretty good. But that day I was thorougly bored and just went to look for the landscape.  I went onto this mountain range and inbetween one of those I saw a fucking deer, I was really lucky but I startled it and it went up like a bastard and run like hell after being still for awkward long time. I felt good seing those things but I was kinda worried about wolf now but at the same time thought it was better if I die faster. I went back but couldn't find my shelter for few hours then came in at night and slept.\n\nI was so hungry the next day waking up, my Cola was out and I drank from the waterstream. So bored, no wolf. Thought about hanging myself but I didn't bring any rope or something I could use. I had a belt but I didn't think about it a time cause I'm an idiot.\n\nI lived there for about a week and a half then when I was fucking around I got spotted by a jeep. It was apparently an equalievent of ranger in here searching for me with the police. My parents had posted search notice to police and reported it. Apparently they searched for bus station and my equal of Social Security was recorded there on a bus, tracked the driver down and asked me where I got off. They had been searching for 3 days till they found me. \n\nComing back was the most shittiest feeling, I was kinda happy to be back but I wanted to die peacefully there in the forest. I didn't like how they would be scared and shit. I met up with them in a bout an hour after the spotting. They were in their car searching as well, got a mouthful and rage. I got on the car and we had the longest fucking conversation ever.\n\nAnyways we kinda got the commonground after that, I was an underachiever but when I came back I took some time off and worked a little then went full time. I have a better life now, I live alone and I love it. \n\n\nSorry if that was a long one, but that's what happened to me. It was my twisted attempt of suicide or just dying peacefully while enjoying my time. I didn't think much of hanging there or otherwise I would have but yeah. I just thought I'd die of starving, but I guess you can do much fkin more when you're in the wild.\nI didn't eat anything after the day 3, went on water and some plants that looked safe at the time ( but I think I just ate it to feel something other than grumbling)\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ybta7/"}