{"id": "t5_2qh1i_t3_4e8oip_t1_d1zbyq2", "creation": 1460428780, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "cocoderojo", "text": "I took sixteen pills of 50 mg Sertraline, four pills of 0.5 mg Lorazepam (Ativan), a can of redbull, a bottle of prescription cough medicine (Codeine), and alcohol. At that point, my anxiety kept me from sleeping and eating. I was a 21 year-old Asian girl and just weighed a little over 100 lbs. I was up and about walking around in public until I started throwing up and I was sent to the hospital. When I came to, the first thought that came to mind was \"I failed...again.\" There were just these endless tears that would roll down my cheeks. Even then I felt like an empty vessel. I still didn't feel very much alive at all and mostly just detached from everyone and everything. I was watching the world in third person through a gray filter. I wanted to leave the hospital and rip out the IV in my arm, but I was honestly also too exhausted to fight anyone. There was always someone watching me from outside the room in the hospital. They would come in to check on me from time to time. At one point she asked me why I was crying and all I could respond was \"I don't know.\" Since I live out of state for college, my parents couldn't come to the hospital in person, but it broke my heart to hear how much I hurt them when I spoke to them on the phone. It broke my heart to see how much I hurt my closest friends. It changed the reality of what I had originally thought to be the truth but it was really just a delusion that my depression wanted me to believe in. My three days spent at the hospital were full of lies straight through my teeth and I somehow managed to convince the stream of staff members that I don't need any more medication and counseling that I never went but cancelled.\n\nNow a days, there is still a nagging thought in my head that maybe I would be better off dead. I try to keep it at bay with days/nights that are so lit that I'm grateful to be surrounded by good vibes and good people. I am thankful for the support from my family and friends and I find it very difficult to understand why I still feel the way I do. Because existing does not feel like it is enough for me. \n\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1zbyq2/"}