{"id": "t5_2qh1i_t3_4e8oip_t1_d1yc8k6", "creation": 1460376090, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "taw710", "text": "I know I'm late but I could really need some advice here.\n(also this is a throawaway for obvious reasons)\n\nMy girlfriend attempted suicide after her first boyfriend treated her like shit when she was 15 years old (she is now 18) and she wasn't messing around. She took like 20-25 sleeping pills and went to bed expecting to never wake up again.\nInstead she woke up in the hospital and was told her parents brought her there after they heard her vomiting in her room, which she cannot even remember at all.\n\nI met her last year and she told me about this about half a year ago. I have a troubled past too and was close to do something along those lines myself but, thankfully, never actually was strong enough to do it.\n\nWe both regret our suicidal thoughts / actions of our past but now we are really happy together and very thankful to be alive.\n\nNow comes the part I could need advice on from people with similar experiences: Her parents started being afraid of it happening again and she felt really controlled, being watched all the time. Which...i can understand somewhat from her parents point of view, but still it makes her feel quite miserable at times when \"the walls have ears\". She wants to leave home as soon as possible but since she will be at university for at least another 4-5 years with only a small part time job on the side it wont be as easy to support living on her own without her parents support. And she hates being dependent on them.\n\nThe thing is...I actually feel like most of this supposed \"control\" of her parents is just in her head and based on guilt because of her suicide attempt. The first few months she told me she couldn't stay overnight because her parents wouldn't allow it. But she never even asked them in the first place. And when she did they said: \"Sure go ahead\"\n\nThere were several of these moments where I got the feeling she is paranoid about her parents. I guess they did get freaked out by her attempt and tried to keep her safe, but now they are quite relaxed again and she doesn't see it. \nI get along fine with her parents but I don't really wanna bring this topic up with them.\n\nSo does anyone have advice how I could support her overcoming her fears about her parents to make her more comfortable?", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yc8k6/"}