{"id": "t5_2qh1i_t3_4e8oip_t1_d1yhdyr", "creation": 1460386093, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Jacosion", "text": "I was in a long distance relationship with a girl I met on MySpace. Didn't work out but that's not important.\n\nOne of her friends would call me to talk about her troubles every once in a while. She had a boyfriend in the UK (we live in the US). She was kind of nuts. Didn't allow him to have any friends who were girls. Stuff like that. Although I don't know how she mediated it since he lived across the pond. I played halo with I'm online a couple of times. He was really nice. It didn't work out with them though. That's when things got bad.\n\nShe was already pretty depressed. She cut her self ect... But him breaking up with her sent her over the edge. And since I was the only person she really talked to, she latched onto me. \n\nShe called me one night and calmly told me that she was going to kill herself while I was on the phone with her. She claimed to have fallen in love with me, and if I didn't love her back, she'd swallow as many pills that she could find. So I did the only sensible thing I could think of. I told her I loved her, which was a lie. \n\nBut that didn't stop her. A couple days later she called me and told me she had went through with it. That as we spoke she was probably dying. I managed to convince her to let me call a suicide hotline for her. The lady on the phone told me to call 911. Only problem was I didn't know where to tell them to go. I lived in Florida, she lived in Ohio. And she wasn't calling anyone. Finally I got her mom on the phone and she took it from there.\n\nI don't really know how she turned out after that. I broke contact with her because I couldn't handle being friends with her anymore. It was too much for a 14 year old to deal with. I do hope she's ok now. \n\nShe did call me my senior year and threaten to sabotage my relationship with my then girl friend (now wife). I told her off and she hasn't called me since.\n\nI feel like she had some mental issues besides depression. I hope she got help.\n\nI know this isn't exactly what you asked about OP. But I felt like it was relevant.\n\nIf any young people here have friends that are thinking about suicide. Tell someone please. \n\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yhdyr/"}