{"id": "t5_2qh1i_t3_4e8oip_t1_d1yhucl", "creation": 1460386768, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "EuphemiaPhoenix", "text": "I've never attempted suicide, but here are a couple of possible reasons:\n\n* Access to guns isn't always easy, especially for someone who's not in the US. \n\n* Worrying about the consequences of living with the effects if it doesn't work (even a shot to the head isn't guaranteed to kill you, as evidenced by this thread). Liver damage or scarred wrists are likely easier to deal with than having blown half your face off.\n\n* Consideration for whoever finds the body and/or has to deal with the cleanup. If you hang yourself or overdoes there's probably going to be less mess.\n\n* Not wanting the owner of the gun to feel guilty if it doesn't belong to the person trying to kill themselves.\n\n* Fear. Even if you're really 100% sure that death is what you want, it's still a big step to actually go through with it, and psychologically it's a lot easier to swallow a bunch of pills and wait for them to take effect than it is to pull a trigger end things instantly.\n\n* Not everyone does a ton of research before trying to kill themselves. A  lot of people who try are in a really bad living situation, or they're too fucked up in other ways to think about it like that. Some people don't have access to the internet. In that case it's perfectly logical to assume that taking an overdose of sleeping pills will send you peacefully to sleep forever.\n\n* Not really thinking straight. Maybe they don't want to die, but don't especially care if they do. Maybe they just want to stop thinking for a really long time, and downing a bottle of pills that's already to hand seems like it would achieve that.\n\nThose are just the ones I came up with in about five minutes, I'm sure there are more.\n\nBut also, it's true that some people who make supposed suicide attempts don't really want to die. I absolutely despise the collective idea society seems to have that that's somehow attention-seeking and narcissistic and that they're less worthy of help than people who are 'really' depressed. Maybe it is 'just' a cry for help, and I can see why people who've made genuine attempts or lost people to suicide might resent that, but the same information online that says you almost certainly won't die from an ibuprofen overdose also tells you there's no such thing as a 'safe' cry for help. You might not die, but you'll certainly be in a lot of pain for a long time. Too little and it's likely no-one will even notice, too much and you might end up with permanent organ failure. If you cut your wrists and deliberately don't make the scars deep enough to kill you, it still fucking *hurts*.\n\nA lot of the stories in this thread are from people who OD'd and didn't wake up til days later - does that sound like a normal thing to put yourself through if you just want to be the centre of attention for a bit? The number of self-absorbed drama queens in the world is a **lot** higher than the number of people who deliberately put themselves in hospital, and that's because it's not a case of fucking yourself up a bit, tragically collapsing and waking up to all your friends and family gathered round your bedside exclaiming how relieved they are that you survived and how they'll never take you for granted again. There's a lot of pain, you're probably going to vomit everywhere and shit yourself (or get everything covered in blood, depending on how you choose to do it), and all the while you're wondering whether you've just made the biggest mistake of your life. Then when it's done you have to deal with people's reactions, and the guilt of having put the people you love through something like that when you know you didn't even want to die in the first place.\n\nI guess it's true that people who make cries for help are separated from the people who use almost foolproof methods by a tiny glimmer of hope that maybe things will get better if they can get the care they need. But to get that they feel they have to go against every human instinct for survival and put themselves through hell, as well as the (admittedly sometimes slim) chance of actually dying from whatever it is they've done, because that seems better than going on living with the constant unbearable emotional pain of being depressed and no-one understanding. And *then* they get told that they're not as worthy as people who've really tried to die. It's called a cry for help for a reason.\n\nEdit: just realised that sounds like I'm accusing you of thinking those things, which I'm not. It was just a rant about people's attitudes in general.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yhucl/"}