{"id": "t5_2qh1i_t3_4e8oip_t1_d1yhy32", "creation": 1460386922, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "FoxtatoOverlord", "text": "I just cried, harder than I have in my entire life. I just wanted to be done but I was convinced that life was just trying to continue screwing me. \n\nI swallowed every damn pill I owned (a wide variety due to being medicated for bipolar, depression, anxiety and a few other random meds) but a friend found me slumped against a basement wall covered in my own vomit. He took me to the hospital and they immediately pumped my stomach. When I woke up I was devastated. I was mad at my friend for not letting me die, but more so I was mad at myself. All I could think was how could I have been so stupid, I was already planning how my next (and final) attempt would go, how I'd make sure I never had to walk this planet again. I thought surely nobody on this planet was drowning in pain and misery the way I was. Until I saw my mom crying.\n\nThat's when it all shifted, my perspective became a little bit more clear all at once. The pain I was feeling? It was nothing compared to the pain she was having to deal with. Seeing her youngest daughter laid up in a hospital bed because she tried to kill herself. I knew from the way she looked at me (but never at my face) that I'd caused her more pain than I ever actually experienced. \n\nI vowed to never do that to my mom again. After a stint In a mental hospital for the suicide, pill problem and eating disorder I spent months trying to win my mom back. Eventually her hugs became a little bit tighter, she started laughing again, and it was all worth it. I lapsed a few times with the pill problem and the eating disorder but that was it for me, I was done with trying to be done with life. I wanted her to be proud of her little girl and feel she didn't fail. \n\nUnfortunately she passed away while I was still battling the eating disorder, but she did know I was on the final road to recovery. It's been 8.5 years since my suicide attempt, and even with my mom being gone I'm never looking back because who i was is who I never want to be again. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yhy32/"}