{"id": "t5_2qh1i_t3_4e8oip_t1_d1ykoaz", "creation": 1460390793, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "> What you do is ultimately up to you.\n\nThis was the truth for me. I hadn't quite gotten to the point of suicide yet, but I was definitely on the dock looking at the boat. Nights were the worst because I was alone with myself. During the day I went through the motions of living, *if* I wasn't sleeping because sleep was an escape. I didn't feel *anything*. It's hard to describe that absolute void of emotion. But at night I would lie awake, trying to sob quietly so as not to alert anyone else in the house, and wonder if I walked out the door and into the night if could I just be swallowed up by it somehow. I wanted to stop existing because I was such an obvious burden to everyone else and I was so very *tired* of feeling like this. I would think about ways I *could* die if I had to. There were guns in the house and I could totally do that, but it would be such a mess and I would hate to be that much more of a pain in the ass to people even in death. Honestly I thought I wasn't worth the trouble. I couldn't bring myself to hanging, the thought of it scared me all my life. Pills were absolutely out of the question because they don't work and I'd probably just make myself horrendously sick. I just wanted to go out into the desert, lay down, and die. Or under a bridge somewhere - I actually fantasized about walking out under an overpass somewhere secluded and just laying down to die. If Aokigahara were in the US I probably would have gone there. Somewhere where my family wouldn't find me and be sad, somewhere were they could think maybe I was out there still alive and happy, but I really wouldn't be. I'd be dead. No muss, no fuss. Just the end.\n\n\nAnd then I got a really good job offer. I wouldn't have even tried, but I was trying to ignore how very bad things were and function like a normal human being. I was working a job already, but this was a huge step up in pay and responsibility. I should have been totally stoked, but I was completely apathetic. There was no future to think about, everything was right now and right now fucking sucked. The morning I had to get up to go to orientation/training I had a massive panic attack. I brushed it off as a reaction to the sleeping pills I had taken the night before and called and told them I was sick and that I was very sorry but I would catch the next one the following Monday. They were very understanding. The problem was I never came out of the panic attack, it just kept going. I didn't have a regular doctor so I went to the local clinic looking for some kind of help. They gave me a medication that just escalated the problem. I was sitting on my bed, trying to calm down by watching Adventure Time, just going through this horrendous cycle of hysteria every two minutes. Extreme giddiness to extreme sadness. I had no idea how to stop it and no idea what was going on. I had no control whatsoever. It was absolutely terrifying and exhausting. I tried to put on a brave face but any moment I was alone my anxiety level shot through the fucking roof. I had crying jags, was dry heaving, couldn't stop shaking - all the fun stuff. But when I was around people I shut down and just did the things I thought I was expected to do. In truth I was barely functioning. The following Monday I couldn't do it again. I was near hysterical. My Dad was absolutely furious with me. I couldn't stop crying. I finally broke down and admitted to my Mom that I was having really, *really* bad thoughts about hurting myself and I needed real help. I felt so fucking stupid. How did I let myself get so fucking bad? How did I get so low that I let this happen to me? My Mom took me back to the same doctor and she told me I had to go to the hospital. I was fucking *terrified*. I have had a deep and consuming fear of mental hospitals since I was a small child. I don't know where this came from, but it's there and it still is. My Mom and I drove over to the ER and talked about whether I had to do it or not. I refused, she didn't want me to because she knew how mortally fucking terror stricken I was. We went home. I took one of my anti-anxiety medication pills and fell asleep terrified that at some point the cops and an ambulance were going to show up and force me to go. How fucking embarrassing that would be for my parents. They didn't think so, but that's where my mindset was. I guess that's one emotion I could still feel. I slept for 19 hours, woke up, ate a little, watched a little TV, went back to sleep.\n\n\nThe next morning I woke up and I knew that if I was going to get out of this I was going to have to do it myself. Jesus fucking Christ is it hard. By some grace it was the beginning of October and Halloween is one of my favorite holidays. I threw myself into decorating the house and yard. My parents were behind me 100%, I think they were happy I had a project to focus my energy on. I *made* myself leave my room and be with the family. I made myself pick up knitting and sewing again to give myself projects to focus on, small things I could accomplish a little at a time. Making myself care was fucking exhausting though, but I knew only I could get myself out of the pit. Gradually the world became less gray. In March of the following year I got a different job with the same company. Having a set structure to my day helped a lot. It wasn't an immediate reaction, the first night before this new job I didn't catch a wink of sleep and was sick as a dog. I went in, but didn't stay the whole day. Somehow I'm still here. It's three years on now and there are definitely times that I struggle. Just a few months ago I had a moment were it felt like I woke up, I don't know how else to describe it. I had been miserable for so long that it was like being lost in a fog - and then suddenly I found a slightly clearer patch and I could see beyond that fog. And oddly enough I saw one of my cats. Like *really* saw him. I knew he existed outside of the fog, and I thought I had been looking at him all this time, but I *wasn't*. I was so focused on the internal misery that I couldn't see beyond it at all, and suddenly I did. It was almost like an out of body experience. It was fleeting and I have to mentally pull myself out of it when I realize it's happening. I'm still working on it. It's still a huge fucking struggle, but I think I'm making progress. I look back to that time before and I really, really hope I never feel that hopeless again. I don't ever want to.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ykoaz/"}