{"id": "t5_2qh1i_t3_4e8oip_t1_d1y9xjy", "creation": 1460368251, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 29, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BIGMc_LARGEHUGE", "text": "I used to have a horrible cocaine and alcohol addiction. Add into that an extremely emotionally abusive gf at the time and it was a true recipe for disaster. I lived in Hudson County NJ at the time, which is right across the river from NYC(I lived half way up between the Lincoln tunnel and GWB). We would get high and drunk, fight, and then I'd wander around all night. \n\nI made the walk up to the GWB several times but always turned back. Well after one particularly bad marathon binge and subsequent fight I decided this was it. I grabbed the bottle of Jack, stopped by my dealer for one last gram, and walked upto the bridge. The whole time I'm sniffing, drinking and cryingncuz all I can hear is her telling me how pathetic I am and how she never loved me. \n\nI start walking across the bridge, and how I wasn't stopped idk(I walked past some cops on the footpath and I know I looked like k didn't have all my with about me). So as I'm walking across I stop at the spot where I was going to jump. I take one last blast and as I'm leaning on the rail crying my eyes out I see someone out of my peripherals. It was someone on an early morning jog. They're coming up on me and all I hear is \"Don't do it man. It's not worth it.\" \n\nThe person didn't even break stride. Didn't stop to talk. Didn't offer anything else besides those passing words. And that's when it hit me. It's not worth it. If I could just get my shit show of a life together it wouldn't be worth it. \n\nI went home and passed out due to all the alcohol and exhaustion. I woke up and made major changes in my life. That still ended up being the last gram of coke I ever bought. I broke up with my gf. I quit my job a week later and moved out of a heavily toxic area I lived in my whole life(dealers every, easy access to drugs 24/7).  That was over 3 years ago and I'm still coke free and doing better in life than I had ever thought possible ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y9xjy/"}