{"id": "t5_2qh1i_t3_4e8oip_t1_d1yaumd", "creation": 1460371757, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "megalomaniacaly", "text": "I was 15 when I was diagnosed with depression and I attempted Suicide at 16 (and then again at 17)\n\nI attempted to hang myself with some rope that I bought from the local hardware store. I had enough of pretty much everything at that time, school grades were low, friends turned into bullies and my family were abusive and just down right horrible to me ever since my grandfather past away (when I was 3)\n\nIt was a thursday night and when my grandmother wasn't near my room that's when I tied a noose from the various videos and instruction things I read online and I got a chair from the kitchen which was a few feet away and i remember hanging for about 5 sec. I felt the pressure on my neck and felt extremely hot as i kicked the chair from under me. the rope eventually broke and I fell to the ground. I remember just coughing a lot and my grandmother came in to ask what that noise was and she saw it all and I pretty much had to persuade for to take me to the hospital. I had rope burn and I was there for 1 month. I couldn't have coat hangers, shoe laces, string anything that I could hang myself with, no mobile phones, no computer besides the one in the mental institute part which was for 'learning only' Family would call up those in there with me. There was about 18 rooms I was in the 8th room and it was a mix of boys and girls under 20. I was the youngest there twice when I've been. I spent my month there just being away from everyone, drawing,writing and talking to doctors about things. \nMy family or friends never called me, I spent my whole month there just alone, my second time 1 year later I spent 3 weeks there because I begged them to take me out, I did not like being in that part of the hospital. Although it was the safest place for me.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yaumd/"}