{"id": "t5_2qh1i_t3_4e8oip_t1_d1yd7ly", "creation": 1460378549, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I was alone at college and I have suffered from PTSD, severe addiction, and Major Depressive Disorder. This was not my first attempt, but the most serious one. I just finally got so exhausted, death just seemed like the next logical step. I had failed at everything in my life and I couldn't take the shame and guilt of being me anymore.\n\nI took as many pills as I could. I picked up a bunch of pain pills and xanax bars. I took more than I could count. A girl I had known for two weeks came over to see why I didn't come to class. She found me blacked out on the floor barely alive. She dragged me to the elevator and managed to get our advisor to drive us across the street to the hospital. I woke up afterwards wondering how and why I was alive. I was so angry that I couldn't get that final release of all the pain. \n\nShe told me that I needed to quit using and try to get better and we could try having a relationship. I had never been in a relationship before so I had no idea she even liked me. I went to treatment for the 6th time and we started dating. \n\nI had never been shown the kindness she gave to me and the unconditional love. It changed who I was and made me realize that I am not the only person who would be affected by my death. She is the most beautiful, loving and caring person I have ever met.\n\nFour years later we are engaged to be married later this year. I am sober and about to finish up my degree. Now when I know a friend or relative is depressed I tell them that they could be right around the corner from something life changing. I can't say it's been a perfect ride, but my life is better than I could've imagined. There were a few major hiccups along the way, but I am still here.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yd7ly/"}