{"id": "t5_2qh1i_t3_4e8oip_t1_d1yl896", "creation": 1460391537, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ARLsci", "text": "\"Shit\", basically. Then followed by anger and embarrasment. I didn't want to be seen doing it.\n\nMy parents found me after I cut my wrist with a scalpel. Somehow the blade had broken and could not fully complete the cut. They heard a weird sound when I threw the thing against a wall in frustration in the middle of the night. I then ran outside onto the highway, with the blood dripping all over the place. \n\nMy father sprinted outside with a lamp to signal cars there was someone walking on the road, putting himself at risk. I walked off since I did not want him to get killed. They then drove me to the hospital and claimed I had cut myself cleaning up glass. Minutes after we got outside, my mother said I now had the choice of talking to them or we'd walk back inside for professional help. I simply nodded, it was all I managed to do.\n\nThe next 5 days I did not eat, did not respond to anyone and just sat on the couch. I did not even hear people talking, never even saw they were there. During all that time, whenever possible one or both of my parents just sat next to me. My mother took time off work for personal reasons to look after me and get me to eat. I lost 8 kg in a week.\n\nI'm stable now, did the last two years and my PhD public defence is scheduled. My boss was extremely understanding. I went back to work after two months. Everyone that knows me has said I aged a lot. It's probably true.\n\nIf anyone with suicidal intents reads this, **please reconsider** before you do it. If you are not sure you want to do it, don't as you will mess it up anyway and will cause yourself harm. If you are sure, reconsider as well and **talk** to people you trust or a professional helper. **It is not a shame.** When I got back to work, I was surprised to find out two of my colleagues and my boss struggled with depression as well when they were younger. I will never forget them and what my family did for me.\n\nI know it is hard to make that step and open up to someone about it. I failed to do it, but try. Life doesn't suddenly get better. It has been two years for me and I still have moody episodes, but the time between them increases. During those my life still feels like \"the show must go on\" instead of Louis Armstrong's \"Wonderful world\", but you do learn to live with it. Slowly, things improve.\n\n\nRemember, once you have tried killing yourself, you have to learn how to live with the scars, both physically and emotionally.  The white line from my lower arm to my wrist will never go away and keep reminding me of what I did. I will also never fully grasp what I put my parents through. Don't put yourself in that place. **Talk** to someone, before you stop considering doing just that.\n\nIt's the first time I ever speak about this (and type on Reddit, so sorry for the bad formatting), but if it has made one of you reconsider, it has been worth the hour it took me to write this.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yl896/"}