{"id": "t5_2qh1i_t3_4e8oip_t1_d1yy0uo", "creation": 1460408162, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "humanefly", "text": "I saw it. You matter. Everything we do has much wider ripple effects, we leave our fingerprints on history even by accident, without realizing it.\n\nWhen I was much younger, I was cycling down near the waterfront in Toronto and exploring abandoned buildings. I found some old factories, there was a small shanty town on the land with homeless people living there, they put up tents and things. I guess, many of them could not read very well. There were some large shipping containers bolted shut, and a distance away some fenced off rusting barrels in a field. For some reason, all of the plant life around the barrels was completely dead; I wondered why.\n\nI went up to the shipping containers and saw that they were labelled with warning signs: it was so very many years I don't remember now; I think it said: Hazard PCB toxic or something like that. So, instead of trying to break in to look inside, I walked away.\n\nAs I got on my bike to leave, one of the homeless youth approached me. They asked what was inside, and I told them, and told them to stay away. Then I got on my bike and cycled away.\n\nA day or two later, there was an article in the paper saying that some homeless people had taken a story to the paper, and PCBs/toxins/carcinogens were found stored on site and possibly leaching into the water table. So an investigation was launched and the homeless shantytown was demolished, and the land owner legally forced to remediate the land. \n\nYears passed. I had entirely forgotten the incident. Many years later, I was working at an ISP and for some reason the land was brought up, so I shared my little story. My co worker looked at me and said: \"My dad lost his down payment on a condo that was supposed to be built on that land.\" and I started apologizing, and he said: \"No, maybe you saved my life. I would have been with my little brother playing in that playground.\"\n\nThis was a really long rambling way to say: \n\nYou matter. More than you know, in ways that you can not imagine. Onwards,", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yy0uo/"}