{"id": "t5_2qh1i_t3_4e8oip_t1_d1ys6lj", "creation": 1460400588, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheGreatSpaces", "text": "I think almost all thinking people are nihilists even if they don't consciously realise. Realising is hard. One feels adrift and anchorless, and sometimes pointless. The assumptions that drive the ambitions of the masses don't seem to apply to us, except it needn't be entirely true. I console myself with the love I feel for a few people - not wanting them to have to feel the pain my death would cause. On a day to day level I pursue education purely to satisfy my curiosity. I hand in assignments and pass subjects purely to be allowed into the next set of subjects. If I'm going to live I figure I should live in comfort, so that is a modest motivation to find an income greater than what I had before. I find myself focussing a lot on everyday comforts like food, reading. My real ambition is to not feel guilty about watching 'too much' television, or about being unfit or overweight. What starts out as a sort of depressing ennui can evolve into a calm acceptance of the terrifying truth that we don't exist for a reason; a lower level of anxiety about formal achievement can be liberating. Unexpectedly in my current state of mind I find myself giving better advice to others - I can see through their indecision to the obvious answers to questions like \"should I put a deposit down on a house or go on a world tour\", or \"is it irresponsible of me to pursue a career in music and leave my public service position?\"\nIt's when I'm stressed by life and work that I feel I'm at a disadvantage to others - normals don't question themselves as much, they want to survive. Those are the times when I most consider giving up. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ys6lj/"}