{"id": "t5_2qh1i_t3_4e8oip_t1_d1y6ge0", "creation": 1460355424, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SpongeNarwhal", "text": "I woke up really confused and tried to remember what I was just doing; hanging myself. \n\nI was 19 and was 6 months into sobriety after rehab, living with a minister who was a second mom to me. She and her husband were on a cruise and her older son was celebrating his birthday that day. I decided that the world had given up on me, breaking up with my addict boyfriend is what I needed to do... And could not handle it.\n\nI called my then boyfriend and he was so upset he told me not to tell anybody and that he could help me. I knew he was wrong and that wasn't love.\nI called my councillor from rehab/my addictions group and she literally drove across town and took me to the hospital. I had purple marking all around my neck, skinned my spine along something when the rope I hung myself with broke while I was unconscious. \nWe decided going back to rehab for 3 months was the best, and I had no neck injuries from my hanging. \n\nI'm not going to say it was easy, I broke up with that boyfriend, stayed single for over a year, worked on my recovery, and attended what I had always wanted in college: animation. \n\nIt is now 3 years later in my sobriety and almost 3 years since, and I start my final year of animation in September. I am also dating a wonderful and truly loving man who isn't afraid to tell me the truth and helps me best he can; with REAL love. I have a fantastic relationship with my rehab group, family, and the minister whom I lived with. I sometimes have hard days but am moving farther away from thoughts of suicide because I really truly can't bear to hurt the people I love so much in my life today.\n\nPlease don't give up! Don't end your life over a boy, or over anybody in your life. You are SO important, and even more important to the people who love you and we will never understand how much we are truly loved!", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y6ge0/"}