{"id": "t5_2qh1i_t3_4e8oip_t1_d1y7sff", "creation": 1460359779, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "notdead1", "text": "Probably buried but first time i tried to kill myself was drinking a liter of vodka and downing a bottle full of xanax. Went to the hospital after being more depressed than normal and not being able to sleep for 2 weeks, started getting facial ticks and hallucinations, etc. \n\nAnyway the first time my roommates at the time had no idea what was going on. They told me that apparently I cried like crazy and was muttering to myself and banging my head. I went to sleep somehow face down  and woke up with vomit all over everything. First thing i remember was \"fuck why am i still here\" few seconds later \"wtf did i just do\"...\n\nSecond time I was home after graduating still no job or anything, just wasting space. As a side note I'm diagnosed with major depression and general anxiety disorder. My ex who cheated on me like 30+ times in our 1.5 year relationship called me after we broke up for like 1 day so far, just to let me know she fucked someone else. I wasn't stable emotionally and so I went to the liquor store, drank another liter of vodka and downed another bottle full of xanax. \n\nI really wanted to die. I passed out on the street, neighbors drove me to the hospital. Woke up and thought \"fuck im a piece of shit i can't even die correctly, why aren't i dead, fuck you god, seriously fuck you, my whole life i've prayed that i would just die and you can't give me that, fuck god, fuck god\". Saw my parents there waiting, felt horrible about it. Sister told me my dad cried (he never cries, he's a tough ass motherfucker). They left after I said i needed some time, I started to cry about how alone I am, and I have no friends.\n\nRealized that when I tried to talk to my so called \"friends\" for help, no one gave a shit about me. I actually only have 1 real friend who tried to visit me and see if I was okay, he is forever my blood brother even if he lives far. And I'm closer to my family.\n\nAnyway ended up in mental hospital, out patient treatment, multiple psychologists and therapists and the whole shebang.\n\nStill feel like killing myself but won't do it until my parents pass away. I'm a 28 year old loser who is pretty much a shut in and doing shit jobs just to pass time. \nFor those wondering I have a bachelor's in biology, I wanted to be a doctor, did worse and worse each semester as things got worse, still graduated. I havne't turned my life around. I'm thinking about trying to go back to school for computer science or something..\n\nAnyway sorry for the long ass story/rant. Haven't talked to anyone about this shit for like years now. \n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y7sff/"}