{"id": "t5_2qh1i_t3_4e8oip_t1_d1yye7x", "creation": 1460408657, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "yyan177", "text": "It makes you wonder what makes them 'therapists' at all. \n\nI have those suicidal thoughts,  sometimes. But i know i will not be putting them into action. I think it is important to know that it is a feeling, to know that it will pass. Sometimes we need to try and take life less seriously,  have a light heart and just think of it as reading a book, be curious to find out the story of your life.\n\nI think it is wrong to try and guilt people into staying alive by saying what your therapist said. Its a shitty quick temporary fix to a wound that needs tending. If a person has broken a leg, you wouldnt tell him \"stop saying it hurts, don't you know it makes your parents feel bad?!\". His job was to understand how you feel, to show you that life is large and remind you that it is ok to feel shit sometimes, and to ultimately help you understand that you are temporarily blinded by sadness.\n\nBut i dont think many people can do that for you, and the best person to help you is always yourself, since you are the only person who has direct access to your mind. You know you are strong. But you are letting a wound hurt, and you let it hurt because you wish somebody can see and simply acknowledge the existence of that wound. But it is a wound, and it needs tending. if you dont take care of that wound, it would start rotting, and it doesn't matter how strong you are,  it would eventually break your soul into pieces. \n\nOf course,  i may be just projecting all these from my experience.  But if you ever need an accompany,  feel free to pm me. There is no need to let it hurt you. ive been there, i sometimes still feel like that, you are not alone.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yye7x/"}