{"id": "t5_2qh1i_t3_4e8oip_t1_d1ziqrd", "creation": 1460442742, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "xRaFiKi", "text": "Reading your comments is seriously some of the most inspirational stuff I've read on the subject of depression and suicide. Hearing the ways you brought yourself out of it and how positive of a person you are now makes me want to achieve that as well.\n\nOver the past 5-6 months I have never been in a darker place. I haven't ever attempted suicide, but some of the images that flash through my mind are terrifying, yet it was almost as if I craved it. I wanted to die because I felt so utterly worthless. To this day I'm not sure if I'd ever act on it, but it worries me. \n\nI've done things such as therapy and even went so far as to go to a mental hospital (which literally lasted 6 hours instead of 21 days because it was actually for addictions) and while it definitely has made a difference, I still find myself in a slump.\n\nI was doing really well for a month or two, but just recently I've been having suicidal thoughts again and that feeling and desire to just be gone. I've been on medical leave from work for almost 6 months now and I'm supposed to go back soon but I'm just not motivated anymore. I hate my job and I know that I should find something else but there isn't anything due to the poor economy and I feel stuck. All these things snowball and send me right back down with it.\n\nReading your post and comments to follow, however, has revitalized that desire to be happy and positive again. I used to live my life by thinking that mostly everything has a silver lining to it somehow and I feel as though I've lost that. I want to have that again. \n\nAnyways, I just wanted to say thank you on behalf of myself and surely a lot of other people. You have made a difference in people's lives by simply posting your story and I'm sure that you make a difference in the lives of strangers during your day-to-day life. \n\nI hope you continue to bring a ray of light into people's lives, because you do a wonderful job of it.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ziqrd/"}