{"id": "t5_2qh1i_t3_4e8oip_t1_d1y83jw", "creation": 1460360890, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheJVR", "text": "I just had a realization that nothing was going to be the same.\n\nMy wife was the one that discovered me. She called my mom. I was given a choice between going to a psych hospital voluntarily or by police escort, police escort is an automatic visit to Green Oaks in Dallas...fuck that place. I chose to go voluntarily. Went to a private hospital. It was still the worst week and few days of my entire life. \n\nI was given a diagnosis of BP 1\n\nI didn't sleep the entire time...even on Ambien. I had an awful reaction the first night to meds they gave me; not sure if it was the Trazadone or the Abilify. \n\nI was switched to Ambien and Depakote after that. \n\nThey took away my anxiety meds. My normally excellent blood pressure of 110/65 shot up to a regular reading of 140/90 for the duration of my stay. They put me on this shitty stuff called Vistaril; it's essentially a giant dose of Benadryl. Did nothing for my anxiety.\n\nI guess I should mention that they took my anxiety meds because I'd swallowed a bunch of them and slashed my arms--so I guess that's on me.\n\nUmmm, my roommates (I went through two) snored insanely loud. Part of the reason I didn't sleep, though given my anxiety level I doubt I'd have slept even in a solo room. Plus I'm used to a box fan and you're not getting a box fan in a psych ward.\n\nThey also had someone coming through to check on me every few hours...I don't know why....but it was inconvenient to say the least.\n\nI spent the week trolling the nurses station, trying to talk my way out of that place. Told my psych that I was okay. That I didn't need to be there. I didn't go to most of my classes or meetings or whatever you want to call them. In short I was a pain in the ass. They called my family and told them I was being extremely uncooperative and manipulative. Took a long time after being discharged before I even became med compliant. I'm surprised my wife put up with me. \n\nSaw a lot of crazy (no pun intended) shit while I was in there.\n\nAnyway, that's an abbreviated version of my suicide attempt and the repercussions. It's been a long road (6 years) since my diagnosis. I've been in and out of day programs and almost committed multiple times. I've been med resistant and fallen in and out of self harm patterns. I'm going through a major bout of rapid cycling as I type this and am due for a meeting with my psych and a med adjustment in a few days.\n\nThis mental illness shit is a tough road to plough. Every day is a fight. But I won't give up.\n\nSorry for the ramble.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y83jw/"}