{"id": "t5_2qh1i_t3_4e8oip_t1_d1y60x5", "creation": 1460354196, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "toxictaru", "text": "That's about as true as it gets. For some people, depression WILL pass, the problem is they're not often the ones who act on the impulse. \n\nFor some of us, it never goes away. You maybe get better at dealing with it, but it doesn't change the fact that your whole life is about depression. Either you're in the spiral and about to hit bottom again, or you're actively working to maintain that bullshit image that everything is OK because you don't want to bother everyone else with your problems. \n\nWhat doesn't stop, for me anyway, is looking at every single fucking thing around me and realizing that I have hundreds of ways of dying, and all it's going to take is that one moment where I really say fuck it (again) and do something about it. \n\nSomeone mentioned drugs above, and it's funny, because I realize more often than not, that my drug use is one of the very few things that actually get me OUT of an episode. I'm not going to sit here and say I'm not an addict and making excuses for myself, because I'd be lying, I know what I'm doing. But as it stands, it's keeping me alive. I've had extended periods of time without drug use (years), and felt like shit every day, it's coming back to it that makes me feel better. Yes, that's exactly what an addict says, but I'd rather be an addict and alive, than sober and dead. Sorry guys, that's a reality... for me anyway (that's twice I've said that in this post).\n\nMine doesn't go away, I've been dealing with this shit for over 20 years. I've been treated by every drug under the sun, and nothing has changed how I feel about the whole thing. It doesn't change how I feel. I get by because I've been working on it for a long time, but when someone tells me \"it gets better!\" I just get angrier. Not because of some kind of ill-intent, but because those people just don't understand. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y60x5/"}