{"id": "t5_2qh1i_t3_4e8oip_t1_d1yjlm2", "creation": 1460389326, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "rdmacph", "text": "Probably going to get buried but my first thought was that I had less of a reason to live. I broke it off with a girl I was seeing at the time so she didn't have to go through any pain, this also destroyed our friendship as it turned out that she had experienced overdoses so hated me.\n\nIt also got me ridiculed as someone I trusted like a sister made joked behind my back in college, caused me to study from home for a month and not work for 2. It also caused me to get hooked on codeine for months which made me very out of it.\n\nHowever it did show me that someone did care, I messaged another girl I was close to basically crying out after I had overdosed. Saying sorry, have a good life etc. The next day she called me early in the morning to check if I was okay and met with me a few days later for a chat.\n\nAlso someone I kayak with told me we were going out on the canal to help me clear my head. For two hours we didn't talk at all just kayaked in silence which helped.\n\nI forgave the 2 people who turned on me as they both apologised. However I never forgave my stepdad who never knew about my overdose but when he discovered I was off work called me selfish and never spoke to me for days. Even now as I'm a big guy from powerlifting my coping method if I get stressed is to cool down as I have a huge temper which very rarely comes out but when it does can be destructive. He doesn't see me cooling down but yells at me for walking away from situations I don't like.\n\nNot the best idea to someone almost 100kgs of muscle with a temper. One time he started shouting in my face with my mum doing nothing and me trying to reason with him. That didn't work so as he was trying to intimidate me I lost it and shouted back how he wouldn't like it if I shouted at him. This caused him to push me back.\n\nSide note I have a dodgy knee due to the weights I lift and if anyone does anything to possibly hurt it, it's the only time I get physical. He also had me cornered which isn't a good idea. I pushed him away, grabbed my car keys and ran out the house. I didn't care about repercussions at that point I wanted out.\n\nI did return hours later and agreed to be civil with him. It also drove a wedge between me and my mum as she knows why I leave and come back to stressful situations once I calmed so I can think rationally but she just watched it and didn't say a word.\n\nSince his mum died he has been very civil to me but I still don't forgive how he acts towards me. Know that I moved over 150 miles away to uni my mental health has levelled however I still have panic attacks but not as often. But I will never forgive him for that.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yjlm2/"}