{"id": "t5_2qh1i_t3_4e8oip_t1_d1y4tlx", "creation": 1460351076, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 511, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I hope this doesn't get buried, but here it goes. Maybe no one will read this, but I hope someone does and it can help. \n\nMy first feeling wasn't relief, it was more anger and pain. I felt like a bigger failure than I already felt, and since I was handcuffed to a hospital bed and on my way to a psychiatric hospital, the tremendous weight of the process I had to now go through was overwhelming. I was in a locked facility for 17 days, and I lied to every doctor evaluating me the whole time. Told them I regretted what I did, that I wanted to live, that the incident seemed like it happened forever ago, blah blah blah. Just a steady stream of bullshit coming out of my mouth. The truth was I was playing for a quick release so I could go home and do the job properly. \n\nI obviously didn't. The way my mother cried when she visited me in the hospital has stopped me so far. Also, my best friend's mother, whom I love like my own family, gave me the best advice I got during that time. I was talking to her about what happened, and I was kind of beating around the bush explaining what happened, and she stopped me and just said \"own it\". That's made a huge difference. \n\nSo here's my advice to you if you're reading this all the way at the bottom of some Reddit thread.  If your life seems worthless and you hate yourself and you see no point in living, the hard fucking truth is you're right.  I'm not going to sit here and beg you to get help.  You have a choice to make, so make it. But remember that killing yourself has consequences for your family, friends, community. And also this:  just because your life doesn't matter doesn't mean it's automatically better to be dead. Own who you are. To quote a certain half-man, \"never forget what you are. Wear it like armor, and it can never be used against you\"", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y4tlx/"}