{"id": "t5_2qh1i_t3_4e8oip_t1_d1zsu69", "creation": 1460470434, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Britbritters", "text": "Probably not the usual instant regret story. After taking a bottle of anti-anxiety meds and washing them down with a bottle of vodka, my husband (boyfriend at the time) called an ambulance and I was taken to the hospital. My best friend was by my side, and although I can't remember anything she told me I kept crying and saying I wish I had died. \n\nThe rest is also sort of blurry. I remember having to call my parents and tell them what had happened. At the time I was ashamed and could not get the words out when my mom picked up. I asked for my twin sister, who then relayed the message to my parents. She told me after I sounded like a stranger, I was talking at half the normal speed and was slurring so much I was near unintelligible.\n\nAfter convincing my family not to drive five hours to see me, I guess I passed out for a few more hours. I was in and out of consciousness while they flushed my system.\n\nWhen I was disharged from the hospital, I was taken to the Waterford (mental hospital) where I waited for what seemed like forever (this is the same day, late at night now). After talking to a psychologist for a couple of hours I was deemed stable enough to go home for some reason. (he told me I was depressed, duh, with borderline tendencies) I think at this point my speech was still slurred, I definitely wasn't in my right mind. But for some reason I wasn't kept overnight.\n\nSo after about 16 hours I crawled back into my bed, same bedroom where I had decided to end my life. I felt exhausted, ashamed, guilty, and scared. I felt this way for days afterwards, but only relieved I was unsuccessful for the sake of my loved ones. That feeling was mixed with guilt.\n\nTwo years of recovery later and I still have recurring nightmares. Not an experience I am willing to repeat. But if I am being completely honest with myself, what I went through only made me determined not to fuck up if I tried again. Luckily, I have no desire to do so in the immediate future, as I am in a good place right now mentally.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1zsu69/"}