{"id": "t5_2qh1i_t3_4e8oip_t1_d1y988l", "creation": 1460365365, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "enguyen89014", "text": "My first thought was the same as another user's comment. Why did they have to bring my parents into this? Couldn't I have just had my time alone in the mental hospital until discharge and then face them? It seemed like they were like hey lets force this kid who attempted suicide to do the next shameful thing....talk to your parents a about it when it could have been they were all or part of the reason.  I'm Asian so I felt at the time it was more shameful and embarrassing for me for them to have to see a son who attempted to kill himself. Being forced to talk to them at the mental hospital after was so gut wrenching. \n\nSo this is my first post ever on Reddit because suicide is a very important topic to me. I've been on Reddit for maybe 9 months and sometimes I'll think about creating an account and posting but never get around to it but I wanted to elaborate for those who are interested. \n\nSo the first time I took 40 Benadryls and woke up deaf in one ear for the day. I didn't tell anyone until way later on after the attempt that actually put me in the hospital. I was pretty freaked out but eventually my hearing came back. I do recall being very drowsy and trying to go to the restroom but I kept trying to open the door like the handle was at the bottom of the door. It was strange because I obviously knew where the door handle was but was so disoriented I was either hallucinating or just too messed up to get my body to rise fully. \n\nFast forward a few months or so later I took 90. I actually bought the 100 pill bottle but was taking 10 at a time in 5 minute intervals and only made it to 90. They said I puked up purple and started to seize. Apparently they forced coal down into my stomach to get me to regurgitate as much of the drugs as possible before it entered my system. Mind you this is a recount from my parents so I'm not positive on all of the details. He told me the doctor said I flatlined and a defibrillator was used to bring my pulse back. Those who visited me said I was conscious for 3 days in the hospital but not mentally so. They said I kept crossing my eyes and seemed to just not be there. I don't actually remember any of it. My first conscious memory is walking with an IV into the mental hospital where I stayed for 10 days before being discharged. Luckily my parents didn't approve the anti depressants because I didn't want to take them either especially considering I was 16. I had heard that they cause more issues with mental stability prior to 18 but that was about 8-9 years ago. \n\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y988l/"}