{"id": "t5_2qh1i_t3_4e8oip_t1_d1y8jrg", "creation": 1460362620, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 29, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NonaSuomi282", "text": ">You have a choice to make, so make it. But remember that killing yourself has consequences for your family, friends, community.\n\nAnd for those of us with no such connections? Not quite suicidal anymore, but certainly given it some serious consideration in the past, and I hate this being the primary reason trotted out time and again.\n\nMy family doesn't give two shits about me, nor I them. It's a sordid story, but the gist is they dumped my ass a few hundred miles away, told me to fuck off, then had the audacity to \"check in\" on me semi-regularly and criticize how I was getting on without them. Fuck that. As far as I'm concerned, \"family\" is something to be milked for all it's worth in repayment, not something or someone I owe any obligation to.\n\nFriends, basically none to speak of. Probably had something to do with living two dozen miles from my school through HS, which meant I could do fuck-all with anyone after school, then HS itself where I was shipped out to an out-of-state school halfway through. Only people I would have considered friends have eventually lost touch despite my attempts to stay in contact, or else have actively ended our friendship through other means, like lying to my face or backstabbing me.\n\nCommunity? What the hell does that even mean? It just comes across as a hollow word that means nothing except what you want it to.\n\nI don't hate myself- much to the contrary. The reason I would end my life is specifically because I don't hate myself. If I hated myself, I'd force myself to endure whatever I could possibly endure and survive. Instead, it's a combination of selfishness and apathy- I see it this way: my life is miserable. The things that I enjoy day-to-day are fleeting, and obviously so, and they all seem more trivial every day. The things that give me long-term fulfillment have, historically, only been allowed to me for long enough that it hurts that much more when I lose them and are then kept wholly out of reach, and by all appearances it would take a literal miracle to change that within my natural lifespan. That all being the case, why should I force myself to live my life unsatisfied? At the end of it all I'm just another one in seven billion, or three hundred million, or thirty-eight million. There is nothing especially unique about me, or about anything I do or will ever or can ever do. Nothing in particular will be gained by my continued existence, and conversely nothing in particular will be lost if it ends. The only possible way for me to have any kind of noticeable impact on the world, however fleeting, would be to do something spectacular to kill myself, but there's no reason to do so, since I'd gain nothing from it either way. \n\nOnly reason I haven't actually gone through with it yet (and unlike most people in this thread, I've done my research) is because I've set an objective threshold for what I know to be an irrevocable rock-bottom, and I haven't reached it yet. But to be just as objective about my current situation, it's looking more likely every day that I will fall that low before things improve significantly. So it becomes a question each day of \"why bother prolonging the inevitable\"? There's a tiny part that feels an irrational hope that things will legitimately improve and stay that way, not just have my conditions improved as a prelude to falling to a new low, but at this point I'm not putting much stock in the idea. So far, the best answer I've come up with is just base apathy- it would take more effort to go through with the act than to continue drifting along waiting for the final line to be crossed.\n\nSorry, nothing personal to you, I'm just feeling particularly cynical and/or depressed, and in need of a vent.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y8jrg/"}