{"id": "t5_2qh1i_t3_4e8oip_t1_d1yj4g8", "creation": 1460388642, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PunultimatePeril", "text": "I'm a diabetic as well, and I basically did the opposite of what you tried. I've been a type 1 since I was like 5 so I did have a very good idea of what I was doing at the time as well, even if it was poorly thought out in retrospect.\n\nBackground: I was like 13-14 at the time I think, and I'd been starting to suffer from depression (which ran in my mom's side of the family) and I tried to tell her, but she laughed at me. There's more to her \"parenting\" (if you could call it that) that contributed, but that's a story for another day. She probably dismissed it as that \"teenage angsty phase\" but it was terrible for me. I self-harmed but wore those wrist cuffs because I was ashamed of doing it. I scratched myself until I bled because I wanted to feel something, you know?\n\nI was a kid that had friends, did well academically and wasn't the kind to \"look\" depressed. So, it was no wonder no one ever thought that I could have it.\n\nSo, it all started when I got sick with a cold or the flu and my mom never asked me about my blood sugars (which leveled out pretty nicely while I was sick) or how I was doing or felt in general, and I slowly started feeling like no one cared. So I stopped caring, stopped giving shots, stopped testing myself. I could be \"normal\" and not have to do anything was one of my thought processes, I guess. \n\nThen I got diabetic ketoacidosis and was taken to the hospital. They didn't know I'd been neglecting myself the first time so I didn't care. I felt isolated, alone, depressed. So damn depressed. No one asked why or how I was and I just did it again. It was the second or third time I was hospitalized (I can't remember fully, as you can imagine, my memory was fuzzy) they were saying something in the ambulance about me almost slipping into a coma and I had to stay with them, and there was just so much panic around me.\n\nThen I fell asleep because my body was so fatigued, probably from the hell I put on it. I guess I was dissociated from my body in that sense because I felt nothing, emotionally. I woke up in a hospital bed with a strangely calming sensation, like I could die and be content but for some reason I wouldn't go no matter how many times I tried it. I remember thinking that, too. \"For some reason, I can't go just yet but I don't know why.\"\n\nTHAT time, they caught onto the fact I'd been neglecting myself pretty hard. That was probably because I went to a different hospital too. My dad (who I was really close to and respected) was ready to throttle me for being so careless. I was a little relieved in that sense, my first thought being along the lines of \"Oh shit\" because I was in massive trouble, but it was a relief that I actually felt something. It was just numbness for so long, the startle of someone doing that made my heart jump.\n\nBut when I was discharged and got home, my mother yelled and screamed at me about it. It wasn't the \"I was deathly worried about you, why did you do this?!\" kind of yelling, either. It was more along the lines of \"Why are you such an idiot, look at what you've done!\" It made feel more than just ashamed, it made me feel like I should've just done the deed just so I wouldn't have had to deal with her again. She kept getting in my face and said \"Do you want to kill yourself or something?!\"\n\nI retorted a \"no\" out of reflex, but I never had the courage to admit to them I wanted to kill myself because I felt no one cared. Looking back, I'm ashamed of it because for a couple years, I put my father in some serious financial strain and my mom actually called me a \"financial burden\" at that point. I felt bad because in retrospect it was selfish. I wish I'd spoken up about it sooner, but at the time I had no idea how to really put it into words. I'm glad I'm still here, but it's an uphill battle with depression.\n\nThe climb up from rock bottom when you feel like you've got absolutely nothing to lose is so difficult. I didn't have support from anyone until years after the fact because I never went to anyone, friend or professional about it. I never took drugs, I just tried to live life \"normally\" or rather, how my friends used to see me. I started feeling better soon after when I went back to school because of how elated they were that I was still here. Little by little, I salvaged some comfort from them being so earnest and grateful for my existence. I told my mom that the only reason I was alive was my friends, she called me stupid or something along those lines and that was my rollercoaster for a while.\n\nI still struggle with that depression, but over the years (I'm 20 now, married and far from my home state) I've told close friends and my older sister about it, and I've become a little more comfortable with my support system. It's... a bit humbling in a way how much of an impact I made on so many people. It's one of the biggest lessons I've taken with me and why I'm always so serious when people talk about killing themselves because they feel alone and no one cares. I still have a lot of issues coming to terms with who I am and the idea that I shouldn't hate myself at times, but my support network has helped me a lot. I'll probably start counseling someday, once I work past my damned pride in avoiding that route.\n\nBut honestly, I'm glad you're alive. That's a frightening situation, but your quick acting is definitely commendable. Your story will probably help a lot of other diabetics realize that route is definitely a rollercoaster and discourage them from trying the same thing. ^^\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yj4g8/"}