{"id": "t5_2qh1i_t3_4e8oip_t1_d1yu9kr", "creation": 1460403266, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ladycowbell", "text": "When I was starting high school I decided to move to Florida with my mom. My parents had divorced and my mom packed up and left one day. I went from living her to living with my dad suddenly. My dad was incredibly poor and mean to me (looking back it was because of the stress of raising five kids with no money, we wasnt mean he was depressed). Anyway I moved to Florida and everyone was cruel to me. I had no friends, no one was even nice to me. I was alone all the time and incredibly depressed. No one in Indiana wanted me and neither did anyone in Florida.\n\nSo one night I went out and threw myself off of The Pier in Saint Petersburg (its a large shopping building that's on a Pier that extends into Tampa Bay). I just sort of climbed the railing and jumped in during high waves because of a storm. I figured no one would find me because it was late at night.\n\nWhen I came to there were a group of four or five homeless guys that were trying to help me. I had worn a bunch of heavy clothing to weigh me down. They had stripped me down to my essentials (shirt and shorts). One was sprinting down the beach leading the EMTs to me.\n\nWhen I actually was able to make thoughts again I remember just thinking about how people that had nothing in life worked so hard to save my life. I vowed to never let my struggle with the feeling of having nothing ever get the better of me again. I moved back to Indiana and started donating and working with the homeless. I vowed to dedicate my life to those less fortunate than myself, because I owe them my life.\n\nI never did meet the five guys that saved me again.\n\nTL:DR Tried to drown myself, was saved by group of homeless men, vowed to dedicate life to helping others.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yu9kr/"}