{"id": "t5_2qh1i_t3_4e8oip_t1_d1yb8zr", "creation": 1460373133, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mumblybee", "text": "The thing is with a gun, you either pull the trigger or someone catches you and thinks it's a good idea to wrestle it out of your hands. Either sheer courage or complete reckless abandon has to overcome you if you think it's a good idea to put yourself in harm's way. \n\nWell, when the woman I loved, the person I never wanted to seen hurt, has had it with the relationship after 3 years of living together said enough was enough, everyone is running high on emotions. The thought of being abandoned after I had envisioned living a life beyond myself was about to peace out, I couldn't control myself. I was no longer present mentally. I felt like I was observing everything. After 5 years in the Army this was what was going to kill me, I just felt numb. The only thing I could consciously do was give up my gun. I didn't want to hurt her or anyone in the apartment compound since 5.56 rounds penetrate sheet rock like nothing. \n\nAfter all my years of service, I wasn't about to hurt anyone else in my selfish act. I gave up the gun. I opened the door. I emptied my pockets. I waited till the cops showed up. I complied. \n\nTo this day, I haven't been able to be recover. My number was up that moment, and whoever existed then died. I haven't been able to hear his voice ever since. All my childhood memories just seem like some vivid memory that someone else lived. I am a husk of my former self, someone that everyone who doesn't know what happened still look to me for guidance and inspiration. I am just fake version of my former self who is merely impersonating him. \n\nThe only thing I'm doing now is existing so all the people who claim to love me don't have to actually deal with me no longer physically being here. If I could, I would erase my existence and try to reform some new life, but I know that isn't going to solve anything. I just don't want to bear this identity I have anymore.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yb8zr/"}