{"id": "t5_2qh1i_t3_4e8oip_t1_d1yiexj", "creation": 1460387622, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "hownotwhy", "text": "My husband committed suicide 7 years ago and I have come a very long way in that time. I lost my best friend, college sweetheart, confidante and everything that has ever grounded me and the fight back was more than difficult - there are not even words to describe it. I still suffer from some residual PTSD and anxiety which I finally decided that I needed to take - I fought it for a long time. I wanted to be strong enough without it. I have often thought that I don't understand why all this has happened to me. A wise friend cautioned me recently that that why question is not helpful but focus on how to get through it. It made things clearer. I am a better person for all this - I know it in my soul. After relocation about 5 years ago, I finally took a job that was everything I ever wanted. It has not yet been a year and about a month ago with no warning, my boss starting giving me a very hard time. Feel like I am being treated unfairly and it is causing me a lot of stress, even with my medication. I have worked really hard and it all seems so unfair. I feel like I am the unfortunate scapegoat of something I could not have changed. I have meeting tomorrow that I am dreading where I am either going to be fired or severely dressed down and it's all I can think about despite by best efforts. It's hard not to wonder why this is happening - I keep thinking when will this all be enough? Haven't I gone through the enough to finally get a break? I know that is weak and counterproductive but I just want to coast for awhile. My husband saw the goodness and potential in me. I wish any of that mattered to anyone else. I am so so tired. I am trying. I am praying. He left me here to deal with all of this alone. It seems so unfair.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yiexj/"}