{"id": "t5_2qh1i_t3_4e8oip_t1_d1y7avb", "creation": 1460358080, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kobekramer1", "text": "Well, I don't know if what I did counts, but I did a 4 day binge on amphetamines. I took 16 30mg vyvanse, snorted 3 adderall 30mg, and took 2 adderall xr 30mg.  My chest started hurting about day 2 and I didn't give a shit. So I definitely understood what was the probable end of this. On day 4 about 30 minutes after pill 16 I stood up and my heart hurt extremely bad, my head felt this weird pressure, especially under my teeth, and everything went blank. When I sat back down I looked at my friend and it took me about 10 seconds to realize who he was, where I was, and what I was doing.  I spent the next few hours feeling my blood desperately try to reach my head and feeling like i was passing out every now and again.  I balled my eyes out and I never cry. Everything I valued that I didn't realize I did, like the love of my parents, quickly became obvious. I wrote them a death letter telling them how much I should have appreciated them because I was sure my heart was stopping soon, Or that the blood wouldnt stay in my head long enough. After this same feeling continued for two days I just texted my dad, which seemed like the worst case scenario at the time, I just wished that I was dead so that I didn't have to face my parents for some reason, \"can you come pick me up, I need you.\"\n\nWhen they got there I got in the car, balled my eyes out and tried to get it out that I thought my heart was failing. I can't describe what this did to me mentally.  To not be alone in what I thought was my death, it was like years of having severe anxiety and depression melted away. Maybe like an ego death or something. Tons of abstract insecurities just washed clean.  It was wonderful. Then about a week in bed passed, no doctor could explain why I feel the way I do even after ecgs and ultra sounds, and the old feeling crept back in when I started feeling like I should be doing something buy I couldn't. \n\nI wish I had a happy ending but I'm just about the same as before i did this and it's been 6 months. I still value that experience though. I know that there is something now that is seperating me from that state of normalcy. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y7avb/"}