{"id": "t5_2qh1i_t3_4e8oip_t1_d1yaiip", "creation": 1460370543, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 33, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "failed_suicide", "text": "throwaway because this is my biggest secret and isn't something I'm proud of. \n\nWas 15. Retrospectively I lived a wonderful life, but decided to choose a permanent solution to temporary problems. Got my older brothers gun (Merica), went to the garage. Loaded it. \n\nI swear my thoughts were ripped straight from the lyrics of a shitty 2000's pop-rock album. I imagined how bad it would make that whore feel, how all my friends would come to my funeral, how my parents who were going through a divorce would cry, how my brother would probably hear the gunshot upstairs and be the one who finds me, how my band would write a song in my honor – what an awesome show. Lot's of cool people ended this way – Kurt Cobain, Hemingway. You will miss me, I will be a legend.\n\nI pulled the trigger with the gun to my temple. It felt like a hammer had hit my head, my eardrum exploded and I remember time decreasing in viscosity as I slipped out of consciousness. I felt warm. \n\nI opened my eyes to a burning sensation going straight through my head. My eyes were on fire, I was coughing, I couldn't breathe. I couldn't see. I couldn't hear. Tears were rolling down my face. Blood was gushing down the side of my head. I did not understand what was going on. I didn't think shooting off my head was this painful. \n\nThen I stood up, dizzy as hell. I bolted outside from the gas filled garage and let the sun hit my face. I couldn't open my eyes, nor could I hear anything. The neighbors saw me and called the cops with an ambulance.\n\nTurned out my brother only had tear gas bullets. I managed to make an excuse that it was an accident, that I was playing with the gun in the garage and shot myself by mistake. I had squeezed the trigger too hard, jerking the gun upwards so the burn-mark on my head was not at a direct angle. Everyone believed me. I got insane amounts of attention in the hospital from my family and all my friends. \n\nI got exactly what I wanted. Now looking back – Jesus Christ what a dumbass I was.   \n\nEDIT - Spelling", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yaiip/"}