{"id": "t5_2qh1i_t3_4e8oip_t1_d1ydwg1", "creation": 1460380057, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "layoxx", "text": "I'm sorry to hear about your friends. I'll be here if you need to or want to talk about it. \n\nFor me, the suicidal urges always came on quickly, unexpectedly. There was no time to plan because it was an immediate desire. I needed to kill my self as soon as possible with whatever was near me. So it always failed. I didn't truly want to die, because in the days after I was happy to have survived, and I thought I was all past it and all better now. Then it would come around again, like being possessed, and I couldn't even think that there was a time when I had ever been happy. It was all consuming. \n\nI made it a habit during the happier times to make sure there was never anything dangerous in my day-to-day life. Knives were kept in a public space (I've never lived alone), no dangerous pills, no strong ropes around, no guns in the house, etc. That way my only options were to try and choke myself or shut my head in a door, or other things with inevitably fail as my body stops working correctly. I kept it a secret for many years because I was afraid no one would think that I 'really wanted to' and I was lying for attention, that it was just a cry for help. \n\nA former roommate planned his out for a really long time. I think he used an ineffective method because he didn't want to arouse suspicion. He kept it on his desk for weeks before trying to poison himself, looking back on it, it was always around. I won't put words into his mouth about why he chose to live, but I am proud of him.\n\nI think it's really different for everyone, there are so many reasons why your mind can spoil, and many methods people try to cope with it. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ydwg1/"}