{"id": "t5_2qh1i_t3_4e8oip_t1_d1yla22", "creation": 1460391605, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "thief425", "text": "My perspective is that I am glad that person is here, on a grand scale. I don't know them personally, but I know they have a perspective of human existence that can only come from what they've experienced. We can't presume to know what they will or won't contribute to society, nor do we know the exact impacts of their willingness to share their story with us today.  Maybe it will directly impact someone today, maybe it will be a faint memory or a bubble of hope for someone else down the road.\n\nWhat I am certain of is that if they were not here, alive, today, we would be missing contributions to this conversation. Theirs, yours, mine and the others in response to yours, etc. None of us exist in a vacuum. We are all connected in strange and unknowable ways.\n\nAs a therapist, I often see people who filter the actions of everyone else though a lens of negativity often reflecting their mental health symptoms. Whereas some people may have a more optimimistic, glass half full, take on life, and honestly believe that they ARE glad that person is here to share their story, another person may filter that through a nihilistic lens and only perceive false intentions and hollow compliments. But, that's the perceived intent, not the true intent of the person who said it.\n\nJust as you may not appreciate someone telling you that you should be happy and get over it, those people may not appreciate being told that they're not allowed to be happy that another human being didn't kill themselves. \n\nI think it is a terrible failure of our social, healthcare, and justice systems that people suffer so much as to want to die, and they proceed so far as to make an attempt without being offered the help they need. When we, as a society, get a second chance to make a difference, I AM happy about it, and hope that maybe this time we can get the person the help they need like we should have the first time.\n\nI wouldn't automatically assume that everyone is being disingenuous. Some of us signed up and have dedicated our lives to fighting for the right to wellness, peace, and happiness for all. We get paid crap for wages, considering the education and overtime it takes to do the job properly, and there are emotional and physical tolls we pay as well. We very much care that people got another chance at life, and it's heartbreaking when you're too late to make a difference. \n\nI've lost clients, but I know that I did everything I knew to provide information and choices and to make sure they knew they had value. There is an inherent dignity of humanity that we all deserve, and it is my duty to ensure that each person is afforded that respect, empathy, and understanding regardless of their station or direction in life.\n\nI don't write this to tell you what to believe.  That is your choice to decide whether you believe people are genuine or not. But, I hope to offer a perspective you may not have seen before from a person who doesn't know you, but who loves you not because of what you are today, but what you may someday be to someone else. We can't predict the future, good or bad, and I'd like to take my chances that you might do something amazing some day, and I'd like you to be here to do it.\n\nGood luck, adventurer!", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yla22/"}