{"id": "t5_2qh1i_t3_4e8oip_t1_d1y63ys", "creation": 1460354435, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 66, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "dezeiram", "text": "You're a wonderful friend just for being there, but I can't even express how valuable it is that you're actively trying to understand. \n\nI dont knoe how severe your friend's depression is, but i'd like to share some things with you that may  be useful.\n\nDeciding to be one of those support beams is HARD. Almost certainly there will be times when you yourself feel emotionally strained. I've been both the supporter and the supported, and both sides can be incredibly frustrated at times. There are times when nothing you do will \"help\" and those are the absolute worst. \n\nThrough all of that strain though, it is ***vital*** that you stay yourself overall. At the end of the day, assess yourself. Your feelings. Your attitude. If you feel a change for the worse, address is AS SOON AS POSSIBLE. I fucked up really bad with this in my last relationship. My boyfriend was extremely depressed and stressed out all the time. He didn't even really take it out on me. He tried so hard to be happy for me, encouraging me to focus on myself. But I got so lost in being desperate to help him that I really did forget that my own happiness needs maintaining too. And I'm pretty sure my actions are the reason I stepped away from that relationship, and I'll feel terrible for that for the rest of my life. **You cannot help someone else if you yourself need the same help**. \n\nDon't let time slip away from you. I don't know how often you guys talk, but make it often and regular. Try to get your friend out of the house, even just to sit outside to talk. Regular sunlight does wonders. Coffee shops, zoos, aquariums, the park, a riverside, whatever you can do to get your friend out of the house in a relaxing way.\n\nSorry I ended up venting a bit. I hope this helps in some way. Best of luck to you!", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y63ys/"}