{"id": "t5_2qh1i_t3_4e8oip_t1_d1y6xta", "creation": 1460356902, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "hotliquidbuttpee", "text": "Shit, I was so messed up around that time I actually didn't remember I had done it until I had been sober for a few months. I was fucking horrified. \n\nI was really bad off on some stuff after my kid's mom left me. In a haze one night, I swallowed the rest of my bottle of Tylenol PM, about 15 extra strength pills. I woke up maybe 16 hours later and went to work. I saw the pill bottle on the coffee table but it just didn't really click. I mean, I knew what I had done. I guess I can't really explain it. I just kind of put it in the back of my mind and went about my shattered life. \n\nI checked into rehab a few weeks later after an extremely painful detox, got sober, and became happy again. I vividly remember the day I finally felt the warmth of the sun on my skin again. About two months after checking in, I was at a meeting and someone was talking about their suicide attempt. Everything came flooding back and hit my like a ton of bricks. I had to leave the room to regain my composure. \n\nIt took another two years before I told someone: my kid's mom. She was being really ugly to me about something I had said or done and I begged her to stop. She was telling me that I was vile and disgusting and she never wanted to see me again. She told me that everyday for the past 3 years she regretted having a child with me. Our beautiful son. She said if it was up to her, they would move far away and I would never see either of them again. She said loving me wa the biggest mistake she had ever made, and that she hated that I was the father of her child. That she shivers at the thought of me being in the same room with her. That I will never so much as hug her again. We haven't made physical contact since, and she is visibly uncomfortable every time I'm around. \n\nAnyway, I begged her to stop saying those things. In the confusion of what was happening, I told her that the last time she treated me this way, I tried to kill myself. I regret that. She called me a \"fucking liar.\" \n\nAfter a little while, I guess she believed me. She told me if I was going to kill myself to please do it right now, before our son was old enough to remember me. \n\nI don't hold it against her. Her mother had just died, her boyfriend had just cheated on her while her father was in town visiting after the funeral. She had also just lost her job. I really don't think I caused her to say those things. She actually called a week later and apologized for saying all that to me. I thanked her for the apology, but foolishly asked if she was just apologizing for hurting me or if she actually meant it. She apologized for hurting me. \n\nEdit: I'm sorry, that's really long. I didn't mean to write so much. You guys don't have to read it. \n\nTL;DR: I forgot I tried to do it for a couple months. I've only told one person, she didn't believe me. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y6xta/"}