{"id": "t5_2qh1i_t3_4e8oip_t1_d1y6qnw", "creation": 1460356282, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "fresnohammond", "text": "\"Where the fuck am I? A HOSPITAL?? WHAT THE FUCK AM I DOING HERE?!?!?\"\n\nI don't really remember the suicide attempt, or even the choice. It was by alcohol. I was blackout drunk already.\n\nI'd been dealing with several months of hardcore sleep deprivation. I got a few reprieves but it went something like 1-2 hours of very fragmented sleep a night. The rest of it was just drowsiness but no sleep. Every night. Every fucking night. Worst stretch was 4 weeks of this.\n\nFirst went my fine motor skills.\nThen gross motor skills.\nThen judgment.\nThen mood.\nThen complete mental state. I don't just mean stability but conscious perception started getting fucked.\n\nAnd the physical misery. Boy! You know those charts they keep in a hospital \"How's your pain today?\" 0-10 where 10 is screaming agony unable to respond the pain is overwhelming, 9 is close, 8 is fucking miserable mate.... so on....\n\nImagine the same scale but \"intense physical discomfort\" without any actual sensation of pain. I was probably a 9 on such a scale. My hands were the wrong shape and muscles attached every which way, all of them wrong. The world spun in peculiar and decidedly unpleasant ways and I generally felt the worst sensations of physically being on a very large roller coaster. Finger spasms non stop, same with legs. Sometimes unable to even hold a pencil. Sometimes unable to walk. I had very little direct control over my muscles by that point. Taken to ER twice for what appeared to be a seizure. Wasn't.\n\nAll from sleep deprivation.\n\nTo be clear my body was putting me through shit normally reserved for when the CIA really wants to tear a human being apart.\n\nWorst time of my life, and that's saying a lot.\n\nA few times after this I was very suicidal but thankfully was under supervision. When your existence is that wretchedly .... well.... wretched.... you just don't want to live anymore. Not like that. Dear God not like that.\n\nAll sorted now. Very happily. Easily too, though I fear the vague possibility of a world where these two simple medications are no longer available to me. Not likely though.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y6qnw/"}