{"id": "t5_2qh1i_t3_4e8oip_t1_d1y8vkb", "creation": 1460363928, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "fattysthrowaway111", "text": "I took a huge aspirin overdose, about 200 pills, and then got into bed and waited to fall asleep.  However, sleep did not come.  Hours passed, I developed stomach pains and the pains got worse.  I became sweaty and agitated and tossed and turned.  After several hours, I realised I wasn't going to fall asleep.  I realised I'd be awake while dying, and it might take days.  The pain was already so bad that I realised I couldn't take that.  I had no choice but to go and wake my mother up and tell her what I'd done.  I stood outside her bedroom door for ages, trying to summon up the courage to go in and tell her what I'd done.  It was just awful.  We went to the hospital, and I was taken through immediately.  It was too late to pump my stomach, I had to be put on a drip and given activated charcoal to drink instead.  But the aspirin had really taken hold and I became terribly confused and spent the next few days having audio and visual hallucinations, and often not being sure where I was or what was going on.  When I came back to reality, I think my first conscious thought was hurt and dismay that everybody - medical staff, friends and family - were being so unsympathetic and downright nasty to me because of what I'd done.  I was given no psychiatric help, just discharged after my physical ailments had been seen to.  I was 17 years old.  I'm 32 now and despite repeated requests, still haven't received any psychiatric help.  I would still commit suicide now if I could find a sure-fire way of doing it.   this happened in the UK if anyone is wondering.  The NHS is fucking useless for dealing with this sort of thing, and my family are totally unsupportive.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y8vkb/"}