{"id": "t5_2qh1i_t3_4e8oip_t1_d1yhn8z", "creation": 1460386475, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Danasaurus_Rex", "text": "Do you have a counsellor or therapist? As someone with bipolar disorder and anxiety disorder I've found that while I can discuss the regular relationship stuff with my husband, I know he's not a professional and that my issues run a lot deeper than most people's. \nI see a psychologist to deal with the heavier stuff and my husband is able to be supportive without feeling like he has to know how to help me with coping techniques and all the little deep dark minutiae of my brain that would probably scare him a bit as even though we have been together for 10 years this June he has only known me at relative stability - he didn't see all of the demons I had and the way I had to fight them to get to where I am.\n\n\nPeople who don't experience these sorts of things can't ever fully understand, they can only be supportive from the sidelines. They aren't medical professionals and that is what we need, people who are experienced and schooled in this sort of thing to help us with the mental fight. I hope it gets easier for you, and know that you do have a complete family. Your kids love you and need you, and if they are the best reason to stay around. \n\nSorry for the huge block of text, this really hits home for me. My parents split up because my dad didn't get help for his bipolar and anxiety and my mom couldn't be parent to him as well as 2 kids.....he never got help for his issues and ended up hurting his kids (emotionally) because of it. I haven't talked to him in 5 years. My sister barely talks to him. Fight for your health and your kids, they are worth it and more importantly you are worth it!", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yhn8z/"}