{"id": "t5_2qh1i_t3_4e8oip_t1_d1yjazz", "creation": 1460388904, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I'm 24 and female. I swallowed pills and laid down waiting to drift into my eternal slumber. When I woke up I was covered in my own vomit and was incredible dehydrated. I laid on the floor thoughtless for what seemed like hours. I felt like an empty vessel and I was filled with a deep sadness that I could not accomplish the simple task of ending my own life; I slipped back into a deep sleep and when I woke the second time I was greeted by a cat (I didn't own a cat at the time). The cat purred and laid on my chest and together we just laid there waiting for the energy that comes with life to fill my lungs. Eventually I stood, cleaned myself up, showered and it is then I realized the seriousness of what happened. Never before had I attempted suicide and as I reflected on my suicidal actions I began to feel sick, ill. My legs gave out and I fell in the shower and began sobbing. After my shower I slept for two full days, hardly eating or sleeping. When I woke up I felt reborn. My life changed drastically and I began advocating for myself. The abuse I experienced as a child seemed conquerable and I took the first deep breath I've taken since being birthed into Earth's atmosphere. I felt no shame, I felt no obligation to others, I felt grounded in myself. A gift no counsellor or therapist could have ever given me. I felt strong and for the first time ever I began to understand myself and my existence. Suicide and I danced a tango and thankfully the dance didn't lead to my death, but to a new beginning. I am still struggling with my mental wellbeing and the past abuse I've encountered haunts me, but it does get easier... Slowly, but it does. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yjazz/"}