{"id": "t5_2qh1i_t3_4e8oip_t1_d1ygupb", "creation": 1460385289, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rgnxsupreme", "text": "When I was 20 I was going through a rough spot and I was in a really bad relationship that lasted 6 years. She cheated on me all the time, was verbally abusive and an all around horrible person. One night (Around 2am) I couldn't take it anymore and I decided to take my car down a local street where many others have lost control and died. There are some serious bumps and hills where every tree has flowers/memorials on it.  \n  \nI was doing about 95mph when I hit the bumps and lost it...  \n  \n\nMy car spun out of control and it felt like time completely stopped then went in to fast forward.  \nWhen my car had finally came to a halt I was in the center of the road. Untouched.  \n  \n\nAt that moment I felt a purpose. I wasn't supposed to die.  \nThere was something more waiting for me. \nI did not know what the reason was but there was this deep sense of life.    \n\nAfter sitting there in silence for about 10 minutes, I turned around, went back home and cried myself to sleep.  \nThe next morning I drove down that same road.  \nI remember exactly where I started to lose control because there is an old gate to an abandoned barn right where the first bump is.  \nI saw the tire tracks... They went straight in to the woods...  \nAnd the tracks came back out about 10-20 feet down the road and continued to spin until I stopped.  \nI was never one to believe in miracles or guardian angels but God had my back that day.  \nI finally broke it off with my long term girlfriend that weekend.  \nI met the most amazing girl not long after and we are married now.  \nI've graduated college and I am living a pretty awesome life.  \nTotal 180 from where I was at a few years back.  \n\nThe moral of the story is just let time & God do his thing.  \nThere is purpose in everyone, even if you don't feel it.  \nYou have worth and meaning to someone, somewhere.  \nDon't give up. Don't lose hope. You are loved.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ygupb/"}