{"id": "t5_2qh1i_t3_4e8oip_t1_d1ya3dy", "creation": 1460368898, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "plaid_banana", "text": "Try not to feel too horrible about it. I know that's so much easier said than done, but you did what you could.\n\nI've been on both sides of the situation, suicidal (although not actively so) and trying desperately to keep my (actively) suicidal partner alive. And I do mean desperately... I don't think there's another word that can accurately convey that feeling of utter despair. \n\nI had a lot of guilt about it too, and though I'd wanted to break up with her, didn't do so because I felt it would've been kicking her while she was down/that I would've been \"just another person who abandoned [her]\". And when we broke up, I *was* suicidal (though she didn't know it) and I *was* angry that she wouldn't stay to help me as I'd stayed to help her so many times.\n\nBut despair and anger and guilt aren't good reasons to stay together. It's hard to hear and hard to believe from both sides, but ultimately one partner cannot be responsible for the other to stay alive or to be happy. And if one partner is unable to communicate, as is so often the case when you're suicidal, then the other partner is by no means obliged to stay with them. It's not a personal failure on anyone's fault, it's just that mental illness is *obscenely* difficult, and it can end even the best of relationships. Again, it's not anyone's fault, it's just a thing.\n\nedit: You're never obliged, or should never be obliged, to stay with a partner. Mental illness/suicidality or not. Don't worry about being abusive or ableist or neglectful or callous or selfish or whatever if you're thinking about breaking up. Those are some of the things that my ex had engrained in me (had she not been otherwise abusive, or had I not been mentally ill, maybe they wouldn't've stuck) and it absolutely tore me up. But a person is *never* obliged to stay with their partner if they don't want to. If you want to leave, you can and should. It took me way too long to learn that.\n\ntl;dr You did the right thing.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ya3dy/"}