{"id": "t5_2qh1i_t3_4e8oip_t1_d1yfn04", "creation": 1460383323, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ZabaZuu", "text": "I read your posts and wanted to say that you have very big dreams, and even your small dreams require pretty substantial preparation in the form of education.  Since you've gone to school, you probably know this already, but I want to say it anyway if only to bring it to the front of your mind: you have to think of everything as small steps towards the greater goal.  I'm about to graduate with a BS in computer science, I'm very familiar with the workload required and I don't think it's something I could have handled working a full-time job along with it, at least not with the results I wanted.  My point is that I sympathize with the sense of things feeling out of reach.\n\nYou said you follow tutorials online to help you reach your goal of making a game.  I recommend focusing on the fundamentals of programming before following those tutorials, if you haven't already.  Everytime I have tried to follow a tutorial for anything you could classify as a product of programming, it made me feel incompetent in a way, and when I finished, I didn't feel like I could do it without the tutorial.  I never felt like I was taught anything through those.  However, it is empowering when you know what you are doing as a programmer and you understand the underlying technology, then you figure it out on your own.  Try to get yourself to the point where you are learning the tools (meaning a game engine), rather than the process of creating something with it.  I don't know if I worded this very well, but if you'd like you can PM me and I can try to direct you towards learning programming on your own.  Getting a job as a software developer can be done with a solid GitHub portfolio, at least at new smaller companies, so don't let a lack of funds get you down.  I'm not gonna lie to you, a degree is required for most companies, but you should still pursue your dream.  Your passion can give you the edge in interviews and again, a solid portfolio can make a huge difference.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yfn04/"}