{"id": "t5_2qh1i_t3_4e8oip_t1_d1zjq47", "creation": 1460445797, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "urdeadxd", "text": "I'm glad to hear that you're in a point in your life where these problems are no longer ones you currently have to deal with. Also I can't imagine the emotions you will have to deal with as a result of this past abuse. But if you're over the hump like you say, then you should focus on that and not what's happened in the past.\n\n Depression is something that requires your time and effort. I'm someone who naturally falls into a depressed state of mind but its up to me to snap myself out of it. It's like sitting around and worrying about every starving kid if Africa. Or every person who died in a car accident today. Theres a lot of terrible stuff in this world and some things you shouldn't lose time worrying over.\n\n I know the feeling of losing so much time and mental effort going down the wrong rabbit hole in my mind. And I'm not trying to make it sound like this is something that people choose for themselves. But if someone is the type to fall into a negative state of mind then they DO have to choose NOT to let themselves fall for that trap.\n\nIunno man. Theres nothing I can say to magically cure a mental state, otherwise I would of brought my witchcraft around the world so no one would have to deal with this. I do know that I care about you though. As a person and as someone that I can relate to. I also know that you have a lot of people that care about you and that you care about them too. \n\nMy buddy was found dead 2 days ago. I can't explain to you the amount of hurt that is being felt throughout his family and friends group. He had so much to live for and so many that have been absolutely torn up over how things turned out. I doubt you're much different. I doubt anyone is so alone that they really don't have reasons and people to live for. \n\nAnd please quit feeling bad for feeling bad. It's perfectly natural and you can see how it's a vicious cycle, I'm sure.\n\nI hope my message has made you feel at least a little better or a little more like talking things over with those closer to you. I'm sure they would be more than willing to. Hope you have a nice day.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1zjq47/"}