{"id": "t5_2qh1i_t3_4e8oip_t1_d1y7p5x", "creation": 1460359449, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "KingInTheWest", "text": "I've got two attempts and one almost attempt to my name. First attempt was trying to swallow pills and just pray I never wake up, I can't remember what pills they were but I was 17 and stupid so probably nothing that could kill me. Woke up with vomit in my bed and nobody to notice it at home.    First thought was 'where the fuck am I?' Since well I thought i was never waking up. \n\n\nSending attempt was 2 weeks later. Tried hanging myself in the backyard. Turns out not being a boyscout paid off, the knot at the loop came undone and all I could think was 'I can't even fucking kill myself properly' \n\nAlmost attempt came 3 months later while in counseling and under near 24 hour surveillance from my family or any authority figures cause my parents had seen the cuts on my arms.  \n\n Something minor had set me off, probably something girl related (my girlfriend at the time was also severely depressed, loved her to death, and we helped each other at times but overall we were just straight bad for one another) \n\nSo I decided that it wasn't worth everything, I decided to sneak out and hang myself in the middle of the night (I had a fixation with this way as the summer prior my best friend hung himself, and I wasn't smart enough for the right pills)  \n\nThe thing that changed my mind was remembering that friends mom at his funeral service. I couldn't bear to think of my mom in the same way, or my friends who were already still living with his death having to go on with mine too. \n\nI think the only reason those thoughts even occurred is because I went to get help (even if it was non optional) so please please please if you are in a dark place get some help. When just taking to the therapist helps. They're not emotionally invested so you can actually have a chance for a rational conversation about what's going on.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y7p5x/"}