{"id": "t5_2qh1i_t3_4e8oip_t1_d1y8zzf", "creation": 1460364432, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NEXT_VICTIM", "text": "Please don't read this if you are diabetic and depressed. Hell, don't read this if you are a medical dependent with depression. It's dark as hell. If you need someone to talk to, PM me or check the sticky'd mod post at the top.\n\nLet me tell you about how my world used to work. Mind the rant, you can't really turn this sort of thing into storytelling.\n\nA type 1 diabetic in shit control is basically in a constant living state of a suicide attempt. You are constantly fighting to keep yourself alive while your body does everything possible to throw you into either a coma (extreme low BG levels) or into Diabetic ketoacidosys (extreme high BG levels).\n\nIf you take that struggle and add depression (which is statistically common in childhood onset type 1), you get a situation that can cause that living constant attempt. In fact, it's downright masochistic just how that edge is. \n\nThe weirdest part is that that sort of dangerous edge could be unintentional. Just not having good control can put you in that perilous medically neglectful spiral.\n\nAnother issue is that lack of medication can directly cause depression and a host of other \"lethargic\" style symptoms. Once your in the hole, it's horribly hard to climb out. Even the effort to go and get your Meds from a cabinet could be enough to wind you and force you to need a rest.\n\nEven stranger, the well accepted remedy is to have a specialized doc (endocrinologist) basically yell at you. They can't actually help you if you can't keep up the treatments. That means that the chronic illness that allows that situation can only be improved by reducing the depression. It's a catch-22.\n\n\nI am in better shape now but there are still moments that I have to work incredibly hard to keep my self stable. It's a challenge but it allows me to appreciate every moment to it's fullest and it gives me a hell of a sense of humor. \n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y8zzf/"}