{"id": "t5_2qh1i_t3_4e8oip_t1_d1y89lu", "creation": 1460361517, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "LillianVJ", "text": "About two weeks ago I tried to end myself with rubbing alcohol, and needless to say it wasn't at all fun. \n\nPretty much seconds after I started chugging it out of the bottle my throat swelled up and I couldnt breathe at all for a good few seconds, and at that moment I realized I seriously fucked up. \n\nAll of this happened outside my house really late at night, and the alcohol part of it kicked in nigh instantly because it was only ten minutes later that I was wandering my small town without enough clothes on for the weather hoping I would freeze to death or pass out and not wake up, but it never ended up happening, and because of my regret I managed to get on the phone with a friend, and I ended up throwing the bottle of rubbing alcohol as far from myself as possible and going back home. \n\nI ended up not even waking my parents while sneaking back into the house, and even got a nights rest, but I was still suffering in the morning, and I'd ended up getting a friend to cally parents because I couldn't face them myself in the state I was in, they got me to a hospital and I was watched over and then released the same day, because I'd only managed to get down maybe 100ml of the 500ml bottle, and ended up metabolizing it. \n\nThe following days were mostly spent nursing a hangover filled with regret and some self beating on for what I'd done, but I came out of it realizing it was an impulse act fuelled by my mild depression and suicidal thoughts, as I'd found the rubbing alcohol not even three hours before I attempted suicide with it. \n\nCurrently I'm still sort of nursing myself back to mental health and I'm signed up for an intensive outpatient program, which is essentially a daily group therapy on week days, and so far I've already rebounded back to what I would call decently stable (still probably mildly depressed though) ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y89lu/"}