{"id": "t5_2qh1i_t3_4e8oip_t1_d1yv86m", "creation": 1460404486, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "awildpoliticalnerd", "text": "The sun is one of, what, 200 billion in our galaxy? Its size is average, maybe even slightly on the small end of the bell curve-- it's got nothing going for it compared to some of the other things we see in the sky. In the incomprehensibly vast expanse of time that remains before the last proton decays, even the billions of years that this mediocre ball of plasma will stick around seems infinitesimal. \n\nBut do you know what? It's why trillions of life-forms exist, past, present, and future. It's the reason we're *here.*\n\nNumbers can't lie but they do deceive. They omit that worth isn't found in rarity. Worth is found in how things relate to each other. Your worth isn't in how you stack up against 7 billion humans. It's how you interact with a few of them, with the planet, and with its other inhabitants. It's about the multiple roles you play (many of them subtle and thankless) in the whole goddamn system. \n\nYou may never know them all. Maybe you'll get a cerebral sense for it. Maybe. But you'll probably never realize it in your gut in that same visceral way that the specter of infinity haunts you now. But that's not where truth lies. Your gut is what tells you that Smith is a more common last name in this world than Devi. It's where the raw emotional leftovers pool together after all the mental shortcuts that get us through the day take place. It's not bad for general stuff but it lacks *precision.* Shit, if we need graph theory just to figure out who the fuck the main character is in A Song of Ice and Fire/Game of Thrones, how the hell can we expect for our guts or our brains to accurately grasp the multifarious connections that stem to and from **us?**\n\nYou're worth something. Your internal struggle with the enormity of existence has impacted hundreds of strangers on the Internet. Allow yourself to extrapolate how important that makes your day to day life. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yv86m/"}