{"id": "t5_2qh1i_t3_4e8oip_t1_d1y6owx", "creation": 1460356131, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "\"The one fucking time they use the furthermost tracks to go that direction...\"\n\nAnyway, I had finally had enough. I decided to get completely platered and sit in front of the tracks and wait for a train. I don't remember the walk there so much. Just kinda remember being there. \n\nThe tracks were only a half mile away from my house, and about 200 or so feet down the road on the tracks became entirely shrouded due to trees and whatnot. So nobody driving by would be able to see even as much as my silhouette. Perfect way to die. Just wait for it to come while I'm entirely numb.\n\nNow, here's the thing, there are three sets of tracks. The first go right, the second go left, and the third just has stray carts. \n\nI waited between the first and second ones, and saw a train coming from about 3 miles away (it may be surrounded by trees, but it's a straight shot and I can see the light). It was going right, so I sat upright, facing away from it on the first set of tracks. I felt no nervousness, no fear, nothing. Just total apathy.\n\nThen the train passed me. And I almost immediately sobered up, or at least enough to remember everything entirely clearly.\n\nI then thought to myself  \"Well, I tried, back home I go.\" I don't even remotely understand my reasoning at that moment. I could have easily just waited for another train. I was full prepared to die. I had organized all of my belongings and wrote out my suicide note.\n\nI still had no desire to live, but I guess I just lost my motivation to die.\n\nI remember every step on my way home. That was also probably the best nights sleep I have ever had.\n\nI then woke up crying out of guilt and shame.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y6owx/"}