{"id": "t5_2qh1i_t3_4e8oip_t1_d1ynfh2", "creation": 1460394441, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "luumu", "text": "\"Ew. Ow. Oh fuck, I did that. Fuck, this is embarrassing. Oh shit, the nurses called my mom. Oh fuck, this is embarrassing.\"\n\nI came to in the internal medicine ward, hungover and with teeth stained black with medical charcoal, two IV bags dripping into my arm.\n\nI'd gotten shitfaced and od'd on acetaminophen (I'd had to visit three separate pharmacies to buy enough for my intentions). In what in my recollection is a fuzz of intoxication and darkness of the night, I'd called the ambulance on myself. I'd spent the night vomiting black and scream-crying in the ICU. I remember being wheeled out of the ICU and asking a nurse \"Am I going to die?\" and her answering \"No\".\n\nBefore leaving my home, I'd packed a spare pair of pants - not a book or phone charger or anything useful, really. After the nurses trusted that I wasn't going to bolt, they allowed me to drag the heavy IV pole down the hall, into the elevator, through the emergency room lobby and out to the parking lot to smoke cigarettes.\n\nThe next day, I was interviewed by a pair of medical health crisis workers. I told them I was embarrassed (because I'd tried to kill myself and also because I'd executed it so half-assedly), and fine, and scared of going home.\n\nThey put me in the closed ward. No door out, no asking to leave. A self-described manic gave me a (thorough yet short) tour. I needed to pee, and learned that I needed to ask a guard to open the door to the bathroom, and wasn't allowed to lock it behind me. I smoked a cigarette in a smoking booth with a lighter chained to the wall. After only an hour, the doctor came to get me out of the ward.\n\nAnd just like that, they showed me the door. There I was, in the January cold, feeling absurd. I walked home.\n\nReturning to my apartment and my room was the strangest thing I've experienced in my life. I felt reborn, and like an archaeologist. The empty bottles of pills and liquor. The computer still on, the clothes, the guitar that I only played when no one heard - the scattered artifacts of a normal life. The things that held meaning only to me. What would my family have thought at the sight? It was bizarre to think that if the me that tried to kill me had been more ruthless, that would've been the remains of me.\n\nAnd at the end of that, I find it hilarious that the stress of cleaning up before people come over wouldn't end at death. Fuck having people over.\n\nI've never shared much of this with anyone, so if you read this, thanks.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ynfh2/"}