{"id": "t5_2qh1i_t3_4e8oip_t1_d1yf2gz", "creation": 1460382318, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "-UserNameTaken", "text": "Please take my text with the knowledge of what worked for me may not work for everyone.  There are so many degrees of depression and severity of symptoms, ultimately you will need to find what works for you.   I view medication in my case no different than a cast for a broken leg, instead of protecting my leg it was kind of protecting me.  If your leg is broken you need a cast, it is the only way to get your leg strong enough to a point where you will no longer need a cast.  The cast is not meant to be a permanent solution.  It is a device to get you better, but not one that is permanent.  That is how I view medication, AND I CANNOT STRESS THIS ENOUGH, this applies to only me.  There are people who need medication. People who are a danger to themselves or others that should remain on medicine.  There are people who are ok with a cast on their whole lives, and that is ok, becuase they know how much it sucks to have a broken leg and do not want to risk it.  Please keep in mind, I tried to get off of medication 2 times and relapsed, pretty badly.  The third time I decided to get off of it, and mind you this was working WITH my psychiatrist, and everyone thought it was a bad idea. Everyone. All they had to say was look at your track record, this has not worked out in the past, why would it now.  But I had in my mind that I was going to do it. That I would be able to not need medication, but I always had in the back of my mind the knowledge that no one but me would know if I need to go back on, so it is up to me to be honest with myself if I felt that I needed to go back on meds.  That was 12 years ago.   Listen, you have to just be honest with yourself, because no one knows what is going on in your head and your heart except for you.  If you can't shake the dark cloud following you, if you can't stop the reoccuring thoughts in your head, if you can't sleep....then you need to make it a priority to find a solution.  This life and this world is so precious, you have to make the most of it. You need to never stop trying to find what works for you, but you deserve to be happy, you deserve to be loved, and you deserve to find enjoyment out of life,  and do not ever convince yourself you do not.  That was the hardest part of dealing with depression I think, that it convinces you that you are not worth fighting for, and I think a lot of people believe that voice after dealing with it for so long.  You are worth fighting it, I promise you.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yf2gz/"}