{"id": "t5_2qh1i_t3_4e8oip_t1_d1y80th", "creation": 1460360607, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 11, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "doobiesaurus", "text": "I really wish my friend was here to answer this question. Thank you to all of you that answered, i just miss him so goddamn much. He had PTSD like so many that we've lost. He was an amazing person that lit up the room whenever he walked in and i never heard a negative word spoken about him ever. To those of you that failed, please try to remember that there are many people that care about you and will listen to you, even if its just us internet strangers. I cant stress this enough. Please please please talk to someone. I got a message from my friend the night he went through with it, but i thought it was just one of his bad moods he was in. I regret not driving to his house every single day of my life. I dont know what wouldve happened but i miss him so much. I know he was going through hell but please please please talk to someone and try to get help. I would do almost anything to talk to him again other than just in my dreams. Im sorry this wasnt an answer to the question but there are so many people out there that miss this man so much. Just please, help yourself. We've lost to many to their own hands already. \n\nEdit: i know these upvotes are just clicks, but they mean that you read what i typed, and you support me and what i said. Internet stranger is a weird thing that tugs on the heartstrings in a weird way. Again, i miss my friend so much and i hope those that need it get help. Theres at least someone out there that wants you stay around. You may have not even met them yet but they are there. If anybody needs to talk or vent or whatever we can message or even skype. I know how hard it is losing someone you love so much. If youre going through a loss or just need some encouragement i would be more than happy to be here to talk to you.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y80th/"}