{"id": "t5_2qh1i_t3_4e8oip_t1_d1yash5", "creation": 1460371548, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "030315", "text": "i don't even remember, I just felt awful for the next 3 days.\n\ni had several \"attempts\" before that but I honestly just think it was a cry for attention. i intentionally didn't take a lethal dose.\n\nbut this time was different. each time I have an episode I get less and less scared, more and more impulsive. \n\nit was a few days after Christmas. my sleep schedule was really fucked up, i did absolutely nothing all day, and I had been mentally screwing with a guy twice my age because I was so unhappy with myself. my mom (I am a teenager btw) came in at like 8 AM and I was still awake. she started yelling at me for doing nothing and sleeping all day. I was really apathetic and just kept saying \"ok.\" I was too tired to care. She slammed my door and I fell asleep.\n\nI woke up at like 5pm. I don't really know what was going through my head. Probably barely anything. I went downstairs and locked myself in the bathroom and got the Arsenal of pills out because I found where my mom hid them. She was in the room right next to me. \n\nI just kind of lined them up. It was almost like I was playing with them at that point. Then I started slowly taking them. I had been in there for a while. My mom heard the sound of pills being \"shaken\" so she came to the door and told me she knew what I was doing. She wasn't all that panicked. She got a screwdriver and started unscrewing the door handle,obviously taking her time. So I just said fuck the rest of the pills I lined up, emptied a bottle of sleeping pills into my hand and took them all at once.\n\ni am really tiny. 108 lbs and not even 5 feet. So it really fucked me up. My mom finally got the door open, said \"really?\" and I just walked past her. It hit me almost immediately. As I was walking up the stairs I started feeling really heavy...really out of it. I just sort of fell onto my bed and was staring at the ceiling.\n\nmy mom came in my room and started saying the stuff she usually does. I don't even remember what she said, everything about my life and me was blurry as I was laying there. I felt my heart slowing, it was getting really hard to breathe. I was struggling to keep myself awake...and then I thought \"oh fuck, am I dying?\"\n\nThen I felt completely disassociated. The REAL me couldn't speak. It was kind of like...my subconscious was speaking? I just remember crying for my mom. Just saying \"mom, mom\" as she stood in the doorway and said nothing. I couldn't even turn my head to look at her. I passed out.\n\nI woke up a little bit later and started choking on my own vomit. I ran to the bathroom and continued throwing up. I was really disoriented, and still found myself calling for my mom. My little brother saw (3) and got my mom to come upstairs. She just stood there and watched me gag/vomit. Then, in the most apathetic tone, said\n\n\"You better just go to the kitchen and drink some milk\" before walking away.\n\nI don't really think I thought anything when I woke up. I didn't feel anything either. I was just kind of like, \"ok.\"", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yash5/"}