{"id": "t5_2qh1i_t3_4e8oip_t1_d1y86pl", "creation": 1460361207, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 224, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "faramond", "text": "I've had a string of (in hindsight) half-assed attempts prior to this one, and I was starting to feel a bit frustrated.  The first attempt I had was with rat poison, but I couldn't ingest enough poison-laced food (I ended up throwing up).  The next attempt was rat poison mixed with insecticide, which for my teen mind back then, seemed perfectly logical.  It didn't go down well, and I wasn't able to ingest enough to even make me feel ill.  I didn't want to drink insecticide, and thought of a way to have it in my body without it being through my throat.\n\nBrilliant idea: why don't I just inject myself with the stuff?\n\nYes, I thought this was a bright idea at that time.  I bought some syringes (meant for insulin shots, but I didn't know it back then.  These were around 10mL syringes IIRC), filled them up, and readied myself.  I tried looking for the large veins around my elbow and knee areas, thinking that if it manages to get into those large blood vessels, I'd be pretty much dead before long.\n\nI injected myself with the stuff just after everyone in the house went to sleep.  It was a painful affair, but I managed to inject two syringes worth of insect killer--one in my elbow, the other one in my knee.\n\nI woke up the next day not feeling much different.  Felt like a slight fever was coming, but other than that, I'm still alive.  I figured it's a failure I can easily sweep under the rug, like the previous ones.\n\nLater that day, the feverish feeling got worse.  Also, I felt my left arm and my right leg not working right.  It felt painful to bend and it seemed to be slightly inflamed.  It wasn't obvious at this point though, and at first glance, it seemed nothing more than a bad fever.\n\nThe second day brought nothing other than a worsening of the fever.  My skin then felt like it was both hot and cold at the same time.  It hurt to touch anything.  The inflammation got bigger, and the injection site starting to become obvious.  I passed it off as an insect bite (heh, yeah), perhaps one of the nasty cockroaches in the house got to me while I was sleeping and bit me.  My family believed my story for the time being.\n\nOn the night of the second day, the inflammation got so big my mom started questioning me about the insect bite story.  I tried to ignore her questions, but after hours of questioning, I relented.  I wanted so bad to be just left alone to die, but my mom was having none of it.\n\nAfter a tense night, I finally decided to go to the hospital.  I failed big time, and I can't do anything at the moment but to get better.  I figured that if I were to make another attempt, I must get rid of the ill effects of this one first, and to do that, I must be totally honest with the medical professionals.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y86pl/"}