{"id": "t5_2qh1i_t3_4e8oip_t1_d20tkyb", "creation": 1460524514, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MauriceDavisBand", "text": "I took 97, 50 mg sleeping pills.  I was ready to go and be done with all the sadness that my heart just couldn't handle anymore.  I spent 3 days on a ventilator as my lungs and kidneys stopped working.  And for 3 days the Dr.'s asked my family if they wanted to pull the plug because they didn't believe I would wake up.  Each time my family said, \"No, he's going to wake up!\".  And then I did.  Outwardly I was so sorry for what I put everyone thru.  They were all so sad and shocked and didn't know what to think and so glad that I was still here.  But truthfully, my first thought was, \"Why am I still here?\".  By all rights I should be dead.  I don't want to be here.  Why? I went to counseling and did a lot of soul searching and about 6 months ago it was revealed to me why I was still here.  I'm a singer/songwriter and I knew that I had the opportunity to speak for those who didn't have such a platform.  So I decided to write a song about suicide.  Then I decided to make a music video for suicide prevention.  I can relate to every person who has ever thought about suicide or even tried it.  I've been there and I made it.  And most importantly, I overcame it.  I'm still here and I get to help other people, just like me, every single day.  It gets better, I promise you that.  To anyone on the fence, sit and talk with me awhile.  I won't blow smoke up your butt, the answers are NEVER easy.  It's NOT the cowards way out.  But there's a better way.  We are each gifted and so special in our own ways, we just need to recognize that our value is not based on upon other peoples perceptions of our worth.  \n\nhttps://www.youtube.com/watch?v=jq56VDonz5I\n\nHere's the link to the video.  If you or someone you know is suicidal, watch this or share it and follow the links to get help.  If you just want to help, ALL the money from the sales of this song are donated back into various suicide prevention organizations.  I don't make a dime from this, I just want to help people and let you know that I want you to stick around.  Please, stay.  If no one has told you today, you matter. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d20tkyb/"}