{"id": "t5_2qh1i_t3_4e8oip_t1_d1yedhq", "creation": 1460381010, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "thudly", "text": "I got to a point in my life where I'd basically lost everything that was important to me, and I was in a lot of pain almost every day. And I was a at a point where no matter what I did, even if I succeeded one day, it wouldn't last because problems from my past would come back to haunt me inevitably. I basically didn't see a point in going on. \n\nBecause of the chronic pain I was in, I had a prescription for Tylenol 3s, a whole bottle of them. My roommate was out of town for the week, but he told me he'd wanted me gone by the time he got back. It just wasn't' working out. So I told him, \"Yeah. I won't be here anymore when you get back\". \n\nSo there I was, with my bottle of painkillers, no place to live, no future, no hope, and in really bad pain to boot. I just laid in bed all morning the first day I was alone. The pills were on the shelf. I was thinking about how my loved ones would be sad if I was gone, maybe even devastated, but they'd get over it. Life goes on. And at least I wouldn't be in pain anymore. And at least I wouldn't have to deal with how pointless life was. \n\nI never ended up doing it though. Instead, I reached out to my dad and told him what I was going through. He drove over and picked me up. He didn't even talk to me about it. No lectures or anything. He just started working on helping me find a new place to live. Sometimes having only one less thing to worry about is enough relief to help you go on another day. Just fix one little problem. It makes you feel a little better.\n\nThough I didn't actually, physically make the attempt, I still consider myself a survivor. I was pretty damn close. I even had the plan, the means, and the opportunity. But I reached out instead. I don't even know why I did. There was really no reason not to do it. But when I went to bed that night, the last thought in my head was that, yeah, life is shitty and miserable. But the great people out there who genuinely care and treat you decently no matter what make it worth the trouble, and the little sparks of joy in the darkness are as beautiful as stars. \n\nI decided to become one of those kinds of people. Life might not ever get better. My situation is still only marginally improved. But at least I can make other people's days a little better, and maybe give them a little bit of that feeling of overwhelming gratitude I felt when my dad was there for me in my darkest hour. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yedhq/"}