{"id": "t5_2qh1i_t3_4e8oip_t1_d1ybf9b", "creation": 1460373700, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "poetadelmar", "text": "Throw away time. Too late to join the party, but I figured it would be a good way to let some steam out.\n\nThe \"may cause suicidal thoughts\" lable on anti-depressants is a serious matter. Back last November, I had to deal with some pretty bad crap, and amidst the worst of it, one night I decided to just take my medication. After twenty minutes I still hadn't remotely calmed down, so I took it again. And again, and again eight more times, for a total of thirty something pills. Frankly, I was not completely lucid during the whole thing, but I texted some crap out that I really regret having done so now, so I guess I was pretty conscious at some point about killing myself.  I managed to call an ambulance in a moment of clarity, I think, and next thing I know I'm in a hospital.\n\nI was furious and scared it didn't work. I suffer from some pretty heavy PTSD after two tours in the Marines and getting shot in the leg. I have a shitty family that I acknowledge have manipulated me to stay locked in with them to take care of them and essentially be their little servant. I'm studying something that I frankly have no passion for, and can barely take solace on the fact that my practice hours have gone for a good cause. I'm unemployed and recently single. I wanted it all to end, and not being able to go through with it was just another failure in my life. At the same time, I can't help but think how emotionally unstable I am, that I can just try to do something like this on a whim. \n\nIt's given me some new appreciation for life. The whole incident left a very bittersweet note, as it lead to some serious complications with my liver, but it made me realize that there's people that care about me. Cliche'd, but it's keeping me going.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ybf9b/"}