{"id": "t5_2qh1i_t3_4e8oip_t1_d1ydh8b", "creation": 1460379143, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CedarWolf", "text": "I was pissed at myself because I couldn't do it. Of all the simple things in life, disrupting the delicate processes that govern and maintain a human life should be laughably simple. There are dozens of ways to do it and good people die by fluke accidents every day. Why should I manage to survive by luck and chance and grace when I've wanted to die so very much?\n\nI was so upset, despairing and distraught, it was just this simple little thing and I couldn't even do that. All I had to do was slide the sharp metal a mere 2 or 3 inches between my ribs, easier than cutting a steak, and I couldn't do it. Hell, all I had to do was hold the knife and *fall*, and I couldn't do that, either. I was 14 when I figured that out.\n\nMaintaining life is so damn hard, taking it should be so easy... But I've never managed to succeed. I can't drown, I've been swimming in alligator-infested waters and they didn't come near me, I've been within 12 feet of wild bull moose and grizzlies and yet I'm untouched, I've been shot at and I've put myself in harm's way so much... Just by existing. I work dangerous jobs, I've lived in dangerous places, and my body itself should have killed me already. I can't even bring myself to shoot myself because it would leave a mess for whatever unlucky shmuck finds me.\n\nBut I'm a stubborn one. If I can't kill myself, I tell myself I'll just have to make the world a better place, a place I can live in safety and be free to be myself. It's the work of a lifetime, and it hurts... But I try to help other people as best I can, and I try to be useful, and that makes me feel a little better.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ydh8b/"}