{"id": "t5_2qh1i_t3_4e8oip_t1_d1y7k7t", "creation": 1460358968, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Hi. I just wanted to say a couple things, after reading this.\n\nI have never been suicidal. There are times in my life where I wanted to die, but never enough to break me. I suffered a whole other demon. \n\nMy anger drove me to hate everyone and everything. And this is often something vastly over looked, especially in mental health. Hate. The feeling of true, and absolute hate. Not for myself. For everyone, and everything around me. I hurt people. Its one thing to hurt yourself. But I did it to others over, and over... And over...\n\nI don't remember how I faced that demon. I woke up one day, very very tired. In was tired of always being so horrifically angry. For no reason. I was tired of hate. Hate is a powerful toxin. Hate is as powerful as love. I was just so tired. I decided, \"I can't keep this up. Its to much... I'm done... I'm done hating.\"\n\nIt took a long time for me to be okay. It took along time for me to learn... Everything. How to develop and maintain healthy relationships. How to see the good in the people and world around me. How to empathize. How to trust. How to love. How to cherish. How to feel. How to cope with my emotions, be they negative or positive. Happiness was still alien to me, and scared me.\n\nNow my demon is finally dead. Laid to rest. My anger has subsided, though I need to control it every day. But its easy now. I look for the beauty in the world. The mountains. Cars. My friends. Things I find beautiful. These things help me contain my anger and I feel I'm finally free.\n\nI now work in a boys group home for kids ages 12-17 in state custody. Some are felons. Some are addicts. Some are mentally ill. Some were in horrific situations and the state had to step in. I love my boys. I love working with them. I teach them what I had to teach myself; how to cope and have healthy relationships. \n\nI read this, and your final words stepped out to me, and I wanted to say this, as its something I say often but it has a huge impact on me every time I say it. I once only hated. But that has changed.\n\nI love you too.\n\nEdit: reading these comments and seeing the love and kindness in everyone. I'm crying. So this edit is to tell ALL of you: I love you.\n\nAnd please, I don't want to seem dramatic in anyway. But I want to express how important it is for me to see love and feel love. The love on this thread... For complete faceless strangers. The love you're showing and the love I feel towards you. This is what heals me. This is what drives me. Thank you all so much for showing something I went so long without. Thank you.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y7k7t/"}