{"id": "t5_2qh1i_t3_4e8oip_t1_d1yd7e3", "creation": 1460378534, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bilateralbipolar", "text": "I've had two suicide attempts. And I would not lie to you and say that my suicidal ideation has gone away for good. I am at the point now where I am thankful that I didn't succeed those times. You should know that I am bipolar as well. Which means I will always cycle through deep depression. My first thought the morning after the first attempt was, \"why am I awake?\" I was bitterly disappointed in myself for not being strong enough to make sure I was actually dying. I would tell myself that my existence was a terrible mistake that I needed to fix. That so much of my life had been awful and painfully lonely that it couldn't change. To make matters worse, I didn't disclose my suicide attempt to my psychiatrist, I was afraid of being committed and having to go on heavier atypical antipsychotics. Don't ignore your support system like I did. I was 19 at the time in the midst of an incredibly messed up, abusive relationship, and I almost missed out on every breathtaking moment of joy I've had since. My next suicide attempt is kind of hazy, I know it was mid June 2012, and I know that I did a significant amount of drugs to try to off myself and I remember telling my bf that I was dying and then I remember throwing up quite a bit and hoping it'd been long enough that I'd absorbed the pills anyways. It took me quite a while to feel better from that one. I think I even failed out of my classes, that semester. In the years since, I've ceased to continually demonize myself, my past actions and I try to focus on the future . I made a bucket list and self flagellated all over the place about the experiences I've yet to experience. I've checked off quite a few in the 6 years since my first attempt. Not nearly all, I hope I keep adding to the list throughout my life. Things that my psychiatrist said that changed me: Suicidal thoughts are not normal. It's not normal to want to kill yourself every day, normal people don't do that. You are sick, and you can't get better through force of will alone. Suicide is a permanent solution to a temporary problem. If your life is so awful that you're looking to run away from your problems. Actually run away, go far away to a new place, find a better solution to nonexistence. Because there's no coming back from that one. So I ran away to the circus essentially and found a better place. Art therapy saved me more than the medications did, I'm down to just the art now. And my reason for existence now? To leave the world slightly better than how I found it.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yd7e3/"}