{"id": "t5_2qh1i_t3_4e8oip_t1_d1zlyy1", "creation": 1460454406, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Nicaol", "text": "Hi there,\n\n \n\nThanks for the reply, I love getting feed back on this stuff and it is a real motivator to hear someone confirm your own perception as its very much a case of feeling your way around the issue.\n\n \n\nIt always amazes me how someone who is witnessing someone suffering from mental illness cannot see that they are sick.\n\nIt may originate in the brain however the brain converts this mental illness into a physical pain. How can anyone sit and see someone they care for looking like they are about to implode under the pressure and then deny the physicality of it is beyond me. \nThe brain is an organ and a far more complex organ than any other, you can get illnesses of nearly all of your organs and the brain is no different in that it also has physical manifestations.\n\n \n\nAlso, your point about suicide and only seeing the suffering. I learned, through reading and doing research that being suicidal does not make you love the people around you any less, in fact, this is, I assume, where the overwhelming guilt comes from. Now I put myself in my friends shoes. “how much pain and anguish would I have to be enduring regularly for the suffering to outweigh that love for my family and make suicide a viable option”… the answer…. Unimaginable and I just hope that it is not something I have to personally face up to.\n\n \n\nAs someone who wakes up every morning generally content it was a difficult concept to grasp. A great quote I read on here was that ;-\n\n \n\n“suicide is not about ending life, it is about ending pain”\n\n \n\nNow that is a straight forward analogy I can understand, my god, seeing my friends suffering, I understand completely. It is a really useful tool which will stop you offering the dreaded “but what about your family” or “you have so much to live for”. The pain and anguish is clearly that bad.\n\nI don’t consider myself an expert on anything and I can only offer up ways I found useful for supporting my friend. It really doesn’t take too much to just accept that as much as someone with mental illness see things from their own perspective so to do you as someone who does not suffer. Once you accept that your world view does not apply to theirs then you are automatically in a better position to empathise. \n\nAlso a huge point is, a little reading can go a long way. If someone you love is suffering, take the time to be objective, imagine an hour in their shoes and do some research. Even 5 minutes of reading about mental illness will help you support someone far more adequately.\n\n \n\nMental illness is still very much the elephant in the room of society, us humans are suckers for tangibles and therefore would rather diminish this suffering through lack of understanding.\n\n \n\nIm so glad you read my article and I thank you for the reply, I never know wether or not im getting it right but I will always try my best and accept that I always have something to learn on the issue.\n\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1zlyy1/"}