{"id": "t5_2qh1i_t3_4e8oip_t1_d1y5cgj", "creation": 1460352392, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ivota", "text": "Hey, just thought I'd share a bit of my personal battle before I go to bed. I struggled with anxiety and depression for years before seeking help. I resisted help for so long because I knew I would have to stop perusing my dreams (due to medical disqualification because of my mental health). Fear and worry and emptiness became my familiar emotions. I cried a fuck ton when I was alone (I always put on that happy face/front so those around me couldn't tell what was up). On the worst days I didn't cry at all...I stayed locked in my room in my fraternity and stared at the ceiling. If I needed to go to the bathroom, I pissed in a bottle...at one time I remember having 3-4 bottles of piss just laying around in my little room. The only time I left my room was to get my food delivery and maybe get to one class. I was always kind of quiet and definitely not a stereotypical frat guy so no one really noticed. When I wasn't sleeping, I mainly thought about how much I wanted to die. \n  \n  \n\nNow where am I going with this? Like you, I had my fleeting moments of happiness. Those moments felt so fucking strange...so much so that I believed my self to be manic depressive. It turns out that while I had a lot of mood swings, I didn't have some of the other symptoms for bipolar. It just felt strange feeling happy. I was in college for commercial aviation and some of the few times I felt happy was when I was flying which is why I was so reluctant to seek help. How could my life go on when I couldn't do the one thing I've wanted to do since I was a kid? But my flashing moments of happiness came in other forms. Movie releases, fall weather, small compliments, cleaning my room. And I realized I wanted those fleeting moments of drive and passion, energy and hope to last longer, so I got help.\n  \n  \n\nIt seems like such an easy and patronizing thing to say to someone: \"get help, take meds, reach out\". I realize that. But I think you also need to want to get help, and experiencing those small moments of normality is what pushed me to talk to someone on a regular basis and start the process of finding a medication that works for me. Fast forward 4 years since I've left my university following my diagnosis and I am about to graduate from a good university, I have started to value my family relationships, I have a dog whom I love and he loves me and we make each other happy. While I'm not perfect, I'd say on the whole I am doing better. Just assessing where I am at right now, I'd say I am usually a pretty happy person and those little flashes of happiness have become normal and now I just have small flashes of stress and worry, but I can manage them. \n  \n  \n\nI'm sorry this has dragged on so much. I know your battle is uniquely your own and not everything I've told about my story will relate to your struggle. I just want you to know that there is hope to getting your feelings, emotions, and happiness sorted. \n  \n  \n\nAnd I want to leave you with a little quote from one of my favorite films: \n  \n\n  \n> \"It's like in the great stories Mr. Frodo, the ones that really mattered. Full of darkness and danger they were, and sometimes you didn't want to know the end because **how could the end be happy**? How could the world go back to the way it was when so much bad had happened? **But in the end it's only a passing thing this shadow, even darkness must pass. A new day will come, and when the sun shines it'll shine out the clearer**\"\n  \n  \n\nIf you feel like you need to reach out some more, please feel free to do so, either to me, or to anyone. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y5cgj/"}