{"id": "t5_2qh1i_t3_4e8oip_t1_d1y87yj", "creation": 1460361336, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "denialtwister31", "text": "'Well, shit, now everyone thinks I'm racist.'\n\nNo throwaway because I think I've told a few people.\n\nYears ago I was in a terrible place emotionally. I wasn't suicidal per se but I wasn't in love with the idea of being alive. I would never want to actually off myself but if i was ever in a life-or-death situation, i sure as hell wouldn't fight to stay alive. I realize now how cowardly that was.\n\nOne night I was walking home late at night across town and I was mugged by two dudes with guns. Perfect opportunity. I remember just egging them on to shoot me, trying to piss them off by not complying by handing over my wallet and whatever and just repeatedly screaming the n-word (they were black). I didn't care, hopefully I would be dead soon and I could be permanently away from my waking self, my brain that produced all of this self-hatred and misery.\n\nThey beat the hell out of me, pistol whipped my head several times and gave me some rad scars on my hands but didn't shoot me. Turns out those pussies only had fake airsoft guns. But when I woke up in the hospital with a concussion and a crazy head wound with my dad crying at bedside, all I could think was now I'll be known as the deathwish racist.\n\nThe incident really knocked sense into me. Your life doesn't suck, you miserable sadsack, there are many many people that love you unconditionally. I've been doing infinitely better emotionally ever since.\n\nPlease, it's been said in this thread hundreds of times but it bears repeating thousands more: if you are having thoughts of self-harm or suicide or depression or what have you, please seek help. If you're uncomfortable seeing a therapist, talk to a friend, a teacher, a trusted member of the clergy, just talk to someone who will listen. Hell, you can talk to any of us in this thread. We've been there and we will not judge you. We love you and many people in your lives love you and that is a fact.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y87yj/"}