{"id": "t5_2qh1i_t3_4e8oip_t1_d1yvd19", "creation": 1460404656, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Bad-Science", "text": "Thank you for those words. I'm actually feeling a bit emotional right now, something I wasn't expecting when I got into this. \n\n> And if I may ask, what is it that is keeping you here? Is it family or something? Because I feel like if its been going on this long and you've wanted it to end this long, there has to be something keeping you from it. \n\n\nLess and less. I would never have done anything while my dad was still around... but he's gone now. My mom is gone far enough that even if I died, I don't think she would be told because it would upset her too much to no purpose. I've been holding out hope for the last 3.5 years that my head injury would resolve itself, but after this much time I'm starting to come to terms with the likelihood that I'm probably about as 'healed' as I'm ever going to be. \n\nRight now? Probably my wife. I made a commitment to her when we got married, and I stand by that. So I'll probably never do anything while she is still around. But the troubles she is having are multiplying fast (she's pretty much at the point now where she wouldn't be able to live alone, and can't hold a job).  \n\nHonestly, I'm fumbling over words here because I don't know how to say it... but in short, once my obligation to her is over one way of the other, I don't see much here for me anymore.  Maybe the last main thing keeping me here is curiosity. So much has already happened in my life, what is next? The next big invention or discovery.\n\nOh, one more thing because I find that telling somebody that I don't know actually feels like it helps a bit... I'm kind of stuck in a quandary that isn't helping me deal with this at all. My/our friends all know about my sister's and dad's passing, of course. And my ongoing head injury and how it is effecting me. \n\nBut my wife has made me promise that I won't let anybody know about her issues. She wants to have a 'normal' life for as long as possible (which may not be too much longer, honestly). So I'm holding all of that inside, trying to cope with it and work my way through it... with no help or support from outside. Even worse, trying to hide things and cover for her so things can remain 'normal' for as long as possible. I can see how much she is trying to not give in to her illness, but soon it won't be something we can hide anymore. Until then... well, its hard. And AFTER she opens up about it it may well even be more difficult, since then nobody will ever treat her the same again. \n\nI know that I should start seeing somebody professionally who I can talk to about all of this, but that's not the kind of person I am. I could see it in my father too, he was the 'suffer in silence, I can deal with my own problems' type. \n\nFinally, I've found myself thinking of a date in the future. At the 4 year mark of the anniversary of my injury, I think I'm going to have to re-evaluate things. Maybe that is when I'll make a decision about plowing forward, or calling it quits.  That day comes up in mid-November. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yvd19/"}