{"id": "t5_2qh1i_t3_4e8oip_t1_d1yir39", "creation": 1460388108, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Nicaol", "text": "My best friend suffers from suspected bipolar disorder(official diagnosis is imminent, at 28) and this was the main point I learned. To just accept that you cannot comprehend the anguish they endure constantly. \n\nAs stated here, for the most part I am just there to be there. I only intervene on actions really, his dismissive attitude towards getting help was a line for me, so I talk him round and forced the issue. It's very easy to be dismissive of the mind set that they cannot be helped.\n\nHe still has extremely long and deep periods of depression which, for me, the hardest part is having to watch someone you love endure this absolute grief. I am always cognizant of the fact that if I find it excrutiating to bear witness to then it can only be a drop in the ocean in comparison to his daily struggle.\n\nA couple of things that I find are useful as tools for someone who is supporting a friend with mental illness are :-\n\nFirstly, the obvious, always remind them of why you like them and of their virtues,my friend is one of the most beautiful human beings, he is intelligent and funny. It can be repetitive but it is important they are reminded of what is great about them.\n\nSecondly, I always remind him that his condition warps his self perception and that it is important to remember his condition does that. (A big addition to this point is to accept, as the person supporting, that all though it is the condition causing this that this point alone does not detract from the reality. It doesn't feel any less real to them). It at not help them feel better but it may be of comfort to them that you understand this.\n\nI also make a point of highlighting his achievements as they get lost in the din of depression.\n\n\nI will be honest, I struggle under the pressure at times, I have my own very young family and I feel like it's my responsibility as he is like a brother to me. I'm his confidante and I feel I would never forgive myself for not being there for him. After all, it's all I have to do for him.\n\nHe can, obviously, be dismissive of professional help but I make sure he remains open and at least tries to take help on offer.\n\nThis is not a broad stroke at anyone experiencing mental illness and it is important to remember that EVERYONE is different and have different needs.\n\nTo me the below article was like an awakening for supporting someone and taught me a valuable lesson on being there for someone.\n\n\nhttp://www.opentohope.com/platitudes-uncomfortable-for-everyone/", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yir39/"}