{"id": "t5_2qh1i_t3_4e8oip_t1_d34ult2", "creation": 1463193025, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MotherOfMercyAndJoy", "text": "I joined Reddit just to answer this; I read threads every once in awhile, but know little about the ins and outs so patience for the newbie...\n\nMy first moment awake was total shock. Then deep, raging anger.  After consuming close to 500 sleeping pills, I awoke in the ICU extremely confused and disoriented.  I remember making my hands into fists and trying to touch them together but my arms wouldn't work!  I was with it enough to realize \"omg! My arms won't work!\" but out of it enough to not realize that my arms were restrained.  I was in and out of consciousness off and on those 3 days in the ICU, but always felt this rage, like I wanted to get the hell out of there.  I tried to rip out my own catheter and felt nothing <---- this makes me nauseous to even really ponder today.  \n\nI'll never forget the moment I told a nurse \" I want to get out of here! When can I go smoke a cigarette?!\". Her answer made my blood run cold.  \"You aren't going anywhere; you tried to kill yourself.  You'll be admitted upstairs to the psych ward...voluntarily or not.\"  Que rage, helplessness... Pure torment :'(  One of the scariest, most out of control moments of my life.  I was so upset.  I never meant to be around for any consequences.  It wasn't a cry for help.  I was done, my soul literally could not bare anymore pain.  I'm normally a sentimental schmuck...but I didn't leave a note, never said a goodbye, I simply drove around town buying pills, my tear stained face turned to a brave mask, and checked myself into a hotel to end my life.\n\nMy mom and my aunt came in to talk to me after that nurse left.  I literally have no memory of what they said.  I was still very out of it from all the drugs and maybe from the seizure I had?  But what I DO remember is after that talk, something in my brain clicked.  Something in my soul vibrated again.  And as I rode the elevator to psych ward, I surrender all.  It was my rock bottom...and it freed me to move forward.\n\nMy heart is with all of you who have suffered and found a way to claw yourself out of rock bottom.  You're all heroes.  I am too.  And I finally believe that <3\n\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d34ult2/"}