{"id": "t5_2qh1i_t3_4e8oip_t1_d1y84g8", "creation": 1460360983, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NaomiNekomimi", "text": "It was probably berating myself for being selfish, irresponsible and horrible.\n\nI don't consider this an actual suicide attempt because I backed down and didn't jerk the wheel but I think it is a little different than most stories maybe so I might as well share. Just to be clear I do not mean to compare this situation to some of the ones in this thread as it is no where near severe. I apologize if anyone feels like it wasn't a proper attempt so it shouldn't be posted.\n\nI was driving home from class one day during the majority portion of my life in which I was clinically depressed due to a number of factors (though primarily trauma and unfortunate life circumstances). It was night and the road was empty and I was feeling a little bit of a spiral come on. I started to cry and eventually just shut my eyes and pressed my foot down completely on the pedal. My little car started picking up speed and struggling but I heard it rev harder than I had ever before. My hands were shaking and I was desperately trying to build up the strength to jerk the wheel.\n\nI came to my senses after what felt like an eternity but I imagine was not more than a minute because I hadn't drifted off the road yet, only into the opposite lane from where I started (it was a wide highway). I don't remember how fast I was going at the peak of it because I slammed my brake and started slowing down in a panic before I looked at the speedometer. But I had time to put my brake on and open my eyes to look and in that time it still hadn't dropped below the high 80s in a car with quite good brakes. \n\nMy first thought was how terrible of a person I am and how I really SHOULD just do it if that's how reckless and inconsiderate of others I am, to endanger them like that. My second thought was that I need to tell someone. Unfortunately, I was in the middle of nowhere and was too nervous as an 18 year old girl to pull over in the middle of the night and stop for a long time. So I kept driving even though I was shaking so hard I couldn't keep the car straight and had to focus really hard to not swerve side to side.\n\nI didn't drive for a long time after that, and I still get nervous sometimes when I come home from class at night.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y84g8/"}