{"id": "t5_2qh1i_t3_4e8oip_t1_d1y974s", "creation": 1460365244, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ambersroses81", "text": "The first thing I remember is being in the  ambulance with them forcing me to drink something disgusting.\n\nNext thing I remember is laying in a room on a table or something begging the nurses to just let me die. I kept saying \"please let me die, why won't you let me die. Everyone would be so much happier if you just let me die.\" \n\nThen I was in a room in the cardiac Ward with an aide who wasn't allowed to leave my side.\n\nIt was a horrible experience, they were overly full in the psych ward. I saw a psych doctor once and they released me within 48 hours. I spent the next four years in deep depression until I got tired of them experimenting with meds and feeling like I wanted to die. I finally broke down and told my mom that I've wanted to die for years and that this weekend either I'm killing myself or something is happening to fix it.\n\nShe took me into my urgent care and I talked to this sweet older grandfatherly doctor. He very kindly explained that I needed more help than he could give me. That I needed to go home and pack a bag for a week away. He was going to call the hospital and tell them that I would be there within an hour and a half. \n\nGoing home and telling my husband and children that I was going away for at least a week was the second hardest thing I've ever done.\n\nWhen we got to the hospital they were full, luckily I WANTED help so they were able to send me to the voluntary Ward at the UW. I will be forever grateful to them. Once I got there, I felt so much better. The option of suicide was off the table and they were going to help me.\n\nI still struggle with major depressive disorder every day but I haven't thought that I wanted to die for years now.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y974s/"}