{"id": "t5_2qh1i_t3_4e8oip_t1_d1y4q35", "creation": 1460350836, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 91, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CrimsonWind", "text": "I've never attempted before, definitely considered it but your description is close to bang on to what my depression was like. Just didn't see the point, life was shit and didn't appear to be getting better.\n\nSo I started looking for an escape which came in the form of alcohol, then weed. Which was better than booze as you don't feel like shit in morning, but the escape wasn't as good. I then tried this legal drug that basically knocked me out for two hours. This was great for me, I've always had trouble sleeping and the escape was real. I'd wake up for 20 mins-max just to get high and go back to sleep (I basically wanted to be in a coma).\n\nSo I'm not eating, not going to work, I've started stealing to support the habit, I get fired and kicked out. I have to move in with my parents again. Depression hits me big time here, everyone see's it, everyone is trying to help. But fuck them right? I'm happy doing my thing, why can't people just leave me to it. So now I've got no friends and my parents want me out. And then Boom, the drug gets taken off the shelf and I'm forced to quit (I needed to situation taken out of my hands).\n\nCut to three weeks later. No withdrawal symptoms (which was weird, people went to rehab for this), I went from getting fired from a supermarket to being a graphic design tutor, moved into a nice house with my one remaining friend and I've never looked back.\n\nI was depressed because I couldn't see any light in the world, I didn't feel like I had a place in today's society and I just wanted out. I was envious of those around me, and hated them for their happiness and companionship. I was depressed because I didn't know why it was happening, I had no real reason to be depressed, which made it worse because then I was thinking that I'm just some piece of shit, who isn't happy with what he's got.\n\nFor me beating depression was about figuring out why it was happening, despite there being no obvious reason. Then I needed to figure out what made me happy, what I like doing, this was hard as I found it hard to be passionate about anything at this point. And then it was simply accepting that depression was apart of my life. It's not the end of the world unless you let it be, it's just a phase that will pass, and yes it will be back, but it'll pass again. A lot of it for me was that I simply had to stop trying to be happy, and just be content in life, and trust that happiness will follow.\n\nedit; I am sorry for the book.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y4q35/"}