{"id": "t5_2qh1i_t3_4e8oip_t1_d1yck53", "creation": 1460376938, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Twatson8", "text": "\"You fucking idiot. Of course you botched even this....\" --in the car on the way to the hospital\n\nI was really pissed. I attempted a few months ago--November 28 to be precise. I go can go into details if people ask (I'm in a much better place now and have no problem talking about it), but I'm in a bit of a hurry.\n\nAnyways...my parents had me put in a psych ward for six days, which was a complete waste of time and an utterly miserable experience. I didn't eat the whole time I was there and barely slept thanks to this kid that would scream and beat the walls and himself whenever someone turned the TV off. One of my only friends in there was this 11 year old that I played chess with during our free time, and he tried to drown himself in his sink while I was there. So I just focused all of my energy on lying my way out of there. \n\nThen I had partial hospitalization, which is basically group therapy that you're required to go to that's at the hospital. That was actually fun, oddly enough--put a bunch of fucked up teenagers in a room together (I was 17,  18 now) and hilarity ensues. As far as the therapeutic aspect of it, though, there really wasn't much value. Same goes for traditional therapy; I only go to my therapist because my parents make me, it's honestly completely useless. \n\nAll told, I missed two months of school. Most people still have no idea why. And a word of advice to anyone who's stuck where I was? Talk to people. The number one thing that I've taken from this whole experience is that even the people you don't think care about you at all, do. And even though I still have some down days, they're nowhere near as bad and overall I'm very happy now, thanks to my girlfriend (who's pretty much the most incredible person I've ever met) and medication. Feel free to PM me if you'd like if you just need someone to listen (or read, I suppose). \n\nSorry if there's any formatting issues; I'm on my phone. I'll check for replies later. \n\n", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yck53/"}