{"id": "t5_2qh1i_t3_4e8oip_t1_d1z3jv0", "creation": 1460416172, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "psychstudent3040", "text": "Some dazed combination of how? Where am I? What day is it? I tried to overdose. I was a sophomore in high school. Honestly it's a blur why because I can't imagine now feeling so low. I snuck past my mom while she was napping on the couch and filled a plastic bag with headache pills and then some other type (can't remember what). I stashed it in my drawer and waited for the moment to come when I knew I was ready. I got in a stupid argument with my mom two days later and sat on the side of the house with a water bottle and started taking them. I think I only got to 45 before my gag reflex kicked in. I couldn't for the life of me get any more down without gagging. Immediately I panicked thinking I hadn't taken enough to die and would be a vegetable. I called my best friend and started getting loopy, walking around the neighborhood and dropping pills behind me. My friend convinced me to go back to my house and try to throw up the pills. I instead went to my room and passed out.\nI woke up dazed. I remember panicking thinking I had fucked my brain up because I was so loopy. Then I was wondering what wet stuff was on the side of my mouth (throw up). And then wondering why it felt so uncomfortable between my legs (catheter). Then the next few days were a blur until they put me in an ambulance to a mental hospital.\n\nI do remember I couldn't look my mom in the eye and it made her leave the room sobbing. The only person I would talk to is my sister. It made me realize how fucked all of my relationships with everyone were and what a shitty person I had become. I regret that I made my family suffer through that (and pay thousands for the hospital bills) but I honestly don't think anything else would have woke me up and made me stop being such a shitty person to everyone, including myself.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1z3jv0/"}