{"id": "t5_2qh1i_t3_4e8oip_t1_d20e87o", "creation": 1460498625, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I've never posted on Reddit before, but I think it could be helpful to someone, so I think it might be useful. Another thing I should mention is I have attempted on numerous occasions, so I can give a few thoughts after several of my attempts.\n\nI was bullied quite badly, when I started comprehensive school, and it was when I'd just started there too, and the teachers didn't really do much about it, and my family picked on me quite a bit too, so with everything piling up, I started attempting, at first I would get my dressing gown, and tie the belt around my neck, a part of me knew this wouldn't kill me, without me hanging, but I believe on a subconscious level, I wanted to find out if I'd be able to hang myself.\n\nAnother attempt was to drown myself, in the bath, I submerged myself, and after a few tries of this I got very close, but at the last minute, my body just brought itself out of the water, and I started breathing, and the closer I got, the more unpleasant it felt, so I stopped, I didn't really have a thought, after this, I just got out and carried on as normal, but I did find it too unpleasant to try again.\n\nOn another attempt (this was my first year of college, I had taken 2 weeks off, due to feeling badly depressed, and when I had started college I started getting suicidal thoughts as well, which I'd never had before and some other issues got worse as well.)  After the 2 weeks off, I was feeling really low, a bit worthless and insecure too, and in a way, I felt inferior, so one morning before college, I put a can of aerosol up my nose, thought for a couple of minutes, but I decided to do it, so I sprayed, but with the way it was directed, it was more directed at my nose, rather than up it, so it failed, I was still a bit down and guilty (something which I usually feel, after an attempt) but I just went to college as I should have.\n\nI am better now, I do get bad every now and then, and I do sometimes, wonder what would everything be like if I were successful, or if I wasn't here, but I found hope, it wasn't easy, but I started to look after myself, not in a vain way, but at those times, I didn't really love myself, so I started to do that, and it does help, I took it one step at a time, but I eventually got through it. Also, if anyone here ever needs a chat or something, then you can feel free to PM me, I know this sounds cliché, but I'm a good listener, and I care, so I will do my best to help, if I can. I'm not a counsellor or doctor or anything like that, but if anyone needs help, I'll do my best to help.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d20e87o/"}