{"id": "t5_2qh1i_t3_4e8oip_t1_d22g33d", "creation": 1460634793, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "How is it not your words? You didn't directly say what I said, however you argued against the fact that people could change for the better to not have war, and it's reasonable to say war is immoral, isn't it? At least some of the time, surely?\n\nAnd people that make immoral decisions such as, say, genocide are scum. Scum that the world would be better off without, right?\n\nSo in your world view of we cannot change people for the better, we will continue to allow ourselves to be ruled by immoral scum and therefore be immoral scum ourselves and somehow you are promoting this idea rather than the idea that actually, we could change, and we could have a better world for it in the future, once we stopped our barbaric ways, yes?\n\nSo please explain to me how I'm the bad guy... Please think of the consequences of your opinions and how they are going to affect other people because you have seriously gone a long way to ruining my day, and my life is bad enough as it is without people like you ARGUING with me, when I'm trying to PROMOTE POSITIVE CHANGE IN A THREAD ABOUT SUICIDE. \n\nSorry you make me a bit fucking angry, and I wasn't joking when I said you make me want to kill myself, there are points in my life where it already seems hopeless and then having people like you come and tell me that firstly I'm somehow HURTING OTHERS BY TALKING ABOUT POSITIVE CHANGE, and secondly ASSURING ME THAT THERE IS NO WAY TO CHANGE AND WE ARE DOOMED TO PERPETUAL WAR.\n\nHow do you justify your views? You haven't even tried to. You have nothing to back it up, you just spread your misinformation whilst simultaneously telling me that there is no way I can improve my life... Because if humans can't change as a whole that much mean they can't change as individuals, because that would be accepting that if everyone individually changed for the better, then society would improve, which you are saying can't happen...\n\nPlease explain logically to me what is wrong with what I've proposed before you start telling me that what I'm saying is bullshit, and that for some reason it is worse than someone telling potentially suicidal people that there is no way the world could improve for everyone as a whole... \n\nThink about what you're saying! ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d22g33d/"}