{"id": "t5_2qh1i_t3_4e8oip_t1_d1ykt9q", "creation": 1460390980, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I didn't quite make it to the jumping part, I had planned to, but hadn't quite worked up to it yet when somebody called the police and an ambulance. Who promptly brought me in. Once it was clear I wasn't an immediate danger to myself the police just left me with the ambulance crew who took me back to my flat (like 30 seconds from the bridge so it wasn't like they took me home 'instead' of the hospital, just wanted somewhere to sit down and fill out paperwork/check me over)\n\nAll I could think was \"I don't want my flatmate to find out\"\n\nThe worst part about it was they wouldn't take no for an answer. We went back to my flat, despite me asking them several times not to, because I didn't want my flatmate to see or hear any of the conversation. I would rather random people in the road heard it over having to deal with the inevitable \"So... what happened?\" bullshit.\n\nBut they would not fucking grant me that one simple request. And the result was that they accidentally fucking told my housemate what had just happened. Which I was not happy about.\n\nThat was December 2014, and was the worst I've ever felt, at that time although suicide had been on my mind constantly for months, it only really takes a few minutes where your mind is so fucked you genuinely believe you *need* to die to come close to it (or make it happen).\n\nI've made a huge amount of progress since then. Changed jobs, moved to a cheaper location, paid off some of the debts I had, spent some time away from a very close friend of mine who had attempted suicide several times who I was crippling myself trying to help. I hadn't realised how much damage I was doing myself by constantly worrying about them at the time. I routinely went several days in a row without being able to sleep, even with the help of pills, and would have nightmares whenever I did manage to get some sleep. I had to take almost 3 months off work and spent almost all of it in bed.\n\nI'm still a bit unstable here and there, and I've mostly had to make that progress myself because of how difficult it is to find mental health services in the local area (and how difficult I personally find it to seek them at times) but I'm doing so much better than I was. My life now, despite needing a lot of work, is incomparable to how it was then. Which kinda scares me, because I still feel low a lot of the time, and occasionally something will 'set me off' and I'll drink myself stupid or something, I still have involuntary suicidal thoughts regularly. But it's hundreds of times better than where I was at Christmas 2014, the idea of ever returning there terrifies me.\n\nHopefully everyone in this thread has gotten or is in the process of getting better. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ykt9q/"}