{"id": "t5_2qh1i_t3_4e8oip_t1_d1ynjmz", "creation": 1460394595, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Bad-Science", "text": "> But if that means that I get to spend the next 45 doing the things I've come to love again, and that I get to build that world and that future to be whatever I want and need it to be? \n\nThanks for the reply. I wish I could be in an optimistic place, but the things I'm dealing with ARE things that are going to be with me for the rest of my life, not temporary impediments that I can move on from.  Here is a bit of copy/paste from another reply, with more at the bottom. \n\n\"In the last 3 years:\n\nI got into an accident and got a head injury. 3 years later I'm still dealing with it (headaches, memory issues, etc)\n\nI lost my sister to cancer after a long illness\n\nI lost my dad just a few months ago and am dealing with that loss and his 'estate' stuff.\n\nMy mom in in a nursing home, slowly forgetting who she is and who I am.\n\nMy wife is battling something (some form of dementia or very early Alzheimers?) that she will more than likely never get better from. It effects us both every single day now that I feel like her caretaker, not her partner.\n\nWork is very very stressful right now, made harder because of side effects of my head injury.\n\nThe only social contact I have (had?) was based on a sport I like to take part in. But since my injury, I can't do that anymore so I'm slowly drifting away from people since all I can do is stand on the sidelines now. Besides, I know that my time left with my wife is probably limited, so whenever I have a choice I chose to be with her. \n\nSo I don't see any light at the end of the tunnel. I'm happy for maybe 1 minute each morning when I wake up, then I remember my life and the weight descends.\n\nSo a few good days are not going to pull me out of this. \"\n\nWith all of that, I'm in a place where I can't really see things ever really getting better. From here, there are only a few ways this can go. \n\n1) I 'move on' from all of this eventually. My wife passes away, my family all dies (almost there already), I lose my friends because the things that bond us together are gone so they just drift away, I get a different job, new friends, etc. In short, 'moving on' would mean a whole new life. I just know that, even if that happened, there would be a whole LOT of pain between here and there.  \n\n2) I don't move on, and and up like my father did. Lonely, alone (except for me), house-bound and waiting for death. or;\n\n3) Ending it all at some point. No, I'm not planning for that point now, but I have considered suicide one of my valid options for years now.  ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ynjmz/"}