{"id": "t5_2qh1i_t3_4e8oip_t1_d1y6y5a", "creation": 1460356931, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Sleepitawaythrowaway", "text": "Just never really saw the point of living as a kid.  I always watched the news and read things that a kid probably shouldn't have been reading.  Agonizing over every horror in the world.  I can remember being six or seven and reading articles on tensions in the middle east(like those are new!) then watching the news and hearing that we were minutes from nuclear war and just thinking, \"So, why?\"\n\nI would lie in bed and spend hours trying to imagine what it would be like to be dead.  To be nothing.  It was scary at first but then it just seemed better.  I had friends and was popular.  I was college bound and gifted in academics and the arts but every night I would close my eyes and try to be dead.  Hoping that if I could lock my mind in on what it was like it would welcome me.\n\nFast forward a few years and I had just lost a job I hated, felt like my parents and family hated me.  I went to the beach one afternoon and decided it was just time to be done with it.  I had a prescription for a powerful sleeping aid so the method was clean and easy.  I came home, boxed everything up so no one would be inconvenienced by having to sift through my things, wrote a letter expressing my deep sense of hopelessness and apologizing to everyone for every small wrong I'd committed, outlined a brief will, carefully folded the letter as to make sure it would fit perfectly into the envelope I had labeled **DNR**, and washed down the pills I had with whiskey.\n\nWoke up or rather regained any sense of consciousness eighteen or so hours later and sat there feeling like shit and screamed, \"Are you fucking kidding me?\"\n\nI have no idea how I didn't die and it still kind of pisses me off.  I haven't gained any sense of enlightenment or hope.  I'm not suicidal anymore and while I think about being dead often the periods between such thoughts are longer as I get older.\n\nEven as I experience success in life and allow my creativity to come out more than I did that voice is still there:  *This is pointless.  No one is going to remember.  No one is going to care.  Everyone is in transit and all things are fleeting.* it got easier to not listen after I unpacked those boxes and burned that envelope.\n\nI talked to a therapist about it but I could see the look in her eyes and knew there were no answers.  She'd prescribe something that wouldn't fix anything.  It would just change the nature of my misery.\n\nI have happy moments but they are always stained with the awareness of everything that is wrong, everyone who is in pain, and that in the end none of this really matters.  I doubt I am less sad.  I think I've just gotten used to it.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y6y5a/"}