{"id": "t5_2qh1i_t3_4e8oip_t1_d1yqv9b", "creation": 1460398911, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Born2dodishes", "text": "I thought \"Fuck. I failed.\" This was in September of 2015-- I'd gone into an extreme manic state (based on some really awful things going on in my personal life), downed a bottle of pills, and slashed my wrists repeatedly (scars which I'll always bare as labels forcing me to wear long sleeve shirts for the rest of my days) and didn't want to wake up ever again. I don't know how, but my roommate knew something  was wrong (he'd seen me the night before and I was a complete mess-- drunk, crying, not making sense) and kicked open my (locked) door, saw all the blood, and immediately took me to the hospital. I got thirty seven stitches across my wrists and greatly damaged my kidneys from the extreme amount of pills I had taken. I was 51/50'd and spent a week in a mental hospital. Which only made things worse as it was one of the most wretched and downright scary places I'd ever visited-- condescending and unhelpful staff, being forced to share rooms with dangerous patients (my \"roommate\" for lack of a better term, threatened to kill me repeatedly and when I reported it to the staff they just said, \"well, we'll check in on you every now and then\"), hell-- I didn't even see a counselor or an internist for three days (I was supposed to see one within the first twenty four hours). I was eventually discharged and diagnosed with borderline personality disorder. I've since become medicated and go to therapy once a week. In all honesty? I'm still most DEFINITELY suicidal, but I'll never act on it again for fear of going back to a place as hellish as the mental ward where I was sent. I try to focus on the good things, I truly do-- I have a place to live, a good family, a car, a job, good friends-- but every day is still a struggle. I'll never forget the look on my parent's faces when they saw me in the hospital, I'll never forget hearing my brother cry on the phone (it was the only time I have ever in my life heard him cry) when he called me in the hospital. I'll carry guilt for my selfish act for the rest of my days, but I know that being free and able to live day-to-day is much better than the alternative of being confined to an institution. I'm trying-- I really am-- but it's still so goddamn difficult to silence these dangerous thoughts in my head. I hope and pray that some day they will go away, but in the mean time I just do the best I can and try to silence them. I need to realize that I am lucky to be alive and deserving of a good life. It's up to me to earn a good life-- and despite all the bullshit and pain and fear, it's still something I *have* to go for, because letting the darkness consume me will never help. Again, every day is a struggle, but nothing worth having is easy to get.\n\nApologies for the long post. ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yqv9b/"}