{"id": "t5_2qh1i_t3_4e8oip_t1_d1y8muh", "creation": 1460362952, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Stitchthealchemist", "text": "I was real scared. I didn't want to go on living, I really didn't. The depression makes me feel that way, like I'm worth  nothing, and at times I'll believe it. I get urges all the time to jump out a car or keep on drinking until I meet my maker, but when I woke up I was scared that I had gone through with it. I cried and cried and held a knife, just shaking and trying to work up the courage to slit my throat like a beautiful smile. But I thought to myself there was no way in hell I'll let myself lose to the thoughts, so I called a friend and got help.\n\nWhat people don't realize often about depression is that it works differently in different people. It scares the shit out if me. My depression doesn't make me sad, it makes me angry for no reason, and I mean anger like I caught someone fucking my own mother after drugging her after a turn with my sister's. The urges make me want to slam people into the counter at work for asking me what size coffee we have, or kicking a puppy for licking me too much. I fight my depression by making myself sad, listening to music I know will trigger me and thinking about the day I found out my son's mother cut her own throat the way I was about to my own (two years later I found out, it broke me). Point of my ramble is that I'm glad I got help, I'm glad I have the strength to not stab my co-workers and to not hurt that puppy, I'm glad I have people that care about me, even if the devil on my shoulder tries his hardest to convince me no one cares. \n\nMy advice to anyone going through what I do every damn day is to keep on going as best you can. I know it's hard, im in tears writing this out. I know sometimes you wake up and you can't move because what's the point of getting up again, who gives a shit if you live or die, right? Well I'm saying people do care, but you have to care yourself. Find your courage in what you can, armor yourself with whatever pleasant thoughts you can, and reach out. Someone, somewhere will grab your hand and pull you to the safety of what you need, be it pills or hospitalization or just a friendly soul to vent to. Fight on, my friends. Fight your devil's with kindness so that one day, someone will save you from yourself. \n\nDamn, that felt good to get out. If you guys have any questions or if you need a shoulder to cry on, ol' stitch is here for you. Good luck, and stay strong ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y8muh/"}