{"id": "t5_2qh1i_t3_4e8oip_t1_d1y6bco", "creation": 1460355013, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 268, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "louisbullock", "text": "I think this is what keeps me going in life is that will.\n\nThings get fucking tough. They always do, life is an absolute bitch.\n\nBut that will isn't gone, even in the people who say it is I have my doubts, I think its still there, even an inkling.\n\nSomeone can't honestly say to me they don't have that, how else do you think we've been surviving all this time? We've conquered things and made great things as a race, we're incredible beings!\n\nSo why stop now?\n\nWhy give up yet? Put in another coin. A friend of mine, Erick Watson put up a blog post entitled ['Continue?'](http://menageri-e.tumblr.com/post/57769805458/continue) that kept me going a lot, the idea is when things are down, put in another coin in the arcade machine, keep going.\n\nYou'll never actually know how far you can get or could have gotten until you keep trying. I ask, what would my best self do? Could I keep pushing forward? Of course, there's all the potential in the world, there's people who're worse off, there's success stories that come from hardship, so why the hell not keep continuing?\n\nIt honestly is a bit frightening reading some of these stories I should add, I hope to not get myself to that state, but its good reading them to see the resolutions people have taken and lessons learned, that one can continue on and on still despite difficulty, thats whats inspirational.\n\nThere's nothing inspirational about death, nothing heroic, nothing beautiful, its an act that in a way can be selfish even, without sounding too strong, it can seem to not take into consideration the effect it will have on others around the person.\n\nWe had a fellow come and talk when I was in high school about surviving a car crash, but his mate didn't.\n\nThe moral of the story was that this guy who died had 50-100 people affected just by his death alone, the ambulance folk, nurses, doctors, police folk, family, friends, acquaintances even, it keeps growing and rippling out.\n\nPeople who want death sometimes don't put enough thought into this, and its something I remind myself always of, there'll be someone at least who'll miss your loss, and it does ripple out even if one doesn't imagine it would otherwise. Think of the others.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y6bco/"}