{"id": "t5_2qh1i_t3_4e8oip_t1_d1ymmfn", "creation": 1460393382, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "theOTHERdimension", "text": "Well at first, they just prescribed me trazodone because I had been having trouble sleeping with my anxiety. After a few months on that, maybe 2/3 months, I hadn't seen a giant improvement in my mood and the side effects of the original dose weren't worth the results. \n\nI had a talk with my doctor about it and she recommended we try a combination of fluoxetine and trazodone. She also lowered the dose of trazodone that I would be taking so that I wouldn't have such a hard time with it. \n\nA month later, I did see an improvement in my mood after that but I still felt kind of weighed down with my depression, so I talked to her again. This time she increased the dose on my fluoxetine and kept my trazodone the same. \n\nThat combination is the one that finally worked perfectly. It took a while, as you can see, but the way I feel on my medication is vastly different from the way that I feel without it, in a good way. There was a period of time where I couldn't afford my medication, so I had to go a year without it, that was a hard year. Then, I had to get my medication adjusted all over again because I wasn't used to it anymore and they had to start me off slowly. \n\nSo in total it took maybe 6 months (the first time) of them adjusting my meds for me to feel \"normal\" again. But it was so worth it. It was frustrating at times and I felt like I was bothering my doctor by requesting adjustments over and over again, but I remembered that that is what they're there for. \n\nAlso, if they prescribe you a medication and you don't like how it makes you feel/there's too many side effects, just ask for a new one. Tell them what's happening with the one they gave you and ask if there's something else you can try. \n\nMy main side effects of trazodone were migraines and extreme drowsiness, even after 12+ hours of sleep. When they lowered my dose, the all day drowsiness went away. My migraines went away after I got used to the medication.\n\nIt's definitely worth trying medication if you suffer from depression/anxiety. Just remember to give it some time before you stop taking it, it might take some time to feel results.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ymmfn/"}