{"id": "t5_2qh1i_t3_4e8oip_t1_d1ye82z", "creation": 1460380709, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "WheresMalik", "text": "I swallowed 66 Ativan during a time when I was homeless for a few days in 2011. There is a huge list of reasons as to why I did it, but suffice it to say I did it. \n\n\n\nI swallowed them in a super Wal-Mart parking lot in the early afternoon. I woke up the next day in the hospital feeling like crap. I turns out I had swallowed them and for some reason in my drug-induced delirium decided it was okay to try and drive somewhere else - I ended up hitting a parked police vehicle that had an officer just sitting inside doing whatever. I was told the officer said he went up to my window and noticed I was passing in and out of consciousness and he dragged me out of my car and put me in his cruiser and took me to the hospital. \n\n\nWhile there, they pumped my stomach but that wasn't the end of it. The nurse told me that I had repeatedly tried opening or smashing open the window on the 3rd floor I was on so I could jump. I kept screaming something along the lines of, \"I just want to die! Just let me die, I don't want to live anymore!\" They then handcuffed me to a bed or something. \n\nEdit: Wanted to clarify as I wrote this in the morning when I had just woken up. When I said I tried to drive somewhere, that is true. However, I left out that I didn't get very far as I hit the parked police car IN the Wal-Mart parking lot. Furthermore, I was driving slowly enough that there was absolutely no damage to either his police cruiser or my own. I had to have been going >5 MPH when I hit him as the officer said it was no more than a light bump for himself in the vehicle. The morning I woke up he and I talked for a few minutes or seconds, the time is very jarbled for me until the day after or so, I just remember him telling me that and then him shaking my hand and hoping I get help. As to my first thought, I don't remember. Just confusion.   ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ye82z/"}