{"id": "t5_2qh1i_t3_4e8oip_t1_d1z3ate", "creation": 1460415783, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Throwawayfinnishdud", "text": "Obviously a throwaway..\nOk, long story. I know this'll be buried and no-one will read, but here we go. I'm in my early thirties Now, this episode happened 2011. I'm a finn, had a terrible childhood with being bullied extremely heavily each and every day for 12 years at school. However  went to study for masters in economics later on. \nI really had everything just about right in my life, I had already lived abroad, worked abroad, become fluent on german etc. Studies were great. I went to Munich (where I also have lived before) with a bunch of friends and just out of nowhere, I tried to jump in front of a subway train at Marienplatz subway station. My friends literally saved my life by wrestling me down. I was very very drunk, the hangover lasted all the way back home on a car (1500 miles, 48 hours) \nTil this day I do not know what happened. I just got very drunk and tried to kill my self by getting absolutely maimed by a fucking train. I do tend to get depressed, I still think that i should never been born. But I really would never dare to kill my self. And I never to this day admit to my friends that I remember what happened, was a complete shock to wake up next day and to hear them talk about this and the mood was.. I'd say half of them completely disappeared from my life and half stay in touch after graduation, needless to say I am really ashamed of how our trip to Oktoberfest and to my Ex hometown ended..\n\nActually quite frankly I just want to start over and forget about the past, been a lifelong alcoholic and used drugs and tranquilizers heavily as a teen, to escape the reality. And never since tried again, never going to and really made progress by not drinking, not using anything and really working hard to start all over (applying all the time for jobs in Germany as the Job market back home really suck at the moment (unemployment being ~18% measured by the governmental employment ministry)\n\nAlso was the happiest time in my life when I lived in Germany. Will go back ASAP..\n\nSorry for a long rant, obviously dont wanna use more permanent nick for this, but really helps to vent", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1z3ate/"}