{"id": "t5_2qh1i_t3_4e8oip_t1_d1y7kp0", "creation": 1460359018, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "\"Holy shit, my ear.\"\nI was around sixteen and in the depths of my depression and other psychological disorders without medication when I decided to try and end my life for a third time. But this time I was sure I wasn't going to fail, so I took my fathers gun that he keeps for self protection, aimed at my head and fired. I am a relatively small girl so the kick from the gun instantly blew me back and as I laid on my parents bedroom floor all I could think was, \n\"I'm dead. I'm dead. Fuck, I'm dead.\"\nBut as I laid there for longer and longer and felt the hot blood rushing out of my ear did I realize that I was in fact not dead and in deep shit. All my previous attempts had been relatively quiet, just pretending to have a stomach bug when I was sick from trying to OD or covering the marks on my neck from trying to hang myself with makeup. But I had just fired a gun in my house and SHOT A BIT OF MY EAR OFF. I had intended to die instantly so I would not have to face the consequences of firing a gun, but I was now missing a chunk of my ear and laying in my parents bedroom. Everything was so vivid but once my parents got home it was all a blur, probably due to blood loss. All I can remember is my mom screaming, \"What have you done? Oh God, what have you done?\"\nI got sent to inpatient for four months after this and slowly recovered and got my ear reconstructed, the only reminder being a small scar on the back of my ear, but even then, hearing loud noises scares the shit out of me and puts me into panic attacks. \nEvery single day I am reminded of the horrific disorder that depression really is and how much it can change a person. I had no legitimate reason to feel the way I did. My family loves me so so much and every single day I am so thankful for my mom who helped me help myself. :-)", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y7kp0/"}