{"id": "t5_2qh1i_t3_4e8oip_t1_d1yqsij", "creation": 1460398814, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Getting more serious here....I was bullied before too, things were bad, sad, and not to make this a competition, but the severity of the bullying reached the point that my school recommend me to go to a difference school as the only viable solution. When I was offered it by my family and the school I said no, refusing to be broken and give in . I know exactly why I made the choice but that's a long story that I don't need to go into detail into.  I was still bullied after, nothing changed, life was miserable but it was a life defining moment for me. I'd don't remember thinking of suicide because I was so young, but I do remember wishing I never existed, and how things would be better in non-existence. \n\nI know what kept me going, supportive family, long nights of violent video games, and my devotion to my religion.\n\nThat said, I can't quite connect or console people who have gone into depression, I know I experienced depression, but I think my nativity simply excepted the misery as something completely normal. So even if I experience simular pain I don't think I can really empathize enough to handle or help others.\n\nSo anyway I wanted to take this opportunity to ask, what broke you?\n\nDid you lose hope in yourself? Did you lose hope in the people around you? Did you believe things were going to get better? If not when, and why? Are you religious? If so did it play a role in these experiences? How old were you? Did you have any friends? Was there anyone that you trusted? Do you hold any resentment towards the people who bullied you? What was the nature of the bullying?What could have prevented you from reaching that point?\n\nI don't expect an answer to any of them, I just wanted to see if I can learn something.\n\nThankyou\n\nalso I'm glad you found my comment funny :)", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yqsij/"}