{"id": "t5_2qh1i_t3_4e8oip_t1_d1y94ae", "creation": 1460364920, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "FieryWolf29", "text": "Well, this wasn't so much a intended suicide per-say, rather a bad event that I was going with. I was caught out in a rip-tide one day along with my sister, and as we were young, we couldn't swim very well. About that time, I was receiving the brunt of bullying in my school life. So I was thinking, 'At least people won't have to deal with this annoying, awkward kid.' So I kinda just stopped swimming, and began sinking.\n\nAbout 30 or so seconds underwater (like I said, I wasn't actually intending to die rather than go along with it, so I wasn't really in a rush to drown), I started getting pulled by some random bloke who happened to see me and my sister (she was being helped by my dad, who had a really bad back from an incident in the army). I still wasn't really doing anything, rather then going along with it, so I literally wasn't moving anything, just being pulled. We eventually made it to shore, and taken to hospital.\n\nI dunno if I was in shock or whatever, really still hadn't been feeling anything, so when we got back to where we were staying at the time, I kinda just sat around on the couch. My sister was a bit more upset about it. She cried about how she felt terrible about how she put me in danger, because the reason we were out there was because our younger brother and ourselves were playing a game. When she admitted that, that was the first thing I actually thought since. Knowing that my sister (who up until then I respected immensely but didn't think cared for me, like everybody else) was worried for me rather then herself during the time...kinda just struck.\n\nSo now, I'm out of school, entering university, and gotten over the bullies. Most of 'em were dickheads, and the majority of them actually had some issues of their own (some physical, some mental). I don't talk about that day anymore, and try to help others where I can.\n\n-----\n\nWhat I thought:\nWell now I feel like crud. Give her a hug, and tell her she's great and brave.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y94ae/"}