{"id": "t5_2qh1i_t3_4e8oip_t1_d1y80r4", "creation": 1460360600, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Solitarypinwheel", "text": "When I was a preteen, I began my battle with depression. At that age I had few resources or frame of reference to determine why I felt how I did. It seemed like everyone else was moving forward in their lives and I was just...there. \n\nEventually it got bad enough that I decided it wasn't worth the effort anymore. I swallowed the remainder of a bottle of extra strength Tylenol. I don't remember exactly how much, it was over a decade ago, but my 13 year old brain figured it would be enough. After taking the pills I felt this ridiculous sense of freedom and relief. For the first time in months I felt something other than nothing. It was all going to be over soon. I laid down to go to sleep. \n\nHours later I woke up puking. My first thought was something along the lines of \"oh, shit\" and I bee lined to the bathroom on clumsy legs to continue vomiting into the toilet. Knowing I had failed was absolutely crushing. After puking my guts out, I crawled back into bed. No one was home at the time, and to my knowledge no one in my family has ever found out. The closest I ever came to telling anyone was my best friend in the following days at school. But I didn't want to be called crazy (stigma is the word, but my 13 year old self did not have as developed a vocabulary) or put in a mental ward so I never told anyone. I also didn't want to have to explain to the nurse, the principal, my parents etc. about the awful things (or lack of things sometimes) that I felt. So I said nothing and continued moving through my life. School, homework, sleep. I was very mechanical for many years. I never attempted again but I certainly thought about it, sometimes daily. When I was younger, I was dissuaded by the idea that I would just fail again, but as I aged I needed soemthing more to hold on to. At this point I didn't want to die, but a part of me was actively self-destructive. \n\nLate in high school I hit a turning point. I don't remember exactly what happened but it involved something to do with studying existentialism. A good friend of mine had said something to about living life to its fullest, to which I internally scoffed. But then, I started thinking, although my life was worthless to me, perhaps it could be worth something to someone else. So I started volunteering, I started helping people whenever I could. Even if my life was empty, I might as well make other people's lives better right? Because I had already failed once to die, so while I was still stuck here, I might as well be useful. \n\nMy volunteering led me to work with teenagers, some dealing with the same issues I had. I find it easy to connect with them sometimes, because the thoughts they have are the same ones I endure. I have also discovered something else. Regardless of how awful my thoughts are (I still think about killing myself daily), I know that I am winning my battle because I would NEVER do that to the teens I work with. I can rationalize away the reactions of my family and friends (they are strong, they would get through it) but I can't rationalize betraying so many people who have confided in me over the years. And that keeps me going, every day, every night. When the back of my mind howls at me to end it, I know that I won't -because I am living for more than just me. I am a lifeline, I can help others, and killing myself would cause more destruction that I am willing to take responsibility for. \n\nWhich brings me to the crux of this post: To anyone who feels worthless or numb or has no reason to live, start looking inside and outside yourself for the one thing you can seize and hold on to for dear life. I know from experience that sometimes being loved isn't enough. But I guarantee that there IS something out there that will be enough. \n\nIt might not get \"better,\" but it gets manageable. In my mind I think of myself like a recovering alcoholic, each day I might have a relapse, but each day I am stronger and I can do this. \n\nTldr: tried to kill self, failed, found that being needed is sometimes more important than being loved ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y80r4/"}