{"id": "t5_2qh1i_t3_4e8oip_t1_d1ykevu", "creation": 1460390436, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Bboyle2", "text": "Ouch. My belt broke and I fell out of the tree.\n\n***Edited for the whole story when I returned from Chic-Fila\n\nIt started off as a stupid move on my part over a pointless argument with my Mother. I have a history of Manic Depression and I had thought about suicide a lot. I never went all out before, though. I ran outside and climbed a tree, wrapped my belt around my neck/tree, and pushed off from the branch. The belt broke after a few seconds and I fell to the ground. That is when I thought ouch and screw this, I am going to eat a bottle of generic Advil. I was then informed by my Mother that the pills would not really hurt me, except for probable my liver. I then called my Friend to come get me, so we could drive around or go see his Brother. His Brother also had a history of trying to kill himself and I thought that maybe talking to someone else who suffered from depression would help. My Friend informed that his Father was home and we both did not really like being around him. We drove around for a few hours getting stoned and then the guilt hit me. I had to go home and apologize for my stupid actions before my Mother went to sleep. My Friend then tried to talk me into going to his house to say hi to his Brother, but conceded that we were all going job hunting in the morning, so we could meet up then. I got dropped off, apologized to my Mother, and then got paranoid about falling asleep with all the Advil in my belly. I finally passed out at around five. Now, I sleep like I am dead and usually nothing can wake me up. I actually have slept through two hurricanes. Well, around 6 my eyes opened and I saw the caller id lit up. I closed my eyes and re-opened them with the phone in my hand and next to my ear. \"What's up?\" I  asked and my friend says\" My brother hung himself last night, can you come over?\" Now I had hung myself and I was still breathing, so I asked him if his Brother was okay. He was not. I had used a well worn belt, but his brother had used a Nylon rope. I said okay, see you soon, hung up, closed my eyes, and then realized what was going on. I ran to my Mother's room and informed her of what happened. Our families were real close. I lived with them for a year and they basically lived with us for around ten years at that point. My friend was my Sister's first real boyfriend! Well my Mother said let's go and we both jumped in different showers, took off driving, and made a fifteen minute trip in four minutes. We got to the front door and my Friend opened it and just lost it when he saw my Mother. I went looking for his Mom and she lost it when she saw me. The police were questioning the Father and the body was in the back yard under a blanket. My Mother went over to the cop and started chewing his ass over how he was treating my Friend's Dad. She was threatened by arrest, but she would not back down. She won the argument and then called a Priest. I was in shock. This is my own A Christmas Carol. I couldn't put two and two together. I was watching a horrible play entitled \" How to destroy a Family aka You almost did this to yours\". I walked out front and around to the driveway. I saw the paramedics on the driveway waiting on the cops to finish up so they could take the body away. I light up a cigarette and walked to the backyard to say good bye to my friend. I saw the familiar Vans poking out from the blood stained blanket underneath the basketball goal where I learned how to dunk. I lost it. What a waste. It all hit me how horrible this was and how if I had just gone over there last night it might have changed something. My Mother came outside and looked at me. Without a word we both knew what the other was thinking. I was so lucky that my belt broke and I spared my family from this horrible nightmare. \n\nI went home and called my Father, who was well on his way to exiting our lives for better pastures, and he did not answer the phone instead choosing to draft me a letter. He gave me some actual parting wisdom. \"Suicide is the last selfish act of a selfish person, set to hurt a select group of people.\" Now I did not want to hear that at the time, but that final message from him is unfortunately is one of the main reasons I am still here. Whenever I get too manic and get overwhelmed by the hopelessness, I think about what we went through with my Friend's suicide and pull back from the line. I can understand that sometimes it is overwhelming and it weighs so much that some people just cannot take it anymore, but seriously, think about your friends, family, hell even your acquaintances! The guilt and fallout from suicide is something that no one can ever forget. Death will come for all of us soon enough, so do not throw away what little time you have if for nothing else than the people you love.\n\nSorry for dragging on and if anyone has any questions due to my rambling style of writing, let me know.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ykevu/"}