{"id": "t5_2qh1i_t3_4e8oip_t1_d1y5lwr", "creation": 1460353066, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 706, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "rebelman233", "text": "No throwaway please excuse Grammer and format I'm just putting this out there. I am just going to type it out. I deal with ptsd and depression at the time I was dealing with my issues that I hid after coming home from over seas my divorce and I was getting close to losing my apartment I got drunk as hell got in a fight with my then girlfriend I racked my shotgun with my girl in the room and her daughter in the room next to us and pulled the trigger. The shell was sitting on the floor and the shotgun did not discharge. I was put in hand cuffs and had the police surrounding me with weapons drawn. I tried to fight but gave up. I was loaded in to an ambulance and taken to the hospital. The sergeant walked in to my room and said you are a lucky son of a bitch and showed me the shell that should have killed me. I spent a week in the psychological ward. The things I saw there were worse then iraq. I saw people shit the last selves and use it like make up. My first thought when the fog cleared was I should have died and the barrel of that shotgun still looked oddly tasty. Today I  am not doing the best but I want to live. Mental heath is no joke and we need to look at it a lot better. If any one is interested in will reformat and clean this up in the am other wise this will just get burried In the reddit pit of comments \n\nEdit.\nThank you to all of you for your comments really can feel the love. I did have a few tears from all of you. Good thing I am cutting onions at my part time job\n\nI still have my bad days but have not had suicidal thoughts in a cupple of years. \n\nTo any one else who know a vet the 22 a day is real. If they are on facebook tag them to battle in distress. They are trained and usually help with in minuets. Also have them look up warrior pointe. It is a group of vets that do get together and also offer assistance with va claims. Any vet out there feel free to pm me if you are ever having a problem\n\nAgain thank you all", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1y5lwr/"}