{"id": "t5_2qh1i_t3_4e8oip_t1_d1ybiid", "creation": 1460373988, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DrJonah", "text": "It took about a week before I finally realised that it hadn't worked.\n\nI'd taken a few packets of Paracetamol on Friday afternoon. That weekend we were due to visit my family, so figured I'd become very ill at some point during the weekend and then be hospitalised before dying with friends and family around me.\n\nFell asleep on the afternoon and could manage to carry on driving, so asked my wife to take over. We had to stop so I could throw up. Wasn't much vomit, and was 6 hours+ since I'd taken the pills so still thought I'd done enough. \n\nAt this point I debated telling my wife, but decided to stick with my plans and I wanted to die somewhere familiar.\n\nSpent the the weekend enjoying every moment. I'd sit there with an odd smile on face as I watched my daughter play with grand parents and cousins. This was probably the last time I'd see these people happy like this. It was beautiful.  Any moment I was ready and prepared for my liver to start giving out (the expected consequence of the OD) and then I knew that the end would come.\n\nThen the weekend was over and we went home.  Still I thought it might happen. My wife went back to work. Life carried on, as it does.\n\nIt's at this point I told my wife what I had done, and what I had expected to happen. Lots of crying from both of us. Promises made to seek help. We would get through this we told each other.\n\nAfter time, I knew that I couldn't leave my daughter - who was only 2 at the time, and would probably spend a good part of her life trying to understand why her daddy would rather die than be with her.  It would be unthinkable.\n\nI've gotten better; not perfect, though who is?\n\nThe hardest part for me now is that weekend is still one of the happiest memories I have.", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1ybiid/"}