{"id": "t5_2qh1i_t3_4e8oip_t1_d1yjk96", "creation": 1460389273, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "porkbuttextravaganza", "text": "Hi there, just another internet stranger who's been dealing with clinical depression for a little over 10 years now. Like others, I wanted to reach out to give my heartfelt comfort to you in dealing with the asshole that is depression. That being said, I just have a couple of stray thoughts that might help in some way. \n\n> I hate needing pills just to feel normal.\n\n* The pills - I've been on and off a generic Zoloft this past decade, and I completely understand this feeling. I already have a several chronic conditions and know too well that heavy feeling of knowing that I'll be popping these little bastards for the rest of my life. However, the good news is that, depending on your specific variety of depression, you could find an anti-depressant that both works and takes time off. My depressive episodes come in waves, and I've been able to successfully balance out my brain juices to the point of going off my meds and being just fine until I need to jump back on. I'm sure you can find a quality Dr to help you navigate the world of meds to find something similar to help you now and in the future.\n\n> part of my mind is always taken up by the depression. Then, no matter how hard I try, I always make mistakes. Of course that makes me feel worse about myself. \n\n* **Depression lies** - It took me a long time to figure this out, but since then, I'm spreading this particular gospel. When depression sets in, it has no remorse in feeding you lies upon lies to make you feel worse. Think you're worthless with no one to turn to and no hope of recovery? **Lies!** Depression is greedy and wants you all for itself, and part of the struggle is cutting through the bullshit to the truth: ***You are loved.*** In this regard, pills can help, but so can other things like friends, psychiatric help, and changing one's lifestyle. The point is, depression wants to wallow, but you can overcome.\n\nOkay, sorry for the long post, but please let me know if you ever want to talk (about anything, really). I hope you have a good rest of your day! ", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d1yjk96/"}