{"id": "t5_2qh1i_t3_4e8oip_t1_d20twa2", "creation": 1460525271, "origin": "t5_2qh1i_t3_4e8oip", "height": 1, "replied_to": "t5_2qh1i_t3_4e8oip", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Guaraninja", "text": "My younger sister is the only one in my immediate family I've ever told, and to be honest I don't know where I'd be without her. She deals with anxiety to the extreme where if we go to the mall on a busy day we have to leave immediately otherwise she'll freak out and start hyperventilating. \n\nShe was the one that encouraged me to go to counseling and start opening up other people. Since the incident she and I have gotten a lot closer.\n\nIt's always been tough dealing with parents about my diabetes. They've been there since day one, and so i have to respect their dedication to keep me healthy. On the other hand, even when I ask for help, they don't understand the pressures that I have on myself to keep my blood sugars in line, how draining it is to see my A1Ç's come back with a level that's way too high, or the constant poking and prodding, the testing and corrections.\n\nSigh, I really appreciate them trying, but it's decidedly impossible, no ridiculous, to have them on the same page that I still have trouble finding. The one time my dad gave me some sage advice was when he said it reflected my character the way I deal with my levels and overcome the troubles that come with them. It really spoke to me when he said it, because he was big enough to say he understood that he wasn't going to be there every step of the way. Mind you this was after my failed attempt, and I never told him about it either.\n\nDespite them never knowing about that weight, I know they'll have my back, and will keep wanting the best for me. Right now the biggest obstacle that I need to face, is making sure that I want what's best for me; Not for them, but for myself.\n\nDoes that make sense? Because it made more to me as I was writing it down, ha-ha", "permalink": "/r/AskReddit/comments/4e8oip/serious_suicide_survivors_of_reddit_what_was_your/d20twa2/"}