{"id": "t5_2tand_t3_qgejw3_t1_hi61sf0", "creation": 1635283903, "origin": "t5_2tand_t3_qgejw3", "height": 1, "replied_to": "t5_2tand_t3_qgejw3", "down_vote": 0, "up_vote": 15, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "n-olie", "text": "If you had a good friend or family member going through the exact same thing you are.\n\nWould you talk to them the same way? \n\nLike, hey best friend, get a grip and stop being so shy and anxious. \n\nYou probably wouldn’t, right?\n\nGive yourself the same grace you would give a kid or friend or someone else you see. \n\nI’m sorry you were cheated on. I know that hurts beyond belief. If you had a good friend dealing with this, would you say you hate that they are angry and sad? Or would you- most likely- give them a huge hug and try to help? Can you try for a day to treat yourself like how you would treat a dear friend?\n\nThe previous poster is right. Start with replacing all the hate with accept. For me, I accept I am a very anxious introverted person. I actually know hundreds- thousands- feel the same. It’s not a bad thing in itself! \n\nChange starts with accepting. Accepting that I will probably always be introverted and probably a little anxious is a good start. Accepting there are aspects of that that are good — it makes me a great listener, it makes me want to help when I see others in a similar bad space I’ve been in. Then there are aspects that maybe are not so good, like I isolate a lot when I’m overwhelmed and can lose friendships as a result. I’m not going to become a different person overnight, but it makes it easier for me to focus on an aspect I want to fix - like my tendency to self isolate- rather than try and solve the whole anxiety issue. \n\nIf you haven’t already I encourage you to talk to a professional if you can. There are some amazing talk therapy options out there, cognitive behavioral therapy specifically has been shown to help a ton with anxiety and depression.\n\nYou got this. You posted here because you know something needs to change. That’s a big step already. 💙", "permalink": "/r/DecidingToBeBetter/comments/qgejw3/i_hate_the_person_i_have_become_and_i_cant_sleep/hi61sf0/"}