{"id": "t5_2tand_t3_qgejw3_t1_hi6mbs0", "creation": 1635292970, "origin": "t5_2tand_t3_qgejw3", "height": 1, "replied_to": "t5_2tand_t3_qgejw3", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Tinnie_and_Cusie", "text": "First off, you're not horrible and disgusting. You are a human who is hurting in this difficult world. I hear you. I cry every day. \n\nI would like for you to check out these links. You might benefit from The Backpack Program:\n\n>This current age is faster, busier, noisier, and more stimulating than any era preceding it. While there have been some wonderful advances made over the last few decades, our modern society also poses **unprecedented challenges which many of us do not have the awareness or tools to address**. **The Backpack Program** **equips people with the resilience and life skills necessary to negotiate these new obstacles.**\n\n&#x200B;\n\nThere's a 20-dollar \"workbook\" that I ordered for myself just to see what it's about, and I recommend it to anyone needing to learn resilience; the \"program\" itself is intended for groups, so don't go \"ahhh!\" at those prices; ignore them. That workbook would help you with everything you said you hate about yourself. It's a really useful resource! \n\nI am NOT affiliated with this program in any way nor is this intended as an advertisement and I won't make a cent from this, I'm simply suggesting this to you as a resource with the hope that it may benefit you. \n\nThe workbook:\n\n[https://thebackpack.life/collections/store/products/the-backpack-workbook](https://thebackpack.life/collections/store/products/the-backpack-workbook) \n\nThe list of contemporary challenges:\n\n[https://thebackpack.life/pages/contemporary-challenges-x?\\_pos=2&\\_sid=c8f9bf72c&\\_ss=r](https://thebackpack.life/pages/contemporary-challenges-x?_pos=2&_sid=c8f9bf72c&_ss=r)", "permalink": "/r/DecidingToBeBetter/comments/qgejw3/i_hate_the_person_i_have_become_and_i_cant_sleep/hi6mbs0/"}