{"id": "t5_2qh5i_t3_coswp8_t1_ewqfn88", "creation": 1565664666, "origin": "t5_2qh5i_t3_coswp8", "height": 1, "replied_to": "t5_2qh5i_t3_coswp8", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "poppyfield_76", "text": "Sorry for the long reply... I tend to start off with something short and simple and then just continue to type 😂😂... It was gonna just be a 2 sentence reply, but I kept on adding stories and random pieces of advice, so I guess here we are...\n\nYeah, I really get the out of nowhere thing. Anxiety really creeps up on you, and you don't realize you have it until it has developed so much, you're missing the ability to even crack a smile. I've spent the lowest points if my life crying on the shower floor and I didn't even understand why I was crying and panicking. That was definitely the most frustrating thing about it all: not knowing why it was happening, and not even getting a warning. And, trying to figure out where it came from definitely felt like trying to find the end of a circle.\n\nIt's okay to not be able to understand what happening, though. It's extremely frustrating, but it's something we can't control. I feel like lack of control was a big deal when it came to anxiety (especially for me, since I'd worry about things I would never be able to control), and slowly taking back control of my life through things that I could control really helped me out. Something from as little as making my own dinner or planning out my day really helped me out and made me feel like I was ruling over my own life again.\n\nI feel like a good way to tackle anxiety is figuring out what worries you and then being able to control that worry. Also, taking to anyone about it is really important. I know it's cliche, but know that by anyone, I mean ANYONE. Talking to yourself or even a god damn stuffed toy genuinely helps. I was too afraid to tell friends I'd see every day, so I told two friends whom rarely get to see because of where we all live. And it too courage to even tell them, courage I had to build up by reciting what to tell them for weeks.", "permalink": "/r/happy/comments/coswp8/ive_hit_seven_months_without_a_single_panic/ewqfn88/"}