{"id": "t5_2qh5i_t3_coswp8_t1_ewtryel", "creation": 1565752593, "origin": "t5_2qh5i_t3_coswp8", "height": 1, "replied_to": "t5_2qh5i_t3_coswp8", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "poppyfield_76", "text": "Now that you mention it, I do remember the confusion heart palpitations brought me. I remember researching it and seeing what could cause my quick and heavy heart beats, and I saw all these serious medical problems. I would go through the list and try to think about whether or not I had the condition on the list... Of course, I doubted stress or anxiety as a factor and instantly threw it out the window, since I didn't want to be \"problematic\". For a while, I believed it may have been high blood pressure, even though I've suffered from low blood pressure half my life.\n\nAs for the showers, you also experienced it? I always felt so scared to tell people that, because I was afraid of judgement... Yet, it was the scariest and worst part of my day, during the time my anxiety was bad. Of course it was something I knew I had to do, and I purposely took showers in the more sounds proof shower we have, just so people couldn't hear me cry. I'd also time them so I could take showers while I was mostly home alone or I knew I had time, because no matter how much I wanted to leave the shower asap, I knew I'd be stuck sitting on the shower floor with a panic attack for a good while. Talking about panic attacks, I always hated how I always got them in the shower-- a small, confined, area-- yet panic attacks made me feel like I needed space and to walk around, but I couldn't just step out because my legs wouldn't move and I can't get out the shower because I would be in the middle of taking it...\n\nIt feels really nice talking with someone who's gonna through the same things, or at least SOME of the same stuff... Anxiety had always made me feel like the odd one out, and I would always feel emotionally alone and distanced from everyone because I felt like no one could relate... As in I felt strange about all the stuff anxiety made me feel and do and I always believed it was someone only I was weird enough to feel or do through anxiety.\n\nAlso, if you ever want to message me about this sort of stuff, know I'm always open :) I'm still struggling with figuring out how Reddit works, but I'm pretty sure DMs are a thing, right? Sometimes, like today, it'll take me a while day to reply, and sometimes it will take me a few minutes to an hour... but either way, I'll always end up reading everything and replying.", "permalink": "/r/happy/comments/coswp8/ive_hit_seven_months_without_a_single_panic/ewtryel/"}