{"id": "t5_2tand_t3_71spvo_t1_dns3smu", "creation": 1506904501, "origin": "t5_2tand_t3_71spvo", "height": 1, "replied_to": "t5_2tand_t3_71spvo", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "womanopoly", "text": "Man, I can totally relate. I quit snapchat years ago and technically still have instagram but I only post about once a month and it's usually something funny I found on reddit. I'm a recovering alcoholic, and occasional drug user. It took me years to find the balance but I managed to take back my life. \n\nOne of the biggest reasons I distanced myself from social media (besides the obvious privacy concerns) was that I'm impulsive and overthink things WAY TOO MUCH. For instance, I used to post a lot about my depression or post things to make people laugh. The problem was I would think about that post all day and get anxiety from it. With a ton of self reflection I realized that social media was to blame for my constant anxiety and panic attacks. I had an epiphany one day: I've never had anxiety over a post I didn't post. \n\nNow social media is just as addictive as any drug. You see everyone constantly starring at their phones in public. Now the way I quit drinking was to distance myself from it. Out of sight, out of mind. So when I was struggling with the social media addiction, I applied the same principle. I literally downgraded from an LG G5 to a Blackberry Bold haha. And yes if you're wondering it was a burner phone my drug dealer friend gave me haha. I can't send or receive picture messages, can't see emoticons, only basic sms and calling. Obviously, it is a pain i in the ass sometimes, the camera is shit. But it was what I had to do to regain a balance in my life. \n\nI still have facebook just so I can communicate with people, however, there is not a single picture of me personally on it. \n\nJust these small changes in my life changed me from being Tweak from southpark to Matthew McConaughey in Dazed and Confused. \n\nSo glad to see you taking back control!", "permalink": "/r/DecidingToBeBetter/comments/71spvo/i_quit_snapchat_two_years_ago_earlier_this_week_i/dns3smu/"}