{"id": "t5_2tand_t3_qa9mld_t1_hh3qqlz", "creation": 1634562144, "origin": "t5_2tand_t3_qa9mld", "height": 1, "replied_to": "t5_2tand_t3_qa9mld", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "runningdmc", "text": "This is amazing.  I used to teach. Not o-chem, lol. But, (high school) kids would tell me their dreams. I was shocked at how many times people (teachers, parents) told them to find a new dream. Two things: \n\n  \n1. A lot of kids didn't know the possibilities outside of \"doctor\" \"lawyer\" etc... common jobs. Or\n\n2. A lot didn't know what it took to get to those big dream jobs or what the day-to-day was like in those careers. \n\nMy philosophy. Never, ever say no. Always say yes, and outline the path. Even the hard one. \n\n* \"Yes. You can, but you need to ramp up that science grade.\" \n* \"Yes, you can, but you dug a hole during high school, so you've got to take a year or two resetting your GPA at community college--100% prepping for the tests.  \n* \"You're a straight-F student with an amazing business plan and drive. I'd hire you. But maybe take \\*\\*one\\*\\* business math course. People will steal from you.\" (they did, and they grew giant businesses). \n*  Class-skipping seniors who were told they'd be a failure? I skyped their behinds into class (before virtual learning was allowed). One called me up this year and said, \"Miss, wanna see my Tesla?\"  \n* Even one actor who I said, \"You should leave that (factory) job and act.\" Few years later, he texted me a picture of himself with a legend of a Hollywood star.\n\nNever believe in no. Always: \"yes, here's how.\" Sometimes people weren't willing to take the harder path and changed paths--totally legit.  But \\*\\*never\\*\\*  \"no, you can't.\" Because you can. There are a million paths. \n\nAnd, I've found people who take the tougher path often end up being better in the end. \n\nYou didn't let challenges stop you. You appreciate your journey. When you meet a patient with a tough case no one has solved, or a real medical challenge, you'll be the doc to stick with that person.  You'll change lives. \n\nAnd that is gold. \n\nCongratulations on your journey and upcoming success u/SaiyanStrong117", "permalink": "/r/DecidingToBeBetter/comments/qa9mld/started_my_20s_with_a_18_gpa_and_homeless_ended/hh3qqlz/"}