{"id": "t5_2tand_t3_qelpzg_t1_hhu0ylt", "creation": 1635056992, "origin": "t5_2tand_t3_qelpzg", "height": 1, "replied_to": "t5_2tand_t3_qelpzg", "down_vote": 0, "up_vote": 71, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "UncleVoid", "text": "\nYou’ve spent what seems like a majority of your life surviving, not living and any survival scenario will show you the outcome is always to find the most amount of comfort in that moment just long enough to breath and rest before moving again. You’re constantly moving, you’re mind, your thoughts, your actions are going a million miles a minute probably replaying things you wish you did or should have done in the past. You see surviving should only be “in the moment” kind of reaction but in todays world most people are just trying to survive everyday. And it’s painful, that’s why we ease the pains with pills, booze, simple pleasures that will allow us to get more comfortable in surviving so we can rest. So stop resting, I mean a complete jumpstart back into what life felt like before the influence of drugs and temptation. Typically your Brain will balance itself out but that takes years and years, and we don’t have that kind of time. So there’s things we can do to speed it up. First of all, fight your battles and slay your demons. Do whatever you gotta do to kill that part of you that won’t let go and I mean bury it and never think about it again. Whatever happened is the past, forget about it because it’s forgot about you. Now stop trying to tackle everything at once, you’re here for the marathon, not the sprint. Everyday do something that’ll make you uncomfortable, something that makes your heart rate go up and down naturally. Take cold showers, be vulnerable to someone, take up an extreme sport or anything you deem edgy and gives you a spark of life you needed naturally. Pick up old hobbies, or reconnect with old friends, you’ll need support through this. Not everyday you’ll feel great or happy so force it if you have to at first because it won’t take long to living the life you intended instead of thinking about it.", "permalink": "/r/DecidingToBeBetter/comments/qelpzg/i_am_22_and_wasted_much_of_my_youth_what_should_i/hhu0ylt/"}