{"id": "t5_2tand_t3_qelpzg_t1_hhv935a", "creation": 1635087561, "origin": "t5_2tand_t3_qelpzg", "height": 1, "replied_to": "t5_2tand_t3_qelpzg", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Yukfinn", "text": "I'm a 30 year old who at 22 just started doing drugs, I spent 4 years on painkillers, 2 years on heroin and benzos, ended up doing months in jail, racking up 45,000 in debt, lost my girlfriend, alienated myself from my family and was homeless at 26. I'm not trying to toot my own horn but I'm a smart individual, I've always been curious and creative and compassionate and have had many friends who are productive and supportive and appreciate me as a human being, but due to the nature of my upbringing, I lost my father early, was abused, got sent away to programs where I was abused and alienated from my friends and family, all of these experienced just fucked me up and I had no idea how to deal with it so I just used drugs and partied and fucked off on my phone and isolated myself and blamed the world until I lost everything. You're young, if I could go back to 22 and start over I would gladly give extremities, like fuck, even take an eye, but that being said at 31 I'm happier than I've ever been. It's never too late to turn around. I got into therapy (I went through a couple therapists before I found the right one), I started taking life seriously, I slowed down, I journalled, I meditated, I got creative outlets, I learned to appreciate the life I have left, and now I'm back in school, I'm doing research at ivy league schools, I'm designing trauma curriculums for a state prison, I've worked as a crises counselor for homeless youth, all of these experienced have allowed me to give meaning to my suffering and have given me hope for the future and allowed me to help others. It sounds like you've been through a lot and more than anything you need to have compassion and understanding for yourself, and also know that your road to recovery isn't linear, you'll have good days and bad, you'll get clean and relapse, you might spend a week in your bed depressed, but just love yourself and understand you're trying your best, just take it a day at a time because you really are a survivor.", "permalink": "/r/DecidingToBeBetter/comments/qelpzg/i_am_22_and_wasted_much_of_my_youth_what_should_i/hhv935a/"}