{"id": "t5_2tand_t3_qelpzg_t1_hhwyqdy", "creation": 1635113083, "origin": "t5_2tand_t3_qelpzg", "height": 1, "replied_to": "t5_2tand_t3_qelpzg", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "0nemorelight", "text": "Between around the ages of 19 and 22 I was so deep into addiction, much like you, whilst at university. I was depressed, anxious, suicidal. I remember OD'ing, more than once, and it sort of became a regular thing for me to black out for days. I remember very little of this time period, and what I do remember is hospital visits, losing friends, a couple of suicide attempts, almost being admitted to impatient care, collapsing at work several times, collapsing at university, collapsing in mcdonalds, collapsing in the middle of a busy junction.. I was a mess.\n\nBut you know what, you're not too far gone. You've decided to be better and that's the first step, you know you have a problem and you want to do something about it. As did I, eventually, when I realised how broken hearted my parents were, they thought I'd die there. I had to do something. \n\nIt took me some time, a couple relapses, a lot of patience and setbacks. I lost my job when I just stopped going into work (and uni) and opted to spend days in my room high on drugs. I was on benefits for a while and living back at my parents, unambitious and afraid, but willing to do and be better, as you are.\n\nI'm now in long term employment whilst doing a degree in something I care about and that will help people that have gone through the shit I have. I am getting on for 3 years clean from drugs and my parents are finally proud of me. I live apart from them and this time, I'm actually looking after myself. You can too. I have all the faith in the world that you can turn your life around! \n\nAll the best of luck, keep your chin up. Don't be afraid to ask for help. Some people work well in a program, I got clean on my own and with the help of my parents and by talking to a few people, but ultimately it is your decision and willpower that will get you off them.", "permalink": "/r/DecidingToBeBetter/comments/qelpzg/i_am_22_and_wasted_much_of_my_youth_what_should_i/hhwyqdy/"}