{"id": "t5_2tand_t3_qelpzg_t1_hhvnd4y", "creation": 1635093675, "origin": "t5_2tand_t3_qelpzg", "height": 1, "replied_to": "t5_2tand_t3_qelpzg", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "rmom1017", "text": "At some point in all of this thing I’ve called life, I thought I had to be moving, working towards something. I didn’t know what. But I was gonna get it. I’ve never found it. I got a life you wouldn’t imagine. I’m privileged and happy and fulfilled. But here I am commenting on some damn stranger’s Reddit. None. Of. This. Life. Makes. Sense. I have no advice for you except forgive yourself for it all bc you are the only person you have to answer to when you die. Find love that makes you feel warm. That doesn’t make sense but it will when you find that love that makes you warm. I know that drugs make you think you know what love is but they don’t. Love makes you wake up one day wishing above all wishes that this poor bastard on the internet feels as happy as you but they don’t and that eats you up. I love you stranger, and I hope you find that love too.\n\nReal quick before I forget: don’t take this the wrong way but stand up and give yourself a round of applause. Just for making it to this very moment. That takes a lot. It’s more than so many have accomplished, including your poor smart probably beautiful doctor mother. How many of us wish we were a doctor? A lot! Well that didn’t work out the way you’d think for your mom right? (Please don’t think I’m disrespecting your mother) after this round of applause, remember to take a deep breath and be gentle with yourself for having to deal with all this bad bullshit, then take all of these other beautiful peoples advice and to find out what you wanna do!!! You got it!", "permalink": "/r/DecidingToBeBetter/comments/qelpzg/i_am_22_and_wasted_much_of_my_youth_what_should_i/hhvnd4y/"}