{"id": "t5_2tand_t3_qelpzg_t1_hhzuort", "creation": 1635175877, "origin": "t5_2tand_t3_qelpzg", "height": 1, "replied_to": "t5_2tand_t3_qelpzg", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Cherry_slushx", "text": "We lived very different lives, but we ended up in the same place. I felt that my childhood was wasted also. I wasn’t allowed to be a child so I turned to drugs and alcohol trying to chase whatever childhood I could have in my teenage years. But the thing is, im never gonna get that time back. And neither are you. Those years are gone. But that doesn’t mean they were wasted. They brought you here didn’t they? All those years of hardship brought you here to this moment, where you can change your life for the better. But the thing is, you can’t replace one vice with another. Because as long as you’re still looking for something to help you escape reality, you’re never gonna find JOY in reality. I can’t tell you what to do from here. But I can tell you that even having the desire to get better is an accomplishment. I think you should check into a rehab to help you kick those drugs, you can’t do it alone, trust me I didn’t. And the sooner you get started, the more time you’ll have to find things in life that bring you joy. I’m still depressed and I take meds to help me deal with the shit in my head. But I’ve come so far in a year and a half. I still have moments where I question if any of it was worth it, but I also have days where I convince myself to get up and go to a party and I have a great time! Like I said, I can’t tell you where to go from here. But here’s what you can expect. It’s gonna be so fucking hard. You’re gonna have days where you wish for death because it’s easier than this. You’re gonna have days where you relapse, but those days don’t mean you’re not in recovery. U know what those days tell you? Those days tell you that you’re working so hard to change the way your brain clings to negativity and you’re WINNING. In those moments, ur brain fights back because it doesn’t like change. Our brains like to form habits and stick to them, because changing is hard. It’s so fucking hard. But I can’t even describe in words just how worth it it is to be able to genuinely enjoy waking up in the morning, the simple happiness of being able to go the gym and do basic things like brush your teeth without it being a constant battle. You’ve wasted nothing, because those years taught you a valuable lesson. And now it’s up to you to decide what to do with it. We can’t give you an answer, we can’t show you a path to take. YOU have to forge one on your own, because this is YOUR recovery, and no one else’s ❤️", "permalink": "/r/DecidingToBeBetter/comments/qelpzg/i_am_22_and_wasted_much_of_my_youth_what_should_i/hhzuort/"}