{"id": "t5_2tand_t3_ep35hs_t1_feh6j42", "creation": 1579110180, "origin": "t5_2tand_t3_ep35hs", "height": 1, "replied_to": "t5_2tand_t3_ep35hs", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I know how this can be.  I have been sober for 39 days today and have made massive life changes. Gym daily, and looking to help children that have broken homes.  Everyday i fight my own brains anxiety and depression. Therapy helps, but i also have to stay committed to myself and learn how to change my thought process.\n\nAll my closest friends just want to drink, do coke when its easy to get, and talk about football.  We are all in early 30's no one has kids, and half of us have a significant other (4 out of 9). The first time i told them i was not drinking they saw it as a joke. Like some challenge to get me to give in.  But for once in my life i finally have some confidence in my abilities and a massive desire to be the person i know i can be.  I did not drink.  about a week after they joked about it and joked about getting me hammered on my friends bday last week.\n\nWell, i am trying to be the person i know i can be. Part of that is honesty to myself, and others where needed.  These guys are supposed to be my friends so they should be there for me, to help me.  I got fucking real on them a few days before the bday. I drew my land in the sand, and if you were not with me, then you were against me.  I admitted to being an addict and an alcoholic. And that i am in recovery for my sanity and that staying clean is not an option, its a necessity. If they cannot handle that than tell me directly, and if the pressuring me to make bad decisions is going to happen i will walk away immediately.  No fucking around, no second chances.\n\nI did not get any pressure on the weekend.  Friends were a bit more quiet and reserved talking to me, but this is all new to them too. They also need time to adjust to who i am now.\n\nMy point is, if you are really serious about being a better you, you must draw your line and absolutely stick to it. Even if you have always given in before, now is the time to change that. Be a man of your word. Those that really love you will be there for you.", "permalink": "/r/DecidingToBeBetter/comments/ep35hs/i_removed_myself_from_the_group_chat_of_my_oldest/feh6j42/"}