{"id": "t5_2qh5i_t3_6l94g1_t1_dk0gbm5", "creation": 1499657514, "origin": "t5_2qh5i_t3_6l94g1", "height": 1, "replied_to": "t5_2qh5i_t3_6l94g1", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "badbrownie", "text": "Interesting question!  Made me pause and ponder.\n\nI don't think so.  I don't think he's good at understanding complex concepts and nuanced lessons because I taught him anything in particular.  But perhaps it's because my communication style has always been whatever is the opposite of Because-I-Said-So.\n\nAt the risk of getting judged for going racial, I heard somewhere that Jews are great debaters because of the familial and religious Jewish traditions of analysis and debate.  I can't speak to the truth of it, but I think that's a great tradition and seek to represent it.  I tell my son, I'm not always right, but I know why I think the things I think, and you should too.\n\nThe truth is though, that he turned away from his parents when he started on the puberty.  Sulky and surly and disengaged and lazy.  All the fucking boxex were checked.  But one day I confronted him about it all and I don't recall everything I said but I do remember I said this \n\n\"I've not given up on you.  But I can imagine giving up on you.  That's where you've taken me.  And I'm still here, shaking you and saying No More, but it scares me that there's a part of me that can imagine giving up on believing that I can reach you and help change you\"\n\nIt was all a bit melodramatic but it turned out that it reached him.  Made him upset and break down a little (as did I) and I suppose that's the essence of it.  I begged him to not let our relationship go down the path it was heading and he heard me and stopped. \n \nSince then it's been night and day.  That was 4 months ago.  2 months ago we had another come-to-jesus about his behaviors and his duties and since then he's blossomed.  He didn't get defensive and decide it was more comfortable to shut me out.  He honestly confronted my ideas and transformed himself.  As you can imagine, I can't take too much credit for that.\n\nRight at this very moment, he's cleaning up the dishes from a mini-party we had.  I asked him to do it earlier and he said he would and now he's gotten to it, long before I started worrying I needed to remind him.\n\nSo - I suppose that for the most part I've got to say I'm lucky and grateful and he's the sole owner of the credit for who he's becoming.  He's not 'safe' yet.  His instincts are still lazy.  But he's taught me what the phrase Respect Yourself really means.  It means, be what you admire.  \n\nThanks for asking!  It's good for me to remember how lucky I am.", "permalink": "/r/happy/comments/6l94g1/my_wife_and_son/dk0gbm5/"}