{"id": "t5_2tand_t3_1ssvz9_t1_ce14ga6", "creation": 1386971183, "origin": "t5_2tand_t3_1ssvz9", "height": 1, "replied_to": "t5_2tand_t3_1ssvz9", "down_vote": 0, "up_vote": 14, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PartyGirl_or_CEO", "text": "**Can confirm.** \n\nMe=22 year old female, senior in college, rediculously social human being. Lover of good times, raging parties, maintaining a large group of friends and accumulating new experiences.\n\n~~Deactivating Facebook~~ *I mean deleting my Facebook applications. I have enough self control to avoid jumping onto Facebook when I sit down at a computer. Apparently some people do not. I was unaware. I hope you find the help you need or whatever. Damn.* Anyway... Deleting Facebook from my devices forces friends to actually put effort into contacting me. As a result I only hear about important shit. I am completely unaware of minor issues between my friends. **I love this.** I only get invited to things by people who *really* want me to be there, thus I do not feel guilty for not showing up to 'support' my 45+ friends who dj or have bands. If they don't need me there enough to call or ask in person, I no longer feel the need to go.\n\nMy life is less cluttered. I have less secondary social obligations pulling me in different directions. I am less prone to weigh myself against the perfected versions of themselves that my friends post. I don't dress for events with the mindset that I need to not only look good, but also photograph well (while drunk at 2 am after dancing for 6 hours?! Fuck that.) I don't waste moments of my precious existence wondering if I need a new profile picture.\n\nI actually have lengthy phone conversations again (it's so 90s!!). I've taken to stocking my kitchen with snacks and drinks because now **MY FRIENDS DROP BY MY APARTMENT WHEN THEY'RE IN THE NEIGHBORHOOD.** Seriously dude, it happens. We have spontaneous, wonderful times IN REAL LIFE. I don't feel pressured to contact  everyone I know and invite them too, because there's no Facebook event chronicling who came over. I have personal moments exclusive to the people involved in them. \n\n**Tl;Dr** I love Facebook, I find it very useful. However, reducing my use to once/twice a month (yes, I'm serious) has radically improved my satisfaction with my social life. YMMV (read: This works for me, I don't care if it works for you.) ", "permalink": "/r/DecidingToBeBetter/comments/1ssvz9/facebook_use_makes_people_feel_worse_about/ce14ga6/"}