{"id": "t5_2tand_t3_q4cvl4_t1_hg4vion", "creation": 1633891934, "origin": "t5_2tand_t3_q4cvl4", "height": 1, "replied_to": "t5_2tand_t3_q4cvl4", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "RealPrinceZuko", "text": "I'm going to be honest with you because you need it. Based on your post, and your actions of jumping into another relationship immediately, I'm going to say that you haven't taken the time to properly learn and grow from your mistakes. It's one thing to think at a surface intellectual level of \"damn, I really hurt that person\", but it's a completely different (and necessary) action to really look deep inside yourself and find out why you hurt them, why did you behave/react that way, what were you feeling, and what your beliefs are. Doing this is necessary for change.\n\nI'm happy that you realize you want to be a better partner/person, that's awesome and is the first step. However, I am nervous for your current relationship, because you haven't looked at yourself deep enough. It requires a lot of introspective work, and an open mind. You can make it work, but you absolutely 100% need to get into therapy and have someone help you sort through you thoughts and beliefs. Your thoughts and actions are the only thing we can truly control in this world, so it pays dividends to really master that.\n\nOne last thing regarding contacting someone. Before you reach out to apologize, ask yourself: \"am I really doing this because I think it will make the other person feel better, or am I only doing it to help me release guilt and shame I've been holding on to?\" More often than not regarding ex's, it's the latter. Just be completely honest with yourself. Look at the situation from an observer/third person perspective. We can't change the past, but we can change the person in the mirror. It starts with the right mindset, and doing the right thing. Take care, feel free to reach out if you want to talk more.", "permalink": "/r/DecidingToBeBetter/comments/q4cvl4/i_have_a_long_string_of_relationships_behind_me/hg4vion/"}