{"id": "t5_2tand_t3_qdxqou_t1_hhtlvty", "creation": 1635047076, "origin": "t5_2tand_t3_qdxqou", "height": 1, "replied_to": "t5_2tand_t3_qdxqou", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "juepipa", "text": "If there is anything that defines depression is your post right here. I went through the same hell not long ago. Even though I feel much better now I do not feel cured by now. Let me give you some heartfelt advice from someone who’s been there: (alongside going to the doctor, which I understand you went but are not happy with the way he’s handling your case. Worst case, you’ll tell him how you feel and that is making your life and day to day actions completely impossible. The right medication will balance the chemicals in your brain and that’s always the first step towards being more functional. Think of your brain as “diabetic”, and it need its insulin. If you broke an arm you’d go to the doctor too if it hurt like crazy! Treat your brain like a regular part of your body that can get sick too)\n- try to be in the sun. I read that your country is not that safe, so you must also have anxiety and going outside might be too much rn. Just open a window and let the fresh air inside. Being in the sun was a complete game changer for me and you’ll feel better just after some short 10 mins!\n- get a physical exam. You might seriously be lacking vitamin b complex and that makes you DEPRESSED AF (trust me me, I know!)\nSupplements: \nomega 3 ( protects the brain, balances out hormones), \nZMA (take it before you go to bed, most people lack zinc and magnesium in their meals and it makes a HUGE difference in your sleep quality)\n\nI personally also started to watch a lot of Jordan Peterson. It’s amazing how ideas might help you recover and change your thought processes about some things. He really motivated me and help me through my toughest times, as I don’t really have a family that believes in mental illness (they are so afraid of their own vulnerability that they couldn’t face my own depression and I don’t judge. Just make sure you have someone who inspires you and gives you advice on day to day things that might be absolute game changers!)\n\nSorry for long post OP. I just wanted to tell you exactly what I would tell if someone I loved had depression. And it is not your fault. You are sick. Of course, you learn a lot when you “low” and in the future you will respect yourself a bit more because you don’t want to relapse. But please believe that you are sick and there is nothing to be ashamed of.\nTake it easy, sleep and drink lots of water. And remember, first step: a little sun does wonders.", "permalink": "/r/DecidingToBeBetter/comments/qdxqou/my_depression_has_gotten_worse_now_im_too_weak_to/hhtlvty/"}