{"id": "t5_2tand_t3_miclmc_t1_gt4avls", "creation": 1617347037, "origin": "t5_2tand_t3_miclmc", "height": 1, "replied_to": "t5_2tand_t3_miclmc", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "joonimo", "text": "It is awesome to hear that you had a solid day! When I read what you've written here, what I see is a lot of really great growth and personal reflection. It is VERY easy to do what you mention when things go awry -- to fall back into old patterns and to self-isolate. \n\nIt sounds irrational, but something I've found to be really important is to challenge yourself when you feel like you might as well curl up in a ball, ruminate on the past, and remove yourself from friendships and your community. It's precisely in those moments that it's really important to seek support, not only for your own well-being, but for the well-being of those around you. Seeking therapy is such a terrific step, and I hope it's one you continue to leverage (even when it feels like you don't need it as much, and even if you feel like you don't deserve it). \n\nWhen it comes to managing strong emotions and letting them pass, I like to gently consider a few questions:\n\n* Is this emotion, or this thought, bringing me closer to who I want to be?\n* Is this emotion, or this thought, helping me be present for myself and for the people I care about?\n* What will help me be safe in this moment?\n\nAnd maybe a few affirmations, too, to start the day. What are your values today? How will you give yourself room to grow and change today? How will you celebrate your growth and build connections with the people you care about? I find that these kinds of questions help me stay present, and foster a sense of \"I am a person with potential.\" \n\nPracticing detachment can also really help. It can be really hard to respond to things mindfully as they come up, so if it ever feels like too much or if it feels like you're getting really upset or angry, it never hurts to take a step back and remove yourself from the situation. Giving yourself time to cool off can be a real gift! \n\nWhen you find yourself feeling down on yourself, please remember all the great progress you've made and all the ways you're growing in your relationship with yourself and with the world. Not everyone in your path will be able to see your growth journey, but some will, and you will - and IMO, a person committed to healing and growth is something to celebrate. We all mess up in different ways, but we all have a place in the world that we get to define every day. Keep going and thank you for committing to being the best you - it'll have a positive ripple effect on the world around you!", "permalink": "/r/DecidingToBeBetter/comments/miclmc/how_do_i_become_able_to_fully_feel_and_express/gt4avls/"}