{"id": "t5_2tand_t3_q8lxtz_t1_hgs5c91", "creation": 1634329206, "origin": "t5_2tand_t3_q8lxtz", "height": 1, "replied_to": "t5_2tand_t3_q8lxtz", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CopperPegasus", "text": "What advice would support you right now?\n\n&#x200B;\n\nI can toss some general stuff out there (and I'm sure other great posts will happen). But if there's something specific you know you need, please do tell us.\n\nNow what I can tell you is:\n\n\\- You do not have to characterize your experience through other people's lenses. If you, on some peaceful and steady reflection on the situation, do not feel like a victim of assault, you do not have to be one or characterize your experience as such because other's tell you so. If, on the same reflection you do, then you can. You are the person who is allowed to say what you experienced, regardless of other people's experiences. Do not let others bully you EITHER way. They can mean well and still be wrong.\n\n\\- However, know that there is nothing good about encouraging overuse of recreational drugs and pushing sexual boundaries with a partner. Nothing at all. Your ex is, at the very least, a scumbag.\n\n\\- Try to understand that everyone does have different boundaries and may interpret your experiences differently to how you do. They generally mean well and it's worth listening to their opinion, but yours (of what happened to you and your body) will always matter more.\n\n\\- That said, be open to the idea that you deserve to be treated incredibly well by any sex partner and if that did not occur, do not assume the guilt, or shame, or anything. YOU DESERVE TO BE TREATED WELL AS A SEX PARTNER AND BY ONE. Your previous experience, abilities, boundaries, personality etc do not change that.  You can withdraw consent at any time- previous activities do not matter. Good partners do not push limits. No is unambiguous.\n\n\\- If necessary, let a professional help you untangle what you are feeling. They have experience untangling these things. You do not have to figure everything out alone. There are also anonymous support sites etc for women in a similar boat.\n\n\\- It does not matter if someone had a worse experience. your experience is still valid. We all stand together in this, there is not a hierarchy of acceptable pain.\n\n\\- You can decide you were a victim of sexual assault and not report him. They are not mutually inclusive. It would be great if that's a road you feel up to walking, but the system is not always good to women. You do not have to fight that fight unless you feel up to it.\n\nThat's about you. Now about the situation.\n\n\\- Try to accept that this is not a good man. Don't let yourself spiral into blaming yourself or other victims. He and he alone is responsible for things he has done, how they are perceived, what people are doing about it, and so on.\n\n\\-Try to distance yourself from the rumor/gossip mill here regardless of if you find something to report and decide to or not. You do not have to partake in rumor and gossip about this matter to 'earn' victim status nor 'support' other victims nor explain to the curious and the gossipy. You own no one explanations. You owe yourself peace.\n\n\\- You are not obliged to support the other victim emotionally here. That offer was a sweet gesture, but you are not a trained mental health professional and this could also go wrong and be harmful for either or both of you. If you have space to empathize and listen and let her tell her story, that could be useful. If it starts impacting your mental health, or you feel obliged to defend/explain his actions, or you just want 'tea'. step back. You are not obliged to act as support system for someone else to 'atone' for having been in a relationship with this piece of cr\\*p and you have NO right to mine someone else's trauma for gossip.\n\n\\- In fact, step back from all of this until and unless you can cope with it. It's not your problem to solve or worry about. This person is nothing to you right now. You are, at most, a victim and need only engage with the law as far as you wish and no one else unless you choose and feel safe. You do not need to be a participant further for any reason except 'I want to be and it will help me heal'. It's not your problem and your actions can't fix any of it.\n\n\\- Processing emotions is messy. You could be fine now, a wreck in a year, and perfect ever after. There is no prescribed path of recovery you have to follow.", "permalink": "/r/DecidingToBeBetter/comments/q8lxtz/my_exboyfriend_has_been_accused_of_assaulting/hgs5c91/"}