{"id": "t5_2tand_t3_n7y2hv_t1_gxgfrw4", "creation": 1620528087, "origin": "t5_2tand_t3_n7y2hv", "height": 1, "replied_to": "t5_2tand_t3_n7y2hv", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Fabulous-Advantage", "text": "Thanks for writing that out. \n\nTotally relate to the 'food phobia' and gag reflex things. I would still go to those work functions, I would just nibble away and not really eat.\n\nI'm 21 and I couldn't take it at 19. I did my best to try but maybe I didn't have the time or determination to commit given I was balancing a more-than-packed schedule and preferred to just cope with eating like I did all my childhood then throw life into chaos by trying to cope. And oh yeah, I had to pay for it too and my parents strongly opposed it so there were big family issues going on too. \n\nI'm going to try again soon when I start my job. I never got around to CBT. I was always too busy sharing all my issues from the past, I wanted the professional to understand and validate before I was going to do CBT. It most likely is a mind thing and I'm glad/surprised 7 sessions made such a difference for you.\n\nThanks for reiterating I'm not alone, I can see one or two people who seem to share similar issues is my guess. But what is most annoying is those who assume I don't have an issue that is so disabling. Like asking why I'm so small (I'm not anymore, when I'm lifting weights and I see how I'm pushing up more than my bodyweight and that I didn't eat enough before this but I would eat again after. ) Or assuming I'm lazy when I don't have energy or telling me if I eat more I would feel hungrier.  \n\n\\~ I know exactly how debilitating it is and how completely isolated it makes you feel.  \n\nYes and as a man, even more so. \n\nI wish it were that easy, honestly. I will definitely look into this again with a more long-term professional after I get my first job. It may be a little beyond just anxiety with others as I have this trouble alone too. And I am sure there are many root causes, as in my previous therapy this wasn't even the important issue that was being discussed. \n\nAnd I understand that you wrote a lot and not all of it relates and I appreciate the comment.", "permalink": "/r/DecidingToBeBetter/comments/n7y2hv/my_issues_with_eating_isolated_me_tw_eating/gxgfrw4/"}