{"id": "t5_2tand_t3_n7y2hv_t1_gxfxu0l", "creation": 1620518209, "origin": "t5_2tand_t3_n7y2hv", "height": 1, "replied_to": "t5_2tand_t3_n7y2hv", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "LMichele1232", "text": "I’m not sure if this will be helpful or not but just in case any of this resonates with you, I’m happy to share it. It will be long so I’m sorry about that, but it’s just to lay it all out in case any of it sounds familiar.\n\nSomewhere in my childhood, I developed some weird food thing. It came in several parts: \n\n1) I didn’t want to eat with other people (or be seen eating) apart from with my immediate family. This meant I would throw away lunches my mom made for me at school and not eat during lunch... for at least 8 years (my poor Mom had no idea!!) At social events or family functions, people would see me not eating and the ‘oh come on’ or ‘you must be hungry’ or ‘just try this’ would start. I was put in the spotlight with people pressuring me in the middle (I was shy and did NOT like being the centre of attention). This carried on into adulthood and affected things like potential work lunch or dinner functions.\n\n2) In combination with the above, and perhaps in part caused by the trauma of people trying to pressure me to eat, I also conveniently developed food phobias. Anything that was familiar (chicken breast, spaghetti, meatloaf, pizza, etc) was fine... but ONLY if cooked by my grandmother (she was the cook in our house). Anything unfamiliar or that I was not used to eating (salad, fish, every single vegetable, milk, most meats, etc) became a phobia trigger. If I somehow managed to get one of these close enough to my mouth to taste, I would get an instant gag reaction and panic would set in and it all got very ugly, very quickly! This continued into adulthood and again... forget those work eating functions! NOT a good look! Oh, and limited options for small dinners with friends, eating at anyone else’s house, limited ‘safe’ restaurants etc. \n\nAt around 30 I couldn’t take it anymore and started going for CBT (Cognitive Behavioural Therapy) to try to get to the bottom of it. Unfortunately this was cut short as something more pressing came up meaning I didn’t get to continue this for as long as I needed. But, just from the the 7 or so sessions I had, I can now eat lettuce, most vegetables (they’re still not my fav but I can try them with no gag reflex whatsoever), some meats other than chicken breast... you get the idea! At first I felt a bit silly with some of the exercises I had to do in therapy but to my absolute shock, they enabled me to realise my mind was triggering the gag reflex before anything even got near my mouth. \n\nNow, at 40, I can eat way more different things but more importantly, I’m more able to TRY different things (in my own time, in my own way, without any pressure from others) and confidently decide if I like them or not rather than my brain making that decision for me instantly. I’m not 100% and I still don’t love eating around people I don’t know well (still working on that in therapy as I think its root cause is deeper) but I can do it and ‘fit in’ as needed (unless it’s fish... can’t be doing with that!!!) My husband is a bloody angel and he not only safely introduces me to new foods in completely non-intimidating ways but he also has tricks to save me and make me feel safe and normal if we are in social situations where people get the slightest bit ‘ooooh try this!’ If I had never done the CBT, I never would have known how to communicate any of this weirdness to him and I never would have had the chance to work through this in my own way, with his help.\n\nAgain, I’m so sorry for the length of this comment but I just wanted you to know that you’re not alone in this (it can’t be just us with these types of blockers) - I know exactly how debilitating it is and how completely isolated it makes you feel. But also to suggest that if it is at all possible for you to look into CBT, it may really help to take the edge off this problem for you (and with more than my limited 7 sessions, should help you get to any other root causes that may be causing the anxiety from eating with others). I truly, truly hope you find a way to turn this around...and I’ll be rooting for you!", "permalink": "/r/DecidingToBeBetter/comments/n7y2hv/my_issues_with_eating_isolated_me_tw_eating/gxfxu0l/"}