{"id": "t5_2tand_t3_6ba27k_t1_dhky4iv", "creation": 1494853443, "origin": "t5_2tand_t3_6ba27k", "height": 1, "replied_to": "t5_2tand_t3_6ba27k", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "crosenblum", "text": "Trust me I understand where you are.\n\nNo rant, but just an honest sharing and asking for help, so no problems. Been where you are.\n\nFor some of us, there is no magic or guaranteed career.\n\nWe have to figure out what we're capable of, and what things that we can do, that bring most value to potential employers.\n\nIt's time for you to enroll in the School of Hard Knocks.\n\nSo let go of the career ideas for now.\n\nJust take a job, any job. \n\nBecause no matter how badly it may feel like unfit, those are the ones that will challenge you, and move you to grow and learn.\n\nIF, you have the right mind set.\n\nEveryjob has the potential to teach and learn and grow you, if you are perceptive to it, and look for it.\n\nI too have always felt like the odd one out.\n\nAnd honestly, most of that, in fact all of that is related to our perceptions of ourselves.\n\nNo your not sensing her interest or lack of interest, your not doing anything to get the interest.\n\nWhen your an introvert, there is a real danger in your attempt to protect yourself from pain, to keep pushing people away, and becoming more and more passive.\n\nCreating the mindset of doing little, but expecting much from others, and then doing nothing to earn or get others in giving to us any part of their lives.\n\nPassivity and Negative Mind Set are your greatest ENEMY!\n\nTrust me I know this enemy from decades of battle. DECADES.\n\nYou have a choice, you can keep waiting for life to get better, or start taking action, to change your mindset.\n\nIt's your perceptions that is a major reason why your not having much luck or happiness or success.\n\nThis is not the magic land, of doing little and great things come to you.\n\nIt requires lots of effort and action, and planning and preparation, and persistance.\n\nAnd no one but you can change that!\n\nSo how do you start change?\n\nEach week, once a week, look at your life, what part of your life do you want to change or improve?\n\nFor me, I pick Sunday, start think over different appointments, to do list, cleaning my house checklists, and start pick what I want to get done this week.\n\nI write it down, prioritize what is more important and what is less important.\n\nAny major change you want, break into small steps. \n\nReal success is gradual, from daily small steps, until you don't even see how much you've changed.\n\nYour also not alone, millions of people have the same issues.\n\nBut you must choose, and only you can choose.\n\nDo you start taking action now? Which will be very hard at first.\n\nOr stick to being passive, and angry at the world because your not getting what you feel you deserve.\n\nTrust me, no action + passive = YOU EARNED NOTHING!!!\n\nYou can do it, pick small goals, small to do list, every week, and just do 1 thing a day. \n\nAnd as you do  1 thing daily, start crossing off your to do list.\n\nThat is such a powerful feeling.\n\nTo know each day your moving forward and growing and learning in your life, small step by step.\n\nThere is an old saying.\n\n\"Step by step, walk the thousand mile walk\"\n-Miyomato Musashi, One of the world's greatest samurai and swordsmaster and philosophers\n-Wrote Go Rin No Sho, The Book of Five Rings.\n\nGo do it! Get your life and make it better!", "permalink": "/r/DecidingToBeBetter/comments/6ba27k/not_sure_what_to_do_i_need_help/dhky4iv/"}