{"id": "t5_2tand_t3_6ba27k_t1_dhru8dv", "creation": 1495211301, "origin": "t5_2tand_t3_6ba27k", "height": 1, "replied_to": "t5_2tand_t3_6ba27k", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "matavisser", "text": "I'm in the same boat. 4th year of university and I realized my negative, passive mindset has turned into awful social anxiety, and I've made NO friends. Makes me feel like shite bc my friends from high school all have new people around them, and I can't even connect with those people! It's like god throws me a line and I *snip* send it right back. But I decided to get a job just last year, barista work, and it's been all right. I had the same mentality as you about 9-5 jobs and put it off all through uni, but it has been a  valuable experience and just knowing that I do it, and getting that measly paycheck--it makes me feel more valuable to the world. It also forces me to socialize with coworkers and half of them aren't bad at all, they're all just young people like me who don't want to be there, but the difference is, they eat it up and do it.  Trust me I still get anxiety the night before going in for a shift, and my manager completely hates me because I guess I'm not talkative enough and don't try to eat her ass during our 7am shift (ffs), but that in itself has taught me that some people just won't like you. That's how earth works, people are here, and some won't like you. But you just gotta dip your toes in the water, right? \nI think you and I share many similar points of view. And that's terrifying because I feel paralyzed most days, and I'm a relatively attractive female, so it must be more difficult for you (assuming men get less sympathy from this shite world). But you just need to push yourself out of your mind. Once you're out of there and you're mingling with society, you'll realize there are people who aren't full blown superficialites. Or that it's not just that black and white, some people just don't pay attention to those types of things and may come across that way because they just aren't self-aware. But my advice would be to go out there and listen to others with compassion and an open-heart. Hear other's stories, make connections, just as you are doing on these forums. But with real flesh and blood. As someone who despised people and society, my biggest lesson was realizing it's what we lonely introverts crave so badly. Not all people are awful, and not all of them will agree 100% with you. But you'd be surprised, others are willing to listen and love you, if you show them you are willing to do the same. And that doesn't mean they're self-serving, egotistical asses, we're all alone and all we have in this giant universe of empty space and twirling spheres. We have to look out for ourselves and make sure the relationships we forge will better our lives, that's the point, right? Despite all that, humans still crave social interactions. We still want to share our dreams and fears with flesh bags like ourselves, and confirm that no, there's nothing to fear. We're not really all that alone. \nI think your worldview is important to society. Without people like you, who question the institutions before signing the slips, we'd all be no better than caged monkeys. I think you should direct that anger and doubt towards production: write, or record your thoughts. Make beautiful artwork. Run and scream in the rain, tire your body out, go home and dry off and phone up a friend to tell them what you've done. But don't direct it at your fellow man! Everyone's just trying their best ultimately, and you are too no doubt. Maybe I'm preaching to the choir, bc I still have trouble socializing. At school I don't even talk to my classmates because they're all too \"dumb\" for me to grace them with my sloppy, awkward small talk. And that's my loss. Because my friends from high school have all made valuable friends, so obviously I'm the common denominator 😅 but I know in my heart, we deserve friends and love too. We deserve all that we desire. But we have to put our feet forward first, and do most of the dirty work in order to get those things we want. I'm just starting to get my hands dirty, each grain of dirt is a lesson, each hand washing is sublime, I'm twice the woman I was last year because I've just fucking tried at it. Fuck the blueprint we see around us, there are others trapped in here too, so might as well make some organic love relationships while we're in here!!! Who knows, maybe you'll start a band, or a deep, philosophical circle of like minded folks. When you do, it will be because of YOU. \n\nThat was cathartic. Sorry for the word vomit, hope you can get something out of that.", "permalink": "/r/DecidingToBeBetter/comments/6ba27k/not_sure_what_to_do_i_need_help/dhru8dv/"}