{"id": "t5_2qh5i_t3_afyn3l_t1_ee3r5d5", "creation": 1547532737, "origin": "t5_2qh5i_t3_afyn3l", "height": 1, "replied_to": "t5_2qh5i_t3_afyn3l", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ajfunk27", "text": "Congrats man! Really happy to hear that!\n\nGood luck in college-\n\nGo to class. It honest to god helps. Don't make a habit of skipping. It's like half the battle. \n\nBuy textbooks anywhere but the bookstore (cough cough or torrent them cough cough)\n\nMake friends with the people sitting next to you just in case you miss or they miss. Good to get notes. \n\nHand write your notes, it's been proven it helps with test scores. \n\n\nAlso, as someone with office hours, please, if you need help, go to office hours. No one comes. If you can't make those (which is possible) professors are more than happy to schedule a meeting. Ask for help early, they can't help you at the end of the semester. Professors normally really want to help!\n\nRemember, there's gonna be hard days. One bad test grade isn't gonna screw everything up. You just gotta figure out what went wrong and fix it from there.\n\n\nYOU GOT THIS! I BELIEVE IN YOU!\n\nEdit: I just read you're doing counseling and substance abuse. I'm gonna be taking a class about that this semester. Interesting stuff, honestly. Good luck and as a fellow human sciences person (I'm doing stuff with cognitive/perception psych), a good psych tip is when you feel you're ready, try to help in a research lab. It's a great way to get connections with people already in your field. It's a great support network. Obviously, I wouldn't do this as you're still figuring out college, but once you get comfortable give it a go. Even before then, just talking to professors who work on your area of interest about said interests will be helpful with connections. Psych people are nerds and love to talk about their research areas. You don't even have to have a class with them yet. If you do approach them, be polite and just dress in not sweatpants. If you contact via email, be sure to put your name, classification, and reason for emailing. Always greet using Dr., especially if you're unsure. Just trust me on that. Regardless, good luck again! \n\nGo kick those classes asses!!", "permalink": "/r/happy/comments/afyn3l/200_days_drugs_free_today_on_my_way_to_my_first/ee3r5d5/"}