{"id": "t5_2tand_t3_qaxzhu_t1_hh61pgf", "creation": 1634598621, "origin": "t5_2tand_t3_qaxzhu", "height": 1, "replied_to": "t5_2tand_t3_qaxzhu", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "RealPrinceZuko", "text": "As a fellow 33 year old who is recovering from rock bottom, I can sympathize with you. I left my toxic company of 8 years (funny coincidence lol) late 2020. My wife told me shortly after that she was moving back to her home state, and wanted a divorce. We're still good friends, but it was so incredibly painful saying goodbye to her and our two dogs. I went to live with my mom, because I had no where else to go. I got there and decided I was going to take a few months off to mentally reset. I ended up finding a really great group of people through a mutual game. There was a woman in that group that always wanted to play with me. Everyday she would follow me into games. Against my better judgement, I jumped into a relationship with her when I knew I shouldn't of. I ended up hurting her in the end, and lost that entire community of friends I made. It's been a rough year to say the least.\n\nWas I hard on myself? Yes. Could I have handled things better? Absolutely. Did I do the best I could in that current moment? I did. I was broken, and in a really low point in my life. I know that everything I've been through is not a reflection of me as a person. I know who I am, I know the unique presence I bring to the world, just like you. Adversity is actually one of the best things that can happen to you. It turns you into the strongest version of yourself, and gets you one step closer to your higher self. As long as you look at it from a learning perspective instead of holding on to a victim mentality, you're going to do really great things in this world.\n\nSomething wonderful is always on the verge of happening. Feel free to reach out", "permalink": "/r/DecidingToBeBetter/comments/qaxzhu/feel_pathetic_trying_to_get_my_life_together/hh61pgf/"}