{"id": "t5_2tand_t3_ohjl4c_t1_h4qwfkr", "creation": 1625955511, "origin": "t5_2tand_t3_ohjl4c", "height": 1, "replied_to": "t5_2tand_t3_ohjl4c", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "KeyboardWarrior_2019", "text": "Hey dude! To be honest, I think it was just the thought of \"this doesn't feel right\" paired with my wedding happening later this year. Like I said, the \"shouldn't share\"/revenge porn/voyeur themed threads on 4chan we're the most taboo/morally questionable stuff I've looked at, so while the content shown wasn't necessarily out of the ordinary, the nature of how it was presented of not knowing the state of consent shared with them, it made me ask myself \"Is this something you want to carry with you into a marriage with the most important person in your life? What would she think?\". Pair that with my paranoia and \"what if\" scenarios cause by my OCD, it made it quite easy to make the cut.\n\nAnother huge thing I can't recommend enough (that's technically two pronged) but: if you can afford it and it's available to you, work with a professional therapist or psychologist. I don't know where you are in the world, but here in the US, our healthcare system is laughable at time and the insurance companies still don't fully invest in mental health resources. I'm someone with \"pretty great\" health insurance and it costs me almost $100 USD/session. At the same time though, it's invaluable having someone to talk to that is a third party and completely unbiased in your life, who can help assess what is actually causing the addictive traits in your life and how to correct it. Additionally, if you have someone in your life (spouse/partner/parent/friend etc) you feel comfortable talking to and be honest with them. Talk to them about your struggles. It's a hard bridge to cross, but once you do, you'll find that most people in nature will want to help you and just want you to be the best version of you as possible. I did/do both with therapy and talking to people close to me. My relationship with both my fiancee and my parents are super close and can talk to them about anything, so I'm lucky. And if you don't have that person in your life, groups like this, r/NoFap, and others are here for that exact reason. Everyone here is for the same thing: to kick this shit out of our lives (or at least in a manageable manner). Don't be afraid to lean into the community.\n\nSorry that was kinda long, I tend to ramble haha. And of course, feel free to DM me if you have anything you don't feel comfortable talking about in the thread, happy to be there for you, my dude! :)", "permalink": "/r/DecidingToBeBetter/comments/ohjl4c/decided_to_quit_consuming_porn_and_start_becoming/h4qwfkr/"}