{"id": "t5_2tand_t3_acuurv_t1_edb9f12", "creation": 1546709318, "origin": "t5_2tand_t3_acuurv", "height": 1, "replied_to": "t5_2tand_t3_acuurv", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "franticshouting", "text": "Thank you for the input! I'm happy to say I love my marriage. It's about as imperfect as any, but in ways that challenge me for the better. He's also a social introvert. We actually love being \"alone together\" and working on our projects/hobbies, doing housework. And I think being \"dragged\" (haha) out of the house for brunch some mornings is really good for me, so he makes me better in that way. I guess I'm just disappointed in myself, because I feel like I'm being selfish sometimes when my external vibe probably reflects my internal, private, and frankly stupid feeling of feeling \"coerced\" into doing things—albeit, only coerced by my own guilt. My husband knows I feel this way, and we've had tiny arguments about it, but I always conclude that I would never want him to stop trying to get me out of my head and out of the house, and that if I really, truly do not want to go, I'll tell him and he can be okay with that. As it is, he's compromised doing things like grocery runs together (he loves going together, I hate going to the grocery at all). \n\nSo, I think I'm pretty lucky in that regard, in that my husband and I are really very compatible, even in the ways in which we're different. Plus, I love him to pieces and he makes me happy.\n\nI definitely see your point though, and it gives me comfort knowing that this is all just a result of the fact that I know who I am and like who I am. I think what I need to really spend time practicing is just coming to a middle ground. I really can be too selfish with my time. I know being selfish with your time is healthy to an extent, but it's getting to a point where I feel like it's going to affect my relationships soon, and my mental health, if I don't make some adjustments. \n\nI think it's just hard, and I think furthermore, I feel alone, because I don't really know anyone going through something similar. My husband gets it in many ways, because he also really values his introverted \"project\" time, and being alone together, but he has quite a bit more drive to get out and get dressed, meanwhile I can stay in the same clothes for 2-3 days. (Gross, I know.) ", "permalink": "/r/DecidingToBeBetter/comments/acuurv/i_never_want_to_do_anything_and_i_feel_guilty/edb9f12/"}