{"id": "t5_2tand_t3_oa7k9m_t1_h3hhyzl", "creation": 1625001238, "origin": "t5_2tand_t3_oa7k9m", "height": 1, "replied_to": "t5_2tand_t3_oa7k9m", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "93PatronSaint", "text": "Hey there… just wanted to share a few songs that have helped me when I was and I *am* battling my demons… a lot of them are Korean songs by BTS lol but the messages  are universal especially their message to “love yourself”… it’s one I keep coming back to and often  when I find myself falling back into self-sabotaging pattens because of this message I now stop and ask myself if what I’m doing is the best way I can love myself in that moment/at that specific time… it’s still a work in progress but often I find framing my mind this way helps i.e staying up too late… an issue I’m still working on… I will ask myself is this really the best thing I can do for myself right now… for my body? \n\nEtc loving yourself is also doing the little things that make you happy like you mentioned in your case anime, etc please remember that… but sometimes it can be doing the hard and boring stuff stuff like forcing yourself to take a shower, paying your bills, cooking a healthy meal, etc….It’s also important to know that interests change and that’s ok but you owe it to yourself to explore and do things that make you happy. \nWith that said here are some songs on my “mood down and need to just work through it” as well as my “motivational love yourself playlist” in no particular order…\n\nA lot of their songs have captions if you are watching it from the HYBE labels YouTube, you can also just google the  lyrics. It’s not much but I hope you at least take out a few reassuring words that no matter where we are in the world, we are all more or less experiencing the same struggles and fears… it’s all part of the human condition I suppose regardless… you can still choose to love and honour yourself by doing the things that make you happy. \n\n🌸BTS-INTRO, NEVERMIND (contains one of my favourite quotes by one of my favourite artists and member in the group Suga who has dealt with mental health issues in the past and is vocal about it “if you feel like crashing, accelerate  you idiot”… it’s a bit tough love  but sometimes It’s what I need to snap out of my headspace when it starts to get dark…\n\nAGUST D- SO FAR AWAY… (AGUST D Is SUGA the aforementioned BTS member’s solo projects and persona… this is one of my go to to listen to on repeat when I’m deep in the hole…please, please read the lyrics…) \nPS: there’s two versions,  one on Spotify with Jungkook (another BTS member) singing the chorus and another on Apple music with a female singer both equally beautiful. \n\n🌸RM’s MONO (literally the entire mini ep/mixtape especially the song “Moonchild.” RM is the leader of BTS and it’s his solo project)\n\n🌸JIMIN’s promise (another member as well… I think the lyrics were like a promise from him to him and I sort of interpret it as like me making a promise to myself to be there for me…”be my light” and I hope you see it that way or find a meaning/interpretation that works for you…?\n\n\n🌸also BTS Epiphany, Spring day, Lights, ON (lol not lights on…lights and ON are two different songs), Life goes on, blue and grey, Stay Gold, Answer: love myself, Shadow, Jungkook’s cover of Maroon 5’s lost stars\nAnd Black Swan which deals with the theme of losing ones passion… there’s two beautiful videos but please please watch the orchestra version in which the story is told through modern dance and doesn’t feature the BTS members as well…\n\nAnd finally Cypher 4 because we love a good diss trap with the refrain “ya player haters you should love yourself” lol 😅seriously even if rap isn’t your thing sometimes you just need a pick me up song and you’ve got to hype yourself up you know?\nAlso my boy Suga snapped halfway through lol k that’s all for now, feel free to ask for more songs or let me know if you liked any or whatever…\n\nA non kpop song that helps me when I fall of the wagon is Try again by Aaliyah.", "permalink": "/r/DecidingToBeBetter/comments/oa7k9m/im_trying_to_get_out_of_a_long_term/h3hhyzl/"}