{"id": "t5_2qh5i_t3_clvacq_t1_evzrtk3", "creation": 1564965559, "origin": "t5_2qh5i_t3_clvacq", "height": 1, "replied_to": "t5_2qh5i_t3_clvacq", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Sheriff_Mills", "text": "I agree with seasoned_drop about the culture. I'm born and raised Catholic here and received a lot of grief all my life. The Mormon church has its hands in all of the laws that are passed. Recently Utah voters voted to make medical marijuana legal. It's was Proposition 2. But when the legislature met they gutted the proposition. Also there was a bill to make conversion therapy for homosexuals under 18 illegal. The law was almost passed but a day or 2 before the law was voted on by lawmakers, the law was rewritten and was a husk of the original bill. People were furious! But the governor signed it anyway. \n\nIn restaurants mixed drinks cannot be prepared where children are close enough to see them being made. That law was slightly loosened last year. The only alcohol sold in grocery stores is beer with 3.2% alcohol. If you want anything else like wine, liquor, or stronger beer you have to buy it at state owned liquor stores that are closed on Sundays and all holidays, state and federal. The legal blood alcohol content was just lowered to .05%.  I have 3 cops in my family and they all say that won't do anything to save lives. \n\nMany Mormon children are forbidden from playing with non-mormon kids. There is a stigma associated with drinking coffee, wearing tank tops or shorts that don't come to your knees. \n\nAnd yes, the pay gap between men and women is infuriating but I don't see that changing anytime soon. We also have an \"inversion season\". This is between November and February. Because the valley is between 2 mountain ranges the position gets trapped by high pressure. The air quality! Becomes very unhealthy. A few years ago it was so bad that 100 doctors signed a letter to the governor to please do something like restrict driving and putting restrictions on factories. But he said the air quality wasn't bad enough to do anything, even though 100 doctors were saying it was. \n\nThe land is beautiful! I love going for drives up the canyons especially in the fall. But many of the people, the laws and the influence of the Mormon church can be so frustrating that I tend to not notice the scenery. \n\nI know this is a lot and you may want to take a break while reading. These are just the things I and many others do not like about Utah. Let me know if you have any questions. Hope I've helped.", "permalink": "/r/happy/comments/clvacq/my_mom_and_i_are_currently_in_slc_because_she/evzrtk3/"}