{"id": "t5_2tand_t3_ji8tzu_t1_ga7c30h", "creation": 1603744416, "origin": "t5_2tand_t3_ji8tzu", "height": 1, "replied_to": "t5_2tand_t3_ji8tzu", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "perceval-le-gallois", "text": "After a period of thinking and journaling, and identifying what led you to act the way you did, learn to forgive and laugh at yourself. I am a recovering asshole and developed a tic of smacking the heel of my hand into my head when I remembered something rude or shady I did or said. At first I thought it was harmless, but then people would see me doing it which was embarrassing for both of us and it actually started to give me headaches. So I had to develop better coping strategies. \n\nI had to let go of the past and learn to laugh at it. Rather than holding onto my anger for myself and my mistakes, I would release the tension and laugh about what an immature thing I'd done. How poorly thought-through it had been, how impulsive, how selfish, and just let out a good hardy laugh. More than anything, the relief that I know better now is so healing. The fact that I can identify the cringe means I'm doing so much better than I was then. And that is heart warming and gives me hope. \n\nI journal a lot, I dream-journal, and I leave behind what hurts me: I unfollow people I knew from that time but was not friends with because of my issues, because it hurts that I wasn't able to come away from my time knowing them with a relationship between us. Since I'm not going to run around tugging on sleeves and asking people to take pity on me, or worse, acting like everything was fine, I just leave the space open for meeting new people now that I'm more mature. You can and will build a new life with the realization that you must change. And it's incredible that you know to leave the other person be. Thank you for being you and taking on this brave journey to improve. You can and will succeed when you dedicate your life to respect and dignity. \n\nPersonally, reminding myself to respect myself and others at all times leads to me behave in a way that I am mostly proud of. Of course we all slip and act in a way that is less than preferable sometimes, but it's about improving, learning, and apologizing sincerely and without excuse. We all make mistakes and now you know better than to do this, and you learned it the hard way. You can take these lessons and use them to improve or continue to make excuses for your actions forever. It sounds like you have started a lifetime of recommitting every day to the first option. Stay on track!! :) Life gets better when you do.", "permalink": "/r/DecidingToBeBetter/comments/ji8tzu/ive_recently_realized_im_a_toxic_person_today/ga7c30h/"}