{"id": "t5_2tand_t3_ji8tzu_t1_ga60a9j", "creation": 1603720506, "origin": "t5_2tand_t3_ji8tzu", "height": 1, "replied_to": "t5_2tand_t3_ji8tzu", "down_vote": 0, "up_vote": 11, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "elizacandle", "text": "Self growth! Yay! Good on you for admitting you have a problem! Here's some resources, to teach you how to build healthy habits, healthy emotional relationships etc.\n\n- *Running On Empty* by Jonice Webb (and its sequel)\n\nAmazing books that really help dig deep, gives you easy do's and don'ts for developing healthy coping skills, healthy habits. Etc. Really worth the read. The reason I HIGHLY recommend these is because they focus on emotional *neglect* which is often (and understandably) overlooked in favor of more visible issues such as physical /emotional abuse. However emotional neglect can be just as harmful as any other form of abuse and Dr. Webb Really helps you understand how to improve your emotional health and heal from your past.\n\n- *The Body Keeps the Score* By: Bessel van der Kolk\n\nFocuses on healing from trauma and abuse. I've only started it, but it is promising and comes highly recommended.\n\n- *Adult Children of Emotionally Immature Parents* by Lindsay C. Gibson\n\nVery good to open up, name things. I didn't personally resonate with this one as much but I totally see the merits of it and touches on many topics. \n\n- In Love While Parenting App\n\nThis amazing little app is available for free on Apple and Google. While it is aimed at people who are parenting and in a relationship the facts and guides it shares are extremely useful in helping you build stronger relationships and emotional bonds with those around you. It has short videos and is easy to use just a few minutes a day.\n\n- *Will I Ever be Good Enough?* by Karyl McBride\nSpecifically aimed at daughters of narcissistic mothers. Helps with coping, setting boundaries and healing!\n\nother subs \n\n- r/cptsd\n- r/raisedbynarcissists \n- r/emotionalneglect \n- r/Anger\n\n\n\nThings to remember on your journey of self growth \n\n- Progress isn't linear\n- Mistakes are normal and they do NOT erase the progress you have made. \n- Be gentle with yourself, you cannot shame your way into improving \n- Don't try to change every single thing at once. True lasting change is done incrementally over time.\n- Take breaks- ans give yourself time to process! \n- Self Care is a must! \n\n#YOU CAN DO THIS\n\n#Break The Cycle", "permalink": "/r/DecidingToBeBetter/comments/ji8tzu/ive_recently_realized_im_a_toxic_person_today/ga60a9j/"}