{"id": "t5_2tand_t3_geh81m_t1_fpolii6", "creation": 1588786510, "origin": "t5_2tand_t3_geh81m", "height": 1, "replied_to": "t5_2tand_t3_geh81m", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "zacattack62", "text": "Hey I hope you know I’m not saying Reddit is the problem: I’m the problem and I know that. I love to hear about a site as wonderful as this being used in ways like your ways. Keep that shit up!\n\nI’ve heard this concept explained before and I think it applies to this. Credit to the original thinker, as this is not my idea:\n\nA lot of social media works on the premise of constantly promising you new, breaking information before things like news outlets can get in the way. If there’s a new piece of gossip, or a Tweet that sparks controversy, or whatever, it’s on social media. Reddit is no different, in fact in some ways it’s worst. Reddit is all about “the scoop”. There’s absolutely nothing wrong with that, but here’s what happens when you abuse it like I have. \n\nYou come to get “addicted” to that “breaking information.” You come to expect something new every time you check your timeline. You want to see the posts on r/popular before they become popular. So I’m not always just opening Reddit because I’m bored, sometimes I’m doing it because I subconsciously want that feeling of being ahead of the loop. \n\nThere’s also the idea that anything becomes kinda useless when it becomes compulsive. This is embarrassing, kinda, but just to show how bad it can be: sometimes I close the Reddit app, and open it RIGHT back up. It’s because I expect that re-opening to yield new posts, new breaking info. *I don’t even realize I’m doing it.* And there are times where I zone out and when I come to, I’m scrolling Reddit. I never actually made the conscious decision to open it, and didn’t have any reason to. It’s just compulsive. \n\nBackground: was diagnosed with OCD a few years ago, but the psychiatrist in question always seemed a little trigger-happy. Even when she, a medical professional, diagnosed me, I knew she was kinda full of shit. I’ve come to understand that I definitely have TRAITS of OCD, but I think those traits can be attributed to other issues. Also a former substance addict, and maintainer of bad habits. I am definitely a special case here. There are MANY aspects of my life I need to intervene on myself for and distance myself from, Reddit is only a single example.", "permalink": "/r/DecidingToBeBetter/comments/geh81m/replacing_easy_dopamine_fix_with_long_term_self/fpolii6/"}