{"id": "t5_2tand_t3_po4faq_t1_hcw9qz4", "creation": 1631669042, "origin": "t5_2tand_t3_po4faq", "height": 1, "replied_to": "t5_2tand_t3_po4faq", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Kiwi-Fox3", "text": "Thank you so very much for the heartfelt words! Unfortunately as I read this, I believe I am dealing with a kidney stone 🤦🏼‍♀️ I went to the walkin-clinic on September 2nd, for what I thought was UTI. I took my antibiotics as prescribed, and then had to return to the emergency room on September 9th for severe abdominal pain. They told me all my tests came back normal, but I was still in severe pain. Now I have a low-grade fever and when my husband affectionately pated my back I had excruciating pain as if the stone was moving. I can't tell you how angry I am right now to have gone to two visits, now to go a third visit, to finally get someone to actually listen to me, and not treat me like a pain pill seeking addict. 😤 I even told them when I went into the ER \"I don't want your pain medicine I want to diagnosis, I want to know what's wrong!\"\n\nLuckily I do have an appointment with a urologist, and they said that they would call me when we can schedule an ultrasound. Unfortunately I'm losing my insurance at the end of October so this really puts a crunch on my ability to take care of this issue. It makes me so angry that just as you said doctors can be so set in their ways and they feel that their patients are lying to them, or that they know best, when I've been living in this body my entire life. I know what's normal and not normal. I know I have a low body temperature naturally, so a fever of 99.7 is extremely high for me considering that my resting body temperature is typically at 97.2 ( doesn't mater what thermometer does the test). My mom is hypothyroid, and I know that a low resting body temperature are signs of thyroid disease, so I've been asking them to check up with my thyroid levels and they keep assuring me that \"everything is coming back normal\". I'm extremely doubtful and I still feel that thyroid disease is on my horizon.\n\nEver since 2012 I've often referred to it as beginning my health journey when I started to eat smoothies on the regular. Unfortunately I have taken a dramatic drop in my focus on good food medicines. I'm well aware that this is a huge mistake, especially for a sensitive delicate body such as mine.", "permalink": "/r/DecidingToBeBetter/comments/po4faq/the_most_important_thing_to_understand_is_that/hcw9qz4/"}