{"id": "t5_2tand_t3_oxij67_t1_h7nzfc6", "creation": 1628076875, "origin": "t5_2tand_t3_oxij67", "height": 1, "replied_to": "t5_2tand_t3_oxij67", "down_vote": 0, "up_vote": 22, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "megalo53", "text": "Had some tough times in my life and I think I came to rationalise this, from lots of reading and introspection, that the way it helps for me to think about \"who I am\" is a bit like this: you are someone manipulating a puppet, or you're a dog trainer, or a scientist working on a robot. The entity the world sees is the puppet/dog/robot. But \"you\" are one step back from the puppet dog robot, you're in the background, nudging and prodding this dog robot thing in one direction or another, trying to gently guide it to the best place to succeed, be happy, enjoy life. It's the puppeteering dog training scientist that tells the robot dog to go to the gym, to eat healthy, work hard, be good to people. And sometimes it wins. But sometimes the robot dog goes haywire, and shits everywhere. Sometimes \"you\" get angry or sad - that emotion is like the robot dog is pulling on the lead so hard that the dog training scientist can't stop it running off to chase the cat. And that's ok. It's a gradual process, because the robot dog doesn't understand the dog training scientist exactly. It takes time (maybe your whole life) to get the robot dog to act in line with the dog training scientist.\n\nUltimately this is a helpful metaphor I find to describe consciousness vs subconsciousness. And once we recognise that, when our behaviours or our emotions are \"going wrong\", we can learn to observe this as a kind of curiosity of the human condition. Of biology. It's the dog running after the car despite the trainer saying no. It's the robot short circuiting while the engineer tinkers. But it's *ok*. It happens, and the dog training scientist has to start again. \n\nSo last thing I'll say is this gets us into debates about free will. My personal feeling is, maybe unsurprisingly, that we have \"some\" free will. In a given moment our robot dog can take over: e.g. we could gorge on food when we're dieting. But the dog training scientist puts us in a position to avoid this. The dog training scientist buys fruit, not chocolate, at the grocery store, so that when the robot dog takes over, you gorge on fruit.", "permalink": "/r/DecidingToBeBetter/comments/oxij67/you_are_not_your_thoughts_you_are_not_your/h7nzfc6/"}