{"id": "t5_2tand_t3_p44fu0_t1_h8xtnle", "creation": 1628965708, "origin": "t5_2tand_t3_p44fu0", "height": 1, "replied_to": "t5_2tand_t3_p44fu0", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BerningMan1", "text": "Gratitude.  I find that I can not be grateful and angry simultaneously.  I start everyday by being grateful and focus on my heart when I'm in it. Initially, I would focus on what I was grateful for (i.e. my family, dog, health, etc.) but now I just focus on universally being grateful for the miracle of being alive and let that state embed more and more in my body.  When I find myself getting pissed, I breathe, tense and relax muscles and then rest into my gratitude practice.\n\nWhen we are angry, we are shielding ourselves from a perceived injustice that we want to change. Oftentimes, we are actually helpless and there is nothing that we can do about it but rather than admit that to ourselves and just let it go, we get angry thinking that our anger is \"doing something about it\" but it's not productive and causes harm to ourselves + others if not checked. \n\nAfter a clusterfuck of bad experiences, I had some rage/anger issues for a number of years.  IT really sucked.  I learned to just be with the feelings, to watch them, not judge it and just allow them to be.  It's like the inner child needing attention and alot of times that was enuf, especially when I took the time to notice the tension in my jaw, chest, flurry of rageful thoughts, etc.  Just noticing is healing.  This also allows you to detach from the experience rather than letting it drive you and you will start seeing patterns, thought loops and emotional reactivity patterns to those thoughts.  When you start seeing those patterns, then it's easier to pattern interrupt.  \n\nLike when I think about some shit my brother did, I really don't think about my brother anymore because it doesn't matter, I can't do anything about it and I don't want to waste anymore precious moments of my life being pissed about him being douchey. So I focus on what's happening in me, in terms of thoughts, images, sensations, etc. and notice what is happening and the patterns. Once the experience gets my attention, it all seems to dissolve and the more I do this rather than react, the quicker it passes through.", "permalink": "/r/DecidingToBeBetter/comments/p44fu0/i_am_having_very_violent_angry_random_thoughts/h8xtnle/"}