{"id": "t5_2tand_t3_p44fu0_t1_h8ylt1z", "creation": 1628978618, "origin": "t5_2tand_t3_p44fu0", "height": 1, "replied_to": "t5_2tand_t3_p44fu0", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TiredForEternity", "text": "These are called \"intrusive thoughts\" and have no basis in your actual beliefs as a person.\n\nIntrusive thoughts rise up when someone is under stress or anxiety. The brain does this funky thing where it starts to imagine imagery, situations or crimes. The reason they're called \"intrusive\" is because they're sudden, with very little to no desire to commit those actions, and can be upsetting, disturbing, even scary. \n\nBut the fact you're scared of them, and don't want them, says loud and clear that you're not the kind of person to do those things. Someone who is wouldn't feel any disgust, and would willingly have that imagination.\n\nIntrusive thoughts can be caused by a mental disorder, but bottom line is they're your brain screaming \"I'm stressed out! Listen to me! I might just snap!\" \n\nTo cope with them, mitigating stress, eliminating (or lowering) things that stress you, meditation, self-care, talk therapy, all of these can help. When you're less stressed, they usually decrease in frequency. It's also a good idea to remember to take a deep breath and say to yourself things that can calm you in the moment - mantras, quick centering (going off of you saying you meditate), a grounding object, redirecting your thoughts to a positive situation to imagine, reassuring yourself you're safe, all of these things can help. \n\nBottom line: There's absolutely nothing wrong with you or your morality. You're stressed, and your brain isn't very good at communicating that it's stressed. You're far from alone and a lot of people experience these sudden thoughts, but you're not a bad person, at all, for being unable to control these thoughts. Take care of your mental health.", "permalink": "/r/DecidingToBeBetter/comments/p44fu0/i_am_having_very_violent_angry_random_thoughts/h8ylt1z/"}