{"id": "t5_2tand_t3_lme6yn_t1_gnvjf13", "creation": 1613648130, "origin": "t5_2tand_t3_lme6yn", "height": 1, "replied_to": "t5_2tand_t3_lme6yn", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Number132435", "text": "You're young and restless, this is the perfect time to try new things. Keep an open mind. Whats the job market like where you live? If you're able to, dont be afraid to try a few different jobs, or industries. Get an idea of whats up and what you like/dislike, what strengths you have. Are you tied to one location?  There's places you can move to and easily find jobs that pay well if you're willing to go and work. When I was 18 I was tired of kitchens, knew I wanted nothing to do with customer service and was waiting for a chance to get on at the sawmill in my hometown. Eventually I got tired of waiting and moved to northern canada and found a job within a week in the oilfield there. I learned something at each of these places, as well as others, and eventually I figured out what I wanted out of a job besides a paycheck. \n\nWhat kind of things have you been looking at? 18 with no experience Im assuming service, hospitality, kitchens. At your age trades and labour start to become more accessible, theres a couple upsides to these: they pay more than other entry level jobs, help keep you in shape, and have opportunity to become a career. Also industries like construction havent been as hard by the pandemic, and are safer in that context since you're not dealing with the public. Depending on the job you could end up just working with the same handful of people everyday. Places to start would be as a labourer, on a construction site doing clean up, or helper for a specific trade carpenter, mason. Another alternative would be a similar role in a shop, like a cabinet shop or some kind of manufacturing. Then theres more industrial places like sawmills or mines, but those entry level jobs are usually more competitive. Finally on the other end of the spectrum would be more casual jobs like landscaping, warehouse work, painting or moving companies\n\nSorry for the long post, but part of finding work is just knowing whats out there. Lots of jobs Ive had in the past 10 years I didnt even realize were an option back in highschool", "permalink": "/r/DecidingToBeBetter/comments/lme6yn/dropping_out_of_college_and_dont_know_what_to_do/gnvjf13/"}