{"id": "t5_2tand_t3_jh1mjs_t1_g9xm18k", "creation": 1603562228, "origin": "t5_2tand_t3_jh1mjs", "height": 1, "replied_to": "t5_2tand_t3_jh1mjs", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ChrisssieWatkins", "text": "You may have already thought this through but I’ll share my 2 cents— \nFrom a strategy perspective, I think you should 1. Try to have an advocate with you and 2. Take the approach that they appreciate that you saved the company from a possible liability and a colleague from injury or worse: “I’m sure we agree that this situation required urgent decisive action.” “ Thank goodness I was there and no one was hurt.”  “Of course the safety of the team is everyone’s first priority.”  \n\nThis gives them an opportunity to align with you as opposed to being on the defensive.  \n\nIf they go on the offensive, have a few go-to points you can reiterate without being defensive. They may try to imply that you over-reacted. Revert to something like: “I’m sure we agree that when it comes to health and safety, it’s always better to err on the side of caution.“ “None of us want what could have happened on our conscience.”\n\nYou can come out strong and say something at the beginning like: “I think a good outcome of this meeting would be for us to be on the same page with regard to the safety issues I’ve shared. Let’s discuss the best way for us to get there.” This gives you an opportunity to provide feedback on the format of the meeting they’re planning.  For example, you may want your own question period to understand what they’ll do with the info you’re giving them, what their internal investigation approach will be, the timeline, etc., perhaps after each point you raise. Take notes, circulate a sign in sheet, or at least list who was present. If they have someone taking notes, request a copy. \n\nYou should not feel interrogated, belittled, or made to be on defensive. You are a hero and they should take this approach. You are free to leave at any time. They may employ you, but you still have some leverage. Even if you’re not represented by a collective bargaining unit, it’s likely that your on-the-ground colleagues who are directly impacted by these safety issues are. Utilize that union if necessary. \n\nBest of luck to you. Please keep us posted.\n\nEdit spelling\n\nEdit2: any chance your company has an ombudsperson? If so, request that they attend.", "permalink": "/r/DecidingToBeBetter/comments/jh1mjs/reporting_hazardous_osha_violations_even_though_i/g9xm18k/"}