{"id": "t5_2tand_t3_nxirao_t1_h1ey4ot", "creation": 1623426511, "origin": "t5_2tand_t3_nxirao", "height": 1, "replied_to": "t5_2tand_t3_nxirao", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NotAPairOfSocks", "text": "I am by no means an expert but maybe some of these will help!\n-let yourself celebrate and be proud of the progress you’ve made so far. It actually really is a big deal that you’re moving in the right direction!\n-start small, start sustainable. Going to the gym every day for an hour is too big of a step and isn’t sustainable. Going for a 10-minute walk twice a week is a much better place to start.\n-focus on what’s going right instead of what’s wrong. Example: I used to work at a summer camp that had an archery range. One day a cabin of 10 year old girls was practicing on the range and a rabbit hopped in front of the target. Because the girls were focusing on DONT HIT THE RABBIT, guess what happened? They shot and killed the rabbit. Moral of the story: if you’re focusing too much on the bad, you’ll hit the wrong target\n-build a support system. It sounds like you’re doing some of this already! Seek out counseling services, too - trained pros will be able to help you more accurately. You don’t need to hang out with people you haven’t seen in years, but maybe just reaching out to them electronically to see what they’ve been doing in their lives is a small enough step that you’ll feel connected without triggering too much anxiety\n-keep track of your progress. Try to write down positive steps, like “ate an apple instead of a donut today” or “took a shower.” I’m a teacher so I don’t work for a few weeks in the summer, and my mental health goes down the toilet unless I keep a daily list of those kinds of things. Otherwise I start to feel like shit. But having a daily list is super useful, because I can remind myself that I did something good every day.", "permalink": "/r/DecidingToBeBetter/comments/nxirao/please_help_me_help_myself_to_do_better_feedback/h1ey4ot/"}