{"id": "t5_2tand_t3_nxirao_t1_h1f34f1", "creation": 1623428674, "origin": "t5_2tand_t3_nxirao", "height": 1, "replied_to": "t5_2tand_t3_nxirao", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Zombiefood40", "text": "Wow\nTHANK YOU FIRST AND FOREMOST!!!! I can’t thank you enough really. To you this is just taking a few mins out of your day to help someone, but to me this is really life altering and a really big deal as you know. Thanks for the props on me moving forward. I guess I shouldn’t be mad at all your right, it’s just I wanted to be a lot further now. That was yesterday. \n\nYou understand that working out for 10 mins a day consistently is something big for someone in my situation. I do feel though that I dug myself out of a hole so deep that I never thought I would. I’m making my way out. Old patterns almost through. I know I don’t have to answer to you although my God I have so many defaults. For f*ck sake I realized while writing this that I was letting you know that I wasn’t that bad off, but still bad off. Ie…off the ledge looking down. I don’t know you, but you took the time to write this means so much. The little things in life are so big now. \nI don’t talk to any old friends “drug buddies” at all. Side note. Was at a friends house 6 years ago high out of my mind on adderall. No idea how she didn’t know. I came clean with everyone because I know people were thinking and I’m not going to be someone who is hiding from these mistakes I’m\nGoing to help people and some people got a few things from me. So it was amazing us hanging out like two years ago. \n(  now plans after covid ) no big deal just a friend who doesn’t judge me ( one of\nThose one of a kind friends ) I realized I have so much support which is so amazing ) they don’t understand me like you do or half this page. As far as a support system. Well….I have two lady friends ( gfs sound funny ) both of them are just amazing ( the priceless ones ) one I’ve never met before ( I will be in the future a year or more when I’m ready ) and the other one someone I was basically attached to from the hip. \n\nHere’s where my problem is….( just 1 right ) I told one of them, the one I was so close to that I had a relapse and that’s why we didn’t talk for the last month. I did slip on a couple pills but not to where I would….basically I lied to her and told her I relapsed the last 3 months and that’s why I didn’t text etc. I just needed to be alone. Being accountable is a huge problem for me as well. ( before\nI finish this message I just need to thank you again, going to screen shot it & or email it\nto myself. I have gotten very very sound advice like this before. Basically though I said the same thing as far as what I’m going\nTo do. For f*ck sake when I stopped all the drugs I proper turned into a cow. I went from 185 to 260 in 2 years. ( not bragging lol ) anyway I just lost 30 lbs as well. \n\nIt’s just one thing after another as you see. So I’m going to use your response as literally my reminder. I’ll figure out how to make it up to where it’s somewhere accessible quick on my phone and it will remind me that I don’t have to do this overnight. \n\nFamily members of drug addicts are 6 months behind an addict ( I’m told ) so my sister, Mom whomever sees me as I was 6 months ago. I have to say that’s so on point because without the weight loss I am exactly the same as then. \n\nLately though my thinking is what I’m struggling with. I’m inpatient. That’s the “druggie mentality” that he’s I can change but it does define me now. Making things up to friends because I’d rather take a nap. \n\nWow I’ve had it with that. I just decided I’m not going to be making things up at all anymore. It’s so pointless, it’s not who I am, and it’s the easy way out. Some friends I have are sort of clingy and I think it’s my fault. \n\nWow I went way off topic here mate. If you were to here my story from 18 until now you’d feel like you are reading or watching a movie. I’ve been to prison ( at 17 for being a teenager ) which to me is having a few friends break into an apartment with keys in the door. So I drank a few of this guys beer. If I’d not have admitted it to the police or new my rights I’d have gotten probation and wouldn’t have done 14 months in a 17-100 year old prison. \n\nI’m finally reconnecting with my daughter who is my life, it’s been 5 years since I seen my baby girl 21 years old!!! Never too late but that’s another thing. This is why I can’t post in just an anxiety group or a recovery group. I just wish there was a community called you fcked up your life big time and now your fixing it. ( basically you got through the hard part and now your stuck ) \n\nA 10 minute walk per day-Ez-Pz. \nShower a day.                     “” “”\n\nI think It’s time for the counseling and back\nto my AA meetings. The way AA works is set up for someone to help another person who needs help and that’s how he stays sober. \nIt’s like an AA lifestyle. I see a psychiatrist. In 24 years I’ve never had a counselor or psychologist. There’s literally not enough hours in the day for me to explain everything that has happened and I been through. I will deffo go to one but It’s almost a lost cause. They’d probably think I’m literally making things up. No clue how I’m not dead right now. I mean that should be enough right there I get it. “Normal” people ( thank GOD I’m not ) would just be shocked. I mean nothing cynical or bad but I was an idiot and addict for years. \n\nI think something you wrote in there made me realize I’m trying to do this over night. \n\nSeriously thanks again. I’m not sure too\nMuch how Reddit works, less then a year on here trying to support or ask, but hope to bump into you again. I can tell right off the bat your one of the good ones. 🤜🤛💯🙏", "permalink": "/r/DecidingToBeBetter/comments/nxirao/please_help_me_help_myself_to_do_better_feedback/h1f34f1/"}