{"id": "t5_2tand_t3_8rnow8_t1_e17bzqc", "creation": 1529831761, "origin": "t5_2tand_t3_8rnow8", "height": 1, "replied_to": "t5_2tand_t3_8rnow8", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BHS90210", "text": "I also suffer from social anxiety. Addiction as well (sober now). For me seeking professional help changed my life and I’m now able to cope with things in a much better way than I’m used to. My mom passed away two months ago and she did everything for me and I’m 30 which is pretty pathetic but getting on an anti depressant, finding a part time job that is low stress like a dog walker or a delivery person could be a good idea for you bc I learned the hard way that not working or going to school for long periods of time while my mom supported me only made me more depressed. Being busy with a set schedule is key. Boredom is dangerous as you will want to start self medicating even more. Take small steps. Try reading self help books, I got into law of attraction and it’s changed my life, given me a more positive attitude, etc. check out  r/lawofattraction it was great for me as I tended to be a pessimist most of my life. Also meditation has changed my life and really helped me control my anxiety and negative thoughts. It is a good way to relax and feel good without having to use substances. Unfortunately the only way to face many of your fears will be to face them head on which is easier said than done so I’ve tried to push through my social anxiety and even though I’m still working on it, I’ve made an effort to go out more and connect with others even though most of the time it stresses me out. The more I do it though the easier it has gotten and now I actually look forward to spending time with others. Anyway sorry to ramble I hope this has helped in Some way and I wish you the best. ❤️", "permalink": "/r/DecidingToBeBetter/comments/8rnow8/i_need_your_help_social_anxiety_is_ruining_my_life/e17bzqc/"}