{"id": "t5_2tand_t3_ji8tzu_t1_ga86n37", "creation": 1603760790, "origin": "t5_2tand_t3_ji8tzu", "height": 1, "replied_to": "t5_2tand_t3_ji8tzu", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Nutelladela", "text": "Forgive yourself, and be prepared to relapse in small ways in your journey to get better. But realize that the time you spend not falling back on these old habits will become longer and longer, until you'll forget what it was like to be this person. Apologize and communicate to the person you've hurt as soon as you realize that you were wrong, even if that person also wronged you in the fight. What matters isn't that they realize what they did wrong, but that you leave behind a piece of this abusive self every time you apologize and try again. \n\nAnd although I've said this already, most importantly of all, be prepared to forgive yourself. Mistakes you've already made can't be undone, and mistakes you'll make in the future are only bad habits as long as you continue trying to change. \n\nLastly, it won't take as long as you might think to stop having to make an active effort to not fall back on toxic behaviours. At first, you'll have to actively think about correcting yourself. But the brain learns so much faster than you know, and it picks up on our signals of \"you shouldn't be doing this.\" Before you know it, you'll find yourself doing the right thing naturally and without having to fight for it. \n\nLook up Cognitive Behavioural Therapy, and try applying it to yourself. It truly does work.\n\nSource: I was an angry, manipulative, narcissistic person because of habits that I picked up from my abusive father than I resented but mirrored. I resented him most when I started knowing exactly what kind of shitty manipulation tactics he was pulling, because I would do them too. This was many years ago, and I can't even remember what it was like to be that person. Change will come and it will last. You can do it :) I believe in you, and I hope that you believe in yourself!", "permalink": "/r/DecidingToBeBetter/comments/ji8tzu/ive_recently_realized_im_a_toxic_person_today/ga86n37/"}