{"id": "t5_2tand_t3_ji8tzu_t1_ga6nzvl", "creation": 1603732705, "origin": "t5_2tand_t3_ji8tzu", "height": 1, "replied_to": "t5_2tand_t3_ji8tzu", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AnonEnmityEntity", "text": "Been there. First, congrats on positive change and goal setting.\nSecond, remember that it wont always be this in-your-face as it is now. As you said, its gonna be a long road, and later on down the road, old habits will have slipped back in your life without you realizing it. Old feelings will be reignited. Easy choices will seem less negative, and allowing the \"occasional slip up\" becomes more and more frequent. \nThird, as someone else mentioned, look for the root cause, if applicable. It likely will be a collection of causes, but narrow it down as much as possible through introspection, critical thinking, healthy social support, and therapy.\nFourth, see if capitalizing on the benefits to be gained from adopting a philosophy or spiritual practice is right for you. For instance, mindfulness will help you practice being present, accepting, and learn to be at peace with things you cannot change. Many other disciplines will achieve this too. The key ingredient, in my mind, is the discipline. \"Checking in\" frequently will help you keep up with your goals. Use those moments to answer these possible questions: am I doing things my future/ideal self would do? Is this decision in line with my personal goals and values, or a deviation from it? Am I doing this because I want to, or are my emotions getting the better of me?\n\nGood luck and remember: you're the only one that can make this real, lasting change, rather than just some empty words and a reddit post. You can. You inherently have the ability within you because you are a person. You can find others to help you as well! Stay strong. Forgive yourself.\n\nEdit: spelling", "permalink": "/r/DecidingToBeBetter/comments/ji8tzu/ive_recently_realized_im_a_toxic_person_today/ga6nzvl/"}