{"id": "t5_2tand_t3_ji8tzu_t1_ga9ovq1", "creation": 1603804351, "origin": "t5_2tand_t3_ji8tzu", "height": 1, "replied_to": "t5_2tand_t3_ji8tzu", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "RondaMyLove", "text": "I used to be a very toxic person. I cringe when I think of the people I've treated like dirt before I starting learning about both myself and others.\n\nWe all have our own path. Mine started with a book called \"Happiness is a Choice\", and then \"To Love is to be Happy With,\" by Barry Neil Kaufman. \n\nToday, when folks want to find the inner peace they see inside me, I recommend five minutes morning and night of square breathing meditation or similar. This first step is so you can better hear your thoughts and understand the inner world you've created to take care of yourself. \n\nThe next thing I would do is to start journaling with a particular reason: mornings take one thought from your meditation and challenge it. But not harshly, with complete curiosity. Why am I thinking \"she's a bitch for leaving me?\" She would know what's best for her, just like I know best what's best for me. What do I get from thinking this thought over and over? Why is \"being Right\" important to me? What if I think I'm right just because that's what I want and not because it's best for her? Would it be more loving to her and me if I was just sad she made that decision and then spent my energy on what traits I really loved about her? When did being Right first become important to me? What do I think about anger towards someone I say I love? \n\nAt night, I recommend following Martin Seligman's recommend practice of What Went Well today. I also added What did I do well today? In my upbringing, acknowledgement of my own good works were discouraged to say the least. \n\nAnother big step in my change was when I became an admitter. I'm generally lazy, I also have pretty server ADHD, but can't take Western meds to help. So I forget stuff. A lot. Does not matter how important it is to someone I love or to me. So I'm often perceived as flaky, unreliable and disingenuous.\n\n I now let people who might be counting on me know I'm not the person to handle the follow up. I work hard to train friends and family and co-workers how to successfully interact with me. If I find myself judging someone for their work ethic, forgetfulness, or anything basically I look for where I might be judging myself for that trait too and try to understand what I think I'm getting from the judgement. \n\nIt's sort of like drinking a cup of poison and wondering why I feel like crap. Somehow this is supposed to motivate me? \n\nBy being a full out admitter I shortcut the little scared kid inside who's trying to avoid getting in trouble for not being perfect. I suck in some ways. It's okay to suck. I'm wonderful in other ways. That's okay too. I'm perfectly imperfect.\n\nI hear really good things about cognitive behavior therapy. If I understand correctly, it's a short term, focused therapy that helps folks create the changes they're looking for in their lives. \n\nI personally love \"Tiny Habits,\" by Dr. BJ Fogg, for figuring out what change I want and why and implementing it remarkably successfully into my daily life. \n\nIf you haven't, do apologize to the folks you've hurt. A real apology is \"I'm sorry, I did this thing which hurt you. I know I can't undo the hurt. If there is something I can do to help correct the consequences of my poor behavior, let me know and I will do that.\" And be really willing to do it. Or don't bother, you aren't really ready yet to take full responsibility for your behavior. That's not a condemnation. Just a measure of where you are in your process. Do not contact someone who you've been specifically ordered by them or the court not to contact. Write your apology in a letter, and burn it. Share it with a counselor and work through the self forgiveness.\n\nI wish you well on your journey to creating the new you you want to become. Be gentle with yourself as you find and figure things out. Be gentle with those you meet on your journey. It took you many years to create this person, and there's no deadline to get to the place you are wanting to go. Progress and consistent inner exploration are much more useful than pressure. I also found inner peace and joy. I wish you the same.\n\nStay safe.", "permalink": "/r/DecidingToBeBetter/comments/ji8tzu/ive_recently_realized_im_a_toxic_person_today/ga9ovq1/"}