{"id": "t5_2tand_t3_ft4uzz_t1_fm7v5d8", "creation": 1585837423, "origin": "t5_2tand_t3_ft4uzz", "height": 1, "replied_to": "t5_2tand_t3_ft4uzz", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "dieselcakes", "text": "What is a “normal” dose? A small microdose, done semi- to regularly, is normal to the person doing it. Tell me your normal meth dose. \n\nAnd I’m sorry, Dr. Gorillaxrabbit, was it? Can you also tell me how to fix my “vague but arguably significant issue” with your all knowing algorithm?  I’d love to finally get my life together like “people who dedicate their life to a goal”.  You seem to regurgitate nothing else but MeTh Is BaD aNd AdDiCtIng. Do YoU hEaR yOuRsElF?! ...yeah it’s easy as fuck to jump on the bad meth man that you know nothing about. Yeah, we all know, don’t do meth. But if meth comes up in some kind of conversation (ahem), maybe instead of attacking and sounding like an insecure asshole, actually take a minute to attempt to at least acknowledge that plight that others may have to work through, or some of the ways people have made their choices. “U are lazy” says the asshat that can’t be bothered to type two additional letters. Realize there may be some shit you don’t even have the capacity to comprehend if you tried, I’m not saying you don’t-I don’t know you- but I’m willing to take my chances here. And that’s ok. To be unaware isn’t bad in itself, but fuck, man. At least try.  Bring some useful contribution to this or fuck off. Educate yourself, and either offer support or facts, which brings awareness. Maybe both. Not encouraging anyone at all, but there have been studies done on this shit now so people can try to better understand why other people may be willing to learn or even try shit. And unless you personally know this man that you’ve describe specific human characteristics about, his life and choices affect you none. Stay in your lane if you can’t keep up with knowledge and progression (progression being in science, not in everyone is doing it now). I get I’m insulting you for being ignorant, but I’m also bringing in facts so that you can read while you sit the fuck down. I’m considerate like that. \n\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4939399/\n\nhttps://psmag.com/.amp/social-justice/the-many-surprising-health-benefits-of-meth\n \n\nhttps://www.samhsa.gov/find-help/national-helpline\n\n\n\nOP, that’s awesome as fuck, and it’ll be hard. Some days will be easier than others, and expect to stumble along the way. Stumbles don’t have to negate progress. ❤️", "permalink": "/r/DecidingToBeBetter/comments/ft4uzz/10_days_clean_from_crystal_meth/fm7v5d8/"}