{"id": "t5_2tand_t3_py3des_t1_hesrlsn", "creation": 1632965980, "origin": "t5_2tand_t3_py3des", "height": 1, "replied_to": "t5_2tand_t3_py3des", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "VastBridge9070", "text": "You're not only recognizing your past mistakes, but trying to be better AND asking for help? I'm so proud of you! I'm not patronizing you, I just feel like so many more people need to hear that these days. I'm really so proud of you. You're doing great, progress isn't completely linear. It's a ratio where how many times you mess up slowly gets smaller compared to how many times you don't. \n\nIf i am understanding \"letting go\" in the way that I think you mean, I think the ultimate goal one day will be that you will be at peace with yourself so that your past mistakes don't torment you, and you don't feel so harshly tempted by angry, rash decisions. \n\nBut for now, how bout working towards letting go in smaller, better attainable ways? You seem very smart and proactive to me, but here's what I did in case you might want to explore and expand on any of these: \n\n1. wrote down my trigger words, actions, and questioned why they set me off. Then I wrote about it extensively in my diary until I talked away most of my anger, because the first step to letting go is to process what exactly I'm holding onto. \n2. have something to turn your attention to when you have bad moments. for me, it was music and my diary. \n3. therapy. Whoo boy that stuff was magical. \n4. Hehe this is kind of silly (okay it's really weird, but bear with me) but i have a mantra. more like a whole little ritual. when something gets me really upset, I imagine my head as a mass of wool. I imagine the thing making me angry as a bird that got caught in there. with my eyes closed, I physically mimic pulling out the bird and throwing it out the window. I think the words '*I relinquish you'.* surprisingly, it really helps. if you like this, I suggest making something that feels right for you.\n5. I imagine one thing I love more than anything in the world and how that thing wants me get better, and how i have to be better in order to deserve love from it (that thing is my cat. I want to be worthy of her love. I want to be the person she thinks I am. She believes in me) \n6. proactively apologizing and saying I love you to the people really close to me when I am having a good day. it goes like \"hey, I know I don't say this enough but i wanted to remind you i do really care about you. I'm sorry I have days where I don't show it and I've slipped up so many times. I don't know when I might slip up again but if I do please know I dont mean it and i will try to let you know ahead of time/go away for a while. I wanted to let you know while I'm still feeling like myself.\"\n\nthose are some daily things, longer-term things I do like setting education plans, life goals, things like that but those are some of the smaller steps that helped give me little tastes of what true letting go feels like. that kind of relief is worth chasing. Goodluck!", "permalink": "/r/DecidingToBeBetter/comments/py3des/what_does_it_mean_to_let_go_and_how_do_you_do_it/hesrlsn/"}