{"id": "t5_2tand_t3_pyazq4_t1_hex47wq", "creation": 1633049345, "origin": "t5_2tand_t3_pyazq4", "height": 1, "replied_to": "t5_2tand_t3_pyazq4", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "LCBrianC", "text": "Got it!  Thanks for the info!\n\nI think I'm starting to get a sense of what's going on here. There is a lot of external, societal pressure to figure out \"the one thing\" you want to do with the rest of your life, and not only is it stupid, it can be harmful. As you've already observed, there's a million things you could do, so how can we be expected to pick just one?\n\nThe good news is, I think, you can't, so don't.\n\nInstead, explore, and explore a lot. First, do some digging. What are **all** the possibilities out there, including the ones you've already looked into?  Spend some time, months if you have to, searching the internet and any other resources you have to find out anything that seems even *potentially* interesting. Just write it down. Next, look at all the positive sides of those choices. Do they pay well?  Are they easy fields to enter? Do they seem interesting? Does the work you can do offer nice benefits?  Things like that.\n\nOnly after you've done that should you start looking at the challenges. Do you meet most or all of the requirements? Would it cost a lot, take a lot of time, or be extremely stressful to try and become qualified to do that kind of work?  What challenges or stresses do people who do that kind of work talk about and how well could you handle those? Regardless of the direction you decide to go, there *will* be hardships, so it may be worth thinking about what kind of challenges you're willing to face before even digging in to what's out there.\n\nI think another really important thing you're not doing (and very few people do this, myself included), is reaching out to get more information. For instance, you can get a pretty good sense of what certain academic programs offer by reading the descriptions online, yes, but have you reached out to schools and said \"Hey, I'm thinking to study at your university and this is what I want to do. What programs do you have for someone like me?\" They actually pay people at the university *just* to help with stuff like that (admissions advisors/counselors). Also, I, for instance, have a masters in organizational leadership, so you could also look out for people who have masters or PhDs in subjects you're interested in (LinkedIn is pretty good for this).\n\nThe more in the dark we are the harder it is to make a choice, so get creative and social and gather as much intel as you can. You've got time man, 24 is a great age to be exploring and pondering. Let me know if there's anything else I can help you with. :)", "permalink": "/r/DecidingToBeBetter/comments/pyazq4/the_paradox_of_choice/hex47wq/"}