{"id": "t5_2tand_t3_p5e57j_t1_h98kywx", "creation": 1629165799, "origin": "t5_2tand_t3_p5e57j", "height": 1, "replied_to": "t5_2tand_t3_p5e57j", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ladyashirix", "text": "Any successful behavior change uses similar methods for success. You already have a head start, because you're thinking about making the change, and finding a professional to talk to.\n\nSome things that will help you keep moving in the right direction\n\n1. Consider *both* the pros and cons both of staying the same with no change, and learning to detach. If the cons of staying the same seem to outweigh the current pros, then it might help you keep going in the direction of detaching.\n2. Meanwhile, think about what positive things you get from the relationship right now. I can understand that you are just so torn and heartbroken, because it sounds like this person has been important in your life. You love them dearly, hopefully at least at one they showed you love and respect. I'm sure there were/are other positive aspects, too.\n3. So, related to the benefits of this relationship, think about where you will get those instead if you detach from this person. There are plenty other people who will actually talk to you instead of what sounds like deflecting (though I don't fully know the situation so can't be sure). Many people and hobbies that will support you living your life in a loving way. Activities that will support your health and improving your appearance and self worth. Places and groups where you will feel comfortable being yourself, even if you sometimes speak or express yourself emotionally, and still feel supported and respected.\n\nIn my own personal experience where I had to cut someone off, one of the only things that got me to wake up was things getting to the breaking point. I hope it doesn't get that bad for you.", "permalink": "/r/DecidingToBeBetter/comments/p5e57j/how_do_you_let_go_of_a_person_you_know_is_not/h98kywx/"}