{"id": "t5_2tand_t3_p5e57j_t1_h97rtjm", "creation": 1629152500, "origin": "t5_2tand_t3_p5e57j", "height": 1, "replied_to": "t5_2tand_t3_p5e57j", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "yearchallenge", "text": "Hi, I'm so sorry to read that you are hurt and that you are in this situation. I hope you will find a way to let go.\n\nI had been there too. This is what helped me in the 3 occasions, maybe it helps:\n\nThe first time I was very young and I tried several times to break up but the exboyfriend kept on pushing to come back together, so it became an on-and-off-again relationship. After a year I decided to take a year to study abroad. When I came back he tried to be together again but I stayed firm until he understood it was over.\n\nThe second time I was convinced the man I was dating was the love of my life but he didn't feel the same way and I really wanted to find \"true love\". It broke my heart but I wrote him and email and finished the relationship (I would have been been unable to do it in person or on the phone because I loved him so much, I would have cried non stop and probably change my mind or be easily convinced of staying together). He didn't even tried to get me back and I cried so much but I didn't looked back. My heart hurt for years afterwards but I stayed firm and was convinced it was for the best. \n\nThe last time was the hardest because my fiancé at the time got cold feet and for some months was unsure on our relationship (we were in a long distance relationship for a long while). The situation was extremely painful for me and I decided to let him go until he was sure on how to proceed. I had never suffered more but I didn't contact him for months. \n\nI took it one day at a time and was very patient with myself. I got lots of books and fun series to keep my mind busy when I wanted to contact him. I always said \"not today, we will see tomorrow...\"\nI created my own business and followed my dream. I did every day something that made me happy and kept a healthy diet, yet I cried myself to sleep every night. It was very hard but worth it. Eventually he realised he wanted me back and he is now my husband. \n\nI hope some of this is helpful in your situation. I wish you the best and keep my fingers crossed for you.\n\nTake care. Greetings from Germany.", "permalink": "/r/DecidingToBeBetter/comments/p5e57j/how_do_you_let_go_of_a_person_you_know_is_not/h97rtjm/"}