{"id": "t5_2tand_t3_os2hf1_t1_h6otqno", "creation": 1627379073, "origin": "t5_2tand_t3_os2hf1", "height": 1, "replied_to": "t5_2tand_t3_os2hf1", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "luckyoreally", "text": "It sounds like your issue mainly comes down to low self-esteem, the problem isn't your partner's exes, it's the feeling you have that you don't measure up.   \n\n\nI was taught a few mental exercises for self-esteem when i was in therapy which really changed everything for me, maybe they can help you too. One exercise is to write down a list of traits that you associate with being a good person (for example: selfless, helpful, smart, funny - whatever you consider to be important). Then next to each trait you draw a scale from 0 to 100.   \nOnce you've done this you have to think of 2 people you know personally. One person who you think is really cool, impressive, who you look up to or even feel jealous of, and one person (not you!) who you consider a failure, someone you wouldn't want to be. Assign both of these people a colour, and write their names down above the list of traits. Now, using their respective colours, draw a little marking on the scales for each different trait, in the spot where you think each person belongs (for example: the cool person gets an 80/100 for how funny they are, and the 'failure' gets a 40/100 for intelligence - whatever). Make sure you're being realistic and honest about who these people are, don't be overly harsh or look at them with rose tinted glasses!   \nTake a look at the different scales, you'll notice that the 'cool' person isn't perfect, there's no way they scored 100 on all the different traits, and the 'failure' also isn't all bad, there are things that they're good at. They're both just people, just like you. You were able to acknowledge that even the person you consider a 'failure' has things about them that makes them good, and valuable. Why aren't you able to recognise these things in yourself? Why are you being so hard on yourself, when even 'failures' aren't all bad?   \nThe final step of the exercise is to write your own name down above the list of traits, and to now mark yourself on the different scales. Be honest, just as you were about the 2 other people, don't be overly harsh on yourself because you feel you should be humble. Now look at the scales and you'll realise that you in fact, are also just a person. You have good traits - things that make you important, and valuable and a good person - just like everybody else. The point of the exercise isn't to compare people to each other, but to show you that every person has strengths, including you!   \nYour boyfriend's exes are just people, they aren't perfect. Try to remind yourself daily of your strengths, and realise that your boyfriend probably loves you because he also sees all these good traits in you.", "permalink": "/r/DecidingToBeBetter/comments/os2hf1/how_do_i_stop_overthinking/h6otqno/"}