{"id": "t5_2tand_t3_mpicko_t1_h5clsib", "creation": 1626401586, "origin": "t5_2tand_t3_mpicko", "height": 1, "replied_to": "t5_2tand_t3_mpicko", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "masonwill007", "text": "I totally feel your pain. I used to struggle academically when I was in college. It was really bad to the point that I was under probation. Yet, that was the pivot point that I realized I have to do something different to help me from being kicked out of the school. I started my research on how to study effectively and most importantly how to stay focused. Thus, here are some methods that I found out:\n\n&#x200B;\n\n1. **Time blocking** \n2. **Eliminate Distractions**\n3. **Start the morning right**\n4. **Staying healthy, eat and drink right**\n5. **The early bird catches the worms!**\n\n**I. TIME BLOCKING as Parkingson’s law:**\n\n“Work expands so as to fill the time available for its completion”\n\nRemember how you always got a lot more or even the majority of the assignment done on the night before it’s due?\n\nHow blocking works effectively.\n\nStart with top priorities to low priorities.\n\nSchedule for little breaks in between not just lunch and dinner.\n\n    → Great apps for blocking schedule: \n\nClokify -  also include time tracker\n\n[time tracker](https://apps.apple.com/us/app/clockify-time-tracker/id1304431926)\n\nGoogle calendar:  [Google Calendar](https://apps.apple.com/ky/app/google-calendar/id909319292)\n\n&#x200B;\n\nII**. ELIMINATE DISTRACTION**\n\nI think you are on the right track now, as you eliminated all the social media. It’s a good practice of self-discipline if we can manage ourselves not to use social media while working/ studying. However, it’s not that easy, so there is some help from the blocking-social-media apps:\n\n* Offtime\n* Moment\n* Flipd\n* Freedom\n* AppBlock\n\n&#8203;\n\n    \n\n[https://www.reviewed.com/smartphones/features/10-apps-that-block-social-media-so-you-can-stay-focused-and-be-more-productive](https://www.reviewed.com/smartphones/features/10-apps-that-block-social-media-so-you-can-stay-focused-and-be-more-productive)\n\n&#x200B;\n\n**III. Start the morning right.**\n\nI stopped the habit of checking my phone when I just woke up. I found this habit really distracting. It was one of the reasons I used to forget things when I got out of the house. Instead, I start meditating first thing in the morning and then review my to-do list that I had prepared the night before. Here is some statistics to motivate you to start meditation: [https://disturbmenot.co/meditation-statistics/](https://disturbmenot.co/meditation-statistics/)\n\n&#x200B;\n\n**IV. Staying healthy, eat and drink right**\n\nBesides eating healthy, coffee is really helpful. The only problem with coffee is its stain on my teeth, as well as bad breath. I tested some energy drinks, it does help focus a bit, but the sugar is crazily high as well as the carbohydrate level. So, I tried vitamins and supplements. Surprisingly, I found this one particular supplement that works amazingly well. Not only was I able to focus but it also helped my memory and improved my mood drastically. Here is the website for you to check out the supplement. It is called Cerebral Prime:\n\n[https://cerebralprime.com/pg/29](https://cerebralprime.com/pg/29)\n\n(save 15% with this link)\n\n&#x200B;\n\n**V. The early bird catches the worms!**\n\nI'm a morning person so waking up early in the morning helps me big time. I am more productive and feel rewarded when I finish a lot of studies before 7:00 am. So, find out who you are - either night owl or early bird to build your studying/working schedule that is most advantageous to you. REM sleep is really important for creativity. Therefore, I have tested out some sleeping aids that help enhance deep sleep and I like this product the most, Cerebral Sleep: [https://cerebralprime.com/pg/29](https://cerebralprime.com/pg/29)\n\nLast but not least, keep doing the good habits constantly. Consistency is important for any success. Good luck folks!", "permalink": "/r/DecidingToBeBetter/comments/mpicko/i_cant_study_cus_i_keep_getting_distracted_any/h5clsib/"}