{"id": "t5_2tand_t3_idpykr_t1_g2azxdj", "creation": 1597995689, "origin": "t5_2tand_t3_idpykr", "height": 1, "replied_to": "t5_2tand_t3_idpykr", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "procionlotor", "text": "Thank you for the thoughtful reply.  I guess you are right that this is more a question about boredom or fulfillment without any obvious pleasure than about dopamine proper.  I know that people live less stimulating lives than I do in full satisfaction, so it should just be a matter of inner work.  But it still seems like  being a responsible person means basically giving up pleasure in most forms and finding a way to be happy, or at least to keep moving forward. \n\nI have broken enough addictions to be familiar with the cycle of intolerable cravings giving way to mild nagging and finally disappearing entirely.  So I hope that eventually that will happen more generally and I won't constantly be looking for a source of dopamine/happiness/pleasure/whatever outside myself.  But this is much more persistent.\n\nEverything you write makes sense to me, but I don't think I am at a point yet where I can truly accept that good people have vice and desire.  It just seems like pursuing anything for me is selfish; it either hurts someone else or it distracts me from responsibilities.  I am not a child, I should be responsible for myself without hurting those around me.  One day maybe I'll get to a different perspective, but right now it's hard to see.\n\nI have never seen the networks that you mentioned, although I suspect that my therapist is part of this since it all seems familiar.  I have tried mushrooms, which I think helped.  But I also wonder if there is a large element there of just indulging pleasure centers.  Right now I am in a place with very tight drug laws and no tradition of mental health pharmacology.  I am totally unable to travel and my city has been under tight lockdowns all year, so there is no way to take part in anything like that anyway.\n\nI am trying to approach this as an opportunity to cleanse myself and to give up as much connection to worldly pleasure as I can.  But I can't quite figure out how people do that and still feel satisfied.  It feels like intentionally bringing anhedonia onto myself.", "permalink": "/r/DecidingToBeBetter/comments/idpykr/living_without_dopamine/g2azxdj/"}