{"id": "t5_2tand_t3_3g75it_t1_ctvl8q1", "creation": 1439004891, "origin": "t5_2tand_t3_3g75it", "height": 1, "replied_to": "t5_2tand_t3_3g75it", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Chispy", "text": "Technology and where it's going!\n\n Technosalvationism, transhumanism, singularitarianism.\n\n Virtual reality, augmented reality, and mixed reality. Look at the big players (Facebook, Google, HTC, Valve) and research how they see it impacting the world on a social level. VR is going to be HUGE on a social standpoint, and will be a great way to break down all barriers across all races in such a short amount of time, and lead to immense implications.\n\n Research the living shit out of artificial intelligence as well! Blogs, articles, books, podcasts, etc. AI and machine learning is just beginning, and coupled with AR and VR, it's going to unleash an incredible future. And all of it is going to happen within the next several decades and benefit people of all parts of the world. \n\n Automation is another cool topic, but could be offensive to people who define themselves by their jobs. If you think the people you hang out with are open minded, bring the topic up. It should get them re-thinking themselves, and broaden their own perspectives in relation to how they define themselves and what they want out of their own lives.\n\n Technology is allowing you to get these ideas into your mind. It's such a powerful mindware upgrade that's allowing people of all cultures to find information that augments their lives in such positive ways. Not many people appreciate this fact, so appreciate how accessible it is to you and its potence. Spread the word as well. It's only going to get more efficient with time, and make sure you take it to your full advantage. Spend time building up yourself and your reputation. Never stop learning about your world, always have that deep inner fire that seeks knowledge and wisdom. Keep helping others, and keep paying it forward to the people you meet online and offline, because in the end we all have the same access to the same technologies and we're entering the same exciting future together. ", "permalink": "/r/DecidingToBeBetter/comments/3g75it/what_are_some_cool_hobbiesinterests/ctvl8q1/"}