{"id": "t5_2tand_t3_3g75it_t1_ctvkrpv", "creation": 1439003840, "origin": "t5_2tand_t3_3g75it", "height": 1, "replied_to": "t5_2tand_t3_3g75it", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Cylosis", "text": "Archery! I've been shooting for 11 years now and probably will until the day I die. It's definitely what a lot of people consider \"cool\" as you describe, and my experience has led to countless fantastic encounters. Let me pitch it to you:\n\nIt's a lot like golf in a lot of ways. It's quiet, mostly individual, precise, and relatively simple. People young and old do it. You'll also never get good at it, you can improve constantly but still be kept humble by people that have been doing it half as long. It's cheap to get into, and like a good set of clubs, if you treat your equipment right it will outlive you.\n\nI always say to people that there are 3 big reasons why people shoot bows:\n\n1. People that are in it for the sporting/competition side. I meet a lot of people at the range that are practicing for a big upcoming competition, and even more people if I travel to one. It's very similar to gun culture in a lot of ways but with like, a quarter of the crazies.\n\n2. People that are interested in the culture or history of archery. Just about every nation on the planet utilized archery at one point or another, and the result is dozens of different styles of bows and technique. I bump into a lot of LARPers and history buffs, as well as people connecting with their heritage or using the sport as a meditation tool. (Kyudo, Japanese archery, checks both of those boxes. It's basically Tai Chi with a bow)\n\n3. Hunter types that are looking for a change or challenge. I'm from Alberta so there's lots of people doing this.\n\nThree generally different archetypes of people whose lifestyles all happen to intersect at archery. My facebook friends list is chock full with people I would have never met or connected with if I didn't shoot. Whenever my hobby has come up in conversation with people I meet, I find that just about everyone has had some sort of experience with the sport related to one of the 3 above reasons at some point in their lives. It really is a fantastic activity and it's enriched my life in so many ways.", "permalink": "/r/DecidingToBeBetter/comments/3g75it/what_are_some_cool_hobbiesinterests/ctvkrpv/"}