{"id": "t5_2tand_t3_mq7f06_t1_gulommz", "creation": 1618493136, "origin": "t5_2tand_t3_mq7f06", "height": 1, "replied_to": "t5_2tand_t3_mq7f06", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Korroboro", "text": "I understand that anxiety works as an alert: something bad could happen.  \nMaybe you could focus on making yourself feel safe.  \nFor example, there's a video about reducing anxiety through something called \"tapping.\" I have found that it works. They say that you should tap on certain spots on your face and that the stimulation produced is what reduces anxiety. I have my personal theory that it could be that what really reduces your anxiety in this exercise is that you are so focused on it that you forget about your worries for some minutes. Anyway, try that and see if it works for you. You could try to reduce your anxiety just before studying or working on an assignment.  \nAlternately, you could play three of your favorite songs, and sing along, before starting. This can put you in the right mood.  \nThere's another exercise that is called \"rapid eye movement.\" I have not tried this myself, but they say it works.  \nYou could also reduce the work doses. You could, for example, work for five minutes, and then rest for five minutes. Work another five minutes, and then rest for five minutes. If it works, you can increase it to ten minutes after two weeks: work ten minutes, rest five minutes.  \nBe creative. Work on solutions that ease you into studying. Try to avoid forcing yourself to work. When you force yourself, you put yourself against you, and that increases anxiety.  \nAlso, watch how you talk to yourself. Don't judge yourself. Don't scold yourself. Don't demean yourself. Don't pay any attention and time to any argument that makes you feel disappointed of yourself.  \nDon't waste your time looking for motivation. Discipline works better. But don't apply discipline as an imposition. Instead, ease yourself into it little by little, as if you were starting to train for a sport.  \nI hope this helps.", "permalink": "/r/DecidingToBeBetter/comments/mq7f06/advice_on_being_a_better_me/gulommz/"}