{"id": "t5_2qh5i_t3_8qvilm_t1_e0mszza", "creation": 1528935346, "origin": "t5_2qh5i_t3_8qvilm", "height": 1, "replied_to": "t5_2qh5i_t3_8qvilm", "down_vote": 0, "up_vote": -103, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Edit: Please read the entire thing before you downvote.\n\nu/poloxamer It's not the best. In fact, having a child is probably the worst experience you'll have in your life. You'll spend endless hours changing diapers at 3 AM. Having to feed a small monster than refuses to eat his mush and only wants chocolate milk. They'll also try to wander around the  house staring at every shiny thing that catches their dark unforgiving eyes. You'll have to watch them stumble back and forth like drunken idiots as they try to walk for the first time, it's an awful sight. Eventually you'll notice they're getting smarter and start calling you the dreaded \"dad\" word. Usually you're lucky and they say \"mom\" first. But like Ravens, they're smarter (and more talkative) than they look.\n\nDiapers soon get replaced (though no one ever said it was a good thing, potty training is a hell all on its own) by scraped knees and you find yourself stocking up more on bandaids and neosporin than huggies.\n\nFast forward a few years and you find some peace in dropping them off in Kindergarten. I feel nothing but pity for the overseers we call \"teachers.\" They should definitely get more funding, one little demon is already bad enough.\n\nEventually they do grow on you (more like a parasite than anything.) They'll ask you dumb questions like why toys cost money and why we can't go to Disneyland all the time. (You should still answer them well though) At first these questions seem naive and \"child-like.\" But in actuality, all they're doing is reminding you of your crippling debt and mocking you for having only enough money to put bread on the table to feed the little brat.\n\nPretty soon, they'll finish school entirely and start planning for college. If you're a good parent, you'll want to make them go to the school furthest away from you. Depending on how well you answered those naive questions in their childhood, you will be rewarded with putting them in schools farther away from you, preferably one far away like Harvard, Yale, maybe even UCLA. \n\nBut it's not over yet. Here's where it gets really bad. Now they start pestering you every other day to send them money. But the strangest thing is that their torment doesn't end their. You kind of start to miss them now, it's the strangest feeling, almost like Stockholm Syndrome. You wish you had those days back when all you had to deal with was Disneyland and scraped knees. \n\nEventually they start their own family and all you can feel is a spiteful glee that they now have their own parasite to deal with. Yet they're such awful demons themselves that they'll likely bring their own parasite to you so that you take care of it while they work. Yet another trial in this torturous thing they call life.\n\nOne day, you'll be in a retirement home, a prison devised by them and their kind to lock you away so they don't have to deal with you. Thats right, they devised an entire facility just so they wouldn't have to change *your* diapers. \n\nThen like the true monsters they are, they only visit you once every year or so just to check up on you. And you feel terrible because they have won. They have systematically managed to make you miss their company. To make you miss all the scraped knees and the diaper changes at 3 AM and the baby monitor and the insurmountable hills of homework and the bad prom dress and the first car crash and all the oh so many broken hearts. After all of this torment, they finally won. You miss them. And you know what? It was all worth it just to see them succeed and be happy.\n\nSo yeah, having kids sounds like the worst thing ever. 0/10 Congrats on your misery. I hope you enjoy it as much as any parent can.\n\n2nd Edit: Sorry if this post came off sounding negative, I was trying to write something bittersweet but many of you have pointed out that it felt really negative. I'm open to criticism and I appreciate any ideas. At this moment, I am somewhat satisfied with having heard back from two separate parents commenting that they liked my post. So I do feel as if I struck the right nerve at least twice.", "permalink": "/r/happy/comments/8qvilm/after_multiple_miscarriages_and_almost_giving_up/e0mszza/"}