{"id": "t5_2tand_t3_pvvakh_t1_hee1m8g", "creation": 1632687741, "origin": "t5_2tand_t3_pvvakh", "height": 1, "replied_to": "t5_2tand_t3_pvvakh", "down_vote": 0, "up_vote": 28, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Sanne_Reddit", "text": "I'm really interested in this. I've never been very addiction prone (no problems with alcohol, drugs, smoking, etc.), but I recognize very well what you describe. There is always at least one outlet that I NEED, in an unhealthy way, to feel at ease. And even though I rotate my addictions of choice, I spent way too much time with them in order to avoid my feelings and boredom.  \n\n\nI recently discovered that this pattern also includes many of my relationships with men (and also with friends). My youth was tough, so dopamine and oxytocin make me feel especially wonderful. This leaves me vulnerable, though, for manipulative people. If interacting with people gives me a dose of those delicious hormones, I'm not true to my boundaries and plans, because I don't want those people to stop eliciting those feelings in me. With healthy people this is less of a problem. With toxic people this results in a toxic dependency in me.  \n\n\nSo, I hope you can tell me what helped you do this? Did you have helpful information or a book on this topic?  If so, I would love to know what it was, so I can go the same route as you.  \n\n\nAlso, you describe your new experiences as 'interesting'. What does it feel like for you now? For me folding the laundry feels empty, probably because of the drop down from the high. I wonder what substitutes that emptiness, if anything. I guess I find it really hard to let go of my addiction because I fear to never feel good again, when I do.  \n\n\nAnd how do you see a healthy relationship with dopamine? I think that's really my question. How can I develop a healthy relationship with those addictive hormones?", "permalink": "/r/DecidingToBeBetter/comments/pvvakh/i_overcome_my_dopamine_addiction_everything_is/hee1m8g/"}