{"id": "t5_2tand_t3_d9065x_t1_f1fn65u", "creation": 1569448208, "origin": "t5_2tand_t3_d9065x", "height": 1, "replied_to": "t5_2tand_t3_d9065x", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "thothpethific92", "text": "I actually had a conversation with some school peers earlier today on this subject. It was unanimous authenticity and honesty are highly robust and sought after character traits when engaging with other people in conversation - or just in general. It builds trust, openness with one another and provides insight across many places in time, geography and demographics. \n\nOne of the comments which catalyzed our conversation was this: \n\n\" I was a shy, compulsive liar in middle and high school and I'm trying to be more honest with myself and others\". \n\nI straight up gave him props on his willingness to share and gained a ton of respect for him because of it. It's been six weeks in class and this is the first time we've actually had a legit conversation longer than 5 minutes and the first one actually outside of the classroom. My perspective of him changed enormously because of it (not that there was negativity - he was just a dude I sat next to in class - so neutral I guess). So, in the spirit of transparency, I relayed my own former issues in lying during my childhood and teenage years as such:\n\n\" It wasnt that I'd lie about my credentials...I can do this, or I've been there, i know this person; it was more along the lines of - pretending to hate a band I really love, or pretending to not have a crush on a girl because shes not 'cool', or liking a certain brand or style because the 'cool' people liked it. \n\nWe got deeper into it and realized that that mindset is a great precursor for losing your identity (or at least struggling with it). Shedding what you enjoy for social reasons isn't (usually) an acceptable response mature adults take when faced with criticism. We just take or ignore the criticism, or if it is legitimate, we acknowledge it and move forward with our lives- which is likely one reason why kids and teens struggle so much throughout middle and high school. Who actually teaches kids how to handle criticism? We see parents tell kids what to do if they get bullied, but it all seemed superficial, or a band-aid to help our hurt feelings, never anything that actually got to the heart of it - I cant say that I or my siblings were raised in such a capacity. \n\n\n To get to the point, I think it comes down to values. Many adults even struggle with identity.  That is to say - what are their values as a person, a parent, a loved one? Are they practicing those values? Are they adopting or practicing false values or the values of others? Do they even have any values?\n\nHow can children and teens ask themselves such existential questions when many of their own parents are dealing with it? Not to say its anyone's fault. It's very difficult to be honest,  introspective and identify your faults in general, regardless of age or demographic and we cant expect everyone to be willing or capable to do so. That said, very few parents who are aware of this are teaching their children that they must continually develop personal values in order to build their identity over time - the goal being, of course, to raise a mature and well-rounded adult who can contribute back to society in a positive capacity and, with luck, by orders of magnitude. \n\nAnyway, to come full circle, when you have personal values - steadfast values that are tried and true across all time and practice them in your life, it will be easier to become an authentic human being. You will always have your core set of values to guide you. Whether it is your personal philosophy, hard decisions, confrontations, tragedy, personal hardship, massive failure AND massive success and so on.  Your values are what you use to measure against in all of these scenarios. \n\nFailed a class and wanna drop out of school? Values \n\nApplied for a job and didnt get hired?\n Values\n\nGot in a arguement with a loved one and dont wanna ruin a relationship? \nValues \n\nJust won the lottery and wanna spend all your money on cocaine and hookers? \nVALUES\n\nWow, sorry for the long post and thanks to anyone who actually read this. I had this sitting in my pocket all through class and really wanted to respond and then when I got in that convo afterwords it made me hyped to write this. Probably didnt even get it all out either lol 🙏", "permalink": "/r/DecidingToBeBetter/comments/d9065x/why_you_should_always_be_genuine/f1fn65u/"}