{"id": "t5_2tand_t3_lvkota_t1_gpcyive", "creation": 1614643860, "origin": "t5_2tand_t3_lvkota", "height": 1, "replied_to": "t5_2tand_t3_lvkota", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ohtoum_Volreim_I", "text": "Hello!\n\nI have become aware of this situation too. I prefer to lock myself in a mental bubble of YouTube videos that don't let me hear my thoughts in order to scape what I feel are overwhelming responsibilities, but they always catch up to me. This is called escapism, and it's one ugly fucker. It drives you in loops of the same situations and feelings time and time again.\n\nYou and only you decide when enough is enough. It is up to you to stop and decide to do things differently. \n\nWhat has been working for me so far has been:\n\n1. Making a list of \"Things That I Do That Are Giving Me Needless Trouble and Holding Me Back\", to have my main issues represented in front of me for context.\n\n2. Looking deep inside myself to see why I behave like this. What causes me this anxiety that drives me off to wasteful activities? In my case is a tendency developed over the years, with it's roots on the evasion of potentially stressful situations using mind-numbing agents to be blissfully unaware (for a short period of time).\n\nThat is why I procrastinate. It's a coping mechanism from my brain that has gotten out of hand.\n\n3. Setting some goals for direction.\n\nShort, mid-term ans long-term goals are what you need to steer yourself in life. Brainstorm ideas, then classify them by type and think:\n\n-When do I start with this?\n-What do I need in order to start?\n-How do I keep track of my progress? (With mini-milestones)\n-When will I know I have reached the goal?\n\n4. Becoming more organized about my activities. \n\nIt began with school. \n\nI started writing exam dates on my calendar. I began doing lists of assignments per subject with all their due dates, which I also reflected on the calendar. I made a list of every assignment I should do per day to be effective, and then I structured it in study and work hours in a weekly timetable.\n\nI then included time for my goals and personal time.\n\nThis way, I know what I should be doing all the time instead of having every day as a blank slate and a bunch of cluttered responsibilities that I will do when I feel like it.\n\nWhich means never.\n\n5. Meditating (I use Headspace)\n\nIt's not bullshit after all. When I stop to notice how I'm feeling, to just exist in the environment, to get a bigger picture on time and life, and I simply see my stresses and thoughts without judgement, they become much more manageable and I have been performing better, and living out of my mental bubble more often. \n\n(https://youtu.be/iN6g2mr0p3Q) A Headspace animation on how meditation works.", "permalink": "/r/DecidingToBeBetter/comments/lvkota/avoiding_discomfort_has_defined_much_of_my_life/gpcyive/"}