{"id": "t5_2tand_t3_bcp3yl_t1_ekse7s0", "creation": 1555151728, "origin": "t5_2tand_t3_bcp3yl", "height": 1, "replied_to": "t5_2tand_t3_bcp3yl", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "blackandwhitepaint", "text": "I think most of your issues stem from the fact that you take zero accountability for your own life and blame your dissatisfaction on others. If you're risk-averse, it's not other people's fault for not encouraging you to take risks. I have a feeling you'd be blaming your problems on being \"forced to take risks\" if it were the other way around. It's not on other people to have to \"break you out of your shell\". It's not your dad's job to motivate his grown adult son to live a fuller life. You feeling self conscious is your own emotion, which is your own responsibility. Parents are often busybodies and it's not \"starting shit\" to ask someone you live with when they'll be back at night. At this point it looks like you're just looking for excuses to point out other people's imperfections as an excuse for your own inaction. \n\nYou DO know love, because your dad and friends show you love in their ways but to you it's not good enough because it doesn't live up to your romanticized fantasy of love. You're too young to be moaning about having \"never had a girlfriend\". And seriously, what do you bring to the table? A lack of motivation? No ambition? Blaming other people for your lack of motivation or insecurity? A girlfriend does not exist to boost your self esteem. Relationships are hard work and are only as good as the people in it. You're unhappy now, I can guarantee you'll be unhappy in a relationship too. What you need isn't romance or other people's help; what you need is to take charge of your life instead of passively complaining about it while doing nothing about it. Don't like your dad's ways? Move out. Afraid of loneliness? Then accept dad's ways with awareness of your choice or learn to develop healthier ways of improving your life other than inserting people in it to validate your existence. Don't like the way your dad talks? Let him know and ask him to do it differently. Your life is monotonous? Add a spark in it. The world is vast; there is a ton for you to discover, learn, participate in. Shy and timid? Practice meeting people and being friendly. Hookups make you \"shattered\"? Then stop hooking up and focus on yourself. It's one thing to be bored with life but you have every means to change that, and if you refuse to take action to change anything, you don't get to complain that it's somehow the world's fault that you're unhappy.", "permalink": "/r/DecidingToBeBetter/comments/bcp3yl/my_life_is_stagnant_how_do_i_change/ekse7s0/"}