{"id": "t5_2tand_t3_mq02sk_t1_gudw3rx", "creation": 1618330769, "origin": "t5_2tand_t3_mq02sk", "height": 1, "replied_to": "t5_2tand_t3_mq02sk", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rocksteady2R", "text": "Handful of thoughts, in no particular order.\n\n(A) The Mankind Project is a mens group that - at its face - lets men work through challenging emotions we find in life.   Another portion of it is that part of that work is finding a mission in life, and helping us live to that mission.  the MKP is an unequivocal boon to my life.  I cannot recommend it enough.  If you happen to be a woman, then our sister organization is Woman Within.\n\n(B) I memorize poetry as a hobby.  I have incorporated a few jokes into those memorization, as well.  when you say that you want to make folks laugh, i find it invaluable to have a a few good jokes ready to go.   \n\n(C) to do things like your random compliments, that takes effort.   i've made a go at it a handful of times, and i'll tell you, it's tougher than it sounds  to get over that shame-piece that (- and mind you, this is *MY* work, here, i don't put this on others, much less you) - it's really tough to get over that shame-piece that wants me to be small, wants me to go unnoticed, no matter the fact I draw attention to myself a myriad other ways.   It takes practice to be able to break through two bubbles (mine and theirs) to say \"Hot dang, that's a heck of a Yellow in that jacket, and you wear it really well.\".   Those folks that go out and tell folks \"I Love You\" and \"you've got a great smile.\"?  hot dang.  cajones.\n\n(D) You can do things like a weekly call/text list with your friends.   Not so much me, but I hear often on the internet \"I hate that my friends don't call or write\".  well, I have two thoughts.   the obvious is 'how often do you call them?\" and the second is the challenging one - \"is that so bad?\"    Yes, yes, some friendships can be usury and one-sided, manipulated - intentionally or otherwise.  But I believe that most times, people are just being people, themselves.  We *all* trend towards seclusion and isolation.   it's where we feel safe.   So to this point, I do one big phone call a week (not to my mother, she deserves/gets/earned her weekly calls regardless).   but that giant friends list that has added up over the years.   Sometimes I take a lament at having started this so late in life.  If i had done this early on, .... man, I have Army friendships, hobo/hiking/hitchhiking/traveler friendships and even a few school friendships that likely would have lasted through.   I recommend making that effort, though - i also have a few 20yr old friendships, and they're highlights to my day. \n\n(E) People want to be *Heard*.   Learn good listening and communicating skills.   the catchphrase in my head is being careful to not be just \"waiting for my turn to speak\".   we all want ourselves to be heard to, but too often one or the other or both participants will just talk over and through the other - with perfect clarity and recall - and still not really hear the other person.\n\nI'm sure there's plenty of youtubes on this.  the phrase you can probably catch some traction with is \"active listening\".  that's how i know it, at least.  In my mens group, we also work on the action of repeating back, not passing judgements, speaking from the self (and without absolutes).  \n\n(F) I'm challenged by this thing you said - \n> I can’t relate to those who struggle because I don’t struggle myself  \n\nI hope you realize that's just not true.  Struggles, at their core and our core, are one of the key components of being human, and in there, *is* a comradarie.  are they the same?  likely not.   do they need to be the same?  definitely not.  Don't compare the struggle itself - which is what i feel you might be doing - \"My emotional malaise isn't as dire as that guys homelessness and drug habit, therefore, I'm not struggling enough to call it struggling.\"  that's horseshit.   my therapist helped me with this recently with my negative self-talk.   \"Just because I am not as mean to myself as I imagine others are, doesn't mean that my negative self talk isn't as 100% as bad as it gets\".  \"Oh rocksteady, you dumb fucking idiot\" isn't atrocious - but it isn't Love either.  and just because i don't delve into \"Rocksteady, you vile piece of mouldy wet dogshit.  You're the only kind of fucking ignorant idiot who would do something that dumb.   You're a fucking twat and you bring your mother shame.\" - just because i dont' get that vile doesn't mean that I'm not doing harm to myself.  What's more, I'm comparing again - I'm not just comparing struggles with someone elses - which i believe we covered is bad on its own merit - but It's comparing myself to my own imagination of me - i.e. i'm continually moving the goal-posts that determine when I see myself as valuable enough to love.  \n\nanyhow.   That's what i've got for now.  I gotta run.  Take care of yourself out there.\n\noh wait - Marriane Williamson.  wanted to leave you with this quote.  I've been chewing on it for a while now.  do with it what you will.\n\n>  “Our deepest fear is not that we are inadequate. Our deepest fear is that we are powerful beyond measure. It is our light, not our darkness that most frightens us. We ask ourselves, 'Who am I to be brilliant, gorgeous, talented, fabulous?' Actually, who are you not to be? You are a child of God. Your playing small does not serve the world. There is nothing enlightened about shrinking so that other people won't feel insecure around you. We are all meant to shine, as children do. We were born to make manifest the glory of God that is within us. It's not just in some of us; it's in everyone. And as we let our own light shine, we unconsciously give other people permission to do the same. As we are liberated from our own fear, our presence automatically liberates others.” - Marrianne Williamson.\n>", "permalink": "/r/DecidingToBeBetter/comments/mq02sk/i_need_to_change_i_want_to_be_a_light_to_everyone/gudw3rx/"}