{"id": "t5_2tand_t3_q124jj_t1_hfix23k", "creation": 1633467208, "origin": "t5_2tand_t3_q124jj", "height": 1, "replied_to": "t5_2tand_t3_q124jj", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "QWhooo", "text": "I definitely know the stuck and trapped feeling, and it's definitely hard. Figuring out how to live, and taking steps to do so, is hard for a lot of people!  But when we take steps, we can start to feel better.  I know when I'm at my lowest, if I remember to just *do something productive*, I can stave off the worst of the agony of self-dislike. \n\nYou mentioned depression a lot in your reply to me. I'm sorry I haven't gone back to the full thread to see if you elaborated elsewhere on this, but I'm wondering if you have access to any kind of therapy.  If you've never tried it, don't worry, it is really just a conversation where they encourage you to tell stories about your life and ask questions that can help you figure out useful perspectives and strategies to overcome difficulties.  (Disclaimer: I am not a therapist or anything in that field. I also haven't done a lot of therapy in my life, just occasionally when I felt like I needed it.) \n\nDepression, as we laypeople talk about it, is definitely heavy to deal with, whether it's **situational** (a reaction to things external to yourself, which is not technically classified as depression unless you really can't shake it), **chemical** (some people's brains have more challenging reactions or lack of reactions to things), or **behavioural** (you have active thinking traps which keep you in cycles that are hard to break), or some combination thereof.  We can learn to modify our thinking, which can really help with our stuck behaviours as well as our reactions to situational and chemical struggles. When we think or behave differently, our brains learn to connect things in new ways, and we can even train our neurotransmitters to fire better to help us feel better.  This is a big way that therapy helps.  \n\nSometimes it helps to have more than just therapy, and many people find great relief in antidepressants. But even with them, it's useful to learn to train yourself to think in ways that encourage growth and progress and strength.  Many doctors will prescribe talk therapy alongside any medications. \n\nAlternatively (or additionally), there are ways to self-therapize.  You can try:\n\n* journaling (I've used this a lot to talk myself up from a low state);\n\n* watching inspiring videos about motivation, or understanding psychology, or whatever else you can find on a relevant rabbit-hole dive into your problems (I found a YouTube channel called How to ADHD that I really like, despite never being diagnosed with it myself... there's some great coping techniques there for so many of my personal struggles!)\n\n* meditating (the Headspace app seems pretty awesome);\n\n* turning towards creativity to spark joy and create peace in yourself.\n\nYou mentioned music, twice, and I wholeheartedly believe music is one of the best ways to soothe the soul. I have dabbled in music creation and digital audio mixing and mastering, and it is absolutely fascinating.  It is something you can do with minimal investment, too: there's decent DAW software available free (Garageband on Mac I think is included in the OS, and I've used Audacity on Windows) or free-ish (I currently use Reaper, which is awesome and free to try but then it just nags after 60 days and I totally intend to buy it someday but I'm on a bit of a different creative path at the moment).  There's a lot of free sound clips and plugins and tutorials out there. \n\nAny work you do for yourself in this way may bring you enough relief that you can build on it yourself from there, or it may help you realize that it might be good to have help from someone who is trained to help detangle the messes we make for ourselves in our minds.  It's really up to each individual to figure out how they themselves tick, and how they tick best. \n\nI wish you all the best in your journey!", "permalink": "/r/DecidingToBeBetter/comments/q124jj/i_hate_that_reddit_and_random_strangers_is/hfix23k/"}