{"id": "t5_2tand_t3_q124jj_t1_hfdta9q", "creation": 1633372806, "origin": "t5_2tand_t3_q124jj", "height": 1, "replied_to": "t5_2tand_t3_q124jj", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "all-boxed-up", "text": "What you are describing is depression. You're languishing and not living. If you don't get joy from anything you could have a chemical imbalance in your brain. It's time to get to know yourself, even your depressed self.\n\nWrite a list of the things you do every day to exist. East breakfast, get dressed, brush your teeth, go to work, eat lunch, etc. That is your bare minimum To-Do list. Now pick one easy physical exercise like go for a walk around the block or do five or ten pushups. Add that to your to do list. Now pick a brain exercise you might like ie: listen to a science podcast or read for 20 minutes. Then meditate, set a timer to sit and do nothing for 10 minutes. \n\nNow write about your day:\n\nDuring your bare minimum To-Do what was hard to get motivated for? What was easy?\n\nHow did you feel after your physical activity? If you went on a walk was there anything interesting you observed? If you did pushups at what count did it start to get difficult. What muscles felt good, which ones weren't good? \n\nHow did you feel after your mental activity? Was the topic interesting or boring? Should you try a different genre or do you want to keep pushing through?\n\nHow was your meditation? Was it difficult to not let your mind wander? When your mind wandered what did it think about? Do you need a guided meditation or just some calming background music?\n\nKeep doing that for a week. Then add another task to your day. Lengthen your walk. Read longer. Feel free to drop something you realized isn't that important. Add routines to your day and reflect on what you did. Pay attention to yourself.", "permalink": "/r/DecidingToBeBetter/comments/q124jj/i_hate_that_reddit_and_random_strangers_is/hfdta9q/"}