{"id": "t5_2tand_t3_q124jj_t1_hfdcsvl", "creation": 1633366658, "origin": "t5_2tand_t3_q124jj", "height": 1, "replied_to": "t5_2tand_t3_q124jj", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "QWhooo", "text": "\n> All the thoughts that come to my mind is that the issue is me being me. I don't want to be me.\n\nWhat does it mean to be \"you\"?  Brainstorming answers to this question can help you figure out what you can work on to help yourself enjoy yourself more.  \n\n**What about yourself are things you don't like?** I know I have many things about myself that I don't like and I'm struggling to change, but identifying these things was the first step.  Even this morning I caught myself saying how much I hate being me, which is what prompted me to read and reply to your post.  I was in a low moment when I said that, and got slightly out of that low by remembering that I have a therapy appointment in two days, the first in over a year.  \"I'm working on myself,\" I reminded myself, \"and that is good.\" \n\nNext...\n\n**What about yourself are things that you DO like?**  Is there a way you can include doing more of these things in your life?  Are there spinoffs of these things that could give you a hint of what to direction to take your life that may be satisfying to you?  \n\nIf these questions are too hard right now, that's ok too: it's truly ok to be a blank slate.  That is your license to stumble boldly forward into whatever strikes your fancy, and if it turns out not to feel right for you, you can change your direction.  This is true at any age, but it's especially true when you're as young as you are. \n\nYour first few guesses of how to fill that blankness might not suit you, but they can help you figure out who you are not.  At age 18, I stumbled forward into a computer science degree I no longer use. At age 21 I stumbled forward into a physics degree I no longer use. At age 28 I stumbled into a marriage I'm no longer in.  I didn't know what the heck I was doing, and still don't, and I'm now still stumbling forward at age 42. \n\nBut I'm figuring things out, and you can too. Also, it's okay to be in progress, rather than a finished product.  Heck, I don't ever wanna be finished working on myself!  I definitely want to be in a better state than I am now, and from there I'll surely have new improvements I'll want to make, but finding room for improvement is not a flaw! \n\nIt may also help to ask yourself...\n\n**What will you be like, once you become more comfortable with yourself?**  How will you feel?  What could that life look like?  You don't necessarily need to answer all the unanswered questions here about where you'll be or what job you'll have; just define your target state by the way you want to be and feel. \n\nImmerse yourself in this vision or feeling for awhile, and then ask yourself, \"What can I do today to help me feel more comfortable with who I am?\"  And then do it.  Repeat as necessary.", "permalink": "/r/DecidingToBeBetter/comments/q124jj/i_hate_that_reddit_and_random_strangers_is/hfdcsvl/"}