{"id": "t5_2tand_t3_q2064m_t1_hfj88zn", "creation": 1633472184, "origin": "t5_2tand_t3_q2064m", "height": 1, "replied_to": "t5_2tand_t3_q2064m", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Archisian", "text": "Unfortunately, I moved to a new place and I can’t access one even if I wanted to.\n\nBut I had a situation recently that I’ll bring up.\n\nMy now ex-girlfriend and I were eating dinner and I tried to bring up some the issues that were going on. She told me that I had no common sense. What that was, I wasn’t sure. But I attributed it to her disappointment in me not remembering things or doing things when she told me to do them.\n\nThe thing is that, when I would go to visit her, she tell me to do ten different things at once all at the same time. It was very hard to keep track of it all and inevitable, I’d forget something. The moment I forget that one thing (or multiple) she get angry and tell me why I can’t remember. I tried to explain to her but she just wouldn’t have it. One particular instance was when we were coming home from vacation, I had to get a COVID test before I returned home and went back to work. My boss messaged me the prior day asking me to get one, so it was very last minute and threw a wrench in our plans. So, we woke up early. My girlfriend had given me and umbrella because she heard it was going to rain. But it wasn’t raining when I went outside. Having little time, I brought the umbrella with me. Not knowing the area and having difficulties with the language of the place I was at, I tried to find all these clinics to ask if they could give a COVID test. I had to have her help translate to taxi drivers and I tried to do my best to get to where I need to go. It was so much at one time. Eventually, we found a place but it was later in the day, so I went back to our hotel.\n\nWhen I went back up to the room, the first thing she asked me was “Do you have the umbrella?” I didn’t have it. I had forgotten it in one of the taxis. She was furious at me and was saying “That was my mom’s favorite umbrella! How could you lose it?!” (Never mind the fact that I had no idea that it was her mom’s umbrella, she just handed me one).\n\nI felt so horrible because of how angry I made her and I felt so dumb that couldn’t remember it. There was silence for a while and I tried to tell her how sorry I was and it was so stressful to get to all these places and not know language, that the umbrella I guess fell down the list of priorities in my mind and just fell out entirely.\n\nBut her demeanor didn’t change. She eventually said that she “wasn’t angry anymore”, but I knew that moment changed the relationship. We eventually broke up a couple of months later (so two weeks ago for me now).", "permalink": "/r/DecidingToBeBetter/comments/q2064m/im_afraid_im_not_a_good_person_the_people_i_have/hfj88zn/"}