{"id": "t5_2tand_t3_puf0ea_t1_heeqbj3", "creation": 1632698776, "origin": "t5_2tand_t3_puf0ea", "height": 1, "replied_to": "t5_2tand_t3_puf0ea", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "trtlclb", "text": "I just reread your OP and noticed you're fresh out of high school. That means the dietary and exercise benefits will be less noticeable to you, since your body is still relatively resilient naturally.\n\nAs time goes on you will find a healthy diet and exercise will become more and more noticeably beneficial, and it's definitely something that will pay dividends in the long run if you start sooner rather than later.\n\nAn easy & simple way to understand what a healthy diet is comprised of — since these days it's difficult to tell with the endless contradictory information thrown our way — can be defined simply as eating mostly vegetables grown without harmful chemicals & meat without added hormones or raised in an unhygienic environment, and avoiding highly processed foods that contain tons of preservatives or sugar, like refined breads, soda, \"shelf stable\" deli meat, etc. Fruit is a great addition as well. All of that isn't to say you shouldn't eat whatever you want sometimes of course, but many ailments people face today are rooted in poor dietary habits, so it's important to be aware of the impact our diet has on us, and what a good diet looks like.\n\nFor physical fitness, some form of cardiovascular exercise like running or swimming where you get your heart & blood pumping powerfully for a consistent period of time like 10-20+ minutes. Some form of resistance training if you want — push-ups are a good one, also squats, lunges, etc — just with bodyweight is fine as long as you are pushing yourself somewhat. It's ideal to start your exercise regime with a good stretch for any muscles & joints you'll be using as well — to help prevent strains, get the blood pumping to them, and stay flexible.\n\nIt seems like you might feel a little undirected, now that you're out of school, which might be part of why you're depressed. There are tons of options when it comes to choosing a hobby, and it might be a worthwhile endeavor to work on developing daily habits related to eating right and exercising.\n\nYou also noted you don't think working will help, although work is important in the sense that without it people can't make much of a life for themselves - we all have to do things we don't enjoy, and when people say things get better they're referring to how over time you start to understand the value of hard work, and how spending some of your time working makes the rest of the time that much sweeter. It's kind of like how in school you spend so much time in class but the time outside of school just feels particularly nice.\n\nYou'll find any number of opinions on depression & anxiety, but for me I see them sort of like compasses - they can be useful as a tool to identify problems in your life, and give you the ability to see what you should do next. Don't focus on removing anxiety or depression from your life. There will always be things that might make us sad or things that we have to do that we don't necessarily want to, but that is also only part of what life is all about. It's counterproductive to your own long-term satisfaction in life to avoid those facts, and it will make it more difficult to enjoy the good times when they're here.\n\nThere's a lot of things I only barely touched on so here if you have any questions let me know. Honestly I was kind of all over the place lol, sorry about that.", "permalink": "/r/DecidingToBeBetter/comments/puf0ea/how_to_deal_with_depression_without_going_to/heeqbj3/"}