{"id": "t5_2tand_t3_puf0ea_t1_hehsgaq", "creation": 1632763572, "origin": "t5_2tand_t3_puf0ea", "height": 1, "replied_to": "t5_2tand_t3_puf0ea", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "trtlclb", "text": ">I believe the problem is that I genuinely don't see myself doing all that in the long-term. I don't really believe I can do that.\n\nThat's okay. That's just how it starts out — when you make long-term decisions like that, which are already deeply baked into your mindset, it will feel like that in the beginning. As you take real steps though it will feel more and more possible, and more and more acceptable to your internal dialogue. I'm sure you've heard quotes similar to \"the first step is always the hardest\" and that's exactly the situation for this. It gets both easier and you feel better when you commit to positive changes like that, though!\n\n&#x200B;\n\n>The only thing like that for me is writing.\n\nYou know what, I'm not surprised you said that. You clearly write very well just based on the short conversation we've had, I think that would be an excellent direction to go in for a hobby. Hell, I can already tell you are better at writing than most people I've talked with on here. What kinds of things would you want to write about? Short stories, books, nonfiction/fiction, journaling?\n\nI get what you mean about it feeling pointless to write if nobody is going to read it. Honestly I've struggled with that specific thing myself. \"Why should I put in the effort if nobody is going to read it\" is a very sensible thing to think; nobody wants to waste their effort trying to be productive on something that doesn't help anybody. Ultimately I decided as long as one person reads it, that's enough for me. In all the conversations I've had, I've learned a ton too, which was a somewhat selfish reason to continue doing it as well. It's not just about being of help to others, but gaining understanding yourself.\n\nUsually people who enjoy writing are deeply curious and also have a passion for learning, so maybe that can be a focus for you as well — there's certainly more value in writing than just what it gives to the reader.\n\nJust to add onto something we talked about earlier: I really recommend instead of doing sit-ups — which are not a great exercise generally (just doesn't do a ton and there are better core exercises) — do just a few highly effective compound bodyweight exercises. Specifically:\n\n* Push-ups\n* Squats\n* Lunges\n* Pull-ups\n* Dips\n* Planks\n\nYou can also combine push-ups and squats into one exercise called a Burpee, which also includes a jump in each repetition; this is a great exercise that also works the cardiovascular system when done right. All of these exercises have plenty of alternative forms if you feel like you can't do them normally as well.\n\nAre you familiar with the terminology sets/reps? Do a couple sets of each to start out and push yourself just hard enough that you have a fair bit of difficulty finishing — it might take a few days to figure out the right way to do it, but again this is one of those things that you just need to start and then it gets easier/more comfortable to do from there. Doing a couple sets of 5-10 reps of each of the above exercises can be done in under half an hour, so don't let that feel too intimidating if you're worried about that.", "permalink": "/r/DecidingToBeBetter/comments/puf0ea/how_to_deal_with_depression_without_going_to/hehsgaq/"}