{"id": "t5_2tand_t3_cs1nnp_t1_exd65ro", "creation": 1566168219, "origin": "t5_2tand_t3_cs1nnp", "height": 1, "replied_to": "t5_2tand_t3_cs1nnp", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "LordyHoardy", "text": "Those are THEIR thoughts.   You cant control that.      Thoughts are only thoughts unless they are said.   My point is.   To cure the social anxiety isnt enough to just work on some basic conversation skills.    Its getting to the root problem.  Which is being afraid of other peoples judgements.  How fo you get over that? \n\nBy not caring about others judgements.   We are often worried about someone not liking us.   We are human, and have been trained to feel so.but rarely do we think.  Do we even want that person in our lives? What does their opinion matter if not? \n\nIf someone thinks you are ugly.   Why do you want that person in your life?    If you dont want them in your life, and they arent in your life.  Allow thoughts to be thoughts.   Someone might find you ugly.   But another person might think you are the greatest being to ever walk the planet.   Just because you are you.    \n\nFocus on that      being you.   Take your strengths, and things you find positive about yourself, and build on that.   Feel comfortable in your own skin. \n\nAlways remember, that unless someone SAYS something derogatory about you, they likely couldnt care less about who you are. What you look like or what you are doing.  Those derogatory words, and negative views you are having are coming from your own brain.   NOT the other person.     \n\nIf you want to overcome social anxiety, work on yourself. Those things you feel self conscious about.. What can you do to make yourself feel better?  \n\nLike for me    i hate my arms.    I have lost over 100lbs, twice in my life.  So I have a lot of excess skin.   I allow myself to feel self concious about it from time to time.  I recoil this by wearing clothes that dont accentuate my least favorite features.  And instead, I accentuate what I do like about myself.  \n\nAs for not feeling comfortable where you are.    Do you even want to be there?   You were given the ability to move. So do. When gardening I have learned that a plant will grow its roots deeper if its in its optimal environment.   It gets involved and gives to its neighbors simply by surviving, ans living for itself.    Do that for yourself.   Find the people that help you be your best self. The place that allows you to feel comfortable.     Dont force it.   Just continue to be the completley awesome human being you are, and dont care about anything or anyone else except making yourself thrive.    The people and things you are meant to thrive with, will show up over time. So in the meantime, work on what you can control  which is yourself. Learn what you like best and what you like least. Even in some of the hardest situations, our weakness' can become strengths, its only about knowing how and when to use them.", "permalink": "/r/DecidingToBeBetter/comments/cs1nnp/how_to_be_comfortable_in_your_own_skin_and_stop/exd65ro/"}