{"id": "t5_2tand_t3_cs1nnp_t1_exd55h5", "creation": 1566167490, "origin": "t5_2tand_t3_cs1nnp", "height": 1, "replied_to": "t5_2tand_t3_cs1nnp", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "sunsetskies_", "text": "One thing you could do is fake it until you make it. Do what you think a confident person would do until you gain that confidence within yourself. Try not to slouch and accept your height and build for what it is. \nI'm right on the other end of the height spectrum and found that people will judge you either way, whether negatively or positively- it's all a bit dumb really as those are heights given to us by God which we don't pick! Look internally and embrace all the wonderful things about yourself. Be happy with yourself first and then God-willing you can be more self-confident when in public. Maybe frequent coffee shops and libraries to interact with more people. You said you work out, maybe try strike up a conversation or ask gym staff about an interest you might have in common- it doesn't need to be gym-related (I helped our receptionist pick out which films to watch on Netflix after my workout sessions aha).\nPreserve your energy especially as an introvert and recognise after interactions, when you need to recharge again- pace yourself. Talk to maybe one more person a day or every two days even if it's just a greeting.\nSmile! Even when you're alone, you could smile and you'll feel a boost of happiness hopefully. Then try smiling at others, thinking less of how awkward it is and more that you want to make the most of your day and this moment with another human.\nSorry this comment is so long, I hope it's of some use. I come across as confident when out and about but as an ambivert, I also am very awkward (a lot sometimes) and need my time to myself and not socialise, even when outside.", "permalink": "/r/DecidingToBeBetter/comments/cs1nnp/how_to_be_comfortable_in_your_own_skin_and_stop/exd55h5/"}