{"id": "t5_2tand_t3_cs1nnp_t1_exdqp4j", "creation": 1566183909, "origin": "t5_2tand_t3_cs1nnp", "height": 1, "replied_to": "t5_2tand_t3_cs1nnp", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "pizzaforce3", "text": "The issue of being uncomfortable in your own skin comes, so I've been told, from self-centeredness.\n\nNow, many folks, including myself, respond with, \"I can't be self-centered, I have low self-esteem!\"\n\nSelf-centeredness does not imply that you think too much of yourself, in fact the opposite may be true.  What it implies is that you think of yourself *too much*.\n\nThis is my problem.\n\nI spend far too much time thinking about how others are going to perceive me, thinking about what kind of impression I'm making, thinking about what I'm going to say to person A if person A says X to me.\n\nThe solution, I've found for myself, is to start thinking about others; start practicing some altruism, start practicing a little empathy, and I do this by volunteering my time and talent to something that does to some good to others, and doing so in a way that I'm not getting direct credit for it.\n\nI give compliments to people without expecting responses.  I do helpful things anonymously, and then I don't tell anyone that I've done them.  I give time voluntarily to projects that do some social good, even though I may not be personally invested in that particular cause or project.   In short, I try to make my little corner of the world a better place, without worrying about getting credit for the improvements.\n\nIt is about as counter-intuitive a process as I've ever encountered; making everything and everyone else look better rather than making myself look better.  But the results speak for themselves.  Since I've embarked on a course of less self-centered behavior, I've become a more centered self.  \n\nI worry less about how I appear to others, I have a better self-image, and, although I still need my quiet time and tend towards being an introvert, I no longer find social interaction to be as draining, because I know that the things that actually give me a sense of self-worth, things that I judge *myself* on, are the very things that I am doing without telling anybody, things that I don't need a crowd of people to validate.\n\nAlong the way, I've discovered others who have made the same or similar decisions to be useful and helpful, without being ego-driven about it, and have discovered that these people are actually worth getting to know better.  Most importantly, I've started to get the sneaky feeling that I might be one of those people too, and that folks might want to enjoy my company for who I am, rather than judge me for who I am not.\n\nHonestly, when I first took on this kind of process of image-change through behavior-change, I thought it was going to be a real pain, a drudgery, a kind of penance for being all wrapped up in my own head for so long.  but, the more time and effort I invest in being helpful and useful to others, the more I enjoy it.  I actually look forward to interacting with others where the role I play is part of a larger, greater whole.  Its kind of cool, like being a secret agent for the good guy's team, or an unknown superhero who's powers only manifest themselves when they remain completely under wraps.\n\nGive it a try?  At worst, someone else will have a better day than they expected.  At best, it will relieve you of that overly-introspective burden of constantly being the center of your own attention.", "permalink": "/r/DecidingToBeBetter/comments/cs1nnp/how_to_be_comfortable_in_your_own_skin_and_stop/exdqp4j/"}