{"id": "t5_2tand_t3_mtp9kx_t1_gvhpji1", "creation": 1619125841, "origin": "t5_2tand_t3_mtp9kx", "height": 1, "replied_to": "t5_2tand_t3_mtp9kx", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "23cowp", "text": "> The things i say to them are: a hello and a light compliment, either on their hair or dress or hoodie etc. never anything like \"your body looks great\" or \"your so beautiful\". \n\nEvery woman is different, but I never complimented women I was interested in on their appearance or clothes--at least not right away. It seemed too much tipping my hand and it must get just tiresome for them, especially if they are fairly attractive. Instead, my goal was to be friendly, as if I was trying to potentially make a new friend. Which, of course, I was (in part).\n\n> For example the last girl i asked for her number was taking a break outside the sushi place she worked at and i was walking out of a sandwhich shop i just picked up lunch at. I said hi and talked about the sushi place ffor like a minute after complimenting her on having really cool looking long hair. (like even for a girl it was considered really long, past her waist). She talked about her self debate with cutting it too since how much of a nightmare maintaining hair that long is. When i asked for her number she said no she works 7 days a week at the sushi place. But if i wanted to see her she could go in there to see her. This is either a rejection and she felt a bit awkward giving an out right rejection or she fully intended what she said. \n\nThat situation is a bit iffy, in that getting a shift break at work might be a time a woman just wants to relax and breathe (or smoke) and not have to be \"on\" with some random new guy. You have to realize, many women (many *people*) when they are talking to the opposite sex, feel they have to be \"on\"--pretty, charming, etc. She might have been just tired and felt like, \"God, I can't even just have a damn cigarette with some guy from the street hitting on me *again*.\" That said, it sounds like it went kind of OK anyway. \n\nI'm not surprised she wouldn't give you her number. Did she even know your name? A thing about you? Probably not, right? So what were you to her? *A total stranger.* So, she is being asked to give personal information to a total stranger on the street. This is in a world in which women have very very bad things happen to them by strangers. \n\nSure, maybe if you were strikingly good looking, or unbelievably charming, or she was in a really up mood from just getting amazing news and not working inside a restaurant (7 days a week!--so she's struggling and bad), *maybe* she would have thought, \"What the hell--let me risk giving this total stranger my number.\" But rarely will all that be true--for any man.\n\nInstead, you have to find ways to de-stranger-ize yourself to women. I once saw a woman in a restaurant I worked at and she would see me, etc. I didn't talk to her. But one day I saw her at a local donut shop and just boldly asked her about what she was studying. I had some familiarity with the material, so we talked about it. *Then I just left*. I didn't ask for her number then, because it was still too early. I then saw her a few more times. Then, finally, one day I asked her not even for her number but when we might get a chance to hang out. I'll skip to the end: ultimately, I had some romantic interaction with her (and I'm still friends with her many years later). But I had to build up to it.\n\nIt helps if you frequent a particular neighborhood in which you see the same large group of people, men and women. As you get more familiar, opportunities come up sometimes if you're open to them.\n\n> i dont get any return energy from any sort of hobby or work etc anymore. kinda like i said in the OP im tired of life in general and am not enjoying anything. \n\nSorry to hear that. Have you considered counseling (particularly, these days, tele-counseling through video calls)? \n\n> BUT: i can pretty much relay what the profile was:\n> The profile description was somthing along the lines of:\n\n> \"Hi :) im looking to date and meet someone.\n\n> I like taking care of my health and fitness and managing my finances and just staying at home with my personal hobbies. Im not a huge extrovert, but spending time and going to places with my friends is my favorite pass time.\n\n> Lets grab a slice of pizza together :)\n\nCan I be blunt? This is incredibly boring. Imagine if you read this from a woman. Would *you* be interested in her? is there anything *interesting* here? Zero. It's like Generic Human Being. It's not even clear if you're a man, woman, young, middle aged, old... (Yes, I know your other profile stats tell that, but it should come across in what you write here, too.). It's almost as if you are trolling and trying to create the most lifeless, uninteresting profile description you can. Compare if you had written this:\n\n> I'm a scruffy, scrappy, goodhearted man knocking on the door of my 30s and looking to find a strong and funny woman who knows all the words to AC/DC's \"Back in Black\" album (or would be willing to learn them)  to team up with me, my dog Dirty Chester, and a case of chilled Yoo-hoo to explore the best and kookiest of what this young 21st century has to offer. I love guessing games, finding antique candleholders put out to curb, and night swimming. In fact, listening to REM's \"Night Swimming\" *while* night swimming. I think it's possible to be very masculine and still bake muffins--and I like it when I bake muffins and they rise up and overrun their little muffin cups because that floppy part at the top is the *best!* \n\nToo silly for you? Fine, but at least it catches someone's attention. But it has it filled with specifics, and character. Would you watch a TV show in which everyone's motivations were to \"take care of their health and fitness and managing their finances and just staying at home with my personal hobbies.\"??? \n\n> As for the pictures, it would include one of me posing with some friends for a picture, one of me and my dog at the park, one of me on a travel pic. and one of me with a clear view of my whole face/head.\n\nThe context doesn't matter so much. What matters is if they are a) flattering enough pictures of your face, hair, body, and personality and b) You look close to your best in them. I've seen so many horribly bad shots of men online over the years.  Bad lighting/shadows, grainy, out of focus, selfies that make the nose look 30% bigger, depressing background, dingy clothes, shirtless (rarely a good look unless you can *really* pull that off and it's in the right context, like a beach shot with friends), not smiling at all, look like you're going to kill someone or just did, dorky glasses, bad beard, bad haircut, childish clothing, etc. etc. Are you SURE you have avoided all these common pitfalls?\n\n> I dont care what race they are, what religion, what personality type (like extrovert or introvert etc etc), what hobbies, what wealth status, what hair color or height etc.\n\n> I only dont want to date major someone with health conflicts (of their own doing) such as being a smoker or someone who is fat. No they dont have to be a health nut and i dont mean health conditions someone may have, like if they were born with something. And i also dont want to date someone who has kids. I dont ever intend to even have kids of my own blood.\n\n> And i dont think having a no kid or major health conflicts as criteria is being picky. but ill hear your opinion on this.\n\nI don' t think that's being picky at all! It sounds perfectly reasonable and very open-hearted. I think this part is just fine.\n\nThe key thing to keep in mind that I don't think you are--either when approaching women in public or trying online--is this: Dating is a marketplace and you have to differentiate yourself to women. You have to give them reasons why they should pick YOU rather than stay alone or be with some other man. You don't have to give them overwhelmingly good reasons, but you have to give them *some* reason(s). It's rare that a man is so inarguably good looking that he doesn't have to do or say anything well and women will vy for him. For most men, you have to do what all male animals do: show the female of the species why you're a good catch. Make yourself interesting, funny, friendly, caring, witty, smart, admirable, etc. People like this generally and women are people.\n\nYou have stop thinking entirely in terms of *what you want* and start thinking a lot more about *what they want*.", "permalink": "/r/DecidingToBeBetter/comments/mtp9kx/how_to_fix_life/gvhpji1/"}