{"id": "t5_2tand_t3_mtp9kx_t1_gvds89g", "creation": 1619046771, "origin": "t5_2tand_t3_mtp9kx", "height": 1, "replied_to": "t5_2tand_t3_mtp9kx", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "user2puser", "text": "The things i say to them are: a hello and a light compliment, either on their hair or dress or hoodie etc. never anything like \"your body looks great\" or \"your so beautiful\". And then trying to make some convo on what their doing or happening in the circumstance. For example the last girl i asked for her number was taking a  break outside the sushi place she worked at and i was walking out of a sandwhich shop i just picked up lunch at. I said hi and talked about the sushi place ffor like a minute after complimenting her on having really cool looking long hair. (like even for a girl it was considered really long, past her waist). She talked about her self debate with cutting it too since how much of a nightmare maintaining hair that long is. When i asked for her number she said no she works 7 days a week at the sushi place. But if i wanted to see her she could  go in there to see her. This is either a rejection and she felt a bit awkward giving an out right rejection or she fully intended what she said. No problem either way, But im not going to try that avenue of going to the place to chat her up again, jsut because i know shes a smoker so realistically a relationship wouldnt work as i dont smoke at all and dont want to be around that. I just wanted to again, practice the conversation aspect and also practice not hesitating to approach someone when i do see at least SOME sort of opportunity to engage with a girl. especially since with random cold approaching there isnt much of those happening on a day to day basis.\n\n&#x200B;\n\nas for seeing my profile. i currently have been uninstalled from the online platforms for dating for a couple months now. because ive just been drained of any life energy and those apps make it worse. (getting rejected in person doesnt still tho). i dont get any return energy from any sort of hobby or work etc anymore. kinda like i said in the OP im tired of life in general and am not enjoying anything. I shouldnt have dating app poison present currently.\n\nBUT: i can pretty much relay what the profile was:\n\n&#x200B;\n\nThe profile description was somthing along the lines of:\n\n\"Hi :) im looking to date and meet someone.\n\nI like taking care of my health and fitness and managing my finances and just staying at home with my personal hobbies. Im not a huge extrovert, but spending time and going to places with my friends is my favorite pass time.\n\n&#x200B;\n\nLets grab a slice of pizza together :)\n\n&#x200B;\n\nAs for the pictures, it would include one of me posing with some friends for a picture, one of me and my dog at the park, one of me on a travel pic. and one of me with a clear view of my whole face/head.\n\n&#x200B;\n\n&#x200B;\n\nalso just do give you an idea of potential dating criteria i personally have:\n\nI dont care what race they are, what religion, what personality type (like extrovert or introvert etc etc), what hobbies, what wealth status, what hair color or height etc.\n\nI only dont want to date major someone with health conflicts (of their own doing) such as being a smoker or someone who is fat. No they dont have to be a health nut and i dont mean health conditions someone may have, like if they were born with something. And i also dont want to date someone who has kids. I dont ever intend to even have kids of my own blood.\n\nAnd i dont think having a no kid or major health conflicts as criteria is being picky. but ill hear your opinion on this.", "permalink": "/r/DecidingToBeBetter/comments/mtp9kx/how_to_fix_life/gvds89g/"}