{"id": "t5_2tand_t3_mtp9kx_t1_gv7tnbs", "creation": 1618935478, "origin": "t5_2tand_t3_mtp9kx", "height": 1, "replied_to": "t5_2tand_t3_mtp9kx", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "23cowp", "text": "> To the why did i go on those older aged dates. It was just simply for dating practice, thats all. I dont have very much practice in that regard, both in the actual date and the approaching someone with a conversation geared at light flirting to ask their number. Its not a thing that is \"amiss\"\n\nI meant something was amiss in the whole situation--that you're trying off and on for years and it's not working. But that was a good idea to try some dating practice.\n\n> as for having my friends that are in relationships review my appearance, profiles etc. I have had review from them for the profiles and the way i dress / look. And its fine, im not like a model or anything but im also not a hideous monster. and the profile description is normal enough.\n\nWell *something* is not working and there are only so many variables here. It's got to be one or all of:\n\n- The state of dating sites generally over the time period you've used them.\n- The sites you use.\n- Your photo(s)\n- Your profile description.\n- How you respond to anyone that contacts you.\n\nMy guess is it's a combination of all of these, of which you can improve the last four.\n\n> i havnt had them actually be near enough to hear what i say to a girl i cold approach. but theyve seen me a few times before. I mean i generally get atleast friendly sort of responses from girls that turn me down, yes kinda awkward, but sometimes i get normal enough short convo with a laugh from them. Im not super charming with my convo, but its not rude or SUPER flat.\n\nWhen you say they turn you down, what words do you say to them and what are the sorts of things they say in response?\n\n> I think my problem is in your first paragrah. And yes i admit i rationally understand that and admit that i only half think that way and half am just frustrated. And also bitter that i never have energy reciprocated back towards me. it fucking sucks being alone all the time\n\nIt does, and I understand (firsthand). \n\n> I understand that people meet at work, through friends, meetups etc. But what i assume happens there that doesnt happen with me is a natural coming together in SOME way. Something that makes the initial encounter or event natural. I just never experience any natural opportunities in these various settings. Its more along the lines of me always putting effort into forcing an encounter. \n\nI think you are living with a distorted view or minor delusion here very similar to your previous statement about \"incredibly slim chances to actually meet someone as a guy.\" (and probably born out of the same very understandable frustration). Other men, at least on average and over time, *don't* have some kind of special \"natural coming together\" that you necessarily lack. All men basically have the following options for either meeting or being set up with someone: school, family, work, friends, wider social circle, neighborhood, hobby groups (including stuff like contra dancing), Meetups, bars/clubs, church, shared housing/roommates, creative ventures, online, out in public. \n\nI know of examples of success stories in all of these categories, including from my own experience. Sure, the more of these options you have in play the greater your chance of meeting a compatible woman, but it's not like all other men have *all* of these in play *all* the time. In fact, often one just has a few. You work with what you've got.\n\nMy guess is it's really something about how you're going about it that's wrong. I say that with respect and empathy, not harsh judgment, because I'd like to know you could change this. I'd bet that if we held your body, bank account, and IQ  constant and just somehow could upload a different man's mind into your head and allow that mind to control what you did, within a few months that person would have had some successful dating/romantic experience. \n\nI'm not sure what you're doing wrong. I'd be willing to review your profile if you want (PM it if you want), as that might provide some insight. \n\n> btw thanks for taking the time to engage with actual dialog and not just throwing out the typical, completely, unhelpful advice like. \"follow your passions that excite you!\" \"theres someone out there for everyone!\" etc etc\n\nYou're very welcome. I wish I had a time machine and could go back to when I was 18-30 and I'm sure I would have been much more successful with women than I was. Hindsight is 20/20 and all that. :D", "permalink": "/r/DecidingToBeBetter/comments/mtp9kx/how_to_fix_life/gv7tnbs/"}