{"id": "t5_2tand_t3_p4vgbg_t1_h93vasv", "creation": 1629080067, "origin": "t5_2tand_t3_p4vgbg", "height": 1, "replied_to": "t5_2tand_t3_p4vgbg", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "fluorescent_frogs", "text": "Hi friend, I’ve been in a similar place. For me it was a sport, instead of studying, but it all came crashing down and I had a loss of identity. Before I get into any suggestions, because you mentioned some suicidal thoughts as well as anxiety, PLEASE consider talking to someone about these thoughts. Someone like a therapist, counselor. Please take that first step! No shame. I did years of therapy during my issues.\n\nSome things that I found helped me, though I’ll warn that it’s a long process! Please be gentle with yourself. What kinds of hobbies do you enjoy outside of studying? What are things that you like about yourself? \n\nFor me, it helped to sit outside and be with nature. Nothing earth shattering, no goals, just sitting and watching and observing with no agenda or to do list. What do the birds do, what do the clouds look like, why do trees grow the way they do, and so on. I still do that, and my family laughs that I stare out the windows when I’m feeling down. It helps me “reset” and gets me out of a mentality of always having to accomplish stuff. I was also the 4am wake up kind of person, tons of school work, extra curriculars, etc. Just slowing down, observing nature, and doing some kind of hobby that’s for pleasure instead of a goal (like reading, knitting, photography) helped me feel more content and less anxious about missing out on stuff or like I should be doing more. \n\nRemember, you can’t be going 100% all the time. We all need to rest and recharge, and that includes mentally. You’re not lazy. We can only go full blast for so long. You are still just as valuable when you rest, as when you work. You have value just by being yourself! \n\nPlease take care, and be kind and gentle to yourself. Life isn’t a race or a competition. You are doing great! And just one more time.. please strongly consider talking to a therapist or counselor about these feelings - they can help WAY more than just me, some random person on the internet :)", "permalink": "/r/DecidingToBeBetter/comments/p4vgbg/i_want_to_learn_to_be_content_aside_from_external/h93vasv/"}