{"id": "t5_2tand_t3_h8sdcs_t1_fuuq092", "creation": 1592181210, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "sleepdrift3r", "text": "I’m terribly sorry to hear your anxiety and depression are so bad and have gotten to this level. I struggle with depression mostly and some anxiety, but my girlfriend deals with both and very bad anxiety. I’ve learned a lot from her and the extent anxiety can debilitate someone. I too struggle with conflict, even with being one to stand up for my beliefs or others, I still tense up and my heart starts racing and I get extremely sweaty palms. I think some just have a stronger fight or flight mechanism than others and it can cause conflict or anxiety inducing situations to be much worse. I went to group therapy for a couple years and individual for multiple. My therapist helped me a lot over the years, but eventually, just couldn’t offer me anything beneficial and usually made me feel worse. Therapists work really well for some and don’t work much at all for others. I’ve gained a lot of empathy and understanding for those dealing with either depression or anxiety from my experience firsthand over the years. I love to help or talk to others dealing with these dreadful diseases and usually I recommend them a few things that have helped me. \n\nI think therapy can work loads and antidepressant/anti-anxiety medication can work as well, it all depends on the individual. Because of both of them costing money, some not having insurance, some not having supportive or knowledgeable parents, and other things that may halt progress, I tend to recommend things most people can do no matter what. My advice would be to start a journal. One can do this any way they want or what is beneficial to them, but I think some main things to try and write on would be a gratitude list, what you plan to accomplish with the day and what you did accomplish, a quote for the day, how your physical and mental health is, what you plan for the next day, some habits to adapt, etc. That’s how I did mine. What’s really helped me a lot is reading (I switch between nonfiction and fiction), as well as stretching/yoga and meditation every day. Meditation and practicing mindfulness has helped me the most along with when I used to journal every day. Learning about various philosophies and ideals has helped a ton also. Namely, existentialism, stoicism, and Buddhism. i’m not religious in any sense, but spirituality has helped me a ton. \n\nreading I recommend is The Heart of the Buddha’s Teaching by Thich Nhat Hanh, Meditations by Marcus Aurelius, The Power of Now by Eckhart Tolle, The Stranger by Albert Camus, and The Four Agreements by Don Miguel Ruiz", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fuuq092/"}