{"id": "t5_2tand_t3_h8sdcs_t1_fuu895b", "creation": 1592171269, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": 38, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ScrappyAppleton", "text": "I used to be just like you. Honestly, it’s a lifelong struggle because sometimes when life gets hard it’s easy to revert back to that scared little kid. I’ve greatly improved and these things helped me: First, start small. Just break out of your comfort zone a tiny little bit. Don’t worry about confrontation just yet. If commenting makes you nervous go on something like r/aww and comment that someone’s kitten is so cute. That’s nothing for anyone to get offended by and you’ll get used to stating your opinion. Next, build up with small requests of people. Is your roommate listening to music too loud? Just very politely say hey, did you mind turning that down just a bit? Or if your take out is wrong nicely ask that it be made correctly. These are very difficult things to do when you feel so nervous to speak up. But remember, you’re asking nicely and it’s a small request. You’re as valuable as anyone else and if someone would give you an attitude, it’s not you.\nOne more thing and I’ll leave you alone: if someone does something that upsets you or if someone confronts you and you get anxious/are not sure what to say, remember it’s always okay, if possible, to stop the situation, take some time to organize your thoughts and get back to the person. Nothing wrong with saying “Hey, something happened a few days ago that I need to talk to you about.... or “ I really want to discuss this with you but I can’t right now, let’s talk again on... Remember this takes time and  practice. Don’t be hard on yourself because even if you were the most confident person in the world, people will sometimes react badly to you because of their own issues that have nothing to do with you.", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fuu895b/"}