{"id": "t5_2tand_t3_h8sdcs_t1_fuu988h", "creation": 1592171788, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ZibbidiBooDah", "text": "Nurture the \"small, silenced little girl\" in you. Let her know it's okay that she has felt scared, anxious, depressed, or any other feeling. Let her know it is okay that she's been quiet. The little girl you were as a child and an adolescent had to deal with verbal abuse during a time in life when she didn't understand what was really going on and she didn't know how to process her feelings surrounding the abuse. She did the best she could in her young mind to develop coping mechanisms to help her get through each moment she had to spend in that abusive environment. Let her know that she is growing into a strong young woman who is becoming more aware of her feelings and learning how to overcome the negative emotions that are still triggered by the fear of confrontation/conflict.\n\nAs a young woman, you have many more options now than you did as a child. You can choose when to participate in healthy debate, and you can choose when not to engage in worthless argument. You have many resources that you can use to help you understand what is happening, to learn how to overcome obstacles and move forward, and to help you rebuild your self-esteem that was \"worn down\" in your developmental years. These resources can be found in countless books, on the internet, and with supportive people online and, hopefully, in real life.\n\nLet your inner child know that she is no longer alone. She now has you to help her, to guide her, and to protect her when needed. If it helps, you might think of yourself as a loving big sister to your inner child or the best friend every girl needs.\n\nPerhaps above all, remember that you are not alone, as you've already learned from posting here. It's certainly not always easy, but try to focus on the overwhelming positivity sent your way and dismiss anything or anyone who doesn't serve you and the strong woman you know you can be.", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fuu988h/"}