{"id": "t5_2tand_t3_h8sdcs_t1_fusqhw9", "creation": 1592140616, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "The397thDoctor", "text": "Well done for posting about it - social anxiety can be crippling so posting about it like you have is something to be celebrated. I'm already proud of you.\n\nIn terms of how to overcome it: that journey will be different for everyone who goes through it, but I feel like I can confidently say the following will probably apply:\n\n- consider making peace with your past. After all, you can't change any of it.\nThis may even mean making a conscious effort to forgive both yourself and some other people. This is often something people resist because it feels like 'letting them off the hook', but really, forgiving people is something you do for yourself. Carrying around baggage, resentment, regret, anger and more is exhausting, and you need your energies for living in the present and for the personal growth you are hoping to achieve. Holding a grudge is like drinking poison and waiting for the other person to die.\n\n- slowly challenge yourself to push out of your comfort zone. The hardest thing about self confidence is that it doesn't really come from reading a book or a TV show or anything outside of yourself. It comes from getting the results you want out of life. \n\nRight now, if I'm reading you right, you are experiencing pain because you are scared to live your life as you think you should. You are asking what the formula is to allowing you to break free of this situation?\n\nWell, I think perhaps the only way to overcome that is to be brave and live your life anyway! By doing that, sooner or later you suddenly realise that the fear has begun to subside, even when things don't go to plan, the world doesn't collapse like it felt it would.\n\nBeing brave doesn't mean being fearless, it means being scared and doing it anyway. By doing you learn and get better at doing it, gain confidence and lose your fear.\n\nIt sounds over simplified and almost childish, but... \"The most effective answer to fear is bravery\" - I'm unaware of any other solution myself, but feel free to keep searching and let me know if you find something, please!\n\nI know it can work because I was once called a coward by a boss for similar reasons as you have described: I would rather please others and upset myself than engage in conflict which I found scary.\n\nIt meant that I didn't learn a grow like should. I was older than you when that conversation happened if that makes you feel better. I am now much better.\n\nIt may be that you're not ready right now to push yourself out of the comfort zone and be prepared to fail and go agajn, but own day you might decide that the pain of growth is less than the pain of continuing as things are - I know I did and while I've got miles left on my journey to being free of my anxieties, what anxieties I have left no longer have such a hold on me.\n\nPerhaps I've not articulated my thoughts perfectly, but if you see any value in what I've said and want to read more I recommend \"you are a badass\" by Jen Sincero. If the suggestion of a self help book makes you cringe like it did me then DEFINITELY read it haha. I don't believe in everything she talks about but she makes some great points.\n\nGood luck with your journey, how ever long it is.", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fusqhw9/"}