{"id": "t5_2tand_t3_h8sdcs_t1_fuujo0c", "creation": 1592177563, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "pharzon", "text": "So I struggle with wanting to be accepted by others and being overly sensitive about my interactions with them (online and IRL). And I have wondered why that is. I came up with an armchair pseudoscience theory that helps me and so I thought it might help you, too. It goes something like this:\n\nThose of us who fear rejection - for whatever reason - are experiencing a very legitimate fear. For most of our history as a species, we have been reliant on our tribe for survival. To be cast out of the tribe was to be alone, to have no help in finding food, water, or shelter; or protection from enemies. It was effectively a death sentence. That's even true to an extent, today. A child can no more provide for themselves than an isolated individual could on the Savannah 5,000 or 10,000 years ago. So when someone threatens to cut you out of your group, *especially* at a young age, you are experiencing an existential threat. \n\nNow, life has changed a bit in our modern times and maybe it is possible to go it alone now (if you have an income). But that fear will stay in you if it's not addressed. A therapist can probably help the most with this, so if there's any way you can find one, I encourage you to do it. If you can't, though, I would recommend learning about how we as humans process fear. It isn't rational. Threat processing doesn't even run through the same part of the brain as other inputs and thoughts. It runs through the Amygdala and it shortcuts most (basically all) higher thought processes, sending you right into fight or flight. There are not many ways to intervene in this process, but one of the best proven ways is the practice of mindfulness and meditation. Practicing to see the opportunity to intervene in this response opens up more opportunities to do so and thereby avoid the panic, choosing instead to react in a more meaningful and productive way. I would recommend Cognitive Behavioral Therapy as a way to pursue this - as other commenters have mentioned. \n\nI wish you well in your journey to be better!", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fuujo0c/"}