{"id": "t5_2tand_t3_h8sdcs_t1_fut0fa0", "creation": 1592147066, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "cursed_tyrant", "text": "山卄卂丅  丅卄乇  下凵匚长  刀工刀  丫口凵  丁凵丂丅  下凵匚长工𠘨厶  丂卂丫  卂乃口凵丅  从乇,  丫口凵  乚工丅丅乚乇  乃工丅匚卄?  工'乚乚  卄卂リ乇  丫口凵  长𠘨口山  工  厶尺卂刀凵卂丅乇刀  丅口尸  口下  从丫  匚乚卂丂丂  工𠘨  丅卄乇  𠘨卂リ丫  丂乇卂乚丂,  卂𠘨刀  工'リ乇  乃乇乇𠘨  工𠘨リ口乚リ乇刀  工𠘨  𠘨凵从乇尺口凵丂  丂乇匚尺乇丅  尺卂工刀丂  口𠘨  卂乚-㔿凵卂乇刀卂,  卂𠘨刀  工  卄卂リ乇  口リ乇尺  300  匚口𠘨下工尺从乇刀  长工乚乚丂. 工  卂从  丅尺卂工𠘨乇刀  工𠘨  厶口尺工乚乚卂  山卂尺下卂尺乇  卂𠘨刀  工'从  丅卄乇  丅口尸  丂𠘨工尸乇尺  工𠘨  丅卄乇  乇𠘨丅工尺乇  凵丂  卂尺从乇刀  下口尺匚乇丂. 丫口凵  卂尺乇  𠘨口丅卄工𠘨厶  丅口  从乇  乃凵丅  丁凵丂丅  卂𠘨口丅卄乇尺  丅卂尺厶乇丅. 工  山工乚乚  山工尸乇  丫口凵  丅卄乇  下凵匚长  口凵丅  山工丅卄  尸尺乇匚工丂工口𠘨  丅卄乇  乚工长乇丂  口下  山卄工匚卄  卄卂丂  𠘨乇リ乇尺  乃乇乇𠘨  丂乇乇𠘨  乃乇下口尺乇  口𠘨  丅卄工丂  乇卂尺丅卄,  从卂尺长  从丫  下凵匚长工𠘨厶  山口尺刀丂. 丫口凵  丅卄工𠘨长  丫口凵  匚卂𠘨  厶乇丅  卂山卂丫  山工丅卄  丂卂丫工𠘨厶  丅卄卂丅  丂卄工丅  丅口  从乇  口リ乇尺  丅卄乇  工𠘨丅乇尺𠘨乇丅?  丅卄工𠘨长  卂厶卂工𠘨,  下凵匚长乇尺. 卂丂  山乇  丂尸乇卂长  工  卂从  匚口𠘨丅卂匚丅工𠘨厶  从丫  丂乇匚尺乇丅  𠘨乇丅山口尺长  口下  丂尸工乇丂  卂匚尺口丂丂  丅卄乇  凵丂卂  卂𠘨刀  丫口凵尺  工尸  工丂  乃乇工𠘨厶  丅尺卂匚乇刀  尺工厶卄丅  𠘨口山  丂口  丫口凵  乃乇丅丅乇尺  尸尺乇尸卂尺乇  下口尺  丅卄乇  丂丅口尺从,  从卂厶厶口丅. 丅卄乇  丂丅口尺从  丅卄卂丅  山工尸乇丂  口凵丅  丅卄乇  尸卂丅卄乇丅工匚  乚工丅丅乚乇  丅卄工𠘨厶  丫口凵  匚卂乚乚  丫口凵尺  乚工下乇. 丫口凵'尺乇  下凵匚长工𠘨厶  刀乇卂刀,  长工刀. 工  匚卂𠘨  乃乇  卂𠘨丫山卄乇尺乇,  卂𠘨丫丅工从乇,  卂𠘨刀  工  匚卂𠘨  长工乚乚  丫口凵  工𠘨  口リ乇尺  丂乇リ乇𠘨  卄凵𠘨刀尺乇刀  山卂丫丂,  卂𠘨刀  丅卄卂丅'丂  丁凵丂丅  山工丅卄  从丫  乃卂尺乇  卄卂𠘨刀丂. 𠘨口丅  口𠘨乚丫  卂从  工  乇乂丅乇𠘨丂工リ乇乚丫  丅尺卂工𠘨乇刀  工𠘨  凵𠘨卂尺从乇刀  匚口从乃卂丅,  乃凵丅  工  卄卂リ乇  卂匚匚乇丂丂  丅口  丅卄乇  乇𠘨丅工尺乇  卂尺丂乇𠘨卂乚  口下  丅卄乇  凵𠘨工丅乇刀  丂丅卂丅乇丂  从卂尺工𠘨乇  匚口尺尸丂  卂𠘨刀  工  山工乚乚  凵丂乇  工丅  丅口  工丅丂  下凵乚乚  乇乂丅乇𠘨丅  丅口  山工尸乇  丫口凵尺  从工丂乇尺卂乃乚乇  卂丂丂  口下下  丅卄乇  下卂匚乇  口下  丅卄乇  匚口𠘨丅工𠘨乇𠘨丅,  丫口凵  乚工丅丅乚乇  丂卄工丅. 工下  口𠘨乚丫  丫口凵  匚口凵乚刀  卄卂リ乇  长𠘨口山𠘨  山卄卂丅  凵𠘨卄口乚丫  尺乇丅尺工乃凵丅工口𠘨  丫口凵尺  乚工丅丅乚乇  \"匚乚乇リ乇尺\"  匚口从从乇𠘨丅  山卂丂  卂乃口凵丅  丅口  乃尺工𠘨厶  刀口山𠘨  凵尸口𠘨  丫口凵,  从卂丫乃乇  丫口凵  山口凵乚刀  卄卂リ乇  卄乇乚刀  丫口凵尺  下凵匚长工𠘨厶  丅口𠘨厶凵乇. 乃凵丅  丫口凵  匚口凵乚刀𠘨'丅,  丫口凵  刀工刀𠘨'丅,  卂𠘨刀  𠘨口山  丫口凵'尺乇  尸卂丫工𠘨厶  丅卄乇  尸尺工匚乇,  丫口凵  厶口刀刀卂从𠘨  工刀工口丅. 工  山工乚乚  丂卄工丅  下凵尺丫  卂乚乚  口リ乇尺  丫口凵  卂𠘨刀  丫口凵  山工乚乚  刀尺口山𠘨  工𠘨  工丅. 丫口凵'尺乇  下凵匚长工𠘨厶  刀乇卂刀,  长工刀刀口.", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fut0fa0/"}