{"id": "t5_2tand_t3_h8sdcs_t1_fut6ola", "creation": 1592150638, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "getyourDintheD", "text": "~~It's not dumb. You're not dumb.\n\nHonestly an anxiety disorder is something that would really benefit from sitting down with a professional and working through it or on it enough so that you feel better equipped. I know that's a bit of a shitty thing to recommend in some ways 'can't talk to strangers just talk to a therapist lol', but honestly, it's something to really consider if possible.\n\n\nThere's a small note - this is a problem that you can manipulate, make better or worse through conscious effort. You are not broken for feeling this way, you are not irreparably damaged, you are not a finished story. Also, it can become worse *while* making a conscious effort to change. At no point does your value change. You are not worth less for dealing with this and you will not be worth more when you come out the other side. You are you, and that is enough.\n\n\nFirst off, what are you scared of when you post? Specifically. Are you in a position that a strangers opinion is so important to you that it will effect your mood? Or is it that if someone is negative or needlessly aggressive with you that it feels like they are confirming something you already thought? Anxiety disorders can meander with self-esteem issues, especially where there's some sort of negative experiences during formalisation or childhood period.\n\n\nSo, think on whether the fear of the interaction is being wounded or being wounded again where you have been hurt before. The reason I say this is I think it's important to frame where you're feelings here lie as much as possible. Not that they are static or anything, but changing this kind of behaviour is something that I think you'd have most success with by acknowledging or at least seeking out where the feelings are anchored while outside of the stressful situation itself.\n\nThere's so much more to talk about but I'm conscious you asked for advice and not an essay.\n\nBut, start small and try to figure out where that fear of negative interaction sits? It's so much more nuanced than this but just to put a skeleton on a way you might arrive at feeling like this\n\nChildhood criticism experience \n\n-> Feelings of self doubt as child \n\n-> carry to adolescence as now developed coping tool \n\n-> develop negative behaviours into adulthood  \n\n-> experience conflict between coping tools and desire to live as an adult\n\nWhere I'm going with the above is an attempt to explain that in experiencing anxiety in scenarios like posting on Reddit you may well actually be experiencing the byproduct of the coping tools you developed while having those experiences as a child.\n\nYou anticipate an interaction and get your tools at the ready. Just identifying this can be an achievement and can signify huge progress in dealing with it. \n\nAgain I'm rambling - I'll end with the above. But please, talk to someone. Be good to yourself.", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fut6ola/"}