{"id": "t5_2tand_t3_h8sdcs_t1_fuvpzc8", "creation": 1592206540, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "awakeinny94", "text": "I am one of the people you mentioned: outspoken, confident etc. My younger sister and boyfriend are not. Very anxious and will clam up at the slightest. We’ve found out a good way to handle their anxiety is to practice. Yes! You heard me, practice lol. Silly as it sounds, it helps. \n\nAbout two years ago when we started we went to a hotel. Now this was a destination hotel with ballrooms and entertainment and restaurants in the hotel. My sister went exploring and lost her key card. She was locked out of our room. My boyfriend and I were both asleep, we had been to a lantern festival and tired out went to sleep just after midnight.\n\nShe went to the front desk they said they couldn’t let her in. They said that she had to notify me. We had all checked in together to one of their bigger suites that sleeps 5. When we did, all three of us got a card each. The management didn’t call me on the room phone to wake me up. They didn’t ask for my sisters ID. We have the same last names. Also the room when we booked was checked for 3 guests. They did not offer to call the room. For some reason ( anxiety ) my sister never called me. Just texted to say she couldn’t get in. \n\nSo I woke up at 5am and not seeing her in her bed, panicked. Called the front desk and no one told me a thing!! I stayed up for two more hours sick to my stomach until my sleepy sister knocked on the door. Turns out she had checked into a smaller room by herself. When she told me that they kept her a while before giving her a room and no one tried to even contact me and she was brushed to the side\n-I tell you I saw red. Got really calm, gathered information and told my sister and boyfriend we were going to complain. They were anxious. But we had agreed to practice. So I called the front desk, asked for the manager and for a sit down. They patched me in to the managers boss. \n\n\nNow I do great with confrontation, I don’t mind it one bit. I was head of my debate team all through school. My current job is to speak with people. I was a little out of my depth at the hotel. It was a place we could hardly afford with a lot of nose up in the air business. But I wasn’t backing down. \n\nAt this point we had already checked out, our things were in the car and I requested a face to face with the managers boss. We sat down and I introduced us, said why we are here. My sister said her lines and so did my boyfriend. I gave the body of the issue, she said her second line ( she only had two). It was a success.\n\nAnother time recently, my boyfriend and I were doing laundry and we applied the same tactic. Someone working there was very rude. So we practiced calmly and he said his line and then I said mine and he said some more. Then we approached the person, explained what we were upset about. \n\nThere are some more incidences over the years but John and my sister always talk about the hotel. It was a big step. I think both have become better at anxiety around people. My boyfriend especially is so much better! My sister is also better. Big improvement.\n\nI guess what I’m saying is if you practice a little it helps.!\n\nEdited for syntax and tense.", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fuvpzc8/"}