{"id": "t5_2tand_t3_h8sdcs_t1_fusps61", "creation": 1592140087, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": 26, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mcsarah087", "text": "This is really hard and a lot of people struggle with this. People on the internet are just jerks sometimes because honestly it is fake socialization. We can't see each others faces or emotions and having that lack of detail really changes the game. \n\nI think that your fears have a lot of levels and there are a few things you can do.\n\n1) Temporarily stay off the internet or at least areas of the internet where you are subject to this anxiety. In general, avoiding our phones and technology is so much better for our mental health. If I start to get anxious in life I stay away from my phone for a few days and it really puts it into perspective that other people's opinions really don't matter in my day to day life. I take this time to focus on myself, eat right, exercise, meditate and do whatever I want with my time. I know this is all old advice but it's old advice for a reason. We can't be whole if we don't invest in ourselves and likewise we can't love ourselves or ever gain self confidence without this time.\n\n2) let's say you go online and see a shit comment from someone towards yourself. It is important to realise that this comment is not about you or what you said. If someone says something mean or thinks unkindly of you they probably dislike themselves way more than they dislike you. Nobody who has self esteem stoops to the level of putting others down. Something is going on in their life to make them feel like shit and you can empathize with that because you know how it feels. It is unfortunate that they choose your comment to release their suffering but it's not about you. When I really realized this I ended up having compassion for the troll which in turn boosted my self esteem and self love. Useful in the real world too. \n\n3.) Find a good therapist. Not just meds but a good therapist who can help you work through your past trauma. \n\n4.) You don't necessarily need to be outspoken and outwardly confident in order to actually be confident. I am a very quietly confident person. I dont engage in conflict because I am perfectly comfortable with who I am and what I believe. I have found that when I do speak up about something important to me because I need to, people listen. If you are someone who is sensitive to confrontation/conflict / causing a big stir than consider striving for this instead. We often think of confidence as this big, loud \"here I am\" type person but that has never resonated to me in my own life and you sound a lot like me before I earned my confidence. \n\nSorry this is so long, I hope you can find some peace in your life.", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fusps61/"}