{"id": "t5_2qh5i_t3_ij2v61_t1_g3dp1f9", "creation": 1598811221, "origin": "t5_2qh5i_t3_ij2v61", "height": 1, "replied_to": "t5_2qh5i_t3_ij2v61", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "JarethKingofGoblins", "text": "Why not?! This was one of my favorite parts of the book to research and write—understanding how platforms like Instagram can be deeply unhealthy for us psychologically while spaces like Reddit have shown trends in the total opposite direction. \n\n>Consciously or not, when we’re evaluating ourselves in social media, we’re comparing our complex lives full of ups, downs, and in-betweens to other people’s highlight reels. Evolutionarily, we’re trained to evaluate ourselves against our neighbors because we may learn useful information that way. If our neighbor is much more successful at growing crops than we are, it’s useful for us to peek over to see what he or she is doing differently. Or, more accurately in evolutionary terms, the people who peeked over to see how their neighbors were growing crops were more likely to survive than those who didn’t.   \n>  \n>People with more social awareness are better in tune with their groups, and humans’ tendency toward sociability is credited as an important trait for giving us competitive advantage over predators and other primates. Our close evolutionary relatives, the Neanderthals, were stronger than humans, evolved tools earlier than humans, and had larger brains than humans. But a prevailing theory of why the Neanderthals went extinct about 40,000 years ago revolves around the human capacity for sociability and coordination. Some researchers even suggest that human domestication of wolves — arguably an aspect of inter-special sociability — also played an important role in giving them the edge over Neanderthals. We’re acutely aware of our broader communities and how we fit into them — it’s a fundamental part of how we think.   \n>  \n>So when social media gives us this new “window” into the lives of our “neighbors,” and those neighbors exclusively post their life highlights, it’s easy for us to conclude that we’re less successful, less attractive, less happy, and so on. Ironically, being constantly exposed to these highlights has demonstrably negative effects on our mental health. Depression in young people has risen by as much as 70 percent in the last 25 years according to a recent study in the UK, and some researchers point to social media as the cause.  The same study showed that 63 percent of Instagram users reported feeling miserable after using the platform, higher than any other social media site. This study got something right that many social media studies don’t — it stratified the effects of different social platforms.   \n>  \n>There is a growing body of research about how social media affects mental health, but many of these studies lump every website or app with a feed into the category of “social media.” How social media affects our brains is an extremely important territory for research, but nuanced differences in social network structures manifest significant differences in user behaviors and mindsets. In fact, one study conducted by the University of Utah showed that people with serious mental disorders — bipolar, schizophrenia, and depression — improved as they participated in Reddit communities about those topics. By analyzing linguistic dimensions like positive emotion, negative emotion, and sadness, researchers observed that the language subjects used improved significantly in nine out of 10 categories over a seven-year period. Depressed people who participated in the r/Depression community became less depressed.", "permalink": "/r/happy/comments/ij2v61/six_years_ago_i_had_an_idea_i_thought_was/g3dp1f9/"}