{"id": "t5_2tand_t3_m8p3ud_t1_gsid4zo", "creation": 1616879706, "origin": "t5_2tand_t3_m8p3ud", "height": 1, "replied_to": "t5_2tand_t3_m8p3ud", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lulumeme", "text": "fair point. Im not saying to NOT quit done and not get clean. Not at all, my point was to do it when  you are sure about the questions i mentioned and you felt better before done and before addiction. Truth is, I was never happy, was very insecure kid with severe social anxiety and agoraphobia, no matter what i did, i always had these mental issues more or less, as if i was stuck and it was just natural state of being for me, the homeostasis.  hence no wonder,  i kept falling back to my depressive anxiety pit.  I was unhappy and depressed before addiction, i was even more depressed before done. I tried quitting many times the drug of choice and drugs overall, quit done once, quit all drugs and benzos and alcohol but i still never felt non depressed and normal naturally. No matter how many months i was clean the gradual improvement was still not enough and i had to accept that 'natural' is not always better. plenty of illnesses people suffer from if they choose the natural path because they hate being dependent on any drug or medicine or anything. Your body doesnt always resolve itself on its own, and is imperfect sadly.\n\nMy point was emphasizing that if youre not sure about quitting done and not happy, dont fall into the illusion of getting out of this pit without conscious and constant effort and work. The reason I preferred quitting cold turkey instead of tapering, even though its more painful, was because it was less work. I expected the problems to resolve themselves if i wait long enough and my brain receptors recover. But I didnt consider how big the non drug related and non addiction related factors were on my mental wellbeing. Before addiction my receptors were not desensitized or damaged in any way, they were technically in their most factory new stage lol, yet the first 24 years of my life i remember as tainted with constant moderate to severe depression, constant dullness and numbness, even though my reward circuits were still factory new as i havent touched drugs yet, so why wasnt it functioning properly?  Yet it was the most miserable time of my life. \n\nI clang to the \"my brain has chemical imbalance\" belief with no proof so hard, i was convinced  i just had to fix that one or another chemical imbalance and everything will resolve itself. But by that logic i should have been the happiest before any drug use, by that logic being on methadone would make my reward circuit so desensitized to natural reward i would be unable to feel any happiness at all. Yet as long as took done as prescribed, i was able to have happy moments, happy moods. Because the brain doesnt care if the opioid receptor is filled with methadone or endorphin molecule, as long as its filled and active, the neurons can talk to it and pass messages thru it.  \n\nQuitting done did not relieve me of the baggage and the unhappiness which i thought to be pushed on me by the mdone. So even 5 year daily 90 mg done is not enough to desensitize you to normal amounts of reward and the unhappiness was unrelated to methadone at all. It made sense at a time but i just hoped the done was at fault because i hear this 'its dragging me down' story and believed it. But it was unconscious effort to oversimplify the problem  as it would be nice if just quitting done would let me feel happy naturally again, but i never felt good naturally in the first place, so what can be even more supressing on the wellbeing and mood than being addicted on 90mg everyday methadone for 5 years? apparently unresolved emotion issues, loneliness, stress, need for therapy, neglect, past trauma, incorrect behavioural and thinking patterns and habits.  Shitty diet, lack of exercise but most importantly lack of responsibility and meaning in life as well as social bonding.\n\nthe moments you felt the most happy or satisfied and 'in the zone' was when you were into something meaningful (to you) and when you progressively move closer towards your goal, whatever it is. Serotonin tracks your status in social hierarchy and apparently being lower in the chain, like being jobless, broke and unable to succeed romantically will not only reduce the positive emotion you feel but intensify the negative emotion you feel and especially so the lower down the hierarchy ladder the more negativity you feel and the less serotonin you produce further intensifying sensitivity to negative motion and anxiety.  this is more powerful on wellbeing than methadone /suboxone.", "permalink": "/r/DecidingToBeBetter/comments/m8p3ud/being_sober_is_beautiful/gsid4zo/"}