{"id": "t5_2tand_t3_e4m97a_t1_f9e5z4e", "creation": 1575240096, "origin": "t5_2tand_t3_e4m97a", "height": 1, "replied_to": "t5_2tand_t3_e4m97a", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ThePublicJournal", "text": ">Will apologizing to Karr make you feel better? Maybe. But the more important question to ask yourself is will it make her feel better?\n\nI'm not sure. She seems like a sensitive person so even me being in her sights is what sets her mind off.\n\n>The purpose of an apology should be selfless. You’re trying to address the things that you did that made someone uncomfortable because you don’t want THEM to be uncomfortable. Not because YOU don’t want to be uncomfortable.\n\nYou might be right because to be honest, I mostly want to apologize make myself feel better at this moment rather than next year when I'm out of the district. As I've said before, I shouldn't be preoccupied on what other people think so I never really considered how Karr would feel if I tried to apologize.\n\n>So keep growing. Leave this girl alone. If you find yourself in a position to speak to her... \n\nThat's what I was thinking. I've always thought that the only way to redeem myself was to wait for that opportunity to happen, but I'm pretty sure it won't. That's why I wrote this because I'm contemplating about making that moment myself happen without waiting for coincidence to make it happen.\n\n>...the ONLY thing coming out of your mouth should be an apology, not an explanation, an apology... \n\nThat's hard chief. I really wish you weren't right on this but you are. Because in real life, people want to go straight to hearing the apology, not a story on why the person apologizing did what they did.\n\n>If she accepts the apology and engages with your friendship again there will be opportunities to explain. If she doesn’t then you know that it’s time to move on.\n\nYes. I hope graduating high school will help me move on, not just with respect to this incident, but almost everything I've done and been through. And I hope she moves on too, especially because I wouldn't want her to use this moment against me any further in the future. If I don't see her anymore, there is no reason for me to think about this.\n\n>Good luck!\n\nThank you very much for taking the time to read my story and write on it.", "permalink": "/r/DecidingToBeBetter/comments/e4m97a/i_harassed_a_girl_in_my_school_last_year_and_now/f9e5z4e/"}