{"id": "t5_2tand_t3_qae9qq_t1_hhajs5e", "creation": 1634683685, "origin": "t5_2tand_t3_qae9qq", "height": 1, "replied_to": "t5_2tand_t3_qae9qq", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "WatchingSpaceBattles", "text": ">But what hurts the most is that all that \"progress\" was not even real progress. So what if I lost over 20 pounds? So what if I learned new skills, got out and saw new people, can run a mile again, etc.? I'm still the same person beneath all of that.\n\nSo here we see someone who:\n\n* lost over 20 pounds\n* learned new skills\n* got out and saw new people\n* can run a mile again\n\nOn a subreddit called 'decidingtobebetter', this sounds an awful lot like 'better'.\n\nSo in what sense are you 'still the same person beneath all of that'? Yes, it is true that if you ignore everything that has changed, then nothing at all has changed. That is not particularly insightful or helpful. No, those things didn't address your aspirations for valuing yourself and being socially valued, but that's like saying getting your teeth cleaned is not 'real' progress because you didn't end up with a girlfriend two months later ('why not? I thought women liked a nice smile'), and that you therefore ought to embrace tooth decay.\n\nThere are better ways to think about yourself, and they are entirely possible, even if it doesn't seem that way to you.  I think you would benefit from professional help, where someone can help you frame yourself and your life and how you talk about yourself in ways which are better. For example:\n\n>I need to become a real, worthwhile, consequential person as quickly as possible to make up for my lifetime of failure.\n\nIf you actually believe this is true, if you believe that you need to become this, then *the solution is to go to therapy*. Tell them what you need to become and why. They will do their best to untangle things. If you're going to come up with reasons why you shouldn't go to therapy (how you and your life is just objectively this or that, so therapy won't work), don't tell me those reasons. Go to a therapist and tell *them* those reasons why you think therapy won't work, and see what their response is.", "permalink": "/r/DecidingToBeBetter/comments/qae9qq/how_do_i_stay_on_the_right_track_long_enough_for/hhajs5e/"}