{"id": "t5_2tand_t3_outs4t_t1_h75rmxo", "creation": 1627698878, "origin": "t5_2tand_t3_outs4t", "height": 1, "replied_to": "t5_2tand_t3_outs4t", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "nickDNR", "text": "i feel u buddy i used to feel the same way, but i realized productivity is a concept forced upon us since birth. past generations relied on productivity and tried to instill 'work ethic' on us because that's what they knew and thats how they lived. yes things are different in regards to working to make money, but if what ur concerned with is more-so free time, the thing that freed me was the realization that productivity = being.\n\njust be....Be Here Now....coloring in an adult coloring book is just as productive as gardening or learning an instrument or studying or meditating. if you spent ur free time in a state of presence and mindfulness doing something that causes happiness, that's more productive than spending an hour on Duolingo. your worth isnt tied to your ability to work or produce content or learn, you werent born to spend your life doing what you think needs to be done, you were born to exist, to have a body and have consciousness in that body. if spending ur time doing things that you THINK will benefit you but dont actively make you happy, they arent productive. if you spend half a day playing chess or skateboarding or even just allowing yourself to spend time on social media and at the end found you had fun  doing something that nourished your mind and soul, THATS productivity. \n\njust existing is enough buddy, and the fact u have agency to find a job is dope! but if you're board in your free time or feel guilty that you're not doing something 'productive,' it might mean you need to offer yourself more compassion and allow yourself to just have fun. what other reason is there to live if not to love life!", "permalink": "/r/DecidingToBeBetter/comments/outs4t/i_do_not_have_any_porpuse/h75rmxo/"}