{"id": "t5_2qh5i_t3_mdfixp_t1_gsb4rnt", "creation": 1616776925, "origin": "t5_2qh5i_t3_mdfixp", "height": 1, "replied_to": "t5_2qh5i_t3_mdfixp", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Cupcak3Face", "text": "Well starting at the beginning of this most recent employment journey, I was retaliated against at a company for speaking up about harassment taking place in the workplace, I was left unemployed for four months when they fired me for getting involved in all that. \nI applied to so many places and went to dozens of interviews and nothing stuck, I didn’t have a car so public transpo was one of my only options for getting to and from work, I went to the grocery store that had an easy bus commute near me during a hiring event they were having and was hired on the spot for part time work in an area I already had a lot of experience in. It was something and that’s all that mattered at that moment but it quickly turned into a very toxic environment with a lot of exploitation of the employees, I wasn’t interested in pursuing full time with how they treated people. \n\nI had some money set aside and had some more money added to that from a death in my family and I was able to get a used vehicle. I spent a lot of my spare time putting in job applications, tons that I didn’t want, some I did, just to get out of the environment that was making me so mentally and emotionally anguished. \n\nWith this particular job opportunity after putting in my application, I went to the store and bought something and introduced myself to the manager, he invited me to come back the next day and do an interview, the interview went really well and he called me the next week. I feel that showing my initiative and going into the store to introduce myself really made an impression during a time of all electronic applicants. \n\nMy advice is during the times where it feels like you’re treading water and not getting anywhere to just keep swimming. (Cheesy I know) but there were a lot of times in the past couple months I was in some dark places and staying persistent is what got me to a new place. Job hopping can be so tiring but I’m hoping now that I have something stable, full time, in an environment that’s not so draining I may be able to think about a future career and online school. I wish the best of luck to anyone out there pursuing making something with themselves or just bettering their lives in whatever ways they need to.", "permalink": "/r/happy/comments/mdfixp/i_got_the_job_i_really_wanted_and_start_monday_i/gsb4rnt/"}