{"id": "t5_2tand_t3_oln7hz_t1_h5fqfbx", "creation": 1626465675, "origin": "t5_2tand_t3_oln7hz", "height": 1, "replied_to": "t5_2tand_t3_oln7hz", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "onlypositivity", "text": "Holy shit it's like this thread was written for me.\n\nSo, I used to be in a real ugly place. Let's just say I drank too much, hurt a lot of people, and generally made bad life choices. Things were not going well. Then, I got a woman pregnant. Recipe for a shit life, not just for myself but for my kid, right there.\n\nThing I realized is, even though many of the problems I faced had their origins in others' actions (drinking etc in my mind was a consequence of those actions), the thing that mattered was my *response* to those stimuli.\n\nSee, we all have agency, no matter what our situation. Maybe we only have a little, maybe we have a lot. Point is, we *choose* our responses, our actions, and thus control the flow of our life within the boundaries of what is realistically possible.\n\nTo make a long story very short, I decided that I would control my responses, my proactive choices, everything going forward. I would make my agency work for me, instead of floating along wherever the winds took me. Rent was late and I was too poor to pay it? I'd figure it out.Car about to get repo'd? figure it out. I had to go without a meal so my kid could eat? no problem, at least my kid is eating. that's a win.\n\nThing is, you make enough of those choices, you bend your agency to your will, and you start reshaping the boundaries of what is possible in your life. Make no mistake, this is not some linear upward trajectory, and your choices *will not* always be the right ones, or even the best ones from the bad ones, because you're a person, and people fuck up. But if you stick to it, the \"graph\" of your life starts to change. As it changes, new opportunities and new choices become available.\n\nIf youre at the bottom of a pile of shit, you have two options - start digging, or get comfortable. You'd be blown away how many people choose to get comfortable, not realizing its a choice. Sacrifice. Struggle. Make as many right decisions as you can. Try not to *react* to bad stimuli, but rather be *proactive* about keeping on your path up that hill,, opening up as many future choices as you can.\n\nI lost 5 jobs in 10 years. I got paid more at each subsequent job. I made better choices, developed myself, grew into a man roughly the style of what I want to be, with plenty more work ahead.\n\nSuccess is not something you can just \"achieve.\" There is no end to the climb. it is a process you go through every day. It's living proactively, weighing your options, and making the best choice you can over and over.\n\nTry not to get hung up on if something sucks or not. Lots of things suck. Stubbing your toe sucks. Heart failure sucks. But if youre still breathing, you're still living, and if you're alive, you can consistently make the best choice from those presented to you.\n\nThats positivity. thats an optimistic mindset. nothing will ever be perfect, but if you put the effort in, things will be as good as they *can* be.", "permalink": "/r/DecidingToBeBetter/comments/oln7hz/how_do_you_see_a_life_problem_in_a_positive/h5fqfbx/"}