{"id": "t5_2tand_t3_q1b5ek_t1_hfes93b", "creation": 1633385903, "origin": "t5_2tand_t3_q1b5ek", "height": 1, "replied_to": "t5_2tand_t3_q1b5ek", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "the_talking_dead", "text": "Instead of talking to redditors, go talk to a therapist. Depression isn't just something you can generally shake off. You can have all the support in the world, the best life, and still get depressed AF.\n\nA therapist will help you develop your game plan for what to do when depression starts creeping in, especially if you don't deal with it all the time. That is somewhat harder because you can just wake up one day and know that day and the next many are going to suck.\n\nYou may also respond well to anti-depressants but keep in mind, then do take time and consistency to work well. It is easy to fall into a trap of trying to only take them when you feel bad but they take a while to cycle through the body.\n\nThings you can work on now:\n\n* Show yourself grace. You aren't choosing to be depressed but instead, your mind and body are reacting to an internal imbalance. You don't have nearly as much control as you think you do over how you feel. So getting angry at yourself for following a biological impulse you can't control is counter-productive and likely to only make you feel worse.\n* Remember that depression is often cyclic, so while you may feel bad today, you can know that in time, you won't feel this way. Sometimes, you just have to put your head down, remind yourself of this, and push through to do the things you know you need to. It will be hard, but you can do it. \n* Give yourself downtime to recharge. College can be a hectic time with school, social life, interests, etc. Plan downtime for yourself so that when it is a depressive streak, you have built-in time to not stress yourself out more. ings that will help boost your mood.\n* Get active. This does not work for everyone, but a big turning point for me was getting physically active. Take up jogging, or lifting, or CrossFit or whatever. Just move your body multiple times a week. It releases a bunch of good stuff in your body that will help boost your mood.\n* Get outdoors. If you can do your exercise outside, you will get that vitamin D from sunlight! This is good for the body, helps you get to sleep at normal times, and generally supports your mood and mindset. If you live somewhere with a gloomy fall / winter, then start taking Vitamin D supplements. A very high percentage of Americans are vitamin D deficient.  \n\n\nMost of all, remember that this is a process. There will be days of amazing progress and completely wrecked days as well. This is normal and you have to keep your mind on the big picture and not let a single day discourage you. It is completely possible to have a functional, productive life while dealing with depression, it just takes a good mindset and a solid game plan.", "permalink": "/r/DecidingToBeBetter/comments/q1b5ek/i_want_to_stop_falling_into_depressive_slumps_and/hfes93b/"}