{"id": "t5_2tand_t3_pjhs2d_t1_hc1afft", "creation": 1631088508, "origin": "t5_2tand_t3_pjhs2d", "height": 1, "replied_to": "t5_2tand_t3_pjhs2d", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "JGWol", "text": "I’ve felt this a couple times and I have gotten through it before.\n\nWhen I quit my engineering job and came back home, I was VERY depressed by it. I felt like I gave up on a five year long relationship with myself. I spent years trying to achieve a goal of getting my degree, and than moving out of the Midwest to a more exciting part of the country.\n\nBut I did. And all I discovered was that I am no happier anywhere else I go. Location doesn’t make me happier. There was months of euphoria, but once the novelty wore off, I felt like I was stuck in a new rut.\n\nComing home felt like being single again. I would see Facebook notifications of the beach and these highlights from living in Cali that would make me feel even more depressed. Until maybe three-four months in, I was starting to see the silver linings in accomplishing new goals in life and finding myself bartending, which has since been my new career.\n\nAnd, for almost two years, I felt great. Still had issues, sure. But I felt I had purpose. But the blues came back again a month after my 30th birthday when I broke up with my girlfriend. My businesses went into thin air and I found myself doubting the future again. The one I loved and trusted was gone. My job turning into monotony, and I’m left feeling like I’m back on a hamster wheel.\n\nHowever, as my therapist once told me when I lived in California.. you have to stop chasing the sun.\n\nFind what works for you and just stick to it. Not for four months, or eight, or ten. Give it a year, maybe two. Really be patient with not only your process, but that of the world around you. Your community, your family, your spouse and friends. You never know what might change tomorrow for the better or for the worst. \n\nFive months after my break up and I’m still in pain. Even laying here, my entire evening I have felt depressed. I also took the time to replace the inner tubes that both popped on my bicycle. I’ve been cycling 30-40 miles a week. And running a lot too. Also, I shaved my face completely and have realized how much of my jaw line came back. I’ve lost a considerable amount of weight since being single. I’m no longer stress eating in a relationship that kept me unhappy and sexually unsatisfied. I feel more motivated to be attractive and to take care of myself. My personal finances are the best they’ve been in years. My savings is the most I’ve had ever. And I’m making more money now than I did when I was an engineer in California.\n\nLet the suck wash through you. Feel the sadness. It’s an isolating feeling because no one else can mourn your losses in life but you. Your failures, your broken relationships. The future that will never come to be. It’s hard. But also remember: the future you envisioned for yourself was never one you pictured before you hit your highs.\n\nLet me explain that further.\n\nI’m personally broken up over the future I won’t have with my ex, or the engineering career that I had to run from for my own sanity, or the business I was proud of but ultimately had to end. But, there was a time before all these situations even became a reality, that I NEVER imagined I would be standing in them as tangible circumstances.\n\nI DID find my career in California. I DID have a future with my girlfriend, if even just for a year. I DID run a business. The only difference is, how long they lasted.\n\nBut the truth is, not everything In life is ours to keep. Things change. People change. We change. If I had stayed in California, I would’ve probably gotten laid off at one point or another. I also left in 2019. One year before the pandemic. My mental health was already in the fritz. Imagine how I would’ve felt if I had gotten locked into my apartment for months. Alone with no family to calm my nerves.\n\nOr if I did continue my small business with the partner I despised. His incessantly nagging girlfriend who always butted her way into our affairs and drove me absolutely crazy with her entitlement. Or if I accepted a large loan to propel the business, only to become financially tied in with someone I didn’t want to be around.\n\nOr, if I kept my relationship going with my girlfriend. Instead of taking charge and respecting my wants and needs in a relationship, I continued to let her dominate my sexuality and make me feel inferior and subdued. I would’ve probably eventually grown malicious or worse, became angry or violent. Instead I left the relationship at a peak level of frustration after months of unwavering compromise, and I allowed myself to leave with grace and pride instead of letting her get the last word in. I can let her feel stupid for letting me, who I believe myself to be a very good boyfriend, get away from her. \n\nSo, long story short, you are not forbidden from feeling depressed making the right choices. Because life will continuously give you no win scenarios. Damned if you do, damned if you don’t. It takes a strong person to push through hard decisions and get through the pain of the consequences. It’s necessary in order to thrive and become a person you admire and respect.\n\nBut it’s always going to be hard because you will have to sacrifice a lot of what you want In life. You’ll have to cut ties with the toxicity you love. And over time the only hope you can have is that closing those doors will open up better opportunities that serve your personal ambitions.", "permalink": "/r/DecidingToBeBetter/comments/pjhs2d/to_anyone_who_feels_lostlacking_motivation/hc1afft/"}