{"id": "t5_2tand_t3_p5qj8l_t1_h98adp6", "creation": 1629160909, "origin": "t5_2tand_t3_p5qj8l", "height": 1, "replied_to": "t5_2tand_t3_p5qj8l", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CompetentSomewhere", "text": "I'm not a guy so I'm sorry if it's not my place to comment, but your post resonated w me so I can't really help myself. I can't identify w the whole wanting to be more masculine thing, but I also am very fearful & timid so in those ways I can relate & I understand just how debilitating it can be. Maybe your case is different but for myself, it ultimately boils down to insecurities of the most unimaginable degree coupled w the belief that I will never be good at anything, or good enough in general, and that I don't even deserve to be. I'm still a complete mess so I'm not trying to preach at all, but I think that if you start to do things that will make you feel proud of yourself, it will start to help. Push yourself outside of your comfort zone, but just a little at a time. Do things to help boost your self esteem & to gain confidence from. Start small & make sure you consciously acknowledge all of your accomplishments no matter how insignificant they may seem at the time. Prove to yourself that you are just as capable, masculine & worthy as all of the other guys who you might encounter at a new job or anywhere else. Seek out those careers you want & you walk in there w your head held high & w the confidence that you deserve to have in yourself. Trust yourself that you can do it. And if it's a struggle at 1st, give yourself the same time, patience & opportunity to learn that I'm sure you would extend to anyone else. Don't allow little setbacks to define you or what you can or can't do or handle & trust yourself that you will figure it out. And if anyone at those jobs or anywhere else does complain about you in any way, just keep in mind they're the ones who should be ashamed of themselves for being the ignorant, narrow minded pricks that they so clearly are & that you are a goddamn rockstar for going after what you want & for trying something new. Please don't let anyone else tell you who you are, not even when it's your own harsh inner critic. Prove to yourself what you are capable of & who you really are & BE PROUD of any & all attempts that you are brave enough to make, even if they don't go exactly as you hoped they would. And if you're not ready for that just yet, it's ok.. as they say, fake it till you make it. You deserve to be happy & to live a good, fulfilling life. Please don't allow that fear to run the show anymore, take your power back☺️", "permalink": "/r/DecidingToBeBetter/comments/p5qj8l/how_can_i_toughen_myself_up_as_a_32_year_old_man/h98adp6/"}