{"id": "t5_2tand_t3_p5qj8l_t1_h992r67", "creation": 1629175063, "origin": "t5_2tand_t3_p5qj8l", "height": 1, "replied_to": "t5_2tand_t3_p5qj8l", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CasualSky", "text": "I think your timidness really shows by wanting to change yourself to accommodate others, who haven’t even expressed a distaste for you.\n\nYou’re acting as if you already lost, and the only way to win is to be what others expect. Even if you’re timid, I would rather work with that than some of the construction people I know. Timid isn’t bad. And being masculine doesn’t set you up for success.\n\nI think what you want to work on is social skills, not masculinity. And that will be it’s own process, but you can make progress! You’re already self aware about what you could be doing better. (eye contact) As someone with severe anxiety and painful self awareness, it’s hard to get out of my head in social settings sometimes because I’m thinking about all the things I’m doing wrong and what other people are thinking looking at me.\n\nFeeling comfortable in your own skin takes a lot of time, and there will be good days and bad days. There are lines we need to draw though so we can maintain self respect, and one hard line for me is to not change for others. \n\n“Becoming masculine so that you’re more accepted at a job site.” Does this seem like something that says you respect and accept yourself? You don’t have to change to be accepted by other men. And acceptance from strangers is not something we should chase, we find it within ourselves.\n\nMy advice, focus on eye contact and try to make some progress there. Even if it’s forcing yourself to be uncomfortable, it will get easier over time. Eye contact can make us feel vulnerable, but vulnerable isn’t bad. You’ll adjust to that feeling and then you’ll be a pro :) just keep focusing on one thing you want to improve socially, and you’ll make progress.", "permalink": "/r/DecidingToBeBetter/comments/p5qj8l/how_can_i_toughen_myself_up_as_a_32_year_old_man/h992r67/"}