{"id": "t5_2tand_t3_lv1l55_t1_gpae0jt", "creation": 1614596996, "origin": "t5_2tand_t3_lv1l55", "height": 1, "replied_to": "t5_2tand_t3_lv1l55", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I'm sorry to say that I absolutely agree with her regarding the accident and your questions about if the people responsible for that horrible trauma could GO TO YOUR WEDDING?\n\nJesus fucking Christ, what the hell dude. 'Hey do you want people who scarred you for life and aren't even sorry fucking up the happiest day of your life? Pretty please?' nah that was not okay.\n\nRegarding the abortion - with her trust in you rightfully broken, I'm not entirely surprised about how that went down. It's tragic, but that kind of decision, even when made willingly can end up deeply traumatic. Some women deal with it better than others, and some just kind of... break on it, even if they want it. There isn't much you can do while she heals or tries to heal. It's not uncommon to wnat to put everything to do with the trauma of it behind you - and unfortunately that includes you.\n\nClearly, you've had some communication issues all along, even if you weren't aware of it - but when I read this, the key thing for me was how HORRIBLE it was that you unironically asked if she's cool with your asshole family and when she understandably said no TRIED TO PRESSURE HER INTO IT. Whether you intended it or not, that's what repeatedly asking the same thing is.\n\nNo is a complete sentence. It should have NEVER taken more than one no from her for you to drop it - and while I don't know for sure, I suspect that had you done so, she wouldn't have pushed back with never talk to them again either. That to me seems like she was lashing out because she felt cornered.\n\nEverything else just compounded after the trust violation unfortunately.\n\nSorry it ended that way for you. Try to deal with your own issues, instead of fixating on hers - ultimately, you can only heal yourself and move on, you can't fix her, even if you want to.", "permalink": "/r/DecidingToBeBetter/comments/lv1l55/need_advice_stuck_she_blames_me_for_her_abortion/gpae0jt/"}