{"id": "t5_2tand_t3_ptl5om_t1_he0k3fa", "creation": 1632433360, "origin": "t5_2tand_t3_ptl5om", "height": 1, "replied_to": "t5_2tand_t3_ptl5om", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Admirable-District-9", "text": "Yes. Yes. For example, I actually do the dishes even though I have to force myself to do so, but I get distracted by thoughts while doing so, and take a bunch of time and when  I'm finished all I think is \"omg what if I didnt clean the dishes right\" \"what if the plates still have food on them even if I cant barely see it? What if bacteria starts to grow on them? What if I added too much dish soap? What if I digest it without knowing and get cancer?\". The whole process of cleaning for me is sooo exhausting (before, during and after), I hate it so much because I also feel like no matter how hard I try to clean them, it's not enough. And it feels like it's ruining my health. I even have to organize my thoughts before cleaning, I think \"ok first I'm gonna do this first... and then this and that\" but sometimes I'm like \"JUST DO IT\". I can go weeks without cleaning my room because, even if I hate dirty spaces, sometimes it seems better for me to do so rather than obsessing about cleaning. There's a window right in front of the sink where I wash the dishes, and through that window my neighbor from the other building can see me. I also feel exposed, and insecure because of that. But yeah, the main problem I have is procrastinating and feeling stressed and paralyzed everytime I feel like I have to do something and my mind shuts down and I start acting weird and look for silly distractions like excessive porn, youtube videos, celebrities etc. It's got me to a point where I cant have a healthy routine, I struggle with brushing my teeth, taking a shower, eating what I need to eat, getting enough sleep. I haven't bought new clothes in years, I almost let an amazon gift card expire because It was so exhausting for me to choose and buy a product. I told myself in 2020 that I was going to start investing, its almost 2022 and I have no idea where to start cause Idk what to choose. I'm never pleased everytime I get a haircut. Spend time watching myself in the mirror before going out, and before leaving the car. I always feel indecisive. I think its a combination of depression ocd adhd social anxiety and body dysmorphia. But even thinking about going to a professional makes me worried because Idk how much I can afford and how many sessions/attention I need. Even this comment makes me worried \"what if I didn't explain myself right? This is the third time I edit this. It never ends", "permalink": "/r/DecidingToBeBetter/comments/ptl5om/whenever_i_want_to_do_anything_i_get_paralyzed_by/he0k3fa/"}