{"id": "t5_2tand_t3_pr0aho_t1_hdikcer", "creation": 1632087634, "origin": "t5_2tand_t3_pr0aho", "height": 1, "replied_to": "t5_2tand_t3_pr0aho", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Vetrioq", "text": "Lmao.\n\nThis whole, “if you don’t agree with everything I say you must be a horrible disgusting human who wants to hunt down brown folks and tie them to trees or burn all the gay people at the stake” take is a bit reductive, dontcha think? \n\nCare to explain without the crushing amounts of assumed superiority why this take is any different? Sure, there are historical and cultural reasons for why POC (African Americans in particular) are more predisposed to crime. What I find interesting is the assumption that there cannot possibly be social and cultural reasons at play with the prevalence of violence towards women from males. Further than that, even if males are genetically more predisposed to aggression and violence than females, does this logic make sense then? Certain mental disorders make people more prone to aggression, and yet if you make off-handed comments about how you cowered in fear every time you saw one of those people on the street people would rightly think you were an asshole. \n\nWhy are some generalizations okay while others aren’t? Why would genetic predisposition as opposed to cultural/historical origins make any difference? The facts on the ground are that men are more likely to be violent as are African Americans than their respective counterparts. It doesn’t seem any more okay to me to generalize about random men on the street than it does to generalize about a random black person.  \n\nOC literally said “…without fearing for our lives, like we do when we speak to men”\n\nLet’s switch that up. Some old white dude at the bar says “white privilege = being able to speak to other white people without fearing for our lives, like we do when we speak to black people”\n\nHow does that read? Sound really nuanced and well thought out to you? \n\nTl;dr this take is insufferable and it’s disheartening to know people who probably agree with me on almost every social issue haven’t thought about why they hold those views at all.", "permalink": "/r/DecidingToBeBetter/comments/pr0aho/being_social_about_to_go_out_to_a_bar_by_myself/hdikcer/"}