{"id": "t5_2tand_t3_7xb3cq_t1_du6y5md", "creation": 1518547427, "origin": "t5_2tand_t3_7xb3cq", "height": 1, "replied_to": "t5_2tand_t3_7xb3cq", "down_vote": 0, "up_vote": 153, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "karzbobeans", "text": "Sure ive got one.\n\nI didnt graduate college until 26. At 23 i was still in school and slacking off and my dad was paying for everything. I went slow through college and was frequently depressed and unmotivated. I had very few friends and escaped reality playing video games and drawing. My dad went unexpectedly broke and left the country to work overseas. His posessions were all gone and i had 2 weeks to find a job and pay rent. I got a job as a web developer for a very small salary because i had to drop out of college and had no experience. I actually didnt drop out properly and failed a bunch of classes so i thought i had screwed the college road up permanently.\n\nI learned the value of money and work and times were very difficult for a while. I eventually found out about a \"grade forgiveness\" program and when i went back to school at 24 i turned those F's into A's because i changed my attitude. I also started making a small game project of my own just for learning.\n\nI graduated at 26 and felt a sudden urge to leave my hometown behind and start a new life. I always had aspirations to go to California and work for a big game company but up until then it felt like a pipe dream.\n\nWell when i had my diploma in hand, i packed up everything that i could into my tiny car and gave my furntiture away. I drove to los angeles and stayed in the cheapest motel i could find. I didnt have much money and time was short. I applied to every game company i could and tried to show employers my game project so i wouldnt get tossed aside for lacking experience. I got plenty of second interviews and thought i finally had it in the bag but was turned down last minute.\n\nAfter 2 months i was about broke but i didnt give up. I decided id rather be homeless pursuing the life i wanted than comfortable in a life i didnt want. I bought 2 books on how to interview better and read them cover to cover while working on my game. I used that knowledge to really seal the next interview and i showed this next company my game project. They loved it. I got the job and found myself working for Disney as a game programmer.\n\nMany moments i thought i wouldn't and couldn't make it. There were many times i felt like a useless piece of shit. I had to look at myself critically and work hard to change my circumstances. Somehow i did it. If i can, im sure plenty of others can.", "permalink": "/r/DecidingToBeBetter/comments/7xb3cq/anyone_have_any_true_comeback_stories_that_can/du6y5md/"}