{"id": "t5_2tand_t3_7xb3cq_t1_du7y5gt", "creation": 1518584447, "origin": "t5_2tand_t3_7xb3cq", "height": 1, "replied_to": "t5_2tand_t3_7xb3cq", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ILoveEspressoNmoney", "text": "Yes I have one that may work,\n\nI was a drug user at 16, didn’t get into anything harder until 17, started doing LSD and Mushroom as well as smoking weed every day. That may be fine for someone more mature but at 17 it messes with me. \n\nI ended up being admitted to a psych ward where I received a misdiagnosis of having bipolar. I was on psych meds for years and struggled HARD. I attempted suicide twice and called an ambulance for myself both times. My life spiraled out of control and before I knew it I was doing harder and harder drugs. I ended up 19 years old addicted to crystal meth and homeless. I was a drug addict to the core and hit absolute rock bottom.\n\nNow for the comeback - after I spend 4 months in rehab I rejoined society. I was 20 at this point and started working as a barista, I was timid and anxious and kept what I had been though a complete secret to everyone. I met with a doctor to told me if I wasn’t clean for 2 years from illegal drugs I couldn’t be diagnosed bipolar. So I stopped taking the psych meds and I haven’t for the last 6 years.\n\nI stumbled across a personal development book called “Awaken the Giant Within” by Tony Robbins. I decided to purchase it on a whim and applied some of the concepts. Book after book I read i didn’t see anything changing at first... all I knew I made a CONSCIOUS decision to be better.\n\nI quit my 5 year pack a day smoking habit, starting lifting weights and got promoted at my job. A year or two later I got promoted again and my confidence started rising and rising. I kept reading personal development books and applying the principals.\n\nAt this point I’m 23 and have been lifting 3 years and it shows. Being consistent has really paid off. I meet the love of my life and we move in together. I’ve never been this happy in my entire life and I know I’m on the right track.\n\nFast forward to today. I’m 26 and I am completely independent and make 140k+ as a mortgage broker. I live with the woman I’m going to marry and love with my whole heart. We live in a beautiful apartment on the waterfront in the city. We have a puppy and I drive a new sports car. \n\nLife can be crazy but one thing I know is if you decide to be better and commit you can do it!\n\nTLDR - Went from a homeless crystal meth addict at 20 to a young success at 26. ", "permalink": "/r/DecidingToBeBetter/comments/7xb3cq/anyone_have_any_true_comeback_stories_that_can/du7y5gt/"}