{"id": "t5_2tand_t3_7xb3cq_t1_du6zewi", "creation": 1518548569, "origin": "t5_2tand_t3_7xb3cq", "height": 1, "replied_to": "t5_2tand_t3_7xb3cq", "down_vote": 0, "up_vote": 41, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "itty53", "text": "Short pick me up story:\n\nAbout 8 years ago I was a raging alcoholic, living alone in a trailer with basically no food other than alcohol and the occasional loaf of bread that I'd bake (cheap!). I had been in a cycle of depression for many years prior. I had DUIs, had no license, no job, I sold weed to get by and even that was drying up quickly. \n\nI met someone. She -- for whatever reason -- fell for me. I wasn't looking for anyone, I'd been burned hard already (and that started that depression cycle, but I digress). But we ended up together. \n\nShe moved in. She was working, I still wasn't. I began writing, a lot. Got a few published articles, nothing major, but it wasn't going anywhere. I decided to try my hand at programming and web-development again (it'd been a few years but it was an old hobby of mine). Built a nice reservation system, tried selling it to a few businesses, nothing came of it. This went on for almost two years.\n\nOne day that girlfriend and I got into an argument about me not working. But it wasn't easy. In an angry huff I went to Craigslist of all places and responded to someone looking for an in-house web developer. It was a two-sentence, no information blurb. I thought \"this won't go anywhere but at least I can say I'm trying!\".\n\nI was asked to interview the following day. I went. And it was for a small ad agency about an hour away. I took an IQ test, did the interview, and was hired on the spot. \"Can you start Monday?\"\n\nAnd that's where I've been since. Happily. And the agency here loves me too; I'm the best developer they've ever had. Pay is great, raises are consistent each year. When I started I didn't even know the language they were building in, I had to learn. But I knew I could. \n\nSince then I married that girlfriend, bought a house near the office I work at, and now have a 3 year old son. It's a totally different life. It wasn't long ago. If I could take my 30-pack-a-day beer habit at rock bottom and come out of it, anyone can. ", "permalink": "/r/DecidingToBeBetter/comments/7xb3cq/anyone_have_any_true_comeback_stories_that_can/du6zewi/"}