{"id": "t5_2tand_t3_7xb3cq_t1_du7w3j3", "creation": 1518581723, "origin": "t5_2tand_t3_7xb3cq", "height": 1, "replied_to": "t5_2tand_t3_7xb3cq", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Manofmolten", "text": "At 19 I was trying and failing community college. Always struggled with school. Not the concepts, but the system itself. I was bright but had zero motivation. Socially, I was a bit of a mans man/funny guy mashup in high school. \n\nSo, I'm a decent looking guy and had a gf my senior year of high school. After summer she went to college a few hours away and I stayed home because I was academically unmotivated. I got a job pushing carts at a grocery store in high school and was currently paying for my gas to get to work/school, while barely affording tuition at our local community college. That was all my money paid for folks. \n\nYou can imagine what happened next. My beautiful gf was in a distant college as a freshman. I was ignorantly thinking we'd make it work and get married and life would just happen for me....\n\n She told me she wanted to end things because the distance was going to be too hard. (The nice letdown) I was adamant I could make it work. She then gave me the toughest pill I've ever swallowed.       \"Listen, you aren't going to college, not real college. You're not making any money. You're living with your parents. I don't want to be the cart boys girlfriend. I'm breaking up with you.\" I literally wept hard. Full on sissy mode, like Alice and wonderland, filling up the room tears. She slautered me.\n\nIt was tough for a couple months, took it day by day. I'm not talking about the breakup though. The toughest part was seeing such a brutally honest reflection of myself for the first time. How unvaluable I was to someone I thought I was so close to. \n\nI then learned about people making money in construction without a college degree. Hands on stuff. I thought, great sign me up! So I dug into it and decided to start a 9 month welding program in the Midwest. I moved away on a loan and started school. I had nobody around that I knew, no connections, and no familiarity to the area. I was right where I needed to be.\n\nI focused harder than I ever had in my life, fueled by the bitter memory of my gf and her brutal evaluation of my life. I had purpose. I was required to go to class for 5 hours, 5 days a week, with one Saturday optional each month. I went 10 hours each day and EVERY DAMN SATURDAY. I was excelling and it was because of my newfound purpose. \n\nI graduated top of my class, and could weld anything you threw at me. I moved home and literally had a job locked down within the first few days. My overtraining didn't just help my skill, more importantly it solidified my confidence. For 6 years I worked and climbed to the top of the company. \n\nThe entire time that I was working, I was doing lots of out of town work. I had way too much time on my hands in the hotel rooms during the week. I wasn't big on drinking and watching tv got old. That's when everything came full circle and I discovered of all things, my love for learning. THE SAME THING I DETESTED MOST OF MY LIFE.\n\nI crammed so much knowledge into my brain over those years it was ridiculous. First it was random 'cool' information. Then I was interested in knowledge with application, particularly financial and business. So I started the long road where I am now.\n\nI managed to buy a home at the age of 20, and broke 6 figures in my 401k by the time I was 24 years old. I have been on many vacations, and enjoyed many many good times with friends. By 26 I am newly running my own business and have a rental home as well as a home to live in. My assets are well diversified and plentiful. My 401k is fully funded as is, with no more contribution needed. And if you're aware of r/financialindependence, I'm on my way to retire early. \n\nSo I would say, without a brutal torn down look at myself, I wouldn't be where I'm at today. Oh and of course, getting so bored that I learned to love learning was a huge plus! Every time I've grinded my hardest to achieve a goal, my life hurdled the farthest in a positive direction. That much I know for sure.", "permalink": "/r/DecidingToBeBetter/comments/7xb3cq/anyone_have_any_true_comeback_stories_that_can/du7w3j3/"}