{"id": "t5_2tand_t3_kw6bfz_t1_gj3gvzs", "creation": 1610528234, "origin": "t5_2tand_t3_kw6bfz", "height": 1, "replied_to": "t5_2tand_t3_kw6bfz", "down_vote": 0, "up_vote": 16, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "make_me_a_good_girl", "text": "First, every person's story is one-sided. Unless you are depressed, few people are inclined to paint themselves as the villain of their own story. Do you think my ex walks around telling people I left because he is a habitual liar, a gaslighter, that he cheated on me with a supervisor at work who gave him promotions, as well as other women when he was on the road? No. Of course not. Even in our years of couples counseling, he could never say he was a liar. Liars are bad, and he isn't bad. He just didn't tell me the whole truth, or \"wasn't completely honest with me\" or similar euphemisms. He never apologized for lying to me, he would simply say that he didn't lie to me very often. For a woman that can deal with the lies, he would be a catch. That's not the kind of relationship that I'm able to be in.\n\nSecond, I made more money than him by about 5% when he was cheating. I am curious why it is always assumed that women make less than the men who get stressed at work and lose their libidos, or who fuck around at the office while pretending they are too stressed to fuck.\n\nA few other details: I used my days off of work to clean our home, run errands, plan and cook our meals, do laundry, and do yardwork so that he could go to rec league sporting clubs, or come home and watch tv,.or play video games without me (I am a gamer, he would insist on playing things we couldn't play together). \n\nI told him about my on-line NSFW escapes, I asked if I could have dirty pen pals and he said he didn't care, he had the password to my phone and was welcome to read any of my messages or interactions with people. He had an affair years before and I forgave him for it. \n\nI suggested we could try an open marriage. He told me that he didn't like the idea of sharing me. Turns out he likes the idea of sharing himself, though. He lied to me about his intentions and desires when I had given him  the option to legitimately have what he was already deceptively taking. That was not good enough, apparently.\n\nYes, I was drawing my self worth from external sources. It is a problem that I am working on. I have codependency issues. Also, after half of my life of being lied to and manipulated by the person that I trusted the most *not* to do those things to me, I have some CPTSD triggers and emotional flashbacks that really fuck me up. I'm working on them. I'm working to find value in myself, on my own. Part of that journey is this step of unsubscribing from things that are not helping me anymore.\n\nWe were both at fault in our marriage, you are correct. It takes two to save one and it takes two to make one. I didn't establish boundaries when I should have. I didn't press the issues around unequal contributions around the home even though we both paid exactly the same into our household savings and against our bills. There is blame on both sides, there always is.\n\nI don't know that I will have a next husband to worry about. Maybe it will be a next wife. Maybe marriage isn't something I am able to see myself doing again after how expensive and heartbreaking it has been to leave someone I thought I was building a life with. Maybe I don't deserve to even attempt to date anyone until I have my shit figured out. I don't know. One impossible thing at a time. \n\nToday's impossible thing was removing a large number of bad influences from my Reddit feeds. Tomorrow's impossible thing may be doing an extra 10 minutes on the rowing machine. I don't know, but I'm finally moving in what feels like a positive direction.\n\nI'm not saying I am perfect, or that I had a perfect past. Nobody is perfect, and there is no such thing as a perfect life.\n\nStep by step, day by day. Deciding to be better. It is all we can do. Good luck on your own journey, whatever it may be!", "permalink": "/r/DecidingToBeBetter/comments/kw6bfz/today_i_unsubscribed_from_over_400_nsfw/gj3gvzs/"}