{"id": "t5_2tand_t3_kw6bfz_t1_gj8vmrs", "creation": 1610644408, "origin": "t5_2tand_t3_kw6bfz", "height": 1, "replied_to": "t5_2tand_t3_kw6bfz", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "make_me_a_good_girl", "text": "Thank you, I literally have personal contact cards that say \"awesome\" on them after a friend suggested it once. Haha. Fake it until you become it, right? :P\n\nI am not a perfect person. It took me over a decade to get counselling for the sexual assault that I experienced at the hands of someone I trusted when I shouldn't have, all while living overseas and away from my support network. I had some things that would set me off, and we just didn't talk about them because both of us buried it.\n\nI didn't suggest that we see a couples counsellor until I was pretty much already gone, and he wasn't ready to talk about things yet so the timing was all wrong.\n\nI would bottle things up, not wanting to rock the boat, and let them build until I was so upset that I couldn't have a calm conversation about my feelings. I didn't talk to friends and family about our issues because I wanted people to see his best side - and because part of me suspected that they would tell me to leave if they knew the hard parts of our relationship.\n\nI would get angry at my spouse and then say things to gently embarrass him in front of friends. He would state that the stories I recounted were not how they really happened, that I was remembering it wrong or revising history to fit a particular narrative. I looked pretty freaking crazy to some people, I'm sure.\n\nAt one point, when I realized that my ex was going to keep having affairs and lie to me about them, I thought it would be a good idea to just have my own affair, and we could have each other for stability and APs for our sexual needs. Ruined an otherwise great friendship by propositioning someone that seemed like they were in the same boat - they were appalled and wanted nothing to do with me ever again, rightfully so.\n\nI overthink things. I have high expectations, but somehow also low standards. I somehow make people feel like it is unsafe to be brutally honest with me, even though I try to be upfront about how that level of \"so honest it hurts, so honest it is selfish\" is all I want from people.\n\nI have tons of patience, right up until I run out of it. I am slow to forgive unless I see genuine remorse for the actions that I feel wronged me, intentional or unintentional.\n\nIt is possible to be an awesome person, and to also be a crappy person at times. It is possible to be an awesome person in a crappy marriage. It is possible to have an awesome marriage most of the time, but have deep problems that surface occasionally and that, when you finally address them, are not able to be resolved.\n\nI am able to be awesome and also to share in the blame. The relationship was between two people, and it takes two to tango and two to let it fall apart.\n\nThank you for your kind observations, but I felt the need to challenge your black and white outlook on relationships and why they end. It is just as grey as how they begin. Everyone involved has a different memory of how the couple first met, or first got together.\n\nPeople are complicated. Relationships and friendships are complicated.\n\nKnow your worth. Value your time. Spend it on the people that make your life better, and whose lives you feel you can make better. Don't waste time on people that don't reciprocate. If they wanted you in their life they would give back.", "permalink": "/r/DecidingToBeBetter/comments/kw6bfz/today_i_unsubscribed_from_over_400_nsfw/gj8vmrs/"}