{"id": "t5_2tand_t3_lumr0v_t1_gp8j5q2", "creation": 1614551510, "origin": "t5_2tand_t3_lumr0v", "height": 1, "replied_to": "t5_2tand_t3_lumr0v", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "gobble4victory", "text": "I’m just old enough to have worked hard for multiple long term goals and achieved them. Academic, career, financial milestones, check. Took up running, hit some big goals, check. Travel to other continents, check. Status and acceptance.. sort of, I guess, technically.\n\nTakes about a day and then I’m empty. It’s just what happens, and it’s definitely not just you and me.\n\nLearning to nourish casual interactions with people into friendships changed my life. I did the other things.. got interested in cooking, bicycles, did a ton of reading, sat in with different spiritual groups (as an outsider)... still, just taking the risk of learning peoples’ names and trying to learn about them and even inviting them to eat dinner or hang out on my porch has really filled in those gaps. Terrifying for me. All of those friendships took effort, and started from nothing. It took me a long time to figure out that adult relationships don’t just magically happen. They take effort to cultivate everyday. I thought some people just “had a bunch of friends” and, I didn’t know it’s actually a skill! I kind of bungle my way through it and nobody seems to mind. Authenticity trumps status, I think.\n \nI’ve been out of school for almost 20 years and I STILL get twangs of guilt when I spend a whole Friday night out doing normal social stuff. How fucked is that?!\n\nCould be an American thing or an academia thing, but I feel like I get fed messages every day about achieving things, and The Dream, and someday we can Arrive if we just work hard. If you’re wired a certain way, you’ll achieve the shit out of those goals with single-minded focus, one after another. And then... meh.\n\nI’m just the internet, but truly I think you’re on the right track here, so keep it up.", "permalink": "/r/DecidingToBeBetter/comments/lumr0v/trying_to_fight_the_emptiness_in_small_ways/gp8j5q2/"}