{"id": "t5_2tand_t3_jz1q69_t1_gdb2ego", "creation": 1606111197, "origin": "t5_2tand_t3_jz1q69", "height": 1, "replied_to": "t5_2tand_t3_jz1q69", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "paragonemerald", "text": "Big props to you! Stay the course, keep affirming yourself, keep trusting yourself :D\n\nI think I was about your age when I was publicly testing the boundaries of my gender expression for the first time. I'd been unhappy with my appearance for a long time through my teen years. Your story of bleaching and changing your hair really resonated with me. I think I was 12 the first time that I bleached my hair; it was long   \n(CONTEXT: I'm AMAB, so people thought of me as a boy back then. Five years ago I came out as non-binary and have lived my truth ever since)  \nand so now I had this huge head of golden hair, instead of my normal dark hair. The roots grew out and my brother cut it short, then eventually we cut it again so the blond didn't show anymore. Throughout high school now and then I latched onto opportunities to break conformity, by wearing outlandish thrifted clothes, or even a very feminine dress, on a regular school day.  \n\nI had my ups and downs along my life but I'm so grateful that I kept moving forward. As my graduation from high school gave way to my gap years (two of them), my self-consciousness and fear about my likeability (lovability) became pretty intense, and when I went to college, I entered an acting program where while there was lots of acceptance of lesbian, gay, and bi identities, really breakdown of gender was pretty taboo, so I felt an intense pressure to conform to a masculine style, and I kept being cast as *Man's Men* in our scenes and plays. This time involved traumas that were hard for me to process productively during the intense grind of my school years, working part-time at multiple jobs, going to school full time, and working full-time for the theater for free as an actor and stagehand for college credit. I dropped out at the end of my sophomore year when I was expelled for a mistake that I made in the midst of this stress and chaos. \n\nI'm in my late 20s now and I never went back. I drank a lot after school, and I shut down emotionally, and I just ran down back roads and cried. Eventually I got work at a good business that was run as a co-op, with equitable ideals and standards, and a very loving environment, and I moved out on my own and started working for my rent and my food all the time, and this changed a lot for me. I had one really bad night, living in a rooming house, and I couldn't process or cope. I almost killed myself chugging a bottle of wine in ten minutes and spending the rest of the night terribly sick. I never drank again, and I found a therapist. Recovery from my addiction to alcohol led me to the revelation about my gender: I'm always going to be worthy of love, and able to make something worth living for out of my life, regardless of what I can do for other people. I found out that summer that I don't have to \"Be a man!\" to be loved, or to have work, or friendships, or happiness. I've been one of the luckiest trans people I know. I've still gone through all my great share of tears, had coworkers, bosses, and people that I thought were friends ridicule me, harass me, or disrespect me. But I define who I am, not my society, not my genetics, not my birth, me.\n\nI hope that you can keep your heart in your hands, and keep showing your beautiful bravery to god and the universe and the people of the world. Keep your head shaved, or grow it out later when you want to. It's your hair, not anybody else's. \n\nLast tidbit, before I ever came out or cracked my shell, I used to watch live performances of Lady Gaga's \"My Hair\" and cry at my desk. I still probably could, but I used to too.", "permalink": "/r/DecidingToBeBetter/comments/jz1q69/i_shaved_my_head_and_now_im_struggling_with_my/gdb2ego/"}