{"id": "t5_2tand_t3_m0hroi_t1_gqawx33", "creation": 1615272192, "origin": "t5_2tand_t3_m0hroi", "height": 1, "replied_to": "t5_2tand_t3_m0hroi", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "GonnDir", "text": "I thought about it but then I thought I just make it readable in a flow so that you won't be bored, bc I'm usually the same like you.\n\n\n\nTLDR EXTREME MODE:\n\nTried to fix myself and thought my consume of weed porn and stuff like that would be the problem.\nTurns out it wasn't. Turns out abuse destroyed me and I didn't see it. Giving in stupid stuff would be the symptom not the cause but I needed at least 5 years to realize.\n\n\n\nTLDR HARD MODE:\n\n\nThis story is basically phoenix from the ashes\nI went from emotionally crippled child with worst perspective to a good boy. On the journey to good man I became a destroyed man. And after that, in comparison to my old self I became a wise man.\nEvery dream I had I buried in my life. And I had the biggest dreams, also very strong mental tools. The people I trusted, ripped me apart to the point I didn't even know if I am who I remember I was, or if this is made up by my mind so I don't lose all my shit.\n\nBut now I am stronger, smarter, wiser and have more energy in me than ever before and I am not ever gonna stop living and sticking up for what is right, not ever let someone fuck with me again. Other people can be like, let's figure out, I'm like nope I now know I'm very good on my own and I don't need people who didn't earn my deep respect and trust or their opinions and I recommend sticking to your guns, let your brain process stuff, don't identify with the process. A part of the process is that you identify with it but remind yourself it's the process. It's accepting that you might not be able to be the person you want to be. It might be weeks, months, or years in my case. But just don't forget who you were at your best times, who you want to be and trust me your brain will figure.\n\n\n\n\n\n\n\nTLDR easy mode:\n\nRise of a phoenix from the ashes not just once.\n\nBorn in a HEAVILY abusive family full off addicts & regular psychosis. I said nope I'm going to be the opposite. Hard tests on the way but made it, became awesome person.\n\nWith 17 I'm all that what I wanted to be, strong personality, popular, hard working in school and work, earning more than average person in town, living independent.\n\nSpent 7 years trying to build a stable relationship for marriage with a girl I trusted in and sweet dreams became the worst nightmares, I got mentally drained and abused on a daily basis and couldn't believe someone who loves me doing this, I think she is sick I need to help her, ending up being the one who needs help.\nWhen we split I was broke and realize over 20 years abuse. I'm 25 now. \nI was suicidal and had PTSD. A high performer who worked to be the most stable mf ?! becoming thisss. wow wtf happened.\nIf you ask me I have been to hell And back three times in my life and I always came out stronger and went to my old ways even if I thought this will be my life.\n\nThere was a little voice inside of me that stopped me from doing something really bad, that always reminded me at who I was.\n\nIn the end of this journey I became some kind of an updated more experienced version of my self. I am wiser today and I am good. I try not to make the same mistakes and value the use of \"No\" and leaving instead of staying became more of a quality.\n\nNature is made to live and not to deconstruct it self.\nEven if your brain is giving you hell forever and you want to end it all - Sword is made in the fire my friend.\n\nTo make sense with the title, over the years I didn't know what is destroying me so much, if it was cigarettes or weed or work. But I was never heavily abusive with anything and had no problem stopping these things and realized these were not my main issues, shit is deep down.\n\nActually when I smoked weed I was afraid what my girlfriend thinks about me in general. \nIf you want to see it like that I knew my problem there, living to be liked by my girl. So we will live happy with family and all the shit.\n\nBut sometimes you need to make a cut. Bury the dream yourself. Run. Build. Let the suffering happen as long as it takes. Reach out for help. Build new dreams but take your time, finding ambition and inspiration in life is a very long journey and it can be depressing when you stress about it. Try to be happy being alive, try to be happy that you can enjoy the taste of coffee. Try to be a child and enjoy the smallest things until you eventually can stop being the child. These are helpful things I said to myself.\n\n\nEdit: added ultra mode", "permalink": "/r/DecidingToBeBetter/comments/m0hroi/leaving_drugs_and_doing_sports_did_not_make_me/gqawx33/"}