{"id": "t5_2tand_t3_nwst48_t1_h1c89t9", "creation": 1623366411, "origin": "t5_2tand_t3_nwst48", "height": 1, "replied_to": "t5_2tand_t3_nwst48", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "contrite_creep", "text": ">You are just like everyone else, except for the fact that you've isolated yourself so much\n\nThe thing is, while I know this is true, emotionally I still feel so distanced. It's not only my self-inflicted isolation, it's a bunch of other small things. Teachers said I would grow up to be a genius, but my poor behavior and tantrums also drove everyone away and made friends difficult. I was diagnosed with high-functioning autism, which also set me apart from anyone. It's because of this that I've internalized being different as a facet of my entire being, and not only different, but extraordinary. If I was an outcast, I needed to prove that I had actual worth, or else I was worthless.\n\nIn reality, I don't even know if I have Asperger's (the diagnosis before it was removed from the DSM), or if I'm socially stunted because of how I grew up. My mom spoiled me, but also yelled at me for being a spoiled child. My brother was overly angry and violent at times (he was likely dealing with trauma), exposing me to things I wasn't emotionally prepared for. I had no dad, or any positive male role models really. All of this combined to me, despite having a home and food, not really feeling like I got to be a kid. So I guess in that sense, I *am* different.\n\nBut I don't know. There's still that fundamental disconnect between what I know (\"other people\", the impenetrable monolith, are just like me), and what I feel (everyone is out to hurt me). A lot of it is rooted in my shame, and my fear of intimacy. But either way, it's become such an integral part of my identity that I don't even know who I am outside of it. It's a coping mechanism that doesn't need to exist anymore, but is still sustained by its own inertia, and my inability to define who I am (my interests, dreams, hobbies) without the expectation of redeeming my core worthlessness (by having to be the very best, something I feed through power fantasies and delusions that are borderline narcissistic and ones I'm really trying to get rid of ).\n\nI can't really afford therapy atm, so sorry if I'm unloading all of this, but I just feel like I need to say it.", "permalink": "/r/DecidingToBeBetter/comments/nwst48/i_want_to_move_forward_and_rebuild_human_contact/h1c89t9/"}