{"id": "t5_2tand_t3_nwst48_t1_h1b18ye", "creation": 1623347401, "origin": "t5_2tand_t3_nwst48", "height": 1, "replied_to": "t5_2tand_t3_nwst48", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheChristopherMax", "text": "There is a lot of self loathing here... can you clarify your justification? I read: you developed a coping strategy of isolation that isn't serving you any more.  This isn't a crime it just means that you're suffering. So unless you strangled hobo or something then living a joyless life or being dead in a ditch isn't actually a just punishment. In fact no punishment is appropriate. Perhaps a medal is warranted for surviving in the face of adversity.\n\nWhat is appropriate is that you do a little re‐parenting. If you knew a kid going through what you did what would you say to them? Sounds like your clear that it wasn't a good environment. Spend a minute and offer that grace and love to yourself.\n\nAs far as what's next: You've got time to be whoever your want to be. And you can shed whatever parts of yourself are that you don't like. You're not required to act/respond/think/engage today and in the future  the way you might have in the past.\n\nSo decide who you'd like to be (your most aspirational vision of yourself) and show up that way as much as you can manage. If you show up powerful and kind and a great friend then ... well ... that's who you are. Regardless of whatever the gremlin in your head might say. \n\nIf you're worried that you're so unsocialized that you might be hurtful, then start with an activity or direction that's got some structure. A hobby (like you mentioned) is a great way to engage others in a structure. A board game group, a volunteer project, getting a job will alow you to engage with others while learning social norms. Trust me, your peers will signal to you if you're straying from acceptable behavior or crushing it as person. All this while continuing to engage you in the mutally agreed hobby/job/common activity.\n\nIf you want the most extreme solution, you could even try joining the military, or crewing on a boat. Those relationships are tight and serious and they will unmake and remake you (weather you need it or not). \n\nTL;DR cut yourself some slack. Pat yourself on the back for surviving. Pivot into who you want to be next.", "permalink": "/r/DecidingToBeBetter/comments/nwst48/i_want_to_move_forward_and_rebuild_human_contact/h1b18ye/"}