{"id": "t5_2tand_t3_nwst48_t1_h1b86g9", "creation": 1623350265, "origin": "t5_2tand_t3_nwst48", "height": 1, "replied_to": "t5_2tand_t3_nwst48", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheChristopherMax", "text": "Alright. I'm more clear now. \n\nI have good news. You don't need to punish yourself over this anymore. You already have... and for good measure plenty of other people have and will. Also, my prior advice stands.\n\nThe prior comments on the other thread about therapy are a good idea. If you're in school I bet they have a resource. \n\nSound like it happened with one lady 4 years ago. So as long as you don't do it any more then you can move on.. You don't have to pretend it didn't happen and that you didn't participate in that situation but you don't have to wear it either. There's no benifit to bringing it up. You can proceed as your new self in all the ways I mentioned before and leave this behind. There will be some new people in your life who will discover this about you and want to be dicks about it instead of embracing who you have become. (There will be less and less people who care over time) cut the people who can't let this go out of your life and find people who like you for who you are.\n\nIf it does come up with someone who has earned the right to hear about your personal business then you can talk about it. Be sure to frame it as something that HAPPENED IN THE PAST AND THAT YOUR NOT THAT PERSON ANYMORE (get clear on that for yourself too). You can be honest but let them drive the discussion so that you don't TMI it and sound like you're bragging. Also, no one needs the lurid details. Also, if there is some with an adversarial interest (her, her parents, law enforcement) they can direct their questions to your attorney (which you will get if it comes up. Attorneys give consults for free)\n\nThere are a lot of people who do uncool and hurtful stuff in their teens that turn out to be fine people. Like millions of people. You were mis‐patented, mal‐adapted, young and dumb. But you can be who you want to be, act the way you want to act and be with the kind of people you want to be with.", "permalink": "/r/DecidingToBeBetter/comments/nwst48/i_want_to_move_forward_and_rebuild_human_contact/h1b86g9/"}