{"id": "t5_2tand_t3_8vcc58_t1_e1nib6y", "creation": 1530534422, "origin": "t5_2tand_t3_8vcc58", "height": 1, "replied_to": "t5_2tand_t3_8vcc58", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "msmurasaki", "text": "Hey, I have similar issues and still working on them. I found a study that links motivation with dopamine. You should read up on it. The reason why a lot of people are motivated and able to face problems, is from the dopamine they get when they finish. That addictive nature, is an attempt to overkill and get as much dopamine as you can. (at least thats how I understood it). \n\nTheir solution was having small goals, and finishing them. Then at times rewarding yourself. Like one does with dogs. So like reading a book, will be slow when you start. But will overtime make you feel like you did something good. It will give you things to think about, to replace those shitty thoughts in your head. Then rinse and repeat. Until you start forming habits and discipline that overall give you a sense of achievement. There is a reason that most people in the gym already look awesome when they start and are the ones that come regularly, while there are hardly any overweight people. Because starting is the hardest part. It is only once you have that routine, that you really start to reap in the benefits and enjoy it. You have tried and failed. And tried again. Many people fail and there is nothing wrong with that. The strength is in trying again. If that hobby or thing you try isn't working. Try something else. \n\nBut don't overdo it. Like I will go to the gym. Feel awesome, and then overkill it with excessive training. Then I don't want to go the next time because I expect the same amount of work from me. Just do 5 minutes here and there of the positive things in your life, and stop. That will make those things addictive to you and help you build on it. Like go to the gym for only 15 minutes. Then go home and play video games. Read a book for only 15 minutes. Then watch some tv. Because the things that give you long-lasting dopamines also require work. Which can make you feel weary if you don't control it. ", "permalink": "/r/DecidingToBeBetter/comments/8vcc58/my_life_feels_so_directionless_i_keep_running/e1nib6y/"}