{"id": "t5_2tand_t3_oa5c2w_t1_h3fsqeo", "creation": 1624974330, "origin": "t5_2tand_t3_oa5c2w", "height": 1, "replied_to": "t5_2tand_t3_oa5c2w", "down_vote": 0, "up_vote": 11, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Capraig", "text": "Nice!\n\nA few things as you enter college (although your advisor might cover these off as well)\n\n* It's ok to not know the answer or understand the material if a prof calls on you, or even as you leave the lecture/lab/studio/shop.  Always remember that you are here to learn!  It may take some time to get challenging material to sink in, and that's ok!\n\n* We all learn differently.  Some twig onto things as the instructor talks (and can answer things quickly, seemingly making them appear smarter), while others prefer to take the material away and reflect on it.  Don't be discouraged if you find yourself the latter, often these are the students that succeed more\n\n* Never be scared to ask questions, that how we learn.  It's one of the ways profs gauge the understanding  of their material.  Other quieter/shyer students will thank you for asking \"their\" question\n\n* Get your time management under control fast!  For college, one hour outside class for every one hour contact time (at least). Schedule your part-time work schedule around your classes, not the other way around \n\n* Remember, you at college to work out who you are going to be.  If you end up in a programme that you realise is not for you, change it!  Your profs will celebrate your choice (although be sad to see you leave).  Don't stick it out to \"just finish it\" (unless it's your last semester I guess)\n\n* Get to know your instructors, as they can provide references as well!\n\n*    Lastly, it's not \"just\" college!  This is a beginning, and you can go as far as you want.  If you think uni is for you, then it will be!  Just make sure that once you have started, you understand what is required for a degree, any agreements with your college and unis for advanced standing etc.  Again, references from your profs!\n\nLastly, make sure you get to know students around you!  Half the reason to be in tertiary education is meet people like you.", "permalink": "/r/DecidingToBeBetter/comments/oa5c2w/college_community_college_but_still/h3fsqeo/"}