{"id": "t5_2tand_t3_eslxd9_t1_fs1n5mj", "creation": 1590631555, "origin": "t5_2tand_t3_eslxd9", "height": 1, "replied_to": "t5_2tand_t3_eslxd9", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Americanwadewilson", "text": "I completely understand what you're going through. I too, am in my thirties and have similar struggles with video games.\n\nI started out getting my first snes as a kid and have pretty much owned every console since then. I found so much joy in video games for years!\n\nThen a couple of years ago I started struggling with the feeling of emptiness after playing. I was  no longer having the same fun I used to. I wasn't getting the same release and dopamine hits I was before. I took some months off and then tried again... New AAA games, new system, new pc, new controller, new everything.... It was exciting for another month or so, then I got the same feeling of wasting time.\n\nI don't know if I just crave the nostalgia aspect and that is what keeps pulling me back. 🤷‍♂️ I honestly don't know.\n\nI found minimalism a few years back and I got rid of a ton of my material possessions because I was  feeling trapped. Instead of me owning my things, my things were owning me. After donating and selling truckloads of material possessions, I had a ton of time on my hands, joy and a new outlook on life.\n\nThen recently with a relationship loss as well as the pandemic/quarantine, I fell off the wagon and bought another gaming pc. If I'm being honest I think it was a mixture of boredom and wanting to connect with that nostalgic aspect due to the breakup.\n\nWhile getting the system all set up and running and installing a crapload of steam games... I felt total excitement like it had all came back to me. Two weeks later and maybe thirty hours of gaming had gone by.... And guess what? I had the same bad feeling of wasting time and disappointment. Hmm 🤔 idk what my deal is. I know I don't like this whole back and forth thing though. \n\nI've contemplated \n- Am I getting too old for this? \n- Am I trying to relive the past? \n- Am I running away to avoid current problems, emotions and feelings by hiding in a virtual reality? \n- Am I over thinking this and it's not an issue at all just a problem I'm creating? \n- Do I actually have a video game addiction?\n- Is this my own personal midlife crisis? \n\n\nI have no clue. \nJust seen your post and thought I'd share so you'd know you're not the only one. Hang in there. I feel your pain.", "permalink": "/r/DecidingToBeBetter/comments/eslxd9/30m_struggling_with_longtime_video_game_avoidance/fs1n5mj/"}