{"id": "t5_2tand_t3_kodv07_t1_ghqeyik", "creation": 1609521359, "origin": "t5_2tand_t3_kodv07", "height": 1, "replied_to": "t5_2tand_t3_kodv07", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AshOrMania", "text": "Not the original commenter but I’ll hop in... \n\nFor some people, meditating or going to the gym definitely count, as well as practicing guitar, but for you, based on how you’re asking the question and your post, I would guess that you'd have to be careful. \n\nDowntime is time that’s free of any “should”-type thoughts. You’re not “supposed” to be doing anything, you’re allowing your body and mind to recover from the stress of the more rigidly scheduled portions of your life. \n\nGym and meditation are great for that but for someone who has perfectionist and workaholic tendencies, those things can also start feeling like chores, which you then mentally \"punish\" yourself for failing to do enough. Practicing guitar is also awesome for relaxing, unless it becomes a scheduled, goal-driven way to add more stress into your life. \n\nIf you can noodle around on the guitar without bringing the perfectionism into that area, then totally yes, downtime approved. Same thing with the gym, but only if it feels like \"you-time,\" not just another thing on the checklist that you have to do.\n\nDowntime should be something you look forward to and feel refreshed after doing and it can be different every time. You could play video games for a few hours, go for a long walk/hike, play with the kids for a while with no \"work guilt\", cook a new recipe for fun, listen to an audiobook or podcast -- especially one that feels like \"trash\" or isn't \"educational\" in any way, take your partner to pound town (with consent lol), vegetate on the couch with your phone on reddit, whatever. \n\nThe only \"rule\" to downtime is that as soon as you start getting that feeling that you're doing something wrong, take a breath, reassess, and remember that the time is about relaxing and resetting, not about achieving and accomplishing.", "permalink": "/r/DecidingToBeBetter/comments/kodv07/how_much_downtime_does_a_person_need/ghqeyik/"}