{"id": "t5_2tand_t3_pie77l_t1_hbry731", "creation": 1630905478, "origin": "t5_2tand_t3_pie77l", "height": 1, "replied_to": "t5_2tand_t3_pie77l", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "LeadingMeaning570", "text": "Consider utilizing more non-traditional ways of socializing, perhaps? Unfortunately, I don't think the pandemic is going away anytime soon. Rather than allowing it to push us into a bubble, we have to adapt to a new lifestyle where we can still foster our physical, mental, and social needs. If you feel there is area for improvement in your social sphere, try looking into friend apps or dating apps. You don't have to go in looking for a lifetime partner or seeking high expectations, rather dip your toes into conventional conversation. I think slowly you'll develop a greater confidence in yourself that extends beyond your more conspicuous achievements :)\n\nBack story (not trying to sound braggy when I say this, but I apologize if it comes across this way!): I was a textbook perfect Asian daughter -- top high school student, varsity athlete, weekly volunteer gigs, clubs, graduated university with a doctorate, played two instruments.... while I am proud of those achievements and I used to base my success on that, here is what genuinely makes me happy now: paying my bills without stress, art projects with my husband, seeing my dog live her best life, going to the gym. Those latter interests are some of the many I developed once I allowed myself to explore out of my comfort zone of being studious and demure. They have also brought me closer to many different communities of people.\n\nLong story short: step outside of your comfort zone and don't be afraid to stumble along the way. The greatest way we grow is learning to positively cope in times of discomfort.\n\nI have faith that you can find happiness and new facets of yourself during this tough time! All my love and best wishes to you XOXO", "permalink": "/r/DecidingToBeBetter/comments/pie77l/turned_29_this_year_and_im_having_a_quarter_life/hbry731/"}