{"id": "t5_2tand_t3_oh9oav_t1_h4nufrm", "creation": 1625885135, "origin": "t5_2tand_t3_oh9oav", "height": 1, "replied_to": "t5_2tand_t3_oh9oav", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "containmentleak", "text": "i don’t even know who i am to be “myself”  \nYeah, at 14 that's pretty normal and I felt the same way. The only thing I slowly learned was that....I was already \"me\". You are already you. Everything you think, feel, say and do. It's all you. It might be you clouded by depression. It might be the version of you that is super excited about an upcoming game or movie or something you like. It might be a version of you that is grumpy from a bad day and too little sleep. They are all you. Humans are really complicated and mixed that way. We have a lot of different \"faces\" but they are all us.   \n\n\nI second the other person about going slow. Challenge yourself to do SMALL things that are SHORT lived on a regular basis. Start by forcing yourself to go outside once a week. Just for 5 minutes. Or 10. Long enough to walk to a nearby convenience store or park and come home. Make it a routine. When that becomes comfortable (maybe not easy. Just...normal), the next step is twice a week or 3 times a week. Just five minutes. Don't have to talk to people yet.   \nAfter that you can do once a week, get a juice at that convenience store and talk to the clerk. \"hello, how are you\". get your little treat, say thanks and leave. That treat is your reward for challlenging yourself to talk to someone. Do it every week at the same day and same time. Imagine what the conversation will look like. Before you do this, imagine yourself feeling okay when you do this. Your imagination is powerful and you probably spent so much time imagining the worst that it is difficult to imagine anything else. Imagine the best possibilitiy. What does it look like? feel like? smell like? Really full walk yourself through it in your mind.   \n\n\n\" everyone else seems so happy but no matter how hard i try i’ll never be like them\"  \nHave you read the posts on reddit? xD Have you seen how many people feel the same way you do? Maybe not. I have a challenge for you. Once you have talked to the same person a few times  to ask someone ONE of these questions and see what they say.  \n\"Are you happy?\"  \n\"Have you ever felt lonely?\"  \n\"Have you ever felt like the black sheep?\"\n\nIf you want to share your feelings too, you can. I recommend you only share a little bit with new people. A lot of people struggle. The only difference is that they talk to each other and struggle together. You have been alone in your mind for so long that the \"average\" people you meet might not understand your type of loneliness. But feeling \"different\", feeling \"wrong\" and feeling \"disconnected\" is actually pretty common I think. So try going slow. You'll meet people that understand and people that don't. Eventually, you will find someone like you who spent (or still spends) a long time staying home and feels uncomfortable talking to others and will understand you more deeply and you will understand them. It just takes time. Good luck!", "permalink": "/r/DecidingToBeBetter/comments/oh9oav/how_to_stop_this_cycle/h4nufrm/"}