{"id": "t5_2tand_t3_dmr9zc_t1_f61i26s", "creation": 1572640624, "origin": "t5_2tand_t3_dmr9zc", "height": 1, "replied_to": "t5_2tand_t3_dmr9zc", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I like your logical approach.\n\nTherapy is great because it gives you the opportunity to hear an outsider's POV of your thought processes. A therapist can help you to develop a better understanding of yourself by challenging your firmly set beliefs about yourself, and guiding you to think about your situation in a new light, which is often an important step to finding a solution (or finding coping mechanisms that work for you).\n\nA therapist's job isn't to erase your problems, exactly, but to identify them and to help you cope with them in a healthy way. A therapist can't cure loneliness, but a therapist can help you to identify why you might feel lonely in a crowd, and offer advice towards making meaningful connections with others.\n\nYou say that you're ugly. A therapist can't cure ugly, but a therapist can help you find confidence in your appearance, or in yourself in general, by pointing out charming traits you never knew you had. This can make you feel more secure as a person, which gives you better prospects socially, and can hugely improve your quality of life. You can't cure ugly, but you can offset it with confidence.\n\nSomething I've enjoyed about therapy is validation, and coping tools. My first therapy session basically confirmed all my suspicions about myself. The therapist said nothing new or amazing to me about myself. But he did offer some great advice to prevent my problems from affecting my quality of life. It was stuff I'd never heard before, and it really helped me.\n\nTherapy is different for everyone. You like to approach your problems logically. I like that. Just don't forget that you're human too, and the emotions you feel might be illogical, but they are very real, and they need to be addressed too. Take a chance with therapy. Give it a try.", "permalink": "/r/DecidingToBeBetter/comments/dmr9zc/can_anyone_here_explain_the_stepsprocess_of_how/f61i26s/"}