{"id": "t5_2tand_t3_7xlv1s_t1_dua1gyr", "creation": 1518683942, "origin": "t5_2tand_t3_7xlv1s", "height": 1, "replied_to": "t5_2tand_t3_7xlv1s", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "katiebellVIII", "text": "This is amazing timing as I've been working on my own one as I felt the shadows creeping up on me after some bad news about a family members illness.\n\nHere are some of the things I do:\n\n* Force myself to work out for 10 mins a day at least 3x a week (going to go do that after I post this!! :D)\n*  Watch ASMR videos. My favourite is [ASMR Therapist](https://www.youtube.com/asmrtherapist)! \n* Plan a day for me in the near future to have something to look forward to. I've started researching day spas so I can go get a massage and facial. They're my favourite way to treat yoself!\n* Listening to meditation music. It puts me in the moment and I can put my worries aside for awhile which helps me to relax and feel less tense. [Here's a good track to get you started](https://www.youtube.com/watch?v=y-i88zkxPug&t=93s).\n* We're lucky enough to have a bath tub in our house and I spend about $60 a year on fancy lush bath bombs (that I break up into pieces to make them last longer) that I use to make bathtime special.\n* Facial massage. I found a really cool video the other night on how to do you own face massage. It's relaxing (helped me a bit with the jaw/ear pain I get from clenching my jaw), plus doing it regularly helps to keep your skin looking nicer. It's supposed to drain your lymphatic system too so yay for helping physically too! \n* Force myself to take a step back and realise that I'm feeling down, tired, angry, stressed, on edge, worried, scared, sad, hopeless etcetc and ask if there's anything making me feel like that. Is it something I can control? Okay, how can I fix it? Is it something out of my control? Yes? Maybe I should try and let it go (so much easier than said - but the mental exercise of asking and telling myself does help over time!).\n* Vitamins, water and this stuff that helps to keep my tummy happy as I have IBS and I think that can really affect me when I'm having a bad episode of symptoms.\n\nI know these are all specific to me but I hope they can help inspire your list in some way! \n\n(Edited because I suck at formatting).", "permalink": "/r/DecidingToBeBetter/comments/7xlv1s/does_anybody_have_a_depression_playbook_they/dua1gyr/"}