{"id": "t5_2tand_t3_fd3k4c_t1_fjfve35", "creation": 1583301389, "origin": "t5_2tand_t3_fd3k4c", "height": 1, "replied_to": "t5_2tand_t3_fd3k4c", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "OFishalDJ", "text": "I think a thirst for knowledge and more information is really great but yeah it's not fair to hold it against others and close your mind to opinions etc\n\nDo you value harmony? If you make that your focus you may find it easy to change some people do not value harmony and this in my opinion is what leads to a know it all pedantic attitude. What is the point of your interactions with others? I would examine that.  \n\nToo often will you hear incorrect statements and that's life you can't avoid that. \n\nSaying nothing when you hear something incorrect does not require any patience, it simply requires for you to not take it personally or see it as an opportunity to gain attention. Often I find that know it all or pedantic people have low self esteem I've always assumed they were trying to boost it by being right about everything. \n\nYou know what really boosts self esteem? Making others smile or laugh, feeling that you are part of a community. That's priceless. Collect information and grow your knowledge for its own sake and I bet you like to be mentally stimulated and that's a good reason for wanting to know \"a lot\"\n\nI think what you're searching for is a change in values? Perhaps? Like you want to value harmony and have harmonious interactions over other things. \n\nMindfulness doesn't have much to do with this unless you plan on being mindful about when you are starting to get worked up over incorrect statements. That may help. \n\nEgo death is an extreme in this scenario and enlightenment won't be reached without mastering some understanding of harmony and rethinking your values. Best of luck.", "permalink": "/r/DecidingToBeBetter/comments/fd3k4c/ive_noticed_myself_getting_a_little_too/fjfve35/"}