{"id": "t5_2tand_t3_fd3k4c_t1_fjg7pip", "creation": 1583315519, "origin": "t5_2tand_t3_fd3k4c", "height": 1, "replied_to": "t5_2tand_t3_fd3k4c", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AnotherLivingThing", "text": "A person with a lot of knowledge understands that knowledge is not finite. Which, in practical terms, means that, the more you learn, the more you realise that you don't actually know anything. This kind of confidence that you describe is usually the result of a person having a very small amount of knowledge. The saying is true that 'a little knowledge is a dangerous thing'. Have you heard of the Dunning-Kruger effect?\n\nDon't let people's admiration of you go to your head. Even if you were the smartest person in the world (and you're not), measurable intelligence is not the only thing of value that exists in the human mind.\n\nTo fix this, get a university degree in something like literature or philosophy. I guarantee you will come out with more questions than you had going in.\n\nIf you can't do that, or can't afford it, then start with reading about postmodernism. Foucault could be a good start. If you find that hard to get into, or can't get hold of it, have a look at Philosophy Tube on YouTube.\n\nEveryone has something of value to bring to a conversation or experience - even if that is just an understanding of how they think about the world and what their inner landscapes look like. Experiences are valuable too. People are valuable. Life is valuable. Our entire world is valuable - and not just because of the facts that we can learn about it. Other people, and everything around you, have an intrinsic value that is separate from the utility or rightness that we can extract from it. When you reduce things to 'I know this quantity of facts about it', you fail to truly appreciate the world you spend your life in - reducing it to the quantitative, rather than the qualitative - and you can simply decide to stop doing that. This first post is a really good way to make it happen:\n\n> First of all, it’s great that you are aware of it.  Second, my strategy  is that I like to visualize that everyone I go I am the owner and I want  everyone to have the best experience.  Gym, coffee shop, etc, pretend  that you own the place and all you want is for the guests to enjoy  themselves while they are there.  You want to look out for them, make  sure that they are safe, enjoying themselves.  Eventually you just  become someone that is happy when the community is thriving. \n\nAdditionally, if you truly *are* right, then you're not going to persuade anyone by being dismissive of *their* knowlege. People tend not to take that well.", "permalink": "/r/DecidingToBeBetter/comments/fd3k4c/ive_noticed_myself_getting_a_little_too/fjg7pip/"}