{"id": "t5_2tand_t3_crkll3_t1_ex8v1uv", "creation": 1566079280, "origin": "t5_2tand_t3_crkll3", "height": 1, "replied_to": "t5_2tand_t3_crkll3", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "WeirdAnswerAccount", "text": "Think of it like this: we evolved from animals over billions of years. The groups of humans that ate mainly carbs like potatoes, wheat and rice never had to be as physically fit or mentally sharp as the humans that needed to chase down animals and kill them. \n\nOur culture has raised us on eating corn and bread and carbs because our brain basically gets a high off it, but we're too sedentary for it to not turn into diabetes, heart disease, high cholesterol, inflammation that causes aches and pains in our body. Corn and bread are cheaper than any other food, so American companies have marketed the shit out of it because the profit margins are way higher than lower carb foods. \n\nThe Keto diet is pretty simple, but requires a lot of attention. Basically before you eat anything, look at the nutritional facts and avoid carbs almost entirely. You'll end up learning how to cook and it'll develop a lot of self control if you can get through the first week. When I start I usually eat a lot of eggs and bacon,  ground beef with taco seasoning and a bunch of cheese, sausage, hot dogs. Eventually once I'm not craving sugars anymore after a few days I'll eat premade caesar salads and some vegetables ( I didn't choose to eat a single vegetable in my life before doing keto). But you need to avoid bread, potatoes, rice. Check out /r/ketoprogress for motivation and other subreddits when you search keto. \n\nThere's a lot science behind it so you might not want to dive too deep right at the start. Just keep in mind that carbs are the enemy and start taking a multivitamin and adding more salt to your food. Expect to be thirsty and drink tons of water and start peeing more often because carbs are what hold water in your body.\n\nSearch through youtube for keto tips and recipes etc. There's a guy named Thomas DeLauer (his youtube channels name) that used to be obese but now he's ripped enough to be a fitness model who's entire channel is dedicated to keto education, but I studied exercise science and have been researching this stuff for years and he goes into some super complicated topics in some videos so don't let those scare you. He must have some researchers on his team or something lmao. \n\nIt's going to be a huge lifestyle change, but if you go through that subreddit you'll see that the results are life changing and once the results start coming in you'll get hooked and learn how to make permanent changes to your diet. And don't forget that if you fall off the wagon, there's nothing stopping you from getting back on. \n\nIf I sound like a keto spokesperson, it's because it helped me a lot. The energy and mental clarity and confidence boost I've gotten are so worth skipping out on the ice cream and the pizza that gives me short term meaningless satisfaction. Give it a shot for at least 6 weeks and try to avoid cheat days and you're going to start telling every body about it too.\n\nFeel free to message me if you have questions or anything. I love talking about health and fitness and all this stuff. I was lucky to feel self-loathing and get obsessed with self improvement when I was really young lmao.", "permalink": "/r/DecidingToBeBetter/comments/crkll3/i_am_not_going_to_die_alone/ex8v1uv/"}