{"id": "t5_2qh1i_t3_eyszxc_t1_fgjdt9n", "creation": 1580841949, "origin": "t5_2qh1i_t3_eyszxc", "height": 1, "replied_to": "t5_2qh1i_t3_eyszxc", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "tulip2three", "text": "Had been forced to marry a man at a very young age. Fell into a depression because religious people said once married you MUST stay married or your adulteress.  He was a very bad man, abuse does not cover how he was. I had a obgyn prescribe antidepressants but at an extremely irresponsible  high dose after my first baby was born. I couldn't take how destructive the pills were, he also prescribed very high doses of narcotics and biafra and sleeping pills. So I just quit cold Turkey, EVERYTHING. I was 19 at the time and didnt know anything about what can happen if you quit everything without supervision. It didnt take long for me to spiral into a kind of sad madness on top of his continued torture. One day I took my prescribed ibuprofen after he told me to kill myself for the hundredth time, the world would be better off, etc. He in fact took the bottle from me, emptied it into his hand forced them into my mouth and poured water into my mouth and held my mouth shut until I swallowed. Wouldn't let me leave the room, but all I could think is I couldn't leave my baby with this human. No one could save him but me. I tried to leave cried begged pleaded, finally, he let me go. I walked to the hospital. I told them a matter of factly what I had done and calmly let them pump my stomach.  I must've answered the questions correctly because they let me go home directly home. I didnt tell them what he did or that he had anything to do with it. Walked home. It wasn't the last time I tried. This was just the most traumatic. It's been eight years since I found the courage to leave that person. I still try to not think of what he did. I do go to counseling. Processing everything seems insurmountable. But, God help me I'm trying. A good man, with the most caring loving heart married me, took me from being terrified and afraid to being able to trust another human. I feel safe, loved and somehow, this good man, has adopted and loved my children and has protected them  and healed them from that other person. I haven't tried to do anything bad to myself in eight years. Been married to my good man for five years.", "permalink": "/r/AskReddit/comments/eyszxc/serious_suicide_survivors_of_reddit_what_made_you/fgjdt9n/"}