{"id": "t5_2tand_t3_nj0c8s_t1_gz5f8o6", "creation": 1621768532, "origin": "t5_2tand_t3_nj0c8s", "height": 1, "replied_to": "t5_2tand_t3_nj0c8s", "down_vote": 0, "up_vote": 34, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ztormzy", "text": "Ohhhh noooo, I'm so sorry you feel that way :(! Internalised racism is the devil!!! \n\nI'm a black girl and I've been successful in the journey against internalised racism; I'm proud of my skin complexion and heritage :). My afro is literally like a lions mane, or peacock feathers. It's unique, eye catching. It defies gravity. My skin literally is a clear as glass, it absorbs and reflects the frickin sun!!! Everything looks bomb on me hence why mannequins mimic my complexion and figure. My chocolate eyes are both warm and sultry and I've been told my full lipped smile lights up the room. I think I'm absolutely beautiful!! I bet you are aswell!!\n\nSome things that have helped me: \n\nInternalised racism = believing negative, racist stereotypes about oneself due to the media and society, right? :) \n\n1. Therefore, you need to surround yourself with as much positive representation as possible. For example, watch movies and tv shows regularly in your native language and culture! On social media, follow mostly attractive, dark skin, south asain influencers that have the same features as you! Unfollow, any influencers that adhere to your current, internalised racist standard of beauty! :) \n\n2. You also NEEDDDDDDD to educate yourself on your countries history and why theses oppressive systems (racism, colourism and featurism) even exist! It's sooooo eye opening and soon you'll feel silly not accepting your self as you are! Mainstream beauty standards are based on white supremacy; it's arbitrary that a particular phenotype is held as the ideal. When, in actuality, beauty comes in all shapes and sizes. Beauty is just how sexually dismophric your face is, how young someone appears and how symmetrical their faces are. Arbitrary things such as skin colour, hair type and eye colour are just enforced by society to not only manipulate you into buying certains items but as a form of mental slavery to white supremacy. They don't influence beauty in the slightest; you soon see that when you follow attractive, dark skin, south asian people with features that mimic yours. AMAZZINGGG videos that you can start with are: \n\nBeauty standards are b*llshit by Karolina Żebrowska: https://youtu.be/GJBo2eqzVe8 She details how throughout history literally EVERY👏🏾SINGLE👏🏾FEATURE has once been a beauty standard. Big noses? Check. Small noses? Check. Small butts? Check. Big butts? Check. Pale skin? Check. Tans? Check. Small lips? Check. Big lips? Check. \n\nColourism by Khadija Mbowe: https://youtu.be/W9ussxD32tE Omgggg she is one of my favourite youtubers! She talks about the history of colourism. \n\n3. Call out racist attitudes around you and inside you! Have a friend with low self esteem bring you down? They're... CANCELLED XD! Like seriouslyyyyy! You defo don't need negative attitudes like that in your life! Pick you, pick radical self acceptance at all costs! \n\nI don't care if I don't know you, I honestly love you and I'm sooo sad that you're going through this!!!! I hope you see your value one day!!! :) Feel free to message me if you need to rant or whatever :); I mean it! ❤❤❤❤", "permalink": "/r/DecidingToBeBetter/comments/nj0c8s/finally_admitted_to_myself_that_i_have/gz5f8o6/"}