{"id": "t5_2tand_t3_nj0c8s_t1_gz5orlw", "creation": 1621775569, "origin": "t5_2tand_t3_nj0c8s", "height": 1, "replied_to": "t5_2tand_t3_nj0c8s", "down_vote": 0, "up_vote": 21, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ReallyGuysImCool", "text": "Sorry man, I think you're coming from a good place but you're missing the mark completely. This isn't even about the R word (racism in the sense that western society thinks about it). The issue is the underlying shame - all those points you're addressing don't get at what hes upset about. It's not about 'being allowed to have a preference to date white women' or 'it's ok to speak English'...the issue is that he's realized he's actively trying to surpress his identity as a brown man and distance himself from his culture. You're probably trying to make him feel better and be more confident in who he is right now, but your comment leaves out that he is deeply unhappy because he's been taught not to be happy with who he is. Taught by his parents culture, and feeling pressure by living in a society that for most of his life has not had positive associations with his culture. To the point he wishes his skin was lighter because of colorism (a huge issue in non western countries)  and not because he doesn't like a suntan or whatever. He doesn't want advice to try to make him feel proud of being western assimilated. He wants advice to try to make him feel proud of his skin color and background.\n\nTo OP if you're reading this: no matter what other trolls might say, it is brave of you to admit this to yourself. This is an issue that affects many people of color. It's hard to admit that you are ashamed of what you are on a subconscious level. It's even harder when many of those around you will not understand - well meaning white people, other minorities who have not come to grapple with the issue themselves, or the worst in my opinion, other minorities who brazenly internalized and externlaizef  it and openly perpetuate the idea that their culture and skin color is shameful. I dont have advice for you other than that youre taking the right steps in a painful journey of reconsidering your identity at a fundamental level, and that youre not alone.", "permalink": "/r/DecidingToBeBetter/comments/nj0c8s/finally_admitted_to_myself_that_i_have/gz5orlw/"}