{"id": "t5_2tand_t3_nj0c8s_t1_gz5c4m3", "creation": 1621765599, "origin": "t5_2tand_t3_nj0c8s", "height": 1, "replied_to": "t5_2tand_t3_nj0c8s", "down_vote": 0, "up_vote": 63, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "hellohappystar", "text": "Hi, I just wanna highlight that what you are feeling is a product of a society that is racist / has white supremacist attitudes. I’m not sure what the situation is like in Canada, but here in Asia (I’m a Chinese person from Singapore), our histories of having been colonized by white superpowers decades ago have no doubt contributed to these ideals that our own Asian/coloured heritage and backgrounds are inferior. People are still trying to unlearn racism (towards other races and also towards our own race). So I just wanna emphasise that it’s not your fault, and this whole systemic racism thing is not as simple as just trying to fit in. Coz if you think about it, the fact that you feel the NEED to distance yourself from brown people just so that you can start to be accepted in a predominantly white community, means that the ppl around you already have prejudices against dark/coloured people. And probably, many people in your community have implicitly racist attitudes/behaviours/language, and it’s quite likely that these have been so normalised that people don’t even realise that whatever racist thing they did or said is racist.\n\nThat being said, this is a very very complex issue, and I don’t rly know what else I can do or say to guide you. But I personally think that it’s a very good first step to notice that you have internalized racism. But I just wanna remind you once again that, because you’re a member of a minority group, brought up in a culture that has very likely normalised racism towards coloured people, you shouldn’t blame yourself totally for this. Because your attitudes have been inevitably influenced by society. Yeah.. lastly, just wanna say that you’re definitely not alone in this. There are people all over the world, both in the west and in Asia, still experiencing racism.\n\nIf you want some resources, I totally recommend this Instagram page @minorityvoices. However it’s situated in the Singapore context (coz like I said, I’m from SG haha), submitted by Singaporean people from minority races. But I hope that reading those stories will help make you feel less alone.\n\nEdit: sorry I misread.. I realised that you said that you grew up in Asia but moved to Canada recently (5 years ago). But I think this still holds!", "permalink": "/r/DecidingToBeBetter/comments/nj0c8s/finally_admitted_to_myself_that_i_have/gz5c4m3/"}