{"id": "t5_2tand_t3_nj0c8s_t1_gzcw6sh", "creation": 1621918110, "origin": "t5_2tand_t3_nj0c8s", "height": 1, "replied_to": "t5_2tand_t3_nj0c8s", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "hellohappystar", "text": "Right? Logically, they’re equal. It’s just a matter of which language is more useful in that country. No shaming involved!\n\nHowever, many people of colour are called dumb or uneducated for being unable to speak English fluently. Some who do speak fluently still get looked down upon if they have an accent. Or even for people who have grown up in an English-speaking country all their lives and speak perfect English, the moment they speak their mother tongue in public to their own friends or family, they’re seen as outsiders who should “go back to where they came from”. Or they get screamed at because “the main language here is English so you should be speaking English!” (And even more recently, being assaulted for being Asian, and being blamed for the “Chinese virus”, even though these Asian ppl who unfortunately got attacked probably don’t even have anything to do with it lol. You don’t see these assaults happening to UK people; they don’t get attacked or shouted at for the British variant, do they?)\n\nAnd then you have coloured, local people who get “complimented” for speaking English well, or for behaving like a civilized local, even though they ARE a local lol. (Though I concede that this last line really depends on context. Some ppl come off as condescending while others are just clueless.) \n\nThen there are the other practices that are perfectly okay in some cultures, yet are seen as being “uncivilized”, or “backward”, such as eating with your bare hands, wearing the hijab, or praying at a temple etc. \n\nSo, my point is, just like how you correctly pointed out, people should NOT be mocked for speaking a different language. They should not be shamed/shunned/looked down upon for having different cultural practices. They should just be seen and accepted as having harmless cultural differences. However, in reality, coloured people are treated in a condescending way when they do their own thing, hence people like OP have been conditioned by society to think and feel that the correct thing to do is to be as white as possible, and to try their best to discard their own culture/heritage. All these just to avoid discrimination by the majority. And this is what racism is all about, when the majority has power over the minority. \n\nAnd I want to say that you’re lucky to be white, coz even if you move to a country with a different ethnic majority (eg Japan), such that you become the minority, it really doesn’t hurt that much. Coz the general impression that people have of white countries/people is that western countries are very advanced, knowledgeable, have the latest trends, have the most power, know what’s right etc. Most people generally see white people in a positive light. Like if you were to move to Singapore and let your kids grow up here, I think your kids would be super popular just because they’re white lol. Yes no doubt people will see you differently, but they won’t oppress you or shame you for your skin colour. And this is what privilege looks like. And I think this can be attributed to colonialism that happened decades ago, where whiteness is glorified, and over so many years of being ruled by western countries, coloured native people living in these countries have internalized all these ideas that they don’t even realise it. So I hope you get my point! :)", "permalink": "/r/DecidingToBeBetter/comments/nj0c8s/finally_admitted_to_myself_that_i_have/gzcw6sh/"}