{"id": "t5_2tand_t3_nj0c8s_t1_gz5skr2", "creation": 1621777811, "origin": "t5_2tand_t3_nj0c8s", "height": 1, "replied_to": "t5_2tand_t3_nj0c8s", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "thedarkseducer", "text": "All of the people on the comments that are telling you Oh it wasn’t racism but etc etc. these are the people who need a real reality check on what it feels like to live in a society where you are a minority. \n\nI applaud you on recognizing that you have internalized the racism you’ve experienced. It’s a long road to walk it o recovery but it’s worth deconstructing every belief you have in your mind and the subtle effects and influences of living in a white society can have on you. One thing to be hyper aware of is many many people do not understand racism and what it means. They think racism = hate and other things. A LOT of white people and BIPOC  do not have a fundamental understanding of it even though the contrary will seem so. Racism is an ideology a worldview a belief a paradigm. Like any ideology it can be deconstructed with effort. By recognizing and becoming aware of the racism that has poisoned your mind, it will become easier to identify beliefs, actions, behaviors etc that propagate it’s existence. You’ll begin to see how society can cause you to absorb these ideals implicitly. Although they have good intentions on telling you “you just want to fit in” its completely ignoring the causes of why and how you are going about it. They are being mindful of your feelings but it isn’t helpful on a journey like this. \n\nI am glad you have decided to do better because it is a daily battle to fight the way you’re mind is programmed. Cultural programming is an influence and in the end, you determine how much control it can exert of you and your behavior! Congratulations and I wish you further success on your deconstruction. If you want help identifying it I can help by pointing the way to resources books etc that can bring awareness to the different forms and expressions that racism and internalized racism can manifest itself.", "permalink": "/r/DecidingToBeBetter/comments/nj0c8s/finally_admitted_to_myself_that_i_have/gz5skr2/"}