{"id": "t5_2tand_t3_nj0c8s_t1_gz61pw8", "creation": 1621782562, "origin": "t5_2tand_t3_nj0c8s", "height": 1, "replied_to": "t5_2tand_t3_nj0c8s", "down_vote": 0, "up_vote": 37, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "STEMfatale", "text": "i mean since the shame manifests itself specifically regarding race i’m not sure why that wouldn’t be internalized racism. not that that makes it anymore their fault; when you grow up consistently being told negative things about your race, seeing negative stereotypes in media, etc it’s nearly impossible NOT to internalize some of that.  \n\nOP, a lot of this advice is great, and definitely working on self love and self acceptance is key. i would also suggest seeking out some successful South Asian individuals in the fields you’re interested in, doing some research on the awesome things about your culture and history, etc (if that sounds condescending, I apologize; I’m sure you know plenty about your culture already, but I think it might help to work intentionally to find things you personally admire and want to emulate that you may not have been aware of/rejected in the past). And finally, you do not have to feel ashamed. I am betting there are tons of people who feel the same way, whether you encounter them online or in person. There have been studies showing that children as young as kindergarten will mark a doll with light skin as “prettier” than a darker doll, because the message that whiteness is the ideal, whiteness is the default, is so deeply ingrained in so many aspects of western society. I do think it’s getting better, but you can’t fault yourself for negative conditioning you never asked for or wanted in your brain. But you can be part of it getting better by working to love, accept, and admire yourself as well as your culture/race/skin color.", "permalink": "/r/DecidingToBeBetter/comments/nj0c8s/finally_admitted_to_myself_that_i_have/gz61pw8/"}