{"id": "t5_2tand_t3_nj0c8s_t1_gz5glhu", "creation": 1621769705, "origin": "t5_2tand_t3_nj0c8s", "height": 1, "replied_to": "t5_2tand_t3_nj0c8s", "down_vote": 0, "up_vote": 187, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BarneyDin", "text": "**Yeah. Op seems to feel bad for things that don't necessarily should make you feel bad.** For the first half my life I was an immigrant, trying to fit in, and although I am white, just as the people where I lived were for the most part, I underwent exactly the same thing as you described - but I didn't find it bad. Maybe because I was fairly young when I moved over?\n\nIt was just a funny way of expanding my identity, to the point that now I feel both. I became bilingual, took extremely big pride in being able to adapt to a new culture to the point of being naturalized completely and being able to pose as the two nationalities. It was fun. I am a much more interesting person for it, and these two identities don't fight. No one cares about it, and if they do they are an asshole not worth worrying about it. And it's an interesting conversation starter. **And being able to incorporate these two cultures, opens a lot of doors in terms of friendships and relating and also makes me open minded and see that culture and identity are extremely fluid and a matter of personal choice.**\n\nThe problem I think OP has is internalized shame, not racism. If you allow someone to tell you you are a bad person for trying to fit in and be an author of your own unique identity - then the problem isn't any of the identities but your self esteem. There will be always people ready to judge you for your tastes, life choices, sexuality, adherence to tradition, etc. These, regardless of race, are just fucking assholes.\n\nAnd it echoes in the only bit that OP described that I feel is something to work on: feeling responsible for how others of your culture behave. It's the same thing, you somehow internalized the expectation and shared responsibility. That is not racism, that is low self esteem and the threat of feeling judged. Kill that in yourself by building yourself up. You are the owner of your own opinion about yourself, not other people.\n\nSo dig deep down to find out why you take to heart what other people think. If you want to change your identity, feel free to do that. You are not a slave to tradition or expected roles. But if your self esteem is hurting for being judged, do something about it. It's a big obstacle in life, and has nothing to do with racism. More with your boundaries and feeling of ownership of your life. Never be a slave to any expectation or the judgement of other people. Your soul will suffer  because of it.", "permalink": "/r/DecidingToBeBetter/comments/nj0c8s/finally_admitted_to_myself_that_i_have/gz5glhu/"}