{"id": "t5_2tand_t3_nj0c8s_t1_gz5c0rt", "creation": 1621765498, "origin": "t5_2tand_t3_nj0c8s", "height": 1, "replied_to": "t5_2tand_t3_nj0c8s", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Be wary of the fact the modern political climate wants there to be racism even when there isn’t any, because racism is a big bad enemy that gives people a target to fight.\n\nLike another commenter said, you don’t have to feel bad for the things you described. Code switching isn’t a bad thing. My dad is British and I speak with more of a British accent around my family but more of an American accent around others. Not at all racial, just conforming.\n\nGrowing up, kids do stupid things. You aren’t defined by what you did as a kid. I wanted to be Asian growing up because I played in a youth orchestra and a lot of people were Asian. I always hoped someone would mistake me for Asian. I don’t think that now because I’m not a kid anymore. I’m not a bad person for being a child and trying to make sense of race and neither are you.\n\n\n\n\nThings like being a ‘coconut’ are other people being racist towards you. They are telling you what you are allowed to like because of the color of your skin. You’re allowed to like whatever you like. Of course you are watching films in English- you live in an English speaking country. You are allowed to do that. Also speaking English when you live in an English speaking country isn’t anything to be ashamed of either. I’m planning to move to a European country in the future and plan to speak the language there.\n\nWanting partners who are white is okay. You’re allowed to have preferences, even if those preferences came from the fact more white women are shown as beautiful on tv than other races. You alone are not responsible for changing how the world represents beauty. You don’t have to date someone you’re unattracted to because you don’t want to be racist. \n\nNot wanting people to make you look bad is not racism, it’s wanting to fit in. The feeling you’re describing is commonly called ‘cringe,’ and we only cringe at groups that are most like us. I cringe when vegans do and say something dumb because I’m vegan and I don’t want people to think I’m like the crazy vegans. It’s natural.\n\nYou’re not a bad person OP and you’re only hurting yourself by beating yourself up and calling yourself racist.", "permalink": "/r/DecidingToBeBetter/comments/nj0c8s/finally_admitted_to_myself_that_i_have/gz5c0rt/"}