{"id": "t5_2tand_t3_ejdzvs_t1_fczhnwf", "creation": 1578101470, "origin": "t5_2tand_t3_ejdzvs", "height": 1, "replied_to": "t5_2tand_t3_ejdzvs", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DoubleFelix", "text": "The Courage To Be Disliked has pretty much exactly this as one of its examples of how a superiority complex is a facade for an inferiority complex — which is itself then an excuse for not having the courage to face one's own tasks, and live by one's own values.\n\n> PHILOSOPHER: Okay, let’s go over things one at a time. The condition of having a feeling of inferiority is a condition of feeling some sort of lack in oneself in the present situation. So then, the question is—\n\n> YOUTH: How do you fill in the part that’s missing, right?\n\n> PHILOSOPHER: Exactly. How to compensate for the part that is lacking. The healthiest way is to try to compensate through striving and growth. For instance, it could be by applying oneself to one’s studies, engaging in constant training, or being diligent in one’s work. However, people who aren’t equipped with that courage end up stepping into an inferiority complex. Again, it’s thinking, I’m not well educated, so I can’t succeed. And it’s implying your capability by saying, “If only I were well educated, I could be really successful.” That “the real me,” which just happens to be obscured right now by the matter of education, is superior.\n\n> YOUTH: No, that doesn’t make sense—the second thing you’re saying is beyond a feeling of inferiority. That’s really more bravado than anything else, isn’t it?\n\n> PHILOSOPHER: Indeed. The inferiority complex can also develop into another special mental state.\n\n> YOUTH: And what is that?\n\n> PHILOSOPHER: I doubt you have heard much about it. It’s the “superiority complex.”\n\n> YOUTH: Superiority complex?\n\n> PHILOSOPHER: One is suffering from strong feelings of inferiority, and, on top of that, one doesn’t have the courage to compensate through healthy modes of striving and growth. That being said, one can’t tolerate the inferiority complex of thinking, A is the situation, so B cannot be done. One can’t accept “one’s incapable self.” At that point, the person thinks of trying to compensate in some other fashion and looks for an easier way out.\n\n> YOUTH: What way is that?\n\n> PHILOSOPHER: It’s to act as if one is indeed superior and to indulge in a fabricated feeling of superiority.", "permalink": "/r/DecidingToBeBetter/comments/ejdzvs/finished_2nd_season_of_you_on_netflix/fczhnwf/"}