{"id": "t5_2tand_t3_l5yn1a_t1_gkxx61g", "creation": 1611751821, "origin": "t5_2tand_t3_l5yn1a", "height": 1, "replied_to": "t5_2tand_t3_l5yn1a", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Bloomin-LifeCoaching", "text": "Okay so first things first, whatever you do, please don't hate yourself for anything that you do. We are all human, we all have been through different experiences in life that shape us into who we are now, and that's not something you can control.\n\nSecondly, I grew up in a completely opposite environment as a kid than you and yet I portray some of the same attributes as you do. I keep to my self. I am also selfish. I get told that I am an asshole. But the truth is I just know what I want in this life and for some that is intimidating. I strive to be a leader that others can look up to, and it's not to have power above others but to help guide others.\n\nReading some of this made me question some of your past friends honestly. The truth is if somebody really cared to keep you in their life, or cared to ask why you were wanting to leave the friend group. To me, it didn't seem like any one of them was concerned with how you were feeling and if that's the case, they weren't good friends to keep around anyways. This isn't me trying to just diss your past friendships, I hope you can see that.\n\nI believe that your anxiety has a big impact in why you feel that you are a narc. I think that you are just figuring things out like all of us are. You are young and your path that has lead you to where you stand today wasn't the easiest and that shaped you.\n\nIf I were you, I would be laser focused on yourself, communication with close friends and your boyfriend, and opening up to them. Communicate with your boyfriend on how you feel. He should be your biggest cheer leader and root you on no matter what. And if not, well I'll just say that's not something I would look for in a partner.\n\nAll in all, just work on being the best version of you. Don't change who you are necessarily just because others have something bad to say about you. What are the odds that what those people have said is 100% fact.\n\nI hope you have a great day :)\n\nIf you'd like to talk more about this message me and we can chat!", "permalink": "/r/DecidingToBeBetter/comments/l5yn1a/19f_help_am_i_now_just_realizing_that_im_a/gkxx61g/"}