{"id": "t5_2tand_t3_o6n51e_t1_h2znb3r", "creation": 1624625436, "origin": "t5_2tand_t3_o6n51e", "height": 1, "replied_to": "t5_2tand_t3_o6n51e", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MysteriousTraining72", "text": "Thank you. I can relate to a lot of what you said. I’ve also been insecure and desperate to be loved. I realize that if I was more confident in myself, I wouldn’t have fallen for just any guy who flatters me.. which is what I’ve done. I’ve fallen for anyone who said nice things to me and made me feel special. I let my emotions consume me. I’m glad you were able to set boundaries and speak your mind with the last one. I’ve been learning to do that.. and it’s hard. With the last guy I liked, I’d always end up giving into his sweet words. He minimized my feelings, and so did I. He made me feel so high and happy and special, only to make me feel insignificant. And he made me believe I was. So I realize true love comes from within. I’m trying to get there, and it’s hard. Being aware of the problem is easy, but fixing it is hard. I know I need to learn to love myself. I’ve learned what I really want, and yeah sometimes I’ve also felt like I was asking for too much. I never really acknowledged my needs and always brushed them aside to meet someone else’s. I’m in therapy, to process all of the trauma in my life.. I had a shitty childhood and have both daddy and mommy issues. Self improvement has been my focus ever since the last one got a girlfriend a year ago. I don’t want to ever find myself in that situation again. I recognize it won’t happen overnight. The journey is hard and painful at times. My goal is to feel confident enough to not be swayed by smooth words, and to not feel so bad about myself when others don’t treat me the way that I want them to. I have passions. And they’ll always be with me no matter who’s in my life. I have a vision for the future. And I want to learn how to achieve it alone, and be perfectly happy alone. It’s hard.", "permalink": "/r/DecidingToBeBetter/comments/o6n51e/how_to_stop_being_perpetually_heartbroken/h2znb3r/"}