{"id": "t5_2tand_t3_o6n51e_t1_h2vf76k", "creation": 1624532801, "origin": "t5_2tand_t3_o6n51e", "height": 1, "replied_to": "t5_2tand_t3_o6n51e", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Far-Ad-4810", "text": "I think you recognizing that the people you wished could be your 'someone', and that they were not right for you is already a major step in the right direction. It can be incredibly hard to move on or feel 'released' from past experiences, especially when they connected to you emotionally. Since i'm by no means an expert or know your life story to a point where i'd feel comfortable making any 'real' notions, here's a few things that might help you. \n\nFirstly, i'd suggest looking up boundary making skills, or articles that deal with establishing boundaries and the practicing them in everyday life, they don't have top be big boundaries but make sure those you make you keep asserting and also validate for yourself. From personal experience it has helped me with feeling more confident on my own and settled in my decisions. \n\nSecondly, if you have Netflix I suggest watching Brene Browns \"the call to courage\" it really dives into why/how/when we feel rejected/accepted in everyday relations and romantic ones.\n\nFinally, whenever you can practice small joys, and big ones, doing things you know makes you happy and keep doing them, as in, if you can try to let any worries about possibly 'missed' joy with a partner or joy from any changes you *could* make. Yes you could, but maybe by feeling more settled in knowing you have places where you are happy will make it easier to see any additional joy in the future (or partner) as an addition and not a necessity because you're already 'settled'.\n\nI hope you find a way to feel at peace with yourself and your past and wish you good luck moving forward :')", "permalink": "/r/DecidingToBeBetter/comments/o6n51e/how_to_stop_being_perpetually_heartbroken/h2vf76k/"}