{"id": "t5_2tand_t3_o6n51e_t1_h2u8pj0", "creation": 1624500424, "origin": "t5_2tand_t3_o6n51e", "height": 1, "replied_to": "t5_2tand_t3_o6n51e", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MysteriousTraining72", "text": "I guess I’ve been single for so long, and every time I think something may happen with someone, turns out I got my hopes up and he leaves me for someone else. I can’t imagine my life with a partner anymore. \n\nI know I started every single relationship the wrong way: having sex with them almost immediately. I’m a very emotional and sensitive person, and end up falling for the person while they don’t (although they act like they do). I never had true emotional intimacy with exes, because I always chose guys who lied to and cheated on me. I haven’t had an official boyfriend since 2014. The guys since then got in my pants and acted like they cared about me. I thought I had emotional intimacy with the last one. He was polite, kind, and said such sweet things to me. He told me how special, beautiful, and talented I was. He said we’d definitely see one another again. And we talked about our lives.. I felt so close to him. When I had a bad day at work, he was the one I talked to. He praised my work and said how he was excited to see what I’d come up with next. And then… turns out he leaves me so easily when he finds someone else, even during lockdown. I was devastated. I’m still upset. But I realize it wasn’t true emotional intimacy— he knew the right things to say to make me like him. After this, I really questioned my judgment. I felt like something was missing since he left, perhaps because I felt the need to have someone who made me feel special? And now he made someone else feel special. It made me realize that I need to really love myself more, so I don’t just fall for nice words and praise. I don’t know how to just be happy on my own. Maybe I’m not confident enough in myself. I don’t know.", "permalink": "/r/DecidingToBeBetter/comments/o6n51e/how_to_stop_being_perpetually_heartbroken/h2u8pj0/"}