{"id": "t5_2tand_t3_o6n51e_t1_h2vv4ul", "creation": 1624542682, "origin": "t5_2tand_t3_o6n51e", "height": 1, "replied_to": "t5_2tand_t3_o6n51e", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Vividwanderer", "text": "Carrying over the resentment is really rough. I am so sorry. I carried over my lack of self worth, insecurities and a desperation to be loved. Which never attracts the right person. So instead of having a wall up, I let anyone in who gave me attention. Yuck. \n\nWith all these flaws and issues, I married someone who wasn’t right for me. We were great friends, but anything past that was nonexistent. I was such a shadow of myself when I committed to him, it doesn’t even feel real. \n\nSo, I’m picking up the pieces, trying so hard to be disciplined with self awareness, stay encouraged and remind myself that I have value and something to give the right person. \n\nI had a whirlwind romance after my marriage that felt too good to be true. And it was. I really had to force myself to step back and see the big picture. My emotions, my heart, completely took over. It was a first in my life, just followed my heart. There was a lack of reciprocity & lots of baggage on his side. But I knew he was capable of more than he was giving because he gave it and then took it away. And at first he addressed the baggage with a neutral tone, but it quickly turned defensive. So… that was all a disappointment. But I have so much gratitude that I was able to spot it, to define the lack, communicate exactly what I needed from him with grace (instead of shame, blame & anger. All from a place of fear). And when nothing changed, and it actually got worse, I knew to exit. The old me would have made excuses for him, I would have bent and bent to get my needs met or shamed myself into not having needs. It is so freeing to say, nah, I’d rather be alone than do all the heavy lifting in the relationship. \n\nAnd a man would read that and say, I bet what she wanted was money, I bet it was chores, I bet it was him being totally emasculated & inconvenienced for her pleasure. Nope. It was so much simpler than that. I wanted his actions to match his words and intentions. And when his actions and words weren’t lining up, I asked him to assure me that we were still on the same page, to just tell me that he still cared to the degree that he had previously stated. And that never happened. He made me feel like an inconvenience. I very clearly told him what my concerns were & they were not addressed. I took that as a sign that I wasn’t important enough to him to take the time to comfort me, so I moved on.\n\nIt hurt to go. I’m still mourning it. But I can see the future more clearly & cautiously now, which is a huge gift. \n\nSo, am I happy? With who I am and what has emerged from all the dumpster fires, yes. But I am lonely. I worry that I am asking too much or there isn’t a match out there for me. But… deep down, I just have faith that it will work out. And I’m not sure where that is coming from. \n\nSo, my only advice is to keep getting to know yourself. Unpack the old wounds all the way to your childhood and understand why you react to things. Why you picked the wrong partner. It’s a puzzle that comes together in the most unlikely moments.", "permalink": "/r/DecidingToBeBetter/comments/o6n51e/how_to_stop_being_perpetually_heartbroken/h2vv4ul/"}