{"id": "t5_2tand_t3_3mcmaj_t1_cve3id2", "creation": 1443210067, "origin": "t5_2tand_t3_3mcmaj", "height": 1, "replied_to": "t5_2tand_t3_3mcmaj", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NEVERDOUBTED", "text": "It's not too uncommon for the FDA to recall a drug that was heavily tested, used for many years by thousands (perhaps millions) of people, when it was originally believed to be safe. \n\nNow...I don't think there is anything that has 10,000 focused scientific tests associated with it. Not even climate change has that. There are certainly 10,000+ climate related tests, but not on just one specific area. \n\nRight?\n\nWith that, one other possible scenario. - All things have a failure rate with them, or at least, some statistical chance of a failure. Despite how many are made and used, and are verified to be to perfect, and overall, see millions of hours of use (as a collective whole) they can still fail...and sometimes fail at a rate never predicted. Best example? Mechanical failures related with airplanes. \n\nBest example of that? The Rolls Royce engine that failed on one of the A380s. Not a small failure, but a big failure. After all that testing, and all the work and verification that went into it, and all the people that spoke highly of the quality, it...failed. \n\nAnother example? Space shuttle booster o-rings. How much testing and engineering went into those...and hours of service, before just one dude said there was a chance of it failing? \n\nI'm involved with some science and engineering everyday and over the years of doing this, I have learned that you never say never with anything. If there is ever a chance, then there is a chance. And if you have 10,000 scientists that all say the sky is blue, and one guy says, \"no, it's red\", I listen to that that one dude...in fact I listen to him VERY closely. Because...sometimes it's the one dude that just sees and looks at things differently...that makes all the difference. \n\nEinstein....for example, really rocked the world of physics. He disputed the work of many great scientists, with years of education and research under them. 10,000? Depends on how you look at it. \n\nSo...\n\n>Proof is nothing but a collection of opinions that match your own.\n\nI say....f*ck ya!!!\n\nEDIT: I just thought of one more. High carb/high grain low fat diets. Dumbest thing EVER that so many people felt (and still feel) is the right thing to be doing. ", "permalink": "/r/DecidingToBeBetter/comments/3mcmaj/88_important_and_epic_life_truths/cve3id2/"}