{"id": "t5_2tand_t3_3mcmaj_t1_cve7xie", "creation": 1443217978, "origin": "t5_2tand_t3_3mcmaj", "height": 1, "replied_to": "t5_2tand_t3_3mcmaj", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NEVERDOUBTED", "text": "Well...okay. I'm not going to disagree with anything that you said. All sounds good to me. \n\nNow...that said, as a side example, I do debate vaccines from time to time. Doesn't mean I'm anti-vax, but I like to study them and I am a little concerned about their long term effects, and I do worry about how much control a government should have over what goes into a person's body.  \n\nJust for the record, (since you brought this up) I am a little concerned between the discrepancy of parents that reported problems with their kids, immediately or shortly after receiving a round of vaccines, to that of the whole \"causes-autism\" debate. \n\nDo I think vaccines cause autism? Nope. Do I think there is a chance that certain vaccines, in certain children, cause or create a condition that might be diagnosed as autism? Yep. But there is little evidence of this. \n\nAnd I think this is why we have such a strong debate on this. The scientists that define autism in a laboratory setting, can clearly demonstrate that vaccines don't cause autism. On the other end are some parents that note a radical change in their child the very second the needle is pulled out, which often at a later time, is diagnosed as \"autism\". So...do we have different definitions of \"autism\" - the scientific one, and the \"it looks like a duck\" one?\n\nSo I can understand both sides in this debate and I see how this supports a large group of people strongly feeling (knowing) one way about something (vaccines don't cause autism) to that of a much smaller group, (those parents that saw a change) that feel that they do, based on personal accounts. \n\nWe don't have to debate any of that, by the way, because the subject is really about masses vs. smaller disbelievers. \n\nSo...I'm using the word \"feel\" here and there, and I do think it's important...because...often what a person feels is based on knowledge and experience. A hunch leads to a hypothetical position, which then leads to testing, which then leads to a result that may or may not support it. But...just about everything originates with a feeling. \n\nThen...it either sits as that or someone moves it forward by seeing if there is any real evidence to support it. \n\nSo...if someone I work with \"feels something\", I would most likely say...\"let's check it out\". ", "permalink": "/r/DecidingToBeBetter/comments/3mcmaj/88_important_and_epic_life_truths/cve7xie/"}