{"id": "t5_2tand_t3_mjr8zy_t1_gtcnute", "creation": 1617547725, "origin": "t5_2tand_t3_mjr8zy", "height": 1, "replied_to": "t5_2tand_t3_mjr8zy", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Californiameatlizard", "text": "Look up DBT. When I was stuck in a very similar loop it gave me concrete actions to take. \n\nTry to focus on the concrete things in front of you rather than deep philosophical questions. Is the absence or existence of objective truth going to change the way you act?\n\nHave a daily checklist. Get up, shower, brush teeth, get dressed. Eat breakfast. Make plan for day. etc.\n\nAnd don’t do anything just in your head. Write it all down, as much as you need to. \n\n(I’m doing a shitty summary of what SMART goals are here, probably go look for a better explanation) Make a list of goals. (Maybe better your health, pick up a hobby, etc.) Think about timelines and priorities, and pick one, *just one*, to work on for now. None of what you’re doing or trying to do is easy; if it was you’d already be doing it. \n\nSay you’ve picked health as a goal. “Health” is a lot, go through and find sub goals, or ways to get healthy—exercise and eat better. \n\nPick one. Eat better is again a lot, so break it down—eat more veggies, eat mindfully, etc. \n\n“Eat more veggies” isn’t very measurable. So maybe you want to eat an extra serving of veggies a day. \n\nWhat do you need to reach that goal? You need veggies. \n\nTry to set a specific time if you can, say you’ll eat the extra veggies tonight. \n\n>\tI know that good sleep and going on walks make me feel a lot better, but it’s not enough for my brain to be convinced that I shall focus on building these habits.\n\nYou just have to start doing it. I wish there was better advice, but you just have to take that leap. You’re at the top of the stairs, and you’d like to get to the bottom. The only way to get there is to take a step.\n\nRight now you really just need to *do* things. You are not going to solve your overthinking problem by thinking about it. You need to *do*.", "permalink": "/r/DecidingToBeBetter/comments/mjr8zy/overthinking_is_ruining_my_life/gtcnute/"}