{"id": "t5_2tand_t3_n9c7sv_t1_gxnaaxg", "creation": 1620676251, "origin": "t5_2tand_t3_n9c7sv", "height": 1, "replied_to": "t5_2tand_t3_n9c7sv", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Lakkdainen", "text": "I'm sorry you are feeling the pain from this currently.  Note I did NOT say \"sorry you had to go through this\", because in the long run, you will look back and be happy at all the lessons you have learned.  I can directly relate to so many things you have described here.  I know you are hurting at the moment, but let me be the first to tell you... you are entering a golden age of self growth!\n\nYou will soon discover many positive things, and break away from defining your self as seen from your ex.  To bust out of your sad mindset, I challenge you to this thought:  If these other people were so amazing or clearly better than you, why couldn't he bring himself to simply break up with you and move on?  The answer is because you have solid value as a person and partner.  \n\nIf he's like 99.99% of the other cheaters out there, he gaslighted the hell out of you to lower your self esteem.  It's a mind game to make you think you are not worthy of being loved, that you were lucky to be with him, etc.  The reality is that he tried to diminish your self worth so you wouldn't realize you're better than him and leave.  It never seems like it in the moment, but cheaters have the lowest self esteem of anyone.\n\nI, and many others, have been exactly where you are.  Here's how it pans out:  You first have to detach a bit from the sadness and realize the craziness and manipulation that has been going on.  You'll quickly realize that there's many great people in the world, and many of them find you desirable!  With some time, you will feel amazed with yourself.  There won't be a constant negativity bringing you down.  \n\nIn closing, I contend that you don't \"truly hate yourself and your body\".  I believe you were simply hit with enough negativity from someone else that you were led to believe to think that way.  HUGE difference.", "permalink": "/r/DecidingToBeBetter/comments/n9c7sv/got_out_of_a_major_25_year_relationship_that/gxnaaxg/"}