{"id": "t5_2tand_t3_9qlh10_t1_e8a81lx", "creation": 1540275442, "origin": "t5_2tand_t3_9qlh10", "height": 1, "replied_to": "t5_2tand_t3_9qlh10", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Simple_Salamander", "text": "Hey so, I can really relate to your situation! I'm currently in my fourth attempt at college after withdrawing the first three times. I myself am having to do an appeal for financial aid for exceeding the number of allotted hours rule- my first recommendation would be to see if your university has an appeals process, as well...most do!  \n\n\nAnother thing that has helped me is getting organized. My husband helped me put together a spreadsheet that maps out the semester day by day, so that I know exactly what I need to be working on when to keep up. This has been immensely helpful for me, because in high school, I could just skate by with no real effort and still get all As, and that has not been my experience with college at all, so I've had to build new habits.  \n\n\nI would definitely agree with the others who said to pursue therapy. What has been a total game-changer for me is REBT (rational emotive behavior therapy). You may want to look into it and see if it could be beneficial for you too. I could recommend a couple of books for you, if you'd be interested; however, there's also a lot of information online about REBT for free.   \n\n\nThe basic concept is that our self-defeating behaviors (procrastination being one) are a result of underlying irrational beliefs that we have. I'm seeing a lot of negative self-talk in your post, which is why I suggested you look into this- I was in the exact same boat myself. I would constantly put off assignments and then spiral into a deep pit of self-pity, self-anger, frustration, and confusion. These behaviors fueled each other in my case- the more I avoided tackling the problem, the worse it got, and the more I hated myself. The more I hated myself, the more I avoided the problem...and so on and so forth. Things have really started turning around for me since I've started really confronting all of my irrational thoughts, though I still have a long way to go myself as well.  \n\n\nFeel free to message me, if you would like. I would be happy to share more about my experiences or just be there to listen to yours!", "permalink": "/r/DecidingToBeBetter/comments/9qlh10/i_have_failed_9_community_college_classes_taken_5/e8a81lx/"}