{"id": "t5_2tand_t3_9qlh10_t1_e8chwsq", "creation": 1540364036, "origin": "t5_2tand_t3_9qlh10", "height": 1, "replied_to": "t5_2tand_t3_9qlh10", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I think the first step is to master your mental health.\n\nFirst things first: If you're smoking weed, **stop**. It kills motivation. You can't afford that. Go cold turkey.\n\nRegarding the ADHD drugs: I get it. They can majorly suck. But it's normal for it to take a few tries to find the right medicine for you. And there are a lot of options. Have you tried Vyvanse? If depression is in the mix, Wellbutrin might also be a great fit.\n\nTry to get your ass in front of an excellent psychiatrist. If that's not possible, research **hard**, figure out if ADHD, depression, and anxiety seem to be factors for you, and understand the pharmacological options available to you. Then make persuasive arguments to general care practitioners.\n\nThen, start attending support groups. And read some good, research-based books about motivation, habits, and mental health. This sucks. You need help. You aren't the first person to have these problems, and you can get a major leg up by learning from others' experiences.\n\nOnce those 2 things are in motion, you'll have a much different perspective on what to do next. But even though it's premature, I suggest you put school aside for a little while. You're not ready. That's okay.\n\nGet a crappy retail job and study code independently. And start freelancing as a Wordpress ... setter-upper person. They're easy skills to pick up, and you can quickly start building your portfolio and learning a little about the business. Furthermore, my gut tells me you might be a great fit for freelance work and entrepreneurship.\n\nOnce you've succeeded in building a portfolio, teaching yourself a ton of code, and understanding the kind of career you want, look into boot camps. idk if they'd give a shit about formal education, if you can prove your skills.", "permalink": "/r/DecidingToBeBetter/comments/9qlh10/i_have_failed_9_community_college_classes_taken_5/e8chwsq/"}