{"id": "t5_2tand_t3_l8bdje_t1_gldgnn1", "creation": 1612019886, "origin": "t5_2tand_t3_l8bdje", "height": 1, "replied_to": "t5_2tand_t3_l8bdje", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "nayr_sival", "text": "I needed this today. Been clean from kratom for 37 days, and alcohol for 12 days now. I don’t really have urges to use again at this moment, but I’m struggling to cope with my mental health(depression, anxiety, agitation from where I’m at or not at in my life, aswell as covid life and not being able to piece my life together in the healthiest way or the ideal way) I knew getting sober wasn’t guna be easy, not using is the easy part though, but finding your direction or purpose in life and trying to run towards that is the hardest thing to do. On top of having all the emotions that overwhelmed me at 16 and drove me to use drugs and alcohol come back full force. I feel like I’m spinning my wheels in the mud and can’t get any meaningful traction.I’m filled with so much determination and drive to become the man I know I am behind the mask of substances, but with covid, it’s harder to set up doctors appointments or get in with a guidance counselor to assess my skills and what direction in life would be best for me. I guess I need to remember that it’s one day at a time, I can’t expect to be the whole man I am deep down overnight. Every day can’t be the best day, and I should try to accept that these emotions exist within me for a reason. I need to embrace them and use them as motivation to keep going, I may not like the spot I’m in, environment I’m in, or people I’m surrounded by, but if I continue trying to progress myself, will eventually look back and be greatful I didn’t use. If I use, I regress and actually stay put in the same miserable place. Stay positive everyone! One step in the right direction is one step farther away from the pain and darkness that enveloped our lives! I love all of you!", "permalink": "/r/DecidingToBeBetter/comments/l8bdje/instead_of_focusing_on_letting_go_focus_on/gldgnn1/"}