{"id": "t5_2tand_t3_n28f0x_t1_h04erfk", "creation": 1622495252, "origin": "t5_2tand_t3_n28f0x", "height": 1, "replied_to": "t5_2tand_t3_n28f0x", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ad_Gloria_Kalki", "text": "I completely understand these feelings you described. \n\nI remember how I felt so out of control when I was trying to stop drinking, and again when my oldest daughter was born. I didn't have a huge drinking problem, but I was moving in that direction. And I didn't have any issues providing for my daughter, but I didn't have any way to set her up for success in life. \n\nThat really got me down. \n\nTwo things helped me climb out of that hole, I'll share them in case they are useful to you and any who reads this.\n\nThe first was that I realized that I could not keep drinking in a way that I enjoyed and keep control of it. The neurochemistry involved in addiction won't allow it. I had to admit that I wasn't strong enough to control it. I had to surrender and admit that I couldn't just will my way through it. I learned to take pride in being a non-drinker.\n\nThe other thing was finding a mission for me to arrange my life around. Like, \"What can I do to provide my kids with food, shelter, and water for the rest of their lives?\" I don't want to hand them millions of dollars that they didn't have to work for, but I do want them to be free to live their lives without have to struggle just to survive.\n\nLearning to admit my weakness and surrender my desires in exchange for what I actually need, and finding a selfless goal that I can structure my life around. That helped me. In fact, because of the decisions I made based on those two things I now make more money, have a better and healthier lifestyle, and I'm going to be able to buy each of my daughter's a house for a wedding gift (or whatever, they're still little.)\n\nAnyway, let me know if any of this was helpful for you.", "permalink": "/r/DecidingToBeBetter/comments/n28f0x/i_dont_know_how_to_overcome_this/h04erfk/"}