{"id": "t5_2tand_t3_cc7h9s_t1_etlvdr7", "creation": 1562946163, "origin": "t5_2tand_t3_cc7h9s", "height": 1, "replied_to": "t5_2tand_t3_cc7h9s", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "sj90", "text": "That's such a negative and limited viewpoint around positive change in general. \n\nHe talks in this book about these issues and how he is currently in a healthy relationship because he slowly managed to learn from all that he had been doing wrong. And his attempts to identify these issues and patterns and how to try to rectify them. \n\nThat's the very core idea of this book. What kind of values you identify with and whether or not those are right for you and healthy for you.\n\nAlso, \"practice what you preach\" is a very flawed ideology to stick to because people who end up giving good advice through such self-help books and articles are those who have learned from their mistakes in life and identified why those mistakes happened. Rectifying those mistakes to have a better future requires change which is not easy at all and varies from person to person. Choosing to not pay attention to something worthwhile that has a chance to improve your life because you think the one who's giving the advice is not stable enough is worse than your characterization of a man you don't know personally. \n\nI knew about my issues and mistakes quite well but I struggled a lot with changing for the better for quite a long time. Doesn't mean that if I notice similar patterns in a friend I can't nudge them in the right direction if they require/request so. Whether they act on that is completely unrelated. But the patterns and thought process do exist and overlap between individuals enough that you can learn from someone else's experiences. \n\nIt's better to identify what resonates with you and choose to act upon it if you wish to instead of trying to push it away because you don't like the one giving the advice for arbitrary reasons.\n\n(my point is in regards to this book only)", "permalink": "/r/DecidingToBeBetter/comments/cc7h9s/the_subtle_art_of_not_giving_a_fuk/etlvdr7/"}