{"id": "t5_2tand_t3_q7cnj0_t1_hgj8qtq", "creation": 1634160240, "origin": "t5_2tand_t3_q7cnj0", "height": 1, "replied_to": "t5_2tand_t3_q7cnj0", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SweetPeaAsian", "text": "I had a very similar situation as you. My program for manual therapy required you to study and practice constantly to be well informed. Oral exams were hard because it required 100% memorization and understanding of where soft tissue, muscles or bony prominences were and how to test them. \n\nI personally found the biggest obstacle for most people was overcoming the anxiety of being examined. It’s already nerve wracking to reciting special orthopaedic tests. But on a time limit in front of an instructor with a clipboard? \n\nIf you didn’t study or incorrectly performed a special test, they would immediately know. Even if you know everything and you experience performance block, they will still fail you. So it often brought on a lot of tears from classmates after finals. \n\nAs a result, many people dropped out or failed classes. My original cohort was a whopping 32 and reduced to 14 students by the halfway mark. If you fail a class then you must wait 6 months until that same course is offered again. I was extremely proud of my hard work to still be there.\n\nHowever, halfway through my program my mom was diagnosed with thyroid cancer and didn’t want to do anything about it. I was an emotional mess. Life was squeezing the living hell out of me. I didn’t want to fail because I was crying in class everyday and while studying at home. Also, it felt like a burden trying to convince my hysterical mother to get surgery. So I decided to take a 6-month break from school to be supportive. Not just for my mom but for my mental health. My parents were not happy about this. They shamed me for not being more dedicated to graduating. It made me feel so guilty. \n\nBut I was also angry. Angry that they couldn’t be support for me when I needed it most. Angry that I’ve always helped them when they struggled. Angry that I’ve been independent my whole life and worked for the things I have, to be told I’m selfish and can’t do anything right. They never showed confidence in my career choice and they’d occasionally make back handed comments that I wouldn’t finish. Even telling me not to count my eggs before they hatch. \n\nThe effort I put in was a clear indication of how much I wanted this. I studied day and night. I made notes prior to class so I could review the material before we discussed it. My grades were among 80- 100% on quizzes and final exams. How could they not notice the sweat and tears I poured into this life choice? I chose this profession to make sure I could help support them when they’re old and retiring. I learned manual therapy so I could be educated on how to take their pain away. It felt like a slap in the face. \n\nI spent the initial period of my break pleading to my mother to remove the cancer through surgery. She insisted on treating herself with herbal and fungal holistic methods. It was driving me crazy. I knew she was actually scared of the surgeons accidentally cutting her vocal chords while removing the cancer cells. She would spend most of the days singing karaoke, and googling home remedies. Nothing I said would be enough to change her mind. \n\nCoincidentally, my cousin was moving to the University of Alberta at the time. She had never lived on her own before so my aunt and uncle suggested that I go with her to make sure she was safe. I stayed with her for about 4 months in a 1 bedroom condo. It was a very dark time for me because I would cry all throughout the day. I’d lay on the couch and binge Netflix. I’d get high on cannabis to relax and calm my nerves. We had a mattress on the floor as a bed. I also couldn’t find a job because the locals didn’t want to hire a non-local. \n\nAt one point my parents made a road trip to Edmonton for “fun” and showed up to give me some money. I was really grateful but my aunt insisted that they did this to keep their control over me. They NEVER go on road trips but they left after a couple of days. After spending another month of cleaning and looking after my cousin, having no income, and feeling unproductive, it was enough to tell me I needed to leave. \n\nEventually, I re-entered into my program and I found that I had forgotten a lot of important details during my time off. My grades were acceptable but my motivation was significantly reduced. I was dragging my feet this time. When I was getting close to graduating… My instructor told me I didn’t have enough clinic hours to apply for my boarding exam. She gave me a specific cut-off date and I worked extra long hours to meet my threshold. \n\nOne fateful afternoon, I received an email stating that the cut off date for board exam applications was slightly earlier. I ended up not having enough credits on time and had to wait another 6 months for the next board exam. \n\nNow being 1 year behind my original plan, I was feeling rather disappointed. Yet, I spent those 6 months studying and believing I would pass all 4 board exams with no problem. \n\nOn my first attempt I passed my ethics exam and my oral practical exam. However, I had failed my clinical theory and clinical sciences exams. This meant I had to wait another 6 months to retake the boards. My self-esteem took a hit and I started isolating myself because I was ashamed of not being successful. \n\nOn my second attempt, I passed my clinical theory exam but failed my clinical sciences exam. I was so devastated and disappointed with myself. Letting my peers, my parents, my family, and my friends down. I realized that I let myself down the most which was all that mattered. I had to wait another 6 months. So I did everything I could’ve to make sure I would pass the next time. I knew I wasn’t going to throw all my hard work away. \n\nI went to supplementary classes, I made my own practice exams, I read the textbook and small details on diagrams. I asked my previous classmates to share their notes or anything helpful. I was always watching educational science videos. My confidence of passing was shaken but I wasn’t going to give up.\n\nDuring my third attempt at my board exam, I counted all of my answers that I was sure were correct to have a minimum pass. And marked every question that I was hesitant about. I spent the last half of my exam going through process of elimination to increase my odds. \n\nAfter waiting a couple of weeks, I got an email stating that I passed all of my exams and that I could now register for my license to practice. My parents now show more respect for my profession strictly based off my income. I also moved out and rented my own suite. And earlier this year I almost opened up a small clinic within a local pharmacy but decided it was too soon. I can now say, I respect myself for never giving up and I’m proud of the work I provide to people in need. \n\nIt was a long, hard, and painful battle but I’ve grown so much from this experience. I appreciate every day that I get to work because I know what it took to get where I am now. For the rest of my life, I won’t ever let someone tell me I can’t do something. That’s something that I get to decide for myself. I also don’t need to be successful for the people in my life. If they feel like I disappointed them because I made a human mistake then that’s their problem. Everyone struggles and you have to start somewhere to be great at anything. \n\nBe proud of the hard work you’ve done up to this point. Don’t let the weight of the world tell you that you’re not good enough. I had classmates in their late 40s learning with me. So that’s a great example on how you still have endless opportunities no matter where you are in your life. If you need a break then take it. But be clear if it’s “running away” or if you’re tackling your problem and making this easier for you. \n\nWishing you all the best. You can do anything you put your mind to as long as you keep trying and don’t stop until you get where you want to be. -hugs- I’ll be crossing my fingers for you", "permalink": "/r/DecidingToBeBetter/comments/q7cnj0/i_just_found_out_that_i_failed_my_board_exam_this/hgj8qtq/"}