{"id": "t5_2tand_t3_o5lkvm_t1_h2o44pp", "creation": 1624380752, "origin": "t5_2tand_t3_o5lkvm", "height": 1, "replied_to": "t5_2tand_t3_o5lkvm", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Goliath422", "text": "First of all, DO NOT TRY TO BECOME A PICKUP ARTIST. It’s skeezy as fuck and even if it “works,” it’s the shiftiest possible foundation for a relationship to be built upon. \n\nIf you have social anxiety to the point of seeking out therapy, my advice is to steer clear of trying to pick women up at a park or a bar anyway. Those attempts fail A LOT and will only get less and less effective as time passes. Frankly, in my experience, women don’t like being approached for a date randomly out in the wild unless all circumstances are exactly right (those being that she is single, you are beautiful enough to spark interest on sight, she isn’t busy/late/in a bad mood, etc. etc. etc.). And trying to pick up a rando makes your chances of not just being rejected but being (justly) called a creep go up exponentially. \n\nMy advice is to focus on your hobbies that have a social component, join local clubs or go to Meets, and get talking with women when your primary goal isn’t to start a relationship or get laid. Your conversation will be smoother because you’re talking about something you’re into and comfortable with instead of trying to follow some script for a pickup line, women won’t have the pressure of immediately coming to a conclusion about your date-ability and be forced to go on your looks and opening line alone, and you’ll become friendly or even friends. Then you can ask yourself if you’re interested in more, and if you are, you can approach these hypothetical women as friends and ask if they’re interested themselves. Friends are going to be much, much kinder in rejecting you than a stranger who feels you’ve invaded her day uninvited. Friends are also WAY more likely to date you because they already know they enjoy your company. \n\nMost important of all: don’t approach every interaction with a woman as a chance to start a relationship or get laid. You take a woman’s actual self out of the equation—if you look at a woman for the first time and imagine marrying her, for example, you’re imagining marrying a photograph. You haven’t learned who she is, what she likes, if SHE will treat YOU right, if you have complimentary political views, if she’s a smoker which you hate/love, if she drinks/parties/does drugs/shares a religion/is even into dudes. You’ve objectified her and made her a prop in your life. I know what you’re really seeking is companionship, love, affection, shared goals, all that gooey shit that makes life worth living, but start with meeting a PERSON, not a POTENTIAL MATE. Speak easily and honestly and give her time and space to do the same. Don’t put the weight of your ultimate goal on early encounters—it’s too much to ask and will get you a cold shoulder often. \n\nGood luck out there, friend! Just stay relaxed (as much as you can!), be kind, and let relationships build themselves instead of trying to force them to happen or to look a particular way and you will be totally fine!", "permalink": "/r/DecidingToBeBetter/comments/o5lkvm/hey_guys_im_24m_and_ive_always_had_trouble/h2o44pp/"}