{"id": "t5_2qh1i_t3_2ohecq_t1_cmng0iu", "creation": 1417920128, "origin": "t5_2qh1i_t3_2ohecq", "height": 1, "replied_to": "t5_2qh1i_t3_2ohecq", "down_vote": 0, "up_vote": 37, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "misspelledthrowawy", "text": "I can't remember word-for-word what I thought, but it was something along the lines of, \"It's alright. We can go now.\"\n\nAt that moment, when I decided for sure that that was what I wanted, \"I\" had, for some reason, split into \"we.\" Brain me and heart me. Bouncing back and forth between feeling and unfeeling at that period of time while dealing with wanting to die left one part of me to keep it together. When brain me wanted to be dead, heart me would say, \"But what about so-and-so and others? You'd be hurting them.\" When heart me would wither away and I didn't really \"feel\" anything anymore, brain me would tell me, \"Keep it together. If you kill yourself, you'd be nothing but a failure.\" (Thinking about it now, it was less like \"brain me\" and \"heart me,\" and more along the lines of pride and guilt.)\n\nLater throughout the year where I was heavily contemplating suicide, I began to have panic attacks. Coworkers and roommates thought I was having mild seizures or something. Not that I knew what was happening either, but my stepbrother has epilepsy, so I thought maybe I was having heart problems due to stress. Boyfriend-at-the-time and I were living together, too, and our relationship had really gone sour. That mixed with the fact that he was using me for money, the fact that I had few friends (none being close to me and were more his friends than mine), and a shitty childhood made things difficult to cope. Then the boyfriend and I broke up, but he was still using me for money. \n\nWhy was that? See, right when I turned 18 and moved in with him, I was a doofus and started a joint bank account with him. We were both working at the same shitty fast food joint and all our bills and his shitty spending habits would drain that account faster than I could save any money to get out of there, and truth be told, he wasn't making a huge effort to help me out either. There were days that I didn't eat to keep up with his spending pre- and post-breakup if that paints a picture.\n\nI didn't have a great relationship with my family either, so I didn't think I could turn to them for help. At least, not without them expecting me to relinquish control over my life because I'd owe them whatever they wanted for dealing with me and my bullshit.\n\nSo one day, both \"brain me\" and \"heart me\" had given up. And thus, \"It's alright. We can go now.\"\n\nThat day, I got a hold of a bottle of pills and zombie-d my way to a quiet place by myself where I thought I would be dead by the time anybody found me (if they'd even starting looking for me). It turned out to be harder than I expected because it wasn't just pride and guilt keeping me alive at the time. It was also cowardice. So I decided to start out slow. Just a couple at a time when I would fade in between feeling nothing or crying and punching myself in the head, trying all the while to override every instinct keeping me alive. (The punching in the head thing is weird, I know, but I used to think it wasn't actually self-harm because I wasn't cutting or doing anything that left anything permanent.)\n\nI ended up chickening out after only taking about a fourth of the bottle. But for some reason that day, I couldn't get myself to stop crying. It weirded everyone out because I was considered bubbly and happy-go-lucky. Someone kept asking me what was wrong, and I eventually told them. They had went and called an ambulance, which surprised me because I told them I didn't take that many. (However, \"not that many\" turned out to be more than I thought it was, toxicity-level-wise.) So, the paramedics showed up, took me to the hospital where they made me drink a charcoal shake, and kept me for a 72-hour stay.\n\nSorry for the wall of text. I have a hard time actually considering the incident an actual suicide attempt because I wussed out before I had a chance to die anyway, so maybe my last thought doesn't actually count. But there you go.", "permalink": "/r/AskReddit/comments/2ohecq/suicide_survivors_of_reddit_what_was_the_last/cmng0iu/"}