{"id": "t5_2qh1i_t3_2ohecq_t1_cmnz1ld", "creation": 1417978398, "origin": "t5_2qh1i_t3_2ohecq", "height": 1, "replied_to": "t5_2qh1i_t3_2ohecq", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Made_you_read_penis", "text": "To be fair I received training on how to speak about childhood experiences.\n\nPainting in acrylic, but I also do ink work.  I actually don't like painting, but hey, they sell.  I do a lot of stuff that talks about my experiences in life, but I also developed a BDSM/leather daddy enthusiast following locally, so big comic style ink posters are fun to do.  Lots of BDSM, sex, and guro under a separate name.\n\nI'm *finally* moving into silkscreen stuff; I'm a nerd at heart.  It's always been my dream medium, but the setup is very pricey.  I want to make art posters, yeah, but I've always liked gig posters.  My style is better suited for silkscreen.\n\nI *just* inherited the silkscreen equipment from a very lovely and very well known artist that passed, and unlike my paintings where I sold them sporadically when I market myself hard I'm getting pre order offers like crazy, and my very first patron from the BDSM community.  All I need is to set up a better dark room for image transfer, so we're making my entire garage my work space.  That's intense for me.  I now have an account and receipt book because it's getting popular enough that I need to claim it on my taxes.  No more straight cash with no records.\n\nI plan on re launching my site within the next year, as I've got a much better webmaster now and I understand watermarks and things like that with the lessons learned.  Right now no site, which has been a big issue.\n\nI'm relatively new, but I'm also a 6th generation artist, so I've had a lot of exposure to the business.  My grandparents are wonderful for that.\n\nOkay, that was too long of an answer, but I'm so excited it's crazy.\n\n**TL;DR**  Basically I do paintings and ink, but I want to work in silkscreen now that I have my footing.  It's been well received.", "permalink": "/r/AskReddit/comments/2ohecq/suicide_survivors_of_reddit_what_was_the_last/cmnz1ld/"}