{"id": "t5_2tand_t3_n4xdlk_t1_gwy5g3c", "creation": 1620162251, "origin": "t5_2tand_t3_n4xdlk", "height": 1, "replied_to": "t5_2tand_t3_n4xdlk", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "tubnug", "text": ">Everything else is too difficult and under-stimulating, so I never leave my comfort zone. I get exhausted from mental effort so easily. I feel so underdeveloped and passionless\n\nI think it's important that you've made this clear to yourself, at the very least you're aware of what you're feeling and can recognize how it'll degrade you if you allow it to go on. You enjoyed the arts didn't you? what happened? In my experience if you don't want to go back to an old hobby try something new!   \n\n\n>I also kinda like being up to date on pop culture and news. Maybe this is all just rationalization, idk.\n\nYou definitely are just rationalizing this. You have an addiction. We don't like to accept technology use as a toxic use of our time, but the reality is that surge of dopamine you get whenever you get a notification or read something instantly gratifying is LITERALLY the same high that people who drink, smoke, and gamble feel. It's unhealthy and frankly I think more people need to hear that.  \n\n\nI think the way it'll effect your mental health is heavily reliant on what you do after you go 'sober'. I'm 19 and deleted all my social media except reddit and snapchat because I realized that not only was my screen time astronomically high, I had/have an unhealthy dependency on my phone and I'm also trying to do something about it.  \n\n\nNow that I don't really have social media to cling to, I don't really have a reason to use my phone to be honest except texting and calling. It's honestly an incredibly liberating feeling and it made me feel like there's so much more time in the day. Open to ideas? Go on a walk. Honestly. Just going outside (without your phone) for 20 minutes to walk around look at things and take it all in can start to ground you and get you in a better head space, it did for me anyway.   \n\n\nYou can also try meditation, nothing serious, just closing your eyes for like 5 minutes (using guided videos tend to help me so: [https://www.youtube.com/watch?v=inpok4MKVLM&ab\\_channel=Goodful](https://www.youtube.com/watch?v=inpok4MKVLM&ab_channel=Goodful))   \n\n\nNothing about it is easy, I know. It's gonna suck some days and I think the days where you wanna grab your phone the most are probably the days you should feel even more inclined to go do something else. It's scary, and definitely worrisome to have a goal like this and not know where to start. I think it's possible, and for what it's worth: I think you can do it, I'm rooting for you OP !", "permalink": "/r/DecidingToBeBetter/comments/n4xdlk/i_have_been_addicted_to_technology_from_an/gwy5g3c/"}