{"id": "t5_2tand_t3_ldabwt_t1_gm611i9", "creation": 1612562999, "origin": "t5_2tand_t3_ldabwt", "height": 1, "replied_to": "t5_2tand_t3_ldabwt", "down_vote": 0, "up_vote": 12, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Simply-Rainy", "text": "Yes having the matted hair became painful. It would pull at my scalp in a way similar to having a tight ponytail. There was one large clump in the back which specifically was uncomfortable and pulled at the edges. \n\n\nYes, I tried washing it without combing through in hopes that it would losen up enough to let me get through the matted parts. It did not work. \n\nI would brush the front of my hair back and collect it into a bun like ordeal. And use gel to hold it back, concealing the clumps of matted hair underneath. No one noticed. But over time, it began to look more like a nest and harder to hide and harder to grip the hair together. \n\nWell part of my depression is that I don’t have much family support. I’ve only seen one family member a handful of times over the past couple of years. I tried to discuss what was happening to another relative that lives out of state over the phone, I mentioned that I hadn’t taken care of my hair like I should but I didn’t go into any details. Immediately, there was a feel of judgement. So I didn’t discuss what I actually meant and the severity of the issue. And I was working from home since early last year. No coworkers could notice. Prior to that, I was successful with the pulled back bun method. My mom passed in early 2019, the last time I had my hair professionally done was for her funeral. I didn’t notice too much at first (or was in denial) I just took it as a rough patch that would subside. Things just progressively got worse. \n\n\nMy scalp feels soo much better now! I’m a huge fan of lush products and I was finally able to use the shampoo I was waiting to use!! Smells soo good. Feels soo good!! I am happy. \n\nThank you. 😇", "permalink": "/r/DecidingToBeBetter/comments/ldabwt/combed_my_hair_after_2_years/gm611i9/"}