{"id": "t5_2tand_t3_mobmfv_t1_gu43tur", "creation": 1618111984, "origin": "t5_2tand_t3_mobmfv", "height": 1, "replied_to": "t5_2tand_t3_mobmfv", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "daughterofthemoon420", "text": "Funny I thought my best friend made this post. We are both part of a friend group that’s been tight since freshman year in high school (about 6 girls). We are now in our late twenties. My friend and I are the only ones who moved out of our hometown and have started moderately successful lives (still in early stages of our careers). But the rest of us, the group still living back home, still do the same shit and have not grown at all. Still go to the same bar on Saturday nights, still want to turn up all the time, work jobs just to get enough to party on weekends. One of our girls even got a DUI about a month ago. \n\nMy friend and I both came to the conclusion: We will always love them. We have suffered together, grown together, grieved together, physically have fought against others together, have built a beautiful family with kids now in the mix and husbands and community. We will always cherish that! But at a distance. And that’s okay. Because that’s growing up and it doesn’t make us bad friends. I’m prepared to live a life time loving those 6, always and forever, through thick and thin, but prioritizing myself and my success above all. \n\nLiterally talked to my dad yesterday cause like I said my friend and I are currently going through a break up of sorts with the rest of the group, and he told me something wise:\n\nYou will start the path of life with others at the same starting line. As you continue your marathon through life, for whatever reason, those you started with will take rests, get lost, or give up. You will then have to choose whether to wait for them to catch up, go back to get them, or simply keep walking forward. However, if you do choose to stay back for them you’ll end up walking the same path you’ve already surpassed and waste the little time you have left on your race. The best thing is to keep walking forward. Your friends can always catch up.", "permalink": "/r/DecidingToBeBetter/comments/mobmfv/is_it_appropriate_to_separate_myself_23_from/gu43tur/"}