{"id": "t5_2tand_t3_gmrb74_t1_fr6e2ty", "creation": 1589924583, "origin": "t5_2tand_t3_gmrb74", "height": 1, "replied_to": "t5_2tand_t3_gmrb74", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "the-Toddfather", "text": "My job just prior to this revolved around developing cellular biologic therapeutics. I took on a wide range of projects from CAR-T geared towards solid tumor cancer, using allogeneic Natural Killer cells to assist blood diseases and leukemia, isolating and culturing adipose- and cord blood- derived mesenchymal stem cells for treatments, isolation and application of exosomes, etc. and making biogel scaffolds to help repair wounds. I was given the opportunity to travel all around the world these past couple years for work (I set up and trained new labs, attended conferences), and was able to see what major players are doing in cellular medicine, as well as the impacts directly in numerous clinics.\n\nBefore that job I did university research where I 3D designed, did the electrical wiring, wrote a decent portion of the programming, physically constructed and then operated a 3D bioprinter for making custom 3D biogel extracellular matrices to be combined with embryonic stem cells for tissue repair.\n\nI chose to primarily pursue biomedical engineering in college because ever since I lost my dad to ALS at 14, it has been my dream to cure, or at least very effectively treat that disease, among others. I didn't know how I would be able to get into a position to do that with the ability to pioneer new ideas until unforeseen blessings put me into the opportune moment I have now. Two of my business partners are among the top in their field with lots of intimate experience in novel treatments for several debilitating diseases and vaccine development. \n\nIt took me a long time to get to the right place in my life, and it took several twists and deep lows to get here. You just have to focus your way through all the noise. Remind yourself each morning what you're getting out of bed for. It cannot be superficial.", "permalink": "/r/DecidingToBeBetter/comments/gmrb74/yesterday_i_resigned_from_my_job_to_fully_devote/fr6e2ty/"}