{"id": "t5_2tand_t3_pzb93m_t1_hf1xm8s", "creation": 1633143320, "origin": "t5_2tand_t3_pzb93m", "height": 1, "replied_to": "t5_2tand_t3_pzb93m", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AggressiveYou2", "text": "I've been self medicating daily for a while, as well. Got worse at the start of covid after leaving a long term, toxic relationship. It sucked and I thought it would be better for me to feel nothing than what I felt at the time. The problem is that if you keep drowning out the negative thoughts and feelings out with cannabis, it makes it harder to deal with them sober.\n\nIve been talking to a therapist for a few months and this week she actually suggested that my daily cannabis use could be stopping my progress. She told me to cut back, not entirely, not yet at least. I would try titrating yourself off of it, maybe instead of daily, switch to every other day, then just weekends, and then off it altogether (if that's what you want). I'm currently still not listening to her newest advice, since I'm so great at self-destructive habits to distract myself from my (perceived) shitty life.\n\nI like using cannabis, not just recreational but also for medicinal purposes. But it definitely has made me more sensitive to my negative thoughts and feelings. I'd try to start meditating, I use the headspace app for a daily 5 minute practice to start my days off, it helps to make it a habit/routine. But I still have a long way to go.\n\nPersonally, I highly suggest you speak with a licensed professional, because if you quit weed cold turkey without addressing what it is that you're using it as an escape from, you probably won't stop or get better. You're dependent on it, physically and mentally, as a crutch. Working out could help with your appetite, and could relieve stress and help with sleep. You can try melatonin as another sleep aid, but that is entirely up to you and your doctors\n\nI hope the best for your recovery, let's end the stigma of smoking weed everyday making you cool or a loser, and instead figure out why it is we're depending on this substance and how to not need it to get through our lives", "permalink": "/r/DecidingToBeBetter/comments/pzb93m/am_i_self_medicating_or_fueling_my_depression/hf1xm8s/"}