{"id": "t5_2qh1i_t3_2dpvdz_t1_cjrwcxh", "creation": 1408198223, "origin": "t5_2qh1i_t3_2dpvdz", "height": 1, "replied_to": "t5_2qh1i_t3_2dpvdz", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SausageManDan", "text": "Okay, so I thrown my tale out a bit. You can either look at it as \"it was a shitty attempt, it would never have worked, hardly a survivor, he didn't even come close\" or you can see it as \"he's still a survivor because he tried\".\n\n\nSo I'll start this at the start of this year. \n\nI had depression, I had a history of self harm of around 4 years with nearly 2 years clean and trying for 3 to get into the army.\n\nAround the start of January my relationship with my father fully broke down. I don't mean we had an argument and I stormed out. I mean, we had argued for months, and I mean months, about the most trivial of things. My dad has had a drink problem for many a while. Around 20 or so years I'd say. Not to the point where he doesn't work, I give him his credit. He was worked every day of his life to provide. But he would drink a large amount every night when he came home from work.\n\nHe had a history of becoming violent when he had drunk. As he did with my mum. I moved to live with my dad around 2 1/2 years ago. Anyway, back to point. January, like every night we had argued, he told me how useless I was and hadn't done anything round the house (I'd been signed off work sick for 4 months at this point and had a referral to a mental health team in process)\n\nWe had a huge argument. He was finding something to argue about. I went downstairs to the kitchen and I admit I deliberately pissed him off by making a lot of noise while he was trying to sleep. Again, the argument continued when he came down, he got up in my face and pushed me, I wasn't going to be intimidated, I saw him beat the shit out of my mum 10 years ago, I wasn't letting him do it to me. I pushed him back out of my face, he grabbed my wrists. A struggle ensued as I tried to break free and punch him. Up against the worktop I went with force. I managed to turn around, to which he then full force slammed me against a wall, however there was a shelf that came into nice contact with my head. He let me go. More arguments and around 10 phone calls later my mum persuaded him via phone to let me out the house because he was hell bent on \"fucking sorting this out tonight\". Bare in mind I was frantically searching my room for a knife. I had every intention of seriously hurting this vile man.\n\nThat night I crashed at my now ex-girlfriends family place. The following day my grandparents came and picked me up, I remember my grandad just holding me in the middle of the car park as I stood and cried on him. What was my life coming to?\n\nOver the next 4 months I got put on medication and gradually deteriorated. I was self harming more and more, suicidal thoughts were getting worse. I set a date of the 22/04/2014.\n\n21/04/2014 came, like any other day, I had walked the dog in the morning, I had helped round the house, I went to someones house in the village and helped with their PC problems, came home, had some lunch. I went to my room, I couldn't make another day, it's not that I wanted to die, it's that I didn't want to live. I sat in the bathtub with a razor, I text my mum telling her I love her and my little sister and that I was sorry. I then attempted to slit my wrists. I have 8 rather maroon scars from that. I was close but not close enough. I could see my veins in the cuts, I was at most a millimetre off hitting them.\n\nI had failed. I sat crying as I dialed my mum, I went into auto pilot, I rang her and between crying told her what I had done. She rang my grandparents and told them, they came up, got me out the bath and drove me to A&E. I went into an adult unit for 2 days before being transferred to a teenage unit. Where I've so far spent 3 1/2 months. I'm still technically a patient. They're getting me my own place and I've been sleeping on my muns sofa for nearly 3 weeks.\n\nSorry if this is depressing, but hopefully this will cheer you up. I'm happier. I'm going back to study, I've got an IT apprenticeship in place and will be starting my life again. \n\nThe whole incident at A&E has now become a joke. When they admitted me, they wrote 'DSH' on the paperwork to come dress my wrist and clean it. That stands for Deliberate Self Harm. The women who came to sort me out, asked how I had done this with the dishwasher. She saw DSH and thought dishwasher.\n\nThe whole thing me and my mum refer to as the 'dishwasher incident'. Take how you will but thank you for reading my story. Sorry if it's long but any questions feel free :).\n\nJust a little side note. I don't have contact with my dad anymore. I've spoken to him once in 8 months. He has also sent me 2 text which I deleted straight away. I've made the decision to keep him out my life. He is my dad after all and I will be civil when I see him (weddings).\n\nDo you want to know the saddest bit of it all? Not once has he said sorry. That he also admitted to my mum that \"I still don't know what it is that I did.\". \n\nWelp. There's all for everyone to see, I've been specific with dates, I'm very open and honest, all family and friends knoe about this and if they saw this would instantly recognise it was me.\n\nEDIT: Spelling. (&added a bit at the end).", "permalink": "/r/AskReddit/comments/2dpvdz/serious_suicide_survivors_of_reddit_what_are_your/cjrwcxh/"}