{"id": "t5_2tand_t3_n390k1_t1_gwq9h4q", "creation": 1620002610, "origin": "t5_2tand_t3_n390k1", "height": 1, "replied_to": "t5_2tand_t3_n390k1", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Able_Remote_3616", "text": "I'm going to respectfully disagree and try to articulate why this doesn't hold true for me  and atleast some other people bc this is something I struggle to understand. I did not watch the video but I've seen videos that make a similar point l, here one from Dr. K who I really enjoy ( https://youtu.be/So7hE1Ba_QA )\n\nIf I'm understanding correctly the basic premise of your point is that ACTION>THOUGHT when it comes to *self esteem* . On this most basic premise I think we can agree! I recently read Nathaniel Branden's *6 Pillars of Self Esteem* https://youtu.be/mfFUVnwCNVY which I really liked and I think he reinforces the idea that the same actions that reflect self esteem are the actions that build self esteem. We could call this the \"fake it 'til you make it\" idea if you want something catchy and oversimplified and I like that kind of stuff. The next logical question then is how do I act that way?\n\nThe problem is that humans are actually naturally geared towards self improvement by default. Helplessness is a learned trait. In other words if you have low self esteem and you're not following the natural pull of self improvement, some other force is acting on you. Often it originates as some negative  *limiting belief*. \"Focusing on self improvement\" sounds nice but there's a good chance you've done that before and failed because you couldn't overcome the negative belief that caused you to avoid focusing self improvement in the first place. \n\nThe basic premise of CBT is that thoughts lead to feelings and feelings lead to actions. If you don't like the way you're acting the best way to change is to understand what thoughts lead to certain feelings and how those feelings lead to your action (or inaction). Usually the initial thoughts are irrational, based on a some cognitive distortion ( https://psychcentral.com/lib/15-common-cognitive-distortions ) that you can recognize and change. If you change the thought, you change the feelings, and with practice you change the action. \n\n So be self absorbed but have some direction to your introspection. Get curious about what your defense mechanisms are protecting.  Get curious about what thoughts preceded your feelings. Just my opinion let me know what you think, am I missing something? Ive struggled with low self esteem for a long time. Sorry for the rant it helps me organize my thoughts when I write this stuff down", "permalink": "/r/DecidingToBeBetter/comments/n390k1/a_new_insight_on_raising_selfesteem_not_being_so/gwq9h4q/"}