{"id": "t5_2tand_t3_lkr1ax_t1_gnm1tka", "creation": 1613449139, "origin": "t5_2tand_t3_lkr1ax", "height": 1, "replied_to": "t5_2tand_t3_lkr1ax", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ThoroughlyGray", "text": "So lying like this is a defense mechanism, and it takes a conscious mindset shift to fix. A therapist and/or mindfulness meditation can help you focus on ideas:\n\n-There are greater things in life than avoiding trouble.\n\n-Staying out of trouble is not the same as being a good person.\n\n-You’re denying yourself the opportunity to be truly seen. You’re hiding your mistakes, or “bad thoughts”, or things unlikely to be well-received, which doesn’t really allow people to get to know you fully. You’re also missing out on the wonderful experience that is “being bad and being forgiven.” People who grew up lying like this as a coping mechanism often never got to experience this phenomenon as children, and we tend to be unsure that we will still be loved if we mess up. If you never got that as a kid, it’s really transformative to experience for the first time as an adult. Really, really lovely, you should try it.\n\n-You’re denying yourself the opportunity to really know yourself. When you lie, even if you know it’s not true, it allows you to sort of...not really examine the truth too hard. I’ve noticed that once I say the truth out loud, to another person, in a time where I usually wouldn’t, it a) exposes some sort of truth or deeper root that I need to work on and b) makes the thing I was lying about seem WAY less dramatic and severe. If you’re someone who has been very hard on yourself, consciously choosing to tell the truth/not hide can actually show you that wow...this was not even that big a deal in the first place, and keeps you from distorting it/subconsciously blowing it out of proportion in your head. \n\n-The big takeaway is that practice makes perfect. The more you do it, the more you’ll learn about how you feel, and why you feel that way. Practice being intentional with the things you say....as someone who has (had?)  this same vice, I found that the lying/hiding tended to just slip out, and it would take me stepping back and taking the second to ask “Is that actually true or is that something I just said?” Then you can get to the point where you ask that question BEFORE you say the thing...and it becomes a lot harder to lie intentionally when you point it out to yourself that that’s what you’re doing. Mindlessness was a huge factor in most of my lying.\n\nHope this helps in some way! Congratulations on deciding to be better in this way; I promise it’ll make you happier/feel more free in the long run!", "permalink": "/r/DecidingToBeBetter/comments/lkr1ax/how_do_i_become_a_more_honest_person/gnm1tka/"}