{"id": "t5_2tand_t3_lkr1ax_t1_gnn2ui1", "creation": 1613479342, "origin": "t5_2tand_t3_lkr1ax", "height": 1, "replied_to": "t5_2tand_t3_lkr1ax", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Glad-Curve4601", "text": "Thanks for sharing your problem. The lie is a symptom of something much bigger. \n\nYou have pointed to one reason why you have been telling lies but there might be other explanations. There are several reasons why people lie, one of the main ones being that they  have low self esteem. If it is related to self esteem, the good news is that you can work on this.\n\nIt requires us to have a much better understanding of who we are. Too many of us go through life never knowing our purpose and what we stand for. We fail to recognise our talents and only focus on our weaknesses. As a result, we find ourselves muddling through life and covering our tracks.\n\nI suggest the following three steps:\n\n1. Positive self talk  \nStart monitoring your self talk. Positive words in; positive actions out. If you catch yourself saying something negative to yourself, flip it to a positive. You need to be aware that your subconscious is listening 24/7 and will act on whatever you feed it. This means we all have to be careful what we say even if joking.\n2. Identify who you really are  \nWork out what your purpose is and your values. People with purpose have no need to lie to themselves or others. They know they're on this planet to have a positive impact. They know what is right and what is wrong and they make sure that every action is about helping them to fulfil their purpose. \n3. Gratitude  \nBe thankful for everything no matter how small. This serves two purposes - when we're grateful, it moves us to a more positive state and it helps us to develop resilience so that we can deal with life's setbacks.\n\nYou've started your journey to a more truthful life. Enjoy it.", "permalink": "/r/DecidingToBeBetter/comments/lkr1ax/how_do_i_become_a_more_honest_person/gnn2ui1/"}