{"id": "t5_2tand_t3_q8ucx4_t1_hgto7fh", "creation": 1634357328, "origin": "t5_2tand_t3_q8ucx4", "height": 1, "replied_to": "t5_2tand_t3_q8ucx4", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "intensely_human", "text": "It damn well better not be over for you because I’m 38 and looking at a career with no real accomplishments so far. Just trying to survive.  \n\nI will say that in my late twenties I finally began to believe that *pushing creates change*, ie that I can put in effort and get out results. In anything. And that more effort means more results, so proportional.  \n\nWhen I was your age I believed that I was stuck. That my lack of achievement was evidence that my nature was incompatible with achievement.  \n\nBut it’s not true. You’re like a big barge floating in still water. And your daily efforts are like you standing on the dock next to the barge, holding a rope attached to it.  \n\nIf you pull on the rope, the barge moves. Water has no minimum force necessary to overcome friction. The barge moves slowly, but it moves. Any amount of force will move it. There’s no line between “can” and “can’t”; it’s all “can”.  \n\nYour nervous system is like that. When you make effort, it rearranges. You’re not stuck you just have a lot of inertia. The medium is fluid, not solid.  \n\nIf you don’t believe that, try this: Just say over and over in your mind “My effort creates results”.  \n\nYou don’t need to feel a deep meaning as you say it. You don’t need to look yourself in the eye in the mirror. You don’t need to meditate beforehand. You can just repeat it again and again when you drive, walk, do dishes, whatever.  \n\n“My effort creates results. My effort creates results. My effort creates results. My effort creates results.”  \n\nThe best thing that can happen is you say it so many times the words become meaningless mush in your brain. And then keep saying it even more. Push, push, push. Trust me on this - the neuroscience behind this is sound.  \n\nBelieving that you’re stuck is a superstitious, unscientific myth. Your mind is fluid, not solid. It’s a viscous fluid but it is a fluid nonetheless. Think of an ice cube drifting across the table. The tiny deviation from level in the table creates a tiny sideways force. But because the water is a *fluid, not a solid*, there is no minimum force necessary to create movement.  \n\nWhen you start seeing all the walls as clay that **will** warm up as you push, life begins to look different. My own career isn’t too great yet, but I’m constantly getting better at everything I do and the respect is starting to coalesce around me.  \n\nSo tomorrow make this your mantra. Say it as many times as possible. Why was many times? Why is 101 times better than 100? **Because your mind is a fluid not a solid**  \n\n“My effort creates results. My effort creates results. My effort creates results. My effort creates results. My effort creates results. My effort …”  \n\nEverywhere you go, all the time, keep repeating it.", "permalink": "/r/DecidingToBeBetter/comments/q8ucx4/ill_be_25_in_a_month_is_it_too_late_for_me/hgto7fh/"}