{"id": "t5_2tand_t3_q8ucx4_t1_hgspccc", "creation": 1634338480, "origin": "t5_2tand_t3_q8ucx4", "height": 1, "replied_to": "t5_2tand_t3_q8ucx4", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "helpimacarrot", "text": "Im 30, gonna be 31 soon, and I decided to work on my stuff at 25. I enrolled in school and have since gotten into therapy to help with my mental health issues. These feelings of unworthiness or feeling inadequate don’t just disappear and it something I still struggle with but I have a great support system and being in therapy has helped immensely. \n\nYou are not alone at trying to figure out your life at an “older age”. I think 25 is still quite young. And I also wanna say that your path might not be linear but do not be discourage by that. It took me three years to get my associates degree and that made me feel like crap. But I realized that I was doing myself a disservice by not being proud of my accomplishments. It might have taken me longer than most, but it was my time, effort, and dedication that got me that degree. I should be getting my bachelor’s degree by the end of the spring 2022 semester. So, hopeful this part of my journey will be over soon lol. \n\nOne thing that help motivate me and that I alway keep in the back of my mind is this quote I saw a while back. Essentially it said, don’t frame age or time as a negative such as, “I’ll be 40 by the time I finish school” because you’re going to be 40 one day anyways so you might as well spend the time in between pursing your dreams. \n\nSorry for the long response OP. The gist of what I’m getting at is that you’re still young and even if you weren’t, you should spend the time you have going after your goals rather than thinking they are outside of your reach due to age. \n\nGood luck on your journey!", "permalink": "/r/DecidingToBeBetter/comments/q8ucx4/ill_be_25_in_a_month_is_it_too_late_for_me/hgspccc/"}