{"id": "t5_2tand_t3_q8ucx4_t1_hgsrwj9", "creation": 1634339765, "origin": "t5_2tand_t3_q8ucx4", "height": 1, "replied_to": "t5_2tand_t3_q8ucx4", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "blondeanonnurse", "text": "Hi. I’m 25. I have a degree in history, 3/4 of a nursing degree, both of which I’ll never use and two children, a modeling career that is already well behind me. I desperately wanted to go to art school my whole life. My life went so fast in a few years and I’m having a serious crisis, the same one you’re having, I was having a few weeks ago. You and I have actually achieved a lot more than most people our age. But we still feel worried, because I guess we are beginning to face the expectation of adulthood in its genuine sense. I also suffer from the same confidence issues which makes me more anxious about all of this, I’m working on it though.\n\nMy husband is nearly 50. He is a very successful professor and author. When I had this “breakdown” over the course of those weeks, he kept reminding me that at 25, he had the Scandinavian variant of an associates degree in a completely unrelated field, and was basically sitting at his moms house and smoking cigarettes and reading books all day, partying all night. Then he went and decided to study his actual passion, English. Then he kept going, got his doctorate. He did it all pretty quickly once the ball was rolling, but he probably wouldn’t have done a very good job if he started at 19 like other people around him. He wouldn’t be where he is today. His point is that, 25 is not fucking old, it’s when life is just starting, and there is NOTHING wrong with inventing or finding yourself at any age, but 25 really is not old, but old enough to begin to have a more focused vision. In his perspective, this is a huge advantage. When he told me this I cried with joy realizing this is the reality! I still get anxious or nervous about finally living my passion, if I’m too old, if I’m doing the right thing etc. but then I remember this advice! \n\nI’m going to go to art school now :) \n\nIt’s just NEVER too late and my friend, we are SO YOUNG. We will look back on this and be so happy we made the decision to live authentically so early!", "permalink": "/r/DecidingToBeBetter/comments/q8ucx4/ill_be_25_in_a_month_is_it_too_late_for_me/hgsrwj9/"}