{"id": "t5_2tand_t3_q8ucx4_t1_hgu6snm", "creation": 1634371309, "origin": "t5_2tand_t3_q8ucx4", "height": 1, "replied_to": "t5_2tand_t3_q8ucx4", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "badumdumdumpstt1", "text": "I had always wanted to get a PhD and go into academia ever since I was a kid. I thought my day would start with me drinking lots of coffee, going into the office, doing research, and then coming home late, exhausted but satisfied. I was really confident during my Bachelors but when I started my masters in another institute that was a whole league above the one I had studied at, I felt like I was the worst/ the stupidest. I always felt like I had only a surface level understanding of anything I was studying. I applied for PhDs and didn't end up getting any, so with my back against the wall I decided to find a job in industry for a year while I waited for the next PhD cycle. I knew enough about myself to know I wanted to work in a company where I was passionate about the work, and even though at that point I was ready to accept whatever I did apply to one company I shared the same values with. I spent my first year really enjoying my work but also being wracked with panic of not starting a PhD and being \"too late\". Right before my third cycle of applying, I was terrified I'd be 28 by the time I finished. Everyone would have zoomed past me. At the same time I battled with myself of where I wanted to be and how that agreed/disagreed with the idea of a future I had built for myself. If I had clung on to that idea, if I didn't have a job those endless rejections would have crushed me and my confidence. Research in a lab doesn't happen over night, but also research doesn't only happen in a lab. If you take the gamble of choosing to pursue something that maybe you think isn't where you want to be, it'll help you build your confidence to get you there. And once you start moving, you'll learn a lot about yourself. It really isn't too late ever to do anything, and if anyone tells you that they're just trying to gatekeep whatever it is. If you want someone to help you make an actionable plan to get to wherever you want, I'd love to help :)", "permalink": "/r/DecidingToBeBetter/comments/q8ucx4/ill_be_25_in_a_month_is_it_too_late_for_me/hgu6snm/"}