{"id": "t5_2tand_t3_j34tn6_t1_g7aq0ba", "creation": 1601567681, "origin": "t5_2tand_t3_j34tn6", "height": 1, "replied_to": "t5_2tand_t3_j34tn6", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "imatito", "text": "That’s great man !!\nDon’t focus on any big goals right now\nJust start a timer and some music and I use the timer to help measure out the small workouts I do like pushups, stretches, a quick break, etc.... \nIt definitely helps making the small goals easier to hit starting with one minute exercises \n\nTell yourself your not supposed to see any results, it’s supposed to help you feel better, not look better. It’s a more positive way to build the consistency since your doing it for a result that isn’t based off a look or others opinions and progress is consistent rather than having a goal and not staying consistent because you haven’t hit a physical goal etc... \n\nSuper proud of you and anyone that decides to just start, all you have to do it try because that alone most people don’t do, believe it or not. \n\nI’ve started this journey of Eating an overall healthy diet cutting fast food till just weekends and it’s so much easier to see and feel the progress because your not forcing it ya know, stay lax on some boundaries at first Is my suggestion. \nAnd doing small workout and stretches at home, just to feel better and after 3 weeks I felt my back not hurting as much and I was more flexible reaching for the ground, very slow but progressive progress \n\nIf your ever unmotivated, what I do is I roll onto the floor from my bed and start doing a plank, it especially helps if your angry or sad and lost in your head. And do the plank until you can’t, if helps breaking your first sweat, and then working out after is that much more motivating \n\nJust some tips from experience, I do at home stuff, coronavirus has the gym all weird and all so I started building a mini home gym", "permalink": "/r/DecidingToBeBetter/comments/j34tn6/today_i_joined_a_gym_and_stopped_pretending_like/g7aq0ba/"}