{"id": "t5_2qh5i_t3_8fidhw_t1_dy6153d", "creation": 1525018538, "origin": "t5_2qh5i_t3_8fidhw", "height": 1, "replied_to": "t5_2qh5i_t3_8fidhw", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Jake-Bullet", "text": "Let me clarify. \n\nA lot of people think there are medical doctors, or aligning your chakra and avoiding vaccinations with nothing in between. \n\nNaturopaths go to med school. They get medical degrees, they are doctors.\n\nI went to countless regular doctors for this. \nI’ve been prescribed so many pills it was ridiculous. \nWhen my malnutrition was so bad I couldn’t focus, they said “must be ADHD”. here’s Concerta, Effexor, Ritalin, not working, maybe the antidepressants will help, welbutrin, Paxil, Celexa. \nWhen they ran out of pills then came the excuses. \n\n“You’ve got IBS, it’s in curable” It also has every symptom between heartburn and stomach cancer, so ANYTHING can be called IBS.  \n\n“Crones disease, incurable, stop eating what makes you feel sick.”\n(There’s a test for crones, they didn’t bother to check)\n\nTime to give up and “manage the symptoms” with anti-nausea pills, or heartburn pills, or when it hurts at night, here are sleeping pills. \n\nI accepted the vague terms of my fate for over a decade. Stopped going to doctors, because they all said it was hopeless. I dealt with pain you can’t imagine from my intestines literally being dissolved by my body, then the stomach acid leaking out. \n\nThen I went to one single naturopathic doctor (with a masters degree just like every doctor) and she said\n”sounds like you’ve been allergic to a lot of things, for a long time. Let’s get some blood tests for food allergies. First time in my life a doctor tried that. seriously, first time.  \nHey, what do ya know!!?!\nYou’re allergic to EVERYTHING!!!\nYour stomach is a mess!!\nLet’s FIX it. \n\nHere’s a diet plan that cuts out the bad foods, and still gets you some nutrition. \n\nHere are the probiotics that you aren’t producing anymore. \n\nHere’s stomach acid in a pill because you don’t have your own anymore. \n\nEventually everything healed, the blood tests improved, I gained weight, got some strength, people stopped trying to talk to me about my “anorexia” \nDoctors stopped checking for heroin tracks. \n\nAll so some insufferable ass-hat online could reduce my life’s experiences down to the assumption that I’m such a hippie I don’t believe in medicine. \n\nThanks for your input. ", "permalink": "/r/happy/comments/8fidhw/spent_my_life_surviving_on_protein_shakes_and/dy6153d/"}