{"id": "t5_2tand_t3_j9gdmg_t1_g8jpwcy", "creation": 1602464332, "origin": "t5_2tand_t3_j9gdmg", "height": 1, "replied_to": "t5_2tand_t3_j9gdmg", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "It isn’t about what you do or don’t deserve, and you have nothing to be ashamed of for having been fortunate in life. If you haven’t already, I would definitely bring these feelings up with your therapist next time you see them.\n\nAre you at a place in your life where you would want to/be able to care for a pet? It’s a little harder to feel miserable and detached when you‘re hanging out with a dog who is excited about life every single day and needs you to walk them, play with them, etc. Not that a pet should ever be treated as a quick fix to all problems, but your therapist might have thoughts on whether something like an emotional support animal would be helpful to you.\n\nBeyond that, is there a cause you feel passionate about? And, if not, would you be interested in doing some research to find one that matters to you? I’m in a different situation than you, but I know that for me personally, volunteering is one of the few things that makes me genuinely feel happy and connected to others. There is a lot going wrong in the world right now, and while I disagree with you when you say that you don’t deserve what you have, it’s true that there are many people who don’t have the resources or opportunities to achieve their own goals. Without knowing what your hobbies/interests are, there is undoubtedly a problem out there that could benefit from your time, expertise, or just financial support if you can give it. If there is something out there in the world that makes you angry or sad, it sounds like you might be in a position to do something to improve it, and that’s a big deal. I would look into volunteer opportunities near you to see if there’s anything you think would be worth getting involved in — there is likely a ton of variety when it comes to opportunities. I used to help out at a therapeutic horseback riding center pre-COVID, I now deliver groceries from the local food bank every other week, and I do a bit of tutoring sometimes. When I had more time, I used to help out at a community kitchen serving breakfast a couple times a week  — the people there were wonderful, and I miss that experience a lot. You could also look into animal shelters, local museums/libraries, and then there are remote opportunities too, like doing graphic design work for a nonprofit, or just making friendly phone calls to seniors who are isolated right now. It’s just little things here and there, but being able to do something that makes a small difference to someone always makes me feel better, and maybe you’ll feel the same.\n\nThis will sound dumb, but when I helped out at the community kitchen, we were serving breakfast to people for whom that might be their only meal of the day. A lot of the food was leftover pastries donated by local grocery stores, and weird off-brand sugary juice with names like ‘salted caramel juice drink with apple flavoring.’ Everyone used to make fun of the inevitable creepy juice flavor of the day, and it was funny, but I always wished I had the disposable income to just donate a bunch of orange juice or something, so that at least a few people could have a slightly healthier, less-gross start to their day. I wasn’t in a position to do something like that, but maybe you are. It doesn’t need to be anything huge or earth-shattering. There might be one small thing like that where you could make a difference in some way, and maybe you’d eventually find something fulfilling.", "permalink": "/r/DecidingToBeBetter/comments/j9gdmg/my_lifes_too_easy_its_ruining_me_how_do_i_get/g8jpwcy/"}