{"id": "t5_2tand_t3_nhn34u_t1_gyxpqmv", "creation": 1621600244, "origin": "t5_2tand_t3_nhn34u", "height": 1, "replied_to": "t5_2tand_t3_nhn34u", "down_vote": 0, "up_vote": 42, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mcwopper", "text": "Not trying to be rude, but I am going to be direct: your mom is a drain on your life. Don't be \"in the process of cutting her off\", just cut her off. Right now. \n\nYour dad is not going to help you. I don't know his circumstance, but if he is leaving unpaid bills, I would assume it is in fact about money, or he's just a little crazy. Either way, leave aside any hope that he will help you. Waiting on him to have a change of heart means you will just continue to be disappointed.\n\nBecause you are in a country with no student loans, you are now going to have to finance your own education. This sucks, but there's nothing to do but get to it. Get a job. Literally any job. Go dig ditches if it's the first place that will hire you. Start making money. At the end of the day, having your own money will be the key to your independence from an unsupportive family. Keep applying to better jobs, but don't wait for one to magically appear when you could be out there doing things now. Then once you save up enough you can go to school. Or maybe you will find a career that does not require school. Who knows. But nothing will happen as long as you stay in your dads house wondering what to do.\n\nYou are very young, and this is a good thing. You are literally decades away from when you have to legitimately worry about \"is it too late, have I wasted my time?\" Anything you do now to improve your circumstance is a positive, even if it's just getting a low wage job. \n\nHell, a low wage job might actually be the best place to start. Low expectations. I was terrified of going out into the world when I got out of high school. Because I had no other choices, I got a labor job. I was wracked with anxiety about it until I got there and realized all that is expected is to show up, be sober, and work a full day every day. Once I realized I could do this, everything else seemed way less scary\n\nI'm not at all saying this will be easy. I'm not trying to make it sound like this will all just happen and everything will be dandy. What I'm saying is you're going to have to go through it one way or the other, and my advice would be to take control of as much as you can. Good luck, I know you can do it.", "permalink": "/r/DecidingToBeBetter/comments/nhn34u/i_feel_sad_confused_and_lost_i_feel_like_the_odds/gyxpqmv/"}