{"id": "t5_2tand_t3_nhn34u_t1_gyz6r0x", "creation": 1621624993, "origin": "t5_2tand_t3_nhn34u", "height": 1, "replied_to": "t5_2tand_t3_nhn34u", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "intensely_human", "text": "The last time I did a job search was in 2019. I was starting to confused as to my lack of success, and a friend of mine who does a lot of hiring told me “You’re going to need to apply to about a hundred jobs in order to get your job. Roughly. It’s up to you how long it takes you to send your 100 resumes”  \n\nI ended up sending about 50 before I got a job. I had about ten interview processes, and all but one failed.  \n\nAnd I’m advanced in my career.  \n\nAll I can say is that you should keep trying. The reason to stand up and fight isn’t because you’re guaranteed to win. It’s because going down fighting hurts less than going down cowering in fear.  \n\nThe reason to stand up is not to succeed, but to gain the immediate psychological benefits of standing up.  \n\nI was your age half my life ago. I remember it. I remember trying to do the math to find out whether the effort was worth it. People told me it was, but I was skeptical.  \n\nWell, I’m just now learning this at the age of 40: you stand up because it feels better. Don’t chase external circumstances; chase psychological states of mind. You get more serotonin when you try. Even if you try and fail, as long as you keep standing up the serotonin and the dopamine will keep coming.  \n\nBut when you give up, the serotonin stops coming. Giving up makes defeat hurt worse. It guarantees defeat *and* it makes defeat hurt worse.  \n\nQuite frankly, it’s not worth it to try, based on the probability of success. The odds are stacked against you and no matter what you do in life the universe *will* eventually crush you into oblivion, and everything you create and achieve will be destroyed and forgotten.  \n\nWhat matters is how you feel moment to moment. And believe me, trying and failing feels better than not trying. It’s hard to compare them because failure is an acute pain and giving up feeds a chronic pain. Giving up amplifies all the discomfort in your life, by removing dopamine from circulation.  \n\nIf you set the goal of optimizing your state of mind, your moment to moment experience, then the locus of control is inside you. Nobody and nothing can stop you from succeeding. The moment you decide to try, you start getting the benefits. Your conscience rewards you with dopamine and the dopamine makes life hurt less. The moment you decide to give up, your conscience stops rewarding you and you are left with the blank and empty horror of being conscious but having no purpose. Nothing is worse than having nothing to do. Not even failure.  \n\nTo repeat, once again: do not seek the external reward; seek the internal one. It is real, it is scientifically validated, and it is in your control. The external rewards of success, survival, etc are side effects of the development of your brain that happens when you try.", "permalink": "/r/DecidingToBeBetter/comments/nhn34u/i_feel_sad_confused_and_lost_i_feel_like_the_odds/gyz6r0x/"}