{"id": "t5_2tand_t3_38lztx_t1_crx2jok", "creation": 1433550236, "origin": "t5_2tand_t3_38lztx", "height": 1, "replied_to": "t5_2tand_t3_38lztx", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "psubold", "text": "You're welcome, friend. I wish you the best of luck. Be careful how much faith you put in society's answers to your questions. Watch how many people in society live their lives and see if it really makes sense. Are they acting out of love or fear? Are you acting out of love or fear?\n\nAs long as you're acting out of fear (fear of not being good enough, or not being respected, or not surviving, or what others think), you are vulnerable to the outcome of your actions and your satisfaction is dependent on a multitude of external influences that you don't control. But if you do what you do because of an inherent love (either the love of the act itself or love of the benefactors), the outcome no longer effects you and your satisfaction. The satisfaction is inherent in you and what you do.\n\nDon't get me wrong: I'm not telling you to go find what you love to do or find your one unique passion in life. There probably isn't one amazing thing in the universe, that once you find it, life will be bliss. That's another external pursuit that will just leave you feeling incomplete. When it comes to 'what' you are doing, you do have to believe in it and know that it has value, but the biggest part of happiness/satisfaction/fulfillment is how you live your life every day regardless of what it is you are doing.\n\nIt's easy get caught up doing the things that society rewards and sacrificing peace and happiness in the process. I am a recovering over-achiever who did this for a long time. But, to a certain extent, the things people subject themselves to in our society are all part of a game that you can choose not to participate in. (And to the extent you have to participate in it, you can do so knowing it's all a game, which helps.)\n\nI hope this message finds you well. I don't know where you are at in life, but maybe you're ready to start questioning these things. If not, and you think I'm crazy, that's fine too. Either way, best of luck with your path forward. If you ever want to talk, I'm here. Be happy :)", "permalink": "/r/DecidingToBeBetter/comments/38lztx/how_do_you_stop_comparing_your_current_depressed/crx2jok/"}