{"id": "t5_2tand_t3_jz1q69_t1_gd9d26q", "creation": 1606078068, "origin": "t5_2tand_t3_jz1q69", "height": 1, "replied_to": "t5_2tand_t3_jz1q69", "down_vote": 0, "up_vote": 216, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "chemslutt", "text": "When I was 19, I shaved my head. Like shave-shaved, nearly bald. I had long, black hair that got me a lot of attention and compliments, and I cut it all off. It was a big change, especially at first. I live in a larger city in a rather traditional, rural state, and I definitely experienced what you’re experiencing now. People stared at me wherever I went, which was difficult because I’m a low-key gal that doesn’t love attention. Occasionally I was mistaken for a man. I didn’t have a boyfriend, and the amount of men that showed an interest in me dropped drastically. I didn’t mind this too much because it also meant I never got catcalled either. I did it for reasons similar to you, I was tired of looking a certain way out of obligation. The anxiety of being in public was tough at first. A LOT of people judged me harshly. My own family was embarrassed. But you know what? I looked fucking great. And I bet you do too. And so many girls told me (and still tell me) that they wished they could do what I did. So my advice to you is this:\n\n1.) Don’t hide. If you appear anxious and insecure, people will notice. Shoulders back, head up. You’re just a girl with a buzz cut doing her thing.\n\n2.) Experiment with clothes and makeup. I never realized how much my femininity was tied to my hair until I cut it off. My style was very punk/grunge, but when I cut my hair I found that wearing baggy clothes all the time weighed me down. So I started dressing more feminine, taught myself some makeup and contouring, etc. It really helps!\n\n3.) There will be haters. It’s a radical hairstyle, and there will be people who will say you were prettier before and whatnot. They’re irrelevant. Get a team of supportive people around you. Sounds like your man is chill with it, and that’s a great start. \n\nThough I decided to grow my hair back out, I have zero regrets about shaving it. It was the first time in my life that I did something for myself and no one else. You should be proud of yourself. It’s hard to make choices that go against the grain. The anxiety will get better with time, don’t worry. And if you decide to grow it back out, that’s cool too. It’s your hair, you can do what you like. PM me if you have more questions/concerns about being a buzzed lady.", "permalink": "/r/DecidingToBeBetter/comments/jz1q69/i_shaved_my_head_and_now_im_struggling_with_my/gd9d26q/"}