{"id": "t5_2tand_t3_jz1q69_t1_gdbeabe", "creation": 1606122324, "origin": "t5_2tand_t3_jz1q69", "height": 1, "replied_to": "t5_2tand_t3_jz1q69", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "j0sefine", "text": "Wow, being so young and deciding to challenge yourself so hard already! :o\n\nI think I feel quite similarly to you, but about my leg and armpit hair. I started shaving because everybody else did and it hurt (sensitive skin), I had to do it very often or it would itch and that would hurt my skin even more. I hated it. First I started shaving only once per week, before gym class at school. And then I learned that I could get away with only doing it before swim class at school.\n\nTo get rid of the “ugh *again*” feeling I tried waxing. That hurt. I tried an epilator once and wanted to fucking die. I did my bikini line too and it hurt so badly and itched already the next day. \n\nAnd then suddenly I thought to myself: *why?*\n\nAnd I stopped.\n\nOne of the best feelings of summer is biking, with shorts on, and feeling the wind in my leg hairs. When I’m watching TV or doing something mindless I twirl my fingers in my leg hair. My skin is much better and I like the look of pubic hair. It’s a nice little fluff. \n\nI’m still not comfortable around other people tho. It’s been TEN YEARS and still, it’s so very ingrained in my mind that women are *supposed* to be hairless. It’s rough for me at beaches, I had to slow breathe for minutes before joining the rest of my squad when the exercise uniform included shorts, I was so so so scared of intimacy because then I’d either have to shave or have to show my hairy legs to another person. It severely impacted how much I got laid lol\n\nI love it and feel comfortable by myself but I’m so scared of other people’s perception. It’s a weird thing.\n\nI do like to think this: I might inspire someone else to be slightly norm-breaking if they want to. And I hope I do that, that it becomes more acceptable and more common.", "permalink": "/r/DecidingToBeBetter/comments/jz1q69/i_shaved_my_head_and_now_im_struggling_with_my/gdbeabe/"}