{"id": "t5_2tand_t3_jz1q69_t1_gd9fst9", "creation": 1606079346, "origin": "t5_2tand_t3_jz1q69", "height": 1, "replied_to": "t5_2tand_t3_jz1q69", "down_vote": 0, "up_vote": 15, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "silverbellsandcock", "text": "I also shaved my head during this pandemic. I'm in my twenties, and I'm having similar mood swings about it. As a teenager I was also very meticulous about my image and my hair/clothes. It wasn't that I wanted to be hotter or something, but it was that I wanted to be right, to just look completely acceptable from all angles according to anyone. Now I get a real kick out of bucking social expectations for women, and I enjoy testing my self esteem in not being ashamed for these \"flaws\". I like seeing how far I can go, and still make it a non-issue through charisma/confidence/competence. Example, I don't shave my legs and my armpits only occasionally, I don't dress is a way that makes me look attractive, I only ever wear lipstick, not concealer, mascara, brows, etc. There are other things, but these are what people comment on. \n\n\nIt is so freeing to just not care, and I loved it with the hair too, loved the buzz cut, but lately I've been feeling down about it all. I feel like I've done too much, become too ugly, and I am not as young and skinny anymore, so it doesn't come off as cute or radical as much. \n\n\nI come to terms with this connection between my appearance and my experiences by reminding myself that beauty is a skill. Yeah, my choices may have decreased my baseline beauty. But it's that same as my decision to not practice the flute. It's not something I'm prioritizing right now. It doesn't mean I can't. When I need to be beautiful, I put in the work and make myself beautiful. It's a hat you put on when it serves you. Looking good, looking conventionally attractive can have it's uses (as you are finding out, people do treat you differently based on how you look), but at the end of the day it's just another tool in the tool box. Society likes to paint it as more than that, as something that needs to be constantly maintained by every woman at all points in her life, but that is nonsense. Serious athletes work out every day, and famous actors look beat 24/7. I'm more of a jack of all trades, and right now I don't want to work on my appearance.", "permalink": "/r/DecidingToBeBetter/comments/jz1q69/i_shaved_my_head_and_now_im_struggling_with_my/gd9fst9/"}