{"id": "t5_2tand_t3_jz1q69_t1_gd9w3oi", "creation": 1606087292, "origin": "t5_2tand_t3_jz1q69", "height": 1, "replied_to": "t5_2tand_t3_jz1q69", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "xeromace", "text": "I did this last year! I'm 18F now, but was 17 at the time and I now have (approx a year and a month later) a floppy mullet of healthy hair. I cannot recommend cheap Amazon wigs and beanies enough, especially if you're really struggling with self image and confidence in person right now.\n\nAt the time, I shaved my head because I came out of a rough toxic friendship, and because I'd dyed and bleached my hair so many times to try and fit in with my friend group. It got to the point where I couldn't brush my hair without it snapping or flaking off, and looking back, I do genuinely think it was also a lot because of male attention. I shaved my head and my boyfriend was nothing but supportive, but my friends abandoned me. Hair is hair, and if people have negative reactions because you got a haircut that's on them. I felt so confident when I was alone too, and so scared and self conscious around other people, but believe me when I tell you now that you are a fucking badass. For real.\n\nShaving your head is no small deal, and it's one of those things that people think that they're allowed to comment on, or touch. It was one of the hardest things for me to deal with, but it was also incredibly helpful. Shaving my head reminded me that I am allowed to take up space, allowed to just exist. I hope you can feel like this too. I do remember finding it hard to adjust to random people touching my head or saying, 'haircut?' as an intro question, but I definitely see it as a sign that people are impressed with how ballsey and strong you are. \n\nShaving my head made me who I am, and although most of it was forged through many hours of crying in my room and thinking I made myself ugly and undesirable, I've come to the understanding that at the end of the day, hair is an accessory, and doesn't have any affect on who you are, or can become. Having no hair is freeing, and so easy to care for, the average shower becomes a head massage. If people have negative reactions, they weren't good for you anyway.\n\nBasically, even if you hate it now, it will grow out and you'll be able to say in the future, as a teen, I shaved my head. That's hardcore!  You trusted yourself then, so trust yourself now. This is a new beginning, and it can be the start of a better, more healthy and positive era. It was for me! I'm sending good vibes, and I hope your confidence returns. (Extra confidence boosting things for me were statement earrings, like big hoops, bold lipstick and also scarfs, either tied around your head or neck make it a ✨fashion moment✨)", "permalink": "/r/DecidingToBeBetter/comments/jz1q69/i_shaved_my_head_and_now_im_struggling_with_my/gd9w3oi/"}