{"id": "t5_2tand_t3_jz1q69_t1_gd9li44", "creation": 1606082138, "origin": "t5_2tand_t3_jz1q69", "height": 1, "replied_to": "t5_2tand_t3_jz1q69", "down_vote": 0, "up_vote": 16, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Partigirl", "text": "For forty years I've had my hair every color imaginable, every cut possible, just about anything I could do to it, I did. (in high school I even dipped it in regular bleach! I also painted it with watercolors, ha) I shaved my head in 1980. Back then, doing anything unusual to your hair meant LOTS of hassles and harassment.  But I too was testing what it meant to be me vs society's concepts.  Odd thing is I had beautiful hair, so people would often compliment me on it to the point I felt like  it was too much of a defining feature, so I really swapped it up. Chop chop, color, shave...I even wore wigs of all types too. I just really played with it.\n\nWhen I was young I'd have young girls come up and confide in me that they wished they could do that to their hair... they were never \"brave\"  enough or their  \"boyfriend wouldn't approve\" according to them.  When I colored my hair pink an purple a year or so ago, I had older women telling me almost the same thing. So forty years apart, some women are still afraid of stepping out of bounds. Others step out of mainstream just to find themselves in an outsider culture that's become mainstream, honestly it'stoo much bother for me to think about these days.\n\nIt's all so confusing, isn't it? My only piece of advice is to not worry about these things too much. \n\n1) it's only hair. It grows back usually, it's most forgiving and nothing is very permanent.\n\n2) Confidence is born in comfort. Comfortable with yourself and your choices. Comfortable enough to know you are there for you to live your life and not worry about what others think too much. As long as you aren't harming yourself or others than you can do as you like. If they don't like it they can turn their head. \n\n3) People will always mock those who stand out. It is an affront to their own self concepts and you can't spend your life trying to help them maintain comfort status. That's their job. Exceptions: Grandparents. It's perfectly okay to calm it down a bit for the old people for special occassions, if you love them. Otherwise be yourself.\n\n4) Which leads me to Be Yourself. If you like what you are doing and aren't using it as a therapy crutch, then by all means enjoy.  \n\n5) Just love yourself. I learned to love my natural hair, I enjoy watching the gray come in. I recently cut my hair very short too an am enjoying it and will enjoy it being long again next year. Your hair is just your hair. Work with what you've got and love what you have (or don't have). Drop the worry. Hair is forgiving, you should be too.", "permalink": "/r/DecidingToBeBetter/comments/jz1q69/i_shaved_my_head_and_now_im_struggling_with_my/gd9li44/"}