{"id": "t5_2tand_t3_nj0c8s_t1_gz5lnbz", "creation": 1621773565, "origin": "t5_2tand_t3_nj0c8s", "height": 1, "replied_to": "t5_2tand_t3_nj0c8s", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "iboojenny", "text": "Hello fellow redditor  \nI’m a fellow coconut 🥥. \n\nBrown on the outside, white on the inside, and my mother intended it that way. Literally. I’m multiracial. My 23andMe ancestry composition is quite literally “all over the map”.  \n\nAll throughout my childhood, my mom often told my sister and I that one of the reasons why she had children with my father (they inevitably divorced) was because he was part “white” and she wanted babies whose *”noses would be more white-looking and would have high cheekbones.”* My mother’s side of the family is largely Chinese and Southeast Asian. My mom’s side of the family is largely Filipino and she hated this. She often made backhanded comments about how Filipinos had “flat noses”, “dark skin”, “dark lips” etc., we were also raised to eat more traditionally westernized food than culturally Filipino food. And my grandma was the last of her generation that came from the Philippines to Hawaii to be bilingual. She never taught the language to her daughters.  \nI never knew what this was in my adolescence, and I was never equipped to understand the concept of internalized racism. (It’s heartbreaking because I know there was this pressure on people like my grandma to conform to English-speaking as the norm, especially in public VS at home..thank goodness I grew up in Hawaii where this expectation wasn’t as severe as it may have been in the mainland since most of the demographic in Hawaii is Asian..)\n\nI wanted to share my story, because I wanted to let you know that you’re not alone, and that you don’t have to feel this deep shame. You’re human and you’re learning-just like the rest of us. You have the capacity to change and gauging from this post, you seem to want to. I think it’s great that you’re taking a look at all of this. It’s the first step into true self-acceptance. In today’s day and age, we’re not where we want to be with diversity and cultural acceptance, BUT we’re getting better. And realizations like this help. I used to denounce the Filipino side of me SO hard. It was so...misguided. But today, I am so proud. Of EVERY single ethnicity.  \n\nI can’t say this will work for you, but aside from taking the 23andMe test (I wanted to educate myself and get a full “map” of what I really was, since my family only kind of had an idea) I will move forward in educating myself on each of these ethnicities. Kind of like “reversing” that trained behavior my mom instilled in me to believe *this* or *that* about Filipino culture..well, now I’m taking education about this culture into my OWN hands. The result will be pride, fascination, and adoration. And I also plan on traveling to these countries soon (Philippines and others)\n\nBasically, flip it on its head and turn it into a *positive experience* because YOU have the power to do that.  \nI hope my message finds you! Have a good day! ✨", "permalink": "/r/DecidingToBeBetter/comments/nj0c8s/finally_admitted_to_myself_that_i_have/gz5lnbz/"}