{"id": "t5_2tand_t3_nj0c8s_t1_gz5il21", "creation": 1621771306, "origin": "t5_2tand_t3_nj0c8s", "height": 1, "replied_to": "t5_2tand_t3_nj0c8s", "down_vote": 0, "up_vote": -1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Yelyn", "text": "All great and supportive advice!\n\nMostly, I believe you are trying to assimilate to your country. This creates more opportunities for you to feel like you have a role and are part of the social fabric. However, the things you described are quite superficial. I would look towards volunteer opportunities to give yourself a true importance and role in your community. It might help to ease the stress of trying to fit in - doing good things for others will help to fill a hole in your heart, and help others to recognize who you are as a person. You’re also feeling like the representative of your race when you surround yourself with white people; but relax, people want to be around you for who you are, not what you look like. You don’t need to feel embarrassed by the actions of others from your first culture.\n\nI am from U.S. I have lived in the UK and Japan, and each time I have done my best to assimilate and made friends with locals. I shared positive aspects of my culture, like food, music, and art. I helped clean beaches and raise money for local charities. Both places, I felt annoyed at my fellow expat’s behaviors - guys wearing shorts in UK, people talking loudly or coming off as rude, people blowing their nose in public in Japan - the list of transgressions is endless. They made themselves painfully obvious, and I am more the type of person to follow “when in Rome, do as the Romans.” Fact I learned is, you’re not responsible for anyone else’s behavior but your own.\n\nI would try to focus less on your perceived differences (between you and other South Asians, or you and white people) and shift your mindset to appreciating the positive aspects of both cultures that you get to claim as your own. Also, speak whatever language the person you’re talking to understands; it’s about communication, nothing more. It’s about being yourself; showing up as YOU, not denying your heritage or trying to force yourself into a box. Embody your whole self.\n\nAnd rather than thinking you only want to date white guys, think about specific traits you like in a man; you’ll find most positive traits are universal among humans. If you happen to be immersing yourself amongst white Canadians, you will probably find these traits in a white Canadian guy. But if you’re literally anywhere else in the world, you would find someone else with those traits that draw you in. Cultural differences can be bridged, easily in this modern era. But for your sanity, don’t be superficial. A pasty white glow won’t warm your heart.", "permalink": "/r/DecidingToBeBetter/comments/nj0c8s/finally_admitted_to_myself_that_i_have/gz5il21/"}