{"id": "t5_2tand_t3_nj0c8s_t1_gz5fk9d", "creation": 1621768821, "origin": "t5_2tand_t3_nj0c8s", "height": 1, "replied_to": "t5_2tand_t3_nj0c8s", "down_vote": 0, "up_vote": -4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "throwMeAwayTa", "text": "* White people often compare skin colour and fight over who's darker.  They move to hotter climates and are pleased they have darker skin.  They don't feel sick that they are happy about it.  They also risk skin cancer to get darker skin in tanning beds, spray paint themselves darker and plenty more.\n* When talking to CEOs at a business presentation, I adopt a different persona to when talking to party-animals at a music festival.  This is fine.\n* Most people have preferences - tall, long hair, short, toned, big muscles, skinny etc.  I grew up in a different country and have often found myself a bit more drawn to people similar to the ones I grew up with (same skin colour as me generally).\n* It's natural to feel shame when someone associated with us behaves badly.  Similarly if someone in a group of friends is behaving badly, regardless of race, others will often feel shame.\n* As a British person, I dislike the British people that move to a foreign a foreign country and don't speak the native language, just speaking English in European countries, creating a British enclave.  It seems rude to me and one of the reasons I haven't tried it myself, as I'm not great with languages.  And yes from the above point, I would also feel shame when I see British tourists acting badly abroad.\n* The word 'coconut' and the expectation you should act in certain way because of your skin colour **does** sound like a racist concept to me.  You should be able to act how you want (within the law and being a decent human being) even if that doesn't match a socital stereotype.  I know plenty of British people that like Japanese Songs, Korean music etc.  That is fine too.", "permalink": "/r/DecidingToBeBetter/comments/nj0c8s/finally_admitted_to_myself_that_i_have/gz5fk9d/"}