{"id": "t5_2tand_t3_nj0c8s_t1_gz5drc2", "creation": 1621767161, "origin": "t5_2tand_t3_nj0c8s", "height": 1, "replied_to": "t5_2tand_t3_nj0c8s", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "GlassExplanation", "text": "This is not at all uncommon. You are better than many others for recognizing it, which is the first step. As others have said, exploring the origins of these biases and producing an objective factual counter that you can easily recall when you catch yourself will help you break the cycle.\n\nFor example, we know that white skin was idolized during the colonial era for obvious reasons and it's a cultural norm that continues to be perpetuated to this day. Hindu deities depicted as blue in religious artwork were actually black, so clearly this preference for fairer complexions hasn't always been around. Now you can be part of the movement towards undoing that cultural damage, starting with yourself.\n\nWith second-hand embarrassment, again ask yourself: is it embarrassing because they are doing something common in my culture, or simply because they are the same colour as me? If it's the latter obviously it's silly to be ashamed on their behalf; if it's the former then explore that behaviour, understand where it comes from, and form a defensible opinion on it. Come at it not from fear or shame but from empathy and a desire to understand. They are a human being like you with hopes and dreams and experiences; they have reasons, confusing as they may be, for doing what they do. Regardless of whether you conclude their behaviour is appropriate or not, understanding kills racism. You can only be racist if you do everything you can to avoid trying to understand people.\n\nA general post-colonial shame affects many indigenous communities, Indians are no exception. There is a Facebook group called Subtle Curry Traits where people discuss these topics (and meme about them) in a positive, encouraging way, that may be helpful for connecting with your heritage and appreciating it for what it is. Because you'll always be different from white people despite your efforts.\n\nAlso read The Namesake by Jhumpa Lahiri (DON'T WATCH THE MOVIE). Required reading for all coconuts imo. Being Different by Rajiv Malhotra is the next 'woke' level but start simple for now.\n\nYes, I was in your position not too long ago. Feel free to message if you want to talk more about it. You're not alone :)", "permalink": "/r/DecidingToBeBetter/comments/nj0c8s/finally_admitted_to_myself_that_i_have/gz5drc2/"}