{"id": "t5_2tand_t3_e43woq_t1_f9f1hqd", "creation": 1575257108, "origin": "t5_2tand_t3_e43woq", "height": 1, "replied_to": "t5_2tand_t3_e43woq", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "just_sneetches", "text": "I appreciate your struggle over the existence of God. I came to the point of saying, the God they talk about in church. He doesn't' exist. I believe we have enough evidence to conclude that someone made this planet and put life on it. I was vague because I don't want to be pigeon hold as  \"one of them.\" Most of us carry some baggage, and I haven't found my Christian theology to be particularly helpful with my mental health problems. I was once an elder in an evangelical fundamentalist church.  We had some issues. Long story short, one of the guys became an Atheist. I came to a conclusion, God is, but He is very different from what I thought.\n\nWe have about 66 books written my about 33 different authors who testify about the Creator God, who gets involved in the lives of people. That's the God whose help I need. Someone who gives a shit and get involved. I think I found Him in the scriptures. I don't think most people in most churches have any idea of how He relates to us. Maybe it's just the \"us\" who have mental health problems. \n\nFrom my experience, God gets involved when I ask, but He does it His way, in His time, with goals in mind. I have to respect Him, just like anyone else, maybe a little more so. That leaves me with, what does He want from me? One of the things He wants is for me to be creative. That's why it is so rare for God to give direct instructions. He gave me the ability to think, He has given me a situation to work with, and He wants to see what kind of good I can make in this mess. When I see the results of my choices, I get to understand something about me. I have to take responsibility for my decisions. The day I decided I was going to accept responsibility for \"my choices,\" I recognized I had been taking responsibility for other people's choices. Me accepting blame for things others have done is taking a long time to unlearn. That's part of what I think of as the \"God thing\" part. When I get one bit straightened out, there is a flip side. \n\nI had to have it pointed out several times in different ways before I said, \"I will take responsibility for my choices, and only my choices.\" I can be stubborn and stupid. That several people took the time to point out this truth to me was not a coincidence. I can see that looking back. That is also part of the \"God Thing Part.\" He likes working with people. His timing is usually inconvenient, and it shows His creativity. He acts in character. \n\nHe hears us, and He usually responds with tenderness to expressions like WTF God.\n\n It's kind of like, I thought I was standing in a pile of shit, and it turns out, it's mostly clay. I figured that out after planting my face in it. (did I mention I can be a slow learner?). With some work, I can make something good out of the clay part. The potential for fine china is there. I don't know if I'll ever get that far. I do know that because I'm pursuing a good thing, God is interested. He will send help when I ask and when it's needed. My opinion and his on the second part differs significantly.\nHope this helps", "permalink": "/r/DecidingToBeBetter/comments/e43woq/should_i_seek_counselingtherapy_again_for/f9f1hqd/"}