{"id": "t5_2qh5i_t3_n3lhbf_t1_gwv9z9d", "creation": 1620100655, "origin": "t5_2qh5i_t3_n3lhbf", "height": 1, "replied_to": "t5_2qh5i_t3_n3lhbf", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SpiritOfAnAngie", "text": "Oh I was put on Xanax in 2010 because I was misdiagnosed as having panic attacks when actually it was an autoimmune disorder that took nearly 7 years and a trip to the Mayo Clinic to finally get a diagnosis. My family and friends didn’t even really believe I was sick until the seizure started. At first I just woke up one day and I just felt sore all over, flu like, dizzy, weak, my stomach was so messed up, the list goes on and on.. I have a type of Dysautonomia, my specific kind is called postural orthostatic tachycardia syndrome. Basically my heart rate and blood pressure along with my other things the body does automatically (via the autonomic nervous system) mine does not. So it basically effects all body systems. The odd thing is it often affects young healthy women the most. So if I’m laying down I feel fairly ok, sitting is worse, standing still is very difficult. Normally when a person stands the veins in their lower body constrict in a split second so it’s easier for the heart to pump enough oxygenated blood to the brain. My body fails me here so my heart rate sky rockets and if my blood pressure can’t keep up, I pass out or have a seizure. There is no current treatment so doctors just treat me sympathetically. Depressants mostly. Narcotics for the pain and benzos to help calm the heart and keep me from panicking because it’s scary as fuck sometimes.. I started to become afraid of everything and medication made me feel better so it was very easy for me to be caught in that cycle. Soon, because my medical history was so intense anytime I went to the doctors office with a symptom I’d leave with a new Rx. Then I started learning what to say to get what I wanted and it just escalated.. \n\nMy husband eventually hid all of my medications long enough for me to sober up enough to start the conversation that I had a legit problem and I needed to change. He was saying things like how he didn’t like “the other Angie” meaning the high one. That she was mean, dismissive, short, just the opposite of the woman he fell in love with. He said he’d leave for work terrified I’d be dead when he got home. My family also started to notice and I was so reclusive everything about hire I was living was very unhealthy. \n\nI relapsed several times before I actually started remembering and feeling things about myself that I had forgotten about. So the final time I stopped it wasn’t too bad but the first time I stopped everything, it was 8 days of pure hell.. I probably should have gone to a detox clinic but that’s neither here nor there at this point.", "permalink": "/r/happy/comments/n3lhbf/the_first_photo_is_me_off_benzos_and_opioids_for/gwv9z9d/"}