{"id": "t5_2tand_t3_fd3k4c_t1_fjgdjrg", "creation": 1583323075, "origin": "t5_2tand_t3_fd3k4c", "height": 1, "replied_to": "t5_2tand_t3_fd3k4c", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "gimme_dem_cats", "text": "Sounds like you might benefit from reading books or watching Youtube videos on social skills. \"How to Win Friends and Influence People\" -Dale Carnegie may be a good start. Perhaps videos regarding how to have a conversation with people or on the psychology of body language and people may help as well. Check out some Ted Talks and see where it takes you! \n\nPerhaps if you can shift your mindset from \"I know more than most people\" to \"I can learn something from everyone\", it may be helpful. For example,  although you may more academically  inclined than one individual, they may be well liked by others because they have a strong social and emotional intelligence. \n\nOne of the basics of conversations and people is to ask questions. Individuals want to feel important and cared for and you can do this by showing interest in them. Secondly,  acknowledging their opinion and offering further information based on your knowledge is much more palatable  then outright disputing what is said. People want to have pleasant conversations not debates (except those who do, then have at em). In addition, surrounding yourself with people that are more intelligent and knowledgeable than you  may help to humble you. Understanding that it is not possible for you to know everything and you can not be an expert at everything may help you understand we are all students in life and all lacking in some areas. The important thing is not what you know, but that you are self aware and willing to grow (kudos to you)! \n\nI am not sure if it is what you are looking for, but books on confidence may help as well. The difference between arrogance and confidence makes all the difference. It takes confidence and tact to know something and communicate it in a humble way. It takes confidence to sometimes let the moment go and say nothing at all because you are secure in yourself and your knowledge. Sometimes others may already have mastered this skill and you may take them as intellectually inferior. Others may not be able to communicate effectively verbally, but have a large amount of knowledge or a different understanding. You never know! \n\nIf you stop looking at others as your intellectual opponents and instead as friends and understand every individual has value (even if they are shitty and just act as a lesson), it may help in this realm.\n\nI know I didn't mention many books/series, but seems like information in this realm might be useful. Hope this helps! All the best :)", "permalink": "/r/DecidingToBeBetter/comments/fd3k4c/ive_noticed_myself_getting_a_little_too/fjgdjrg/"}