{"id": "t5_2tand_t3_fd3k4c_t1_fjfejtk", "creation": 1583290164, "origin": "t5_2tand_t3_fd3k4c", "height": 1, "replied_to": "t5_2tand_t3_fd3k4c", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Nashboy45", "text": "Actually I feel like we are very similar. This actually messed up a relationship I had with someone because I really did think I was right all the time. However, more often than not I just was way better at expressing my points than other people and so it made it convincing to someone who was “less enthusiastic” about being informed about a wide breath of topics.\n\nWhat I learned from that experience is that just because I have a really solid point in my head and there isn’t really a clear point coming out on the other side doesn’t necessarily mean there is no point being made at all. More often (really every time) people need help expressing their points and learning what they really mean. So instead of trying to lay down what I’m saying, I spend a lot more effort now trying to see what other people are saying. The rule of thumb is, “if it doesn’t look like something I could really see their point of view on, then I’m probably not understanding their point enough.”\n\nIm not perfect every time but I have improved on that front significantly and every conversation I have with people is interesting because you get to peek into their world to see how they think about things instead of just looking at things my way. Most of the time I don’t really change my ideas and personal stances on things but it has definitely opened my eyes to the complexed and diverse perspectives of the people around me in an interesting way. Also people feel more comfortable talking to me because I really am just in it to hear them out. I don’t have to prove to them my perspective because I’m too engaged in their perspective. The side result is they often do ask for my perspective and are able to hear me out more. Last observation is that most of the time, people don’t disagree on things but that there is a aspect of a topic they really want acknowledged and highlighted and when you can get them to feel like you see that part of it they are more readily willing to see what you’re trying to highlight. Everyone’s trying their best.", "permalink": "/r/DecidingToBeBetter/comments/fd3k4c/ive_noticed_myself_getting_a_little_too/fjfejtk/"}