{"id": "t5_2tand_t3_p204ui_t1_h8ifjxa", "creation": 1628669570, "origin": "t5_2tand_t3_p204ui", "height": 1, "replied_to": "t5_2tand_t3_p204ui", "down_vote": 0, "up_vote": 60, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DaleNanton", "text": "I’m just blown away by the huge amount of privilege in OP’s write up. I don’t come in contact with this amount of it ever so this was an amazing read just from the stand point of like “wow this person just keeps fuckin up and it’s alright every time!” And we’re supposed to be clapping over here like “wow you’re amazing.” as if the system isn’t designed to help your probably male, white American behind. No one’s so into spinning their spoiled childhood into some hero story like the white American male I tell ya. Good for you, OP. Thank god the bank was able to finance your vacations while you were going through all of that stress. Not to mention juggling that high-paying job you didn’t have to do anything to get while dealing with your “bitch” boss (was it a woman? - god, so annoying) that wanted you to actually work and like… *figure stuff out*? How nerve-wracking! Truly harrowing stuff. Better get started on your “if I can do it so can you” speech now.\n\nEdit: I just realized that OP is saying that they came out of college with no college loans, just credit card debt. If you scroll up a bit, OP says that they didn't get any help other than \"in the very beginning\". I mean... this is some real \"I got a small loan of a million dollars\" shit and people are really eating it up in this thread. OP was never under any real financial threat. Just playing around and experimenting with the luxurious cushion that life provided them with and making a boohoo story out of it and people are really playing into it like \"Wow so proud of you bro.\"", "permalink": "/r/DecidingToBeBetter/comments/p204ui/after_5_years_i_paid_off_70000_of_credit_card/h8ifjxa/"}