{"id": "t5_2tand_t3_ptuhun_t1_hdz5m0f", "creation": 1632411927, "origin": "t5_2tand_t3_ptuhun", "height": 1, "replied_to": "t5_2tand_t3_ptuhun", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kwitcher-kvetchin", "text": "OP I wish I had gold or an award to give you for this.\n\nTY **so much** for sharing your experiences & thoughts. Your insight & perspective is very helpful to me on my own path right now. Hopeful & encouraging! TY!\n\nI'm impressed by your commitment & I'm excited for your future progress away from social media.\n\nI've been \"getting less connected\" also, & have been pleasantly surprised to note how little I've \"actually\" been impacted, so far. I definitely needed distance. I'm also vm appreciating one less bill to pay, too!\n\nA few weeks ago, I returned my modem to the ISP after a rate hike. I still have plenty of audiobooks & movies in my stockpile & can refresh those during my weekly trip to the library.\n\nAbout a week ago, FB AI misinterpreted one of my comments on a news article **about** violence as \"inciting violence\" vs. discussing the article itself, so now I'm in \"time-out\" for a bit. I noted I was irked by the circumstances, but not by the \"forced break\" itself. I felt a little grateful, TBH. I didn't contest it.\n\nI alerted my few \"actual\" friends, especially those who have spoken up in my prior times of quiet.\n\nI closed up my profile, then deleted the app.\n\nIn honesty, I think what's kept me reluctant to deactivate my account entirely is the fact I have a lot of history documented there, & I haven't applied myself to transferring / archiving all of it elsewhere. I'll most likely do that while I'm sitting in time-out, then shut it down entirely. I don't want to go back.\n\nAlso, I think the pandemic **and** the election  uncertainty here in the US November to January contributed a lot to my internet overindulgence. As you note in your post, I think so many of us seek that *genuine*  connection and reassurance, especially folks who are lacking it in their day-to-day lives. Like you, I've been focusing my energy on my real-time, real-life cares & connections. Much more fulfilling!\n\nGosh, this turned into a bit of a Tolstoy, eh? Sorry about that! Best wishes to you OP, & thanks again for sharing. I've gotten great mileage out of this post!", "permalink": "/r/DecidingToBeBetter/comments/ptuhun/150_days_without_social_media_7_things_i_noticed/hdz5m0f/"}