{"id": "t5_2tand_t3_o9q1kj_t1_h3e4xtr", "creation": 1624931476, "origin": "t5_2tand_t3_o9q1kj", "height": 1, "replied_to": "t5_2tand_t3_o9q1kj", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "containmentleak", "text": "1- Virgin: This would be a benefit if you met/married someone religious. Being a virgin until marriage is a great thing - you just live in a western society that doesn't value this and where people are getting married later and later or not at all. (aka - stop comparing yourself - it's hard, I know)  \n\n\n2-  Living at home. This is also cultural. It's perfectly normal to live at home until marriage. America has this weird independence streak and I assume that's where this idea/fear is coming from.   \n\n\n3- Debt - you tried something really cool. Not everyone succeeds. Your debt is a tribute that you were brave enough to take a chance more than a sign of weakness or failure.   \n\n\n4- Limited travel - the fact that you have at least left your home country once for the fun of it and still have the desire and curiosity for travel (regardless of ability or carrying through of that) is valuable. So long as you have that, when you're ready you will travel again.  \n\n\n5- ah yes, the 30's friend dearth. Friends come and go we just don't talk about it. Find online communities (reddit isn't too bad, some discord ones are nice too and you can call, watch movies, and listen to music with other people and just generally become very close) until Covid allows you to pick up real life ones again. Maybe you did yourself a favor there. Doesn't mean you can't be friends with those people, they just aren't the close friendships that you want and need. Exciting time to find newer ones and more.  \n\n\nThere is no such thing as \"should\" so you are so not behind. I've seen chronic pain, disabilities, death. \"Should\" those people hold down a full time job? Live independently? Or are they okay being just as they are, and just where they are. No such thing as \"should\" or \"normal\". Just stastistical majority or minority. Doesn't make it right/wrong/better or even normal. Normal is relative to each of us.\n\nSounds to me like most of your problems are in your outlook (like many of us). I recommend a qualified therapist. You may need to to try 2 or 3 different people to find a good fit though. Am on the thought journey myself. Good luck!", "permalink": "/r/DecidingToBeBetter/comments/o9q1kj/seriously_behind_in_life_would_appreciate_some/h3e4xtr/"}