{"id": "t5_2tand_t3_ogt2ih_t1_h4mm6ds", "creation": 1625860912, "origin": "t5_2tand_t3_ogt2ih", "height": 1, "replied_to": "t5_2tand_t3_ogt2ih", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Nichoros_Strategy", "text": "I had a pretty significant realization the other day. I have been sinking into more serious alcoholism+weed smoking abuse for many years now. Honestly attempted quitting thousands of times now without success, and the long term effects weakening my potential in life increasingly. Every attempt I make has revolved around habit management, to get them right, choosing the best ones, and then of course the discipline to execute, all amidst the weight of whatever withdrawals I owe at the time. Before long, self sabotage happens like a snap judgment where I make little tweaks and allowances, I make the rules, so I can break them just as easily. Then it's back to the drawing board again after going on \"vacation\" with the drugs for another round and all good habits put back on hold. \n\nThe realization is that this focus on habits needs to be completely flipped, or I have no hope. Whether that's true for everyone I don't know, but the point of quitting, for me, is to get back to being successful, to get more things done, have new experiences, meet new people and be presentable, to get physically and mentally healthy. The theory about getting habits right makes plenty of sense, as getting them right would likely make achieving that goal a little easier when you are \"ready\" to, but I think it is such a tightrope, and for me I think a defense mechanism to avoid taking direct, bolder actions, maybe fear of the very success that I claim to want. Generally, people don't do what they don't want to if they have the choice, and for drug users that choice of what they want to do is pretty simple, especially with passing time within the cycles.\n\nSo it comes down to, I need to go right for the throat of the issue, as I think you did (even if by accidental discovery). By finding action to take in the realm of: Success, relationships, health, that I straight up WANT to do on a regular basis, and give 0 thought to any habits which in theory would enhance myself in those realms, because when you just start doing a new thing that you actually like to do and want to get better at, as time passes the habits must come naturally, they'll be implementable more so when you are already on the playing field every day and starting to get stronger. If I want to stop taking drugs, I need to be living a life where taking drugs is nothing more than a strain on what I actually love doing. So long as they are a coping mechanism to help pass the time in a life that I've kept in some sort of \"stasis\" mode, the strength just isn't going to be there. I think the phrase \"fortune favors the bold\" has never been more true.\n\nThanks for the post and congrats!", "permalink": "/r/DecidingToBeBetter/comments/ogt2ih/i_had_to_be_better_it_was_either_that_or_the/h4mm6ds/"}