{"id": "t5_2tand_t3_pxub03_t1_heswdkh", "creation": 1632968226, "origin": "t5_2tand_t3_pxub03", "height": 1, "replied_to": "t5_2tand_t3_pxub03", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AnxiousLuck", "text": "I agree completely on the advice of focusing on you and personal boundaries you need to set yourself up for a happier life and better relationships. Honestly, everything you said after you being ‘compatible in nearly everything’ explained exactly how you are not compatible. Also, if he loved you and was loyal even as a friend, he wouldn’t basically put you on the street after the breakup. Also, 32 is incredibly young!! I understand the feeling left behind other women at that age but personally I started life over at 33 (am 37 now) and am so effing happy I did. I focused on me and my mental health. I know what I want now. I have boundaries now. I have enough self esteem to demand my needs in all my interactions. Other people’s lives don’t affect my life or choices, no matter how close they are to me. Also, dating never stops. I haven’t left the house since the pandemic and don’t go to clubs or parties or clubs at all but have been getting texts and calls from potential suitors the entire time. Again, 37. Finding a partner should not be a focus or worry right now. IVF for family will be available and likely more advanced when you’re ready. Jennifer Lopez, Mariah Carey, Chrissy Tiegan, Michelle Obama and many many many more womenall used IVF to have families in their late 30s and 40s. You can’t afford to worry about finding someone to fit your imagined timeline. after you get yourself mentally trained to not let things that bother you slide. You’ll be great! In most cases, starting over is good. Honestly starting anything over is great. You literally have a blank slate and can design the very long life you’re going to live to ensure you are mentally and emotionally ready for any future stumbling blocks. Good luck, you’re awesome and ask google or Alexa for a compliment for a moment.", "permalink": "/r/DecidingToBeBetter/comments/pxub03/starting_life_over_at_32/heswdkh/"}