{"id": "t5_2tand_t3_pxub03_t1_hepuuna", "creation": 1632920787, "origin": "t5_2tand_t3_pxub03", "height": 1, "replied_to": "t5_2tand_t3_pxub03", "down_vote": 0, "up_vote": 28, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "joshiwheel88", "text": "So I’m pretty much on the opposite side of this. Me (33m) and my girlfriend (32f) have been together for 6 years. \n\nI’ve never been great at expressing my emotions, giving compliments, or initiating much of anything . I’ve just never been good at getting them outside of my head, my head will stop me. I suppose I don’t want her to laugh at me, because in my head I don’t think she’ll believe me. \nIn the beginning, I’d say something kind or the like and she’d tell me to stop, never realizing that she enjoyed it, but her insecurities told her I was lying or the like.\n\nRecently, I was made aware that our relationship felt more like that of roommates. I can’t say I was completely surprised, but it kicked me into gear. I love her so much and couldn’t imagine my life without her. The most important part to me was that I wanted her to be happy. We decided to take a break.\nMuch of our lives still intertwine, so we’re still « together ». \n\nWe’re working on ourselves as well as each other in the mean time. I’m pushing through my thoughts and expressing myself.\nIt’s a partnership, I figured it was worth looking at myself and allowing myself to say what I’m thinking as well as how I feel for her on a daily basis. I honestly feel that the two of us are closer now than ever. It feels light and freeing now as well. We’re so much more jovial. \n\nI don’t know if it will last like this way forever or if I will revert back to my old self. I feel that not only is this benefitting our relationship but also myself.\n\nI hope this helps you and hasn’t just been a rambling mess. Good luck.", "permalink": "/r/DecidingToBeBetter/comments/pxub03/starting_life_over_at_32/hepuuna/"}