{"id": "t5_2tand_t3_pxub03_t1_her8y1y", "creation": 1632941791, "origin": "t5_2tand_t3_pxub03", "height": 1, "replied_to": "t5_2tand_t3_pxub03", "down_vote": 0, "up_vote": 14, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "hecknology", "text": "So, I \\[28M\\] admittedly relate to your ex-boyfriend. I've been in and out of long-term relationships for the better part of my adult life. My first long-term relationship ended because he put on a little weight (that I didn't notice), got feelings of insecurity, and projected my lack of affection as disgust or spite. Essentially, I wasn't emotionally intelligent enough to support him, even though I wasn't aware that he was feeling self-conscious about his body. \n\nMy last ex actually left me. For a friend of ours. Lied about it for months. And when I finally figured out the whole story, he told me, \"You're detached. You never give me affection. I always feel like your love is conditional.\" And it was sad. It makes me feel very lonely sometimes. \n\nUnfortunately, I can't change the way I show affection. It's a survival mechanism, deeply engraved in my personality at this point. It's very you-can't-teach-an-old-dog-new-tricks. \n\nBut there is a happy ending to this. I've been with my boyfriend \\[33M\\] for just about 2 years. He's incredibly affectionate, often goes through waves of being needy. He comes from a background in musical performance, so I sweetly refer to his needy moments as \"Zip-Zap-Zop to cry for attention.\" But he also just... gets me, ya'know? Like, I don't have to TRY SO HARD with him. He understands that I love him -- I care so deeply -- I'm just... a lil different. \n\nSo, I say this to tell you that you're doing the right thing. And it probably hurts so badly, and it's gonna suck for a while. But if you're not getting what you need, it's better that you identify it NOW and make the change at 32 than wait until you're 40, or 50, or 60, etc. You deserve someone that meets your needs, and your ex-boyfriend, much like me, couldn't do that. AND I'm so proud that you ended it while clearly addressing these reasons before it manifested as some kind of misguided hate (a la the 2 exes I mentioned above). \n\n&#x200B;\n\nTL;DR - You're doing the right thing. Sometimes the best decisions are also the hardest to make. You're both going to find such amazing and supportive people in the future. It sucks right now, but every day it'll get a teeny bit better until you one day look back on this moment as a fond and familiar memory.", "permalink": "/r/DecidingToBeBetter/comments/pxub03/starting_life_over_at_32/her8y1y/"}