{"id": "t5_2tand_t3_pxub03_t1_hetq4gk", "creation": 1632987214, "origin": "t5_2tand_t3_pxub03", "height": 1, "replied_to": "t5_2tand_t3_pxub03", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "herro_rayne", "text": "Hi op! Don’t worry too much, I am 29 and I started over two years ago. I divorced for the EXACT reasons you described, pretty much the same scenario. A month after I left and had been living on my own, I met my current husband. Don’t expect to meet the love of your life as quickly as I did, but know that you likely will meet them, now that you aren’t settled in an unfulfilling relationship. I am so so so happy I left my ex. I know what true love feels like now and I get to hold onto it. I was very happy on my own, always have been, and would have been happy to be single as long as possible. I never thought I’d marry again, then boom my soul mate came along. We’ve been married for a year now and it’s so lovely. Seek happiness in your own company, do all of the things you want to do. Don’t look for the right one in the wrong person. You are all you need, just like I was all I needed, If the right one is out there you’ll cross paths someday. Should you find the love of your life you will be so thankful you took the time to be single. If you don’t allow yourself to be alone you may never find the right person for you. An affection lacking relationship is hollow and will drain you. Trust your instincts and good luck starting over, it will be ok in time. 32 is still young! Don’t fall into the trap of (I can’t have kids past 35) I’m a nurse, TONS of women have healthy happy families at STARTING at 40, you’ve got time.\nAll this to mostly just say, I was the happiest I’d been in 3 years when I was alone, that happiness then was increased when I met my husband. None of that happiness would have been possible if I had stayed with my ex, who couldn’t even be bothered to try, or go to therapy or any of that.", "permalink": "/r/DecidingToBeBetter/comments/pxub03/starting_life_over_at_32/hetq4gk/"}