{"id": "t5_2tand_t3_pt1ep1_t1_hduules", "creation": 1632325606, "origin": "t5_2tand_t3_pt1ep1", "height": 1, "replied_to": "t5_2tand_t3_pt1ep1", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BurntnToasted", "text": "Ok, Ill bite. It’s not “easily” combated, OP could be under a ton of stress, simply saying “OP just go workout, eat great food, and get 10 hours a sleep, gosh, why aren’t you taking my advice” is kind of “rude”(this is an example, obviously you didn’t say this). There’s a ton of factors that can be at play here, maybe OP has ADHD, where simply “turning it off, have it in a different room” isn’t so easy. Dopamine is a powerful tool, and sadly most do not break away from an addiction until they have hit rock bottom, that point varies from person to person. Maybe you caught on the fact that your phone was addictive and took control before it was too late. When I was in deep depression I used videos/scrolling to escape from reality, this happened for years until I get better. I’ve taken years to improve myself and I’m still not out from its clutches. Yeah, I can turn my phone off, put it in another room, but my brain is conditioned for that dopamine, I try to improve bit by bit everyday, but it’s a long process. You block every dopamine receptor in a rat and it won’t move for anything and will eventually die, that’s how strong dopamine is. From what I’ve seen, OP doesn’t seem like he’s not taking advice either, and considering he posted on this forum asking for advice, I wouldn’t say he doesn’t want advice. I’m not sure how you’re a therapist, you basically stated “Your problem isn’t a problem I have, therefore it’s pointless, just use willpower dumbass.” Maybe you’ve posted some actual advice in other comments on here, but for this thread, you haven’t contributed any useful information other than the fact you’re way better than OP. You have to be a troll. You can always delete posts and stuff, and I’m not dedicating my time to scroll through your entire comment history.", "permalink": "/r/DecidingToBeBetter/comments/pt1ep1/my_phone_is_literally_killing_me_i_need_help/hduules/"}