{"id": "t5_2tand_t3_q2d978_t1_hfnwmvn", "creation": 1633561729, "origin": "t5_2tand_t3_q2d978", "height": 1, "replied_to": "t5_2tand_t3_q2d978", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Sanne_Reddit", "text": "Hey girls,I also broke the contact with my toxic partner (in my case a narcissist) this year. It's hard work, but at least it's a road that isn't being shoveled away under your feet while walking like it was being in the relationship.\n\nOP, your ex sounds like a total idiot for not jumping that bandwagon with you to self development. And your future self will thank you so much one day for your courage to take this step (I've been there before so I know).\n\nI wanted to give you, and anyone that can use it, a copy of my First Aid Plan when flling into those moments of toxic hope, what ifs..., if only's, denial and shame. Those will come, but don't worry, they're just hurdles and will fade out. Your thoughts aren't true, it's just your mind & body longing for the familiar patterns you developed in this reletionship. I just can't find how to attach a pic, though, so if you're interested, let me know and I'll see if I can make a post or work something out to get it to you. Or, make one for yourself, the ritual of writing it down can also be a good one. For me it's 2 pages of the toxic feelings and thoughts I did, and will, encounter like \"they will treat their next partner better and I will miss out\" and the realistic way of looking at it: \"they won't. they'll just find someone less assertive and/or less capable to see the toxicity of it all. that way they'll have a longer supply of affection and flattery so they can keep up the appearance for themselves and others they are a total ass without having to change. people that are not prone to self development, won't change that overnight. so even if he does change, he's still a long road away from acceptable behaviour and probably won't even take that path or give up and show the lack of self responsibility he has always shown\". (O and yes, I stole it all from anyone and anywhere, mostly podcasts about abuse, because other people that are further up that road see many things clearer than I do. Whatever helps me, or you, make that shift from feeling helpless to feeling strenght.)\n\nI proud of you and anyone else empowering themselves and your messages give me hope I can do this and keep my head held high.", "permalink": "/r/DecidingToBeBetter/comments/q2d978/i_left_a_toxic_relationship/hfnwmvn/"}