{"id": "t5_2tand_t3_ag1txb_t1_ee3dkla", "creation": 1547520064, "origin": "t5_2tand_t3_ag1txb", "height": 1, "replied_to": "t5_2tand_t3_ag1txb", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "BrutalSap77", "text": "Hey man. First of all, take a breath. Like an actual breath. Look around you, look at the pictures and messages on your phone, think about what you have in your life. EVERYTHING IS OKAY. You are amazing and everything is going to be fine. You're obviously a caring person and your anxiety stems from roots of love and care that crawl into a fear, which is okay.\n\nIt's also a good thing that you were able to realize the obsession with her that, while a good thing in small senses, was causing a drift from yourself and your life. I'm glad you were able to work on this and begin to be your own guy, which is obviously what she fell for in the beginning.\n\nHave you tried talking about all of this with your girlfriend or a close friend or family member? It's very helpful for anxiety to have a vent source and somebody with a solid foot on the ground to reassure you that you're a good dude and are gonna be fine. I appreciate you sharing and opening up but coming on this app for this makes me wonder if there's opportunity to discuss this with people around you. It might be you avoiding it out of fear that it'll make people judge/not like you (trust me, I've been there!) but these people that love you and here to help you be a better person and you would be there for them in the same fashion.\n\nI know traveling and being without someone like that for such a long time can cause more worry but I encourage you to have a conversation about this with her. Don't worry about her judging you or starting a fight. Tell her your concerns about your mental health and that you have worries and have her help you through it. \n\nI hope this helps please feel free to DM me if you just want to talk more man. Have a blast in Prague I'm sure you will!", "permalink": "/r/DecidingToBeBetter/comments/ag1txb/hey_everyone_im_just_wondering_if_im_doing_okay/ee3dkla/"}