{"id": "t5_2tand_t3_m0yhhe_t1_gqf60qt", "creation": 1615358440, "origin": "t5_2tand_t3_m0yhhe", "height": 1, "replied_to": "t5_2tand_t3_m0yhhe", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ray-Flower", "text": "My dream started out as merely just interest. I had a great interest and love for something. I wanted my life to be more about it. For me, that was making video games. I only really knew it was my dream when everything else just didn't spark that kind of interest in me. \n\nSurprisingly, just a while ago I realized that if I had not decided on being a game designer I would likely had become an engineer, because my next greatest interest is solving problems and learning intricate systems and patterns. \n\nIf you want to realize what your dream is, just think about what you enjoy the most. If you can't think of anything, go and try a bunch of stuff you've never done before! Working different jobs for a while, talking to new people, cooking, baking, sewing, embroidery, etc.. I just discovered I love sewing and crotchet a few months ago by giving it a shot, it's a lot of fun and quite chill! my kind of thing. Use that as an example to figure out what you vibe with. think about what you REALLY want if there was nothing stopping you, not what you think you can get (because that will *not* make you happy). You can always learn and grow to get what you want. \n\nAs for loving yourself, it's no short answer. A lot of it has to do with your mindset and habit of thought. You need to change your habits to the ones you want, and through your habits you will become the person you want to be. The thoughts you think control what you feel. \"I don't like where I am right now\" sounds like a habitual thought -- if that is what you are thinking, that is what you will feel, and ultimately what you will express in your actions. catch yourself when you think those thoughts and make the choice of choosing to think about what is positive in the situation you are in, and what you have to be grateful for. When you allow yourself to feel grateful for something, you are creating a space in your emotional state for love to move in. It opens you up. \n\nA very important tool to keep in mind... The thoughts you think sets the emotions you feel. What you feel will manifest itself in your actions. And your actions will give you the results of those thoughts. Another perspective to look at it is from your current situation and results. Based on that model, what do your results tell you about what it is you are thinking? You become what you think. Always remember that. Always think positive things and such things will find themselves in your life. \n\nI know you will probably still have questions, this is partly coming from the program I took which covers a lot of different mindset stuff so it's hard to grasp at first. \n\ntl;dr: you become what you think", "permalink": "/r/DecidingToBeBetter/comments/m0yhhe/problems_with_selfworth_and_selfsteem_want_to/gqf60qt/"}