{"id": "t5_2tand_t3_m0yhhe_t1_gqm480s", "creation": 1615494998, "origin": "t5_2tand_t3_m0yhhe", "height": 1, "replied_to": "t5_2tand_t3_m0yhhe", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ray-Flower", "text": "Don't surprises your negative thoughts. They are a part of you, and when you surprises them, you are really just surpressing yourself. Embrace those thoughts and feelings, let them flow through you, not run away or bottle them up. The difference is that after you let them through, giving yourself enough time as needed for them to resolve, you can then choose what you want to do and think next. Know that those feelings are there, embrace that part of yourself as being perfect just the way you are, and choose how you want to move forward. \n\nGambling is not the same as persistence. You will know that the odds are in favor of you losing money than winning. \n\nBeliefs have to do with taking charge of your destiny, and becoming what you are thinking. \n\nThere are a lot of things you can try out, I guarantee you. Write out a list of everything you can think of that you haven't tried. Knitting, embroidery, cooking, baking, going to a concert, playing an instrument, drawing, animating, volunteering, whatever it is, try something you've never done before. Of course it will feel challenging, and that you may think it's pointless, but that's because what you are conditioned to think and feel. It's those thoughts that are stopping you from actually breaking out. When you encounter those thoughts, you are going in the right direction. Any kind of self doubt, pessimism, or negative thoughts are a cause of your current habits and lifestyle to keep you pinned down where you are right now, to keep you \"safe\". It's how we evolved as a species. But that doesn't work well in our current civilization. We need to adapt and grow, not stay where we are. It's hard because we're not used to it.\n\nBefore I get into the psychology part, think about what kind of goal you have for yourself. Something you've never done before that you really want. Not something you know how to do, or think you can get, but what you really want that you do not already know how to do. Think of the one thing you want more than anything. The thing that if you had it, you would feel amazing. Something you think about every day. That is your goal. Write a list of everything you may want and desire, order it by preference of importance, and the number one thing is your goal.\n\nDoes your school offer any psychology classes? You could read some books on psychology, or take an online course. What is stopping you from going after that dream? I guarantee you it is only yourself. If others are not offering it, find some courses. Read a book. Connect with psychology professionals and ask them a few questions on how to get started. People LOVE to get asked questions and help others (especially me). \n\nThe question you should ask yourself is \"how can I achieve my goal?\" And then go and do it. You will find it's hard, because it's stuff you have never done before. But you will feel empowered to go after it because it is something you genuinely want", "permalink": "/r/DecidingToBeBetter/comments/m0yhhe/problems_with_selfworth_and_selfsteem_want_to/gqm480s/"}