{"id": "t5_2tand_t3_mjr8zy_t1_gtdpj14", "creation": 1617567210, "origin": "t5_2tand_t3_mjr8zy", "height": 1, "replied_to": "t5_2tand_t3_mjr8zy", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "dirty_guava", "text": "There is only one thing you need to become convinced of, and that thing is...there is no right answer. There is no perfect diet. There is no perfect regimen. There is no perfect way to be.\n\nI also suffer from overthinking. Recently I almost had a complete mental breakdown because I couldn’t stop the overthinking voice in my head. I was in terrible emotional suffering. I finally got on antidepressants which I wish I had done ten tears ago. The antidepressants helped quiet my brain. Suddenly the overthinking and information overload were not my default. In the stillness I started to hear another voice which I realized was my voice. The strangest thing is that I don’t think I’ve ever heard my own voice before, or at least not since I was a small child of 6 or 7. I realized my voice is kind to myself. When I listen to my voice, I can hear what I want to do: eat a burger or a salad, sleep or take a walk, put down my phone and pick up a book or call a friend. \n\nMy life isn’t perfect now but I’ve learned that the overthinking voice was just a voice in my brain that isn’t really who I am meant to be. It will always be a part of me but I don’t have to listen to it. Especially because there is no right answer to most things about how to live. You have to listen to yourself to decide how you want to live. \n\nAntidepressants may not be the right solution for you but I recommend trying to spend the next few weeks and months quieting your mind and searching for your voice. It will be quiet and hard to hear at first but it’s there. The more you listen to it the stronger and healthier it will become. Meditation or running might help you quiet your mind. As you start listening to yourself you’ll start to know what you want to do. \n\nGood luck friend!", "permalink": "/r/DecidingToBeBetter/comments/mjr8zy/overthinking_is_ruining_my_life/gtdpj14/"}