{"id": "t5_2tand_t3_okxpz6_t1_h5cgqnv", "creation": 1626398935, "origin": "t5_2tand_t3_okxpz6", "height": 1, "replied_to": "t5_2tand_t3_okxpz6", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Viper610", "text": "Life is hard when you're dealing with depression. Especially when you feel like you're competing with others around you and trying to match up. It's not a healthy way to live and I myself am now coming to terms with it. \n\nI left work in January of this year to get myself back on track after trying to bury my depression in my work. Sought out therapy and meds and while the first 3 months were hard, I found my balance, and everything was looking up. Then mid-June came and my meds were no longer working (yes your body can become tolerant to antidepressants in which you may need a dosage upgrade) and before I knew it, I crashed and ended up overnight in the hospital. Nobody called, nobody asked about me, and to top it all off, family and whoever else I thought would support me, made it out to be my fault. I felt like crap and didn't want to do anything. I was mad at myself and everyone around me, but after a while of doing nothing, I got back into my therapy sessions, got new meds, and have been on track since. Yea it was an embarrassing fall from what I came from, but I got back up and that's what matters. \n\nI told my own family, back off. I hate that when I'm \"good\" they want to be around, but the minute I hit a bump in the road, they disappear. It's not healthy and is no good for my progress and recovery. If you're gonna be around to be supportive, fine, but if not, goodbye. This whole year, my siblings have texted me once. I'm not mad. I understand that some people just don't understand mental illness and choose not to understand it and that's ok. It helps me know who to keep around if anyone.\n\nIf their absence brings you peace, you didn't lose them, they lost you\n\nI've pushed through by not focusing on them and instead using all that energy to focus on me. I block out what everyone else is doing because everyone else is on a different, with different level of baggage. I did a week of venting to myself and then day by day starting to get back into focus. At the end of the day, all you have is yourself and you have to find a way to live with yourself because you are what matter\n\nIt's okay to take a break. Don't feel bad about it. And also when you're ready, remember, you don't have to eat the whole elephant at once. Take your time and do what's right for you.\n\nI wish you the best of luck!!", "permalink": "/r/DecidingToBeBetter/comments/okxpz6/i_have_decided_to_give_up_on_being_better/h5cgqnv/"}