{"id": "t5_2tand_t3_lheg5u_t1_gmzab8w", "creation": 1613075348, "origin": "t5_2tand_t3_lheg5u", "height": 1, "replied_to": "t5_2tand_t3_lheg5u", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "omi_palone", "text": "I could not agree more.\n\nTwo years ago, I ended up in the hospital. My insomnia had gotten so bad that I was starting to have auditory and visual hallucinations, my short term memory was nonexistent, and life had become intolerable. I got connected with a therapist for the first time in my life, and the therapist was also n MD who ran a sleep clinic. I thought he was just going to prescribe me sleep meds, but I was surprised when he said his entire practice has a policy: meds are an absolute last resort, and you're going to test solutions to all the common sleep problems before we even consider them as a long term measure. He handed me three individual surovexant pills so I could get some reliable sleep for a few nights, and I started therapy and sleep hygiene assessments with him immediately. \n\nHis first four requirements in my case: zero caffeine at all, no electronic screens after 6 pm, be in bed no later than 8:30 pm (reading was fine, but no screens), and a daily exercise requirement (usually walking for an hour or jogging for half an hour). After those three surovexants, I haven't taken a sleep aid since. I'm amazed at how effective it was to simply regulate my behavior to facilitate sleep and restfulness. I have caffeine again, but none after noon, and I've greatly cut down on my intake in general (and I'm grateful that my local coffee shop sells very high quality decaf beans so I can still have coffee outside my morning caffeine window). My insomnia didn't go away immediately, but it started improving immediately. \n\nDid this solve everything? No. Did this make me much more able and willing to work on other problem areas in my life? Absolutely. I so completely encourage everyone to find a sleep routine that works for your lifestyle. It's an excellent investment in yourself.", "permalink": "/r/DecidingToBeBetter/comments/lheg5u/stop_neglecting_your_sleep/gmzab8w/"}