{"id": "t5_2tand_t3_po0dz0_t1_hcu7rg4", "creation": 1631637782, "origin": "t5_2tand_t3_po0dz0", "height": 1, "replied_to": "t5_2tand_t3_po0dz0", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MrClickstoomuch", "text": "Still struggling with this a bit, but here's some of my personal favorites:\n\n* raspberries: these only have 5g of sugar and 8g of fiber per cup, but still really fufill the sweet tooth! Blueberries are also good, but have half the fiber and more sugar.\n\n* pistachios / nuts: all nuts are great for eating healthy IN MODERATION, but I really like the flavor of pistachios in particular. It fills my fattier food cravings.\n\n* salads: while salads are good for you, avoid low nutrition leaves like iceberg and go for cabbage or other veggies instead. And a homemade dressing like poppyseed dressing can be made with greek yogurt to make you get good nutrition with some sweetness to make your salads pop. And put some nuts / feta cheese on it to get some mouth feel variety!\n\n* carbonating a bit of water with a sodastream or other machine and mixing it with some fruit juice can really help fufill that \"bubbly pop\" flavor desire while weaning you off it. Be careful though on what juice because many have as much or more sugar than some pops. Smoothies can help if you mainly want the sweetness but not carbonation, but still want to feel good about your food. I put my smoothie ingredients together in big reusable plastic bags in the freezer so I can just blend it together when I want something sweet to drink.\n\nMy big problem area right now is dinner meals because most of the stuff above is snack foods or appetizers. Chicken and fish are great, but haven't found something that sticked for me to avoid fattier options. You can make some chickpea pasta pretty easy and relatively cheap, but not trying to make a chicken pasta dinner every night either.", "permalink": "/r/DecidingToBeBetter/comments/po0dz0/i_started_eating_good_food_and_exercising_i_quit/hcu7rg4/"}