{"id": "t5_2qh5i_t3_afyn3l_t1_ee32cwr", "creation": 1547511192, "origin": "t5_2qh5i_t3_afyn3l", "height": 1, "replied_to": "t5_2qh5i_t3_afyn3l", "down_vote": 0, "up_vote": 48, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Series_of_Accidents", "text": "Really great question. Office hours are yours to use for whatever issues arise. I don't do any deep-thought work during that time because the distraction of students popping by makes that less efficient. So if students don't come by, I often get a little bored since I'm usually just sorting through emails, grading, or working on lecture prep. Having students come by makes the office hours feel like they're actually useful.\n\nMy preference is for students to arrive with a list of question they're struggling with. Then we just go over whatever they're confused about. I also love it when students come by for career planning or other chats. We're actually a pretty good resource. We know all about the process of applying to and surviving grad school, as well as important issues in our field. If you want to go to grad school, visiting your professors is a good way to get letters of recommendation. To get a good letter, we have to know you. Just coming to class and passing the tests means we don't really know you and can't write a good letter for you. \n\nNot every professor feels this way. Some loathe office hours because they are required. But it's because it disrupts deep work, not because they dislike the students (usually). So I'd say play it by ear. You can tell if your professors want you to leave. Just be respectful though. Don't overstay, be aware if there are other students waiting, don't show up early and expect to be seen, and don't show up just a few minutes before office hours end. But yeah, I have a tendency to think my students are usually pretty cool. I like spending time with cool people, so I'm rarely annoyed when someone shows up to my office hours.", "permalink": "/r/happy/comments/afyn3l/200_days_drugs_free_today_on_my_way_to_my_first/ee32cwr/"}