{"id": "t5_2tand_t3_c4nnh1_t1_erysihl", "creation": 1561416300, "origin": "t5_2tand_t3_c4nnh1", "height": 1, "replied_to": "t5_2tand_t3_c4nnh1", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CleverFeather", "text": "You’re welcome! Look, your first week is the toughest. Fact is you’ve gotta break the different habits you’re so used to giving into. \n\n\nYou gotta give up what you’re used to giving in to, because *if you keep trying what you always have you will always get what you’ve always received.*\n\n\nI was used to waking up in a daze. Used to passing out, rather than going to bed. Used to the rushed and disheveled demeanor. I was used to feeling like hell. At this point I wasn’t hungover anymore, that’s just who I was. \n\n\nI was used to the craving of a cold bottle of beer, and used to caving into it. I was used to being broke, so I was used to going to the liquor store before going to my “home bar” so I could pick up a half pint of whiskey and two or three airplane shooters too that I could sneak in and drink in the bathroom. I was used to telling my friends the reason I was going to the bathroom so often because I had broken the seal. Really though, I was just drinking in there, too. I loved colder weather because the bottles were easier to hide under layers. \n\n\nI was used to this routine. Every day. I followed it around like the dog I was. I felt like it gave me confidence, to say things I thought but didn’t really mean, or to do things I wouldn’t otherwise. \n\n\nWords and actions define us, it literally made me somebody else. \n\n\nI’m telling you all this because I hope you see yourself in the words. Because you will see yourself in my original post too, if you want it badly enough. So I’m asking you, /u/Polyunsaturatedbit ; how badly do you want yourself back?", "permalink": "/r/DecidingToBeBetter/comments/c4nnh1/my_50th_morning_sober/erysihl/"}