{"id": "t5_2tand_t3_plvd5m_t1_hce8z96", "creation": 1631331002, "origin": "t5_2tand_t3_plvd5m", "height": 1, "replied_to": "t5_2tand_t3_plvd5m", "down_vote": 0, "up_vote": 37, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SpaceAndTheWastes", "text": "* Travel (cliche I know, but hosteling around the west coast is still a highlight of my life).\n* Got a cool scar from a car built by engineering students in the Mojave desert at Mad Max fest.\n* Lost a thunderdome fight at that same Mad Max fest.\n* Worked at a bdsm dungeon.\n* Did slam poetry at open mic nights (and got stupid drunk with my fellow performers, who are now life long friends).\n* Learned to play a few new instruments and wrote a bunch of music.\n* Got free drinks for cleaning up after witnessing a bar fight (smashing someone across the face with a full drink will get you kicked out of a bar, but being the guy who cleans up after that event will get you a good relationship with the bartender).\n* Quit a miserable job after way too long (nothing will ever feel as good as leaving a place that treats you like shit).\n* Had a lot of one-night stands/made out with a lot of strangers. (Not the safest decision, but I made a lot of good friends and I had a good time. Just remember to get tested regularly and take birth control if you're into that.)\n* Got free drinks for going to a western bar on veterans day for karaoke in my full punk regalia (I had a 7 inch mohawk at the time), and singing Johnny Cash. (I'd like to believe it was because the rendition was good, but based on the shocked faces I think it was more the novelty, lol.)\n* Got lost in San Francisco in the wee small hours of the morning on the best date of my life.\n* Made friends with a Hungarian man on a 14.5 hour Greyhound to Seattle, who gave me a massive playlist of music from all over the world. (We never met again, but I still listen to that playlist on occasion.)\n* Crowd-surfed into a mosh pit and stayed there.\n* Fell in love. Got my heart truly and utterly broken. Still don't regret a thing.\n\nIn the words of the great John Darnielle, \"do every stupid thing that makes you feel alive\".", "permalink": "/r/DecidingToBeBetter/comments/plvd5m/whats_the_most_enjoyable_most_fun_thing_you_did/hce8z96/"}