{"id": "t5_2tand_t3_hfqs3j_t1_fvz8yit", "creation": 1593109214, "origin": "t5_2tand_t3_hfqs3j", "height": 1, "replied_to": "t5_2tand_t3_hfqs3j", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "weakectomorf", "text": "I have the exact opposite of you, I have no libido and I don't enjoy good food. This is due to a lack of testosterone I have recently discovered, I will supplement this soon. But what I want to say is that motivation is not purely mental but can also be physical. What you eat and how you handle your body has a strong effect on your mind. Imagine wanting to lose weight, the beginning is literally a war against your thoughts and hormones that crave sweetness, but as the days go on and you persist. Then your brain will adapt to the new situation, and after a while you will also see results in the mirror and scale. Motivation is not always the most convenient way to sail, with goals you don't always have to live in the moment but think about the future and realize yourself that if you give up today you have to start again tomorrow. That may sound obvious and easily said. But compare it with money that you borrow for consumption that you use but in the future you will run out of money. And then you have to pay back and you actually know that you can enjoy less later because you have to pay off money. The same goes for calories if your maintenance is at 2500 calories a day and then you eat 3000 calories then in theory you will have to eat 2000 calories the next day in order not to gain weight.\n\nYou have to learn to look at everything very factually and become realist because the reality is sometimes very painful and confronting but telling yourself fairy tales is not going to get you anywhere, but above all be patient with the process when you start it sometimes seems unfeasible but take a small step every day towards improvement. You do not have to be hard on a strict diet tomorrow, for example you can also take a walk if you have eaten a donut. Build it up little by little. \n\nBut it starts with being honest with yourself.", "permalink": "/r/DecidingToBeBetter/comments/hfqs3j/serious_question_what_makes_you_want_to_get_better/fvz8yit/"}