{"id": "t5_2tand_t3_equz2p_t1_fezuj8p", "creation": 1579461833, "origin": "t5_2tand_t3_equz2p", "height": 1, "replied_to": "t5_2tand_t3_equz2p", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Moira-Thanatos", "text": "Would you like to tell me, what ALL your interests have been throug your life?  \nIn what field are you making your masters degree?\n\nSocial work is not the only way to have a good impact on other people.   \nThis job field can be very devastating. Imagine you have to work with families that abuse their kids but don´t want to change their behaviour, or humans who are addicted to drugs and can´t/won´t change? A friend of me works with a woman that has a handicapped and my friend get´s treated like a slave, commanded all day and blamed for everything that goes wrong.\n\nSocial work can be very hard If you work with people that don´t want your help. But of course there are also very nice and grateful people.  \n\n\nI just wanted to say that I have the same thaughts as you have, but you don´t have to do something \"social\" to make an impact on society.    \nImagine all the people that worked on computers, the internet and satallites... freedom of speach and access to information would be VERY hard without them and only rich people could get 0,001% of the information we can access now. Technologies and inventions have a big influence on human life.   \nThe work of philosophers lead to constitutions and laws.  \nArtists, singers, actors, producers,... every person involved in creating art or entertainment gives us something to enjoy beyond just existing.  \n\n\nSay a work field and I tell you why they are important. For me, the only people society doesn´t are people who invent cheesy decoration (live, love, laugh) and of course the worst, people that hurt others. (Human trafficing etc., pedophile rings, sexual slavery...)  \n\n\nOtherwise I´m sure everything people are willing to pay for is something society needs.   \n\n\nI don´t think it matters at all WHAT field you work in.  \nThere are social workers out there that destroy people´s life and I´m sure there are a few good criminals out there too.   \nThere are simple waiters that make your day just by being very nice and there are educated and successful people out there that can harass you.", "permalink": "/r/DecidingToBeBetter/comments/equz2p/i_feel_like_i_was_born_for_greatness_but_dont/fezuj8p/"}