{"id": "t5_2tand_t3_m4swhg_t1_gqwhksq", "creation": 1615734161, "origin": "t5_2tand_t3_m4swhg", "height": 1, "replied_to": "t5_2tand_t3_m4swhg", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ettmausonan", "text": "Here we go:\n\nSo a big part of moving forward is Deconstruction; learning to detach from basically everything we're told from birth. Not *rejecting* necessarily, but recognizing that it's all been told to us by other humans, and is therefore subject to examination:\n\n*Is* this true?\n\nWell what is true...\n\nOkay, is this helping me? Yes or no\n\nIf not(OR if so), why? (Cue super-deep contemplation)\n\nIt's a process. But there are examples in media who have found that liberation: watch the movie Patch Adams or the show Psych. Dead Poets Society is also good.\n\nBear in mind you still have to exist within the system, and if you flaunt your freedom too hard there will be repercussions. In Patch, it's Phillip Seymour-Hoffman's character, in Psych it's Lassiter. (Dead Poets makes it very clear)\n\nBut underneath it all, there's the question:\n\nWhat's it all *for?*\n\nIn my opinion, it's to *help people.* A life lived solely for oneself is an empty one, endlessly chasing hollow fulfillments, inconsolable, miserable, worthless...\n\nSo take time to find a way to give back. *Your* way! They differ, do some experimenting to figure it out\n\nMinor caveat: I also have spiritual beliefs that bring it all together for me. I do not wish to foist them upon you, I don't believe in that. I do believe one can have a healthy, rewarding, pleasurable life with the basic principles I've outlined, but if one considers an afterlife, there is more to be considered. \n\nI'll leave it at that. I am available for continued conversation if anyone is so inclined, but for now best of luck to you reader, and to us all!", "permalink": "/r/DecidingToBeBetter/comments/m4swhg/im_more_interested_in_appearing_smart_in_front_of/gqwhksq/"}