{"id": "t5_2tand_t3_pzb93m_t1_hf8j6yc", "creation": 1633275803, "origin": "t5_2tand_t3_pzb93m", "height": 1, "replied_to": "t5_2tand_t3_pzb93m", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MisterMoogle03", "text": "We’re not all that different, that’s the same experience I had when I was using. It made everything easier. I enjoyed eating, talking to people, saying what was on my mind, the music and art I was making flowed freely. Just last night I found myself thinking ‘man if I had this edible I’d go and kill it on the dance floor instead of worrying about people looking at me weird’. It’s all in your head, you sound like someone who overthinks so many things, as do I. \n\nIt seems your misconception is that you NEED to smoke to achieve all that. You’ve conditioned yourself to believe that if you smoke you’ll give less fucks. It’s not solving the root of the issue, just sweeping it under the rug until the next time you NEED to smoke. Right now, you don’t see any other way because you’re not willing to live any other way. I get that. I was there just a year ago. \n\nI understand what you’re saying. What I’m saying is THC does help. It helps give you the tools to understand where you’re having issues dealing with the ordinary. It helps take those inhibitions off and let you view the world (and ourselves) with fresh eyes, clarity, and truth. \n\nHowever, if you don’t take the time to look deep inside, and learn how to use those tools to achieve sober what you’ve learned that you CAN achieve high, you’ll be relying on smoking to enjoy ordinary things that you enjoyed sober as a child. \n\nGreat things take time, it’s up to you to decide whether it’s worth it nobody else can do that for you. I’m not trying to convince you to stop smoking forever (I’m down to once a month from 10+ times a day just a year ago), only trying to relay how much better it is to have a grip on life sober and enjoy the highs 100x more because my tolerance doesn’t minimize it so much. \n\nAlso, it’s really cool to actually remember all the details I didn’t even realize my memory was too shot to keep up with.\n\nEdit: If you’re questioning whether it’s fueling a problem it’s probably because you’ve already recognized in some ways it is.", "permalink": "/r/DecidingToBeBetter/comments/pzb93m/am_i_self_medicating_or_fueling_my_depression/hf8j6yc/"}