{"id": "t5_2tand_t3_pzb93m_t1_hf1gj2o", "creation": 1633134603, "origin": "t5_2tand_t3_pzb93m", "height": 1, "replied_to": "t5_2tand_t3_pzb93m", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MisterMoogle03", "text": "Both probably. \n\nI was in an eerily similar position as you at your age. At some point, you have to be willing to sit with yourself, your thoughts, and be able to address them sober. Such is the way of life.\n\nYou can TRY to be high all the time. Even you said it’s affected your energy levels. Basically sounds like you’re ok with being a shell of who you are just so you don’t face the anxiety and depression. Imagine yourself not high, with high energy, performing. Now you’re super high performance, and not using weed as an excuse to deal with the things people have to face everyday. \n\nYou’re not treating the depression and anxiety. You’re numbing yourself to it. Running from it. You can TRY to run forever, but at some point life will happen and you’ll be forced to face it eventually; potentially at a time when you’re older with more responsibility and don’t have the energy to learn healthy coping skills that people who don’t smoke everyday learn. \n\nThere are so many ways to smoke for benefits. And at times, you probably do it, but it sounds like most of the time it’s done as a crutch. Essentially limiting your potential for growth as an adult. \n\nThe withdrawals will suck. That’s the price you pay for relying on training wheels excessively. Thank goodness it’s not opioids or benzos (I would never wish those withdrawals on my worst enemies). Force yourself to eat/drink nutrients even if you’re not hungry. It’s not supposed to be easy, but these are the consequences of your own actions. You know what sucks more? Being an adult that hasn’t learned how to face life head on so she HAS to be high all the time (versus choosing to because smoking is enjoyable). \n\nDon’t get me wrong though, there are people who smoke all day and it’s beneficial, but the intentions and purpose make a huge difference.\n\nThis is coming from someone with years of being stoney baloney. In the moment it’s fun, but it only prolongs the inevitable. Best to get a grip on it soon before you become complacent with life and apathetic toward everything and live a life of, “well I have shelter and food and weed as entertainment so all is dandy!”", "permalink": "/r/DecidingToBeBetter/comments/pzb93m/am_i_self_medicating_or_fueling_my_depression/hf1gj2o/"}