{"id": "t5_2tand_t3_o4u4b9_t1_h2kz0l4", "creation": 1624310597, "origin": "t5_2tand_t3_o4u4b9", "height": 1, "replied_to": "t5_2tand_t3_o4u4b9", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Least_Purchase4802", "text": "You’ll never get better tomorrow, because tomorrow doesn’t exist - focus on getting better right now. We always say things to ourselves like “I’ll get better tomorrow, I’ll do this differently tomorrow, I’ll start on Monday,” etc instead of focusing on doing it right now. \n\nI saw another comment say focus on one thing, it’s great advice. Choose the one thing you most want to change and immediately start doing it. Don’t wait until tomorrow. Even if it’s a small thing, just do it. We procrastinate because we think about things and overthink it and let it hold us back. Want to know a secret? If you don’t do something, it’s tying you down. An example would be you playing the piano. You want to play the piano, but you procrastinate and play video games or scroll social media, with wanting to play piano at the back (or even forefront) of your mind the entire time, so even when you’re doing other things, NOT playing the piano is affecting you, and at the end of doing the other things, you still haven’t learned how to play the piano. Next time you think about wanting to play the piano, do it! Same with anything in your life, including and especially chores, because once they’re out of the way then you’re free of the guilt of not doing them and can focus freely on your time and what you want to do with it. \n\nAnother thing is that two months ago isn’t recent. It’s two months ago. It happened two months ago, and while it was sad two months ago, it isn’t happening right now - it’s sometimes difficult to grasp, but we let things from our past dictate and define us when really we don’t need to, we can appreciate and understand that these things happened, but at the end of the day they’re not happening RIGHT NOW. \n\nYou can do this, I believe in you, and I hope you believe in you too. Send me a private message if you ever need to talk or feel like you need to share some emotion and some feeling.", "permalink": "/r/DecidingToBeBetter/comments/o4u4b9/my_life_is_spiralling_out_of_control/h2kz0l4/"}