{"id": "t5_2tand_t3_q3fmex_t1_hfsa46l", "creation": 1633645829, "origin": "t5_2tand_t3_q3fmex", "height": 1, "replied_to": "t5_2tand_t3_q3fmex", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "carlleetabobita", "text": "I used to feel this way when I was in school as well. I was constantly trying to assess my own worth. I felt that others would only interact with me out of pity, or be attracted to me because there was no one else. I no longer feel this way.\n\n\"I am rather confident with my personality (I know my values and I try to act according to them)\". Fuck yeah. ***This is called self-respect*** and it's AMAZING.\n\n\"...but I am very scared that I annoy others or that they find me ridicilous.\" You literally just said that YOU think YOU are cool. If others can't at least acknowledge that you have self-respect and that's cool, they are not that cool. ***TRUST ME!!!!!***\n\n\"There are a few good days every now and then when I feel that my likeable features outweight my unattractive ones but I always get smacked into the \"god damn look at how ugly you are - who would want to be with or even be seen with someone like that?\"\n\nI wish I could convey how useless of a pursuit abusing yourself is. Where did it get me? Where does it get any of us? The daily self-destruction is a good way to die inside, slowly. **I'm not exaggerating.** It is a great way to pave the road of your life towards depression and suicide\\*\\*.\\*\\* I am concerned that self-abuse is part of your life, to the point where you don't even know if its accurate. Really low self-esteem can be a symptom of depression. CBT exercises or therapy can help you make sense of these self-abusive thoughts like 'Am I garbage?'. Maybe check out a Dr. David Burns workbook, because THESE IDEAS NEED TO BE CHALLENGED, you cannot go on talking to yourself like this, okay hun? You matter, and it matters that you can't tell if you have any worth to others.\n\nThe people who felt like us, and go on to make it and go on to be okay in life realize that we all have to make peace with ourselves and learn to **appreciate what we have.**  You can start that journey of self-appreciation and self-acceptance whenever you want. Theres no rule you have to punish yourself until you are certain your 'good feature outweigh your bad ones' or you 'aren't socially awkward'. It's just a labor you commence inside of yourself, whenever the fuck you decide. It can feel wrong (like, fake), and it can be really challenging if you don't have a lot of honest, organic love and support in your life.\n\nIf you want to keep doing this existential calculus  to find out if you are a worthy human being, you certainly can. I wouldn't advise however, because it actually doesn't matter. You are worthy. You just have to decide. It doesn't have to be a huge arrogant thing, but you matter. You, your beauty, your warts, your strengths, your flaws are part of you and you matter and you are worthy. Done. Feel free to come back to this board whenever you need encouragement and support, I suspect you may not have a lot of it in life.", "permalink": "/r/DecidingToBeBetter/comments/q3fmex/i_feel_sincerely_inferior_to_others/hfsa46l/"}