{"id": "t5_2tand_t3_pcdig2_t1_hai8ehr", "creation": 1630030958, "origin": "t5_2tand_t3_pcdig2", "height": 1, "replied_to": "t5_2tand_t3_pcdig2", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "The_Dude_of_Pala", "text": "A similar post came up earlier and in the interest of not retyping it all please go take a look, you might find something helpful. \n\nhttps://www.reddit.com/r/DecidingToBeBetter/comments/pb4otp/i_need_advice_on_how_to_quit_porn_and_improve/?utm_medium=android_app&utm_source=share\n\nNot judging you at all, that would take too much effort, honestly. I've been there and compassionately feel for you. As for the addiction and fetish situation there's some simple things you should already know or realize. \n\n1. If you know it's \"wrong\" and you keep doing it then it's taking on the form of addiction. If porn is disrupting your life, you're choosing it over other things and if you use it like a drug to feel good, or punish yourself, etc... then it's definitely becoming an addiction. If you want to face the addiction I highly recommend checking out Dr. Gabor Mate's talks on YouTube about trauma and addiction. Then definitely talk to a real person, a therapist that specializes in sex/porn addiction. \n\n2. The increase in level of kink is typically due to desensitization, but I'm sure you've figured that out over the years. It just takes more and more to get a rise out us, so to speak. There's no easy way to discuss this with a partner, especially if they don't understand. And even if they secretly suffer similar problems, there's a pretty good chance they're going to still be upset at you and themselves. This is where it gets very complicated. \n\nSo, after reading through your post I'm not sure what you're asking for or what you're looking for. I might have missed something, but is there some specific advice or resource that you're interested in that we might be able to help with? I've been there man, and my heart goes out to you and I'd love to give you some perspective and advice, I just don't know where to start.", "permalink": "/r/DecidingToBeBetter/comments/pcdig2/porn_addiction_unloading_accepting_accountability/hai8ehr/"}