{"id": "t5_2tand_t3_okxpz6_t1_h5ebuh1", "creation": 1626443895, "origin": "t5_2tand_t3_okxpz6", "height": 1, "replied_to": "t5_2tand_t3_okxpz6", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Chezzabella", "text": "I’m so sorry that’s your experience.\n\nOne thing I will say - is that you CAN manage/unlearn what your brain is telling you. It takes a lot. But it is possible - it’s doesn’t just get fixed one day - it needs constant maintenance.\n\nCutting yourself off might make it harder to integrate with people in future… so I’m worried that on cutting yourself off - your brain will find something else to focus on, and you might get worse: anxiety / agoraphobia / depression.\n\nIf you’re happy being a solitary person then kudos to you, it might be the right thing. But really really think about whether cutting off is the right thing. Maybe take a break first, see how you feel??\n\nThe only reason I say that is because a friend of mine struggles with very similar mental issues as you - she has therapy every week to manage how her brain works against her. It is a constant battle for her to understand that her friends and family care about her, without expectation, and that she puts a lot of pressure on herself to ‘be there for everyone’ and very often has to pull herself away from that. The underlying issue is self esteem, and she IS unlearning those behaviours and has some incredibly valuable friendships with people who are compassionate about how her mind works. (We are best friends and I am always patient with her if she spirals) but she definitely culled relationships that were a detriment to her situation. \n\nHave you got the ability to seek professional help? Just to see if you can uncover WHY you put that pressure on yourself and your relationships? Why you think that shutting off is the only solution? (I’m a therapist in training so I can’t offer any official advice)\n\nBig hugs to you - sounds like a tough situation to be in, to believe that cutting off is the only way to find peace.", "permalink": "/r/DecidingToBeBetter/comments/okxpz6/i_have_decided_to_give_up_on_being_better/h5ebuh1/"}