{"id": "t5_2tand_t3_pvvakh_t1_hef6zhy", "creation": 1632706721, "origin": "t5_2tand_t3_pvvakh", "height": 1, "replied_to": "t5_2tand_t3_pvvakh", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Sueaq", "text": "Not the person you’re replying to but I had a similar experience. I started treatment for adhd 2 months ago and the change is unbelievable. You’ll have the energy and desire to do the things you’ve been wanting to do for months but have been putting off. You’ll actually be able to act on those needs/wants without feeling overwhelmed constantly over any little thing. If you suspect you have adhd talk to a professional. Getting treatment for it will be one of the best decisions you ever make. Do keep in mind medication affects people differently and it could take a couple tries to get it right. I was lucky with the first prescription I got and a small dose of stimulant solved all the issues I had with lack of motivation and focus without any noticeable side effects. One thing to note is if you do have adhd and get treated, you can still get distracted by anything even under medication. You have to go out of your way to reduce distractions and put yourself in a position to succeed/accomplish your goals. For me as a student it was going to the library every day and putting my phone away in my backpack along with deleting my social media’s and only smoking weed occasionally as a reward for getting all my work done. If you want it you’ll still have to work for it and make sacrifices as Adderall or Ritalin or any other medicine is not magic. Reducing the things that distract you or give you anxiety is key and without that, the medication will just make you focus more on the things that distract you. Talk to your doctor about it, I promise if you do get diagnosed and get treatment and are responsible with it it will change your life for the better.", "permalink": "/r/DecidingToBeBetter/comments/pvvakh/i_overcome_my_dopamine_addiction_everything_is/hef6zhy/"}