{"id": "t5_2tand_t3_mi3a63_t1_gt2t6zg", "creation": 1617313206, "origin": "t5_2tand_t3_mi3a63", "height": 1, "replied_to": "t5_2tand_t3_mi3a63", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Whew, prepare yourself for a wall of (hopefully helpful) text.\n\nThis is such a common dilemma. The problem is that we're fed the lie that we can \"just do it.\" But that's not a real option. If we could all actually \"just do it,\" this sub wouldn't have over half a million members.\n\nI used to have absolutely no discipline and no work ethic. But several thoughts and best practices turned my life around. Here are some of the things I took into consideration and kept in mind that genuinely helped me become better at life:\n\n* **Are your goals reasonable?** A lot of us have lofty ideals of ourselves. A dream \"perfect me\" who wakes up at 5am, goes for a run, intermittent fasts, drinks green smoothies, works 9 to 5, has 2 successful side hustles and 3 hobbies, a flourishing social life, etc. This isn't reasonable, because it isn't real. Nobody lives like this, not sustainably, and the select few who may live something close to this didn't get there in one day. Set the bar super *super* low. Set it so low that you cannot fail. Struggling to get through your to-do list? Cut it down to three, two, or even just ONE item. You can't do your homework consistently every day? Set a goal to simply ready yourself for work by grabbing the tools you need and just sitting at your desk. From there, work your way up as slowly as you need to. You'll know you're going too fast when your plans are getting ahead of your execution again.\n* **Are you healthy?** Meaning, are you physically and mentally well? The work is only as good as the tool, so if your mind and body are not in great condition, the thoughts and actions they carry out won't be so great either. Before any other change to your life, prioritize your health. This means go get yourself checked out for any physical illnesses. If you have mental illness, book yourself a professional. If you can't afford a professional, look for sliding scale resources, free resources, and media like books and vids put out by professionals.\n* **Are you leading a healthy lifestyle?** By this, I don't mean, \"are you running a mile every day?\" or \"are you lifting weights every day?\" though those are incredibly healthful practices. I mean, are you forcing yourself to sleep early every night so you can get a full 8-10 hours and wake up early? Are you eating whole foods? Do you prioritize produce in every single meal? Are you meditating?\n* **Are you taking your vitamins?** I made this separate from the above because I can't stress its importance enough. I used to think I was profoundly lazy. Turns out I had chronic fatigue thanks to a very severe iron deficiency. Now, I take iron, fatty acids, B12, vitamin D (SUPER important), and a vegan multivitamin (I'm not vegan but I eat a lot of plants and not very much meat). To anyone feeling down or tired or unmotivated, I always recommend vitamins because they truly did change my life. I'm not exaggerating. Your body is a machine. It needs what it needs. If you're deficient, you won't function. Start with vitamin D if you live in the northern hemisphere, and then feel your way around other vitamins to determine what you need.\n* **Do you have systems that work for you?** I love [this quote](https://twitter.com/JamesClear/status/1047643455722283009) from James Clear, author of one of my favorite self-help books, \"Atomic Habits.\" (And I'm someone who generally hates self-help books so take this as a solid recommendation). \"You do not rise to the level of your goals. You fall to the level of your systems.\" What he's saying is, your dreams and your motivations are fleeting. They are dependent on your state of mind. Your systems? They'll be there for you no matter what. They will work no matter what. I'll give you some examples of systems that I have surrounding a productive workday. I put my phone on silent, face down, and far away from me. I sit down at my desk with a hot mug of green tea (productivity juice; more on this later) and I **put up my feet**. This is so crucial for me. The moment I take my feet off the ground and cross my legs under me on my desk chair, my work mindset kicks in. It takes more effort to get off my chair and fuck around than it does to stay put and do my work, and so, I do my work.\n* **CAFFEINE, CAFFEINE, CAFFEINE.** If caffeine is something that sits well with you, use it. I wasn't a big coffee drinker for a long time. I couldn't figure out for the life of me how my peers were always so perked up around me when I felt like a zombie in the mornings. Their secret? Caffeine. It's like cheating at life. Many people opt for coffee, but I personally usually go for green tea or black tea. Not only does tea contain caffeine to perk you up, green and some black teas also contain L-theanine. This is a compound reported to boost focus and concentration.\n* **Are you able to keep the big picture in mind?** You speak about \"finding a good reason,\" and how you have none. I don't believe that. If you didn't have a good reason to do well, you wouldn't feel so bad about not doing well. Maybe you want to succeed in school to obtain a specific job or salary. Maybe you want to support your parents. Maybe you want to travel the world. I don't know what your reason is, but I'm very sure you have one deep down. Keep this big picture image of your life in mind. If you struggle to do that, keep the image in front of you... literally. Print out imagery, quotes, etc. and pin it up on a corkboard or wall where you can see it every day.\n\nThis massive answer basically sums up to making life easier for you. Right now you lack discipline because it's easy to lack discipline. Look after your body and mind to make making better choices easier. Look after your lifestyle because when your sleep, diet, and vitamin levels are in place, everything else falls into place much faster. Set up small systems that work for you and rely on them instead of intrinsic motivation. I hope at least some of this is helpful.", "permalink": "/r/DecidingToBeBetter/comments/mi3a63/i_want_to_be_more_disciplined_just_maybe_not_as/gt2t6zg/"}