{"id": "t5_2tand_t3_po8pe3_t1_hd1kp8g", "creation": 1631767901, "origin": "t5_2tand_t3_po8pe3", "height": 1, "replied_to": "t5_2tand_t3_po8pe3", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "hopefulsquash00", "text": "I was a waitress for 7 years, briefly worked as a care-aid (I don’t consider it a career, but I did go to school for it), have been at my office job for 10 years, and am now training to be a massage therapist! Considering also going into counselling as a secondary career.\n\nWorking as a waitress honestly levelled me up so much in terms of people skills. The carry over from that helped me excel as I’ve moved on.\n\nThe office work I came in with no knowledge other than my customer service skills. I’ve worked my way up by offering to do anything whether I knew how or not (with honesty in case they actually needed someone with pre-existing knowledge) and briefly dabbled in management before deciding it wasn’t what I wanted. That took my people skills and added assertiveness and confidence that I can hold my own as a leader.\n\nI’ve just learned to kind of try things, and figure it out as I go. I’ve also figured out that most people are also doing the same. The key seems be to owning what you do, and being responsible even if you make mistakes. Also, if I’m confused there is usually a YouTube video that helps me out haha\n\nI’m the first in my family to really deviate and go to school and it was a slow build to my current momentum as I honestly didn’t think I was going to be able to do more than hold down entry level jobs. I also had a bit of a turbulent life throughout my 20s, but I still managed to be a stand out employee despite the various train wrecks in my personal life. \n\nSo mostly just trial by error, being slightly competitive,  enjoying learning, and being okay with not knowing 100% what I’m doing.", "permalink": "/r/DecidingToBeBetter/comments/po8pe3/what_advice_do_you_have_for_someone_whos_turning/hd1kp8g/"}