{"id": "t5_2tand_t3_po8pe3_t1_hcxiq8m", "creation": 1631698102, "origin": "t5_2tand_t3_po8pe3", "height": 1, "replied_to": "t5_2tand_t3_po8pe3", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "donteatmyhotdog", "text": "Start saving now. Stop buying dumb stuff you're going to forget about in a month.\n\nIf you're not healthy mentally, you won't be healthy physically (at least not long term). Work to have a healthy mind.\n\nStds are real and you have a high chance of receiving one if you're sexually active. Especially Herpes and HPV. Be smart. \n\nIf you deal with insecurities, you will not magically grow out of them. You have to make the change happen. Practice being kind and forgiving to yourself in the same way you are (hopefully) to your closest friends. On the same note, if you struggle with jealousy, it is 99% of the time stemming from you not believing you're good enough. Plot twist: you are good enough.\n\nNever stop saying please and thank you. Everyone in the world is dealing with issues we can't see - it hurts no one to be kind. But also, don't let people walk over you or push your boundaries. The people that try to guilt you into doing what they want over respecting what you want ...KNOW they're trying to take advantage of you. You aren't being kind for eventually agreeing to what they want - you're being manipulated. It is common for some people to take advantage of your age groups stereotypical naivete. Knowing when and how to say \"no\" is a powerful tool in all walks of life.\n\nOh and have fun! Do all the things. Go to all the places. When you find that thing that makes you feel peace ..but also gives you that giddy joy butterfly feeling at the same time - listen to it, foster it, pursue it as a hobby or career. You won't be disappointed. (Mine is in the mountains, for example. I hike.... a lot)\n\nI really went off there... I'm about to be, 30 and wish I'd had and taken this advice into consideration at a much younger age.", "permalink": "/r/DecidingToBeBetter/comments/po8pe3/what_advice_do_you_have_for_someone_whos_turning/hcxiq8m/"}