{"id": "t5_2tand_t3_klmpok_t1_ghbn9kr", "creation": 1609188522, "origin": "t5_2tand_t3_klmpok", "height": 1, "replied_to": "t5_2tand_t3_klmpok", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "YardageSardage", "text": "Yeah, you've still got a lot to figure out, young king, but you'll get there. \n\nYou may find it helpful for you to think of the emotional responses you've gotten used to giving as habits. Habits can be extremely powerful in the ways they shape us - giving us an automatic behavior in everything from the words we use to our daily activities to the places our feet take us when we're not paying attention - and they can be really tough to change, but it's possible. You've gotten a couple of years deep into the habit of suppressing your own emotional responses, so it's probably going to take you a long time to not just stop automatically doing that, but figure out how to act without it. Be patient with yourself, and be brave, because emotional vulnerability can be damn scary, man! \n\nAnd that's an excellent question to start your thinking with. If you had to write down a list of words under the topic of \"man\" or \"manly\", what kind of words would you come up with? Chances are pretty high that the influences of general modern western (Americanized) culture would crop up at some point, stuff like \"strong\" or \"tough\" or \"muscular\" or \"provider\", but also stuff like \"unemotional\" or \"unfeminine\" or \"violent\" or \"angry\". \n\n[Here's](https://youtu.be/Cetg4gu0oQQ) a great ted talk I came across recently about masculinity and emotions. Or honestly, just google or youtube search \"men and emotions\" and take an assessing look at the kind of stuff that comes up. These are the influences that our culture has been having on you, in ways I reckon you probably don't even realize.", "permalink": "/r/DecidingToBeBetter/comments/klmpok/i_cannot_show_emotions_other_than_happiness_and/ghbn9kr/"}