{"id": "t5_2tand_t3_pywy9a_t1_hf0ljgp", "creation": 1633119701, "origin": "t5_2tand_t3_pywy9a", "height": 1, "replied_to": "t5_2tand_t3_pywy9a", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "campbell-1", "text": "I sincerely wish I had a magic formula to disclose here but sadly I do not.\n\nWhat I can say is that I spent +/-20 years in the trenches with the devil juice and I can't quantify a single instance where this translated to a tangible benefit to my existence. Sure, in the moment I thought I was having a helluva time, but hindsight is a great teacher. \n\nSo, *my* 'never again' was the culminating moment when too many negative overtones/themes associated with my presence on mother earth collided and it finally clicked that I didn't want to do life *this way* anymore. One scenario I faced at the time was that I am slightly career obsessed and have really high ambition to make it to the 'top' of my industry.  I began to explore the notion that my 'climb' would never happen if I was habitually ingesting depressants into my system.  I felt I was working against my own ambitions and not giving myself the best chance to 'make it'.  Also, if I wanted to mow the lawn I had to ensure there was a 12-pack in the fridge to aide in that process.  More times than I care to admit that resulted in me getting drunk while mowing the lawn and then passing out in my shop.  My participation to attend any sort of event (fall festival, concert, friendly gathering)  was contingent upon alcohol being a part of it.  I began to acknowledge my relationship was really with alcohol, not with the 'thing' that I was doing/attending etc. \n\nAnd the grand finale in Huntsville was at a wedding. As a gift, all the groomsmen brewed their own style of beer and brought it to the reception and it was all soo tasty.  While having casual conversation with some friends, a guy approached me and said, \"hey, that guy over there is also in telecom you should talk to him and see if you 2 can do some projects together.\" I got excited about the opportunity but I subconsciously faced the proverbial a fork in the road.  Instead of going left and talking with him about wireless telecom, I went right to refill my mason jar with some beer.  It was in that smallest moment when I went right instead of left when my world came crashing down and I said to myself that this is the last beer I'll ever have.  I felt so ashamed that I didn't even have the courage/ability to talk to another person about an industry I know everything about without having a drink 1st.  I said to myself, well, time for something new because this isn't who I want to be in the future.  \n\nFinished the reception, went back to the hotel for the night.  Woke up, had some of the shittiest cold French toast from some dumpy restaurant in town and over breakfast I casually told my other-half that I'm done drinking.  We both were like, OK if that's what you want to do it, you should do that.  And the rest (so far) is history.", "permalink": "/r/DecidingToBeBetter/comments/pywy9a/1460_days_have_passed/hf0ljgp/"}