{"id": "t5_2tand_t3_p0byal_t1_h85kw2r", "creation": 1628417297, "origin": "t5_2tand_t3_p0byal", "height": 1, "replied_to": "t5_2tand_t3_p0byal", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Lettuphant", "text": "Hey buddy, sounds like you have some neurodivergence. A lot of what you describe aren't issues that are internal, but issues trying to fit into a world and understand how other people behave. Almost like they got a book on how to do Life that you never got given.\n\nI'd recommend you do some online tests for autism spectrum disorder and ADHD. For ADHD, those with ~21 questions are often based on the official ones.\n\n\nThe reason autism or ADHD is my go-to here is that it often manifests as finding something That Works for social situations (in your case, humour) and then seriously analysing every conversation after the fact, thinking about how it should have gone or what you could do differently. This is not something neurotypical people do as standard, but very much how autistic, ADHD, or people with severe social anxiety caused by trauma move through the world.\n\n[ADHD means very low levels of serotonin, the brain chemical that lets you Do Things and Enjoy Things.](https://youtu.be/cx13a2-unjE) If you can sit for hours feeling guilt and shame about not doing something that should be easy, like doing the dishes of filling in a form, instead of just doing it, that's a sign. Same with finding an interest and then just losing it. \n\nYou may also want to Google \"Rejection Sensitive Dysphoria\" and see if it clicks. It is not a diagnostic for ADHD, but seems to be universally suffered by those that have it, and it fits some of what you've described.\n\nGenerally, it sounds like what you need is to talk to a mental health professional. Maybe see a therapist a few times. But I hope some tests will help you understand your own mind better.", "permalink": "/r/DecidingToBeBetter/comments/p0byal/i_dont_see_myself_ever_being_happy/h85kw2r/"}