{"id": "t5_2tand_t3_6hnpmn_t1_dj1asyf", "creation": 1497724652, "origin": "t5_2tand_t3_6hnpmn", "height": 1, "replied_to": "t5_2tand_t3_6hnpmn", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TelicAstraeus", "text": "The Ontario human rights commission has a policy which *essentially* states that if you refuse to use someone's preferred third person pronouns (which can be anything, by the way), and refuse to instead use their name, then you're violating their human rights. C-16 is new legislation in Canadian law which further reinforces the human rights tribunal's ability to enforce their policy.\n\nWhen Jordan Peterson made his initial youtube video stating his intention to refuse to cooperate when compelled to speak certain words, the university of toronto, advised by it's lawyers, sent Peterson a notification that he should stop as he may already be in violation of the law merely for expressing his intent to not use the pronouns. (canadian law makes employers responsible for their employees actions, so they are forced to send such letters in order to protect themselves - though from what i understand peterson isn't exactly an employee at this time,  I'm not 100% clear on the whole relationship technicalities).\n\nAs for the bathroom issue, I would like to suggest that you may have an incomplete understanding of the criticism of the matter. It is not that people are opposed to legitimate transgender individuals from using the bathroom of their preference - there's never been a problem with that sort of thing on a widespread scale. The issue is with predatory men entering women's bathrooms, and using the argument that they are trans, when they are not, as justification for it. Yes we have laws against predatory behavior, and this is still a chink in the defenses our society has constructed to protect women and young girls from predation. It is a complicated issue, and while I don't know where I stand on the matter legally, it is not as simple as \"conservatives hate trans people, and their actions against them through legislation makes them hypocrites\".\n\nAll that said, Peterson is not a conservative from what I've observed.\n\nedit: also\n\n> usually incredibly politely\n\nhttps://www.youtube.com/watch?v=1mzqtB1Dl1g\n\nEdit2: further, there are many trans people who have reached out to peterson himself and thanked him. They say that these social justice warrior types do *not* represent them, and they'd really rather this nonsense go away. It is just not as simple as you're making it out to be.", "permalink": "/r/DecidingToBeBetter/comments/6hnpmn/jordan_peterson_aim_at_the_highest_good_tool/dj1asyf/"}