{"id": "t5_2tand_t3_hjpjtu_t1_fwsynax", "creation": 1593783826, "origin": "t5_2tand_t3_hjpjtu", "height": 1, "replied_to": "t5_2tand_t3_hjpjtu", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "moeses201", "text": "Funny the more reports or a drug being euphoric, the more dangerous it becomes. Flualp is like alp but slightly more uhh... normal feeling? Off pure alp I was wrapped in a cloud of bliss, I feel like flualp gives me the anti anxiety properties and leaves me a little clearer headed then pure alp but then again now that I’m sober almost 72hrs and going back to music I’ve worked on or projects I’ve done I’m disappointed in my ear, it wasn’t as “clean” as I thought it was, a lot of things just wooshed past my head (in terms of engineering music to make it sound radio ready).\n\nAnd you’re right, it’s easy to say you’re gonna get stronger on a good day haha, it’s really difficult this morning when all I want to do is crawl in bed and sleep but I have an eight hour shift and then when I get home I know I’ll be fighting demons for a few hours before I blink to attempt sleep. It definitely gets rough, and I’m only on day three. I feel like I haven’t slept in days, I switch between extremely full and empty like on a dime, my energy levels go from great to dead in moments. It’s awful.\n\nI just know if I take a bar or rescind any of my previous convictions I’ll be disappointed in myself. Tomorrow is Fourth of July in America so they’re gonna be shooting off fireworks. I’m going to believe they’re shooting them off for me and my four day sober chip to get me through today and hopefully tomorrow. Someone said it gets easier on day four. I feel like I could handle this so much better if xans didn’t deprive you of sleep too.", "permalink": "/r/DecidingToBeBetter/comments/hjpjtu/my_last_dose_of_xanax/fwsynax/"}