{"id": "t5_2tand_t3_odwx2n_t1_h47gs9s", "creation": 1625548612, "origin": "t5_2tand_t3_odwx2n", "height": 1, "replied_to": "t5_2tand_t3_odwx2n", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "InnerHeart6", "text": "Hi lovely human, it doesn't sound like you are motivated by fear, maybe you need to see that differently? It sounds like what motivated you was wanting to create a better life for yourself, and taking life into your own control, because for so long, it was under others control. A shitty childhood is the epitome of something completely out of your control, unpredictable, unstable and naturally, in a shitty childhood, you are in fight or flight mode constantly because you are always subconsciously preparing yourself for trouble.\n\nI saw a quote once that really inspired me: “Being raised in an unstable household makes you understand that the world doesn't exist to accommodate you, which... is something a lot of people struggle to understand well into their adulthood. It makes you realize how quickly a situation can shift, how danger really is everywhere. But crises when the occur, do not catch you off guard; you have never believed you lived under a shelter of some essential benevolence. And an unstable childhood makes you appreciate calmness and not crave excitement.” ― Curtis Sittenfeld, The Man of My Dreams.\n\nIm not sure if this will resonate with you, but I think you need to see yourself differently, and instead of looking at your decisions as fear based, but rather, choices you made to give yourself the best chance in life which in my opinion, is super inspiring, something to take pride in and trust yourself wholeheartedly in creating the best life possible for yourself. It's so normal to feel that feeling comfortable is unnatural because you are so used to always figuring out the next thing, addressing the next issue and always looking for danger. Instead, maybe you could create positive challenges for yourself that aren't associated with problem solving. Maybe your next challenge, is taking care of you now that you have sorted everything you could. Accept that this will be a personal challenge as you haven't been shown how to do it by others, it will be uncomfortable and weird, but it's an area you need to grow in and address, and it's a healthy discomfort. Maybe you need to journal and use prompts to help you in unpacking this discomfort, get to the root of what you need, why you deserve to feel comfortable, and how to truly accept what you deserve. Therapy can help with this process, but you can do it on your own if you don't have access to this. Look up the podcast by Dr. Margaret Rutherford 'Self Work' she has incredible tips and advice from a clinical perspective. \n\nOn another note, embrace the discomfort and treat it as a wound healing into a scab, its a process, some days you will feel good, others maybe not, but above all, trust yourself, you are doing a phenomenal job!! Excitement/constant happiness is not a standard for normality, contentment is, and you are deserving of this. Discomfort is not a sign you have failed, but rather, you have been confronted with something you haven't yet addressed but cannot ignore. I wish you the best!!", "permalink": "/r/DecidingToBeBetter/comments/odwx2n/disconnected_yet_connected/h47gs9s/"}