{"id": "t5_2tand_t3_p1owzq_t1_h8g93is", "creation": 1628626240, "origin": "t5_2tand_t3_p1owzq", "height": 1, "replied_to": "t5_2tand_t3_p1owzq", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TrailingKat", "text": "Learn how to love yourself. Truly and fully. So that when someone you encounter and are vetting to be a part of your life treats you with anything less than respect, you will have enough self love to walk away for your own best interest.\n\nFall in love with yourself, first. \n\nFind hobbies. Fall in love and delve into something. Really nerd out. It may take a lot of experimenting to find what you like, and it may change as you get older, that's fine. Keep learning. Never stop. Keep learning about something you find genuinely interesting. Find something that fills up your emotional cup that you can turn to when you are bored, want to level up, want to enjoy you time,or whatever. Don't let anyone make you feel bad for your hobby and recreation activities. Find new people. There are plenty out there who share your interests. Don't limit your world and happiness because another doesn't vibe with your hobbies. There is a whole world you can enjoy. \n\nLearn about your past relationships with friends and family. I always suggest therapy. It's not for those who need it at a time in need. It's actually great on the regular for checking in with yourself. Understand who you are and talk it out with a third party. Understand what you want from others and from yourself. What are your expectations of your life, those who are part of your life, and those you wish to introduce into your life. Know who you are, what you offer, love yourself and know what you expect of others, its important to do inner work. Know thyself and all that right? \n\nExplore the different religions and spirituality. Understand what other countries are enduring right now politically. Even if only a little bit. Not to tout your worldviews, but to be in the know. Don't over consume media. Look into details and check facts. Form your own opinions and keep an open mind. Remember, not everyone who adheres to a certain way of life agrees to it. Often there is no route for escape, and even speaking out against it with someone trusted can result in much damage and harm. Don't judge. It isn't as black and white as it looks. There is a lot of grey area in life. Don't be afraid to explore it. And don't be afraid to not know what to think about it. You don't need to share your opinion on everything. It's smarter to listen and absorb. When it is time to speak you'll know.  Always ask questions. Don't feel dumb for asking. It's better than being lost in the conversation. Listening is a gift. To yourself, and to the speaker \n\nListen to what people are telling you.\n\nWhat are they telling you about themselves?\n\nHow do they speak about others? How do they move through the world ? Filter your friends more than your photos.\n\nDo it. Whatever it is, take the chance and do it. You never know if it will go good or bad. It's just an experience. You will get plenty more. Opportunities aren't available forever. Take it if you feel the tug inside you to do it. Do it. Trust yourself to catch you when you fall.\n\nNo one is forcing you. Unless their hands are on your person, no one can force you to do anything. Learn your rights. Stand up for yourself. Love yourself. You deserve it. \n\nYou deserve happiness.\nThere is enough sunshine in the world for everyone.\n\nIf you struggle, ask for help. When you see someone struggle, help them. It says more about the one who doesn't help the one in need than the one who is in need. Circumstances change all the time. Leave a trail of kindness behind you and know that it will be returned.\n\nWhen life gets harder and seems impossible to overcome, you've just levelled up. It won't get easier. You're onto the next stage of life. Learn new tools and ways to tackle life. Life is a bitch, she'll throw lots of curve balls. You don't need to swing at them all. Strategize and gain better insight on how to move forward with the challenge. It may disappear when you overcome, it may return and you will be better equipped to overcome, or it may last a lifetime.  Level up and know that you got this. \n\nHave fun. Travel, when it's safe to. Take care of your teeth, eat well, do yoga or find a fitness activity you enjoy to keep up with. Find one to make your hobby. Running? Yoga? Biking? Swimming? Pole dancing? Whatever. Get active and have fun. Love your body. It's your only home for the rest of your life. It can be your temple. But for sure it's your only sanctuary no one else has access to without your permission. Treat it well, and expect others to as well. \n\nYou deserve it.\n\nEdit: poke dancing seems non covid-friendly. Wouldn't recommend, also seems annoying. Would recommend pole dancing though.", "permalink": "/r/DecidingToBeBetter/comments/p1owzq/advice_youd_give_to_a_18f/h8g93is/"}