{"id": "t5_2tand_t3_p1owzq_t1_h8gbxe3", "creation": 1628627436, "origin": "t5_2tand_t3_p1owzq", "height": 1, "replied_to": "t5_2tand_t3_p1owzq", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bangbangurhead", "text": "As to encouragement, *coraggio!* More specifically, when you say this:\n\n> I want to make some changes in my life so I don't screw it up in future. Looking for some advice to improve in different areas of life\n\n..you are something like halfway there, already.  Many, many people live by accident / crisis / drama management - from one disaster to the next.  Luck favours the *prepared*.\n\nDon't believe everything you think.  \n\nPeople are mostly thinking about themselves, and so are you:  this means that it's a waste of time, mostly, or usually, to take offense at the behaviour of other people, because usually, or mostly, it's got little to do with you.\n\nThe quickest way to get rid of an enemy is to make her your friend.  In so doing, the world is changed for the better.  And, so are you and her.\n\nOnly read the headlines on the front page - I am from the newspaper and radio / TV era, but this translates perfectly to the internet age.  The largest-font stories are what you're being told to think about, so know what that is, because it's coming your way.\n\nDon't believe anything you hear, and only half of what you see.  See \"A Stone, A Leaf, A Door\" by Thomas Wolfe for more information, or any poetry worth the title.  Rumi.  Dickinson.  \n\nIf you read, incorporate the oldest and most important classics you can understand, and then some - challenge yourself with difficult reading.  You don't have to dive into Aristotle and 16th century Lithuanian liturgical texts, but push the envelope - Victorian novels, for example, require a stillness to absorb and have little of the instant gratification of some - some, mind you - modern and popular works.  Read the graphic novels, too, sure - but be sure to enjoy some of the higher quality media, whatever it is.  If it's film, be sure to watch the oeuvres of the likes of Fassbinder, Bergman, Kurosawa.\n\nI missed out on having children, and saying these things to a young person starting out is affecting me more than I would have thought it would.  Damned onions - but I have a business meeting to get to, and an obligation to honour.  A friend is helping me with a problem, and I'm not going to make him wait.  Take a lesson from that.  \n\nFor what it's worth, for asking with open heart and mind, I'm proud of you.", "permalink": "/r/DecidingToBeBetter/comments/p1owzq/advice_youd_give_to_a_18f/h8gbxe3/"}