{"id": "t5_2tand_t3_p1owzq_t1_h8huaeg", "creation": 1628653713, "origin": "t5_2tand_t3_p1owzq", "height": 1, "replied_to": "t5_2tand_t3_p1owzq", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "notafrequentflyerr", "text": "When it comes to relationships, don’t ignore your feelings. Relationships where you feel insecure aren’t worth having. Don’t wait around for years hoping someone will change or settling for relationships that are half assed. You’ll know if you feel secure in a relationship, but if you constantly feel uncertain, whether that by once a day, once a week, once a month, deal with the issue. That goes for platonic and romantic relationships. Also, once again for relationships, communication is essential. Know how to communicate when you are angry without being mean, and understand that it’s ok to have uncomfortable conversations.\n\nIn terms of romantic relationships, you get out what you put in. If you go into a romantic relationship in a unhealthy place and you already don’t value yourself and are struggling with insecurity and you haven’t got other areas of your life together, a SO is not going to fix that. The best relationships are made when two people who are healthy and can take care of themselves choose to be together, not when one or both partners is dependent, whether that be mentally or financially.\n\nAll that stuff about relationships being said, focus on yourself a ton. Get into hobbies and interests. Set goals, school goals, travel goals, career goals, skill goals, personal growth goals. Never stop living and valuing your own life.\n\nHave fun in school! I’m in school and I’m not going to tell you that it goes downhill once you leave because I don’t think that’s true AT ALL. But college is a unique experience that you won’t have again in the same capacity so take advantage. It is expensive though so also focus on your school work lol.\n\nLastly, don’t be too hard on yourself. Remember to have empathy for yourself. You are doing the best you can everyday. Doing the best you can does not mean exerting yourself to the furthest possible limitation, it just means doing the best you can do without straining yourself. Don’t put too much pressure on yourself to achieve something in a certain amount of time, everyone moves at their own pace and it is not a race.\n\nFor mindfulness, once again, trust your emotions. Your feelings are indicators. They may not always tell you facts, but they tell you where you feel worried, happy, angry, insecure. Don’t ignore that, learn to listen to that and take proper action.\n\nIn short, don’t put too much pressure on yourself. Just making this post, it looks like you’re trying and I’m sure you’ll do great. When you make mistakes, don’t look at them as failures or screw up, they are just stepping stones and you are learning, we never stop learning. As long as you are trying and putting a real foot forward(even though it gets scary sometimes and you can be clumsy with it) you’ll be ok!", "permalink": "/r/DecidingToBeBetter/comments/p1owzq/advice_youd_give_to_a_18f/h8huaeg/"}