{"id": "t5_2tand_t3_p1owzq_t1_h8fzeqh", "creation": 1628622103, "origin": "t5_2tand_t3_p1owzq", "height": 1, "replied_to": "t5_2tand_t3_p1owzq", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "anonymous-animal-1", "text": "**It is always OK to ask for help.** You will have to ask more than one person, and you will have to ask more than once, but always ask for help. I needed mental health assistance and encountered unhelpful people. But I was persistent, asked people and read books. Now I am way better off. My favorite helpful books: Feel the Fear and Do it Anyway, How to be an Imperfectionist, CPTSD by Pete Walker, and Adult Children of Emotionally Immature Parents (sounds mean, but helped me empathize with my parents and their flaws.)\n\n**Trust your gut - when you think you see a red flag, don't try to dye it pink. Get out of the situation.** Red flags include: the person not trusting you and your judgment, trying hard to convince you when you've already said no (whether it's to get a coffee or to get physical). Things that show up in RomComs are often very creepy in real life.\n\nAs my mother in law says, \"beware the friend you make in one day.\"  They might draw you in but they are often narcissists. Narcissists perform a cycle of idealize and devalue. They build you up and break you down. If you notice this happening, leave immediately. My life was nearly ruined by a narcissist.\n\nAlways be conscious of birth control, and keep it under your control. Only OK condom use if you can see the intact packet. Don't get or stay pregnant unless you choose to. And know that abortion is OK and surprisingly common.\n\nDon't get married in the first half of your 20s, or even the second half. My mom told me this. She got married at 22 and regrets losing the time to explore and form her own independent identity. My mother in law also told me this - she was married twice in her 20s and both were mistakes that she advises us against. It took me until my early 30s to feel like I was ready to be in a serious relationship.\n\nOH!!! And **SAVE MONEY!!!!** Learn about index funds and put money in them. You can do this very easily through Robinhood or TD Ameritrade. I would say put as much as you can in VOO (Vanguard SP 500 index fund). I really, really wish I had saved and invested more money. Put the money out of sight and out of mind and let it grow.", "permalink": "/r/DecidingToBeBetter/comments/p1owzq/advice_youd_give_to_a_18f/h8fzeqh/"}