{"id": "t5_2tand_t3_q3m6uw_t1_hg75rzh", "creation": 1633931698, "origin": "t5_2tand_t3_q3m6uw", "height": 1, "replied_to": "t5_2tand_t3_q3m6uw", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Procrastination happens because we think a task is too boring or too challenging. Procrastination is also a way in which our brain(aka subconscious mind)  prevents us from tackling our fears. eg. if I get anxious every time I have to study math then my brain will keep putting it off and completing my work.it might also result from deeper feelings related to the task, such as self-doubt, low self-esteem, anxiety or insecurity (these feelings reside in our subconscious mind)\n\nThen, there's self sabotage. it is when we actively or passively take steps to prevent ourselves from reaching our goals. This behavior can affect nearly every aspect of our lives.\n\nidentify your emotions feelings and thoughts when you feel that resistance and write down what you feel. come back to it after some time and evaluate those thoughts that you wrote down. this will help in finding the root cause of the problem. root cause is very important so that we can directly tackle the problem.\n\nyou said that you felt like something possessed you and that you couldn't resist it. Don't worry (it happens to everyone. for some people its more and for some its less)  ,its just your subconscious mind preventing you from doing what you should do because its scared of it or it thinks \"i cant do this it is so challenging\" so it will prevent your conscious mind from the task and will distract it with something unimportant like the internet etc. \n\nWhat can you do to tackle this ?\n\nwell, first go and check what type of a procrastinator you are (there are 4 types)\n\ngo deeper into your subconscious mind and take control instead of it taking control of you( check google for habits) i would recommend meditation because it has helped me. just do it 5 minutes everyday.\n\nget only 1% better everyday. setting very high expectations also makes us procrastinate\n\nyou should realize that, at its core, procrastination is about emotions, not productivity. The solution doesn’t involve downloading a time management app or learning new strategies for self-control. It has to do with managing our emotions in a new way. To rewire any habit, we have to give our brains what Dr. Brewer called the “Bigger Better Offer” or “B.B.O.” ( u can look into bbo more on google)\n\nOne option is to forgive yourself in the moments you procrastinate. In a 2010 study, researchers found that students who were able to forgive themselves for procrastinating when studying for a first exam ended up procrastinating less when studying for their next exam. They concluded that self-forgiveness supported productivity by allowing “the individual to move past their maladaptive behavior and focus on the upcoming examination without the burden of past acts.”\n\nmainly i think you need to try adopting new habits and getting out of your comfort zone because no pain no gain. it doesn't have to be that hard because when you find your root cause it helps you a looot. there are so many articles and videos that help. \n\nRemember, you are not the problem. its your subconscious mind. shortcuts don't help in the long run. Have a great day..", "permalink": "/r/DecidingToBeBetter/comments/q3m6uw/im_procrastinating_a_lot_i_cant_get_out_of_this/hg75rzh/"}