{"id": "t5_2qh1i_t3_1at1hr", "request": ["2399de9b-5f9f-4843-9623-c2d0014f1624"], "text": "I never really submit anything on here other than upvotes or downvotes, but today I have to get this out. \n\nWhile I was sitting in my apartment last night around 8 pm EST, I received a frantic phone call from my mother. Even before the phone rang, I had this horrible feeling something bad was about to happen, like foreshadowing of what I was about to hear. On the other end, I heard her shaky voice as she broke the horrible news to me. My extremely close uncle, who is like a son to my mom rather than her brother, took his life by shooting himself through the heart. We knew that he was going through some tough situations in his life recently (ending a 10 year relationship with his fiance), but we never suspected that it would be this serious. \n\nLike I said, my mom practically raised him. She was more of a mother figure to him than just his older sister. Recently, with his break-up, she watched over him very closely. She made him stay at my parents house for a week or so right after it happened and made sure to monitor his every move. She was so concerned that she even made him see a doctor and therapist as well in that week following.\n\nOver the course of this past week (about 2-3 weeks after the initial break up), he seemed \"fine.\" As always, my mom checked up on him, and eventually he began to stay at his home during this week. He always reassured my mom that he was doing much better, the medications were helping tremendously, and that he was making great progress in moving on. \n\nHowever, when she received a call from his next door neighbor last night that 6 police cars and an ambulance were at his house, her heart fell through the floor. She rushed over to his house, where she was met with a dozen officers, the coroner, paramedics and my uncle's very close friend. Apparently, she collapsed to the ground when an officer uttered \"I'm so sorry for your loss\"; it was the first time she really knew he was gone. Putting the pieces together from the coroner's report, my uncle's friend's account, and looking through his cell phone, we found that my uncle lay in bed and shot himself through his heart around 7 a.m. EST. He died instantly. He left no note and the house seemed lived in; not methodically cleaned like it was premeditated. \n\nI know this is long, but I am in utter shock. It's not real. What I want to know is what exactly goes through someone's mind right before taking their life. Obviously, I know that everyone has different reasons and thoughts for doing so, but I want someone to try to explain what goes through one's mind to get to that point. \n\nAlso, for those who survived a loved one's suicide, where do we go from here? We are so lost. Help.", "url": "https://www.reddit.com/r/AskReddit/comments/1at1hr/suicide_survivors_of_reddit_what_went_through/", "title": "Suicide survivors of Reddit, what went through your mind before committing the act? What stopped you? ", "social_network": "reddit", "user": "ArthurPineapples", "subreddit": "AskReddit", "subreddit_path": "r/AskReddit/", "up_vote": 3, "down_vote": 0, "creation": 1363969893, "permalink": "/r/AskReddit/comments/1at1hr/suicide_survivors_of_reddit_what_went_through/", "nsfw": false, "first_save": 1635416771.2617228, "replies_charged": false}