{"id": "t5_2tand_t3_otno2u_t1_h6x2tdl", "creation": 1627532140, "origin": "t5_2tand_t3_otno2u", "height": 1, "replied_to": "t5_2tand_t3_otno2u", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Onsight33", "text": "I would say you are definitely not as 'dumb' as you say you are. You are quite observant of your behaviors and people who I would categorize as 'dumb' are not very aware of those behaviors. \n\n&#x200B;\n\nHowever, I do understand where you are coming from and frequently in the past and in the present I have felt the same way that you describe. I too struggle with things that seem more 'simple' such as handling tools for the first time that others seem to do well with on their first go. There are some great comments below already for helping you to come to better terms with your behaviors and how you choose to cope with them. I think the comment below that says to keep a journal is super important as it will allow you to see what might be a pattern in your life. \n\nBut honestly, if I had to guess, I would say that you suffer from anxiety in some form. I think you put far too much pressure on yourself and you always are seeking the worst in your behaviors and performances. Take a step back and think about the skills that you do have. Maybe in your journal, write about what you are good at and what you enjoy. Because guess what? More than likely the things you are good at, other people would struggle with. That is a part of life. I would think about seeing a counselor or therapist to discuss this issue as they would have far better advice and techniques in coping with this. But to sit around and say you are no good at anything is obviously far from the truth. \n\nOne thing that has helped me tremendously with my anxiety and in coping with similar thoughts is to learn new skills and push myself mentally and physically. For example, I have been teaching myself Spanish for the past 6 months and while I have felt quite stupid at various times throughout this process, I have seen incredible growth, too. Language acquisition is something anyone can do if you put time and effort into it. It's also great for people who struggle with anxiety because you can actually see growth (of course if you put time and effort into it as I said earlier) when you pick up a book that you couldn't read before and now can, or when you can talk to someone in a different language. It of course is also awesome to have the skill of being bi-lingual or tri-lingual and many people admire that. It's truly incredible and I guarantee that you will begin to fight off the idea that you are 'dumb' or 'stupid' when you start to push yourself in this manner. Oh! And of course there are many studies that show the positive impact that learning a new language has on your memory and problem solving and focus. \n\nSorry to go on and on and I hope this makes sense. \n\n&#x200B;\n\nTLDR; \n\nI too struggle with this due to my anxiety. I have been learning a new language to help (but it could be any new skill). It works.", "permalink": "/r/DecidingToBeBetter/comments/otno2u/how_do_i_build_common_sense/h6x2tdl/"}