{"id": "t5_2tand_t3_nsawab_t1_h0llk4w", "creation": 1622832738, "origin": "t5_2tand_t3_nsawab", "height": 1, "replied_to": "t5_2tand_t3_nsawab", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "latraductoranerviosa", "text": "I've been roughly where you are, so let me try to give you some hope:\n\nWhen I was your age, I was severely depressed, had really bad alcoholism, couldn't hold a job. My life was an absolute nightmare. I couldn't envision anything like a future for myself. I expected to die at some point during that depressive episode, probably from drinking myself to death. \n\nI'm 32 now. In the time since that awful depressive episode (the worst I've ever had, and it lasted over a year), I've earned a college degree, started my career as a translator, stopped drinking, taught myself how to knit and play the ocarina, started teaching myself Russian (I translate Spanish, and have a minor in German and eventually intend to get my BA in German so I can work on translations in that language as well), started writing a book (which I don't intend to publish- I'm literally only writing it for myself, and I love it). \n\nI don't feel like any of my time was wasted in those years where I was lost and depressed. I learned a lot during those times, and I don't think I'd be where I am now had I not gone through what I did. Beyond that, I've learned to live with and accept myself, and especially my past. Wishing I could change any past actions or experiences is an exercise in futility, and it gets me nowhere. I've learned what I needed to learn from my past mistakes, and I will continue to make mistakes and learn from them until the day I die. That's really all life is: an ongoing series of lessons learned through mistakes, and problems to solve. The trick is learning not to let the darkness take control, to forgive yourself for your mistakes even if others won't or don't, to recognize that this is your life to live and that how others are living their lives has no bearing on your own. It takes time to rearrange your mindset, and it's important to recognize that *it's honestly okay* if it takes you a while. Few things worth having are easily or quickly acquired. So try to remove time from the equation, because life isn't a race. It's just life. And so many of us spend so much time ruminating that we fail to enjoy life for what it is. I'm still guilty of that sometimes, but I still refuse to give up on improving myself and the way I look at the world.", "permalink": "/r/DecidingToBeBetter/comments/nsawab/i_decided_to_be_better_and_now_i_see/h0llk4w/"}