{"id": "t5_2tand_t3_nadfr7_t1_gxukibi", "creation": 1620824784, "origin": "t5_2tand_t3_nadfr7", "height": 1, "replied_to": "t5_2tand_t3_nadfr7", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "throwawaayyyyy19", "text": "Thank you chef. Finding humor is something I hadn’t considered before but it makes sense. Whenever there’s a lull we usually crack jokes with each other and it’s pretty light hearted, but finding that balance between working as hard as I can, and not taking myself so seriously during rush hours is something I will work on. \n\nI think you correctly identified the issue, me acting as if “everything is under control”. I want to be seen as competent, but true competence is being honest and admitting my shortcomings, or being vocal about not knowing. I’m going to reframe my thinking, I want the team to look great, not just myself, not being vocal was very selfish of me I’m realizing. It wasn’t intentional, I would never sabotage anyone else for myself, but I also wasn’t being considerate, it’s something I need to be (and will be) conscious of and work on. \n\nI’m definitely cooking on my own, and picking up prep shifts, whenever they are available. I come in early and stay late, and I’m always bugging chef and other cooks about tips, experience, and advice. Luckily my eagerness is encouraged, I have a really good and supportive crew. Is there any cuisine you recommend that would be a good challenge? My world consists of a lot of Italian and American dishes. My next goal is to create a traditional Moroccan dish, and next make Vietnamese pho from scratch.  \n\nI told myself I’m going to stay here for a year at the most before applying to other places. I feel like that will give me enough time to be completely comfortable in this environment and be ready to tackle a new restaurant. \n\nThank you so much for your honest words and advice, it’s going to help me more than you know. I sincerely appreciate it and wish you all the best.", "permalink": "/r/DecidingToBeBetter/comments/nadfr7/landed_a_job_as_a_line_cook_my_goal_is_to_become/gxukibi/"}