{"id": "t5_2tand_t3_nadfr7_t1_gxv246b", "creation": 1620832763, "origin": "t5_2tand_t3_nadfr7", "height": 1, "replied_to": "t5_2tand_t3_nadfr7", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "someonefun420", "text": "Yep. Fully agree. \n\nI actually love cooking. I loved cooking professionally. There is a lot to love about being a chef. But a lot to hate too. \n\nLow wages no matter your experience. I can't even count how many places I worked and I was never paid what my experience was worth. This didn't just go for me but all of my coworkers at all restaurants I've worked at. \n\nI was a grill cook in a super busy restaurant with about 5 years experience and they paid me $12/hr + $2/hr for tip out and still told me I had to work harder if I wanted a raise. And by work harder, they meant start your shift 15 minutes early (unpaid) to prep your station.\n\nThese guys straight up lied to me when they hired me. Told me my wage was something else, and when I got my first pay it was something different. \n\n\nI worked at one place where the first cook was on salary for the winter hours (ski hill) and off salary in the summer (when it was slow).\n\nThis guy was the third down from the top. When he was on salary he would work super long days. He had no life. When he was off salary, he had no hours and made no money.\nI thought the point of a salary was to ensure balance!? Nope, this was to save the restaurant money. \n\nSexual harassment is common. So is drug and alcohol addiction. It's not partying, it's \"team building\"\n\nMost of the addicts I know have either worked in the industry or still do. \n\nThey expect you to do split shifts where you sit for 2 or 3 hours in-between your shifts. You work all holidays and always weekends. Often times they divide up your days off and trying to get more than two days off in a row!!?? Good luck lol. \n\nMany chefs are abusive as fuck too. And if you don't fit into the kitchen clique, look out. Can get pretty toxic when people don't like you and want you gone. \n\nI have cooked and roofed for approximately the same amount of time and I would go back to roofing before I would go back to cooking.", "permalink": "/r/DecidingToBeBetter/comments/nadfr7/landed_a_job_as_a_line_cook_my_goal_is_to_become/gxv246b/"}