{"id": "t5_2tand_t3_nf2v56_t1_gym88tl", "creation": 1621371684, "origin": "t5_2tand_t3_nf2v56", "height": 1, "replied_to": "t5_2tand_t3_nf2v56", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Targaryen-ish", "text": "Great! For weightlifting, I’d absolutely recommend the three most basic and effective compound exercises I can think of, which are squats, deadlifts and bench press. I don’t know how familiar you are with those, but technique is very important not to injure yourself when it comes to heavier weights, so I’d recommend starting really light and add weight in small increments each day of lifting. You’ll see results in strength increase in no time. I’d probably recommend 5 sets of squat and bench press with around 8 reps per set, for deadlifts I’d say 2 sets with 5 reps are good. \n\nNot much to say about cardio but to do what you enjoy! High intensity interval training (HIIT) is great if you’re low on time but want to get the cardio in anyway. \n\nFeel free to do both cardio and weightlifting on the same days initially, but as weights get heavier you’ll want to separate the weightlifting and cardio to separate days, otherwise you might hinder the gains in one or the other (and also, doing cardio before heavy lifting might increase the risk of injury if you’re tired before lifting). \n\nIf you feel like you want to squeeze in a third day of workout a week I’d recommend to go for weightlifting-cardio-weightlifting. Lifting weights improves most things that cardio do as well, and you can never go wrong with more muscle. Better strength overall makes cardio less risky in the long run as well by reducing the impact on limbs from running, for example. \n\nI could elaborate on all of this if you’d want, but I just threw this together right before going to bed. Hope it helps!", "permalink": "/r/DecidingToBeBetter/comments/nf2v56/five_weeks_in_a_row_that_ive_gone_to_the_gym/gym88tl/"}