{"id": "t5_2tand_t3_pxub03_t1_hetpnku", "creation": 1632986792, "origin": "t5_2tand_t3_pxub03", "height": 1, "replied_to": "t5_2tand_t3_pxub03", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Sontotajer", "text": "Dear stranger,\n\nI relate to your situation so much. I am/was your boyfriend in my relationship. Exactly like that, touching is not my style, showing affection is not my style, hugging my so out of nowhere is not my style. And I believed that. Truly. And I thought that's just the way I am. Me and my SO read the book the five ways of showing love or something like it. I understood the concept and I tried to show her love in her own way but it felt forced and fake.  It was only when I saw my mother lose her eyesight and trying sooo hard to see the letters in her laptop screen that something broke in me. My mother was in pain and all I wanted to do is hug her. It was a primal and strong feeling for me. After 28 years I got a real feeling to hug my mother. And I did. And it felt real. She even said you are hugging me different today. I knew that that it wasn't that it wasn't my style not to hug. It was the fact that I wasn't hugged as a kid. I wasn't shown physical love. If I don't know how good a hug feels why would I want to give it to someone? If I don't think I need a hug why would I think you need one?\nIt takes facing the pain within, facing the child that wasn't hugged enough. Seeing it in all it's pain and hugging it from the inside. And when we feel the warmth of a hug from a loved one, then suddenly it will become our \"style\". Because a warm hug is everybody's style as a kid. It should be the safest place in the world. When we don't don't get that as children, something in us shuts down. It doesn't disappear. It waits for us to return and shows us the love we needed then.\nNot everyone can do that, and it's the most important work people can do on themselves.\nYou deserve someone who loves himself first. Then he can actually love you. I know it hurts. And I know it seems like your life is over. Just know you are worthy of being hugged and that you are not TOO MUCH TO HANDLE. You deserve to be shown love. \nMake sure also you are also loving yourself and that you are not looking for other peoples hugs because you are lacking your own.", "permalink": "/r/DecidingToBeBetter/comments/pxub03/starting_life_over_at_32/hetpnku/"}