{"id": "t5_2tand_t3_pxub03_t1_herptvn", "creation": 1632948637, "origin": "t5_2tand_t3_pxub03", "height": 1, "replied_to": "t5_2tand_t3_pxub03", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Dnulde", "text": "I'm in a similar situation as your boyfriend. It can sometimes be physically and mentally painful to express love. I prefer to do it in my own way. My partner knows this but it doesn't always work for them. I compormised and started forcing myself to act as they want. It is sometimes unbearable and I feel like less of myself. As time has gone on, I increasingly feel resentful and isolated. As if I am being forced into exposing some deep part of myself. What is most painful is the knowledge that who I am naturally is not enough. \n\nMany of the comments I read say that your BF is not and should be putting in more effort. That he doesn't love you enough. That if he did, he would change and/or compromise. He is taking on the brunt of the responsibility here, and possibility unjustifiably. From your post, it sounds like he does express love when you seek it but that he is not forthcoming with it. Does he express it in other ways? If so, are his ways of expression and the sought after expressions enough? \n\nIt sounds as though he may already be compromising. If you want something else (if you want him to initiate for example) then that is perfectly acceptable. If this is not working for you and you want to leave then that is perfectly acceptable. I wanted to add my perspective because there is another side to all of this. There could be a \"Starting life over at \\_\\_\" from his perspective. The demand to express love differently can be just as painful as it is for you to not receive expressions of love. \n\nI am not trying to guilt trip you here. I am hoping that you'll see that your BF may be doing everything he can to make you feel loved and happy. It might be easier for some commenters to call your BF unwilling, uncompromising, or unaccomodating but that may not be the case. If you both understand each other then perhaps you can make it work. \n\nTo answer you question: Yes, I believe SOME people can learn to express love differently. Can your BF? I don't know. Can you? You describe your relationship as compatible in all but one way. From my experience, such compatibility is difficult to come by. You both will need to compromise to make this one point of compatibility work. If you truly believe that your BF is not doing his part while you are, then leaving may be best. \n\nTo address your concerns of starting over at 32: I started over at 30. It can be difficult while feeling impossible. But it is, in fact, possible. I have two friends in similar situations that have made it work and are now hapyy. There is no reason you can't do the same. \n\nPlease take this all with a grain of salt. I don't know you or your BF and one can only glean so  much from a few paragraphs. Whether you two decide to stay together or move on, I wish you both the best.", "permalink": "/r/DecidingToBeBetter/comments/pxub03/starting_life_over_at_32/herptvn/"}