{"id": "t5_2tand_t3_pxub03_t1_heu4p7j", "creation": 1633000059, "origin": "t5_2tand_t3_pxub03", "height": 1, "replied_to": "t5_2tand_t3_pxub03", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TrashPanda_808", "text": "I’m only 29, bisexual male, and my opinion may not mean much here but, I started to cascade down a very visceral drug infused path in my early to mid 20’s, one day after being tired of the lunacy and toxic relationships, and not recognizing myself in the mirror type of reality; I woke up walked outside and donated just about everything I had to a struggling family that looked like they were living out of their van just outside of my ex’s apartment bought a ticket with the last of my money and went home that summer. If it wasn’t for my Grams, who once went down a similar path,  I may not be alive today, or the very least one could assume that quality of life may be different.   She was in her late eighties by the time I came back and she was a lot of inspiration for me in my life, she actually taught me to read, taught me to cook, to achieve better outlooks when times were hard and then one day I came home and she was face down in the bathroom, blood everywhere, fucking horrific, I cried so hard that day. Sometimes I still do when things are incredibly stressful and I try to think about what she would say, at the time It felt like one of my heroes was taken by life’s cruel,  but natural embrace. \n\nThey way she had fallen, it was horrific and I still blame myself for not being there.  I know that’s not healthy, but I’m working through that. I mean It took me until just a few weeks ago to be okay with with seeing any amount of blood and not having to apply any psycho analytic techniques to keep me from going into a massive panic attack. \nMy therapist says I should not think in terms of what if’s, but it’s hard to ignore the “what if’s” when they’re extreme what if’s. He would also say we often let Trauma and depression dictate too much of our lives and it’s up to us how we move forward through these events. \nNot a lot people escape those kinds of scars, whether they’re self inflicted or pressed upon us. I’ve had a lot of friends who haven’t made it and a lot of those people I looked up to, people who I thought, “okay they can do it, I can too” and I even struggled to let it all go after I first came home and I was near suicidal. It’s hard to watch those people fall, people like my grandmother who believed in me to the very end.  Or losing people you believed were stronger than you and you look up to that and and every day feed off that. I still have suicidal tendencies. Even with a life that’s is far more wonderful than the one I was leading. \nI know One thing that really immediately helped me when I can home and dealing with my traumas and depression issues, aside from just being home and seeing my grandmother, was going to the gym, not to lose weight or achieve some societal status, but to apply a real level of dedication, something I had always struggled with in my life.  Just being hyper focused on my health and self thought really helped me get back to basics and reminded me of my humility and could look myself in the mirror and recognize that person again. \nI was working in kitchens and went to culinary school obtained a degree and and I had some really amazing opportunities.  I only wish Grams was a live to see that. She passed in the middle of my last semester,  if I hadn’t met my soon to be wife just a year prior to all that, my support system would have been so much weaker. \nI was in my last year in school, Grams health was getting worse and that’s when I met someone amazing and she was there for a lot of moments in just a two year span. \nWe were married during the pandemic, intimate judge led ceremony in the park just off the Pali. Now we have a regenerative farm in S. Georgia and three lovely crazy farm dogs and I’m about to turn 30. \nTo sum this all up, I had always been dealing with clinical depression and when I was fifteen I never thought I would live to see 21 and when I was 24 I never thought I would see 27 and looking back at this part of my life it taught me one very important lesson; being life is so fleeting it can take no time at all to screw it all up or turn it all around and restart.  \nI know it’s daunting, but you might surprise yourself with how resilient the human spirit can be and what a well focused human being can accomplish in a short period of time.", "permalink": "/r/DecidingToBeBetter/comments/pxub03/starting_life_over_at_32/heu4p7j/"}