{"id": "t5_2tand_t3_lgo2p5_t1_gmtde9o", "creation": 1612965141, "origin": "t5_2tand_t3_lgo2p5", "height": 1, "replied_to": "t5_2tand_t3_lgo2p5", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "keitothekraken", "text": "Thank you so much for sharing this. I love how self-aware you are. You have made some courageous steps to take care of yourself already by leaving an emotionally abusive relationship. That’s a victory. You’re also starting to recognize patterns of self-sabotage. Not everyone can do this...you’re so right. It can be difficult to receive love when you so strongly have these negative feelings about yourself. I’ve been there too. \n\nThe changes you desire to make are doable. However, it’s going to take a lot of work, discomfort and a willingness to forgive yourself. I have been working in being self-compassionate for only the last 2 years of my 32 years of life and it’s made all the difference in the world. I also can’t take all the credit...I’ve been going to individual therapy and couples therapy with my spouse, who also has had some significant traumas in their life. I can relate on wondering whether we would ever have a healthy relationship...and we are the healthiest we have ever been. \n\nIt’s so great to hear that you have a supportive partner. That makes a huge difference. However, we all create our own narratives. If you believe you do not deserve to be loved or cared for, you may have great difficulty believing it when someone else wants to show that to you. It sounds like you may be feeling some of that right now. Given your circumstances, this sounds normal. It’s hard. So very difficult. But there’s hope. It sounds like you’re willing to put in the work to make sure you can be a more loving and accepting person of yourself...and as a result becoming a healthier partner. \n\nI’m sorry if this is too preachy or I’m giving too much unsolicited advice. I just feel this so deeply because I’ve been there. I just wanted to tell you that it’s never too late :) help is there for you if you want it. I know it can be difficult to access therapy for some as well but I hope this is an option for you. Best of luck. You are so strong!!", "permalink": "/r/DecidingToBeBetter/comments/lgo2p5/can_anyone_with_mental_issues_actually_lead_a/gmtde9o/"}