{"id": "t5_2tand_t3_fcbam6_t1_fjdfj9c", "creation": 1583252152, "origin": "t5_2tand_t3_fcbam6", "height": 1, "replied_to": "t5_2tand_t3_fcbam6", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "coffeeTTTandthee", "text": "Ultimately, no matter how much you think, you will never come up with a solution that allows you to conquer human nature.  You can only practice by acting, failing, and opening yourself up to criticism.  You have to face criticism enough times to reframe both your relationship with criticism, and your emotional reactions to criticism.  \n\nNow, there is one thing I Do want you to think about - where did you get this idea that acting without thinking made you be selfish, indulgent, and rotten?  My guess is that these things were told to you, by parents, peers, or other authority figures, and for some reason you believed them.  I don't want to go all conspiracy theorist on you, but most adults you encounter as a child do not have your best interests in mind.  You are not a \"piece of shit\" as you so succinctly put it, but anyone who can watch you have the joy of a child and criticize you for it IS a piece of shit.  \n\nThink about it - how does acting excited about something make you a bad person?  For you to even feel this way shows that you have been failed along the way.  And, frankly, the only way you have \"failed\" parents, peers, and other authority figures is by not reading their mind and kissing their ass.  \n\nNow, you expressed that you were lonely trying things that appealed only to you.  And, you are right - if you do things that nobody else enjoys, then you will not connect with anyone.  And, it may be the case that you are that one-in-a-million, special person who  has hobbies that are not and will never be appealing to another person.  But, my guess is that you are not, but you are afraid that showing interest in anything will lead to criticism by a select few loud, outspoken members of society who are narcissists and like to shit on anything and anybody who dares to speak out.  It's easier to sit back and avoid being a target of the most outspoken members of society, but it comes at a cost.  But either way, in your mind, the end result is loneliness.  So, why not go down swinging?", "permalink": "/r/DecidingToBeBetter/comments/fcbam6/my_life_will_not_advance_until_i_have_a_mastery/fjdfj9c/"}