{"id": "t5_2tand_t3_fcbam6_t1_fjnqw62", "creation": 1583512810, "origin": "t5_2tand_t3_fcbam6", "height": 1, "replied_to": "t5_2tand_t3_fcbam6", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "coffeeTTTandthee", "text": "Hey man, I get it.  Now, you will probably come away from this next point thinking I'm an asshole, but I want to ask a simple question:\n\nCould it be that you are afraid of your own passion and excitement?  Could it be that you are ashamed of being different?  \n\nYou raised some struggles that many men face.  We, as children, are taught to tone down our excitement about things that are nerdy or deemed to have little value in the adult world, while being encouraged to be passionate about things that lead to a productive career and family life.  \n\nThe thing is, you can check all the boxes with traditional masculine athletic and academic achievements, but still end up alone and jobless.  It seems like you are stuck with this regret that you did not follow this traditional path, and now that you are not meeting your own definition of success (which, I would also argue, is something that was told to you), you are regretting not listening to the guidance to act like a traditional guy.  But, regardless of path, the outcome can be the same.  This is a false regret.  \n\nWhat is the difference in outcome?  It is passion.  You brought up this word, and your original inquiry was about chemistry, but I believe that chemistry is the natural outcome of internal passion which is manifested as outwards charisma.  The confidence and passion you seek is not a confidence gained from aggression and being the same as everyone, but instead is a confidence of being able to laugh at anyone who shames you for being different.  \n\nEven if you and another person like different things, it is this passion which attracts them, because it is an invitation to co-create using different mediums.  This is what playing is at the end of the day - the merging of different energies and imaginations.  \n\nAt the end of the day, it seems that you are ashamed of not being the same as everyone else.  But, being the same does not guarantee success, nor does it attract people.  Our parents and school, even if they mean well, teach us to be the same because that makes us easier to control.  Peers pressure us to be the same, because encountering someone different forces them to confront the fact that they are running from their own regret about chasing sameness.  \n\nWhat you have to truly believe is that by being passionate and sharing that passion, you will attract people AND opportunities.  Now, when you do this, you will also attract hatred and rejection, but this is the risk you have to take.  Hatred only hurts because you have been conditioned all your life to believe you will die if you do not have the universal approval of others, but this is just an overmagnified childhood self-preservation mechanism which you no longer need.  Instead, in adulthood, hatred and rejection are signs that you are doing things RIGHT.  \n\nSo, go and rediscover your passion.  Be brutally honest, with yourself and others, and quit wasting time running from or escaping the false regret of not being the same.  It is not too late at age 28.  I met my spouse when I was 28, and my spouse was the first person in my life with whom I went on more than two dates.  I also got my first adult job at age 28.  \n\nTL, DR: You find a mate and a job by doing two things - being shamelessly different and telling them how your unique difference can allow the two of you to co-create.", "permalink": "/r/DecidingToBeBetter/comments/fcbam6/my_life_will_not_advance_until_i_have_a_mastery/fjnqw62/"}