{"id": "t5_2tand_t3_fcbam6_t1_fj9ltvj", "creation": 1583153083, "origin": "t5_2tand_t3_fcbam6", "height": 1, "replied_to": "t5_2tand_t3_fcbam6", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "coloradoconvict", "text": "You don't understand how things work, so your decisions about what will or won't happen because of that incomprehension, are themselves not rational. You have assigned some labels to areas of human experience that don't come easily to you, or that you have no gift for, or that you don't understand - but the creation of the label merely gives you a mental handle for thinking about the underlying topics, which are far more complex than the label admits. It doesn't grant insight.\n\nLove is not something that one tries to achieve; it happens, or it does not happen, and it is not subject to our control. People who do have what you label \"chemistry\" sometimes go through life entirely without love, or find it and then lose it and live out the remainder of their days in sorrow.\n\nYour thinking at this point is choked with incorrect assumptions and wild predictions. \"There's just absolutely no escape from the fact that doing the things in life that would make me happy require this 'chemistry' thing that I do not have.\" Let's parse that.\n\nYou've never had the \"things in life that would make \\[you\\] happy\", so how do you know that they would make you happy? You don't. You hopefully assume. (A field report from someone who has had those things: they don't make you happy. That isn't how happiness works. There are people who are miserable in the bosom of their loving family surrounded by their creative triumphs, and there are people who are happy as clams sitting alone in cardboard boxes and thinking about rocks.) \n\nYou don't know that \"chemistry\" is required to get these things that you want. You hypothesize it. But your hypothesis is akin to a 3rd century Greek physicist thinking about atoms - by accident or luck you may grab onto a bit of the actual truth of things, but you'll die not knowing which bits of your \"knowledge\" were quaint folklore and which were actually pretty quotidian, if impressively premature, descriptions of the universe.\n\nYou don't know what \"chemistry\" is, so how do you know you don't have it? Maybe it's latent. Maybe you have such gobs of it that it is other people who are failing to resonate on YOUR wavelength, not the other way around. OK, these are probably not factual hypotheses - but they could be. Again, you don't know.\n\nThere's NO ESCAPE from the FACT that...\\[invalid term\\] \\[invalid term\\] \\[invalid term\\]  - so it isn't a fact, and we can't speak about whether \"it\" can be escaped because \"it\" is just your repeated propaganda against yourself. Your thesis statement is five subtheses that all evaluate to \"Nope\".\n\nI am not sure what positive steps you need to take to move forward in life. But I'm absolutely sure that you have to take a massive quantity of dynamite and blow your entire worldview and logical assessment of the human universe to smithereens - because, my young friend, you have built an enormous edifice of Wrong from an amazingly large number of bricks of Nope.", "permalink": "/r/DecidingToBeBetter/comments/fcbam6/my_life_will_not_advance_until_i_have_a_mastery/fj9ltvj/"}