{"id": "t5_2tand_t3_fcbam6_t1_fjmlqjv", "creation": 1583474458, "origin": "t5_2tand_t3_fcbam6", "height": 1, "replied_to": "t5_2tand_t3_fcbam6", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NauticalFork", "text": "Sorry about a later response. I'm just not sure what to do with my thoughts going forward, so it's a bit of a stuck mindset. \n\nI described myself as a piece of shit because I honestly couldn't think of a better descriptor for who I was at 21. I graduated college, got dumped, had all my friends leave for the suburbs to start families and adult lives with their spouses, I got an awful job, lost said job, was unemployed, had to move in with my parents out of fear that I would be a danger to myself. All of that before my 22nd birthday. And during that time after it seemed I lost nearly everything, I was useless. I lied to my family about looking for work. Sometimes I just sat on the couch and stared at the walls. Mostly I would just do whatever I could to detach from reality: excessive video games, excessive tv, excessive sleep, porn(of which any amount is excessive and morally repulsive), excessive junk food, etc. I was an awful person, and I felt like if that was the person I was able to become, then I didn't really deserve to have a job. So I remember that guy I was at 21, and that he's still just below the surface, waiting to come out as soon as life takes a bad turn again. Because let's be real: I'm 28, there are plenty of bad things bound to happen during the remainder of my life, whether they are my fault or not. \n\nAnd you know, if someone else had the same problems at some point in their life, I would probably show compassion and empathy. I don't think I would feel disgusted by them. But thinking back on myself during that time just makes me so horribly disgusted, because I know myself from firsthand experience. \n\nAnd for the other stuff, I'm just not sure. I mean, reality seems to suggest that being myself isn't really the best choice. My parents are great people, but they always told me from the time I was 13 or so that I would never get a girlfriend if I liked playing Pokemon. That girls will never like a guy who isn't confident. People who are into old books aren't cool or well-liked. It doesn't make any sense to want to be a comic book artist, and I should instead chase a reasonable career goal for smart guys like me, such as engineering or business. That girls like guys who are in sports, so on. They didn't necessarily stop me from doing what I had a passion for, but they warned me that following my passions would backfire. All those things kind of built up this idea when I was in high school that I needed to change who I was or accept that I wouldn't be loved... but I just couldn't force the change. I once tried to become a \"serious adult\" by throwing away all my art, and honestly, that killed my passion for it, but it didn't make me more of a serious adult like my parents or older brother, it just made me feel empty. \n\nBut again, my parents are genuinely good, caring people. Their warnings were spot on. Because loads of people in high school thought all my interests were lame and told me that no one would ever love a guy like me with no talent for anything cool or respectable. My parents gave me sound advice; I just didn't know how to follow it. And now here I am. 28, and with what to show for it? I couldn't force myself to become the kind of serious adult my parents and brother are, and now it's too late to be the young, happily married Catholic father I dreamt of being, just like my dad and brother. I'm stuck with an English degree that I'm passionate about instead of being stuck with a business degree that would make me more like my family. And I'm still not a good enough writer for that hobby to be considered legitimate. \n\nSo, sorry about the ramble after such a while. I just have complicated feelings on the matter, and it's difficult to reconcile right, wrong, being myself, not being myself. It's a lot of puzzle pieces that don't seem to fit together.", "permalink": "/r/DecidingToBeBetter/comments/fcbam6/my_life_will_not_advance_until_i_have_a_mastery/fjmlqjv/"}