{"id": "t5_2tand_t3_n4ef1u_t1_gww4873", "creation": 1620125278, "origin": "t5_2tand_t3_n4ef1u", "height": 1, "replied_to": "t5_2tand_t3_n4ef1u", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Smorriso13127", "text": "You are being very hard on yourself in my view 😂. That being said, improving your life is always a good thing. \n\nFirst of all, it is not a bad thing to have a \"shitty job\" in your early 20's. Remember, you are only three years into your adult life. You have untill you are in your mid 60's untill you retire. That is a lot of time to develop! Focus on making small gradual improvements to your life, and see how those improvements compound over time. \n\nMe personally, I didn't find my feet in my career untill I was in my early 30's. What changed the game for me was focusing on learning (as opposed to drinking, which was the main focus of my 20's). As soon as I began taking on jobs in which I had to focus on learning new skills, and continual development, my career skyrocketed, and has continued to do so, despite several set backs and obstacles.  \n\nSo in short, if you are learning new skills in your current job, you may be in the right place. If not, focus on job roles in which you can learn, and work on performing those jobs as skillfully as you can. \n\nIn reference to focusing on your fitness, that is a really good place to start. Fitness builds confidence and discipline, and also makes you a generally happier person. \n\nA good way to get into fitness, is by picking a fitness program, maybe reading the book, and performing the routine as written. \n\nSome good choices are:\n5/3/1\nThe greyskull lp\nThe juggernaut method\nCrossfit\n\nDoesn't matter which one you pick, just that you do something consistently for a long time, and enjoy it for the most part.\n\nReading is also a very good way of improving your career and mindset. It will also help to develop a more positive and optimistic outlook. A good place to start is the impact theory reading list.\n\nAgain, try not to be so hard on yourself. Life can be very good, it just takes some effort and smart thinking. Focus on making very slight improvements and see where it gets you. \n\nHope this helps", "permalink": "/r/DecidingToBeBetter/comments/n4ef1u/i_might_fuck_around_and_finally_get_my_life/gww4873/"}