{"id": "t5_2tand_t3_mqksob_t1_guhw3ha", "creation": 1618413893, "origin": "t5_2tand_t3_mqksob", "height": 1, "replied_to": "t5_2tand_t3_mqksob", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Korroboro", "text": "You are stuck because you’re behind in the number of failures achieved. You have not failed enough!  \n\nGo ahead and hurry! You need to fail a lot to catch up! Don’t you have big accomplishment to accomplish? What are you waiting for! Don’t you want to be the best?  \n\nImagine that your goal is to be the best pianist. Where do you start? What great pianist was perfect from the very beginning? None! Every one of them practiced day in and day out. What is the action of practicing about? A big part of it is to study how mistakes are made in order to understand how to avoid them. Making mistakes and learning from them is growth. If you have found a way of making no mistakes this last week, you have not grown.  \n\nI’m a one-to-one math teacher. In my class, I’m like a hunter. I set traps to see if my pupils take the bait. But I’m a nice hunter. Whenever a student falls in my trap, I teach them what the trap was about and I teach them how to detect the trap. Then I set my traps again to see if they are able to avoid them without my help. If they fall, we repeat the cycle, refining their skills, until they excel. The mantra of my classes is “Failing is fine. Failing is part of the learning process.” Once they embrace their failures, once they know how to fail and be fine with it, they start learning a lot.  \n\nAvoid this sequence: “I failed --> therefore, I’m a failure. I’m worthless.” Instead, adopt this alternative sequence: “I failed --> How did I fail? How can I avoid failing in this way? How is this failure useful for my purpose? This has turned out to be an interesting challenge. Hmmm!”  \n\nBeing extremely hard on yourself is a desperate attempt to control yourself. It is also counterproductive. You feel you can’t control a deteriorating situation, so you get harsher in a desperate attempt to make yourself move into action to follow the plan, using self hate as a punishment. The result is anxiety.  \n\nTo your brain, anxiety is an alert: something bad might happen. Let’s go back to the pianist example. You might confuse yourself by thinking that you are afraid of failing while you practice, because failing is unacceptable. This narrative is confusing because it is deceptive: it is a lie! Watch closer. The sequence is: you try your best --> you fail --> you scold yourself completely out of proportion, in what can be categorized as torture. What are you afraid of? Your inflexibility. Your scolding. Your judgement. Your comparing yourself to others. Your name-calling. Your arguments to convince you to feel disappointed of yourself.  \n\nSo now, practicing piano has become very difficult. There’s a threat. And the threat is not the mistakes you might make.  \n\nHear this: you will never be perfect. You will never, ever, reach perfection.  \n\nThe best pianists are not perfect. You might see perfection. You might hear perfection. But pianists themselves know that their execution isn’t perfect. The trick is that their interpretation is so near to perfection that you cannot notice the imperfections.  \n\nSo demanding perfection from yourself is cruel. Please stop being cruel towards yourself.  \n\nInstead, embrace your imperfections. Don’t be afraid of them. Touch them! Feel them! Know your imperfections up to the point where you can see how to polish them. Make it your goal to optimize by minimizing and maximizing. But never make it your goal to be perfect. Never demand the impossible from yourself.  \n\nFrom now on, instead of finding arguments to hate yourself and feel disappointed of yourself, strive to find reasons to accept yourself as you are.  \n\nSee what actions you take and what actions you avoid taking, and see the results. Do this without judging yourself, without comparing yourself to others, without scolding yourself. Just watch. “I did this and this was the result.” “I avoided doing that and that was the result.” That’s all.  \n\nDiscipline can help solve your issues, yes. But not discipline as an imposition. Discipline is a freedom, a power that you give to yourself as an act of love. In a way, discipline is like a sport: you train for it, little by little; kindly.  \n\nPlease feel free to ask the questions that might arise after reading this.  \n\nI hope this helps.", "permalink": "/r/DecidingToBeBetter/comments/mqksob/i_can_finally_put_words_on_my_main_issue/guhw3ha/"}