{"id": "t5_2tand_t3_p8p1i2_t1_h9sdmjf", "creation": 1629553370, "origin": "t5_2tand_t3_p8p1i2", "height": 1, "replied_to": "t5_2tand_t3_p8p1i2", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "greebledhorse", "text": "I dunno, I wouldn't say I'm perfectly adapted to dealing with rudeness and so on, but it could be helpful to lead with good faith and then try not to be surprised if you're disappointed, just figure, \"Ah, so it's going to be like that\" and change tactics to fit. And then once you've dealt with the situation that's gone wrong, your energy is free to invest in new situations that could work out better.\n\nA trusted friend recently started ghosting me out of nowhere, and like, of course it's upsetting, but I kindly told them to get back in touch if/when it was a good time and unfollowed them on social media so I don't have to keep seeing their posts while they're still deciding. I do not want to mess with ghosting. Holding onto an image of what things were like before is only going to get in the way of how things are, how my friend is actively showing me that things actually are. I'm open to the possibility that once my friend takes some time to think about things they'll get back in touch and we can talk about what happened, including the ghosting. I'm open to the possibility that the issue is more about stress in their life, and how intimidating it is to have a hard conversation, than anything malicious. But I still deserve to protect myself, and the thing to do when someone is hurting me is to accept what's happening and move out of firing range, even if I would have trusted them before I got this new evidence. \n\nI don't know if a story from Christianity is up your alley or not, but I'm remembering a story from the Bible where one of the disciples is indignantly telling Jesus about a thing somebody did. Instead of getting into a life lesson or a parable about the best way to be in the world, instead of taking it really seriously and unpacking how that person's rudeness falls short of godly living or whatnot, Jesus just says he actually isn't surprised at all that a person would do something rude. Like, sometimes it's not that deep, sometimes people are just rude, everyone has a terrible capacity for it and that's just how it is. \n\nSorry to hear that life keeps punching you : (", "permalink": "/r/DecidingToBeBetter/comments/p8p1i2/how_did_you_accept_that_the_world_is_not_as_nice/h9sdmjf/"}