{"id": "t5_2tand_t3_puf0ea_t1_heh34ps", "creation": 1632752441, "origin": "t5_2tand_t3_puf0ea", "height": 1, "replied_to": "t5_2tand_t3_puf0ea", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "trtlclb", "text": "Nobody has a perfect diet and exercises all the time. There isn't a problem with falling off here and there for a day or two. It sounds like your issue is once you have one of those days/weeks you decide it's not worth getting back on the horse. Is your expectation deep in your mind that one day you can just go back to what you were doing before? That little mental seed will grow over time into a tree, so it's better to look at it as if you're making long-term changes to your habits, not potentially temporary ones. That will help you kick it back into gear when you're ready as opposed to simply forgetting about it after a few days or so of not keeping the habit going.\n\nFasting can be very beneficial for the mind and the overall health of your body. Intermittent fasting (what you're describing) is a good way to do it, you can also do a weekly 1-day fast (I like to relax and avoid eating anything on Sundays) and some people take it to more of an extreme and go a couple days, which apparently has a slew of additional benefits. I haven't done that in awhile myself, though.\n\nWhy do you feel like you aren't capable of putting in hard work? Maybe you have \"worked up\" hard work in a way that it seems like something you can't do. Everybody starts working without understanding what they're doing, and it's not like your employer will expect you to come out the gate a superstar. It takes some time to learn the ropes and figure out what \"hard work\" is in any given job. They will be expecting to help you figure most things out along the way if it's your first job, and that's totally normal.\n\nMany people struggle with body-image issues. When I was younger I did as well. The thing about a job is they only really care that you can help them with the work. Very, very few jobs care about an applicant's looks. It might help to get out there and in front of people more, though, because then it will be less intimidating. A little hard to get started, yes, but well worth it in the long run.\n\nWhen you were making a list of hobbies, what were some that you were really considering pursuing?", "permalink": "/r/DecidingToBeBetter/comments/puf0ea/how_to_deal_with_depression_without_going_to/heh34ps/"}