{"id": "t5_2tand_t3_qbwqmh_t1_hhcm31l", "creation": 1634730131, "origin": "t5_2tand_t3_qbwqmh", "height": 1, "replied_to": "t5_2tand_t3_qbwqmh", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Agreeable_Rooster_28", "text": "It seems like you've done a lot of positive things for yourself and achieved a lot of external success but there is some work to do internally (as we all do!). I have had a similar problem to you and I recently made a bit of a breakthrough so I'll just share my perspective. I realised that though I achieved all of these things, I still wasn't proud of myself. I was pushing and pushing, thinking that this was self-care, but actually it wasn't. My internal thoughts were harsh and no matter how much I would do, my inner voice would always say \"you should do more, you should have done this ages ago, you should do this, you should do that, you're embarrassing, why can't you get it right\". It was very punishing, and disappointed. And this is no way to live, and no way to treat yourself.\n\nYou may balk at this, but the key is self acceptance. Self-love, even. You need to give yourself a break, treat yourself with a lot of compassion and be proud of what you have achieved. I am sure there were many obstacles and barriers that you have dealt with on your journey, and still you persevered. You do not need to be perfect to deserve happiness! You do not need to be perfect to deserve happiness! You have listed so many great achievements and efforts but still I sense a feeling of \"I am not enough\" - and I assure you that you are! Your worth doesn't depend on all of these material things, though they do need to be maintained to make your life easier. This is why you may have noticed some of your friends being happier whilst doing less. I think its more about the relationship you have with yourself rather than external things - though they do play a small role and can make life more comfortable\n\nAlso, I did CBT too and this helped me to get back on my feet when I was heavy with anxiety and depression for little amounts of time but I felt like it wasn't able to tackle the root of my emotional problems. I found psychoanalytic or attachment based therapy really helped me get to the root of why I wasn't happy. I would highly recommend giving it a try if you are interested.\n\nI hope this is helpful, forgive me if I've unintentionally said anything untoward. You can do it!", "permalink": "/r/DecidingToBeBetter/comments/qbwqmh/i_feel_like_absolute_crapive_done_a_ton_of_work/hhcm31l/"}