{"id": "t5_2tand_t3_20y33y_t1_cg8c0vq", "creation": 1395417667, "origin": "t5_2tand_t3_20y33y", "height": 1, "replied_to": "t5_2tand_t3_20y33y", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "audacias", "text": "/u/STFUandLOVE and /u/Shizo211 hit the nail pretty much on the head here. I'll tell you a quick story though that might help: \n\nI was walking once with my headphones in (this also relates to #59) when I passed a small old woman holding a feather. She was standing by a parking meter, looking sort of lost, holding this feather out to the busy students who passed her by. After passing her, I held for a moment, then removed my headphones and walked back to her. \n\n\"Thank you,\" she said, \"Nobody ever stops. I was just wondering what kind of feather this is?\" It looked to me like it was a seagull feather, but she thought it was from a bald eagle. \"I'm keeping it,\" she laughed as she tucked it into her handbag. \n\nShe told me she was visiting her grandson who was going to the same university as me. I asked her how long she'd lived in the city, she said since she was born - she'd never moved. She told me about the city I know only from old black and white photos - the streetcars, the neon lights, the \"golden age\" of movie cinemas. She remembers a different city skyline than I do. \n\nOver fifteen minutes or so I got a good Sparknotes version of her life. There are so many infinite intricacies I could never find out, but through a brief conversation a stranger who I or many people would usually have passed by became more known to me. After talking, I left my headphones out and kept walking, with a big smile on my face, thinking about her life and how ours just intersected for this brief time, if we would ever meet again, and who I would meet and learn from next. \n\nNot all people are willing to share their story, not all people want to talk to strangers, there are people who keep theirs in a locked box. This could be for any number of reasons and should be respected. Particularly war stories I imagine would be difficult to share - my grandparents have never told me about what happened to them in the war. But if you ask the right questions and listen the right way, you'll hear some incredible stories from fascinating people. \n\nEnjoy!", "permalink": "/r/DecidingToBeBetter/comments/20y33y/i_made_a_list_of_100_things_ive_learned_so_far_in/cg8c0vq/"}