{"id": "t5_2tand_t3_madmt0_t1_gru8jbu", "creation": 1616437685, "origin": "t5_2tand_t3_madmt0", "height": 1, "replied_to": "t5_2tand_t3_madmt0", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "bownsyball", "text": "Of course, and I'll probably be making some assumptions here that you'll have to forgive, but it just sounds like this issue comes from some deep insecurities about not being enough for other people either creatively or personally (certainly not the only one on planet earth with these issues).\n\nWhen your only goal is to appeal to others many people don't see that as genuine and are put off, or worse yet, you'll eventually attract someone who might take advantage of that.\n\nMeditation is many things, and can be used for many things, however in it's simplest forms it teaches you how to know yourself better.\n\nLiterally, just sitting alone with yourself and noticing your own thoughts will help you do this.\n\nKnowing yourself -> loving yourself - if you can do a good job of that you'll be more of a  genuine person, and often times being genuine is attractive and cool enough to outweigh what ever else is still rough around your edges that people might find \"subjectively not a good fit.\" \n\nYou said in a comment further down that you want to love and be loved, be desirable, worthy, and accepted. Give that to yourself first. Before you go looking for it. You don't need a group of people to give you permission first. You really don't. And often when the chips are down, friends may flee, and partners may lie, all you have again is you alone, deciding if what someone else has to say about your 'worthiness' matters or not.\n\nI see meditation as the most direct path to knowing and being comfortable with who, and what you are. I know this isn't an answer with concrete steps but I do think it's an answer that gets to root of many problems.\n\n15 mins in the morning 15 mins at night ?\n\nNetflix has a short series that teaches you about it and guides you into some practices. It's called headspace.\n\nI hope this helps explain what I was getting at. What do you think?", "permalink": "/r/DecidingToBeBetter/comments/madmt0/my_entire_life_ive_hated_that_so_much_is/gru8jbu/"}