{"id": "t5_2tand_t3_enur0a_t1_fe92hgi", "creation": 1578933442, "origin": "t5_2tand_t3_enur0a", "height": 1, "replied_to": "t5_2tand_t3_enur0a", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "vanishingtact", "text": "> Yes, as a method of control. That may work out good or bad in the short term, but in the long run that's precisely the dynamic it establishes: her controlling him by threatening to not love him anymore. If the current issue if resolved, that dynamic remains established for the future and will resurface again the moment she wants him to be act different or look different from how he is - why wouldn't she do it?\n\nSo what's your point? Just because someone could hypothetically use the threat of divorce to manipulate their spouse into doing whatever the manipulator wants doesn't mean that's what is happening here. And the fact that manipulative people exist doesn't mean that people in a relationship aren't allowed to have and communicate boundaries for themselves and standards for their relationship as we've seen with OP and his wife. What you're describing is abuse, to be sure, but what OP describes is not. \n\n> Well literally the very idea of commitment is that you stick with your partner even when times are tough\n\nSure, but commitment doesn't always mean letting your partner do whatever they want and accepting everything. OP's wife is helping ensure that their relationship will actually survive these tough times by being clear about what she needs and expects in order to be able to continue.\n\nAnd yes, I do believe that expecting your loved ones to accept poor treatment and behavior simply *because they love you* is adolescent fantasy. A more mature perspective would be to accept that fitting two individuals together for life is a difficult task and requires constant effort and often change. OP seems to recognize this.\n\n> I think you can admit, if you're honest, that a woman in OP's position making this post would face an overwhelming consensus of 'you deserve a man who loves who for you who are unconditionally kween, you can do better than someone who only thinks of themselves in YOUR time of need.' I know this hypothetical to be the case, I'm sure you do too if you're honest with yourself. YOUR comment would be downvoted like mine was if the genders were flipped\n\nOkay, is that what all this is about? Frankly... the number of upvotes a post gets doesn't impact how (in)accurate or (un)insightful the post is. So what if I would get downvoted if the genders were swapped? Seriously, how does that change what I'm saying?\n\n> Ever think..a relation*ship*...is a lot like an actual *ship*? <thinking-emoji>\n\n> *cringe*\n\nUh, feel free to pretend I used a different analogy if this one makes you feel uncomfortable", "permalink": "/r/DecidingToBeBetter/comments/enur0a/i_finally_actually_listened_to_my_wife/fe92hgi/"}