{"id": "t5_2tand_t3_mpxuog_t1_guczhsg", "creation": 1618314410, "origin": "t5_2tand_t3_mpxuog", "height": 1, "replied_to": "t5_2tand_t3_mpxuog", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "UnendingQuest", "text": "What do you mean by a worthwhile hobby? \n\nIf you actually get enjoyment from watching Youtube and eating snacks and watching porn, then that's what you enjoy doing and it's alright to spend some of your time doing those things. If deep down you find them depressing and want to find other things in life you might enjoy, start spending some of your time trying new things.\n\nIt might benefit you to stop thinking about the things you do in your day in terms of \"good, boring, hard things you don't want to do\" and \"bad, procrastination things you do to avoid doing the hard things or as a reward for doing the hard things\". Doing things you enjoy can just be a normal part of your day, just like doing the things that have to get done. Its doesn't have to be a cycle of restless procrastination, struggle, hollow reward, repeat.\n\nMaybe it would help to lay out what you would need to do everyday to have a life that, to you, would feel responsible and good and like you're taking good care of yourself. Then note when those things would need to happen if any of them are time dependent. Next, fill out what you days should look like, being sure to include some time for relaxation and doing things you enjoy. Having some idea of what you should be doing and why (i.e. to have a good life) will help if part of the issue is not knowing what you should be doing at any given time.\n\nWhen it comes to actually making the choice to do the right thing, it really is just a matter of will power and conscious focus. There are some tricks that can help:\n\n- Start small. Pick one smallish (less than 30 min) thing you ought to be doing and commit to doing it everyday for a week. Once you successfully complete the week, add another thing. \n\n- Use timers. Its amazing how much you can get done in 15 to 30 minutes if you just get started and focus. Try doing 15 minutes of a thing you normally avoid, then 45 minutes of distraction / relaxation. Over time, increase the focused time and decrease the breaks. The \"focused time\" can include working on a hobby!\n\n- Start learning and practicing meditation. It helps you quiet your own mind and slow down enough to calmly make good decisions.", "permalink": "/r/DecidingToBeBetter/comments/mpxuog/how_do_you_teach_yourself_self_control/guczhsg/"}