{"id": "t5_2tand_t3_or0633_t1_h6gg6d5", "creation": 1627203334, "origin": "t5_2tand_t3_or0633", "height": 1, "replied_to": "t5_2tand_t3_or0633", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "OceanTumbledStone", "text": "Hey this is really interesting to me. I was way less focused at that age too. But I was not really into what I was doing. Until I got a computing degree and career I didn’t really settle into anything, or seem overly committed. The managers could tell and I think it frustrated them as I did have the potential to not just go out all the time and giggle and chat etc.\n\nIt all changed for me when I really cared about what I did and started to see wage increases and what freedom that opened up in my life.\n\nDo you like where you work and do you see yourself doing it more longer? \n\nI don’t know if the being fun bit is a problem? Or do you think you’re maybe distracting others at work with the joking and goofing off? If you’re just fun and enjoying life at times then that can be refreshing actually. But not if it’s like in school with someone being naughty at the back and getting others in trouble! I used to chat too much in class… and I’ve been in places where I hung out with the more “rebellious” people and ended up being advised about that affecting my work and how I’m seen.\n\nBut now for me, at nearly 40, spending all my life so worried about appearances at school and work, I kind of wish I wasn’t so serious at work and could relax and “play” more. I think people actually like that, and I’d have more friends, as long as you still get the results and the job done. I’m different outside work but the two personalities have started to merge together too much. And life is so short. So I wouldn’t recommend just becoming super serious and worried and not allow time for fun. There are some good books about the importance of play at work too. Charlie Hoehn for example.\n\nYou’re still young, I had only just started my career at that age! I guess you could write out your goals. What do you want? To move out? So how much do you need to earn monthly to do that. Do you want to save up to buy a house? Would it be best to stay home and save up instead of paying on rental, or are there other reasons to move out? \n\nAnd have you spoken to your manager about this being the real reason you’re not getting promoted higher? Have you expressed that you want to progress and to what specifically? Will reducing your goofing off at this company lead to that? I do think it’s good to put a lot into what you do, especially since they’re paying you to be there - but not to the detriment of health, social life or burnout. Just within the reasonable hours you do, not to an extent where you just break and end up resenting it. I guess it’s always balance as usual.\n\nMaybe you’re comparing yourself to others online, that’s easy to fall into. Someone always seems more successful in that way.\n\nInterested to hear and see how this goes for you. I’d love to have 10 extra years to plan how to get a property sooner for example. It only happened for me this year because I didn’t prioritise it early enough. Same feeling will happen with my pension I expect. But I’ve had a lot of fun experiences over the years too. \n\nGood luck!", "permalink": "/r/DecidingToBeBetter/comments/or0633/i_dont_know_how_to_mature/h6gg6d5/"}