{"id": "t5_2qh5i_t3_n3lhbf_t1_gwul92y", "creation": 1620087908, "origin": "t5_2qh5i_t3_n3lhbf", "height": 1, "replied_to": "t5_2qh5i_t3_n3lhbf", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SpiritOfAnAngie", "text": "Oh man, all day every day, whatever I could get my hands on. Any opioid and no idea how many mg of me talking because I’d just pour 3-6 pills in my hand at a time then take two 2mg Xanax bars. Sometimes more than that even. I’d not remember phone calls I made, texts I sent, appointments I’d made. I’d tell my husband “hey look a new episode is on! Let’s watch it!” And he’d be like “you’ve said that three times and I’ve told you three times that we’ve already watched it..” he’d get so frustrated with shit like that. I completely ruined two holiday seasons that I don’t even remember. Completely embarrassed him and myself in front of family. I was a total train wreck.. gained so much weight, stopped taking care of our beautiful new home, like, I literally cared about nothing else. \n\nThe worst part was me realizing the pain of feel not taking the meds was actually withdrawal pain and not pain associated with my autoimmune disorder like I had originally thought. So my husband literally took all my meds and hid them from me long enough for me to sober up enough to be able to hear him and actually take in that I indeed have a huge problem. And still it took me about a year to believe him and start to take action for myself. My drug abuse never got as bad as it did after he first talked to me but I was afraid for a long time that I couldn’t live a good quality of life without them. But that’s addiction for ya. You lie to yourself without even knowing it or realizing it. But once I saw and felt just how physically dependent my body was on these meds it scared the shit out of me. I thought that because my meds came from doctors that it was okay. WRONG!!!!! And so now I’m on a list so no matter where I go, all pharmacies know not to fill narcotics for me.", "permalink": "/r/happy/comments/n3lhbf/the_first_photo_is_me_off_benzos_and_opioids_for/gwul92y/"}