{"id": "t5_2qh5i_t3_n3lhbf_t1_gwuv0qn", "creation": 1620092653, "origin": "t5_2qh5i_t3_n3lhbf", "height": 1, "replied_to": "t5_2qh5i_t3_n3lhbf", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SpiritOfAnAngie", "text": "Looking back it makes me feel sad that I treated my poor body in such a way. Now I try and just do the opposite of what I did during those dark years. I apologized A LOT and I realize now through a near death experience I had during an overdose (that was going to happen sooner or later mixing two such dangerous drugs at such high doses) how much I truly matter and that no matter what, all of us really, will always be okay. Life just feels so much more simple now. I feel like me getting this autoimmune disorder that sort of brought on this whole ordeal, that I resented, that made me feel sorry for myself, made me mourn my old life etc. has actually been a HUGE blessing in disguise. It for one brought me to my husband. This man took me to Hawaii and married me on the beach and one year later took me back, played our wedding song and again danced barefoot with me in the same exact spot on the same exact day at night under the stars.. like hire romantic!! It allowed me to slow waaaay down in this world that moves so fast. Sometimes like a weirdo I go and sit in my front yard under my big tree just to get some sun. I actually saw an earth worm the other day! First time I’ve seen one in AZ!(I’m from Minnesota) I also go to the park and feed the ducks. My husband taught me how to snowboard!! It kill’s me the next day but the pain always eventually goes away. I learned how to scuba dive! I went door to door and met all my neighbors and organized our first annual block party which was so much fun. I’m a better step mother. I read books to them at night now, teach them all about crystals and the magic that is our universe.. Just so many things I NEVER would have done before. I was even able to get a  job for the first time in 4 years at a Crystal shop (this was a huge win for me! My husband is so proud of me!!) \n\nI wish your daughter could have found whatever it was that she was looking for. Her soul is no longer in that heavy body she must have been carrying around for as long as she could. Can I ask you what your daughters name is? \n\nI wish you all the peace this world has to offer!\n\nFor me, still early on in this journey, I just know I’m not going to let one more day pass me by because of you look close enough, little miracles are all around us, wonderful people are right next to you that are more often than not willing to share a smile, jokes to be made, laughs to be shared.", "permalink": "/r/happy/comments/n3lhbf/the_first_photo_is_me_off_benzos_and_opioids_for/gwuv0qn/"}