{"id": "t5_2tand_t3_of6vxh_t1_h4cwa00", "creation": 1625668609, "origin": "t5_2tand_t3_of6vxh", "height": 1, "replied_to": "t5_2tand_t3_of6vxh", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "sideofspread", "text": "You made the right choice, you didn't know what you wanted so you broke up to let her find someone else. Children/marriage are not things you can really compromise on. She seems to have a goal and you don't share that goal. It's best now she can find someone that will share that goal with her. \n\nAlthough I will say, don't put to much stock into \"What you want to do with your life\". Life is ever changing, try just starting with all you can do is be happy. Do things that make you feel joy in the midst of it all, and do your best to do them often outside of the regular day to day of life. If you don't know what makes you happy, we'll there is step 1! Try new hobbies, visit new places (doesn't even have to be far away countries- start by switching up the shopping center you go to). And build on from there. \n\nNothing is ever certain, and no one ever has everything figured out. Just try to see what you feel comfortable taking risks with, and things that you don't. I will say not wanting to have kids- is becoming a more common place things for younger people. I know it stills seems abnormal, but there are a lot of people who have children that really shouldn't. You're doing the smart thing by not just doing something because it's expected, and involving someone else's life into it until you have a clearer vision of where you would like to go. \n\nI will say from personal experience I dealt with a lot of trauma and suffer from depression, when I made it to about 23 I had no idea what to do because I truly never thought I would make it this far. And that's really scary, but I started small and did my best to try and understand things about myself. I'm not gonna say I have it all understood and now I'm seeing through the matrix, but I feel like I'm in a better place than I was. Take time to understand yourself, try new things, makes new friends, then maybe pick up dating again a little later on.", "permalink": "/r/DecidingToBeBetter/comments/of6vxh/at_22yearsold_i_feel_like_an_adult_with_no/h4cwa00/"}