{"id": "t5_2tand_t3_ki9bf4_t1_ggpimno", "creation": 1608657534, "origin": "t5_2tand_t3_ki9bf4", "height": 1, "replied_to": "t5_2tand_t3_ki9bf4", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "inkwater", "text": "I learned to knit. \n\nI'd wanted to learn for years. Bought a few skeins of yarn and a set of needles, got a book, tried to teach myself, failed miserably at it. Couldn't get the hang of it no matter how much I tried. Got pissed off, stuffed the tools into the closet for three years.\n\nThen one day I saw a post on Facebook about a group who wanted donations of red scarves. I could not make a scarf to save my life, let alone donate it to their organization by the deadline. However, I was fed up that I'd quit because it looked like such fun and I really wanted to figure it out. So, I dug out my yarn and tools, and struggled, and got fed up again, and then watched a YouTube video. \n\nOne stitch. The first stitch, called garter stitch. It's the lynchpin to the whole enchilada. If you can't master it (and it's simple when you know how), you can't knit. Challenge accepted! Took me two weeks to make a really ugly scarf with stitches that overran themselves in places and made a wonky-looking thing. I set my mind to making one scarf that didn't scare anybody. So, eventually, progress happened. Whoo!\n\nThat was a year and a half ago. Since then I've made tons of hats, scarves, pillows, dish clothes, lap blankets, all sorts of things. I work on it every single day, sometimes only an hour when my arthritis is bad, or up to ten hours. 95% of finished projects are donated to people who need them. The rest is for my husband and our cat. When I don't knit, I feel antsy.  It's the creative expression I've been seeking my entire life. Huzzahs!\n\nWhatever gives you the fire, and it doesn't have to turn into a career, give it your utmost. It starts small, like the garter stitch. You'll find it.", "permalink": "/r/DecidingToBeBetter/comments/ki9bf4/what_change_has_had_the_biggest_best_positive/ggpimno/"}