{"id": "t5_2qh5i_t3_7rfy33_t1_dswye80", "creation": 1516361917, "origin": "t5_2qh5i_t3_7rfy33", "height": 1, "replied_to": "t5_2qh5i_t3_7rfy33", "down_vote": 0, "up_vote": 20, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CedarCabPark", "text": "I don't think some people understand just how insanely hard quitting certain drugs are. Especially opioids and benzos. The withdrawal is living hell, and if you ever went through it, you would be humbled 12 hours into it. Imagine the flu with panic attacks, BUT you can't sleep for days. Then after the severe part, there's still months of PAWS (post accute withdrawal symptoms/syndrome. I forget the last word).\n\nHonestly, if there was an opiate that wasn't lethal and didn't have withdrawals, the addiction would be drastically more manageable and tolerable. Almost everything bad about these drugs, the bad decisions and desperation, just comes from trying to avoid withdrawing. Being on the drug alone, the person is usually pretty chill and fine. It's way different than stimulants where people can be out of their mind and aggresive after being up for days.\n\n*Now here's a tangent for any opiate addicts out there:*\n\nKratom is a powerful tool for anyone struggling with opioid or opiate addiction, as its legal (in most states), drastically cheaper, and non-lethal. But it still has the issues with addiction and withdrawal, as it works on the same opiate receptors in the brain and has recreation effects. But it's a damn good first step. If anyone is struggling with a bad opiate addiction, please check out kratom. It has pain killing effects, social relaxation, all of the same things, except it's more mild. But it being legal and cheap and really help your life. Without a tolerance, a dose is 2-3 grams. You can get 250 grams for 25 dollars. It's just a ground up leaf from the tree, and you either take it with water or make a tea usually. Tastes pretty bad though.\n\nAnd not worrying about a lethal overdose is a big deal. I know people that have gone from 80-120mg of methadone (a notoriously bad withdrawal that lasts for a LONG time) straight to kratom, and never went back.\n\nIf you don't have an addiction to opiates, I wouldn't suggest using kratom and you can get addicted to it. And if you do, it can be hard to quit. It's especially hard because you can buy it at so many places around the corner, so the temptation is strong for some. For others, the addiction is a lot less intense and they can take breaks without an issue. But that's a big gamble.\n\nBut if you're someone who relies on pain killers for chronic pain, it might be a good choice. Strength-wise, I would put it in the range of slightly above hydrocodone, but below oxycodone. You can redose a couple of times daily if needed, as well. It's interesting that there are different types and \"strains\" of kratom, with very different effects. From stimulating to more pain killing, to sedating, and more.\n\nI just recently stopped using it for a number of reasons, but it quite possibly saved my life. It may end up illegal sometime, and everyone (addict or not) should be very concerned about that. You'll see an awful lot of people switching back to street drugs, something nobody wants. It's already bad as it is. \n\n\nJust some stray thoughts I wanted to put out there. Drug addiction is no joke, and is the hardest thing in this world that I've come across. Staying sober is just an unbelievable act and should definitely be praised. The temptation to just jump back in is always there for addicts \n\n(If you have any questions about kratom, let me know. There's different types that have different properties, and some vendors are better than others.)", "permalink": "/r/happy/comments/7rfy33/drug_addict_for_8_years_went_to_jail_in_2015_and/dswye80/"}