{"id": "t5_2tand_t3_3ze8fc_t1_cylgzdq", "creation": 1451913127, "origin": "t5_2tand_t3_3ze8fc", "height": 1, "replied_to": "t5_2tand_t3_3ze8fc", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Goondor", "text": "Hi friend!  You've already taken the first step toward bettering yourself by taking the time to identify the things you want to change any why.  My advice would be to not try and fix everything at once.  Fix the worst of things and work your way through.  Maybe choose smoking first: it negatively impacts your heath, limits your social choices, and potentially could limit professional choices as well.  A friend of mine quit last year and she said that she would set rewards for periods of time without a cigarette.  Treat yourself at one day, one week, one month, three months, and so on.\n\nAfter a couple successful weeks, maybe start to pick up running, C25K is a great program that many former smokers have good luck with.  Also, it gives you 30 mins to yourself 3+ times a week which can be like meditation for you (it is for me).\n\nTry seeing a head doc and letting them know why you're self-medicating with Adderall.  They can help you determine whether you actually need it, or maybe another variant of the medication that could help you professionally.\n\nYou might need to consider branching out into other social circles if your current circle contributes to your bad habits.  That can be the hardest part, but the more success you have, the better you'll feel about breaking ties if they just keep trying to undo all of your hard work.\n\nFinally, as far as relationships go, they're tough.  The answer is time, separate yourself from that person entirely, don't go where they frequent, don't watch the shows they watch, don't intentionally remind yourself of them.  Now is the time to find out who YOU are and what YOU want, then beast it all.\n\nGood luck, if you need support I'm always available to listen. ", "permalink": "/r/DecidingToBeBetter/comments/3ze8fc/im_paranoid_insecure_full_of_bad_habits_and/cylgzdq/"}