{"id": "t5_2tand_t3_oecags_t1_h55oj66", "creation": 1626272857, "origin": "t5_2tand_t3_oecags", "height": 1, "replied_to": "t5_2tand_t3_oecags", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "pumpernickel34", "text": "If it were me I'd go along the lines of something researched to be healthy and sustainable like high protein low carb. I suggested you look into keto (high protein, tons of vegetables (beans for fiber etc) so that you DONT have digestive issues. Also, because you suggested high protein.\n\nWith something like that you can increase carbs once you feel comfortable ar your weight. Less of a \"diet\" which means increase success rate!  \n\nIn a month (or when you want) You'd like a biscuit with breakfast and to not have to constantly \"think about food\" that's fine. Have one.  You want subway. Have it. The key is balance. That's just my experience in modifying patterns long term. \n\nAs far as long term goes, dealing with the psychological aspects of eliminating\nBehaviors and creating potential life you are working towards can be tricky.\n\n Simply put, there are reasons we \"coped\" with food, drugs, etc. Usually exploring those areas is a good idea with a therapist.  Not saying this is the case for you, just something to consider given the patterns you are resetting. \n\nIf you go the vegetable route, look into roasting them. Lots of great herbs and spices to make them delicious! \n\n Seriously, some great recipes on the internet. I don't know if you meal prep, but there are some great tips in that subforum. I personally like putting a shit ton of chicken in the crockpot and then using it as a base for different meals throughout the week.\n\nI shred it and it's easy and yummy. \n\n1. chicken and black beans and salsa.\n2. Chicken and roasted broccoli \n3. Chicken on fresh avocado and tomato\n  \nPossibilities are limitless \n\nAlso, it doesn't require much thought and is easy to portion.", "permalink": "/r/DecidingToBeBetter/comments/oecags/i_just_drank_my_last_soda_so_begins_my_attempt_to/h55oj66/"}