{"id": "t5_2tand_t3_gt5hu7_t1_fsay2kv", "creation": 1590844487, "origin": "t5_2tand_t3_gt5hu7", "height": 1, "replied_to": "t5_2tand_t3_gt5hu7", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Scott_Daneau", "text": "  \n\nActually, I don't have a major concern with social media by and large. Just Reddit in its current form. It would take too long to really go into everything as to why reddit is detrimental, or at least not as beneficial as it could be.\n\nIn short, as an agent of socialization: This is a place for public discourse. However, with optional anonymity and a point system, with consequences on public discourse and that the point system is based on popular opinion, I feel that free and open discourse is not truly possible here. This is due to the karma system and its associated concepts, like brigading. Having an opinion contrary to a popular opinion will simply get you excluded. This most concerning aspect of this is that this norm of excluding people that do not conform to popular opinion likely finds its way into the culture at large. I've experienced biases and intolerance for opposing viewpoints in academia, for example, even when such viewpoints had, at least, enough merit for serious and respectful consideration. There are actually numerous instances in which individuals are factually correct but shouted down because their observations and assertions are not popular.\n\nSo if Reddit, as an agent of socialization, is affecting the western culture at large, then I think some adjustments to Reddit are at least worthy of consideration.\n\nI think that a new karma system is in order. My proposal would be that upvotes and downvotes count as one vote. Comments are ordered by most votes overall, not merely upvotes or downvotes. The comments themselves would show the number of upvotes vs downvotes so that people would know how others felt about the comment, but downvoted comments would not be sent to the bottom of the list where no one could see. As a result the most likely responses to something that a reader doesn't quite care for, or doesn't quite like enough, would be no vote, rather than what often happens now: the downvote resulting in negative sanction, which discourages open discourse.", "permalink": "/r/DecidingToBeBetter/comments/gt5hu7/i_woke_up_a_week_ago_and_decided_to_suspend_all/fsay2kv/"}