{"id": "t5_2tand_t3_gt5hu7_t1_fsai70z", "creation": 1590829866, "origin": "t5_2tand_t3_gt5hu7", "height": 1, "replied_to": "t5_2tand_t3_gt5hu7", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "lavendrambr", "text": "Honestly I need to limit my social media too. It’s gotten so negative to be on that it’s actually changing how I feel people act in the real world and view me (because now I’m interacting with people more online than I am IRL), and it’s really not good for me since I have anxiety and paranoia. I rarely going on Facebook, Instagram, and snapchat just because I suck at/don’t care too much about keeping up with those, and I’ve been using twitter basically everyday for the last 2.5 years, but now I’m finding that I need to stay off twitter because my timeline is full of negative events happening in my country and the world, racism, discrimination, hate, cancel culture, and not to mention this awful covid stuff. And I’m a huge empath that gets distraught when I read about too many negative things, so having to constantly see that people are dying from covid, or dying from racism, or people’s lives are getting ruined over a misunderstanding on the internet, can just be too much for me at times. I literally want to help everyone and fix everything and make people see how stupid they’re being and I feel so helpless. And if I’m being even more honest with myself, I noticed a huge decline in my productivity and motivation when I started using way more social media around 4 years ago, and I find my phone/social media being the default entertainer when I’m bored when that’s not how it should be at all. I don’t even identify with my hobbies I used to love anymore because I’m so used to just grabbing my phone and wasting countless HOURS on it. I think about drawing or painting, I dream about a story I could write, and I wonder about all the books on my shelf, yet I still grab my phone because it’s more familiar and safe to me now (*blehhhhh*). I find myself obsessed with the fact that I’m not happy in my life when everyone else I know seems to have it figured out. I want to have a nice picturesque life I can post on Instagram but I just don’t and it makes me feel like I’m missing out. I want to be a cool person that can easily gain followers or people that care about what I say, but I’ve never been the type of girl people are drawn to like that. I want to “create” a personality for myself online to easily attract other people so I can have friends again because I’m so lonely (long story short, I accidentally isolated myself for 2 years and now my only friend is my boyfriend and I’m *struggling*). Just seeing myself type this stuff out that I’ve never actually admitted, and the fact I did not have these specific wonderings about my self worth 5+ years ago, let’s me know I have a problem and I need to limit my social media ASAP. Thanks for letting me rant on your post, it helped me realize things! I’m glad you’re also taking necessary steps for yourself!", "permalink": "/r/DecidingToBeBetter/comments/gt5hu7/i_woke_up_a_week_ago_and_decided_to_suspend_all/fsai70z/"}