{"id": "t5_2tand_t3_h91kfb_t1_fuvwed9", "creation": 1592212828, "origin": "t5_2tand_t3_h91kfb", "height": 1, "replied_to": "t5_2tand_t3_h91kfb", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Silfidum", "text": "IMO people suffer due to ignoring their empirical experiences in favor of some dogmatic belief since we as humans tend to rely on our senses first most. \n\nIf we do not have any empirical data to suggest that a belief have any basis, even if it makes sense logically, or worse yet we have empirical data that suggest the opposite we may experience a bit of a dissonance emotionally. \n\nBut there is also a problem in that our senses do not capture enough data to *truly* and *fully* understand the world around us which necessitates skepticism to have a more objective outlook. Which leads to concepts, rules etc that help interacting with reality in a more productive manner. \n\nA lot of dissonance is born from human mind interacting with time, essentially. Many things, concepts and such were made and perpetuated without us ever capable of knowing nor perceiving so we may have a problem of understanding them empirically.\n\nIMO emotions are just our baseline, empirical, true *self* \"speaking\" in a way that is inherent to us individually rather then using an interface like language to formulate a piece of data that we can share. After all, we don't *really* need an interface to *understand* our emotions as they are more meta then language and it operates a lot faster then speaking words could ever hope for. Technically you don't have to speak at all to make some kind of sense of yourself and the world. \n\nHowever it can be difficult to *justify* emotions in a environment since you are a part of the ongoing system in which your actions may or may not cause a reaction from other individuals and other phenomena. Hence sometimes we may feel like following some assertions, even though on an empirical level we do not believe nor assert them, due to expectations of following said assertions will lead to an expected resolution. \n\nThe problem usually comes from over investing in either following your emotions (which I assume is analogous to stated term \"energy\") or following outside assertions adapted from other people and sources. \n\nFollowing your emotions can be problematic due to not fully understanding the environment hence relying on past experiences that you empirically been through can be likely insufficient to reasonably assert an outcome of your action which in turn may lead to undesired outcomes. Particularly when dealing with things that you never interacted with before. \n\nFollowing adapted assertions is problematic in that you do not empirically sure that those assertions are true hence there is no *true* guarantee that following them will lead to a desired result and not many such assertions are even near all-encapsulating to the environment nor situations you are going to be dealing with due to shifty nature of the environment itself. \n\nPersonally I would recommend to be more aware of what you are feeling about any given situation and what assertions you are following and why. Skewing your mode of operation is not in of itself a bad \\\\ good \\\\ orange thing, it just lead to different outcomes. \n\nIn a sense what we all are going through is just experiencing trauma from going through time. Thanks for coming to my TED talk.", "permalink": "/r/DecidingToBeBetter/comments/h91kfb/making_decisions_based_on_energy_has_helped_me_so/fuvwed9/"}