{"id": "t5_2tand_t3_pjd1mf_t1_hbwpq05", "creation": 1631002397, "origin": "t5_2tand_t3_pjd1mf", "height": 1, "replied_to": "t5_2tand_t3_pjd1mf", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "gafflebitters", "text": "I have experienced this, very recently in fact. In May i got a job and that is when the hard part started, the job gave me the motivation to start to move in a positive direction and do those things I had been putting off and letting pile up, this was not easy.\n\nI get laid off  quite often in my work and when the long periods without work happen I always dip a bit into depression but this one was particularly bad, just like you describe, I was struggling with myself just to go for a walk outside everyday for 20 min and then I wouldn't do it for some reason then THAT became just another reason to \"beat myself up\". My brain was turning the positives into negatives on me.\n\nI recognized my depression while listening to another person with Major Depression symptoms talk and i identified with their feelings and that scared me and helped me too. At least I knew what was going on. I talked to some people close to me and told them what was happening in my head, I called the Dr. and he very quickly sent me a prescription that was supposed to help and be non-habit forming but I just couldn't take those pills, afraid of what it might start I guess, perhaps i made it harder on myself by refusing them, I don't know.\n\nI was talking with a friend before i got the job and he was trying to help me and he was asking me why i was not looking for work and I \"couldn't\" give him an answer, I was not ready to say what was stopping me out loud at that time, it was kind of hidden from my conscious mind, and he suggested I was lazy, and that was why i was not getting a job and that hurt. I felt like I'm down, and here you come, retired guy that you are, judging me and kicking me, that sucked I can tell you, and i no longer talk to him, he probably wonders why, meh.\n\nHaving made it out of my personal depression I wish i could give you some simple steps or light some torch of encouragement you can follow out of your own dark cave to the light, I assume it is different for everyone and for me i had to wade through a bunch of pain and negativity (missed job opportunities, continued depression and guilt) until i got the job and then that was a turning point. The pain and negativity did not stop but I had the motivation to keep moving forward, it was hard , there was so much baggage to bring along, i was angry a lot, but moving in a positive direction.\n\nI guess the thing i learned was that when i lose a job it is MY decision what i do next and i can do what i have always done and risk sliding back down again the next time ( and it will, I have proven that to myself) or i can take some scary steps into uncharted territory and hopefully away from depression next time it happens, I have discovered my choices make my depression worse or better and that is a very good place because many people do not have a choice over their depression and they cannot avoid theirs so \"easily\".  \n\n\nI hope you like reading, so, your title was extreme laziness, I will say, i do not think depressed people are lazy, that is dishonest and keeps me from my answer. Why did I not look for work? Not because i was lazy, it was because I had a foreman take a very personal interest in punishing me and making me miserable just before he laid me off and to be quite honest i was afraid of this very thing happening again. So, a fear was keeping me from taking action, a fear that i had to deal with before i could move on, i was not lazy, I had been kicked very hard and i was wary of being kicked again.\n\nWhy was i able to talk myself out of going for 20 min walks everyday? I am not sure. That was not laziness. I think that was the depression and \"inertia\" which can be very difficult to overcome. \n\nI think an early indicator of change in my situation was when i became aware of what was going on, and even though i could not tell anybody else yet i stopped assisting it in dragging me down. I became aware that little things i was doing were greasing the walls so i could not climb out and did my best to stop doing those and got as honest as i could about my situation to someone i trusted, that helped.\n\nSorry about the long message, i am thinking out loud, and perhaps it could be condensed. I am here if you need to talk this over with someone who understands  : )", "permalink": "/r/DecidingToBeBetter/comments/pjd1mf/how_to_fix_extreme_laziness_brought_on_from/hbwpq05/"}