{"id": "t5_2tand_t3_pjd1mf_t1_hbwq5pj", "creation": 1631002783, "origin": "t5_2tand_t3_pjd1mf", "height": 1, "replied_to": "t5_2tand_t3_pjd1mf", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheBackstreetNet", "text": "Well, I was in the same situation for all of 2019, and it sucked. It's really bad. And I totally get it.\n\nHere are my recommendations:\n\n1. Get therapy ASAP. I used BetterHelp. It might take a few sessions before you find the right therapist, but that's OK. Just keep on changing until you find one. I didn't do therapy for so long. I slowly got better over time little by little. Therapy kicked my recovery from depression into high gear! In the space of 4 months, I improved as much as I had in 18 months. If you can't afford therapy, at least get the book \"Feeling Good\" by Dr. David D. Burns. It takes you through CBT and is a great help and super easy to listen to on Audible.\n2. You must be using your time in some way. Are you watching stuff on YouTube? Spending all your time on Reddit? Playing games? Whatever your vice is, you need to cut it down or cut it out. Don't ever rely on willpower because you will give in. Uninstall the apps, leave your phone in a different room before going to sleep. Make it difficult to access these time-wasting activities.\n3. Get a job. It creates accountability. You need to be at your job no matter what. You might skip out on things in your own life, but you won't skip out on your job. It doesn't need to be a good job. It just needs to get you out of bed.\n4. Try interacting with people again. Social isolation is the biggest reason people STAY depressed once they get in that cycle. Meeting up with friends and spending as much time not alone as possible is a really good way of improving your mood.\n\nThis is a tough journey you're on. But as someone on the other side, I can firmly say there is a way out. It might take ages to get there, but it's well within reach. **I BELIEVE IN YOU!!!**", "permalink": "/r/DecidingToBeBetter/comments/pjd1mf/how_to_fix_extreme_laziness_brought_on_from/hbwq5pj/"}