{"id": "t5_2tand_t3_obpst5_t1_h3xnwnz", "creation": 1625330497, "origin": "t5_2tand_t3_obpst5", "height": 1, "replied_to": "t5_2tand_t3_obpst5", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "pmevanosky", "text": "I have multiple journals going on at any one point in time.  Used to be I would think I would need to finish writing in one journal before I moved on to a new one.  Now, I just buy the ones that appeal to me.  I have them with cats, with beads, decorated, not decorated and I write in them whenever I feel the urge.  I just grab one.  So, the prior entry might have been from 15 years ago.  So what?  They are my journals I can write in whichever one I want.  \n\nI also have my computer journal.  It started out as a mood journal based on a suggestion by a therapist I was seeing at the time.  It has morphed into some 102 pages many years later and I write about whatever I feel like writing about.  Just get up on a soap box and blather about.\nPeople can have dream journals.  They can have Rune or Tarot journals like if you draw 3 daily and then write about the meanings and how it all pertains to what is going on in your life.  You could have a recipe journal.  You could have an Interesting Titles for Stuff journal.  I have a journal for all the posts I make in Facebook, Reddit and my website TalkingtoSpirit.com  You could have a journal with all the interesting tv shows you want to watch or the books you have read or want to read.  \n\nI find as I am getting older I am also having a harder time remembering things.  You could have a place for reminders. It is your journal and you can do whatever you want.\n\nI actually never read mine once I am finished unless I need to look for when something happened.  You can do that easily in a computer journal with a search tool.  For me it is the cathartic and healing action of just getting it out onto paper that counts.  \n\nI just started a new one the other day.  It is full of notes as I write each day on the NaNoWriMo.org Camp 2021 project.  How many words I did that day.  Interesting developments in the book I'm writing.  It is only for the month of July and I am aiming for 50,000 words.  I will continue writing on the book long after July is over, but I can sure get the meat of the book onto paper this month.  The first NaNoWriMo for novels started in November, 1999.  It's free and the idea is that even though writing is a lonely event having the encouragement of other writers doing the same thing you are doing is a good thing.  Misery loves company.  You don't even have to communicate with them.  It's just somebody holding you accountable.  It's only ever for a month at a time and the thrill of reaching 50,000 words in one month's writing time is indescribable.\n\nAlso, I am a Virgo.  I don't know if that has anything to do with it, but typically Virgos are very detail oriented.  Very, very picky about stuff.  \nI enjoy journaling.", "permalink": "/r/DecidingToBeBetter/comments/obpst5/finally_made_mental_health_my_1_goal_and_reached/h3xnwnz/"}