{"id": "t5_2tand_t3_qckla8_t1_hhnsgm6", "creation": 1634932134, "origin": "t5_2tand_t3_qckla8", "height": 1, "replied_to": "t5_2tand_t3_qckla8", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PracticeDarkArts", "text": "I don't think she's a narcissist. You may want to study up more before you make accusations of such. Don't forget op admitted to being a dick to her I'm sure it goes further then op says based off of a few things in this post. In this situation anyone would try to make themselfs look good and the other bad, Notice how op gets you to confirm them being a dick is ok by saying it could be worse down the road. My statement of sociopath was directed at op not this other person. Also to call her a narcissist off of this Info makes no since for the simple fact this is op point of view, you never heard her side. Maybe this person was in a past relationship or friendship with someone who has ASPD. Maybe this person has been advised by a psychiatrist the telltale signs of someone with ASPD and has instructed to cut someone off if this person sees the signs. The fact that op blamed his friend and threatens self harm at a women to get his way says it all for me. In op own words I was tempted to punish, op words it to sound of self harm. The true punishment is the felling of guilt he is pulling from his victims by using self harm and the felling of betrayal and confusion using other people as excuses/scapegoats. She even asked him not to contact her yet in person he makes contact by apologizing shows how much respect he has for her space. In a public situation if someone apologized would you say no........ By the way if it's her fault why is he apologizing. I'm not here to argue just state facts. It takes 8-12 years to become a psychologist depending how good your studies are. A few YouTube videos and blogs will teach you some but won't teach you how to break the paragraph down into that person's perspective so you can analyze their mind and what their subconscious has to say.", "permalink": "/r/DecidingToBeBetter/comments/qckla8/i_think_i_successfully_prevented_a_conflict_from/hhnsgm6/"}