{"id": "t5_2tand_t3_8gh2bo_t1_dyccmt5", "creation": 1525290870, "origin": "t5_2tand_t3_8gh2bo", "height": 1, "replied_to": "t5_2tand_t3_8gh2bo", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "jarwastudios", "text": "I was like you about 10 years ago. I'm 37 now. I find myself between two places now, focused me and tired me. Focused me is when I can push through stress, being tired, whatever to get done what I want to. Tired me says \"maybe tomorrow.\" However, I'm much more consistent than I used to be, and I have have a day job and a wife and a home.\n\nAt 27 I really didn't have much to lose. I drove around $500 jalopy cars, I had shitty retail jobs for the most part, I had just finished up an MBA at a shitty for-profit school, and had filed bankruptcy a few years prior. I had no credit, no one depending on me and could do whatever I felt like. I went out the bar a lot and drank, I was reckless, I drove drunk, A LOT (never had an accident or DUI, I was VERY lucky, don't be like me, get a DD!!!!). I was unhappy with my life and couldn't find a good rhythm.\n\nOnce I met my wife I began to change. I started paying my bills, maintaining jobs with a better work ethic, within a couple of years we were living together, so we got married, got a dog, and started something of a life. That gave me things with weight in my life and I finally felt some value to my existence. \n\nI stopped acting so recklessly. I slowed up on booze, started planning times for doing the things I loved while also planning leisure time. Basically I learned moderation. I picked up smoking weed because I could focus better, weed out the erratic thought patterns and feel better about myself.\n\nI'm a daily smoker now because it rights my brain, allows me to relax internally and focus on whatever it is I want. I spend time with my wife, find time for creating (I'm an artist) and make plenty of time for games and dog walks.\n\nFor me, I learned to value my own existence by finally having something in my life that meant something real to me, and that was my wife, I desperately didn't want to let her down, which eventually became me not wanting to let myself down either. It wasn't overnight but I got there. I'm not consistent week to week but overall I feel a lot more consistency in my life, and every so often I find ways of being carefully reckless (like getting an Uber if I go out and get hammered once or twice a year).\n\nSorry that was so long!", "permalink": "/r/DecidingToBeBetter/comments/8gh2bo/jumping_between_two_states_of_mind/dyccmt5/"}