{"id": "t5_2tand_t3_mtp9kx_t1_gv5gob2", "creation": 1618881243, "origin": "t5_2tand_t3_mtp9kx", "height": 1, "replied_to": "t5_2tand_t3_mtp9kx", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "user2puser", "text": "To the why did i go on those older aged dates. It was just simply for dating practice,  thats all. I dont have very much practice in that regard, both in the actual date and the approaching someone with a conversation geared at light flirting to ask their number. Its not a thing that is \"amiss\"\n\n&#x200B;\n\nas for having my friends that are in relationships review my appearance, profiles etc. I have had review from them for the profiles and the way i dress / look. And its fine, im not like a model or anything but im also not a hideous monster. and the profile description is normal enough.\n\n&#x200B;\n\ni havnt had them actually be near enough to hear what i say to a girl i cold approach. but theyve seen me a few times before. I mean i generally get atleast friendly sort of responses from girls that turn me down, yes kinda awkward, but sometimes i get normal enough short convo with a laugh from them. Im not super charming with my convo, but its not rude or SUPER flat.\n\n&#x200B;\n\nI think my problem is in your first paragrah. And yes i admit i rationally understand that and admit that i only half think that way and half am just frustrated. And also bitter that i never have energy reciprocated back towards me. it fucking sucks being alone all the time \n\n&#x200B;\n\nI understand that people meet at work, through friends, meetups etc. But what i assume happens there that doesnt happen with me is a natural coming together in SOME way. Something that makes the initial encounter or event natural. I just never experience any natural opportunities in these various settings. Its more along the lines of me always putting effort into forcing an encounter. I believe the best chance for me personally to meet with this natural occurance is either at work or through a friend set up. Ive asked my friends, they know im looking. and theres no single girls at my place of work (its not a big company, more around 50 or so employees)\n\n&#x200B;\n\nbtw thanks for taking the time to engage with actual dialog and not just throwing out the typical, completely, unhelpful advice like. \"follow your passions that excite you!\" \"theres someone out there for everyone!\" etc etc", "permalink": "/r/DecidingToBeBetter/comments/mtp9kx/how_to_fix_life/gv5gob2/"}