{"id": "t5_2tand_t3_q9o8uz_t1_hgy6hpa", "creation": 1634446180, "origin": "t5_2tand_t3_q9o8uz", "height": 1, "replied_to": "t5_2tand_t3_q9o8uz", "down_vote": 0, "up_vote": 13, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ChangingThymes", "text": "I put 6 hard years into learning to accept myself.  It worked. Here’s what I learned in that journey and maybe this will help you and others. \n\nIt all starts with self-awareness.  Keep a journal.  \n\nWrite every day.  Multiple times a day if you need to. Take that running dialog in your mind and get it out of your head.  All the shitty self criticism.  Doubt.  Self hatred.  Fears.  Arrogance.  Pity.  Blame.  Just get it out of your head.   Be brutally honest with yourself.  Don’t judge.  If you think it, write it.  This is the foundation for self awareness.  What others think of you.  And more importantly what you think others think of you is a bunch of bullshit you can’t control.  You can only know what you think and how you feel. Being honest about those two things alone takes a lot of effort and patience.  If you don’t know how you fee and think you will never be comfortable with yourself when you are with others.  \n\nAfter a few weeks or months you will see recurrent things in your brain.  You’ll get tired of writing the same thing.  Embarrassed how pathetic it feels to be weeks or months (or years) later and you still have the same doubts, fears and self criticism.  But you will gain two profound insights.  First you will have the language and awareness of exactly whey is in your head.  Repetition will bring clarity.  Second you will begin to realize that of the many doubts  you have, much as you may not like them or wish them to be different (or more likely know what it takes to change them but lack the discipline), they are actually true and real parts of who you are.  You are now becoming profoundly self aware.   No one can judge or reject you worse than your own mind at its worst.  You will truly have a more clear sense of who you are both good and bad.  \n\nNext.  \n\nYou want to move from self aware to self accepting.  \n\nThis is much harder but much less painful.  It’s less painful because the process of becoming self aware means repeatedly facing and putting words to the worst things your mind can think and your heart can feel about you.  Self acceptance is harder because it is not as simple as just keeping a journal of all of your internal junk.  Self acceptance means you have to go do things.  In all of the recurrent journaling you will find many things you wish you could/would change, and many things/circumstances you wish were different.  \n\nThe process of self acceptance means actually starting to make the changes that truly matter. You will have a long list.  But self acceptance involves making the effort to change them….and then….accepting the ones that, even though may be the most important, you aren’t able or willing to change… yet.   Keep the possibility that they can change in the future.  But also become more accepting that you be at a place in life where you will change other things and in other ways.  Continue to journal because you will continue to harshly judge and doubt yourself for the things you’re not changing (but should) and the things you are changing (but aren’t changing enough). \n\nIf you ever heard the “serenity prayer” this is a pretty clear affirmation of this phase of the process. \n\nBy this time it’s been months (maybe many or many many months). You will know your greatest fears (awareness) and you’ll have made some changes and tried many changes.  Therapy.  Gym. Diet.  Dating. Job. Move.  Hobbies. All of these happen as you start Making efforts to change.  \n\nBut you’ve been journaling.  For quite a while.  You truly know you.  For better or worse.  And as you shift your relationships you’ll journal them and become very aware of how you feel and react to them.  \n\nAction and awareness, over time… is “reflection”.  Looking back at yourself over time with depth and honesty, and a bias towards making change where you can…. That’s a healthy and honest human. \n\nYour relationship with yourself will Improve.  Your self acceptance will improve. you’ll see the benefits of the changes you’ve made and acknowledge yourself for what they’ve done.  You’ll still doubt and fear and wish you could change more but with reflection as a core part of your life you will see….  You’ll be more accepting.  More aware. Less afraid.  More confident.  \n\nAnd the people around you will be different. Practicing daily and active reflection (journaling drives self awareness, self awareness and honesty over time fosters reflection, and reflection becomes the foundation for acceptance of yourself). You will make less time for those who aren’t right for you.  You will attract people to you who naturally respond to your self awareness and acceptance.  With continued diligence this becomes a virtuous cycle.  Bad things and bad people and bad decisions will still happen but less and less and they will be less dramatic and disruptive and simply be lesser parts of a larger and better life journey.  \n\nSo how do you get to self love?  It’s easy.  You’ll find you’re already there.  And I can prove it too you.  Think of one of your favorite, good, people you’ve known in your life.  A parent.  Teacher. Sibling.  Friend. Think of much you just love hanging out with them. You could talk or laugh and hang out for hours if not days.  And you love them. Because of how good it feels to be around them. Now take a moment and reflect (be honest) about their shortcomings.  Did they have weight issues?  Money issues?  Love issues?  Health issues?   Always!  But in your first memory you felt the joy and love of being in their presence. In your second memory you reflected on their imperfections.  But you didn’t love them any less for their shortcomings. \n\nSelf love comes when you are aware of your shortcomings.  And it doesn’t matter or stop you from feeling good about the the things that feel good about being you. You’re funny.  You listen. You’re creative.  You like to talk. You tell stories.  You read. You have ideas.  You’re truly and interesting person you want to spend time with. \n\nYou have a bunch of doubts.  But through journaling and self awareness you know them better and more honestly than anyone.  If others see them (you) or judge them (you), you can actually understand and empathize.   \n\nYou put energy and thought into the things you can and are willing to change. And with continued journaling and time you have built trust in confidence you have value and can and are becoming an even better version of yourself. \n\nOver time, reflection will naturally attract more of who and what truly matters to you.  And over time you will become one of your most trusted, honest and comfortable people for you to be around.  Self love. \n\nPs we all have good and bad days and good and bad experiences. So keep journaling.  Keeping reflecting.  And keep making changes. It’s a journey. An awesome journey.  \n\nPps. I worked hard at this for probably 6 years.  That was 25 years ago.  I still do those things.  I have good people in my life.  I am a good person.  It doesn’t have to be more complicated in my opinion.", "permalink": "/r/DecidingToBeBetter/comments/q9o8uz/how_do_you_even_learn_to_love_yourself_or_like/hgy6hpa/"}