{"id": "t5_2qh5i_t3_gazup9_t1_fp460h3", "creation": 1588292383, "origin": "t5_2qh5i_t3_gazup9", "height": 1, "replied_to": "t5_2qh5i_t3_gazup9", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "IFTYE", "text": "1. Y’ALL ARE GORGEOUS!! Did you keep your original photographer for this? Because damn. It’s beautiful.\n2. Thank you for postponing. I know someone who is floundering on their decision to postpone and pressuring their partner to just move forward... and it’s rough. As a guest, I made travel plans. I booked hotels, scheduled flights, blocked off my calendar, etc. And when shit went down I kept staring at that trip, wondering if I should cancel or wait for them to cancel, while the anxiety of reaching out just built up with *that’s rude and then I just look like a dick when they do postpone, but what if they don’t, but I only have a limited time to get the money back to put towards their next date, what the fuck do I do if they don’t postpone and I have to tell our (very close) family members with serious health issues and they try to fight me or I have to reassure them it’s okay to miss, but then I SHOULD miss it to protect said family members, but I morally would lose my mind if I had to miss this persons wedding, etc etc*... Them postponing was the biggest sigh of relief. \n\nThem calling a few days ago to ask me how I felt about them *actually* just having the wedding regardless was one of the MOST awkward phone calls of my life. I already cancelled everything. Abso-fucking-lately not would the immunocompromised family members be traveling and attending, I had to try REALLY hard to not just lose my shit about the question itself, and no, virtually no one from one side would be there because they weren’t going to risk the others *lives* while spending thousands of dollars to do it when they planned on another bigger ceremony later. \n\nI really, truly, would be ecstatic for them if they decide to sign the paperwork on the original date. Bring on dresses and tuxes and pretty pictures and kisses and happiness! But this back and forth on a full “wedding” and total disregard for anyone else has made me look at the couple very differently. So thank you for deciding and making decisions for yourselves that you’ll be happy with, I promise there are people in your lives that appreciate it :)", "permalink": "/r/happy/comments/gazup9/i_got_married_had_to_postpone_the_full_wedding/fp460h3/"}