{"id": "t5_2tand_t3_n4l7j0_t1_gwwovvl", "creation": 1620137037, "origin": "t5_2tand_t3_n4l7j0", "height": 1, "replied_to": "t5_2tand_t3_n4l7j0", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MattTheMentor", "text": "The good news is that you're not the only one, this is very common. The bad news is that I don't think it ever goes away, you just have to find ways to work around it. Here's the main ones that work for me.\n\n&#x200B;\n\n**Do it scared**\n\nThis phrase is very helpful for me to jump start things before I feel ready. Anxiety, uncertainty, burn out and all of these emotions can make it very hard to feel like starting. But once you start, it's a lot easier to keep going (and progress will make you feel better!). So I have a bracelet that says \"Do it scared\" I wear every day and it reminds me that it's okay to try something even if I don't feel ready. Usually it's the inactivity/stagnation that feels the worst, and you'll learn/make progress as you go. Action is the route to progress, and life starts at the end of your comfort zone.\n\n**Reach out**\n\nTalking to friends is incredibly helpful. They don't have to have the answers, but sometimes just getting out of our own head is what we need. Sometimes they have great advice and sometimes it helps to remember we're not alone. They have their own versions of our problems and maybe they need to vent too (but one person has to reach out first). Life got a lot better after I stopped feeling awkward being the first one to reach out. My friendships got even richer and my friends were very happy that I was keeping the connection alive.\n\n**Journal**\n\nPutting your feelings onto paper (or google doc) kind of forces you to understand them better. Nine times out of ten I will feel better after journaling simply because I better understand the problem. It's kind of like if your stomach hurt because you ate something you were allergic to. Knowing that doesn't fix the bad feelings immediately, but you can discontinue the thing that is making you feel badly (maybe a bad relationship, maybe too much isolation, etc). Sometimes what you need is a day off, like you said that balance between work and rest is very difficult.\n\n**Consistency is key**\n\nAny of the habits that make you feel good or productive or effective should happen by default. For me that is going for a walk, listening to a positive audiobook or podcast, journaling, stretching, exercising, and meditating. This doesn't have to be a 4 hour marathon every morning, my routine takes about 45 minutes. But by making sure it happens every single morning it's like I can set the default mood of my life to be \"calm and confident\" because I do things every day that make me feel that way. Sometimes we have to break routine, but for me the secret to avoiding bad days is systematically doing things that make you feel good. Usually really dark times in our lives compound over long periods of negativity. Let's keep that ball from ever growing too large.\n\n&#x200B;\n\nI want to reinforce that it sounds like you're doing great work already and you have a lot to feel proud of. Not everyone puts in the work and I'm sure you've seen great results already. It's true that we're never \"done\" and it can be disappointing to still have bad days when we've worked so hard. That's okay. As long as you have tools you can use on bad days and remember to use them, things will be okay. Those bad days don't mean you're not doing enough or there's something wrong with you. They just mean you're human and everyone has days like that. Luckily there's great tools you can use to feel better. Wishing you all the best!", "permalink": "/r/DecidingToBeBetter/comments/n4l7j0/what_do_you_do_when_its_starting_to_feel_like_too/gwwovvl/"}