{"id": "t5_2tand_t3_q7njpj_t1_hgjz7de", "creation": 1634172343, "origin": "t5_2tand_t3_q7njpj", "height": 1, "replied_to": "t5_2tand_t3_q7njpj", "down_vote": 0, "up_vote": 102, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Number1Cow", "text": "Alright man, first off, Happy birthday mate! I know it might not feel like it at the moment with so much going wrong but I'd like for you to be happy.   \nI'm sorry to hear you're having such a tough time at the moment. Getting your heart broken sucks. You've just invested so much time into the wrong person and now you're on your arse with nothing to show for it..\n\nAs cliché as it is, time is the best healer but you can speed the process up, you've got to invest that energy and time you've got spare now in yourself now instead.. Keep yourself busy making improvements to your life whether mentally, physically or spiritually. Keeping active and following goals will not only keep you distracted but improve your life as well.\n\nIt sounds like you've already got the right idea. Keep moving forward.. But don't just walk forward for the sake of not stopping and giving up, walk forward with intent to your next goal or experience you want to have. Life's opportunities are limitless, you've just got to decide to do something and pursue it for the sake of your own interest. \n\nOver time you'll notice your self caring about the past less and being more engaged in the present and in life.\n\nI know what it's like to feel alone and inadequate, to feel betrayed and heart broken. You've just got to put yourself out there until you don't feel so sad anymore. It obviously no where near as easy as it's written but I'm just talking from past experiences. \n\nLast year on my birthday, I was feeling so sad and alone. I was at a similar sort of tipping point to you, where I had to decide if I was going to give up or I was going to keep going.   \n\n\nI decided to keep going and live my life as a captain of my ship instead of just being passive and let life have it's way with me. I refused to accept the current state of things. You've got to perceiver and know that you won't feel sad or lonely for ever.   \n\n\nYou'll always be tested in life, I try and make light of it and just call negative life events \"character building\". How you handle adversities determines what sort of man you'll grow into. Think to the future and consider what sort of man you want to be and keep striving towards that ideal.\n\nLast year I looked at all the things wrong with my life and decided to fix them. If you look at your life I'm sure you'll be able to find things to fix. Start small, celebrate all the small accomplishments and things to be grateful for so the world doesn't seem so dark.\n\nTwo of the most immediate things you can do to improve your life and move forward is start practicing a martial art. This will push you straight out of your comfort zone, it will give you more confidence, discipline and strength. \n\nJust start with one one-to-one a week and go from there. You'll learn new skills, gain knowledge but you'll also gain a support network of people that just want to see you grow and want to help you achieve which will make you feel less lonely.\n\nSomething that I've found that works for me personally is to carry a little black notepad around with me. In one side, I write a to-do list which I check daily and tick things off that I've completed that day and really think about what I can do the in the immediate future that would benefit my life and I try and do them. I put things on I would of done anyways and tick them off too. It just builds it into more of a habit and it feels good to tick things off.\n\nIn the other side I write things that happened that day that I have to be grateful, positive experiences or just things that made me happy. It trains you to look out for the good in the world and see the positives in situations or things that maybe don't look so bright right now. \n\nOver time you get a little book full of progress, accomplishments and reasons to feel maybe not so alone and sad.   \n\n\nBut yeah, basically just don't give up, have faith in yourself that you'll be able to create a life for yourself where you'll experience more of the positives than negatives in life. I don't want to just ramble but I saw you're post and I couldn't not respond. You will be okay, this is speaking from experience. I hope this went a little way to helping bro. Feel free to message me if you want to talk and I'll try and get back when I can if you want to ask anything more :)", "permalink": "/r/DecidingToBeBetter/comments/q7njpj/its_my_21st_birthday_today_my_girlfriend_of_5/hgjz7de/"}