{"id": "t5_2tand_t3_a8xt60_t1_ecgwpp3", "creation": 1545675271, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "findingmyniche", "text": "I just turned 36. I was in a similar boat. Not miserable, but kind of a solitary person with no interest in much. Had had relationships, but not great ones. All my friends have moved away.  Just kind of melancholy no desire for anything.\n\nThen I started taking martial arts 3 months ago. It's like the secret ingredient I've been missing my entire life. I love it. Even when I don't feel like going to class I go anyway and always have a great time. It works through stress. It's physical activity. Motivation to work out at home because I want to be conditioned. I am making real friends. I feel like I'm approaching one of the best times of my life. I'd definitely suggest reading about different martial arts and choosing one that sounds appealing. I do feel like a got lucky on my gym and found a group of people I fit in great with. Maybe try a couple different gyms if you don't like the vibe of one place. They usually let you come check the place out, watch or take a week of classes for free.\n\nIf not martial arts maybe keep trying various hobbies and meet ups. Seems like the magic happens when you find something you're really interested in and a group of people that are also into it enough that they meet regularly to do it. Sports, geo caching, book club, etc. Then friendships grow from there.\n\nMaybe get some space from your parents for awhile? I remember going through a phase in my mid/early twenties where my dad was trying to be more overbearing because he was having trouble feeling like he should still be more in charge of me. And I was extra angsty getting very angry if he tried to tell me what to do. Time and space seemed like the only thing that fixed it. Maybe you all haven't had enough time and space from each other for them to healthily accept you as an adult, you to accept yourself as an adult and both of you to form better boundaries. The overbearingness and overprotectiveness comes from a good place, but it wreaks havoc on relationships and development. \n\nKeep at it. I've found it's always when I'm least expecting it, really invested in my interests and just content with life in general that big changes like relationships sneak up on me. ", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecgwpp3/"}