{"id": "t5_2tand_t3_a8xt60_t1_ech1l73", "creation": 1545679226, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "EdGG", "text": "Alright, i feel a bit identified with your story, so let me give you a bit of perspective through mine.\n\nFirstly, that was wonderfully written. If you can write, you can talk. Meeting people in your 30s seems a bit strange, but it really isn't. There are lots of us here (I'm 39). I also never had a real relationship until I was 30. I did have a fling at 27, but I feel your pain... Loneliness is a bitch. But luckily, it's a bitch you can ditch. You have a job, and seem to be ok at it. That gives you plenty of room to focus on yourself. Gym, awesome. Being a bit stuck with your parents seems like a big deal to you too, so you know what to do; you can start slowly, making your own meals; I'm sure you can YouTube some things here and there and start cooking for yourself.\n\n Think of the person you'd like to be, and think of what could make that person... You did it before by choosing a career; you know your priorities. Seems like a well spoken man that isn't a kid (to me that's 28 and up), has a job, and plays an instrument has quite a bit going on for him. You aren't uninteresting (and I tell you, there are a lot of boring people out there), so you've built a great canvas there, but you need to... Well, put it out there. \n\nThat means you'll have less parents' time, but more time for other things (mainly yourself and getting out of your comfort zone). Go to a bar and talk to a stranger, no expectations. Ask him/her just for the sake of talking, and see what happens. If nothing happens, that's already more than you had. Be polite and leave your baggage at the door; you aren't that grumpy old man you're making yourself to be, and I'm sure you know it.\n\n You're the person you want to be, in the making.\n\nGo to a different gym and offer to spot someone, or ask someone to spot you, and introduce yourself. Ask if you can take turns on a specific machine with someone. No expectations, other than remembering his name.\n\nI turned my life around on my 30s. I moved to another continent so I had to start from scratch. I now have great people around me, a better job, know myself better than before, and I know I'm still working on me. Don't currently have a girlfriend, but I have had a few interesting relationships with great, great women, and I've had more flings and dates than I can remember. Loneliness is an option. I go to certain bars or events, or gyms, or cafes, and I always bump into people I know. I always have a good word for everyone, and I introduce them to my other friends now that I can. A couple of birthdays ago I invited a few people to my birthday a day before (didn't plan), expecting maybe 15-25 people to show up and around 80 made it. The place was offering me free open bar and bottles just to move some to a different area!! And I know for a fact I met all of them after I was 33. Hell, I met a few new friends on that party!!\n\nTime is on your side. You've been investing it in different areas, and now you want to diversify... Good. Do it.\n\nPM me if you're feeling stuck; I'm not in your time zone, but I'll reply.", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ech1l73/"}