{"id": "t5_2tand_t3_a8xt60_t1_ecg287d", "creation": 1545637780, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Dyesce_", "text": "You don't have a burn out, you have a bore out. Google that. You also have a smart sister. \n\nI read that whole thing. You repeat yourself. You also know exactly what you have to do. Do it. Not tomorrow, from now on! \n\nStop mooching on your parents. If you go over for dinner, bring a dish. Learn to cook. Clean up your whole appartment. Redecorate. Or rather decorate in the first place, as my gut tells me. \n\nStart doing thi ga for your parents. Help.your mom with household chores. Go shopping for them. Whatever, just stop being the spoiled kid. It's your decision, you are grown. \n\nDo things. Stay out, go places. Go to concerts. You like music, go with that. Your job has nothing to do with it, don't change if you don't have to. \n\nNobody wanta to hang with you not because that's not something adults don't do but because you are not good company. I am over ten years older than you and all my friends love to just hand and play games. We do boardgame days regularly and play video games all the time. Online and at someone's place. \n\nYou probably complain a lot. Nobody want to hear that. It sounds like \"My life is like a vacation all the time, I get fed and cleaned and it is sooooo horrible!\"  \n\nI get why you are unhappy. You have no challenge at all and thus no reason to live. Never a success or a learning experience fail. It is actually horrible. \n\nI am your karmatic opposite. I've been through so much shit, most of it might learn fault in some way. Now my life is just awesome. I can compare with poor times, with sick times, been through burn out and depression and cane out the other side.  I don't know what could happen to not make me appreciate every day. Even on migraine days I find worth and thankfulness. \n\nYou need experience. Go, get it. \"Move out\" from your parents. Do visit them, you don't know how long you still have them, but be a guest at their home, not the little kid. \n\nAnd have a heart to heart with your sister. She can help you. Let her shout at you but try to do as she says. \n\nI know I sound like an asshole. But since you already know what's wrong and even how to fix it you do need a kick in the ass to start. \n\nAnd frankly, that's what you're here for. ", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecg287d/"}