{"id": "t5_2tand_t3_a8xt60_t1_ecg80jh", "creation": 1545647223, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Orothrim", "text": "Hey man, there are a few basic ways you can go about this and they have all been suggested already, so I'll just put them together.\n\nSudden Stop:\nMove house far away from your support network, forcing yourself to learn the skills you haven't developed, I recommend another country, since that will also be exciting for you.\n\nSlow Climb:\nSlowly make changes in your life, say take up a dance class, perform music to an audience each week, cook for your parents, not them for you, get a website blacklist on your browser to block you from viewing sites you are wasting your life on, do your own laundry.  This could work, it will require you to constantly make small changes.\n\nScorched Life:\nGet a small storage unit, put your computer, and guitars in the storage unit.  Sell everything else, buy a small laptop you can do basic website development on, make an account on one of those freelancer websites.  Get a one way ticket to Europe, and don't come back to America until you have visited the capital city of every European country.  Take the laptop to do some extra work while you travel, but accept that saving for retirement is useless for some who is going to kill themselves, so burn some of your savings.\n\nIf you are suicidal I recommend doing a Scorched life, because you literally have nothing to lose.  If you want to kill yourself there is nothing in your life that you feel is worth living for, so burn it down, fight a tiger, go skydiving blindfolded, act as though you have no survival instinct and just experience the world.  I promise, you will find something to live for, and maybe even love.  If you do decide to do this, when you come by London, we should grab a drink, and you can tell me the stories you have gained.\n", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecg80jh/"}