{"id": "t5_2tand_t3_a8xt60_t1_ecfed56", "creation": 1545612513, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 39, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "tuilitb", "text": "Can relate to the situation. Younger than yourself though.\n\nFirst, it is great that despite your bitter, you still had the intuition to look for outside opinions about your personal story. \n\n&#x200B;\n\nFirst, let's have a look at your assets (number of \\* = how good our situation is)\n\n\\- Finance \\*\\*\\*\\*\\* Money leaking everywhere. This will allow you to invest in yourself. But how?\n\n\\- Health \\*\\*\\*\\*\\* You seems to be healthy (not granted for everyone), even willing to do sport. Why not trying another sport? Not necessarily ping-pong but something else. I personally like badminton as you can strike the shuttlecock as hard as you want and it remains an elegant sport. Exercise is good but not that fun.\n\n\\- Career \\*\\*\\*\\* You have a stable position with a excellent salary. Again, not everyone has this. I removed one star though because you don't seem to like your job that much.\n\n\\- Family \\*\\*\\*\\* We definitely have a supportive family. You may not have friends or girlfriends but you DO have your family and they ACTUALLY care about you. Your parents are not directing you in the right direction despite their goodwill. Your sister yelling at you shows that she actually would like you to be better. So the simplest solution would be to contact her and ask her how you change and improve: she WILL help and way better than any Redditor as she knows you better than us. \n\n&#x200B;\n\nThen, the things to improve:\n\n\\- Passions \\*\\*\\* If you have a passion, get good at it and show it to the world. Is there any way you could form a rock band at your company? If you have no passion, then play a sport you like (and chat with your partners), or go volunteering (helping the poor, teaching to children, communal activities, associations): you can't leave volunteering unhappy for, thanks to you, the world is better after your help. At some point, you could even drive a project on your own. \n\n\\- Social/Community \\* : not much apparently, but still, you work with people but what are they doing, they can show you activities you would enjoy.\n\n\\- Love life \\* : none but have you ever taken a risk to trigger a start of a relationship? Again, your sister is the most appropriate person to help you with this topic. But first you gotta love yourself first. Who would love you if even you, don't? This might be the most challenging thing for you but if it works out, it will be worth it. You also want to avoid toxic relationship.\n\n\\- Learning ? Important for me, but what is it that you want to learn? No learning = stagnation. I keep myself alert by wanting to be better in any domain of my interest: more knowledgeable in classic literature (for worldly dinners), male fashion, ..., anything which is not computer/screen-related.\n\n\\- Autonomy \\* I personally value autonomy as my proudest achievement and I wish you had the same. You already have the money: 99% of the job is done, but this 1% is paramount!\n\n&#x200B;\n\nFor me, your goals (prioritized from immediate actions to long-term goals) should be:\n\n\\- learn to cook and stop letting your family cook for you: you lose credibility in front of everyone if they know this. Cooking also does not have to be a constraint: Youtube have nice videos about people making lovely meals and cakes\n\n\\- avoid obviously toxic Internet content if you are still browsing them\n\n\\- tell to your sister that you want to change and that she helps you\n\n\\- experiment things that you have not considered: dancing, walking for an hour in a park, chit-chat with the unknown coworker \n\n\\- meet as many different people as possible: they will open doors you had discarded, they will unconsciously teach you social manners that will be useful for your longer-term goals\n\n\\- create your network of friends: this will be the consequence of the previous point. They could be colleagues, sport partners, other volunteers, family, ... From this network, you may eventually find your soulmate (= person that makes you better and vice-versa).\n\n\\- look for another/different job, more in line with your nature: this is where your savings can help you\n\n(- drive projects on your own, and be proud of it)\n\n\\- marry\n\n&#x200B;\n\nThis mere thing of communicating your distress to the world is the first step toward recovery, as you will heal by talking to others.\n\nTell me is this helps.\n\n&#x200B;\n\n&#x200B;", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecfed56/"}