{"id": "t5_2tand_t3_a8xt60_t1_ecgtrcd", "creation": 1545672872, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "A_Good_Soul", "text": "Build some hobbies.\n\nYou like gaming? Call your local board game store and find out when they have meetups in a genre you like. You could just look online but talking to someone about how it works could relieve stress— state you’re new and be honest that you have a bit of worry as to how you get started if you were to just show up. They’ll likely give you tips. You could also try going by yourself beforehand to see the place and talk to them in person, even buy a deck of whatever ahead of time and learn it a little before starting. I bet they’d be thrilled to have you.\n\nWhat about learning a new language? You can look up language schools and everyone will be really self conscious and do poorly...together. Then by the end of a few weeks you will have socialized with others, learned a badass skill you can share with others, and grow a bit of confidence that way.\n\nOnce you get the language skill— or even without— go on a vacation somewhere. I adore solo travel and it teaches you a hell of a lot very quickly. It’s never bad or scary in the danger sense, but you learn to meet new people pretty quickly and see an amazing new place in the world. Maybe Italy or England? Look up hostels— they aren’t just for teens!\n\nTalk to a counselor specifically about creating boundaries. Creating boundaries will help you a lot. There’s no prevailing reason to not rely on your very loving and caring parents so things will stay the same unless you make the firs move. To do that, you create boundaries— creating space both physically and mentally between you and them, such as not showing up one weekend and being ok with it despite mom or dad saying they miss you and want you to come home, etc.\n\nChicago is awesome. Go for a walk in Millenium Park and just observe people. Eat at Yolk and not your parents. Go see a show of some kind. Practice going up to people by just asking for directions even if you know the answer. Tell someone you’re from out of town (I mean, you are) and ask someone if they recommend a place to eat even if you don’t go there. By the end, you’ll have had your breakfast, walked outside in fresh air amongst people (I know, I know. Not the best time of year but put on a jacket and suck it up), and spoken to two or ten or twenty people.\n\nVolunteer. My god volunteer. What does that mean? So some google searches and see what pops up. You have your standard animal shelter, homeless shelter, but also groups like Make-A-Wish have tons of opportunities to help. I bet if you were to show up to a shelter in January when volunteerism goes way down and you were to spend three hours on a Saturday serving the less fortunate, the moment they look you in the eyes and say “thank you” your suicidal thoughts will diminish substantially.\n\nDo all of these and one day you can semi-confidently travel to, say, London and know what to expect when asking people for directions or suggestions, you’ll have a hobby like tabletop games and can find a shop in London to do the exact same thing at as you did at home, hop over to Italy or Spain and practice your language a bit whilst building some serious indépendance and when you return you’ll feel like a badass who just crushed it in a way most people never will.\n\nYou got this, bro!", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecgtrcd/"}