{"id": "t5_2tand_t3_a8xt60_t1_ecfg6ue", "creation": 1545614134, "origin": "t5_2tand_t3_a8xt60", "height": 1, "replied_to": "t5_2tand_t3_a8xt60", "down_vote": 0, "up_vote": 23, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "PastaNotFound", "text": "When individuals havent been teached proper coping techniques by their parents they refer to different things to self-soothe. Your siblings used drugs as a way of coping and it is entirely possible that you used gaming and isolation as a way to self-soothe.\n\nI have had a traumatic childhood where i used distractions as a coping mechanism (dissociation). Whenever i feel like shit i will just throw myself into games, movies, music, daydreaming and sleeping to distract from my feelings. Ask yourself if you do the same?\n\nFew months back i found r/cptsd which is a sub for people who went through childhood trauma and are struggling with the problems it left behind. Don't think of only physical and sexual abuse but also emotional abuse and neglect (just as damaging).\n\nThere is a book they recommend called \"Complex PTSD: From surviving to thriving\" from Pete Walker. It explains what cptsd is, how it is developed and how it influences your behaviour. Beware that it can be a hard read if the information given hits home. \n\nSymptoms of cptsd (see if they fit): \nEmotional Flashbacks (non visual), Tyrannical Inner &/or Outer Critic, Toxic Shame, Self-Abandonment, Social anxiety, Abject feelings of loneliness and abandonment, Fragile Self-esteem, Attachment disorder, Developmental Arrests, Relationship difficulties, Radical mood vacillations [e.g., pseudo-cyclothymia], Dissociation via distracting activities or mental processes, Hair-triggered fight/flight response, Oversensitivity to stressful situations, Suicidal Ideation\n\nThey explain all these symptoms above in that book i mentioned before if youre curious.\n\nWhew this turned into a long ass reply, hope it can help though. ", "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/ecfg6ue/"}