{"id": "t5_2tand_t3_iz7raj_t1_g6jfcx3", "creation": 1601045214, "origin": "t5_2tand_t3_iz7raj", "height": 1, "replied_to": "t5_2tand_t3_iz7raj", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "erinpanzarella", "text": "Hi love. I’m so sorry for your loss. \n\nMy dad passed away in May 2019 and the grief still overwhelms me at times. It can feel super alienating especially if you don’t have people who can relate to what you’re going through. But you are not alone ❤️ \n\nI completely relate to everything you wrote out. Some days I feel like I’m worse than before because I “know” what to do and can’t get myself to do it. But this is part of being imperfectly human. We are not meant to have it all figured out and sometimes life is really really rough. I wrote a post a few weeks ago and someone literally said I needed serious professional help in a derogatory way and I feel like we’re often taught it’s problematic to get help or that the feelings that come up in this human experience are somehow crazy. \n\nwe are meant to feel it all and sometimes that fricken blows. But I’m learning to sit with the feelings instead of push them down bc I spent years repressing stuff & they only fester. I am so proud of you for how far you’ve come and for recognizing that it may be helpful to get some outside professional help to hold space that we often don’t have in our daily life. I’ve been teetering on starting therapy to help me deal with the overwhelming things. \n\nYour sadness and anger are totally valid but they’re also fleeting emotions that pass with time. I had these feelings this week and even though they hurt a lot, I also had this sense that as long as I allowed them - they would pass eventually. \n\nYou got this. You’re aware of what’s going on internally which is the biggest battle. Most people are just meat suits walking around & while I used to envy those because “ignorance is bliss” - I also realize ignorance is also ignorance and I’d rather be participating in my life than just going through the motions and awareness helps me do this. \n\nYou’re doing a great job. ❤️", "permalink": "/r/DecidingToBeBetter/comments/iz7raj/i_missed_meditating_for_a_day_and_instead_of/g6jfcx3/"}