{"id": "t5_2tand_t3_ha8y3l_t1_fv42e6s", "creation": 1592393344, "origin": "t5_2tand_t3_ha8y3l", "height": 1, "replied_to": "t5_2tand_t3_ha8y3l", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "JustMrX", "text": "A lot of good advice has been given in the above comments! But there's a little tip I would like to add.\n\nIf I were you i'd stop trying to think of writing a BOOK everday. I'd try to make it small. The trick is to make the next step so small it is impossible to fail. \nExample:\nA book contains a story, a story is made of chapters, chapters are made of paragraphs, paragraphs are made of sentences, sentences are made of words, words are made of letters, letters are written with a pen. The first thing you do to write a book is pick up a pen. \n\nSo no matter how stupid it may sound, just pick up a pen and view it as progress towards your book. No matter whats next. If you feel like gaming, drop the pen again, be satisfied with the small step you took and enjoy the game! (You might even enjoy gaming because you told yourself you also made progress towards your book). Do this for a few days and when you feel like taking the next step, start writing. Write at least one word. Even \"chapter 1\" will do the first day. Next day write (at least) one word again. The name of a character, the town the story takes place, etc. You'll soon start to write multiple words and after that multiple sentences, multiple paragraphs, chapters and eventually...the whole book. \n\nEvery step counts, no matter how small. By picking up a pen you are closer to writing a book than without picking up a pen! \n\nGo for it! You can do this! \n\n\nPS: on another note. Stop \"trying\" to do it, just DO it (or don't). But by saying you'll \"try\" you are already creating an excuse for yourself to justify not doing it (\"well at least I tried\") often used by people afraid of failing (yes....speaking of experience....).", "permalink": "/r/DecidingToBeBetter/comments/ha8y3l/im_so_fucking_lazy_i_wasted_this_whole_quarantine/fv42e6s/"}