{"id": "t5_2tand_t3_ha8y3l_t1_fv1p8lj", "creation": 1592336558, "origin": "t5_2tand_t3_ha8y3l", "height": 1, "replied_to": "t5_2tand_t3_ha8y3l", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "quietpartyguy", "text": "Dude, you're not alone.. I feel you.\n\nIn my case I want to improve myself, so I've been trying to read books and working on my hobbies. I feel like I'm wasting my time on videogames (like you, I suppose?), but I tend keep playing these games instead of trying to do something creative with my hobbies. As a matter of fact I'm actually trying not to play some game right now, but I just came across this quote that someone posted here:\n\n&#x200B;\n\n**\"Each day you must choose, the pain of discipline or the pain of regret.\"**\n\n\\- Eric Mangini\"\n\n&#x200B;\n\n(god bless OP)\n\nI think that our common problem may not be laziness, but resistance to the things we want to do (and videogames are easier to do), as I've read in the book \" I Could Do Anything If I Only Knew What It Was\" (if I'm not mistaken).\n\n&#x200B;\n\n* This is what I've been trying to do lately: **I try to write, everyday, personal notes on things that I can improve, or failed that day, but also things that I'm proud of** (I'm proud of my productive hobbies, not videogames);\n\n&#x200B;\n\n* I **start things**, and **this is important**, because **we must take action.** Just try to write for a couple minutes, just try it. Just write something, you can set a time, but I think that you shouldn't honestly. But write, everyday (no matter how small the text);\n\nI feel like sometimes when we start something we fell some internal pressure, so, just make sure that **if you don't feel it you don't have to push it, but write something** and if possible, keep going.\n\nI think Mark Manson said something like **\"Emotion inspires action and action inspires emotion.\"** (at least I read this on his latest book, \"Everythings f\\*cked\").\n\n&#x200B;\n\nAnd you know.. **we all need a purpose in life that fulfill us** and videogames do, but only momentarily. If you think writing is your purpose **you must give it a chance or you'll probably regret.** You'll also build self-control by avoiding this temptation  / instant gratification that, in your case (and mine), are videogames and work on something that will make you proud of yourself in the long term.\n\nOn a final note, I must say that we should, obviously, have fun and play some videogames. But it's really easy easy to get addicted on them, also.. take action (**if there's something that you want to do, but you're finding 'mental resistance', do it! Take action!**).\n\n&#x200B;\n\n*Hope this comment can give you some 'emotion' to use some ink :)*\n\nEdit / Extra quote (lmao, sorry, but it fits the post,  just saw it on other sub):  **\"The reason most people fail instead of succeed is they trade what they want most for what they want at the moment\"**\n\n\\- Napoleon Bonaparte", "permalink": "/r/DecidingToBeBetter/comments/ha8y3l/im_so_fucking_lazy_i_wasted_this_whole_quarantine/fv1p8lj/"}