{"id": "t5_2tand_t3_mufqse_t1_gv6etit", "creation": 1618903552, "origin": "t5_2tand_t3_mufqse", "height": 1, "replied_to": "t5_2tand_t3_mufqse", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "messybitch87", "text": "So, avoid fad diets. Learn to count calories. Every single fad diet is just a way to trick you into eating less calories by giving you restrictions on what you’re allowed to eat, but all are incredibly difficult to maintain. Counting calories is the way to go, because you don’t have to get rid of any particular foods, you will just be eating a little less of the foods that you have been eating. Get a food scale off of Amazon, they are like $12, and go to the calorie counting subreddits to start learning. I worked in dietary in a hospital for 5 years, and I promise you this is the only proven reliable way to maintain steady weight loss and hold at your goal weight forever. \n\nWeighing all food and liquids you consume is super easy, and takes literally seconds. Put the weight of the food items into an app like my fitness pal as you cook, which also takes seconds. Literally as easy as putting the food item in the food scale bowl, put weight of food item in the app, dump food item into the pan you’re cooking with, or the plate/bowl you’re eating off of. That’s it. With liquids, put your cup on the scale, poor the liquid in, input weight of it in the app, and done. The only thing you don’t need to weigh is water. For anything that says “zero calorie,” or “calorie free,” put 4 calories per serving into the app. Most food laws allow item to be labeled are having no calories if there are less than 5 calories per serving, so you should assume these things actually have at least 4 calories per serving. Doesn’t seem like much, but it can add up if you have a bunch of liquids that claim to be zero calories. \n\nAlso, you should strongly consider going plant-based or seriously reducing meat and dairy intake. Reducing meat and dairy is great for your overall health, and also typically makes for lower calorie meals, and can be beneficial for other things, like digestion, better skin, etc. \n\nGood luck on your health journey!!", "permalink": "/r/DecidingToBeBetter/comments/mufqse/i_believe_i_was_just_given_my_last_chance/gv6etit/"}