{"id": "t5_2tand_t3_6wbe6k_t1_dm8lusn", "creation": 1503935534, "origin": "t5_2tand_t3_6wbe6k", "height": 1, "replied_to": "t5_2tand_t3_6wbe6k", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "fartwiffle", "text": "None of the activities you state you want to quit doing are bad, wrong, immoral, or something you should never do...as long as you do them in moderation or at your leisure.  If all of your time is consumed by these activities then you should probably consider how much time you are allocating in your day towards them.\n\nHowever, all of the activities you listed are generally things that provide us with intrinsic rewards.  Basically things that give pleasure as a form of happiness.  Pleasure isn't a bad thing, but we need to keep in mind that when chasing happiness through pleasure (intrinsic rewards) that form of happiness doesn't last very long so we're constantly chasing more of it.  The problem with pleasurable activities is that it's easy to get hooked on that little dopamine high that we get from them to the point where we're almost like a junkie looking for the next fix and these things start to consume all of our time and take over our life.\n\nConsider finding an activity that provides you with extrinsic rewards.  This is a form of happiness that I call satisfaction.  Satisfaction is a form of happiness that isn't necessarily as intense or as easy to get as pleasure, but it lasts a long, long time.  It can stay with you for days, months, even years.  Extrinsic rewards (satisfaction) come from activities that take work and dedication to achieve or from helping others or sharing an activity with someone you care about.  Examples would be fitness, learning a new skill, building something, repairing something, volunteering to help others, cooking a meal and sharing it with someone, overcoming a personal challenge, or even something like splitting and stacking firewood.  Many activities that ultimately provide an extrinsic reward aren't necessarily fun while you're doing them (although they can be), but the long-term benefits for your life and your satisfaction with a job well done are really worth it. \n\nFor me personally, once I started working towards long-term satisfaction instead of constantly chasing after pleasure I just found that my desire to those quick-fix activities waned.  It's not that I never watch Netflix or browse facebook or have a tug.  It's just that there's so many more fulfilling things to do with my time that will actually let me be happy instead of making me think I'm happy.\n\nTL;DR: Two types of happiness.  Pleasure isn't bad in moderation, but to be truly happy look for satisfaction.", "permalink": "/r/DecidingToBeBetter/comments/6wbe6k/how_can_i_quit_fappingwatching_pornquit/dm8lusn/"}