{"id": "t5_2tand_t3_nvikua_t1_h14h955", "creation": 1623220403, "origin": "t5_2tand_t3_nvikua", "height": 1, "replied_to": "t5_2tand_t3_nvikua", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Ok_Hamster3522", "text": "You are browsing Reddit or porn for hours most likely because you want to not feel some sort of uncomfortable feeling. This may be done subconsciously, but it is there. Some feeling that you have is driving you to act in a way that you’re trying to escape. Thus the “read Reddit until I’m numb.”  So I would ask that you look at your thoughts that are driving those feelings. Become more aware of those thoughts and the feelings that are driven by those thoughts. Are they feelings you are trying to suppress?  \n\nWhen you feel the urge to go back to the internet and browse for hours, stop and recognize what you’re thinking and feeling at that moment. It may take some time and may take some practice, but you will find it. From there, start thinking different thoughts which will drive different feelings. \n\nStart doing this every day: take 10-15 minutes to write down your thoughts and journal. Sounds like you do this a little bit anyway. But this should be part of the routine. From there you can start to identify various recurring thoughts that aren’t serving you. \n\nYou say “low self esteem” but that you’ve also been to open mic nights. Those seem to conflict to me. It is not easy to get in front of people and do a comedy routine, you’ve done it. What’s stopping you from thinking more of yourself and doing it again? Do you think those in the audience would have the same courage and guts to get up there and do what you’ve done?  \n\nYou’re “taking baby steps.” What do you want to do(eg giant steps?)? What actions are going to get you to your result of being a comic?  Identifying those actions. From there how do you want to feel in order to perform those actions? Perhaps empowered or courageous or focused?  Then from there identify the thoughts that you want to think to generate that feeing. “Today I’m writing three jokes.” “Today I’m gong to absorb the world in order to create comedy.” “I’m going to sign up for 2 open mics.”  Just do it. \n\nIn the end, you are having thoughts that’s drive some sort of feeling that drives some sort of action. Right now the action is Reddit and porn. What are the thoughts and feelings?  From there, how can you change that in order to get to your result?  What can you think, then feel, then act in order to get to your goal?  \n\nIf you have success or failure, how will you ensure yourself and get over it to keep moving forward?  You got this, just look within first, as that is where the issue is. For some people it’s shopping or drugs, for you it’s the internet. \n\nThis is a big goal. You can get there and you can be successful, but clean up your head first. There is so much more to discuss, feel free to reach out. \n\nGood luck, you’re amazing, and I love you too!", "permalink": "/r/DecidingToBeBetter/comments/nvikua/i_know_what_want_to_do_in_life_i_have_the/h14h955/"}