{"id": "t5_2tand_t3_eoni7c_t1_fej5u5y", "creation": 1579158098, "origin": "t5_2tand_t3_eoni7c", "height": 1, "replied_to": "t5_2tand_t3_eoni7c", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "alghiorso", "text": "OP I quit after a couple years of occasionally partaking and a year or two of smoking many times a day. My life was a haze and I felt sick. Like a mental/spiritual sickness like my life was just being sucked out of me and I could do nothing about it. It allowed me to emotionally procrastinate while in a toxic relationship that went on way longer than it should have. I'd show up to family functions, work, and even church high. I told myself it's not that bad. It's not as bad as alcohol and everyone does that. \n\nI can't tell you life is always better sober. Weed sheltered me from some harsh emotions and harder truths about myself and where I was headed. When I quit, those were still waiting for me. Life out here isn't always happy, but it's real, it's clear, and there's a beauty in the grit of the everyday struggle. The friends I \"lost\" were just people I smoked with. Our relationships didn't really have any more substance than that. \n\nI still think about weed sometimes. It made so many things so much more fun. Close to 4 years ago I decided I'd rather have a life that is meaningful than a life that is fun. Pot doesn't have a place in this new life. In the past 4 years, I got married. I've spent half that time living abroad. I've grown a lot in my interests (photography and writing) and really experienced a rebirth in my faith once I decided to start living the life I was pretending to have. \n\nPot wasn't the problem, it was a symptom of a larger problem for me. Might warrant you taking some time to go on a solo hiking trip or road trip to unplug and really do some soul searching. Wish you the best OP.", "permalink": "/r/DecidingToBeBetter/comments/eoni7c/deciding_to_quit_weed_heres_my_story_and_how_weed/fej5u5y/"}