{"id": "t5_2tand_t3_jidw7e_t1_ga6fykz", "creation": 1603728771, "origin": "t5_2tand_t3_jidw7e", "height": 1, "replied_to": "t5_2tand_t3_jidw7e", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "the_noobcat", "text": "My Mom would always say - don't ever look into the neighbors backyard, because the grass is always greener at the other side. But frankly,the same mom would ask me how did another kid do it's test,if I didn't get an A (back in school days), which showed me that we as society are learned to compare ourselves to others all the time. It is healthy and natural ofc,to some point,but not after the point where you do not enjoy your own success.\n\nFirst of all, I would recommend you turn off all social medias that makes you feel bad. For example,girls feel intimidated by unrealistic beauty standards set on instagram,and they should avoid instagram or those beauty pages in order to overcome the feeling of being fat and ugly. So if you look at some people showing off on any social media, uninstall the media for a while. You need to clean your soul from the feelings you get while looking at those posts. Now I know during Covid if we would uninstall everything we would be left alone,so chose only the medias that makes you connected to real friends - I chose Viber and reddit for example, and got rid of facebook and instagram.\n\nSecondly, you really need to become aware of your successes,and not take it for granted. to do so, plan to invest time and energy into thinking about your successes. let's say - every evening from 8 to 8:30 watch photos / videos of yourself when you were being honored or when you performed in front of public, whatever you do, and repeat yourself why are you successful. remind yourself how hard you worked to get there, how many allnighters you had,how little money you once had and how much you earned,or whatever would make you feel proud. You need to exercise this,to even have a bit higher opinion of yourself st the begging,because you deserve to remind yourself constantly how good you are.\n\nThe last thing - don't forget that we all have flaws,the richest people cry and feel same feelings we do,and if we would think of who is more successful,we would never enjoy our little lifes. There's someone more successful than Bill Gates,but does he care? No,he's spending his retirement carelessly, surrounded by friends and family. Remind yourself why did you chose this career path and what about it makes you feel genuinely happy. I'm an engineer/artist and I know my doctor and layer friends are making more money than me,but their jobs would never make me happy! I'm only satisfied when being creative, and I'm very proud of things I've done. My every project is unique and noone in the whole would could make things exactly like me. That makes me happy!\nWhat makes you happy about your job?", "permalink": "/r/DecidingToBeBetter/comments/jidw7e/im_trying_to_overcome_my_jealousy/ga6fykz/"}