{"id": "t5_2tand_t3_osnhs6_t1_h6rbs35", "creation": 1627423556, "origin": "t5_2tand_t3_osnhs6", "height": 1, "replied_to": "t5_2tand_t3_osnhs6", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "tforce80", "text": "Thank you so much for this. I tried reading into Karpman Drama Triangle. I'll be honestly, it's a bit confusing and I'm not clear how to avoid falling into the roles... but it's VERY clear now that, when we fight, I cycle through all the roles. \n\nA recent fight fits this triangle perfectly. My daughter was the Victim (being blamed for getting in the way), my wife the Persecutor (blaming my daughter for doing something she didn't do), and me the Rescuer (trying to help my defend my daughter). Once I defended my daughter, she became the rescuer (trying to stop my and dad from fighting), my wife the victim (feels like she did nothing wrong and I always attack her) and myself the persecutor (yelling at my wife that she should have known better and that she was accusing my daughter falsely).\n\nNone of this is important... but the roles are the problem. My wife and I constantly jump between Victim and Persecutor. My wife is usually the victim, thinking she's blameless and I'm attacking her for no reason.  I'm usually the persecutor, telling her all the things she's done wrong. Then we'll flip. She'll accuse me of always attacking her and that I have the anger problems. I'll become the victim and lay out sob stories of how hard it is for me to deal with everything.\n\nWhat I like about the Karpman Drama Triangle is that it doesn't dismiss or absolve anyone. Everyone has a role and has part of the blame. I shared this with my wife and I think she understood a bit. Hopefully we can avoid falling into the roles now that we recognize it. We need to stop enabling each other in the roles we're comfortable with.", "permalink": "/r/DecidingToBeBetter/comments/osnhs6/husband_said_he_made_my_730am_appointment_for/h6rbs35/"}