{"id": "t5_2tand_t3_q5vb1a_t1_hg8efz9", "creation": 1633963191, "origin": "t5_2tand_t3_q5vb1a", "height": 1, "replied_to": "t5_2tand_t3_q5vb1a", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "NormalTuesdayKnight", "text": "Sorry to hear about your struggles. They’re real, and they’re not small. I dealt with similar things around your age, so I’ll try to tell you some things I learned the hard way.\n\nIf you can’t figure out what you’re interested in, then please take some honest and transparent time to figure out why. For many people, it’s because their parents are emotionally unhealthy and might be verbally abusive, physical abusive, they may gaslight you, be codependent, or any number of other things. For many people at your age, we are just products of our environments. Finding ways to leave home to try and figure out our own selves is pretty important. So, to that end I’ll make some recommendations:\n\nConsider:\n\n1. Changing your major. Don’t worry about how practical the major is. Just pick something that interests you. *Any degree is better than no degree.* Associates’ and Bachelor’s just prove to an employer than you can finish goals and use a computer. If you have a degree and don’t want to do work relating to it later on, there’s nothing wrong with that and many people in the world don’t use their degrees in their careers.\n\n2. Consider finding a roommate. You mention trying to get out of your family’s home. Well, it’s unrealistic - especially in NYC - to try and afford your own place. So don’t!\n\n3. If you’re moving out anyway, then consider going to school online. It will cost less than traditional, and also gives you have the ability to live anywhere.\n\n4. See a psychologist/therapist. Talk to a couple until you find one you like. Not being able to decide what you like means you’re unhealthy somehow. It may be bc of your environment, but nobody has the power to change your life except you.\n\nHope this helps. Hang in there! You can get through this.", "permalink": "/r/DecidingToBeBetter/comments/q5vb1a/any_advice_on_how_to_change_my_life_for_the/hg8efz9/"}