{"id": "t5_2tand_t3_eyr37a_t1_fgk0upq", "creation": 1580855195, "origin": "t5_2tand_t3_eyr37a", "height": 1, "replied_to": "t5_2tand_t3_eyr37a", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "alvinpoh", "text": "I used to, and still find myself, doing these things. It's completely normal and essential to just destress and de-load, but to do it too often is a problem. The issue is that stuff that \"you really want to do\" isn't a good enough reason for yourself. You need to see the end goal and see yourself becoming a great artist (for example, since you mentioned drawing).\n\nThe thing that definitely helped me was to know my **greater vision.** I was pretty lost, and in that state, anything that occupied my time was great. And if it gave me \"entertainment\" or \"enjoyment\", then it made even more sense. That's why you need a reason to say no to these activities and to focus on activities that matter.\n\nThe key is to define what the activities that matter are. That's why a vision is important. For example, if your vision is to be a great artist, then you'd do what it takes to improve your drawing skills. You won't be able to persuade yourself if you just think that \"drawing is a good thing\". That's why you don't want to spend time on Instagram or porn because they're taking time away from your vision and plans. \n\nSimilarly, if you like to cook, and have a vision of becoming a good cook, then spending time watching cooking videos, experimenting in the kitchen, cooking for your friends...all these would be activities that you'd find yourself drawn to doing. You'd have less of a reason to be watching cat videos because you know that your time can be spent on *something else that gives you more happiness and fulfilment*. \n\nPersonally I love having a success plan because it keeps me on track. I've blogged more about how I was lost and I found more fulfilment by creating a success plan:  [https://www.alvinpoh.com/plan-to-become-successful-creating-a-success-plan/](https://www.alvinpoh.com/plan-to-become-successful-creating-a-success-plan/)", "permalink": "/r/DecidingToBeBetter/comments/eyr37a/why_do_i_persuade_myself_to_do_things_that_are/fgk0upq/"}