{"id": "t5_2qh1i_t3_ahg9py_t1_eogejie", "creation": 1558556353, "origin": "t5_2qh1i_t3_ahg9py", "height": 1, "replied_to": "t5_2qh1i_t3_ahg9py", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "gissur540", "text": "I hanged myself about 4 months ago. I'm going to go over what led to that act, and what my recovery has been like.  \nlike most of us, who are actually suicidal... my childhood was not easy. my teen years were even harder..  \nI kind of never fit in anywhere, I changed circles, and my persona like socks. And my mood swings were all over the place.  \nAround my twenties, I started working excessively ( note. I started working around 9 years old, in every school break, and summer breaks, until around 17 years old, when I quit school, to work full time)  \nAnd my back started failing me. And since I was so young, no-one believed me, not even the doctors.  \nSo I just kept working. Started smoking weed to mellow down the pain.  \naround 25 years of age, I had been working as an auto mechanic for around 5 years, and my back just could not handle more, the pains were very severe, and my moodswings severe starting to get WAY worse, and depression becoming evermore severe.    \nI went to the doctors, and they gave me a prescription for  Opioid painkillers.  \nI was on that shit for the next 5 years, and starting to work up to 360-420hrs a month, for that period, because of high rent and living costs in my country, trying to get my debts down and so on. fucked up on those opioids..  \n2 years ago I got an analysis on what had been wrong for the bast 10 years, I had Fybromalgia, and possible slipped disc, and severe Borderline Personality Disorder. so they put me on disability.  \nAnd since living situation in my country, I just could not make ends meet, on disability, so I started working, how do you say it in english, for black money? no tax, basicly illigaly, both at my garage, and other jobs.  \nThose news, and that situation, fucked up my head real good, I had no energy, and was starting to become a zombie, on those opioids, and smoking weed regularly. My friend was selling cocaine at that time, so I decided to give it a try, it had to get my energy up, right!  \nOh boy it did, live suddenly became wonderfull, I had my energy up, and my self confidence went up, I could work more, so I started doin coke on a daily basis, alongide those opioids, and the weed.   \nBut I didn't realize that I was doing more painkillers, and my cocaine usage was getting up, since I had unlimited amount for free, from my friend.   \n8 months ago I lost my apartment, so I had to sleep in my garage for about 5 months, over the winter... In Iceland, with no heating.. I started to get worse and worse, getting sucked into that quicksand.  \n5 months ago, I got another garage, with a small apartment on the second floor, a fucking dream, to a car nut like me.  \nI was using excessive ammounts of pills an cocaine, My metabolism stopped, my weight plummeted.  \nAnd I was so far down into the quicksand that I saw no way out of it, no matter what.  \nSo I did the obvious choice, I killed myself. I was hanging in that rope, dead, for almost a minute, downstairs in the garage....  \nI was just lucky, that my girlfriend at that time, and her friend were upstairs, which I did not know at that time.  \nHer friend saved me.  \nI cannot recall what went through my mind before I blacked out.  \nBut I remember coming back to life... I was in a white void of nothingness, then It kind of felt like waves, and I started seeing reality, at the corner of my eye, I did not know what was happening, or that I had hanged myself, this feeling is kind of hard to explain.  \nThen I felt like I had a choice, go to whatever I saw at the corner of my eye, or continue down into that white void.  \nI chose not to go  down that void, fuck.. it wa the hardest thing I have ever had to do in this life, because that void kept sucking me down, and I had to struggle REALLY hard, to fight it till I got out of it, and BAM, I was back, Alive!!!  \nAnd my whole life flashed in front of my eyes in a split second.  \nI fell down onto the floor, and cried for I don't know how long, felt like hours.  \nI was taken to the emergiency room at the psych ward, They did not let me in to the ward.  \n(mad starvation in the health care system in Iceland )  \nso I was sent home.  \nthe next day, I consumed so much cocaine and pills, it could down a horse.   \nI snapped, like in that scene in Pink Floyd The Wall. I destroyed EVERYTHING in my apartment and in the garaga, I destroyed the car aswell, EVERYTHING.  \nthen I stormed out, my hand covered in blood, from cuts, from that crazyness, I have no idea how those deep cuts happened. when I came outside, I heard sirens, and bunch of blue lights, so I ran for it, The cops got to me, and threw me into a cell, took all my clothes.. they left me in a cold cell for hours, That is no way to treat a sick individual, I yelled and kicked the door, demanding to go to the psych ward, without use..  \nso I started headbutting that steel door, untill the guy in charge came.   \nSince I kind of knew him ( he did not know that I was there, untill that moment ), he called the ward, and did not take no for an answere, and got me in.  \nI spent 7 days in that ward, going through withdrawl from cocaine and oxy, fuck, it was hell!  \nafter that I went to rehabilitaition for 5 weeks.  \nsince then I have been in followup apointments, and support groups, It has not been easy. but I feel alot better today.  \nBut I am 30 years old, and I am not allowed to work, strickt orderes from my doc.  \nMy grandparents took me in, so I can save up some money.  \nAnd in two months, I am moving to Spain, my parents live there, and I can keep my disability over there.  \nSo yeahh, I think my life is getting better today.  \nI realised, what an utterly stupid thing this was.!!  \nIf anyone is thinking of ending it... DO NOT DO IT, things will get better, and life is precious.  \nSorry for the long post, just feels so good to let it out.", "permalink": "/r/AskReddit/comments/ahg9py/suicide_survivors_of_reddit_what_happend_to_you/eogejie/"}