{"id": "t5_2qh1i_t3_ahg9py_t1_eoownd4", "creation": 1558749534, "origin": "t5_2qh1i_t3_ahg9py", "height": 1, "replied_to": "t5_2qh1i_t3_ahg9py", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "jazmxnes", "text": "I severely overdosed on a Friday night, and woke up very woozy and out of it on the following Sunday afternoon. I asked my mom everything that happened and she told me. I have no memory of any of it. \n\nSaturday morning, after my overdose, my mom had called my phone to wake me up for breakfast. I didn’t answer so she assumed I was still in deep sleep. After a few more minutes she sent my three year old sister to wake me up. \n\nShe couldn’t wake me up.\n\nMy baby sister (who didn’t understand) told my mom that she couldn’t wake me up. My mom thought I was pretending to sleep to get her away, so she came upstairs to my room to wake me up herself. \n\nThat’s when she saw the bottles on the side of my room. \n\nThe ambulance came. I wasn’t able to breathe on my own, so they intubated me. While in the ambulance, the paramedics drilled down to the bone of my leg to deliver an I.V., which I really think was unnecessary. \n\nMy dad, who was in the ambulance, said I woke up and reacted and tried to fight the paramedics after they drilled my leg. \n\nWhen I arrived at the hospital, (I’m assuming I had lost consciousness again by the time I got there) I was admitted to a room. They pumped my stomach to remove the toxins, then infused it with charcoal when they finished. \n\nWhen I was somewhat stable, they set up an I.V. to deliver fluids, and inserted a catheter to collect my urine. (I had urinated myself a few times since I was loosing control of my body functions)\n\nI have absolutely no memory of what took place those two days. To me it felt like a 15 minute nap. I was in the regular hospital for four days on suicide watch, then resided in a mental hospital for four more days. \n\nIts been 7 months since then, I’m still fighting with severe depression and constant suicidal thoughts. Every once in a while though, I feel happy that I survived and hopeful that my situation will get better.", "permalink": "/r/AskReddit/comments/ahg9py/suicide_survivors_of_reddit_what_happend_to_you/eoownd4/"}