{"id": "t5_2tand_t3_oll3ow_t1_h5gbr6l", "creation": 1626475528, "origin": "t5_2tand_t3_oll3ow", "height": 1, "replied_to": "t5_2tand_t3_oll3ow", "down_vote": 0, "up_vote": 17, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "latraductoranerviosa", "text": "I've been through what you're feeling, mate, and I know how much it sucks. My past still crops up in my thoughts and bothers me sometimes, but when it gets real awful and I really start beating myself up and ruminating, I just remind myself that of all the people in the whole history of the world who wished they could go back and change the past, exactly 0 of them have succeeded. I beat myself up for long enough about my mistakes, ranging from mildly shameful/embarrassing to outright horrible, and continuing to punish myself will only negatively interfere with my life in the present. \n\nI'm not that person anymore. I can't change any of it, but I do have control over how I live and do things now. It took a few years for me to get my life together and change for the better, but I went from being an alcoholic mess in a year long depressive episode so deep I couldn't hold a job, rarely showered, and drank from the moment I woke up until I went to bed (blacked out, more like) to a college graduate, self employed as a translator who doesn't drink anymore (apart from the very rare solitary beer I occasionally have with a steak dinner) and who more or less has her life together. I also don't negatively impact the few people in my life anymore, aside from the occasional mistake that everyone makes from time to time (accidentally hurting someone's feelings via misunderstandings, for example). \n\nIn essence, if you have changed or are changing for the better, you've learned from your mistakes. Your post suggests this is where you are. The past is no longer in your control, so leave it behind you where it belongs and focus your energy on improving your life and yourself now. It's the only way forward. =)", "permalink": "/r/DecidingToBeBetter/comments/oll3ow/i_regret_my_past_and_it_kills_me/h5gbr6l/"}