{"id": "t5_2tand_t3_oll3ow_t1_h5ieml9", "creation": 1626526251, "origin": "t5_2tand_t3_oll3ow", "height": 1, "replied_to": "t5_2tand_t3_oll3ow", "down_vote": 0, "up_vote": 11, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "moeru_gumi", "text": "You just start small!\n\n\\>it’s quite big so almost daunting to get started.\n\nYou've put your finger right on CBT and you didn't even realize! How would you help someone clean their house if it was really messy? Walking in, you say \"oh, this is a big job!\" But what's the most logical way to get started? I would make a *list* of the things I'd need to buy (gloves, trash bags, dust mask, sponges, a couple basic cleaning products). I'd get those things and come back. I'd ask, \"What rooms do we *absolutely need to fix first*? Ok, kitchen, bathroom and sleeping area. Let's start in the bedroom for now.\" (Triage!)\n\n Then we would go to the bedroom, assess where there are piles of 'stuff' and find out what's the *biggest things we can remove immediately* to make some room. Grab big piles of trash at once, drag those out. You do the left wall, I'll do the right wall. Find things they want to keep, *put those in a box for later*, and move them outside for now. Get down to the carpet. Move furniture. Grab the little bits of dirt and old food containers, just get down to the bare room as soon as you can, get the bed out, open the windows. Then you start cleaning the surfaces. Then, slowly, you can bring back in only objects that they really are gonna keep, and you put them back nicely. Then you move on to the bathroom. :)\n\nCBT is reeeeeal similar. Make a list of things we are gonna need here-- techniques for anxiety, self-esteem help, there's definitely some trauma swimming around in there, poor sleep, compulsive eating, fear of dogs, PTSD from a car crash, bad relationship with mother-- starting to make a plan for what we are gonna address. All those things are probably symptoms of events, and have grown like a callus or an infection around a painful event or REAL problem. \n\nSo, remove the big things you can move immediately. Poor sleep, let's try some basic relaxation techniques. Problem at work today, let's talk about how you just didn't feel confident in the moment, but it's ok, let's try these phrases tomorrow at work. Drink two extra glasses of water today and write down how you felt later. have a bit of a cry and see how you feel afterward. Write down befores and afters. Immediate patch on the problems, but we are trying to move some big and immediate emotions so we can start on the deeper things in a calmer and reflective state!\n\nAfter thinking deeper about memories, problems and events that led to problems, you start to realize that some behaviors you've made a habit were once really useful (like staying very quiet while parents fought) but now, as an adult, are unhelpful (having a panic attack when someone criticizes your work). When you suddenly see that link it's like a huge light bulb turns on and you see all this shit that didn't make sense before, or you THOUGHT made sense or just dismissed as 'normal', or accepted someone's poor excuses, but then you say \"hooooly shit, that was actually really shitty. No wonder it messed me up! Holy shit! ... Ok. NOW what do I do about it?\" \n\nNow we're down to the carpet, man! \n\nAll of this takes time and its a slow and patient work, like gardening. Lots of journaling is usually involved, as well as repeating phrases that you don't reeeally think are true at first (\"I am perfectly capable of doing this. I am smart and my coworkers like me.\")... but the trick is, you've been repeating things to yourself for YEARS that are **NOT true** like \"I'm dumb, I'm no good.\" And once you start changing the internal monologue you will find it changes the emotions that follow those words.\n\nsorry for wall of text, you got me just at my first sip of coffee when I'm really full of words in the morning. CBT is like exercise, might look scary and uncomfortable at first but the more you stick with it, the more you feel AWESOME. :)", "permalink": "/r/DecidingToBeBetter/comments/oll3ow/i_regret_my_past_and_it_kills_me/h5ieml9/"}