{"id": "t5_2qh5i_t3_vsoor_t1_c57f4ez", "creation": 1341002498, "origin": "t5_2qh5i_t3_vsoor", "height": 1, "replied_to": "t5_2qh5i_t3_vsoor", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "keakealani", "text": "This is a really good point - thanks for bringing it up. I wonder how this could be implemented, though, in some ways. I love the idea of stressing positive talents -- I think both people who are considered disabled or special needs and those who are considered \"normal\" have come across many instances of being judged and classified by weaknesses more than strengths (you know, the \"misbehaving\" child, or the \"hyperactive\" kid). But some talents are so far removed from what is traditionally stressed in, say, a school environment, that it's hard to nurture those talents in the context of the kind of \"core education\" most schools focus on. I like the idea of more specialized schools like music, art, or pre-professional vocational schools, but I also wonder how you can necessarily best harness some of the very unique and hard-to-qualify talents found in so many individuals. Even for myself, having been a music geek and pretty talented as a kid really didn't help me until I was able to major in music in college; throughout my middle and high school years I often struggled academically because I was busy with a rigorous performance and practice schedule and wasn't able to keep up with homework. It would have been nice to go to a music school, but they're not readily available and it would have involved strict audition processes, that due to my lack of formal private training I wouldn't have passed, plus if I got in it would mean moving to a boarding school 5000 miles away from home, plus all the financial burden associated with that. \n\nI hope one day we really can help everyone nurture and grow their own talents rather than pigeonholing kids because they're differently abled, but I just don't know how to do that in a practical sense.", "permalink": "/r/happy/comments/vsoor/my_friends_sister_and_her_boyfriend_both_have/c57f4ez/"}