{"id": "t5_2qh5i_t3_vsoor_t1_c582k4n", "creation": 1341163411, "origin": "t5_2qh5i_t3_vsoor", "height": 1, "replied_to": "t5_2qh5i_t3_vsoor", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "keakealani", "text": "Hmm. That's a really interesting thought. I have to say, my experiences both really agree and in some ways not so much agree with your proposal.\n\nThe high school I went to, for the most part, did allow that kind of choice - we had to take either five or six credits per semester (one credit for each class except for things like PE and marching band where you had to take multiple semesters to get the whole credit), and we had some basic graduation requirements in terms of credit numbers. If I recall correctly, I think the basic requirement was 2 years of science, 3 years of math, 3 years of social studies/history, 2 years of visual/performing arts or music, 2 years of foreign language, and 4 years of English. So out of all the subjects, the only one you had to do your entire high school career (unless you summer school'd your way out of senior English) is English. And being a relatively big school (~1600 students in the high school) we got a lot of options for which classes we could take to fulfill the requirements, like AP classes and topical classes like women's history, Asian-American literature, 3-4 different \"tracks\" of math class (basic, regular, honors, and AP for upperclass), etc.\n\nPersonally, I really liked that idea - I took my requisite two years of science, then replaced that credit with taking a second foreign language my junior and senior years. It gave me a lot of options in college because I was able to make a choice about which language I pursued for my college graduation credit, and besides just allowed me to learn something I'm interested in, rather than something I'm forced to learn, which was nice.\n\nI definitely think this could be taken further to allow more choice -- even allowing students to go to other schools nearby to access classes that aren't available at their home school. It definitely is important to allow choice for students and let them take responsibility for the things they learn in class; it would also benefit students to be in classes where everyone *wants* to be there, and will actually try to learn and participate positively rather than being brats because they hate math or whatever nonsense.\n\nThat being said -- this may be a little of my own youth showing, but I do wonder about the decision-making process here with a lot of younger students. In college, sure, you're an adult and you should make the decision about your major and go and do that, without being saddled with a million classes you don't like and will never use. In high school? Maybe, with some guidance (in my school we had two deans assigned to every grade level who did a personal meeting with you to discuss scheduling each year, as well as faculty advisors who could be met with to get ideas on scheduling), but it's still entirely possible that high schoolers could make a less-than-stellar decision and really get screwed over later because they don't know a relatively basic skill, having never taken that class. With middle and elementary, I'm not so sure. I am sure parents and families could get involved, and I am sure teachers and advisors could be consulted, but I'm uncomfortable still with younger students focusing on one subject at the detriment of another, only to find out later they hate that one or aren't very good at it in the high levels.\n\nIf you had asked me where I'd spend academic credits and what I was good at and interested in, the answers would be vastly different depending on my age -- in elementary, it would have been math hands down. In middle school, science. By high school, it would have been languages, English, and history. But in college it's music without a doubt, and that's the career I'm going for. And I admit, the chances of me doing math outside of balancing my checkbook is really slim, and my ability to speak passable Mandarin and Japanese is not terribly useful studying Western classical music. But, the skills I developed taking these classes (even math, which I hated and almost failed in high school) have fostered skills that help me in my music studies - communication, organization, recognizing patterns, understanding social context. Skills in almost any field can be applied to many other fields, and I do think you can get a broader wealth of knowledge by learning these skills through a variety of ways rather than just a few, even if it's hell to get kids through some of them.\n\nOf course, as a musician I do get up in arms about music education. And I'm sure there are other subjects that feel the same way. The problem is that they're being cut for the wrong reasons, not because of demand but because school admins don't see them as important. And that does reflect a generation of students who similarly don't see music as important, and therefore won't give it a chance as a class. That's what I worry about with any overhaul of education, which is probably why things never do change. But it's so worrisome that during the \"pilot period\" something valuable could be lost because there's low demand, often due to outside factors. And that's not something I'd like to try, because it has dire repercussions later. Going to a public university as a music major with people mostly educated through their public high schools, who are cutting music left and right, was a big eye opener for me -- skills that I considered basic coming to college were completely beyond half the freshmen because they hadn't learned them or even been told they were important. Those same students often never catch up, skirting by on easy teachers and barely-passing grades, and those same students are the next generation of music teachers. Once the importance of basic skills leaves the world of school, it becomes a very vicious cycle.\n\nAnyway, I went off on so many tangents here it's insane. Thanks for letting me ramble about my other passion, education reform, to you, even though it's sort of random and stupid at times. I think I might even see if there's like r/education or something to talk more about this, because it's really interesting to think about.", "permalink": "/r/happy/comments/vsoor/my_friends_sister_and_her_boyfriend_both_have/c582k4n/"}