{"id": "t5_2qh5i_t3_vsoor_t1_c57gkhe", "creation": 1341008543, "origin": "t5_2qh5i_t3_vsoor", "height": 1, "replied_to": "t5_2qh5i_t3_vsoor", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "vplatt", "text": "I don't know that there's a simple answer, especially for kids at a younger age.  I do know that I want to see schools provide equal access to educational resources so that at least everyone has the same basic opportunities to learn.  Of course, their abilities to take advantage of those opportunities are going to vary over time, even for so called normal kids.  That said, we can acknowledge up front that children aren't all going to cost the same to educate, especially if they have a disability of some sort, but I don't like see states burdened with the huge costs associated with trying to keep the profoundly disabled in mainstream classrooms.\n\nSo... yeah, not simple at all.\n\nThat said, I think that the system as we have it now isn't all that bad.  It's tempting to point fingers at schools and blame everything on them when technical skills are in short supply in the market and when there are so many students under performing their potential, but there are other factors in play here for which schools really can't compensate, e.g. poverty, overly choosy employers, etc.  \n\nThe bottom line though is that lower education is about personal development and capability so I could imagine a school system with perhaps a bit more market driven focus to help ensure those occur.  \n\nFor example, if every student could choose how to spend their allowance of academic credits in school and were rewarded with better job prospects or just more interest in education in general, I think we would see a reshaping of the school system around those demands rather than allowing the school system to dictate the educational regimen of students based on mere tradition.  OTOH - People in general think it's a bit crass to make primary school, jr. high, and even high school students worry about educating towards specific job prospects; but really why shouldn't students and their families have some control in the matter?  It's their lives!\n\nI know we already do this to some extent in high school, but I'm actually thinking there should be more choices of this sort allowed throughout all of K-12.  Educators assume that everything they're teaching children today is absolutely critical, but if Johnny can't sit still for music, but absolutely rocks math class, then why not let him play to his strengths?  This is particularly relevant in middle school and beyond where SO much time is wasted on things that most students will not use.  I guess that's a matter of opinion, but I'm old school in that I believe only in the \"three R's\" of education + science and the rest should be based on demand.", "permalink": "/r/happy/comments/vsoor/my_friends_sister_and_her_boyfriend_both_have/c57gkhe/"}