{"id": "t5_2qh5i_t3_ar71qe_t1_egl788o", "creation": 1550307035, "origin": "t5_2qh5i_t3_ar71qe", "height": 1, "replied_to": "t5_2qh5i_t3_ar71qe", "down_vote": 0, "up_vote": 335, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TheFancyFoxy", "text": "I hope no one minds me using this post as a way to highlight my symptoms pre-diagnosis?  I wish I'd had even the foggiest inkling that these were linked to Hodgkins Lymphoma cancer!\n\nMy symptoms included:\n\n**Persistent Lethargy and Fatigue** \\- turns out I'm not just a social flake, but that feeling exhausted and unable to do things is a common side effect of this cancer.\n\n**Back Pain** \\- if it weren't for the back pain, I could have been in a much worse position. It was the symptom which finally persuaded me to pursue medical intervention and led to the diagnosis (admittedly six months later!).\n\n**Itching** (all over) - of all the symptoms, this is the one which has been causing me the most distress. Some days I want to take a potato peeler to my legs and be done with it.\n\n**Getting Sick Easily** \\- seriously, I thought I was just unlucky because I seemed to catch all of the bugs that were going around. Turns out it wasn't a biological talent - but that it was probably a symptom of my cancer!\n\n**Night Sweats/Chills**: This should have been quite a big red flag, but because I was always coming down with bugs (see above) I put it down to yet another cold-like infection.\n\nIt's easy to look back and think 'why didn't I notice earlier?' (you know, before my cancer got to Stage 4), but the truth is that hindsight is 20/20 and when you're actually living through these symptoms they feel so unrelated and random. They were spread out over weeks, months and even years, so I'm trying not to be too hard on myself about not spotting a pattern earlier.\n\n&#x200B;\n\n**EDIT:** One other thing I'd like to mention, since this post has taken off and you've all been so wonderful, and because I've received a number of very heartfelt and open DMs from others in recovery from cancer.\n\nYes, I am overjoyed to be in remission. It's completely the best news I could wish for, and something many other people sadly never get to hear. Cancer is a horrible, horrible disease which is cruel and unpredictable, and I know far too many people in just my own social circle who have been affected by it. I'm happy to be here, and so grateful to everyone who helped pull me through - from the NHS workers and my family, through to r/cancer and r/lymphoma.\n\nBut, as I'm discovering every day at the moment, surviving cancer doesn't always mean bouncing back and thriving. It's not always a 'fresh start' or a chance to build yourself up as stronger and fitter than before. It can be incredibly isolating and a real struggle. In fact, as crazy as it sounds, I’m certainly finding ‘recovery’ more of a challenge than chemo.\n\nRecovery isn’t as structured as treatment, and although chemotherapy was super rough, at least when I was attending chemo there was a sort of safety net. The nurses would check my bloods, there were doctors nearby, I was having regular scans etc. Suddenly it’s just me and a very very unfamiliar body which doesn't really work very well anymore.\n\n[Here's a great article](https://metro.co.uk/2017/11/21/why-the-trauma-of-cancer-doesnt-end-after-treatment-7094279/amp/?__twitter_impression=true&fbclid=IwAR1LkTKP6IrLXFgc7xHUMoOaOPEqucxJYPJZNY-eds3zLg9XpvBhElbUTkw) which was published in 2017 about some of the feelings and issues that go hand in hand with remission for many people. I've also set up r/Remission as I couldn't find anything similar and would dearly love a place to talk to others going through similar feelings!", "permalink": "/r/happy/comments/ar71qe/im_in_remission_and_i_have_a_hairline_again_well/egl788o/"}