{"id": "t5_2qh1i_t3_27ivc5_t1_ci18zu6", "creation": 1402112094, "origin": "t5_2qh1i_t3_27ivc5", "height": 1, "replied_to": "t5_2qh1i_t3_27ivc5", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "throwaway46913", "text": "It isn't your fault. It isn't anyone's fault but my own. Every one I've know has amazed me. You are a beautiful wonderful person. I'm afraid I never will be a good person. I've tried as hard as my nature has let me but I am useless. I feel like I only slow down the good in the world around me. I really don't want this to be the beginning of my suicide note, but I'm afraid that I should start counting my 24 or 168 hours tonight. February 18th,  2014.\n\n___\n\n3/28 (to me)\nThere is nothing good about you. You only hurt the most important and wonderful people in your life.  You deserve to be rotting in a waste dump. Fuck you. \n\n___\n\n5/13/2014\nWhat follows is my first sobered entry.  I will leave the full conversation (including the drunk bits above) that I'm writing to myself. \n\nI've been waiting. I've been drinking because it feels like I'm not forced to spend so many days with memory of being alive. \nI've been waiting for a time in my life when I will be competent and talented. I've been waiting for a time when I stop failing.\nI've been waiting for a long time. \nLife, to me, is the most personal experience we have. We should be afforded any freedom that doesn't harm anyone else. Things get messy when helping one person hurts another, as I'm sure all of my loved ones would be hurt if I were to hurt myself. But life is pain. Death isn't enjoyable, but it is not painful. \n10,000 people worked for 6 years to put the World Trade Center together. It took so few to destroy it that morning. Ten thousand good experience in my privileged life can be sterilized by a handful of bad ones. \nI create the bad ones. I make refuse of the good work that good people have put into my life. \nI have learned that I will regret myself as long as can, and the best way to fix a problem is to create an environment that will disallowed similar hazards in the future. Time will mend past mistakes and death will prevent future mistakes.\nAgain, I stress that life is the most personal experience we have. I am making a choice to leave. I wish that we all could choose how long we stay, but we can't. People shouldn't die against their will. People shouldn't live against their will either. \nI've spent the last 10 years working toward this conclusion and I'm tired. I'm tired waiting to get better, imagining milestones, failing, and trying to justify suicide. I'm tired of wishing there was a way out.", "permalink": "/r/AskReddit/comments/27ivc5/nsfw_suicide_survivors_of_reddit_what_did_you_say/ci18zu6/"}