{"id": "t5_2tand_t3_l7ozts_t1_gl93tsu", "creation": 1611937057, "origin": "t5_2tand_t3_l7ozts", "height": 1, "replied_to": "t5_2tand_t3_l7ozts", "down_vote": 0, "up_vote": -7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Belle047", "text": "*i am not a doctor. I guess that needs further clarification at the start of the post* \n\nSo... maybe this gets down voted and I get greifed.  But two pregnancies later, and a wild ride of symptoms and problems left me with little options. I just want to offer a side opinion. Also there is little to no evidence or research for anyone who chooses to look for it. This is a personal opinion with direct oversight from my doctors\n\nFirst off: good for you OP! making any changes in life is difficult and doing it for baby is always an easy choice because, baby! Congratulations!\n\nI have some overbearing health conditions that made pregnancies difficult for me. Including some issues with my metabolism that made morning sickness an all the time sickness. The first trimester for both babies I did not eat much if anything and would find myself at the hospital regularly for iv fluids and to make sure baby(s) were okay. \nI smoked weed when I was at my worst while pregnant. I know the doctors say \"don't\" for the myriad of reasons. But when all they could give me is more drugs or the reality that I'd likely miscarry due to the stress. One joint in the first trimester solved 3/4 of my problems and I was blown away. After a month of depriving myself of no weed, after being a full time weed smoker for years, it was bliss. Pregnancy #1 gave me the chance to learn a ton about moderation and the uses of CBD instead. Pregnancy #2 (which im carrying right now. Half way!) Was the same except I didn't deprive myself in the first month, which was the worst. I had to come off some medication for my issues and switch up medication types for baby's safety. Fuck was I sick. Small puffs from joints kept me going. \n\n*i am not a doctor. I consulted heavily with my obygn and I recommend you do the same for all health matters*\n\nI guess I'll clarify why I'm posting this. Withdrawl is real and caused serious issues that no doctor would even acknowledge. They pushed drugs after drugs and those made me even more sick.\nThere is a lack of research for the moms who CHOOSE to pursue THC OR CBD as an alternative to perscpribed pharmaceuticals. \n\nMost of my symptoms settled from the horrible point after the placenta developed and was taking care of hormone control for baby. Somewhere around the 12 week mark? \nSo now I treat with CBD if needed, but I won't deprive myself of the only thing that helped me because I do not want chemicals/pills to solve these problems if I don't need them. The dialectin they gave me for the puking only made things worse. So I stopped that stuff fast. \nI'm available in private message if you have more questions, I'm trying not to divulge too much information that will give the lynch mob something to grip about. 😅\n\nGood luck, and best wishes to you and LO. I REALLY did only mean to post this as an alternative angle in the event that you do struggle after quitting. I have also been a thc product consumer for a number of years. Otherwise, I don't share these personal details often due to the grief squad but opted to here. \nOh well.\n\nEdits done for clarification that I do not hold a medical degree and this is only a personal perspective due to the lack of actual scientific evidence available to those who choose to research the effects for their own personal choices.", "permalink": "/r/DecidingToBeBetter/comments/l7ozts/so_im_preggo_time_to_stop_w_the_blunts/gl93tsu/"}