{"id": "t5_2tand_t3_p5nvck_t1_h97lzms", "creation": 1629150030, "origin": "t5_2tand_t3_p5nvck", "height": 1, "replied_to": "t5_2tand_t3_p5nvck", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "what_the_a", "text": "I have ADHD, so I am TOO GOOD at letting things go lol. \n\nIn all seriousness, I think I also just naturally don't have a tendency to fixate. I don't know if its just how I am or if its because from a young age I was inadvertently practicing mindfulness from a young age. But I just basically force myself back to the present. It's the basics of mindfulness, which you can look into. It's really helpful. \n\nI also just get sick of thoughts after a while. Like if I am worried about a future possibility. I eventually just sorta get to the point where I'm like \"welp, i'm worrying about something that doesn't exist yet and there's nothing I can do until it actually happens. no use in making myself miserable about something that I've invented.\" I just like... get sick of thinking about things. \n\nWith thoughts about my past mistakes or bad experiences, I think allowing yourself to feel negative feelings and letting them process helps too. I don't drudge up as much anymore because i've sorta worked through it and now i'll think about it but I can just say \"oof, rough time. anywho...\"\n\nFor one thing, I don't believe thoughts are anything but electrical impulses. So just because I think a thought, doesn't mean it has to be acted on or even accepted. I can acknowledge it and then let it go. What I believe is that I'm not creating every thought that enters my mind, I am the \"thing\" witnessing the thoughts. That means I can just reject them. I even \"named\" the intrusive voice. It's an old crusty white guy who's opinions I don't respect. It makes it really easy to tell them to fuck off. And this has proven results. \n\nThe thing about our brains is that they take the easy way. Your thoughts will naturally go down well-defined avenues. Constantly challenging the intrusive thoughts and dispelling them helps your brain carve new, healthier pathways. I literally think about two paths in my brain -- the well worn one through the woods where I know I'll be harassed along the way. I know the way because I've done it many times, but I also know its a way worse experience. Or I can take a new shortcut through an open field-- there's tall grass and some stones and branches in the way so its tough to get through at first, but I can move those. Over time, I keep taking that path and it gets easier and easier to walk through. Now I don't only have the option to fall down a thought spiral, I can just say, nah actually I would prefer to not ruminate on this all night so I'm gonna take the open field over there. \n\nBuuuut that's just me. This stuff comes naturally to me and I've never had to do too much work to get over things. I do think I started doing this at a young age which has probably helped a lot. But lots of people have success with mindfulness and meditation so perhaps that can be helpful to you too.", "permalink": "/r/DecidingToBeBetter/comments/p5nvck/do_people_without_ocd_simply_disregard_thoughts/h97lzms/"}