{"id": "t5_2tand_t3_h8sdcs_t1_fuutdqy", "creation": 1592183184, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "rednightmare18", "text": "Hey, you got this! From one ex-wimp to another soon-to-be ex-wimp.\n\nBefore I add on to this awesome advice chain, I just want to say I admire you so much for deciding you are FED UP with all this stress and the way it's been impinging on your life. It may not feel like it, but this cry for liberation from the unhealthy part of yourself (that goddamn anxiety) is your biggest confrontation of them all, and you've already broken through. Celebrate that, woo! \n\nThe other thing I want to say is that, like building up muscle, building up mental fortitude takes time. Don't be discouraged if you don't transition into a badass bastion of chill overnight. You may have the occasional bad day here and there where your anxiety gets totally outta whack, but every day, it will grow a little smaller and less powerful.\n\nSome tips that worked for me: \n\n1. Scale back your social media usage. WAY back. Just play around in online communities you know are positive and chill places. As your anxiety dwindles, you can add other sites on bit by bit. \n\n2. Make sure you always have a few \"escape\" things going on at any given time. A few hobbies, a few interests, a few skills, a few games, a few hangouts. That way, if you have a bad anxiety day about one of these things, you can switch to another. This will make sure you always have a refuge of sorts and will never feel locked out of the part of life that gives you simple joy.\n\n3. It's not a replacement for therapy, but it does really help to find some \"anxiety buddies\" who intimately understand what you're going through. See if you can find some healthy groups for folks living with anxiety, or even just confide in your trustworthy friends... you never know who may be hiding their own struggles. And helping others work through their bad days will help you feel stronger, too. \n\n4. My lifesaving mantra is: \"I'm gonna *practice* letting the small shit (or \"this worry\") go.\" Seriously, this single sentence saved my goddamn sanity. Just using the language of \"practice\" helps reduce anxiety so much, because it avoids heaping on extra pressure. \n\nAnd lastly... remember that it's OK to be sensitive and it's OK to cry. We all cry! We all freakout! We're all wimps to some degree! The important thing is that you've recognized your reactions are disproportionate to the things causing them, so you wanna scale those reactions back to size for your own health and happiness. But you don't have to become a SUPER TOUGH CHICK who NEVER CRIES. (I'd argue that's not something any of us should shoot for, 'cause that extreme isn't healthy, either.)\n\nI think you're gonna start feeling better and stronger before you know it. :)", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fuutdqy/"}