{"id": "t5_2tand_t3_h8sdcs_t1_fusywb0", "creation": 1592146158, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "GreyFox-RUH", "text": "Hi\n\nThank you for sharing, and I'm sorry you are going through this. I see a strong person screaming to manifest her strength. But I also a person who is angry and hates herself for being currently being the strong person she wants to be.\n\nYour post reminds me of myself. I realized recently I'm somewhat of a snowflake. I'm also a people's pleaser. And God damn I hate that so much. It makes me feel weak and pathetic.\n\nI'm sure it has something to do with how I was raised (my mother is a perfectionist and my father is irritable and easily angered). \n\nBut I want you to first accept that you are what you are now, and to see some good in it too. I'm not trying to sway you away from changing, but you need to love and accept yourself. You seem to be a person who cares about other people's feelings. That's a really great thing. It's rare in our world. I myself am a \"nice guy\", and while I hated myself a lot when I first noticed that and just wanted to delete all of that, later I became proud and happy of me being \"nice\". I will never throw being \"nice\" away, I will just throw away being \"too nice\". Same thing with you.\n\nYou already realize what you are doing and that's a good thing. You also want to change and that's a second good thing. You can, you definitely can. But it will not be easy, and it will take time. Please don't be hard on yourself now or be hard on yourself when you don't live up to your expectations when you decide to change, you're not invincible.\n\nPerhaps you can view some videos from the School of Life on YouTube about the \"self\". They got some good stuff. Check out this video: https://youtu.be/8hYTPl7MkiA\n\nI myself have stopped using Twitter recently because I can't tolerate disagreements. I'm working on myself to change. I've also taken a serious approach to meditation two weeks ago and I feel great. I still have a lot to change in myself, but one day at a time.\n\nGood luck", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fusywb0/"}