{"id": "t5_2tand_t3_h8sdcs_t1_fut65hl", "creation": 1592150338, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": -1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "nixsee", "text": "I'm sure that writing this will have helped a lot. Check out stoicism for some ideas on how to control your thoughts and emotions.\n\nAlso, as opposed to the people calling you a strong, independent woman, consider the notion that you're not a 25 year old woman, but a 25 year old girl. You wouldn't be in this mess if you were a woman, though you're on your way to becoming more of a woman by engaging with it authentically. \n\nMoreover, its both useful, and I think accurate, to consider Woman/Man/Grownup an unattainable ideal that you can only ever strive towards - humility is the name of the game, after all. Similar for wise, good, or any other such trait - you can become wiser or better, but you'll always fall short of perfection. Saying \"you go girl, you're great, you're strong, fuck those trolls\" can only make things worse, because it deludes you into thinking the opposite of reality - that you are highly flawed, like everyone else. The solution is to embrace your brokenness and start getting better (as the name of this subreddit suggests). \n\nWith a focus on humility, its more or less impossible to become upset or offended because you aren't ever surprised by your shortcomings and failures. In fact, any offense/disturbance literally is you just thinking too highly of yourself - something you become eager to discover so that you can become less prideful, less wrong, less shitty. If someone is just being a troll, ignore them. But if they show you where you're wrong (and we are all wrong in an uncountable amount of ways), what could be better?\n\nI've gotten to a point where I post things, be it anonymously here or on my facebook timeline, not with the yearning for likes/validation, but with curiosity at how ignored it will be. When I receive crickets, which is most of the time, I use it as information to reflect upon - Was I correct? If I was correct, was I being a dick? Are people just receiving it poorly because of their own lack of humility/self-awareness/etc...? Could I change my approach so that I'm attending to their insecurities rather than cutting to their soul? etc...\n\nThe underlying lesson from it all, however, is always that I need to live the ideas out more fully to have more credibility. Share these sorts of thoughts in a more comprehensive and public way - such as a blog that I have been pondering over for 6 years.\n\nFear of being incorrect aside, perhaps a way to deal with the trauma from your parents (or trolls) is to have a more \"humble\", compassionate view towards them.\n\n\"I'm carrying this traumatized outlook and identity around, but that only came from being abused as a child who didn't know how to make sense of the world. That's not \"my\" fault, that's the \"fault\" of the little girl, but I'm stronger and more capable than that now. As such, I've come to realize that when my parent(s) yelled at and belittled me, even if they were correct that I was wrong about something, they were violent and angry because they themselves are insecure, immature, ignorant people. I should always be thankful for being corrected where appropriate, yet also immensely compassionate for someone who has such a warped view of how to behave to anyone (much less to their daughter) - how sad it would be to be like them. Moreover, their behavior is quite likely not even their own fault, as it probably resulted from their own traumas growing up, which came from their own parents' traumas, and so on.\"\n\nIt seems to me that its this realization, that we're just at the end of a chain of ignorant suffering, is what frees you from it. I would imagine that Buddhism would fundamentally agree with this, and go further to have compassion for those who are still \"asleep\", as i've suggested. When someone says something like depression/addiction runs in my family, its bullshit and could hardly be more detrimental as it is moving the responsibility/capability for solving a problem to something outside of yourself. What runs in families are ignorant values and perspectives, insufficient living conditions, etc... Those cause depression and anxiety, and recognizing this - that you are thinking about and living life incorrectly - is what frees you from it.\n\nI hope this is helpful in some way\n\n&#x200B;\n\nedit: In your edit you said that you'll aim to shrug off the naysayers - that's the opposite of what you should do. Many naysayers are actually correct, thus should be considered. If they are correct you should be thankful. If they are wrong, you can correct them. And if they're just being a troll, you can have compassion for them.\n\nAlso, forget about therapy - all any decent therapist can do is help you help yourself, something that you are fully capable of doing yourself. The meds are not the solution either. Check out Lost Connections by Johann Hari - its a great, recent book that goes through a lot of what I've said about depression. Ultimately YOU are the problem, not your parents, society etc... This doesnt mean you are intrinsically wrong/broken, but that you just happen have a flawed perspective on how to navigate life (and who doesnt?). Moreover, it might be helpful to think about anxiety and depression differently. Rather than a \"sickness\", consider it to be a positive signal. When you're tired, thirsty or hungry, you aren't \"sick\" - its just your body telling you to sleep, drink or eat. Similarly, anxiety and depression is your body telling you to wake the fuck up and start thinking and living better - get some humility, perspective about how much unbelievably worse life is for billions of people and get over yourself, and find something meaningful/purposeful/fulfilling outside of yourself to dedicate your energy towards. \"Those who have a why to live can endure almost any how\" - Friedrich Nietzsche (quoted heavily in Man's Search for Meaning by Viktor Frankl, a classic that you'll find to be very helpful. His ideas are basically CBT, which is also basically Stoicism.)", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fut65hl/"}