{"id": "t5_2tand_t3_h8sdcs_t1_fut45ki", "creation": 1592149212, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": -1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I think taking baby steps is the right way to approach this problem. \n\nI’ve seen sensitive people become far less sensitive by taking baby steps to build their confidence. \n\nWhy does this work? Can’t expect overnight with drugs and therapy to fix this. Likely they’ll say the same thing. \n\nHow would baby steps work? \n\nStep 1. Start by introducing yourself to a stranger in a coffee shop 3 times per week. Little introductions can be scary because what if they reject you. \n\nHow I would do it? Sit down next to them for 5 minutes and ask what they’re reading (if it’s a book). Talk about it.\n\nStep 2. Sharing an opinion in public. \n\nDon’t progress into this until step 1 feels comfortable and not scary. \n\nIn the same conversation with the stranger recommend a book that you enjoy. That’s completely unrelated and different than the one they like with the likelihood they won’t be a fan.\n\nWhy? This isn’t rude and people do this all the time. You likely do not. This is a mini conflict. \n\nStep 3. Sending your food back \n\nAfter recommending a book feels okay, try sending your food back. \n\nGo out to eat at a restaurant late in the day. If the food is anything but perfect, ask the server to fix it.\n\n1.  “There aren’t enough black beans” is a perfectly reasonable request. \n\n2. “This is cold/overcooked/tastes funny/etc. is perfectly reasonable to bring up\n\nWhy? This is slightly more of a conflict. Other people’s screw up doesn’t mean you should suffer. It’s uncomfortable to have this conflict but it’s important. \n\nStep 4. Challenging an interrupter \n\nIf someone interrupts you, try your hardest to speak up and say “excuse me, I was talking.” \n\nStep 5. Instead of challenging and interrupter, just start talking louder and look mad. \n\nOnce you’re comfortable doing that, try to just continue talking but louder if someone else interrupts you. \n\nIf someone’s rude, pipe up and ensure they know that it’s not okay. \n\nOnce you’ve gotten through all of these, conflict shouldn’t be as difficult. \n\nThis + a sports team and/martial arts would be huge for you.", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fut45ki/"}