{"id": "t5_2tand_t3_h8sdcs_t1_fusppen", "creation": 1592140029, "origin": "t5_2tand_t3_h8sdcs", "height": 1, "replied_to": "t5_2tand_t3_h8sdcs", "down_vote": 0, "up_vote": 20, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Unsullied_Fox", "text": "To start off, I just want to say that typing down all of your insecurities and flaws is very commendable and brave. You should be proud of that.\n\nOkay, so in order to figure out the solution, you have to know yourself very well. This means taking the time to understand fully well what stops you from progressing. But you should also question WHY it happens too. It’s true you have reasons that caused these issues for you but in order to move forward, you can’t stick to the same reason. Childhood and past trauma can be very rough so you could make peace with what happened and realise that it wasn’t your fault. Once you realise that, you mustn’t use your past as a excuse anymore because it will only hold you back. \n\nWhen it comes to the disapproval, validation and what not, you could ask yourself: “what will happen to me if I get hateful comment or if I received disapproval?”. Asking yourself questions is the first steps. \nIt is important to talk to someone so it is very good the fact that you have spoken about your issue and decided to move forward. No-one knows you 100% but yourself. In order to have a firm belief, you must come to make peace with your past and start telling yourself “I am worthy of love and I am a independent woman who’s opinion is important”. Even if you end up being selfish, you must maintain a good sense of identity. \n\nFrom reading your post, you’ve already display a courage of strength and bravery of that of a independent woman. I am personally happy that you come forward and share it with other people.\n\nIn the end, wear your identity as a armour so it wouldn’t be used against you. If you believe you are the woman you want to be, keep constantly telling yourself and that way, you will have firm beliefs and conviction in whenever you do.\n\nMessage me if you’d like and I be more than glad to spare a mind 🙂", "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/fusppen/"}