{"id": "t5_2tand_t3_qctkw3_t1_hhl2td3", "creation": 1634879272, "origin": "t5_2tand_t3_qctkw3", "height": 1, "replied_to": "t5_2tand_t3_qctkw3", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "WelbonWorkOnline", "text": "In life, there are some things that people are always chasing after but never fully achieve them. It is like chasing one’s own shadow. These are the likes of wealth satisfaction and perfect stress free lives. Achieving them is next to impossible but improving on them is within one’s reach, depending on how determined one is. This is where self-improvement comes in. General self-improvement is quite vital in our lives. There are a lot of simple things we can improve in and make our lives better. Skills, natural abilities, aspirations and dreams; these are just but a few. If we are to effectively improve our selves, there are some particular steps that we should follow. \r  \n\r  \nFirst and foremost, try and grade yourself. This means accessing your traits and behaviors. Know your weak and strong points. One can use a formula known as S.W.O.T when doing this. This stands for strengths, weakness, opportunities and threats. Jot down these items on a piece of paper and list them down based on your life and how you live it. Remember your past experiences and reactions; let them help you come down with a complete and sincere list. This way, you will know where an improvement is needed. \r  \n\r  \nSecondly, accept the results of the assessments. Do not be in denial! If you find that you are easily angered, accept it and start thinking of ways to improve on that. Do not start looking for excuses and scapegoats. I know most of us find it difficult to accept that we are on the wrong. This is perfectly normal for human beings; it is how we are. Nevertheless, the best thing to do is to overcome it.\r  \n\r  \nAfter you accept that, you are in the wrong, build up a positive mentality inside you. There is no wrong in the face of the world that cannot be corrected. All it takes is accepting that you are wrong and showing determination to correct it. Actually, a positive mentality is the key to self-improvement. People tend to give up hope while in the process claiming that they are way past correction. One thing that they never remember is that nobody is perfect. If there was, he or she would have been a superhero. Keep on keeping on, do not give up! However, do not overdo it. This never ends up well. Live your ordinary life but in an improved manner. \n\n&#x200B;\n\nHope this helps you SceneSick2", "permalink": "/r/DecidingToBeBetter/comments/qctkw3/how_do_i_start_being_a_good_person_again/hhl2td3/"}