{"id": "t5_2tand_t3_pdd5ia_t1_harp4lm", "creation": 1630212729, "origin": "t5_2tand_t3_pdd5ia", "height": 1, "replied_to": "t5_2tand_t3_pdd5ia", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "asecuredlife", "text": "You're very young. I personally feel many of the advice here won't help you because you are still growing and maturing from my perspective. I don't know your past, but start with the observation that you are in full control of changing your own past, present, and future.\n\nTo use a criminal justice term, you have a negative life script and to a larger extent, a negative world view.\n\nDo you get anxious a lot? Do you feel you have any control over what happens around you, or does the world *happen* to You? Partially related, but what is your personality type? I'm starting to belief less about types, but they do help to give you a broad overview of an individual and what they are like in broad terms.\n\nI feel that you need to find the type(s) of therapy that work for you, at a cost you can afford. You need to find a coach or mentor who will help talk you through things in a way that you feel comfortable with. Depending on your personality type, this will be difficult. You may find that talk therapy doesn't work for You and that other forms will. It varies from person to person.\n\nAll I can say is, in some ways, I used to think like you, but perhaps not as extreme. Note that when you have emotions or feelings strongly in one way or another, you should ideally assume positive intent: your body or your mind may be trying to tell you something.\n\nAs you start to try and think through these things and figure out more about yourself consciously, that's the point where I'd recommend looking into hypnosis. That helped me quite a bit recently. I can't share much else right now, as I feel I'm at the very beginning of my journey despite how much progress I've made. But it does get better. You have to put in the work, however.", "permalink": "/r/DecidingToBeBetter/comments/pdd5ia/how_to_not_be_negative_all_the_time_how_to_not/harp4lm/"}