{"id": "t5_2tand_t3_qeh24p_t1_hhxruk5", "creation": 1635127463, "origin": "t5_2tand_t3_qeh24p", "height": 1, "replied_to": "t5_2tand_t3_qeh24p", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "MattTheMentor", "text": "I think self esteem comes from having a solid idea of who you are. This means knowing what is important to you, knowing what you want out of life, knowing what you DO NOT want, and separating yourself from the values/goals/identity that others might have ushered you into when you were younger. Once you really know who you are, then you can believe in that person. When you don't know who you are, it's easy to have low confidence or self esteem because there's no foundation to stand on.\n\nThat said, this takes time. Don't be too hard on yourself because many people spend most of their 20's figuring this out. I know I did. That said, it is by trying new experiences, talking to new people, and getting out of your comfort zone that this process is accelerated. Someone who never tries anything new will never figure out who they are. Someone who tries lots of new things will become cultured, form opinions about the world, and build more confidence and esteem about who they are. \n\nSo my advice to you is to seek out new experiences, try to get out of your comfort zone every day, and have self compassion along the journey. It's not easy to learn who you are. There will be mistakes, rejections, awkward moments, and failed experiments.. That's okay. You will learn from all of them, and the only mistake is not trying anything. The good news is that trying new things will bring you benefits far beyond the ones you planned for. I went to improv meetups where I made great friends even though I didn't keep with improv. I had failed relationships where I learned a ton about how to set proper boundaries. And I had friendships that fell apart which taught me what I really need out of the people in my life.\n\nYou are in the process of creating your own identity. It is exciting, terrifying, and very important work. It's okay to feel uncomfortable, that's kind of the point. I promise you can do it and I promise it gets easier with time. Take baby steps and be patient with yourself, I think you'll be very excited as you continue to learn about yourself. Wishing you all the best of luck!", "permalink": "/r/DecidingToBeBetter/comments/qeh24p/i_think_ive_realized_what_my_issue_is/hhxruk5/"}