{"id": "t5_2tand_t3_p9qqjj_t1_ha1my3p", "creation": 1629733992, "origin": "t5_2tand_t3_p9qqjj", "height": 1, "replied_to": "t5_2tand_t3_p9qqjj", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "idontsmokeheroin", "text": "Hey man, I was in a bad accident 8 years ago. After the accident I really leaned into drinking because of my chronic pain and depression. I didn’t want to take opiates and thought I was a  saint for leaving them alone due to my families nasty addiction history. Well, alcohol became the problem anyway. I quit drinking 3/15/20, basically right when the pandemic hit. I was awful at first. Rage, crying, depression spells, irritability at best. I haven’t had a drink since. Then I was diagnosed with a neurological disorder (SCDS) that affects my balance, so now I sorta feel drunk all the time anyway. \n\nA lot of things make me just wanna give in. The world, my own shit. It’s hard. It’s really fucking hard and you’re not going to be out of the woods for awhile. I don’t have much of a support system with my family as my sobriety comes off as a threat to my New England, Irish Catholic family. I haven’t even done AA, but I think about it a lot even still.\n\nI can tell you a couple things. It never stops sucking. But it gets better. As lame as it sounds, I come from a small town and the thought of someone reading my poorly written obituary in my town newspaper, somehow is enough for me to not want to be another statistic. \n\nMy advice. Start walking. Sounds dumb. Do it. Treadmill, neighborhood. Just start walking meditation. It helps with the anxiety. It sounds so stupid, but walking may’ve saved my life. \n\nIt’s still not easy. I have to find other ways to manage my pain, and I get anxious in social situations, but it may be that I’m just getting older…but I’m starting to realize there isn’t really a person or experience worth giving up my sobriety for. \n\nI listen to Bill Burr a lot because he struggles with this too. He put it this way. In the beginning, it’s there everyday. The want to just start drinking. It fucking sucks. You sit there in a form of misery and anguish until you go to bed and when you wake up the next morning, you don’t feel guilt. Eventually, it starts to go away and it’s not EVERY day. And shit man, everyone is different. You will find what works for you if you’re patient through it. Adopting a bit of stoicism helped me there because sometimes there isn’t a way around the SUCK, you just gotta go straight through. \n\nI wish you the best. It’s been really hard and I know how you’re feeling. One week is really huge and you should be super proud of yourself because the first month is the hardest with the emotional rollercoaster. \n\nYou’re doing the right thing. You’re nervous you may drink, so you’re reaching out. Never stop reaching out. I commend you for this post and deciding to be better, as I know the strength it takes to stay sober. \n\nOne final thought. You’ve been sober for one week and today you asked for help. Do you see how you’ve already improved? You noticed something about yourself and were responsible for it and came here to reach out. If that isn’t productive, I don’t know what is. You’re treating your sobriety with care, and you’re putting your health first. I think you’re doing a fantastic job and when you go for your meditative walk, I think you should reflect on how proud of yourself you should be for that.", "permalink": "/r/DecidingToBeBetter/comments/p9qqjj/im_going_on_day_7_of_not_drinking_and_im_really/ha1my3p/"}