{"id": "t5_2tand_t3_qehakp_t1_hhvu6yv", "creation": 1635096444, "origin": "t5_2tand_t3_qehakp", "height": 1, "replied_to": "t5_2tand_t3_qehakp", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I cannot say about isolation. But I have left social media, and have never looked back, because I did feel better.\n\nOne thing that you wrote struck something in me just now\n\n\\>  but i know there are people who are good with social media, who can use it and follow all their old hs classmates and still seem to feel fine and in my head, those people are more mentally strong than i am.\n\nI have the same thoughts but regarding my worry over work/career. I have always been very high strung in matters of study or future career.  I was thinking recently, what would happen if I don't think about it at all? That maybe it's just a mentality I have to change. But then I thought, what about people around me? My peers who seems to be doing a lot, but still look happy and healthy. And obviously that they have better mental health than me, they are better than me.\n\nAnd in early days of my leaving social media, I had the exact same thoughts. That others can handle it better than me. But honestly, I've been off everything except reddit for more than a year. And I will never ever go back, because of the good things I have gotten, or bad that I avoided by leaving social media. Yes, there are people who handle it better than me, but I have a far better life now as compared to my past. And that's all that matters. If I ever feel like contacting someone it forces me to call them , or message them. And it feels much better than looking at their photographs or posts. In fact im slowly transitioning to calls only.\n\nI think I added some unnecessary info about my life here, but I would like to thank you. This post made me realise the situation in another part of my life that I never thought to have similar patterns.", "permalink": "/r/DecidingToBeBetter/comments/qehakp/getting_rid_of_social_media_might_be_hurting_me/hhvu6yv/"}