{"id": "t5_2tand_t3_n0vant_t1_gwevouw", "creation": 1619781728, "origin": "t5_2tand_t3_n0vant", "height": 1, "replied_to": "t5_2tand_t3_n0vant", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "e7th-04sh", "text": "Then let me add that you might be living some illusions about some people. And you might be doing all you can to uphold them, never putting those people to the test. Subconsciously realizing they are not what you emotionally need them to be, you protect them from situations where they would reveal the truth. You don't wanna see what they would choose of their own volition.  \n\n\nThis is a special case of the problem I explained above. You have to let people be shitty if they are shitty. It might reduce your feeling of safety, but think about it - it was actually you all the way providing the safety, the other person served just as a psychological token. As soon as you really have to rely on them, then you will see if your subconscious fears were true. And if they were, you'll be left in your predicament.  \n\n\nSo when I talk about consistently accepting discomfort rather than submitting to manipulation, what I mean is - psychologically accept that this will not \"fix\" that person. It can, of course. But this is all about long-term. You should not assume that being tough is only worth it if it will result in that person altering their behavior. Because what if they don't alter it? Are you going to finally succumb and go back to your previous ways?   \n\n\nIf you don't want to sacrifice your time here on being somebodies unpaid servant, if you are sure that the situation you found yourself in is unfair, then you have to be ready to acknowledge that certain people in your life will not change. If it's your family or spouse, if you love those people, then you may want to stay with them and it's fine, but make it a sober choice. And soberly choose submitting to their unrelenting manipulation or soberly choose a stalemate and discomfort. But don't assume everything can be solved and it's within your power. Be sober when looking at the world. You choose to be assertive, but they can choose to be stubborn. Or it may turn out they absolutely do not care about something, and it doesn't matter if you do or don't do it, they won't be bothered that it's not done. If something really has to be done, sorry, you will have to do it then. If it doesn't, it's up to you if you want it done more than you want to sit down and relax. But if they don't care, be sober and choose what you want in this situation. Stop blaming them by the way - of course they are to blame, but we blame out of frustration. If you accept them as somewhat mentally deficient, you'll expect no more honorable behavior from them than you would of your cat. You're not mad at cat that it doesn't clean their own litterbox are you?  \n\n\nIt's of course probable, depending on what kind of situation we're talking, that they actually care about all that. Say, it's your teenage daughter and you keep doing her laundry, although you did your own at her age. Stop doing the laundry. Calmly ignore anything she does to try and make you submit to her will. In the end either she does the laundry, she walks around in dirty clothes or she gets a different sucker to do it for her. But finally you won't be burning away your lifetime doing something for an ingrate. I know we love our children. But it does them NO GOOD teaching them they are princes and princess whose old socks smell of roses. What a disgusting example of utter lack of empathy so many teenagers show, when they offload all sorts of menial tasks on their old, tired parents...  \n\n\nAnd remember that you are dealing with people who were more  or less knowingly, perhaps less, as in many cases it's a matter of bad character, of people who just don't see what they are doing for what it really is... anyway, you're dealing with people who were manipulating you. If you start behaving different, they will try to adjust to that. They are very used to, maybe reliant on you solving their problems. So one trick that might happen - they will think you just feel unappreciated. They will try to show you some appreciation. They will do something that usually was offloaded on you. They will treat it like they are doing your job in your place, doing you a favor to show you they appreciate you doing it all the other days in the year. Set yourself hard rules on what you believe is your duty and what is not. Stick to them, don't do them any favors at least for now. Do what you owe them, and nothing you don't owe them. Do not feel bad about yourself being so strict - they have a huge debt to you already that they probably don't think about, do not acknowledge and will never repay. If somebody owed you $1000, 10 years overdue and asked you for $5 for a train ticket, and you denied, and they said some mean things about you then... do you defend yourself? do you explain to them why you've got the right to treat them this way? or do you get angry? the best you can do is pay them no mind. A brief laugh and walk away. You have nothing to prove to anyone, you're not the crazy one here. There is a limit.   \n\n\nBy all means, love other people as you love yourself. Would you like to be a bad person? To treat people unfair, take advantage, be parasitic? No? Then don't affix them in their wrong ways either.", "permalink": "/r/DecidingToBeBetter/comments/n0vant/i_am_a_recovering_peoplepleaser_the_below_article/gwevouw/"}