{"id": "t5_2tand_t3_n0vant_t1_gwa3rxr", "creation": 1619691983, "origin": "t5_2tand_t3_n0vant", "height": 1, "replied_to": "t5_2tand_t3_n0vant", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "UnendingQuest", "text": "I'm having a hard time with this while dating new partners. I have such a long history of not saying what I want / need in order to uphold the wrong relationships - or not having enough sense of self to even know what I want / need. Now that I'm trying to be better at that, I have no idea WHEN it's 'normal' to bring up big things. I've read that you don't have to present every difficult thing about yourself on the first date - that it's good to give people a chance to see the good things about yourself before they need to consider the more challenging parts of you with very specific needs. But it's like I've trained my brain to think \"don't hold back\" when these things come up - even if it's in a text conversation before we've even met. Now that I'm dating in my mid 30's, it feels like there are SO FEW compatible people and like I'm actively searching for incompatibilities that don't meet my fundamental needs so I can quickly move on to the next person and speed this horrible process of trying to find a compatible long term partner in light of the needs I've worked hard to identify for myself. I feel like I'm swinging too far the opposite way and am becoming inflexible and unwilling to give people a chance or consider compromise - and in the back of my mind it makes me feel like I'll be single or serially dating for the rest of my life.\n\nAt the same time though, I know that what I'm doing now is better than what I was doing before. Its just a hard balance to strike given that the \"perfect\" person isn't likely to be out there, especially for me at this stage of the game.", "permalink": "/r/DecidingToBeBetter/comments/n0vant/i_am_a_recovering_peoplepleaser_the_below_article/gwa3rxr/"}