{"id": "t5_2tand_t3_q9ozcp_t1_hgykj6r", "creation": 1634456335, "origin": "t5_2tand_t3_q9ozcp", "height": 1, "replied_to": "t5_2tand_t3_q9ozcp", "down_vote": 0, "up_vote": 6, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Any-Seesaw-3475", "text": "Ok, first, congrats for asking! Posting the question is not always easy. It's not easy, especially to naturally outgoing people who thrive in social situations. I will talk to you from my highly introverted POV but I hope it helps!\n\nOf course, the point not to be lonely is starting to enjoy yourself. I think the HOW depends on you as a person. \n\nDoing an activity that you enjoy: I like to read and write. When I enter into the fictional worlds, I forget my surroundings. Of course, it's impossible to feel lonely when you're \"someplace else\". \n\nPutting yourself as a priority: Sometimes, we get lost in our hectic lives and maybe prioritize socializing or completing tasks over starting new challenges. It's always a possibility to \"improve yourself\", learning something you've always wanted, but never got the chance to. For example, if you've always wanted to learn to speak a foreign language, now it's time! Also, that can open you doors to new friendships or opportunities. \n\nFocusing on the things you like about yourself: I figured some time ago that what I hated about being alone was that my anxious self tended to focus on the bad things about myself. I used to think about everything that I could be doing better or change about my life, when...it's not always so. It's one thing to want to learn a new skill, but a completely different thing is to want and become someone else. When you're alone, try to get in with the attitude of why it's cool spending time with yourself. What would someone else say? It might sound wacky, but it helped me a lot.\n\nAlso, remember that needing social contact doesn't make you needy. Try to put yourself out in situations where u can meet people. We need human contact, it's normal and healthy!!!", "permalink": "/r/DecidingToBeBetter/comments/q9ozcp/how_to_be_alone_without_being_lonely_advice_pls/hgykj6r/"}