{"id": "t5_2tand_t3_q9ozcp_t1_hgyphik", "creation": 1634460383, "origin": "t5_2tand_t3_q9ozcp", "height": 1, "replied_to": "t5_2tand_t3_q9ozcp", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "KawaiiPsychologist", "text": "I’ve been reading a few social psychology research publications recently for one of my classes. The research suggests that out of the factors of friendship quality that predict variation in loneliness, validation and caring are the most predictive (in reducing loneliness) (Parker & Asher 1993; Parke, Roisman, & Rose 2019). It sounds like perhaps you find a lot of validation and caring in spending time together/hanging out, and unfortunately that’s not an option at the moment. Are there other ways that you can still feel close to your friends without seeing them? I’ve also had to quarantine for over a year and things that helped me feel close to my friends despite being unable to see them were: \n\n1. Video calls/phone calls (just to talk or to do something together, like going on a walk outside but talking at the same time) \n\n2. Writing letters and sending them through the postal service; if you search up penpalling on Instagram or Pinterest, there’s a whole community sharing pictures of intricate envelope decorations using washi tape, stickers, calligraphy etc. and people include fun things in the envelopes besides letters, such as tea samples, QR codes of their playlists, movie lists, pictures, book reviews, stickers, handmade paintings, and a lot of other things. It’s a way to feel physically connected to someone without being able to see them. \n\n3. Ordering things for each other and having them shipped to each other \n\n4. You can play virtual board/card/video games together on https://tabletopia.com/; the immersive experience is even better if you’re able to have a phone/video call going while playing\n\nAnother way to combat loneliness is to do community/charity work. You can try https://kindness.org/ to get connected with local/National community projects. \n\nFinally, The Connect2Affect program offers self-assessments and information on a variety of ways to reduce isolation and loneliness. You can visit the site here: https://connect2affect.org/", "permalink": "/r/DecidingToBeBetter/comments/q9ozcp/how_to_be_alone_without_being_lonely_advice_pls/hgyphik/"}