{"id": "t5_2tand_t3_op749a_t1_h64c4c3", "creation": 1626957522, "origin": "t5_2tand_t3_op749a", "height": 1, "replied_to": "t5_2tand_t3_op749a", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "mhutch312", "text": "Do you really want to go to college or is that what you're \"supposed\" to do? It sounds like you need some time to live a little and to make some mistakes. You can always circle back to college in the next 5-10 years or when you're actually interested in what you want to learn about. You need to remove yourself from your support system because as comfortable as their kind words are they're stagnating your growth. All the fun and excitement you're worried about missing will always be there and it's your choice if you want pursuing that as the center point of your life. I would suggest an adventure. Here's my story...\n\nI was literally where you are at 19. I ended up failing out of college and had no direction.   \n Eventually I went to help out a friend working in Mississippi for the Hurricane Katrina relief. I learned more about the world in that 6 months then my entire time in high school for better or worse because no one was there for me to make excuses to. I came back up and fucked around some more until my support system kicked me out of the house because I couldn't hold down a job (always looking for the next party or social gathering while being a deceptive jerk-off to my support system). \n\nAfter living on a friends couch for a year (which was the center point of a party scene) I was given a guitar by my mother on Christmas. That guitar was a catalyst to focus on something I was interested in learning about. 6 months later I moved home and started getting guitar lessons and 1 year later I was doing open mics. 2 years after that I was back to school for IT and now have a career. The point is, when you find something that envelops you because you're genuinely interested in it the world and all that other bullshit goes away. It's just you and your will to make the world into how you want to live in it.", "permalink": "/r/DecidingToBeBetter/comments/op749a/how_do_i_stop_my_self_destructive_behavior/h64c4c3/"}