{"id": "t5_2tand_t3_op749a_t1_h668lgk", "creation": 1626987970, "origin": "t5_2tand_t3_op749a", "height": 1, "replied_to": "t5_2tand_t3_op749a", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "IdiotReflection", "text": "\nI don't know where your issues come from I'm only talking from my experience. \n\nMaybe you don't want to be in college. It's very hard to do something like that to meet someone's expectations. Give yourself time to figure out what you want.\nI had similar problems.\nI was also considered smart and went through my primary and high school with good grades and low effort. \nThat's probably why I didn't have a good work ethic and wasn't able to face a system I wasn't interested or prepared for. \n\nIn my country young people are forced into college at 18 because otherwise you are deemed practically illiterate.\n\nI wasn't interested in college but went because it's expected. I did semi good for the first year but soon everything started falling appart.\nCollege was a trigger for deep issues I was avoiding within myself and the floodgates opened. \n\nI started drinking heavily and doing drugs. It wasn't party drinking mind you. I became a bar fly.  There was a time when I couldn't fall asleep sober. \nIt took me a severe mental breakdown to quit college and I went back home for a year and started getting better and stabilizing. \nRecording music and illustration helped me a lot. That was my meditation. \n\nI am 24 now. Still a bit lost but I accepted myself for who I am. I moved to Berlin from a different country which I always dreamed of but was scared to go through with and am working a simple job. Only now have I truly decided what education I want to pursue and what I want in life. I'm currently working on a college application. \n\nYou doing all these crazy things is an attempt to run away. That's atleast what it was for me. \nThat sweet numbeness and not giving a fuck. \nIt's hard. \n\nI don't know where you're from but try to be honest with yourself. What do you really want?\nLeave college if you must. Just be sure that you really want to. If you're not sure that's also fine. \nBut from what I read it seems to be clear that where you are now isn't what you want. \n\nYou are not a failure. \nYou are just in a bad place. \nYou are just young. \nOur parents lived in much simpler times. \n\nIt's hard to figure shit out and you never stop having to work on it. \n\nI wish you the best. \nYou have only failed if you never give yourself a chance. \nStart accepting yourself and loving yourself. \nYou can do it! You deserve it! \nAs a former fellow failure myself, I salute you!", "permalink": "/r/DecidingToBeBetter/comments/op749a/how_do_i_stop_my_self_destructive_behavior/h668lgk/"}