{"id": "t5_2tand_t3_op749a_t1_h63x07y", "creation": 1626946252, "origin": "t5_2tand_t3_op749a", "height": 1, "replied_to": "t5_2tand_t3_op749a", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "Firstly, I am really sorry that this happened.\nNow, this is going to seem harsh and probably unreasonable but please just hear me out.\n\nIt is all your responsibility to fix this.\n\nI'm not saying it's your fault, where you where born, parents and people in your life, what you've watched and what you've been told are all the reasons why you got here.. it fucking sucks that you got delt a bad hand.\n\nNow the cool and kind of scary part. You have control over your life, way more then you realise. You have basically 0 control over what someone says to you but, even though it seems like it isn't, you have control over how you act.\n\nI was addicted to videogames and alcohol for years, I always use to just say things like \"I can't help it\" or \"it's the game's fault\". I saw it as **\"this causes me to have fun, I do what I feel like therefore I have no control\"**. Every time I was given ay kind of hint that I needed to take control of my life I would get scared and lash out, I was scared because it meant that I had to do things that would hurt me and I didn't want to be hurt.\n\nTldr, the next 4 years of my life went like- move back in with parents. Suppress my rage and anger over their chewing or criticisms. Start doing some things to get my life in order. See a therapist and ignore their advice. Finally realise that I actually sucked at being social.... *This is where I get better* start taking steps to get more social. Realise that to be social I need to be able to listen, understand and have things to talk about. Join a server where I meet this amazingly social person who I copy and try to be nicer and Kinder than. End up falling in love. Get complacent, play video games, get depressed and get dumped. Spend the next 5 months being a sappy lil bish. See her online and realise that I have been slacking and I am actually pretty pathetic RN. \n\nStart waking up at 5am, go for a run, work all day on cleaning or yard work, listen to motivational messages to get me through the lazyness. 1 week in and I've made huge progress!!\n\n\nSo the real tldr: you recognise and face those feelings that are telling you *\"you are shit, do better\"* and then you **take action** to start doing better. Listen to that voice and take it as a challenge. \n\nNote: Make sure to keep healthy. Start eating better, sleeping on a good schedule and listen to advice but don't take it as gospel.\n\n\nYou can do this!!!", "permalink": "/r/DecidingToBeBetter/comments/op749a/how_do_i_stop_my_self_destructive_behavior/h63x07y/"}