{"id": "t5_2tand_t3_pgsrlf_t1_hbf8kht", "creation": 1630657074, "origin": "t5_2tand_t3_pgsrlf", "height": 1, "replied_to": "t5_2tand_t3_pgsrlf", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rough_Addendum3351", "text": "This is what I was just telling my lady.  We started a clothes line this time last year. Matter if fact 4 years ago I manifested this life we are living. Our business is growing, quicker than I imagined. But I don't really know what I would have imagined. But we Hadley it. I get so proud of her when I hear her talk and she says she owns a clothing company. She works her assmoff during the day as a cook. Comes home and still works for 4 hours  not busting her ass but still working. Wtf else to do besides watch stupid tv. I was in the construction field for 15 years and have worked around a few women. Construction is tough work and even tougher as a woman. I've seen dudes be complete douches to the woman. One took it so far as to grope like you said. I just cought the tail end of it as she punched humming the chest. I got in the middle of them asked wtf was up she said what happend I asked himenwtf rly , naw it didn't go down like that, he said.... Now I know this guy worked with him for about 2 yrs drank beers with him  A cpl times.  Told him gtfo , it what. Iimma grope your ass with my foot mthr fkr. Well, needless to say we had to go to the hospital to get my foot amputated out his ass. This poor girl was in tears and thanked me. I don't lose my job but it seemed like I got the shaft and she didn't stick around much longer  from what I gather it was slime you said\"you're a sexual harassment case looking to happen\"  we learn as we go around the son, some learn slower than others. But we learn. I wish you the best of luck andnim sending positive vibes and good thoughts your way!!!! Ps, ya need  any work shirts. Hmu. I'll tell ya all.about to!!!", "permalink": "/r/DecidingToBeBetter/comments/pgsrlf/i_didnt_like_my_life_so_i_quit_my_job_and_became/hbf8kht/"}