{"id": "t5_2tand_t3_m3gj7m_t1_gqp2ogw", "creation": 1615561631, "origin": "t5_2tand_t3_m3gj7m", "height": 1, "replied_to": "t5_2tand_t3_m3gj7m", "down_vote": 0, "up_vote": 11, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "atuan", "text": "I went through a similar thing with divorcing at 33 and I'm now going to be 39 this year and I have a 7 year old.  It's been nothing but fighting and opposition for years, I'm stuck in a poor state with few job options and I have to live 2 hrs from my daughter's dad to work.  I have spent years wanting to kill myself everyday.  Because I won't leave my daughter's life I never did, but I feel like after divorce and after all the potential of youth wears off it can be so despondent, and feel like there's no way to start over.  It's definitely not easy and finding good jobs when you've been a SAHM and you're almost 40 with spotty work experience... I almost gave up.  I'm still not perfectly happy but I'm not in that place where every day felt like hell and I had no reason to live.  \n\n&#x200B;\n\nI think my 40s and the 40s for a lot of divorced women can be the happiest and best decade of their lives.  I appreciate and am grateful for all sorts of things I took for granted throughout my life: my health, family that's all dead or estranged now, good friends, that seemed so easy to make in your 20s and now are few and far between and hanging out and having fun is a once in a blue moon treat, instead of expecting non-stop fun and stimiulation... I am working on taking care of my plants and would like to get an aquarium,  and just spend time doing nothing with my daughter and I'm more at peace.  I don't feel the need to control things or prove myself right anymore... I'm starting to feel freer than ever.\n\n&#x200B;\n\nI really do believe while it's cliche, but what doesn't kill you makes you stronger.  When you get through these things you have a strong, grateful, and informed attitude.", "permalink": "/r/DecidingToBeBetter/comments/m3gj7m/i_told_myself_that_if_my_life_didnt_improve_by/gqp2ogw/"}