{"id": "t5_2qh5i_t3_olh1y3_t1_h5ezyy7", "creation": 1626454414, "origin": "t5_2qh5i_t3_olh1y3", "height": 1, "replied_to": "t5_2qh5i_t3_olh1y3", "down_vote": 0, "up_vote": 90, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "had3sboi", "text": "Sure! Full discretion: this is just my experience w gender and does not dis credit the millions of other gender variant/trans folks that do this journey but differently! There’s no right way to be trans, we come in all varieties! But this is my story: (DUN DUN) lmao \nNah but really the first time I ever said anything about being a masculine person I was 7 ish years old. It was summer time and we had a pool and for the first time ever she told me I needed a top. That I couldn’t just wear shorts in the pool like my brother. \nThis confused me, and made me feel like I was burning inside of my own skin. My\nFirst tangible experience with gender dysphoria. I lived in a small co town in Massachusetts and of course I was a child in the late 90’s so this was not spoken of. I wouldn’t even meet a gay person until my late teens. Flash forward to puberty, a grueling 3 years of horror. \nThere’s really nothing to say when someone asks what’s wrong and your answer is “I wasn’t born correctly and I feel it creeping in my bones every single day”. You don’t say that, because you can’t, because you don’t even have the language to define this experience. I told my mom that I was interested solely in per suing women romantically when I was 12/13. She was overwhelmed. She was A single mother at this point with one child in Afghanistan (older brother) and the one tucking “her” hair under her hat at the bus stop so understandably this was difficult. I didn’t ever like the word lesbian. People would say I was going to be a great mom, I would feel sick. Something was still so wrong. I didn’t start to feel real real push back from my mother and family about my gender until about 16/17. While my brother was on his deployment I would raid his drawers, take his clothes, sneak them to school and change behind a bush or on the bush. Humiliating but strangely liberating? Didn’t understand that one for a bit. Relationship with my mother completely nose dived when I started this. She hated how I looked, and essentially hated that she was losing a daughter when she felt like she could lose her other son to war at any minute. We berated me, embarrassed me, threw my masculine clothes away even if I bought them myself. This was devastating through high school. As many sad folks of that age group do, I developed some nasty self harm tendencies and a difficult eating disorder. My last hopes were dashed when my brother who was my best friend before his deployment, came home for good and threatened to strangle me and “watch the life leave my eyes” in front of our mother. She didn’t intervene, I don’t think she knew how too. \nMy family wouldn’t allow me to tell my brother while he was over seas because he was “already going through so much” I tried to tell him that, he couldn’t believe I didn’t say anything. He hated me. I was 17, graduated from high school, bought a tux from savers and marshals, went to prom, bounced through and on couches that summer and busted my ass to get into college that fall. \nMoved to Boston ma, and came out as trans two weeks in my freshman year. Fought the medical systems tooth and nail to get hormone replacement therapy, and chest surgery. Had to leave my college during times of transphobia. (Goodle Hayden Lombardozzi curry college, or type in “New England pride tv Hayden Lombardozzi”  on YouTube where I’m interviewed with my mom about this experiences. \nOh ya! My mom! She dis owned me for two years. My freshman and sophomore year of college. One day I told her, “you’re either going to have two happy sons or a happy son and a dead daughter”\nThat got her attention and from that day on we worked our way out of a years long hole. Today, I speak publicly to local high schools and colleges. Sometimes to graduating med students and as repentance, my mom comes to every single talk and at the end takes the mic and addresses parents in the room, pleading them to love their trans kids before they lose them. \nHer biggest fear used to be public speaking, but now that’s number 2. She is my best friend and biggest ally. Sorry this was all over the place, just a jumbled recollection of thoughts", "permalink": "/r/happy/comments/olh1y3/im_an_evolution_in_motion_pictures_about_10_years/h5ezyy7/"}