{"id": "t5_2tand_t3_q35ayu_t1_hfr5774", "creation": 1633628433, "origin": "t5_2tand_t3_q35ayu", "height": 1, "replied_to": "t5_2tand_t3_q35ayu", "down_vote": 0, "up_vote": 10, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "daitoshi", "text": "Yyyeeeeeeup. I'd recommend talking to a therapist or something. \n\nWhile 'Not getting to projects' and 'feeling overwhelmed by stuff not getting done' is pretty normal and can be solved by journaling or w/e, struggling to remember to brush your teeth/wash yourself consistently is a bit of a flag for getting your mental health evaluated. \n\n  \nI made it to my mid-20's before I realized that struggling to form routines over really basic shit like brushing my own teeth, regularly showering, feeding myself... on top of feeling like I was unable to start boring tasks like doing dishes, picking up garbage, tidying my house, or calling to make an appointment - that wasn't normal. \n\nLike - I'd WANT to do it, I'd DECIDE to do it, but my brain just stalled out and I'd do something else instead. I constantly forgot important things like documents or appointment reminders, and then I'd lose hours and hours... even entire days to just focusing on one entertaining but unproductive thing. When I 'woke up' from that state I'd get super anxious about all the things I should have been doing and I ended up entirely overwhelmed and frustrated and stuck pacing while my hands somehow refused to just do the fucking dishes! \n\n  \nPlanners didn't seem to work, because I'd do all the work of filling out the planner and then forget the planner existed. Hell, I can forget ANYTHING if it's out of eyeshot for a few minutes. I wouldn't change a burnt-out lightbulb for months because I'd walk out of the room and instantly forget what I was doing, or the dark didn't bother me enough to register as 'an irritating problem to fix' - so I never thought about it. \n\n  \nTurns out I have ADHD, which is primarily a problem with some neurotransmitters in the brain that control Memory & Self-Regulation. I'm chronically deprived of dopamine.   \nMost frustratingly, apparently I don't get chemical rewards for 'copleting a task' like most people. I only get the 'pleasure-good-job' chemical when doing something new/exciting. PLUS total boredom manifests as physical aching and discomfort, so my brain is constantly shying away from shit to avoid the painful sensation of boredom. (Aka it's structurally wired to resist forming essential self-care habits, because routine is boring).  Fuck me. \n\n  \n**Good news:**   \nThere's a lot more education surrounding ADHD nowadays, which means there's a lot more resources for adapting how you live around what your brain needs.   \nPlus, for many of us, medication does wonders, by artificially increasing dopamine to levels that a normal brain has. It helps with focus, memory, directing your own thoughts and actions, and doing boring tasks like making appointments and doing laundry!   \nGetting a body-double helps a lot, too. Since my brain can't reward me for simple tasks, but it CAN reward me when someone else shows approval, I can simply do a task and then show someone to receive that delightful chemical satisfaction.", "permalink": "/r/DecidingToBeBetter/comments/q35ayu/i_suck_at_being_an_adult_please_help/hfr5774/"}