{"id": "t5_2tand_t3_q35ayu_t1_hfrn519", "creation": 1633635844, "origin": "t5_2tand_t3_q35ayu", "height": 1, "replied_to": "t5_2tand_t3_q35ayu", "down_vote": 0, "up_vote": 9, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "VirtualPlacebo", "text": "I disagree with most of the comments here.  You don't need an app or list or to read a book or whatever on top of feelings of being overwhelmed.  You are overwhelmed, so adding to the list of things to do with yet another thing to do doesn't help.\n\nYou named a bunch of stuff that needs to be done.  Don't try to have a \"perfect\" day and get it all under control at once.  Pick one task that doesn't sound too terrible and do the bare minimum you need to feel a bit better about it.  Then stop.  That's it.  Let the little bit of satisfaction from getting on top of that one task sink in.\n\nIf you have the energy after that, pick another relatively easy task and do the bare minimum you need to to feel a bit better about it. Let the feeling of \"OK, that wasn't too bad\" sink in for a bit and then decide if that's all you have in you for the day.  Don't push it and quit when you feel good about it still.\n\nTomorrow, rinse and repeat.\n\nThe DMV will wait, your contacts will be at the dr tomorrow if it has to wait, you obviously don't really need what is in those boxes you still have packed right now, etc...  Relax and tackle only what you can manage for each day.\n\nAfter a few days or maybe a few weeks, you will have removed some of the tasks from your mental list.  A month or so from now you'll have more done and maybe one good habit. That's WAY more than you will get done just thinking about it all, and giving up.  You're stuck in your head and overwhelmed.  Be kind to yourself, tackle one thing at a time and you get to the rest when you can get to the rest.\n\nOnce you are caught up, other things will inevitably trickle in and need your attention, but you won't have as much of a list in your head and you will be \"adulting\" with the best of us.\n\nHang in there and be nicer to yourself.  You've got this.", "permalink": "/r/DecidingToBeBetter/comments/q35ayu/i_suck_at_being_an_adult_please_help/hfrn519/"}