{"id": "t5_2tand_t3_q35ayu_t1_hfqdmle", "creation": 1633617037, "origin": "t5_2tand_t3_q35ayu", "height": 1, "replied_to": "t5_2tand_t3_q35ayu", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "octarine16", "text": "I don't remember why I was so resistant to the idea for so long, but I just got a planner and started using it properly last year and my life changed completely. \n\nI barely adult as it is, but I cannot adult at ALL without my planner. \n\nex. I had a dental appt last April, so I counted 6mos. ahead and wrote down \"dentist\" and forgot about it. \n\nThis month, I see the note and make an appointment. \n\nWithout that note, I'd not see the dentist, and 10 years from now I would probably have no teeth. \n\nIf I started keeping a planner properly (for tasks, not social events) when I was younger, my life would've been very different now I'm sure.\n\nplanner tips:\n\n1. Set down big goals for the year\n2. Goals for the month\n3. When you write your daily to-do list, classify tasks into A (MUST URGENTLY GET DONE TODAY) B (should be done today) and C (nice to get done). Then rank the A's into A1, A2, A3, and so on. The idea is that even if you get nothing done that day except A1, you'll be fine and your life won't be a disaster. Conversely, if you check off everything on your list but A1, you're actually still not on track and you should be aware of that. \n\nThat huge list in your head, write it all down. You'll get it done. It may take a lot longer than you thought, but you'll get it done. \n\nFor things that I need to do every day, I posted a morning and evening routine on the wall. I try to do them in order so it's easier to fall into the habit. \n\nAll that said, without fail, I'm active on Reddit when I'm psychologically at my lowest, so I feel insecure about giving advice lol. \n\nYou're definitely not alone.", "permalink": "/r/DecidingToBeBetter/comments/q35ayu/i_suck_at_being_an_adult_please_help/hfqdmle/"}