{"id": "t5_2tand_t3_q35ayu_t1_hfutrcd", "creation": 1633702275, "origin": "t5_2tand_t3_q35ayu", "height": 1, "replied_to": "t5_2tand_t3_q35ayu", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "daitoshi", "text": "I started my medication around your age. I was also quite hesitant to be 'dependent on pills', as in my household that had a very negative connotation, and people who were chemically dependent on an outside source were no better than people who abused recreational drugs.\n\nThere are several problems with this line of thinking.\n\nJust because no one noticed and I never got diagnosed until adulthood.... that doesn't mean I didn't need help, before. It just means that people in my life failed to notice that I was struggling, and failed to offer the help I needed, year after year.\n\nMedication is a *tool* to help you. There is no shame in needing a bit of help to keep up when your body CANNOT perform at the normal baseline.\n\nI also have glasses/corrective lenses. I am dependent on them to *see*. Somehow this **Medical Assistive Device** \"doesn't count\" despite being *exactly the same concept* as using medication.  It's using an outside tool to help you do basic things that your body isn't able to on its own, even though other people can see perfectly fine without assistance. But people understand I can't just 'try harder' and make my eyes see better.\n\nIf I had never gotten glasses, despite knowing my vision was shitty...  I probably wouldn't have a job, I definitely wouldn't be able to drive, and I'd probably have neck and back pain from constantly leaning in to squint at things 5 inches from my face.\n\n**So, imagine I'd NEVER gotten glasses.** I'm now 30. Someone offers me a pair of glasses. Should I put them on, or keep struggling the way I have been for decades?\n\nMedication like the stuff I take for ADHD is exactly the same way. My brain is physically, chemically structured differently than most people. Because of this structure, I struggle to do basic self-care and other activities required of me by society.\n\n&#x200B;\n\n**Treatments:**\n\nOnce I reached out to a doctor, got tested, got diagnosed, the FIRST thing they focused on was **lifestyle adjustments** and other techniques to help with *working around* memory and executive dysfunction.\n\nA good diet, regular exercise, restful sleep - those are also VERY important, and make a huge impact.\n\nIf you want to learn some tips about adjusting your life to work around ADHD, I recommend [How to ADHD.](https://www.youtube.com/c/HowtoADHD/videos) It's a pretty entertaining youtube channel, and very educational. ([\"Why stimulant medication helps ADHD - and how stigma can hurt](https://www.youtube.com/watch?v=38qpm6VKBFc)\")\n\nWhile medication on its own can definitely help, and lifestyle adjustments on their own definitely help, the two of them act as *multipliers* and make each other doubly effective.\n\nBoth is good.\n\n**Medications**.\n\nI take Adderall. I tried Wellbutrin but didn't like the side effects. There was several months of slowly adjusting the adderall dose until I was able to be focused and productive at work, but didn't get insomnia or other odd side-effects.\n\nEveryone's brain chemistry is a little different. What works for me may not work for you! That's why it's a very personal and customized experience when you try medications for ADHD, and why many people go through 2-3 different types before finding one that works well without unpleasant side-effects. This is normal. \n\n**Experiencing Adderall:**\n\nAll the cross-thoughts, noises, and constant impulses in my head just quiets down. I don't have to sort through a ton of options to make a decision.  That's the most striking thing. My brain is just.... quiet. It's really peaceful.\n\nI just see a thing, decide it should be done, and then go do it.\n\nI can focus on boring things like doing my taxes, filling out spreadsheets, doing laundry and feel relaxed about it. There's no itch to do 3 things at once.\n\nI actually go through my entire to-do list. I remember the list was made, and remember to check things off.\n\nI'm STILL incredibly creative. My personality is still exactly the same. I'm actually happier now, since I'm not constantly guilty by a pile of rotting garbage and dirty dishes that I couldn't make myself take out. It's done! They're clean!  I have far less to worry about because I can just *do things.*\n\nMy working memory still kinda sucks, but there's less clutter from the world clogging it up, so I can remember *more* than I used to. I can remember that I'm allowed to record conversations, or set calendar reminders and alarms.  It's way easier to grocery shop and actually *stick to my list* instead of buying whatever strikes my fancy.\n\nIt's EASIER to do the lifestyle changes, because my brain is no longer unconsciously calculating the trajectory of flies, forensically analyzing the history of a scuffed wall, or cataloging the species of trees around me in a desperate scrabble for *anything* that would give me dopamine.\n\nIt's basically the same kind of calm focus that caffeine gives me, but it lasts all day and still lets me sleep peacefully. I've got the dopamine now. My brain can relax.", "permalink": "/r/DecidingToBeBetter/comments/q35ayu/i_suck_at_being_an_adult_please_help/hfutrcd/"}