{"id": "t5_2tand_t3_8ax3iv_t1_dx2iekc", "creation": 1523282325, "origin": "t5_2tand_t3_8ax3iv", "height": 1, "replied_to": "t5_2tand_t3_8ax3iv", "down_vote": 0, "up_vote": 50, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Shukakun", "text": "A lot of that sounds very, very familiar. For a very long time, I've considered myself selfish, narcissistic, opportunistic, dishonest and overall a pretty terrible person. Self-improvement caught my attention mainly because of greed. I didn't have much money, I didn't have sex often, I didn't have many people who cared about me, and I wanted to learn how to get more. Like many men do, I fell in love with the idea of progress, of working hard to overcome the obstacle in front of me. I realized that the path of least resistance always comes back to bite you in the ass in the long run. There are two things that I think might help you become a better person and/or understand yourself better.  \n  \n**Selfishness is self-defense**  \nWe are instinctually selfish, no doubt about it. People who live paycheck to paycheck don't donate to charity much regardless of how empathetic they are. They're well aware that some starving African child needs food more than they need their cars, but not having the car would be too much of a personal setback. People like Bill Gates or Mark Zuckerberg usually contribute a lot to charity, but that isn't because they're extremely altruistic and selfless. There's no such thing as a billionaire who doesn't consider his personal wealth one of the most important things in his life. Without that mindset, they wouldn't get there in the first place. The amount of money they give to charity might seem huge to us, but in proportion to what they have and what they will earn in the future, it is much less than what a car is to Mr. paycheck-to-paycheck.  \n  \nSame thing goes for being honest, helping people and so on. There's no such thing as inherently evil people, only people who interpret the world as being so dangerous that they need to look out for number one even if it means fucking everyone else over. As your life gets better, you'll worry less about keeping your own head above water and you'll notice that you might look around and see if someone else needs your help every now and then.  \n  \n**Lying is easy**  \nIf you've ever looked into self-improvement and self-discipline in diet, exercise, mindfulness, personal economy or any other area really, you'll notice a clear pattern. Hard work pays off, and the easy solution is going to fuck you over eventually. You either willingly experience pain and hardship now to improve your future, or you flee from the pain and hardship using pizza, porn, cigarettes, video games or whatever your vice of choice may be. Such a lifestyle naturally leads to every aspect of your life degenerating into stressful, unhealthy chaos. You probably see lying the same way I've always done. You're good at it and you don't have any moral qualms about it, so if you can lie to someone, get away with it and benefit from it, why wouldn't you? I've pondered that question for a long time. The thing is, people who lie well and lie often are great at manipulation, seduction and charm. But they have a tendency to gain an infamous reputation eventually, and then they have to go somewhere where nobody knows them and start over. They're always on the move, never steady or safe. It's also a pain in the ass to keep track of all your lies in your head to make sure that you stay consistent, that and the fact that you keep reinforcing the idea that you're a bad, untrustworthy person both put a constant ruthless strain on your mental health. Being honest is simply easier and better for your self-image in the long run.  \n  \nSo, if honesty is easier in the long run, why not do it? Because lying is easier *now*. And some people need, or at least feel the need, to lie every now and then. Imagine you're a friendless, unemployed virgin and you're in a bar looking for a one night stand. If you're completely honest and tell every woman that you meet there that you have no friends, no money and no sexual experience, your chances of going home with someone is pretty damn close to zero. If you want to succeed tonight, you need to lie. Lying is quick and lying is easy, especially if you've done it for a long time and become good at it. But you would be much better off if you did the harder thing earlier, making friends, getting a job and getting some experience with women. My old mindset (which I suspect you have now) of \"Lie as often as you can whenever it benefits you, as long as you get away with it\" is a catastrophe in the long run. You'll be much better off with \"Lie only when you absolutely have to, and live your life in a way that you can openly talk about without having to feel ashamed or be hated by everyone around you\".", "permalink": "/r/DecidingToBeBetter/comments/8ax3iv/im_honestly_just_not_a_good_person/dx2iekc/"}