{"id": "t5_2tand_t3_8ax3iv_t1_dx2qfiu", "creation": 1523289947, "origin": "t5_2tand_t3_8ax3iv", "height": 1, "replied_to": "t5_2tand_t3_8ax3iv", "down_vote": 0, "up_vote": 17, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Rattl3me_throw-away", "text": "You hate yourself and you finally realize it. **GOOD!** This is the start my friend, now you can begin being self-aware enough to fix it. You're not a narcissist. You're no different than any human out there. Do you think everyone in the world doesn't do things for validation but you and other narcissists? Well you're wrong if you think that. The difference is not letting it define you. There are things you cannot change. You cannot rid your entire self of the desire or need for validation. That's okay. You just can't let it consume you like it is. Learn to live with it, not destroy it.\n\nI was in your shoes at the start of the year. I made a post here too. At the time, I was two months out of my ex leaving me. I was yelling and crying in my car because I wanted it all to fucking stop. I blamed everyone but myself my whole life. I hated myself to the very core and I was turning into a person I despised. Everything I wanted to be, I was not, and everything I hated, I was. I settled for that girl because I craved the validation she gave me. I treated her like a pile of garbage for years and she always stuck around. I ended up deciding to date her for self-serving and similar reasons that you describe above. I ended up falling in love but that's besides the point. I changed a lot during that time with her but I didn't understand life or how to be the man I wanted to be much more than just running away from the piece of shit I still was underneath. I went from getting my validation from other people to just from her. I was happy when I was with her but I was so different without her. I was still running from a whole slew of issues and just confiding in a single person. It was far from healthy and fell apart once she left me. I deserved every last word and action she gave me. \n\nThat day I spent screaming in my car that I hate myself, I made a choice. A choice to not hit rock bottom and just turn my life around. I made the choice to build a life I love. I made the choice to be the person I knew I could be. I picked up meditation, running and redeveloped passions for things that I have (in-spite of picking them up for the wrong reasons). I have lost 20 pounds since this time, i meditate 45 minutes a day and run for another 30. I really recommend using the apps \"Headspace\" or \"calm\" for meditation. I couldn't say better words about them. I let my ex go and have found how to bring happiness into my own life for the right reasons. I repaired relationships with friends I lost and family I was horrible to. I have studied some Zen Buddhism, specifically from Alan Watts, and have started reading this book called \"I Am A Strange Loop\" by Douglas Hofstadter. It's wonderful. They provide wonderful commentary on who we are and insight into the self-finding journey.\n\nMy point is, this is the start of your journey to loving yourself. I know you're overwhelmed and don't know where to start. Start small. Do the little things right and see it expand into something more beautiful. I went from hating myself and wanting nothing more to change the piece of shit I was to being someone I love and care for. I look inside and see someone who is strong and I couldn't be more proud of myself on where I've come since then. \n\nYou're not alone in this journey and having the insight to see that you are these ways only proves you're not a narcissist. You're in a loop you're stuck in and you can see you're the only thing that's in your way. This is the first step to getting out. You're not your thoughts and they don't define you. You're more than that. Find love for yourself and all of this goes away. \n\nIf you want to talk further or anything like that, my pms are open. Take care and good luck friend", "permalink": "/r/DecidingToBeBetter/comments/8ax3iv/im_honestly_just_not_a_good_person/dx2qfiu/"}