{"id": "t5_2tand_t3_ozuumu_t1_h83q82f", "creation": 1628374047, "origin": "t5_2tand_t3_ozuumu", "height": 1, "replied_to": "t5_2tand_t3_ozuumu", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Okitsu", "text": "Most people learn first by focusing on breathing. In and out.\n\nNatural breathing is not something most people think about - many often learn chest breathing and resort to mouth breathing when physically active. It might not make sense at first, but you breathe with your stomach and ideally breathe in through the nose and out through the mouth. Hypothetically the best.\n\nLearning that natural breathing is kind of like meditation, as the focus is on the self. It's a type of \"body scanning\" meditation, or so I've been told. You can do this with any action you can physically take, but breathing is an easier start. \n\nDon't beat yourself up if this isn't intuitive or easy to start. Certainly it's difficult to explain.\n\nThe other names of meditation types escape me, but consider this: there is another step back where you realize that there's a lot more going on than breathing at this current moment. Every other sense is being \"ignored\", or suppressed. Sight and taste, temperature, balance are not as important while focusing on breathing. They're still happening automatically, your subconscious is dealing with them. Your breathing is usually subconscious. It might not be while reading this post, sorry. If you let whatever you're focusing on slip into the suppressed, automatic, you can... enter a trance, to lack any better term. This trance is a practiced state of mind. I find it lets me browse the subconscious feelings that I normally suppress. Simple things like breathing, walking, feeling. I can choose which one to focus on, and sometimes they come to me as though by accident.\n\nAt least, this is what me and my therapy have arrived at. It's been 14 or so years since I started focusing on breathing. In personal experience, I feel like I'm a better person slowly since it began. Maybe in every way.", "permalink": "/r/DecidingToBeBetter/comments/ozuumu/are_you_a_slave_to_your_thoughts/h83q82f/"}