{"id": "t5_2tand_t3_lkjdrg_t1_gnmz8rz", "creation": 1613476587, "origin": "t5_2tand_t3_lkjdrg", "height": 1, "replied_to": "t5_2tand_t3_lkjdrg", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "D-Squared42", "text": "Im in almost the same situation as you but im the guy and we have been best friends for almost 9 years now. We \"dated\" once in middle school and then confessed feelings for each other again in freshman year of college but the timing wasnt there at that time. Ive recently realized that i still have feeling for her and would like to actually try things out but I'm not sure at all if she feels the same way. We do everything you've talked about doing with the guy you like and more but i just cant tell if she has any romantic feelings for me. My advice for you based on what i wish my friend  would do IF she felt the same way towards me is to give flirty compliments (im kinda oblivious when it comes to flirting so i dont really have any examples on what to say exactly), ask his opinion on more personal stuff like your outfit for the day or your hair. Stuff that makes him feel like you actually care what his opinion is and then show him that you appreciated his input ya know. Small things like \"this made me think of you\" are also great imo cuz my heart flutters when i get a text like that. Also just asking him stuff about his passions are great way to probably get him talking if hes not a huge talker. Ask me anything about cooking/baking (like actual questions not just \"what is your favorite thing to X\") or any of the fandoms i like and i will talk for hours. if all else fails just tell him. Personally im a bit to scared to say anything cuz every woman i've liked who was also a friend beforehand has cut ties with me afterwards cuz they felt weird i guess and id rather silently crush than lose my best friend. I hope it all works out for you two!", "permalink": "/r/DecidingToBeBetter/comments/lkjdrg/finally_successfully_asked_someone_out_out_on_a/gnmz8rz/"}