{"id": "t5_2tand_t3_jh8m75_t1_g9xftoy", "creation": 1603559041, "origin": "t5_2tand_t3_jh8m75", "height": 1, "replied_to": "t5_2tand_t3_jh8m75", "down_vote": 0, "up_vote": 28, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "elizacandle", "text": "Amazing! You can't fix a problem you can't see... \n\n#for anyone not able to do therapy yet, here's some super helpful books /resources that can help in the mean time.\n\n- [*Running On Empty*](https://drjonicewebb.com/the-book/) by Jonice Webb (and its sequel)\n\nAmazing books that really help dig deep, gives you easy do's and don'ts for developing healthy coping skills, healthy habits. Etc. Really worth the read. The reason I HIGHLY recommend these is because they focus on emotional *neglect* which is often (and understandably) overlooked in favor of more visible issues such as physical /emotional abuse. However emotional neglect can be just as harmful as any other form of abuse and Dr. Webb Really helps you understand how to improve your emotional health and heal from your past.\n\n- [*The Body Keeps the Score*](https://www.brainpickings.org/2016/06/20/the-body-keeps-the-score-van-der-kolk/) By: Bessel van der Kolk\n\nFocuses on healing from trauma and abuse. I've only started it, but it is promising and comes highly recommended. \n\n- *Adult Children of Emotionally Immature Parents* by Lindsay C. Gibson\n\nVery good to open up, name things. I didn't personally resonate with this one as much but I totally see the merits of it and touches on many topics. \n\n\n- [In Love While Parenting App] (https://appgrooves.com/app/in-love-while-parenting-couples-app-by-hjb-ventures-llc) \n\nThis amazing little app is available for free on Apple and Google. While it is aimed at people who are parenting and in a relationship the facts and guides it shares are extremely useful in helping you build stronger relationships and emotional bonds with those around you. It has short videos and is easy to use just a few minutes a day. \n\n###For Parents trying to BREAK THE CYCLE\n\n- [*No Drama Discipline*](https://m.drdansiegel.com/books/no_drama_discipline/) \n- [*The Whole Brain Child*](https://m.drdansiegel.com/books/the_whole_brain_child/) \n Both by Daniel J. Siegel and Tina Payne Bryson\n\nThese are wonderful parenting books that really teach you how to encourage and help your child thrive and move away from punishment and towards teachable moments and bonding experiences. They really explain how a child's mind is different, how to manage tantrums and misbehavior in a more conductive manner. \n\n**Things to remember on your journey of self growth**\n\n- Progress isn't linear\n\n- Mistakes are normal and they do NOT erase your progress. \n\n- Be gentle with yourself, you cannot shame your way into improving \n\n- Don't try to change every single thing at once. True lasting change is done incrementally over time.\n\n- Take breaks- and give yourself time to process! \n\n- [Self Care](https://www.blessingmanifesting.com/wp-content/uploads/2017/07/6720202.png) is a must! It comes in many forms and what works for me may not work for you! Exploration is key. \n\n#YOU CAN DO THIS\n\n\n#Break The Cycle", "permalink": "/r/DecidingToBeBetter/comments/jh8m75/stop_telling_yourself_you_dont_need_therapy/g9xftoy/"}