{"id": "t5_2tand_t3_mjfcsk_t1_gt9ysap", "creation": 1617479288, "origin": "t5_2tand_t3_mjfcsk", "height": 1, "replied_to": "t5_2tand_t3_mjfcsk", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "throwaway7977335", "text": "Hi there, thank you so much for reading and responding. \n\n\"I can't\" does seem to be my safe space. If I don't try, I won't fail and I can't be embarrassed, you know? I would love to redirect that energy and feel more confident and happier with myself, but nothing I've tried has actually made a difference. I've tried \"turning my negative self talk positive\". I've tried imagining what I'd think of someone else who spoke to me the way I speak to myself, etc. Theoretically, that should make me realize what I'm doing to myself isn't right, but it hasn't actually helped me reframe anything or feel any better. I don't often say it out loud to anyone else (with few exceptions when I decide I need to open up to my husband or best friend), even though it's always on my mind, typing all this out is one of the first time's I've really \"put my thoughts out there\" and allowed anyone else to glimpse how I feel about myself.\n\nI honestly don't know what I like about myself. Anything I've been complimented on before just seems so hollow and like that person was wrong or didn't know me well enough to make that compliment. Again, it's easy for me to make excuses why I don't like myself in the face of someone telling me otherwise. \n\nIn terms of goals, I have been trying to step out of my comfort zone. About 3 years ago, I took a job that requires me to be \"in charge\" of large project management, be client-facing, and to travel A LOT. I was hoping I would get used to it, and that being successful in that space would help build confidence. Outside of being more comfortable at airports, I haven't really gained anything that I can see - it's still a struggle and most days, I feel like I don't even belong in this position.", "permalink": "/r/DecidingToBeBetter/comments/mjfcsk/i_feel_like_its_time_for_me_to_address_my_mental/gt9ysap/"}