{"id": "t5_2tand_t3_oczq1s_t1_h3zv2vy", "creation": 1625376902, "origin": "t5_2tand_t3_oczq1s", "height": 1, "replied_to": "t5_2tand_t3_oczq1s", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "First of all, don’t ever feel ashamed to FEEL. Grief comes in all forms. We grieve when someone dies, we grieve when dreams die. We grieve when we try to accept an opportunity and the opportunity we took doesn’t work out. Grief is normal, it is nothing to be ashamed of and it is something we have to feel as humans, so we can move forward. Too many people feel that emotions expressed shows weakness. Feelings are not a weakness. You should not be subjected to hiding everything, feeling isolated to the point where you can only express yourself in an anonymous way on a website. You have every right to feel what you are feeling and you have the right to express yourself in every facet. The best thing you can do is find a way out of that environment that has you so isolated. Not one person was put on this earth to suffer so silently. Your life matters, your feelings matter. YOU MATTER. Please do everything you can to find a way out of this environment, to get your own place. That alone will change everything for you. I don’t know you at all, but I feel the pain in this post and it breaks my heart. I hope you understand that your silence in your suffering is heard, I pray and I wish that you will have an opportunity to leave this environment, to find somewhere that you can thrive. I hope you can find people that care for you and will help you find the place you can go to truly be free. There is nothing wrong with crying. It’s healthy. But it’s not healthy to be in such a negative environment where you are squandered as a human being. Please take care of yourself. And if your feelings ever take you into a dark place where you feel like your life doesn’t matter, reach out to all of us. Reach out to somebody outside of that environment. You are worth so much more than your current circumstances. AND YOU ARE NOT WRONG TO SIMPLY FEEL. I love you. You matter. I promise it will get better.", "permalink": "/r/DecidingToBeBetter/comments/oczq1s/as_an_adult_with_problems_im_just_wondering_if/h3zv2vy/"}