{"id": "t5_2tand_t3_oczq1s_t1_h3yuiup", "creation": 1625353250, "origin": "t5_2tand_t3_oczq1s", "height": 1, "replied_to": "t5_2tand_t3_oczq1s", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "w_crow", "text": "Yes please let yourself cry. The same way the response to emoting anger is socially created, so is our reflection of self around crying.\n\nIt took me years to welcome sadness in my life, as a friend. Warmly. I would create stories around sadness being unacceptable, ignored. This would bottle up sadness until anger became my only way to express.\n\n Sadness truly is a natural body function. Crying is a natural body function. Men particularly have been taught to walk away from sadness, scientifically, neurobiologically our hypothalamus is made to process sadness from our memories of expressing sadness in our hippocampus and the more that loop is expressed the stronger the resonance of the emotion will be. Trauma after trauma, the more we pack it away, the more cortisol and adrenaline is created in our bodies, until we are truly physically sick. Like an overheating vehicle, we break down from the inside. \n\nYour tears, o2 intake, circulatory systems are all meant to operate with some sadness. If you feel like its safe, try finding a quiet place, journal about what you feel sad about, get some water, but on some sad music and try to cry. Welcome in sadness like an old friend you haven't seen, its not there to hurt you, only to express what is normal for what you are feeling. Experiment.  Try to smile while you cry, it is possible. It also is possible and nor al for your body to only be able to dump out so much stress through crying, it won't go on for days. It can be possible to take breaks, return to your journal and write down what thoughts or other feelings came up for you. \n\nWomen in western culture have often labeled \"a good cry\" as a positive experience of expression. Women are humans, men are humans, it is possible for everyone to have a good cry through intentionally exploring your emotions bravely and with curiosity and dignity. \n\nI believe in you. Be well!", "permalink": "/r/DecidingToBeBetter/comments/oczq1s/as_an_adult_with_problems_im_just_wondering_if/h3yuiup/"}