{"id": "t5_2tand_t3_c1wyst_t1_et3vg2b", "creation": 1562439804, "origin": "t5_2tand_t3_c1wyst", "height": 1, "replied_to": "t5_2tand_t3_c1wyst", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "SoothingSolesNC", "text": "Love this post Trevor! I just published a similar one that would be a great addition to yours. \n\n——————-\n\n25 Qualities of Genuinely Happy People\n\nWe all aspire to greater happiness.\n\nWe currently have more comforts and luxuries than ever before and yet addictions are at an all time high. \n\n1 in 6 Americans is on antidepressants.\n\nThe World Happiness Report of 2019 revealed that Americans have reached a record level of unhappiness.\n\nSo what sets genuinely happy people apart from the rest?\n\nWhat are they doing that is different?\n\nAnd what can we learn from them?\n\nI define ‘genuinely happy people’ as people whom are so solid within themselves that they are not easily shaken by and perturbed by what’s going on around them. These people most definitely feel the spectrum of human emotions including anger, sadness, etc. But what sets them apart, and what allows them to remain in a relatively consistent place of happiness, are a combination of the following qualities:\n \n25 Qualities Of Genuinely Happy People\n\n1. They choose courage over comfort.\n\nComfort breeds complacency, and when we become complacent we end up settling for whatever is easiest and fastest, versus what is more rewarding and enriching. Success comes from taking risks and having the courage to fall, over and over again, and to take risks, you need courage. As Brene Brown so eloquently states below, courage and comfort are mutually exclusive, so you HAVE to pick one. Don’t let comfort become your default. \n\nWhen was the last time you stepped out of your comfort zone?\n \n\n2. Their self-worth comes from within.\n\nWhen we place our self-worth in the hands of external situations, events, achievements and people, we become an emotional roller-coaster and our happiness suffers. In contrast, when we recognize that true self-worth comes from within, nothing anyone elses does or says can disturb our peace. You can lose your job, your spouse, have your manuscript rejected, be criticized, be ignored, be ridiculed, be gossiped about and you still feel good about you. This is one of the key ingredients to genuine happiness.\n\nHow do you feel about you? Do you need other people’s approval to feel ok and be happy?\n\n3. They have a deep humility.\n\nHappy people tend to be self-aware of their flaws and weaknesses and as such have developed a good dose of humility. Humility comes from a healthy appreciation of our shortcomings, rather than toxic self-deprecation. This isn’t about being critical with ourselves, it’s about viewing our imperfections with unconditional positive regard. \nHumility and pride are mutually exclusive. Pride says: I’ve got nothing more to learn. Humility says: I’m forever teachable. There’s always more to learn.\n\nWhen we are humble,  we are far less reactive in the face of criticism and judgement. We can easily steer past hurt because we’re able to find and own up to our shortcomings without shame and self-deprecation.\n\nHave you lovingly embraced your flaws and weaknesses yet? Are you teachable?\n\n4. They have a helpful belief system.\n\nWhat you believe matters.\nYour belief system is responsible for how you see yourself and how you perceive the world and those around you, and as such, your belief system is directly linked to your level of happiness. What you believe determines how you feel and how you act.\n\nBelief systems are not right or wrong. They are simply helpful or harmful.\n\nThey determine how you feel when you wake up every morning – do you wake up excited to take on the new day? Do you wake up grateful? Or do you wake up stressed and slightly depressed? \nYour belief system also determines how you manage stress, crises and accidents. Do you fall apart? Do you get angry and feel bitter? Do you hit rock bottom? Or does your belief system cushion your fall and offer you a soft (and comforting) place to land? \n\n5. They are self-aware. \n\nSelf-awareness means having a deep understand of you. Who you are, what your strengths are, what your weaknesses are, what your gifts are. Self-awareness involves getting to know your belief system and thoughts intimately. When we become more aware of our subconscious belief system and the stressful thoughts that run on auto-pilot in our minds, we are able to better understand our behavior and our actions. This allows us greater self-mastery, which in turns leads to greater happiness. \n\nDo you have a deep understanding of you?\n\nTo read the rest go to The Holistic Health Academy blog and it’s the first post on the homepage! \n\nIf you have any questions don’t hesitate to reach out!", "permalink": "/r/DecidingToBeBetter/comments/c1wyst/11_hacks_to_boost_your_happiness_backed_by_science/et3vg2b/"}