{"id": "t5_2qh5i_t3_jy066a_t1_gd1mh1b", "creation": 1605957519, "origin": "t5_2qh5i_t3_jy066a", "height": 1, "replied_to": "t5_2qh5i_t3_jy066a", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "hidefromthe_sun", "text": "This is a severe mental health problem. Speak to your family and work with them. You need their help. Everything comes second to getting sober, including work. So far as work is concerned you're off with stress - take time out. The blackouts will get worse and will happen sooner into your binge.\n\nI'm 2 years sober but this was my life exactly. Binge. Withdrawal. Sober for a short while. Rinse and repeat.\n\nIf you're experiencing withdrawal symptoms please see a doctor. They can help with medication. My experience of quitting alcohol is that within a couple of weeks that overwhelming voice that I couldn't live without it started to get quieter. 6 months and I was living a relatively normal life. Addiction services and AA helped me feel less alone with this problem.\n\nExercise is your friend. I have an unhealthy relationship with it, as in I follow the same addictive patterns and crash when I'm injured but it's a lot better than drinking and hoofing enough cocaine to keep Pablo afloat for week. Healthy eating will heal the damage you've done. Lots of vegetables.\n\nMeditation is fantastic. Watch Mindfulness - The Mind Explained on Netflix. It does a far better job than I can at explaining how it breaks the pattern of worrying and anxiety about the past and future. It helps with the guilt. Staying sober helps with the lies.\n\nThere's a life outside of this. If you don't stop alcoholism will be your cause of death, whether it's from injury, liver damage or any of the myriad of health problems this causes. I wish you the best of luck. Don't feel guilty - everyone in your position deserves to get out of it.", "permalink": "/r/happy/comments/jy066a/in_just_a_few_days_i_will_be_1_year_sober_no_its/gd1mh1b/"}