{"id": "t5_2qh5i_t3_jy066a_t1_gdb8jxw", "creation": 1606116622, "origin": "t5_2qh5i_t3_jy066a", "height": 1, "replied_to": "t5_2qh5i_t3_jy066a", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Playinhooky", "text": "I didn't see your comment until now. I just finished my rotation and grabbed a mickey instead of my usual 26. I knew if I could just get home with that I wouldn't be too tempted. \n\nFirst day back at work was rough. I broke my glasses on my binge and am normally chatty but was quiet yesterday. I think my coworkers knew something is up. I really love my job and did really well today so thats a plus.\n\nI think if I can manage to get out of the house and get groceries, cook a nice lunch and dinner and not drink until after dinner I should be better on Tuesday. I need that to go well as I am seeing my Grandma. She has been such a help getting sober this summer then I fucked up. She came to my work looking for me because I wouldn't answer my phone.\n\nI just need to stay away from 40s. I'm going to ween myself off as when I go cold turkey I go back to binging hard. As long as I can eat for the next week or so and slowly decrease my intake I should be ok soon.\n\nIts like a whirlpool. I feel like the further I get to safety the stronger that pull gets. I just need to keep contact with family and maintain my positivity at work.\n\nAnd I know you say not to feel guilty but I was in rehab almost 3 years ago exactly. They paid for all of it. Guilt is killing me.\n\nI think my biggest issue is ignoring problems in my life and booze and Netflix/video games is the easiest and sure way of ignoring them. Its been a problem for a while.\n\nI WILL get back on track. I got way more out in this comment than I should. I hope you haven't invested enough in me to read this far but I really appreciate your words. I can do this.", "permalink": "/r/happy/comments/jy066a/in_just_a_few_days_i_will_be_1_year_sober_no_its/gdb8jxw/"}