{"id": "t5_2qh1i_t3_7c5u3e_t1_dpnf4ju", "creation": 1510368373, "origin": "t5_2qh1i_t3_7c5u3e", "height": 1, "replied_to": "t5_2qh1i_t3_7c5u3e", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": null, "text": "I suffered from a very severe and resistant form of depression and anxiety for a very long period of my life. At the time of the attempt, I was living alone and had suffered a psychiatric episode of sorts. \n\nI had made different plans for killing myself previously but this one didn't occur under the previous contexts. The others were much more thought out and realistic (I would have succeeded in the other methods) but this one was me in the middle of a really bad psychosis just grabbing a bunch of pills. \n\nSo I had been on a medication at the time which didn't work. Part of the drawback of that medication was I couldn't use typical fast-acting anti anxiety medications alongside it. \n\nMy doctors opted for this stuff called **Hydroxyzine** which is basically just a really strong prescription antihistamine medication. It knocks you the fuck out in a way that I can't describe. It's basically anti anxiety in the sense that you won't be conscious of the anxiety attack and just sleep right through it. \n\nIn a fit of psychosis, I swallowed a bottle of the things and figured that would be enough to kill me. Considering one pill was a high enough dosage to knock me out for a day, the whole bottle would do the trick. \n\nWhat happened instead was I got a little sleepy and went into a vomiting attack. One of the unknown side-effects of my anxiety was I developed an ulcer I didn't know about. I found out shortly after this when I began vomiting blood. \n\nIt turned out my anxiety burned a hole in my stomach because of the increase in acid. The beautiful irony of my suicide attempt was the very thing I was killing myself over turned out to had inadvertently saved my life. I wouldn't have vomited up the pills if I had the ulcer. \n\nI never told my family what happened. I was living alone at the time and I simply went to the ER after I started vomiting blood. I told them I had been suffering with GI issues for a while and it got worse after I had taken some medications (which they believed)\n\nI'm no longer suicidal. I found treatment that worked and am currently at a point where I can say I feel 100% stable. I don't have the anxiety attacks anymore and I don't have the mood swings or the extreme depression. The issue was pushing myself to actually keep looking for treatment (which is hard when waking up in the morning isn't really possible on most days)\n\nTreatment does work. You just have to keep looking until you find something that works for you.", "permalink": "/r/AskReddit/comments/7c5u3e/serioussuicide_survivors_of_reddit_what_happened/dpnf4ju/"}