{"id": "t5_2tand_t3_pnlwwm_t1_hcreacc", "creation": 1631579844, "origin": "t5_2tand_t3_pnlwwm", "height": 1, "replied_to": "t5_2tand_t3_pnlwwm", "down_vote": 0, "up_vote": 7, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "fishtimer", "text": "it sounds like so far, all your decisions have been either made for you, or your family has subsidized you enough that you never had to deal with any actual consequences of your actions. the consequences of you past choices here may feel harsh and severe, but buddy, the choices you made were extreme. you're the one who pushed things to this point, and you're the only one who can fix this. for most other people, the things you were already doing (like only working when you feel like it, only taking on projects you like, etc) would have had way bigger consequences than what you're currently experiencing. \n\nand look: you're a spoiled rich kid, but that's not entirely on you. spoiled rich kids don't just materialize out of thin air, and your parents really didn't do you any favours by protecting you from the consequences of your choices. it definitely **is** going to be harder for you to adjust to a more normal life than it would for someone that was raised in it. it's going to hurt and feel painful, embarrassing, and impossible, but personal growth pretty much always does. it's easy to be fit, talented, etc, when you're handed everything on a silver platter - sorry, but those achievements aren't actually the achievements you probably felt they were at the time. that's part of why everyone hates rich people: they believe they're better than everyone else because they've achieved things other people haven't, while ignoring that wealth is what made those achievements possible for them in the first place.\n\nyou have an opportunity here to grow past that. I know you don't want it to, but there's a good chance this is going to be a defining point of your life, but that doesn't have to be a bad thing. if you didn't change from this experience, if you just switched things up a little and got back to where you were in a few months again, you'd just go back to being a spoiled brat. is that what you want? or would you rather grow as a person and become something more? \n\nthis leads me to my main point: it's time to start making your own choices, taking responsibility for them, accepting the consequences, learning from your mistakes, and continuing to grow. you've acknowledged you fucked up severely and have been insanely privileged, and that's a great starting point, but you still aren't taking responsibility for your life or making your own choices. look at your post - you're working a job your dad set up for you, that you hate, to try and get back the wealth before because you see no other option. trust me, there are plenty of other options. (what about the work you already enjoy and have a lot of experience with? what's stopping you from finding a more regular position doing that?) it's time to do some serious self reflecting, and figure out what actually matters to you. instead of trying to get back what you lost, figure out what's important to you, and how to get there. your situation may be insanely, ridiculously good compared to pretty much everyone else, but that doesn't mean it's right for you. that's not being a spoiled rich kid, that's being your own person. it's not easy, but it's worth it.\n\nin terms of more practical advice:\n\nget yourself to /r/ADHD and start asking for help with coping strategies. some of the things you mention, like not being able to connect hard work in the now with payoff later, are actually ADHD things, and discussing it with other people struggling with the same thing can be incredibly rewarding and helpful. \"taking charge of adult ADHD\" (the author is..something like Bertram Russel? I don't remember offhand, but the cover is mostly yellow) is a great book to look into as well.\n\nrelated to this, get yourself a therapist ASAP. your life has changed hugely, and it's 100% normal and ok to need help talking through your experiences/feelings and how to deal with them. I'm not sure where in the world you're located, but psychology today is a great resource for finding therapists in North America (not sure if they cover other countries or not), and it will list therapists' specialties. find someone who lists ADHD as a speciality - that's important. it's also very important to find someone you feel comfortable and safe talking to, that you have a connection with - this is way more important than the particular type of therapy they practice, or their specific qualifications. it can take some time to find a good one, but it can make a huge amount of difference.\n\nalso, discipline is not a personality trait, it's a skill you can improve. start small, do sth like Pomodoro (20min work, 5min break), starting with short stretches of time, and increasing as you become more used to it. it will absolutely get easier as you build it.\n\non a lighter note, try watching Schitt's Creek - it's a sitcom about a rich family who lose everything and have to start over in a small town. it's a really good show and it might help you feel less lonely while you're still trying to make friends.", "permalink": "/r/DecidingToBeBetter/comments/pnlwwm/what_advice_can_you_give_to_a_spoiled_brat_who/hcreacc/"}