{"id": "t5_2tand_t3_pnlwwm_t1_hcqncea", "creation": 1631567552, "origin": "t5_2tand_t3_pnlwwm", "height": 1, "replied_to": "t5_2tand_t3_pnlwwm", "down_vote": 0, "up_vote": 92, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ChickenSandos", "text": "No offense, but maybe this will motivate you to seize the opportunity that is before you and quit being lazy. \n\nYour father is going to allow you to have a beach house, a nice car, and everything you lost plus presumably a nice salary, if you accept the job he is offering.\n\nYou keep asking how does one adjust to normal life. The situation you’re facing is not normal life. Most people don’t get to have a house and a car and money just because they take a job that is literally handed to them without having to apply/interview.\n\nMost people in our generation are going to have to work literally decades at a boring-ass 9-5 to be able to afford a regular house, not even a beach house. Have you seen housing prices lately?This is probably after they have payed off their student loans and after they went through the process of applying to countless places and received as many rejections. All the while people walk the thin line between living on a shoestring in order to progress while splurging here and there for small pleasures but making sure to keep out of credit card debt. \n\nYou are still in a very advantageous position. You should feel happy about this and grateful and do the work so you don’t regret squandering an opportunity to stay in the upper echelons of society. From what you are telling us here, you are a long way from rock bottom. \n\nI do not attempt to insult you or call you privileged or any of that. I am just being real with you because it sounds like you think your life could not get much harder, which is misguided based on your post.\n\nI guess my advice is that you should not resent your station in life or the fact that you have to work. You have incredible opportunity in front of you that others can only dream of, and to not seize it would be a grave mistake.", "permalink": "/r/DecidingToBeBetter/comments/pnlwwm/what_advice_can_you_give_to_a_spoiled_brat_who/hcqncea/"}