{"id": "t5_2tand_t3_pnlwwm_t1_hcq7j52", "creation": 1631561162, "origin": "t5_2tand_t3_pnlwwm", "height": 1, "replied_to": "t5_2tand_t3_pnlwwm", "down_vote": 0, "up_vote": 17, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "CeeCee123456789", "text": "I am sorry that you have gone through a rough time. Most of us have a hand in choosing some portion of our own pain. While the house on the beach, etc may have been different, pain is relatively universal and drug addiction happens to all kinds of people.\n\n[I am not a scientist or a drug counselor, so I am happy to be corrected if I am wrong. ] Chemically drugs have a tendency to overwhelm the feel good centers of the brain. Imagine that in regular life, you enjoy your shower. Sometimes the water pressure sucks, other times you have a brand new shower head, and it is just right. Either way, if water is pleasure, you are experiencing it. Now imagine you are standing under a raging waterfall. Your shower, even the one with the perfect water pressure isn't going to be able to compare.  \n\nWhen you use drugs regularly, your body gets used to the waterfall. That is one of the downsides of drug use.  So, you don't experience the shower the same way. For a while, life is going to feel less exciting. That is just part of it. \n\nDrugs also have a powerful effect on learning and memory which can make it difficult to be in recovery in the same space/places that you used to use. If the first time you got high, you were sitting next to a red door, decades later seeing that same door can trigger a craving for the drug. Leaving the country sounds difficult, but it is long-term, likely a good thing. \n\n\n>The work that my dad is offering me is incredibly boring in comparison, and requires me to be in the office 9-5, five days a week.\n\n>. I'm struggling with the concept of suffering now so that I can have a better future later.\n\nIt is not about suffering, it is about balance. If your job isn't as exciting, find excitement elsewhere. If you enjoy hiking, plan a trip using your vacation days. If you like boxing, take a class on the weekends. Figure out how to turn on the shower, while recognizing that 1.) It isn't gonna be the waterfall 2.) That is a good thing. You stay under a waterfall long enough, and you will drown. \n\nIf your identity is tied to your creativity, then keep being creative. I write poetry. Professionally, even \"successful\" poets operate at a loss. Your job doesn't have to be tied to your creativity. If it is a 9-5, from 5-midnight (or whenever you go to bed) is your time. Paint or design or whatever on the side. Your life doesn't have to be your job. Your identity doesn't have to be tied to your job. \n\nI want to encourage you to get some counseling (it you aren't already) and some support. You don't have to do this by yourself.  I  also want let you know that you are already doing really well. The fact that we are having this conversation is a testament to how far you have come. \n\nKeep ya head up. \n💛", "permalink": "/r/DecidingToBeBetter/comments/pnlwwm/what_advice_can_you_give_to_a_spoiled_brat_who/hcq7j52/"}