{"id": "t5_2tand_t3_o0dpqr_t1_h1ulv11", "creation": 1623766395, "origin": "t5_2tand_t3_o0dpqr", "height": 1, "replied_to": "t5_2tand_t3_o0dpqr", "down_vote": 0, "up_vote": 3, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Iyioj", "text": "Hello! \n\nI suggest /r/nonzeroday and /r/getmotivatedbuddies . Once you've made some goals you can keep yourself accountable to stay motivated and you can find inspiration there.\n\nThere are also subs to spend less time online if you think that will help you. (/r/nosurf and /r/dopaminedetoxing)\n\nTo get started I think it might help to think about why you're doing what you're doing at the moment. Screens provide easy dopamine fixes, so you could try to replace that with an activity offline that also feels rewarding. You have to be aware that your brain is used to quick dopamine fixes and offline activities may be slower at feeling rewarding but I think in the end it will feel more fulfilling. For example after cleaning your place you can feel very proud of yourself for having a clean and organized space. \n\nAlso think about why you procrastinate. Are you someone with an all or nothing mentality? \"I have to clean my whole room today, but that's such a big task so I might as well do nothing.\" Or you don't know where to start so you just don't. It helps to think of a very small starting step with which you can begin. Also, some people procrastinate because they're afraid of failing and want to avoid that negative feeling by never starting. Or you feel like something is such a small and trivial thing, not worth your time so you ignore it and end up not doing it.\n\nYou have limited willpower each day, but once you have made something into an automatic habit \nit takes a lot less willpower and mental energy to do something. A recommended book is Atomic Habits (this book is recommended everywhere on reddit lol). Start by building one habit at a time instead of trying too many new things, getting overwhelmed and returning to your old behavior. One habit could be going for a walk everyday, and then later build up to more exercise. Or doing the dishes each day immediately after dinner.\n\n\nAs for a hopeful story for inspiration, here's a bit about me:\n\nA while ago I was pretty depressed, sleeping in until noon everyday, barely getting any household chores done and not really doing much. My first habit was starting to go for a walk everyday. It helps against depression and that was my motivation to do it even though sometimes I totally didn't feel like going. I don't exactly remember which habit I started after that, but I've been meditating, getting up earlier  and flossing everyday 😂. Flossing may seem like such a small habit, but it builds your discipline muscle. Working on your posture is also a good habit. I'm slowly adding more habits to my life and I've been quite happy with everything that I'm able to do each day. In the beginning it helps to have the goal of doing at least one positive thing per day (hence the nonzerodays sub). It could be something small like doing the dishes. When you've achieved one small thing you'll feel good and motivated to keep going.\n\nHope this helps! Good luck!", "permalink": "/r/DecidingToBeBetter/comments/o0dpqr/ive_decided_to_be_better_how_do_i_actually_start/h1ulv11/"}