{"id": "t5_2tand_t3_or6xjg_t1_h6hpvvs", "creation": 1627233122, "origin": "t5_2tand_t3_or6xjg", "height": 1, "replied_to": "t5_2tand_t3_or6xjg", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "messybitch87", "text": "It’s normal to be difficult to focus and all that during meditation. The point isn’t to be able to clear your mind, but to learn to not get completely engrossed by your thoughts. It takes practice. When thoughts pop up to distract you, you’ll see them, possibly get distracted by them, and then turn your focus back to your breathing. Rinse and repeat. Learning not to let your thoughts take over is basically a bit of cognitive behavioral therapy, which is what you NEED to start learning to control your emotions. \n\nI’m speaking as someone who has done a lot of therapy for PTSD, which if you aren’t aware, comes with unpredictable mood swings like 0-1000 burning rage. Do I still get enraged, defensive, terrified, etc? Of course. Does it still control my life and my actions? Nope. Was I able to fix it quickly? Nope. It took years. \n\nCBT was easily the most helpful thing to learn to control my mood swings and get them to occur less frequently. Try mindfulness meditations to start, the headspace app is especially useful for learning to retrain the way you acknowledge and process thoughts. Or move onto The Honest Guys on YouTube when you want something more interesting. Had an out of body experience with them. Good times. \n\nAnyway, cognitive behavioral therapy is what’s going to help you the most, of which meditation can greatly assist. Basically you need to learn to retrain your mind on how to process thoughts and emotions that pop up. When you feel yourself overreact to something someone says, or their tone of voice, you need to immediately stop that process and analyze. “Am I overreacting? They probably didn’t mean it like that. I know that my brain takes things personally, so this is most likely one of those times. It’s ok. Not everyone is out to get me. Do I need to dedicate this much emotional space to this one moment of my day?” Etc etc. Basically you’re just interrupting the moment before it can escalate and consume your whole mind for hours. \n\nHonestly, I’d highly recommend going to therapy to have a professional help you through this process. It will go much faster with professional help. Getting a therapist you like can take a moment too. Don’t give up if you don’t jive with the first therapist. They totally get it. Just ask to see a different therapist, or go ahead and schedule yourself with a different therapist. Sometimes you have to try a few before you find one you like. Totally normal. \n\nBtw, angry journaling can help some people, but it can cause some others to bask in the bad things and just get worse. So look out for which reaction you’re having to it and stop if it’s making you worse. If it does make you worse, but you still want to journal, do it by writing only positive things. Even if you only wrote down one positive thing on some days, and even if it’s small, this will still contribute to building a healthier worldview and healthier emotions over time. \n\nGood luck to you!", "permalink": "/r/DecidingToBeBetter/comments/or6xjg/how_to_stop_being_angry/h6hpvvs/"}