{"id": "t5_2tand_t3_or6xjg_t1_h6gutkf", "creation": 1627216353, "origin": "t5_2tand_t3_or6xjg", "height": 1, "replied_to": "t5_2tand_t3_or6xjg", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DragonBastion", "text": "I'm maybe a step or two ahead of you in learning to manage my anger.  I'll share the skills I've learned researching this topic.\n\n1. Immediate help - deep breaths.  The habit and practice of reacting to emotionally charged situations with deep breaths changes the brain's wiring (I will be grossly simplifying all of this so please feel free to go read more on anything I say) from emotional to logical.\n\n2. No-filter journaling.  NightingaleY mentioned it first but I'll go into it a little bit more.  Processing the emotion and letting it go is a part of getting ahead of it next time.  Where deep breaths is reactionary, the journaling is proactive at stopping it from happening in the future.\n\n3. Mindfulness meditation.  Mindfulness is a meta-cognitive skill that will help stop emotional hijacking before they happen.  It will help rewire the brain just a bit (again, grossly simplifying the process, benefits, and actual mechanics so please don't just listen to a random stranger on the internet and learn more for yourself) so that your reactions to emotional situations will be reduced.  Even if you've had no success previously, please remember that this is a cognitive skill and any skill takes time to get better.  Practice will improve your focus and that focus will in turn help develop a meditation habit.  Again, proactive skill that you need to do outside of the event to keep it from happening.  This might be a more vital part of outgrowing your anger than anyone wants to admit because it sounds like pseudoscience (there is actually a lot of science in this so please learn more.  It is kinda amazing how useful this can be).\n\n4. Perspective change.  This is more a goal than a skill.  You need to change how you see yourself in these situations.  What you perceive as being treated unfairly might not be what someone else perceives.  There's a lot of assholes out there when we think people are malicious and petty, but oftentimes they're just lazy.  Hanlon's Razor - \"never attribute to malice that which is adequately explained by stupidity\".  You cannot change people.  You cannot change what happens to you.  But you can and must change how you react.  You decide your reactions, not other people.  The responsibility of this fact means that you are not the victim in a tragedy but the protagonist in your own hero's journey.  Gain the skills to overcome the obstacle.\n\nThere are more, but this might get you started.  I'd also recommend seeking counseling.  There are also times where the issue lies in neural chemistry, your diet, lifestyle, and relationships.  All of these are possible sources of issues that could be best changed.  A counselor that you click with will help a lot, but ultimately it is up to you.\n\nSources-\n\nhttps://youtu.be/sbVBsrNnBy8\n\nhttps://youtu.be/7CBfCW67xT8\n\nhttps://youtu.be/IeblJdB2-Vo\n\n\"The Emotional Life of Your Brain\" by Richard J Davidson w/ Sharon Begley\n\n\"Emotional Intelligence\" by Daniel Goleman\n\n\"Focus\" by Daniel Goleman\n\n\"The Power of Habit\" by Charles Duhigg\n\nGreat Courses\n\n1. Building Your Resilience\n\n2. Your Best Brain\n\n3. Practicing Mindfulness", "permalink": "/r/DecidingToBeBetter/comments/or6xjg/how_to_stop_being_angry/h6gutkf/"}