{"id": "t5_2tand_t3_pz1fml_t1_hezm387", "creation": 1633104218, "origin": "t5_2tand_t3_pz1fml", "height": 1, "replied_to": "t5_2tand_t3_pz1fml", "down_vote": 0, "up_vote": 4, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "TnekKralc", "text": "I've been a smoker for the last 20 years and daily smoker for the last 13 years. I have certainly had some success over the years quitting for short times but I always fall back into the trap. I've currently been sober for about 5 weeks now and starting to feel confident I can hold. Here is my advice;\n\nBuy a CBD vape pen (not CBD herb). The withdrawal symptoms are real as is the habit of smoking with activities. The pen calms the withdrawals and the lack of high helps slowly lessen your subconscious desire to smoke with your favorite activities.\n\nExercise and start working on focused breathing. Boredom is by far your biggest enemy in quitting. Our brains are so over filled with dopamine you have to actively fight against boredom when you take away one of your biggest sources of dopamine. Exercise is well known for its various benefits, but the biggest one in my opinion is it simply gives you something to do when none of the activities you usually smoke through seem as attractive. The breathing exercises help gets you comfortable and thrive off the boredom. I go back and forth using the Whim Hoff method and resonant breathing, both have free apps that are easy to use. Give it a month of daily use and I promise it will have massive benefits to your daily life. The added benefit especially with WHM is that it gives you a very interesting and different high that's hard to explain but undeniable on your 6th or 7th round.\n\nTell your friends and family you are quitting and ask them not to offer you a hit if they are smoking around you. It's hard enough being around someone smoking is 10x worse if you have to say no. Almost everyone will respect your desire and those who don't should be phased out of your social circle as they don't respect you.\n\n\nNow for the bit that has in the past gotten me banned from r/leaves. I had a pretty significant experience 4 weeks ago that was then followed up by a life threatening experience that reinforced my commitment but isn't easily replicated. I used psychedelic mushrooms for the first time 4 weeks ago (previously had only used psilocybin via LSD). I had a pretty significant trip where the message was that I needed to take care of myself because nobody else will. From the next morning on I have had no withdrawal symptoms and my focus on sobriety has become clearer. I still microdose LSD as my anti depression but all plans of macrodoses have been cancelled for the foreseeable future. Using a drug to quit a drug is not the smartest idea, however telling my story without it would be dishonest due to how impactful it has been for pushing me towards confidence in my sobriety.\n\nSince I quit, my eating is finally back to normal after suffering from a grief inspired eating disorder for the past year. My therapist says I'm looking far more full especially in my face(though I pay her to say that) but now importantly I feel better. I'm reading again, just finished \"Kinship with all life\" and now consider that my favorite nonfiction book of all time, and using books to fight the boredom.\n\n\nPeople will focus on my psilocybin paragraph, but CBD, exercise, and social circle should be your main takeaway. It's not an easy journey, but you can do this. I'll leave you with my favorite Bojack Horseman(obviously) quote \"it gets  easier. Everyday it gets a little easier. But you got to do it every day, that's the hard part, but it does get easier\". So much love for you on this journey, keep strong.", "permalink": "/r/DecidingToBeBetter/comments/pz1fml/im_done_abusing_my_brain_and_lungs_im_quitting/hezm387/"}