{"id": "t5_2tand_t3_p967xa_t1_h9xu83y", "creation": 1629657756, "origin": "t5_2tand_t3_p967xa", "height": 1, "replied_to": "t5_2tand_t3_p967xa", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "wearblc", "text": "I quit FB years ago. Downloaded all of my pictures and deleted my account. \n\nInstagram haven't deleted yet but I've been off of it for a year now. It started by removing the app but I'd still use the browser to view it once in a while, definitely not as slick as the app so I wanted to use it less. Recently I've logged myself out and I haven't been back since.\n\nReddit I was using quite a bit last year but felt like it was a time killer as well and caused stress in it's own way (feeling like I'm not doing enough or good enough compared to what I see on here, like all other social media platforms). So I removed the app for Reddit. I hop on the browser to check it once in a while but the browser experience is not the same as the app so I tend to use it less. I revamped my subreddit subscriptions to be geared towards things I want to learn or find uplifting. Anything I find that starts to get me down I block the subreddit.\n\nI also try to make a conscious effort to put my phone in a place that isn't accessible most of the day but keep the ringer on for calls. On some phones you can customize disabling app notifications during a specific time frame.\n\nIf I do want to be on my phone I make an effort to think of things I *need* to be doing that I can accomplish with my phone (writing emails, looking into a product I'm considering, etc).\n\nI have to say life without social media and reducing my reddit use has been *AMAZING*. We put *so* much pressure on ourselves when we're constantly shown the highlight reels of others lives. I was feeling inadequate and unhappy. That I needed to be doing more with my life - travel more, create more, buy more. NONE OF THAT IS IMPORTANT. Covid has helped me realize that in combination with the social media cleanse. Family, friends, and being present are important. \n\nLife is short. Social media distracts us from that reality and wastes it.", "permalink": "/r/DecidingToBeBetter/comments/p967xa/theres_one_more_vice_to_get_rid_of_reddit/h9xu83y/"}