{"id": "t5_2tand_t3_26fsna_t1_chqtzg6", "creation": 1401041113, "origin": "t5_2tand_t3_26fsna", "height": 1, "replied_to": "t5_2tand_t3_26fsna", "down_vote": 0, "up_vote": 5, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kevinambrosia", "text": "Two things:\n\n1. You can still be funny/witty/charming it will just take a different strategy.\n\n2. This is an opportunity for growth.\n\nNow, you've already established that people are off put when you wrap detrimental statements in a joke. You've also already established that you generally have an air of confidence and a quick wit. Now, you know what people actually like, significantly more than critiques? Compliments. Yes, it's true. So why not try for a complimental strategy to your jokes, you'll still look super confident (only someone who feels secure enough in their own intellect[either secure about the fact that they aren't smart or that they are, either way, it 'a a sign of confidence in the right context] will call someone else smart), people will like you because you'll make then feel good about themself, and you'll start seeing more value in the people around you in the world(one who looks for positives starts finding them everywhere).\n\nThere are a few tricks to this:\n1. Be genuine, there is a fine line between actually complimenting people and veiling an insult by compliment. You might not be able to distinguish between the two so easily because you've been in insult mode so long. Also, you've trained your friends to expect insults from you, so they'll be very untrusting of you. It is always better to err on the side of too genuine than not genuine enough in this situation.\n2. Be unexpected. You can actually use all that criticism you've been practicing to surprise your friends by following it with a genuine compliment. Let's say you make a critical joke about a friend's appearance(how like old you), what if you immediately followed that by a genuine compliment of their looks; the object of your critique could also be an obviously positive aspect of the person. That way, you're meeting their expectations(they will only expect negative jokes from you at this point) while laying ground for your change in humor style.\n3.confront your friends if you value them and let them know about the change. It puts you in a place of vulnerability which builds trust. It also allows them an easier time in recognizing the changed you. Their expectations of your negativity exist, you have to address it somehow, either through actions or words or both.\n\n\nGood luck with this great opportunity you have.", "permalink": "/r/DecidingToBeBetter/comments/26fsna/yesterday_i_received_the_worst_feedback_ive_ever/chqtzg6/"}