{"id": "t5_2tand_t3_26fsna_t1_chqxmv3", "creation": 1401050598, "origin": "t5_2tand_t3_26fsna", "height": 1, "replied_to": "t5_2tand_t3_26fsna", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "nkstr", "text": "I would first like to say that, although it probably doesn't look it now, your friend did you a big favour. She cares about you enough to be honest with you. If she didn't think you were still worth keeping as a friend, she might have just distanced herself from you over time. (I know nothing about your group of friends obviously or the dynamics of the group, so I'm just basing all of this of my own experiences). \n\nI had a somewhat similar experience in high school, but I'm female (doesn't really matter though) and I thought I was funny and quirky but I apparently drove everyone crazy and not many people really wanted me in our group of friends. I realize that at the time, I was super insecure and trying really hard to impress them. We all ended up going to University soon after and I never kept in touch with any of them. BUT I made great new friends after that. So my story is pretty different but I think you've been given a real chance here to reflect on how you react in situations and speak to people honestly about how they feel when you make jokes or whatever. If these people are great friends, it's worth having these conversations and being ok with them calling you out on something you say in the future and you can do your best to try to be more sensitive. \n\nNow, this might be way off base to suggest but maybe they aren't the friends you thought they were. Maybe you would be better off trying to make new friends who understand you a bit more. It's taken me a long time to realize it but I realized that it's ok to not be friends with someone anymore. Like that not everyone you're friends with has to be your friend forever. It sounds silly but maybe you just don't have much in common with these people. Like you became friends because you were in the same class or worked at the same place but now that context is gone and you don't have enough in common with these people to maintain a friendship. Again, this is just based on my experience and I'm not saying to cut all ties but it's a time to maybe think about your friendships and how much they mean to you.  Sorry for the super long post. All the best to you! I wish you luck for your sake (and not just everyone you know) because you deserve great friendships too. ", "permalink": "/r/DecidingToBeBetter/comments/26fsna/yesterday_i_received_the_worst_feedback_ive_ever/chqxmv3/"}