{"id": "t5_2tand_t3_26fsna_t1_chqzbta", "creation": 1401054946, "origin": "t5_2tand_t3_26fsna", "height": 1, "replied_to": "t5_2tand_t3_26fsna", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DouglassFunny", "text": "I think we've all had some bad phases sometime in our life. The great thing about your situation is that you had a friend tell you what you're doing wrong. While it was probably the worst thing to hear from somebody you consider a friend, at least she told you. You don't sound like a bad guy to me, and you sound remorseful.\n\nI don't know exactly how you acted around your friends, but I have the feeling your sense of humor heavily relied on somebody else being the butt of your jokes. In the past i've been in friend groups where we would constantly rip on each other kind of like the guys from \"The League\", or \"It's Always Sunny\". Well I lost a few years of socializing with friends due to a long illness, I became somewhat of a recluse as well. I was stuck in my own personal hell. I spent a good amount of time reflecting on who I was in the past, my actions, and who I wanted to be in the future. Well my health eventually returned, and I became a different man. I stopped hanging around people who didn't lift each other up(for the most part), and changed my focus from being the funny, popular guy, to the guy with a smile on his face, and something nice to say. I used to be a big time talker, but now I try to be more of a listener.\n\nLong story short, I used to be a jerk. Plain and simple. I went through a change after some self reflection, and was surprised when people started calling me a \"nice guy\" on a regular basis. \n\nOP, don't beat yourself up, it sounds like you haven't done too much damage. Just focus on being a better friend, and being nice to people. Get the urge to call someone out? Just get used to keeping your mouth shut when you don't have anything nice to say. I still playfully tease my friends, but it's important that teasing never becomes the basis of your friendship, and it's important to understand the barrier between playfully teasing, and hurtful personal attacks. ", "permalink": "/r/DecidingToBeBetter/comments/26fsna/yesterday_i_received_the_worst_feedback_ive_ever/chqzbta/"}