{"id": "t5_2tand_t3_26fsna_t1_chqti1c", "creation": 1401039830, "origin": "t5_2tand_t3_26fsna", "height": 1, "replied_to": "t5_2tand_t3_26fsna", "down_vote": 0, "up_vote": 16, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "headlesscatlady", "text": "I'd like to offer you an exercise of sorts to try out. I don't think your primary objective should be concentrated on holding back your thoughts, but rather \"dialing into\" the people around you in social situations. When you're in a group, focus on really listening, observing, and reading the people around you. Not just the person talking and listening to what they're saying, but how it's being received as well. Then when you feel compelled to provide your own input, consider all of this information you've been processing and respond accordingly. Either phrase it in a manner more conducive to the conversation or decide not to provide that input if it bears the antagonizing nature of your past comments. Your primary objective should be to make those around you feel comfortable. That being said, the root of your problem seems to be that you struggle with empathy (of course this is just based purely on the information you've provided here). So you should step out of focusing your thoughts on how you are funny, sociable, witty, etc. and focus on how each of the individuals around you feels. \n\nThis advice is all very easy give, but much harder to practice, as it involves a shift in your mental focus from being inward driven to outward. It takes time and practice. Another good exercise to train your focus would be to really observe people whenever you're out for whatever reason. Really try to observe strangers and read their attitudes. See if you can deduce what they may be feeling and ask yourself, why. You won't be able to find the answer of course, but again, the idea is to train your thought process. \n\nAs a teenager, I was probably similar to you, definitely unaware of the types of reactions my comments and jokes were getting, but as I matured and personal betterment became an imperative aspect of daily life, this is one thing that I learned how to do. From my experience, I can say it's definitely well worth it, because with practice and conscious effort, you can get to a point where you literally see a person's anxiety towards you dissipate very quickly and it feels really good to know that you caused that (I have resting bitch face, so people I don't regularly associate with generally tend to look nervous when first talking to me, so this was practically a necessity if I wanted to grow my social circles).", "permalink": "/r/DecidingToBeBetter/comments/26fsna/yesterday_i_received_the_worst_feedback_ive_ever/chqti1c/"}