{"id": "t5_2tand_t3_kg2ygf_t1_ggccuyi", "creation": 1608365761, "origin": "t5_2tand_t3_kg2ygf", "height": 1, "replied_to": "t5_2tand_t3_kg2ygf", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "zhentarim_agent", "text": "Social media is only people showing themselves at their best in the large majority of cases. It's very hard to share how you're suffering on social media because we're trained to post for engagement.   \n\nIf social media is what's hurting you I highly recommend deleting apps and using some sort of website blocking extension so keep yourself off these sites for a few weeks. It's hard at first, but a social media cleanse feels great after a while.   \n\nI think you could greatly benefit from getting back to the basics of other things you enjoyed before the depression and suicide and see if you feel any spark, even if momentary, while doing those things. But do it for you, and not for social media.   \n\nYou can also start to think more about the things that cause unhappiness in your life. If it's your partner like you mention might be the case in your main post, then what can you change there? Doesn't have to be immediate, but can you take baby steps to change that?   \n\nAnd lastly...please see a therapist for your depression if you're able to and have the insurance to get help. All my suggestions are just starting points, but ultimately therapy and medication is what's going to do the heavy lifting here.   \n\nUltimately you'll have to just take things day by day. Don't worry about the far off future - too much uncertainty. Focus on the present. The now. The today. Just focus on getting through each individual day because I'm sure they already feel like huge hurdles.    \n\nThis is all pretty general because there's no one size fits all, but just know that I'm rooting for you to get through this and find your happiness again. ♥️", "permalink": "/r/DecidingToBeBetter/comments/kg2ygf/failed_suicide_attempt_dont_know_where_to_go_from/ggccuyi/"}