{"id": "t5_2tand_t3_kg2ygf_t1_ggchcpj", "creation": 1608370526, "origin": "t5_2tand_t3_kg2ygf", "height": 1, "replied_to": "t5_2tand_t3_kg2ygf", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "wasporchidlouixse", "text": "1. This is not a failure. It's a second chance. If you had died you would not have the opportunity to rebuild your life and try different solutions to your problems. \n\n2. What is the biggest hurdle you wish you could fix in your life? Why didn't you think you could fix it? Was that a fact or a belief? Things that look impossible from our current perspective are hard and scary because you don't know if you can do it. You're not on the other side of the hill yet. But no matter how long it takes, or how much help you will need to ask for to get through it, I promise it is possible. Even if you only improve it by 10%, life will improve overall. \n\n3. Reach out for help. Keep reaching out for help. And don't stop until you get it. You deserve to be supported, loved, helped and encouraged to thrive in this life. If the people in your life are only bringing you down, you need to find new people. Good people are out there, and if you are good to them they will be good to you. \n\n4. I hope you keep trying. I believe the meaning of life is twofold: trying towards a goal, any goal at all; and making connections with other people. An awesome goal for 2021 would be to make two friends, real friends, who you know you can count on. And when one is busy, the other can be there for you. If you had a friend to call and talk to about how you were feeling, and let all the hurt out, would things have gone differently? \n\n5. Sending you love! I'm religious so I would obviously recommend religion as a salve but I know it doesn't work for everyone. Wishing you well. Christmas is a hard time financially but also emotionally for people who don't have good networks in their life. Maybe you could try going to local charities like soup kitchens and churches and non-religious charities like Red Cross that may do community meals on Christmas day. That could be a great place to make some new friends and expand your circle of support.", "permalink": "/r/DecidingToBeBetter/comments/kg2ygf/failed_suicide_attempt_dont_know_where_to_go_from/ggchcpj/"}