{"id": "t5_2tand_t3_kg2ygf_t1_ggci4nq", "creation": 1608371392, "origin": "t5_2tand_t3_kg2ygf", "height": 1, "replied_to": "t5_2tand_t3_kg2ygf", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Via4", "text": "I’m so happy that you are still here. You are important, kind compassionate person and you are loved.\nThe world would not be the same if you were not in it.\nDelete social media. It’s a lie. It’s not making you feel good. \nWatch it’s a wonderful life. Today please especially if you have never seen it.\nToday’s society puts seriously unrealistic expectations on people.\nWe can choose to fall for this and run around believing that if we work ourselves to death we will be successful, then happy.\nIf we cover ourselves in surgery, makeup, expensive clothes then we will be happy..\nThen why do all these Hollywood types kill themselves??? Because of the serious pressure they are under to hold onto their success.\nBut none of it is real. It’s the stories we tell ourselves. Please if you can look at Jordan Peterson’s talks on YouTube he articulates this very well.\nWe are only on this earth for a very short time. We can choose how we spend that time. \nAs hard as it is sometimes we have to keep reminding ourselves that it’s in our control how we choose to spend it.\nI like reading, going for walks it feeds my soul. \nWe also have to be kinder to ourselves and stop putting so much pressure.\nCovid is coming to an end now don’t let something as temporary as covid make you give up. Don’t watch the news. Simply just be. Do the things that you like to do. What are those? \nToday especially your feeling feelings of guilt and embarrassment. Take the failed attempt as a sign you still have so much living to do!!! When I get down and want to just give up I visualize myself as an old woman in a care home. All I have let is my memories. Imagine if all you had to look back on was all you did was feel sorry for yourself and not lived life. Or you look back and thing of all the places you seen, people you met and the adventures!! You will never remember what some eejit had on their social media. Because it won’t be relevant. \nThis is your life. You were put on this earth for a reason. Go and find that reason!! It takes strength and courage. You have these in your possession. You have to sometimes dig very very deep.\nI for one believe in you. You hit rock bottom. Now it’s time to build the pieces. Please check back in and let us know how you are xxx", "permalink": "/r/DecidingToBeBetter/comments/kg2ygf/failed_suicide_attempt_dont_know_where_to_go_from/ggci4nq/"}