{"id": "t5_2tand_t3_m3k4we_t1_gqpibq4", "creation": 1615568681, "origin": "t5_2tand_t3_m3k4we", "height": 1, "replied_to": "t5_2tand_t3_m3k4we", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "AfterEcho2021", "text": "Well you at least furthered your understanding. \n\nWe have to understand how something start and follow how it evolves to get a concept into why people  consciously or subconsiously use it culturally  despite the Webster \"literal\" definition. You are right about the definition leaving behind it's origin or purely meaning, \"Ignorant\". Nice clearly has multiple meanings from a diction standpoint and a cultural standpoint too.\n\nIt sounds like you're a nice person, but oblivious to the negative cultural context in which I am stating the usage of the word. It does have a negative connotation to it whither you realize it or not. A simple google search will inform you more on it. I'm not here prove myself right or be proven wrong.\n\nI don't care if you reject my idea to hold on tightly to yours or maybe how you might self identify as a nice person.\n\nIt seems I've challenged something that makes you uncomfortable. This is for you to figure out why you are uncomfortable and what that means to you.\n\nIf you reject my idea, good, live your life in peace and move on. If you can't find peace on why it upsets you, then take time to reflect, understand, and learn from your inward self. Either way, it has no bearing or influence on me.\n\nThe two are not situational, but are more about intentions behind the actions of those who deliver it. its more self-reflective. two men might do the same good action, but one is kind because he does it with better intentions. The other does for the acceptance of others or an alternative motive that isn't stated, but can be felt.\n\nFor better understanding: When a woman talks endearing of a man they are fond of and respect, they say: \"he's so kind\". When a woman talks about a guy they don't want to be mean to or don't fully feel they are being genuine, they say: \" Oh he's just nice\". the first guy is pursued, the second guy is left wondering why he's not pursued despite his good actions.\n\nCrystalize it or not, that's on you. My understanding is based on my observations and my life experiences. my realization has helped me in all facets of life.", "permalink": "/r/DecidingToBeBetter/comments/m3k4we/decide_to_be_kind_and_not_nice_because_there_is_a/gqpibq4/"}