{"id": "t5_2tand_t3_7phmt7_t1_dsi3azn", "creation": 1515640660, "origin": "t5_2tand_t3_7phmt7", "height": 1, "replied_to": "t5_2tand_t3_7phmt7", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "paanicc", "text": "When you think of a professional you think about someone who has achieved something in his life. Someone who hast struggled and hustled a lot and still does but now on a higher - more professional - level. So to get to where he is you’d have to understand what he went trough: he didn’t just stood up from the couch and decided “imma be professional now!” He actually worked hard. Try identifying with that: you’d have a lot of tenacity, the will to pull trough. Also you’d have taken a lot of responsibilities in your life to that point so you also are learned to be reliable. You’ve surely made mistakes but you learned that you can’t give in or hide mistakes you have to stand up for what you did and deal with it. You’d have eaten dirt on your way so you’d appreciate every bit of easy work that comes your way. Also you’d be confident - because you’ve experienced a lot you’ve done a lot you didn’t just quiet when things got rough. And you’ve been in this business for a while so you also know what this is all about a professional knows what he’s talking about. Also you learned to handle people - oh handling people - smiling when you’d like to cry hand shaking when you’d like to brake their hand but all for the sake of connections. You’ve learned that weakness is something for at home cuz at work wen your at what your doing you can’t show that you have weak points. Cuz than people won’t respect ya nor will they trust you. ... \nIt’s hard to acquire that mind set just by thinking about it but knowing where your heading might speed up the process of getting there.\n  ", "permalink": "/r/DecidingToBeBetter/comments/7phmt7/hi_reddit_what_do_you_think_is_the_secret_to_a/dsi3azn/"}