{"id": "t5_2tand_t3_ki3oes_t1_ggpuzw8", "creation": 1608663780, "origin": "t5_2tand_t3_ki3oes", "height": 1, "replied_to": "t5_2tand_t3_ki3oes", "down_vote": 0, "up_vote": 0, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "packsonJollock89", "text": "I'm trying to tackle my own biases! That's why I'm here! Thank you for what you said though, it makes sense. I'm just having a really hard time removing emotion from it, and seeing things logically. \n\nIt's so hard to not be hateful. The girl I mentioned, who has pretty much slept with half the dorm, hangs out with me a lot. I mean everyday almost. But a part of me (a huuuuuuge part of me) wants to just say fuck it, I don't want to be another guy in your list that you can call when you're bored and need attention. 'Cause I know if I'm not available, she'll obviously message someone else. Heck, maybe she messages me because someone else wasn't available. And this kind of thinking just drags me into a spiral of self doubt and hate and I don't know how to not care. The only way I've learned to deal with it is to cut ties with people. Because my ego tells me I should. \n\nSex isn't always there though, is it. It's there in spades for girls, who want it. Some girls I know do not just want a lot of sex with a lot of people. Some want long term relationships. But the ones that do want it, can get it, whenever. I cannot. She (that friend), would have to put in zero effort, on a day she's feeling particularly sexually frustrated. Pick from list of existing guys she's slept with, or go on bumble, meet new person, frustration gone. I can't do that. That imbalance causes so much anger, that I pretty much just isolate myself, because I would have to put in so much more effort and even then will most likely not get what I want, while she would have to put in nothing. \n\nI don't know how to be okay with this. Because that's all there is to do right, be okay with it.", "permalink": "/r/DecidingToBeBetter/comments/ki3oes/help_me_stop_being_an_incel_please/ggpuzw8/"}