{"id": "t5_2tand_t3_ki3oes_t1_ggoq3pj", "creation": 1608640568, "origin": "t5_2tand_t3_ki3oes", "height": 1, "replied_to": "t5_2tand_t3_ki3oes", "down_vote": 0, "up_vote": 14, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "Administrative-Task9", "text": "“For the girls, it’s a totally different experience...” yes, it is. Let’s talk about the typical online dating experience for a girl, shall we? \n\nYou scroll through, hoping to meet someone nice. You start chatting to quite a few guys because at least half of them will turn creepy immediately, asking for nudes, calling you a bitch when you don’t, and some will even threaten you. They’ll call you a fat ugly whore and tell you that you deserve to be raped. That’s pretty much par for the course. \n\nYou have to make sure your social media accounts are well locked down because you know a handful of these guys will look you up and send you threatening messages when you refuse their advances. You’ve made the mistake of using the same photo on your dating profile as LinkedIn in the past, and that one guy showed up at your office and nearly got you fired. \n\nOf the few guys who seem genuinely nice, you decide to meet some in person. (You need to tell a friend where you’re going and to check in with them regularly.) Of the few guys you go out with, a few will turn out to be horrible in person - and even with the ones that don’t, you need to watch your drink at all times. \n\nIf you really like a guy and end up sleeping with him there’s a good chance that once you do, you’ll never hear from him again. \n\nThere’s also a few cool guys you get along with, but you don’t “click” on both sides with every one of them, so it’s nobody’s fault - but a lot of the time there’s just no real spark (either for him, or for you) so you part amicably. \n\nAfter a few months you might be lucky enough to finally meet someone who is genuinely nice and compatible and you’re attracted to each other, and you start a relationship. But it wasn’t easy and the whole process was at great personal risk, and very taxing. \n\nSo you’re right: it is a VERY different experience for us, one you should not envy. \n\nAnd as previously mentioned: you really need to see a professional.", "permalink": "/r/DecidingToBeBetter/comments/ki3oes/help_me_stop_being_an_incel_please/ggoq3pj/"}