{"id": "t5_2tand_t3_pga1jv_t1_hbfyp0h", "creation": 1630675040, "origin": "t5_2tand_t3_pga1jv", "height": 1, "replied_to": "t5_2tand_t3_pga1jv", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "ManicPixieDreamSloot", "text": "So I relate to this SO hard. I felt the same way when I graduated college. \n\nSo, almost six years later here are my suggestions/insights:\n\n*Working remotely, having no friends, having no hobbies*\n\nI feel this, because I also work remotely and feel like I have no friends sometimes. So I started helping people on reddit, in posts like this, just to get back in the habit of conversing with people. Then I started reaching out to people locally on facebook groups. My trick is to try to solve people's (small) problems by offering insight or technical advice or perspective. Most everyone is hella appreciative. It feels good, it's productive, it's relaxing, and people are truly grateful. Try it!\n\nResearch is my hobby, btw. And i love it. I'm also a vigilante proofreader, i frequent r/suicidewatch and talk people away from the proverbial ledge, and i write product reviews for apps.\n\n\n*jumping around Europe*\n\nWe're still in the thick of a pandemic. Would not recommend.\n\n*Living in the moment / Planning & goals*\n\nPor que no los dos?\n\nDefinitely do both. Have long term objectives,  goals to generally walk toward to keep you focused. Dont stress about it, but think about if you're gonna want an advanced degree or not*, or if you're someone who wants to rent an apartment and if you have a decent credit score (avoid payday loans!), or where your industry is booming or coming up that you might wanna capitalize on.\n\nThat said, you need life experience to set many worthwhile goals. So definitely make low-risk choices and experiment with new stuff (not drugs lol). But new hobbies, classes, ways of expressing yourself. \n\nGet political,  go vegan, shave your head. Whatever. Be a little gay! Adopt a cat! Volunteer! \nWork for a nonprofit that wont pay you enough but will feel rewarding! All things I've done (except i am very gay lol).\n\n\n*best way to tell is to look up job descriptions for jobs you'd like to someday have and see what they require. I write resumes professionally,  this is solid advice lol\n\n\n\n*Leaving Home*\n\nYes, do it. Come to Louisville! It's great for people your age and in your field. You'll love it. Definitely leave home though. Spread your wings. Grow a bit.\n\nGood luck!", "permalink": "/r/DecidingToBeBetter/comments/pga1jv/my_life_feels_directionless_and_i_dont_know_what/hbfyp0h/"}