{"id": "t5_2tand_t3_ltc1d0_t1_goyoove", "creation": 1614415514, "origin": "t5_2tand_t3_ltc1d0", "height": 1, "replied_to": "t5_2tand_t3_ltc1d0", "down_vote": 0, "up_vote": 8, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "chickentenders222", "text": "But yet you gave advice on a dynamic in which drug use was an integral part of and used \"but I have a background in psychology\" as a pseudo credential; and now you are admitting the psychology you learned had nothing to do with drugs, but you still insisted on giving advice and then deceptively trying to somehow validate it with a \"Psychology Background\". I took dual enrollment AP College Board AP Psychology for 16 credits in 10th grade, and I learned about drugs without it being devoted to a specific branch of psychology like Biopsychology or Clinical Psychology. In just about every single branch of psychology, drugs including their pharmacology, (pharmacokinetics and pharmacodynamic), interactions with psychiatric conditions, etc. \n\nThe point being, you spoken on a situation in which you admitted later to having very little knowledge in an area of knowledge the played a vital role in the dynamic, you then made references to that pool of knowledge \"Meth refrence\", as you belittled the importance of drugs being a massive factor, by dismissing that drugs mattered as portraying it as not being \"an excuse\", which you should probably know what you're talking about to make that judgment, also noted your awareness of Kratom and it's \"Nasty aspects\", (so you are informed on drugs? Or not), to which you continued to ignore the role the Kratom's 2 opioids, Mitragynine and 7-hydroxy-Mitragynine and their many metabolites played. As well as ignored the other important factor of possible mania. I supposed emotions or altered states of mind we're also not discussed in your 2 years of Psychology. You then later attempted to use your \"Psychology background\" as some way to validate your statements on which the majority of primary factors in the given dynamic, you later admit to have little knowledge about, and the psychology background didn't include the most important factors. (Did you learn about ADHD or no because it wasn't \"Neurodevelopmental Psychology\"?)\n\nThen you made projections of the inner workings of their relationship dynamic, because while potentially  in a manic state of mind from drugs, that must 100% reflect his respect for her year round, 👏 nice Psychoanalysis Freud. \n\nI never claimed to be very learned, but you did. I'm very well aware there's multiple branches of psychology. \n\nLike wise I'm also aware that if you had gotten in a helicopter with a pilot, who knows how to fly. You wouldn't expect him to say he's never flown a helicopter before after you take off. Then when you're violently flying recklessly, you express your disbelief to the pilot of his ignorance in the skill of flying a helicopter. And then he turns around and goes, \"Well for someone on such a high horse I'm shocked you didn't know there's multiple ways to fly. Like hang gliders and planes.\" \n\nYou wouldn't expect it, because he gave his credentials of being a pilot, and you would assume that if he has credentials in flying, and is about to fly a helicopter, that his creditals he gave, would have to do with flying a helicopter and not an airplane. \n\nLikewise, you wouldn't expect someone to comment on a matter in which they make multiple drug references and drug use is one of the most important factors in the dynamic, and they attempt to self-validate their statements with a \"Psychology background\", in which drugs play an imperative role just about ubiquitously in all disciplines of Psychology, as well as neurodevelopmental conditions such as ADHD being the most common and well researched neurodevelopmental condition to date, as well as emotions and altered states of mind, all of which are basic fundamentals of psychology. And then admit they know fuck all about the primary factors in the dynamic, and their self validated accolades to back their statements actually have fuck all to do with their statements, as they have fuck all to do with the most important factors of the dynamic in which their statements are referencing. \n\nYou also decided to insult the person, to make yourself feel better? Despite the fact, that your claims mostly ignored the imperative factors. Yet you still pass judgment like you're in a place to do so, \"Psychology Background\". Lmfao", "permalink": "/r/DecidingToBeBetter/comments/ltc1d0/my_long_term_boyfriend_told_me_two_months_ago/goyoove/"}