{"id": "t5_2tand_t3_n8cdlg_t1_gxihc1l", "creation": 1620578889, "origin": "t5_2tand_t3_n8cdlg", "height": 1, "replied_to": "t5_2tand_t3_n8cdlg", "down_vote": 0, "up_vote": 2, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "kronkknowsbest", "text": "Wow. Truly incredible to read. Although I know that’s not what you were looking for I have immense admiration for you in both your insight and willingness to see these things in yourself and in your desire to open up about them. \nI have three children and my oldest beats up on herself about how hard she feels she’s been on her two younger siblings, mainly her sister. Granted, it doesn’t stop her from continuing to show up that way again and again.. and again and again.. :) but she feels deep remorse for her harshness towards them. I try to help her find forgiveness for herself, and acceptance. For one thing, with birth order comes natural roles we step into (in general and based on circumstance). For another, we are often hardest on the ones we are closest to - I think this is because we have trust in the relationship.. trust that it can withstand the conflict, the criticism, the battles, the jokes. We can test out our individualism and in that, our vulnerability, with those in our safety net. This is not to say she or you are wrong to “keep yourself in check,” but that maybe there could be a different way to look at the behavior. \nI know it seems odd but sometimes when my son gets a little bit snotty towards my husband I feel a little jealous. My son would NEVER treat me that way, he’s too afraid of me. But with his dad, it is safe and unconditional. He trusts the relationship can handle it. At least that’s how I see it. It certainly helps me view things with more understanding and compassion when dealing with anyone I feel is acting irrationally or even “mean.” \nSorry for the long-winded response. Loved your post!", "permalink": "/r/DecidingToBeBetter/comments/n8cdlg/it_took_watching_old_home_videos_to_realize_just/gxihc1l/"}