{"id": "t5_2tand_t3_3ecbgw_t1_ctdpakq", "creation": 1437679411, "origin": "t5_2tand_t3_3ecbgw", "height": 1, "replied_to": "t5_2tand_t3_3ecbgw", "down_vote": 0, "up_vote": 30, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "DizzySaltPeanuts", "text": "Prince of procrastination here: I noticed we both have a lot of the same internal dialogue. I have been using this summer to retool the way I think and perceive myself. So I thought I'd share. \n\n1.   *\" I've already wasted so many years not learning, that people my age would be [a] ____ wizard\"* . This is something you need to erase from your internal dialogue. I too look back at the past too often, regretting what I haven't done and fantasizing about what I could have accomplished by now. This is a demotivating attitude. Try to gear your thoughts towards the future. Those thoughts waste space. Accept what has/hasn't happened and keep thinking about what you are going to do next.  Start thinking of your mind and your thoughts as finite resources. Realize that when you fixate on regrets or escape via nostalgia, you waste valuable computational resources. Start focusing on what you can do next, what you want to accomplish next week, next month, or even next year. Fixate on what's next and how you're going to get there. Think of little things too, what section of a tutorial could you cover next, or what exercise will you try tomorrow. This is what I think people mean when they say to visualize your success. Make your goals concrete too. This makes them seem more doable. \n\n2. *\"I think I use ____ as a way to escape, so I don't have to focus on reality\"* Yes that is exactly what is happening. You and I share the same habit: escapism. If we're not thinking about it, it doesn't bother us, which explains this: *\"It seems, over the years, I've just been suppressing any emotion I have, so I can stay on a comfortable neutral level.\"* You are fundamentally dissatisfied with this behavior but you don't ***feel*** dissatisfied. My friends in school were always high achievers. I used to take refuge in being a stress free person as a way to comfort myself about not working as hard as I could. Well the truth is that a little stress, a pinch of anxiety, or just a hint of worry is what kept them going. I told myself, \"this is good enough\", or \"at least I tried\", or worst of all \"well if this above-mediocre result is how much I get for this little bit of effort, imagine what I could have achieved if I tried a harder. Oh well, I'll try next time, and it won't be so hard because I'm smart\". Let yourself feel it. But don't get down on yourself. This is an odd balance you have to strike. \n\n3.  *\" I get a weekend, and leading up to the weekend, I'd tell myself, oh I'd totally go swimming, I'll do some coding, I'll clean up my place, I'll make food, gym, etc. Two days later, I've done nothing but sleep and game.\"* Another commonality, we both make laundry lists. You are setting all the right goals, yet you pile it on waaaay too thick. Set smaller goals. Go to the gym once a week, and do that consistently for 4 weeks. Then go twice a week. As for coding, that shit takes time. Another bias I used to have was underestimation. Never just assume you can just do it. I'm sure you are capable of acquiring the skills necessary, but don't let your intelligence shackle your need for drive. Coding is hard. There will be days where you spend time just getting used to your IDE, not writing a single line of code. When I realized how big tasks can be, I stopped underestimating them. I stopped piling on goals and deadlines so heavily. I feel like you could benefit from this. \n\n\nThese all fundamentally come down to one mantra: your mental state, manifests externally. Your mind ***IS*** a limited resource and what attitude you adopt, the thoughts you fixate on, or even the feelings you indulge in can heavily affect your productivity, your consistency, and most importantly, your overall health. I would suggest practicing mindfulness. I am a poor meditator, so I follow some guided meditation podcasts and use a guided meditation app. Here's a tidbit from these guided meditations I feel like you'd  appreciate: Thoughts, and emotions often spontaneously manifest within our minds, but they are passing, like clouds. The next time you see yourself getting down on yourself try to think of that negative thought or emotion as a passing cloud. You do not get angry at the sky for the clouds it hosts. Above those clouds is a clear sky - your center. We choose to entertain and latch on to such feelings/thoughts. We can also choose to let them go.\n\nLast piece of advice: when trying to code or get some other focus-intensive work done I find that the first thing I do really sets the mood and productivity for my whole session. So, I try to make sure that I at least look at my main task for a little bit before I do anything else. That way it is at the forefront of my mind. Also, remember to take breaks! I personally love the Pomodoro system. 25 minutes on, 5 off. Pacing is really important. \n\n I hope this helps. These all take time, and I am still struggling to implement these in my day to day, but I believe in you! Start today, start small, and stay positive!\n\nEDIT: sentence clarity ", "permalink": "/r/DecidingToBeBetter/comments/3ecbgw/how_do_i_get_out_of_this/ctdpakq/"}