{"id": "t5_2tand_t3_3ecbgw_t1_ctetrgv", "creation": 1437760893, "origin": "t5_2tand_t3_3ecbgw", "height": 1, "replied_to": "t5_2tand_t3_3ecbgw", "down_vote": 0, "up_vote": 1, "social_network": "reddit", "replies_charged": false, "no_replies": false, "user": "reeblebeeble", "text": "The short answer is diet and exercise. But everyone has heard this a billion times so I'll break it down a bit and describe how it's gone for me. \n\nI always had an attitude that I was raised healthy and I knew what healthy was and I was already healthier than many people so therefore it was silly to think that my problems were \"caused\" by diet. This was sort of backwards thinking as it wasn't so much that diet caused the problem, but that diet was the simplest instrument for healing I had at my disposal. It's not about comparing yourself to the rest of the population - that is distressing and usually unhelpful - if something has come out of balance in your life, you need to focus on what YOU need to address that. The changes I made were not radical. I simply increased fruits and vegetables, decreased refined oils, meat and dairy, and cooked at home more. I focused on increasing good things, not eliminating bad things. I allowed myself to have whatever I wanted, if I still wanted it after eating my fruits and salad and so on. I tried going vegetarian for a month and though I couldn't stick to it 100%, I felt great afterwards. That was a big step in changing my understanding of how I needed to eat. So for me it's about general principles, not strict rules. \"Eat food, not too much, mostly plants\". But I don't place any actual strict restrictions on myself because I don't think that's a healthy mindset either. That's important, too - because doing this is not a punishment - and once you start to feel the rewards of eating really well, like really feel them in your body, it just makes sense - that's all you want to do. \n\nLike I said, I already thought of myself as a pretty healthy person before so it was only through consciously eating as many vegetables as I could that I started to really understand, like feel in my body, the the power of small adjustments. I also realised that food was a major source of pleasure for me, and that that was how I kept bad stuff in my diet, because it was something I felt like I needed to get pleasure. Changing my diet broke that association between bad food and pleasure. To be clear, I do get pleasure from the healthy food I eat, but it's not a form of escapism, it's a source of energy. If I eat a bag of potato chips, I feel depressed. That's a straightforward cause-effect link in my mind now. Not because of guilt, but because it makes my body feel shit. \n\nDoesn't mean what worked for me will work for everyone, but you can't go wrong by upping your fruits and vegetables. And a certain portion of raw food each day (fruit, salad veg). \n\nAnyway, I feel like that was the game changer for me. Such a simple thing that took me so long to actually implement. With exercise, I've been trying for years to do it consistently, but I've been really sporadic about it. I have more energy now and I have more positive feelings in my mind about doing it, so it's easier to make it happen. For me, it's stuff I enjoy, which makes it easier. \n\nAnother general principle: simplify everything. Don't write out big plans of exercise regimes and diet plans and schedules and stuff. I still do that sometimes, but I know it's just my brain being insecure and trying to reassure itself that everything will be all right in the future. Make it easy. If you can't do your exercise today, maybe you can just go for a 10 minute walk. That's a difference that makes a difference. If you can't make a fancy meal, you can simply roast a big pile of veggies in the oven with a bit of oil and seasoning. Nothing could be easier. \n\nThis is my best advice: It all counts. Small differences make a difference. Give yourself credit for everything, be 100% kind to yourself, because getting better is not a punishment. Do not give up. It's not the plan, it's what you actually do that counts. So if you can just take a small step, do that. \n\nWork on one major thing at a time. Say you want to overhaul your diet, exercise and sleep habits - sure, attempt to do all three at once, but you'll probably fail at two, so don't worry about that, focus on one and just do the others when you can. For me, for some reason, focusing on diet first has made the others easier. Diet and exercise are feeling solid so I'm moving on to trying to implement a daily meditation practice, and I'm hoping that will improve my sleep as well. These are all things I've been trying to implement consistently for YEARS. \n\nThis was a long ramble, hope you found something helpful in there. ", "permalink": "/r/DecidingToBeBetter/comments/3ecbgw/how_do_i_get_out_of_this/ctetrgv/"}