{"id": "t5_2tand_t3_n6uvia", "request": ["e234981c-b061-4d83-8134-70d441847f74", "9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "(This is not a confession, nor mine. I am simply curious what people think about someone who would right this.)\n\nI spent years of my life, my primary, my secondary; dreaming and conceptually asking for a lie. The few things that gave me happiness were nothing more than little packages that promised on their surface to give me that which I had not had for most of my life as a student. As soon as I opened these packages I realized all the disgusting things they had inside, it was not only the same indifference, ignorance and impurity that I had tried to disregard throughout my life, but also, it was the celebration and appreciation of all these things I had hated. The worst of the case is that I had asked for that miserable package and I do not know if it was out of fear or the lack of interest with which I had become used to living my days that I did not open the door to receive it until what it contained was irretrievably expired. I wonder if in the future it will be for me, as for so many people that once time passes and the contents of the package are fermented in a substance that causes them the same illusion of happiness that my dreams of the future caused me, that I will finally appreciate the false happiness brought by the pleasant lie that temporarily fills that very hole in which we will end up. The same hole that has been my home for a long time, where I have found some tranquility and calm, this hole has the name of loneliness. It is easier to hide in the darkness of this hole where my dreams and fantasies are perfect than to go outside where imperfections are so revered. Once in a while like a diver whose oxygen tank runs out, I would go outside to breathe, but when I did I was naturally so disappointed that I dug that hole more and more. I isolated myself to such an extent that those who originally saw me dig my hole with indifference, now whispered to each other and began to mock that lonely miserable digging his hole. It is incredible the fear that causes me to get out of that hole to meet the expectations of those who laugh, even though I don't like to think about it, I wonder: if I continue digging this hole will it be my grave?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n6uvia/the_package_and_the_hole/", "title": "The package and the hole", "social_network": "reddit", "user": "EquivalentWest5678", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1620381210, "permalink": "/r/DecidingToBeBetter/comments/n6uvia/the_package_and_the_hole/", "nsfw": false, "first_save": 1635437541.9164848, "replies_charged": false}