{"id": "t5_2tand_t3_gi6oad", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Sorry, English is not my first language.\n\nIf you search my profile you would find comments and posts about my drinking and about my mental health. I had the fortune of being one of the last people late redditor u/Alexander_q commented to,he saved my life and I cannot thank this community enough, every single week I recieve a PM asking how I'm doing.\n\n I was on an abusive relationship that ended early last year.\n\nThen, November came and I met her, we both come from shitty relationships and cheating, we care so deeply about each other, she is the woman I want to marry, but I want to change for myself.\n\n To make this story short, I have been drinking almost everyday and my GF knows and she's been so understanding, but since last monday, I have reduced my drinking everyday, today I have my last shot in front of me, I have a cup of tea right beside it and it is what I'm gonna be drinking from now on.\n\nI would like to ask you to help me keep my goal of not drinking again this year and maybe if I see fit, ever again. I want my mind as clear as it is from mornings through evenings, I want to be me. If someone would like to throw me a PM everyday for the next month, I'd love it.\n\nAs of cigarettes, I'm done, I know suffering two whitdrawals at the same time might be difficult but I want to do this for me. For the man that I want to be when I ask my GF to marry me.\n\nAlso, I am starting a new teaching job on the 22nd after 4 months of no job, so I have that going for me which is nice.\n\nI Think I'm making no sense or not as I would like to, but, TL;DR: I'm not drinking anymore and not smoking later.\n\nEdit: I’ll try to make an update on this same post later this night when I’m feeling less emotional.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gi6oad/i_found_the_one_i_know_i_have_to_be_a_better/", "title": "I found the one, I know I have to be a better person for myself and for her. As of today, I am drinking my last drop of alcohol in a while (Maybe forever) and as of friday, my last cig", "social_network": "reddit", "user": "RafaStart", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 178, "down_vote": 0, "creation": 1589269588, "permalink": "/r/DecidingToBeBetter/comments/gi6oad/i_found_the_one_i_know_i_have_to_be_a_better/", "nsfw": false, "first_save": 1635436627.060093, "replies_charged": false}