{"id": "t5_2tand_t3_mo3nlj", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Why do you care about everyone else’s feelings more than your own? Why do you always put yourself last? You do so much for others, you are terrified of upsetting anyone, and none of them even know you are suffering. When was the last time you asked someone for anything?\n\nI’m not saying it’s a bad thing to help others. I’m not saying it’s wrong to be selfless. But when will there be more in your life than saving other people? When will you decide that saying no to someone is easier than working yourself to death? \n\nDon’t tell me that you know how to tell people “no.”  I think we both know you haven’t done that in a long time. In fact, I bet you only do it when your plate is so overwhelmingly full that you have no choice. You only say no when you are stretched to your limits and it’s not up to you. And what happened then? Did it shock you when the world didn’t end? \n\nHonestly there aren’t any “have to’s” in life. There are choices and consequences. You don’t have to wear clothes in public. You’ll probably get arrested, but that’s just a consequence of a choice. You also don’t have to help everyone all the time. Maybe some people will get upset with you. That’s a consequence. But do you want people in your life that hold you emotionally hostage? There are big consequences to never getting your own needs met too. Have you thought of that?\n\nIt’s time to change. It’s time to think about what you need and stop putting everyone else first. Lots of people are burning you out right now just because you don’t know how to tell them no. You’re hurting right now because you don’t know how to tell them you’re overwhelmed. And there’s a lot of things you need to say that you hold back out of fear of rejection. You’re suffering in silence and the only person who can help you is busy taking care of everyone else.\n\nIt’s okay. I’ve been there too. A lot of times I’m still there. But we can take baby steps. We can tell people that we don’t enjoy that thing they want us to do as much as they do. We can tell them how important this other thing is and we really want to do it. We can just say we need to recharge and we can’t help them that day. You don’t need to give a reason. But you do need to say no so that you can see what happens. You can see how the world doesn’t end and practice standing up for yourself. This gets easier over time. You are not a bad person for having needs. You’re not unkind for saying no. And you won’t get better at this until you try it.\n\nThere’s someone who needs you now more than anyone else. Someone in incredible pain and completely abandoned without anyone else who can help them. The most important favor you could ever do for anyone is taking care of yourself. If you burn yourself out then you can’t help anyone. Now is the time to be there for yourself. The world can take care of itself while you’re seeing to your needs. It will still be there when you come back. But if you don’t take care of yourself then there’s a lot of people who will miss you when you’ve given away so much there’s nothing left. \n\nLife is short. You can’t get this time back. You’re hurting a lot right now, and it’s time to take care of you. Please take this chance, you have less left than you think.\n\n\\--------------------\n\nFurther Reading: If this post resonated with you then I highly recommend Self Compassion by Krstin Neff, PhD. Dr Neff’s research teaches emotional literacy through mindfulness and compassion. When I better understood my own buried resentment and inner pain I could then offer myself compassion. And when you accurately see the pain you are in, you’re in a much better place to stand up for yourself with others. If you can’t see the fuel level in your car it’s easy to offer people rides all day and get stranded together on the side of the road. If you really want to help others, helping yourself is a part of that.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mo3nlj/people_pleasers_saying_no_might_feel_rude_but/", "title": "People pleasers: Saying “No” might feel rude, but never saying it feels worse", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 166, "down_vote": 0, "creation": 1618057157, "permalink": "/r/DecidingToBeBetter/comments/mo3nlj/people_pleasers_saying_no_might_feel_rude_but/", "nsfw": false, "first_save": 1635436503.5398438, "replies_charged": false}