{"id": "t5_2tand_t3_h7s0w7", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "This is an idea that I use to keep myself motivated so I figured I'd share it.\n\nHave you ever looked back and been grateful for something that you did for yourself? For example, you might be pretty proud of your teen self for learning how to drive. You never have to do that again! You five year old self learned how to read when their brain was growing at an amazing rate, giving your current self a major advantage. You got a lot from that version of yourself.\n\nYou probably have a general idea of the person you are trying to become. Whatever you are doing now, that person is going to appreciate. They couldn't have gotten to where they are, without you doing what you are doing.\n\nWhen you are discouraged, imagine yourself in a year (or five, or ten, or fifty,) looking you in the eye and thanking you. \"You created me,\" they might tell you. Maybe they would say, \"Just hang on. It will get better sooner than you think!\" Your future self might say, \"You taught me something that I will never forget,\" or, \"I know it doesn't feel like it, but you are being so strong and brave right now. From my perspective, you are a hero.\"\n\nEven simpler, tomorrow-you will be so grateful that today-you did the dishes. Next month-you is going to be really glad that you cut out sugar. Next year-you will be so much better off because you stayed in school, or maybe they will be on top of the world because this year-you dropped out and pursued your dream. Senior citizen-you will appreciate all the diapers you changed decades earlier when they see their children grown up and carry on the family spirit.\n\nThe world is going through a lot right now, and there is no better time to glean inspiration from the future, in the same way that you do from the past. Time isn't linear in the way we experience. Somewhere out there, in all of existence, there is an evolved you that appreciates you and in cheering you on. Raichu has a love for Pikachu that goes beyond all things. There can be no Venusaur without Bulbasaur. Tap into that energy and use it!\n\nThis was honestly kind of cathartic for me to write, so thanks for reading, and I hope this helps you :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/h7s0w7/imagine_your_future_self_giving_you_a_pat_on_the/", "title": "Imagine your future self giving you a pat on the back for what you did for them. You are laying the foundation for your ideal self to be born, and you can use their gratitude to guide you.", "social_network": "reddit", "user": "astrokatzen", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 59, "down_vote": 0, "creation": 1591992251, "permalink": "/r/DecidingToBeBetter/comments/h7s0w7/imagine_your_future_self_giving_you_a_pat_on_the/", "nsfw": false, "first_save": 1635437210.5244606, "replies_charged": false}