{"id": "t5_2tand_t3_lse0ef", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Background: I had a bad childhood and struggled with addiction for a number of years, only to get myself \"stuck\" in an unhealthy/abusive relationship where I have become completely codependent. I'm ashamed to admit this, but there it is. It's been almost 8 years of this and I'm desperately seeking a way out. I was a very smart, independent kid, and this is not what I had in mind for my life. I'm 30.\n\nMy parents pushed me into a useless humanities major in college (I was even against it), and now I find myself still unemployable and unable to lift the curse. I applied for 50+ jobs over the past year and a half and nobody seems to want me. I have nothing to offer the working world, which is a source of shame and guilt in addition to keeping me stuck in a very bad situation. I have no idea how to get on my feet, let alone \"escape.\"\n\nI have no family to turn to. I have two friends, though neither is particularly close and neither is really able to help me (I've asked about job leads). No one can help me. I have to help myself.\n\nThe only way out that I can think of is to essentially start over and go back to school, get a degree that will actually be useful (i.e. employable), break my isolation and meet people (I've forgotten how to socialize, which may be why I'm bombing my job interviews), work hard, network, and enter the workforce as a functional human. Given my current situation I will have to apply in secret, though I am highly motivated to do this. I am fortunate to have a connection to a prominent faculty member at a school I am interested in, and he said he would write my recommendation. I can probably get in, but how the heck would I finance it?\n\nI have not held a proper job in years and have no financial record. ***Can I even apply for financial aid?*** FAFSA is out of the question (they require tax returns), and I doubt that even a bank would give me a loan due to years of unemployment. Is there a way to go about this? Or am I \"stuck\" forever?\n\nThanks in advance.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lse0ef/applying_to_grad_school_after_years_of/", "title": "Applying to grad school after years of unemployment", "social_network": "reddit", "user": "Plenty-Championship2", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1614279621, "permalink": "/r/DecidingToBeBetter/comments/lse0ef/applying_to_grad_school_after_years_of/", "nsfw": false, "first_save": 1635436628.11072, "replies_charged": false}