{"id": "t5_2tand_t3_pyyzqt", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "I’ve overcome many things in my life the best others, but for some reason every mistake I make , however insignificant, feels like it’s the end of the road. It feels like I’ve been unmasked as an imposter and I’m being judged even by strangers that don’t know me. \n\nWhat inspired me to write this post, I gave a speech today in my business communications class. \nI fundamentally overestimated my target audiences understanding of the topic at hand because I rushed through the assignment last minuet and based it on what I’ve been learning in my computer science degree path. \nI fumbled in front of everyone, actively realizing my miscalculation as I progressed through slides of the OSI/TCP model and pulling a complete blank I froze. I ended up apologizing and stating what I had realized. As agonizing as it was for me, I know it’s just a small mistake.\n\nWhat bothers me is that this is my third time in college. I failed out of two other colleges.\nMy first attempt I was just young and didn’t have good values.\nMy second attempt was when my son was born and I missed 12 required clinical hours that forced me to drop out.\n\nI’m not stupid, but I have a set of challenges that makes me seem less than bright. They make it hard to stay committed when my interest sway so frequently.\nMy ADHD and Dyslexia work in tandem to make it really hard to focus on what I need to be doing. Instead of having strong executive functions and being able to prioritize, I lose my train of thought and I focus on what’s interesting or stimulating to me. It isn’t intentional and I’m not even cognizant of it most times. \n\nI work 40+ hours a week, I have two beautiful kids but I constantly feel like I’m not good enough because of how hard it is to find what they are doing interesting (from my ADHD as cold as it sounds. I love my kids, but I don’t have control over that process in my brain.)\n\nNow, I’m not going to go in depth about every bad thing that’s ever happened to me.\nThat isn’t the purpose of this post.\n\nIt’s mostly to vent, and hopefully relate others who might be facing similar circumstances. \n\nIn truth I like failure, it makes me feel, even if it’s embarrassment. It teaches me, I don’t think there is a better teacher than failure.\n\nI’m going to keep on trying, learning, pushing. That’s the father that my kids need. That’s who I want to be.\n\nIf you’ve read all the way down here, thank you and I hope some of this post had a positive effect on you.\n\nYou’re not alone.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pyyzqt/im_going_to_keep_trying/", "title": "I’m going to keep trying", "social_network": "reddit", "user": "Csmith981", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1633056683, "permalink": "/r/DecidingToBeBetter/comments/pyyzqt/im_going_to_keep_trying/", "nsfw": false, "first_save": 1635435345.7683926, "replies_charged": false}