{"id": "t5_2tand_t3_qftdhg", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "Mimetic desire, a theory from philosopher René Girard, argues our desires aren't authentic. Instead, we desire other people's interests (e.g., food dishes, hobbies) or how they are (e.g., status or prestige.)\n\nFor example, we act under mimetic desire when we buy a celebrities' favorite shoes in seventeen installments because he likes them. Mimicry is inoffensive in this case because the star doesn't know us. Therefore, he won't retaliate, scold, or compete with us.\n\nBut imitation can cause rivalries when the person we are imitating shares our goals.\n\nFor example, Gucci's creative director Alessandro Michele doesn't care if you imitate his style. But if Louis Vuitton's artistic director Virgil Abloh copied his style, Michele could see Abloh as a rival. The rivalry could cause Michele to criticize Abloh in public or seek a new style to outdress Abloh.\n\nWe can find people with our goals or financial state around us—friends, family, and colleagues. And if we aren't careful, copying them can lead to rivalries or regret during our deathbed.\n\nDifferentiation is Girard's solution to the potential violence caused by mimetic rivalries. \n\nSelf-isolation is one method I've used to differentiate myself from other people. So far, I have become better at distinguishing between genuine and mimetic desires after periods of isolation. \n\nYou can do it too, following the three steps below.\n\n## 1. Choose a form of isolation based on how comfortable you are with solitude\n\nWhen you cut your family, friends, Pomeranian, and partner from your life, you cut your social support group. Without one, your mental and physical health deteriorates — you are more likely to have higher blood pressure, reduced immunity, and feelings of loneliness. \n\nFor example, five years ago, I took a 1-year isolation period to improve my mental health after switching majors and suffering from unprecedented hormonal acne.\n\nI had my roommates, so I wasn't alone. But most were men raised to believe emotions are useless. In other words, they couldn't provide emotional support even if they wanted. \n\nWhile I became more confident about what *I wanted* to pursue after this time, I was unhappy without a support group. \n\nSo for your first isolation period, choose the conditions of your isolation based on how comfortable you are alone. Otherwise, you may feel miserable because of not having people to reach out to for emotional aid like I did. \n\nIn my case, the 1-year time frame was too long. My mental health wasn't at a peak state, so I crumbled without a social circle. Maybe, a three-month period while having a support group could have been a better option.\n\nThose comfortable with loneliness can choose more extended isolation periods surrounded by fewer people. These conditions will give you more time to ditch other people's desires—as you'll learn below.\n\n## 2. Use time alone to learn about what you value in life\n\nWhen you know what you esteem, you can better differentiate between a need and a mimetic desire. \n\nOne of the few positive outcomes from COVID was that people had more time to think. Sure, some workdays extended, and home tasks overlapped with work — like taking a nap during a work call. But most people had more time to create plausible arguments to leave their jobs.\n\nAs a result, millions left the jobs they'd been doing to compete, show off, keep up, or amaze their social circle.\n\nUnlike these new unemployed people, millions haven't understood *their* desires yet and still work to meet someone's expectations.\n\nDuring your upcoming isolation time, discover what *you* value so that you can reduce the influence of other people's desires. You can learn about your values and beliefs by questioning them. I follow a simple process: write down one of my beliefs and then ask, \"why do I believe this to be true? Who else believes this to be true? Why aren't the alternatives true?\"\n\nAsk yourself these questions to discover the roots of *your* desires—often other people's desires.\n\n## 3. End your isolation cycle before you compete with yourself\n\nEven if you go to a remote cabin in the woods for 6-months, there is a model of desire you can't run from—the ideal you. \n\nHumans have an ideal version of themselves. This version behaves differently than you do.  If you are isolated too long, you can turn your ideal self into your model of desire. And since you are chasing ideals, the unreachable standards might overwhelm you, besides, of course, governing the interests you pursue after your isolation period. \n\nDuring my second isolation period, I turned an ideal image of myself into my model of desire. \n\nAt first, competing against me stopped me from comparing to others. This habit helped me ditch other people's beliefs. But then I became frustrated because I could not become the perfect version of myself.\n\nI didn't know what the ideal me was supposed to know, wore what the ideal me was supposed to wear, or earned what the ideal me was supposed to earn.\n\nSo, on the one hand, I was learning what I valued. But on the other hand, I was chasing another person's identity—my future self's.\n\nI've gone through three months-long isolation periods: two deliberate ones and one enforced by COVID policies. I can now detect when I'm competing with myself. But I couldn't do this during my first two isolation periods.\n\nThus, I recommend anyone planning to self-isolate for the first time to set an end date for this period.\n\nFor example, your first isolation period can last two weeks. You can then use one or two days to check how comfortable you felt during the exercise. \n\nIf you feel anxious about not talking to anybody, don't isolate yourself right away. Instead, wait for a few months until your mental health is in a peak state. \n\nBut if your next isolation period excites you, start a new one after at least two weeks. That way, you can use those two weeks to test your capacity to make more autonomous decisions.\n\n## Free up time to appreciate who you are\n\nHumans seek to be and look like others out of envy and admiration. \n\nUnfortunately, this tendency can ruin your relationship with others and your future self—in the form of regret.\n\nIsolation is one of the likely dozens of methods to become more genuine. It's the one I tested and validated. But you can evade mimetic desire with any method that shows you having everything another person has (e.g., stress and legal issues) isn't ideal.\n\nIf you know other tactics to reduce the influence of mimetic desire, share them with me on Twitter @ MrNicolasForero", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qftdhg/how_to_pursue_you_want_and_not_compare_yourself/", "title": "How To Pursue YOU Want And Not Compare Yourself To Others", "social_network": "reddit", "user": "Nicolasforero", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1635204768, "permalink": "/r/DecidingToBeBetter/comments/qftdhg/how_to_pursue_you_want_and_not_compare_yourself/", "nsfw": false, "first_save": 1635435988.8545263, "replies_charged": false}