{"id": "t5_2tand_t3_mzulwr", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "No one tells you that when you decide to be better you’re gonna take a lot of steps backwards \n\nNo one mentions how when you decide to be better you’re gonna have to come face to face with a mirror \n\nNo one says that when you decide to be better you’re not gonna recognize the eyes staring back \n\nNo one tells you that when you decide to be better it’s gonna feel like progress never comes \n\nNo one mentions how when you decide to be better you’re gonna lose almost everyone you’ve known along the way\n\nNo one says that when you decide to be better you’re gonna blame yourself more than them for leaving\n\nNo one tells you that when you decide to be better you’re also deciding that the person you have been is no longer welcome at your dinner table \n\nNo one mentions how when you decide to be better how hard it is to ask yourself to remove yourself from your own dinner table\n\nNo one says that when you decide to be better you have to remember to give grace when you don’t immediately leave the dinner table\n\nI decided to be better a few months ago.... I joined the sub hoping I would eventually be able to share some sort of success story. On how I’m thriving. How I’m doing better than ever. I’m on top of the world.... but I’m not. In fact I feel worse. \n\nBut everyone always says how when you decide to be better... it’ll feel like a lotta steps backwards.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mzulwr/a_poem_about_being_better/", "title": "A “poem” about being better.", "social_network": "reddit", "user": "shitsgayyo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1619546693, "permalink": "/r/DecidingToBeBetter/comments/mzulwr/a_poem_about_being_better/", "nsfw": false, "first_save": 1635438363.4802883, "replies_charged": false}