{"id": "t5_2tand_t3_ckod1k", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "So far, so good. You have several life roles that you have defined. Each role has a funnel with long-term, mid-term, short-term, and weekly goals. And for each role you have defined the mission statement and the personal vision statement. But how do you juggle with all these often-competing priorities? How do you achieve balance between them? How do you know at what point of the day on which role to stress? And in general, how do you divide your time?\n\nThis chapter is about balance. I believe that finding balance is the most important task and all your efforts so far have been leading to this. There are different descriptions for this. Some people call it “*finding work-life balance*” with the implication of quantitative division between work and life commitments. Other people call it “*finding work-life harmony*”, or qualitative division between work and life. In practice, all this means that you cannot afford to neglect any of your life roles in favor of the others. At least not for long.\n\nHowever, you can still decide to neglect any of your life roles by dropping it from the list. The implications are immense and I urge you to really think about it, but this is what I did a few years ago (more about it later in this chapter).\n\n## Time to read\n\nTime to read: X minutes (based on 150 words per minute).\n\n## Introduction to work-life balance\n\n Many people struggle to find the correct separation between their professional and personal lives and they call this work-life balance. What they fail to realize however is that there is also tension between the different life roles within the broader professional and personal categories. The immediate solution seems to divide the time you spent in each role in equal portions (let’s call that quantitative division). This could be a good idea depending on your life roles, but can you dedicate 2-3 hours a day each day to the different life roles? I do not think this is even possible if you also want to sleep. Another option will be to divide the time your spent based on the return (let’s call that qualitative division). But this way you risk dropping the ball on some roles that feel not that important. In this case, where is the middle? What is the correct option?    \n\n### What prevents us from doing the right thing?\n\nThe main problem, in my opinion, is that we, humans, immediately tend to go for the short-term rewards rather than stay strategic and concentrate on the long-term. All the years of evolution have taught us to stuff ourselves when we see a low-hanging fried, because we might not have another chance. This skill was probably great a few thousand years ago while we were still hunter-gatherers, because of the burst of energy that we get from sugar and fast carbs. But in our modern world, there are too many low-hanging fruits and it is not a challenge to find them. Meanwhile, you still keep this instinct to stuff yourselves. And you keep investing your time in immediate gratification activities (or in other words, you are wasting our time).\n\n#### Email\n\nAnother issue is that most of you have this endless list of to-dos that we call e-mail. E-mail is what other people want from you – your time, knowledge, advise, willpower, skills. Many productive people only check their email once or twice a day, they create a list of tasks from this email, and they mix these tasks and prioritize them against their own to-do list.\n\n#### Juggling\n\nLast but not least, you try to juggle too many things. Have you seen those super mommies in the movies that wake up at 5:00 AM to do yoga and meditate, prepare breakfast, drop the kids to school, cycle to work, get dressed in the impeccable suits, are energetic and awesome the whole workday eating no carbs, go back home to prepare this amazing dinner, and, finally, help the kids go to bed, and watch a movie with their husband?\n\nOr that lawyer, who goes to the gym at 5:15AM to work-out, eats a smoothie for energy, takes a cab downtown, secures a multi-million deal before noon, heads to the courtroom to defend this NGO on a pro-bono basis, goes out with colleagues to a local bar to celebrate the victory, clubs all night long, and does not go home alone? I know, there are a lot of stereotypes in the two sentences above, and please accept my apologies, but I hope you get the point. Well, these people exist only on the TV screen. You cannot do everything every day. You have to ruthlessly prioritize.\n\n### What is the benefit of work-life balance\n\nBy the end of this chapter you will have a toolbox to help you ask the right questions each day and set the right priorities for all your tasks. You will be empowered to question all your instincts that sometimes work in your favor, but sometimes work against you. You will know when to say – this is enough, and when to say – I can do more of this.\n\n## Personal story\n\nMany years ago, my life roles list (even if it was not as well defined as now) was completely different than now. I was a huge fan of video games and I spent about 20% of my time playing. Also, I used to play a lot of sports (tennis, football, skiing). I have not done the calculation, but let’s say about 5% more. I did not sleep as much as now (I was in my twenties), but let’s say another 25%. Then, of course, I was working hard and I spent probably another 25%-30% working. I dedicated a lot of time to my friends – about 15% and only 5% were left for my parents and brother. But nevertheless, I had found my balance and I was happy for a period of time.\n\n#### Change\n\nA few years ago, I decided to completely change my life by changing at least 3 of the pillars. I moved to another country, I decided to continue my education, and change careers. On top of all that, I met the right person and I started a family. That was probably too much change (even though I love change) and I went through a very rough period. The biggest win, however, was that I dropped video games. Which means that I removed the Gamer role from my list. I used the extra time for education and self-improvement. The same happened to my Friend role – I reduced it to the bare minimum and I used the time to dedicate to my family. But again, I found my balance. Which, in my opinion, means that I’ve found a state that makes me happy and allows me to feel fulfillment after each day of my life.\n\nNow, as I am writing this book, I have 7 life roles on my agenda. I found through experimentation that you always have to start with yourself. It may sound selfish, but it is really rather selfless. By putting own needs first, I’ve managed to create an atmosphere of trust, care, and compassion in my personal life. And an environment of trust, respect, and win-win relationships in my professional life. Then, I have three more personal roles and three more professional roles. This is because my professional development is equally important as my personal life.\n\n#### Principle\n\nI have also created the principle “*Family > Career > Fun*”. For me, this means that I sacrifice pleasure if it conflicts with my career or my family (but I still put fun on the table). And, most importantly, I put my family above my work.\n\n## Background\n\nThe essence of work-life balance is in knowing yourself, knowing your goals, making sure you schedule enough time for all of them, and setting yourself first. All the chapters in this book have been leading you to this one and helping you improve the aspects of your life that will benefit your balance.\n\nHowever, balance is more than making sure you pursue all your tasks. You need to seek balance in everything that you do – balance sleep, work, and relaxation; balance personal and professional; mind and soul; emotions and thoughts. Do not let yourself swing in extreme conditions – from anger to indifference, from hunger to gluttony, sadness to overjoy.\n\n## What can you do to improve your work-life balance\n\nIn this article, you will concentrate on balancing your time and allocating enough time for each of your life roles and your goals.\n\n### 1. Prioritize your time\n\nWe’ve already established that in the previous articles and I will stress it one more time. If you want to become better at X (any skill) or a successful Y (any profession), you need to practice the skill or the profession. As simple as that! You want to become a better public speaker? Guess what? Watching TV will not help you. Or reading books. There is nothing wrong in improving your knowledge of public speaking (reading blog posts with advice, or listening to podcasts by great speakers). But you will not get better unless you start doing it.\n\nThis is why you need to prioritize your time and put the important stuff first. All your tasks can be divided into four quadrants (important and urgent, important but not urgent, not important but urgent, not important and not urgent). The more time you spend in I and III (urgent), the more stressful your life it. The more time you spend in I and II (important), the more you accomplish. Ideally, you need to concentrate all your efforts in quadrant II (important, but not yet urgent). This will prevent the important tasks from getting urgent. And (also ideally), you need to ignore III and IV altogether.\n\nThe best way to do that is spend an hour each week to define the important tasks for the week. And 30 minutes each day to determine which of the important tasks you want to tackle on this day.\n\n### 2. Improve self-awareness\n\nWhen is your most productive time? In the morning? Or the evening? In other words, are you a lark or a night own? A typical day of a lark will be to get up yearly, meditate, exercise, go to work, tackle the most important tasks (MIT) before noon, then start doing the less important tasks, go home early, play with the kids, and go to bed early. A typical day of an own will be to get up late, have a coffee while reading the newspaper, do some late morning jogging, go to the office just before noon, work on the MITs until early evening, visit the gym on their way home, go for a late dinner with friends or family, watch a movie or read a book, and go to bed late.\n\nIt is really important to know yourself and put the important tasks when you will have the highest energy levels. If you are not sure, then experiment consistently for a month. Spend 1 month as a lark and another one as an owl. Which one feels better?\n\nThere are also other elements of self-awareness that will help you achieve balance and I briefly want to touch upon them. You also need to know your triggers. When you are emotional (sad, angry, frustrated), then it will be a challenge to be productive. Spend some time thinking about your triggers and try to get to know them.\n\n#### Introvert or extrovert\n\nAre you an introvert or an extrovert? Just like larks and owls, some people accomplish more when surrounded with others. And other people constantly get distracted in such environment.\n\n#### Writer or a talker\n\nAre you a writer or a talker (reader or a listener)? I am a writer and I set aside 30 minutes each day to review and organize my email and to answer all the emails that need an answer. I typically go somewhere quiet and fully emerge myself. I am also a lark and I schedule important meetings before noon, but after my “alone time”, because talking drains me and I need my mind to be clear of clutter (all emails are handled and all tasks are written down) in order to concentrate.\n\n### 3. Develop habits\n\nMost of us are creatures of habit. For those of you that are not, I am not sure if this section is a good idea. But for all the others, you need to turn productivity into a habit and not rely on happenstance. Set strict hours for the different important tasks (meditation, communication, self-improvement, reading) and stick to them. Most writers that I know prefer to write at a predefined time and have turned writing into a habit. Most athletes stick to a strict regime when they are training for a competition. This way you train your mind to get into the correct mode at the correct time.\n\nHabits also have a downside, the change from daylight-saving and back really messes up my routine. This is because we use hours and watches for the last 100 or so years while our mind and body understand only the sunlight as an information source. In the last few years, I try to adjust myself gradually to the new time. For a week I switch all my habits with 15 minutes, then 15 more, and so on. But it is hard. School always starts at 7:30 and you need to be there on time no matter the day.\n\n### 4. Track your time\n\nAfter you’ve established your habits and after you’ve put the most important tasks on your calendar, the next step is to actually track how much you stick to that. I would also recommend doing that exercise before you start everything else. Track your time on a spreadsheet and see where you invest your time. My work requires a mix of business and tech skills and in order to grow I have to invest time in both. And my actually job requires a third skill. So, I make sure I keep the proportion of the three roughly steady on average (25%, 25%, and 50%). But before you are ready to do this, you have to track your time for a few weeks and make sure you know where it goes.\n\nThen, you are ready to start making changes. If you see discrepancies this means that you should start prioritizing more one of your life roles vs. the others. Or, shift the priorities with which you are accustomed. You cannot avoid having weeks where the balance is shattered by an event, a lot of meetings, a looming deadline. This is fine. However, you need to make sure that you compensate in the following weeks. You can imagine it like a bank deposit. It is OK to withdraw time from the other life roles, but you need to deposit it back.\n\n### 5. Organize your working environment\n\nMost of the problems with regard to balance is when you overemphasize one of your roles over the others. Imagine the classical example of an overworked father who is always behind on his deadlines and has to work late to finish all his responsibilities. What if that person could find ways to be more efficient at work and make sure that he actually finishes everything on time? Then, the balance would be restored.\n\n#### Working from home\n\nIf you are one of these people that work from home, create a place where you only do work. Turn this into your working shrine, learn to associate it only with working. It has to be separate enough from everything else, so your mind will know that when you sit there all distractions are left behind. You will not be efficient if you go back to the refrigerator every few minutes (or maybe you will be, for all I know – I am not efficient like this). Or, if you have to TV on while you work. This is my biggest distraction. Find your way of doing things, practice it, and keep improving your productivity. This way you will be able to time-box your work and have enough time and energy at the end of the day.\n\nThe same is true for your alone time or the time with your family. Forget the phone and the email. Put away the computer with those candle stick charts. You’ve withdrawn time from your other roles while you have worked hard, now is the time to deposit it back.\n\n#### Working in an office\n\nFor those of you that work in an office I would make sure that you have everything accessible (more info about organizing your desk here). It is easier to associate the working space in the office with work. But I would still advise to remove distractions. If you work better alone, book a room or find a place where you can do that undisturbed. If you work better among other people, prioritize working during the time when the office is the fullest. I also believe in organizing your desk in a proper way, so that you have “*mental compartments*” for different types of activities (paper for drawing and notes, space for the mouse and the keyboard, a little space for a few family pictures, a tray for incoming tasks on paper, etc.)\n\n### 6. Take advantage of technology\n\nWhat we have now in terms of productivity tools has never been seen in history. You have numerous applications that could track your time. And reminders that make sure you take a break and do your MITs (most important tasks). You have scheduling applications, applications that help you adopt a habit. My advice is – use them, but, once again, find the balance. Email is a great communication tool, but the constant flow of emails and the notifications can hinder your productivity (more info about organizing your email here). Most people check email just a few times a day – enough to communicate effectively, but not enough to become inefficient.\n\nAnd finally, think about organizing meetings remotely (more info about organizing efficient meetings here). There will never be a proper substitution of one-on-one interactions in person. But not all occasions require this. If you can, try to meet with people over the phone, or in virtual conference (VC). This way you could spare yourself a 1-hour drive or even a flight.\n\n### 7. Make time\n\nYou don’t find time, you make time. Schedule the most important activities on your calendar including the activity to schedule activities. Schedule time to review your priorities weekly and make sure you always have this time. My personal advice it to do this in morning before everybody else gets in the office, but it is obviously up to you. I also schedule personal events on my calendar, this way it is much harder to book something over, because you need to make a conscious choice to lower the priority of your family (or spouse, or parents, or sibling).\n\n### 8. Do what you love\n\nMy favorite example here is the instructions that flight attendants give you when you board a flight: “*In the unlikely case of emergency, make sure you put our own mask fist and then assist other passengers.*” It is amazing how many people neglect that. Make time to do something that you love which does not feel like work every week. If you can, make it every day, or at least several times a day. The most important activities that fall into this category are those that put you in a state of flow. Flow is when you do not feel that you are working.\n\nThis is you depositing back the withdrawals from your personal account. You need to “sacrifice” so much to be healthy, productive, successful, and happy person, parents, spouse, or professional. And so, you need to refund yourself for all that. Sometimes this could be just making time to watch a movie on a weekend, or play a sport, or take your spouse to a dinner, or your kid to the aquarium.\n\n### 9. Take breaks\n\nThe main secret on your quest to find balance is not to manage your time efficiently, but to manage your energy levels efficiently. There are many studies that show that our minds and bodies are optimized for 60 to 90 minutes of concentration (in sports, work, anything). After that period, we can will ourselves into continuing, but we are not nearly as productive as during that time. When you mind needs a break, there is nothing that can stop it from having it. So, don’t do it. Schedule breaks in your day. Go for an afternoon nap, if you work from home. As Winston Churchill says, you give yourself two mornings like this. Go on holidays, go on vacations. Recharge your batteries and sharpen your saw.\n\nAlso, schedule your vacations regularly and relax during that time. There is nothing that works better for your work-life balance than a week or two away with your family. Remember to disconnect, leave your smart watch at home, do not enable data roaming.\n\n### 10. Manage your mind\n\nAnd last but not least, and it will probably sound weird in this list, but fight fear or self-doubt. There is nothing that harms balance more than negative thinking. Learn to do meditation or breathing exercises. And do them on regular basis. Schedule time on your calendar to do that. Counter every negative thought, be brave in the face of fear (I wish that was as easy as it sounds, but it is not).\n\n## Summary\n\nDefining your life roles and all the corresponding goals and tasks has been the main topic of this book. Finding the balance among all your life roles has been the main topic of this chapter. Finally, it is up to you to keep this balance once you find it. Make sure to bounce back if you fail in the beginning, keep working on yourself and the benefits will come. Think about this as a never-ending journey (it will end eventually, but this is not the point), rather than a goal that you have to reach. As you grow older your mindset will change and new things will become important to you. Then, you will have to find the balance again (potentially even leaving some of your old self behind). \n\nTin Mayer\n\nAuthor", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ckod1k/worklife_balance/", "title": "Work-life Balance", "social_network": "reddit", "user": "tinmmayer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1564665979, "permalink": "/r/DecidingToBeBetter/comments/ckod1k/worklife_balance/", "nsfw": false, "first_save": 1635437135.260545, "replies_charged": false}