{"id": "t5_2tand_t3_k3ua6h", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I have struggled with PTSD, major depression and generalised anxiety disorder since middle school and it got especially bad in college because of the pressure of dealing with things on my own, and the stress of Engineering courses and failing romantic relationships made it all worse. I started therapy and was put on medication too but it didn't really help me, probably because I couldn't find the right therapist. In the course of the past 5 years, I attempted suicide seven times and ideated it countless times too. The last attempt was last year in the month of March and I almost died to it. I came back home to visit my sister because she was having a baby and something turned soft inside me the day I held the baby in my arms. I still had suicidal ideations and for a brief period of time believed that I could finally die in peace now that my family had someone else to be happy and hopeful for.  I told my dad about my issues and also opened up to him about trauma from childhood that I had been blocking for almost a decade. I decided to start writing poetry again, took to daily running challenges and actively tried being more open about sharing my burden with my friends. I actively worked on my self-esteem issues and unlearned and unpacked a lot of stuff thanks to the dreadful covid lockdown. I am grateful that I survived my suicide attempt, my niece is 18 months old now and I am finally in a place where I no longer have suicidal ideations or intrusive thoughts about giving up on life, I am an engineer with a job, I can run 15 kilometres at a stretch on any given day, I no longer feel the urge to shave my head or self-harm, I am more open about what bothers me and I try to solve problems as they come, not to jinx it but I recently got into a warm relationship with a friend I made at the beginning of the year and I plan to move out into a house of my own after I save up enough to afford it. I turned 22 a few days ago and I am looking forward to living this life through all its seasons.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k3ua6h/celebrating_a_whole_year_of_no_intrusive_thoughts/", "title": "Celebrating a whole year of no intrusive thoughts", "social_network": "reddit", "user": "ohgodidonthaveajob", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1415, "down_vote": 0, "creation": 1606736442, "permalink": "/r/DecidingToBeBetter/comments/k3ua6h/celebrating_a_whole_year_of_no_intrusive_thoughts/", "nsfw": false, "first_save": 1635438245.2606566, "replies_charged": false}