{"id": "t5_2tand_t3_lzfdlr", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "20M with Asperger's. Diagnosed at 13, grew up with family dysfunction that escalated from middle school onwards(parents fighting verbally/physically ad a suicidal sister). I was eccentric as a kid(clingy, more silly acting than average), middle school I preferred Legos and sword fights with younger kids and outside of that just church youth group, but was socially awkward and kinda weird at school(i.e. standing by people to talk, but can't think of anything so come off as creepy). High school I had some odd moments and was still socially awkward too but was much more alone due to having narrow interests and eventually stopped being religious. I'm basically normal now in terms of social awareness and making conversations and such, really that's where most people were at years ago and seeing who I am now compared to back then really shows how different I was compared to neurotypical people, which does lessen my confidence and make me apprehensive about seeking new friends and especially dating aside from still feeling guilty for past mistakes. Though I wonder if fixating on that is more debilitating than clothe condition itself.\n\n\nThing is, I know that even if the first 18 years of life haven't been ideal, I know I shouldn't feel doomed. Even being inexperienced my social intuition is normal now though I do have to watch my wording and hyperfixation more closely. I'm not ugly(decent looking an even told I look a couple years younger) and am working on getting in better shape, aside from the EMT training, moving out soon and starting web classes in a couple months. My desired career is working as a game warden(environmental police officer). I talked to a couple of them when at a marina about the job and though mentioning I was autistic, they did say I walked up and talked to them no problem and had researched it more than anyone they talk to.\n\n\n I guess I should give myself some more credit and not hold onto past mistakes so much. Lots of folks do dumb **** in adolescence and its not like other people don't get a **** hand mental healthwise(BPD, depression, anxiety, etc). My own sister has something in the bipolar department with mood swings where she will throw and break things and has been put in soecial care for suicide before, and she likely gets it from my dad who has similar tendencies. I am not upset about having the Hollywood high school experience either. It's exaggerated anyway and even then I'm not a party animal or seek to be a smooth cassanova, but would have like to have some solid friends and involved in some worthwhile extracurriculars and classes and of course wish I was less cringey.\n\n\n\n\nI welcome all input, including those on the spectrum themselves or those with other mental conditions? Any tips, your own experiences with struggles and support, ups and downs?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lzfdlr/how_do_you_come_to_terms_with_having_a_mental/", "title": "How do you come to terms with having a mental disorder/disability?", "social_network": "reddit", "user": "Zen-Paladin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1615077939, "permalink": "/r/DecidingToBeBetter/comments/lzfdlr/how_do_you_come_to_terms_with_having_a_mental/", "nsfw": false, "first_save": 1635437265.414135, "replies_charged": false}