{"id": "t5_2tand_t3_ag87jz", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "It's been almost 2 weeks of me setting up a routine for myself. I'm still struggling with depression and anxiety, I still have a lot of self doubt since I have no clue what I want to do with my life but these 2 weeks of routine are helping me so much and I am so proud of myself that I thought I'd share it to maybe bring some light to others. I was always lazy to set up anything and kinda failed at keeping anything up for more than 2 days. But this time it's lasting.\n\nI've been getting to bed at a set time : around 11pm every night. I didn't drink alcohol nor coffee for 2 weeks. Been waking up whenever I felt like it and then got out of bed, ate a healthy breakfast and drank around 2 liters of water everyday, setting up reminders on my phone. Since 5 days I've been doing yoga every morning before doing my skincare routine and hair routine. I then proceeded to tidy my room and house. Once everything was done, I tried do to the tasks I prepared for the day (practise my violin, play games, do the things my mom asked me to do etc).\n\nBefore going to bed I then watched a movie or read a few chapters of a book so I could go to sleep with some different things than my problems in mind. I also put up a lot of motivational quotes on my walls so that whenever I walk around my room I have some nice stuff to read and remind me of my objectives.\n\nThe benefits are that I feel less worthless, it shows me I'm capable of setting objectives and fullfiling them, even if they are easy. I start my day with accomplishing things for myself and I feel proud, which is such a rare feeling for ppl suffering from depression. I wake up with positivity. And the more I keep going in the routine, the more I'm excited to get out of bed and feel my freshly washed skin for example,  or to scent the cute candles I put all over my room for my yoga poses. Also these 5 days of yoga help me deal with the anxiety I feel in my body, it goes away for a few hours after my sessions and it feels SO AMAZING!! I should've done this earlier !\n\nI am so happy with this and I feel so much motivation to keep going. Didn't feel like that in years. I even booked an appoitment for a therapist today!\n\nI strongly advise to try and set up a light and easy to follow routine and to stick to it. For me right now it's working like a charm and it feels like it's something I can hold on to. I'm not doing that much in terms of productivity compared to the standarts of our society, but at least I'm doing more than before and I feel much better in my skin and mind. If you don't know where to start, a routine might be a really good option!\n\nHave a great day :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ag87jz/i_set_up_a_routine_and_its_helping_me_feeling/", "title": "I set up a routine and it's helping me feeling better!", "social_network": "reddit", "user": "Risablabla", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 57, "down_vote": 0, "creation": 1547556927, "permalink": "/r/DecidingToBeBetter/comments/ag87jz/i_set_up_a_routine_and_its_helping_me_feeling/", "nsfw": false, "first_save": 1635435826.7897809, "replies_charged": false}