{"id": "t5_2tand_t3_q2ctyt", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "b69cf201-6737-4217-b486-9096135546b8", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "78e8a1f4-314f-439f-8f40-daf7a6da355f", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "There’s a lot i’d like to say here but I’ll try to keep it brief. I’m too ashamed to talk to anyone I know irl and I don’t have the funds to go to therapy at the moment. \n\nA bit of background: I’m 21 years old, slowly getting through college and very recently quit a job that was deteriorating my mental health. I have a bit of money saved up to where I can take my time finding a new job. I have decided to take this free time to really figure out what I want to do with my life, given my last career path has just turned sour. \n\nSaying I’m indecisive is an understatement. \n\nI used to take pride in having lots of unique hobbies and interests. From athletics to music to cooking to art, I’ve always had a passion to learn about everything. However, when I really think about my motives, it turns out “passion” isn’t really the right word. \n\nI have realized that associate my ‘interests’ with a certain lifestyle I think I would like to live. I don’t think of the work it takes to get there, but I instead focus on a romanticized version of myself in that career path. And before you ask, yes, it’s vanity. I want people to think I’m intelligent, selfless, admirable, but most importantly, beautiful while doing XYZ job/career. For example, my thoughts might be: “If I became a singer, I would have so many people that would love me” or “If I became a professional soccer player, I would have a really fit body” or “if I was a statistician, I would be considered very intelligent to the average person”. It’s as if I have ulterior motives for each potential career path, which is why when it actually comes down to starting down a path, I back out. My intentions are not genuine.\n\nI’ve dropped out of college on three separate occasions, all of them having to do with my fear of not being able to commit to a certain career path. I’ve also worked in a variety of different job types, none of which were fulfilling. My biggest fear is living a life in which I am not proud of, or that I find myself mentally checking out most of the time. I don’t want to constantly be waiting for the weekend. And to achieve that, I know I need to chase my dreams, but what dreams are there to chase if my only objective in life was to be better than others? To be prettier, smarter, and more well rounded? And for what? It’s not attainable and certainly not mentally healthy to measure ones success based on what other people have achieved. \n\nIt makes me wonder, if I didn’t have all of these insecurities regarding my looks and my intelligence, what kind of person would I really be? It is as if I’ve surrounded my whole identity around being pretty that I don’t have any genuine personality, except for bitterness and jealousy when I see someone who is better than I am. \n\nI’m not sure how to change my outlook, because right now it’s pretty bleak. I can expand on or explain anything if needed, I know some words didn’t express in exactly the way I wanted. But any advice or similar stories are helpful.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q2ctyt/everything_ive_done_in_life_has_been_in_the/", "title": "Everything I’ve done in life has been in the pursuit to be admired and envied. It’s gotten me nowhere. Now what?", "social_network": "reddit", "user": "opeitschristine", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1633493530, "permalink": "/r/DecidingToBeBetter/comments/q2ctyt/everything_ive_done_in_life_has_been_in_the/", "nsfw": false, "first_save": 1635435343.4703805, "replies_charged": false}