{"id": "t5_2tand_t3_emo07x", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "221a05fc-6bbf-424e-808a-6b3e01891c48", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "What is “happiness”? Technically is just the balance between your reality and your expectations. If you have a job that satisfies you if you think that your salary is fair, if you feel happy being among your family members – you are happy. Even though you might earn less money than your neighbors and your car is cheaper and older.\n\nSo, happiness is the point where your lifestyle meets your goals. If you dream about being a wolf of Wall Street but work as a cashier in a local supermarket so far, you are unhappy. An American life coach would have said that you have a dream, a purpose, that you have motivation. But it doesn’t change the fact that you are unhappy. Unhappiness is the gap between what you have already had and what you would like to have instead.\n\nCommon sense tells us that there are two ways to narrow the gap. The first one is to fulfill your dreams. The second one is to lower our expectations to the level of our real life. Common sense also tells us that the first one is much more complicated. Moreover, we know that as soon as we reach our goals, make our dreams real, we will get new dreams, and it all will start up again. So, the second one, logically speaking, looks more attractive – from the different points of view. But we often look at it as at a betrayal. The betrayal of our dreams.\n\nThis idea comes from the west. The Eastern religious and cultural concepts (Buddhism, for instance), the other way round, suggest the opposite direction of thinking. They advise us to work on ourselves until we feel the harmony between the world inside us and the world outside. The world outside is perfect, or at least we can’t change it anyway, so the only thing we can do is to sync our inner vibrations with the pulse of the world. But Eastern practices still look rather exotic in our world of money, gadgets, and social media. The majority of us subconsciously chose the first way to narrow the gap, and just a few of us are successful in it.\n\nThere are a lot of reasons for that, but I would like to mention two of them. The first one is social media or the things that had the same function in the pre-Internet era, such as glossy magazines. It is too hard to fight the obsession of being wealthy and well-known when we look at the broad smiles of celebrities. The second reason is too many stories of the losers we have heard in our lives. How does a typical loser behave? They justify their failures by claiming that they are happy anyway. If they can’t afford traveling abroad, they say: “What can be better than the motherland? There are many places to visit at home”. If they can’t afford a car, they insist that they walk a lot, which is healthy. And so on. \n\nAnd we are afraid that as soon as we start to lower our expectations, we will start looking the same way. Looking like the losers trying to find a decent reason for our “losership”. \n\nThat’s not true, of course. What does the term “loser” mean? It is a person who is worse than others in some ways. This approach contains two crucial things – comparison and judgment. Somebody compared the person with an imaginary “standard” and made a judgment – he (or she) is a loser. We often do it ourselves – we compare ourselves with an imaginary “standard” and make a conclusion that we are losers. \n\nI have read an article in The New York Times (“Human Contact Is Now a Luxury Good”) recently about the idea that in the future face-to-face communications between people will become the privilege of the rich elite. That things like messengers, skype, artificial electronic “friends” created by AI, and living in gadgets will be the fate of the poor majority. And only a few people will be able to afford the luxury of talking to each other. The wealthiest people are afraid of screens, and their kids attend the high-class, screens-free private schools. \n\nI would like to add that the right to choose their lifestyle will be the privilege of a minority. Not necessarily the rich minority, but the minority of really free people. The majority will still follow the social trends magnified by social media (or even a “social rating”, as it described in the “Black Mirror” serial, similar kinds of ratings already exist in China). The minority will set up their own levels of life expectations. The majority will let others do it instead.\n\nIt is never too late to join this minority. If you really want to become a celebrity – do not hesitate, go ahead. But if you are happy keeping a low profile – it is your choice. If you really love things like skiing, dancing, visiting glamorous parties – enjoy it. But if you are happy at home, with a good book and a good mag of tea – just stay at home.\n\nSvyatoslav Biryulin", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/emo07x/happiness_is_just_the_balance/", "title": "Happiness is just the balance", "social_network": "reddit", "user": "sbiryulin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1578643808, "permalink": "/r/DecidingToBeBetter/comments/emo07x/happiness_is_just_the_balance/", "nsfw": false, "first_save": 1635435276.1496224, "replies_charged": false}