{"id": "t5_2tand_t3_iueqop", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "It's currently 3am as I write this and I realized how the position I am in is very weird. I know I am only 20 and I'm not supposed to have my life together but I just am in a limbo of wanting to be successful and happy but also not acting towards it 100%. I grew up in a very affluent town although my family never was we have a long line of relatives who lived here before it got crazy wealthy. I come from a loving family and I have great friends but I feel like I'm wasting my life away. I'm 20 years old and I never really had to try that hard in life. School was never really that bad and I never tried but just got by until college where I ended up failing out. Sports and things I was pretty naturally talented. I in no way mean any of it in a bragging way. I know the life I live is very fortunate. My biggest struggle has always been motivation and believing that good things will come. I recently was diagnosed with ADHD, which could explain the struggle with school and motivation but even with medication I still struggle. Right now I'm in such a weird place where I want to do something with my life and with my day and then I just end up sitting on my bed all day playing video games. I've also started to dislike a lot of the things that brought me a lot of joy. Video games seem kind of meaningless, youtube videos although sometimes fun seem fake and like a waste of time. Certain foods suck now especially processed things. Luckily my family is moving out of this town to somewhere more rural and peaceful, once get past the moving phase is when I hope to start more of my self improvement journey. I hate how I just spend hours every single day staring at my phone. I just cut off my ex who was my best friend because it's to hard to be friends with her and not be able to express how much I love her anymore but I can't move on like that and I can't live hoping she'll see me in that way again. I also started nofap to kick my 7 year porn addiction.\n\nMy biggest thing is I don't want to look back in regret. I have all these ideas, dreams, and goals but I always struggle to stay on path. I wanted to start a youtube channel that I actually believed in but with covid it put a major hold on the main part of the channel. I want to be something meaningful to someone. I want to be loved by someone where it's drama free and I can just enjoy my time with them. I look at how the world is right now and I really hate the way everything has turned out and it just beats me down. I just want to leave and go somewhere see the world, move to Europe or something and see the world before its all destroyed. \n\nI don't really know what I'm asking I guess if anyone can help me stop being a talker and someone who actually acts. If anyone has any advice or anything to say on this it would be greatly appreciated. I also want to thank anyone who reads this whole thing.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iueqop/need_help_to_grow_up_and_do_better_for_myself/", "title": "Need help to grow up and do better for myself", "social_network": "reddit", "user": "CobraFloyd", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1600327886, "permalink": "/r/DecidingToBeBetter/comments/iueqop/need_help_to_grow_up_and_do_better_for_myself/", "nsfw": false, "first_save": 1635436632.0588806, "replies_charged": false}