{"id": "t5_2tand_t3_isd355", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "So I’m a 26 year old jobless virgin living at home with family. I live in a pretty well off upper middle class family and I was never forced to get a job as a teen and I never needed to work so I didn’t. I just focused on school. I’ve actually had one part time job in my life and it was so minimal I hardly count it as experience. I have a worthless degree in anthropology and student loans that are frozen right now but my parents were helping me pay for. Been graduated for two years and still no career or jobs in sight. The pandemic obviously has made this more difficult than it already was. My parents are high risk. So I haven’t gone anywhere in 5 months. I have no money to my name. \n\nIf you asked me what I want out of life I would say to have my own independent life. To have my own place so I can maybe someday pursue relationships again. That’s the only way I’ll be able to have a relationship again physically, moving out and being away from my high risk parents. Hate to say it but a lot of it is about sex if I’m honest. But also just not wanting to rely on my parents anymore and getting away. \n\nThe problem is that this seems literally impossible. I can’t live here and have a normal job. I would have to isolate myself for two weeks after every time I go out and work. Obviously this isn’t feasible. So my only option is to find a remote job or have a remote career that would allow me to one day save up enough money to move out. In an insanely expensive southern cal city. It feels like even if I did this that it would take years to get this much money! And that I’ll just end up being a virgin into my mid thirties or forties. \n\nI wasted so much time before the pandemic era. I should have planned my life out but I didn’t. I was just taking the easy route and relying on my parents money. And here I am now facing the consequences. Basically I’ll be middle aged before I have a normal adult life, if I ever do. This is so soul crushingly depressing to me. I feel like a complete failure. Embarrassed and pathetic. Self hatred. It’s so depressing that I just try to forget about this reality. Somehow I’ve not smoked weed in five months but I’ll probably start again soon. I drown everything out with tv shows, video games, working out, sports, food, and music, the only stuff keeping me alive at this point.  But there’s times when I’m doing those things and I wonder “is there more?””is this all I’m going to do until I fucking die?”. I know I’m privileged that I’m not starving and that I’m safe from the pandemic and not homeless but I still want my own life someday. \n\nI don’t know what to do. It’s just hopeless.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/isd355/looking_for_someone_to_try_and_give_me_hope_if/", "title": "Looking for someone to try and give me hope, if you dare. And please be brutally honest I need it.", "social_network": "reddit", "user": "st0nervirginsunit3", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 27, "down_vote": 0, "creation": 1600054047, "permalink": "/r/DecidingToBeBetter/comments/isd355/looking_for_someone_to_try_and_give_me_hope_if/", "nsfw": true, "first_save": 1635437847.6870356, "replies_charged": false}