{"id": "t5_2tand_t3_8cnu0v", "request": ["da3e72ac-2059-4c8f-99c6-52edffdec3d2"], "text": "Ahhh, smell the flowers. They truly are wonderful are they not??\n\nI’m sitting here at my laptop, like I have so many times before, yet today something is different.\n\nOften I find myself here, contorting my face into some mask of pain and determination, striving and struggling to accomplish some goal. Something has changed. Maybe I have been broken, my mind relinquishing my fate to the eternal cosmos… yet some part of me knows this is not the case.\n\nI do not want to struggle. I do not want to live in a place of constant discontentedness, always looking for the next big win. Why do so many of us find ourselves in this place? It is not what we are meant for, it is not how we are meant to live.\n\nI am not here to place blame. I am here today to shine a light on a long forgotten corner of our existence. We do not have to be these uber productive creators that so many of us strive to be. It is wonderful to create, it is wonderful to be productive, it is wonderful to be efficient, but isn’t life on it’s own wonderful as well. \n\nCan wonder and joy not arise from simply sitting and watching the world flow around us? I know that it has for me. I saw a hummingbird flying the other day, darting in and out of the maze of vegetation that it knew as it’s home. It knew nothing of struggle. It knew a simple and effortless expression of its nature in one single, continuous flow. It did not know of lack, all it knew was the sweetness of the nectar it drank to it’s heart’s content.\n\nWhy are we not more like the hummingbird, like the butterfly floating effortlessly in the wind?\n\nWhen we decide that we need something, that we are lacking something, our minds automatically activate and begin problem solving. They are quite good at this, it’s own of the reasons our species has progressed so far so fast. However, there is a dark side to this coin. When we do not have any real problems it can lead us into fabricating issues from our imagination to satiate our ravenous appetite for accomplishment.\n\nWhen was the last time you did nothing at all? It is more challenging than you may think. It’s because so many of us have become addicted to striving, to creating, to accomplishing the next task. It has done wonders for our productivity. If you look at what humanity has accomplished in the last decade let alone century it is rather magnificent… but what has it done to our health?\n\nWhat of our emotions, our bodies, the more subtle aspects of our existence. Sure we are “thriving” as a society but how are we doing as individuals?\n\nI am not suggesting that we forsake accomplishments, that we let go of ambition or willingly revert back to the lives that our stone age ancestors lived. All I want is for you to ask the question. Why am I acting this way? Do I need to do this? Is this really what makes me happy?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8cnu0v/in_time_we_all_see_the_truth/", "title": "In Time We All See The Truth", "social_network": "reddit", "user": "ultisquatter", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1523888247, "permalink": "/r/DecidingToBeBetter/comments/8cnu0v/in_time_we_all_see_the_truth/", "nsfw": false, "first_save": 1635438094.9020207, "replies_charged": false}