{"id": "t5_2tand_t3_8017cc", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "/u/improvement-addict,\n\nYou need to grow the fuck up, and you need to grow the fuck up *now.*\n\nLet's start small. You've been in bed for the last twenty-four hours. During that time, all you've managed to do is masturbate. You have a fucking paper due today that you haven't started. You are surrounded by so much fucking clutter -- your kitchen is full of dishes and your clothes are all over the goddamn floor.\n\nYou have books on the shelves that you claim to be interested in, even to yourself, but you haven't fucking read them. I guess they're not as interesting as fucking gifs of scantily-clad women, or some fucking show on netflix. This is a pattern for you. \"I think it would be cool to write a novel.\" \"I'd love to travel.\" \"I want to learn about X.\" \"I want to start meditating/lifting/working/dating again.\" Well, you're fucking lying. If you *wanted* to do any of that, you'd do it. Clearly what you're *really* passionate about is fucking *masturbating.* Clearly what you *really* think is your life calling is sitting in your goddamn bed, doing others the courtesy of pushing them away from you, because at least you know you're a motherfucking goddamn absolute *wretch*. You are the *definition* of akrasia, motherfucker.\n\nYou are such a travesty. A fourth of your life is over, and you've achieved nothing. You've wasted time, money, and resources. You've breathed fucking air and eaten fucking food that could've been used to sustain some normal goddamn people. And your friends? You have a few, technically, but really they're just people you see a lot and are polite to. You've been too lazy to sustain your old friendships. Everyone else has moved on. As time has passed, they've grown up. You haven't. You've sat here and done jack. You're still in fucking college, racking up debt. Most of them are *happy* and *graduated* and *financially independent* and *gainfully employed.* And here you are, rotting.\n\nEvery girl you've ever dated -- or even flirted with, really -- has moved the fuck on. The two that you somehow made your \"girlfriends\" both dumped you after only a few months because you sabotaged the relationship after somehow conning them into thinking you were a fucking person or some shit and not a cynical vegetable. And guess what? They're both *married* now. They're fucking *married,* to attractive, fit, charming, gainfully-employed, and genuinely good men. And here you are, not having been on a real date in over a goddamn year.\n\nYou need to sort yourself the fuck out. You weren't always like this. People considered you to be kind and funny and intelligent and promising. You had friends, genuine friends with whom you shared substantive, mutually-beneficial emotional bonds. You had dreams and energy and you *did things.*\n\nWhat the fuck happened? You did. You did all of this to your goddamn self. This is you fault. You're not a victim. You've had so much shit handed to you on a goddamn silver platter and you've done nothing with it. You were afforded a chance to go to a decent school for an inexpensive price. You were not born into any serious disadvantages. You have parents who loved you. You're not a victim. You're the perpetrator. You might think about killing yourself sometimes, but let's be real. You already have.\n\nSo it's time to bring yourself back from the dead, motherfucker.\n\nDo the whole Jesus Christ Aslan Jon Snow shit.  As soon as you post this, get the fuck out of your bed. Turn off your goddamn phone so that you don't stare at it aimlessly. Take a fucking shower. Make it quick. Get dressed, you know, in clothes, like a person. Maybe turn on some music, but don't spend an ungodly amount of time contemplating the perfect playlist or whatever; it doesn't fucking matter, do you hear me? It doesn't matter. Eat something. All you've had today so far is some noodles. Get some protein. Lentils, with some curry powder, and some brown rice and steamed mixed veggies. Maybe some collard greens. You have all this shit in your fridge, it won't take long.\n\nAnd then fucking get in that flow state and wreck this paper. You have time to hammer it out, and you know exactly what you're  going to write. You can do it. Then, clean up your apartment a bit. Brush your teeth, scrub them. Write a to-do list for tomorrow, so you don't lie in bed aimlessly. Go to bed. It won't feel good. You're used to going to bed at an ungodly hour, but do it anyway. You need to fix your sleep schedule.\n\nDo what you can. You're in therapy. That's great. keep that shit up. If you can do something about any given problem, it shouldn't concern you, because you can fix it. If you can't do anything about any given problem, it shouldn't concern you, because it's out of your control. Change will take time. Be patient. Keep it up. Rome was not rebuilt in a day. And get a fucking job, bro, you have too much time to ruminate and your bank account is anemic. Every building on campus is always hiring custodians, it seems like, so just do it already, *god.*\n\nYours sincerely,\n\nu/improvement-addict", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8017cc/a_letter_to_myself/", "title": "A letter to myself.", "social_network": "reddit", "user": "improvement-addict", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1519522147, "permalink": "/r/DecidingToBeBetter/comments/8017cc/a_letter_to_myself/", "nsfw": false, "first_save": 1635435841.0617442, "replies_charged": false}