{"id": "t5_2tand_t3_puuute", "request": ["eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "It is hard to admit it.\n\nBut I am terrified of actually being better.\n\nIt is really easy to decide to be. But it is really hard to do the work to be. I am afraid I will be boring without my toxicity. I am afraid I won’t attract anyone interesting into my life if I become the boring, sober optimist society wants me to be.\n\nI’m afraid nobody will want to sleep with me. I’m afraid I will lose my edge if I sober up and become a well adjusted adult at 21. I’m afraid I’ll mature too quickly and become a boring old lady, that I will lose my confidence and still hate myself and it will have been for nothing. That I will attract someone safe but boring. That I will never fully be able to be myself if I get better.\n\nI’m afraid if I move out and take ownership of my life, that I’ll remember trauma I don’t want to remember. Im afraid that I won’t recognize myself if I get better. I am so afraid to change.\n\nI want to stay in the cocoon of pain but it’s time to come out and I don’t know who I will transform into. I am scared getting better means I will grow up and give up on my dreams in order to be more responsible even though I know deep down nothing is certain in life; even the most responsible plans go wrong.\n\nI don’t want to lose myself even though it’s what I need. I don’t wanna say goodbye to the me who got through the worst years of my life. And I don’t wanna say hello to the newb who has so much to learn about being a “good person” whatever that means.\n\nI want to do drugs and cut people off.\n\nI am in therapy.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/puuute/it_is_hard_to_admit_this/", "title": "It is hard to admit this", "social_network": "reddit", "user": "z00w33mamma", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1632525536, "permalink": "/r/DecidingToBeBetter/comments/puuute/it_is_hard_to_admit_this/", "nsfw": false, "first_save": 1635437491.61919, "replies_charged": false}