{"id": "t5_2tand_t3_pbq9x1", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "Due to covid and general life happening, most my friends are married and I’m left alone a lot. I’m a extrovert by nature and really need to meet new people. \n\nThis is just one of a few things I need to work on that’s caused me to hit an all time low. It’s been a very hard past few months but especially the few weeks. I’m trying to get out of it and creating a social life again I know will help.\nWhere should I start? I’m 27. Hit the bars like the early 20s again? Where are the communities as adults now that it’s not school. I work in a field that I love but the personnel that work in said field aren’t the type of people I’d associate myself with. Besides 1-2 but everyone is married. Is it unrealistic doing things every week at my age now? \n\nThe feeling and anxiety of not doing social things and sitting at home when I’m not at work is making me insane. It isn’t healthy. \n\nI’m also needing to workout which I’ve never done. I’m skinny and have zero muscle. Any advice on building muscle mass with an apartment complex gym at my disposal would also be appreciated.\n\nAny books from self help to fantasy would also be appreciated. I’ve never been a reader and need more hobbies besides Xbox. \n\nOn that topic what’s some good hobbies to pick up? I need a lifestyle change and I just need help and direction. \n\nI’m also trying to date again for the first time in 5 years…been in a massive dry spell and am super hard on myself for it. \n\nI’m not expecting to get every question to my entire life answered but this is a cry for help. I’ve always been the happy guy making everyone laugh. I don’t know how I got here but it sucks. Been trying to find a therapist also. \n\nI love you all and I appreciate any advice or direction in advance!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pbq9x1/how_do_you_meet_friends_as_an_adult_what_about/", "title": "How do you meet friends as an adult? What about working out for the first time and getting into physical fitness? My life needs changing because I’m depressed.", "social_network": "reddit", "user": "ItsTomFoolery94", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 23, "down_vote": 0, "creation": 1629944818, "permalink": "/r/DecidingToBeBetter/comments/pbq9x1/how_do_you_meet_friends_as_an_adult_what_about/", "nsfw": false, "first_save": 1635435073.8005579, "replies_charged": false}