{"id": "t5_2tand_t3_m0c3zx", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "Many years ago, I found myself in a difficult situation. I had divorced recently and had to support my older son’s mom. I had moved to another city and had to rent a flat. My expenses were relatively high, so I couldn’t afford to earn little. I dreamed about writing books, but the easiest way to make more was to join a commercial firm as a manager – which I eventually did. And it was a long-term mistake.\n\nTo think strategically means evaluating one’s current situation thoroughly and impartially. One should make sure that their reality perception isn’t distorted or biased by money because it happens far too often than we think.\n\nWe all need to earn money to pay for necessities. If you’re a parent, you have to think about your children’s future. We have to take good care of our parents and don’t fall behind on mortgage payments. But, at the same time, we must not betray our fate for the sake of current earnings.\n\nI have seen many people who put the most critical thighs in their life off because they “needed to earn money.” And I was one of them. At some moment in the past, they decided that they would begin doing things they loved (and which they had talents to) “some later.” The problem with “some later” is that it never comes.\n\nAnd do you know what? They weren’t particularly successful in earning money (and neither was I). They were no millionaires or at least rich people. They were working hard, but that work was neither rewarding nor profitable. By contrast, all the successful people – business people, pop or movie stars, football players, etc. – never put their careers off for the sake of mortgage payments. They have their ups and downs, of course. But could you imagine young Cristiano Ronaldo applying for a job in a bank, thinking that he will start playing football “some later”?\n\nNow I earn more as a book’s author and a strategic consultant than I used to while being a CEO. And this job brings me more joy and satisfaction, so I killed two birds with one stone. Look at yourself. Your current position must be a result of your own decisions, and those decisions shouldn’t be distorted by money. I believe that a happy person is not the one who earns more. A happy person enjoys the possibility of doing what their love and being in demand. And very often, it brings more money at the end of the day.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m0c3zx/money_as_a_strategical_distortion/", "title": "Money as a strategical distortion", "social_network": "reddit", "user": "sbiryulin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1615195597, "permalink": "/r/DecidingToBeBetter/comments/m0c3zx/money_as_a_strategical_distortion/", "nsfw": false, "first_save": 1635438118.6638396, "replies_charged": false}