{"id": "t5_2tand_t3_oenfnx", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "For the past few years, I've neglected my body and my health. I'm the most overweight I've ever been, most out of shape I've ever been, and feeling more lethargic than I've ever imagined. All of this is  something I'm deciding to change by adjusting my lifestyle. \n\nNot sure if this is within community guidelines/rules, but I'd like to hold myself accountable by posting an update here every so often until 2022.   \n***Current Weight:*** 270\n\n***Long-Term Goal Weight:*** 200\n\nMuch like a puzzle, my approach to this will be done one piece at a time. If I try to do all-the-things at once... I will likely *(definitely)* slip back into old habits. So, instead of committing to all of these on day one, I am committing to following-through and feeling comfortable within a single area of these sections at a time before moving on.  \n\n99.9% of this is habit and decision making. It's a mental game with physical decisions that have physiological impacts. To keep this in-check, I'll be repeating this affirmation to myself throughout the day. *\"I am a person who makes decisions that improves my health and well-being.\"*  \nMy check-list of things to prioritize. \n\n**Food:** ***I can't outrun my caloric intake***\n\n* Attempting ketogenic + IF + CICO\n* Deleting all food delivery apps \n* Changing my commuter route to avoid typical fast food\n* Using subscription based services to deliver consistent meals + snacks\n* MyFitnessPal for tracking\n\n**Movement:** ***Stress management 101***\n\n* Nightly walks / runs *(Intention is to eat up the clock during the time I'd typically binge eat)*\n* Group weight lifting *(Intention is to have some competitiveness to motivate me)*\n* Outdoors hobbies/activities *(Intention is to replace my social dynamics that were mostly drinking or lunch/dinner based)*\n\n**Sleep:** ***Sleep hygiene is the best hygiene*** (need to research & commit to the certain times in this list)\n\n* No caffeine after a certain time\n* Dinner eaten before a certain time\n* No phone in bed\n* No electronics after a certain time (breaking this one right now...)\n* Not deviating sleep/wake times even on the weekends\n\nHere's to becoming better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oenfnx/time_to_make_my_health_a_priority/", "title": "Time to make my health a priority", "social_network": "reddit", "user": "wtgiom50cttedaetcetc", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1625544668, "permalink": "/r/DecidingToBeBetter/comments/oenfnx/time_to_make_my_health_a_priority/", "nsfw": false, "first_save": 1635438435.962553, "replies_charged": false}