{"id": "t5_2tand_t3_p6dub1", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "TLDR at the bottom\n\nFor some context, I am an 18M who will be going to a medium/large sized college and just graduated high school in May 2021. I move in on August 25th which, from when I'm writing this, is 8 days away. I have always been a good student so there are no issues academically that I'm worried about\n\nBetween about 2019-Feb 2021, I had virtually no close friends, and would spend my time away from school playing video games. I had online social interaction as I was in a very large discord community that all played the same game, and I was part of a \"league\" for this game, so I presume that's what distracted me and almost became my primary world rather than the real world. Because of my huge preoccupation with this video game community, I had put no care into my fashion, appearance, social life, etc. Just grinding school and video games\n\nIn February of 2021 I started having mental health issues/anxiety about my future that basically came out of nowhere. I did a lot of self-reflection about myself, and, while most of it was negative and put me in a very dark place for several months, I am definitely now on the upside as I transition into the next phase of my life. Over the last 4-5 months, I have greatly improved my physical appearance (working out often), fashion/style, and social skills (although I'm still a bit shy, I don't have too much social anxiety as I once did).\n\nOne thing that makes me insecure, however, is my lack of a social life. Given the situation with COVID, I really haven't been able to interact with a lot of people my age on a regular basis since March of 2020, and even then I was barely interacting with people. Between March 2020 to about March 2021, I virtually had no connection with people from my school except during August - October 2020 when I was on my school's golf team.\n\nVirtually the entire summer up until a few days ago, I worked a full-time job. However, my work environment was small, only about 6 of us, and the youngest apart from me was in her mid-20's. While I had a pretty good relationship, and became friends with my co-workers, nothing translated to outside of work and I have not talked to them since my last day last week (I have no way to anyways). I do think this job definitely helped my social skills and reduced my shyness to an extent, but there's still a lot of work I can do in that department. Though, I get that it's pretty normal for someone my age to be shy and awkward.\n\nAlso, this summer, I hung out with some of my friends on four different occasions. During summer 2019 and summer 2020, i pretty much never hung out with friends. I realized that I was not awkward at all among my friends and we could have great conversations and have a great time hanging out. This made me realize that at my core, I'm actually pretty extroverted and love talking to people/hanging out all the time. My shyness and mild social anxiety just kind of holds me back from actively pursuing it.\n\nIn college however, I am pretty grateful to have a fresh start. So far, I have already met a few people through social media, including my roommate, and have had a handful of conversations with them. Though, I still find myself comparing myself to others and feeling bad about myself because I see others on Snapchat hanging out and talking to friends all the time, while I am not, even though I secretly wish I was.\n\nI have also been pretty insecure about my lack of experience with girls and relationships. Prior to the last few months, I probably couldn't hold a conversation with a girl for too long without it being very awkward and me being very shy. However, now I do believe I definitely can as a lot of my anxiety has faded away. Like I said before, I still got work to do, but I've definitely made large leaps from where I used to be and I feel almost like a new person in some regards. Though, i still feel insecure about never having a girlfriend, never having had sex, etc. I had a kiss when I was either 9 or 10 but back then I was just a kid with no real cares or insecurities.\n\nDuring the last few months though, I definitely look a lot better and I know that if I wasn't shy at all, I could definitely attract and get in a relationship. If I had to judge my appearance, just physically, I would probably give myself a 7.5 or 8 out of 10.  \nIf anyone wants, DM me and I can show you before and after pictures of what I look like\n\nSo to summarize, I'm basically just looking for advice on how to break out of my shell and put myself out there in college. I have a really good opportunity and have met a handful of people already through social media and I don't want to mess this up. I know that myself at my core is someone who loves to socialize and talk to people, but I just don't want my shyness or anxiety to hold me back.\n\nTLDR: Former extremely shy, ugly kid who has made large personal growth in the last few months, and is now looking to have a great time at college and have a fun social life, even though they are still a little bit shy and socially anxious", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p6dub1/advice_for_going_to_college_and_putting_myself/", "title": "Advice for going to college and putting myself out there", "social_network": "reddit", "user": "QuestionsForAdvice", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1629238351, "permalink": "/r/DecidingToBeBetter/comments/p6dub1/advice_for_going_to_college_and_putting_myself/", "nsfw": false, "first_save": 1635436459.0097961, "replies_charged": false}