{"id": "t5_2tand_t3_kng632", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "Hi all,\n\nI am posting this to ask for advice on how I can become more confident. \n\nI (20M) am incredibly insecure and have extremely low self-esteem, and have been this way for as long as I can remember.  It would be impossible to provide a complete context for why I might have this issue, but here are a few reasons. I have strong social anxiety and am very awkward in essentially all social situations, and as a result I have had few friends in my life, and have become accustomed to being alone for long periods of time, being the only one without a partner, not knowing anyone at parties, ect... overall just quite lonely. I am used to people not liking me, or at least not finding me sufficiently interesting to pursue a friendship, and these experiences in turn make me even less confident and more afraid of socializing. Another factor is that I've never really been super good at anything, most of the people I hangout with at college have better GPA's than me, or do more clubs or are more accomplished. I have done different activities (instruments, clubs, ect) but although I was decent at these things I have never had the experience of being really good at something, or at least good enough to derive a significant confidence boost from it. It may be relevant that I am gay and asian, and come from a pretty dysfunctional family (divorced parents that still fight all the time) and do not have the best relationship with said parents.\n\nOn a more optimistic note, I really want to become a more confident person, to feel that I have inherent worth, and to believe in myself more. Maybe others have had similar experiences, or can offer any advice that could help me gain in this. The idea of being a confident person just seems like such a distant goal and I don't know where to start in getting there.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kng632/how_to_gain_confidence/", "title": "How to Gain Confidence", "social_network": "reddit", "user": "ineedperspective1", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1609379437, "permalink": "/r/DecidingToBeBetter/comments/kng632/how_to_gain_confidence/", "nsfw": false, "first_save": 1635437609.8185666, "replies_charged": false}