{"id": "t5_2tand_t3_lkreke", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "TLDR: I can’t freaking get myself out of bed. Early morning, midday or afternoon UNLESS I’m sick of being there from feeling sore or having to pee. I’m wondering if anyone else has experienced and/or successfully addressed this issue? \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nHi guys, I’m writing here cos I feel like my drive to solve this problem is seriously weaning. I know for a fact it has been holding me back from reaching my full potential in life. my efforts have also taken a hit from the combo of COVID quarantine and the lack of daylight in my area.\n\nHave any of you deal with this? Have you found any successful strategies? I wasn’t expecting this post to be so long— thanks if you do read it. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nMy issue for years has been that I can’t freaking pry myself from bed when needed. Initially, thought this was because of early mornings, but I have had the same issue if I have to be somewhere at 8am, 12pm or 3pm. I do have early shifts and find I actually enjoy mornings bc they’re quiet and I feel like I’ve accomplished so much by midday. They’ve somewhat lost their allure in the dark winter and quarantine.  \n\nIt’s hard for me to articulate— I feel like my brain is in a whole other realm when I wake. It’s a tug of war between the want to be better and the comfort of avoidance. It seems like the most simple thing to me when I am feeling lucid, but far from it when time comes to actually doing it. I’m not sure if I’ve ever had so much trouble with anything else in my life.\n\n**Why I do it (I think):**\n\n* I didn’t grow up with any particular sleep routine to be honest. Only was forced out of bed for school, church or anything else my parents deemed important. I would stay up as late as I wanted if I said it was for school. Otherwise, I would stay in bed as long as possible. As I got older, my parents had less control over me and I stayed in bed more. \n* I wasn’t exactly raised to self motivate or think for myself. I grew up with a pretty overbearing parent who often used comparison and disappointing others as reasons for action. Now that i have much more control over my life, I’m frustrated that I’m not finding success fixing any shortcomings from my upbringing.\n* I did not grow up with proper time management. It’s rampant though my household and my personal responsibilities. finding sneaky ways to lie to myself to enable procrastination is also a thing for me. \n* I am depressed or recovering from depression not really sure what to call it but whatever. Sleeping/ chilling in bed longer (like a whole day or days at a time) is typical of my episodes. I have suspected I had adhd in the past year, but my doc didn’t seem too into the idea of that rabbit hole. She dismissed it so I gathered I might’ve just used the internet for confirmation bias? I dunno if it is worth pursuing. \n* One of my vices is escapism via sleep. I’m 27 now, I think I realized I was doing this around 24-25. When I’m not particularly in a depressive state, I find it hard to even break the habit I maintained while depressed. \n* I could be avoiding parts of life I don’t want but I’ve even had this be an issue for things I’m excited to do. \n* i always feel tired and/ or low energy. I’m assuming this is because of a lack of quality sleep. \n\n**Resources I have tried:** \n\n* Advice from my therapist: make a schedule/ plan (waking me just shuffles tasks later in the day or or gored tasks and gives up when it’s too late), meditation before bed and waking up\n* Advice from my doctor: practicing sleep hygiene, avoiding caffeine \n* Advice from internet: take melatonin; use motivation from nice toiletries, food, etc to excite you to get out of bed\n* spoke to friends, nobody can really relate. they do encourage me when I talk about it, but I pretty much have the same disappointing news when they ask. \n\n**Things that have helped in the past, but not consistently and/or don’t help anymore:**\n\n* Cutting down (or out) alcohol and pot. I find the former makes me anxious for a few days, the latter makes me sleep more/ more lazy. I avoid avoid it for the most part (specifically because of this) but admittedly have used either/ both after downplaying their impacts. I don’t recognize it’s happening until it’s happening or after I emerge from the post substance fog. \n* Mediation— helps with being aware of thoughts \n* Knowing (external) repercussions — letting people down, losing job, it’s officially last minute, note: its effect on me (ex: my health, my self esteem, $ wasted on last minute ubers to make up for lost time) don’t seem to be enough of a repercussion for me. \n* Light alarm/ timed light/ loud alarm/ fading or soft sounding alarm— I snooze and go back tiger until absolute last min. Or just sleep with the light on (I can sleep in almost any setting tbh). \n* Exercise in the evenings— it seems to be the only time I’ll actually do it so I went with it. Having a place to be a tu I’ve in the gym helped with my motivation, but COVID. I’m back to square one on that front now. \n* I sleep while listening to things. I live in a hectic household, so I’ll put on a documentary or podcast or something to focus on. This sometimes leads to me browsing on my phone/ being distracted. \n* Sleeping masks definitely helped with sleep hygiene, but the getting out of bed problem persisted \n* Changing my environment: I’m actually house sitting at the moment and am even more frustrated bc I’m having the same issue even outside my household. It has worked in past when I don’t want to expose my sleep Habits to someone else. \n* putting a clock/ alarm far away— I get up and turn it off or snooze and go back to bed\n* having someone call me— I answer and sound alive so they’re impressed and then I go back to sleep\n* Drinking water first thing in the morning \n* Using a bring/ seasonal effective disorder lamp (yes, I’ve even fallen asleep with one of them in my face wtf)\n\nDoes this seem like a discipline or motivation thing? Maybe I’m suck in a victim/ non proactive/ lazy mentality? A brain thing? I’m honestly at a loss. I’ve found my morning self going SO far to undermine all the effort my lucid self puts in to set up an easier time leaving my bed. \n\nI sometimes think I am over complicating a simple part of everyday life and it’s just a matter of “doing it”. The problem is, why haven’t I then??? And why have I been consciously struggling with it for so long? \n\n**\\*\\*where I think I could tangibly improve but maybe need a kick in the ass to do so?\\*\\***\n\nI have noticed in quarantine is that I’ll wake up hours before I’m supposed to be/ or wanted to be awake (3-4 am, planned for 7 or 6-7am, but planned for 9) and I feel somewhat in my right mind. i’ll go back to sleep to get the extra sleep or without even looking at the time because it’s still dark out. From there, I’ll start another sleep cycle until 1, 2, 3 pm. Then I’ll wake up late, feel stupid and then just stay in bed defeated. Or will maybe get out but feel bad the rest of the day. \n\nIf I do wake up shortly before when I’m supposed to be up, I’ll chill in bed or get distracted somehow (admittedly with my phone) and then fall asleep again. I thought about j just starting my day at whatever time I wake up. But again, enforcing something just “for me” hasn’t been successful for me much. I often go back to sleep telling myself I don’t NEED to be up for any responsibilities and abandon any want for a functional schedule.\n\nI’m desperate for anything at this point. If you read any of the above, THANKS. Pls let me know if you can relate and/or can help me out. \n\nMuch thanks", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lkreke/frustration_re_sleep_habits_establishing_routines/", "title": "frustration re: sleep habits, establishing routines, action motivation", "social_network": "reddit", "user": "throawybitvh", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1613435500, "permalink": "/r/DecidingToBeBetter/comments/lkreke/frustration_re_sleep_habits_establishing_routines/", "nsfw": false, "first_save": 1635438250.4336991, "replies_charged": false}