{"id": "t5_2tand_t3_9k5yy8", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "Hi everyone, thanks for taking the time to read my post.\n\nI'm 20 years old. I recently went through my first relationship and consequential break up over the last few months. The relationship itself ended roughly 3 months ago, and I ignored my ex-girlfriends calls and texts about 3 weeks ago. If you'd like to have a feel of the riveting tail, please check my post history as I have gone into depth about it.\n\nBasically, I was madly in love and suffered a very deep betrayal when the relationship ended. In the relationship, I flourished like I never thought I could - I got over alot of anxieties about myself, physically and mentally. All my friends had relationships before me and it felt like I missed a step in growing up. I always felt spoon fed, sheltered - but when I finally got to experience a relationship, a girl being in love with me for me, it gave me an amazing boost of confidence and self contentment that made me think; \"Hey, I know I always told myself I was enough... but now I actually believe it!\". I got to be intimate and have sex with someone I loved for the first time (lost virginity). I suddenly went from a 20 year old kid that was content playing games all the time to driving across the city (by myself, in my own car for the first time) to stay over my girlfriends house. Everything was new, and exciting. I was loved and I loved. It was fantastic.\n\nHowever, that's obviously all ended. Consequently, it feels like all my self worth died with the relationship, and I've been feeling quite aimless ever since. Like everything I have done has been to patch up the hole that's been in my chest for the months following my heart break.\n\nThe first few weeks after the break up, I tried to write up a list of things I wanted to do - these included joining sports clubs at my university, reading books, going out with my friends alot etc. And suprisingly, I did indeed do alot of those things, however it never really felt like I was doing them for the right reasons. I was reading my books but I wasn't really soaking it all up as I was trying not to think about my heart ache. I was hanging out with my friends but my only goal was to spend as little time alone as possible so my mind doesn't attack me with thoughts of my ex and how I was dumped. I joined that sports team but didn't actually go to any training sessions yet, even though I signed up. In retrospect, I think I tried to do too much too quickly to patch up the hole, but it was very temporary.\n\nIt's been some time now, and the dust is settling. I still obviously am heartbroken, I feel deeply emotional damaged, like I'm mentally dazed. But, as naturally time passes I'm starting to feel comfterable with myself again.\n\nHowever, I'd like to make some serious changes. I don't want to feel sorry for myself anymore. I want to set goals and attain them. I don't want to remain stagnant. I want to now focus on becoming the best possible version of myself without any brain fog. I tried to incorporate some habits previously but it really felt like I was taking shots in the dark mere weeks after my heart was broken. Now that I have some more clarity and time, I'd like to become the best version of me!\n\nApologies if it's a very vague question (and thank you to those who have read this far, really), but I'm truly at a loss as to where to begin. I want to make changes to my life, but I'm unsure where to start. Should I sit down and try to formulate goals to achieve? This may be an immature mindset, but I want to be the person that if my ex were to ever see me, I want her to think \"Wow, I knew I'd regret letting go of that.\"\n\nI've finally stopped feeling like a child, I feel like I'm becoming an adult with the experience of a relationship under my belt. I had no idea the power of relationships, that I was even worthy of being in one, of being loved.. I no longer feel inferior to my friends, and I finally have let go of the depressing life style of staying home, being scared of being vulnerable and playing games. I want to DO things, gain responsibilities, meet people and experience more of this world I neglected when I just stayed home all the time.\n\nSorry if I was too vague, any help would be more than appreciated.\n\nThanks for taking the time to read and I hope you all have a great day.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9k5yy8/where_and_how_do_i_start/", "title": "Where, and how do I start?", "social_network": "reddit", "user": "sadboy07", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1538310167, "permalink": "/r/DecidingToBeBetter/comments/9k5yy8/where_and_how_do_i_start/", "nsfw": false, "first_save": 1635436551.4655051, "replies_charged": false}