{"id": "t5_2tand_t3_blqu13", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "Hi, I'm most probably a neurotic who just won the long-lasting fight with my social anxiety. Now I'm much more open and fun to be around, but I'm still not the man I want to be. I'm 17 and have so many problems with my emotions. \n\nMy best friend is a saint when it comes to many things. She's very open and fun, but also calm, quiet and patient. Me on the other hand... I am often loud and eccentric and I do not like it at all. I think that's because in the past I felt really alone and had to be quiet, and now when I finally found people who like and accept me I want to share everything with them, and I'm constantly talking. It does not annoy them because I actually try to make stuff I say interesting, but sometimes it still feels forced and like it's \"too much\". Nobody told me that I should shut up or something, but it's something that I don't like about myself and this isn't someone I want to be anymore. I am really jealous of my friend who is very calm, can manage all her emotions on her own (I am very dependent on others and hate that) and just seems so quiet and calm, but in the best way possible. I'm an introvert, but because I don't get my social needs fulfilled on everyday basis (pretty weird family situation, living in a small town with all my friends living something like 40km away from me, spending most of the time alone) when I get the opportunity, I just talk, talk and talk without an end. I wasn't like that in the past when most of my friends where living close, but now I do. \n\nI hate stealing spotlight from others and then feeling bad after realizing what I just did,  (even though they don't mind, or at least they say they don't because I often ask them if they are feeling alright when I do some asshole-ish stuff like that) acting very emotionally (gesticulating, raising my voice when telling something that is important, or other stuff like that) \n\nMy emotions also make me unable to work sometimes, because recently they became very unstable. One time I'm overly depressed, and the other time I'm getting very happy and excited. I can spend the whole day on the couch because I don't feel like doing anything (even if there's something super important) just to feel bad about it during the next day/evening. \n\nI'm constantly comparing myself to others and I'm not feeling happy about myself, even though I somehow achieved more than anyone my age (I made some short films, I have a radio audition every week, I still have the MOST AMAZING AND GREAT best friend that anyone could wish for, I've been in a pretty good relationship, I have a good, big friends group with mature and fun people that I go out with many times a week, etc.) \n\nI just feel that that's who I want to be. I'm being noticeable and just maaaaybe fun around others, but shit, I often feel bad and awkward afterwards. I don't remember this feelings after more serious and mature meetings... And I want to have it back. I would love to occupy my mind with work, not being lazy, having the motivation to change and go forward and also become the calm, but fun and interesting person that I want to be. Sadly, my best friend couldn't tell me how to achieve it, because that's just the way she is her whole life. But I'm only 17 and I want to take my shot now and change myself into someone I am happy with. And there's no better time than now. \n\nMy obsessive thoughts, neurotic behavior and bad self-esteem must go. But the most important thing to me is just becoming... Calm. I want to take care of myself, be happy with who I am. And I don't know how to achieve it. I don't want to accept my nervous, neurotic me. I want him to go. Because it's not something I'm happy with and I know that I can still change just to not waste my life. \n\nPlease, can you give me some advice on how I can achieve what I want?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/blqu13/how_to_be_more_calm_and_get_rid_of_my_neurotic/", "title": "How to be more calm and get rid of my neurotic tendencies?", "social_network": "reddit", "user": "pietro5000pp", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1557236422, "permalink": "/r/DecidingToBeBetter/comments/blqu13/how_to_be_more_calm_and_get_rid_of_my_neurotic/", "nsfw": false, "first_save": 1635435801.3847632, "replies_charged": false}