{"id": "t5_2tand_t3_iv4eh0", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Tw: metions of suicide\n\nAlso sorry if the story looks messy. I am on mobile. I got some story time that I want to share with you in hopes that it will inspire some of you and also because I want to celebrate my progress. An early thank you for having the patience to read.\n\n2019 was to me as 2020 is for the rest of the world. My father got hospitalized for trying to commit suicide, my mother found out she has cancer, my toxic boyfriend of 5 years checked out of the relationship and we broke up, I got depressed and gained 40lbs, I started drinking myself numb and got fired for being drunk at work, failed 4 out of 5 final exams in uni and almost killed myself as well. All happened as I was stuck in a college dorm room. All alone.\n\nFebruary 2020, just as COVID hit, I decided I cannot take it anymore. A friend of mine put me in touch with an old acquaintance of mine after a few failed Tinder flings and we went out. He was a great guy, but I was a piece of shit, insomniac, depressed, panic attack queen and I didn't want someone else to be dragged into this crap.\n\nLittle did I know that the next 6 months will be the best of my life and that he will be the best thing in my life. This is not a story about a guy saving a damsel in distress, this is a story about how mental health can benefit when the proper social support is offered. He never shielded me from anything, he just walked me through all the shit I had to deal with in this dark cold place in my mind.\n\nI remember riding the train, mask already on, forehead on the train window, trying not to cough (in March), face full with tears as I finally took the decision to move in with him and his family. It was new and strange but also exciting (a feeling I didn't have in a long time).\n\nI went into therapy. I lost 15lbs so far. We travelled, watched the stars, did field work together, admired the sunrise on the tractor. I passed all my exams in my second semester and got into a training program. I eat clean (veggies from my own and mil's garden) and I run 30km/week with my friend every evening.\n\nEvery morning I get out the house I take a second to feel the soft grass under my feet and I cannot even begin to put into words how alive and blessed I feel.\n\nI am planning on working on my career for now and soon enough we are going to get married and jump into TTC phase as we are both going to be in late 20s/early 30s by that time. finally feeling like everything is into place. I am still into therapy as there are still day to day issues I deal with and I am still trying to further explore myself.\n\nAlso my mother is getting treatment but she is kind of cancer free for now and my father got a new car after retiring (apparently, his depression vanished once he retired as it was the biggest source of stress).\n\nI still have a lot to achieve but I am a million lightyears away from where I was in the beginning of this year.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iv4eh0/2019_was_my_2020_and_now_i_am_thriving/", "title": "2019 was my 2020 and now I am thriving", "social_network": "reddit", "user": "hejmonikahej", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 26, "down_vote": 0, "creation": 1600428992, "permalink": "/r/DecidingToBeBetter/comments/iv4eh0/2019_was_my_2020_and_now_i_am_thriving/", "nsfw": false, "first_save": 1635438260.5716205, "replies_charged": false}