{"id": "t5_2tand_t3_pno9qm", "request": ["18281d65-fa68-4991-a4a1-8f37346818f3"], "text": "When I enrolled in community college over the summer, I thought that I would hate it. I think I bought into the conventional wisdom that community colleges are dumps filled with lackluster classes and dumb students. And maybe this copium on my part, but I’m four weeks in and think that it’s pretty great so far. I actually like all my classes, there are a couple of classes that I actually look forward to. All my professors are nice, and most importantly really good at teaching. And the fellow students that I have class with are far from dumb, a lot of them are really smart interesting people. \n\nThat doesn’t mean that I’m exactly happy to be here. I’m regretful about the circumstances that landed me at a CC instead of the four year university I was at before. I liked it there, and I felt like I was getting a good education. It wasn’t Harvard or anything, but I felt like it was a good school, for what’s worth the rankings put it around Oklahoma, Tulsa, Nebraska, Kentucky, and Colorado State. I don’t think the CC stigma is correct, but I understand why it exists. Most people going onto college(including me)want the classic college experience of parties, football/basketball games, etc. And it’s hard to feel completely good about going to your hometown CC across from the Red Robin while the people you went to high school with are living it up in Austin, Lawrence, Boston, etc. \n\nBut you know, everyday is a new day. I have to try to make the best of this circumstance, and I think I am so far. I have turned in all my assignments on time, and I’ve only missed two classes(and I didn’t ditch on purpose).", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pno9qm/i_think_i_actually_like_community_college/", "title": "I think I actually like community college.", "social_network": "reddit", "user": "Tannercheck", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 395, "down_vote": 0, "creation": 1631566702, "permalink": "/r/DecidingToBeBetter/comments/pno9qm/i_think_i_actually_like_community_college/", "nsfw": false, "first_save": 1635437107.6597867, "replies_charged": false}