{"id": "t5_2tand_t3_mi3a63", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": " This is probably a relatively frequent post, sorry.\n\nSelf-discipline and work ethic are—in my estimation—some of the most important skills/abilities to have. Recently, many of the things that I should do, and could do, I don't do. If I *need* to do something, I will do it, but if it is not a necessity—such as doing things that get me closer to goals, or important things that are not urgent, like showering frequently—It is not likely to get done. This is a relatively common problem, so I initially assumed that a followable solution would have been found. Unfortunately, this is not the case. The best solution I have found is fairly simple: \"do the work, regardless of whether or not you want to. The only thing you can control is your mind, so make the choice to work.\" I am not particularly fond of this answer, but nobody really is. I suppose it does have advantages.\n\nThe other thing I found was something along the lines of, \"find a good reason.\" This is a much more like able answer, but it is not as easy as it sounds (for me, at least). Many of the examples provided appeared to require deep emotional foundation. Unfortunately, I do not have a deep emotional connection to the goals I have. They are things I would like to achieve (and some of them are relatively important), but the ones I am currently focused on (most of which are about school) I cannot \"find a good reason.\"\n\nAt this point I am attempting to go with the, \"just do it,\" option, but I am desperate for help.  \nIf anybody, presumably with more life experience, would be willing to offer advice, that would be greatly appreciated. If there is anything I need to elaborate on, I will do my best to do.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mi3a63/i_want_to_be_more_disciplined_just_maybe_not_as/", "title": "I want to be more disciplined, just maybe not as much as I would like to not do that... I dont know what to do.", "social_network": "reddit", "user": "OlinSina", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1617306172, "permalink": "/r/DecidingToBeBetter/comments/mi3a63/i_want_to_be_more_disciplined_just_maybe_not_as/", "nsfw": false, "first_save": 1635435168.0912273, "replies_charged": false}