{"id": "t5_2tand_t3_q6bazr", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "b69cf201-6737-4217-b486-9096135546b8", "18281d65-fa68-4991-a4a1-8f37346818f3"], "text": "I have known for a long time that I have great difficulty voicing my opinions. Except around immediate family, I usually don't even attempt it. I tend to be a go-with-the-flow person, mostly in a negative way. I deny myself and others of my true beliefs & desires.\n\nIn addition to this, I have great difficulty expressing my feelings. I bury everything that bothers me. This has led to me lying & manipulating situations. I avoid saying what I feel at all costs when it is difficult to do so. I make assumptions about how people around me will react to what I have to say & I evade the truth to avoid those reactions. \n\nBecause I don't have the confidence to voice my true opinions & feelings, I allow myself to be a doormat. When things get tough, I don't stand up for myself or others.\n\nAs a result of those weaknesses, I am far too comfortable lying (mostly by omission). I used to see all the little lies I would tell as harmless. I would use omissions of truth to protect myself from being challenged or confronted (a situation that would cause me to fold myself down into the aforementioned doormat person!). I am now learning that there are no harmless lies in a close relationship - friendship, romantic, familial, whatever. I have the capacity to hurt people I love.\n\nI need to stop hiding my true self. I will never be happy & never be able to truly connect with another person if I don't start being honest.\n\nI am a people pleaser. I am a passive person. I can be a passively aggressive person.\n\nI have a friend who has said multiple times to other people about me, \"She is the nicest person I know.\" \n\nI want to be kind & giving, but not like this. This is fake as hell & rooted in fear, not compassion.\n\n\n\nNote:\nI am a perfectionist (another thing to work on...!), so please take what I've written with a grain of salt. Understand that I am very hard on myself & I may make things out to be more extreme than they are. I beat myself up & it gets me nowhere.\n\nI am also having a rough day. I am feeling mildly depressed overall.\n\nRegardless, I think what I said above still stands. I need to stop myself in my tracks when I am tempted to hide something.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q6bazr/i_need_to_take_charge_of_my_life_i_need_to_be/", "title": "I need to take charge of my life. I need to be direct with people.", "social_network": "reddit", "user": "eirracarrie", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 27, "down_vote": 0, "creation": 1634003488, "permalink": "/r/DecidingToBeBetter/comments/q6bazr/i_need_to_take_charge_of_my_life_i_need_to_be/", "nsfw": false, "first_save": 1635435962.7640462, "replies_charged": false}