{"id": "t5_2tand_t3_mrzvn0", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed", "0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "These are some of the things I used to go through on a daily basis a while ago. If you\n\nsomehow resonate with them, this post might be helpful.\n\nTo some extent, I think we all have experienced high procrastinatory times with low levels of motivation but when your days are defined by that, a change is required. Lack of desire to actively take part in our own life might have been highlighted by feelings of emptiness every morning when waking up or constant moods of boredom and stress. Some, including myself, have experienced a lack of security which at times affects your self-esteem and trust in other people, peers even best friends of the family.\n\nNot being able to see opportunities anywhere combined with the need to work on something but when coming down to what you can't figure it out. You feel like you don't want to waste time doing something you are not sure would work out the way you wanted to. This is strongly related to a serious lack of leadership and control over your own actions, maybe even feeling purposeless. You have a broad idea about what you want to do or about how to do something but the lack of means and details keeps your entire mojo down. Not seeing an end result is what you are doing can really kill your energy. :(\n\nAll of these states, if left unchanged, could have a devastating effect in time, with you not even realizing it. It is dangerous because it can, in some cases, evolve into chronic depression or even avolition, which is a total lack of motivation that makes it hard to get anything done. You can't start or finish even simple, everyday tasks. \n\nThe good news is that these are all in your control and it can be your choice to strengthen the grip on your own behavior.\n\nStep One - PRIORITIES\n\nIt all starts with knowing what your top priorities are in life. Mastering prioritization can change your life. Knowing your priorities reduces stress, helps you focus, improves productivity and time management, and even helps with work-life balance as you create better boundaries between goals. \n\nIn defining your priorities, first, you somehow need to have a vision for your life. Not a goal, but a vision. There is a major distinction between these two and most people do not know about it. The most important aspect of your life is the VISION. It is how you perceive life, it is what you see yourself like. That is the direction your life should go ( don't worry, I have an example ). GOALS, on the other hand, are actions/tools which are always, and I must emphasize this, ALWAYS set by you to help pave the road towards that unique vision. The goals set by you become your top priorities. Some of these goals might not be so pleasant but are necessary steps that compose your vision.\n\nExample of a vision: \"Having a healthy body and looking good, so I can be an example to others. Being able to travel, and help others, while constantly learning and improving myself. Not being grounded by anything.\" \n\nThis goal prioritization is somehow simple if you parallel it to some common daily routine ( Brushing teeth three times a day - to have healthy teeth in the future ) \\~ ( Doing 3h of that copywriting course - to one day profit from being able to do copywriting ). And from here you can go in-depth into the \"how\" of that action. \n\nStep Two - ITERATION and GRATIFICATION\n\nWe all know that the shortest distance between point A and B is a very straight line -------- right? Right, in math. When you are dealing with life events and \"distances\", there will never be a straightforward way to achieving something, but our mind tends to complicate it too much sometimes. That is why we need ITERATION on our road towards reaching a certain goal. Since our \"straight line\" from A to B will in fact be a very zig-zagged one, breaking down the bigger goal into smaller tangible, even daily, mini-goals that will subside to the end result, will keep us motivated. \n\nThere is an understandable need for feelings of fulfillment in our lives and for some even on a daily basis. Of course, motivation won't be present in us all the time, but the thought of and the reason why we are doing something should keep us going in those times. That is why mini-goals are important. \n\nHumans are, at least to some extent, driven by the desire to experience pleasure, immediately and as soon as possible. This \"crave\" constructs sometimes, one of the most relevant reasons for our absence of motivation. \n\nInstant GRATIFICATION is one of the most basic drives inherent in humans — the tendency to see pleasure and avoid pain. This tendency is known as the pleasure principle. This is highly linked to: \n\n\\- Imagination ( envision your desired future if you forego your current desire ) \n\n\\- Cognitive Capacity ( higher intelligence is linked to a more forward-thinking perspective ) -  seeing benefits in the long run - DELAYED GRATIFICATION\n\n\\- Impulsiveness ( being more spontaneous is making delayed gratification much more difficult )\n\n\\- Emotional distress / Mood\n\nBy practicing delayed gratification and being able to see the benefits of those little iterations of your main goal you could keep yourself motivated during the journey. In most cases, success comes only after 60% or even more of the goal's total percentage is surpassed. Aa a short example, imagine you want to lose some weight. Of course that in the first 2-3 weeks there won't be any significant change, but after a period of constant working towards that, from any angle possible ( daily exercise, diet, proper rest, etc ), you will observe a drastic change compared to baseline.\n\nIf this was helpful or at least motivated you to try and find more about how to get out of that loop, I can post the second part also when it is finished. :)\n\nI'll leave you with some of my favorite sources for self-improvement and growth: \"Atomic Habits - James Clear\", \"Maps of Meaning - The Architecture of Belief - Jordan B. Belfort\", \"Beyond Order - 12 more rules for life - Jordan B. Peterson\", \"Man's search for meaning - Viktor Frankl\"\n\nTo be continued...", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mrzvn0/tweaking_your_motivation_stop_lying_to_yourself_4/", "title": "Tweaking your motivation - Stop lying to yourself [ 4 STEPS GUIDE ] - PART I", "social_network": "reddit", "user": "RandomRealLife", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1618566657, "permalink": "/r/DecidingToBeBetter/comments/mrzvn0/tweaking_your_motivation_stop_lying_to_yourself_4/", "nsfw": false, "first_save": 1635437672.1704133, "replies_charged": false}