{"id": "t5_2tand_t3_5z25s1", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "I uprooted my life for a man who was cheating on me the whole relationship...but now I was offered a full-time position in that city. \n\nI'll keep it short. We dated long distance for two years. I moved to his city and we lived together for half a year. I found out he was emotionally cheating on me periodically throughout our relationship. I immediately packed my bags and ended things which I believe was the right decision. I was debating staying and finishing a 2 month contract job but I rather impulsively decided in that moment to just move back to a bigger city and start all over. However, as soon as I get to the bigger city my boss from the contract job calls to offer me a full-time permanent position with the company with good pay and benefits if I come back. \n\nWhen I was still blissfully unaware of all of this I had been searching for a job for 8 months in said city but could only land short temp jobs. As anyone knows when trying to find a job it is extremely hard on your ego being rejected over and over as well as not having financial stability or security. I don't believe that my resume is very strong as I graduated in 2014 with only 2 years of working experience. Living in the bigger city is definitely a risk because it could take me a long time to find something, plus the anxiety of not earning money. It could take me anywhere from 2-4 months to find a new job. \nLuckily, I'd have a couch to crash on until I get back on my feet where I don't have to pay rent. More of my friends and family are in the big city so it would be easier to move on and heal. So I'll lay the options out: \n\n1) Stay \n\nPros: I have a full-time permanent job with a decent salary, benefits, vacation etc. I have a car, found a cheap place to live with roommates. I have a few friends that can support me through the healing process, more experience on resume plus references\n\nCons: Anxiety of running into ex, everything reminds me of him, far from family, not my dream job\n\n2) Go\n\nPros: Big city = more opportunities, Close to family and friends, Easier to move on in a different environment, Won't have to pay rent till I find a job, lots of distractions\n\nCons: No financial stability, couch crasher till I find a job, massive competition\n\nShould I stick it out in this city for another year to gain more experience on my resume and save up OR should I start from scratch in the bigger city? \n\nTLDR: I uprooted to a new city for a relationship which ended badly. I was offered a full-time position in that city but I do not know if I should take it or start from scratch in a bigger city. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/5z25s1/should_i_stay_or_should_i_go_logical_vs_emotional/", "title": "Should I stay or should I go? Logical vs. Emotional dilemma", "social_network": "reddit", "user": "newdirection647", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1489366606, "permalink": "/r/DecidingToBeBetter/comments/5z25s1/should_i_stay_or_should_i_go_logical_vs_emotional/", "nsfw": false, "first_save": 1635435658.6279695, "replies_charged": false}