{"id": "t5_2tand_t3_omzllh", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "After going to therapy and doing a lot of self work and shadow work, I’ve come to realize what people have been telling me the whole time:\nYou control how you feel.\nIf you have a problem with yourself, change it.\nI can’t let the past stop me from making a better future for myself. \n\nI’ve been pretty heavy and sad most of my life. As of now I am the smallest and happiest I’ve ever been. I’m doing so many things I’ve only dreamt of doing: Being consistent with the gym, my eating habits, and not having people who uplift me around me anymore. \nI’m not at my goal as far as where I want to be, but for some reason, as I was at the gym today, I just had this flooding feeling of anxiety behind it all. “Who will I turn into?” “Will people be genuine to me once I’ve changed?” “Will interactions with new people need to be met with much more caution?” \n\nI’m happy I’m bettering myself, but I guess I feel nervous about how the world will see me now. I’m no longer the girl who needs to hide behind big, baggy clothes, and yet, what kind of people would I attract into my life like that? Would they have accepted me when I was bigger? Depressed? Im a pretty intelligent, open minded girl, i attract a lot of people and people feel the need to vent to me and feel i have good energy.\nBut i don’t want that part of me to be taken advantage of, not anymore. And i won’t let it be. Maybe these are the growing pains I’m experiencing. But i don’t want to also turn into a person that rejects interaction because I’m so cautious and traumatized. \n\nAh, growing pains.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/omzllh/anxiety_because_im_turning_into_a_person_ive/", "title": "Anxiety because I’m turning into a person I’ve never been before", "social_network": "reddit", "user": "Indigochairudo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1626643043, "permalink": "/r/DecidingToBeBetter/comments/omzllh/anxiety_because_im_turning_into_a_person_ive/", "nsfw": false, "first_save": 1635435147.2204685, "replies_charged": false}