{"id": "t5_2tand_t3_o497po", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I’m going by this motto, pardon the lack of a better word. Not really a motto but this is what I’m founding my routine on at the moment. There’s purpose and objectives and that’s new to me. I know it’s good and it is why I keep going no matter how I’m perceived by my circle. \nI’ve been jobless for months, barely making ends meet with my freelancing gigs but never in my life have I felt more progress in the care of my soul and body than have seen in the recent months. Never have I felt better just overall to put it simply, and I’m no superlative over-user.  That’s it for context. \nLet’s dive into what made me come and write this here: less is more as the title states. There could be much better ways to sum it up but that’s the one that resonates with me. For a month orso now, I started depriving myself of the many numbing habits that so many of us got swayed in so unconsciously. Let me  enumerate a few that to me, seemed to be the most harmful: social media, daily time spent staring at a screen, lack of mobility, lack of being outside, bad diet, excessive masturbation/porn/dating apps, smoking cigs, binge-watching, lack of socializing ... the list goes on perpetually the more you think, even those you didn’t necessarily engage in in your lifetime. \nThe numbing I was talking about is one hell of a snake, it welcomes itself in your life without you realizing it and silently makes bigger and bigger room for itself in it. \nNow, how does it manifest ? Obviously all of the depressing characteristics that one might experience in a lifetime will become your daily companions. Many more aspects of the person you are will also take a hit. Fear and insecurities, as blind or denying you are about them, they’re there and those fuckers multiply like a fucking ant colony. \nYou know what this does ? This brings me to my 4th point and that’s the mf ONE : It separates you from your soul man and there’s very little that can beat this helluva tragedy. The soul is one of the two most precious things we’re equipped with from the day we’re born and you better not mess with these guys cause they sure will fucking beat you to death.  The irony of it is that they’re the best buddies you could ever have as long as you take care of em. \nYou see, this is barely  taught man expect for the ones who have been lucky enough to be educated on this by some wise ass around them in their early age. Yup. I would rather think of what  beauty is a kid capable of if he or she if the message gets through from their young age. Obviously, there are ones out there who took less beating from life but I wonder where their energies have directed themselves into doing. Idk might be getting lost here but can’t blame a kid for being curious right.\n\nBack to the actions that needs to be retained from this post right here. Feel like some things mentioned resonate with your experience current or past or whatever? If you were able to think of a few or even if its just one that you can relate to from the list of things enunerated earlier that numbs your soul ? Fucking quit whatever bad habit that is and see yourself making better use of that time you freed up, whatever it is. I’m sure you can think of a gazillion good things you can do. Buckle up ! \n\n💪🏼💪🏼💪🏼❤️", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o497po/1111_less_is_more/", "title": "11:11 less is more", "social_network": "reddit", "user": "BOUMAIL", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1624206119, "permalink": "/r/DecidingToBeBetter/comments/o497po/1111_less_is_more/", "nsfw": false, "first_save": 1635438339.8925278, "replies_charged": false}