{"id": "t5_2tand_t3_3ecbgw", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "EDIT: I'm putting this edit right on top, so folks can see. I just wanted to say THANK YOU to every single person who commented on here. I can't really express over the internet how much everything you guys said has helped me already. I posted this without really expecting any replies, I did it just because I was at a very low point, and I was so extremely dissatisfied with my life. But the amount of support I got from completely random people is incredibly overwhelming. Thank you so much for this, whoever is seeing this. Thank you so, so very much. \n\n&nbsp;\n\nI'm 25. I have achieved nothing significant in these 25 years. Other than not dying, of course, but then again 7 billion or so people have also done that, so it's nothing special. \n\n&nbsp;\n\nWhen I was around 12 or 13, I saw my cousin playing around on a PC, this weird software called 3D's Max. I was on vacation, and staying over at their place. Within one month, I learned the basics of how to use that software, with no internet, no tutorials, just really digging into it, because I was curious. I created this (rather shitty) animation of an asteroid crashing into a planet, and then an explosion (I was 12, sue me). Like I said, no internet access. It was just my desire to learn, to know how to make things. \n\n&nbsp;\n\nCut to right now, I'm struggling to learn anything. With the amount of information and tutorials, and books and help articles on the internet, you'd think I'd learn anything in a day. But that's not the case. I simply can't. I've tried to learn Photoshop, 3D's Max, Maya, programming. Etc, etc, etc. Nothing. I can't continue. I keep... quitting half way. Because there might be a better tutorial, a better book, a better something else I could be learning. \n\n&nbsp;\n\nI tried to get my skydive license. I quit after 5 jumps (3 more and I would have been cleared to jump solo). I tried to get my scuba dive license. I quit. I joined the gym. I quit. \n\n&nbsp;\n\nIt seems, over the years, I've just been suppressing any emotion I have, so I can stay on a comfortable neutral level. Does that make sense even? I dunno. I go through the motions, basically. I have killed off excitement, curiosity, passion, and all those things that made 12 year old me just... do things. \n\n&nbsp;\n\nI work at a company that pays fairly well, so I've become complacent. I feel no real need to get out. But, the thing is, what I do currently is no where near what I'd want to be doing. I want to get into animation, but I feel like I've already wasted so many years not learning, that people my age would be animation wizards by now, and I won't stand a chance. That and the fact that I can't seem to 'learn' anything anymore. \n\n&nbsp;\n\nI smoke (not a pack a day, more like one or two cigs a day), and I game. I get a weekend, and leading up to the weekend, I'd tell myself, oh I'd totally go swimming, I'll do some coding, I'll clean up my place, I'll make food, gym, etc. Two days later, I've done nothing but sleep and game. And don't get me wrong, gaming isn't bad. I've loved gaming since I was like 5 or 6. But lately, I think I use gaming not as a form of entertainment as I used to, but as a way to escape, so I don't have to focus on reality. I know that sounds cliche, but I think that's what I'm doing.  \n\n&nbsp;\n\nWhen it comes to smoking, I've tried quitting so many times, it's absurd. I would come up with the most ingenious excuses to justify it to myself. And that's so incredibly retarded. It's almost like I'm bipolar, leading up to having a smoke, I'd be all, 'yeah, but I'm so exhausted today, it's totally okay to have just one', and then immediately after, I'd absolutely hate myself, like the amount of self-loathing I feel is almost unhealthy. \n\n&nbsp;\n\nI don't want to be this way anymore. I don't know how I got here, but it certainly didn't happen overnight. I want to get out. I want to be that 12 year old kid again. I just don't know how to, where do I start, what do I do. \n\n&nbsp;\n\nI should maybe also mention that I was molested when I was 8 - so, things related to sex are... let's just say weird, for me. My sex drive is only really 'awake' when it comes to fantasy, but real life? Not so much. I could easily just... not have sex, it doesn't interest me. Even when I am actually doing it, it feels more like an exercise, and I'm asking myself why the fuck I'm doing this. I don't know if that's relevant, but yeah. \n\n&nbsp;\n\nSorry for the long post. I just needed to get it out. I can't seek therapy, because that shit is too expensive where I live, and there aren't any 'free' or 'cheaper' alternative. \n\n&nbsp;\n\nEDIT: spelling. \n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3ecbgw/how_do_i_get_out_of_this/", "title": "How do I get out of this complacency/procrastination hole I've fallen into?", "social_network": "reddit", "user": "throwdabrix", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 118, "down_vote": 0, "creation": 1437670525, "permalink": "/r/DecidingToBeBetter/comments/3ecbgw/how_do_i_get_out_of_this/", "nsfw": false, "first_save": 1635436019.1757407, "replies_charged": false}