{"id": "t5_2tand_t3_g4bvol", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Advice appreciated for this. Here goes :\n\nI'm a 26F living at home with my mom and sisters. I quit my job a couple months ago and have felt like I'm floating around since, without a purpose or a direction. With the pandemic, it's made the feeling of restlessness, uselessness, and aimlessness more acute. I meditate and do self-hypnosis on and off to help, I run & yoga, eat pretty healthy, I love to read, I'm relearning Spanish -- I'm pretty fortunate to not have to worry about too many bills (except car stuff), I have my own car and room, rent-free, and definitely little pressure to go anywhere or be anything. \n\nHowever, though I'm not without tools to combat boredom or anxiety, I am still staring at myself in the mirror, wondering what the hell I'm doing with my life. My questions are two-fold here:\n\nHow do I regain my motivation to go and help myself out in the world -- specifically, get a job, push myself to do delivery and drive Uber? How can I push myself just to work? \n\nI need help in finding my intrinsic motivation again. I've lost my spark in my writing, and I still love it, but after talking to my BF last night, I feel like I've lost something valuable. He paints and sings to be better when everyone tells him he's shit, and then he does better than before. His fire is there, and he accomplishes beautiful work. He's got passion, and I feel so lukewarm compared to him. I have felt this way for a long time, like a part of me gave up/lost that spark that inspired my creative drive to be the best writer out there. I got used to people telling me my writing was something and paying attention, so I stopped making as much an effort. Any advice on finding that passion again and holding on to it? What's the key to your internal motivator? \n\nThanks !! :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g4bvol/apathetic_looking_for_my_spark_again/", "title": "Apathetic -- Looking for my Spark Again", "social_network": "reddit", "user": "PalmMallALITA", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1587318272, "permalink": "/r/DecidingToBeBetter/comments/g4bvol/apathetic_looking_for_my_spark_again/", "nsfw": false, "first_save": 1635436651.3055634, "replies_charged": false}