{"id": "t5_2tand_t3_a1qy5h", "request": ["5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Good morning r/decidingtobebetter,\n\nAfter creeping around for a while I felt compelled to put my situation out there. This is a throwaway as family know I use reddit. I don’t feel as though I can talk to anybody close to me and would be grateful for some tips etc and the community here seem nothing but supportive.\n\nI am almost 30 and I’m ashamed to say that I’ve spent the last 12 years basically just coasting along.  I failed all but one of my a-levels, dropped out of the foundation degree that I started. spent several of those years working in a pub and six years working in a job that I got through family (not on my merits), never pushing myself to achieve more than was required to get bonuses etc. \n\nI have been a habitual cannabis smoker for most of my adult life - I did stop for a full year (2017) but the bad habit has crept back in and I’ve made no real effort to stop again. For the most part my smoking has been a daily habit (often multiple joints/bongs,wake and bakes etc). This is one of my biggest sources of embarrassment and I feel as though I should stop but haven’t done anything about it. A few times a week I finish work mid-afternoon and have taken to smoking in the daytime, midweek, and even missing work to just sit alone at home and smoke weed, eat and drift in and out of sleep. My wife has no idea of the amount that I smoke and would be horrified if she knew.\n\nIn addition to this, what started as a sweet tooth and overeating when high has become what I believe is a real issue with binge eating and likely a heavy sugar addiction. Even when I haven’t smoked I will usually eat a minimum of a large bag of sweets a day, often more and almost always in secret. I will heap sugar into my hot drinks and eat spreads and things like it straight from the jar, basically anything sugary or fatty that I can get my hands on, even just piles of bread and butter. I would die if anyone who knows me in real life knew what I actually ate. I am fortunate that I have remained quite lean despite this but the weight is starting to creep on which is only making the situation worse (I have chronically low self-esteem so putting on weight, combined with having to shave my head due to mpb earlier this year has put me in a pretty bad place). At least once a week I will overeat to the extent that I’m close to being sick, unable to sleep due to the discomfort and I’ll have to lie to my wife about what I’ve eaten. The health effects of this and the smoking combined weigh on my mind constantly but this does next to nothing to change my behaviour. \n\nTo top it off, I have racked up a little over £3,000 in credit card debt that I have kept secret from everyone, including my wife who has asked on occasion if I’m having money troubles. I lied because this is an incredibly embarrassing position to be in as I have already been in debt previously and took out a loan to consolidate mine and my wife’s debts (still paying this off). I am struggling to formulate a plan to get rid of this without her having to find out in my current circumstances. She is saving for a deposit for a house (I pay almost all of the bills) and has made great progress, increasing pressure on me to get this sorted ASAP.\n\nOh, did I mention that we have a daughter and another baby on the way?! I feel completely effing overwhelmed at the minute and really don’t know where to start or how to sort myself out. I’ve been medicated for problems with depression, anxiety and sleep issues previously but don’t even know where I’d start if I did go to the doctor. I feel utterly despondent and would appreciate any help at all.\n\nI should say that I have taken some steps forward in this time: I’ve learnt to drive and purchased a car; I’ve spent three years at college in the evenings, obtained qualifications and now work two jobs in my field of study; and I’ve trained for and ran several half marathons and a 24 hour relay race. I know I’m not a complete write-off but I’m 100% in a hole at the minute. \n\nApologies for the huge amount of text, seems once I started that it was difficult to stop! Thanks in advance for all and any advice.\n\nTL;DR: I feel like a waste of space; drug problems, eating problems, money problems, keeping this all to myself and struggling to figure out a plan of action.\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/a1qy5h/emotional_eater_smoker_spender_currently_hiding/", "title": "Emotional eater, smoker, spender currently hiding the extent of problems from my wife (and everyone else for that matter), also an ashamed coaster in life, deciding to be better.", "social_network": "reddit", "user": "craicbaby", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 115, "down_vote": 0, "creation": 1543569806, "permalink": "/r/DecidingToBeBetter/comments/a1qy5h/emotional_eater_smoker_spender_currently_hiding/", "nsfw": false, "first_save": 1635436736.6160865, "replies_charged": false}