{"id": "t5_2tand_t3_lplbe6", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "**Saw another post on here regarding a breakup being a move in the right direction/the right decision even if at the time it doesn't feel like it.**\n\nSeeing that post made me feel like sharing my own progress towards making the healthy decision that in some cases is breaking up with your partner, for the benefit of both parties involved.\n\nBroke up with my gf in late Jan. We had been going through a lot of trouble and due to my own issues with trust and self-esteem, I self sabotaged our relationship to the point where she would become distant and I would recognise that and freak out. Causing a endless cycle of her not communicating and me getting anxious because of that.\n\nA lot of the issues come back to the root of me not feeling worthy of her/good enough for her and then through that being unable to see that she loved me even if it wasn't in a way that was entirely visible to me. A lot of my anxiety came from what I perceived as a lack of communication/effort on her part. In my mind she always seemed like she wasn't fully invested/had one foot out the door or was not being fully open with her feeling towards me. More often than not I felt dramatic and over-emotional. She did attempt to reassure me that she loved me and that I was the right guy for her, but more often than not it would just lead to me feeling like a burden or that I was already making it hard for her to want to date me.\n\nI would always try my best to show her my love for her whether through physical affection, gifts, quality time or reassurance on my part. I often felt I was simultaneously too much and not enough for her. That all my effort was in vain and that no matter how hard I tried that it was doomed to be a one way street in terms of effort and affection, she would then rebuke this telling me that it wasn't like that at all, that everything was fine. After which I would feel guilty and worry that I had screwed everything, hence my constant freak-outs and general anxiety. For a time during Covid lockdown last year, I was working full time and would constantly suffer anxiety attacks at work about our relationship, to the point where I ended up having a lengthy conversation with my GF about my feelings almost resulting in a breakup then and there. However after discussing it and me saying I would work on myself/seek help to be better, we decided to continue dating. During the following months I went on anti anxiety/anti depressants and attended counselling resulting in me feeling a lot better and our relationship working better as a whole.\n\nDuring early January of this year she moved in with her friends and started a new job, now initially I was quite anxious about this as I was worried about not seeing her but after reassurance I was fine. She however became distant and started making less effort (to be expected). We had a lengthy argument about something that I know, in the scheme of things was not a big deal, however all my repressed frustration about all the little things that had added up and became the final nail in the coffin. I realised that despite the fact I had made major changes in my life to accommodate her and to make sure she felt good in our relationship (Counselling etc), that she was never going to give me the same in return, that she had never made an effort to make changes, whereas she was more than happy to tell me to change or make me feel like I was crazy through not validating the way I felt. So in the end we had a talk and I told her how I felt and that I wanted to breakup. I didn't mention the full reason behind it, but mentioned it was clear that she wasn't happy/didn't want to continue on either and that I wasn't happy either. She got quite upset stating that this is what I wanted all along (when I was anxious I would go into a depressive spiral and self sabotage). I explained everything as best I could and said my goodbyes, she agreed it was for the best. I have since then contacted her a few times to let her know I hope she's okay and looking after herself.\n\nOverall its been tough to move forward, I worried whether I was so fucked up to the point that I had intentionally thrown away the best thing that had happened to me. But thankfully my friends and family have been nothing short of saints in supporting me moving forward. I've started down my own path to getting better by finding the things that make me happy again. Whether that's spending time with my friends or just enjoying the small moments of happiness and peace that life sometimes affords us when we least expect them. I've still got a long road ahead of me but I know I'm getting better week by week.  \n\n***Side note:*** *Whilst it didn't work out I don't view her as a bad person nor blame her for how it all ended up. Within the time post-breakup I realised whilst she may have exacerbated my anxiety and didn't do as much as she could have to make things work, but overall it had less to do with her being a bad person and more to do with us not being a good a fit for each other. I also realised that a lot of the feelings of inadequacy came from feeling empty inside so working on fixing that feeling has become my new overall goal.*\n\n*Another thing is understanding that even though at the end of the day we have broken up that I'm still happy to have dated her and had those experiences, with the hope being that I can take those and be a better more complete person for both myself and any partners I may have in the future.*\n\n*To anyone else who feels hopeless post breakup or hopeless in general, know that life can and generally does get better. That irrespective of how shit you may be feeling, life will get easier. I tend to think of life as something that regresses to the mean. In that sense I tell myself as bad as I am feeling now that life will be better I just have to look for those moments of happiness and appreciate them because they don't last forever. It sounds quite nihilistic but it's helpful to me. Everyday that I get out of bed in the morning is a good day, even if it doesn't seem like one. I've also begun writing post it notes of goals/things I want to achieve and that has helped immensely, the feeling of taking the note of the wall as having achieved something is a really good feeling. Setting goals whether big or small, is super important to helping you feel better and is something I recommend highly. Self improvement is a life long journey so don't expect instant results but know you are making progress even if it doesn't feel like it.* \n\nHopefully that makes sense to an extant and anything needs clarifying I'm more than happy to answer any questions.\n\n**TLDR: Had a unhealthy relationship which made me feel worthless, broke up and trying to move forward taking it one day at a time. Working on myself and taking into account learnings from that relationship (and past ones), wanting to be a better for myself rather than others. Some small learnings and positives to take from everything as well.**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lplbe6/learning_that_breakups_are_often_good_things_and/", "title": "Learning that breakups are often good things and can help with self-improvement.", "social_network": "reddit", "user": "Ch1mp_Lord", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1613991575, "permalink": "/r/DecidingToBeBetter/comments/lplbe6/learning_that_breakups_are_often_good_things_and/", "nsfw": false, "first_save": 1635436879.1635745, "replies_charged": false}