{"id": "t5_2tand_t3_mrkfmq", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "I’m admitting it, for the first time in my life I’m going to say it. I am a narcissist. Because of my selfish and abusive tendencies, passed down through my mother since I was a child, and all of the abuse and trauma I suffered from, I became the very thing I refused to be, which was all of the adults in my life. I lost my soulmate because I chose to be angry and thought it was okay to be mad at her, when I should’ve shown her love. She has bpd and I took advantage of her insecurities and dependency on people, just to fuel my own selfish pride. She broke down in tears so many times and all I did was leave the room. I never sat there and showed her I cared. She would spoon feed my ego, and exhaust herself to make me feel okay. I chose to let anger be in my life when it was always the thing to hold me back. I would have married this girl and had kids with her. It was the strongest connection I ever had to someone, she became my girlfriend, best friend, parent, role model, and everything else, balled up into one perfect human being.\n\nWhen I met her, I shared no emotion. I couldn’t connect to a human soul, I didn’t have much of one myself. It’s sad to say, but this beautiful human taught me how to love. She put her spirit into me, and actually created feelings in my dead heart. She jump started compassion and actual emotion. Before her I didn’t care about anyone, you could have the worst things done to you and I wouldn’t care. Two years of her trying to get me to just breathe and it all clicked the second she left me. I was a horrible human being. Everything I touched turned to rot. I do not want to be this person anymore...\n\nI’ve always been afraid of being hurt, because it has happened so many times as a child that I just shut literally all emotion down. No one cared about me, so I stopped caring about the world. For the first time in my life, I experienced genuine heartbreak, as if my heart is barely beating. I’m weak to the core now. I’m exhausted. I’ve always been an athlete, but I don’t even have the energy to go to the gym. I’ve never genuinely cried over someone, I didn’t cry in general. This girl tore through my thick wall of narcissism and it all came down. Now I spend the majority of my day regretting how I treated her, how I manipulated her. I feel a genuine connection to this earth now. I cry all the time, I cry myself to sleep, I cry whenever a feeling hits me. She gave her soul and I broke her. I saw her last night and she is so broken from me. I hate myself for hurting her like that. I always tell the truth, but I lied to her from the beginning. I told her I’d never hurt her, and that’s all I ever did to her. I love her so intensely that it creates hatred for myself knowing I couldn’t just let my ways go. I am ready for change. Change is the only thing I want for myself now, and I am going to turn my life around. She made me find value in myself. I gave up on my potential, and chose to believe I’d just fail if I gave the effort to the things I wanted. I want to right my wrongs. If I could rewind time, I’d fix all of the horrible things I did to her. She is the only reason I want to be on this earth.....\n\nIf you are out there my love, reading this somehow. Don’t feel this pain anymore. You were the best thing to ever happen to me. No more lies. I care about you now, and you gave me so much of yourself. I will live on for you. I’ll be what you always pushed for me to be. I’m going to fix myself for you. One day, I hope you find it in your heart to forgive me. The words to describe you simply haven’t been created yet. You as a person, are incredible. You saved me, when no one else would. I’m sorry I lost track of time. I’m sorry I chose everything else over you. I will never hurt anyone again, I care too much about the world now. You forced all of your love into me, and it took the last little bit of you to jumpstart my heart. I would spend one thousand days and one thousand nights saying I am sorry. I don’t have words anymore, it’s just static in my brain. I lost you, and I will never forgive myself for it. You were the best thing to ever come into my life, and I’m sorry I took advantage of you. You were broken too but I didn’t care. All I do now is care. Don’t let this hurt eat you away. You will find love again. I wish it was me, but I know I don’t deserve the chance. You will find yourself again, and I’ll be there every step of the way. I don’t care how much it hurts. I won’t give up on you because you never gave up on me, no matter how hopeless it felt. I hope you find peace in choosing to let me in. Once I got through the door I smashed every room in your beautiful house of a heart. You were the only person in the world who could’ve fixed me, be proud that you did. Go on to know that you forever changed me. I would’ve given up if it wasn’t for you. You fixed the unfixable. Everything happens for a reason. Live your life my dear. I will never forget you for everything you did.\n\nI love you T. Sincerely yours, C", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mrkfmq/i_am_a_narcissist/", "title": "I am a narcissist", "social_network": "reddit", "user": "KireinaXSerenity", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1618510150, "permalink": "/r/DecidingToBeBetter/comments/mrkfmq/i_am_a_narcissist/", "nsfw": false, "first_save": 1635435170.5209937, "replies_charged": false}