{"id": "t5_2tand_t3_hf2uul", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "So much of my life has been mixed signals. I grew up around a mom that told me she loved me no matter what, and then I would be harshly punished for being imperfect. She would say “tell me the truth and I won’t be mad” and then, guess what- all hell broke loose. \n\nI learned that dishonesty had its rewards and that carried with me up to my mid-twenties until I understood how important being authentic is. I got myself into a depressive, anxiety-ridden, addictive, toxic lifestyle and figured out there must be a better way to live. I couldn’t do it anymore. \n\nOur ability to change only comes when our desire to change outweighs our desire to be the same. That sounds scary, but it’s the truth and it’s actually pretty cool because eventually over time, you stop fearing change and begin embracing it. That desire becomes something that leads you instead of something you’re pushed into because you’re at wits-end with the way things are. \n\nI’m still navigating and always will be, but my life is way more peaceful now and I feel joy so much more than I used to. I feel sad and angry more too- because I’m not ashamed to feel those things, but I’m not depressed or anxious nearly as much because those were symptoms of not living aligned with my own truth. \n\nI recognize now that all of my progress has really grown once I decided to stand in my truth all the time- in my relationships, at my job, and most importantly: when no ones watching. I am who I am, always. \n\nI’m not afraid to disappoint people but I do everything in my power to not disappoint myself. I tell the truth even when it’s easier to tell a lie. And it’s freeing because I’m not afraid of being found out. I’m not afraid of being called out for being a fraud because that’s not how I live my life anymore. \n\nI wanted to send this message out because my life has improved so much once I was clear to the universe of what I wanted and who I was - I stopped playing games and decided to just be real. I can see things unfolding in my every day life, material things that I couldn’t have dreamed of before. I think that no longer putting out mixed signals has allowed for so much, and I wanted to share this advice: step into who you are instead of hiding it. There’s only one you, and you’re amazing. You might have things you want to improve but that doesn’t make you bad, it makes you human. Now that you don’t have to be perfect, you can be real. And real, in my opinion, is the best thing there is because it’s telling the universe that this is who you are- take it or leave it. And there’s a beautiful power in that. I am kinder. I am doing things of service I never thought I’d be doing all because I decided to do things for me and let it spill out into other people, instead of doing things for other people and draining myself in the process causing resentment and holding grudges. \n\nI am proud to be who I am and I want everyone to know they can feel this way because not even 7 years ago I was addicted to adderall, lying, stealing, cheating, my way through life and slowly killing myself in the process. I am proud to say that is not who I am, and it was never who I actually was - just a side effect of shutting out my own being to please the world around me. Obviously that got old very quickly and i couldn’t live with the shame and guilt - but I now know that change doesn’t have to be promoted by self hate, but self love and compassion instead. \n\nHope you all have a beautiful day.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hf2uul/stop_putting_mixed_signals_out_into_the_universe/", "title": "Stop putting mixed signals out into the universe and be honest about who you are. Really beautiful things will unfold.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 43, "down_vote": 0, "creation": 1593012006, "permalink": "/r/DecidingToBeBetter/comments/hf2uul/stop_putting_mixed_signals_out_into_the_universe/", "nsfw": false, "first_save": 1635435385.9341815, "replies_charged": false}