{"id": "t5_2tand_t3_qgmuru", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "Previous post here:\n\n[https://www.reddit.com/r/DecidingToBeBetter/comments/jt0dz4/how\\_to\\_combat\\_freeze\\_response\\_and\\_shame\\_cycle/](https://www.reddit.com/r/DecidingToBeBetter/comments/jt0dz4/how_to_combat_freeze_response_and_shame_cycle/)\n\nIt's been a year since I posted here asking for advice about how to combat my freeze response. At that time I was making about $900 a month while paying \\~$1000 in rent + utilities. I was constantly pulling out of my savings to just scrape by. The worst part was that I knew if I could just BE BETTER and complete the bare minimum of my work, I could get more work and not struggle. I felt intense, overwhelming shame EVERY SINGLE MINUTE I was awake.\n\nLittle did I know: less than month later, I would get a job offer from someone in my field of work that I admire immensely. A month after that, I would meet my current partner and get into my first healthy, loving relationship. Those two things saved me and kicked my butt into gear.\n\nMy new boss told me \"I work every day, but I love the work I do. I feel so lucky to enjoy what I do every single day and it doesn't even feel like work. I feel like I'm playing! But I get paid for it!\" This exuberant positive mindset isn't universally applicable, but we work in the food media industry so this really helped me reframe my work from \"I HAVE to get this photoset edited and posted or I'll get in trouble and get fired\" to \"Wow, I literally get paid to take and post pictures of food. That's incredible because I would do it for fun - and for free!\"\n\nToday, I'm making \\~$80k annually on retainer with multiple clients that I absolutely love working with. I've moved into my first studio apartment and my relationship is incredibly supportive and going strong. I'm so, so thankful to be living a life that I love every day. I still have depression and anxiety, but now that I can afford health insurance, it's manageable!\n\nTHANK YOU to u/seekindivid, u/CoastalCats, and u/SuperChoopieBoopies for commenting with encouragement and advice. I appreciate those comments more than you know and came back to them often over the past year.\n\nFor anyone in a similar situation reading this - just know that you NEVER know when things will turn around for you. Before last October, I had been consistently failing and not delivering things on time/AT ALL in every work project I had for OVER A YEAR. There's a light at the end of the tunnel, and if I can do it, you definitely can! YOU GOT THIS.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qgmuru/update_how_to_combat_freeze_response_and_shame/", "title": "UPDATE: How to Combat Freeze Response and Shame Cycle", "social_network": "reddit", "user": "brraces", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1635303132, "permalink": "/r/DecidingToBeBetter/comments/qgmuru/update_how_to_combat_freeze_response_and_shame/", "nsfw": false, "first_save": 1635436791.3148623, "replies_charged": false}