{"id": "t5_2tand_t3_osq61x", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "I turn 42 on Friday and I have never felt more lost or confused about where to go from this point moving forward than I ever have before. I’ve had a pretty rough go of it from childhood, I battled drug addiction in my 20s and I was in a mentally and physically abusive marriage for 17 years and I got divorced four years ago. I have three kids, my oldest is my 18 year old son who I have a fractured relationship with and I have full custody of my two teenage daughters and my relationship with them is great. I’m a supervisor for general construction company and I just don’t have any passion for my job anymore and I’m in a relationship with a woman who I can honestly say is the first person I have ever loved and she is brilliant and she is beautiful and she is funny and we click on every level but our relationship has been filled with a series of serious and stressful events that were out of our control. My brother was shot and murdered three months ago and then in the following three weeks I lost four more people to suicide, drug overdose and natural causes plus a friend of mine was shot in the head during a road rage incident but he’s going to survive. Also during that I gained full custody of my two daughters due to the dumpster fire my ex-wife is. And during all of that our relationship has fractured and it’s killing me because I can’t find a way to fix it. I am just unhappy and lost and crying every day. I left work early yesterday and I’m home today. I just don’t know what to do. We find ourselves locked and his petty blame game arguments I just eventually and and yelling and frustration with each other and both of us shut down and nothing gets resolved", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/osq61x/lost_and_confused/", "title": "Lost and confused", "social_network": "reddit", "user": "PolecatJoe", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1627403195, "permalink": "/r/DecidingToBeBetter/comments/osq61x/lost_and_confused/", "nsfw": false, "first_save": 1635435375.1159647, "replies_charged": false}