{"id": "t5_2tand_t3_pd8dfi", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "b69cf201-6737-4217-b486-9096135546b8"], "text": "In Artificial Intelligence it’s really important to balance Exploration and Exploitation. It is a simple idea that is really relevant to self improvement. Let’s talk about it.\n\n**Exploration**\n\nThis is how many new things the AI tries. You can configure AI to randomize itself frequently and do lots of experiments, which is important for discovering better ways of doing things. Too much exploration is a bad thing, though, because the AI will try a million different things and never refine or master anything. Kind of like how you have 500 games in your Steam library but haven’t mastered any. Sorry not sorry, I do it too. \n\nThe analog to self improvement is constantly reading different books, doing every different diet, and constantly reading people’s stories on reddit. This is good to get an influx of new ideas for sure, and you can learn much faster from reading than learning everything the hard way. But if your efforts are too scattered it’s really hard to actually make the most of all these different resources. You need to practice, polish and refine. This is called exploitation.\n\n**Exploitation**\n\nThis is where an AI will continue mutating but in much smaller ways. It will fine tune one of the experiments it found through exploration and become a master of the approach it is evaluating. This is how you squeeze all of the juice out of the lemon. The problem is if you spend all your time squeezing one lemon (exploiting) and you never look around at other lemons (exploring). This is also called “local optima” in that you might really fine tune one approach to perfection, but miss out on far better approaches.\n\nOne of my stock trading AI’s was like this, it flat out refused to touch any stock except TSLA. You know your AI is in trouble when it starts acting like WallStreetBets. It was profitable, but could have done better by trying other stuff too. If you’ve done something one way for a long time and stumbled onto a game changing alternative, you know what this feels like. Fine tuning feels great because incremental improvements are easier than starting over, but the trick is to zoom out now and then.\n\n**Balance**\n\nIn my life I settled on strong routines of the best habits I’ve found (exercise, meditation, journaling, reading, fear vitamins) AS WELL AS blocks of time each week I spend outside of my comfort zone. That doesn’t just mean reading a book on a new trick, but going somewhere completely new, meeting new people, doing things you’ve never done before. Inspiration for new ways to improve your life can come from anything that’s new to you.\n\nIf I focus too much on the habits I already know then I feel stagnant. If I run around trying new things constantly then it’s impossible to make concrete progress on the big things that just take time. You have to have both.\n\nWhere are you on the exploration/exploitation spectrum? Do you feel stagnant? Is there a habit you really want to get better at where you need consistency? With both exploration and exploitation the key is to start small. That helps you create habits, and the best returns you’ll ever get are from taking consistent steps forward every day. I don’t care how small. Just pick a target you can stick to and remember to balance.\n\n**Additional resources** \n\nIf this post resonated with you then I highly recommend checking out The Tim Ferriss Show, my favorite podcast. He’s a relentless self experimenter and has tried a ton of things as well as creating reliable systems for managing anxiety, depression, fitness, and meaningful relationships. I get tons of great book/strategy recommendations through his show, and his interviews with people like Terry Crews, Adam Savage, and Tony Robbins are amazing.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pd8dfi/what_ai_can_teach_you_about_self_improvement/", "title": "What AI can teach you about self improvement", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1630151274, "permalink": "/r/DecidingToBeBetter/comments/pd8dfi/what_ai_can_teach_you_about_self_improvement/", "nsfw": false, "first_save": 1635435255.1284635, "replies_charged": false}