{"id": "t5_2tand_t3_m6kcr5", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "So like the title says these are some quotes i either stole, altered, or created that i believe in, Im sure a ton of it is debateable and thats not the point. My point is maybe it can help somebody else and im sure ill be judged but its worth it if i can help somebody. Most of these thoughts i havent shared with many at all but why be selfish right? Im trying to be better, so here you go. take it with a grain of salt.\n\n&#x200B;\n\n Life isnt a game to figure out and win, its a reality to be experienced. lvl up mofucka\n\nusually the ones that are hardest to love are the ones who need it the most.\n\nletting go is hard, but holding on to something that isn't there is even harder.\n\nIf i loan someone 20 bucks and never see them again, its worth it.\n\nonly nothing stays the same.\n\nthe days you want to be discilpined the least are the days you need it the most.\n\ndont sweat the small stuff, its almost all  small stuff.\n\nyou get to  pick one of two pains in this life, the pain of regret or the pain of discipline. \n\npick your pain.\n\nWhile under strong emotions, almost never, is anything as bad as it seems, in that moment. \n\nThe only person i can truly judge is myself, others is a waste of energy. Let them exist to their own accord w/o judgement. \n\nnever do anything with expectations on the other person. Do it because its what you think is best.\n\nlaugh , love , live , learn. its kinda that simple.\n\nThe world is a playground. we know this as kids, but somehow forget along the way.\n\nIts impossible to love others without first having some self love\n\nAlmost always its my mind and not my body holding me back. 40% rule. you will suprise yourself.\n\nLetting yourself be free enables the people around you to also shed the chains that bind them.  \n\nId rather be a authentic loser than a false success. \n\ngrace is the coisiousness that life is bigger than we are, so therefore our gratitude for it\n\nmust match its vastness. Everyone is a human who were shaped by expiercence. We are no \n\nbetter or worse, just different.\n\nI mostly regret the things i didnt do more then the things i did do.\n\nhapiness is a state of mind, not a state of being\n\nNever let your value be determined by someone elses preferences.\n\nanger is almost always a secondary feeling, its the initial feeling that is true and hurts, anger is us usually trying to fight back.defense mechanicism\n\nsometimes good things fall apart so better things can fall together.\n\ncompound interest relates to all aspects of life. Both good and bad aspects.\n\ntoday is the first day of the rest of my life.\n\neven when you hurt, remember to still hope. i refuse to give up hope for a better tomorrow.\n\nmy only true possesions are my actions, and i cannot escape their consequences.\n\nits either a lesson or a blessing. dont dwell, learn and move on.\n\ninch by inch, lifes a cinch. yard by yard lifes is hard.\n\n“Those who have a ‘why’ to live, can bear with almost any ‘how’.”\n\nyesterday is history, tomorrow's a mystery and today is a gift, why its called the present.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m6kcr5/simple_truths_things_i_truely_believe_in/", "title": "Simple truths, things i truely believe in.", "social_network": "reddit", "user": "pwnfaced", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1615931306, "permalink": "/r/DecidingToBeBetter/comments/m6kcr5/simple_truths_things_i_truely_believe_in/", "nsfw": false, "first_save": 1635435587.454235, "replies_charged": false}