{"id": "t5_2tand_t3_pms3rr", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "Today marks the day of 4.5 years sober. As I drank from 15-24, it also means that at this moment my sober time reached 50% of my drinking time.\n\nIs life perfect in recovery? No, of course not. This year has been quite a low year in general, with some nice moments sprinkled in. 2021 has been the lowest since parts of my first sober year. But at least in recovery, I can learn from these experiences. I can change, because I'm not running away from emotions any longer.\n\nIn recovery, life became a lot less lonely. When going through bad periods, instead of drinking them away and blacking out at the pub, I look for connection with loved ones. The quality of relationships got so much better.\n\nSometimes I feel like I've only lived for real for 4.5 years. Ever since sobriety, I feel like a barrier between my inner world and my outer world has been lifted. The good feels more real, the bad feels more real. While I was drinking, everything got neutralized to a grey 'meh'.\n\nBecause of this, I found a new energy to live. So much to do, so many dreams to try out. Both professionally, in education, in art, in relationships, in travel, in athleticism, in going-out (which became a kind of spiritual experience). I admit I'm a 'go hard or go home' kind of person and try to channel that energy in positive and productive directions.\n\nMy only regret: not getting sober sooner.\n\nTo all of you who're not sure if recovery is the right path: do it for you, give your future self this gift. Give yourself this chance, you're worth it. I've learned that if you treat your future self with love, he or she will treat you with love back.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pms3rr/45_years_sober/", "title": "4.5 Years sober", "social_network": "reddit", "user": "engineer_whizz", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 81, "down_vote": 0, "creation": 1631450992, "permalink": "/r/DecidingToBeBetter/comments/pms3rr/45_years_sober/", "nsfw": false, "first_save": 1635436825.3419597, "replies_charged": false}