{"id": "t5_2tand_t3_jfmqdv", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": " This is my very first post and  I just need to get this off my chest. \n\nI grew up in a Midwest suburban neighborhood in this neighborhood, I grew up with 15 other boys who were around my age and we knew each other since 1st grade. We did everything together and we were all best friends. I didn’t have any brothers, so these people were like my brothers. We all stayed in close touch and that group of friends is still close. Obviously, I am writing this because I am not close with my best friends anymore and I miss them badly. To understand this relationship further, we all went to high school and college together. I was an introverted person most of the time but once I learned how to be a class clown, I loved the attention. My parents were very strict on me, so whenever I had the opportunity to be a goof ball I would be. Once, I learned how to get my friends attention and peoples attention by doing something goofy, I would do it all the time. I loved the attention. As you can guess, this continued for a long time with my friends. Once, I got to about a senior in college, I started to see people as making fun of me than having fun with me. I used to drink to excess in college to be “that guy.” I was that drunk douche guy until I moved to another state when I was 27. I always thought my friends hated me and made fun of me behind my back, but we would always still hang out and have fun. Well, once I moved and no one came to visit me, I knew everyone hated me. I drank to excess and traveled for work, so I abused alcohol a lot, while living in another state. Once, I got settled into my new city, I developed doing drugs and drinking to excess to make myself feel whole. I developed my dependency because I was trying to make myself feel good. When I went out, I made sure everyone in the club/bar knew I was there because of course I needed the attention. I moved back to the area, where I grew up with no self identity and I didn’t know how to make myself better. I tried AA a few times but never stuck it out. My friends that I grew up with, started to not want to hang out with me anymore and I would lash out at people, when I was wasted if we did hang out. I went through some terrible experiences, when I lived in another state and I was still reeling from the trauma. The problem was I didn’t know how to deal with the pain. I just wanted people to make feel better so I would consume anything to get that result. When you live your life trying to consume things to make you feel good, you don’t have an appreciation for anything. I was a scared boy. About 2 years ago, I really started to put in work to myself, I started reading self help and inspirational books, started praying again. I even have sought out addiction therapy. I am 8 months sober without alcohol even though I still smoke weed. After not drinking for so long, I have realized that my actions hurt people. I have spent a lot of my time correcting my actions. I thought by not drinking, I would have my friends back. My fiancé has been sober ever since I met her (5 years ago in the new city). She has been the shining light in my life and my only friend, when I have needed it. \n\nI desperately want to connect with my childhood friends, but no matter how vulnerable, nice and good natured I am, I get nowhere. Even more than I did before, I get talked about and made fun of. I realized I took a lot of things for granted in my life and I didn’t respect myself, let alone other people. I realized it wasn’t the drink for me, it was the person behind the drink. \n\nI hurt everyday missing the friends I had since first grade. I hate myself for my mistakes. But, I wouldn’t be able to sit here and realize all of this, if I didn’t make those mistakes. Yes, I feel so sad and long to have fun with the people I care about. But, I guess I should just look at the signs and realize, that my relationship with these people will never be the same and accept it. I just hate accepting the facts I have no friends. \n\nI can hang my hat on continuing to be a nice person, provide for my family and enjoy the hell outa my family. I know that is more than some people have, but I just miss my friends. I know it was my fault in the end and I guess that’s why it hurts so much.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jfmqdv/i_have_no_friends_and_i_am_finally_admitting_it/", "title": "I have no friends and I am finally admitting it. Any advice or help.", "social_network": "reddit", "user": "TheMotoSurfer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1603317705, "permalink": "/r/DecidingToBeBetter/comments/jfmqdv/i_have_no_friends_and_i_am_finally_admitting_it/", "nsfw": false, "first_save": 1635437031.2549453, "replies_charged": false}