{"id": "t5_2tand_t3_qabuud", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Hi, I'm an 18 year-old college student who is deciding to no longer let his phone addiction rule his life. I think the addiction I am letting go of is a little different from the norm, though it impacted me negatively just the same. I was (at the moment still am, but soon will no longer be) incapable of being alone with my own thoughts, this is due to an overwhelming anxiety which has plagued me since my childhood, the root of which I believe to have been insecurities about my height which led me to distance myself from others, resulting in many problems down the line. As it stands, if I have nothing to distract me, I am overwhelmed by negative thoughts, most of which relate to cringe-worthy moments from my past, the rest of which relate to mistakes I believe I am currently making and future negative consequences which could come from them. \n\nThe solution I found to distract my anxiety years ago was listening to stuff at all times, by stuff I mean YouTube videos, podcasts, music, anything that can take my focus away from my thoughts. The content of the stuff is not particularly important, the videos aren't from content creators I particularly enjoy, the podcasts aren't necessarily about topics I have an interest in, though the music is usually from bands which fit my taste. The point is, these are meant to distract me, and it is usually to my benefit that they are not too engaging so that I can only give them half my attention, while the other half goes towards any other task I am doing, playing video games, cleaning the house, doing homework, whatever. \n\nSometimes though, these distractions are too engaging, and I dedicate not only my ears but also my eyes to this content which adds nothing to my life. I will lay in bed, or on the couch, and spend hours watching videos about internet culture and people I dislike, or scrolling through YouTube shorts scoffing at how silly they are, as I waste yet another hour to them. All other responsibilities become unimportant, anything with a hard deadline will be done at the last minute, anything with a soft deadline will feed my anxiety, as I beat myself over not having done what I was supposed to today, only to repeat the same process tomorrow. \n\nAll of this has ruined my attention span, I can not focus on classes, I dropped the piano which I had practiced for years and was getting good at, and I stopped reading books which used to be a passion of mine. I have difficulty keeping information in my head, my memory has become terrible, and my insecurities over having little to no friends and failing in life have grown worse. I also have headaches often and have trouble falling asleep, specially if I have to sleep without the sound of some YouTuber speaking nonsense about something unimportant. This is an important point for me, I can no longer sleep without sounds, it is likely having a very negative impact on my sleep quality and has often affected my dreams. \n\nStarting tomorrow I will only use my phone for:\n\n1) Texting - This was never something I was addicted to, and since I don't have many friends (the ones I have, I've grown distant to) this would pretty much only involve texting my parents and group partners for school related stuff.\n\n2) Emails and school stuff - Checking my emails and checking my grades and assignments through the school app.\n\n3) Looking up RELEVANT stuff - Sometimes it can be very helpful to google something, as long as I do not let myself get carried away I think it would be good to still look up some pieces of information.\n\nNO YOUTUBE, NO PODCASTS, NO BROWSING REDDIT OR WHATEVER, if I want I can do it in my computer at home, or even in my laptop, but not on my phone. I can get rid of computer procrastination later, for now the phone is my priority. I can spend time with books, comics, movies, TV shows, studying, learning the piano or a new language, exercising, doing literally anything that isn't consuming content I hate for the sake of not having to think about my life. I will also start meditating for a few minutes in the morning, I think that fits with my ultimate goal. Anyway, if anyone read this far even if you did not comment, thank you, I appreciate that someone else has heard my thoughts, and maybe now I can start hearing them as well, I know that even just having put this down into writing has helped tremendously.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qabuud/stopping_my_phone_from_ruling_my_life/", "title": "Stopping my phone from ruling my life", "social_network": "reddit", "user": "BetterOffReading", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1634518657, "permalink": "/r/DecidingToBeBetter/comments/qabuud/stopping_my_phone_from_ruling_my_life/", "nsfw": false, "first_save": 1635438242.6317809, "replies_charged": false}