{"id": "t5_2tand_t3_ows61b", "request": ["1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3"], "text": "So I’ve had a history of depression due to an unknown panic attack disorder. It’s lead me to create bad habits which would ultimately place me in a worse state of mind. Ended up arguing with a close friend of mine on multiple occasions, traumatizing him in the process, and now we don’t talk anymore unfortunately. Had another friend who has had a handful of mental disorders, let’s just say she’s hurt me because of it, and I still have urges to go back to her even if I know it’ll just harm me. \nHow do I stop all this? I depend on others for happiness, being lonely sucks yes but I’m kinda bad at socializing with people due to lack of experience. \nAt the same time, I wanna find inner happiness and not think about my failures via compare my own worth to others, just because they have skills that I wish to have. \nI’m trying to push my limits & come out of my comfort zone by getting into many interests that I see fit. (Especially since these topics, Blazblue for ex, are ones the group of people I wanna talk to enjoy.) \nYet it’s all so tiring. Hopefully it’s just the process of doing things you aren’t used to. \nTL;DR: I want to move on from my past self and mistakes. I wanna make new friends and be more of an interesting person to approach, while having inner peace.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ows61b/has_dealt_with_depression_loss_of_friends_finding/", "title": "Has dealt with depression & loss of friends. Finding inner happiness and growth.", "social_network": "reddit", "user": "NoAd1566", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1627951877, "permalink": "/r/DecidingToBeBetter/comments/ows61b/has_dealt_with_depression_loss_of_friends_finding/", "nsfw": false, "first_save": 1635437056.0110075, "replies_charged": false}