{"id": "t5_2tand_t3_hycorl", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "As the title says I am 6 months into my self improvement journey and I have no intention for it to end until I myself do. At the start of this year I weighed approximately 136kg or roughly 300lbs. \n\nThis was a result of a steroid treatment for a lung condition I suffered with for close to 10 years at that point and had been cleared of last November. \n\nMy discharge from my lung specialist hit me like a ton of bricks, pretty much immobilising me and leaving me stuck im a very negative mind set. \n\nThen at the start of this year something changed, I can't quite describe what it was but I felt truly alive for the first time in almost a decade and from that I knew that I had to sort my life out. \n\nI started by working out, now at 300lbs working out in any capacity does not feel pleasant so I started off reasonably with some light weighs and trying to do some basic calisthenics. My original routine went like this: 10 bicep curls per arm at 7kg, 10 bench press at 14kg, 10 push ups and try to do 5 crunches.\n\nFrom there my mindset has evolved thanks to me really taking up reading for the first time in my life and also from finding some incredibly strong willed speakers to learn from, namely David Goggins and Jocko Willink. \n\nThese last 6 months have genuinely been the most stressful, aggravating and toughest months of my life and I have genuinely grown to love every part about it. \n\nAll in all I am now down to 107.2 kg or 236lbs and my current workout regime is 140 push ups, 140 crunches, 300 jumping jacks and 86 bicep curls per arm at 12kg per. \n\nIf you read all of this I'd just like to say thank you, reading the stories on this page has helped me on the days where my new mindset just isn't quite enough on its own to push through the hardships. \n\nP.S. if any of you are struggling with building good habits check out the book atomic habits by James Clear, it's my current read and it's really helping me get some good things in order.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hycorl/6_nearly_7_months_in_the_rest_of_my_life_to_go/", "title": "6 (nearly 7) Months in, the rest of my life to go. (Long story here guys, sorry.)", "social_network": "reddit", "user": "Nukagamer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1595790482, "permalink": "/r/DecidingToBeBetter/comments/hycorl/6_nearly_7_months_in_the_rest_of_my_life_to_go/", "nsfw": false, "first_save": 1635437680.351757, "replies_charged": false}