{"id": "t5_2tand_t3_afk1wv", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "Heyo!\n\nI think most of us are sold on the *idea* of being kinder to ourselves, in other words, we know that it's a good idea and something that we should do. But actually doing it is a different thing. It's not difficult to be nice to one's self, in terms of requiring a ton of spent effort, and yet many of us struggle with it.\n\nNevertheless, let me explain why I think you should invest in being much nicer to yourself this year:\n\n- Being nice to yourself creates 'good vibes' in your inner landscape. It makes it easier to relax and think clearly.\n\n- Being nice to yourself means you're not at war with yourself, struggling for control with your inner child or \"inner primate\".\n\n- Being nice to yourself helps you wake up out of all sorts of shitty, nightmarish thought whereby you're convinced that you don't belong, that no one loves you, that you're useless, etc etc etc.\n\nPersonal growth, real growth, is only possible when peace is achieved in your relationship with yourself.\n\nNow. How to be nicer to yourself?\n\nStart by realizing that you deserve it, and that being cruel or surly with yourself is not nearly as productive as it sells itself to be.\n\nRealize also that the fear/stress/anxiety in you will tend to convince you that you need it. It will say that nothing will happen unless you're in fear or stress mode. Is this true? See for yourself. Spend a day or a week being nice and forgiving with yourself and see if you stop growing - I believe you'll find yourself flourishing more than ever. You will see that any growth or success that you experienced was not BECAUSE you were mean to yourself, but *IN SPITE OF* your mistreatment.\n\nIf you fail at something, still learn the lesson, still think about what went wrong and how to fix it, but then be done with it. And then move onto the next thing.\n\nYou deserve every happiness and success.\n\nBrent Huras", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/afk1wv/how_to_be_kinder_to_yourself/", "title": "How to be kinder to yourself", "social_network": "reddit", "user": "brenthuras", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 491, "down_vote": 0, "creation": 1547391636, "permalink": "/r/DecidingToBeBetter/comments/afk1wv/how_to_be_kinder_to_yourself/", "nsfw": false, "first_save": 1635436549.6919055, "replies_charged": false}