{"id": "t5_2tand_t3_ozygl4", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "This is my first post so I hope I'm doing this well. I'm not really sure what I'm looking for out of this if not for acceptance that things happened and it's okay to move on. Keep in mind this is just as much as rant as it is a story; I started crying in the middle of this and just wanted to let the words and emotions pour out. I hope you're all doing well and enjoy my stream of consciousness.\n\nI'm a 26 year old guy, never really been great at emotional intimacy, but I know I've had some good friends along the way. I find myself still self isolating, despite that it's a bit safer to go back out now. I've been this way since my last relationship, and it's a cycle that's more or less repeated throughout my life. I have trouble bouncing back into feeling grateful, content, etc.\n\nMy last relationship, which felt like a first genuine attempt at one, went pretty bad. I went into it so care free, but almost immediately kinda knew I wasn't into the girl. Despite this I continued on because I didn't think I was giving the situation a fair chance. This was clearly a mistake, which unfortunately led to some pretty shitty situations between us. I feel I became way more controlling and abusive than I really care for being. At it's worst, I put my hands on her during an argument, choking her for what felt like a second or two before pushing her. She was trying to keep me from walking out - I was drunk and threatening to leave on my bike in the middle of the night. The relationship continued for a bit after that, and nothing like that ever happened again, but it's safe to say things didn't magically get better and no we aren't still together. \n\nFor a small period of time after the relationship, I felt ready to bounce back and I almost felt justified in saying the situation wasn't all me and both of us contributed to arguments and stuff, but a couple key details stuck out to me: I was a bit older (5 years older), and I was the abuser in this case. She had pushed me around on some occasions when she was angry but she was shorter than me and I never really felt truly threaten like she did, it was more annoying than anything. Not to mention I'm a man, & while there's definitely no shortage of women out there who can whoop my ass, this one wasn't one I felt would do that. Safe to say I needed to be the bigger person. At least in hindsight, I wish I had been ; and let the relationship go early on and just lived my life. At this point, I've forgiven her for any dumb or petty shit she did; she doesn't even need to apologize. My family thinks I'm being too hard on myself, which I do think I kinda am, but I really don't think this was ever on her to make up for, I think it's on me to decide to be better and do better for myself and others. \n\nAfter some much needed reflection I finally landed on the biggest fears and insecurities of mine that I think led me to this situation. I think my first mistake, was dating someone so much younger than me. I'd be lying if I said the power and feeling of somehow being smarter, wiser, and being able to \"improve\" my partners life was intoxicating. As a man I felt it was something I had yearned for my entire life. As noble as I think I saw this, it's naive and maybe even a gross masculine power trip. My lack of relationship experience didn't help, but that's not an excuse anymore. I'm insecure. I don't feel like a man. I feel like a child and I think my actions sometimes reflect that. I don't want to be too hard on myself because I genuinely want to change and I think that decision is a mature decision to make, but it's meaningless until I open up, truly, and expose my wounds to the world so that my future self is a better me. \n\nI feel like a sissy. I grew up with no brothers. My house was women dominant. My own father, who was hardly around, didn't seem to ever like me much. My step dad whooped my ass pretty bad as a kid and called me a faggot for apparently not being man enough at somewhere around 4-6 years old. I had sex with 2 boy friends as a kid when I was experimenting. They were fun experiences, but not ultimately what I wanted to be doing. I still find some men attractive but I don't experience sexual attraction to them like I do with women. If anything I would like to sexualize women a bit less, I think my dick is part of the reason I make dumb choices with women. I want to mention that my step dad used to ask me to check out and sexualize women when I was a kid, as a way to bond I GUESS, but that was also so long ago that mentioning it sort of feels like a crutch. Im grown up now, I live alone, and I still sexualize women way too much. I watch more porn than I care to admit. I want to be a true friend to more women, and I realize I find it hard not to sexualize them and wonder if we're ever gonna sleep together. To some guys this might seem like normal behavior for a man, but it's not who I ultimately want to be. I slept with a coworkers gf when I was in the military, and I should have gotten my ass kicked for that but the dude was forgiving which only made me feel more guilty.\n\n Ive had very unwanted thoughts that I'm a faggot, gay, a woman, trans, all of these potential fears for what lies ahead if I try to change, and I hate it so much. None of that accurate describes me in a way that I feel comfortable and happy with. At best, I can accept these thoughts for being just tiny descriptors of myself. Am I a bit feminine? Sure. My mom and sisters really were my only family growing up and they taught me cool shit like skin care, hair care, and most importantly to me, how to be a gentleman and not be a misogynistic asshole. Am I gay? I think I could be bi, I don't necessarily have an issue with kissing another guy, but anything outside of that, including a committed relationship doesn't feel like something I want out of my life. It would be experimenting and fun at best. Am I a woman? Literally no. Am I trans? Also literally no, and I think the whole idea of spending time taking medication and having surgeries to pass as a woman would be an inaccurate portrayal of my real self. It would feel more like pure vanity. I don't think I would be happier, just more self centered and it would almost be like bottling womanhood into pure aesthetics, which isn't what women are to me. They're so much more than that. Yet again, I dont feel like a man. I haven't accepted the intricacies of manhood that aren't pure mystical machismo. I feel fear, I feel insecurity, I feel lack, pain, beauty, intimacy, color. I cry, a lot. I cry way more now than I ever allowed myself to. I fight it, a ton. I still feel like a bitch when I cry, and then cry some more when I realize how ridiculous it is to fight it, and how misogynistic I really am, calling myself or anyone else who cries a bitch; how that perpetuates a cycle of toxic masculinity that has terribly degraded my own happiness and self expression throughout my life. I'm crying right now. I realize how much like my father I am, who despite the craziest of circumstances throughout his life, I've only ever seen him cry like twice. My siblings and I survived the the onslaught of consequences that arose from his lack of emotional intelligence and acceptance of his self. My mom survived his bullshit and she's such a small, loving and caring woman who didn't deserve the hate she received. I feel I've come full circle; finally hitting that cliche bump in the road people talk about when they say that no matter how much we try not to be like our parents, we become them. My ex didn't deserve me, she deserved better. I want to say I deserved better in my upbringing, and got exactly what I deserved through my actions as an adult, but in this moment, I feel kind of sick of only thinking of myself. I want to do better, for others. Yes, I want to be happy for myself, but the tears and good feelings come when I think of my family, my mom especially, who continues to believe in me despite the fact that I feel like a huge failure. \n\nChange is hard. Really hard. It takes effort. \nI'm nowhere near where I want to be. Ive always found men who clearly are not only in touch, but in control of their emotions, very admirable & attractive. I look up to them. I no longer look up to comical masculinity. Sure it's fun, and hot to be able to lift a few hundred pounds. Muscles, stoicism, perseverance, and control are all sexy traits, but even if I'm having trouble seeing it right now, so is honesty, tears, vulnerability, and just being a real human being, not a caricature. \n\nAnyway this was long. I hope it doesn't get taken down. If you enjoyed this, let me know. If you relate to this, I'd love to hear that too. If you didn't like this or have issues with anything said, let me know as well. Thanks for your time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ozygl4/its_been_a_long_time_since_my_last_bad/", "title": "It's been a long time since my last bad relationship. (CW: Abuse, violence, homophobia)", "social_network": "reddit", "user": "gersonsmith", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1628360469, "permalink": "/r/DecidingToBeBetter/comments/ozygl4/its_been_a_long_time_since_my_last_bad/", "nsfw": false, "first_save": 1635435400.7729008, "replies_charged": false}