{"id": "t5_2tand_t3_pt5pue", "request": ["b69cf201-6737-4217-b486-9096135546b8", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "Today I realised, if you promise yourself something and you can’t keep that, it’s very likely you can’t keep a promise you have for someone else as well. \n\nI am pretty disorganised, but I work in a senior level tech job (my iq  luckily is quite high, I worked hard 20+ years for some top companies, and have a post graduation) and probably the reason why I have gone forward in life than be in shambles. \n\nWhat I am consistent is - I eat clean and workout based on a schedule most days, Ofcourse do my job (though with fair bit or procrastination).\n\nNow the disorganised part:\n\nI sleep late (go to bed late, then stay there reading kindle until it’s 2/230), procrastinate a lot, waste time on unnecessary things, even though I workout I don’t keep a strict timetable - I know this day I have to do this workout and I do but it gets procrastinated to sometimes upto 11:00 pm etc, In spite it promising myself I’ll workout during lunch time. \n\nToday I realised that, I keep promising myself that I’ll sleep early and wakeup early, but since the pandemic it never happened (except two weeks I took my son for a swimming crash course). \n\nSo, I am going to keep this motto “if you can’t keep a promise to yourself…” thing and see how it might make an impact. I’ll come back after a few weeks.\n\nEdit:\nMinor tweaks", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pt5pue/if_you_cant_keep_a_promise_to_yourself_you_likely/", "title": "If you can’t keep a promise to yourself, you likely can’t keep it for anyone else", "social_network": "reddit", "user": "kickyblue", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 168, "down_vote": 0, "creation": 1632310842, "permalink": "/r/DecidingToBeBetter/comments/pt5pue/if_you_cant_keep_a_promise_to_yourself_you_likely/", "nsfw": false, "first_save": 1635436436.7776365, "replies_charged": false}