{"id": "t5_2tand_t3_o51h2m", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "Okay, here’s the venting coming (and hopefully the last time on Reddit and generally on social media) \n\nI am frightened of doing physical exercise and talking aloud.\n\nOn December 2018, I fell sick. My throat hurt and due to stress caused by  upcoming exams, my skin started to become red and itchy. To my surprise, it was psoriasis (now I’m healed but still got other skin problems). I decided to skip one day of class after going to the doctor to get prescripted some medicine for my throat. \n\nThats same night I stayed late watching some Netflix show, and as my father came back from work, I stood up and prepared for bed because he nags me for staying up so late and not sleeping enough. \n\nI had lots of dirty napkins due to my runny nose, so I collected them to throw them in the kitchen rubbish bin. One of those napkins fell down and as I was bending down to pick it, I suppose I put more pressure than usual on my right knee and all of a sudden I heard a *crack* and fell down on my butt. \n\nSuddenly I felt an intense pain but I didn’t know from where it came from. I called my dad (he was on the bathroom) and he looked at me in despair asking me what happened. So did my mother, and they called 911 but it was my father who had to drive to the  hospital. \n\nI got my knee twisted, hopefully it got by itself back in the place. \n\nMore than 2 years have passed, and day to day I still think about it. My whole body is still on shock. Im scared that it will happen again. \n\nThis Friday I will call my call doctor and  ask her to make an appointment with a psychologist. My fear of getting hurt physically and my fear of socializing have affected negatively both my academic and familiar life and it needs to end. \n\nI’m also planning on going to the gym, but previously tell a trainer my physical issues. \n\nThank you in advance for taking your time to read this.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o51h2m/i_wanna_stop_being_so_afraid_of_everything/", "title": "I wanna stop being so afraid of everything", "social_network": "reddit", "user": "Difficult-Milk3634", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1624298966, "permalink": "/r/DecidingToBeBetter/comments/o51h2m/i_wanna_stop_being_so_afraid_of_everything/", "nsfw": false, "first_save": 1635435099.9204023, "replies_charged": false}