{"id": "t5_2tand_t3_bjfs05", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": " Currently  I'm planning a happy thing. I trip somewhere. I intend to travel alone  and I'm trying to figure out the details. It's my first time travelling  like this and I'm really looking forward to it, I think. I'm really good  at reminding myself that certain things can fail or that I might  dislike a certain aspect of a future event. I'm having a really hard  time differentiating between planning and phantasies of where my trip  might fail horribly because of x. That's where I start losing myself in  the details and decide to continue tomorrow. I'm trying to make  decisions where to go and what to do based on what I want because that  is how you are supposed to do it (?), but I actually don't want to to  anything. I'm paralyzed when I have to make decisions. I realized a  while ago that doing\" the thing\" is an effortless task for me every time  as soon as I started it. I stopped thinking about the big mountain of  reading literature and writing it and just chipped away at the task  until it suddenly was a presentable text I could work with. So for me it  is one thing to finally write that thesis and \"just do it\" so to speak  because there the path is clear, but how can I translate this to things I  should actually enjoy where I have all the options in the world?\n\nI'm procrastinating on planning a vacation. It is ridiculous. Can someone slap some sense into me?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bjfs05/im_going_on_a_trip_planning_it_is_the_hardest/", "title": "I'm going on a trip. Planning it is the hardest part for me. I can't make decisions for my own pleasure.", "social_network": "reddit", "user": "SeparateExperience", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 20, "down_vote": 0, "creation": 1556708472, "permalink": "/r/DecidingToBeBetter/comments/bjfs05/im_going_on_a_trip_planning_it_is_the_hardest/", "nsfw": false, "first_save": 1635437738.0811064, "replies_charged": false}