{"id": "t5_2tand_t3_myofnh", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I hate having long hair. I hate absolutely everything about it. Hate having to wash it, brush it, style it. Hate how it feels on my shoulders or how it gets caught under me when I'm sleeping or how it catches and gives me a headache when it's in a bun. I hate how it collects all over the place - on my floors, in my vacuum, between my fingers in the shower. I hate having to think about whether it's presentable enough for me to go out in public. Hate how there are only two styles I ever do with it and I feel like it's a waste of so much potential. And most of all, I hate how my sense of self-worth is so attached to it. \n\nI'm recovering from an eating disorder and a very important step of the recovery process is coming to terms with the fact that my self-worth is not derived from my attractiveness. But I'm still not there yet and the only reason I'm hesitating to chop of my hair is because - since gaining weight from the recovery process - I feel like it's my only remaining beautiful physical trait. It's a security blanket. \n\nI know what I want to do and what I should do, but I'm afraid of what might happen if I can't manage to wrestle my sense of self-worth away from my attractiveness and there's nothing left about my appearance that I feel is beautiful. \n\nThoughts welcome. \n\nThank you in advance (:", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/myofnh/i_need_a_little_push_to_encourage_me_to_chop_off/", "title": "I need a little push to encourage me to chop off my waist-length hair", "social_network": "reddit", "user": "COnursetallette", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1619407165, "permalink": "/r/DecidingToBeBetter/comments/myofnh/i_need_a_little_push_to_encourage_me_to_chop_off/", "nsfw": false, "first_save": 1635435104.8295007, "replies_charged": false}