{"id": "t5_2tand_t3_o8hgmi", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I tend to \"punish\" myself for making mistakes in life. Especially right in the moment I believe that's the most logical response to doing something wrong. I don't like it, but that's the only thing I can do because I have no alternative. I will list a few examples here.\n\n1. 3 years ago a girl I liked blocked me on Instagram. I tried to convince her to unblock me but failed. So in the moment I decided that I wouldn't talk to anyone at all for the next 2 weeks. I posted this on another reddit account and the comments said that I shouldn't do it because it would only make me feel worse in the long run. Fortunately I never followed through but I can see why it wouldn't do me much good in the long run.\n\n2. At the end of 2019 I had a crush on a girl. At a party I found out that she already had a boyfriend. I was upset so I disabled my social media for the following 2 weeks of winter break. It sucked. No human contact with my friends made me lose my mind and I ended up worse off in the end, while my friends went to all sorts of parties throughout winter break.\n\n3. My senior year of marching band was very rough. My band director was rougher on me than he was the previous year. Because everyone in band used Facebook Messenger to communicate, I ended up trying to delete Facebook account 5 times in just 3 months. Yeah....\n\n4. 1 year ago during quarantine the girl I liked blocked me on Snapchat. This upset me because I really thought I had a chance with her. At that point I was just done with trying to find a girlfriend. When I scrolled through Instagram and Vsco and saw some pics of her in a swimsuit by the pool I was like \"Nope, fuck this shit, I'm out\" and deleted both apps.\n\nDo you get the theme? My first impulse is to simply retract from the world around me for some period of time because I feel like I have done something wrong and thus I don't deserve to have social interaction, usually by deleting social media apps/accounts. I feel like I have deleted more social media accounts than all my peers.\n\nWhat's the alternative to \"self-punishment?\" What should I do instead of retracting from the world and social interaction if I make a mistake when socializing? Answers are appreciated!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o8hgmi/what_are_some_alternatives_to_punishing_myself/", "title": "What are some alternatives to \"punishing\" myself for doing something wrong?", "social_network": "reddit", "user": "CEO_Of_Rejection_99", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1624736041, "permalink": "/r/DecidingToBeBetter/comments/o8hgmi/what_are_some_alternatives_to_punishing_myself/", "nsfw": false, "first_save": 1635436621.82124, "replies_charged": false}