{"id": "t5_2tand_t3_lx5l7j", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "I will use this text as a reminder for myself to remember how big the issue is. I'm not writing this for help or anything like that, but if you have something to say, I'd be happy to read. Btw this text is kind of all over the place so don't expect something like a composition. Also, I'm not a native English speaker.\n\n&#x200B;\n\n**I'm going to read this every morning when I wake up**\n\n&#x200B;\n\nI remember when I was a kid, I always had this some kind of feeling of fear. I even remember asking about this to my friends and them saying they don't have it. Around 5th grade, I noticed that my palms were sweating but I didn't know why they were like that. Some of the kids in school were cooler than everybody else and I would try to get in their social group but they never accepted me, I didn't know why. Now looking back, I was a kid who always wanted to be admired by others, that's why I tried to be like the cooler kids in my school. Everybody were loving them, even the teachers. When highschool started, my sweating problems got really worse. Even when I think about it, my palms would sweat. I found that my social skills were not that great. It was hard for me to be friends with other kids, this made me fear being alone. I couldn't become friends with the people that I wanted to be friends with, so I became \"friends\" with the kids that I don't actually like... but hey, at least I was not a loner right? In the first year of highschool I started to criticize my face and body, I was not perfect. This caused a lot of insecurities. I was not confident, I was not social, I was not great looking. I started to  act like those who around me, those who I don't like. It was just to fit in. This made me question myself, who i really am? Why I chosed to be a fake person rather than myself? Why am I so afraid of being not liked and not admired by others? Why almost everyone are so confident and original? Why am I not like them? I finally realized that I was not okay. After some google searches, I learned the word \"anxiety\", it fitted me right away. As I did some more research, I found out that low self-esteem was my thing too. I was not feeling worthy enough, I would see myself lower than others but at the same time, I would not like the majority of other people because I would always find flaws in their personality or appearence. I became less happy day by day. I was constantly telling myself that I am a loser, worthless, stupid, someone  who can't get things done, a pathetic, someone who spreads negativity to his surroundings. My confidence and self-esteem dropped dramatically. I would get so angry when someone criticises me.\n\n&#x200B;\n\nI convinced my  parents to make an appointment for a specialist. I told them it was just for my sweaty palms. When I finally get to talk with the woman, my hands started to shake and it got harder for me to adjust my breathing to the spaces between my words. It was my first time telling someone about my problems. She ended the appointment early because of my discomfort and diagnosed me with social anxiety and prescribed me an anti-depressant. But after a couple of days, I stopped using it. These drugs weren't going to fix my problems, I was the only one who could fix them (I am NOT encouraging anyone about this, if a specialist thinks you should take medications, take them). I didn't go to my third appointment. Maybe it was better to continue the medication, I still don't know what was the best option for me at the time. Anyways, I realized that I was craving for love in the third year of highschool. There was this girl who I got close with. We were flirting with each other. It felt so awesome to feel loved, important and worthy. I finally became a confident person. However, after some time this relationship became a little toxic and we started to not talk with each other. This made me feel even worse about myself because I realized that my self-esteem was not internal. Fast forward to the last year of highschool, I got a girlfriend. We were so great in the beginning but towards the end of the relationship, I started to get really jealous. We had a lot of toxic arguments. I blamed her for almost everything and got paranoid over her feelings about me. I was so afraid to lose her because if it happens, the harsh reality would hit me again... and it happened. I questioned myself every single day after the breakup. I was so toxic that I would even act like someone I'm not just to be seen as confident but I wasn't. I was a controlling person because of my insecurities. All these thoughts made me wonder If I'm a narcissist, even the thought of it is so scary.\n\n&#x200B;\n\nI feel so bad about myself right now. Quarantine created a lot of time for me to think about my life, and the more I think about it, the more I hate myself. My depression got worse over the time. I tried to change myself so many times but I failed at all of my attempts so I just ended up spending a lot of nights crying while trying to sleep. I know I need to change myself. I should practice empathy, I need to be honest to myself. I need to make lessons from my mistakes. I need to take care of my anxiety and low self-esteem. I need to stop blaming my family for my problems. I'm going to spend the last bit of my motivation and hope on this. I'm sick of it. I will not be a loser. Even if I fail again, I will not give up on myself and start all over without wasting any time. This is not who I am. I will find my true self in my struggle.\n\n“To conquer oneself is the best and noblest victory; to be vanquished by one’s own nature is the worst and most ignoble defeat.”\n\n**NO MORE EXCUSES**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lx5l7j/no_more_excuses/", "title": "No More Excuses", "social_network": "reddit", "user": "perseverance_1", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1614809099, "permalink": "/r/DecidingToBeBetter/comments/lx5l7j/no_more_excuses/", "nsfw": false, "first_save": 1635437567.4040222, "replies_charged": false}