{"id": "t5_2tand_t3_qe1242", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a", "c67213dc-0eed-4cac-a781-9bc082742908", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "I've been lurking on this sub for two months or so now without saying much but found that there's a lot of people here with really good advice on a lot of topics. I don't really know where to begin so I'll start by saying I'm 20 (M) and I'm slowly losing touch with everything around me. \n\nIn high school I was always the class clown and my goal was to make people laugh as it made me feel valuable/happy. When I got to college, I had a very healthy and fun relationship with people around me in my first semester but also felt really lost and sad overall - partly because of imposter syndrome, partly because I didn't really ever hangout by myself as much as I did when I got to college.  The best way I can describe it is that I was happy day to day but not content with my life - I felt that something was missing. \n\nIn my first spring semester, I joined a fraternity that I had mingled with at a lot of social events the previous semester. I thought I may as well become more social as there's no better time than college to do so and it could help improve my issues about myself. Then, a month later, I had a realization about myself that fixed all that sadness away as I realized it was the root of my problem: I'm really just fucking dumb. I make so many mistakes day to day: I'll say something out loud to an acquaintance that I quickly realize is a dumb question or I'll be really clumsy with an action that I'm doing or if someone asked me specifically for help on a task, I'll fumble over myself and be unable to help most the time because I don't know how to do it. \n\nThen covid hit and I was with family for the next 8 months or so until Spring of this year when I went back to campus. Obviously, spending so much more time alone during quarantine only made me think more and more and more about how dumb I am - how I literally make 5-6 mistakes a day no matter what I'm doing. Whether it was passing a pen to a family member with no ink, putting too much water into the rice cooker and ruining the meal because of it, or literally failing a class that was an easy A for everyone else because I didn't do the work. I started to overthink and doubt my actions: was I saying something dumb? about to? what could I say that was interesting? is this even interesting? \n\nThen the anxiety only amplified when I got back to college and had to double-overthink because I care more about what my peers think of me since they've only known me for such a short time compared to family. I continued to make more and more daily, stupid mistakes and smoked a lot of weed to help pass the time as I became more and more alone. I became depressed but also found solace in being alone for the first time in a while. I tried to enjoy that alone time as much as possible. However, my overthinking and anxiety didn't stop. A couple of brothers in the fraternity were looking for one last person to move into their off campus house and asked me specifically and I obliged - ecstatic to be asked, and excited to force myself to be more social in the fall semester (i.e. this semester) by living in a more social house. \n\nHowever, this semester I am finding myself at rock bottom. I overthink everything now and Im so dumb I can't even think of things to talk about with people I consider good friends. So I just sit there in silence, overthinking, thinking about what to talk about - anything just not silence or something dumb. Someone asks me something and I'm unsure how to respond and stumble over my words and its super awkward. I have small talk with roommates but I can tell they include me in their lives to be nice, but we're not actually friends. I try everything to not have the focus be on me (so that people dont realize how dumb I am even though they already know thru the mistakes i constantly make) but I want to be closer to these 'friends' so I need to talk so I try to share a story about myself that is related to the topic at hand. BUt then that get's either interrupted by someone else, by myself stuttering and prefacing the story further, or it's finally told and I get a \"oooh that's nice. . . ahaha. . . \". I consider dropping the fraternity as everyone now knows that im dumb and difficult to talk to and therefore they stop making conversation with me, but I can't drop it since i live with other guys in the frat until may. then tonight I overheard my roommates talking about me, how I am \"black air force energy\" (lol) and whatnot. \n\nThis past month, I am just slowly accepting the fact that im dumb, i can't converse well, and that i am not as good as my peers as a result. I am losing touch with most of my friends since i am a black hole of conversation but I just accept it; it's depressing and it's lonely but i dont want to sit through more conversations of awkwardness instead. I'm scared of graduating college now; if life is going to be even more lonely after college then what's the point. if life is just going to be me working at a desk for the next 40 years of my life then it's not worth it. I don't know what to do and I am breaking down more and more. I dont even want to hangout with my closest friend anymore. I have been working out to improve my life in one aspect at least but other than that I have no outlet and everything is lonely and void of color.\n\nI am looking at getting therapy but never actually make a first appointment. I want to be more independent and proud of myself - working out and feeling good about my body is a good first step towards that imo. I just am so tired of life and everything takes more effort than it should. \n\nSorry about the length of this post - it's just something I felt the need to get off my chest and who better to tell than you guys (other than a therapist).. Thank you for taking the time to read this too. I know im not really asking anything in particular here, but I just spent the past hour lying in bed and typing this out so i dont want to delete this either... i want to stop overthinking.\n\nTL;DR Ive always been a cheerful guy but in college i realized im dumb and thus now have anxiety and i overthink so much it is impeding normal daily functions. i am so tired of everything as a result and just want to be a better version of myself but i dont know how; or more accurately, i either know how to but theres so many steps to take that i never start OR i literally can't (can't change being dumb and not thinking about anything - mind is blank during conversations so can't respond non-awkwardly).", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qe1242/im_so_tired_of_myself/", "title": "I'm so tired of myself", "social_network": "reddit", "user": "Weekly_Program_2230", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1634978498, "permalink": "/r/DecidingToBeBetter/comments/qe1242/im_so_tired_of_myself/", "nsfw": false, "first_save": 1635435854.1271892, "replies_charged": false}