{"id": "t5_2tand_t3_orv4sk", "request": ["78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "Been killin' it at work, gym, friendships with non-toxic people, regular therapy and being good with medication.\n\nIt's truly been a shit year and sometimes I stumble and fall back, yet the feeling of knowing I'm doing way better than the people that stabbed me in the back and heart are never gonna achieve half the shit I have at an earlier age than them helps me sleep so good at night now, when it used to keep me up.\n\nWas on a bit of a bender last week but I'm more comfortable now. Realized most people aren't shit, they just put up the facade that they are. People don't change unless they actually proactively do things to change.\n\nThe people I used to know from past friends to ex partner in all the time I've known them are in a rut and will continue to be miserable unless they make life-altering decisions. I know they won't. I used to give so much love and care to people who are so undeserving and hurtful without empathy or soul. I used to fight for them. Used to help them in anyway I could. No more. \n\nI know who I am now, and I know without those shitty traumatic experiences with people I wouldn't been able to see everything so clearly now. Dropping them only skyrocketed my success.\n\nPeople who decide to be better: if your loved ones are the source of your pain, let them go. It'll hurt for a whole lot of while but you'll come out on top as now you have more than enough time and love to nurture your own self. \n\nI woke up hungover and happy after celebrating with people who truly are gems finally closing a bad chapter with people who truly ain't shit. \n\nAnd most people, especially the ones who hurt others for self gain, ain't shit.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/orv4sk/feeling_great_and_proud_of_myself/", "title": "Feeling great and proud of myself", "social_network": "reddit", "user": "rspaze", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 20, "down_vote": 0, "creation": 1627291004, "permalink": "/r/DecidingToBeBetter/comments/orv4sk/feeling_great_and_proud_of_myself/", "nsfw": false, "first_save": 1635437922.154449, "replies_charged": false}