{"id": "t5_2tand_t3_cciqb2", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "I (33m) think I’ve been depressed for some time, living in the future (“I’ll be happy when x...” “I’ll meet interesting people when I accomplish y and change my life” “I’ll have plenty of time for socializing when z happens and I start really living” etc). The first session with the therapist was great and he helped me realize that the activities I do in isolation are losing their value to me because I’ve neglected forming connections with people (he didn’t tell me this, to my shock I found myself saying it out loud after he simply listened and asked me about my feelings). \n\nAnyways, four days a week I go to the gym after breakfast, maybe around 11am, same gym for years. There is this beautiful woman with such a cool vibe, like maybe she can skateboard. She is there maybe half the time I’m there, we must have similar life schedules— I bet it’s been at least a year of overlapping schedules where I frequently see her there. I’ve never spoken to her because (1) I haven’t been putting myself out there in a long time and (2) In general, I don’t think women like being approached at the gym and (3) she might be around 5 years younger than me and that for sure makes me self conscious. \n\nAnyways, today we happen to cross paths in the gym and it went differently than ever before. the first thing that was different was I think after the realizations from therapy yesterday, my eyes weren’t fixed on the floor by my feet as I walked, they were up and looking at the world. And much to my surprise, SHE initiated eye contact with ME and smiled! Now it could have been nothing, no intention of sending me signals what so ever, but I didn’t really care. So she smiled and I stopped walking to yield to her as we were trying to pass each other in a narrow space in between machines, and when she smiled I didn’t hesitate to speak and I smiled back and just said “really cool hair”, and ran my hand over the side of my head where she had shaved short her hair on the side of her head, like Natalie Dormer had done in hunger games. So She smiled again at me for speaking and then like a dork I gave her the cowabunga surfs-up hand gesture thing. To be honest I don’t remember if she said anything back because I think I was blushing and I was too busy asking myself “did you just speak?!”. \n\nAnd That was it. \nBut it was meaningful. \n\nIt felt like a test that popped up to see if I was going to take action on the realizations I had made in therapy, and I am very proud of myself for passing it! Maybe the high school me would have spoken in a situation like that but it’s been a long time since I’ve been that guy. (What happened to him?!)\n\nNow she may have just been being polite, most likely she was, she just smiled and looked at me because we both tried to use the same narrow walk way at the same time. But I don’t even care, it showed me proof that I DO in fact crave more human interactions because this little blerb was indeed meaningful. It doesn’t matter if she’s interested or not, it matters how I behaved when I WAS interested.\n\nMaybe we’ll never speak again. \nOr maybe we will but she won’t think I’m cute or she might be married, and it’ll be nice that I’ll make a platonic friend who is at the gym a lot when I am! \n\nEither way, I’m good!\n\nBut if she reciprocates and says some sort of compliment to me next time we’re both there, or if she flashes me the cowabunga in a playful way, I might have a fun little heart attack hahaha", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cciqb2/today_i_did_something_that_felt_really_good_for/", "title": "Today I did something that felt really good for my soul that I wouldn’t have done if I hadn’t gone to therapy for the first time yesterday. I spoke to a beautiful woman who smiled at me", "social_network": "reddit", "user": "pWaveShadowZone", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 262, "down_vote": 0, "creation": 1562976626, "permalink": "/r/DecidingToBeBetter/comments/cciqb2/today_i_did_something_that_felt_really_good_for/", "nsfw": false, "first_save": 1635435408.6605847, "replies_charged": false}