{"id": "t5_2tand_t3_a7vwkv", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "I've always journaled pretty regularly, but even more so the last six months or so as I have quite a lot going on and writing it down helps to shake it out of my head and make space for processing. About three weeks ago, I woke up with a couple minutes to spare before going to work, and I wrote down a few goals for the day. *Don't be an asshole. Be patient. Don't be unnecessarily argumentative.* I can't say that I had a rousing success that day as far as those goals went; the next day, though, I made time in my morning routine to do the same thing again. Write down a few goals. Reflect on why simple things are a challenge for me (I'm a long term sufferer of Persistent Asshole Syndrome) and how I can curb some of the fallout. \n\nThe nature of the writing has varied over the weeks. Sometimes it's goals, sometimes it's reflections on the day before. I attend NA for alcohol use (almost six months sober!) and have an app on my phone with a daily... note? I don't know what I'd call it, but some mornings I'm too exhausted to brain well and so all I'll write is verbatim what the \"Just for Today\" is and leave it at that. But I still take a minute or two to clear my head and write something down. \n\nI can't determine how much doing this has contributed to my mental improvement over the last month, but I know with certainty that it's a factor. \n\nThe reason I'm sharing isn't necessarily to advocate morning journaling, but rather the satisfaction of having stumbled in to a routine and then sticking with it. There are dozens (upon dozens, upon dozens...) of things that I could be doing every day to be a better person, but doing dozens of things a day sounds like crap on a stick and I am lazy, even when it comes to personal wellness. However! There has been improvement from just doing *one little thing*. One tiny little routine that only takes a few minutes in the morning. \n\nI realize that's a lot of words to get to one simple point, but alas: Even if you only take one tiny step every day, you're still moving forward. Baby steps really do make a difference. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/a7vwkv/sticking_to_even_the_tiniest_routine_can_do/", "title": "Sticking to even the tiniest routine can do wonders", "social_network": "reddit", "user": "el902", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 309, "down_vote": 0, "creation": 1545294482, "permalink": "/r/DecidingToBeBetter/comments/a7vwkv/sticking_to_even_the_tiniest_routine_can_do/", "nsfw": false, "first_save": 1635438155.1244218, "replies_charged": false}