{"id": "t5_2tand_t3_q72gtl", "request": ["78e8a1f4-314f-439f-8f40-daf7a6da355f", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "(F/28) Last year, I've thought about if a certicate of attendance was an equivalent to a high school diploma.After asking on Yahoo Answers before it got shut down,  I've learned it wasn't because it didn't open up to many job options. I had trouble with school growing up because I thought it didn't teach me life skills. I would get angry if I got an answer incorrectly. I've had a tutor during my high school years until I was a senior. Plus I also had a hard time focusing because a certain subject in a class didn't interest me. I didn't like following the rules either and never took my education seriously. (Not that I've dropped out) I was placed in Special Ed classes growing up until I've aged out to enter a day program. The staff at the program had been supportive of me getting a GED. I've wanted to get a GED to increase more career opportunities, increase my income, get a better job and feel better about myself. I currently work as a bagger at a grocery store for five years part time to earn myself my own money and independence.\n\nI didn't plan to go to college as it would require paying off the loans which can take years to do so.\n\nMy parents knew I didn't like school, but they let me take GED classes. As my efforts to take my future seriously along with my studies my parents were proud of me! \n\nI've passed English, history and science last summer online through GED.com. \n\nThe only subject I have left is math which why I'm taking classes for math virtually both afternoons and evenings. \n\nI've been feeling excitement finishing my GED while studying for math even though I'm not ready to take the last test. \n\n\n\nHas anyone been in a similar situation as I am?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q72gtl/working_towards_my_ged_as_an_autistic_person/", "title": "Working towards my GED as an autistic person", "social_network": "reddit", "user": "Helpmehthrohaway", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 42, "down_vote": 0, "creation": 1634095371, "permalink": "/r/DecidingToBeBetter/comments/q72gtl/working_towards_my_ged_as_an_autistic_person/", "nsfw": false, "first_save": 1635437935.7659707, "replies_charged": false}