{"id": "t5_2tand_t3_m7m2kf", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "Hi, I hope this is the right sub. Just looking for some advice and gentle encouragement.\n\nFor many years now iv'e felt like i have a mental block when it comes to motivation and life goals.\nI havn't always felt like this, when i was younger i had many interests, hobbies, ambitions, i felt blessed with creativity.\nAs a teen i would enjoy writing, especially short stories. I loved reading, i could draw/sketch, arts and craft and my mind was always bursting with new ideas.\n\nThen life got in the way. Stress, bad decisions, messy relationships, broken friendships, family drama and now 2kids down the line, Single mom and i have nothing to show for myself. No interests. No life goals. No motivation watsoever. \n\nMy mind feels so blank now and all i can focus on is getting through the days and making sure my little ones are happy and healthy.\nThe worst thing is i also neglected my health these past few years. And it is starting to show physically, which scares me.  \n\nSo I'm starting to work on my health now, practising self care, healthy eating, loads of H20, keeping active. Also therapy - as i have been through quite some trauma, which has left me with zero self esteem, anxiety and lacking self confidence in myself. \n\nI just need that extra push to rediscover my creative abilities and make solid future goals that will benefit me and my children.\nHow do i find that creativity again? How do i find MySelf again? I just don't know how?\n\n\nEdit : Thank you all for the the kind, uplifting words, It's so appreciated!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m7m2kf/how_can_i_rediscover_myself/", "title": "How can i rediscover myself", "social_network": "reddit", "user": "blessedminx", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1616054891, "permalink": "/r/DecidingToBeBetter/comments/m7m2kf/how_can_i_rediscover_myself/", "nsfw": false, "first_save": 1635435563.1965845, "replies_charged": false}