{"id": "t5_2tand_t3_qcotq0", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "I've spent too long worrying about things in life. Not telling people I like them for fear of the reaction, staying in relationships for too long because I feel an obligation to people, their health and wellbeing. I've always tried to be better without realising I was just restricting myself based on what I think society deems a good, healthy person should be. I've always been the one to hold my tongue, to take the high road. A few days after my last breakup, my best friend turned to me and said 'I feel like you always think you need to be more mature than you actually do'. It's true. I always take the high road. My ex has been talking me down to our mutual friends and meanwhile I've kept to myself and minded my business because I don't want to put our friends in an uncomfy position or talk bad about them.\n\n&#x200B;\n\nBUT. I've started living with less of a filter. I've been saying yes to absolutely everything - from grabbing a drink with a friend to playing dnd (i have no idea how to play this game) with my work friends. I felt a responsibility to stay and try to work on things in my last relationship and let my partner shape my view of us - and then I said no, you're asking me to sacrifice too much here. And so I called it a day. I've been speaking to this amazing brilliant person and I like her and so I was just like. I'm gonna tell her I'm thinking of her! There is literally nothing stopping me and I would so much rather say and do everything than have regrets about being responsible. Like I'm working and doing a masters full time too and I have no time at all but I'm also in such a good position because I'm doing everything I love and letting myself FEEL and DO whatever I need to. I write music and so I wrote a diss track - it's just about releasing the emotions and it just feels wonderful. It can be nice to take the high road and it keeps the peace and lets you be somewhat drama-free but also? Sometimes the low road is where you can find your passion and the best creative outputs you've ever experienced. So that's just where I'm at and I'm looking forward to slightly settling down soon and being less busy BUT - saying yes to new experiences and not holding my tongue on how I feel about people - these are things I'm going to keep.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qcotq0/deciding_to_just_do_it/", "title": "Deciding to just do it", "social_network": "reddit", "user": "No-Refrigerator3232", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1634812437, "permalink": "/r/DecidingToBeBetter/comments/qcotq0/deciding_to_just_do_it/", "nsfw": false, "first_save": 1635437373.2839751, "replies_charged": false}