{"id": "t5_2tand_t3_pzre78", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "f39f6441-79a5-42c9-8dca-c8455143a12a", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I was incredibly weak minded person less than 4 years ago. Depressed and becoming obese, a single word could shatter my life and hurt me for weeks. People always doubted and would even laugh at my journey of weight loss, when you don't even believe it yourself and also other people don't, then that became my mindset. With constant setbacks and complete failures in my weight loss journey I genuinely believed that I was so weak that it was genuinely impossible mission to lose the excess weight, it wasn't possible, not for me.\n\nMore background,  I was diagnosed with aphasia due to early deafness that was later fixed. They told me learning a single language would be a great difficulty, now I speak 3 languages fluently. I was severely bullied at school, bullying lead to severe depression, eventually at the age of 20 my depression lead to its peak, where I would then try to end my life, that then lead to me wanting to try to better my life, not because I thought it would get better, but to validate my next attempt that I wasn't meant to be here. But the opposite happened to me.\n\nA normal winter cold night occurred in early 2018, I scrolled through YouTube and by pure chance I stumbled upon a video by Billy Yang, named along the lines Why run a 100 miles. That video itself transformed myself, I fell in love with running without ever setting a single foot on the pavement, ever since then it has become an obsession to want to experience such a beautiful moment in life.\n\nI lost my weight in 13 months, 30+ kg. I went and trained for my marathon within 10 months, less than a year later I ran my first ultra distance of 63.3 km, to running my first ultra 8-9 months later of 100 km. Before even my weight loss and finding myself.\n\nA lot of people will doubt you, people will want to put you down and put boundaries that aren't set in reality. I got sick less than 2 weeks before my ultra and recovered without any symptoms before the race, however I was still a lot weaker than my peak fitness. I was projected to finish top 10-20 in the race before getting sick. I wanted to quit so bad because I didn't believe that I could run a 100 km in my shape, everyone was telling me that to run a 100k is crazy to begin with, however in my shape that's more so than crazy.\n\nBut my mindset these days is that if you ever tell yourself or anyone else that you're gonna do something, that you have to see it through no matter what. There would have been no way I would have quit without having a genuine reason, and when I genuinely thought that I couldn't finish, then let me try and run a 100k and fail spectacularly. I lived a life with broken promises, constant lies to myself and others. However in this reality, in this life that I live now I want to give my maximum effort to anything that I pursue.\n\nHalfway to the 100k race I was in pain, I was barely running, my lowest placement went down to 158/258 out of runners. I was climbing this mountain. The race started at midnight, it was around 8 am now. It was going to be one of the hottest days that day, I was dreading it badly. First half was done in perfect condition, with 3/4 of the climbing that was waiting ahead of me, I knew it was gonna be 10x times worse in front of me.\n\nI know these low moments, I know how to control my emotions and hormones, so in that moment I listened to some David Goggins because that is one of the ways I know I can activate my adrenal gland. In that split second I went from a person wanting to quit, to sprinting up this small mountain, leaving my buddies that I have been suffering with for many hours. The amount of adrenaline that I received would continue to nearly over the finish line, I kept pushing, I was running in incredibly hostile temperatures now. Runners that I continuously passed by cheered me on seeing my effort being displayed. I kept attacking these mountains with speed and momentum, however the very last climb nearly broke me and that was when the adrenaline was completely gone. The last 10 km was driven by complete power of will, overcoming myself and my emotions. My sprint surges were so powerful in that moment, but it left me vulnerable to the brutal heat, my legs began shutting down mainly due to the lack of salt that I had, but with no aid stations, with nothing on me it was gonna be all out logs from this on, my legs couldn't run. Until that point I must have had about 2,5 km left and a man ran by, seeing him suffer just as much as me and that he still found the strength to run, made me want to run as well. It was hard, my right leg was giving up, I knew I could finish by simply walking, but if there is one mindset with ultras that I have is that I do not want to survive, I want to thrive in it. People were cheering me on left and right, I was focused on the goal of finishing now while running, the more I ran the faster I went. Until I saw the finish line that is when I began sprinting with whatever speed that I could give, I felt my right leg being at the breaking point but I didn't care. I finished at top 44.\n\nThis is me Deciding to be better, I hope it will help some people in their journey. Next year I will challenge myself twice as much, and hopefully it will motivate you to start as well. If there is one thing I know for sure is that motivation isn't needed, in fact I'm not motivated for the most part. However i am incredibly disciplined person. These days I have become a local legend around my area and inspired people in person and done interviews as well. The best part is helping others in their journey of bettering. Because if a person so fucked up as me can do it, then so can you. Here is to bettering ourselves!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pzre78/in_less_than_4_years_i_went_from_a_guy_unable_to/", "title": "In less than 4 years I went from a guy unable to walk a few miles with mild obesity. To running a 100 km ultra race. A journey with constant setbacks, self doubt, and doubting from everybody else, but I had a dream of becoming one of the toughest versions of myself.", "social_network": "reddit", "user": "GwenSkin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1378, "down_vote": 0, "creation": 1633163924, "permalink": "/r/DecidingToBeBetter/comments/pzre78/in_less_than_4_years_i_went_from_a_guy_unable_to/", "nsfw": false, "first_save": 1635435335.1179283, "replies_charged": false}