{"id": "t5_2tand_t3_pe8xf4", "request": ["1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3"], "text": "So a few days ago I posted here that I was giving up video games all together and deciding not to waste all my time.  \n\nIt’s going really well so far!   Still no video games.   \n\nI’ve now learned all the hiragana characters in Japanese and now working on the katakana.  I also skipped ahead a little and learned how to say “it is half past one o’clock”  😍\n\n\nI read some more.  I started a manga, katerou daze, and also read some more of a book all about mma fighter/ pro wrestler Ken shamrock.  It’s a really interesting look into his life and his impact on the early days of mma. It’s not Shakespeare but reading anything is a good start.   I also have Jordan Peterson’s 12 lessons book that I need to finish.  \n\nI walked 5 miles on Friday!   Walked another 2 miles Saturday and decided to rest today.   I wanna walk 5 miles Monday to Friday and rest on the weekends from now on.  \n\nI also didn’t order any fastfood!   I’ve been cooking a lot more.   Staying under my calorie goals.    Having a few things that aren’t the healthiest but keeping that to a minimum and staying under calories.   \n\nI cooked lamb chops marinated in soy sauce, salmon burgers, roasted asparagus, really simple homemade chips were literally just slice 1 potatoe into thin strips, drizzle with a tiny amount (like less than a teaspoon) of oil, salt, and bake for 45 mins.   Much better than eating an entire can of Pringle’s or a handful of fries.  Coooked some delicious tuna as well.  \n\nNo alcohol soda or anything like that.    Already losing a few pounds!   I wanna go from 245 to 199 by January 1st, and then 165 by August 1st.  It’s gonna be tough but I can do it.  \n\nI’m also way happier.   I know I’m still gonna have bad days, but I honestly feel that I’m finally pulling myself out of a deep hole of depression and that I’ll actually start feeeling good about myself", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pe8xf4/i_pledged_to_do_better_and_im_actually_doing_it/", "title": "I pledged to do better and I’m actually doing it!! So happy 😍", "social_network": "reddit", "user": "tyler_durden2021", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 236, "down_vote": 0, "creation": 1630289607, "permalink": "/r/DecidingToBeBetter/comments/pe8xf4/i_pledged_to_do_better_and_im_actually_doing_it/", "nsfw": false, "first_save": 1635437057.745567, "replies_charged": false}