{"id": "t5_2tand_t3_q9tj07", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "Hi, to be honest I don't know how to start this post and the more I think about it the more anxious I get, but I think I've reached a point where I just need to hear advice from different people. Look, I'm not that type of guy who likes to ask for something personal on the Internet and less on social networks, but reddit is the only place I like on the Internet (speaking of Facebook, Twitter, Instagram, etc.) and I think It's pretty cool\n\nThe point is, I need help, in few words. I have felt like a loser, but in many ways both physically and mentally, this feeling is quite difficult and the reason for all of this is that I feel like I am falling behind and I don't know what to do.\n\nSince the beginning of my quarantine, I had to take my classes online, but now it is my last year and, by my parents' decision, I had to take a temporary break from my university (this semester only) because they wanted to wait until I had the inyection for the infection, you all know what i´m talking about. Now I have both doses but the thing is that I am lagging behind everything, in my studies I have forgotten a lot of things :(, my French that I have not finished yet, my English that I have forgotten many grammar rules because it is not my first language and my personal projects.\n\nThings are getting worse because at my university they ask me to certify my English and the only way to do it is by taking the many courses they have or showing my toefl (B1) certificate, the problem is that I never took any of those courses (lol) and I start to forget a lot about my English and obviously I don't know how to start preparing for toefl by myself, while the rest of my classmates are freeing themselves from those courses and therefore from English.\n\nAlso, they are already doing their internship in companys while I sit here wasting my time playing video games and feeling bad for being useless (sometimes I have work to do because I work as a freelance online even before the lookdown that's where I get money for video games and stuff) and I've tried to go through my notes and do it on my own, but I feel like I won't have enough time for that and I feel stupid about it and I know people won't understand me.\n\nEven people who were fat before are now in better condition because they were exercising during the lockdown, they look even better than me. :(\n\nThe part that hurts me the most is that I was the youngest and most advanced in my course before the lookdown and now I am behind all of them but at home they did not want to take that risk of sending me and I got it I am a skinny person who gets sick easily, you know, but still feels bad about it.\n\nSo, wonderful folks at reddit, can you give me some tips on how to improve and fix my problems? I have tried many things that you may tell me, but I do not lose anything to listen to. And if you've read this far, I want you to know that I really appreciate that you took a little bit of your time to read my issues and maybe share something that might help me or just an comment because you were in a similar situation, whatever you do now thanks for listening and helping me.\n\nI will read your comments and thank everyone who has read this ... yeah, it was a bit longer ヽ (• ‿ •)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q9tj07/i_am_falling_behind_and_i_dont_know_what_to_do/", "title": "I am falling behind and I don't know what to do", "social_network": "reddit", "user": "farisidis", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1634453369, "permalink": "/r/DecidingToBeBetter/comments/q9tj07/i_am_falling_behind_and_i_dont_know_what_to_do/", "nsfw": false, "first_save": 1635435068.898447, "replies_charged": false}