{"id": "t5_2tand_t3_8p28nc", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Part of Deciding to Be Better is to become more appreciative of who you are now.  If you feel envious of other people, or are down on yourself because you're not rich and famous, remember that you have to look at the long run.\n\nThe cemeteries are full of people who were once rich once good looking and once famous. But two generations later no one remembers much if anything about them.\n\nIf you're young, you are rich with all the years that are going to come your way, and each hour each day of those years offers you the potential for really becoming who you want to be. \n\nIf you live in developed country, you should also remember just how privileged you are compared to the majority of people in the world.\n\nAt age 50 I myself have to remind myself that even though I may not be a millionaire I live a life that ***billions*** would envy. I am a healthy, white, man, living in America, with a good education, a loving wife, a sweet kindhearted son, and a job that may be boring but isn’t soul crushing and pays me relatively well.  I don't denigrate non\\-whites, non\\-males or non\\-Americans, but without a doubt, sheer chance has put me into one of the most favored 1.25&#37; of the living population at any time in history, just by my birth, and my post\\-secondary education and salary put me into an even lower \"privilege percentage\".\n\nI might find myself envious of someone having a yacht when I don’t have one, but I try to remind myself of all the people who would *long* to be in my situation, which really is one of luxury, even if I was making a lot less than I do now. So many don't have what I have, starting with running hot and cold water, an unimaginable range of affordable food, regular opportunities to eat out, can drive my own car to get to where I want to go, from my local neighborhood to thousands of miles away on generally well maintained roads, no worries about being swept up into Civil War, and so on.\n\nBillions of people live a life of daily suffering. Yet I get a little depressed because I don’t have everything that I would ever want. I have to remind myself of what I do have, including the intangibles that I generally don't consider, and put that in perspective vs. what so many people don’t have. I try to remind myself of this every day.\n\nIn the end, everyone should live a life with healthy ambition that isn't fueled by envy or revenge.  But never let ambition get in the way of deciding to be a better, and by that I mean good, person. If you remember the movie “It’s a Wonderful Life”, George Bailey lived a life of thwarted ambition and was disappointed in himself, yet his brother toasted him at the end as being the richest man in town and it wasn’t because he was financially rich, but instead because he had enriched everyone around him and his life was full of friends.\n\nGeorge really did have a wonderful life, as do I, and likely you do as well, but none of us can appreciate how wonderful it is if you concentrate on what you don’t have rather than valuing what you do.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\n\nThis post springs from a comment I made over in  r/malelifestyle, and since I got a fair number of upvotes, I figured I would share it here as well, since I'm a subscriber.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8p28nc/decide_to_be_better_also_means_valuing_what_you/", "title": "Decide to be Better also means Valuing what you Have", "social_network": "reddit", "user": "AspireAgain", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1528303881, "permalink": "/r/DecidingToBeBetter/comments/8p28nc/decide_to_be_better_also_means_valuing_what_you/", "nsfw": false, "first_save": 1635437870.5228112, "replies_charged": false}