{"id": "t5_2tand_t3_nze97x", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "Hello! I am really just looking for any advice in general. I am 20f about to go to my 3rd year of college. I want to work in wildlife conservation or help the environment in some way, I’m currently a biology major. I’m not really sure how to get into that field. I’ve basically been raising myself since both of my parents weren’t around much, and now that I’m finally an adult I feel disconnected from my peers but I still want to have a good time and set myself up for success and happiness later on. I read a lot of self help type books, I think I’m pushing myself a little too hard at times. I’m paying for college myself, but haven’t had any loans yet since I have 3 jobs. I’ve been dating the same guys for 3.5 years and we plan to get married at some point (a couple years after we graduate). I have depression and ADHD but it’s getting better now that I’m away from my family and have freedom to choose how I do things. I just got my first car and paid it in full, and I started investing on robinhood March 2020. I don’t want to be rich, I just want to support my family in the future with my boyfriend and help the earth and travel. I’m not sure how to balance working and having friends though, and I don’t deal with stress well. I have body dysmorphia which is a constant struggle and I’m not sure what my path will be after graduation. I’m writing all this in case you’d like to give more specific advice. Thank you!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nze97x/general_advice_for_20_yr_old/", "title": "General Advice for 20 yr old", "social_network": "reddit", "user": "Previous_Werewolf_67", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1623643833, "permalink": "/r/DecidingToBeBetter/comments/nze97x/general_advice_for_20_yr_old/", "nsfw": false, "first_save": 1635435278.6624444, "replies_charged": false}