{"id": "t5_2tand_t3_m24o1f", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "I’m 24, and I feel like I have failed at life. In school I always managed to get decent grades and overall seemed to stride to do the best that I can, with what I was given. Very charismatic, bright, happy, charming. I’m not trying to be that guy that has his glory days in school and shit but I’m using it for story telling. I never went to college, I thought that if I had to go to school for another four to six years I was gonna lose it. It just wasn’t in me. So, for the past five years I’ve been dicking around. First, I did Walmart for two years and that mainly consisted of part time hours with a never ending quest of getting stoned and laid. Then after never making any money, I went and worked at mobile home plant for three years. The pay was decent, but the job itself and the management and work life balance was god awful. I quit once and worked a different job for a while, and then came back for the money. I left yet again, and did something else another production plant but 3rd shift, and couldn’t hang. I left there and I currently work at another production plant making some really decent money. I still live with my parents, but I pay my own way. My own car payment, phone bill for my personal phone, and various membership payments along with giving my parents money because ya know I live with them. They consider it the equivalency of it being utilities and rent. So all I would need is my own place. My point? I fucking hate my life. These jobs, they’re meaningless and pointless. They serve no purpose. I’m not trying to get deep, but they’re just jobs where you slave yourself for 8 hours and they just use and overburden the shit out of you until you’re mentally burnt out. And that’s all I’ve done for five years, these lame ass jobs. I’ve always felt like I could do something MORE. I’m very smart but very lazy. I’m debating on getting tested for ADULT ADHD. Because too many different things are adding up. I don’t really have an outside life. I just work and come home. I really don’t have the me in myself anymore. I can’t get into my hobbies, I don’t enjoy anything. I feel very exhausted all the time. I’m angry, I’m tired, I have a lot of negative thoughts and feelings, and just overall have become a toxic person. I feel helpless. I just think I’ve hit this point in my life where I realize I haven’t done anything with my life and I feel extremely powerless because I have no idea what the hell I would want to do anyways. I’ve just been drilled to think MAKE MONEY AND SURVIVE and it’s just wearing on me. I don’t know anymore. I blame myself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m24o1f/im_24_and_i_feel_like_i_have_failed_at_life/", "title": "I’m 24, and I feel like I have failed at life", "social_network": "reddit", "user": "Chris10Taylor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1615400858, "permalink": "/r/DecidingToBeBetter/comments/m24o1f/im_24_and_i_feel_like_i_have_failed_at_life/", "nsfw": false, "first_save": 1635435820.2174346, "replies_charged": false}