{"id": "t5_2tand_t3_1w7x2s", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "Every once in a while, life throws a real reminder at you, sometimes when you need it most.\n\nI sat down for breakfast today next to two women.   One was advising the other on what she should do to find herself gainful employment in the nursing field.   My ears perked up as they started to discuss food deserts, malnutrition and preventative care.  I put down the newspaper and struck up conversation with them about the woeful state of health care in the US.\n\nAfter we got to the part of the rising diabetic rates of children in this country, the abysmal level of infant mortality and the obesity pandemic, something clicked in my brain.   \n\nI am unbelievably lucky to live the life I live.   Many of my friends are as well, and we take it for granted on a daily basis.   When we whine about the fact that our rent is too high, or how long the wait is for the bus, or about the silly melodramas that dominate our conversation, that is an absolute privilege.   A privilege that many on this planet will never have the ability to appreciate.   They're too concerned with trying to get access to the bare necessities of life: potable water, healthy food, and shelter from the elements.\n\nOn top of that, somehow I managed to make a comfortable living out of trying to make the world a better place.   I've been able to play a part of some of the most incredible social movements in the last few years, met some amazing passionate individuals along the way and seen some sights that will forever be burned in my brain.   And now I'm part of a company that I truly believe will rebuild a sense of community throughout the country.\n\nThese are no small things.\n\nYet somehow I still get caught in the minutia of the day to day, as do we all.   And I don't judge myself, or anyone else for that matter, for it.   We're only human.   It's only natural to be concerned with our immediate environment.\n\nBut I hope I don't take it for granted.   I hope I use the gifts I've been given to allow others the opportunities to use their own.   I hope I don't forget that fact too often.   \n\nAnd when I do, I hope the universe is kind enough to remind me.   ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/1w7x2s/dont_take_it_for_granted/", "title": "Don't Take It For Granted", "social_network": "reddit", "user": "Pugilanthropist", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 18, "down_vote": 0, "creation": 1390769679, "permalink": "/r/DecidingToBeBetter/comments/1w7x2s/dont_take_it_for_granted/", "nsfw": false, "first_save": 1635437000.2106068, "replies_charged": false}