{"id": "t5_2tand_t3_qfq1pw", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "I truly hate my job. I started in May, it's work from home (which is the only good thing about it) but I hate it. I make slightly above minimum wage (16 an hour) and I am in charge of an insane amount of tasks and responsibilities that pile up everyday. I am sending dozens and dozens of emails to many different people and businesses where I still don't even know who I'm talking to and why or what to do or how to answer their questions etc. This job has A LOT to know. I also get yelled at on a daily basis by customers on the phone for other people's mistakes that I now have to deal with with little help on the spot and try to resolve all because I just happened to pick up that specific nasty call. \n\nI hate it. I also don't like my team very much. They're all basically trying to kiss the bosses ass all day. In our group chat it's always just everyone aiming to be the funniest with the funniest joke or being the quirkiest... I have to force myself to join in and be part of the team but everyone just seems to be in a competition with each other on who's going to get Employee of the Month. \n\nAnyway I hate it. I am trying to look for another job but it's slim pickings out there. Even before this job I was looking for a while.\n\nSo, how do I remain positive and grateful I even have this job? I try to imagine myself homeless, or working at an even worse fast food iob, or I go to the extreme and I picture myself caught in a shooting and getting hit by bullets and dying lmao I don't know I try just so hard to remain grateful for what I have but it's harder and harder each day. Any advice would be so great.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qfq1pw/how_do_i_be_grateful_that_i_have_a_job_despite/", "title": "How do I be grateful that I have a job despite hating it so much? How do I just appreciate what I have?", "social_network": "reddit", "user": "5ky5enberg", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1635194947, "permalink": "/r/DecidingToBeBetter/comments/qfq1pw/how_do_i_be_grateful_that_i_have_a_job_despite/", "nsfw": false, "first_save": 1635437373.0077522, "replies_charged": false}