{"id": "t5_2tand_t3_h8g6qb", "request": ["eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I think everybody's faith and hope in humanity has been literally put to test in the past months.\n\nIf you asked me about what I thought about the world before corona, I'd be excited and optimistic. I'd say \"there will always be bad things in the world, they always existed and they always will, but I feel that overall things are getting better\". I was optimistic, even though there were some absurds going on, because I understood that they were part of life. But good things were happening too. I'd be at peace with a lot of things, I wouldn't be too frustrated with people.\n\nBut now, everything has changed. I have seen people not care about the virus going to the streets, throwing parties while there are people dying and suffering. Politicians using a pandemic to gain power regardless of the cost of it, human lives. I knew a lot of politicians couldn't be trusted, but seeing that even the people decided to disobey to social isolation and do all kind of stupid things made me lose hope in the population too, at least in my country, one of the most affected ones. There are videos of people being violent with doctors and health workers, the people who are literally keeping others alive by putting their own lives at risk. How do you even manage to accept that and move on? It's insane. I have tried to stay optimistic about everything since the start of the pandemic, but as the weeks and months went by, all the terrible things happening started to slowly undermine my hope and confidence that the whole world would band together to defeat the virus and create an even stronger global relationship between all countries. No, it seems now most countries are more interested in the political game than serving the population.\n\nAnd when you look ahead, there isn't much to be proud of either - the economies around the world will plummet. And instead of helping, politicians again are trying to get something from it.\n\nThen the people going to the streets to protest, some of them rightfully, but some of them destroying things and attacking those who think differently. It's happening in many places in the world in varying intensity. Whatever happened to empathy on **all** sides?\n\nI know that there are people who are trying to do good things, but I feel that for every good thing done, there are 10 other bad things happening.\n\nThis is a vent, I think it's just a pessimistic day, but I'd like to hear what others have to say for it, maybe I'm too biased, but idk, it's been really hard to see things getting better. I think my faith on people is very low atm.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/h8g6qb/its_been_really_tough_to_be_optimistic_with/", "title": "It's been really tough to be optimistic with everything bad going on in the world", "social_network": "reddit", "user": "lernem", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1592083427, "permalink": "/r/DecidingToBeBetter/comments/h8g6qb/its_been_really_tough_to_be_optimistic_with/", "nsfw": false, "first_save": 1635437491.8927677, "replies_charged": false}