{"id": "t5_2tand_t3_n6qkoy", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "Tw: mentions of depression, su*c*de \n\nCheesy title, but today I learned cheesiness can be a very good thing. \n\nLast night I kept having flashbacks of this horrible dream where I saw my suicide in multiple graphic ways. I was crying uncontrollably but silently into my pillow. \n\nToday, I had a conversation with a classmate/friend. He’s someone who’s changed tremendously since the pandemic in mindset, going from a C to an A student. He has told me before that I inspire him. (I’m a straight A student despite battling depression).\n\nSo we were talking, and I could see how hard he worked and what kind of difference he made. Sure, he had cheesy moments with listening to motivational audios, but he stuck to it and he was able to self-motivate. \n\nI saw how much confidence, self-worth and ambition he had, and realized he really did look up to me. I decided I didn’t want to be that “role model” that committed suicide or that ended up allowing myself to tear myself apart. \n\nIt’s crazy how just one person can make such a huge difference in your life. Hes motivated me to chase my goals and focus on myself and my life. \n\nThat being said, It’s time for me to stop trying to live for others and finally live for myself. So what if I’m insecure? It’s time to realize my self-worth, practice self-love and radiate confidence. Cause really, all we have are ourselves. And if I’m mean to myself, no one else will be able to convince me or help me. I have to do it myself. I’m also going to try counselling again.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n6qkoy/yesterday_i_wanted_to_end_my_life_today_i_want_to/", "title": "Yesterday, I wanted to end my life. Today, I want to fight to make it the best life I can.", "social_network": "reddit", "user": "mya-is-confused", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 271, "down_vote": 0, "creation": 1620362821, "permalink": "/r/DecidingToBeBetter/comments/n6qkoy/yesterday_i_wanted_to_end_my_life_today_i_want_to/", "nsfw": false, "first_save": 1635437295.926944, "replies_charged": false}