{"id": "t5_2tand_t3_mbygz0", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "I get up late EVERYDAY. It's not a little late nonono its the fucking afternoon once I get up. I'm sick of wasting a whole half of my day when i can be productive. It's currently 1:30 in the morning, i have makeup work due and current stuff due. I want at least all of my classes to be an A. I'm turning in any work i made mistakes on in and im gonna make sure i make it to my zoom calls to get help. I'm gonna work on making up my bed in the morning when i wake up instead of turning back over. I'm gonna make sure I'm caught up in school. I'm gonna break my habit of eating overnight, today i made sure i stopped myself after 1 and yknow what? i feel fucking fantastic dude.   \n\n\nWill i be going to bed late tonight? Most likely. But does it matter? No, because rather than goofing around im gonna spend it catching up on late work and makeups. I'm gonna make sure i have my plans set that way i dont end up off task and messed up. Today is gonna be a good day. I've switched my diet already to something that'll help me lose the weight to get to a healthy weight and then i can work towards shaping myself to be someone i find good looking and happy.   \n\n\nI've been showering more often too. That probably sounds gross to yall but taking care of myself is really difficult atp. But yknow what ive been doing now? I make sure i shower at least ever 1-2 days (everyday or bi-daily?) and at least once a week i take a bath as a relaxer and ive never felt better. I even washed my hair a few days ago and i feel much better. My life is finally gonna be on a good track whether or not my family and friends cheer me on or not. I'm gonna be happy whether or not they're there with me along the way. I'm finally gonna be happy :)   Its really nice to get this off my chest so even if yall dont read it ill know its out there", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mbygz0/im_done_with_wasting_away_im_making_the_full/", "title": "I'm done with wasting away, I'm making the full change today", "social_network": "reddit", "user": "brunomarswifey", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1616564210, "permalink": "/r/DecidingToBeBetter/comments/mbygz0/im_done_with_wasting_away_im_making_the_full/", "nsfw": false, "first_save": 1635435903.0596852, "replies_charged": false}