{"id": "t5_2tand_t3_gvlnzd", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Let’s help encourage each other here, share ideas and resources, and hold each accountable so we can Do Better. Something I highly recommend and that I’ve done for the past several years (and will continue to do) is work and volunteer for 2 different mentor programs for inner city schools and at risk youth here in Connecticut. Change starts with us, as individuals, in our communities, choosing to take actions consistently. \n\nWe *all* have ways we can give back. I would encourage all of us to choose a way to support black lives better that feels genuine to you. Lots of posts on social media, but actionable steps need to taken in real life, every day. One of the things that has always resonated with me personally is volunteering. Extremely enriching, and also beneficial for those you are helping. There are SO many organizations that need help that benefit people of color. Giving service of my time is the least I can do I feel in a position of privilege. I feel it was very important for me to involve myself in this way, to give my time, service and support, as well as learn what I can, and how I can do more.\n\nLooking forward to hearing everyone’s comments. Maybe your comment and idea will resonate with someone else. There’s *lot’s* of ways we can decide to be better in supporting Black Lives, so please share.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gvlnzd/in_spirit_of_this_thread_lets_list_ways_we_can/", "title": "In spirit of this thread, let’s list ways we can all decide to be better to help racial injustice and support black lives. If you have a resource to share, actions you’ve taken or are going to take, please share those too.", "social_network": "reddit", "user": "connecticut06611", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1591152779, "permalink": "/r/DecidingToBeBetter/comments/gvlnzd/in_spirit_of_this_thread_lets_list_ways_we_can/", "nsfw": false, "first_save": 1635437859.6604712, "replies_charged": false}