{"id": "t5_2tand_t3_jpllic", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "(I also posted this to r/self-improvement but thought I'd try posting it here as well for possible additional advice.)\n\nHello All!\n\nI'm a long time viewer/commenter first time poster, so please be gentle. Also please forgive posting format (using my phone) and any flaws in grammer...I'm incredibly nervous.\n\nThis is going to be a long one with at least a bit of back story needed to help understand where I'm coming from. TL:DR at the bottom. Alright, let's get to it! ^_^\n\n~ Backstory ~\nSimply put, life hasn't always been kind. My parents divorced when I was very young and not too long after my mother met, Dick (fake name). This man was not only rather tall and overweight (which made him rather intimidating to my young mind) but incredibly abusive. Physically, mentally, and emotionally. Unfortunately he was also an incredibly manipulative narcissist. One of those people that in front of almost anyone else would seem like they were doing the best they could, they don't understand why others are accusing them of such atrocities, they need help with these out of control children who aren't even theirs but are raising them as their own, and so on. Behind closed doors, a complete 180. Yelling, screaming, name calling, belittling, having to do 50 (military grade) push-ups/sit-ups perfectly or you have to start over, standing with nose in a corner for time outs lasting anywhere from thirty minutes to a couple hours, objects being thrown, spankings so hard they left welts....I think you get the general idea.\n\nUnfortunately as my mother had grown up in an abusive home herself for a long time she couldn't find the strength to leave (she is still ashamed of it to this day) until I was about eleven years old. After a short troubled youth my relationship with my mother, biological father, and siblings ( three brothers, one sister) improved greatly. A few years passed and I (17 at the time) met, Brad (fake name), which started five year span of my first abusive relationship.\n\nWe were both young and dumb, not sure of what we wanted...ended up being stupid and I got pregnant. But some of my stupid choices had lead Brad to be incredibly controlling. After a couple years (and one more child together) it got to a point where not only did he need to know where I was going but a family member had to be with me and report back to him if I was seen even talking to another guy. Add to it his mother and sister hating me from the start and finding any little thing they could to complain to him about me. I was in that environment for about five years.\n\nJump forward another couple years to 2014 where I end up reconnecting with a couple of friends from high school. One being an old crush named, Chad (fake name). He and I started dating at the end of that year and things were wonderful...they seemed so much better than they were with Brad...but oh how wrong I was in a bit of a different way. Unfortunately I found myself in a relationship with someone similar to Dick in that of a manipulative narcissist. The longer things went on the more he would make our fights out where I was the bad guy, I was the unreasonable one, I was over-reacting, sure he may admit to something small but I was the one who was mostly in the wrong, and so on. Was in that one till the beginning of this year.\n\n~ Now Onto The Recent Event That Lead To This Post ~\n\nHere within the past few months I have been seeing someone who is entirely different from anyone I have ever been with before. And so far....he's actually been treating me right. With that, we come to where I need a bit of advice. My boyfriend, John (fake name), and a couple friends are planning a birthday party for me. They've even invited a couple of my family members who still live out here (which neither Brad nor Chad ever did because neither of them liked my family) to attend. And lately...John has been asking me for gift ideas for me...because no one really knows what to get me.\n\nOver the years I have grown more and more under the belief and feeling that I don't want people to get me gifts. Aside from something like Christmas, I almost hate getting gifts. I always feel terrible that people have spent money on something for me that they could of (and in my opinion should have) been spent on more important things. Whether it be bills, their cars, their hobbies, or just something nice for them. Anything but me. Its such a gut kick reaction that I can almost go into a minor panic attack at the mention of someone wanting to get me something.\n\nBut I do also realize that gifts are a way that people can show their love and I don't want to disrespect or hurt someone else because of my reaction.\n\nSo, how can I be more okay with receiving gifts? Or is there a way I can tell people to not get me gifts that wouldn't hurt or offend them?\n\n\nTL:DR - Abused past and abusive relationships have lead me to believe that I don't want or deserve gifts. Need advice on how to be better about possibly receiving gifts or politely telling people to not get me gifts.\n\nEDIT 1: I do want to quickly add that I do know that not all tall, larger men are like Dick.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jpllic/how_do_i_30f_become_better_about_accepting_gifts/", "title": "How Do I (30F) Become Better About Accepting Gifts?", "social_network": "reddit", "user": "HugPimpSymShady", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1604728320, "permalink": "/r/DecidingToBeBetter/comments/jpllic/how_do_i_30f_become_better_about_accepting_gifts/", "nsfw": false, "first_save": 1635436835.448539, "replies_charged": false}