{"id": "t5_2tand_t3_eyr37a", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "Now I'm mostly talking about things that are seemingly relatively harmless to me. I say this because I am not doing too bad considering I'm doing the degree I want at the uni I want and I have some amazing friends and an amazing girlfriend but those things don't mean I don't waste all my free time doing instant gratification stuff such as: gaming too much, smoking weed too much, nicotine and masturbating to porn. \n\nI like smoking weed but I wish I could do it occasionally and have a meaningful experience like I used to when I started. Now I feel like I'm \"bored\" and convince myself to do those  \"instant gratification\" things instead of things I know I genuinely get long term satisfaction from such as reading, making music and trying to get better at drawing.\n\nThose things ^ aren't exactly horrible things to do but I will literally form very structured arguments in my head like \"no you're not actually bored of that game you don't appreciate the design yet ! I bet you'll love it if you just keep playing!!\" ??? Like I know I want to do something else so why don't I just do that and enjoy it without hesitation? \n\nI know this is quite long winded but hopefully someone else knows what I'm saying ? JSYK I'm noticing this more intensely now because I'm currently on a year off from uni and my plan for this year was not to sit around-vape-smoke-weed-game-wank all day !", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/eyr37a/why_do_i_persuade_myself_to_do_things_that_are/", "title": "Why do I persuade myself to do things that are not good for me instead of stuff I really want to do?", "social_network": "reddit", "user": "Silt_Strider", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 43, "down_vote": 0, "creation": 1580827735, "permalink": "/r/DecidingToBeBetter/comments/eyr37a/why_do_i_persuade_myself_to_do_things_that_are/", "nsfw": false, "first_save": 1635438144.2652707, "replies_charged": false}