{"id": "t5_2tand_t3_kwnz7z", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "Most, if not all of our addictions are driven by a fear of leaving something that we feel is beneficial to us (even though we are aware that it is destroying us). Namely, the smoker thinks that life without smoking will never be as nice, the porn addict feels that their sexual desire will never be fulfilled  with another person, the video game addict feels that they would become a less interesting person for leaving their \"hobby\", etc.  \n\n\nThing is, we can live very healthy and normal lives without any of these things! In fact, we all did live such lives before we fell into the trap.   \n\n\nSo here is my suggestion to you. If you fear that life without your prop is going to be miserable, just try cutting out something else which you aren't so attached to. Perhaps you can stop buying your preferred soda, and just start drinking water for while. See how you feel about it after several days. You should realize that life isn't really any different, and you didn't really make a sacrifice. Life went on.  \n\n\nWhat I am trying to get at here, is that if you can show yourself that you can change any habit in your life without falling in a pit of despair, you can much more easily convince yourself that quitting your addiction won't be much different, and that won't really be as big of a sacrifice as you think (in fact it won't be a sacrifice at all)!  \n\n\nGood luck, and God speed!  \n\n\nP.S. Quit reddit and focus on real life relationships. Works wonders for mental health.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kwnz7z/face_the_fear_thats_stopping_you_from_quitting/", "title": "Face the fear that's stopping you from quitting you addictions indrectly", "social_network": "reddit", "user": "corrosive_air", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 25, "down_vote": 0, "creation": 1610566480, "permalink": "/r/DecidingToBeBetter/comments/kwnz7z/face_the_fear_thats_stopping_you_from_quitting/", "nsfw": false, "first_save": 1635435469.4082367, "replies_charged": false}