{"id": "t5_2tand_t3_e7xqk0", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "\nSome background on the purpose of this post. Like a lot of people here I have been on a slow and difficult but consistent path of self improvement. \n\nI used to game a lot. Even though it was never an addiction in the sense that it never affected my health, work, school and other priorities it did consume most of my leisure time. \n\nWhen I decided to be better, I chose to leave gaming, Netflix and other “unproductive” leisure activities behind and substitute my downtime with activities like reading, self learning math and sciences, and practicing guitar, piano and photography. \n\nHowever the appeal of TV and gaming is very strong and I recently bit the bullet on a purchase (because it was on sale it was even more tempting) that has me very conflicted and I need input from a sub like this.\n\nAlso important info: I am a pretty big Star Wars fan. I used to read a lot of novels and was an expert in the lore of SW. This also stopped when I decided to be better, as I considered it to be useless knowledge.\n\nWhat was the purchase? I bought an XBOX with the critically and fan acclaimed Star Wars the Fallen Order Game bundled. I received it a week ago and XBOX remains in its box although I really really want to play it.\n\nSo here is my question should I be so strict with myself? Should leisure time be optimized to avoid activities that yield no real world benefit? I have always struggled with the internal debate of doing what you want vs. what you should. I feel like I should return it as a game poses no real world benefit. \n\nEven though I would probably play only the weekends for only a couple of hours, (a maximum of 5-6 hours week), time is a zero-sum game. 5 Hours spent gaming during the weekend (which doesn’t seem like much considering Americans spend 2.5 hours during the weekdays in front of their TVs) is time that I could spend practicing guitar or taking photos. I could still spend time doing both type of activities but those 5 hours compounded over time will make a difference in my skill level in guitar vs. something virtual and fake. \n\nI am thinking I have 2 choices:\n\n One alternative which is not the best financial choice but is a happy medium, (since I bought the XBOX 1 X, the expensive high specs 4K version) is to just play the Star Wars game which is a single player story game, which should be a total 15 hours of my life and then just sell the XBOX. It is still 15 hours of my life that I waste but it is good balance between what I want and should do and is better than keeping it and buying other games that I still “want”(just not as strongly) to play and waste time for an indefinite period. \n\nOr I resisted for a week so far, (although I am in a constant serious internal struggle right now, grabbing the box almost opening it but not going through with it) but If I have resisted it so far, I can keep resisting until the the return window for the device is near and then return it. Or maybe in a moment of strength and impulse just return it.\n\nYour thoughts?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/e7xqk0/advice_needed_should_leisure_time_be_optimized/", "title": "Advice needed: Should leisure time be optimized? What is the right balance between what you want vs what you should do?", "social_network": "reddit", "user": "Guitardude30", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1575831548, "permalink": "/r/DecidingToBeBetter/comments/e7xqk0/advice_needed_should_leisure_time_be_optimized/", "nsfw": false, "first_save": 1635435296.2190466, "replies_charged": false}