{"id": "t5_2tand_t3_lw42a0", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "I'm nothing but an angry child throwing a tantrum.\n\nI dont get to have love, and it angers me so much to watch everyone treat their significant others like shit. And yes, you ALL treat your significant others like they are replaceable at any time, not comprehending, for whatever reason, that every single person is different and you can never replace anyone. But Im not allowed to point out how badly you treat others. I get to just sit here and watch it and be angry and jealous, because even though people don't treat each other well, I'm not allowed to take away their happiness.\n\nI dont get to have children, and when you neglect your child, or allow them to become, and get away with, being a bully, you fail not only your child, but every child yours come into contact with. Bullying traumatizes. Call me a pussy or a toddler all you want, you prove me right when you do. But I'm not allowed to call out your failures or defend the children needing defending, because I'm not allowed to take away anyone's happiness, even when they get their joy from evil.\n\nI will never be happy. I will never live the life I want and always dreamed about. I will never feel anything but emptiness and rage and despair. But I'm not allowed to stop people from spreading false hope. Words and phrases that everyone says because \"you don't know what else to say\" words that are nothing but promises that if you believe you will be destroyed because life doesn't care about you, and no person will ever give a shit about you if you can't provide anything.\n\nI'm not allowed to take away others happiness, even though every single person in my life has taken my happiness from me. I know that now.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lw42a0/comparison_is_the_thief_of_joy/", "title": "Comparison is the thief of joy", "social_network": "reddit", "user": "re_baked_cinnabun", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1614697620, "permalink": "/r/DecidingToBeBetter/comments/lw42a0/comparison_is_the_thief_of_joy/", "nsfw": false, "first_save": 1635437292.4159846, "replies_charged": false}