{"id": "t5_2tand_t3_df12gv", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "This quote hit me like a ton of bricks as it is something I subjected to years ago. It could not be further from the truth. We cannot and should not rely on toxic partners and people to treat us in a way that will magically make us better or unlock our potential or best life.\n\nIf you want to be better and do better in life, treat yourself better! Don't wait around to be loved or for someone to make u feel like u are worthy. You are your own damn person and you can be your best self and fulfilled and happy without any of the people around you changing first.\n\nMy life changed when I went through a time where I was treated really badly. Only then did I realise being happy and fulfilled was up to me. If I knew that before I may have been a better partner myself and been treated accordingly.\n\nLove yourself and treat yourself like you want others to treat you as well! Don't treat them like God's and Goddesses but forget about treating yourself well too! The way you see and treat yourself has more to do with how you feel than any nice thing anyone can say or do. It also makes others see your worth. \n\nDon't wait on people who won't do for you what you can do for yourself. \n\nI don't know if there was someone meant to see this but I hope so. Even if its just one person.\n\nEDIT: I never meant to offend people who think you should have great people in your life. Yes you should but my whole point was not to rely on toxic people to change before you can finally have a better life. I deal with people in my profession who say the worst things about themselves and say how a partner existing or new would improve their self worth. That's what I am trying to tell the people who need to see it, to break away from.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/df12gv/i_saw_a_quote_on_how_people_are/", "title": "I saw a quote on how people are different/better/fulfilled more when treated and love correctly by their partners and I could not disagree with the mindset more. Don't rely on others to be better.", "social_network": "reddit", "user": "neverendingOhana", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 60, "down_vote": 0, "creation": 1570546480, "permalink": "/r/DecidingToBeBetter/comments/df12gv/i_saw_a_quote_on_how_people_are/", "nsfw": false, "first_save": 1635436700.7776108, "replies_charged": false}