{"id": "t5_2tand_t3_9m82vl", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "**1. Using your phone, tablet or computer in bed**\n\n&#x200B;\n\nMany people are unaware of the harms of this very bad habit in terms of sleep and productivity. Blue short-wave light - very present on sunny mornings, for example - plays an important role in mood, energy and sleep quality. When you wake up, when your eyes are directly exposed to it, this blue light stops the production of the sleep hormone, melatonin, and makes you more alert. In the afternoon, the sun's rays decline, allowing your body to start producing melatonin again and gradually tire you out. At night, your brain does not expect to be exposed to blue light. He is therefore very sensitive to it.\n\nMost of the devices you use in the evening - computers, tablets and mobile phones - emit bright short-wave blue light that lights up your face directly. This exposure deteriorates melatonin production and interferes with sleep and sleep quality. As we have all seen, a bad night has disastrous effects. The best thing you can do is not to use these devices after dinner (television is not disturbing to most people as long as they are within a reasonable distance of the screen).\n\n&#x200B;\n\n**2. Being addicted to the internet**\n\n&#x200B;\n\nFifteen minutes of concentration are needed to fully immerse yourself in a task. Once launched, you enter a state of increased productivity, the flow. Research shows that people in a state of flow are five times more productive than in normal times. When you detach yourself from your work because you are itching to watch the news, Facebook, a sports result or other, you get out of this state. It will take another 15 minutes of continuous concentration to return. If you disconnect too often during your work, you can spend a whole day without being in the flow.\n\n&#x200B;\n\n**3. Checking your phone during a conversation**\n\n&#x200B;\n\nThere's nothing more irritating than watching you read a text message in the middle of a conversation, or even taking a quick look at your phone. When you engage in a conversation, devote all your attention to it. You'll see, discussions are more pleasant and effective when you get involved.\n\n&#x200B;\n\n**4. Receiving too many notifications**\n\n&#x200B;\n\nThey are a nightmare for productivity. Studies have shown that throwing yourself on your phone and email box as soon as the alert sounds greatly reduces your productivity. Receiving a notification each time a message arrives may generate a feeling of productivity but it is a decoy. Instead of working at the pace of your notifications, group all your emails/SMSs and check them in predefined time slots (e.g. respond to them once an hour). Tests have shown that this method works.\n\n&#x200B;\n\n**5. Saying \"yes\" when you should say \"no\"**\n\n&#x200B;\n\nResearch at the University of California at San Francisco shows that the harder it is to say no, the more likely you are to feel stressed, burned out or even depressed. Each of these symptoms affects self-control. Saying no is indeed a major challenge for many people. It's a strong word, but don't be afraid to use it. When appropriate, people with emotional intelligence avoid phrases such as \"I don't think I can\". Saying no to something is a sign of respect for your present commitments and because it gives you the opportunity to honor them properly. Remember that saying no is an act of self-control that increases your future mastery by avoiding the negative effects associated with excessive involvement.\n\n&#x200B;\n\n**6. Thinking about toxic people**\n\n&#x200B;\n\nYou can't escape these people who permanently irritate you. So every time you catch yourself thinking about them, tell yourself how lucky you are to be friends with someone much more positive. The last thing you should do is think about the people who don't count instead of the people who do.\n\n&#x200B;\n\n**7. Do several things at once in meetings**\n\n&#x200B;\n\nAlways devote yourself fully to what you are doing. If a meeting doesn't deserve your attention, you don't have to do anything about it; if it is necessary, get as much out of it as possible. Doing several things at once in a meeting is frowned upon because it gives the impression that you think you are more important than others.\n\n&#x200B;\n\nLet me know your thoughts below!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9m82vl/7_bad_habits_to_avoid/", "title": "7 Bad Habits to Avoid", "social_network": "reddit", "user": "10xurlife", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 232, "down_vote": 0, "creation": 1538941456, "permalink": "/r/DecidingToBeBetter/comments/9m82vl/7_bad_habits_to_avoid/", "nsfw": false, "first_save": 1635437685.7123916, "replies_charged": false}