{"id": "t5_2tand_t3_kfepzc", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "“There is no heavier burden than an unfulfilled potential.”\n\n**― Charles Schulz**\n\n**Big habits I'm currently trying to implement:**\n\n* To execute at least 1 hour of deep work every day for 30 days (currently on day 0).\n* To get ready for bed at 11:30 pm at the latest and to be in bed by 12 am every night for 30 days (currently on day 0).\n* To execute proper teeth care for 30 days (currently on day 0)\n\n**Big habits that I have successfully implemented:**\n\n* To wake up at 8 am every day for 30 days (from October 26 - November 24 2020).\n* To go to the gym 3-5 times per week for 30 days (from November 9 - December 8 2020).\n\n**Was my day a success? How am I feeling?**\n\nToday was an utter failure. I got my hour of walking done but other than that no other goals were executed. I felt shitty about it for a while, but then I read something that made that fire inside of me burn. I read that a 20 year old has about 3000 weeks to live. I'm currently 20 years old.\n\n3000 weeks is not that much. And out of those 3000 weeks, how many of those weeks will be from one's younger days?\n\nLet me do a quick google search. There are about 500 weeks in a decade. 500 weeks is nothing.\n\nIt's time to step the fuck up. It's time to stop with all the excuses. It's time to give myself some tough love.\n\nWithout self-discipline nothing matters.\n\nI told myself yesterday that if I missed another day of deep work, that challenge would go to 0. And that's exactly what I'm going to do. If my lazy ass is too lazy to do just one hour of deep work then I don't deserve to go on to day 27 or whatever day it was on.\n\nNow that I have all my emotions out, let me think rationally. What is going wrong here?\n\nThe problem is that I tried to do too much at once. Research shows that a beginner should focus on implementing 1 habit at a time. Furthermore, a person who isn't a beginner should focus on implementing a maximum of 3 habits at a time.\n\nI tried to rush through the process. This entire process is not able hitting singular goals. It's about creating a lifestyle that allows one to thrive. That's how I need to the look at things. Slow and steady wins the race.\n\nAlong with the deep work goal, which has now been restarted, I have decided to add the two habits which I think are most beneficial right now. The first is about fixing my sleep time. The other is about teeth care. I'm going to start flossing every night and making sure I'm brushing my teeth properly twice per day.\n\nWith all that being said, I'm still grateful. I have an amazing life and an amazing family. I'm going to work harder and smarter on achieving my goals and becoming the person I know I am.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kfepzc/day_53_of_my_selfimprovement_process/", "title": "Day 53 of My Self-Improvement Process", "social_network": "reddit", "user": "DoerThinker", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1608268080, "permalink": "/r/DecidingToBeBetter/comments/kfepzc/day_53_of_my_selfimprovement_process/", "nsfw": false, "first_save": 1635435471.017201, "replies_charged": false}