{"id": "t5_2tand_t3_np615u", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "I (24, F) just went through a breakup with a wonderful person. Still care about each other a lot. The whole thing has left me thinking about the little reasons that led up to this and I know that one of the reasons was that I was insecure. I made tons of time for him and would then feel really needy  whenever he would make time for his own interests/pursuits while we were hanging out. I always respected that about him, his determination to work on his dreams and not slack on them. Whereas I don’t even really know where I’m going in life, I have interests and goals that I love but I drop them to hang out with him (and have done so in my past relationships too), which leaves me feeling clingy for attention when I don’t feel the same in return from him. So in a sense I pushed him away, and he distanced himself. There were other bigger reasons for the breakup that were out of my control but this is the one I have been mulling over a lot. I’m done with shoving aside my dreams in exchange for attention/affection from a partner. I want to feel headstrong in my life choices and stick to them. I love guitar playing and songwriting, and have been told I could really get somewhere with it if I just dedicate my time to it, but I never really learned good self-motivational skills or hard work for the sake of self-improvement (I was a so-called “gifted kid” who never felt the need to study hard, which is really coming back to haunt me now, but that’s a whole other story).\nIn short, I want to just be done with this whole neediness thing and have the confidence to go after what I want, and I’m so used to the opposite that I don’t really know how to stay focused with it and stop 2nd-guessing myself, stop feeling insecure about my choices. I know that’s a big, vague statement but any tips or advice would be appreciated. Thank you:)\n\nTL;DR\nMy breakup has left me determined to stop pushing aside my dreams for the attention of a partner, but I don’t really know where to start or how to gain the confidence that my pursuits are worth the time/effort.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/np615u/breakup_made_me_realize_my_insecurity_about/", "title": "Breakup made me realize my insecurity about pursuing my dreams, and I need help", "social_network": "reddit", "user": "ResearcherOwn8552", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1622474972, "permalink": "/r/DecidingToBeBetter/comments/np615u/breakup_made_me_realize_my_insecurity_about/", "nsfw": false, "first_save": 1635435261.3005884, "replies_charged": false}