{"id": "t5_2tand_t3_kkigab", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "Since puberty I've been into a bizarre fetish called 'feedism' which is arousal at the act of women deliberately overeating, gaining weight, especially belly fat... conversely I get turned off by fit/thin girls.\n\nFor obvious reasons it's a **FUCKING ENORMOUS** problem. It's ruined my romantic relationships and sex life...and self confidence...and even my sense of morality... but nothing else turns me on very much.\n\nI feel like shit for indulging in it because I'm a fit guy, and I hate greed and unhealthiness. \n\nI feel like shit for encouraging others to be unhealthy for my own pleasure (even if they're into it).\n\nI feel like shit for not managing to break away from this stupid lizard brain years ago.\n\nI feel like shit for trying to find a girl who will be down with gaining weight in real life. As a girl once said when I told her about it; *If you cared about me, wouldn't you want me to be healthy, even if you're not really into it?* \n\nSometimes I feel like shit for feeling like shit for having this fetish, after all I didn't ask for it, maybe I should stop being so negative and keep trying to find someone else with it?\n\nAnyway things have reached boiling point...\n\nI recently turned down a beautiful girl I really liked because she was too 'fit' for me and she had no interest in gaining weight so I was attracted on one level but not very sexually aroused by her. \n\nGood for her...Who the hell in the right mind would deliberately gain weight?   Who the hell would be ok gaining weight in their belly of all places...at least fat asses and boobs are ok because of the kardashian body image... society treats belly fat like it's cancer cells. Plus it's very unhealthy. \n\nI've been trying to cut out fetish porn...but I still find myself having fantasies about it. Or I'll walk past a girl with a chubby stomach and get extremely turned on... or a girl I'm dating will start working out more and I'll break it off with her and blame it on myself. \n\nMy sexuality seems incompatible with my values quite frankly. \n\nI'm not sure what to do about it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kkigab/i_need_advice_to_help_me_overcome_an_awful_fetish/", "title": "I need advice to help me overcome an awful fetish that's ruining my life...", "social_network": "reddit", "user": "faithinstrangers92", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1608988617, "permalink": "/r/DecidingToBeBetter/comments/kkigab/i_need_advice_to_help_me_overcome_an_awful_fetish/", "nsfw": false, "first_save": 1635437780.6297317, "replies_charged": false}