{"id": "t5_2tand_t3_pggbck", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I realised that I'm so f#cking toxic. I'm so selfish and I constantly think only about my happiness. I expect everyone to help me but I'm not even interested in helping others. I use others for help. I have anger issues and it has become uncontrollable. The anger over powers my thoughts, wisdom and I become hurtful.\n\n And if someone hurts me, I become extremely vengeful and can hold grudges for way too long that it can completely destroy me. I become vengeful to the point that I hurt whoever hurt me. Even the person who has helped me get through tough times in life and been there for me every hour of life.\n\nMy anger and vengeance spares no one. All I can think of is revenge. And after that, I feel better. \n\nI take everyone and everything for granted. I am not grateful. It's tough for me to be kind. I cannot stand criticism. I defend myself so much and cannot accept that I am wrong.\n\n I get very jealous of people too. If they seem to have and enjoy what I don't have in my life, I will become very jealous. \n\nI am just like my father. He can be very angry, vengeful, hurtful and what not. He is pretty manipulative and narcissistic (Maybe I am a narc too, idk). The point is I've got all these characters from my father. These are in my genes and I was not aware of it until my mum and sis pointed those out. I f#ck up a lot because of my character. I hurt my mum and sis a lot. \n\nWith all these traits, my dad has achieved nothing in life. If I don't change myself, I am pretty sure that I will end up exactly like him. I can clearly see how much of a failure he is because of who he is. Nobody likes my dad. Not even his own mother. I don't wanna end up like him.\nI hate my father and I hate it that I am like him.\n\nI lack self-esteem. I am beautiful but I need validation from others. I am highly insecure. Others can easily put me down and I lack confidence. I can study pretty well and I have the ability to achieve my huge dreams and goals. But I am afraid that my character will hinder my success. \n\nI don't want to hurt anyone, anymore. I wanna be kind, helpful, forgiving and happy. I want some advice so that I can become better. Thank you for reading my long ass post.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pggbck/im_so_toxic_and_i_feel_helpless_about_it/", "title": "I'm so toxic and I feel helpless about it.", "social_network": "reddit", "user": "DeeChris1", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1630583549, "permalink": "/r/DecidingToBeBetter/comments/pggbck/im_so_toxic_and_i_feel_helpless_about_it/", "nsfw": false, "first_save": 1635435364.470492, "replies_charged": false}