{"id": "t5_2tand_t3_p42vtk", "request": ["4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "Im  not sure how to start this, but Im gonna try my best. In short, I  always thought of myself as an idiot. Not as like an idiot that you call  someone whenever they do something silly, and you obviously dont mean  it, but an idiot in a literal cognitive sense. Kind of like a Forest  Gump type, more intellectually impaired than average. Im not saying Im  that kind of person but I feel like I come somewhat close to it, as if  my cognitive abilities are borderline to it. To start, I didnt speak  until I was 3. Due to the irregularities of my language acquisition as  well as other behaviors I exhibited at the time, I was put under a PDD  diagnosis(pervasive development disorder). I also was diagnosed with  ADD. Over the years I had to take speech therapy and special education  classes. Grade wise, I did pretty well, however I still did awful on  standardized tests which placed me in special education. Besides that, I  understood the depth of intellectual conversation that my peers were  having with each other but I could not mimic it. In spite of this I had  no idea how to form friendships or even hold a conversation with my  peers. I feel like I always had to get someone to repeat what they said  to me, just so I dont lose focus, something I experience now to a less  degree. Some ideas may not click with me and I tend to repeat what has  been said in my mind just for me to understand completely. Ik online iq  tests are some of the worst in regards to testing intelligence, but I  usually averaged a score of 110 on my first tries. I did not place in  special education classes in high school, and was on the honor roll and  the NHS(national honor society). I figured it was just matter of luck,  as I didnt really take any hard classes, and just learned how to bs the  mid level ones. I guess thats it, I cant really think of anything else.  Even now, I still have a hard time coming up with facts/reasons and  putting them together in coherent ideas and sentences. I figured I would  have aspergers or autism, but theres always this thought of me having  something greater and worse. Im 21, and I feel like Im stunted compared  to everyone else Ik who are killing it in their careers, while Im still  struggling figuring out who I am, what makes me tick as an individual.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p42vtk/is_it_possible_that_i_could_have_an_intellectual/", "title": "Is it possible that I could have an intellectual disability, or am I overthinking it?", "social_network": "reddit", "user": "ramenlove2200", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1628922439, "permalink": "/r/DecidingToBeBetter/comments/p42vtk/is_it_possible_that_i_could_have_an_intellectual/", "nsfw": false, "first_save": 1635437470.3231893, "replies_charged": false}