{"id": "t5_2tand_t3_4scayu", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "People that are sad, continue to be sad. They like it. They’re sad. If they didn’t like sadness, they would pop-right out of it saying “Oh shit. I was sad. I want to be happy now.” But they continue to go deeper into their sadness. Deeper and deeper.\n\nImagine a world where you could solve someone’s problem (mental or otherwise). Now imagine the long-line outside of your home of people waiting for you to solve their problems. Now imagine that you couldn’t ever solve anyone’s problems. Imagine the weight lifted off your shoulders. You can’t make everyone happy, and you can’t make anyone happy. You can make someone smile while they’re in your presence, but happiness fades away if the container is broken. So is it your job to mend it? How much will you continue to mend? What exactly is your methodology of creating no-sadness. Or no stickiness to sadness. No blues. No rhythm. No art. No music. Sadness is a creative force, even though you don’t want to do anything when you’re sad. Sadness can be everlasting, and some people can die living their whole lives in sadness, or even kill themselves.\n\nWhat if no-one could make you smile, but your own self. What if the answer is hidden in the self. What if everything so far has been a hoax, and now needs you to master your own, in order to just be happy and in bliss. You don’t need to tell anyone to be happy, they just are. And when they’re sad, you can’t help them. Let go of wanting to make someone happy all the time, and you’ll realize that you’re now just happier. Regardless of how long the awkward pauses may continue.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/4scayu/letting_go_of_the_need_to_make_people_happy_all/", "title": "Letting go of the need to make people happy all the time", "social_network": "reddit", "user": "sanchitkhera11", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1468260053, "permalink": "/r/DecidingToBeBetter/comments/4scayu/letting_go_of_the_need_to_make_people_happy_all/", "nsfw": false, "first_save": 1635435657.1869073, "replies_charged": false}