{"id": "t5_2tand_t3_lme6yn", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": " \n\nI've always hated education. It is a large part of a few factors on why I have hardcore depression and suicidal thoughts. My entire life I have   been groomed to believe that college is necessary just like many of you   reading this probably were too. Over time I have realized more and more   how false it is to say that college is necessary to succeed in life,  but  after all those years of work to build myself up for college...I  don't  know what to do now that I am leaving it.\n\nI don't have any skills in particular. I have never had a job. I am 18. I have 6 months to repay college loans. I do not have a permit or a   license (though I plan to study my permit very often now and hopefully  get it within a couple of months). I have less than $100 in my bank account but am fortunate enough to be able to live off my parents for a  while. In school I was best at History and English. I hate Math and   Science, and English is just whatever for me. History is the only subject that ever interested me. I really enjoy taking photos, though I  only have a smartphone to do it with. Besides that, I have spent my  days  playing video games, jerking off, and sulking in the darkness of  my  room over how much I hate my life. I want to change this, get a job,  and  succeed in life.\n\nWhat should I do? What are the first steps I should take with 6 months remaining to get my shit together? Any recommended jobs that don't require a college degree? Any advice at all that could aid me in any way?\n\nI have searched for different types of jobs and am having difficulty  finding something, especially during this disastrous COVID-19 situation.  I know I am not in any position to be picky, but if possible, please   tell me of any types of jobs that are safer during this pandemic.\n\nAny help would be HIGHLY appreciated and I will take any form of advice. Thank you fellow Redditors.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lme6yn/dropping_out_of_college_and_dont_know_what_to_do/", "title": "Dropping out of college and don't know what to do next. I want to improve my life and leave this painful path behind and start anew. Please help me.", "social_network": "reddit", "user": "azzeeter", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1613624228, "permalink": "/r/DecidingToBeBetter/comments/lme6yn/dropping_out_of_college_and_dont_know_what_to_do/", "nsfw": false, "first_save": 1635436624.665478, "replies_charged": false}