{"id": "t5_2tand_t3_duseuz", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "First of all, I want to thank people on this sub for making me see things from a different perspective. I was at my lowest point at the start of this year. Unemployed. Clueless. Stuck. Ruminating. And basically bitching about everything in my life.\n\nI've not achieved much since and I still have a long way to go but the difference this time is my attitude. Taking responsibility and fucking owning my actions. \n\nSo here's what I'm going to do in the next 50 days.\n\n* Set daily goals and make them small enough to achieve. \n\n\n* Celebrate (silently) small victories. And reflect on failures.\n\n\n* Continue to stay off social media. This is important because it's very tempting to see what everyone's doing during the holidays. Continue to mediate and journal everyday.\n\n\n* Develop at least one new habit before the new year. I think I'll set aside 30 minutes of self-improvement time every morning. It can be for anything productive. Exercise. Reading. Coding. Dance. Anything that my future self will thank me for.\n\n\n* Recognize that NYE is not the end of the journey and this engine doesn't stop there. It's just a date to mark a milestone - which is not set in stone. I'll not be hard on myself if I don't meet my goals by then.. as long at I try.\n\n\n* Remind myself that luck favors the hardworking and the fruits of hard labor is rarely seen instantly.\n\n\n\nThat's it. I just wanted to get this out in writing so I can revisit it later. I hope you can take a leaf out of this too.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/duseuz/50_days_till_the_end_of_the_year_make_it_count/", "title": "50 days till the end of the year. Make it count.", "social_network": "reddit", "user": "prog-nostic", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1035, "down_vote": 0, "creation": 1573479109, "permalink": "/r/DecidingToBeBetter/comments/duseuz/50_days_till_the_end_of_the_year_make_it_count/", "nsfw": false, "first_save": 1635436515.026076, "replies_charged": false}