{"id": "t5_2tand_t3_mho57x", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "f29068b1-c751-4543-b3a6-9d58b1182ab7", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I (F,26) grew up in an abusive family setting. My parents were the kind of parents that brought down my self esteem and did not respect my personal space (typical toxic traditional Asian household) but I was lucky enough to get out at the age of 18 and never looked back. \nAs I am not bad academically, I was able to get a good job and living away from my parents gave me the freedom to be surrounded by good people, I have an amazing group of friends that I'm grateful to have. \nBut outside of my friendship, things have not been good in other aspects. I did get good position and worked hard but after a while I've always felt like I was \"taken advantage\" of for my contribution, like I keep working and people keeps pushing and took my hard work and achievement for granted. This ended up having me changing jobs a lot more frequent compare to my friends and stopped me from having a stable career (my ADHD also play a role in this too). With people outside of my group of friends, things are also the same. As someone who loves passionately I am easy to fall for people, and have people loving me too, but several years or months down the line people...starts changing their attitude towards me and its a familiar story for me until this point to have your partner take you for granted (the best scenario) or straight out walk all over you and cheated (the worse scenario). \nSo long story short, after long and hard observation my life until now and multiple talks with my friends about how I always ended up with \" assholes\" or \"bad workplaces\", I was told one thing that shocked me until today: I have a very poor set of boundaries and my avoidance of confrontation and inability to say no leads to me having negative aspects about people, accusing them of taking advantage of my kindness, devotion or hard work...and end up letting things all blow up. My friend said because they are my friends and I was very lucky to find people who know me enough to not crossing any \"invisible\" line even when I never said it, I was fine with them, but, quoted by my friend, \"most people are just people, and sometimes they'll just do things that hurt you without knowing, and if you never said anything about it they'll take it as normal and never stops\". \nI think what my friend said was true because I never had that sense of boundary growing up, and the Confusion mindset that I was taught as a child has never mentioned about those things and was all about obeying your parents, your boss, your husband,... That plus my people pleaser nature, and my soft, mellow personality is pretty much a perfect recipe for unhealthy, imbalance relationships and unhappiness.\nSo, in short, in order to not keep blaming people in my life, and set myself on the course of happy, stable relationships, I need to work on my personal boundaries. But I don't know how. Apparently it's a skill that needs to be learned and practiced, but I don't know where to start. What book should I read, or what practice should I begin with to create and maintain what they call\"boundaries\"? As someone who's so used to living the way that I was, standing up for yourself sounds like a terrifying thing to do.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mho57x/how_to_start_setting_your_boundaries/", "title": "How to start setting your boundaries?", "social_network": "reddit", "user": "Khemkhem1012", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1617253744, "permalink": "/r/DecidingToBeBetter/comments/mho57x/how_to_start_setting_your_boundaries/", "nsfw": false, "first_save": 1635435187.6718402, "replies_charged": false}