{"id": "t5_2tand_t3_okk4qs", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "since mid may of 2021 I have not been feeling my best. And this time I knew it was something else. In June's first week I realized it is taking over me and I decided to tell someone. I am extremely close to my parents, they understand me and my issues and so i chose them. I have been active on social media, and my friends know I have not been having a good time. But they don't know about the depressed feelings. Many dark times have resurfaced in the past month. It was bad.\n\nGathering the courage to tell them was a whole different task. I had been trying from 2 weeks. But last night, something inside me at 12'o clock in the night told me to just go to their room and say it. So I did. Tears were shed, anxiety was made to shut up, overthinking was talked about, feelings were validated and I feel good.\n\nMaybe this was my biggest limiting belief. Even if the smallest part of me is affected in a good positive way, it makes a big whole difference. This morning waking up, I knew that I donot have to mask my feelings. This is a sign if you feel \"not great\" in anyway, you will get better and live happily again.\n\nthank you for reading. sending love and light to all.\n\nedit: thank u so so so much for all the encouraging, inspiring comments and the awards!! I am glad this post could help people. i hope everyone has a good day!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/okk4qs/i_told_my_parents_about_my_depression_and_i_feel/", "title": "i told my parents about my depression and i feel good", "social_network": "reddit", "user": "Stupid-Biologist11", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 592, "down_vote": 0, "creation": 1626318582, "permalink": "/r/DecidingToBeBetter/comments/okk4qs/i_told_my_parents_about_my_depression_and_i_feel/", "nsfw": false, "first_save": 1635436927.1901104, "replies_charged": false}