{"id": "t5_2tand_t3_q4cvl4", "request": ["c67213dc-0eed-4cac-a781-9bc082742908"], "text": " What it says in the title. I’ve been through a lot of bad relationships, I’m currently starting a relationship with the woman of my dreams, and I want to figure out what I've done wrong in the past so I don't mess this one up.\n\nMy first serious relationship was at 28 (I spent about 13 years before that sleeping with dozens of people, mind you) with a wonderful young man that I’d tucked under my wing. He was living away from home for the first time and was kind of an introvert, so I taught him how to live. We’d been friends for a year when we started dating, and we even started a business together. Everything seemed to be great! We had a ton of common interests, great sex, etc. Probably the best relationship I’ve ever had. And then, with no warning signs, said that I was horrible to him and impossible to work with, and left. And I mean LEFT. Moved out to live with a friend, left the business as quickly as he legally could, wouldn’t hang out as friends. I spent weeks trying to reason with him over text, and he blocked me. I don’t understand what I did wrong.\n\nImmediately after that, I started dating my secretary. It was not a perfect replacement. She didn’t have the best sense of style, was overweight, etc. I realized very quickly that she had extremely low self-esteem, though, so it was easy to try and get her to change, and she absolutely lapped up positive attention. We dated two years in total. It started out as a rebound, but by the end, I genuinely wanted to be with her. She broke up with me without saying why. I didn’t push it because we still had to work together. Later, her friend said that it was because she found me controlling.\n\nI waited a couple years before I dated anyone seriously again. Then I met a woman. I knew she’d be a hard one to keep, but I wanted her. And I was pretty wealthy and she was young, and she was starstruck by me. Things were amazing between us. I even helped her get a job as a voice actress. We went to clubs, the sex was amazing, and… I got her into cocaine. I can do the occasional line without it affecting me much, but apparently, she couldn’t. She tried and failed to quit while with me for around a year, and then broke up with me to get clean. Well, when I heard she’d gotten clean, I contacted her about dating again, and she said that she’d gotten her head on straight in therapy, that I was very manipulative and abusive, and that she never wanted to hear from me again.\n\nI’m not proud of this, but I sought out a rebound. He was an acquaintance, and probably the meekest person I know. I was still mourning the last relationship and wanted someone I wouldn’t need to put much effort into and could treat however I wanted. And it was fine. He always gave me attention when I wanted it, and I always gave him attention when he wanted it. He never complained about how I treated him, which was nice compared to the women I’ve dated. After a year without any other promising romantic leads, I asked him to move in with me. Again, it was fine.\n\nAnd then, I met my current love interest. She’s amazing. Wow. Incredible musician with a high-paying job in the entertainment industry, drop-dead gorgeous, we got along great, she’s over a decade younger than me, just perfect. After she'd gone on a few dates with me, I broke up with my old boyfriend for her.\n\nAs of right now, we’ve been dating for four months. And I’ve just been thinking a lot about how I treated my last partner (admittedly, I was pretty mean to him). Obviously, that’s not going to fly with this woman, and I’ve been doing my best not to fall into the same habits I established while dating him. And… I’ve realized that I really don't know how to be a stellar partner. It's hard for me. All my other long-term relationships ended with the other person deciding that I was doing something wrong. I’m trying to figure out what \"right\" looks like. I usually date people who are either much younger or me or are psychologically vulnerable, so this woman, who seems to have no weakness, is kind of scary to me.\n\nCan you guys help me figure it out? I want this woman in my life for the long haul- I don’t want to ruin this.\n\nTL:RD: I have a long history of relationships that ended terribly. How to make this one different?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q4cvl4/i_have_a_long_string_of_relationships_behind_me/", "title": "I have a long string of relationships behind me, and I've met someone I love. I'm trying to figure out how to do better this time. Help?", "social_network": "reddit", "user": "Ill_Swordfish_275", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1633748469, "permalink": "/r/DecidingToBeBetter/comments/q4cvl4/i_have_a_long_string_of_relationships_behind_me/", "nsfw": false, "first_save": 1635436277.1410222, "replies_charged": false}