{"id": "t5_2tand_t3_nscr4a", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "I want to be better, ideally I would like to wake up at 6 am be ready by 7 study at my local coffee shop for two hours then go to work, after work I would like to study for a couple more hours either at the library then go home and relax for the rest of the evening then go to bed at a reasonable time. Alongside this I want to work as hard as possible and be as reliable as I can be. \n\n&#x200B;\n\nAnd here starts my problems which I dont know how to combat to achieve these goals. \n\n&#x200B;\n\n1. I cannot for the life of me get out of bed in the morning \n2. I have the hardest time focusing when I study \n3. When I get home (I live in an apartment) all I want to do is sleep and regretfully I do so until I get a call from my family friends or bf. (I have a horrible relationship with my roommates and not the most comfortable being outside my room unless needed like if i am doing my laundry)\n4. Plans in general (hanging out, etc) I almost can never say no since I once again do not like being home or out of the loop)\n5. I cannot go to sleep until 2 but in that part im almost never productive and i would stay in bed until i truly need to shower or drink water\n6. Even though I live away from home my parents have my cars location and are strict in general which sometimes leaves me overwhelmed since they are not the nicest people verbally.\n7. My sister depends on me for emotional and academic support at times and once again isnt a nice person (she lives at home and will blow up my phone with rants almost daily)\n8. sometimes I feel like I eat too little and when I eat the foods are unhealthy which may mess up my train of thought or energy\n9. sometimes throughout the week I will smoke or drink if I mentally done for the night yet I will still have nervousness over school and work. \n\nFor context I work in a research lab and am a senior in college studying biomedical sciences. \n\nWhat my question is, where do I start? I have so much flaws and I want to move past them.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nscr4a/i_dont_know_how_to_actually_be_better/", "title": "I don't know how to actually be better", "social_network": "reddit", "user": "ana_xex", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1622833502, "permalink": "/r/DecidingToBeBetter/comments/nscr4a/i_dont_know_how_to_actually_be_better/", "nsfw": false, "first_save": 1635437226.5172684, "replies_charged": false}