{"id": "t5_2tand_t3_e4m97a", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "If I were to rate myself on r/AmItheAsshole, I would rate \"YTA\" for sure. Who's the asshole here is out of the question, it is me.\n\nThe only reason I'm being reminded of this witless thing I did is because of [this separate incident](https://www.reddit.com/r/Advice/comments/e3seue/last_month_i_was_accused_of_being_a_peeping_tom/?utm_source=share&utm_medium=web2x) I wrote about, which you don't have to read at all but in case you're curious here you go. In that incident I wasn't in the wrong at all (NTA), but yet it reminds me of a situation where I was in the wrong (YTA).\n\nIn September of 2018 I was walking home when I saw two girls from school running on the street where I live towards my direction. One of the girls was a girl who had blocked me on Instagram in May of that year. Let's call her Karr. Why did Karr block me? I don't know because I had never really talked to her at all so I don't know what I could have done leading up to her to block me specifically. Nonetheless, seeing Karr and her friend made me excited, but also reminded me about how I'm perceived in school, which is not in my favor.\n\nOut of curiosity I logged into a different account on Instagram just to check out the profile of Karr because she blocked me on my main account, and saw that she had shared her Snapchat username on her profile page.\n\nI went over to Snapchat and added her. That's what should have been the end of the story as she wasn't adding me back.\n\n**But no, sometimes idiotic impulse outweighs reason.** In my experience with Snapchat, whenever you send a message to someone who doesn't add you back, the person who didn't add you back won't receive the message until they add you back.\n\nI wasn't expecting Karr to add me back at all so just out of boredom I wrote in a Snapchat chat to her something along the lines of \"There is a 50% chance you will add me back and a 50% chance you'll block me. Let's see what it is!\". I didn't expect her to actually receive the message because she didn't add me on Snapchat so I just typed away trying to have fun. I was in the middle of typing more things when something really unexpected happened; Her bitmoji popped up in the chat.\n\nI began to panic. \"She didn't add me back but was able to see what I wrote to her? How could it be?\" is what my thoughts were. I was panicking so much that I wrote to her \"Holy shit! I wasn't expecting you to see this!\", and then my finger slipped on the camera button and I sent her a picture of my own face by accident. You may have a hard time believing this, but I can't make this up, it was really ridiculous.\n\n(Side note: It turns out Snapchat has privacy settings where you can opt in and opt out of receiving messages from people who you didn't add as a friend. Karr must have had her settings as an opt in, while I assumed everyone had an opt out setting.)\n\nIt was at that moment when Karr screenshotted my initial message, the message I sent after I realize she was seeing what I was writing, and the picture of my face. I was so embarrassed over it and her screenshotting this awkward situation made me panic even more.\n\nPretending like nothing happened, I wrote to her \"Could you add me back? It would really mean a lot to me if you did\". She didn't reply. I tried to get her to reply by asking \"Why aren't you responding?\", but to no avail.\n\nIt doesn't end there. In the next two-days I spammed her Snapchat inbox with internet memes. Now you might definitely be thinking I'm trolling, but I promise I'm not. Please give me the benefit of the doubt because sometimes people **can** be this stupid like I was.\n\nUnsurprisingly, she blocked me on Snapchat and I felt relieved. Relieved? Relieved. Don't ask why.\n\nHowever, looking back, I highly suspect that Karr has gotten other girls to block me on social media because of this incident, including her older sister. I was never confronted by anyone over this incident, at all. I wasn't disciplined by anyone in the school. However, Karr still took that screenshot and I have not idea who she's shown it to, if she even still has the screenshot. It will all be a mystery to me.\n\nIn the past, I used to look back at that incident and laugh. I thought it would be funny story to tell to my friends. Yet I never told anyone (not even my parents or my siblings) about this story.\n\nBut these days, I'm actually starting to grow up and realize this is a big mistake I made. Now I'm guilty over this incident. Who knew my outlook on life would change so much being 17-years-old at this time?\n\nCertain things in my life are now reminding me of this incident and I'm starting to feel bad. One thing is that I sit right next to Karr's best friend in one of my classes. Every time I see her best friend I am automatically reminded of Karr, which reminds me about how I harassed her. In fact, I even have some common extracurriculars with Karr's best friend, which doesn't help at all. I even have a class with Karr's older sister, who also ended up blocking me several months after the incident.\n\nAlso, last month I was accused of being a Peeping Tom of the band's color guard girls, but I was completely innocent in that case. I already linked that story at the beginning of this post. Being accused of something creepy that I didn't even do is what really began to remind me about being the guy who harassed somebody in a separate incident.\n\nI see Karr all the time, and it's not like I can make her go away. I even saw Karr sitting in the passenger side pull up right next to me in the school's parking lot out of complete coincidence last week. She looked very uncomfortable to see me on the driver's side through the window. I felt a little uncomfortable as well.\n\nHell, she's always looked uncomfortable seeing me, even before she blocked me on Instagram, then saw my PM's, and blocked me on Snapchat. What I failed to accept at that time was that in life, some people just won't like you. She simply didn't like me, from the very beginning when we met. And that was okay, I am not entitled to her liking me. What I also failed to accept at that time was that some people don't like you for unexplainable reasons. Some people simply dislike you right-away, and she was one of those people to me.\n\nI shouldn't have worked so hard trying to figure why she didn't like me in particular. Out of all the people who didn't like me, I took a keen interest on her which I can't explain the reasoning for. I never had a crush on her. I never wanted some romantic relationship with her, but I think that is what she thought.\n\nWhat do I do? Can I redeem myself? Should I redeem myself at all? Do I apologize in person or in a letter?\n\nOr do I do the difficult choice of keeping my distance? Try to pretend nothing happened? Not care about what Karr thinks of me, even if she thinks I'm some perverted creep, even though I never sexually harassed her?\n\nDo I just move on? Is there even a point to take action? I graduate next year. Maybe I'll forget her after I graduate. No more feeling guilty.\n\nCan I make these bad feelings I have go away without apologizing? So many questions to contemplate.\n\n12/01/2019", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/e4m97a/i_harassed_a_girl_in_my_school_last_year_and_now/", "title": "I harassed a girl in my school last year, and now I'm all of a sudden feeling guilty about.", "social_network": "reddit", "user": "ThePublicJournal", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1575228597, "permalink": "/r/DecidingToBeBetter/comments/e4m97a/i_harassed_a_girl_in_my_school_last_year_and_now/", "nsfw": false, "first_save": 1635436529.3605886, "replies_charged": false}