{"id": "t5_2tand_t3_nrkve9", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "Apologies in advance for this wall of text. \n\n&#x200B;\n\nI (32M) have been seeing my significant other (33F) for over 1.5 years. I have had issues with jealousy in past relationships, and I hate feeling jealousy. To cope with these sorts of feelings, Ive essentially built up walls around myself where I don't allow myself to care enough about another person, to have any feelings of jealousy pop up. Basically if I'm permanently numb to the feelings, they cant get inside and wreak havoc with my head. \n\n&#x200B;\n\nThings have been going great with my SO, and without me realizing it, I'm no longer numb and my walls have come down. Recently two things have come up and they are boring into my brain, and I want to work through this before reacting poorly.\n\n&#x200B;\n\nFirstly, my SO asked me my thoughts on her receiving a massage from a male masseuse. I know its clinical and essentially the same as seeing a male doctor. However, massage is an activity that we share with each other and is a big part of our intimacy with one another. Not only do I not like the idea of her getting a massage from another man, but I cant help but feel that what she is asking is if she can share that intimacy with another man. I know the settings are completely different, but our personal, intimate massages just wont feel as special to me. I know this is my problem to deal with, which is why I am here.\n\n&#x200B;\n\nSecondly, she recently confused me with one of her exes. I know this doesn't seem like a big deal, but I have never confused her with one of my exes, and part of why I love being in a relationship with her is that she always makes me feel special. To be confused with an ex, along with the massage thing, I just feel like something in our relationship is now gone. \n\n&#x200B;\n\nMy knee jerk reaction is to intentionally confuse her with one of my exes, in particular an ex that I know she feels insecure about. But, I know that accomplishes nothing other than to hurt her. Essentially, I think it comes down to how can I work through these feelings so I dont constantly feel sick to my stomach, or at the least, how can i go back to not caring as much so as to be numb again? \n\n&#x200B;\n\nI know I am essentially trying to figure out how to love her less, but I can't live with these feelings, and I dont want to lose her either...I just want to be better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nrkve9/overcoming_jealousy/", "title": "Overcoming Jealousy", "social_network": "reddit", "user": "HelpMeBeNumbAgain", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1622746328, "permalink": "/r/DecidingToBeBetter/comments/nrkve9/overcoming_jealousy/", "nsfw": false, "first_save": 1635435103.086038, "replies_charged": false}