{"id": "t5_2tand_t3_fcbam6", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "Title says it all, really. I can't escape from subjectivity and chemistry, and I will stay in this lonely spiral until I have knowledge and mastery over these things. For most of my life, I wanted to be in love, but it never worked out because there wasn't chemistry. No one has ever said that they felt chemistry with me, so I don't even know what it's like. I got into writing years back because I thought it could give my life purpose even if I never get married, and it worked until i tried to publish things. Again, there just wasn't any chemistry. It's suggested to reach out and find a writing community, so I tried, but again... no chemistry, no community. There's just absolutely no escape from the fact that doing the things in life that would make me happy require this \"chemistry\" thing that I do not have. I haven't written in so long because of it and I hate myself for that so much. If I knew how to generate \"chemistry\" or at least identify it, then I would at least have a path forward, but instead I'm stuck with only doing things in life that I can control, which is next to nothing. But at the same time, there's no point in trying to be in love or create a work of art when the one, single most important aspect of it is something that most people have and I lack. If only I wasn't *me*, the problem would be significantly easier to solve. So how do you learn it? What actually creates chemistry, beyond the non-answers of \"it just happens\" and \"be yourself?\" Because 1. being myself is the cause of the problem, and 2. nothing ever \"just happens,\" it only looks that way because we don't always see the cause and effect.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fcbam6/my_life_will_not_advance_until_i_have_a_mastery/", "title": "My life will not advance until I have a mastery over the concept of personal \"chemistry,\" or subjectivity, etc. How do you learn something like this through study/practice when normal people understand it innately?", "social_network": "reddit", "user": "NauticalFork", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1583151898, "permalink": "/r/DecidingToBeBetter/comments/fcbam6/my_life_will_not_advance_until_i_have_a_mastery/", "nsfw": false, "first_save": 1635435091.3222902, "replies_charged": false}