{"id": "t5_2tand_t3_8m8i0f", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "TLDR: By viewing mental energy like physical energy it allows you to really place value on your thoughts and mental strength. As a result, this can help you separate your work from your personal life. You can tell yourself, \"I am not being paid to expend additional mental energy today\", and therefore you can apply that energy to what's most important in your life (family, hobbies, etc)... \n\nHere's a thought on how to improve work life balance while also being more present in the moment.\n\nSay you're given a job to pull weeds for the next eight hours for $100. Once the eight hours is up you are going to be tired, may have a sore back, and you are ready to call it a day. You put in your time and accomplished the task at hand. You've earned your pay by exerting primarily physical energy and you're likely to go home feeling proud. You probably won't think much about what happened throughout the day once you are home doing something you enjoy or being with family. That's great. \n\nNow, say you're given a job to simply strike up a conversation with as many strangers as you can for the next eight hours for $100. Once the eight hours is up you are also likely to be tired and ready to call it a day.  You've earned your pay by exerting primarily mental energy. The difference is, after the initial eight hours you continue to think about some of those conversations. Maybe there was an awkward one, an argument, or even a pleasant conversation. Regardless, you think about the scenarios and how you acted. You continue to exert mental energy thinking even after your paid time is over. Now you are distracted when you should be present in the moment doing something you enjoy or spending time with family. \n\nWhy do we allow ourselves to continue to expend mental energy beyond the hours of what we are paid to do? What if you viewed your mental energy the same way as your physical energy. You only apply your mental energy when you are paid to do so. You stop thinking about work as soon as your time for the day has completed because you are not being paid to expend additional mental energy. By viewing mental energy like physical energy it allows you to really place value on your thoughts and mental strength. As a result, this can help you separate your work from your personal life. You can tell yourself, \"I am not being paid to expend additional mental energy today\", and therefore you can apply that energy to what's most important in your life (family, hobbies, etc)... \n\nSorry for long post, had this thought and figured it's worth posting if it helps even one person separate work from their personal life. Work/life balance is getting harder and harder as the years go by so balancing our mental capacities is very important. Obviously this is not possible for a lot of jobs/careers but I do feel that this mentality could potentially help anyone if applied properly. \n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8m8i0f/mental_vs_physical_energy/", "title": "Mental vs physical energy", "social_network": "reddit", "user": "DrMcGenius", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 25, "down_vote": 0, "creation": 1527318748, "permalink": "/r/DecidingToBeBetter/comments/8m8i0f/mental_vs_physical_energy/", "nsfw": false, "first_save": 1635437717.3531158, "replies_charged": false}