{"id": "t5_2tand_t3_kpxfzw", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "28 year old male, 29 in two weeks. Due to reasons going back to my high school years, and extreme self-confidence over my physical appearance, I become very anxious when going for something in life or doing something I want in case it offends others or leads to confrontation.\n\nPeople like me due to how agreeable and nice I am. When I show a less agreeable side or do something which may 'upset the flow', I feel that people will very quickly treat me differently or become disrespectful towards me. **Putting my own happiness first ahead of others seems to be an extreme issue for me.**\n\nFor example I am currently living with a guy whom I have flat shared with for the past 2 years. We get along really well, but I'm just at a stage where I'm reaching 30 and I just want that extra bit of independence and having my own place. The idea of breaking this to him feels extremely difficult to me.... I think he's probably not gonna take it that well and feel offended. And with that he's probably not gonna see me as the really agreeable and nice guy who he should treat well, but rather trigger him into thinking I'm someone who it's okay to disrespect or hurt.\n\nIt feels like walking a perpetual tight rope; by being really agreeable and really nice I'm keeping the balance, but if I slip a bit then people will disrespect me and hurt me. My ultimate fear is being called ugly or having a comment made about my appearance, but it's also just the sense that people see me as soft and easy to manipulate or hurt.\n\nI know these things need to be worked on for life, but how do I make a start on getting over this fear and finally putting my happiness ahead of other people's feelings?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kpxfzw/serious_issues_with_selfassertiveness_and_putting/", "title": "Serious issues with self-assertiveness and putting other people's feelings ahead of my own...", "social_network": "reddit", "user": "reverbandreverse", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1609721945, "permalink": "/r/DecidingToBeBetter/comments/kpxfzw/serious_issues_with_selfassertiveness_and_putting/", "nsfw": false, "first_save": 1635438255.2556674, "replies_charged": false}