{"id": "t5_2tand_t3_pvhn1x", "request": ["4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "It's weird... Like it's not that I don't have goals or that I don't have the potential to meet them. I feel like it doesn't matter if I achieve them. I am currently able to live a boring comfortable life, forgetting everything else with a little bit of cheap easy entertainment. I could just play LoL for months 3 to 4 hours a day after the jobs forgetting that with a little luck I had the potential to own my music label or build my startup maybe even produce some video game. But once in a while I just get that jab that I'm wasting my potential and I could do something to better the world by example. I got the brain to become a lead scientist if I could effort into it. But in the end, would I really make a difference because I could also watch another season another show and forget about all those problems I force on myself for a bit. 3 months later I wake up remembering that the project I have put on ice is now an iceberg. What I'm talking about it wasn't even a project it was just nearly an idea I had on the toilet. Now please let me return to my boring lonely life so I can continue to forget the waste of potential I am.\n\nBref, I don't know if you were able to catch what my headspace looks like but I'll go with the concrete anyway. At the start, of September, I've restarted my studies full time after about 30 mounts of professional life. Last semester(spring), I've tested myself with a 2 courses semester question of seeing if I still had the capacity to study. Not gonna lie, it was almost catastrophic for the 2 last weeks of the semester I didn't touch my book and was saved because it was about things I've seen like 3 years ago during my never-finished computer science degree. Now we are a month into the new semester and I'm about a week and a half late in all my classes. \n\nMy head is screaming at me to just drop it all and cry myself to sleep for a day or two and just forget about everything. But I can't just drop, the drop without cost is already past and I can't just waste 2000$ (yeah I know, it is relatively cheap for university). But in the end, if I dropped my class I could just restart working full time and I would do 2000$ in 2 weeks, so in the end, I would only have wasted 2 weeks and not 4 months like I'm going to do.\n\nAnd when I'll get my paper, what will I do with it. I'm studying to go into the music/entertainment industry, a freelancer industry. How someone with the ambition of a middle-class dad doing 7 to 5 could survive in this industry. But this is what I have the most fun doing and what I am probably the least bad at.  And it's not like I could rely on people, I've got nobody around me. And I cannot go sell myself to other people, I've no redeeming quality due to the fact that I've not touched my instruments in the last 5 years because I didn't had any ambition to pursue music as a career. And I still don't want to be a musician, I aim to become a project manager and shoot other projects to the moon. But how can a project manager manage projects if there is nobody around him to have a project? I also can't do projects by myself because I would need to have the pressure of learning the technic to perform the project in addition to managing it.\n\nBref, I need to find ambition so I could have the drive to propel myself sky-high and finally stop feeling like a 6' high pile of wasted potential.\n\nThanks for listening to my Ted rant.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pvhn1x/how_could_i_stop_wasting_my_potential/", "title": "How could I stop wasting my potential?", "social_network": "reddit", "user": "chuckfoe", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1632611152, "permalink": "/r/DecidingToBeBetter/comments/pvhn1x/how_could_i_stop_wasting_my_potential/", "nsfw": false, "first_save": 1635437470.0235462, "replies_charged": false}