{"id": "t5_2tand_t3_ld1kuk", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "f29068b1-c751-4543-b3a6-9d58b1182ab7", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I watched part of the HBO series The Vow tonight and I was disgusted. To give some background, The Vow is a documentary about the rise and fall of NXIVM (pronounced: nexium) and the stories of the people involved. NXIVM was a self-help/improvement multi-level marketing company that eventually became a cult centered around the absolute control of its leader Keith Raniere. Raniere is this awful person who abused and manipulated many women, luring them in with kindness and then destroying their lives. He got sentenced at the end of last year to 120 years in prison for sex trafficking and is just the worst person.\n\nNow on my very worst day I am not anywhere near as evil as Raniere. That being said one episode gives a glimpse into his actual mindset, specifically what appears to be some unresolved issues from childhood and his clear lifelong disdain for women as people. He goes on extended (and recorded!) misogynist rant about the \"wound\" of being raised as boy/man in modern society and how it naturally and inevitably creates resentment towards women. Even knowing what a horrible person Raniere is and that this speech was meticulously designed to manipulate its listeners, I couldn't help but to find myself relating and realizing, much to my shame, that I have said some of the things he said about the perceived \"unfairness\" of being a man today. I (34m) know full well in my rational mind that being a cisgender, straight male carries obvious and long-standing privileges in our society. But in the heat of the moment, when I am frustrated over some slight or feeling taken for granted or taken advantage of, I flock to these same feelings of shame and blame that I've heard stream out the mouth of this criminal monster.\n\nWhat is the best way to confront this shame? What am I supposed to do with the \"meta-shame\" (the subsequent shame that comes from feeling ashamed when I remember my privilege)? Does anyone else also feel this way? And what is the kindest way to talk about this with someone who might have similar feelings?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ld1kuk/what_do_i_do_when_i_think_im_the_bad_guy/", "title": "What do I do when I think I'm the bad guy", "social_network": "reddit", "user": "BloodHound86", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1612507945, "permalink": "/r/DecidingToBeBetter/comments/ld1kuk/what_do_i_do_when_i_think_im_the_bad_guy/", "nsfw": false, "first_save": 1635435180.6079793, "replies_charged": false}