{"id": "t5_2tand_t3_ny7f75", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "In many ways I'm very happy with my life and the progress I've made. I have hobbies and a career I enjoy, and have lots of great relationships... \n\nBut the one part of my life that still stymies me and causes a lot of tension is the amount of time I spend futzing around on my phone. \n\nThis is all time that would generally be \"down time,\" i.e. time I wouldn't otherwise be spending doing something else. I do most other aspects of my life to my satisfaction, but just that hour or so before bed, or while I'm waiting for my food to come up, or just have a 20-30 minute gap in my schedule. I spend all this time on my phone and it adds up. \n\nThe worst part is I get no pleasure out of it and I'm not doing anything productive either. I click from Facebook, to Instagram, to Reddit, to YouTube, and back to Facebook again, maybe check my email, etc etc...\n\nI think what frustrates me the most is how it just takes over all my unscheduled time. And I'm also trying to give myself some unscheduled time because otherwise I'm so type A and neurotic that I schedule every last minute of my day to the point of exhaustion. \n\nDoes anybody have thoughts on this or a similar experience? What kind of things have you done to maybe do something more genuinely relaxing in those moments? Or just to curb phone usage etc? \n\nAnd I know people will say \"delete the apps.\" I'm thinking about it, but it's also part of what I do professionally so I'm not sure how feasible it will really be in the end...", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ny7f75/what_to_do_thats_not_on_your_phone/", "title": "What to do that's NOT on your phone?", "social_network": "reddit", "user": "rococo78", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1623506496, "permalink": "/r/DecidingToBeBetter/comments/ny7f75/what_to_do_thats_not_on_your_phone/", "nsfw": false, "first_save": 1635437754.4959395, "replies_charged": false}