{"id": "t5_2tand_t3_kgl55y", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I (31F) graduated over 3 years ago. I got a first class honours from a top uni and won everything going but I was so burned out, depressed an anxious that I didn’t apply for any jobs. I had an awful time during my degree and lost all of my confidence. I’m in recovery now, I’m about to get a therapist and I’ve just got the courage to start working on my CV and portfolio so I can start applying for jobs next year. \n\nHow on earth do I explain this gap on my CV? Since I graduated, I’ve done about 12 mini classes/courses, I’ve had some of my graduate work in a couple of magazines and I had an idea for a film that interested a few but good film producers. I didn’t major in film (I majored in fine art from a top uni) so this was a pleasant surprise. \n\nI’ll be 32 by the time I get applying but I feel like I’ve totally fucked up my life and all of those entry level positions will look at me like I’m a joke. I’m trying so hard to put what I have learned into practice and not catastrophize something that hasn’t even happened yet but i really worry it’s too late. I know in the grand scheme of things I’m not old at all, but I’m an ambitious perfectionist and I can’t help but shake the feeling that by 32 I should’ve had at least 8 years laying the foundations of my career  and I should be much further ahead of where I am now. \n\nAny advice on dealing with this? Has the door really closed? How do I face this?\n\nI’d be more than happy to intern my way into a job if needed or go and do a masters.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kgl55y/i_feel_like_ive_messed_up_ill_be_32_by_the_time_i/", "title": "I feel like I’ve messed up. I’ll be 32 by the time I apply for entry jobs.", "social_network": "reddit", "user": "sasafade", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 112, "down_vote": 0, "creation": 1608429078, "permalink": "/r/DecidingToBeBetter/comments/kgl55y/i_feel_like_ive_messed_up_ill_be_32_by_the_time_i/", "nsfw": false, "first_save": 1635437669.5012739, "replies_charged": false}