{"id": "t5_2tand_t3_p5msq9", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "Its been bothering me for a very long time - 2-3 years. Lack of thoughts, feelings. Pleasure is practically nonexistent and if there is some feeling its almost always within a reach but never all the way. If I had to explain it to someone - its like doing a pull-up and failing the last few inches of it. \n\nAnything I do to keep myself going often feels like a chore and is very procedural - stuff needs to be done. Stuff gets done. Item crossed off a list. Next. So cant really say I have problems getting out of bed and doing things. Feels more like doing things after staying up whole night, even though I do get 6-7 hours of sleep. \n\nAnd the comes forgetfulness. Yesterday morning I made three cups of coffee. First two I forgot to out the cup under, last one I just left there till it got cold. Do t think memory problems are here to blame cuz I often catch myself recalling most random stuff from the past, recent and remote. Dont seem to be having issues storing things in memory either - picked up learning Mandarin recently and things are getting stored in my head at what seems to be a decent  level. Its more of that dazed away feeling when I try to recall things, like “hello brain, you should be recalling something for me, turn yourself on”. \n\nI’m 44M. Well paying job, family, house. Involved in local community volunteering, trying to exercise where I have time (at least a daily 30 min walk outside, weekend yard work, hikes) Tried self help / CBT. Tried meditation. Both seem to help for a short while, at least with immediate reward where I feel better after a session but that is very short-lived unfortunately. \n\nI just want to break out of this state. I want to feel. I dont want to be angry at myself because people around want to have fun and I cant. \n\nI’m sure I’m not the only one and I’m sure there are people around here who were in the same situation and got better.  What worked for you?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p5msq9/breaking_out_of_this_brain_fog_state_what_works/", "title": "Breaking out of this brain fog state - what works for you?", "social_network": "reddit", "user": "East___West", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1629140962, "permalink": "/r/DecidingToBeBetter/comments/p5msq9/breaking_out_of_this_brain_fog_state_what_works/", "nsfw": false, "first_save": 1635437734.8752623, "replies_charged": false}