{"id": "t5_2tand_t3_ppigy4", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "e234981c-b061-4d83-8134-70d441847f74", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "**You have to use the** ***other*** **part of your brain.**\n\n*Uh, what are you talking about?*\n\nSo there are two parts of your brain: the logical part and the emotional part.\n\nLet's look deeper at each one.\n\n—\n\n# The Logical Part of Your Brain\n\nActivities include:\n\n* Reading books\n* Writing books\n* Reading online posts\n* Writing online posts\n* Watching YouTube self-help videos\n* Writing out plans\n* Analyzing your past\n\nAnd so on. If this is what you do with the vast majority of your time, then you are a very logical person. And if your stuck reading a ton of self-help, you're trapped using the logical part of your brain.\n\nNot that it isn't useful, but you wouldn't chop down a tree with a hammer would you?\n\n**Self-help people will tell you that taking action is the key to self-help.** But logic, reading self-help stuff, is a bad way to get there. **Taking action takes emotional energy!**\n\nThink about going to the gym. You willed your self to go there because you know it is good for you. You took action! But what happens next? You do the typical two weeks then stop routine most Americans do. Why? Because going used up all your emotional energy.\n\nWhy do other people go to the gym all their lives? Because they get *excited* about the body they'll get or the way they'll feel after. They created emotional energy (unknowingly) and keep creating emotional energy before they went.\n\nThis also explains why you're addicted to self-help. You create emotional energy before you read it: \"Oh boy! This book is going to finally have the secret I've been looking for!\" \"This book is going to change my life! Look at all the good reviews!\" \"This guy is the one everyone has been raving about, he has to know the secret.\" \"This guy is the original self-help guy, his ideas have with stood the test of time!\" So you read that self-help book.\n\nBut you end up with logical answers instead of emotional answers, the kind of answers you need at this point in life.\n\n—\n\n# The Emotional Part of Your Brain\n\n* Getting excited about stuff\n* Doing things (and enjoying what you're doing)\n* Your gut feelings about things (and listening to it)\n* Enjoying the process\n* Learning from the experience\n\nYes, things like meditation and visualization could be considered part of or developing your emotional brain, but not really if it doesn't feel right to you. And, unfortunately, people think this is emotional work when it really isn't. (Things like meditation are clearly good for you, but they can't replace the creativity energy you're supposed to have in life.)\n\n*Dude, you're saying nothing. Self-help people have already said this.*\n\nBut you've never understood it. And the proof is how much you turn back to self-help looking for answers.\n\n**This isn't about negative thoughts or positive thoughts. It's about tapping in to your inner motivation.** And you know you found your inner motivation cause it has an emotional response.\n\nSo **your true motivation will create emotional energy.** And with enough emotional energy, you can't stop from taking action in life. Boom! The ultimate self-help advice of \"take action\" is now an intimate part of you.\n\n**So what motivates you?**\n\n—\n\n# Proof\n\nLet's look at a few examples to prove what I'm saying.\n\n**Example 1**:\n\nThere is a tennis coach who is known for taking the worst player on a court (you 😉) and turning them into the best in one class. How does he do it? Instead of telling me how to play, he has them watch him play for a bit for reference and then has them just start playing while saying \"bounce\" and \"hit\" when the ball bounces or is hit.\n\n*What is going on here, how does this work?*\n\nHe is getting them to work on the emotional part of the brain and quieting the logical part of the brain that is messing them up. As described in another post by u/MadeInUSA05510  in this subreddit:\n\n>The idea is that there are two selves: self 1 (your logical/talking self) that learns from external knowledge and reflection and self 2 (your emotional/feeling self) that learns from experience.  \n>  \n>Unfortunately, your self 1 often takes over and blocks your self 2 from learning by making you feel bad. \"That won't work!\" \"You screwed that up, come on!\" \"Don't forget that technique that self-help book said to do.\" And self 2 has a lot more intuitive power and experience to draw from making it often smarter than self 1 in your current situation. In other words, you need to do a better job silencing your inner talk to be more productive in life.\n\n**You have to turn off your logical brain and trust yourself.** Then you'll start to grow as a person. You're smarter than you think!\n\n**Example 2**:\n\nStudies show that happiness comes *before* success. Shawn Achor in his work showed that a state of happiness give you a competitive advantage. Furthermore, people who were happy in life ended up becoming successful later in life. Finally, he proved if you can become positive in the present, it leads to becoming successful. And what is going to make you happier than thinking about what you really want in life?\n\nWhile Shawn Achor gives the suggestion of journaling, gratitude exercises, exercise, meditation, and random acts of kindness, what if these activities become boring? What if you just go through the motions? Well, you're not really happier are you? **But thinking about what you really want in life will always make you happier when you think about it, or else you don't really want it.**\n\n**Example 3:**\n\nBut what if you can find a path where you sustain happiness/emotional energy as you work towards your goals?\n\nSo let's look at something at the other spectrum, some of that woo-woo magic we see in the spirituality movement, but I'll explain it using science.\n\n*Ask and It Is Given: Learning to Manifest Your Desires* by Hester Hicks has almost 10,000 reviews on Amazon with 5 out of 5 stars. So, there has to be something to it, spiritual or not. So what's her advice.\n\nHer book talks about the law of attraction stuff years before *The Secret* came out. Before you think this is a waste of time, while *The Secret* talk about simply thinking positive thoughts to attract positive stuff in your life, *Ask and It Is Given* is about creating a sustaining process of positive feelings while you work towards when you want (and if there aren't positive feeling while you work towards it, you're moving too fast). And that **happiness comes from within.** Take a look at this quote from Abraham/Hester:\n\n>**For no one else can think for you. It is only you. Every bit of it you.** \\[...\\] There is only a stream of well-being that flows. It is a stream of pure positive energy. And the Universe, all that we know, is abundant with only that. This is a world based upon well-being. And well-being dramatically abounds. And when you are allowing that stream to flow in its fullness you feel very, very good. And when you are pinching it off a bit, you feel not so good. **There is only a stream of goodness or well-being that you are allowing or not.** And your magnificent emotions are telling you what the mix is, of your allowing or resisting of this connection.\n\nEven if you strip away all mysticism from this quote: she and her followers are practicing:\n\n1. **Extreme locus of control** (how much an individual feels they can control their life, essential for happiness)\n2. **Emotional intelligence** (listening to how things make them feels, so they seek out activities that make them feel good and avoid the ones that don't)\n3. **Emotional energy** (they are doing activities that completely feel good and right, so it must align with their inner motivation)\n\nSound like that's a good attitude to change your life.\n\n>Most of your time will be spent collecting data \\[experiences\\]. But your real work is to decide what you want and then to focus a pawn it. For it is focusing a pawn what you want, you will attract it.\n\nIf you really want to see her process of getting what you want out of life, see another video from her called: \"Preparing For What You Want.\" She talks about the \"The grid filling-in, isn't the action. The grid filling-in is preparing for the action.\" Meaning to take the move when things feel right. Planning when it feels right. And even only thinking about it when it feels right.\n\n**Her process isn't about visualization, but paying attention to how you feel about stuff. And seeking things that feel good/right. Whether it is a thought or action. It's all about the emotional part of the brain!**\n\nIt's about being true to yourself. It's about thinking for yourself.\n\n—\n\nRemember, **if you're done what you're always done in life, you'll get what you've always gotten**. **Give up on consuming more logical self-help information** and **start paying attention to your own intelligence (your feelings)** on situations.\n\nYou already have one type of intelligence, you need to start working on this other one.\n\nDevelop that part of your brain and you might just get somewhere in life.\n\nSo go find your inner motivation and change your life!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ppigy4/how_to_stop_being_a_selfhelp_junkiehow_to_stop/", "title": "How to stop being a self-help junkie/how to stop paralysis by analysis", "social_network": "reddit", "user": "TomDC777", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 23, "down_vote": 0, "creation": 1631815172, "permalink": "/r/DecidingToBeBetter/comments/ppigy4/how_to_stop_being_a_selfhelp_junkiehow_to_stop/", "nsfw": false, "first_save": 1635435127.8630602, "replies_charged": false}