{"id": "t5_2tand_t3_lfwqto", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "\\[The following is an extract from a longer article that I wrote on \"The WHAT, WHY & HOW Of POSITIVE THINKING\".\\] \n\n# HOW Can Positive Thinking Be Learned?\n\nHaving examined the above, it is safe to assume that optimism and positive thinking can be learned — at least by those who wish to.\n\nThe next question is HOW?\n\n**My (Informal) Logical-and-Volitional Theory of Optimism**\n\nThis is where I ask my readers to indulge me with my informal theory of optimism and allow me to share some tips on how I have personally developed my positive thinking mindset.\n\nTo reiterate, my journey of optimism started with two realizations:\n\nFirstly & logically, the world continues on regardless of whether I interpret it or respond to it positively or negatively. In other words, my choice of interpretation of or response to facts & events won’t affect the external world. So if it rains and that spoils my plan of a picnic, no matter how I respond, the rain continues on.\n\nSecondly & volitionally, I can choose how I want to interpret or respond AND my choice affects me internally. Therefore, I might as well choose to think positively since it makes a positive difference to me! So rather than be upset with my picnic plan being disrupted, **I would shift my focus from disappointment to acceptance, and then to adaptation & improvisation.** For example, I would have the picnic indoors instead.\n\n**Tip #1 — Take Control With Logical Thinking**\n\nMost of us have default responses to people, events, and ideas. These default responses are often the results of mental habits, rather than the outcomes of active thinking. Even when active thinking is involved, the thinking may not be logical enough.\n\nA common example would be the prejudices that we hold against people, events, and ideas. If we care to self-reflect on any such attitude, more often than not we find no logical basis for it.\n\nSimilarly, one’s pessimism could be the result of mental habits, rather than the outcome of logical thinking.\n\nAs such, a pessimist would see the proverbial glass as half-empty, even though it could logically be seen as half-full.\n\nA good start in changing from a pessimistic mindset to a positive one, therefore, is to exercise a greater use of logical thinking to replace negative mental habits that may not be rational.\n\n**Tip #2 — Recognize That There Are Alternatives**\n\nA helpful way to effect a change from a habitual mindset is to apply the conscious mind and **use logical thinking to recognize that there is more than one way to interpret or respond to anything**.\n\nFor example, if your boss didn’t reciprocate your smile this morning, it doesn’t necessarily mean that you’ve offended him/her with any wrongdoing. It could be that he/she was preoccupied with some thoughts and had not noticed you smiling at him/her.\n\nOr if someone stepped on your toe (whether literally or figuratively), it doesn’t necessarily mean that it was done with malicious intent. It could be accidental or out of innocent carelessness.\n\n**Tip #3 — Exercise The Freedom of Choice**\n\nOnce one recognizes the possibility of alternative interpretations and responses, the next step is to realize and exercise one’s freedom of choice.\n\nIf the proverbial glass can be seen as half-full, and a positive mindset brings more — and significant — benefits than a negative one, then why insist on perceiving it as half-empty?\n\nIt may seem difficult to change initially, but that’s only because habits take effort & time to be changed.\n\n**Tip #4 — Identify & Replace Habitual Negative Responses With Positive Ones**\n\nMany of us have certain habitual negative responses to certain triggers — whether people or events.\n\nFor example, our automatic response to nagging from loved ones (usually our mothers) could be irritability and even anger.\n\nWith some efforts, it is very possible for most of us to make a positive change.\n\nOne helpful method is to use a simple worksheet comprising of 3 columns (the 2 entries are examples):\n\n\\[A\\] Trigger \\[B\\] Habitual Negative Response \\[C\\]Alternative Positive Response\n\n1. \\[A\\] Mom’s nagging \\[B\\] Be irritated \\[C\\] Be grateful\n2. \\[A\\] Late for work \\[B\\] “I’m hopeless and I’m gonna get fired sooner or later.” \\[C\\] “I can do better. I just need to wake up 15mins earlier.”\n3. \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n4. \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWorking through the table from left to right, list some of your common triggers in the first column. In the middle column, write down your habitual negative response that this trigger tends to elicit. In the final, right-hand column, try to come up with a more positive, constructive, compassionate, and helpful response or thought that you can use to replace the negative one.\n\n**Tip #5 — Pay More Attention to Positive Stuff**\n\nA common and unfortunate habit of many people is to pay more attention to the negative, rather than positive events and experiences. For example, we are often inclined to focus on a single criticism among multiple compliments.\n\nWhen you find your attention singling out or honing in on the negative elements of an incident, make a conscious effort to stop. It may take some effort, but try to draw your attention back to the positive aspects instead.\n\nOne helpful way to practice your ability to refocus is by making time for a positive experience each day and consciously recognizing the positive aspects of it.\n\nFor example, positive daily experiences could be as simple as appreciating good weather, or making a conscious effort to smile at strangers, or being grateful for good health, etc.\n\n**Tip #6 — Change Your Mindset, And You Change Your World**\n\nRecognize that we could control our internal world, even if we had no control over anything externally happening to us.\n\nWe often can’t change the external environment, but we can change our internal one.\n\nWhen we change our internal mindset, we can change the way we see & engage the world.\n\nOne effective way to change from pessimism to optimism is to focus on improving our mindset from **passive negativity** (eg, regret or lament that does nothing to change the external circumstances but only causes oneself to feel worse) to **active positivity** (eg, making the best of the situation or focusing on problem-solving).\n\nInstead of focusing on the difficulty in every opportunity as a pessimist, change the focus to the opportunity in every difficulty as an optimist.\n\n# Summary\n\nWHAT is Positive Thinking: it is a mindset that actively seeks & works towards — not just hopes for — the best possible outcome.\n\nWHY Positive Thinking: it offers wide-ranging significant benefits, many of which are supported by researches and studies.\n\nHOW to learn & develop Positive Thinking:\n\n1. take control with logical thinking;\n2. recognize that there are alternative ways to interpret or respond to facts & experiences;\n3. exercise the freedom of choice;\n4. identify & replace (specific) habitual negative responses with positive ones;\n5. pay more attention to positive stuff (in general);\n6. change our world by changing our mindset from passive negativity to active positivity.\n\nThe above are just a few practical tips that one can use to learn and develop the skill or habit of positive thinking. There are no doubt many other useful ways.\n\nThe important thing is to believe that like many other skills or habits, positive thinking can be learned and developed — and its many significant benefits can be reaped and enjoyed.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lfwqto/6_tips_on_how_to_learn_develop_positive_thinking/", "title": "6 TIPS On HOW To Learn & Develop POSITIVE THINKING", "social_network": "reddit", "user": "ysz1967", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1612853367, "permalink": "/r/DecidingToBeBetter/comments/lfwqto/6_tips_on_how_to_learn_develop_positive_thinking/", "nsfw": false, "first_save": 1635437599.0624478, "replies_charged": false}