{"id": "t5_2tand_t3_gahsug", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "I don't know whether this is specific to ADHD, but for me it really does boil down to the extreme difficulty I have with switching tasks.\n\nI know that today I need to help set up a new computer for my mom. As much as I enjoy helping to set up new computers, I'm really into a new video game that came out recently (Trials of Mana remake) and I've been playing the hell out of it.\n\nFor the past couple of hours I have simply Done Nothing™ instead of playing, even though I desperately want to play. But I know that I need to do this setup thing today. I asked myself: Why? Why can't I enjoy my game right now? For years, I haven't been able to put my finger on it.\n\nFinally realized that it's because I know that if I start playing, I'm going to get really into it. And when I'm 'really into' something, it gives me an irrational anger/annoyance to have to switch tasks away from it. So instinctively, the more attractive option - to keep myself from being annoyed - is to not do anything that I'm capable of 'getting into' until after the new rig is set up.\n\nStarting now, I'm going to work to try to overcome this. It doesn't make any sense for me to waste a ton of time in the name of keeping myself from being irrationally annoyed! Now that I've pinpointed it, I can take the intellectual steps necessary to fight it, and I thought I'd post here in the hopes that someone else might be able to share a bit of my enlightenment as well.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gahsug/pinpointed_the_i_know_i_have_obligations_today_so/", "title": "Pinpointed the 'I know I have obligations today, so instead of enjoying my hobbies as usual until then, I will simply Do Nothing™ until after the obligations have been fulfilled' problem.", "social_network": "reddit", "user": "technitaur", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 132, "down_vote": 0, "creation": 1588194566, "permalink": "/r/DecidingToBeBetter/comments/gahsug/pinpointed_the_i_know_i_have_obligations_today_so/", "nsfw": false, "first_save": 1635436694.7341757, "replies_charged": false}