{"id": "t5_2tand_t3_q9iqu1", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924", "c5413f89-ceff-4d4e-ab55-742c6af6ff43", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "**(Warning: Long venting, self loathing, suicidal ideation)**\n\nI am 15F and everyday feels like my capacity for empathy towards myself and others is lowering and I’m just silently crying.\n\nI’ve been envious ever since I was little. If I saw another kid hanging out with their friends or if another one were more talented than me in something, anger and sadness would bubble up and overtake me. Outside, I’d appear . If I happen to be ‘better’ than someone for even just a little moment, my self esteem would rise up and I would feel like I’m at the top of the world special, too good for anyone. If something contradicts that, I come crashing down, feeling undesired. I remember once snapping at my little cousin for hanging out with the other girls, I was spitting out “I hate you”’s while he stared at me back with those naive eyes. I had to go home after that, and my parents comforted me by letting me buy Minecraft.\n\nI’ve never really been close with anyone, because I’m so caught up in my inner hatred and I’m demotivated to even work on my social skills. Nobody really talked to me in school and I wasn’t even the one to pursue the relationship with my best friend of 4 years. I think I’m only further hurting her by letting her stay with me. \n\nI’m dysphoric about my presence, and self conscious on how I appear. Recently I’ve been spending more money on clothes so I can appear how I want to appear. But I look at the mirror and see a super skinny and short good-for-nothing impostor. I’m very perfectionistic but I’m never satisfied. I look at the world and see so many unforgivable flaws. That’s why I’d wallow in my inner world where I control every aspect and tinker it to ‘perfection.’\n\nMy real colors are so ugly. Under my humble exterior, I see a storm of swarming hatred, deep-rooted envy, selfishness, and self-loathing. Even in those moments of bliss where everything looks to be going right for me and I feel confident, it’ll all just fade away eventually and I’ll be back to square one. I’m so deeply unhappy that thoughts about jumping off a building and hanging myself are beginning to plague me. I’m drowning deeper in my bubble.\n\nI’m so scared of my future, and I’m scared if I’ll let the hatred get to me and do impulsive bad things towards people. What steps should I take so I can ensure I don’t fall deeper than I already am? This is urgent.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q9iqu1/deep_in_hatred_and_at_an_all_time_low/", "title": "Deep in hatred and at an all time low", "social_network": "reddit", "user": "New_Engineering2422", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1634412352, "permalink": "/r/DecidingToBeBetter/comments/q9iqu1/deep_in_hatred_and_at_an_all_time_low/", "nsfw": true, "first_save": 1635435617.9674573, "replies_charged": false}