{"id": "t5_2tand_t3_chgdnd", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "The only friends i have are from playing soccer and they arent very close just \"hey how are you\" and small talks and a few jokes thats all... they never tell me any stories maybe bc\n\nI ask questions like an interview i mostly get Yes/no answers.. idk how to ask open minded questions.. \n\nIm at a point im sick of trying to make friends, i have given up bc idk what to say, i really have nothing to say... i want friends but sometimes i dont think the same.. \n\nThere is so much anger inside me for my self. I want a punching bag so badly.\n\nSometimes i feel like people are too cool for me. Anyone i see i feel like is better than me and smarter than me..i just think they are more amazing than me ever.. and making me feel alone amd like a loser. And beat my self up.\n\nI dont have orginal thoughts or jokes or ideas or interesting stuff to say, im too generic/boring/bland.\n\nIm only nice cause its my only quality, im not sharp minded or charismatic or funny or cool or a bastard that people like or charming or smart or intelligent or have a sense of humour im a total loser who is lonely. No one will ever like me.\n\nWhat do i do to make people like me or value me or take me seriously?\n\nI cant make friends with anyone mostly girls online, its like i beg them just to say hey to me, i try my hardest to get a girl to reply to my first message..\n\nI dont have a job and my parents constantly rip my self esteem apart and i dont have money to move out and i live in a small town which is boring so most days i just sit home and eat. Im worried i end up doing nothing at all. Idk what to do with my self.\n\nMaybe im just interested in people giving me attention/approval so i feel worthy and noticed..\n\nI get jealous of people who tell jokes or who have friends.. in groups.im invisible cause if i even say things they dont make sense and what i say are total conversation killers.. \n\nA girl might be interested in me online for the first day.. next day all i know to say is \"hey, how are you\" thats all.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/chgdnd/how_to_not_run_out_of_things_to_talk_about/", "title": "How to not run out of things to talk about? Espically online?? Idk how to make friends and its making me depressed. Im not even friends with my self. I hate my self. What do i do ? Help?", "social_network": "reddit", "user": "hamacule55", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1564014026, "permalink": "/r/DecidingToBeBetter/comments/chgdnd/how_to_not_run_out_of_things_to_talk_about/", "nsfw": false, "first_save": 1635435832.6050441, "replies_charged": false}