{"id": "t5_2tand_t3_m9t8j9", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": " Discipline is the dentist appointment of the self-improvement world. We all need it, most of us hate it, and a lot of us skip it.\n\nBut like the dentist is important for keeping your teeth in top condition, **discipline is important for a successful and happy life.**\n\nPeople think discipline sucks. I get it, it’s hardly the most exciting way to live. But do you know what sucks more? \n\nNot getting what you want, and not becoming who you want. Sitting around wishing for things to happen to you, or blaming the world when it does. \n\nDiscipline guides the direction of your life. You can achieve amazing things with consistent, small efforts.\n\nIt doesn’t have to be how you’re imagining it. I’m not talking about ice cold showers, boiled chicken, and broccoli for the rest of time. Discipline isn’t the end of your freedom, but the start of it.\n\n# Pick the right kind of discipline\n\nDiscipline isn’t fun if you pick the wrong kind. \n\n**Reactive discipline** is the result of poor outcomes. We set rules to avoid repeated mistakes. \n\nFor a rule - or system - to stick, the motivators have to be right. We want to be in control, moving in a positive direction. Reacting is the opposite, outcomes control us.\n\nBecause of this, reactive discipline is unenjoyable, and often ineffective. We’ve all promised ourselves to never eat like a pig again, stop getting so drunk, and to avoid less-than-stellar one-night stands. But the burgers, booze and bad decisions are always waiting around the corner. \n\nIt’s a cycle of self-loathing, rule imposing, and let downs. It’s disappointing and demotivating. \n\nThe opposite is true for proactive discipline. \n\n# Be proactive\n\nDon’t wait for life to set your rules. Instead, decide what you want from life and set them yourself.\n\nProactive discipline will: \n\n&#x200B;\n\n1. **Let you enjoy life more**\n2. **Lead to results**\n\nWith discipline, you have the freedom to enjoy things when you want. But people believe otherwise.\n\nSocrates once said the secret to happiness is about developing the capacity to enjoy less. This was over 2000 years ago. These days, we can live like an emperor. But that doesn’t mean we should.\n\nIndulgence doesn’t make us happier; it just raises the bar to get there. There’s diminishing returns. \n\nBy being disciplined, you keep the bar low. We think and feel in comparisons. This is a powerful psychological tool you can use for your own happiness. \n\nIf you’re disciplined with your spending, treating yourself is actually a treat. When you’re strict with your diet, pizza tastes like heaven. When you work hard all week, relaxing is glorious.\n\nOver time, you buy more freedom with your discipline. Good savers can retire well before 50. Eating well means you’re not fighting diabetes and crying over cake later. Working hard now lets you build a life of meaning. \n\n# Building discipline\n\nDesire x Time x Discipline = Formula for success. \n\nBut discipline isn’t easy. You have to build it like you would a muscle at the gym. The key to doing it well is picking something beneficial, not reacting to your life. Don’t start with sugar if you’ve got a sweet tooth, for example.\n\nIn *Drive: The Surprising Truth About What Motivates Us,* Pink explains about the most effective internal motivators:\n\n\\- **Autonomy:** Control of direction\n\n\\- **Mastery:** Development of skills\n\n\\- **Purpose:** Feeling of meaning\n\nTick these boxes and you’ll experience a paradigm shift. Discipline becomes a celebration. You want to prove to yourself you can commit to something more. \n\nThis is why I believe physical exercise is the seed of excellence. Control your diet and workout 5 hours a week for 6 months. You feel amazing, confident, and you’ve transformed yourself physically. When you see what you’ve done at the gym, you’ll ask what you can do with your life. \n\nIf exercise isn’t your thing, find something you’ve wanted to try. Wake up 30 minutes early each day. Read, write, sing, practice handstands. Pick something you can be consistent with, and build from there. \n\nWhen you see that discipline gives the outcomes you desire, it’s something you’ll put into life more and more. \n\n# Get what you deserve\n\nThe life you’ll live is directly proportionate to the effort you put in to create it.\n\nAbraham Lincoln said: “Discipline is choosing between what you want now, and what you want most.” \n\nWhat is it you want to achieve? What would it take for you to look back at your life and know you made the right choice by giving it your all? \n\nMake the tough choices now and enjoy a great life later. \n\n\\--\n\n&#x200B;\n\nHave a great sunday!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m9t8j9/how_to_start_being_more_disciplined_without/", "title": "How to Start Being More Disciplined, Without Ruining Your Life", "social_network": "reddit", "user": "KieranDrew", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1616319551, "permalink": "/r/DecidingToBeBetter/comments/m9t8j9/how_to_start_being_more_disciplined_without/", "nsfw": false, "first_save": 1635435462.3099, "replies_charged": false}