{"id": "t5_2tand_t3_qc0qej", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "This is something that's been bothering me about my own personality for years now. I am unable to just let someone else be \"wrong\" even if it's just a case of having a different opinion on something.\n\nThis almost never happens in online forums such as reddit as I can relax, read the comment several times, think about what they meant, enter the conversation with the assumption that I probably misunderstood someone else and that I might be wrong. It almost always happens when talking in person or even worse, at work in mail or chat conversations with colleagues. Just a recent example was that it was decided that I should implement a specific solution with a client. This solution has some different ways of implementation and I was thinking that A would be good. A colleague suggested I should look into B in a mail and I instantly had to respond that \"B is an option but considering XYZ then A is a much better option, so I will do A first and then look into B\". This does not matter, as A and B are equally fine, they will both reach the end goal, there's really no difference in effort in implementation either, but for one reason or another I had to respond. Every time I do this I instantly think \"why did I do this? I could have just said thanks for the input, like I do when commenting online, why am I like this?\"\n\nEven worse if it leads to a discussion and nobody is satisfied with the outcome, I'll ponder it for *days* on end and I can't let go that I didn't \"win\". While I'm thinking this I'm simultaneously thinking \"stop being an idiot, you know it doesn't matter, why do you care?\" but I still just can't let go.\n\nWhat is it that makes it really easy to accept that others have different opinions in places like Reddit but really hard when it comes to people close to me? I really want to stop doing this and become more positive, because the effect this has is that people stop asking me questions because I always need to be right, and when I actually have a point to make they don't listen because my default position is \"question and disagree\". What can I do to react with positivity instead of disagreement all the time?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qc0qej/how_can_i_learn_to_let_things_go_and_stop_having/", "title": "How can I learn to let things go and stop having to be right all the time?", "social_network": "reddit", "user": "DecidedIWillBeBetter", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1634736066, "permalink": "/r/DecidingToBeBetter/comments/qc0qej/how_can_i_learn_to_let_things_go_and_stop_having/", "nsfw": false, "first_save": 1635436303.5705843, "replies_charged": false}