{"id": "t5_2tand_t3_kb1p2t", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "I've been playing WoW since 2008, now and then at first, but being disabled and unemployed, for the past 3 years, I played 8-12 hours almost daily, unless I had appointments or met with friends (rarely).\n\nI wasted almost 3 years of my life and didn't notice just how fast the days were passing by, how I barely managed the minimum of cleaning. How I became more and more reclusive. And, most importantly, how spending that much time online, I turned into an arrogant, aggressive asshole because I lacked in person social skills. It's easy to go off on someone you're not face to face with, and it's horrible.\n\nI was not in a happy space at all, but playing kept my mind from thinking on that too hard. \n\nThree days ago, I snapped at a friend while on Discord because that friend was frequently talking over me, which said friend did regularly to other people as well. It's rude, but my reaction was way out of line. Said friend immediately left the game and discord and I, finally, had an \"Oh shit!\" moment.\n\nI called my brother and had a heart to heart talk, and he agreed that leaving this hellhole would be for the best. He asked me to make a list of things I'd have time to do if I were to delete the game and all incentive (the characters I spent years getting achievements and stuff on) to return to it.\nThe list got longer and longer, which made deleting everything easier.\n\nSo, the morning after I followed through, I put out a post on a neighborhood website where people help each other or put up activity suggestions and all that. \nI asked if people had blankets and sheets and other goods for the local animal shelter, as I had sorted through my stuff and found things the shelter would gladly take - so why not ask other people? \n\nIn the last two days, I got a bunch of messages, and starting this evening, I'll begin collecting the items people decided to give away by driving through the neighborhood in my dinky car. Coming Monday, I'll drop them off at the shelter and will start spreading the post on other local websites.\n\nThis is the first time in years that I feel good about what I'm doing during the day.\n\n\nTL;DR: Dropped a year long, time consuming, addictive hobby and started collecting donations (items, not money) for the local animal shelter", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kb1p2t/deleted_all_world_of_warcraft_characters_and/", "title": "Deleted all World of Warcraft characters and started a small project for an animal shelter", "social_network": "reddit", "user": "Jaredy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 289, "down_vote": 0, "creation": 1607689048, "permalink": "/r/DecidingToBeBetter/comments/kb1p2t/deleted_all_world_of_warcraft_characters_and/", "nsfw": false, "first_save": 1635437993.5641887, "replies_charged": false}