{"id": "t5_2tand_t3_q9erqx", "request": ["b69cf201-6737-4217-b486-9096135546b8", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "I'm 25 , trying to finish my Bachelor in IT (only need 3 more subjects to be able to start my Thesis and finally getting done with this shit), and currently unemployed.  \n\n\nAbout the same month last year I finished my service obligations in the army (9 months)  and came back home only to face that I'm feeling lonely AF. Most of my old friends no longer want to do the activities we used to do and very rarely initiate a hangout. Instead, they are always chilling on Discord playing endless online games / talking with each other (which is kinda ok ) but most of the times when I'm online with them and I ask them to do things they always give answers that seem disgusting to me sort of like \"  I ain't gonna do anything I'll stay home all day and do nothing\" sort of thing which is exactly the opposite of what I wanna hear. Long story short they are a group of friends who almost never go out or do anything fun except for being online ALL DAY on discord playing games.  \n\n\nBecause of that, I lost interest in going out since I have to go alone if I want to, which leads to me staying almost 24/7 home trying to figure out Uni subjects or messing around inside doing nothing progressive, except for practicing the bass guitar. ( its line I end up like them in a way).  \n\n\nThere are days I feel like I'm completely lost and don't know what to do and to top it all my parents have recently divorced and have very bad communication with each other with shouting and fighting every time they HAVE to meet/talk.  \n\n\nI have decided to get better this year and I did by finally trying to finish Uni/applying for jobs recently but overall I have no idea where to start, on what degree I should do what, and how to be better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q9erqx/feeling_lonely_and_demotivated/", "title": "Feeling lonely and Demotivated", "social_network": "reddit", "user": "vaggelis1", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1634399938, "permalink": "/r/DecidingToBeBetter/comments/q9erqx/feeling_lonely_and_demotivated/", "nsfw": false, "first_save": 1635436447.1246426, "replies_charged": false}