{"id": "t5_2tand_t3_mlvs9t", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "# Over the years\n\nOver the years I have managed teams, dealt with several hundred clients and I have picked up several things that I feel really help entrepreneurs live their best life, and that's what this article is about, so strap in let's get into it!\n\n# Never ever put yourself below anyone else\n\nAs an entrepreneur, we have to always be looking after ourself, because WE are the ones that are looking after everything. You need to put yourself first, and the best way to set precedent for this is the START of your day.\n\nYup, I’m going to talk to you about morning routines, because subconsciously, when you dedicate 30 mins to an hour to yourself every morning, you tell yourself: You are important. By the way, I absolutely mean WITHOUT your phone, because when you wake up and look at your phone, you’re being reactive. As an entrepreneur, our greatest strength is to be proactive, at all times.\n\nSo mornings, I like to follow a little schedule which I’ve broken down to accommodate an hour\n\n* Yoga whilst checking in\n* Run whilst doing affirmations\n* Cold shower\n* Gratitude practice\n* Reading\n* Journaling\n* Meditation\n\nThat means I’ve started my day, and done 7 tasks (8 including making my bed - which is very important to do), amongst those tasks I’ve done one of the most difficult things, you’ve got 1 guess which that is, yup - the cold shower. NOW what this has done is set your intention for the rest of the day, you've done what is rated to be one of the most difficult tasks ever. Any challenges that come up during work, you’ve got it!\n\nOn top of the start of the day, you need to understand who the most important person in your life is, the person who has been there from the start, who has been there through every up and down… I’m talking about you.\n\nWe often put others above us because of status, because of what society says, don’t get me wrong our parents, best friend, partner etc, they’re very high up there, but even our parents haven’t been there through every single point of your life, but you have!\n\nThat’s why that validation you seek from others? Seek it from yourself.\n\n# Embrace failure, HUG IT.\n\nI know, you’ve heard it before, many times before. It's either doesn’t fail or embrace failure… but do you truly understand why?\n\nWell, I’m going to explain it through the best way I know how - experiences: Now failures are actually gifts but it's the way we have to perceive them.\n\nYou see every single day, I’m facing failure, but instead of letting it get on top of me, I get on top of it… I welcome it with love, and by that, I mean from a position of love and abundance,\n\nOftentimes we see failure with a scarce mindset, coming from a position of hate, and that means we’re not able to see the opportunity, the lesson that the failure is teaching us. What if… Every single thing that happens was actually supposed to happen exactly like that? Including the adversity... Guess what? It was. You see your journey is not smooth sailing, and no one’s ever is, and that’s not a bad thing at all! So next time something ‘bad’ is happening, understand that it is not happening to you, but instead FOR you.\n\nWould you like a part 2 to this?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mlvs9t/2_things_all_entrepreneurs_should_enforce/", "title": "2 Things ALL Entrepreneurs should enforce", "social_network": "reddit", "user": "thecampereira", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1617776090, "permalink": "/r/DecidingToBeBetter/comments/mlvs9t/2_things_all_entrepreneurs_should_enforce/", "nsfw": false, "first_save": 1635436865.0006251, "replies_charged": false}