{"id": "t5_2tand_t3_a1b42l", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924", "9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "**The idea of motivation is one of many erroneous approaches that have been taken from management to personal life. In fact, motivation is a psychological bomb for the body. It destroys the personality and individual’s life. Discipline works much better.**\n\nIn the office atmosphere, there are a bunch of problems chasing careless employee under a sweet name of “motivation”. And that mix of problems and potential threads implicated in his or her basic needs and ego. Like “I’d be hungry if I lose that Job” or “my neighbors would be laughing at me”.\n\nIn everyday life, a regular night rendezvous with refrigerator does not threaten anyone with immediate problems, but rather offers very pleasant sensations for the next few minutes. The fact, the unpleasant consequences of such behavior will fight back in 10 years, but who cares?\n\nTherefore, we may write a list of goals at the beginning of every day/week/year and try to motivate ourselves to fulfill them. And, of course, fail time to time. Well, most of the time. We may hate ourselves for these failures, then compensate it with sweets/food/alcohol/Instagram. Then we may make beautiful plans again, which we will certainly sabotage soon, and compensate for our learned worthlessness and start again. Running in a circle.\n\nThe average person thinks: “The completion of work depends on my motivation. Therefore, I need to have a mood for doing it and then I will do everything quickly.” And this is his main mistake.\n\nTo fulfill the plans no mood is needed. Or motivation. Things just need to be done no matter what.\n\nIn essence, motivation is such a rattle, a kid toy, a sugar-cotton fantasy, vital for an infantile person to do what is necessary. By the way, the same person will run to the toilet without any motivation, because there is a NEED.\n\nTherefore, instead of trying to “tune in” to do things, you need to concentrate on “how do I consider my emotions is irrelevant and start doing what I decided.”\n\nAdults call it — DISCIPLINE.\n\nThus, the motivation is for children, and adults need discipline in meeting their needs.\n\nMotivation is about limbic, a layer of the human and mammalian brain, it’s our “emotional center”, which is making for us like/dislike decisions.\n\nAnd discipline is about the neocortex, the human level of the brain, our “logical center”.\n\nThe neocortex makes rational decisions and, if it is trained well, it copes well with the suppression of signals from both the limbic and the reptilian brain (the lowest layer, which is responsible for the hit /run behavior). That is why logical reflections always calm the emotions of a person.\n\nSo, lack of discipline is a sign of a child, who is always nervous and dissatisfied with himself or herself and the world around him or her.\n\nMotivation is a psychological bomb for the body. It destroys the personality, making the human unbalanced and unhappy, undermining his faith in himself and his strength.\n\nThere are so many things that are simply impossible to convince yourself to do joyfully. And even in every favorite work, there is always a part that we love to perform and that which we endure. Trying to motivate yourself, in that case, is doomed to failure in advance.\n\nThat’s the reason why diets do not work most of the time. And the poor person considers herself or himself as a forever useless loser, destroying his or her psyche every day.\n\nWhat shall we do? Only awareness of the basic needs and disciplined satisfaction of them work.\n\nA doctor said to my friend’s father that if he does not lose weight, he will die in a couple of years from a heart attack. Father immediately stopped eating sweets and he runs five laps around the stadium every day for last 15 years (even in winter in forty-degree frost). Just no matter what. Does he care about his feelings at this moment? No, he just wants to live and see his grandchildren grow.\n\nNote that the threat of heart disease from obesity disappeared for him after a year or so. Why does he keep running? Because discipline works like a perpetual motion machine: once having changed the approach, a person no longer goes into emotions, does not wait for his readiness to do the task, but simply does everything in his power to finish a job.\n\n**Discipline is built on habits.**\n\nStarting from the small, a person teaches his brain (the neocortex) to cope with childish emotions limbic system like “I want! / Give it to me! / I will not do it!” People grow up this way.\n\nYou sow a thought — reap an action, you sow an action, you reap a habit, you sow a habit — reap a character, you sow a character, you will reap the fate.\n\n**So, there is no Joy? Just a hard work? — NO!**\n\nPeople often think that they were created for happiness and their life should be enjoyable, so they do what they love. Some others torture themselves trying to love unpleasant things/work. Both approaches are wrong. In fact, a very small number of actions brings direct pleasure (via limbic).\n\nOnly RESULT always brings pleasure. But it takes time and efforts to get the result. And you need a lot of result-oriented actions. A labor.\n\nThus, instead of having ceased to perceive short-term actions as a source of pleasure for here and now, people may begin to fill their lives with real results that bring permanent and guaranteed satisfaction, peace and confidence in their tomorrow.\n\nAn orientation of actions towards pleasure is an artificially imposed societal stimulus for the individual, distracting people from their goals and forcing them to move in a circle for the benefit of marketing experts and corporations. Orientation towards pleasure is a sign of an undeveloped infantile personality, and it is such an individual who is the easiest to manage and benefit from.\n\nThe limbic pleasures evaporate as soon as the stimulation is over. Eaten chocolate is forgotten in the next second after throwing a package to trash. Easy come easy go.\n\nPleasures through the neocortex do not come immediately, sometimes they need to be pursued for years.\n\nYou will not be able to enjoy horse riding or playing tennis until you learn it well. You also cannot get gourmet pleasure from the notes of expensive wine, rare cognac or a special type of coffee, if you have not trained your brain to perceive such information through many trials.\n\nNeocortical pleasure can be obtained by JUST THINKING about the subject or about the pleasant experience of the past.\n\nSuppose you like classical music, and bought a ticket to a wonderful concert. Your brain and body will be filled with pleasure before the concert, during it and after. Even more. You will remember it all your life, and feel the pleasure of it all your life too. A joy without an expiration date.\n\nThus, the more positive neocortex pleasure you have in your life, the happier you will be. After all, having earned it once, you can enjoy your whole life. That’s a priceless gift of the discipline.\n\nIn this scenario, with limbic, you play in a casino for all the savings, and with the neocortex, you build a house.\n\nTherefore, the focus of action on the result and discipline in a more detailed examination is the source of eternal bliss.\n\n&#x200B;\n\n\\#discipline #motivation #employeengagement #perfomance #management #success #brain #leader #leadership", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/a1b42l/discipline_vs_motivation/", "title": "Discipline vs motivation", "social_network": "reddit", "user": "Lex_Clavia", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1543443972, "permalink": "/r/DecidingToBeBetter/comments/a1b42l/discipline_vs_motivation/", "nsfw": false, "first_save": 1635435651.2462702, "replies_charged": false}