{"id": "t5_2tand_t3_3fu9du", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "from [my blog:](http://selfimprovementguy.com/self-improvement-club/)\n\n\n**What happens when you get out of bed in the morning? Do you stumble into the shower? Reach for the coffee? Trip over the dog? The things you do first in your day, and the way you do them, can set you up for success or failure...**\n\nAs part of my Self-Improvement I have taken time to analyse how I use my time, how much I get done each day and what techniques I can use to enhance these.\n\nA few months ago I began rising at 5.00am in order to give myself time for important tasks at the start of my day. You can read about this at [\"Getting Up At 5am: 11 Reasons Why You HAVE To Do It And 8 Ways To Make It Easier Than You Think.\"](http://selfimprovementguy.com/getting-up-at-5am-11-reasons-why-you-have-to-do-it-and-8-ways-to-make-it-easier-than-you-think/)\n\nBut there's not much point in rising early unless you make good use of your time. In fact, whatever time you get out of bed, whether you're an Early Bird or a Night Owl, the way you structure the first part of your day can have a significant impact on the rest. So I recommend you create a Morning Ritual.\n\n**Why a 'ritual'?**\n\nMy Morning Ritual is simply a list of tasks that I perform in exactly the same order every morning. You could call this a \"routine\": it would probably sound less mystical or spiritual. But \"routine\" sounds so ordinary and uninteresting, whereas although it includes several mundane tasks, my Morning Ritual is anything but ordinary! It is an extraordinarily powerful technique that sets me up to succeed every day. So don't sell yourself short and get into just a \"routine\": establish a unique Morning Ritual and make it something special.\n\n**Habit Chaining**\n\nYour Morning Ritual is a great opportunity to add new positive habits to your life. One of the best ways I have found to develop a new habit is to link it to an existing habit. So if you wanted to get into the habit of writing a daily journal, you could choose to write it as soon as you sit down for your morning coffee each day, or just before you clean your teeth at night. Doing the already-habitual task (the coffee or cleaning your teeth) triggers the new habit (writing your journal).\n\nThe Morning Ritual allows you to chain together any number of new habits in this way. If you are intentionally and consistently performing your Morning Ritual, it is simple to insert a new task that you might be having difficulty remembering or getting around to.\n\n**Remember it or write it down?**\n\nShould you commit your Morning Ritual to memory or should you write it down as a To Do List and refer to it daily? I prefer to have it written down, because:\n\n* when I get up at 5.00am it takes a short time to become fully alert, so I might miss something\n\n* writing things down is generally a good Self-Improvement habit: it takes unnecessary thoughts out of your head, allowing your brain to work more freely on other tasks\n\n* if you're a Self-Improver you should have a To Do List of some kind anyway, so why not use it?\n\n* having a list and checking things off as you go provides self-accountability, an incentive to get things done and a feeling of achievement.\n\n**What should I include?**\n\nMy Morning Ritual currently contains 29 different tasks! That might sound like a lot, although many of them are short, mundane tasks like \"Let the dog out\" or \"Refill water jug\". The real power of the Morning Ritual is not in getting lots of things done, but in getting your important things done. As you embrace more and more Self-Improvement, there will be important areas you want to develop, such as reading, meditating, writing, goal setting and reviewing. Putting these tasks into your Morning Ritual ensures you are making daily progress with them. \n\nI won' t bore you with my whole list (it changes from time to time anyway) but here are some of the key items I have in my Morning Ritual at the time of writing. I've chosen these examples to demonstrate how I'm using my mornings to intentionally and consistently work on areas that I think are important to me right now:\n\n* **Dental care** - Of course I clean my teeth every morning, I don't need a ritual to remind me to do that! But a couple of years ago my dentist told me start using an inter-dental brush to clean between my teeth. I started building the habit each morning, but I had trouble getting it to stick. I would use the inter-dental brush for a couple of weeks but then I would stop again. When I began developing a Morning Ritual, this was one of the first 'habit problems' I set out to solve. It worked: I haven't missed a day in months and my dentist is delighted with the improvement in my gum health.\n* **Spiritual health** - I'm a Christian (not one of those in-your-face ones...) and for me it is important to spend regular time reading the Bible, meditating and praying. But like many (most?) Christians, I used to find it hard to maintain a daily habit. Now it's not a problem: I added these tasks to my Morning Ritual. With the help of Our Daily Journey and Bible in a Year I spend time every day developing my spiritual health. Your beliefs may be different, but nevertheless developing your spiritual health is a part of Self-Improvement you shouldn't ignore.\n* **Afformations** - I stumbled upon Afformations while researching Affirmations. Since mentioning them in my post about Getting Up At 5am I have had several questions about them. I will write a separate post about them shortly; for now, a Google search will give you the basics.\n* **Writing** - Without my Morning Ritual, this blog would not exist. I decided I wanted to write about my Self-Improvement experiences, but as a very busy teacher there was no time in my day to start a new project. So I set aside a 45-minute focused block of time in my Morning Ritual devoted to writing, formatting, publishing and promoting the Self-Improvement Guy blog. And as a testament to the success of my Morning Ritual: here it is!\n* **Journalling** - Every day I take out a lined A4 writing pad and my favourite pen to write a page about my day-to-day life. When I have finished I scan it into Evernote (safely backed up to the cloud via Dropbox) and then file it in a display book. It's the best part of my whole Morning Ritual: I'll write more about my journal soon...\n* **Inbox Zero** - When you use digital systems like email, note-taking software and to-do apps, it's easy to let things get out of control on the front end. Unread emails pile up in your inbox, notes saved to Evernote get \"stuck\" in your input folder and the tasks in your To Do list start to run out of control. My antidote to this is \"Inbox Zero\": as part of my Morning Ritual I process (Do, Delegate,Defer or Delete) every item in my email Inbox, tag and file all my new notes in Evernote and assign any new to a project or list in Nozbe (my To Do list manager).\n* **News & Weather** - I deliberately keep my contact with current news at a minimum (see \"12 Great Ways To Improve Your Thinking\") so My Morning Ritual is my one daily opportunity to keep up to date. I spend between 5 and 10 minutes scanning Google News and 1 minute checking the local weather. When you live in the UK you have to know about the weather because it's our most popular topic of conversation.\n* **Teaching Room maintenance** - I work from home and have a \"Teaching Room\". In addition to its weekly clean, I spend a short time each day tidying round and dusting the areas my pupils will use, in order to maintain a good impression of my business.\n* **Reviewing Goals** - There's no point in having goals if you're not regularly measuring, checking, reviewing and adjusting them as necessary. I briefly revisit all my goals as part of my Morning Ritual: it helps keep me on track with them.\n* **Making breakfast** - For some, breakfast might be a mundane task, but for me it is important. At the same time each day, I make breakfast for myself and my wife. It's one less thing for her to do in the morning, it's an opportunity to show her I appreciate her and we get to enjoy eating and talking together before our separate jobs take us away from each other for the day. When we've finished, I clean and tidy the kitchen because I know it makes her feel better going out knowing everything is back in place. Taking small opportunities to serve those we care for is a great Self-Improvement technique.\n\n**Start your own Morning Ritual today**\n\nHaving a Morning Ritual takes the guesswork out of your mornings. There are no major decisions to make: you just follow the Ritual and do all your prearranged tasks. Yes, it's \"regimented\", but in a good way. Important tasks are reliably completed and you don't forget anything. Having your morning organised doesn't stifle your creativity: quite the opposite! The mind-space you create by \"getting your ducks in a row\" allows you to think and express yourself more freely. In fact, I get most of my best ideas during my Morning Ritual!\n\n**Give it a try: start with the tasks you often do in the morning anyway. Get them in order and write them down. Then add just one or two extra Self-Improvement habits you'd like to develop. You can add more as these become established. If things don't go to plan one day, remember to \"fail gracefully\" and restart your Ritual the next day as before. Be consistent. Be intentional.** \n\noriginal (and [free eBook](http://selfimprovementguy.com/self-improvement-club/)) posted at [selfimprovementguy.com](http://selfimprovementguy.com/the-morning-ritual-easily-achieve-your-top-tasks-before-breakfast/) ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3fu9du/the_morning_ritual_easily_achieve_your_top_tasks/", "title": "The Morning Ritual: Easily Achieve Your Top Tasks Before Breakfast!", "social_network": "reddit", "user": "djhendra", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1438751016, "permalink": "/r/DecidingToBeBetter/comments/3fu9du/the_morning_ritual_easily_achieve_your_top_tasks/", "nsfw": false, "first_save": 1635436218.252227, "replies_charged": false}