{"id": "t5_2tand_t3_q7424t", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "c67213dc-0eed-4cac-a781-9bc082742908", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "A bit of context: I have dealt with depression and anxiety for a very long time. I've been seeing a psychiatrist for the past couple of years and she's been a huge help. I'm taking medication and I'm happier all around. I've cut toxic people out of my life, I'm no longer smoking weed on the daily, no longer binge drinking multiple times a week.\n\nHowever, most, if not all, of my few friends love drinking. We go out, we drink. We drink a lot. Sometimes drugs get involved, but I tend to stay away from anything other than alcohol and nicotine.\n\nAnd every time I go out, I tell myself, I will not drink too much. I will stop myself after a few drinks. But a couple of shots later, I'm binge drinking again. Shot after shot after shot. And then the next morning I wake up with blotches in my memory, feeling like utter shit, and embarrassed at how I acted (even if I wasn't embarrassing in any way). I get very friendly and talkative and I love making new friends with other girls when I get drunk. But it is just so embarrassing for me to think about the next day, what I could've said or done in the moments that I can't remember. Did I offend anyone? Do they all hate me now?\n\nI know alcohol is the source of so many of my negative feelings. I'm happy and having fun in the moment while drinking, but then the next day, my depression rears its head and my anxiety lingers for longer than usual. I isolate myself for days to get over this embarrassment.\n\nAnd then the next time I see my friends, everything is good and they don't hate me as expected.\n\nAnd then repeat this cycle over and over again.\n\nI know all I have to do is stop drinking as much! It's so easy to say out loud. It's so easy to think and to tell myself that. I drink maybe once or twice a month, but when I do, I go hard.\n\nSorry for the rant, I'm just so sick of feeling this way and need some advice. How do I get over this embarrassment quicker if I DO end up drinking like this? What can I do to stop myself from drinking so much in the moment? My friends aren't the type of people to stop you from drinking. If anything, they encourage you to drink more.\n\nThank you very much in advance.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q7424t/alcohol_and_embarrassment/", "title": "Alcohol and Embarrassment", "social_network": "reddit", "user": "roseypuff", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1634101475, "permalink": "/r/DecidingToBeBetter/comments/q7424t/alcohol_and_embarrassment/", "nsfw": false, "first_save": 1635435070.5243912, "replies_charged": false}