{"id": "t5_2tand_t3_g02ha8", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Hello fellow self-improvers!\n\nI'm choosing to be as active on my focus of self-improvement because complacency is literally the devil for me. I can't allow myself to fall back into the old way of 'existing' because I'd rather be alive and bringing meaning to my life, one day at a time.\n\nI have something I'd love to share. Perhaps it'll resonate with someone else; but I'm posting this primarily because it's important I consolidate and remind myself of this information as much as possible. I had wrote this list a year or so ago - but it needs to be said that when I wrote this I was still running from the pain by acting out with self-pity and self-hatred.. so it didn't stick with me. But today, as my soul is only soaring when it hears the truth, and when I embrace the reality that \\*I can get better\\*, I want to share this.\n\nThe 'three circles' is something that is practiced within particular anonymous fellowships whereby the recovering addict tries to see their behaviours within three circles. The outer circle is the place that the recovering addict wants to be- where they are truly living life and safe; The middle circle is the danger zone- where they are playing with fire and where they are on the slippery slope which can lead to; The inner circle- this is the 'fuck it' zone where the addict is no longer fighting and where they're in the most destructive state of being by acting out. The key thing to know is that a recovering addict doesn't go from the outer circle to the inner circle without going through the middle circle first. \\*So the behaviours that the addict needs to be acutely aware of as the place they need to fight are the ones that belong in the middle circle\\*. These behaviours vary per the individual, so this my model isn't akin to another recovering addict.\n\nWith that being said, I want to share all the behaviours I have listed within my three circles. I'll begin with the worst first and foremost:\n\n**The Inner Circle - Acting Out/ The Fuck It Zone - behaviours from which I am fighting to abstain from entirely:**\n\n* Gambling (all forms; no exceptions).\n* Looking at porn.\n* Over-drinking/ drinking to get drunk.\n* Suicidal thoughts/ self-hatred/ self-harm.\n* Being completely dictated by impulses.\n* Zero prayer life/ existence of faith.\n* Leading others into behaviours I want to abstain from.\n* State of complete self-absorption.\n\n**The Middle Circle - Playing with Fire/ Danger Zone - 'Slippery slope' behaviours which lead me toward my inner circle. \\*While in this zone I can follow very precise steps to get back into the outer circle\\*:**\n\n* Not making a loving effort towards my relationships.\n* Clinging to negative feelings.\n* Taking offence easily.\n* Caring excessively about things that are out of my control.\n* Clinging to the thought 'I don't trust in myself'.\n* Not making time for my higher power with prayer.\n* Procrastinating/ being lazy/ not having a plan for my day.\n* 'Playing with fire' - going on websites I shouldn't/ clicking on NSFW posts on Reddit.\n* Scrolling endlessly through social media.\n* Inappropriate conversations/ jokes.\n* Swearing constantly.\n* Being isolated for too long; not picking up the phone to check in with fellow recovering addicts.\n* Allowing myself to feel overwhelmed with perfection rather than progression.\n* Oversleeping/ under-sleeping.\n* Overeating/ eating unhealthily.\n* Judging others/ gossiping.\n* Not taking my required anti-depressant medication dosage.\n* Playing with inappropriate thoughts/ fantasies.\n* Telling 'white lies' to people.\n* Spending money recklessly.\n* Putting myself in environments that don't feed my soul.\n* Being inconsiderate of others.\n* Arguing needlessly with wife; not trying to find a loving solution but remaining in an entitled state of 'needing to be right' rather than seeking peace.\n* Making snap-judgements about other people.\n* Wasting time.\n* Selfish actions.\n* Becoming bothered over unimportant conflicts.\n* Being indifferent.\n* Not caring about the environment.\n* Lacking compassion towards self and others.\n* Being impatient.\n* Assuming that other people have the worst intentions towards me.\n* Being entitled.\n* Playing mind-games/ taking tabs/ tit-for-tat kind of attitude.\n* Allowing myself to be dictated by anger.\n* Knee-jerk reactions to conflict.\n* Wanting to be given more than I am seeking to give.\n* Not participating in any kinds of extracurricular activities.\n* Not properly listening to other people.\n* Not being present in the moment.\n* Looking down on other people for any reason.\n* Worrying about the future.\n* Hating myself for the past rather than learning from it.\n* Comparing myself to others; carrying jealousy.\n* Thinking in ways that are unhelpful and not evidence based.\n* Not praying before sleeping.\n* Not praying first thing in the morning.\n* Not trusting in my Higher Power.\n\n(Phew... okay now for the good stuff.)\n\n**The Outer Circle - The Place To Be/ The Safe Zone:**\n\n* Working hard; having a fighting attitude every single day.\n* Practicing the mantra 'I reject self-pity and self hatred; I am fighting for my life.'\n* Praying/ spending time with my higher power.\n* Attending anonymous meetings \\*as much as possible\\* and actively participating in them.\n* Forgiving self and other people.\n* Counting my blessings.\n* Following a consistent routine while taking care of my 1 year old son.\n* Being truly present with my son; encouraging good behaviours at his young age.\n* Playing with my son.\n* Surrounding my son with a loving and safe home.\n* Being ready to 'fight' and do what's right at all times.\n* Forcing self to be selfless when carrying out day to day responsibilities of life.\n* Being a truly loving husband with a sincere desire to be a support for my family.\n* Actively listening to my wife (not quickly suggesting solutions when she is just wanting emotional support).\n* Seeking things to do to keep my day productive; fighting idleness.\n* Keeping a tidy environment; attending to a daily list of housework that keeps the house a home.\n* Eating healthily and in moderation.\n* Relaxing efficiently.\n* Doing body stretches regularly.\n* Using money in moderation.\n* Budgeting.\n* Going for a walk.\n* Listening to good music.\n* Baking.\n* Learning something new.\n* Attending religious duties (attending services regularly including going to confession regularly).\n* Living in moderation.\n* Reading literature that feeds the soul (self-help books/ autobiographies of people with incredible stories/ reading holy scripture with an open mind).\n* Praying a novena (this is a nine day prayer that I always find incredibly powerful).\n* Being honest to myself about everything.\n* Being joyous and good-humoured.\n* Being respectful to self and others.\n* Respecting the environment.\n* Planning for the future.\n* Doing something kind for another.\n* Going to bed at a regular time.\n* Waking up early and sticking to a healthy morning routine.\n* Creating an attainable work plan and persevering with these responsibilities (breaking down tasks into smaller more achievable goals)\n* Spending quality time with family and friends.\n* Being truly present with others.\n* Cherishing the time I spend with my wife and son.\n* Approaching all the problems and challenges in my life with patience and grace.\n* Reading a good book; watching an educational documentary; watching an enjoyable movie.\n* Doing something completely new.\n* Doing the opposite of what I 'want' to do when I know it's bad for me (acting according to what is right; not to what simply makes me 'feel' better.)\n* Practicing and working on a talent.\n* Supporting others.\n* Trusting in my Higher Power.\n\nI know if I think hard I could add so much more to the middle and outer circle lists, but I'll leave it at these\\^ for now.\n\nI'll explore on another day regarding the actions I should take when I inevitably fall into the middle circle because I think it'll be really important for me to have these action plans.\n\nFor the sake of discussion- if these were your lists; what would you write?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g02ha8/the_three_circles/", "title": "The Three Circles", "social_network": "reddit", "user": "iamgettingbetter_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1586717865, "permalink": "/r/DecidingToBeBetter/comments/g02ha8/the_three_circles/", "nsfw": false, "first_save": 1635436064.5492744, "replies_charged": false}