{"id": "t5_2tand_t3_oyxe85", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "I guess I have ever been satisfied with myself, and there were a lot of good reasons why I should not be. I am short, I am considered fat for someone with my height, I don't have the best grades, socializing has never been the easiest thing for me, and I was emotionally immature. I know those are my flaws so I tried to change, I tried to be better. \n\nI know that I am not a genius so I tried my best to work hard, I worked harder than anyone in my class. I graduated early and became the youngest student in my graduate program. I worked my ass off to get here, and I am proud of myself, but somehow that does not feel like enough for me. When I was in college, I have thought that getting into a PhD program is how I am going to be better, but now that I am here, why don't I feel enough? \n\nI have always known that I am different from my peers, I would rather stay in the dorm with a book than going out and party, I don't want to drink before I turn 21 so instead I help taking care of my roommates when they got drunk. I was comfortable with it, I thought I was being me and then one of my roommate called me vanilla one day. I smiled because thats my fav flavor of ice cream, then I found out what it means when being used to describe someone, and it hurts. \n\nI thought that maybe when I get into grad school, I will find more kindred spirit, and I guess it went well until one day when I caught one of my \"friend\" who blew me off that night having dinner with some guy. She said sorry and asked me not to tell another friend of ours because she also likes that guy. Suddenly I felt like I am back in high school and I did not like it. \n\nMaybe that is the end of my socializing, I should have realize that it is impossible to find a kindred spirit and just keep it to myself, but the tiny part of me who wants friend kept hoping and kept getting disappointed. \n\nIt is funny how my path of getting better, being better went down a more and more passive trail. I have always made fun of myself as a \"realistic romantic\", in that I love love story, but believe deeply that it will never happen on me. I got disappointed with the concept of love after seeing my parent's marriage, and I have seen so many of my peers falling in and out of love, and I do not want none of this. \n\nI get that this is getting more and more ironic. I kept looking for friends yet I got uncomfortable seeing how this is not what I wanted. I read stories about love, fantasize how it might happen on me one day, then wake up and told myself that this is never going to happen and I should just be okay with it. \n\nIf you have read until this part I want to say thank you, because somewhere even I have felt that I lost the logistic of writing, and I have no even gotten to the part of why am I writing this. \n\nAs I mentioned before, that I am considered fat for someone with my height (I am not tall). In my culture, it used to be that girls are expected to be skinny (at least thats what I was taught when I grow up, I am glad to see the definition of female beauty getting redefined these days in my culture). Yet, ironically, I fall back into the cliche of expecting myself to be skinny. Partly because if I do not get skinny, I will always hear the voice of someone laugh at my weight. I can hear my mom saying that because I am short, I have to be extra skinny to look pretty. I can hear my dad blaming my grandma and my mom for feeding me too much and make me fat, and I can hear my grandma telling me that I am pretty, and will be even prettier if I can lose some weight. \n\nI have been trying, I guess, I think I that I have been trying really hard to be better. I cannot do two major goals at once so after I got into grad school, I started trying. I controlled what I eat and I literally only eat a little bit everyday. I have actually lost weight and I was happy, I was happy every morning when I wakeup and stand on the scale, and even in days where the number did not decrease, I told myself its okay and Rome is not build in one day. I can see the shape of my face changing and I was even able to fir into a pair of tight jeans which I bought by mistake before. I was doing well and I was getting better. \n\nThe trigger is the dress. I have always like princess stories and wanted to be like a princess. I know that sounds immature, but when I say that, I meant I want to be proper when talking to people, have a nice heart, some talents, confidents, and ofc, pretty. I like dresses from the 70s and I guess in general I just like fashion. I am really good with drawing and I wanted to be a designer when I was a kid. Even now I got into research, and wear lab coats basically everyday, I still browse through dresses sometimes bc they make me happy.\n\nNone of these have hurt me until I saw this dress. It was a really pretty dress but a bit pricey. I shared the picture with my mom and she said I should buy it if I like it. I hesitated. I want to say it is for a couple reasons, but I can't lie, its only one reason - that I know I am fat and cannot wear the dress as pretty as the displaying model. \n\nMy mom has actually changed her opinion of me, she has been very honest to me since I was a kid and I appreciate it. She would tell me that she is proud of me and even look up to me as I have grow so much. She tells me that I have grown from a girl into a lady and I look so pretty. I have always valued my mom opinion and tried so hard to get her approval, but now that I have finally get it, why do I still not like myself, why don't I feel like a better version of me. \n\nIt is probably silly, crying over a dress. But if I have to symbolize that dress as everything I want to be, then I guess I am crying as I see the distance between the current me and what I want, even after such a long time of hardworking. \n\nI have always thought that once I am proud of myself, I can be better, I can be a better version of me. And now that I am proud of myself in couple of aspects, yet I still feel empty in the journey of being better. It feels like its never gonna end. I am never going to be what I want.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oyxe85/will_i_ever_be_enough/", "title": "Will I ever be enough?", "social_network": "reddit", "user": "drworryalot", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1628216163, "permalink": "/r/DecidingToBeBetter/comments/oyxe85/will_i_ever_be_enough/", "nsfw": false, "first_save": 1635435379.0935183, "replies_charged": false}