{"id": "t5_2tand_t3_nx4d7g", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "So this is my first time uploading anything on Reddit so I apologise if this body of text doesn’t make the most sense but I’m going to try. So since about Year 9 in secondary school( from the uk) iv experienced a constant blank mind that’s been hindering with my life ever since. Gradually over the years this just got worse to the point where I could be speaking with my loved ones or closest friends and literally be unable to speak about anything because my brain does not seem to function. About 3 years ago i started to feel numb but this got worse over time as well so I basically just feel nothing all the time nowadays which is shit. Iv stopped trying to put a happy face on because it just takes too much energy. Completely lost the ability to laugh genuinely and have a good time, seriously do not remember the last iv felt happy. Everything just seems dismal and grey and talking to people feels like a chore due to being unable to converse with anyone. My mind feels like a haze, constantly feel confused and never have any coherent thoughts. Both Short term and long term seem to be in the gutter. Never want to see friends. If I have to read something, I’d have to read it multiple times to even get a basic understanding of what is being said and then forget it straight away as I move onto the next paragraph. I just can’t seem to retain information at all. My family or friends can tell me the same thing over and over again but I’ll still manage to forget and I basically feel like an absolute spasticated idiot most of the time. I just don’t know anymore. I used to love training and exercising but iv lost that drive, I still workout but I really only go because I feel like it’s one of the only things that’s kind of held me back from being absolutely brain dead and dreadful. My cousins come very rarely but they came over yesterday and we were sitting in my room and cousin asked me  if I was ok. Of course I lied and said Yh I was fine( reason being because I don’t want him to run his mouth and let other cousins or his siblings to know), I asked why and he said I looked broken and tbf I was feeling exactly that. My other cousin also mentioned that I looked like I wanted to kill someone which seemed odd to me as I didn’t feel any emotion at the time and I wasn’t angry. During secondary and college, I don’t remember ever sleeping on time so I was either running on no sleep,3-4 hrs of sleep or too much sleep. Mostly minimum amount of sleep from ages 12-18. I feel like this may have had an impact. Constantly procrastinate and experience a lot of anxiety. I’m sure iv missed out a bunch of things because my brain is useless. I would really appreciate some advice. Thank you", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nx4d7g/been_feeling_like_shit_for_7_years/", "title": "Been feeling like shit for 7 years", "social_network": "reddit", "user": "1extraterrestrial", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1623376006, "permalink": "/r/DecidingToBeBetter/comments/nx4d7g/been_feeling_like_shit_for_7_years/", "nsfw": false, "first_save": 1635437990.76489, "replies_charged": false}