{"id": "t5_2tand_t3_hmrshk", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I thought I was doing just fine, until I saw my younger brother again for the first time in six months at my parents place. We both live in different city's and he's really busy (and I tell myself I am as well), and we haven't seen each other in a while for that reason (and also due to covid, of course).  \nAnyhow, so he was talking about all the things he had achieved so far. And while I know he's a high achiever, man that really hit home. There's no jealousy involved at at, I am more proud than you could imagine, but it made me realise that I am just wasting my time. He just finished his bachelor at the university, doing honours class, getting multiple job offers before he's even finished etc. I'm going into my 6th year in college, whilst it normally should take 4 years, and getting myself into a debt. Got no job and I can't find one. Granted, he always knew what he wanted to do and I still don't so...\n\nSo, I spend the weekend there with my parents and him and it was really really good. Needed to get out of my room and see my family again. But when I came back it really hit me, I felt really bad about it. I woke up the next day and it was like I'm a completely different person. Instead of procrastinating  everything I had to do I started doing everything immediately. I send out 37 job applications in a day. I'm making sure I'm getting finally ready to finish college. I do in a week time what I used to do in a months time. And the best part about it is that he used to look up to me, but now I look up to him! Which really makes me happy to see how much he has matured!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hmrshk/i_think_something_finally_clicked_with_me/", "title": "I think something finally clicked with me", "social_network": "reddit", "user": "Basseronie", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 195, "down_vote": 0, "creation": 1594116384, "permalink": "/r/DecidingToBeBetter/comments/hmrshk/i_think_something_finally_clicked_with_me/", "nsfw": false, "first_save": 1635437008.7135127, "replies_charged": false}