{"id": "t5_2tand_t3_j9lest", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "I know the title is vague, but what I mean is like how can I be kinder to myself and others? Sometimes even when I’m not trying to be, I’ve been told I sound aggressive. I’ve had issues with my anger and emotions in the past but I have always been aware of that worked on it as best as I can. I’ve gotten better, but I can still get better.\n\nThere are things I’ve done in my past that I’m not really proud of. Not like hurting anyone physically or something illegal, but I feel like I’ve been an asshole a lot to ppl for no reason. Just for getting under my skin. Stupid shit.\n\nSometimes bad shit happens to me in life and always think about how I treated certain ppl in my life. Like thats why this shit is happening to you. I’ve always shown love to those I care about, but when sometimes I’ve been a dick.\n\nI always think about it like damn I’m a bad person. Then I try to think positively like no I’m not, I’ve done x,y, and z but the negative thoughts always creep in.\n\nFeelings of regret, disappointment, ashamed, angry. Ppl even tell me “you look and sound like a mean dude”\n\nI just don’t wanna be known like that. I wanna be able to forgive myself and be normal. How can I be better? I know its unpopular on Reddit, but I believe in God and I know shit is more complex than heaven and hell, I always get shook because I’m afraid God won’t forgive me. \n\nI feel like this is my biggest downfall and failure. I need to get better at handling conflict. I need to be more loving and accepting and open minded. I need to be better at not losing my cool quickly.\n\nMy problem is idk how to even start doing that. I know It probably sounds dumb, but I just don’t understand how I can do this and do it CONSISTENTLY. \n\nI was just hoping maybe some ppl on here could help. Please be kind, I’m just trying to do better", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/j9lest/how_can_i_be_kinder_to_myself_and_others/", "title": "How can I be kinder to myself and others?", "social_network": "reddit", "user": "Mysterious-Service79", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1602482218, "permalink": "/r/DecidingToBeBetter/comments/j9lest/how_can_i_be_kinder_to_myself_and_others/", "nsfw": false, "first_save": 1635437172.3808277, "replies_charged": false}