{"id": "t5_2tand_t3_n8cqku", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1"], "text": " You secure admission in a top 10 college and you are pretty excited about going to college and attending university. You dream of the days you are going to spend in college, attending various classes, enjoying parties, building your network of friends and then finally graduating. The college life takes some getting used to, with the various classes, assignments and the associated deadlines. You push yourself to ensure you complete all assignments on time and sometimes you just about make it before the time window closes. Phew!\n\nBut have you thought about what you would do if there were no deadlines.. like for instance, after your graduation, when you step out of the college gates, the world is your oyster. However, there is plenty of time to catch the oysters. So, you dilly dally, putting off your goals, wait for the next time window, and feel no pressure. Suddenly you are free to do whatever you want and whenever you want. And you do just that!\n\nBut first, you make elaborate plans, sketch grand schemes and create roadmaps for the future. You dream of a better tomorrow. By the end of the day, you are satisfied with your plans and then tired, go to sleep with the assurance that you have everything sorted out.\n\nThe next day dawns and you wake up late, still hungover with the success of your well laid out plans. You decide to reward yourself by watching some videos on Youtube and before you know it, its already noon. You go out for lunch, hang out with friends, and then its almost night. You get invited to a party and then you party all night and come home in the early hours of the morning. You crash into bed with the reassurance that you have your life all planned out.\n\nThe next day you wake up with a hangover and tell yourself that you will give a day to recover and detox yourself, before you set about conquering the world and achieving your lofty goals. After all, the plan is already made. You decide to see some videos on how to detox yourself, how to cultivate good habits, etc. As before, the day again comes to an end pretty quickly and you decide to put your lessons into practice from tomorrow.\n\nThe cycle repeats on and on and on and on.\n\nIts already a year since you made your life plan and you haven’t even completed 1% of your actions. You wonder how this happened? You were so good in completing your assignments on time during college. What happened to that now, you wonder?\n\nSchools and colleges are able to get students to achieve goals through planned deadlines and associated peer pressure in complying to these deadlines. You prove yourself worthy if you are able to submit your assignments on time and get good grades. This then becomes a routine for students and they comply.\n\nHowever, after college, there are no deadlines and no warning given to students about this. You are thrust into the world without this warning that their deadlines should be intrinsic and not extrinsic. This is a dangerous action and has consequences for some students who graduate. That is why many students who fare so well in college go on to lead fairly ordinary lives. There are no more extrinsic deadlines and no peer pressure. Erstwhile students are now relieved and while away their days pursuing the many distractions that come their way. By the time you realize, precious time has slipped by without any progress.\n\nColleges and universities need to inculcate the power of habits, the importance of setting up processes and systems, the dangers of procrastination, etc in students. They need to instill in the students the need for intrinsic motivation. Whether these topics will be included in the university syllabus or not, only time will tell.\n\nSo, for now, if you plan to go to college, well, congratulations and good luck! Make new friends, learn new concepts, explore the world of opportunities that lie ahead of you. But do not depend on college to set the deadlines for your life. You need to do it yourself. Its your life. Live it, Earn it, Enjoy it!\n\nSeize the day, Carpe Diem!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n8cqku/dont_go_to_college_for_this/", "title": "Don’t go to college for this…", "social_network": "reddit", "user": "Lonecfawolf", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1620561353, "permalink": "/r/DecidingToBeBetter/comments/n8cqku/dont_go_to_college_for_this/", "nsfw": false, "first_save": 1635436178.6226366, "replies_charged": false}