{"id": "t5_2tand_t3_ejdzvs", "request": ["78fd6fdb-9773-43a2-a009-a544155322bc"], "text": "And I had an ephifany! MINOR SPOILER ALERT\n\nFor those unaware, YOU is about a guy who \"meets\" a woman and enchants her through his many acts of love. He says all the right things, his every move all by the book and in the eyes of his victim he is the perfect guy. Apart from the fact that he is a serial killer who goes to the very extremes in what he believes to be the name of love. \n\nI remember my sceptisism in the beginning, as his actions, aswell as intentions, are some I believe almost every guy recognize when trying to impress a girl. I feared it could cause a lot of women to fear the intentions of a guy doing a kind act/being a gentleman, since terms like \"toxic masculinity\" and the like are getting tossed around a lot these days. This show could cause a lot of damage to the relation between men and women, seeing how the show compared the guy's intentions to those of a serial killer. Luckily my fear evaporated the further I watched.\n\nAnyway, I think there's a lot more in this show that I find draws parallels to everyday life and how we justify our behaviours than what meets the eye..\n\nThe part about the main protagonist, Joe, that I find most intruiging is how he constantly narrates his thought process. His inner voice is surprisingly thoughtful and you can tell his intentions are actually in good faith, that he actually believes he does what love demands and that he truly cares for the girl. Yet his actions are insane and merticulous and speak of something more sinister. \n\nIt's a delusion, a lie he truly believes that he is not crazy or dangerous but just determined to do whatever he must in the name of love. It's rather upsetting to watch him internally, calmly rationalize locking up the women he loves in a cage to \"protect\" her. Also a parallel there, both guys and girls have \"caged\" their partners to keep the relationship in their Davor.\n\nI find this concept to be the bread of the show and one I believe many of us will recognize in ourselves. Allow me to explain before you think I'm comparing anyone to a serial killer okay!\n\nFilosophers say that we as individuals judge others by their actions but ourselves by our intentions - sounds familiar right? This is all Joe does. Well, Joe made me realize how much I relate to that rationale.\n\nI have many addictions, I sometimes lie about small things to spare others from what's actually going on in my life, I am lazy and too often lack motivation. It's bad, but not serial killer bad.\nI realized through the show that my thought process reminds an awful lot like Joes. I forgive myself too quickly for my mistakes and I'm too stubborn to resent my actions. Just like Joe I have been in the faith that I am someone who means good and thus can not do wrong. \n\nIt made me realize how I, subconsciously, believe I am in fact better than most if I really put in the work - however in that belief I became too prideful to actually put in the work. I believe I can do anything I set my mind to, yet the result was I got no motivation to do any of it. I also used to think my emotions were more real/valid than so many others, like people caught up in social media and such (Something Joe does a lot too) in sort of a condescending victimhood complex.\n\nYesterday I finally quit my biggest addiction, weed. A lot build up to this long-over-due decision, but this time I know I will stick to it. Part of my new motivation I can thank Joe for. \nBecause I realized how I, like Joe, am unable to see the damage of my actions. Where he hurt others I just hurt myself, but the parallel is still there. \nI have to be better than what I have (or havnt) been. Because up until now I have kept myself in the delusional faith that I am better than what I show - but now I know, that I (or anyone) will never know how good I can truly be before I have proven it to myself through my actions. I now thirst to work to improve myself so that I can move past relating to a guy like Joe\n\nIt took me long to realize this is a part of what have held me back so long, the self-rightous sense of self and priviledged perfectionistic narrator in my head spewing out all sorts of lies to feel better, without having to do anything to validate those feelings. Like Joe, chaos have followed me, and I walked unfaced through it all.\n\nSo here's to those of you like me and Joe with the internal narrator that makes excuses and forgives you for any mistake you have made - Do NOT let it fool you into thinking you're not as imperfect as everyone else. Your actions do speak louder than your intentions, good or bad, and they should be your biggest target for measuring your worth and improving your life. \n\nI'll finish with the recommendation to give YOU a watch. Apart from the introspective lesson it taught me, there's a lot of well written characters (especially in the 2nd s) and some pretty intense scenarios that will make your toes curl!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ejdzvs/finished_2nd_season_of_you_on_netflix/", "title": "Finished 2nd Season of \"YOU\" on Netflix", "social_network": "reddit", "user": "newthrowgoesaway", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1578049591, "permalink": "/r/DecidingToBeBetter/comments/ejdzvs/finished_2nd_season_of_you_on_netflix/", "nsfw": false, "first_save": 1635436354.7543898, "replies_charged": false}