{"id": "t5_2tand_t3_57v0k0", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "So I don't want to bore you with every little detail because I don't have time to explain my life story, so I'll make this quick and to the point. During summer 2016 I had my life crumble around me. I lived in a 2 bedroom house with 2 of my best friends and girlfriend. It came down to my roommates moving to Arizona and my girlfriend and I split due to my actions. So for the last few months, I have been wallowing in self pity, paying an excruciating amount of rent, 1850 by myself in Los Angels. MURDER. And I work at a restaurant, and during this time that my life was crumbling, enter new management, who started to take away my shifts and more importantly my bar shifts [been with the company for 7 years, and now I have to answer to new bosses who control my schedule, and actually know NOTHING about how our restaurant works]. Fucked up.\n\nI thought everything was over. My life had seemed worthless. I started using drugs to alleviate the pain but that further depleted my access to money, creating a bigger hole that I had to dig myself out of. Coupled with my drinking, I was not in a good state at all. This went on for a few months, from July 2016 all the way until right now. I was an addict, cared about nothing more than drinking and drugs. I was losing shifts, losing money, alienating myself from friends, basically becoming a recluse hermit hopped up on drugs with no money for food. I lost 20 pounds during the summer and lost many connections with friends, and saw myself being less respected at work. Everything was going wrong. Until now.\n\nAs I said before, the company I was with for seven years started removing my shifts and basically destroyed the schedule and money I was making before. I naively thought things would get better, and they didn't. And now it's October.\n\nSo this has been going on a few months, but a few weeks ago, I turned around. I finally applied myself and put myself out there and found a new job, one that seems more promising and will pay much more. I started drinking less and have slowly started weening myself off drugs, did my last bit today, for I am over being a loser. I am NOT a loser and I created a mindset that I was. I put in my two weeks at my old job and start my new job in two weeks. I started eating more and have put on the pounds. I don't want to be the old me, I want to embrace the new me and let it flourish.\n\nI just want to write out that I'm scared. This new job is intimidating, and I am truly nervous. I have been with the other place for so long that it is all I know. But there is no growth in comfort. So I must progress. I just hope things will get better. I am moving out of this place and will no longer have a crazy rent to deal with, but because of it I have no money to move out into a new place and will be homeless for a while. I just want things to be better now, but Rome wasn't built in a day right? \n\nThanks for reading, just wanted to get this off my chest.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/57v0k0/starting_a_new_job_decided_to_finally_take_hold/", "title": "Starting a new job, decided to finally take hold of my life. I feel great, but lost.", "social_network": "reddit", "user": "yeoldecotton_swab", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1476670311, "permalink": "/r/DecidingToBeBetter/comments/57v0k0/starting_a_new_job_decided_to_finally_take_hold/", "nsfw": false, "first_save": 1635436562.0187998, "replies_charged": false}