{"id": "t5_2tand_t3_fx4ho2", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "[Link to Day Two](https://www.reddit.com/r/DecidingToBeBetter/comments/fwj75g/game_plan_day_two_yo_slow_down_rome_wasnt_built/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) \n\n**Profile**:\n\n- 28 year old married man with 1 year old son. \n- Has severe depression and diagnosed with Borderline Personality Disorder (deep fear of abandonment, struggles to see thing in grey, has intense emotions, impulsive, can be manipulative, is very self centred). \n- Has multiple addictions (gambling and porn primarily). \n- Has not been attending meetings or utilising resources to get better. \n- Has serious ‘self pitying/ self hatred’ complex. \n- Self harms and has had attempts on his own life previously. \n- Is his own worst enemy. \n- Lack of resilience. \n- Has been ‘coasting by’ for too long- has finally hit boiling point and things need to change. \n\n**Subject positive qualities**:\n\n- Deep down desperately wants everything to be better. \n- Has sporadic moments of going above and beyond to show love. \n- Wants son to grow up in a healthy and happy family home. \n- Extremely self aware. \n- Has undergone therapy in the past and has Compassion Focused Therapy resources available that will be more than helpful throughout this difficult time. \n- Has an ingrained faith based system which has provided helpful coping techniques in the past. \n- Has a supportive and loving family who want him to get better. \n\n*Goals of plan*:\n\n- By getting LONG TERM HELP with severe mental health problems. \n- Returning to faith (as it can provide sustainably helpful coping techniques and for finding spiritual purpose). \n- Attend Gamblers Anonymous meetings at least three times a week.  \n- Learning to truly love and respect wife, at this difficult time for her, and for the rest of life.  \n- Being able to forgive self and not remain chained to the past. \n- By having a healthy routine EVERY DAY, taking each challenge one at a time. \n- Having a deep trust in Higher Power. \n- Being a role model for son; showing him true strength of character and what it means to ‘pick yourself up, dust yourself off, and keep fighting the good fight’. \n- Being healthy body, mind and spirit. \n- Creating a safe and loving home where problems are addressed with maturity and a true desire to grow and learn. \n- By acceptance that, while subject can do everything he can to get better, it’s not about him anymore. It’s about the people his actions affect. \n\n**Current situation (incl. summary of previous day) 8/4/20**: \n\n- Wife is rightfully taking the time necessary to be away from me.\n- I woke up later than I intended and found myself feeling lazier than would be ideal. I found the usual self pity creeping back up, but was quick to practice my mantra and get the day started. \n- I started my (late) morning with my higher power and brought gratitude into my mind.  \n- I got to work and truly got my head down. I was listening to an audiobook but found myself getting distracted so I put it on pause and tried focusing fully on my work. \n- I had a moment of self-pity missing my son, but I had to remind myself ‘we don’t self pity anymore! We are now fighting for our life’. \n- During a break I started writing in my bullet journal again. I haven’t used it since February and... well... a lot has happened since then. I wrote a quick update and then wrote out a plan. I know I might be doing a bit too much in terms of ‘writing things down’ but this really is the turning point and I’d rather spend my time consolidating my thoughts and having clarity rather than letting my mind wonder back into the old ways of thinking.  \n- When my working day ended at 5PM I went for a jog along the beach (I’m very fortunate to live right beside a beach!) and took some pictures and listened to The Weeknds new album- the lyrics in ‘scared to live’ really felt relevant. \n- I had dinner with my dad (he’s currently staying with me, which is really good- he’s such a good man) and we watched ‘How to train your dragon’.  \n- In the evening I attended my first gamblers anonymous meeting (since last summer). It was held over the phone like a conference call. It was really good! They welcomed me back with open arms. I received much encouragement to retain the feeling of determination and ‘keep coming back’. I listened to other people sharing, but I can’t disclose that cos y’know.... anonymous n all that. \n- I called and spoke with two people I previously attended different anonymous meetings with in the past. Shared that I was no longer running from the pain. They were glad to have be back and fighting for a better life. We discussed the fact that I am doing this for the rest of my life, not just to win my wife back. \n- I spent time with my higher power praying a rosary (this is like a prayer that takes about 15/20 minutes). I also began the prayer with giving gratitude. \n- Signed up for a Skype call with a practical psychologist on adopting new habits (I wanna learnt to get up early EVERY DAY and make plans for my day)\n- At about 10.30PM I played the PlayStation for a little bit... but I genuinely want to limit the time I spend playing it from now on... so after about an hour I switched it off. \n- I wrote out 10 things I’m grateful for.\n\n**Plan for today 8/4/20**\n\n- Wake up earlier\n- Start day with higher power - entrust everything to Him (‘Do your best and let God do the rest’)\n- Submit this post after prayer. \n- Make bed. \n- Work with focus and dedication, taking periodic breaks - stretch legs and keep environment tidy.  \n- Book in for another anonymous meeting this evening. \n- Go for a walk. \n- Drink plenty of water. \n- Fight self pity by practicing mantra. \n- Write letter to wife (no intention to give this to her yet, but only if she decides to make contact what I want to reassure her about) for the purpose of consolidating my intentions to get better and acceptance and respect of her decision to take space from me, and include a flexible approach to the situation allowing it to be entirely in her terms. \n- Pray the rosary. \n- Write gratitude list. \n- Do something you enjoy- but limit the time you spend doing this. \n- Bed by midnight. \n\n*Note from subject 8/4/20*\n\nTHIS IS A LONG ONE Y’ALL. \n\nContinuing the ‘just for today’ mentality I want to study a day I had last week vs. the day my heart is desiring today. This isn’t to pretend I am magically a changed man, it’s to detail how sick I am and the fact I am embracing reality no matter how difficult that might be. For the sake of context this account was a day of the week that both me and my wife were off work:\n\n8am - Sleeping. Hear my 1 year old son waking up. Leave my wife to get out of bed and take care of him. Not even thinking about how selfish I am being. Wife brings my son into the bedroom to see his lazy dad. Son is happy to see dad; dad is happy but still doesn’t care to ‘seize the day’ and get out of bed. \n9am - I go back to sleep; sort of awake but not wanting to face the day. No plans for the next 24 hours. No gratitude. Feeling that strong sense of self-pity, feeling ‘crappy’ about myself. Not wanting to ‘deal with myself’. Mind takes the route of ‘poor me, I’m so stuck in all my problems I have no power to change anything I’d rather just sleep the day away blah blah blah’\n10am - Remains asleep. Vaguely wakes up to hear wife taking care of our son, knowing that I could go downstairs and help. Doesn’t. \n11am - Waking up. Still in bed. Look at my phone and immediately start browsing social media. Waiting for my wife to put my son down for his afternoon nap (usually about 11.30AM) before leaving bed. While it’s nice to see him, I feel intense guilt when I’m with him because I keep telling myself ‘I’m an inadequate dad’ but ironically at the same time I’m not doing anything about this. I am always running from anything uncomfortable or painful. \nNoon - Go downstairs. Eat crappy food for ‘breakfast’. Take my antidepressants and feed the internal dialogue ‘I’m so broken’. Wife is taking a well-deserved break enjoying the PlayStation. I watch her playing for a short while, then ask for the PlayStation. Wife is rightfully annoyed. I have the audacity to see myself wronged for not getting what I want exactly when I want it. I have no care for actually doing anything meaningful with my day. \n1PM - Argument ensues between me and my wife. Lack of mutual respect in the marriage (which has been chipped away because of primarily me) causes us to say very harsh things to each other. No reasonableness. We’re both miserable. Wife walks away from my selfish self. I don’t ponder on negative emotions and play the PlayStation to numb the emotions. \n2PM - I don’t want this negative hostility; but at the same time I don’t want to *really* start addressing my problems because just reducing the pain is easier. I am being dictated by laziness and self pity. I go see my wife and initiate a hollow apology with a hug, mostly just to ‘feel’ like I’ve fixed the problem. Wife reciprocates hug and we find something silly to laugh about. Son wakes up and we take him down for his lunch. Doing the bare minimum I give him his lunch. I feel immense guilt when I look into the eyes of this wonderful little human and knowing the unavoidable fact that I’m not doing the best by him. Instead of sitting with this pain I just try my best not to think about it.  \n3PM - I take my son a walk in his buggy. I pretend to myself that I’m ‘pulling my weight’ in helping with the baby and ‘supporting’ by giving my wife this space. I know this isn’t true. I am with my son but I’m listening to music while pushing his buggy. My mind is elsewhere. I take him out the pram once, maybe take a picture with him.... again feel the guilt that I know I’m not really trying my best. I turn up my music louder. I stop by the shops to get groceries. I call my wife numerous times, choosing to get annoyed by the slight impatience in her voice. Im not really giving her any space... she transfers me the money for the food, but I use some of the money to buy a scratch card. This is insanely bad. I’m still gambling and I’m lying about this fact. I feel immense guilt, but I choose not to take any accountability. I tell myself I can keep getting away with it. I know I can’t, but I’ve become so use to lying can even fool myself. \n4PM - I return home. If I was to be honest with myself I have the mentality ‘I can put my feet up now’ but it’d probably read something like ‘I feel so tired I want to feel comfortable’ and hand my son over to my wife without thinking about it too much. I say I’m going to the toilet upstairs. I’m doing this to avoid the responsibilities of family life. I am spending my time with meaningless distractions. I hate myself knowing this. But rather than using these moments to wake me up, I just keep running from this pain with more distractions. \n5PM - I eventually bring myself downstairs to ‘help’/ ‘to avoid a massive argument’. I find myself automatically bickering with my wife. I am so quick to get annoyed because I’m always feeling wronged. I’m projecting the pain I’m feeling inside into my home. I am barely present with my son. Me or my wife feed him his dinner, I am taking tabs ‘if I feed him then you have to bathe him’. I have so little selflessness within me. \n6PM - I make dinner while my wife puts our son to bed. I kiss him goodnight, I love him but damn do I feel immense guilt knowing I am not doing my best. I enjoy making dinner, finding it therapeutic. I serve it for both me and my wife. We watch something stupid. We maybe chat about stuff. The conversation will either be general which avoids conflict because we’re not really invested in the topic. If the conversation becomes a personal topic it might be pleasant- but I am also liable to ‘get offended’. I’m exhausting. \n7PM-Midnight - I maybe make my wife a cup of tea but I am quick to turn on the PlayStation. My wife goes upstairs and knits or plays her PlayStation in the bedroom. We maybe play an online multiplayer game together, but our interactions are vague. I eat so much junk food at this time and will have no consciousness of the time playing the PlayStation. I just want to ‘feel good’. Every time I experience the usual guilt or I get a glimpse of myself in the reflection of the tv I just try not to think about it. \nMidnight - my wife may or may not have gone to sleep, I haven’t checked in to say goodnight. I’m still playing the PlayStation and know I’ll be doing so for a few more hours. Even if I have work in the morning I’d usually just keep playing until about 1AM. When I decide to go to bed I am met with the impulse to look at porn, which I’ll do even if I’m tired. I’ll then crawl up the stairs. I feel miserable. I hate this life dictated by impulse, but I’m not doing anything to fix it. Every time I run to impulse it’s to stop feeling the misery that is my life that I’ve made because of my impulses. I get into bed and I feel empty. I know that I’m wasting my life away, but I barely linger on the fact anymore because it’s so easy to find something to temporarily make me ‘feel better’. I know that tomorrow I’ll feel the same, but I’ll have those moments where I give into my impulses and they’re literally all I’m living for. I am not even thinking about all the people my behaviour is making miserable. When I begin to it’s too much, self pity always takes the reigns and tells me ‘feeling better is all that matters, regardless of who has to pay for it’. I lie in bed browsing meaningless content on my phone until I am literally exhausted because I cannot be left with my thoughts. I eventually crash. \n\n**********No. Bloody. Wonder. my wife isn’t tolerating this anymore***********\n\nSO TODAYYY- where I am RIDDING myself of self-pity and laziness - without planning every detail (because yeah... that’s not sustainable behaviour) I have a few ideas what I can do throughout the day. I should reiterate - because my wife and son aren’t with me right now that this isn’t a ‘parallel’ exercise. I need to work with my situation no matter what my day contains, as you can see from my ‘plan for today 8/4/20’ it is different from last week, but what is important is how I persevere to make this a good day:\n\n- Force myself out of bed early and not sleep in. \n- Start my day on my knees praying- give thanks to my higher power for this new day. \n- Have a healthy breakfast. \n- Start work ON TIME (it’s easy to get to my desk late while working from home and get away with it). \n- Avoid distractions when working. \n- Set attainable goals for achieving the work in front of me. \n- Spend time meditating. \n- Every time I feel self pity creeping back in do a power stance and state ‘I reject self pity; I am now choosing to fight for my life’. \n- Keep noting down my gratitudes throughout the day. \n- Even if it’s only once that I manage this today- EMBRACE the PAIN of a HUMDRUM activity. I am no longer seeking the thrill of impulsivity. \n- If I’m tempted in anyway to feed my most dangerous impulses to CALL A FELLOWSHIP MEMBER (this is like a secret weapon within addiction recovery groups by the way- it’s like you’re met with superpowers when you make the step of reaching out for help)\n- Always be prepared for the unexpected. I don’t know everything that’ll happen during my day or if I’ll experience a bout of very difficult emotions - approach everything with trust in your higher power and if you feel the impulse to do something, you’re probably meant to do the opposite. \n\nNone of this new way of being is brain science. It’s just living without running from the pain, and fighting the thinking that has kept me a prisoner to misery for far too long. As the old saying goes ‘I was sick and tired of being sick and tired’.\n\nTL;DR - I have accumulated seriously bad habits of laziness and selfishness and they have been ingrained in me because of constant self pity. I am now choosing to reject self pity and fight for a better life. One day at a time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fx4ho2/game_plan_day_three_the_vicious_cycle_of_running/", "title": "GAME PLAN - Day Three. ‘The vicious cycle of running to impulses to escape the miserable life I have made from running to impulses. AKA - the life of an addict’", "social_network": "reddit", "user": "iamgettingbetter_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1586343603, "permalink": "/r/DecidingToBeBetter/comments/fx4ho2/game_plan_day_three_the_vicious_cycle_of_running/", "nsfw": false, "first_save": 1635437691.410735, "replies_charged": false}