{"id": "t5_2tand_t3_hyp7ze", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "I am currently able to dedicate more time towards self-improvement and in that sense I am looking for resources to help do so.\n\nThis is a fairly general question and can be answered in that way. Anything that can help me become 'better'. A day in which nothing is learned is a day wasted, as they say!\n\nWith resources I mean things like, but not limited to, books, courses, practices, habits, exercises, lifestyle changes, and so on.\nExamples could be the book \"Atomic Habits\", the Berkeley course \"The Science of Happiness\" on EDX, a mindfulness practice, a posture-improving exercise and so on.\n\nWith self-improvement, I mean things like, but not limited to, knowledge, skills, well-being, social aptitude, and so on.\nExamples could be cultural knowledge, learning a language, learning to program in Python or Kubernetes, beneficial projects to embark on, and so on.\n\nI'm hoping to hear about things you'd recommend that have proven useful for you and added value to your life.\nFeel free to point me towards any online resources, either broadly or specifically, or what felt helped a lot in learning or was interesting.\n\nTwo personal examples are that I took an online course on Docker and applied that to help improve my home domotics. Another is a mindfulness book that allowed me to develop a practice which improves my mental well-being a bit.\n\nLooking forward to what you can propose!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hyp7ze/question_resources_books_courses_practices_that/", "title": "[Question] Resources (books, courses, practices) that improved your knowledge, skills, or life", "social_network": "reddit", "user": "Kalenden", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1595842731, "permalink": "/r/DecidingToBeBetter/comments/hyp7ze/question_resources_books_courses_practices_that/", "nsfw": false, "first_save": 1635435491.5188894, "replies_charged": false}