{"id": "t5_2tand_t3_e4s0fs", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Long story short, I’m 27 and I’m only now FULLY realizing how incredibly privileged and fortunate i was growing up. And am still. \nWas involved in extracurriculars about enough to count on one hand my whole life, mom  gave me what i wanted, would pick up after me, fix all my mistakes, would get mad yell would be very frustrated, but ultimately i did nothing about it. I was an only child with no extended family around us in our province. I was also made fun/ bullied during school going to school with the same assholes from elementary - high school and had (and still have) low self esteem. My dad was the same way, and maybe i picked that up after him. She would yell at us, she threatened to leave a couple times, but never did. Her and my dad had full on screaming matches all the time in front of me swearing and threatening, nothing super violent, but just really loud and screaming. I would sometimes join in if i wanted them to just be quite. Sometimes i would fall asleep to hearing them arguing and screaming at each other. It was weird. I was given a lot of stuff, a lot of support, but somehow felt like i lacked emotional bonding with them. As i grew up, i felt VERY coddled, and sheltered but unsupported in being an individual.  I spent a lot of time on the computer as a teenager, because i didn’t know what else to do i guess. I watched a lot of tv too. I got a phone at a really early age so my mom could pick me up, even though she was always super late and sometimes i would wait for an hour. I got laptops, i got clothes, new shoes. I got a lot. I moved away with my mom because she got a better job, which i now realize was kind of fucked up as my parents are still married. I dont know why they never got a divorce. It would have made much more sense. I missed my dad a lot. I moved in grade 10 and finished high school in a new province  and it was weird, i had no more activities, no friends, and i just ate all the time and went to school and my mom got home at like 10pm every night/ she’s a work-aholic. I didnt do much but watch more tv, play ukulele, and go on the internet. I made some great friends, but i always felt sorry for myself, as i felt pretty weird and i felt like i didnt really fit.\n\nThey paid for my university, put away for it when i was born,  and i did ok, but i didn’t really take it seriously and as a result ended up with a shitty GPA (2.4)  I fucked it up. They paid for my living expenses and everything. I had moved away, but was still not indépendant.  After that i moved again, after working and making my own money. It made me feel good being indépendant, using my own money, providing for myself. \n\nI moved again, and started to feel extremely depressed. I moved again and totally was indépendant for a while, but still didnt realize why i was so depressed. Fast forward to this past year, ive broken up with like 3 people, they all told me that i expected too much of them, and i always felt like i was ungrateful. I knew all these guys were great on paper,  but i couldn’t say it was enough. Now I’ve moved again, and I’m at school for something I’m not sure i should be at, and feeling horrible about realizing my white privileged, able bodied, first world, - oh i forgot to mention that i have a huge inheritance ~600k from my grandmother and i feel like shit about it because of everything else i have never appreciated. I’m trying to work though all of this, but the guilt is incredibly incredibly hard, it all came crashing down on me. \n\nI’m really trying to fix all my symptoms now ie. depression, anxiety skin picking, low self esteem, codependency, manipulating, ungratefulness, but its hard but i think its good that its hard. And I’m going to get help next week, but i feel like a user and am trying to distance myself from people as i feel I’m destructive to myself and others too. \n\nLooking for others who have felt the same way, or i don’t know. I’m trying, but its making me feel like the worst person in the entire world.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/e4s0fs/27_spoiled_rotten_adult_trying_to_turn_it_around/", "title": "27 spoiled rotten adult trying to turn it around and its the hardest thing ive ever done", "social_network": "reddit", "user": "nooooooofun", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1575252983, "permalink": "/r/DecidingToBeBetter/comments/e4s0fs/27_spoiled_rotten_adult_trying_to_turn_it_around/", "nsfw": false, "first_save": 1635437859.0363314, "replies_charged": false}