{"id": "t5_2tand_t3_q90pyc", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "When i was a kid, we were living with parents, dad was always home, drinking beer and playing games.\n Mom was always in her work, away from home, sometimes coming back for a short period of time.\n We were travelling a lot because they were running away from debts and stuff so i never had a friend because after a year we would move again. So all that was happening till i started grade 4th of elementary school.\n That time grandma took us in. First year it was all okay but after a year everything started to fall apart. We couldnt visit each others rooms, had to sit in ours and study/read books. We couldnt even visit our friends, we didnt have a phone and laptop was only 15 min/day to study.\n At the weekends we all drove to a small village where we had another house and we had to help with field work or help with renovation and all that stuff. Both grandma and our uncles or aunts would tell us we should be grateful because grandma took us in because our parents doesnt care about us and they doesnt want us. \n\nThey said it too many times.\n\n In the last year grandma got sick and i think it was a cancer, still they all blamed us and said its because of us she got sick. There was a time where talking with psychologists started because  they wanted to prepare us to go to child care house. \nThen my sister and grandma had a fight and she moved out. Then she visited our second grandma and they contacted mom. Sis told the story and mom tried to fight for rights to get us back. \nSo after all that we could live with mom again and another hell started. \n\nHer partner first liked us but when some problems came out he got annoyed and bored.\n So he started yelling abusing his strength, he also smoked and drank a lot of alcohol. \nThen there was a situation when he was drinking 3 days straight and i didnt wanted to wash the dishes so all yelling started again, he throwed the table upside down, broke some plates and when he saw me his rage increased and he wanted to choke me. He had his hands  around my throat and tried to kill me. Then Police arrived but did nothing cuz mom said she will take care of things here and they left. \nThen we had a lot of dramas and he was yelling and insulting us for next 3 years. \nWhen i hit 18 i moved away, and was living with my older sister for a short period of time, but because i got rejected at every job i tried to apply and couldnt support myself i came back home. \n\nThen after a year at my younger sister 18th birthday i moved out with her and started a job in mcdonalds. They only let me work there because i abandoned school, otherwise i wouldnt find a job again. \nI was trying hard to work good, and live as an responsible adult, trying to pretend im not depressed after all that happened.\n But then rona started and i lost my job and had to go back to moms house. \nBecause of that i had to go with her partner to Sweden to work, but fortunately it was all canceled. Then he started to do renovation in our house so i went to netherlands for work to avoid working with him. \nBut in Netherlands it wasnt that good, everyone was drunk and high and after 5 weeks i came back to Poland with a deeper depression.\n Because i came back i had to go to Sweden with him but first he had to finish his job in Poland and i had to help him.\n So working with him just got my depression go deeper each day and i refused to go with him there. \nThen he also didnt go there because he cant alone and he started another job here and was yelling why am i not working and stuff. Insults didnt end, depression got deeper and here i am now.\n Mom keeping the pressure and defending him for everything he did. Calling police didnt work even once, they just said they cant do anything (even when he was drunk af everytime and they got called 20+ times during a year). \nWhen we had a conversation with mom about all of us having depression she was surprised and she said \"Why do you all have depression, you didnt go through anything hard yet\". \n\nAnd it all continues but i want to end it and try life again. To do that i have to move out from this house to mentally recover and start a job. \n\nBecause i have no money yet i cant rent any flat or airbnb so my friend suggested to create a gofundme.\n Unfortunately its not supported in Poland, but she was very kind and she created an account to help me out with this. \nIf you want to help me starting a new life, any help is appreciated. \n\nLink to GoFundMe in my profile.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q90pyc/help_me_start_a_new_life/", "title": "Help me start a new life", "social_network": "reddit", "user": "Overall_Culture1257", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1634342714, "permalink": "/r/DecidingToBeBetter/comments/q90pyc/help_me_start_a_new_life/", "nsfw": false, "first_save": 1635436614.7492895, "replies_charged": false}