{"id": "t5_2tand_t3_pfaaa1", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "I have no idea what I’m going for with this post, but here goes something. \n\nAs the title says, I’m a self diagnosed narcissist. I’ve made a lot of progress since I discovered it, but the days I fall back I feel like giving up on trying to do better. \n\nSomething that I’ve done a lot is having the mindset/actions of “everyone else is wrong, and I didn’t do anything.” I’ve been working on that a lot, but then I always come to the question of-what if this situation isn’t me? Should I take the blame anyway, or try to fix it even if it might not be me? Should I overcompensate for the times that I blamed others when it was my fault and I caused a situation? \nI suppose im stuck in the question of validation and acceptance of the given situation. \n\nAnother thing is I want to be open about it. I want to tell everyone that I am so they know what they’re getting into with me, but I know that’s an off putter with others. I already don’t have too many friends, and the ones I do have I cause some kind of drama with at some point. Wether they do something to upset me, or I have a few days or a week where I go completely backwards and I’m a total narcissist. I don’t know what the “right” thing to do is, so I keep it to myself and make references so at least they’re somewhat aware. Is that a good thing to do? Is that normal? Will that do more harm than good?\n\nI want to be my best self. I understand why I’m this way, I understand where I lack, and I understand it’s going to take time to fully improve and be a normal, healthy person. I’m just so lost in conflict and pain from situations. Any advice from others like this, or have dealt with it would honestly be amazing. It’s such a taboo subject that I feel like I can’t talk about it or I’m going to upset others with it. Thank you in advance for any comments back.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pfaaa1/im_a_self_diagnosed_narcissist_and_i_want_to_be/", "title": "I’m a self diagnosed narcissist and I want to be better", "social_network": "reddit", "user": "Staygoldenponyboii", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1630430079, "permalink": "/r/DecidingToBeBetter/comments/pfaaa1/im_a_self_diagnosed_narcissist_and_i_want_to_be/", "nsfw": false, "first_save": 1635435082.0986805, "replies_charged": false}