{"id": "t5_2tand_t3_hdanhf", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "When I first arrived in this country, originally from the US but relocated to Eastern Europe 6 years ago, I was 300lbs, the largest I have ever been in my life.\n\nMy partner and I have come a long way in so many ways over these years, we both have had a lot to deal with. Over the first 3 years I dropped some weight from all of the walking and physical work I was doing, it hovered at around 280/290lbs. I tried going to the gym and working out but my weight wouldn't budge, luckily it didn't budge much when I binged either.\n\nIt wasn't until I healed more and finally got effective treatment for my depression over a year and half ago that the weight started to come off. Within the first month of being on this new treatment, tDCS, I lost 20lbs without doing anything extra or watching what I ate.\n\nI am down to 200lbs now and lately I've been struggling with fatigue and stress again but starting to come back out of it again.\n\nI grew up obese and everyone around me was also obese.  In highschool, when I taught myself weightloss, nutrition, and fitness it was liberating. Seeing the weight come off and being able to keep it off for some years was incredibly empowering.\n\nI got down to 165lbs by playing DDr for an hour a day. Back then I was desperate to get the attention of my highschool crush and I was very socially inept. But also I loved fitness, half of the experience was me trying to earn external approval from that crush and from my parents and relatives, and the other half of the experience was me discovering and embracing my personal values.\n\nIt made me feel powerful enough to beat all of the odds, to dream big and go for it, and for a while there I did until I had my breakdown and psychiatric medication, specifically Abilify, made me regain all of that weight in a matter of months and then some.\n\nI suspect that I had to resolve some psychological issues in order for the weight to come off the 2nd time. I am aiming for 165lbs, but right now when I see myself in the mirror now I feel more beautiful and desirable than I ever had in my life. I am no longer trying to prove that I am worthy of someone else's time, my worth as an individual is self-evident, it speaks for itself.\n\nI never thought I could feel this way about myself, and I am so happy I found this within me. It feels powerful and I've felt too weak and wounded for too many years. I want to leave this hurt behind completely and create amazing and priceless experiences and memories in this lifetime with amazing and worthwhile people.\n\n**Edit June 22nd:** I wrote this last night to give myself a pat on the back, then I woke up today and saw that this had over 600 upvotes. This was completely unexpected, I even received my first silver award for it. \n\nI've basically been a hermit for the last 6 years, I'm in a country where I still can't speak the language and I help out my disabled partner and he helps me. I don't really have in person close relationships with anyone other than my partner. \n\nSeeing that my story touched over 600 people in 24 hours broke my brain a little. Thank you all for taking the time to read it. I am still trying to process this, but it is really fulfilling and uplifting to see that others resonate with my experiences.     ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hdanhf/i_used_to_be_300lbs_now_i_am_down_to_roughly/", "title": "I used to be 300lbs, now I am down to roughly 200lbs.", "social_network": "reddit", "user": "Reisno", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 652, "down_vote": 0, "creation": 1592760036, "permalink": "/r/DecidingToBeBetter/comments/hdanhf/i_used_to_be_300lbs_now_i_am_down_to_roughly/", "nsfw": false, "first_save": 1635437560.6746073, "replies_charged": false}