{"id": "t5_2tand_t3_54bo84", "request": ["311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "\"Healing from your childhood memories\"\nWhat are you trying to protect? You rejected the path your family wanted you to take, now you may be feeling a little stuck. I understand this does suck,been there, frustration will come or already has, this is a sign for you to move forward, but be cautious and avoid back sliding. Some memories are very painful, turn and leave those in the past, you will not forget but you can forgive. The love you should of been given, you can give yourself now, with this acknowledgement you can leave the emotions in the past. Take that step and don't allow this pattern to continue, know that you will survive this. It's a good time to find and own your personal  power. Yes, you need to leave your comfort zone to break this cycle of self abuse. Don't be to hard on yourself, this takes time, your blending your old self with the new. Don't get too caught up in the emotions, you don't want to repeat patterns. If you can avoid being overly emotional then you are headed the right way. Know that prosperity is on its way, a new beginning for you, a new you! \n\nHow do you stop being overly emotional?\n\n- let them go, don't hold on to them.\n\n- reconnect with your higher self/Universe/Divine/God. \n\nHow? By being yourself first, looking deep within and not casting judgment upon yourself (in a nut shell) \n\nForever and always love and peace upon your path, may the light lead your way.\n\nmakinglifeallbetter.wordpress.com\n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/54bo84/discovering_things_from_your_subconscious/", "title": "Discovering Things from Your Subconscious", "social_network": "reddit", "user": "MakingLifeAllBetter", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1474745748, "permalink": "/r/DecidingToBeBetter/comments/54bo84/discovering_things_from_your_subconscious/", "nsfw": false, "first_save": 1635437893.2462347, "replies_charged": false}