{"id": "t5_2tand_t3_9nelwd", "request": ["311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "Have you ever felt like you're extremely busy...waiting for something to happen to you? You don’t know if you’re waiting for something good to happen, or something bad to happen...you’re just busy. Waiting. \n\nSomething great could definitely happen. You’re hopeful. You could get a pay raise at work. That would be exciting! Your pulse quickens. Another prosperous thought rushes in. It’s almost the weekend! This week could go by more quickly than normal! It’s almost the middle of the week, already. You smile. The soft comfort of the weekend reaches for you, a warm embrace away.\n\nYou begin to think that something amazing will burst onto the scene of your life, like the golden ticket to Willy Wonka’s Chocolate Factory. You imagine yourself breaking onto the set of your biggest goals. They can be conquered in one fell swoop! You feel a jolt of triumph. \n\nIt stops after a microsecond. You went too far with the musing. \n\nReality sets in, gravity taking hold of your silly aspirations and shooting them hurriedly towards the unforgiving ground of real life. You hit the ground, bouncing back to the real version of yourself, and your dreams... those dusty, shelved volumes of ideas you have left in the perpetual pause library, waiting to be completed. \n\nYou hate yourself for that lack of discipline you have to finish them. You grow saddened as you think about how incomprehensibly far behind your goals you are. You choke in the dust of the days and months gone by, so behind that you can no longer picture the finish line. Each volume is just one race of the many you have started, signed up for, and had hoped to enter. You examine some that are nearby, reaching out to grab them from the shelf. Touching them, a flood of your once-fanciful intentions shoots through you. You slam them shut, dropping them. They’re foolish ideas, anyway. You cry out as they thud to the floor, and you’re quickly reminded of why they should be avoided. Ouch! Their spines are razor-sharp. You drop your hands, discouraged from opening the fairy-tales you’ve created, and peering into the incomplete reality of your fanciful whims. You don’t know why you came up with them in the first place.\n\nWhite-hot, 100% Isopropyl alcohol doubt seeps in, stinging the now-exposed cuts of failure. You remember the pain of other cuts from long ago. Childhood ambitions of not getting hurt while riding your bicycle, soon regretted when the pain of a skinned knee came knocking. The scratches and cuts garnered from running too fast, not looking where you were going...the awful pain of that one bee sting...you knew better than to play with those bees! You remember, now-. Staying where you are supposed to be is the path towards not getting hurt! By falling. Failing. You *hate* that feeling. It’s unsafe here. You need to leave this storeroom of ambitions. Now.\n\nYou retreat from your dusty library of haunted and forgotten dream-novels, and head towards the all-familiar stairway of impending doom. You feel the darkness of the fear at the bottom, waiting to swallow you. \n\nYou don’t want to go down the cold, foreboding stairs, but you race down them anyway, two at a time. Momentum picks up, and your body is no longer yours. Your brain is switched to auto-defeat pilot, and you’re along for the ride. Again. \n\nBack to the bottom. \n\nYou don't want a dark event to occur, but you feel it stretching in your direction…..reaching. It grabs your future with one distended limb, the other scrabbling to get ahold of you. Realization of the impossibility whimsical fancies grow stronger. \n\nWait.\n\nYou recognize these powerful, unforgiving arms. You’ve felt the foreboding feeling of them before. You remember this event of remembering...again. Too late. You hate this feeling, but it’s kind of familiar. You stop struggling.\n\nSometimes you get this feeling before you go to sleep at night, so you decide to stay up just a bit longer. You pitter around the house with nothing to do. Soon you become busy watching another youtube video. Emails must be checked. You grab your phone again. Someone must have texted you back by *now.* You’re thankful for the distraction if they have. You happily respond. You watch another one, and then two episodes of your favorite show. It gives you something to do. But even as your eyes attach to the screen, unseen thoughts are racing through your head at two times the speed of light.\n\nYou know you could be doing something much more constructive with your time. You could be working to make sure that the real or imagined impending doom is avoided. Maybe it's that homework you need to complete. Perhaps it’s the unfinished work project that you started but never finished. It looms at you from the other side of tomorrow. Waiting menacingly. \n\nYou are rational enough to realize that you could attack these thoughts and back them into a corner. It’s just not the right solution, right..now. Avoidance is. It makes sense to you. Or so you tell yourself, as you stuff down the other voice that tells you better. It eventually silences itself to the din in your mind.\n\nIt fights, resurfaces. It speaks to your heart. You *could* be cleaning your home, so that you don't wake up tomorrow to the same mess that's been successfully avoided another night. You *could* make more time for yourself to exercise. You know you *could* be writing that book that is inside of you. You want a new job, a new career. You *could* be researching alternative options. There’s too much involved. The answer is easy, now, and within reach. You grab it with lightning speed. You simply *don’t*.\n\nInstead, you crank up the volume a little louder, hoping that a funny or suspenseful scene hurries along. You scroll through your phone, rereading old messages if no one has responded. So you can better ignore the back end of your brain’s chatter. It’s whispers. It's sincere disappointment, and true desire to *change* your behavior. If you would only reach for it. \n\nNo, you say. Not tonight. But maybe tomorrow. You strike another deal with yourself. The signature is a collection of all of the previous hundreds you have made over the days, weeks, and months. YEARS. They litter the graveyard of broken promises to yourself.\n\nYour brain makes a final leap to safety, away from the chatter about the challenges of the fake successful life. It’s postponed until tomorrow, when the real change begins. You’re excited. You’ve managed to calm yourself. \n\nThe back and forth in your head pipes down, and you pay attention to your show. You stay up a tad bit too late, and click off your TV as the credits scroll. You tuck down the screen on your laptop. Set your alarm and check your phone once more. Just in *case.* You brush your teeth and hurriedly prepare for bed. Tomorrow, you promise yourself- you’ll even go to sleep earlier. The promise graveyard possesses another victim. You fall asleep asleep praying you get enough time down.\n\nBefore that pesky, always uninvited alarm rings you annoyingly into another day. Another day of trying to avoid the things you know you *should* and could be doing. It comes too fast, and you silence the alarm...and finally get up. Today is the day of change you promised yourself. Ugh. You feel out of sorts and ridden with challenges before you struggle out of bed. You stand. Stretch. Yawn. Oh boy.\n\nPerhaps you’ve made an error about today….\n\nMaybe *tomorrow?*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9nelwd/waiting_for_better_or_for_worse/", "title": "Waiting: For Better or for Worse", "social_network": "reddit", "user": "strwberyiscreem", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1539296788, "permalink": "/r/DecidingToBeBetter/comments/9nelwd/waiting_for_better_or_for_worse/", "nsfw": false, "first_save": 1635437891.106356, "replies_charged": false}