{"id": "t5_2tand_t3_ocq87n", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "My subs ask me at times--how to I change? My answer is the largest barrier that stands in front of you---yourself. Before you can have a strategy, a massive plan of action as Tony Robbins says. before you can even begin to advance forward, you have to have the vision of what you will be. Because if you don't really believe your vision--then you won't follow through--not really. My example was when I envisioned becoming a physical therapist. You need almost all \"A's\" in premed to do this and I was no rocket scientist. Not what they call \"book smart.\" I had to study physics about three times as long for the same A---no kidding. In all my science and math premed courses. But I never considered--not once that I wouldn't be accepted into PT school. Never. Yes I developed a plan of action. Strategy. But the vision was first. Non negotiable belief. I became a PT. \n\nSo now I have this new YT channel and books out etc etc. This is a hard business as well as many of you know. But the concept of vision is the same. And I have strategy and massive plan of action. And clear vision--to help people. To use what I know from patients and my own depressions in the past to help others forward. And I have no concept of failure. And it is starting to get views and the KDP has downloaded 11,000 pages. Sure I only get a half penny a page--not Stephen King but it is a start and more than three months ago. \n\nSo these are examples of vision. You can change. Anytime. The work will be waiting for you, true. But what stops most people is they don't really see themselves as something else. That IT guy that hates being an IT guy? (vs the one who loves it). He can't see himself as maybe an electrician. Or writer. So he gets in his own way by merely paying bills and saying \"I should\" instead of \"I will.\" The alcoholic? He can't imagine a vision where he never touches the substance again. (Been there too 13 years ago). The loner? Can't envision relationships--because he can't come up with that vision. So when you are looking to change--or advance yourself. Set your vision first. And believe it. And I'll send another topic soon on how to make sure your vision is correct. Hope this helps someone. -----Charles", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ocq87n/so_what_stops_most_of_us_from_improving/", "title": "So what stops most of us from improving?", "social_network": "reddit", "user": "CharlesHurstCanHelp", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1625283529, "permalink": "/r/DecidingToBeBetter/comments/ocq87n/so_what_stops_most_of_us_from_improving/", "nsfw": false, "first_save": 1635435103.9361742, "replies_charged": false}