{"id": "t5_2tand_t3_drm7n0", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "\n\n1\nDon’t expect life to be fair. It was biased and it will be.\n\n2\nRemember 80% of the success in any job is based on your ability to deal with people.\n\n3\nWave at the children on school bus.\n\n4\nCompliment the meal when you’re a guest in someone’s home.\n\n5\nCount your blessings.\n\n6\nMarry only for love.\n\n7\nBecome someone’s hero.\n\n8\nMake someone’s day by paying the toll for the person in the car behind you.\n\n9\nSend your loved ones flowers. Think of a reason later.\n\n10\nShow respect for everyone who works for their living, regardless how trivial their job.\n\n11\nKeep a notepad and pencil on your bed side table. Million dollar ideas sometimes strike at 3 A.M.\n\n12\nAnswer the phone with energy and enthusiasm in your voice.\n\n13\nSend a lot of valentine cards. Sign them. ‘Someone who thinks you are terrific’.\n\n14\nOnce in a while, take a scenic route.\n\n15\nBegin each day with some of your favorite music.\n\n16\nVisit friends and relatives when they are in hospital. You need only stay a few minutes.\n\n17\nTake charge for your attitude. Let no one choose it for you.\n\n18\nRemember no one makes it alone. Have a grateful heart and be quick to acknowledge those who helped you.\n\n19\nNever waste an opportunity to tell people you love them.\n\n20\nBe bold and courageous. When you look back on life, you will regret the things you didn’t do more than you did.\n\n21\nLive your life so that your epitaph could read. No regrets.\n\n22\nDon’t burn bridges. You will be surprised how many times you have to cross the same river again.\n\n23\nBeware of the person who has nothing to lose.\n\n24\nKeep it simple.\n\n25\nBe modest. A lot was accomplished before you were born.\n\n26\nWhen someone hugs you, let them be the first person to leave you.\n\n27\nHave a firm handshake.\n\n28\nLook people in the eye.\n\n29\nSing in the shower.\n\n30\nOwn a great stereo system.\n\n31\nIf in a fight, hit first and hit hard.\n\n32\nKeep secrets.\n\n33\nNever give up on anybody. Miracles happen every day.\n\n34\nAlways accept an outstretched hand.\n\n35\nBe brave. Even if you’re not, pretend to be. No one can tell the difference.\n\n36\nWhistle.\n\n37\nAvoid sarcastic remarks.\n\n38\nChoose your life’s mate carefully. From this one decision will come 90% of all your happiness and misery.\n\n39\nMake it a habit to do nice things for people who will never find out.\n\n40\nLend only those books you never care to see again.\n\n41\nNever deprive someone of hope. It might be all that they have.\n\n42\nWhen playing games with children, let them win.\n\n43\nGive people a second chance, but not a third.\n\n44\nBe romantic.\n\n45\nBecome the most positive and enthusiastic person you know.\n\n46\nLoosen up. Relax. Except for rare life-death matters, nothing is as important as it seems.\n\n47\nDon’t allow the phone to interrupt important moments. It’s there for our convenience, not the caller’s.\n\n48\nBe a good loser.\n\n49\nBe a good winner.\n\n50\nThink twice before burdening a friend with a secret.\n\nEDIT 4 REALS THIS TIME: i am 27 my.name is Ashley my fav Pokemon is Blastoise and I am 6 ft. Tall. Not 80 years old. Guess i could have made that more clear earlier.   i am very blessed to see that this has really made some people happy and thinkin all kinds of controversials. I mean, thats the point. Some old man in a book said these things probably because he made a few mistakes through trial and error and wants to help others. Furthermore, that being said, thats why I posted it. For those upset site the source. I found it on ifunny.com. it came with no url because the internet is a free for all. Its bound to happen that 1 out 4 people disagree for any reason for any topic. Its human nature.  i do not know where it came before that. I love those who know exactly where it came from already who sharing! Thats good.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/drm7n0/50_life_lessons_from_an_80_yr_old_man_for_some/", "title": "50 life lessons from an 80 yr old man. (For some reasons #14 stuck with me)", "social_network": "reddit", "user": "ashhtreeee", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2986, "down_vote": 0, "creation": 1572893815, "permalink": "/r/DecidingToBeBetter/comments/drm7n0/50_life_lessons_from_an_80_yr_old_man_for_some/", "nsfw": false, "first_save": 1635435581.1084678, "replies_charged": false}