{"id": "t5_2tand_t3_oa8hgx", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "I decided I am quitting gaming, I had a existential crisis today and after serious self reflection I identified that most of my problems stem from gaming.\n\nNow do not get me wrong, gaming has its benefits, it can be amazing at times but just like everything, without moderation too much of something is harmful. \n\nIn that sense I am like a addict who uses every singe free time I have to play videogames, a story I would like to share of my exams years back are literally of me bragging that I got promoted to the rank of \"Master guardian\" in CSGO instead of studying or even sleeping, in fact I remember that in that day I went to bed at 4 in the morning to go to the exam at 7, while everyone was studying and trying to get into their chosen college I instead played games and pretended the exams did not exist.\n\nNow I regret that, I passed my exam with admittedly decent grades but I keep thinking about how foolish I was, If I had studied better, If I interacted with others besides hardcore gamers in my class, If I did something other than play games. And once I finally woke up to this problem during my existential crisis I decided enough is enough, I quit. \n\nNo longer will I be a willing slave to games, no longer will I spend my life rotting behind a screen trying to get a high score, no longer will I waste my money on services like my own private servers or buy games that are boarder line scams. (Looking at you EA).\n\nI want to experience the world, I want to interact with people, go outside, go on hikes, do something productive other than sit like a vegetable like I did before.\n\nAnd again Id like to remind that inherently playing casually for like a hour is alright, its a hobby like any other but when it literally consumes your life then you have a problem", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oa8hgx/after_wasting_literally_all_my_life_playing_games/", "title": "After wasting literally all my life playing games, I am quitting gaming.", "social_network": "reddit", "user": "Blood_Raven1", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1766, "down_vote": 0, "creation": 1624973981, "permalink": "/r/DecidingToBeBetter/comments/oa8hgx/after_wasting_literally_all_my_life_playing_games/", "nsfw": false, "first_save": 1635436757.8122125, "replies_charged": false}