{"id": "t5_2tand_t3_p3pyca", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "18281d65-fa68-4991-a4a1-8f37346818f3", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "It's been a lonely, scary ride, the past couple of years  and it's getting even more lonely, but I guess less scary.\n\nRight now, I am a single parent of an amazing person. Her dad is in the picture, but he prefers living on the fun side, not working or having a suitable house for our daughter. I can't really change that, it is what it is, and I am happy he is in her life.\n\nI've been engaged to someone, which didn't result in a wedding. It resulted in my fiance's becoming depressed and dysfunctional, putting us through quite a few scary situations. He is now my ex, and for nearly a year already, I don't have to deal with his anger outbursts anymore or feeling like I am just there to look after him.\n\nI am lonely again though, which I don't like, but I nearly have the tranquility I longed for for such a long time.\n\nSoon, I'll be able to move into a social housing flat, and I'll be able to live again and do things with my daughter instead of living paycheck to paycheck. Now, I live in an expensive place I can't afford, so my mum helps me pay for it, and even with her help it's still too much. It's embarrassing to accept her help, as she already treats me like an incapable person, but it is what it is for now. I  am grateful for her help.\n\nMy sister actively dislikes me and doesn't talk to me - she has a different reason each time. My mum - I stopped talking to her, and I am hoping to get us into therapy, so we can have a relationship we both deserve. None of my family members are in touch with me. It is what it is for now.\n\nBut..I keep being positive. I exercise, I diet, I try to do fun things with my daughter even when we barely have any money. I have a job I like and I like my colleagues too. I even had a fwb for a months or so, until he told me he is not ready for commitment (which would have been fine, but I developed feelings for him). It was nice, but brief, and I am not even devastated this time - I am even almost ok with being properly single.\n\nOn the days like today, when the day seems so slow and when I feel down, I remind myself, that in a year from now, I won't have most problems I have now. Things are looking up. I might still feel lonely, but with my ability to pay the bills and live comfortably, I know it will hurt less. Even now, I am quite proud of how far I have come. Having had a neglected childhood, I learned how to parent, all on my own, and found the right resources where to ask for help. I learned to set boundaries and stand my ground, so my relationships aren't doomed to be all toxic anymore. Sure, most guys are not ready for a woman with a child, and I don't have time to look for those that are, I can't change that. However, if I do meet the person who won't leave one day, I know I'll be ready. And if I don't, I know I'll be ok too - the loneliness hasn't killed me so far, so what's the worst that can happen.\n\nThings are looking up already, and in a year from now, they will be even brighter.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p3pyca/one_year_from_now_i_wont_have_most_problems_i/", "title": "One year from now, I won't have most problems I have now", "social_network": "reddit", "user": "zombiesnail30", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 593, "down_vote": 0, "creation": 1628875901, "permalink": "/r/DecidingToBeBetter/comments/p3pyca/one_year_from_now_i_wont_have_most_problems_i/", "nsfw": false, "first_save": 1635435985.387042, "replies_charged": false}