{"id": "t5_2tand_t3_hmm8h4", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Some background to this seemingly lifelong achievement of mine that has come to ease this once long-term goal of mine to \"fix myself mentally\":\n\nWhen I was 13 as I had gone through a suicidal and depressive period of my life and saw a therapist. It really helped and I thought I made leaps but still wanted to see her. However, after a year, my parents suddenly stopped me and said I was \"fine now\".\n\n  \nI did pretty well for a while until shit hit the fan hard sometimes in life, as it usually does, and I noticed I tended to cry, be more sensitive, reactive, and still had panic attacks and anxiety attacks as I once did when I thought I \"still had depression\". I also tended to want to be this mentally perfect version of myself and could never seem satisfied or happy too long with my life and myself. In fact, since I was 9 I lost love for both my body and mind. As time went by I naturally built up confidence and love for my physical self but to this day I struggled with loving who I was mentally for a long time. \n\nDespite all this progress, however, I knew deep down I wanted to see and probably needed to see a professional for my mental health but my family's strong stigma around mental health and dismissive attitudes about the severity of my mental health issues made me think they weren't real or caused me to completely hide it from them and act like my mental issues really weren't \"*that\"* bad. \n\nMy mother tend(s/ed) to raise her voice at me and angrily ask, after failing to console me during the few times I confided in her during a depressive/anxious/panic attack episode, \"***Do you think there's something wrong with you?!****\".* My dad was not usually present for these incidents and even if he were there or if I'd confide in solely him, he'd softly brush off my issues and say that everyone goes through it and I'll be fine. Obviously though, they've gotten better (despite these behaviors and that quote having occurred today) and allowed me to see my N.P. and talk about my issues and about a therapy referral.\n\nAnyways, thanks to a lot of loss in my life and a recent relationship, I was able to re-open my eyes to the severity of my mental issues and as I finally reached an age where my parents would take me and my mental health issues seriously as a mature (baby) adult of 18, I finally got to tell a health professional about my problems. \n\nToday was the first time in 5 years I got to spill my guts, honestly and completely, about everything I think and know and want and need about my mental health to a healthcare professional, my N.P. actually! She was super sweet and understanding and had diagnosed me with possible mild to severe depression and anxiety and told me it seemed like I've had it since I was young. And although my mother's reaction to my diagnosis was to play it down, I feel this sense of clarity in me that yes, indeed, nothing is wrong with me. I just have anxiety and depression literally kicking my ass and forcing me to not function the best I know I can nor help myself enough.\n\nAlthough being diagnosed should've been earth-shattering, it was the biggest fucking breath of relief ever. I can just rest easier now knowing I don't have to depend on google nor question myself constantly on why the fuck I'm so incompetent compared to everyone else who has it harder but is coping better (and also why are they able to easier love themselves, function, and cope better and faster than me?).\n\n  \nIf you read this far, thanks for reading it all (or skipping to this line for the incoming TLDR!) and I hope you know that as grossly cliche yet true for most, life gets easier. Better. And man does a path to the life worth living feel soo good. Cheers to everyone else in this sub walking that same path, either at step 0 or 120 and I hope ya'll have a good day/night! <333\n\n  \n**TLDR; Finally got some professional help and getting diagnosed was the best thing ever for me as it explained my life a lot and made me realize: maybe being crippled by self-hatred and anxiety/panic attacks isn't my fault and that my judgment of myself was never wrong! Also life is good and seems so much more worth living and working hard through when achieving something so detrimental to your health after waiting for such a long time.**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hmm8h4/after_5_years_of_waiting_i_finally_got_to_talk_to/", "title": "After 5 years of waiting, I finally got to talk to a professional about my mental health, got diagnosed, and also bagged myself some therapy!", "social_network": "reddit", "user": "NotNinjachicz", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1594089964, "permalink": "/r/DecidingToBeBetter/comments/hmm8h4/after_5_years_of_waiting_i_finally_got_to_talk_to/", "nsfw": false, "first_save": 1635438263.3017006, "replies_charged": false}