{"id": "t5_2tand_t3_9qlh10", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I'm going to lay it all out there in honesty, and it's bad, so this is hard. As the title says, I have taken 5 years of community college since high school to fail 9 classes. I have made a few of them up for better grades. Then again, I re-took others and got the same grade, and even retook one I passed and got an F. So that looks mighty stupid on my transcript. The entire thing looks stupid, to be honest. I feel so stupid. I know I'm a smart guy. People have always told me I had potential. I fell into the pitfall of being more satisfied with my potential than my results.  I didn't know why I was at college at first. I still didn't until extremely recently. I didn't know what I wanted my life to be, questioned why I was taking the classes I was, and had no motivation to do the work in them. This became a theme. I even took three semesters off from Fall 2016 to Fall 2017. I came back and did better. But only temporarily. In spring 2018 I got an A and a B, then a C in the summer and I'm on failing pace (though I can still get Cs) in my two classes this semester.\n\nThis past month I've decided to buckle down and pursue a career in computer programming. I know none of you, none of me, has any reason to believe I'll buckle down, but I desperately want to change. The thing is, at this point, my transcript is HIDEOUS. It's disgustingly bad. I don't see why any school would accept my transfer. I can't retake a bunch of classes, because an advisor at the CC I attend told me I'm basically at an \"attempted hour limit\" that I had never even heard of because I am dumb and did no research into college during the 5 years I was in it. Apparently if I retake the classes, my tuition at the 4 year schools will be much higher, if they even accepted me. I'm so fucking stupid. In all honesty I might fail the two classes I'm taking right now. I don't know how to stop procrastinating. Maybe I should go back on my ADHD medications, but I don't feel like the same personality when I'm on them.\n\nI'm angry at myself and you can probably tell, but the truth is, I want to be better. I want to maximize my potential. I want to lie before I die (if I have the privilege to see my death coming) and understand that I came into life, didn't fear failure, didn't succumb to laziness, and did my very best. That I fought my demons, chased my dreams, failed when I tried, succeeded when I tried, got knocked down to get back up. I want my one and only life to leave me saying \"wow, what a journey\", not \"wow, what a waste\".\n\nShould I cut my losses and attack life without a degree? Should I get an associates and then work on my coding achievements to become a better programmer? Should I change my major to reset some of my hours toward the hour limit?\n\nWhat can I do to instill discipline in myself? I would even be willing to join the military for that, but I genuinely don't want to be a part of the military, as though I appreciate them protecting us, I want to do all that I can to contribute to eliminating war.\n\nI'm at a loss but I want to overcome this.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9qlh10/i_have_failed_9_community_college_classes_taken_5/", "title": "I have failed 9 community college classes, taken 5 years to do so, have a gpa of 2.35 and don't know what to do.", "social_network": "reddit", "user": "throwaway_23andDown", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1540268156, "permalink": "/r/DecidingToBeBetter/comments/9qlh10/i_have_failed_9_community_college_classes_taken_5/", "nsfw": false, "first_save": 1635437863.963942, "replies_charged": false}