{"id": "t5_2tand_t3_htzlp8", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "\nI’ve always been regarded as the “gifted kid” ever since I was little. I believe that this has impacted me in many negative ways, one of them being that I don’t know how to put actual hard work into things. I’m used to the fact that my minimal effort is sufficient to go by.\n\nI just did significantly worse than I expected on my university entrance exams. This has been a wake-up call of sorts. I know what my potential is, I just never developed the skills to realize it. I want to learn how to:\n\n• “force” myself to do things which are not immediately pleasurable.\n\n• actually stick to new habits.\n\n• effectively manage my time.\n\n• make better decisions in high stress situations.\n\n• become a fast thinker and a better problem solver.\n\nI would appreciate any form of pointers. Books, YouTube videos, personal experiences, activities I could take up. Thank you\n\n\nEDIT: The response has been overwhelming. Thank you all so much for taking the time to give me such intricate advice. I have started reading Atomic Habits, which a few of you mentioned. I had already identified the habits I wanted to implement, but I’ve been trying to do them all at once, which I’ve learned is a mistake. So I’m currently trying to meditate daily, cut out white bread/pasta, fix my posture. I’m also trying delayed gratification (thanks for mentioning) to decrease my daily screen time. I’ll be sticking around in this wonderful community. Thanks again guys", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/htzlp8/18_years_old_never_developed_life_skills_where_do/", "title": "18 years old, never developed life skills. Where do I begin?", "social_network": "reddit", "user": "carnogo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 103, "down_vote": 0, "creation": 1595161070, "permalink": "/r/DecidingToBeBetter/comments/htzlp8/18_years_old_never_developed_life_skills_where_do/", "nsfw": false, "first_save": 1635436855.5068703, "replies_charged": false}