{"id": "t5_2tand_t3_nfteik", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "I am a guy , 17, indian, had only minimal interactions with girls . It's has been ages since I interacted ( I mean , excluding the SM chats ) with one (14 months). In india interactions between opposite genders prior to the financial independence phase is discouraged. This is because the people here belive that such kinds of relations would have adverse impacts on the academic life of a student and would terminate as a romantic relationship in all cases.\n\n However, a small percentage of the youth population  do all sorts of things like flirting, hanging out rendezvously. Mostly only a small percentage of this faction would be academically brilliant, majority of the book worms deliberately chose to remain real distant from members of the opposite sex. Maybe the popular belief that this would help them focus all of their attention to studies might be having a placebo effect on them. Growing up , I always knew that ( since I was being constantly observed / scrutinized by the society ) I aint supposed to cross the limit while in close proximity to the ladies. \n\nSex is a taboo. And uttering that word itself while girls are around would bring you bad rep. People only get the opportunity to indulge in sexual acts for the first time when they reach 23 years of age ( national average ). This is a like a gift pack that would unlock once you become financially independent. People don't date openly , people do it secretly, and that too is a recent phenomenon. If parents find out about your secret romantic relationship, you are in deep shit. If you got into it when you were being financed by your family then prepare to face a nice arse whooping. \n\n\nGrowing up in a patriarchal misogynistic society didn't bother me , but it did influenze my viewpoints to a great extent. I was honestly surprised after discovering that people in other parts of the world have sex before marrying. I percieved it as a fucked up system and I am not sure whether I still do. For a while I thought it was because of this fucked up practice that the divorce rates in those nations are high. I am of the opinion that one man should only get in a sexual relationship ( and if possible romantic as well) with one woman and vice versa.  \n\n\nSince I am a person who is looking forward to understand and if possible interact with different woman from all parts of the world I would like to refine my opinions ideas and views about women. \nAfter watching hell a lot of movies about Unrequited love ( it was/is a deliberate determined effort tbh, I literally spend long hours of my day finding such movies ) I am convinced that real life situations are goin to be like this , not like the cheesy romances. But it has started scaring the shit out of me recently, and I have decided to devote my time and efforts to some productive activity and has vowed to never go after any women.\n\n\nMy life got fucked up real bad post the pandemic fuckup. The beastly abomination within me woke up from its deep slumber. The nice guy me is in constant conflict with this mofo. Takeover seems to me like a likely possibility. This aspect of my  persona is constantly asserting that chasing / befriending women would do you no good and you would eventually become a depressed self hating scumbag on top of that it would also lower your efficiency , and would adversely impact your abilities particularly those, that would enable you to excell in the field of your choice. This is the reason why I decided to distance myself from women.\n\n\nTldr ; I will try to be raw and won't censor my responses. I am suspecting that I might be a WOMEN HATER. The reason why I wrote a big prelude is cause I kinda feel since the audience viewing this are from different countries they might be interested in knowing what all diff stuff conditioned me into this form.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nfteik/serious_i_wanna_change/", "title": "SERIOUS : I Wanna Change", "social_network": "reddit", "user": "Intelligent_Flower78", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1621391029, "permalink": "/r/DecidingToBeBetter/comments/nfteik/serious_i_wanna_change/", "nsfw": false, "first_save": 1635436862.2537103, "replies_charged": false}