{"id": "t5_2tand_t3_g3s2q4", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I've been on a journey to be a better person for a few years now. I feel like I have made immense progress with so many issues in my life, and I'm generally happy, motivated, and peaceful, which have been lifelong goals for me.        \n\n\n\n\n\n         \n\n\n\n\n\nThere is one aspect of my life that is causing me stress, and I'm at a loss for what to do. I've talked to my therapist about this, as well as a few trusted friends, and I feel like I am spinning around aimlessly trying to deal with this. Deep down I know that I need to just let go, but I really don't know how in this specific circumstance.        \n\n\n\n\n\n\n       \n\n\n\n\n\n\nMy plight is my best friend of 30+ years. Literally from the time I was born (I'm a year younger) we've been friends. We spent our childhoods playing together every day, and when she moved to a new neighborhood a few minutes away, we continued to hang out *every single weekend.* In college, she moved across the country, so our friendship slowed a little, but we still spoke on the phone every other week or so, and I visited her once in that period of our lives.          \n\n\n\n\n        \n\n\n\n\n\n\n\n\n\nAfter college we still spoke on the phone every once in a while, and though we didn't see each other, we still regarded each other as sisters (neither of us has biological sisters so this means a lot to us). Eventually I got engaged, and it only felt right that I ask her to be my maid of honor, even though I felt like some of my other close girlfriends may have been bigger parts of my life at the time. The following year she got engaged and asked me to be her matron of honor as well. I was going through some huge life changes during this time of being her matron of honor, but I stepped up and made some rather big sacrifices in order to do (what I hope was) an amazing job.           \n\n\n\n\n\n\n\n\n\n\n     \n\n\n\n\n\n\nIt was around this time that I knew I needed to be better. My family was growing, and I kept falling into cycles of anxiety and depression. I was afraid my spouse would leave me and my child would grow up to be completely disfunctional, so I found the motivation I needed to change. I found that I needed a best friend, and my old buddy was there for me. Whereas before, our friendship was based on the superficial, average chit chat about the weather, now we connected so deeply. I poured my heart out to her, and I felt like she realized she could finally do the same with me. This deep relationship went this way for well over a year. And then I decided to visit again, and everything inside me changed.       \n\n\n\n\n\n\n      \n\n\n\n\n\n(To give some perspective, this was the first time I was visiting her for non-wedding-related activities in almost a decade. This was the first time I was seeing her in her \"natural habitat.\")           \n\n\n\n\n\n\n\n       \n\n\n\n\n\n\nI was immediately struck by how spiteful and angry she went about every aspect of her life, *except anything in regard to me.* Even picking me up from the airport, the long drive was mainly spent talking about how every other driver is an idiot who deserves to die. I'm not just saying she has terrible road rage, I'm saying that this was the tone of every single thing we did. Gas was taking too long? \"Everything in this town is trash.\" Husband was in the kitchen? \"Why didn't you bring me back some snacks, you lazy shit?\" It stunned me. Her husband mentioned that she has a soft spot for me, and I didn't know how to respond. She was obviously a different person to me completely.          \n\n\n\n\n\n\n\n          \n\n\n\n\n\n\n\nShe had obviously not been giving me an accurate representation of her life. I thought through all of our conversations, all of our interactions, our entire history, and I realized: not only did she have a soft spot for me, I had blinders on when it came to her. I made excuses for the plot holes in her stories. I figured all of her micro-managing her wedding activities was normal. I thought, when she would describe an argument with her husband, that he was just a jerk who treated her terribly. Looking back, I ignored the bad stuff, because hey, she was my best friend. But there were many, many huge parts of her life that i would learn about years after the fact, even entire relationships that I knew nothing about while they were happening. And when I thought we were connecting deeply, I still just wasn't getting the full story.         \n\n\n\n\n\n       \n\n\n\n\n\n\nIt's been almost a year since I visited her. Since then I've been trying to wrap my head around the idea that my best friend isn't who I thought. For a while, it was just business as usual. We'd talk once a week or so, and I tried to compassionately point out the \"plot holes\" in her stories, or gently push back when she said something off-color. It didn't seem to phase her. She has only started coming to me more and more frequently with more and more problems. She texts me nonstop now about all of the bullshit in her life (her words), about how everyone and everything is against her and how the whole world is full of assholes.             \n\n\n\n\n\n      \n\n\n\n\n\n\nThere are days where I want to tell her to wake up and realize that she is miserable and she's making me miserable, too. I've suggested many, many times that she try therapy (none of the ones she's tried seem to have any effect on her). \n\n\n\n\n\n\n\n\n        \n\n\n\n\n\n\n\n\nNeedless to say, this relationship doesn't mash up with how I try to live my life. Different people have given me different advice. My therapist suggests that I continue to practice pushing back and forcing her to talk to me differently. This seems to work on a short term basis, but the next day she's overloading me with paragraphs of text about the same issues. My spouse suggests that I let it go, and realize that she's just not my best friend anymore, and I should stop responding to her on a regular basis. This is hard, because she's been my sister for my entire life, and we have this status quo now of communicating regularly. My other issue with this is that I don't really have anyone to fill that void. All of my other closest friends are not as frequent in regards to talking all the time, and though I have to sift through her delusions, she does take the time to at least listen to me in return on most occasions. Other trusted friends that I've talked to don't really have any advice. It's a tricky situation. The last thing I'm worried about is that if I decide to push back too hard, or try to cut ties, I may not just lose a friend but gain an enemy, due to how vengeful she is.             \n\n\n\n\n\n\n\n\n\n\nThank you for reading this far. I'm at a loss. I don't want to lose my best friend, but I think the friend I thought I had only lives in my imagination. Any thoughts or advice is appreciated.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g3s2q4/i_need_some_perspective/", "title": "I need some perspective", "social_network": "reddit", "user": "throwwwwwww7", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1587233503, "permalink": "/r/DecidingToBeBetter/comments/g3s2q4/i_need_some_perspective/", "nsfw": false, "first_save": 1635438276.653518, "replies_charged": false}