{"id": "t5_2tand_t3_lazl22", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "My story: I was raised in an old-fashioned Southern Baptist home. We were always at church and while I had a solid faith background growing up, the purity thing wasn't exactly the greatest for me because it always seemed forced. Nobody really took the time to explain it and the way society was teaching it, it rubbed off (pun intended) the wrong way. So at age 12, I discovered pornography and the pleasure I found was outstanding. My parents tried the approach of \"It's bad for you\" with biblical doctrine and just made me guilt trip to the point I hid it. I hid pornography on my phone and tablet. I'd sneak into the living room to the family computer to masturbate at 2am when the house was asleep.   \n\n\nMy faith was strong for the most part but it was also pretty screwed up because I had this sin growing in my life. When I got into college, it continued. I'd try breaking it but things only got me into deeper darker waters. I'd find myself on heavier porn sites. I've seen things I'm not proud of (nothing illegal though like child pornography for legal purposes) and not felt remorse. Sadly, when science says that pornography can dull the senses to certain things, it's true. (I'm sorry to whomever may be reading this who's been a victim of abuse or rape. Culture has praised it, I indulged in the video side of it, and to you I apologize. It's one reason I want to change my outlook.)   \n\n\nI moved out on my own a few years ago (2018) and it skyrocketed. I was watching multiple times a day on my off days and jacking off 2-3X a day. (Which can't be healthy!) And then a year later, April 2019, I was accused of public masturbation and spent the last year on probation for that crime. My self-esteem had been ruined and for the most part it was a huge wakeup call. (That was definitely the lowest low I've ever been inside.)  I remember my first meeting with my PO and she going \"So, how much do you masturbate?\" and that's when it hit me how bad it really was. I felt awful.   \n\n\nJust after the court made their final decision, I got together with my fiancé. At the time I didn't know what was going on, but early on, I lost my virginity. I had held onto until I was 24. The sex has been wonderful and I enjoyed myself but I was delayed all the time. I couldn't finish. I would have to finish myself and I slowly watched her self-confidence diminish. I spoke up to her about my addiction and she's helped me a lot over the last year and a half on it. Before COVID, I was on an almost two-month streak and then the stress, anxiety, and depression hit. I fell back into my old ways and I was back at it. I found a way around the blocker and I stopped communicating with my partner. Before COVID, I was successful all the time in the bedroom during that break time.  \n\n\nI regret not talking to my partner about my relapse. I should have. The other day she broke down and cried because she was afraid I'd never be able to finish the job. I couldn't hide it anymore and talked to her about my relapse. Was she disappointed? Yes. Did she show me love still in return? Yes, and she said she'd help me get through this.   \n\n\nSo here I am, putting my pride aside, and trying this time for real to completely kick pornography to the curb so that I can perform better, have less anxiety, less depression about myself, and build my self-confidence in myself without the lies the internet tells me. This is officially the start and I hope that I can share a success story as the days pass along. I've decided I need to change for my relationship and my own self.   \n\n\nI really hope that this community can support me in my journey. I hope that I can shine in the end. I hope that I can some day report \"I DID IT!\" I apologize for typing so much, as there has been a lot on my chest. I'm sorry if I hurt anyone's feelings too. I'm going to be a better man even if it's a challenge! I can do this!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lazl22/25m_finally_kicking_my_worst_habit_to_the_curb_so/", "title": "[25/M] Finally kicking my worst habit to the curb so that I can hopefully have children some day with my fiancé! I'm quitting watching pornography and masturbation after years of abuse since 6th grade. (well trying.... I may need a lot of encouragement.) I can do this!", "social_network": "reddit", "user": "LrdFyrestone", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 634, "down_vote": 0, "creation": 1612283047, "permalink": "/r/DecidingToBeBetter/comments/lazl22/25m_finally_kicking_my_worst_habit_to_the_curb_so/", "nsfw": true, "first_save": 1635437735.715296, "replies_charged": false}