{"id": "t5_2tand_t3_e48z50", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I don't know how I developed this or when I became this way. But for some reason whenever I do something I'm proud of and succeed at it, I get this weird urge to tell everyone about it and seek their praise - and I hate it. But that's not the only thing - if someone else does something similar to me, I'll find myself feeling sort of bitter and like someone is treading on my territory even when I know it's fucking stupid. I don't act mean to anyone or even boast about my accomplishments (in the really douchey arrogant way), but I do get this internal irritation that sticks with me and makes me lose motivation and feel depressed for days over it. Like I act friendly on the outside, but on the inside there's this really childish and salty part of me that I despise.\n\nI know people hate reading really long posts, but I badly want help dealing with this and improving myself and I feel like in order to get to the nitty gritty part of it, I need to open up and share a major area of which I feel this way so someone from the outside can help me wake the hell up. Especially since it's hard to discuss this with other people I know.\n\nIf you want, you can just ignore my vent and go based on my paragraphs above - I won't grudge you for it \\^\\^;\n\n\\--\n\nHere's a massive example that i'll give you:\n\nSo, last year I created a Tumblr blog (yes you can cringe lol) about a game series that hadn't fully released yet. I created it because there was a concept for a particular character in the game which I found fascinating. \n\nI went around the web looking for a place to discuss and speculate about the game, but there was no one really talking about it besides on the games forum for the company (which is full of assholes). So, on a total whim I decided to create a Tumblr blog to post my own theories and speculations about it in the hopes of drawing more people to talk about the game with in a pleasant setting.\n\nLong story short, but my blog BLEW UP. As soon as the first part of the game dropped I ended up with literally hundreds of messages every day from people wanting to hear my thoughts and theories. Knowing that I had this weird hidden talent on analysing media and writing thought provoking posts really made me happy and it was like I unintentionally discovered a side of me that I didn't even know I had. It was surreal.\n\nI would write character studies, theories, ect, some of which the actual writers for the game liked and showed appreciation for. Eventually I became really well known in the fandom and perhaps the biggest blog on the site in regards to it. I also formed a really close connection to my followers and would listen to their everyday problems and do my best to give them advice or a comforting shoulder to vent to. This wasn't just me trying to appeal to the crowd or anything, I did genuinely care and want to help these people. My mindset was that I'm currently in a position of power in the fandom to do some good. And I know that a lot of younger kids who go on Reddit have this weird tendency of looking up to and idolising big blogs (something which actually makes me feel kinda iffy tbh since it reminds me of Youtubers/social influencers) and I wanted to be a good influence on them. So I would always try and be there for them and I would also hop in to stop any drama that happened in the fandom to stop the place being toxic, ect.\n\nAnyway, this is the really embarrassing part that makes me cringe typing it out because it makes me sound like one of those really obsessive Tumblr fangirls but i'm going to be 100% honest here because I want help to stop thinking with this mindset and feeling this way.\n\nSo, I kind of began taking pride in the fact that I made one of the characters in the game more popular within the fandom because of my posts, as well as some labels/tags involving him and other characters that suddenly gained popularity and spread onto other sites as well. The fact that I basically trended nearly everything about this character got to my head I think. Whenever I would see someone mention it on Youtube, Reddit or Instagram I would feel this insane urge to mention that I was the one who started it.\n\nI don't know why I latched onto this feeling so much, but I guess it's because I developed a really deep connection with him and spent so much of my time studying him and analysing him because he was so well written (and this isn't a \"fictional character crush\" scenario btw). I felt like I understood the character better than anyone else and in a way it kind of felt like I did..? a lot of my theories on him and studies ended up inspiring how most of the fandom viewed him and even the game developers themselves threw in an easter egg based on one of my posts - which isn't just me assuming btw, one of the writers actually referenced me regarding it when someone asked them. I not only made him more popular, but I also influenced his actual character as well, both within the fandom all over the internet as well as the game itself. Even though I didn't create him, it kind of felt like I did in a weird sense? \n\nI thought that maybe it was because it was the first \"successful\" and accomplished thing that I've done in my life so far and I wasn't used to being praised for things as much as this. But it's not like I was attention starved as a child, I don't think. So isn't it kind of odd that I would develop this strange sense of pride over something that's logically really insignificant and ridiculous to be proud of?\n\nI was strangely treated as a famous person in the fandom. I helped a lot of fanartists and writers gain exposure by reblogging and writing comments/reviews on their work to encourage them to interact more within the community (this is an important note because it ties into part of my pettiness and stupid mindset later on).\n\nAnyway, near the end of the game's 3rd episode, my depression got pretty bad from the constant responding to Asks every day from months on end as well as some personal stuff going on in my life, so I took a \"break\" from my blog for a few months which ended up being 3 or something (after the game had finished).\n\nWhen I came back from my break the fandom was mostly dead. All of those people and close knit community I knew and bonded with for an entire year just vanished. I saw old Asks from people saying my blog was \"dead\" and overall the entire fandom went from 100% to like 30% in terms of members who were there. I kinda of hated myself for a bit because I felt like part of it was my fault. I knew that the fandom would obviously diminish a little after the game released and there was no new content, but the fact that I lost those last few months with those people because I took a break and let my blog die, REALLY got to me. Especially when I saw another blog member which I helped provide exposure to in their content (early days of the blog) suddenly have what I used to have - a big and loving group of people who enjoyed their content and flocked to them. Now, it wasn't the fact that they were more popular which upset me - it was the fact that it was due to their content based on the character that I spent my year dedicating my blog to and grew the fandom for, that upset me.\n\nI felt like I was being replaced by these people. That all of those months with them suddenly didn't matter because I was gone for like 3 months. Like I suddenly didn't exist or matter anymore, because they had someone new to give them content. Even when I responded to all of my old asks and tried to make my blog active again, I went from hundreds and thousands of \"notes\" to barely making over 15 each post.\n\nI think what REALLY hurt me though was that character analysis and studies were my \"thing\" in the fandom, and I remembered promising my followers that I would make a full blown character study on this particular character summing up everything i've studied about him throughout the game. It was my big project I so badly wanted to do. But because of my mental health break I didn't get around to doing it... and when I came back most of those people were gone. So even if I DID make it now, hardly anyone would see it and I keep on kicking myself for never making it sooner so I could experience the joy and excitement from everyone reading it and commenting on it to me. Then this other blogger made her own character study on him knowing full well that I was going to do it (one of my return posts was mentioning it) and I suddenly felt like this important thing very dear and close to my heart was fully ripped from me. Especially because this was at a point where I was deciding to leave the blog and let it die gracefully instead of pathetically trying to revive it - and that passion project of mine was meant to be my final farewell to the fandom.\n\nI know that more than one person can make a dumb character study post and I don't own the character. But even though I \\*know\\* that I couldn't stop the really bitter and protective side of me over it.\n\nAnd I HATE that i'm like this. Why can't I just stop taking this shit so seriously and getting over emotional over fictional characters and worlds. Why do I feel so jealous over a Tumblr blog and why the hell do I need people to know I did all of these things and get frustrated when people don't realise I started it or \"made it popular\". It's so childish and all it's doing is hurting myself in the long run.\n\nI know this was one massive rant about 1 particular thing, but that's because it's the most recent event in my life and biggest example of my need to be showered with praise and affection from people.\n\nI also get this way sometimes whenever I do something i'm proud of and feel a need to let everyone know about it as well.\n\n\\--\n\nI'm really sorry for spamming you all a wall of text, but when I ramble I get really into it and it's the easiest way I have of conveying my thoughts and emotions to people.\n\nI just really need help fixing myself because I know this isn't healthy or normal but I don't know how to fix it myself and if anyone wasn't put off by the length and read it - I would greatly appreciate your help (and be brutally honest with me if it's something I really need to hear).\n\nThank you for your time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/e48z50/how_do_i_stop_seeking_praise_or_attention_from/", "title": "How do I stop seeking praise or attention from people? (long ass vent but you can ignore the text after the cut if you want)", "social_network": "reddit", "user": "xValkyx", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1575169186, "permalink": "/r/DecidingToBeBetter/comments/e48z50/how_do_i_stop_seeking_praise_or_attention_from/", "nsfw": false, "first_save": 1635437688.4506245, "replies_charged": false}