{"id": "t5_2tand_t3_ny8k3q", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "I often find myself fantasizing about being different, about being better, being my ideal self, I've been doing this ever since I can remember, I'm sure it's something we all do, if not... I guess I'm just weird haha. \n\nI used to imagine myself being confident, healthy, and disciplined. \n\nI used to imagine making myself look better, feeling better and getting the things I needed to do done. \n\nDoes anyone else relate? I know some of us do. \n\nIt wasnt until I watched a david goggins video when something  clicked, if you dont know who that is you really should look it up after you read this. \n\nHe was talking about when his \"demons\" would start talking, by that he means when the negative thoughts or laziness gets in his head. \n\nHe'd doubt himself, just like anyone else but he would recognize what's happening, and in that moment he turns into \"goggins\" \n\nGoggins is what he calls his ideal self, and by recognizing these difficult moments and changing his way of thinking, he'd accomplish difficult tasks. \n\nHearing him talk about it was one of the many factors that pushed me into being better. \n\nWhenever things get tough I'd ask myself what would the person I want to be, or in other words the ideal me do. \n\nIf it meant doing an hour cardio every morning, the ideal me would do it. \n\nIf it meant cleaning my room vs procrastinating on Instagram I ask myself what would the ideal me do and it usually helps. \n\nI'm far from perfect and I still struggle, just being honest.\n\nI still fall victim to the \"demons\" in my head, the best of us do, and that's okay.\n\nWhat's important is that we recognize it and get back on track, because honestly,you're bound to fail at some point, we all fail, it's part of the process!!!\n\nWhenever you feel unmotivated, or things get difficult, ask yourself what the idea you would do. \n\nYou got this!\n\nI'd greatly appreciate it if you could show some support to my ig page: cult_of_success", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ny8k3q/a_method_to_being_the_best_version_of_yourself/", "title": "A method to being the best version of yourself", "social_network": "reddit", "user": "Cult_Of_Success", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1623509755, "permalink": "/r/DecidingToBeBetter/comments/ny8k3q/a_method_to_being_the_best_version_of_yourself/", "nsfw": false, "first_save": 1635437233.3646212, "replies_charged": false}