{"id": "t5_2tand_t3_7gbnsm", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I was born into privilege. Private school, piano scholar, played rugby in the first xv. Was always nervous around girls but I found someone at law school in my first year and we were very much in love for 4 years. I dumped her because I didn’t want to marry the first girl I screwed. I wanted to play the field. By now I was a serious rugby player and everyone I knew expected great things from my. By 22 I was dating a Norwegian goddess that I was so hot my mates were so star struck they couldn’t hold a conversation with her. This includes players that were wallabies at the time although I was not a wallaby. \nBeing the son of a well known barrister it was ridiculously easy to make my way in the law. I slept with all my my attractive colleges and fought off stunning women and wanting commitment / marriage. I didn’t want that, my life was just too good. Work, alcohol, cocaine, everything was great.\nThen I developed a gambling problem. To compensate for my losses I drank to numb the pain. This made things worse. Being worth $3m at 30 i lost the lot except for the debt. I lost my license to practise law and my family basically disowned me despite all the help I have them when they needed it, financially and otherwise. My fiancé terminated our baby and left me. She’s now married with kids to some guy she met after knowing him for a month. It’s all over FB how happy she is.\n I’m nearly 40 and now have to work a lousy job for $50k where I used to earn $300k+ pa. Friends don’t contact me and life is just an existence, not a life. Every morning when I wake up my heart just sinks. I just don’t want to go thru with the day.\nI know I shouldn’t indulge in such self pity but it’s hard not to. \nApologies for my ramble, \nLike is just pharked atm", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/7gbnsm/anyone_else_screw_up_your_life_like_me/", "title": "Anyone else screw up your life like me?", "social_network": "reddit", "user": "jackdonahue1980", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1511942546, "permalink": "/r/DecidingToBeBetter/comments/7gbnsm/anyone_else_screw_up_your_life_like_me/", "nsfw": false, "first_save": 1635437869.365908, "replies_charged": false}