{"id": "t5_2tand_t3_mwtgin", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "Before I start, let me tell you a little bit about myself. I’m a man, professional with a decently paying job, married to a lovely husband, own a house, and have a cat.  I work in an industry that let me be a political activist.   All this to say, life is pretty good. \n\nThe older I get the more self-reflective I’ve become. In recent years one of the things I’ve thought a lot about is my lack of curiosity while I was in college. In order to save face or not look dumb, I always tried to come across as having the answer before everyone else. This is a real regret that I hold onto because I believe if I would’ve been more curious I may have taken a very different path professionally. \n\nI like to think I’ve moved past that characteristic and have become a more curious person. Yesterday, I was speaking to my therapist and he mentioned  “I don’t mean this to come off as negative but you often present yourself as a little ‘too cool for school.’”\n\nI knew exactly what he was talking about and was certainly not offended by what he said. Of course, I was a bit sad that I had not stopped being like that, AND I’m completely unaware I am still like that.  So now I turn to all of you I don’t want to be “too cool for school“ I want to be open, curious, and interested in those around me. What advice, strategies, reactions do you have to this?   Thank you all in advance.\n\nEDIT:  I want you to know that the misspelling in the title is driving me NUTS!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mwtgin/i_want_to_stop_being_to_cool_for_school/", "title": "I want to stop being “To cool for school”", "social_network": "reddit", "user": "joshuaferris", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1619178528, "permalink": "/r/DecidingToBeBetter/comments/mwtgin/i_want_to_stop_being_to_cool_for_school/", "nsfw": false, "first_save": 1635435106.361968, "replies_charged": false}