{"id": "t5_2tand_t3_cxjepo", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "I run out of things to say, i run out of things to ask easily, I run out of things to say or subjects to talk about, or topics to bring, i always ask dumb questions no one gives a single fuck about,\nAny question i ask is simply boring or predictable or dull or bland or one worded questions or ones no one cares about.. i have nothing interesting to say... i cant even open a conversation.. its like there is nothing to talk about. Its like i never have anything to say. I get stuck and freeze even at texting.. i run out of topics. After 1 or 2. Im not a guy who can talk.. i cant make a conversation..\n\ni have no qualities at all or any personality.. my only quality is \"Nice\" im one of those boring r/niceguys that are invisible with no friends, i feel like i dont deserve anyone, i feel like everyone is better and more unique than me... im not interesting at all. Im not cool or funny or smart\n\nMy conversations are like interviews, they are always dry, i dont go along with anyone.. i ask questions but they are always boring and can be answered with a few words, then i cant make a conversation out of it.. its always me putting all effort in.. always me chasing them not them chasing me ever... like im not worth their effort..\nI feel like everyone is way much cooler than me or too cool for me...i always text first..i feel invisible.\n\nI ask them hobbies they have they might say \"Hiking\" i cant follow up with a good sentence or ask a good question... its mostly awkward silence... its why im good awful at making friends, it mostly happens online like this.\nGirls giving one word answers and i feel like im invisible and boring & meaningless\n\nMy convos are always like im forcing them.. they are tedious, no one cares about what i say..if i go to a date it will be the worst thing ever happened to me & the girl... im not someone that anyone will love... \n\nNo one listens to me, or laughs at my jokes, i get jealous of ppl with top likes in youtube comments, and my convos go stale fast, i hate my self, i cant even make friends, i dont even like my self bc how i suck at making friends, or feelin like others are smarter than me....im just invisible.. idk how to learn about people...im plain and forgettable. No one asks me questions.\n\nI cant even do discussions about all different topics around the world, or an arguement..\nMy conversations are always tedious or boring or annoying to the persr6on, they just want to leave me. They always leave me on seen. Im trying to make friends online. But they lose interest. Is online a good place to make friends? Like text everyday?\n\nIm the most boring person in the face of this earth. Im important to absolute no one... im too generic, none orginality in me,\nThere are guys who get girls w/o trying im the opposite.. how you guys do that magic?\n\nI always try to impress people, trying to make them notice me/like me/value me.. so i dont feel invisible or meaningless.. its like im not capable of making friends, or making them stay with me..\n\nI always feel like im not unique like others, Im not Smart or Funny or Cool or Intelligent or too Clevar or a genius or witty or charming or witty or wise or confident or creative or charismatic... i have no skills or talents..\nI have no sense of humour...no social skills... no friends or a GF.. im stupid and overly nice.. i want to kill my self. end this.r\nIm just so fucking angry at my useless self\n\nIm so fucking mad at my self... i feel the rage on my bones... im just not unique like others, im not special to anyone... im so fucking boring that im invisible.. i have a boring life..", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cxjepo/how_do_i_stop_being_a_boring_rniceguy_with_dumb/", "title": "How do i stop being a boring r/niceguy with dumb personality? I feel idiotic, and invisible, no one ever cares or gives a single fuck about me...i have no friends I put every fucking one on pedestal...", "social_network": "reddit", "user": "hamacule55", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1567183103, "permalink": "/r/DecidingToBeBetter/comments/cxjepo/how_do_i_stop_being_a_boring_rniceguy_with_dumb/", "nsfw": false, "first_save": 1635435829.1292536, "replies_charged": false}