{"id": "t5_2tand_t3_l4gc8x", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Hello! \n\nI want to get into becoming more organized in terms of certain areas of my life. First, exercise. I have weight gain goals but I have trouble eating. This past summer, I was very disciplined and gained muscle. It fizzled off when I started grad school but I know I can be consistent in both diet and exercise. Secondly, I want to do content creation. I have been very sporadic in my upload schedules but I know my potential and I have seen strides in my content. Lastly, grad school. Luckily my grad school is completely online at half-time. I can literally do whatever (hence the full- time content creation) and since I'm unemployed I can really delve into this venture.\n\nMy only issue is one facet gets in the way of another, then it leads to complacency. Late or no uploads. Doing my assignments last minute because I was editing or streaming. Then home/family life gets in the way, to which I can't say no because it's my parents and I live with them. They just don't understand my goals and dreams in how I want to do content creation full time (which is okay because they still support my endeavors and aren't blocking me). It feels like I'm my own personal assistant at times. Then I spiral into not being motivated to do anything. I know a schedule would really help, but it seems like because I'll never know how long an assignment will take or if I'm busy with family stuff, the unpredictability of my life is really hindering my progress in all areas. \n\nAny advice on structuring, creating a schedule, or what I'm doing wrong? How can I approach this better? What mindset can I have to improve my disorganization?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l4gc8x/trying_to_be_organized_but_im_very_disorganized/", "title": "Trying to be organized but I'm very disorganized", "social_network": "reddit", "user": "vessva11", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1611550433, "permalink": "/r/DecidingToBeBetter/comments/l4gc8x/trying_to_be_organized_but_im_very_disorganized/", "nsfw": false, "first_save": 1635436040.0025496, "replies_charged": false}