{"id": "t5_2tand_t3_q5732u", "request": ["f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "How do you treat yourself when you screw up your diet, miss a due date you had for yourself, or have some other setback? Any of these sound familiar?\n\n* Viciously attacking yourself mentally\n* Trying to repent by over exercising, overworking, or some other feverish over compensation\n* Feel like a failure, worthless, broken\n* Wonder why you always do this, why you can’t learn from your mistakes\n\nBecause I do those. I do them a lot, often in excess of the error that started the spiral. Eating one milkshake should not cause 8 hours of internal self criticism. Forgetting one due date should not cause a feverish work marathon just to re-establish self worth. It’s like life gives me a papercut and I say “Might as well finish the job” and grab a chainsaw. It’s madness.\n\nThe psychology of these episodes is twisted, naive, and ugly. Does this sound familiar?\n\n“I am defined by my present circumstance, and all I see are failures. I have to earn better results right this second or a failure is all I’ll ever be.” \n\nIn those moments we can’t accept who we are. We can’t say it’s human to make mistakes and we can’t acknowledge that we’re more than this one setback. We wholly identify with the setback and our entire self worth is tied to if we can make it right. Riddle me this:\n\n* Has this ever worked for you in the past? \n* Has it ever made you feel better in a lasting way?\n* Can you see yourself as more than this one goal or mistake? Do you realize that this one thing does not define you?\n* Can you accept who you are? Even if it’s not perfect, even if you’ll try to be better tomorrow, can you accept that this is who you are right now?\n\nWe don’t have to jump on the self love train. We don’t have to get flowery about how we love our faults and forgive ourselves. Can we just stop doing shit that doesn’t work? Because the self evisceration, the self criticism, the negative mental loops and worst of all the spirals into self destructive behavior…. all of these make things worse not better.\n\nNot everyone can be an enlightened Buddha in every dark moment. It’s okay to feel pain, disappointment, and frustration. I just want you to remember this question: “Is this action getting me closer to where I want to go?”\n\nThat question has no judgement, it says nothing about where you are right now, and it does not care how far away your goal is. It just holds you accountable to the present moment. If you ask that question while you’re viciously attacking yourself, the answer is “No.” If you ask that question as you reach for another “I give up” doughnut, the answer is “No.” And if you ask it while crying on a treadmill trying to repent for the first doughnut, the answer is “No.”\n\nSelf hatred does not get you closer to your goals. Feverish self punishment is far less effective than small consistent steps every day. You don’t have to be perfect and you don’t have to be the saint of self love. Just take it one day at a time and thoughtfully ask which choices are actually helping you.\n\n**Further Reading:** If this post resonated with you then I think you’d really benefit from *Awareness* by Anthony de Mello. It is an extremely practical book that teaches you to notice these negative feedback loops and gives you tools to escape them. Some parts of being human will always be hard, but improving self-awareness means we don’t make it harder than it has to be.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q5732u/punishing_yourself_does_not_get_you_closer_to/", "title": "Punishing yourself does not get you closer to your goal", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 622, "down_vote": 0, "creation": 1633868821, "permalink": "/r/DecidingToBeBetter/comments/q5732u/punishing_yourself_does_not_get_you_closer_to/", "nsfw": false, "first_save": 1635438377.1556008, "replies_charged": false}