{"id": "t5_2tand_t3_3ovl1i", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "The world is addicted. \nThanks to many of the latest social media apps that have spammed our phones in the last 5 years we have discovered a necessity for connecting with friends and acquaintances all across the globe, always checking in with their posts on Instagram, Facebook, Tumblr and Twitter. The problem is, what happens when we see something we don’t like?\n\nSurprisingly, this term has become so prominent that it even has a definition in the oxford dictionary.\nIt can be defined as:\nAnxiety that an exciting or interesting event may currently be happening elsewhere, often aroused by posts seen on a social media website.\nListen to my experience and see if this sounds familiar.\nHaving a great day? \nThat’s too bad, you just hopped on Facebook. \nI watch a lot of Netflix. I love to spend nights polishing off season after season of Torchwood and for the most part, life is bliss. BUT, all it takes is for me to unlock my phone, open up the Facebook app, start scrolling and before you know it I find myself in a pit of despair! “Why am I wasting my life watching welsh people battle aliens while old school friends are posting photos of cool hipster cafes, engagement posts with 500 likes (totally paid ads..) or other cool and crazy ventures putting my pathetic track pant wearing, chocolate gorging life to shame”. (A bit of an exaggeration but you get the point.)\nListen to my experience and see if this sounds familiar.\n\nRead the rest of what I wrote here. \nhttp://www.inky-n-thebrain.com/facebook-fomo-the-fear-of-missing-out/\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3ovl1i/the_world_is_addicted_to_facebook/", "title": "The world is addicted to Facebook", "social_network": "reddit", "user": "justinpm15", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 28, "down_vote": 0, "creation": 1444927927, "permalink": "/r/DecidingToBeBetter/comments/3ovl1i/the_world_is_addicted_to_facebook/", "nsfw": false, "first_save": 1635435646.227718, "replies_charged": false}