{"id": "t5_2tand_t3_lgi5vb", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "e234981c-b061-4d83-8134-70d441847f74"], "text": "TLDR: You can't eat an elephant in one sitting, but you can over time.\n\nI've contemplated posting here quite often, but finally decided it might benefit other people in a similar situation or past to myself.\n\nI served in the military from 18-23. I did not take advantage of the opportunities it provided and instead focused more on partying, and doing the bare minimum.\n\nI started college for mechanical engineering when I was 23 and promptly dropped out unfortunately. I had an incredibly toxic mindset, and allowed myself to be influenced by negativity/being close minded. I then worked in retail for a few years before deciding to go into another college program. I started trade school and quickly realized that if you want something, it takes work regardless of what it is. I just graduated with my associates in May. I am finally working towards my original goal of engineering and in my second semester, albeit 5 years later than planned. The difference this time is that regardless of what I am learning I actually apply myself instead of constantly questioning when something will be useful.\n\nOutside of education, my finances used to be absolutely garbage. I had messed up and \"fixed\" myself/finances several times over and only this last time did everything stick because of how I did things.\n\nOn top of that, I used to not do dishes, clean, or anything a normal functioning adult would do with some kind of frequency.\n\nIt has taken me slightly over 5 years to get to where I am at now. I am far from perfect still, but almost everyday from them until now has been small improvements.\n\nMy whole point is you might not see the improvements you want to immediately, but over time they will add up. Just keep trying at whatever it is you want to do no matter your age or goal, have an open mind, and don't judge yourself compared to others!\n\nThere is quite a bit more detail to this story, but to keep it short I left a lot out. If you have any questions, please ask, I am an open book.\n\nHave a great day!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lgi5vb/your_progress_is_not_negligible/", "title": "Your progress is not negligible!", "social_network": "reddit", "user": "QuickNature", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1612918581, "permalink": "/r/DecidingToBeBetter/comments/lgi5vb/your_progress_is_not_negligible/", "nsfw": false, "first_save": 1635435197.191116, "replies_charged": false}