{"id": "t5_2tand_t3_nzz1f4", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "Trigger points, knots, sore spots - whatever you want \nto call them - can suck... A lot. \n\nThey are as common as bruises and can cause a ton of dysfunction and suffering in the body. \n\nHow do I know? \n\nBecause for the past 2 years, I have had experience of working with hundreds of clients as a registered massage therapist. \n\nThis includes studying anatomy as well as actively releasing and removing these things on my own body. \n\nSo what is a trigger point exactly? \n\nThe definition of a trigger point is a hyper irritable section of muscle fibers within a muscle. \n\nThey can be large or small, prevalent or subtle, but regardless of how they present themselves, they are there. \n\nTrigger points can sometimes be described as those really tender and sore spots that you feel in the sides of your hips, your back, or your quads. \n\nBut rather then them just being in a few key muscles groups, they can be in any or all of them. \n\nThey can cause pain, limited mobility, and impact every area of our lives. \n\nSo what is the best, most effective way to get rid of them? \n\nThe answer is self massage. Roll them out. \n\nUse a foam roller, a lacrosse ball, or your knuckles. Whatever gets the job done and is suitable for the area you're working with. \n\nLet's start with your quads for example. \n\nAs you slowly begin rolling out and applying increasingly more and more pressure, (it's important to get the muscle warmed up) they're going to start feeling tender. \n\nAnd as you're rolling it out, you might feel a few spots that are NOTICEABLE more tender than the other areas. \n\nAreas where the level of pain goes from a 5/10 to an 8/10. \n\nCongratulations, you just found a trigger point. \n\nAs you slowly roll into that area, notice if you feel any referral pain travelling up or down your limbs. \n\nIf you do, this is just further indication that you indeed found a trigger point. \n\nTo release it, continue applying direct pressure to that area with whatever tool you chose and DON'T MOVE. \n\nLike I said earlier, these damn trigger points can be very subtle, sometimes only encompassing a few thousand muscle fibers, so if you move off of it, even only a centimeter, you won't release it. \n\nStay exactly on the location until that referral pain I was telling you about earlier fades away. It could take 5 seconds, or it could take 55 seconds. It all depends on how long that trigger point has been there for, and for how long. \n\nAnd as long as you don't feel any worsening numbness or tingling, you're good. \n\nIf it's really intense, take deep breaths as you perform this technique. \n\nYou might begin to feel light headed, or even have strong emotions come up. Know that this is okay and completely normal. \n\nOnce that pain is gone, congratulations, you just released your own trigger point. \n\nFeel free to do a little bit of extra rolling out to entire muscles as well as that area. No static pressure here, just dynamic movement. \n\nNow enjoy the new found flexibility, movement, and joy you now feel as a result of having a healthier, more attuned body, free from imbalances and incongruencies. \n\nNow instead of paying $100 to go see a massage therapist for an hour, you can get rid of your knots and trigger points in your muscles in the comfort of your own home. :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nzz1f4/how_to_remove_knots_and_trigger_points/", "title": "How To Remove Knots and Trigger Points", "social_network": "reddit", "user": "TheKuzzinator", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 50, "down_vote": 0, "creation": 1623710280, "permalink": "/r/DecidingToBeBetter/comments/nzz1f4/how_to_remove_knots_and_trigger_points/", "nsfw": false, "first_save": 1635436149.0244493, "replies_charged": false}