{"id": "t5_2tand_t3_g801ex", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "Going the distance to fulfill your dreams is an important part of life. It takes a lot of heart to follow though and see your dreams become a reality. Learning to do this will enable you to see your dreams take shape. \n\nFirst, determine if your dream is something you actually want to create. You will have more dreams than hours in the day. You should limit yourself to 1 or 2 main dreams to accomplish at a time to ensure you are not spread too thin. The dreams that occupy your attention most will be the dreams you want to create. These dreams can take years to accomplish. Learning to fall in love with the process of creating your dreams is the key to accomplishing your goals. If you are not in love with the process, your dreams will likely end up unfulfilled. When selecting your dream, ensure you are not only in love with the end result. \n\nDon’t be afraid to dream big. However, the bigger the dream, the more you need to be in love with the process to accomplish it. Big dreams can take years to create, and require an enormous amount of effort and energy. If you love the process, the effort and energy will be there. If you don’t, you will quickly tire of the work necessary to create your dream. If you begin taking steps towards your dream, and you feel filled with love as you go about the process, this is a sign you are headed in the right direction. If you do not feel a spark of love, it is a sign that the dream you are chasing is not meant for you, and it is time to change directions. \n\n&#x200B;\n\n&#x200B;\n\nOnce you have determined the dream you want to create, the path you take is up to you. There will no doubt be many setbacks, and you will learn to handle them with love. Each setback is there for a purpose and will teach you something new. Learning to view setbacks and obstacles as necessary parts of the process will allow you to overcome them with greater ease. Maintaining the same love you initially set out with can be difficult. In order to do so, you must maintain a clear state that is unclouded by negativity. There is positivity behind the negativity if you look hard enough. Seeing through the veil of negativity will be the way you maintain a clear state. Look for the silver lining in all situations. \n\nBeing a part of something greater than yourself will be very helpful in accomplishing your dream. Seeing yourself as a part of something greater than yourself will enable you to accomplish more than you can alone. Realize you have a great support structure at your disposal and you can ask for help at any time. Be unafraid to look for help when you begin to feel lost. We all lose our way sometimes. \n\nAs your dream begins to take shape, you will begin to gain an even clearer vision of your dream. Maintaining a clear vision and refining this vision as the process unfolds will enable you to create something even greater than you initially anticipated. Should you begin to lose vision of your dream, you will want to take a step back and consider why you are doing this. Reestablishing your motivation will help you to gain a clearer vision. Getting very clear on your purpose will help you regain motivation and energy toward accomplishing your dream. \n\nAllow your dream to be fluid throughout the process. You might find your dream has a mind of its own and your initial vision of it is inadequate. The dream may even take on a completely different shape after doing a few weeks of work. After working on it for a month, your vision of it will be radically different than when you started. Allowing your dream flexibility will help ensure you create something wonderful. Sometimes you may find that some of the work you’ve done is no longer useful on this particular project. Don’t worry if you feel as if you’ve wasted some time. Even the time you’ve spent creating things that no longer apply to your new dream helped you become the person you need to be in order to accomplish your dreams. \n\nAllow yourself to be filled with love as you create your dream. The emotion of love will be very helpful in putting forth the effort and energy required. Love can make the most enormous obstacles seem as if they are capable of being solved. Love will ensure you maintain your focus and do not waver in the face of negativity. Seeing your dream take shape should fill you with great love which you will then continue to invest right back into your dream. Always remember to stay in love with the process of creating your dream. \n\nAs your dream nears completion, you will begin to gain faith that all the love you poured into it is worth great value. It is very easy to see our own creations through rose-tinted glasses. It is important to maintain an open mind about what others think about your creation. Others will be unbiased, as they have not invested so much love into it. Listening to constructive criticism as the project nears its conclusion is necessary to ensure you create the best possible version of your dream. Take their feedback into your mind, but not into your heart. \n\nWhen you come to a crossroads and are not sure of what decision to make, always follow the path your heart wants to take. Take the path of the heart will guarantee you are staying in line with your dream. Your heart always knows what is best. Your mind always thinks it knows what is best, but it is not as good as the heart at creativity. In order to see if something is in alignment with your heart, simply sit with the intention to connect with your heart for 3 minutes. Then, ask your heart how it feels about a particular choice. You will notice a great difference in the result when your heart is in love with a decision versus when it is not. Always rely on the judgment of the heart when making a decision of great importance. \n\nGoing the distance to fulfill your dreams can fill your life with great love, joy, and fulfillment. All the time and energy spent will seem worth it if you can see the project through to its completion. Doing so at the beginning will seem like a mountainous challenge, but by the end you will learn that the process of creating your dreams is truly very enjoyable. The process itself will help you learn so much, and the experience you gain will be with you forever. Seeing the project through to its conclusion will give you something that can never be taken away: the satisfaction in having made your dream a reality. The process was complicated but worth every second. Going the distance to fulfill your dream is the best thing you can do for yourself in life.\n\nFor more content and a self-belief meditation, checkout [lifechangingmeditations.com](https://lifechangingmeditations.com).  Self-belief is what enables you to create your dreams.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g801ex/going_the_distance_to_fulfill_your_dreams/", "title": "Going the Distance to Fulfill Your Dreams", "social_network": "reddit", "user": "StreetParticular8", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1587844184, "permalink": "/r/DecidingToBeBetter/comments/g801ex/going_the_distance_to_fulfill_your_dreams/", "nsfw": false, "first_save": 1635436722.5926921, "replies_charged": false}