{"id": "t5_2tand_t3_msl89n", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "How do you tell the story of your life? I've been sitting with this one for a long time...\n\nStories are pretty much ALL we have (and are and ever were). Nearly our whole existence is based on storytelling. So I think looking at the trajectory of our lives in this way can be liberating and also a positive tool for change.\n\nThe way we speak to ourselves about ourselves is important. We must be thoughtful and intentional about the beliefs and ideas we have about ourselves, our potential, the state of our lives, and the possibility of our futures. If we're not constantly revising our stories, then we run the risk of being stuck in a narrative that is no longer relevant to our lives/no longer serves us. Rewriting my narrative and being transformed by it has inspired me to invite and encourage people to reinvent/rewrite/throw away the stories that are simply no longer serving them. Sometimes, we just need somebody to give us permission. Consider it granted :)\n\nAnd for anybody who needs to hear it: I promise you can still remember and feel your pain (and feel it HARD) but please don't choose to *live* in that story. Don't form a relationship with the source of your pain - if it hurts, it won't make a very good companion. Don't identify with the thing you're trying to get away from. You are not that anymore. Please don't let \"that thing\" (whatever it is) claim more of your life than it deserves.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/msl89n/psa_youre_allowed_to_rewrite_and_revise_your/", "title": "PSA: You're allowed to rewrite and revise your personal narrative... What's the story you tell yourself (and others) about yourself?! And are you happy with that story? (BE HONEST!)", "social_network": "reddit", "user": "nastyyynico", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1618639147, "permalink": "/r/DecidingToBeBetter/comments/msl89n/psa_youre_allowed_to_rewrite_and_revise_your/", "nsfw": false, "first_save": 1635436980.9703398, "replies_charged": false}