{"id": "t5_2tand_t3_h8sdcs", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "TL;DR people freaking scare me and I can’t handle confrontation even on the internet, and it’s gotten ridiculous. But I know I’m capable of being the outwardly strong woman I am inside. I just want to know how to get past such social anxiety and such a fear of confrontation.\n\n\nThrowaway cuz anxiety. I’m oversensitive. A wimp. Whatever you want to call it. I wasn’t always this way, but I guess years of verbal abuse and having your self esteem worn down can change a person. Anyway, I’m not posting this for pity. Hell to the no. Rather, I just want to be able to fucking handle ANY kind of confrontation or interaction that isn’t super pleasant and agreeable, both online and especially in person. It’s gotten to the point where I just lurk on my main account, not only because I don’t have much to say, but also I just fear that feeling of rejection, which is ridiculous something as insignificant as a downvote button or a troll comment could cause. But it does. I am *so* ~~admirable~~ admiring of the people in my life who are so outspoken and confident in potentially tense circumstances. I share those same values, the ones where I stand up for what I believe in, it’s why I write music and write so passionately; I guess it’s easier to express myself that way. But when it comes to any sort of clash, conflict, or even a *hint* of just plain meanness, I curl up into a metaphorical ball inside. \n\n\nLike, even if I do post something, I’ll immediately exit out of Reddit for at least a few hours in fear of facing potential assholes. When I log back in and see I have unread messages, I literally squint and hover my thumb over the text, only revealing one word at a time to determine whether or not it’ll be a nice comment or a mean one.\n\n\nIsn’t that dumb? I’m an almost 25 year old woman, and people still fucking scare me. I fear confrontation because I fear conflict, and I fear conflict because I fear being yelled at, belittled, and/or disapproval/not being enough. Obviously this stems from an entire childhood and adolescence with a verbally abusive parent, but the point is, I’ve been on anti anxiety and anti depressant medications since January. While the depressive symptoms have gotten better, I’m still very anxious, *especially* when dealing with people.\n\nI *know* people are just people, words are just words, trolls are bored cynics who thrive on this kind of effect their hateful words could have on someone like me, and they don’t deserve that satisfaction. What matters most is sticking to my beliefs and thinking strongly for myself. I know all of this. Yet when a circumstance arises, all of that goes out of the window in my brain and I just become this small, silenced little girl again who is terrified to speak up for herself or that she might do the wrong thing. Or who feels she’s just not enough, everything she may say or do is wrong.\n\nHow can I work through this and change this part of who I am?\n\n\nThis sub is pretty cool so I think I’ll stick around for a few before succumbing to the anxiety and disappearing, but I’ll be back because I would really appreciate any advice!\n\nE: yep I’m gonna be that person adding an edit hours later because holy shit guys. I really didn’t expect this to get much traction, just maybe a reply or two and that would’ve been okay with me! But the amount of advice, encouragement and empathy I’ve received feels so good. I’m a bit overwhelmed with all of the comments so I apologize if I don’t reply but I will read *every* single one with gratitude, and on the off chance there are any naysayers here or in the future, I will just keep my head up and shrug the comments off as I block em :) anyway, sadly therapy is very expensive here in the US of A, even with my insurance I’ve got to reach my (high) deductible before anything is covered. BUT, obviously medication alone isn’t helping and I’d like to overcome this no matter what so I’ll be looking into siding scale Psychologists for some CBT. I’ll also be checking out ALL of the literature you guys suggested. Seriously, this is the shit I’m here for in life. People just being decent people to one another. Thank you all!\n\nE2 a day later: hello so I coincidentally posted this while in the midst of a *butt load* of school work, as I’ve just started back in college after taking a few years off :) I’m reading *every* single comment (and re-reading/saving quite a few) because they have been such a comfort and reassurance. You guys are, in short, fucking awesome. Thank you. I’m currently beating myself up (just a tiny bit) for not taking the time to respond to each of you lol because that’s how my brain works, but know I’m super grateful and also happy to know others could relate. If my post resonated with you, please read these responses (or perhaps even your own). You deserve/owe yourselves better, just as I know I do as well. Be sure to take care of you! Good luck!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/", "title": "My social anxiety is so bad, if ever I make a post or comment I exit Reddit immediately because I can’t take the mean comments. I’m a people pleaser to a fault. I want to completely change this part of me.", "social_network": "reddit", "user": "anothrrthrowawayy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3434, "down_vote": 0, "creation": 1592135044, "permalink": "/r/DecidingToBeBetter/comments/h8sdcs/my_social_anxiety_is_so_bad_if_ever_i_make_a_post/", "nsfw": false, "first_save": 1635437666.7465339, "replies_charged": false}