{"id": "t5_2tand_t3_ovzgrn", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "1a213df6-3f71-466c-9762-ace119e0102e"], "text": "For the past couple years, I have been in a constant whirlwind of trying to decide and understand who I am, what makes me happy, where I belong, and fighting the true melancholy of a mid-twenties identity crisis. I come from a long line of “bury your feelings and pull yourself up by your bootstraps” mentality, and not to point blame or say there is anything wrong with that approach, I have just always found myself to be very different when it comes to communicating what I experience or see in life. No one I grew up around talks about the internal turmoil and questioning everything from how you were raised, who you want your friends to be, or if you even like yourself.. all things I have come to grapple with in the years following college.  And all things that in my family finds uncomfortable to talk about. So I used to always feel isolated or labeled as the “different” or “sensitive one”, even in my friendships and relationships I took on the identity of having to pull back so that I wasn’t “too much”. But I started to make a shift in my mindset 3 years ago, which since  has led me on a self-discovery journey to better step confidently into my full self and do the things that will create the life I want. \n\nThe last straw that really drove this shift in mindset happened two years ago, I went through a break up that left me with all my worst fears coming true and pushed me to take a look around. I took a good look at the people around me and my environment, and questioned out of all of the inputs in my life, what impact was it having, and did the inputs match what I wanted for the future? Did they bring me fulfillment or leave me feeling emptier? For my age at the time (24 F) I was a couple years into a great career, but was not focusing as much on that or growth, because I was more concerned with fitting in the mold of where I was and the crowd I was hanging out with.  When I did my quick inventory there was a close friend I had made when I first moved to Texas who I genuinely enjoyed and felt lighter after being around, and a few very new friendships at work. Other than that I was left with surface level friendships, a broken relationship, and not a clue for what I truly wanted. So I walked away from that relationship and stopped asking someone to be with me who didn’t want to be, I removed myself from that situation and friend group because I decided I would rather be alone than sit in that any longer. \n\nI moved out of the suburb I was living in, and into the city, I started focusing more on my work and growing my career. I spent majority of my time working out and with my two closest friends, filling my cup up with authentic conversation and quality time. I forced myself to sit in silence and spend weekends alone, which is what I feared the most, I was scared to be alone with myself. In that alone time, I took time to really get to know myself. I did values work and learned how to focus my life on what brought me fulfillment and kept me grounded. I also focused on journaling and keeping a record of my daily thoughts and gratitude. As time went on, I felt less lonely and started to crave time by myself, and even started to see progress at work with stepping outside of my comfort zone and taking on more responsibilities, and eventually getting promoted.  Fast forward to now, post quarantine, and I have since been promoted again – now leading a team of 8 people at 27 years old. Found the love of my life, met him by agreeing to play indoor soccer (never played soccer before in my life), and now starting to draw healthy boundaries with my family and continue grow and shape the future I have always dreamed of. \n\nSome things that really helped me get here- getting  back into self-help and growth podcasts, books, seeing a therapist, journaling, moving your body at least 4 times a week. Making the conscious decision to step into my strength of communicating what I see in life and not living in fear of being too deep or complicated, knowing I could find people who wanted to find what I had to offer in a friend or partner. And the two sayings that helped me most through this 3 year journey “You are the sum of who you spend your time with” and “we accept the love we think we deserve”. It has been a journey, a tough road traveled of constantly putting myself out there and choosing to do the hard things, but overtime these shifts start to make a big difference in the overall picture. If I can do it, you can do it too! We can do hard things! I'm rooting for you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ovzgrn/two_things_i_have_learned_over_the_last_3_years/", "title": "Two things I have learned over the last 3 years - Do hard things and love yourself.", "social_network": "reddit", "user": "jbertus93", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 104, "down_vote": 0, "creation": 1627849069, "permalink": "/r/DecidingToBeBetter/comments/ovzgrn/two_things_i_have_learned_over_the_last_3_years/", "nsfw": false, "first_save": 1635436698.734592, "replies_charged": false}