{"id": "t5_2tand_t3_aytq02", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707", "311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "Sorry in advance for the length, but I could really use some support here. \n\n# Brief background: \n\nI was born to a single, homeless, junky mother and basically buried my head in textbooks until getting a degree and a good paying job. I’m now 30, married, and stable, but I have no clue what a typical lifestyle actually looks like. I feel completely aimless now that I’ve secured a good job. I spent all my time studying and reading and haven't developed any hobbies or friendships, and I keep my family at a distance because they are unmistakenly toxic. \n\nBy all accounts, I'm doing very well in life: Perfect health, wonderful marriage, healthy salary, and a homeowner in California (which is very rare for my age group as most have been priced out). I've certainly achieved all my lower order needs in life but it's the higher order needs that have me stumped. I've effectively been living the same week over and over for years now and it's making me depressed.\n\n# Problem:\n\nMy life is stuck on repeat and have no plans for the future and because I have nobody in life, I'm lacking frame of reference for how to plan my life. \n\n# My Approach:\n\nTo solve my dilemma I decided to start by defining my values so I can begin forming goals around them. \n\nAfter tremendous amounts of self reflection (I've been an avid journalist for years) I have devised the following list of values, to which I've annexed to each a short precept to capture the full meaning, in the hope of bringing more clarity and purpose to my life.\n\nI'm still developing goals around these values, but I wanted to check in and ask if I’m approaching life correctly here, or if perhaps I’m way off track. I don’t have anyone in my life, and so I’m lacking perspective on what's normal. \n\nOnce I develop goals I plan to begin prioritizing them, scheduling them, and completing them. I just want to ensure I'm not headed down some weird rabbit hole without knowing it.\n\n**MY VALUES**:\n\n**Liberty** \\- To choose how I live and behave, and help others do likewise. - *\"Be yourself.\"*\n\n**Respect** \\- To be respectful towards myself and others; to be polite, considerate, and show positive regard. - *\"Give respect to get respect.\"*\n\n**Curiosity** \\- To be curious, open-minded and interested, to explore, discover, and collaborate. - *“Ask good questions.”*\n\n**Community** \\- To be part of a system, to cooperate, collaborate, and build a sense of connectedness and support. - *“It takes a village.”*\n\n**Order** \\- To be organized, let all thing have their places; let each part of your business have its time. - *\"A place for everything and everything in its place.\"*\n\n**Prosperity** \\- To thrive and flourish in health, happiness, relationships, and work, and to help others do the same.  - *“A rising tide lifts all boats.”*\n\n&#x200B;\n\nThanks to all who have read this far. I appreciate any and all feedback. Cheers. \n\n&#x200B;", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/aytq02/feeling_adrift_and_could_use_some_guidance/", "title": "Feeling adrift and could use some guidance.", "social_network": "reddit", "user": "MisterSilenceDogood", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1552070651, "permalink": "/r/DecidingToBeBetter/comments/aytq02/feeling_adrift_and_could_use_some_guidance/", "nsfw": false, "first_save": 1635436555.6633756, "replies_charged": false}