{"id": "t5_2tand_t3_l8bdje", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "Letting go is something I’ve strived for so many times before. I’ve said “let it go” before, and I’m sure I’ll say it again with the best intentions in mind but I’ve finally come to the realization that focusing on letting go keeps me holding on. Oh, the irony of life, amiright? \n\nI’m sure if you scroll through my posts you’ll see me talking about letting go, and I’m not going to pretend it’s not a practice I’ve tried to stick to. I’ve burned pieces of paper with lists of things I’m “letting go of”, I’ve done the ceremonies focused around letting go, I’ve set intentions during yoga practice to let what isn’t serving me fall away forever, and then, the things I wished away stayed. \n\nI’ve found through my journey that focusing on getting rid of something: whether it’s feelings, expectations, moods, thoughts, habits, whatever- always leads to me somehow gripping to it even tighter for some reason. When you make something bad, or forbid it, it becomes this thing you need to hang onto. \n\nI’ve found this true in so many ways, whether it was in my addictions to adderall + nicotine, unhealthy food mentality, relationships, victim mentality, anxiety, depression, emotions that just wouldn’t “go away”, I could name a million different situations in my life that I constantly wants to “let go of” and as hard as I tried, I just couldn’t. \n\nOne day, I stopped fighting to let go. I accepted my addictions. I accepted my mental health (or lack of it at times). I accepted the thoughts and habits that had led me to the moment. I accepted the grief I once wished would go away. I accepted the feelings that were coming up that I didn’t want to feel. I accepted my body. I accepted my situation. I just accepted my present moment as it was and realized that I was surviving with all of the things I thought I needed to let go of. \n\nI truly feel that we don’t just magically let go of things. Time passes and we learn to live with certain situations. And in terms of the addictions to adderall and nicotine, I accepted that was my situation and I would feel uncomfortable feelings when I stopped taking them. I didn’t let go of addictions or habits or feelings, I accepted they were what they were and I had a choice in what I decided to do with that fact. \n\nLetting go always seemed like this impossible task and I think often it is. We don’t let go of grief. We don’t let go of pain. We learn to live with it, and with that realization I understood it had less power over me and my actions than I thought it did. It became a back seat passenger in my life instead of the driver. \n\nI’m here to say maybe it’s time to stop focusing on letting go and just focus on accepting where you are and adding things you want instead of fighting what you don’t want. I’ve realized all emotions have purpose and they’re not meant to be let go but felt, and in that feeling, like the true duality this life presents to us, it’s grip on us lessens immensely. \n\nI know what it’s like to hold on so tightly to everything. I know what it’s like to feel like I have to just let everything go and the pressure that came with the realization that I didn’t even know how I could possible do that because it literally was out of my hands. \n\nIt’s time to focus on what you can do instead of forcing clichés like let it go on yourself and others. I’ve learned saying this actually is invalidating my and others’ experiences causing me to hold on even more. \n\nLetting go isn’t a choice. It happens over time sometimes. Sometimes it never does. So instead of working on letting go, work on accepting what is. And see where you can go from there. \n\n_\n\nTLDR; \n\nIt’s time to focus on what you can do instead of forcing clichés like let it go on yourself and others. I’ve learned saying this actually is invalidating my and others’ experiences causing me to hold on even more.\n\n_\n\nEDIT: hi friends! I keep trying to reply to all your comments but it keeps just commenting on the thread so I see you and honor your beautiful and important contributions to this post <3 thank you thank you thank you !", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l8bdje/instead_of_focusing_on_letting_go_focus_on/", "title": "Instead of focusing on letting go, focus on accepting what is.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1318, "down_vote": 0, "creation": 1611973209, "permalink": "/r/DecidingToBeBetter/comments/l8bdje/instead_of_focusing_on_letting_go_focus_on/", "nsfw": false, "first_save": 1635435394.3264825, "replies_charged": false}