{"id": "t5_2tand_t3_ciw0zx", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": " \n\nMany times we create plans, To-Do  Lists, Weekly Goals and monthly goals, but in the end we don't make it,  for some do one or two tasks, and some aren't able to complete even one.  Well I'm one of those who aren't able to do even one. But something  happened, I changed something and it works now, I completed 1/3 of my 4  month goals list ( that was supposed to end this November). How did I ?  Here's how :-\n\nI guess, everyone  makes a plan and it didn't go the way it seems  to be. Well that's okay!  It's just the beginning. People go crazy even if they aren't able to  achieve all things in a to-do list. Or for some (me included) who don't   make it to the first task. That's not important, the important thing is  learning that this will happen, this is normal. We don't have to take  it seriously, take this for example :- Ever played a game before ? How  may deaths/Mission Failed you see until you get to the end of the game ?  My answer :- I don't know, no matter how hard the mission seems to be, I  try again and again, until I slay the beast!\n\nThat's  the approach I want you to follow, The Game isn't over if one such  month gets wrong.The Game isn't over of the week goes wrong ! The Game  isn't over if the day goes wrong! Just keep on mate.\n\nThe Approach I want you to follow / That has helped me,\n\nFirst,\"Not My First Attempt, but not the last either\"\n\nWell  mostly we think that whatever plan we make, we'll simply will be able  to complete it in one go, no it doesn't have to be this way. If you can  do it great! But not, then don't fret, no self-abuse, no negative talk,  nothing. It's not going to be in your first attempt okay! Then how many  will it take, five, ten, thirty ? I don't know and you don't either,  mabye it's the second one, maybe it's the tenth. Just don't focus on the  first one only. Even the best athletes try out tens of thousands of  time to get it right at the Olympics, nobody has done it in their first  run. Well, then it's worth trying second and third time.\n\nSecond, \"The Game Isn't Over Yet!\";\n\nMany  people feel that One bad day is all it takes to destroy the city, Wake  the F up man!! This isn't some thriller movie, this is life, One Bad or  One Bad year, Oh no no no . . ,It doesn't matters. What went wrong, okay  it was supposed to, I'm only human, I make mistakes, No bad thing.  Let's do this again, The Game Isn't Over. One Bad week, okay never  matters, here am I, I'll do this again. The Game isn't over. One bad  thing after another, my life is a mess, I'm worthless, I can't do this  anymore, this ain't my goals. All the negative talk keeping you away  from your goals ? Ah, H no! This is all BS, nothing else. Remember how  you felt when you were making such big goals? Amazing right? It felt  like if you can achieve this then you can achieve anything else. Then  for that feeling, Remind yourself \"The Game Isn't over.\" At times we're  faced by monster of level 30 while we are on level 17.But if this was a  game wouldn't you have tried ? (Witcher 3, Skyrim, ... Remember ?). Try  again.\n\nThird \"Work is boring, Accept it! But it's worth it.\";\n\nMost  people have the tendency to quit as soon as they find things getting  boring, not hard but boring. And this is what kills the dreams, because  the phone next to you, the (Whatever is it) seems more interesting than  work. Well to be honest, yes this is boring and accept it. Life's not a  swashbuckler action movie. Accept it. But this doesn't means that it'll  remain the same.Things will get better, and the dreams will take you to  places more amazing that you haven't seen in a movie. So, grab the chair  sit onto the table and start grinding. Or start to the gym, if it feels  like it's boring, So what? I didn't joined it to get entertained. I  joined it to get bored, so let's get bored. Learning seems boring? So  what, I started it to feel boring, if it weren't boring then why would  we had the TV, the Phones, the What so not for entertainment. Accept the  boring stuff, and do it in order to feel bored. If life wasn't as  boring as it is, the TV Shows etc. wouldn't have been invented and we  wouldn't be able to see the Avengers:Endgame either, so accept the  boring stuff!\n\nFourth, and this is more dangerous \"Evil's soft first touches!\";\n\nAt  times while working, playing, or whatever we want to do, we start to  feel overwhelmed, or we just don't feel like it, or we are just too  tired for that workout. Great, everyone had experienced this, And I call  this as Evil's soft First touches, first it seems harmless to quit on  this, Why? \"Not my first attempt though, I'll start tomorrow again, the  game isn't over yet!\", you just said that. But wait here, I'm talking  about something evil here, imagine something like dementors from Harry  Potter, or whispers from the evil soul beneath the earth,or even The  NuN, (It sounds funny, I know. Just Imagine). What you feel are the soft  touches of evil, answering to calls like this can have greater  consequences in the future. This is the start to the path to  procrastination, the path to the pejorative-mindset, and this is the  same path that leads to higher sins like murder, drugs, just the soft  touches will take you to somewhere else. People answering to evil's call  will suffer, and they have. Just turn on the news. This is not  something I'm joking about, If you want to become better, you will have  to fight the greatest enemy life has to offer, The LEVEL :100 \\*\\*YOU\\*\\*,  Evil's touches aren't some higher godly thing, but your own voice. So,  beware mate. What I'm saying is true, turn on the news and you'll find  such psychopaths commuting crimes, as they succumbed to evils soft  touches.\n\nSo, how will you fight the evil within ?\n\nHeard  of No Zero Days? Yeah, that's it. This is how you'll fight the  whispers. But more in your own way. Say  you don't want to learn  something today, okay!You don't feel like it. But, how about only one  new word from another language with it's meaning, just one word, how  about only one Math problem. Phone is there, google search and here you  are, you've done it, find a paper and find a problem and do it!. Don't  want to go to the gym, too tired ! Okay just 5 squats that's all, no  changing clothes none, get out of bed, do 5 squats, and then get back.  If clothes are too tight you can do wall sits, I do that often, find  ways so that things keep on happening. Just this is it! I'm trying these  methods and it has done a great deal in life.\n\nRemember:-\n\n1.Not My first attempt, but not the last either.\n\n2.The Game isn't over yet, keep on trying.\n\n3.Work is boring accept it, but it's worth it.\n\n4.Beware of Evil's first soft touches, don't succumb to them.\n\nHave a good day !!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ciw0zx/for_all_those_who_have_created_plans_and_failed/", "title": "For all those who have created plans and failed, this one is for you.", "social_network": "reddit", "user": "Samurize17", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1564321809, "permalink": "/r/DecidingToBeBetter/comments/ciw0zx/for_all_those_who_have_created_plans_and_failed/", "nsfw": false, "first_save": 1635438300.285185, "replies_charged": false}