{"id": "t5_2tand_t3_kcxoqp", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "9ad14901-6d2f-44f9-8b16-48a4f40b66ab", "802203c7-ca80-4c23-ad08-f571694cfc55", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "I've been thinking a lot about this question and wanted to share with you what I came up with. Hope it's helpful! I'd also love to hear your views on the question!\n\nMy thoughts were mostly triggered by reading \"Personality isn't permanent\" by Benjamin Hardy and his key point, that who you are is not a result of your past, but a forecast of who you want to be in the future.\n\nIt's a very empowering and anti-deterministic argument. If it's your view of the future that shapes your personality, then you can change who you are. Instead of \"finding yourself\", you can go out there and \"make yourself\". Take this seriously and all of the sudden, you gain a whole lot of options and lose a bunch of excuses for not pursuing something because \"It's just not who I am\".\n\nI love the idea.\n\nOne question though: how do you stay happy along the way?\n\nDeciding on a vision for your life seems like an ambitious form of goal setting. And while there's big praise for goals, they have also been linked with negative impacts on your well-being.\n\nIt's a debate that has been going on for while.\n\nAre goals the key to success or a one-way street to sadness and stress?\n\nCan systems give you the results you want or are you a headless chicken without a goal to strive for?\n\nGoals vs. Systems. Output vs. Input. What's your pick?\n\nI was quite torn. The systems idea seemed so obvious. Of course, you should not just live for some future goal and sacrifice your present happiness. And I've experienced often enough the drop of motivation that comes after achieving a specific goal.\n\nBut just the same, goals undeniably create the accountability that a stand-alone system lacks. And don't you risk aimlessness and a lack of self-determination, if you don't work towards a goal?\n\nThere were two options as far as I could tell.\n\nWe either have an unsolvable question.\n\nOr the wrong one.\n\nI'm now pretty sure it's the latter.\n\nBut before we come to that, what exactly are goals and systems? Here's a quick overview:\n\n# Goals\n\nA goal is a singular event that is either true or not. It's binary. There's no uncertainty whether it was reached or not - if there is, then you didn't specify it enough and it's wishful thinking, not a goal.\n\nExample:\n\n* \"Score A- or higher on the test next week\" is a goal\n* \"Do well on the test next week\" is wishful thinking\n\nIt's also momentary. A goal will always be either in your past or in your future.\n\nThere are a lot of frameworks for goal setting and the theory behind them has seeped deeply into our work culture. Earning targets, Personal Performance Scores or required billable hours are just some representations of the goal focused culture of management theory.\n\nGoals are the output of your work.\n\n# Systems\n\nA system is a continuous, holistic process. It consists of smaller building blocks. In this context, these building blocks are your habits. Systems are routines - things, that you do over and over and over again.\n\nSystems are repetitive by nature. And they are are active. The habits that form your systems are actions that work together to create your movement, your progress.\n\nExample:\n\nA simple system for \"Exam preparation\" could contain:\n\n* wake up at 7:30 every day\n* sit to revise material in the morning for 2h (using Active Recall)\n* Work in batches of 4x25 minutes (using Pomodoro)\n* write mock exams in the afternoon for 3h\n\nSystems are the input of your work.\n\n# Question: Goals or Systems?\n\nThat was my initial question.\n\nBut what if I had it wrong all along?\n\nIt's not goals or systems. It's goals + systems = x. They are two sides of a triangle. And the third one is vision.\n\nA lot of problems arised from my first though, where I confused a goal with a vision. They are different though. A goal, as we have seen, is a singular event that we know to be either true or false. It's a milestone. A milestone on a journey where we progress using reoccurring behaviors (systems). And it's destination is our vision.\n\n>Goals + Systems = Vision\n\nThink of it as a journey. You're all ready to go. Backpack is packed, plants are watered and the fridge is empty. Out the door and on your way.\n\n**Where are you going though?**\n\n→ you need at least a rough idea of where you want to end up - that is, if you want to have a self-determined journey. Otherwise, you'll just follow a bunch of people around and end up where they were heading to, not where you want to be.\n\n**Which way are you taking?**\n\n→ Once you figured out your destination, you should think about the way. What's on it? How will you know down the way whether it's still the path to your destination or not? It's the milestones along the way that will ensure you: you're on track.\n\n**How are you getting there?**\n\n→ Ultimately, you need to walk the walk. No way around it - we still can't beam ourselves (why don't you work on that Elon Musk instead of Tequila?!). And walking is repetitive. It's doing the same things over and over again. Things that you know will move you along your journey. It's step by step. Step by step.\n\n# My answer: Goals AND Systems (and a Vision!)\n\nNone of it works without the others.\n\n**Goals + Systems** are just arbitrary without a vision. Which system do you pick? Which milestones do you look out for? You just can't pick them. Or better: picking them at random doesn't mean you don't have a vision. It just means you didn't think the vision through and now you'd better hope that the unconscious vision aligns with what you actually want.\n\n**Goals + Vision** are a recipe for disaster. You know where you want to end up and what to look out for along the way. But without a system to get there, you have no agency over reaching either one. You're dependent on the whims of people and things around you to maybe carry you to the right point. Again, it's the opposite of a self-determined journey.\n\n**Systems + Vision** might work the best of any 2s, but it's still suboptimal. Sure, walking until you reach a destination is possible. But unless it's a straight line and you happen to hit the right direction from the get go, you might as well walk in the opposite direction for all you know. Maybe all roads lead to Rome. But why risk it? Goals are the milestones that let you know: this is the way. Trust in Baby Yoda.\n\nThat's why I believe: it's all three of them, or you're on autopilot to nowhere.\n\nHow's a vision different to a goal?\n\nI had it wrong. Having a vision is not an ambitious form of goal setting. A vision isn't something binary like a goal. It's also not some continuous process like a system. Instead, it's your reflected and conscious view of the future.\n\nAnd it's always your view of the future.\n\nThat means, you'll never catch up. It's not something to tick off your list. Maybe McConaughey described it best in his Oscar speech:\\~\\~\n\nWho's his hero? Himself in 10 years. Always. He knows he'll never catch up and that's ok with him because it gives him something to chase.\n\nYour vision is there to direct you. It gives your goals and systems context. Your vision is the context of all your other decisions.\n\n# Where to start?\n\nSo that's my answer to the dilemma that arose when I was reading \"Personality isn't permanent\". How do you balance having a vision for your life with being happy in the present?\n\nBy knowing you're on the right path thanks to the milestones along the way and by trusting in your systems to create progress. And by accepting that your vision is not something to be achieved, but something to be renewed, time after time.\n\nWhere to start though?\n\nIt should already be clear that you can't start by setting goals. A goal in itself is pointless. It's completely arbitrary. Think of it:\n\nImagine, your navigation system would constantly congratulate you for reaching a certain city or complain about not passing by one - even if you haven't picked a destination. Unless it's the places on the way to where you are going, this information is useless and distracting.\n\nSo first rule of fight club: no goal setting without vision\n\nIt's less obvious when it comes to systems. It would be ideal to have the vision, when you adapt a system - but sometimes a vision is just so hard to clarify. That's certainly true for me.\n\nSo in the meantime, it seems like a fine compromise to me to just pick a random system that produces generally healthy outcomes. Random progress seems better than standing still.\n\nWhatever system you pick as a placeholder needs to have one element though: reflection.\n\nReflection is your safeguard to ensure that you keep working towards having a vision. If working on your vision becomes part of your ongoing system, then you'll probably know at some point: This is the way.\n\nThat's it! Writing helps me clarify my thoughts, that's why I had to spell it out for myself and thought: why not share it? I share those things on my blog and here on reddit and hope, that you can maybe also take a bit away from it!\n\nSo what do you guys think of it? Do you rely on systems or goals? And do you have a vision?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kcxoqp/how_do_you_balance_having_a_vision_for_your_life/", "title": "How do you balance having a vision for your life with being happy in the present?", "social_network": "reddit", "user": "MFreihaendig", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 38, "down_vote": 0, "creation": 1607952798, "permalink": "/r/DecidingToBeBetter/comments/kcxoqp/how_do_you_balance_having_a_vision_for_your_life/", "nsfw": false, "first_save": 1635435220.0316582, "replies_charged": false}