{"id": "t5_2tand_t3_ji1arv", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": " \n\nHey guys I don't usually do this but I've completely reached my threshold where i just don't know how much more I can take. I don't really have a plan for how I'm going to write this and I have serious ADHD so excuse me if this comes off as ranty. I'll probably post in a few subs so if you have any suggestions on formatting or details to add/subtract i'm open to suggestions lol. A lot of this is probably just typing out my own thoughts for self therapy but let's see what happens.\n\nI'm 25 and in university still and I really think I've destroyed my life beyond my own abilities to repair. Here's what's going on.\n\n**Let's start with the good in my life: these are the things that I am proud/grateful of and basically the reasons why I have any interest in salvaging my life in the first place**\n\n\\-I've had a girlfriend for 6 years. We will very likely be together for life and get married at some point, we are basically engaged but I can't do that until I get my life on track. She's a wonderful person. We have a very strong relationship but sometimes I don't want to talk about my internal struggles because I'm insecure or something (This part seems stupid to type but it's harder in real life to just talk about mental health problems to real life people than many admit online). I've always been a rock for other people and I don't know to what extent everyone else knows my struggles.\n\n\\-I have a roof over my head, I'm able to feed and clothe myself, and a strong enough support system that I probably won't go homeless no matter what. I am very close to my siblings and family members.\n\n\\-I'm in school for materials engineering (though this is also a problem as I am doing incredibly poorly).\n\n\\-I am in pretty great shape and health, I could probably finish a marathon tomorrow if I had to at some pace, maybe not fast lol.\n\n**Now here's where the problems start**\n\n\\-I have a strong video game addiction. I've tried to deny it for years but looking back it has COMPLETELY sucked me dry of all joy/ambition in life and ruined what should be some very good, productive years of my life. It's not any specific game, it's a form of escapism I think. I play 5+ hours per day easily sometimes, even when i have responsibilities. I push all of the things I need to get done back as far as I can every single time. This leads to poor quality of life and poor quality of work in school, while being stressed the whole time about all of the things I need to get done.\n\n\\-I've been a terrible student. In high school I could get by on my own smarts without having a good work ethic. I'm one of those \"formerly gifted\" types that always was told how smart I was and how I had to grow up to be a doctor or engineer or lawyer (I'm not sure I even want to be anything like that but here we are)\n\n\\-I am a complete mess financially. I cannot emphasize this enough. I took a year off of school because I owed my school 800 dollars for tuition. This was on bad advice by my school's financial aid office, they didn't tell me that my student loans would be due if I did this. I now have the government sending me scary emails about paying back my loans now and I am too scared to call them, I don't have enough money anyway since I live paycheck to paycheck, if I'm lucky\n\n\\-I've been in school for 7 years. I'm set to graduate next year if I pass all of my classes and be a good student but I've failed at that this year so far. It's probably not too late to repair my current semester if I email my professors and ask for some lenience. I have missed some assignments due to working a shitty job, and just being a generally lethargic and bad person. I feel like a fraud because I'm finishing up a degree for which I feel like I've learned nothing and it is REALLY becoming a struggle in this final year because I think I've somehow cheated my way through university, just BARELY passing everything. If i didn't have pressure from my grandma/parents who don't really understand the gravity of the situation, I'd just drop out and be poor for the rest of my life lol. (I like my program but I feel like I have completely screwed up my education beyond repair)\n\n\\-I walk around in a complete haze 24/7 out of anxiety and depression, my mind never gets a rest at all. I use video games as an escape, but even if I quit those I'll probably just find something else to run to. I have suicidal thoughts (at least once per day). Suicide is out of the question because I have too much at stake and too many people depending on me, If I ever lost my girlfriend I'd probably call it quits though I'd never tell her that. I wouldn't say I'm at risk for suicide but people will do anything if backed into a corner far enough.\n\n\\-My sleeping habits are the stuff of nightmares. I don't go to bed at any specific time. Sometimes itll be 7 am, sometimes 11 pm. This really affects my ability to actually go to class (or in this case watch virtual lectures) and leaves me tired all of the time.\n\nThis got a little bit dark but I need some kind of hope, some encouragement, advice or whatever. I plan on quitting video games cold turkey, setting up a proper work station and grind out real life xp instead of wasting my time on stuff that will never actually count for real life progress. If anyone has any idea on where I should start, or any subreddits that can help me out in more detail or whatever, I don't really know what I'm actually going with this. Thanks friends!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ji1arv/ive_backed_myself_into_a_corner_primarily_from/", "title": "I've backed myself into a corner primarily from video game addiction (m25)", "social_network": "reddit", "user": "WayMundane", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1603660322, "permalink": "/r/DecidingToBeBetter/comments/ji1arv/ive_backed_myself_into_a_corner_primarily_from/", "nsfw": false, "first_save": 1635436869.8340473, "replies_charged": false}