{"id": "t5_2tand_t3_n9yl6v", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "So I've smoked since I was 15 years old, 20 years ago. I just had a daughter 5 months ago, and she's not the easy going, calm type of daughter, she is the get outta my way, head strong type of daughter. I know she is going to be a handful. I noticed I would cough and it would startle her and I had trouble staying quiet when she was trying to sleep. She's just about to crawl and I know soon as she is mobile, she's going to take off. I don't want to not be able to keep up with her, and I definitely don't want to leave this earth before I've seen her grow into a young, beautiful woman. So I decided I was done with cigarettes.\n\nI didn't realize what was in store. I've only taken a couple hits off of one and put it out, not smoking but maybe 2-3 a day for this past week. I don't even like it when I'm indulging my stupid self with this. I started getting the worst head aches and pressure from my diaphragm up, and confusion and dizziness. It's day 8 today and yesterday was horrible. I felt a release in my lungs though and I got some good sleep last night. Woke up today feeling so much better. It might sound dumb, but I had no idea cigarettes had such a hold on me till I was going through this awful withdrawal. I thought, oh I'll put them down and I'll mentally have cravings and just have to fight away the urge. I didn't know I was going to get physically sick from it. Like I said dumb, I know, but it is so much better today and I can't wait to be completely out of this and away from the smoke cloud I put around myself for so many years.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n9yl6v/first_week_of_quitting_smoking/", "title": "First Week of Quitting Smoking.", "social_network": "reddit", "user": "JMCochransmind", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 61, "down_vote": 0, "creation": 1620744179, "permalink": "/r/DecidingToBeBetter/comments/n9yl6v/first_week_of_quitting_smoking/", "nsfw": false, "first_save": 1635435397.2250645, "replies_charged": false}