{"id": "t5_2tand_t3_fa4i0a", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Hi! I had quite an awakening yesterday and I really felt the need to share this story. For context: I’m a millennial, and I’m quite into technology and social media. I would presume that I’m clinically addicted to my cell phone whether I want to admit it or not, which is the story for a lot of us.\n\nYesterday, I was stressed. I’m financially down, turns out my wisdom tooth is infected and now I have to get that removed in an emergency surgery. It hurts. I was also attacked on Twitter, nothing new. I had so many unread messages, beeps and boops and little red circles. I broke down, I’m depressed. Life is too chaotic. I don’t know what possessed me to do this, but yesterday I finally just punched my pillow and turned my phone off to have a “mental breakdown” without being interrupted. I haven’t consciously and willingly separated myself from my phone in years. \n\nI spent the remainder of the day doing things that I’d typically do. Turning my phone off definitely helped calm me down, but I would’ve never expected it to have the effect that it did on me.\n\nI moved to Los Angeles about a year ago. Every night, on my walk home from work, I’d have a quick thought of wishing that there were crickets in this area that sang, because I’ve always loved the sound of them and I missed it. Well, last night I discovered that there are. There’s a lot of them. And they sing, beautifully. I had genuinely never noticed it because I either had my headphones in or I was so engulfed in typing my next tweet or texting a friend back. I couldn’t believe I’d never noticed it before.\n\nI decided to walk down the street to a little family owned sushi bar that I frequent. I was going to grab dinner and come home to watch Spirited Away which is something I’ve been wanting to do for awhile. The cashier at this particular restaurant is always rude and cold, which I wasn’t looking forward to dealing with, but I was on a mission. Coincidentally, though, last night I discovered that she isn’t. She’s the kindest woman I’ve met in this city in awhile. She smiles large, she greets the customers on the phone in silly ways. She gives you as much soy sauce as you want and she laughs and does a little dance on her way back to the counter. It was me, I was the cold one. I was too into my cell phone, every time, to look up for more than a few seconds and notice that this is probably one of the most cheerful women around. I smiled as she handed me my food and I told her I hope she has a wonderful night, she said goodbye to me in Japanese and winked. It’s like she knew that I, too, was different. \n\nThe waiter there has a crush on me, I think. He joyfully told me he was happy to see me again, I’d never even noticed him before. He smiled at me a lot, too. They play really nice music, and I made stories out of the all of the paintings on the walls while I waited for my food. I felt like I’d never been there before.\n\nThe walk home, I realized that there’s a lot of flowers on my street. Los Angeles doesn’t smell as bad as I’d always thought, my senses were definitely heightened. And of course, Spirited Away, uninterrupted, is one of the best movies you’ll ever see.\n\nBy the end of the night, I wasn’t even sure I wanted to turn my phone back on. I couldn’t believe how I felt. I couldn’t believe that I’ve genuinely been missing out on the world because of this tiny little thing in between my fingers. I never believed that this was an issue, I was always progressive about technology and I believed that the internet had evolved into an equally beneficial resource compared to just being present in the world around us.\n\nIt’s not. Turn your phone off sometimes, take a walk without it. Everything is better. Your senses will be heightened and you will feel lighter without your phone. The world lives outside of it, and it’s a spectacular place.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fa4i0a/i_havent_intentionally_turned_my_phone_off_in/", "title": "I haven’t intentionally turned my phone off in years. Turns out, it’s the best thing I could’ve done for myself.", "social_network": "reddit", "user": "LetMeBeGay", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 79, "down_vote": 0, "creation": 1582768230, "permalink": "/r/DecidingToBeBetter/comments/fa4i0a/i_havent_intentionally_turned_my_phone_off_in/", "nsfw": false, "first_save": 1635435493.1471105, "replies_charged": false}