{"id": "t5_2tand_t3_qckla8", "request": ["f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "A few days ago I was sick with a cough. It's not covid because I tested negative. I still have a slight cough and my voice is dying but I now feel well enough to return to class.\n\nMy friend knew this. I asked her if I could go with her to the supply store so I could get supplies for my project. She said no because she didn't want to get germs (which I understand) but she would buy the supplies on my behalf.\n\nShe went to the store and asked me what I needed over text. I listed my items. One of the items I wanted were wood pieces in specific dimensions, so I sent her a list of the specific dimensions of wood I wanted. She sent me the reciept and ended up buying the wrong dimensions. I told her those were the wrong dimensions and she said there were not a lot in stock. I understand the not a lot in stock part but not the wrong dimensions part. I'm guessing she misread or bought what she thought were the next best options. She said those were the specific dimensions but I didn't ask for those dimensions, so she said she will return them. By then I had already Venmo'd her the money for all the supplies, so she returned the cost of the returned wooden pieces to me and she said she will place the other items on my desk in the classroom. I said \"okay sure\" and she said \"you didn't even say thank you please don't ask me or contact me ever again.\"\n\nI was a little surprised by this last statement. I'm not saying it's bad to say thank you or be grateful but I thought, why on earth would someone cut me off entirely over a seemingly innocuous text? Also, sometimes I simply don't say \"thank you\" not because I don't feel grateful, but because I simply forget and it's not the first thing that passes through my head.\n\nThis reminded me of when a girl I liked blocked me on social media 3 years ago. At first it seemed innocuous. But then I flipped out, unfriended one of my friends because I blamed him for what happened, begged the girl to unblock me, and threatened to \"punish\" myself by isolating myself from everyone for 2 weeks if I didn't get what I wanted. I was tempted to do those same things: \"punish\" myself by refusing to talk to anybody and generally make myself feel like shit. But then I thought this situation may not be as bad as I may think. Perhaps it was really not a big deal and she just flipped out mistakenly. Perhaps she was just short-tempered or had something else going on in her life and then snapped when texting me. I think this may say more about me than about her. Besides, even if I may have been an asshole in this situation, what's better? Being a small asshole in a small situation or turning a molehill into a mountain and becoming an even bigger asshole in the process?\n\nSo I decided it wasn't worth \"punishing\" myself by isolating myself or making instant long-term decisions to cut her off that could affect my friendships. I instead decided to just simply apologize to her and give her some space if she needed it. I thought, well, I don't know what the hell just happened, but whatever it is, it shouldn't be made much worse.\n\nI ended up buying the wood pieces myself. When I saw her I apologized to her. She said it was all good and she just didn't want to get germs (which, again, I understand). Since she was speaking a little bit quietly I assumed she needed a little bit of space. Eventually I ended up starting to talk to her as usual again when we were doing homework in the classroom.\n\nI kinda like the way I handled this. It probably wasn't perfect, but I think I successfully prevented a conflict from escalating further. Had I pointed fingers at others and isolated myself and begged and tried to please her and generally giving myself a shit time, I think this would have ended up unfurling into a big fucked up drama shit that would damage my mental health and my friendships, just like what happened 3 years ago when my high school crush at the time blocked me on social media. It may have been exciting to think about what new exciting drama might be on the horizon. But this one time, I think it would actually be better not to turn this into any special drama, and instead just treat this as a small oopsie and go on as if nothing ever happened.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qckla8/i_think_i_successfully_prevented_a_conflict_from/", "title": "I think I successfully prevented a conflict from escalating", "social_network": "reddit", "user": "CEO_Of_Rejection_99", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1634794457, "permalink": "/r/DecidingToBeBetter/comments/qckla8/i_think_i_successfully_prevented_a_conflict_from/", "nsfw": false, "first_save": 1635438389.301958, "replies_charged": false}