{"id": "t5_2tand_t3_9vnrzb", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "Here sitting in a coffeeshop, forcing down coffee to work on my own business that I started to have the free time to pursue my dream of music... just thinking about how if I was working on something that I loved, that was my purpose... what that would feel like.\n\n&#x200B;\n\nThe health in my body, the happiness that would radiate from my personality, the money that  would flow into my bank account because I would be creating something of value, and most importantly, the confidence, self-esteem and just inner peace that would come from truly living out your human potential.\n\n&#x200B;\n\nHoly shit... Jesus... it sounds like an unimaginable dream, yet I know it's possible.\n\n&#x200B;\n\nI still don't know how to get there... maybe I should just drop this business... all I'm trying to earn is $1200 USD to be free and pay the rent and food, and have time to do music... but maybe my mistake was creating a business in something I don't love.\n\n&#x200B;\n\nIn total awe of those people who just work on what they love from the beginning, and invariably find success in it. I feel like such a total cop out for busting my ass to get a degree in mechanical engineer, working as a mechanical engineer, then starting an online sales business... now 32... when if I was  23 and just had worked as a pizza driver 4 hrs a day and focus the rest on music, I'd probably be way further in life right now with my dream.  \n\n\nI always wonder, how do people get started in music, or with anything where everyday is an adventure, and they are creating everyday, building, every move adding to their life, legacy, destiny...", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9vnrzb/in_awe_of_those_who_work_doing_what_they_love/", "title": "In Awe of Those Who Work Doing What They Love - (Heaven and Hell Does Exist on Earth)", "social_network": "reddit", "user": "TravelTravel99", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1541793939, "permalink": "/r/DecidingToBeBetter/comments/9vnrzb/in_awe_of_those_who_work_doing_what_they_love/", "nsfw": false, "first_save": 1635437160.970897, "replies_charged": false}