{"id": "t5_2tand_t3_mefwb9", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "So if I'm being totally honest, \"inspirational\", \"motivational\", and \"self-improvement\" posts (especially on social media) kind of piss me off. Especially the ones that are like \"here's 10 quick tips to get over your low self esteem in just a week!\". I'm a coach, and I see so many colleagues spamming people with self-help guides and books and posts, and I understand we all have to market and bring in revenue, but from personal experience, I have never been helped by consuming hours and hours of self-help and self-improvement material.\n\nThe only thing that has ever helped me is deep self-reflection, understanding WHO I am, what I'm struggling with and why, and what actions I need to take to get myself a little bit closer to that ideal life. And that's not always something I'm able to do alone in a vacuum. Because the reality is, most self-help material isn't created to help YOU. It's created to sell the book, to market the author or the coach/motivational account, to get people to like & subscribe. Why would 5 tips that helped ME get through burnout be useful to you? I don't know you, I can only help if I get to know you, if we figure out what's at the root of the issue you're having, what are YOUR natural strengths, YOUR dreams, YOUR passions. Positive affirmations don't work for everyone. Meditation doesn't work for everyone. Waking up at 5am to go for a run doesn't work for everyone. Having a perfectly clean room doesn't work for everyone. Having a desk job doesn't work for everyone.\n\nI love working with people in their 20's and 30's. It's such a weird age, we're trying to figure out so much but there is SO much self-help crap shoved down our throats. When you've spend hundreds (often thousands) of dollars on books or trainings, or saved 1000 inspirational IG posts, but you can begin to feel even worse because you're like \"I must just be incapable if all these people have been able to do it, but nothing is working for me \". It's so heartbreaking when I hear this from my clients, friends & family because the issue isn't that you're incapable or that you aren't working hard enough. It's the fact that you're putting your efforts and your money into something that only serves to take money from you. A self help book doesn't hold you accountable, doesn't help you troubleshoot or problem solve, doesn't tailor itself to fit YOUR life and YOUR needs.\n\nCoaching can be expensive af. And it's hard to find a \"good\" coach (I also know that coaching in general gets a bad rep on Reddit, and rightfully so, because the field is unregulated and lots of people in it are just trying to take advantage). However... I've also worked and learned from incredible coaches, who don't try to sell you on anything, don't shove their plans down your throats, and who truly work with you as the whole individual that you are to find what works for YOU.\n\nIf you're someone who is trying anything and everything to get yourself unstuck or to reach some kind of goal or to just feel better, but inspirational/motivational stuff only makes you feel worse, please know there is NOTHING wrong with you and you are most definitely not alone. Toxic positivity can be just as harmful and demotivating as toxic negativity. Damn this is starting to sound a little inspirational, let me stop right here. Would love to hear from you all and I'm totally open to any questions/for support.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mefwb9/why_motivational_selfhelp_content_might_be_making/", "title": "Why motivational & self-help content might be making you feel worse", "social_network": "reddit", "user": "outtheweeds", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 28, "down_vote": 0, "creation": 1616858683, "permalink": "/r/DecidingToBeBetter/comments/mefwb9/why_motivational_selfhelp_content_might_be_making/", "nsfw": false, "first_save": 1635435165.8267708, "replies_charged": false}