{"id": "t5_2tand_t3_q9upei", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "It's likely not needed to answer the question, but i feel I need to get off my chest some background details:\n\n>I grew up surrounded by a lot of wealthy people, now i'm talking top 1% of the small country I lived in wealthy. My best friend growing would be considered one of the wealthiest people in this said country. I grew up in a middle class family, till about 9-10 years old when the 2008 recession hit + my mother's abusive ex-husband had swindled away her savings. A few years later, when I was 14 we left that country in search of economic stability to North America.  \n>  \n>North America was hard: culture shock, financial instability, police called due to the abusive environment, lack of friends / consistent bullying. I cut off friendships within the first year of moving due to the pain of seeing people move on (especially the pain of seeing my best friend move on). I spent high school studying to hide the pain and tried my best to ignore all mentions of the country I grew up in, due to the pain it caused me. Later on in North America I was once again surrounded by those with life-styles I would / could never have. Rich parents and lots of privilege.   \n>  \n>Is anyone else on this subreddit in my position? Going through the experience of having to starve yourself in order to get by, while simultaneously being subject to lavish rich socialites who can afford to give their 15 year olds Birkin bags.    \n>  \n>I'm now in my early / mid 20s, I just graduated and feel slightly lost in life. I am not pursuing my degree in order to see if a business I started a few years ago will grow, but I can't help to compare myself to the rich people I grew up with. I tried to remove their existence or mediate in my mind that they only are where they are today due to connections / family wealth. But I cannot stop myself from comparing where I am in life to their positions. I am so unhappy, because I do not have the financial freedom I need in order to live the life I want.  I do not know how to stop this comparison.\n\nI am constantly comparing myself, in relation to those i grew up with, with those in the same business field as me and to the people who hurt me the most in my life (such as the rich best friend I mentioned). **How do i stop comparing myself? How do i get better at dealing with this gut reaching feeling that paralyzes myself? How do I focus on bettering myself without being discouraged by comparing myself to others?**\n\n I feel so inadequate knowing that there is such a wealth gap between myself and the people i grew up with / that there always will be (I take issue with this wealth gap as it means they will have the privilege to do what they want in life without the financial restraints).", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q9upei/how_do_i_focus_on_bettering_myself_without_being/", "title": "How do I focus on bettering myself without being discouraged by comparing myself to others? I constantly compare myself to the rich people I grew up with.", "social_network": "reddit", "user": "selfloveroadmap", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1634459211, "permalink": "/r/DecidingToBeBetter/comments/q9upei/how_do_i_focus_on_bettering_myself_without_being/", "nsfw": false, "first_save": 1635437843.1764925, "replies_charged": false}