{"id": "t5_2tand_t3_nirfzs", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "So yeah basically the title. I saw this post that resonated with me. Just to give a little context I’m a virgin and when you’re a dude at this age you have to sometimes try weird things to get laid. \n\nI post a lot on these virginity exchange subs or r4r subs and one user made a post about virgins trying to lose it who don’t have their lives together. They said if you don’t make or have enough to have a car, a mattress, or enough money to buy a hotel room that sex should\nbe the least of your problems. \n\nI read that and it kind of made a wave of depression hit me. I’m one of these pathetic people she’s talking about. I’m basically a man child trying to have sex and thinking of myself as that brings so much self hatred. I don’t have an income. My parents support me and won’t kick me out. The only thing giving me a will to live is what keeps me busy. Those things are basically housekeeping, like hard housekeeping work for my family and my own physical work outs. I keep myself in great physical shape. Maybe my only real accomplishment on this stupid piece of dust. I feel like I do the housework and workouts to make up for what I haven’t done in life. \n\nFor a lot of reasons, anxiety, OCD, depression, severe social anxiety, RSD,low self image, I’ve avoided work, applying, interviews all that stuff for *years*. Now I’m an almost 30 year old man. 27 to be exact. I’m not having sex, I have no social life, my best friend is about to die, all of those issues I mentioned are still there and I think another one is about to be added. I’m worried about how often I’m thinking about suicide. It’s not that often but it’s more often than before, definitely more as time has trudged on. Idk if i intentionally think of it but I’ll just be sad about sex, my self, my life or whatever and I’ll think about setting myself on fire like a monk. That was the most recent one. I’ve always been *mortified* by suicide because of ocd. It took years for me to even learn how to talk about it. But i worry if this is the beginning of me considering it idk. I do think about it a lot in a philosophical way more than I do actually think about doing it. Still scary. \n\nSo yeah I have all this going on meanwhile I’m just like most other 27 year olds, dying for sex and companionship especially with all that’s happened this past year. But I guess some\nPeople are just fucked. Or maybe I’m just pathetic and even this very post is me looking for excuses. Idk. That’s the cliff notes version of me. Please be honest even if it’s bad.\n\nEdit: I’ve realized something over the years and it’s that I just want “it” to be easy. “It” can be any obstacle in my life but the main ones are independence and lack of sexual experience. \n\nI honestly admit. I want it to be easy. I want to have sex and be independent without it being hard. I do!!! Cuz you know what, I’ve struggled a lot in my life and a lot of normal things for me are HARD. Am I that terrible for wanting *one* fucking thing in my life to not have to be so exhausting? Just to be normal!! I spend so much time literal time in my day on the clock of existence thinking about what it must be like to grow up a neurotypical. I’m tired of saying I haven’t suffered cuz my parents have money. Look up what OCD is like, *real* OCD not the bullshit you see on social media. It’s torture. Its shaped my whole being", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nirfzs/im_not_a_good_person_im_a_27_yo_college_grad/", "title": "I’m not a good person. I’m a 27 y/o college grad, unemployed, virgin, living at home, privileged mooch off my wealthy parents. I need brutal honestly. Don’t worry about making me feel like shit I probably need it.", "social_network": "reddit", "user": "st0nervirginsunit3", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1621715613, "permalink": "/r/DecidingToBeBetter/comments/nirfzs/im_not_a_good_person_im_a_27_yo_college_grad/", "nsfw": false, "first_save": 1635437837.8727272, "replies_charged": false}