{"id": "t5_2tand_t3_dg2a04", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "My wedding is in two weeks, I had a very promising interview for my dream job, and so far I haven't had any alcohol since quitting 6 days ago. Thinking about the wedding makes me literally want to shit myself because there is so much I still need to get done, my dream job doesn't pay worth a toot but at least I would love it, and yeah...6 days isn't a huge milestone for someone who isn't a big drinker from the get go but...I am doing it! \n\nThe only things putting a small dark cloud over my head is our home search, the possibility of not getting this job, and children.\n\nMy fiance and I have been looking at homes and it's *incredibly* discouraging. We weren't approved for much because we both have poor income and I have a mound of student loan debt - yay. The homes in our price range are literally falling apart and would need tens of thousands of dollars to make them habitable. We live in a family home for free that's in a far from desirable part of town. The home is also in bad shape (was that way prior to moving in) and we don't want to dump thousands of dollars to fix damages that were there before us and for a home we don't even own - that's a whole different story. So we have decided to wait and see what happens with our jobs and maybe try to get approved for a higher amount in another year or so.\n\nAs mentioned before, this is my dream job I interviewed for. It would not only be rewarding to me but to college students. The pay would be less than favorable but it is more than I would probably be making now and with time and effort I could possibly advance my career and pay grade. If I lose this opportunity I don't know how I will handle it. For the reason I am even making this post, I am TRYING to be better but if I get a gut punch like this I need to find a way to turn it from a negative into some sort of positive. I am currently working in an okay job but the environment is with toxic people I want to get away from.\n\nLastly - children. My fiance and I are both pretty \"mehhh\" about kids at the moment but him being 33 and myself being 30, we really need to be considering our time. Everyone has always told us \"you'll never be mentally or financially prepared\" so we get that but we are kind of happy just being kid-less. But on the flip side we would also like to have kids, we are just having a very hard time preparing ourselves and I can see it in us both thinking \"should we reaaaaally do this?\" So it's kind of an excitement and pretty damn terrifying at the same time. We are also both giving up our hobbies (which is huge for us) to try and have kids.\n\nAnd the journey continues...", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dg2a04/it_may_be_at_a_snails_pace_but_things_are_moving/", "title": "It may be at a snails pace, but things are moving forward and getting better!", "social_network": "reddit", "user": "cajunqueen929", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1570732302, "permalink": "/r/DecidingToBeBetter/comments/dg2a04/it_may_be_at_a_snails_pace_but_things_are_moving/", "nsfw": false, "first_save": 1635436530.0252936, "replies_charged": false}