{"id": "t5_2tand_t3_p4l62d", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I'd like to share my first-ever post. I discovered Reddit in 2018, and I made this account shortly after because I wanted to share my experience and connect with people. But I quickly froze up, and I never took the leap. Three years later, and I'm finally feeling comfortable enough with myself to share my experience publicly. The culmination of many years' worth of baby steps forward.\n\nMy name is Anthony. I was diagnosed and treated for leukemia at 18 years old in 2006, and went into heart failure from the chemotherapy. After surviving cancer, I developed an addiction to opioids and other pills, and ultimately robbed a local Walgreens pharmacy with a knife in May 2011. I was fortunate enough to bail out of county jail so I could go through long-term inpatient rehab, where the journey of reclaiming my life began.\n\nNevertheless, two years after the robbery, I was sentenced to five years in New Jersey State Prison in August 2013. I did most of my time in Garden State Youth Correctional Facility in Yardville, New Jersey. During a phone call with my dad when I was really struggling, he said, 'Someday, this is all going to be over, and you're going to wish you had documented it.'\n\nSo on a whim, I began journaling. The only things I'd ever written in my life prior were text messages, emails, and book reports from high school. But his words triggered me, and once I started journaling, I couldn't stop. It was as if I was talking to a friend, trying to figure prison out and how I was going to get through. To this day, when I open up one of my journals to a random page and place my hand on the words, feel the pen marks on the page, and shut my eyes, I'm instantly transported back to my cell, with images flooding my head of when I'd pour myself into it. This intensely private outlet carried me through prison.\n\nI was released from custody in November 2017, and shortly after, I was pardoned by Governor Chris Christie. \n\nThe pardon terminated the five years of mandatory parole supervision that I had just begun, and I took the opportunity to set out on a one-way ticket. I've been traveling throughout Southeast Asia ever since: Vietnam, Thailand, Malaysia, and Taiwan.\n\nDuring my travels, I took the time to adapt my journals into a book. And I've slowly been sharing it with people. Soon, I'll be kicking it out into the world. Letting it go. I'm scared and super excited at the same time. It represents a really dark, really private time in my life, yet also a major personal accomplishment I never thought I was capable of.\n\nAt this point, I have over 10 years clean. Like so many others, I knew people along the way whose parents found them face down in their bedrooms, dead from an overdose. I knew people who lost their lives to cancer. And more recently, some of my friends and former bunkies from prison have lost their lives, whether to addiction, or being murdered as a result of the lifestyle they couldn't get away from. I know how lucky I am to be alive today.\n\nThank you all so much for reading. \n\n-Anthony\n\nEdit: Since people have been asking, the book is on Amazon at the moment. Aftermath: A Memoir. https://www.amazon.com/dp/B09C81YTYS\n\nIt is not released, only setup for a pre-order with a date of September 3.That date is arbitrary as the books been done for months now. If people were interested in reading it sooner, I could move up that date, or send some copies to some people now. Let me know. Just an FYI, though, it is heavy duty, and it may take time to read, digest, and process. This is what I've been told. \n\nFinally, I wanted to say thank you so much to everyone who took time to stop and read my post. The feedback has been overwhelming. I put my experience out there because I want to connect with you. And I want to encourage others to take a leap and do the same. I know something about making what felt like a life-ending mistake and emerging from it feeling like a completely different person. I hope I can help you. I'll slowly try to connect with everyone who's reached out. Thank you again.\n\n-Anthony", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p4l62d/i_robbed_a_walgreens_pharmacy_with_a_knife_and/", "title": "I robbed a Walgreens pharmacy with a knife and spent over four years in prison. This is my first-ever Reddit post.", "social_network": "reddit", "user": "AltogetherAnthony", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2174, "down_vote": 0, "creation": 1628994259, "permalink": "/r/DecidingToBeBetter/comments/p4l62d/i_robbed_a_walgreens_pharmacy_with_a_knife_and/", "nsfw": false, "first_save": 1635435955.3947737, "replies_charged": false}