{"id": "t5_2tand_t3_g72zds", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1"], "text": "Please can I get a little whoop!\n\nEdit: wow I didn't expect so much love so thank you. And thanks for the awards, I've never had those so sweet, thank you. \n\nJust to address a few of the questions. \n\nMy debt has been around for 20+ years, never really went away. It started with me getting a credit card when I was younger and thinking that I'll deal with the payment another time. Student loans etc. That slowly trickled to car loans and more credit cards over time. Probably about £20k over that time period, but never all at once.\n\nTwo years ago I had around £4500 of debt over cards and a large overdraft from my student/graduate account for my second degree.\n\nI have been using 0% balanced transfer offers between my cards. With my overdraft I just kept trying to not spend the balance down to the bottom and eventually over a year I now sit above the overdraft. \n\nTo do this I've worked overtime where I can. The pandemic has helped as I'm an essential worker so I'm lucky enough to be still working, and working overtime too. Obviously there is isn't much to be spending money on right now so I've just moved it over to a savings account and wacked it onto my final credit card last week.\n\nWhere I'm at in life... I am a mother, with husband, kids, own home, finally have a decent career following years of studying and having a family. \n\nI am going to buy a new car next, but this time I want to save first instead of undoing all my work to become debt free.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g72zds/ive_just_paid_off_my_last_bit_of_debt/", "title": "I've just paid off my last bit of debt.", "social_network": "reddit", "user": "compoface", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3680, "down_vote": 0, "creation": 1587707827, "permalink": "/r/DecidingToBeBetter/comments/g72zds/ive_just_paid_off_my_last_bit_of_debt/", "nsfw": false, "first_save": 1635436189.658041, "replies_charged": false}