{"id": "t5_2tand_t3_3f0bqs", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "(from my [blog](http://selfimprovementguy.com/about-me/))\n\n**Apart from for caring for a sick child or catching an early flight, you may never have considered getting up as early as 5.00 am. For most of us it sounds like torture - but a few months ago I bit the bullet and began to do it anyway. I have never looked back; the Self-Improvement factor from this one change is huge! Here are some great reasons why you should join me...**\n\n**ELEVEN reasons to rise early:**\n\n* 1) **Successful people rise early.**\n\nSeveral studies have shown that early risers in college are more likely to be academically successful. Sound far-fetched? Maybe, but if you were to get up at 5.00 am you'd be in good company. Among early risers past and present are:\n\nBenjamin Franklin, Margaret Thatcher (former UK Prime Minister), Condoleeza Rice, Tim Cook (Apple), Napoleon, John Grisham, Ernest Hemingway, Dan Akerson (General Motors), David Cush (Virgin America), Robert Iger (Disney), Richard Branson (Virgin), Barack Obama and success guru Robyn Sharma, who refers to early rising as 'Mind over Mattress'!\n\nThese are just a few; the list goes on. Yes, there are some hugely successful 'night owls' too, but the general trend is for an early start to the day. Modelling your life on the success of others can be a great method of Self-Improvement. Rise early and join the success crowd!\n\n* 2) **More productive energy**\n\nGetting up at 5.00 am creates more time to do things during the most productive and energetic part of the day. You might not think of early morning as either productive or energetic, but when you get into the habit of rising early, things change! You discover you can take advantage of all the energy reserves you have been building during your night's sleep. Your mind and body are wonderfully rested and after a short period of adjustment (good coffee and a shower usually help!) both are ready to function at peak capacity.\n\nWhat do you do during the last few hours of your evening anyway? For most of us it's low-energy activities such as household chores, watching TV, surfing the internet or catching up with friends on Twitter and Facebook. That's because we use up our main energy surges during the day.  Intentionally structuring your day around the peaks and troughs of your energy levels is a 'ninja' Self-Improvement technique that takes some mastering. I'm still working on this one myself; going to bed earlier and getting up at 5.00 am is a key strategy for taking advantage of my energy reserves.\n\nDo you still think of yourself as a night owl? I did, too! I used to stay up late most nights, telling myself I was being productive. But the truth was, I just didn't like going to bed. Ironically, this may have been because subconsciously I didn't feel like I was getting enough done each day! Switching from night owl to early bird produced a significant and instant boost to my productivity. Rise early and enjoy the buzz!\n\n* 3) **Quiet and uninterrupted** \n\nGetting up at 5.00 am gives you a long period of peaceful, quiet, uninterrupted time. Unless the work you do requires you to make a lot of noise, you will find the silence of a sleeping world is the perfect environment to gather your thoughts, plan ahead and focus effectively on your important tasks.\n\nWe recently took a holiday on the beautiful Greek island of Rhodes. I continued to rise at 5.00 am (yes, on holiday!) and used the time to complete my regular Morning Ritual including reading, meditation and writing my journal. I also took the opportunity to reflect on past successes and failures, mind-map ideas for future development and get some blog posts scheduled in advance. I worked on our hotel balcony, overlooking beautiful gardens with the mountains beyond. Have you ever watched the sun come up and hear the world come gradually awake? It's a truly wonderful time...and a special privilege granted only to the early riser. Rise early and gain a new perspective!\n\n* 4) **Take control of your habits**\n\nSelf-Improvement involves taking more control over aspects of your life. One great way to do this is the Morning Ritual. (Note: You don't have to get up early for this, but the uninterrupted time it creates will increase your chances of success.)\n\nA Morning Ritual is simply a list of things you do every day, in the same order. For example, my day starts with a visit to the bathroom, including inter-dental brushing, cleaning my teeth, shaving and dressing. Next I gulp down a large (400 ml) glass of filtered water and refill the glass to drink again over the next 30 minutes. Then I go to my standing desk (more in a future post) where I do some inspirational reading, including daily Bible notes, and take some time to reflect and pray. Next, I do my afformations (see my post about Brain Diet) followed by a highly-focused 45 minutes working on this blog. When my timer finishes, I switch to writing my journal, by hand, usually filling a page of lined A4 paper. I scan my journal into Evernote for safekeeping and then file the paper copy away...\n\n...and so it goes on. The same tasks, done in the same way, in the same order, every day, including weekends. You might call it a 'routine' but (and I got this idea from Jeff Sanders of the 5.00 am Miracle Podcast) I call it a 'Ritual' because it sounds much more interesting and intentional. Subtle changes in language can make such a difference to the way we respond to things.\n\nThe Morning Ritual is much more than just a way to organise and remember your morning tasks: it's a superb way of developing new habits. Just in the small section I described above there are FIVE daily habits I have developed that I wasn't doing consistently before I started rising at 5.00 am! I'll let you guess which they are. By chaining your tasks together consistently you can easily insert new habits. It's also great practice for using a To-Do list: another important weapon in the armoury of the Self-Improver.\n\nDeveloping new habits is crucial to your Self-Improvement; getting up at 5.00 am is the perfect time to make it happen. Rise early and work on some great new habits!\n\n* 5) **Putting yourself first**\n\nSelf-Improvement starts out as a selfish activity. Most of us have been brought up to think of selfishness as unhelpful or just plain wrong, but making time for just yourself is essential. As you Self-Improve, you will gradually become the 'best version of you'that you can be, which in turn will enable you to serve others more effectively. Put yourself first, because you cannot love and serve others until you have loved and served yourself first.\n\nRising early gives you time and opportunity to be 'selfish' for the right reasons. Consider your strengths and weaknesses. Figure out your purpose in life. Intentionally and consistently follow a path of Self-Improvement, visiting those areas you know need the most attention. Rise early and be your best in every way you can!\n\n* 6) **Do the important stuff**\n\nThere will always be some menial tasks to get out of the way when you get out of bed (dressing, personal hygiene, etc.) but as soon as possible, focus on the more important jobs in hand. These might be life-enhancing habits you want to develop, urgent tasks that need your prompt attention, or taking big bites out of those larger projects you have been procrastinating on for too long. I have used my morning time for all of these and found it highly successful.\n\nUsing the early hours to crush a whole load of important tasks is a huge win. You head into the rest of your day knowing you have 'nailed it' before most people have even crawled out of their beds - it's a great feeling. Rise early and be ahead of the game!\n\n* 7) **Get off to a great start**\n\nYou know those beefy 'strongman' guys who pull buses and trucks along as a display of their strength? Try that when you get up. No, I'm joking. (Sorry, British sense of humour again.) But If you watch carefully, you will see that the hardest part of pulling the vehicle is getting it moving at the start. Once it's in motion, keeping it going is easier (though still not easy!) This is the principle of momentum.\n\nThe same principle applies to getting up early: getting a positive, productive start to your day adds momentum. Once you've got going (before almost everyone else) the rest of your day runs much better. Even if you stall later on or something goes seriously wrong, the work you have already achieved means your day has been a success. Rise early, and add momentum to your day!\n\n* 8) **Be on time**\n\nDo you know anyone who is habitually late? We have a friend who seems incapable of being on time for just about anything. His daughter is regularly late for school and he often arrives at meetings well after they have started. When there's a party at 8.00 pm his friends joke about telling him it's 7.30 pm just to try and get him there. But behind the joke is a serious reality: a lack of punctuality wastes other people's time and can cause them a lot of inconvenience.\n\nFeeling rushed is not a good way to start your day. Getting up early feels less hurried and gives you more time to get organised. Anyone can be late from time to time but being habitually late is neither effective nor attractive. Rise early and be on time!\n\n* 9) **Enjoy the good stuff**\n\nRising early means you do your 'waking up' before everyone else (remember that shower and strong coffee). Later on, when you start to encounter other people (partner, family, colleagues) you are probably going to be a lot more awake and alert than they are.\n\nBeing wide awake means you can fully enjoy important times like breakfast with your family or spouse. Give your loved ones a better version of you in the morning: make them coffee, serve them breakfast, prepare their lunch, help them get their day going. Rise early and give energy to the ones you love!\n\n* 10) **Get moving**\n\nAn early morning start gives plenty of time for exercise. It might be as simple as a walk around the block, or it could be a full-scale gym visit. Getting your body moving in the first part of your day enhances your energy levels even further and the health benefits are, of course, enormous. You could leave your workout for later in the day, but let's be honest: will you really go to the gym tonight after a hard day's work...? Rise early and get your body pumping!\n\n* 11) **Save time with a shorter commute**\n\nIf you have a morning commute, an early start can improve your life significantly. Earlier buses and trains are less busy, more pleasant to travel on and arrive more quickly. If you drive, you can avoid the heavier traffic and reduce your journey time. If your job starts at a fixed time and there's no opportunity to start and finish early, go early anyway and continue your Morning Ritual before work in your parked car or in a coffee shop, where you can read, meditate, catch up on email or any other \"portable task\". Or use a gym near your place of work for that morning workout. Rise early and beat the rush!\n\n----------------------------------------------------------------------\n\n**EIGHT ways to make early rising easy:**\n\n* 1) **Plan ahead**\n\nGetting up early is all in the planning (if you fail to plan, you plan to fail). Success in anything generally comes not by accident, but by making intentional decisions and then keeping your promises to yourself. If you are serious and organised enough about getting up early then you WILL do it.\n\nIf you're at the point of deciding whether an early morning is for you, be careful of your self-talk: \"I'll try it and see how it goes\" sounds positive but introduces an element of doubt that can be unhelpful. Instead, tell yourself, \"I'll do it and review it in a week\".  This intentionally leaves less room for manoeuvre.\n\n* 2) **Get enough sleep**\n\nSuccess in getting up earlier is almost entirely dependent on going to be earlier. Sure, you can pull the occasional four-hour night, but it very quickly catches up on you. If you decide to get up two hours earlier (like I did) then decide to go to bed at least two hours earlier, too. If you try to short-change your body on sleep it will soon let you know!\n\n* 3) **Get quality sleep**\n\nAll sleep is not the same. To improve your sleep quality, set yourself a bedtime routine. Include an element of planning for the next day, because making decisions about tomorrow before you get into bed means your brain doesn't need to work on those areas during the night. Write down any important ideas or reminders before turning in for the night. Again, your brain will relax, knowing those notes will still be there to review in the morning. Eliminate all screens for an hour before bed: TV, computer, phone, tablet. The only exception might be a non-illuminated e-reader. The light from illuminated screens over-stimulates your brain; you want this final hour to be relaxed and low on brain effort. Read a real book, listen to some light music, meditate or take a gentle walk. When you get into bed, try to ensure the room is quiet, dark and cool enough. Eliminate LED lights from alarm clocks, phone chargers or other devices. Even the smallest amount of LED light can disrupt you. A well-planned, intentional bedtime routine will help to ensure a night of top-quality, restorative sleep.\n\n* 4) **Dive in...** \n\nOne way to start getting up early regularly is to go \"cold turkey\" and dive straight in. For some people this is the best option. Yes, it's painful: making a sudden change to your natural daily rhythm is a shock to your system and you can expect a response from your body that may not be entirely positive...but if you're a \"Just Do It\" type of person then, well, just do it!\n\n* 5) **...Or go slow and steady**\n\nFortunately there's another way. Try setting your alarm clock and getting up five minutes earlier tomorrow. Then five minutes earlier than that the day after, and so on. If you followed this routine then in 24 days time you would be rising two hours earlier. Make sure you adjust your bedtime forward by five minutes each day to ensure you continue to get that high-quality sleep you need. This is the method I used to adjust to getting up at 5.00 am.\n\n* 6) **Customise!**\n\nIf you decide to take the \"slow and steady\" route, it doesn't have to be five minutes every day. Adjust by 10 or 15 minutes daily to speed things up, or reduce to five minutes every other day or even 1 minute per day if you want to take it slowly. Decide what you want and work out your own combination. Just remember to keep adjusting that bedtime, too.\n\n* 7) **Make it a game**\n\nComedian Jerry Seinfeld apparently uses a daily calendar tick method to keep himself writing jokes every day. He has a large wall calendar and every day he writes new material he puts a big red \"X\" on the calendar. The idea is to create an unbroken chain of Xs as long as he can. If he breaks the chain, it starts again. This is a great way to establish any new habit or and you can definitely apply it to rising early. A wall calendar is good because it gives you (and others) a visual record of your success, but you can record it anywhere, such as in a notebook, in a spreadsheet or on your phone. This is an example of gamification. Using game-type behaviour is a well-proven method to boost productivity and Self-Improvement. Set yourself a morning target time for getting out of bed and give yourself a \"Seinfeld X\" every time you hit it. See how long you can make the chain!\n\n* 8) **Fail**\n\nAs well as being a great motivator, the Seinfeld method reminds us of an important reality - sooner or later you WILL break the chain. For whatever reason, even after weeks or even months of rising early you will fail to get up one day. Accepting failure and moving on from it is a vital skill for Self-Improvement. You need to be tough enough on yourself to reduce the chance of failure but gentle enough on yourself to avoid beating yourself up when it happens. And it will happen.  When it does, get over it!\n\n**How about you?**\n\nI hope some of these benefits and techniques will inspire you to join the ranks of the early risers! Starting my day consistently between 5.00 am and 5.30 am has contributed more to my Self-Improvement in the last six months than anything else I have tried. The benefits to my health, well-being, personal organisation and productivity have been remarkable. I heartily recommend it to you.\n\n**What's your daily pattern? Are you a night owl or an early bird? Please share your experience: I love to hear what other people are doing and achieving.**\n\n(Original and [free ebook](http://selfimprovementguy.com/self-improvement-club/) at [selfimprovementguy.com](http://selfimprovementguy.com/getting-up-at-5am-11-reasons-why-you-have-to-do-it-and-8-ways-to-make-it-easier-than-you-think/))", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3f0bqs/getting_up_at_5am_11_reasons_why_you_have_to_do/", "title": "Getting Up At 5am: 11 Reasons Why You Have To Do It And 8 Ways To Make It Easier Than You Think", "social_network": "reddit", "user": "djhendra", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 109, "down_vote": 0, "creation": 1438161337, "permalink": "/r/DecidingToBeBetter/comments/3f0bqs/getting_up_at_5am_11_reasons_why_you_have_to_do/", "nsfw": false, "first_save": 1635437710.7964747, "replies_charged": false}