{"id": "t5_2tand_t3_od7hmu", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "b69cf201-6737-4217-b486-9096135546b8", "a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "I have very poor self esteem and self-worth. I am deeply convinced I am the ugliest woman ever. If there's a mirror in reach at any moment, I'm going to check how I look. And it always ends up worsening my mood. When I go out and see beautiful women, it affects me.\n\nI don't want to be like this. I don't want to care about my physical appearance except the healthy self-care part of it. I've never wanted to be like this or care like this.\n\nI'm extremely insecure and VERY embarrassed about how much it affects me. I'd much rather focus my attention, time and effort on building my personality, hobbies/talents, energy, inner peace, etc than giving two flying f--cks about how I look. But it kills any motivation/determination I have for those things. Idk, maybe it's the bullying trauma I endured about the way I look back in school...\n\nIt interferes with me trying to recover from my depression and anxiety. It interferes with my successes in life and sometimes even determines whether I go out or not even if I've planned on going out prior.\n\nI want to love myself, be at pure peace with myself, be my own best friend, get back into spirituality (I used to be really interested in Buddhism), make true friendships, learn new things and just flourish in so many ways. 😣", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/od7hmu/how_can_i_easily_be_attentive_to_building_inner/", "title": "How can I easily be attentive to building inner peace instead of overly obsessing about my physical appearance?", "social_network": "reddit", "user": "ashlinprogress", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1625350218, "permalink": "/r/DecidingToBeBetter/comments/od7hmu/how_can_i_easily_be_attentive_to_building_inner/", "nsfw": false, "first_save": 1635435384.5966125, "replies_charged": false}