{"id": "t5_2tand_t3_eptlew", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff", "4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "Fingers crossed I get an offer!  I keep telling myself this is the YEAR OF YES! I applied after going back and forth  and I'm so glad I did.  My current position is stressful by itself but my administration has really taken a toll on my mental health.  Ready to feel a part of something positive again!  🤞🤞🤞🤞🤞🤞🤞\n\nUpdate: 3 interviews later, was feeling good... until they told me all my references checked out and now they need to contact my current employer... I work in a school district and it's mid year.  I have 3 supervisors and 1 really dislikes me.  There's no reason they would say good things about me, especially if they don't want to hire mid year. I explained my concern about mid year and them knowing I'm seeking other opportunities and they basically it's their standard practice.  I'm feeling really defeated, especially because if I'm not offered the position, it's not like I'd get fired. I have tenure... but they could make my day to day a living hell and awkward/ uncomfortable.  I asked them to allow me to give notice before calling which they said they would. I don't even know how to tell my supervisors.  This sucks.  This was supposed to be a fresh start.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/eptlew/applied_to_a_new_job_after_being_complacent_in_a/", "title": "Applied to a new job after being complacent in a job where I've been mistreated for years. I had an in person interview today and a follow up phone call interview this evening. Feeling good and could use some good luck and good vibes!", "social_network": "reddit", "user": "mmp12345", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 889, "down_vote": 0, "creation": 1579226382, "permalink": "/r/DecidingToBeBetter/comments/eptlew/applied_to_a_new_job_after_being_complacent_in_a/", "nsfw": false, "first_save": 1635436014.9078605, "replies_charged": false}