{"id": "t5_2tand_t3_o75k9s", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "I’ve never cried so much before, going on to  an hour. I was already depressed but I almost broke down in front of grandma (she doesn’t know I’m depressed). \n\nNormally she’s happy for how her health is. Or so I thought. She drinks vodka for her pain, smokes so she can feel her nerves. She can’t feel her feet, or her left pinky. She doesn’t eat hardly, she’s dehydrated. She has ankylosing spondylitis, congestive heart failure, chronic back pain, arthritis, and more(to much for me to remember). Her spine is a backwards s, her bones in her spine are rubbing on each other she doesn’t have the sponges in between that stops it. Her bones are literally disintegrating and there is nothing I can do for her except help her with simple things.\n\nSo for her sake, I’m going to be better, live the life she couldn’t. I’m going to work out even more than I do now. Be more productive with what I want to do. Be the kid she could only dream of, I’m not a bad kid now, but I could exercise more and help out more.\n\nWhy do I care so much? She is my savior, she raised me since I was two, after my father died, and my mom was arrested. My mom was arrested from what I know five times after the fact. Father died from a car crash, he was a great man. My grandparents are amazing people, young to be considered grandparents though. But that’s in short why I care so much.\n\nPlease help encourage me, I really want this and I think my grandma needs it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o75k9s/i_want_to_be_better/", "title": "I want to be better.", "social_network": "reddit", "user": "sadSmiIe", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1624555412, "permalink": "/r/DecidingToBeBetter/comments/o75k9s/i_want_to_be_better/", "nsfw": false, "first_save": 1635436463.5244985, "replies_charged": false}