{"id": "t5_2tand_t3_llfslp", "request": ["cbd1933a-caaa-464d-8e4c-373318982c62", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "imgur. com/ pElqz4A .jpg\n\nNot much is it; reduced to rows of 73, blocks of 365. My life - in a spreadsheet.\n\nIt seems apt, the past in black. Because it was dark - really dark. It's interesting really, looking at this, it's not all the black that hurts me, I don't care that my past years are reduced to nothing - it is the empty cells. My future days. So little of them.\n\nIt hurts so much to look at this and see how little time I have left.\n\nI missed out on my childhood - to bullying and emotional abuse.\n\nAnd my teen years too - to fear and anxiety and depression too.\n\nAnd my latter years 15 up - to addiction. Escapism and porn; because this world was too much and not enough.\n\nI waste my days to running away living in vicarious dreams. Inside I am still that scared bullied, abused 8 year old, scared of the entire world, knowing all people are cruel, manipulative and evil.\n\nOn the outside: I'm a 300lb 2m meat sack, on the inside I'm a terrified child - the archetype of the emotionally stunted man child.\n\nI feel nothing anymore, not since the first time I tried to die. That was over a decade ago.\n\nI spent these recent years trying to every antidepressant, anxiety medication there is, waking up in terror to every day. I got to about 15 of them, ruined my brain, and my memory is that of someone with alzhiemers. Still I feel nothing, still I am terrified, scared of people.\n\nI spent the last 3 years trying to loose weight, fasting mainly and intermittent fasting. The longest I could do was 7 days. I started of 240lb now I'm 330lb.\n\nI'm failing a course I have little interest in, but have only a year left, and for the first time I am the dumb kid in my class - because of the memory thing.\n\nI have only 10 rows left. 20 blocks. 21 actually. And I have nothing in life. Only scars from many blocks ago.\n\nI feel like it's already over. Physically I'm near halfway through. Inside though, I'm stuck at a quarter. Dumb and emotionally weak. Terrified.\n\nI'm scared to do anything I want. Incapable of doing what I want.\n\nFor the sake that I am unknown to you here, these are my true dreams.\n\nI want to be an actor, even though I don't express emotions. And a singer too, though my voice, most is monotonous. I want to be a youtube, yet I am terrified of judgment, and of people. I want to travel, feel the sun on my back and a breeze run through the hairs on my arms. I want a boyfriend, though I look like shit and have gyno (...comastia). I want friends - real friends so I can finally feel alive and apart of something. I want to learn and be smart and be validated. I want to make films and maybe documentaries. And when I'm old, in my final rows. I want to teach, maybe lecture and help some kids, maybe be a counsellor. And then, when I'm on my final block, I want to fall asleep and die in by boyfriends arms. A euphoric opioid I assume, maybe morphine, maybe inhale some CO.\n\nBut none of that's going to happen. None of that is tenable. I will die having never lived, never felt alive, never having had someone, been loved by someone.\n\nI will fail. 6 therapists, 3 psychiatrists, 4 counsellors, 3 mentors and 15 drugs latter. Still, I am broken.\n\nThis is all to say. People fail. People lose and die. I do.\n\nMy message, and yes it goes counter to the ethos of this sub - is this:\n\n\"Some people are unfixable, they are just too broken. Some conditions are terminal. People die from depression, from anxiety, from trauma. People die from a crappy childhood, from cruel parents. It's a horrid fact of life. People or fragile, and children more so. People choose the noose or the gun or the pills for a reason. Those people that choose that way out, they did not kill themselves, depression killed them. Anxiety killed them. Trauma killed them. And those that say \"it gets better\" - it's torturous\". Sometimes it doesn't. I wish so much, in the world, as a cynic. That the optimist where right, that it was I that am disillusioned. But some things can't be fixed, some things cant be undone. Once that square turns black, that day is sealed.\n\nIt's the empty boxes that hurt the most. They say when you die, your whole life flashes before your eyes. Each every time I tried to die, drifted into a sleep, it was not the filled boxes that I thought of, but all the white that I never got to fill. The same is true of everyone I know who tried to find an end, and failed in their endeavour.\"\n\nThis is probably dissatisfying to you - just think for a few seconds, a minute, about the fact that people fail. That I will fail. See the world as it is, it might help. See how little time there is, how small and reducible a life is. Mostly, do not do as I have done.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/llfslp/this_is_my_life/", "title": "This is my life", "social_network": "reddit", "user": "amenteco", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1613515696, "permalink": "/r/DecidingToBeBetter/comments/llfslp/this_is_my_life/", "nsfw": false, "first_save": 1635436404.6373594, "replies_charged": false}