{"id": "t5_2tand_t3_q7zymo", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "ae1f8c6a-a092-4d44-9c65-df014de8e434", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "There’s two points I want to reflect on in this blog.\nFirstly, I return to our old friend, Fear.\nThis week I read The Fear Bubble, by former SAS fella, Ant Middleton.\nThe premise of his book is really applicable to all ‘scary’ situations in life, like the prospect of an up and coming fight.\nMiddleton explains that before going on any operation/tour, he’d begin to feel the trepidation weeks in advance. His adrenalin would course through his system, his heart rate and breathing would increase – he allowed the fear in his mind to elicit a physiological response, even although (pre-deployment) he was sitting in the safe confines of his family home and nowhere near the danger zone.\nHe realised that this very reaction, and state of being, was of no help. He opted to, in effect, compartmentalise it.\nInstead of worrying about the inevitable firefights for weeks before, he’d visualise that specific situation, a time and place - with a bubble around it. Everything before and after the bubble was fine. Nae danger, as they say (and no need to let your imagination, and heart rate, run wild.)\nOnce you step into the bubble, you’re embracing the fear - then all adrenalin can kick in.\nIt’s really about concentrating and channeling all the primal power and massive force of flight or fight into where and when it matters. Letting fear run wild weeks before is, in all likelihood, going to leave you exhausted, crabbit and frayed. It is what it is - and worrying about things in the weeks, days and hours before will change nothing in the moment.\nIt’s what happens in the moment that counts - and in the cool, reasoned preparation to the moment. \nSo I’ve been compartmentalising too. \nI’m feeling very relaxed, at the moment, and instead of thinking about the negative factors I mentioned in the last post, I’m enjoying the journey. Really enjoying the journey.\nAnd why should my thoughts be negative?  It’s a possibility I could be knocked out. But it’s also a possibility, as is my resolute intention, I could unleash all the steam, the power, the strength and the knowledge I’m harnessing now – combined with the adrenalin of stepping into the ring (which will be encased in a big, shiny, imaginary bubble). Who knows, I could pull off an inspiring, battling win . . .\nI’m daring to dream, but focussed on taking concrete steps to do all I can to make that reality.\n \nOn that note . . . \nThe other point I just want to reflect on is that I’ve hardly touched any alcohol this week (two glasses of red wine with dinner on a Saturday. My sugar has been limited too.)\nI feel fresher, sharper no any residual grogginess from the generous night cap I usually enjoy of an evening.\n \nFinally, going back to Ant and fear, he’s provided a great analogy. It’s similar to Cus.\nInstead of fire, Ant likens fear to a wild horse.\nIf you don’t harness it, it will kick you about, boot you in the face.\nIf you get on that horse and control it, it will propel you to amazing places.\n I feel I’m on it now. I’m feeling positive.\nThis coming week’s about harnessing that momentum, staying off alcohol, continuing to balance hard training with adequate rest and rehydration.\nI’ve sewn the seed to get a few rounds proper sparring done with some hardened campaigners. Lets see where that takes us.\nUsing the bubble, in the meantime, is keeping me relaxed.\nFear is a time and a place.\nThe bubble is slap bang, right there in the middle distance. It’s not now - and I want walk into that bubble with the gait of a man who’s capable of taming wild horses.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q7zymo/dealing_with_fear_my_journey/", "title": "Dealing with fear - my journey 🥊", "social_network": "reddit", "user": "RhubarbContent9665", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1634218901, "permalink": "/r/DecidingToBeBetter/comments/q7zymo/dealing_with_fear_my_journey/", "nsfw": false, "first_save": 1635435078.4177053, "replies_charged": false}