{"id": "t5_2tand_t3_kj8018", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "Wake up. New Day. Breathe. Do something Different. Do one of your habits in different order, see the change that it has on the rest of your day.\n\nWe are blessed, **highly favoured**. \n\nWe all deal with hardships, we all have things in our life that try and push us down but allow us to become resilient to push back and get **UP**. Today, GET UP. STAND UP. FOR YOU. YOU ARE VALID. YOU ARE LOVED. YOU ARE CARED ABOUT. By The Divine, God, The Universe & By Your Peers. \n\nCount your Blessings. Say thank you for being allowed to wake up today, to start new; Give it your all and leave it ALL ON THE FIELD, its the only way.\n\nSome days start slower, some days start fast, some days you might feel like wanting to do nothing, some days you might want to do it all; Have some fun during your day but remember; **THE AMOUNT OF WORK DONE WILL GUIDE YOU ON THE SPEED OF WHERE YOU WANT TO GO.**\n\n**Take your time. Go Fast. Its Up to You.**\n\nEveryday I make sure that I am doing a few things that are fun, getting outside, bike rides, playing video games, meditating. Its amazing the amount of energy that can come from meditating from Outside of Ourselves. It takes time, it takes practice and I am constantly practicing, everyday, every moment.\n\nIts Our Turn. The year is about to switch over, but don't wait until it hits \"January 1\", to start your goals, \"resolutions\", **START THEM NOW.** Write a list down and start working towards 1, right now in this very moment. You can. Something that always helps me, is recognizing that if I do 1 thing towards my goal, passions, crafts, mental health; then I am progressing and thats all that matters. Moving Forward, Evolving, Progression. The Path is day to day, consistently, rather than one day here, one day there. Obviously you don't have to do EVERYTHING everyday and can take breaks in between days, but that will allow you to focus on other things in between those \"break days\".\n\nToday: Do Something New. I believe in you. I believe in us.\n\nI love you.\n\nDrey <3", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kj8018/it_starts_now_72/", "title": "It Starts Now (72)", "social_network": "reddit", "user": "striclyspoken", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 18, "down_vote": 0, "creation": 1608781308, "permalink": "/r/DecidingToBeBetter/comments/kj8018/it_starts_now_72/", "nsfw": false, "first_save": 1635435583.218747, "replies_charged": false}