{"id": "t5_2tand_t3_izl9pw", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "I was in elementary school during the 2008 economic crisis. My father lost his job and my mom's hours were slashed down to next to nothing. It was hard. My parents would often choose between food and bills, keeping us kids out at the park late to avoid the conservation of why no water was coming out of the taps. We kept our house though thank goodness. \n\nI've always been... I guess resentful of those years? I'm now weird with food because of my mother's attitude at the time. We would get yelled at and called greedy for eating at a time that wasn't a scheduled meal. I understand why now but at 9 I didn't. I have symptoms of previous food insecurity like hiding food and keeping food in my room. My parent's credit score sucks and that prevents me from financing college in the same way as my peers. \n\nBut a few days ago I was walking down the street downtown and saw a homeless man sitting at a table at a closed restaurant. I gave him an extra hand sanitizer that I had and we started talking. He told me his whole story about how he's a homeless vet with cancer. No more than a few years to live if that. The system is preventing him from getting any help because without an address he can't apply for any. He gets 300 dollars a month in social security and that's it, most of which he spends at restaurants to be allowed to sit on their patios.\n\nI went to work the next day, I work at a grocery store, and bought him 10 dollars worth of cheap food like peanut butter, bread, canned vegetables, beans,  cereal, etc. I'm planning on getting some 3in1 shampoo/conditioner/body wash and some vitamins and pain killers for him. Maybe some art supplies? I assume he must get very bored so some entertainment might be nice.\n\nBut regardless this made me realize my life is not as bad as I think it is. I'm not homeless, I may not have much but I do have an extra 10 dollars that other people don't. I have a job and a roof and a car and while I work very hard to maintain those things, some people don't have the opportunity to have them at all. My hand I've been dealt hasn't been great but at least I got a hand at all. \n\nI'm gonna start taking the time to be more appreciative of that. I'm going to start trying to be more grateful and more thankful of everything I have. I have a lot but I'm always worried about what I don't, I've always got a borderline victim mentality. I'm not gonna do that anymore. I'm gonna stop letting my attitude hold me back and instead see my situation as a springboard, not an anchor.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/izl9pw/i_had_an_enlightening_conversation_with_a/", "title": "I had an enlightening conversation with a homeless man", "social_network": "reddit", "user": "Toadjokes", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 339, "down_vote": 0, "creation": 1601046864, "permalink": "/r/DecidingToBeBetter/comments/izl9pw/i_had_an_enlightening_conversation_with_a/", "nsfw": false, "first_save": 1635435561.6450436, "replies_charged": false}