{"id": "t5_2tand_t3_os25f7", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "I'm not happy, haven't been for a long time. I need things to change and I feel like these are the areas where I have problems:\n\n\\- Trouble making friends, especially in a small town. I'm quiet and don't know how to let my personality shine and put myself out there. I can't seem to find the friends that I mesh well and where we have things in common.\n\n\\- I am sometimes stuck in the past, thinking about old high school days or my early 20's and crap that went on back then which is not even relevant now. \n\n\\- Never had a boyfriend or any dating experience, guys just aren't interested in me and never have been.\n\n\\- I tend to sit at home a lot, which seems to be terrible for my mental health because all I see is everyone on social media living their best life with friends/parties/get togethers and it really gets to me and makes me feel like life is passing me by.\n\n\\- I do have a problem with my moods, I'm on antidepressants and sometimes I have very low points where I want to cry and other times I just want to make jokes, dance and have a good time.\n\n\\- I absolutely hate my job in health care. I've been at the same job for 5 years and I'm working on resumes to move on to something else.\n\n\\- I believe I have social anxiety, fear to speak up or say something wrong or people will judge me for it.\n\n\\- I struggle with my weight and eating habits, I yo-yo diet and I think it contributes to my moods and emotional habits. I am overweight for my height.\n\n\\- I plan on going back to school, I had to drop out in March because of COVID and I could not teach myself at home. I was really struggling. SO that has pushed my life plan back a few years. I'm really upset about that to.\n\nAny advice on how to make some changes, Sorry its such a long list. There is definitely more but I don't even know where to begin!!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/os25f7/how_do_i_go_about_reinventing_and_changing_my/", "title": "How do I go about reinventing and changing my life at 27 years old, any advice?", "social_network": "reddit", "user": "Dogs-are-life-99", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 26, "down_vote": 0, "creation": 1627316440, "permalink": "/r/DecidingToBeBetter/comments/os25f7/how_do_i_go_about_reinventing_and_changing_my/", "nsfw": false, "first_save": 1635438212.6282747, "replies_charged": false}