{"id": "t5_2tand_t3_nxufa1", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "I am diagnosed with bipolar disorder but stopped taking my meds about 6 months ago because I thought I could handle all the ups and downs on my own, also partly because from taking my meds I was finally at a stable place and felt like I no longer needed them. I was a constant smoker of weed (an every day occurrence, multiple times a day if not all day long). I would smoke during my work days and on my breaks, then come home and continue smoking (mostly dabs and THC carts but also the occasional flower).\n\nA few months ago, I had a scary experience happen after taking four huge hits off of a coworkers cart at work. Nothing felt real and I started getting very paranoid. It went away after my high wore off, so I wasn’t too worried about it having to do with the manic side of my bipolar disorder. It didn’t happen every time I smoked weed so I just shrugged it off as being a one time thing but boy was I wrong. It started happening more frequently and even started happening when I hadn’t smoked at all. It all came to a head about a week ago now when I had another scary experience happen (when I hadn’t smoked any weed for two days straight). \n\nIt was nighttime and I was trying to fall asleep but couldn’t due to closed-eye visuals (mainly geometric patterns) I would get every time I shut my eyes to go to bed. I would look over at my boyfriend’s face and all of his facial features would disappear. I would look in the corner of the room and the door would start to disappear. I got so scared I started crying and my boyfriend had to turn on several lights in order to calm me down. It was then in that moment of pure terror that I decided to go into the bathroom and take one of the pills from my medication bottle. It was in that moment of complete and utter fear that I decided to stop smoking weed for the time being until I get back on my feet.\n\nAs of right now, I am 9 days clean from smoking weed and have been back on my meds for 8 days now. I guess what I’m trying to get at is that for a long time, I was in denial about needing my meds because of feeling like I could handle what I was going through on my own. I now realize that needing medication isn’t something to be ashamed or embarrassed about. If you or someone you know is in the same position I was, please don’t be ashamed of needing that extra something (medication) to help you/them live your/their life. And please, for the love of God, do NOT discourage anyone from doing something (as long as it’s safe and healthy) they believe will help them in the long run. 😊", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nxufa1/decided_to_go_back_on_my_meds_and_stop_smoking/", "title": "Decided to go back on my meds and stop smoking weed for the time being", "social_network": "reddit", "user": "GoldenDog1112", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1623458145, "permalink": "/r/DecidingToBeBetter/comments/nxufa1/decided_to_go_back_on_my_meds_and_stop_smoking/", "nsfw": false, "first_save": 1635435800.65939, "replies_charged": false}