{"id": "t5_2tand_t3_op4bus", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "\nMy parents gave me[29F] awful examples of communication, on a regular basis. Everyone CONSTANTLY  interrupted each other and disagreements we’re almost always screaming matches. Until 4 years ago, I have never been in a healthy(non-toxic) relationship. Once I met my current SO, my communication quickly became a problem. \n\nI am currently in an AMAZING relationship with the man of my dreams. We have two BEAUTIFUL children and a whole lotta love to go round. Like every relationship, though, we have our disagreements and arguments. In the whole 4 years, I have made LITTLE progress improving. Y’all, FOR THE LIFE OF ME I cannot successfully communicate during arguments or disagreements. Aside from this hiccup, our relationship is incredible. Whether I’m not capable of letting him finish a sentence when disagreements/ arguments take place or I am immediately defensive and raising my voice in arguments. He is so important to me and I want nothing more than to improve my communication skills, for us. I’ve tried to just shut up and as soon as I disagree with something he has said….I just pen my mouth, without even letting him finish. Sometimes, I will catch myself as the words leave my mouth and I immediately stop interrupting. But it doesn’t happen enough to be considered “progress.” \n\nObviously, what I am doing isn’t working. However, at this point I NEED TO DO BETTER. When I don’t properly communicate, it makes my fiancé feel invalidated. THIS IS NOT OKAY! He needs to feel just as respected as I do. \n\nWith that being said…\n\nWhat are some things I can do to DRASTICALLY improve my communication skills…or lack there of. He means far too much to me to continue doing something I have had ample time to improve.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/op4bus/how_can_i_learn_to_drastically_improve_my/", "title": "How can I learn to DRASTICALLY improve my communication skills?", "social_network": "reddit", "user": "Little_Pumpkin1005", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1626919323, "permalink": "/r/DecidingToBeBetter/comments/op4bus/how_can_i_learn_to_drastically_improve_my/", "nsfw": false, "first_save": 1635435383.3477309, "replies_charged": false}