{"id": "t5_2tand_t3_pe7gtw", "request": ["b69cf201-6737-4217-b486-9096135546b8", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "I've been having a tough time for almost a year. Diagnosed with depression and i think I may have social anxiety. \n\n\nI have two psychiatrists. One of them is a classic teenager psychiatrist, had two appointments with him. The first appointment was so awkward but I was comfortable in the second one. The other one is for ptsd. She's gonna help me cope with my trauma. My first appointment with her is on 11th Sep. \n\n\nI'm a 10th grader. My school will start tomorrow (31st Aug). It is hard to socially interact with anybody this way.\n\n \nI'm just gonna write down my goals. I believe if I know what to do, I can do it easier. Also people are so supportive here.\n\n\nFirstly I want to keep my room clean . I'm a messy person so when I want to procrastinate cleaning my room is a perfect excuse. After cleaning it, it gets messy in just a few days. It is now messy. I will clean it when I wake up. It is 2 am right now, that is another problem.\n\n\nThen I want to keep myself clean. Most of the time I have no energy to take care of myself but I will force myself to cause I feel more confident when I'm clean. \n\n    -Taking shower at least thrice a week. If I have to choose days, they would be Tuesday, Friday and Sunday. \n\n    -Brushing my teeth at least thrice a day. My teeth are yellow and my breath smells. It makes me insecure.\n\n    -Using my teeth thingy (forgot it's name, the thing that is used after getting braces off) at a time without slipping a night. 12 am is ideal. \n\n    -Brushing my hair everyday. My hair is long and even if I don't brush it for two days it gets messy. I go for weeks without brushing it ( ͡ಥ ͜ʖ ͡ಥ) \n\n    -Cutting/filing my nails once a week.\n\n    -Waxing/Shaving once a week.\n\n    -Having a skin care routine. I have to research to find the best products for myself.\n\n\nI want to be fit and stay like that. Now I'm 168 cm and 60 kg. My goal is to be 170 cm and 55 kg. I want to have abs, thin legs, arms and waist. In the comments don't be like \"LoVe yOuR bOdY\". Nothing's gonna change when you comment that. \n\n     -Chloe Ting and Emi Wong's workouts work on me well. I tried them before and got results but stopped doing them due to my laziness. \n\n     -I can also go cycling. \n\n     -Idk if subliminals work but I can try some of them too.\n\n    -Dancing. Kpop and 1MDS choreographies are fun to learn.\n\n    -Stretching. Anna Mcnulty's videos are great i think. I'm gonna start doing them again.\n\n\nEating healthy and drinking lots of water. I will quit eating junk food and I will drink at least 2 liters of water per day. I usually don't eat breakfast, should change that. And I will avoid late night snacks\n\n\nI want to study regularly, fulfill my responsibilities and be a successful student. I want to take notes with a good hand writing then actually read them. Gonna try to use pomodoro technique. \n\nExcept school, I want to improve my English. Learned it while watching English content. I can improve it watching English content or reading English articles.\n\nFor my 3rd and 4th language, German and Korean. I sometimes watch Korean content on youtube but couldn't dare to learn it. I study German at school. If I pay attention I can do it. Internet would help too. Never paid attention in English, ended up learning it from the internet. \n\n\nHaving a regular sleep schedule. I want to sleep at 11:30 pm and wake up at 7:00 am. I have no chance because of school.\n\n\nI want to wear what I like, what I am comfortable with and be confident. I like following fashion channels but I almost don't have anything to wear in my closet, I mean it. Not like we are broke but I hate shopping. It makes me feel anxious. I am planning to shop online. \n\n\nPlaying the piano everyday. I am pretty good at it but I want to get better at it.\n\n\nAnd the things that are not very necessary but I just want (to):\n\n-A friend \n-Social skills\n-Sew stuff\n-Sing more often\n-Do puzzles\n-Grow plants\n-Feed random street animals\n-Be a street smart person too \n-Find new songs, films, books to have fun\n-Learn how to play ukulele\n-Learn how to draw\n-Learn how to cook\n-Learn to do new hair styles \n-Learn, experience and improve stuff in general\n\nThis is gonna be hard but I will do it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pe7gtw/i15f_decided_to_try_to_get_myself_together_again/", "title": "I(15F) decided to try to get myself together again. No giving up this time! (Hopefully)", "social_network": "reddit", "user": "thehwitam", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1630283976, "permalink": "/r/DecidingToBeBetter/comments/pe7gtw/i15f_decided_to_try_to_get_myself_together_again/", "nsfw": false, "first_save": 1635436445.9988828, "replies_charged": false}