{"id": "t5_2tand_t3_8gpk0u", "request": ["d16532c7-3c5c-45c4-ab79-168cb2cfbb61", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I found this article to be quite helpful and inspiring and a perfect fit for this sub. You can read the original on his [website](https://www.stevepavlina.com/blog/2005/03/cultivating-burning-desire/).\n\n# Cultivating Burning Desire\n\nWhen asked during an interview how he managed to reach the top as a  professional bodybuilder and Hollywood actor, Arnold Schwarzenegger  replied with a single word, “Drive!” All great success ultimately begins  with an idea, but what makes ideas become reality is the fuel of human  desire. An idea by itself can give you a temporary feeling of  inspiration, but burning desire is what gets you through all the  perspiration necessary to overcome the inevitable obstacles along the  way.\n\nTake a moment to think about the goals you’ve set for yourself. \\(You  have set goals, haven’t you? If not, go read the article on [setting clear goals](https://www.stevepavlina.com/blog/2005/03/the-power-of-clarity/).\\)  How committed are you to achieving these goals? Under what conditions  would you give up? What if you could significantly increase your desire  to achieve these goals? What if you wanted them so badly that you knew  with absolute certainty that you would absolutely, positively never ever  give up? When you are truly 100&#37; committed to reaching your goals, you  move from hoping to knowing. If you want something badly enough, then  quitting is simply not an option. You either find a way or make one. You  pay the price, whatever it takes.\n\nThose with an intense, burning desire to achieve their goals are  often referred to as being “driven.” But is this special quality  reserved only for a privileged few? Certainly not. With the right  approach, anyone can cultivate a deep, burning desire within themselves  and move to a state of total commitment, knowing with certainty that  success is as inevitable as the sunrise.\n\nSo how do you cultivate burning desire? You begin with an outside\\-in  approach, altering your environment in ways that will strengthen your  resolve while eliminating doubt. If you take the time to do it right,  you’ll establish a positive feedback cycle, such that your desire will  continue to increase on a daily basis.\n\nHere are eight steps you can take to cultivate burning desire to achieve any goal you set for yourself:\n\n### 1. Burn the Ships\n\nI’m not going to pull any punches with this one. If your goals are  really important enough to you, then you can start by burning the  proverbial ships, such that you have no choice but to press on. For  instance, if you want to launch your own business, you can begin by  making the commitment to quitting your job. Write a letter of  resignation, put it in a stamped envelope addressed to your boss, and  give it to a trusted friend with firm instructions to mail the letter if  you haven’t quit your job by a certain date.\n\nOne Las Vegas casino manager made the decision to quit smoking. He  didn’t feel he had the personal willpower to do it alone, so he took out  a billboard on the Las Vegas Strip with his photo on it along with the  words, “If you catch me smoking, I’ll pay you $100,000!” Was he able to  quit smoking? You bet! \\(Ok, bad pun.\\) This is called willpower  leveraging. You use a small bit of willpower to establish a consequence  that will virtually compel you to keep your commitment. As Andrew  Carnegie once said, “Put all your eggs in one basket, and then watch  that basket!”\n\nIn the classic book [The Art of War](http://www.amazon.com/exec/obidos/ASIN/0486425576/dexteritysoft-20),  Sun Tzu notes that soldiers fight the most ferociously when they  believe they’re fighting to the death. A good general knows that when  attacking an opposing force, it’s important to create the illusion of a  potential escape route for the enemy, so they won’t fight as hard. What  escape routes are you keeping open that are causing you not to fight as  hard?\n\nIf you don’t burn those ships, you are sending the message to your  subconscious mind that it’s ok to quit. And when the going gets tough,  as it inevitably does for any worthwhile goal, you will quit. If you  really want to achieve your goals, then you’ve got to burn those ships  to the ground, and scatter the ashes. If you’re thinking that the  average person won’t do this, you’re right — that’s why they’re average.\n\n### 2. Fill Your Environment with Desire Boosters\n\nLet’s say one of your important goals is to lose weight. Get some  poster board, and make your own posters that say, “I weigh X pounds,”  where X is your goal weight, and put them up around your house. Change  your screensaver to a text message that says the same thing \\(or to some  equally motivational imagery\\). Get some magazines, cut out pictures of  people who have bodies similar to what you’d like to have, and put them  up around your house. Cut out pictures of healthy food that looks good  to you, and post those around your kitchen. If you work in an office,  then alter your office in the same manner. Don’t worry about what your  coworkers will think, and just do it! They may poke a little fun at you  at first, but they’ll also begin to see how committed you are.\n\n### 3. Surround Yourself with Positive People\n\nMake friends with people who will encourage you on the path to your  goals, and find ways to spend more time with them. Share your goals only  with people who will support you, not those who will respond with  cynicism or indifference. If you want to lose weight, for instance, get  yourself into a gym, and start befriending those who are already in  great shape. You’ll find that their attitudes become infectious, and  you’ll start believing that you can do it too. Meeting people who’ve  lost one hundred pounds or more can be extremely motivating. If you want  to start a new business, join the local chamber of commerce or a trade  association. Do whatever it takes to make new friends who will help you  keep your commitment.\n\nAlthough this can be difficult for some people, you also need to fire  the negative people from your life. I once read that you can see your  future just by looking at the six people with whom you spend the most  time. If you don’t like what you see, then change those people. There’s  no honor in remaining loyal to people who expect you to fail. One of the  reasons people fail to start their own businesses, for instance, is  that they spend most of their time associating with other employees. The  way out of this trap is to start spending a lot more time associating  with business owners, such as by joining a trade association. Mindsets  are contagious. So spend your time with people whose mindsets are worth  catching.\n\n### 4. Feed Your Mind with Empowering Information on a Daily Basis\n\nInspirational books and audio programs are one of the best fuel  sources for cultivating desire. If you want to quit smoking, read a  dozen books written by ex\\-smokers on how to quit the habit. If you want  to start a business, then start devouring business books. Go to seminars  on occasion. I advise that you feed your mind with some form of  motivational material \\(books, articles, audio programs\\) for at least  fifteen minutes a day. This will continually recharge your batteries and  keep your desire impenetrably strong.\n\nWhen you absorb material created by an extremely passionate person,  you’ll often find yourself feeling more passionate as well. A great book  I read was [Pour Your Heart Into It](http://www.amazon.com/exec/obidos/ASIN/1565112334/dexteritysoft-20)  by Howard Schultz, the CEO of Starbucks. As I read the book, I was  absolutely amazed at how someone could be so fanatically enthusiastic  about coffee. Other enthusiasm\\-building authors/speakers I highly  recommend are Harvey Mackay and Zig Ziglar.\n\n### 5. Replace Sources of Negative Energy with Positive Energy\n\nTake an inventory of all the sensory inputs into your life that  affect your attitude — what you read, what you watch on TV, the  cleanliness of your home, etc. Note which inputs influence you  negatively, and strive to replace them with positive inputs. I’ll give  you some good places to start. First, [avoid watching TV news](https://www.stevepavlina.com/blog/2006/09/overcoming-news-addiction/)  — it’s overwhelmingly negative. Do you really need to hear about the  woman who was mauled to death by her neighbor’s dog? Fill that time with  positive inputs instead, like motivational and educational audio  programs. If you like to watch movies, then watch movies that are full  of positive energy, such as light\\-hearted comedies and stories of  triumph over adversity. Avoid dark, tragic movies that leave you feeling  empty afterwards. Dump the horror books, and replace them with humor  books. Spend more time laughing and less time worrying. If you have a  messy desk, clean it up! If you have young kids or grandkids, spend some  time playing with them. Some of this may sound a bit corny, but it will  really help increase your overall motivation. If you have a hard time  motivating yourself, chances are that your life is overflowing with too  many sources of negativity. It’s far better to *happily achieve* than it is to feel you must achieve in order to be happy.\n\n### 6. Dress for Success\n\nWhenever you pass by a mirror, which is probably several times a day,  you get an instant dose of image reinforcement. So what image are you  currently reinforcing? Would you dress any differently if your goals  were already achieved? Would you sport a different hairstyle? Would you  shower a bit more often?\n\nAlthough for years I enjoyed the ripped jeans and T\\-shirt look, I  noted that when I visualized myself in the future, having achieved  certain goals, I was dressed a lot more nicely. With some  experimentation I found a style of clothing that looks professional and  is also comfortable. So I gradually donated my old clothes to charity  and replaced my wardrobe with clothes that fit the new identity I was  growing into. \\(Consequently, there’s a Salvation Army store with quite a  stock of gaming industry T\\-shirts.\\) I learned this idea from an ex\\-Navy  Seal, who stressed to me the importance of taking pride in your  appearance, and I can say with certainty that it makes a noticeable  difference. So make sure the clothes you wear each day are consistent  with your new self\\-image.\n\n### 7. Use Mental Programming\n\nThis is a Neuro\\-Linguistic Programming \\(NLP\\) technique that will help  you associate strong positive emotions to whatever goal you’re working  to achieve. Find some music that really energizes and inspires you. Put  on your headphones and listen to it for fifteen to twenty minutes, and  as you do this, form a clear mental picture of yourself having already  achieved the results you want. Make your imagery big, bright, vivid,  colorful, three\\-dimensional, panoramic, and animated. Picture the scene  as if looking through your own eyes \\(this is very important\\). This will  help you form a neuro\\-association between the positive emotions elicited  by the music and the goal you want to achieve, thus strengthening your  desire. This is a great way to begin each day, and you can even do it  while lying in bed when you first awaken if you set things up the night  before. You should cycle the music periodically, since the emotional  charge you get will tend to diminish if you listen to the same songs  each time.\n\nKeep in mind that this form of mental programming is already being  used on you by advertisers. Watch a fast\\-food TV commercial, and you’ll  note that the food is big, bright, and animated — spinning burgers,  lettuce flying through a splash of water, ripe tomatoes being sliced —  and don’t forget the catchy tune. So instead of letting others program  your desires for you, take charge and mentally reprogram yourself.\n\n### 8. Take Immediate Action\n\nOnce you set a goal for yourself, act immediately. As you begin  working on a fresh new goal, don’t worry so much about making detailed  long\\-term plans. Too often people get stuck in the state of analysis  paralysis and never reach the action stage. You can develop your plan  later, but get moving first. Just identify the very first physical  action you need to take, and then do it. For instance, if you’ve decided  to lose weight, go straight to your refrigerator, and throw out all the  junk food. Don’t think about it. Don’t ponder the consequences. Just do  it immediately.\n\nOne of the secrets to success is recognizing that motivation follows  action. The momentum of continuous action fuels motivation, while  procrastination kills motivation. So act boldly, as if it’s impossible  to fail. If you keep adding fuel to your desire, you will reach the  point of knowing that you’ll never quit, and ultimate success will be  nothing more than a matter of time.\n\nIf you apply these eight strategies, you’ll add so much fuel to your  desire that the fire will never burn out. You’ll move towards your goals  like a guided missile to its target, and you’ll enjoy the process  because you’ll be so focused on the positive rewards instead of the  difficulty of the tasks. If you get enough positive energy flowing into  you, you’ll soon have positive results flowing out of you. And you’ll  quickly become the kind of person that others refer to as “driven.”", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8gpk0u/cultivating_burning_desire_by_steve_pavlina/", "title": "Cultivating Burning Desire by Steve Pavlina", "social_network": "reddit", "user": "DrHackenstein", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1525345846, "permalink": "/r/DecidingToBeBetter/comments/8gpk0u/cultivating_burning_desire_by_steve_pavlina/", "nsfw": false, "first_save": 1635437638.5711584, "replies_charged": false}