{"id": "t5_2tand_t3_pa9v9b", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "This post centres around the drama that I have created for myself in a seasonal trailer Campground.\nMy step sister, who is also in the same Campground, has been going on a downward spiral from drinking. My spouse and I, decided in May to separate ourselves from her and her family. There was just too much drama and we were getting pulled into it.\nPrior to distancing ourselves, we always hung out together at the trailer park. I wasn't too worried about not having anyone to visit with, because we talked to a lot of people at the park.\nI have been eagerly trying to be included in the \"cool group\" of people at the trailer park. They are always friendly, but it has become obvious that we will never be close to them like I want to be.\nI have been experiencing a lot of anxiety and depression lately. After a lot of soul searching,  it appears that I have put a lot of myself into trying to be a part of the \"cool group.\"  More than I thought, but it has became my hobby to ruminate about this \"cool group. \" Prior to covid,  I was a very social outgoing person.  I worked in a large office for 10 years and knew a lot of people.  Working from home, has changed a lot of things and I missed my co-workers.  The step- sister that I \"broke up\" with,  was always there for me though.  But, now it feels like I have no one.  I have my spouse,  but he also feels the same way bc my step sister's husband was his best friend.  We are both in our 40's, we are suppose to be too old for this! But, we both miss having close friends. \nSo, I  realized that I need to move on and find new friends.  But, I feel like crap. \nI am valuing myself too much based on having friends.  I never use to care if people liked me.  I was solid, I knew I was awesome.  But,  now my insecurity is as low as it was in grade 6. I am finding that I am doing embarrassing things to try and make people like me!  I feel like no one likes me, they just say hi to be polite. I am full of self doubt.  I over think everything,  even if I should walk the dog.  \nI want to be confident again.  I don't want to care anymore that the \"cool group \" doesn't want to be friends with me. I want to be able to walk my dog around the trailer park without ruminating about it the whole time.  I just don't know how to? \nI feel like I have lost my identity.  \nI know I am depressed.  Already on meds and spoken to  my Dr about it. But, food doesn't taste good anymore,  I have no motivation to do anything except ruminate about this. \nI have dealt with decades of depression,  I know I need to make changes and force myself to be more active... but our heatwaves have not been helpful. \nI think I know what I need to do,  but I would love some positive advice on how be ok with me. \nBelieve it or not, this is the Coles Notes edition. There has been some other family relationships that have ended during this time,  that have been very hurtful.  I found this when I reached out other family members to try to build relationships with... these are family I didn't think I had any issues with... and, basically shut me down.  \nThis is where the doubting myself comes in.  What have I done?  Was I mean to them in the past? What have I done or what am I doing that people don't want to be friends with me?  \nI am just so confused and don't want to not leave my house.  I am afraid to talk to people because I am afraid I will do something wrong.  \nI'm such a emotional mess. So many hurtful thoughts. \nThank you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pa9v9b/i_have_lost_who_i_am_and_dont_know_how_to_find_me/", "title": "I have lost who I am. And, don't know how to find me?", "social_network": "reddit", "user": "BBKall", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1629756021, "permalink": "/r/DecidingToBeBetter/comments/pa9v9b/i_have_lost_who_i_am_and_dont_know_how_to_find_me/", "nsfw": false, "first_save": 1635436459.8175635, "replies_charged": false}