{"id": "t5_2tand_t3_em9f4c", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": " \n\nFirst of all if you read this I appreciate you.\n\nLast  September I quit my job, broke up with my girlfriend of three years,  and moved 800 miles away to a different state with no plans back home  with my mother. This is all on me. I graduated with a useless degree,  criminal justice, in a field I have zero interest in. (maybe there are  jobs out there I could get, I don't know) I have no desire to work in  law enforcement. I would honestly be betraying who I am as a person if I  worked in law enforcement.\n\nBackstory:\n\nThe  truth is, I HATED myself the first 24 years of my life. I was abused by  an extremely narcissistic, religious, cultist father. My mother moved  away when I was very young. This caused me to form an extremely poor  personality. (I'm going to avoid the whole special snowflake shit now)  I'm just giving backstory so I'm not asked why I'm in the position I'm  in. I essentially suffered mental health issues throughout university. I  lived on my own from 18-24 with incredibly toxic roommates that stole  from me, trashed apartments, and left. I was being ridiculed and worked  like a mule by my father during this whole time. When I was about to go  no contact he was diagnosed with cancer. I dropped out of school for a  year and worked. My free time was spent with him at the hospital, or  with my now ex. During university I managed to get fired from a job at a  car dealership, which is on me, and get fired from a delivery job,  which was also on me. I went back to school to finish my final year. I  did. I graduated with my bachelor's. During my last year I worked a  manual labor job with an incredibly toxic, and racist employer. He drove  all his other employees away during this time except for one kid I grew  close with. This whole time I smoked weed like a chimney and drank like  a fish. I was heavily addicted to porn too. I was the walking poster  child for C-PTSD.\n\nThe start of  2019 was the changing point in my life. After a series of events that I  will not go into I had a revelation of why my life had been so fucked  up. After graduating in winter 2018, I continued to work at this job  with my horrible, but tolerable employer and this kid. The kid overdosed  on heroin so it was just me and my boss again. I was doing the job of  three employees alone. But when 2019 I had planned that was it. I'm out  of here. I understand that how I grew up wasn't my fault but it's my  responsibility. I went no contact with my father a year ago. The whole  time was rough. I tried to work things out with my ex but we were just  too different. I realized it was abusive and the only reason I stayed  was because I had no self esteem. I saved up, my 25k in student loans  wasn't due yet, and moved back home in sep to live with my mother. I  broke up with my gf before I moved. My one roommate who I lived with for  four years, who I thought was a friend, never texted or called me since  moving. He still owes me last months rent, security deposit, and a  bunch of other money for furniture I left them. I cut pretty much  everyone out of my life because pretty much all my relationships were  built on low self esteem and me being a doormat.\n\nSo,  I'm 25. I have no friends. I'm broke. No gf. I have about 25k in debt. I  do have a job, but it's only part time now. I have a therapist I can  pretty regularly go to. Over 2019 there were a lot of self realizations I  came to. I would like to write for work. I would like to learn  psychology and conduct research on mental health, focusing on possible  psychedelic treatments for ptsd and c-ptsd (would require a phd). I  would like to advocate for changes in the mental health field and drug  laws. I no longer smoke weed at all. I drink rarely. I am kicking my  addiction to porn too. The thing is I think I like myself now. It's  taken a year of shedding. I literally have started over people. Like I  can't tell you. I packed my car with what I could fit in it and left.\n\nI  cut everyone out of my life. Spent all my money. Currently working on,  and did beat many addictions. Ended my 3+ year toxic relationship. Cut  out my abusive side of the family. But like...all I have are ambitions  now. I am signed up to take a semester of non-degree psych classes. I am  interested in pursuing a PhD. The problem is I'm trying to get  qualified for that. I also have a GRE scheduled for april. Since it's a  non-degree program I am not eligible for aid. My options seem to be,  hustle and stress myself out and make the payment plans while in school,  talk to them about signing on as a bachelor and seeing if I qualify, or  drop out and hit it again later. I am also currently working on  finishing a second draft of a screenplay I wrote in March. I am learning  mycology in my free time as well. Just tell me what I'm doing wrong  because this all feels very slow. Maybe I am going in the right  direction. I don't know. I've been in a fog of dissociation my whole  life.\n\nTl;dr - I fucked my life up and I'm trying to fix it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/em9f4c/25_and_its_all_pretty_much_fubar_i_have_no_one/", "title": "25 and it's all pretty much FUBAR. I have no one else to ask so any words of wisdom are welcome.", "social_network": "reddit", "user": "Throwawayfubar25", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1578575408, "permalink": "/r/DecidingToBeBetter/comments/em9f4c/25_and_its_all_pretty_much_fubar_i_have_no_one/", "nsfw": false, "first_save": 1635438361.2331188, "replies_charged": false}