{"id": "t5_2tand_t3_l2fh9q", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "This is a long one and I'm not a writer by any means, I apologize if I start rambling.\n\nOn January 8th I was on day four of dealing with a terrible chronic pain flare up, and I was sick of the same old routine of sitting around and doing nothing all day but scrolling on my phone because I didn't work and I never had the energy for anything. I decided right then and there that I was going to quit social media for the next 30 days and work on my three(ish) goals:\n\n* Declutter my apartment and start a minimalist lifestyle\n* Have a set daily routine/sleep schedule\n* Treat my body better by eating healthier and be more active\n\nSomething clicked in me and I spent the next few days cleaning up my entire apartment. I took three giant tub fulls of stuff to Goodwill(a lot for my small apartment), and am still in the process of going through stuff in my storage unit. My apartment really hasn't ever looked better.\n\nI eventually worked on my daily routine and sleep schedule, luckily I had started sleeping better already because of all the work I was getting done during the day. Mornings have always been tough for me so I really try and just immediately eat breakfast and do the dishes to get it over with. I've also been trying to start winding down an hour before I go to bed by drinking tea and listening to soft music. I haven't slept this well in probably years, I've always had an incredibly hard time falling asleep and getting up in the morning. I also started working part time for a food delivery service and been able to help our savings account a TON. It also helped me with my self esteem because I don't feel like I'm a total waste of space anymore and I'm contributing again.\n\nI started the fitness aspect by running every other day. 6 months ago I decided to start running with the Couch to 5k program, and I got all the way up to week 4 out of 8 before I fell off the wagon. To my surprise when I went for a run the other day, I was able to pick back up where I was when I stopped months ago. I feel absolutely amazing being the kind of person to be able to just \"go for a run\" because I have never been an active person in my life. I've gain some weight in the last few years and my goal is to lose that in a healthy way, I've kept myself to only a couple snacks a day and started giving myself smaller portions.\n\nI've tried so many times in my life to turn it around and didn't follow through every time but this year I really want to stick with it. I'm hoping to create a really good foundation for myself by having a plan and knowing that if I did it once I can do it again. I haven't been tempted at all to get back on social media, in fact, I want absolutely nothing to do with it and am so ready to just delete them all. Although, I am moving to a different country in a few months and don't want to just completely disconnect for my family but that's a whole other can of worms I don't want to open until the end of the 30 days.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l2fh9q/i_completely_turned_around_my_daily_life_two/", "title": "I completely turned around my daily life two weeks ago.", "social_network": "reddit", "user": "rosegoldensun", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1611287770, "permalink": "/r/DecidingToBeBetter/comments/l2fh9q/i_completely_turned_around_my_daily_life_two/", "nsfw": false, "first_save": 1635438251.2587373, "replies_charged": false}