{"id": "t5_2tand_t3_crompd", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "A few years ago, my abandonment issues and low self-esteem ruled my life. They impacted every aspect but most importantly my relationships. I don’t regret anything I went through because I had to go through them to get here and I learned a lot that I would like to share. \n\nListen to red flags. My first boyfriend wasn’t a good boyfriend. The red flags were there from the beginning and I didn’t listen to them. He was possessive and that became very apparent when I went to college. He didn’t have his life together (we were young so it’s whatever) but he was 4 years older than I was and I got into the relationship the summer before college. When I went to school, he told me he had friends there watching me. He would keep me on the phone late at night and would be mad if I went out. Among other things, that contributed to my worst year of my life and falling into a huge depression. I didn’t break up with him but i should’ve. No one should control what you do or don’t do. I was complacent in the entire situation. We stayed together for a little over 2 years but eventually I realized I couldn’t live life being controlled by someone else. \n\nShortly after we broke up, i met my second boyfriend at a New Years eve party. He was nice and seemed to be the exact opposite of my first boyfriend. We started dating 2 months later and were together for four years. The first year was great as it was honeymoon phase. After that, i realized he had a problem with communication. He wouldn’t talk about anything serious and anytime i tried to bring something up he would ignore it and change the subject. Our relationship was great on a surface level but as we progressed through the years, i realized i was hiding myself so much because i feared he would leave me if he knew who i truly was. I was addicted to adderall during our relationship and it made me the person he wanted to be with. He was a workaholic and used any excuse to work late. I understood he was building his career and i was still in school so it caused a lot of issues. Our relationship ended after I fell snowboarding and couldn’t get down the mountain. He thought I was overreacting (since I was a hypochondriac in a lot of ways) and wouldn’t help me. He wouldn’t take me to a hospital until we got home 4 hours later and I badly sprained my ankle and was on crutches for 2 months. When we found out the results he said “see I told you it wasn’t broken”. I should’ve broken up with him there because he wouldn’t talk to me the whole ride home since I “ruined the trip” but I held on and blamed myself for not being good enough. We went on for a month after the situation and then he broke up with me. Our relationship should’ve ended years before that because he refused to talk about anything and I was afraid to be myself which is a true sign that we didn’t belong together. \n\nAt 25 I was single for the first time in my adult life. BecAuse of my life experiences I always needed attention and sought it in really unhealthy ways - through having someone around - no matter who they were. I had a few short flings during this time, all with people that were NOT good for me. I realized after self reflection that I couldn’t keep doing this. I needed to be okay with myself first and love myself before I could ever have a real relationship. I didn’t know what being alone was and I equated it to lonely but that’s not the case at all. Being alone is a beautiful thing and it helps you understand what you truly want in life. \n\nNow, at 28, I’m in a relationship with a wonderful man. We talk about everything and anything and I am never afraid to be myself with him. If there’s an issue, we bring it up and handle it. We barely fight but we communicate a lot. People would say it’s a problem we don’t fight but I don’t think that’s the case because we just handle things before the escalate to unnecessary places. We’re both very aware of what we want and have found that within each other as well. It’s a mature relationship (something I have never had) and now I realize all of the things that were wrong in my previous ones that I didn’t listen to. \n\nIf you have a relationship (romantic, platonic, familiar) I think it’s so important to be yourself in them. You are good enough as you are and if people don’t realize that, they’re not your people. You shouldn’t be afraid to be you and you shouldn’t be molded into someone you’re not out of fear that it’s not good enough for the other person. That person is not your person if they don’t like the real you and it’s better to figure that out sooner than later. Listen to red flags. Listen to your gut. If something feels off, I would explore it because every time I knew something before I would ignore it in hopes it would go away (hint: it doesn’t). \n\nYou deserve real love. Don’t settle for less.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/crompd/dont_settle_for_less_than_you_deserve/", "title": "Don’t settle for less than you deserve.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 31, "down_vote": 0, "creation": 1566060633, "permalink": "/r/DecidingToBeBetter/comments/crompd/dont_settle_for_less_than_you_deserve/", "nsfw": false, "first_save": 1635436059.2200603, "replies_charged": false}