{"id": "t5_2tand_t3_pk6lhd", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "so here’s the deal: i’m a horrible person when it comes to dealing with myself. with others, i’m the “therapist” friend; i make sure they’re okay and that i do anything i can for them, give them advice, gift them things, etc. \nbut when it comes to ‘self talk’, i’m so bad. i treat myself like shit sometimes, say horrible things, still trying to stop the “all-or-nothing” mentality etc. \nthe thing with self improvement is that we need to take it one step at a time.\nit took me so long to realise that- previously i used to have huge to-do lists, complex routines which ofc were not sustainable and led to failure.\nbut i have decided that i will just focus on getting better than yesterday, not repeating my mistakes and keeping relatively smaller to-do lists.\n\ni wanted to workout twice a day, cut out sugar, gluten and basically all junk, track calories, go on a run daily, get 10k steps, finish 3 books a month, study 8 hours a day, and learn french.\nsounds crazy right- and i’m still just barely 18.\n\n\nso here’s my plan:\nweek 1; workout once a day, get my steps in, stick to my calorie limit, study 4 hours and do 2 hours of french.\n\nweek 2; everything from last week+ workout twice a day, and running thrice a week \n\nweek 3: running 4 times a week, study 6 hours a day.\n\nand then progressively build up or do these daily. sunday’s a rest day tho)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pk6lhd/finally_working_with_myself_rather_than_against/", "title": "finally working WITH myself rather than AGAINST myself", "social_network": "reddit", "user": "hyunjinslatte", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 66, "down_vote": 0, "creation": 1631090519, "permalink": "/r/DecidingToBeBetter/comments/pk6lhd/finally_working_with_myself_rather_than_against/", "nsfw": false, "first_save": 1635436827.132759, "replies_charged": false}