{"id": "t5_2tand_t3_i35wxi", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "I'm 29M and have had a lot of ups and downs the past several years. A great relationship came to an abrupt end two years ago, and it took a while for me to get over it. This year, I was in a good place mentally and landed a new job in another country. I was excited to start a new life, live on my own, and meet new people. However, this pandemic caused my move to be delayed indefinitely, so now I remain living with my roommate until further notice.\n\nEspecially in relationships, I want to help my partner in any way I can, but as it  turns out, I am the textbook definition of a codependent person. This is one of the main reasons that my last relationship ended, and I've gotten better at it since, but it's creeping up on me again. I feel restless with not being able to start my new life yet, and it's giving me withdrawals about not being able to help others. I know that I should focus on myself, and there are things I've been wanting to do to keep me occupied. But I keep comparing it to the satisfaction that I would get for helping others, and it makes me lose interest in doing those things. Instead, I \"take it out\" on my roommate, satisfying my appetite by trying to make her happy. We have a romantic history, so we're much closer than normal roommates, but we were on the same page that we wouldn't get too attached to each other since I was moving. We were both good about it, and she's remained steady, but I'm starting to veer off course. I want to stop before it becomes even more unhealthy.\n\nI feel like if I were to start my new life now, I could be independent because I won't have any \"comfort zones\" to cling on to (friends, family, etc.), and I would be able to start healthy relationships. However, my bad habits are already returning, and I need to stop them before I hurt those around me (especially my roommate). How do I take the first step?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i35wxi/i_want_to_stop_being_codependent/", "title": "I want to stop being codependent", "social_network": "reddit", "user": "chidat", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1596489751, "permalink": "/r/DecidingToBeBetter/comments/i35wxi/i_want_to_stop_being_codependent/", "nsfw": false, "first_save": 1635438133.3064187, "replies_charged": false}