{"id": "t5_2tand_t3_iwy36i", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "Some changes in my life and my journey to improve myself.\n\n**Throw out/donate stuff unnecessary things and only keep the things I need or truly love so that I take better care of my belongings.**\nWhen I look back, I don't know why I kept some of them or why I found some items to be sentimental. A freebie frisbee I got when I ordered something, I'd never play with it and I don't even want it. I also had a lot of items given to me by friends who were moving. In the end, those things just cluttered up my apartment and gave me stress every time I looked at it. When I see something stressful, I try to avoid it or not think about it, so it'd only pile up and things would get messier. Now that I have decided to better myself, I've been able to fill up multiple trash bags and bid them all goodbye. You don't have to worry about a mess when there's not much around to make a mess. \n\n**New organizing system.** I feel pretty stupid for not having realized what I should have changed sooner. I have cleaned out my closet and drawers MANY times and no matter what I do, in a week or two it'll be disorganized again. Now that I've thrown away or donated clothes I know for sure I won't wear or need, I have more space and I can lay them out in just a couple rows and not stacks. I used to have to dig around for a pair of pants, now that things are in a row, I can see everything without having to move things around. \n\n\n**If it only takes 5 minutes, just do it now, don't wait to do it later.** This is something I've seen on reddit A LOT and I took it to heart. Whether it's doing dishes, throwing out the trash, or just picking things up, it has helped me feel productive even though it's such a small thing. Of course, sometimes I forget things that's why I actually take notes or set a reminder when I'm away from the house of what is bothering me at home as I was leaving (I always seem to notice messes as I'm going away). It could be a scrap of paper I had seen but had forgotten to pick up or some laundry I still had lying around. Soon as I get home, I'd clean it up right away.\n\n**Cook more.** Avoiding takeout as much as I can but not entirely. Every once in awhile I might order something, I live in an Asian country so delivery here is abundant and very easy. But cooking at home is a fun challenge and I love trying new recipes. Even if it doesn't turn out great, it's never terrible enough to be inedible. I also try to find food that is more filling. If you just search on the internet, you can find lots of easy substitutes for your regular food that can be filling and have lower calories.\n\n**Diet and Exercise.** I started exercising about a month ago, at home because of covid. I got myself a yoga mat and a friend who give me reminders like a drill sergeant to keep me on track. My muscle gain is up and my fat is down, I've made some progress in weight loss and slowly but surely I'm getting more toned. I've done diets before like keto and intermittent fasting, but none of those worked nearly well enough because once you stop dieting, you just gain it all back, especially for someone like me because my metabolism is terrible. I realized that in order to lose weight, you have to really change your lifestyle.\n\n**At peace with my social life.** Everyone's social life has taken a hit since covid, I'm no different. But this created a great opportunity for me to jumpstart my new life changes. I've always had a hard time saying no to hanging out with friends in person or to play games. I lose track of time and all my plans become disorganized. Now I know that sometimes I have to prioritize myself, my friends will still be around even if I say no. Fomo is a bitch to deal with but I want to stay productive and happy at home. There has to be a balance and as we grow older, meeting friends doesn't seem to be as nearly as high of a priority anymore. \n\n**Fight through the slump.** You will always reach a point where you are tired of trying and days you feel so depressed you don't want to do anything. It's at times like these you have to try even harder. Don't let your anxieties stop you. I've had my ups and downs, but I started writing and drawing my daily activities and feelings in a notebook and it was really nice to look back on. Physically having proof of my progress really helped. So even if you are feeling at your lowest, you should still do your best.\n\n**I want to be someone I'm proud of.** It's not easy to keep these changes and there's always room for improvement. We have to accept that change is a gradual thing and the harder you force yourself to do things differently, the more you'll subconsciously resist. I was tired of worrying if my home was clean enough for someone to visit, or feeling ashamed of what I ate and did/didn't do. The only way I could stop feeling this way is not to avoid it but to face it and make it go away. \n\nOne of the problem I faced is that I forget some of my chores and whatnot, I found writing things down and using the Todoist app is really helpful in reminding me.\n\nI used to make excuses all the time as to why I shouldn't have to exercise that day or procrastinate on cleaning, but I tell myself by the time I finished thinking of all these bullshit excuses, I could have probably have done most of what I needed to do. There's no 'good time' to start bettering yourself, you just do it. Don't wait for motivation, motivation gives you false hope, it's only after you are able to discipline yourself that you will truly believe you changed.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iwy36i/my_1month_journey_so_far/", "title": "My 1-month journey so far.", "social_network": "reddit", "user": "Voxit", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1600685356, "permalink": "/r/DecidingToBeBetter/comments/iwy36i/my_1month_journey_so_far/", "nsfw": false, "first_save": 1635437264.0371273, "replies_charged": false}