{"id": "t5_2tand_t3_bs6gna", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "Currently still on summer break, started work a month ago, survived my most hated bureaucratic processes needed to procure work requirements and realize it's not that bad once you've gotten started.\n\nLife as a service crew was super tough in my first few weeks with my feet hurting like a bitch, but even though it's a characteristic of mine to give up easily when confronted with discomfort, I realized at the end of the day I enjoy this new zone I created for myself. Even though it is tiring, I feel proud for not quitting. \n\nEventually my time as a backup server was up and I had to take on my intended role as a frontliner/cashier. I thought I was going to fail miserably because I'm introverted, has high-frequency hearing loss, and have a bit of a lisp. I did have embarrassing moments but I powered through them all by learning how to smile. Most customers are patient with me as long as I'm polite and friendly, but even with the terror ones, I can manage  since I'm starting to learn not to take rudeness personally. \n\nNow, even outside of work I'm finding out that I'm starting to come out of my shell and being a bit courageous in interacting with strangers. I have started to smile easier, be a little bit more charming, and laugh at myself whenever I make mistakes.\n\nAlso gained much respect and empathy towards fellows on the same line of job, and I try to be as nice as possible to them and sometimes even sneaking them a few reasons to smile in the short time they have to interact with me.\n\nFor now things I still need to work on is my timidity, my lack of assertiveness and tardiness", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bs6gna/introvert_with_hearing_loss_and_social_withdrawal/", "title": "Introvert with hearing loss and social withdrawal who put off finding part-time for 3 years, now I'm doing just fine being a cashier who has adapted friendly facade", "social_network": "reddit", "user": "jedephant", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 16, "down_vote": 0, "creation": 1558636047, "permalink": "/r/DecidingToBeBetter/comments/bs6gna/introvert_with_hearing_loss_and_social_withdrawal/", "nsfw": false, "first_save": 1635435830.899463, "replies_charged": false}