{"id": "t5_2tand_t3_m30p4q", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "All of us want to be better, all of us can and should be better. Negative addiction is the number one thing that holds us back. Addiction can come in many different forms, shapes and sizes. Some of you may share mine and some may have others. But I think there at least a few generals we can all relate to. Now some of you may find some of these to be extreme, too difficult and you’re willing to settle for less. If you believe that, ask yourself, why? Why would you settle for anything less than the most magnificent version and manifestation of yourself possible? Why else are you alive today, if not to live the greatest life and be the most sensational version of yourself possible? I KNOW it’s hard, that’s why I made these rules for myself as well as you all! If it wasn’t so difficult, there wouldn’t be any point to any of this, or any reward at all. And trust me, the reward is beyond our imagination. \nIf this helps you, I’m so glad to have been able to share it with you. I love you all, and I wish you nothing but the very very best. You deserve it!\n\n#1 PMO IS THE LOWEST YOU’LL GO\n\nFor those unfamiliar, PMO stands for Porn, Masturbation, Orgasm. I cannot even begin to explain how powerful, important and integral sexuality and sexual energy is to this experience. I could literally fill multiple books. The general public of the entire world is enslaved by sexual perversion. Our sexual energy is the holiest part about ourselves, it is literally our life essence. Think about how powerful it is, one ejaculation can create an entirely new conscious being. I encourage you do more research into the truths of sacred sexuality and sexual energy transmutation. It is absolutely VITAL. \n\nEdit: there was some confusion so allow me to clarify, absolutely DO NOT watch porn. It is one of the most evil things happening on the planet. \n\n#2 FOR TASTE IS A WASTE\n\nIf you put something into your body purely for taste and taste alone, you are committing a horrible atrocity to yourself. The body is a temple, it is how we experience this beautiful gift of life. There are very CLEAR guidelines on what should and should not enter your body. Taste will never satisfy you, you’ll always return for more. I have good news though, there are so many wonderfully healthy, whole, and lively foods that also simultaneously taste amazing. Please allow yourself to be healthy. This is also CRUCIAL. \n\n#3 A GOOD HIGH IS A LIE\n\nDrugs create a false reality. An endless chase that you will never, ever, ever finish. I myself have a huge problem with marijuana, but the same can apply for any drug. Sure it can help for certain things on certain occasions. Feel better, less stress, more creativity, etc. so if you still aren’t convinced, let me put it this way:\nSubstances from the planet, sacred plants so to speak, are a medicine and should be treated as such. Would you take medicine all of the time, regardless of sickness? If you are a conscious person you would say no, of course not. I’m not completely against something like marijuana. While it may have devastating effects it can also have beautiful ones. So rule of thumb, only take something like this if you are “sick.” If it’s been a really rough while and you’re struggling, feeling down, forgetting why you’re on this journey, then by all means enjoy some and use it to uplift you again. It can provide wonderful retrospection when you need it. But once you are reinspired, MOVE ON. To quote Alan Watts: “If you get the message, hang up the phone.” The thought that you need to stay high, can’t do this or that without it, is a lie. It’s nothing more than a window we are looking out of. The only real way out the door is the true experience, true mindfulness.\nPlease note I am only referring to sacred plants and such. I absolutely do not mean any drugs that are obviously harmful and damaging. Please avoid these at all costs. And yes, that includes alcohol. That’s a tough one for many people. \n\n#4 A PHONE CREATES A DRONE\n\nEVERYTHING is in the present moment, and remaining mindful of it. What is the #1 thing that destroys the present moment? How often do you find yourself staring into a screen looking at absolutely worthless content and nonsensical trash? I shouldn’t even need to mention the cesspool that is social media. I find myself staring into my phone, and clicking it off and wondering where I’ve been the whole time. It’s like myself and my body cease to exist. I am become nothing but this screen, this black mirror. Save yourself, avoid a screen as much as is possible for you. \n\n#5 TO BREAK PRODUCTIVE ROUTINE IS TO GIVE UP ON DREAMS\n\nHow many of us swear we’ll do better? Wake up earlier, exercise consistently, work harder, eat better. The list can go on and on. All of us have a reason for being here, and a version of ourselves we’re trying to reach. You MUST make the right choice. We are creating our reality with every second of our lives. Yes indeed, every single moment is a choice. This is why mindfulness is SO IMPORTANT. If I decide to sit and practice the piano for an hour, I have created a reality where I have an hour of piano behind me. If I decide to eat healthy foods and exercise regularly, I have created a reality where I am healthy and fit. Consequently, if I decide to play video games for hours or sleep in and waste my day, this is the reality I have created for myself. Only you know what needs to be done for yourself and your life. I implore you, just make the right choice. It’s that simple, and that difficult. But you can DO IT! \n\nJUST DO IT!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m30p4q/i_have_created_a_set_of_rules_against_addiction/", "title": "I have created a set of rules against addiction for myself and I would like to share them with you", "social_network": "reddit", "user": "KingOfDarts", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 73, "down_vote": 0, "creation": 1615496606, "permalink": "/r/DecidingToBeBetter/comments/m30p4q/i_have_created_a_set_of_rules_against_addiction/", "nsfw": false, "first_save": 1635436840.262056, "replies_charged": false}