{"id": "t5_2tand_t3_gq720m", "request": ["b1a66ef4-3e71-4d03-875c-961dbcef2285"], "text": "Right, so. I decided to do something a little random and started taking cold showers. Id have a hot shower first then start to slowly turn down the heat until it was totally stone cold. During these moments you have to breathe in deep and fast to keep the oxygen flowing. This really helps with fatigue, recovery, boosts immunity and central nervous system stimulation. These are what i have heard. And since about 4 weeks ago i have been having a cold shower everyday. And im telling ya from my experience and my mates experience who i told to start doing it as well. We have seen such a difference in our mental well being, creativity, recovery and it sure has made me alert and more stimulated throughout the day and havent been ill so far. So if you want, make a change and start having cold showers. It may sound horrible and it may even be horrible but fuck! You feel great afterwards. I explain a lot in my yt video but fuk that not here to plug (although i did just then fk!!) But honestly you learn for the cold water to be your friend. Wim Hof (ice man) was right exposing yourself to cold is your friend. It strengthens your heart if you do it gradually. Dont just jump into a freezing cold pool if you do have heart issues just turn it down to look warm and concentrate on deep breathing and you even get a major sense of euphoria everytime. Iv found that it can help you in certsin situations when you are cold as you start to shiver you concentrate on your breathing and it allows you to take control of subconscious thoughts like shivering, breathing, mind set during a stressful experience i.e freezing cold water running down you for 5 mins. It could even help save lives. (Thats if you were to fall in a river or sea or something so you dont go into shock straight away, you would be familar with the freezing cold and would drown straight away) but anyway I hope this may inspire or help someone to start taking cold showers. Coz i was a depressed mopy shite and since then it gives me that kick up the arse and i feel great so everyone, stay safe and take cold showers :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gq720m/an_interesting_title_about_cold_showers/", "title": "An interesting title about cold showers!", "social_network": "reddit", "user": "b_loved_criminal", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1590394131, "permalink": "/r/DecidingToBeBetter/comments/gq720m/an_interesting_title_about_cold_showers/", "nsfw": false, "first_save": 1635436382.194222, "replies_charged": false}