{"id": "t5_2tand_t3_qcifxh", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "c67213dc-0eed-4cac-a781-9bc082742908", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "I was depressed and had an Identity crisis during my final 2 years in high school. I cutted classes and focused and dedicated my time to playing league of legends causing my grades and social life to drop.\n\nI was very confident of my body back in the day and I was not afraid of taking shots at women/girls. And then all of a sudden every bullshit I did ever since as a child came to haunt me. I became very insecure and the acne on my face is not any better.\n\nI tried to change since I wanted to be better but instead of being better I got worse and I felt like I no longer recognize myself in the mirror. Like I'm on auto pilot and I was very unhappy. It really fucking sucked. It sucked so bad. Looking at yourself at the mirror and asking yourself \"who the fuck is that guy? Is this who I really became?\" \n\nThen the pandemic came and I tried anime that I previously hated and watched an anime about fitness and decided to workout.\n\nI am fit now, far from what I would call ripped and jacked but I am no longer underweight but I'm getting there!\n\nIm also working now and got accepted to one of the most fun and exciting company with absolutely great Team leader, co workers and the work is pretty easy. I love my office job, not bad for a first job for a recently turned 18 years old. I got my first paycheck and I was overwhelmed with emotions.\n\nI started cleaning my face and bought a shit ton of products to my ongoing war with acne. I bought myself clothes so that I dont look like a no fashion sensed loser anymore. I am still finding my style and what I'm comfortable in but we'll get there!\n\nI was hanging out with my co workers last night and that's when I realized that I am back. I feel like I am in control again. I am happy and finally found and recognized myself after losing my identity for almost 4 years. Like this is it! This is what I should be feeling! \n\nWho knew that in order to improve you have to push yourself out of your comfort zone! I did and it turned out great! Well, mostly. Other times it backfired. \n\nSure I am no longer that easy going, funny and chill guy that I used to be but hey! I'll take it!\n\nI will start to go back to the dating game at January of 2022 to further explore my self improvement journey and hopefully find myself a girlfriend after almost 3 years since I had a crush on anybody really. I feel like its finally time. \n\nLong road ahead, more battles to come. But this time, I am prepared and excited on what the future will hold. Bring it on bitch!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qcifxh/i_have_finally_got_over_my_years_of_identity/", "title": "I have finally got over my years of identity crisis. I feel so satisfied and relieved now.", "social_network": "reddit", "user": "Dwight321", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1634786829, "permalink": "/r/DecidingToBeBetter/comments/qcifxh/i_have_finally_got_over_my_years_of_identity/", "nsfw": false, "first_save": 1635436003.6161277, "replies_charged": false}