{"id": "t5_2tand_t3_fuyn9z", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I have, recently, had the misfortune of being in a rut, an experience known to some many others. 'recently' is however, a very liberal definition and I do mean a grueling, hazy 1-2 year period through which it has lingered, and could in all soundness be equated to a persistent depressive state. I say that, as it is in no thanks in my part part, to taking serotonin reuptake inhibitors -- and modulators, norepinephrine reuptake inhibitors, trycyclicics, tetracyclics, dopamine antagonists, 5-ht antagonists and glutamate antagonists. All in vain attempt to remediate my inability to feel emotion or elicit or genuine affect; all the whilst knowing it was simply product of a childhood devoid of emotional reciprocity. Aln errant grounding in the introspect and anti-real, incongruent with this world, untenable. \n\nAnyway, enough about me, all this is tangential, and a personalised post will be of help to less people.\n\nMy question(predicament) is how to use a set period of months (say the quarantine/the summer) to preform a soft reboot of yourself?\n\nBy soft reboot, I borrow from the parlance of franchise universes, I mean to completely transform yourself, but not to extent that you wipe away your past or reset yourself. Merely a massive, stark contrast come autumn. Simply, I guess to reinvent yourself.\n\nNow I am certain I am hardly the first, nor last, to ponder upon the prospect of radical self betterment. But, for the life of me, I can not figure out how to move from potentiality to actuality -- to not end up with the piteous remnant of a mid years resolution.\n\nMy goals, in generality, are: weight loss - fasting,  weight lifting, evening walks and runs.\n\nProductivity - to learn better English, because I'm awful, watch crash courses, watch Yale lectures, read books, learn russian on duolimgo.\n\nSocial skills - work on social skills - watch all of charisma on command, read CBT, DBT, exposure therapy till it's ingrained.\n\nStart writing personally and Photoshop again so I have something to show for it.\n\nThis probably differ for some, however, I dare say it is universally applicable, that very little of this will come to fruition.\n\nSo how do we change that?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fuyn9z/soft_reboot/", "title": "Soft reboot", "social_network": "reddit", "user": "amenteco", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1586024804, "permalink": "/r/DecidingToBeBetter/comments/fuyn9z/soft_reboot/", "nsfw": false, "first_save": 1635438244.0844474, "replies_charged": false}