{"id": "t5_2tand_t3_n8cdlg", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "I never knew. I grew up filming everything, every holiday and random get together. I'm 30 now. I don't have many friends - after high school we all drifted apart. I didn't make any in college, I was too busy working a part time job and studying, I don't have many through work, and I'm not close with my siblings at all. I don't particularly consider myself hard to get along with, I've always felt that I was super relatable and down to earth, I'd even go so far to say that I'm pretty funny. \n\nI recently decided to digitize all my old home videos from over a decade ago, and as I was going through them I realized just how *mean* I was. I can't let anyone see them. I yell at my friends, I berate my adorable *little* siblings, I give nasty comebacks to family members. It's awful. It's so incredibly hard to watch. I should mention I'm a woman - I never thought I went through that \"asshole teenage years\" that mostly boys seemed to go through, but there I am, being a complete asshole to everyone around me. I don't understand it. I really never knew. And I absolutely hate it. It's no wonder my siblings aren't close to me, don't open up. It's no wonder I reach out to old friends sometimes to see how they are, and no one ever reaches out to me.\n\nIt's embarrassing. It simultaneously breaks my heart and makes me angry watching these videos. I think I'm a better person now, but I know I can still be mean and I worry I have burned too many bridges in the past; that that's just how people see me. That the reason my adult siblings won't open up to me is because of how cruel I was to them in childhood. It just breaks my heart hearing myself in those videos, yelling at children.  I'm so hyper aware of it now, and I recognize I still have that piece in me; I'm still very capable of being downright mean. It comes so easily to me, it always has and don't know why my brain is wired this way. I want to change it. \n\nI'm striving to be better. I was expecting such happiness watching these old videos, but it's been such a wake up call. I just want to apologize to everyone. I don't like my past self, and I'm scared of not realizing I'm exactly the same person and haven't changed at all. That's my biggest fear.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n8cdlg/it_took_watching_old_home_videos_to_realize_just/", "title": "It took watching old home videos to realize just how mean I was", "social_network": "reddit", "user": "PossibilityRare645", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1658, "down_vote": 0, "creation": 1620559871, "permalink": "/r/DecidingToBeBetter/comments/n8cdlg/it_took_watching_old_home_videos_to_realize_just/", "nsfw": false, "first_save": 1635437389.1198666, "replies_charged": false}