{"id": "t5_2tand_t3_kha7bo", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "As I get older, I am really having some self image issues.  I just don’t feel like I’m enough anymore.  I work hard on staying in shape, eat well, get nice haircuts, get nice clothes.  But I just feel like a sentient potato compared to many people.  Most of my friends somehow always look like models, and I just feel left out and incomparable to them.  There seems to be such a societal focus on attractiveness, and it’s like I’m just broke when it comes to the economics of that.\n\nI just feel inadequate.  As if I’m lesser-than than most people and have lesser value.  It certainly doesn’t help that I’m not getting any younger and am losing physical value year after year.  I know I should have a lot more self esteem, and I certainly wish I could muster it up somehow.  I’m a practical person and really need evidence to believe in any claim, so I guess I need more evidence to believe I should have more value in myself.  \n\nOf course there’s the value that my wife sees in me, but after so many years now I guess it’s just easy to take that for granted.  Sometimes I feel like I just have to remember that my wife is biased and so am I.  We’re the only partners we’ve ever known so of course we think each other is the best.  When we were a bit younger I found that women would sometimes give me a look or make a pass at me, but that no longer ever happens.  I never had any interest in pursuing anything, but it was snide to know that I did have value at that time.\n\nI really have no interest whatsoever in anyone else.  My wife and I were hanging out the other night wine drunk and played a dumb game where we asked who of our mutual acquaintances we’d most be interested in.  Not in a physical way, but more like if we thought any of them would be a good fit.  We went through literally everyone we knew and both realized we’d never want anybody but each other.  I really truly believe that and wouldn’t want anything changed and would never risk it.\n\nI just wish I felt better about myself physically.  I want to work on it but I just need a reason other than my wife’s biases to use as evidence to believe it.\n\nAnyone have any suggestions or ideas?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kha7bo/i_really_feel_as_if_i_have_dwindling_physical/", "title": "I really feel as if I have dwindling physical value, and it really bothers me a lot. What real evidence can I use to improve my self-esteem?", "social_network": "reddit", "user": "FelinedRockets", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1608525533, "permalink": "/r/DecidingToBeBetter/comments/kha7bo/i_really_feel_as_if_i_have_dwindling_physical/", "nsfw": false, "first_save": 1635437019.4468777, "replies_charged": false}