{"id": "t5_2tand_t3_gv2rj9", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "I was writing an answer to a thread made by someone who was confused and needed advice on how to handle the fact that his family is unsupportive and disrespectful, friends turned out to be fake, want only weed, booze and smokes from him and that he feels lonely, and as I was writing it I decided it deserves a thread because it describes pretty well what I went through. Apologize for any confusing grammar and lack of punctuation, some of it was written with speech-to-text.\n\n''Hi. I don't often answer to posts like these even though I usually have something to say. However this time you're perfectly describing my life. I used to have friends until I was about 16-17. I started feeling uneasy around them and I realized that whatever friends I thought I have weren't actual friends, and that everybody was talking behind my back regardless of how wide they were smiling when they were with me. I moved to a different country and I completely lost contact with some of them but when I come back for holidays, thinking that after years things must've changed and they grew up and that I can recover some of those good times I've had with them (which I later realized was ''fun'' because it all basically was just booze and drugs) and I initiate a conversation with some of these people I used to hang out with, and even ask to meet, they show their actual true side, the one they've been hiding before, back when I was around.  Here in this different country people didn't know me for what I was capable of. They haven't seen any of those medals and trophies, they haven't seen any of the intellectual competitions I've won, they haven't seen me topping the class. And because back then when I arrived here I was going through a cruel puberty, and I wasn't particularly attractive, being a half-fat, half-skinny, acne-riddled and yellow-toothed mess, I didn't manage to get any friends. Sure my spirit was still strong but the only ones I thought I could afford were people just like your \"friends\". Fake failures who only smoke drink and do drugs. Who say shit like ''peace and love'' but do the exact opposite.\n\nSo I just said f\\*\\*\\* it. Chances are the reason why you're hanging around with them is that a part of you isn't happy with yourself. Because if you were loving yourself and you were perfectly happy with yourself then at the mere thought of these guys being fake you would have instantly cut the cord. It took a bunch of motivational videos, epic music, but I finally heard that message. Took a leap of faith and blocked everyone. I stopped believing that just because it's my father, I'm supposed to engage with him and be concerned and bothered by his fury and feel sad about his resentment.\n\nIt took a while to come to terms with and it definitely took some struggle, sacrifices and commitment.\n\nBUT. Just a few months down the line of all this self-improvement and chasing the best version of myself I started loving this (poetically but nonetheless meaningfully speaking) path of a lone wolf. My thoughts became my only friends. And I loved it, I still do. I realized that only when I'm chasing a goal and I'm improving, I'm able to say that I'm happy. Sure, I'm not going to lie here, at times when I go out and I see groups of like 10 people sitting by a table or at a picnic having insane amounts of fun I go like damn that must feel good. Sometimes I see a really cute couple and I go like damn I wish somebody would love me like that.\n\nBut I said f\\*\\*\\* it. Because what matters at the end of the day is what I do to improve myself. What matters at the end of the day, when I'm on my knees praying, is what I did to be better than the person who was on this carpet yesterday. What I did to not waste the gift of life. Not what someone else said about me, or what someone else did. I can't be bothered questioning whether my friends actually like me, if I have to do that I'd rather not have friends at all. I can't be bothered by what my girlfriend thinks of me, having to make her happy and taking her out because I need to stay focused on my work, and because I'm counting every hour. Because I was able to separate myself and I was able to sit with myself and be lonely, and because when you're lonely you can hear yourself better, I was able to identify what I want and I was able to research and study how to do it. Now, don't get me wrong. It is a bit extreme. But I f\\*\\*\\*ing love it. I love the fact that for the last decade, rejection was my second name, because had I stuck with those failures I never would have discovered myself.\n\nRemember the acne-riddled yellow-teethed, skinny-fat mess that I was? The depressed, weak, addicted to a billion things and scatter-minded individual?\n\nYeah.\n\nAfter 3 years on the path of a lone wolf that's f\\*\\*\\*ing gone now.\n\nInstead what there is now is a singer, a piano player, a fitness model, deeply spiritual, but who's also an AI scientist. Someone who's read a hundred books and counting. Someone who quit smoking, drinking, porn, TV, video games, shitty relationships, started eating healthy and systematically. And I'm not even f\\*\\*\\*ing remotely close to being halfway through. I realized that not only were the \"friends\" slowing down my progress, they were stopping it. My family was stopping it. And because of them and their shitty values, I was stopping MYSELF.\n\nDon't get me wrong . I sometimes feel like watching TV, playing video games, eating shitty food, lately even masturbating. I sometimes feel anxious, sad, missing affection, sometimes I wanna unblock some of the less obnoxious losers and have a joint with them and listen to some music. And so will you. That's normal. But because I walked alone for such a long time, conquering all of the above is my f\\*\\*\\*ing reality, my bread and butter. I don't wake up and think ''I hope nothing hard happens to me today''. I HOPE it will so that I can, as Goggins said, callus my mind even further.\n\nSo to everyone who's struggling because they were brought up in a social net environment where for every person there's at least 3 ''friends'' and who now realized that they're not happy, and not having anyone around feels like a piece of them has been ripped off. THAT'S GOOD. Take a f\\*\\*\\*ing stand, listen to 10000 motivational speeches if you have to, and GET. TO. WORK. You'll love the sound of silence.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gv2rj9/loneliness_is_a_gift/", "title": "Loneliness is a GIFT.", "social_network": "reddit", "user": "LookLikeAWitcher", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1591082829, "permalink": "/r/DecidingToBeBetter/comments/gv2rj9/loneliness_is_a_gift/", "nsfw": false, "first_save": 1635436836.6523695, "replies_charged": false}