{"id": "t5_2tand_t3_5zztvg", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "So I am an overweight, old, unattractive woman. I am attempting to lose weight but when you've been this way for 37 years, it's not going to happen overnight. It's incredibly slow, very tiring, and not pleasant. I am fine with dealing with this part, as life is suffering and this is what I choose to suffer through. I'd rather go through life trying to work out and get healthy than to sit and do nothing about it, even if I never get to the correct weight.\n\nMy problem though, is that I constantly want to apologize to everyone for being what I am. I want to wear a shirt that says to the world that I'm sorry for looking the way that I do, I'm sorry for being unattractive, I'm sorry for being here for 37 years and all this time being this thing walking around that others have to pain themselves to look at. I want to have this sign as I walk around that says that I don't really eat McDonalds five times a day, I really do eat healthily, and I know I'm not pretty and I'm not *trying* to be.  I really am having serious problems with this. \n\nAll I want to do is accept myself for what I am and move forward. So what I want to know is, does anybody have any advice on what I can do to get past this?  I want to move on. \n\nI am seeking therapy, and the things she has suggested have not worked so far:\n\n* Repeating affirmations\n* Getting my hair/nails done on a regular basis\n* Wearing makeup\n* Dressing up all the time\n\nThis stuff feels like it's all surface. I need something else.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/5zztvg/how_to_accept_myself_for_what_i_am/", "title": "How to accept myself for what I am?", "social_network": "reddit", "user": "FFXIVdragonlady", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 21, "down_vote": 0, "creation": 1489779989, "permalink": "/r/DecidingToBeBetter/comments/5zztvg/how_to_accept_myself_for_what_i_am/", "nsfw": false, "first_save": 1635437714.1596856, "replies_charged": false}