{"id": "t5_2tand_t3_bq2h8p", "request": ["d16532c7-3c5c-45c4-ab79-168cb2cfbb61"], "text": "*To affirm - \nto state something as true* or *publicly show your support for an opinion/idea*\n\nIt’s known - nothing new about it been around since way before nazis. People with flags and banners yelling in the street or the kid with blackend hair and thick eyeliner beneath his eyes. People identify with all sorts of things. It’s a belief, the same mentality, but very different ideas. Afterall an idea can be anything from material need and money, to selfrealization and faith. Yet *as long as you believe it to be something true*,  \nit can be *anything*. Even your bad social skills or anxiety. You affirm it, because it shows everytime you try and talk. You convince yourself and it becomes a self-fulling reality. Your truth. Bad or good, it’s you. \n  You can change it when you see it. But you have to ask yourself if you actually want to. What’s good for you, the right affirmation? Is talking with a friend or group of friends and agreeing on everything mutually making you proud of yourself? Is that really good? Should you not blame yourself for your past mistakes anymore? Is that so bad? These and many other choises like them, introspective reflections, make up our truth, our egos, who we are and eventually will become. Whichever you believe you manifest in your life. \n\nThis is my affirmation of my own idea of how to affirm myself. I’m not here to convince anyone or point fingers. I’m doing this for me. I’m convinced I’m a shithead, yet it pushes me to be greater. I’m definitely not there yet, and that’s exciting. Bipolar but balanced from the fact now that I know, it willcome and go. Affirmed and reassured I’m going somewhere, still unsure where. \n\nSo what, I needed this loathing because I’m sometimes feeling fragile. The world is lonely and my mind is too weird for all of it. Compassionate overflow drowns me. But I am through being reliant and subservant. My emotional vulnerability turned to fuel. Lot’s of ideas floating just beyond my reach while I’m too busy watching myself. Now it’s time for me to get up and grab them, assert myself and feed my need for the kind of affirmation nobody else can give me. Share that then with the world once I trust I am capable to. Encourage more ideas like this as an act of independence. \n\nI am found to be lost and it’s not an easy search, but eventually I stumble upon a clue. It hurts to keep trying but I know it would destroy me if I didn’t. Doing nothing is not even a choise by definition. I choose to make this post to liberate myself. It’s my way of living. Keep trying!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bq2h8p/affirmation_and_self_talk/", "title": "Affirmation and self talk", "social_network": "reddit", "user": "newthrowgoesaway", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1558174379, "permalink": "/r/DecidingToBeBetter/comments/bq2h8p/affirmation_and_self_talk/", "nsfw": false, "first_save": 1635437631.507332, "replies_charged": false}