{"id": "t5_2tand_t3_qai2ux", "request": ["78e8a1f4-314f-439f-8f40-daf7a6da355f", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "I have never been so lost and confused in my life to the point that I hate myself. I'm trying so hard not to go down the rabbit hole of \"I'm not good enough\". Because if I do, I'm pretty much paralyzed.  \n\nOkay, to begin with, I'm 24/f and I recently graduated from art school and I'm an aspiring animator(2D). I say aspiring because I still feel so far from the goal. College was amazing but I seem to have lost my focus somewhere along the way. I ended up focusing too much on my boyfriend(now ex) in the past year. I had dreamt of being in the art/design field since I was 15. In high school, I was that artist kid who knew exactly what I wanted to do. There was never a thread of doubt.  I was an average student in school and I always knew that whatever I do, I have to work hard, be it an artist or an engineer, or a doctor. But with animation, I found something that I actually wanted to work hard for. I instantly fell in love. \n\nBut the past year has had me questioning that love a lot. When I was younger I wanted to do something that would make a difference to the world, social work essentially. The desire to do something that makes a difference is still there. Still strong. In college, I learnt how to combine that desire with art. But last year made it painfully obvious which professions actually make a difference. Sure enough, I just stayed home wallowing in self-pity.  And as I said I focused too much on my relationship(2 years long). It's like I wanted to be was his girlfriend. When I went back for my final semester, I was really excited to explore my love for art again. But early on in the semester, I had a conversation with my boyfriend about my lost love for art and he put me down for having a negative attitude and made me feel like I hadn't prepared enough for the final semester(which I realize now, was not true). For whatever reason, I carried on that self-resentment I got from the conversation for the rest of the semester. Albeit, I don't blame him for my attitude for the rest of the semester. I should have tried harder to get out of it. I ended up with a final project that I'm not too proud of(because it's not complete). \n\nI finish college in June. We end our relationship because didn't want LDR. Little did I know, ending the relationship would make me realize just how much I've been holding myself back. I thought that ending our therelationship would get me down because I lost him. But honestly, it got me down because the rose-colored glasses came off and I realized just how much of myself I lost. In simple words, I felt like shit. I still do. I hate how much I let a relationship affect and control me. There is a lot of myself that I lost but I won't get too much into it for this post, I want to focus on my passion. \n\nAs an artist, I have to constantly improve and keep practicing. And just never stop. But I stopped. for 2 years. And that is the main reason I ever questioned my choice of work. Because I had made little to no improvements. I was stuck. And now I'm not good enough. I'm not where I should be to be able to work in this field. I refuse to blame my ex or my relationship for this. This is all my doing. I kept dreaming big and doing nothing. \n\nWhen I finished college, I decided to take some time for myself. It was a big change and I just wanted a breather. So I didn't even try to look for a job. And it was during this time that my rose-tinted shades came off and I went deeper into the rabbit hole of misery. I hated(hate) myself. Because at the end of the day I have no one to blame but me and my laziness. \n\nI spent the past four months trying to work on my portfolio, improving skills, and/or just sitting and doing nothing. Unfortunately, I  spent more time doing the latter. I developed a habit of daydreaming. I'd just wake up, get ready and just sit and daydream the whole day. It was the only time where I wouldn't feel awful about myself. And I got lost in my head. It was a few weeks ago that I realized that I'm lost and having a hard time getting out. There are times when I just end up not moving, and before I know it, it's been days/weeks/months. Some days I'd wake up and I manage to do some work. But if you look at it as a whole, I spent the majority of my time just sitting. So basically I spent four months daydreaming, I felt paralyzed.\n\nI realized that I love what I do. What I want to do. This is it. I love animation and I can't even imagine doing anything else because I don't want to. The past week I tried harder to get out of my head. And for the most part, I've succeeded(I think). I started some online courses. And 2 days ago, I got a rush and I mass applied to several places for a job. It was 2 am, I was exhausted but I really just wanted to apply. Unfortunately, most of the applications were sloppy and full of careless mistakes. I copy-pasted some cover letters and forgot to edit them for some companies(so now, some places have a cover letter that says \"we spoke on the phone earlier\", even though I haven't for most of these places). God, what a mess. Then yesterday, I tried to apply for an internship at a studio that I've loved and looked up to for a long time. And I just got a reply saying that my work needs to be better and I need to improve. And they told me to work on it and apply again. And while I already knew this, I'm crushed, to say the least. I'm not even good enough for an internship? \n\nAs I mentioned earlier, I don't want to go down the rabbit hole of \"I'm not good enough\". I can't afford to feel paralyzed for another four months. While it's painfully obvious what I need to do now. I'm ridiculously terrified. I'm panicking and feel stuck again. It's like I've been drowning for the past four months and I didn't even know it and I've suddenly woken up in the middle of the ocean with no life vest. Even though I know how to swim, I'm too terrified to realize that and I continue to flap my arms around like a moron to stay afloat. I don't want to reach land just by flapping my arms around, I want to swim there.  But my mind is too fogged up. I'm so lost. Honestly, I don't even what direction to go in. I know where I want to be but I don't know how to get there. Okay, I'm just rambling now. Heck, I think this entire post is a ramble. I'm sorry about that. \n\nWell, I'm not really sure about what I'm asking here really. Maybe, just...help? I don't know. I just hope that once I post this, I don't go back to my bed and get lost in my head again.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qai2ux/lost_in_my_head/", "title": "Lost in my head", "social_network": "reddit", "user": "cheesyrhy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1634543640, "permalink": "/r/DecidingToBeBetter/comments/qai2ux/lost_in_my_head/", "nsfw": false, "first_save": 1635437945.3701646, "replies_charged": false}