{"id": "t5_2tand_t3_mdz52i", "request": ["f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I struggle a lot with making every day something I can look at and be proud of, but this week has been hard. I've been showing covid like symptoms and my productivity staggered to a halt this past week. As a graduate student and TA, it shouldve been the death mark for me.  \n\nHowever I took a dee breath, sent out a few emails, and decided to deal with it. Nothing is do or die this week: just because my anxiety rears up and convinces me I'm the worst human on Earth because I haven't accomplished some arbitrary form of predefined success doesn't mean it's true. \n\nOne thing. I just have to do one thing a day I'm proud of. \n\nToday, that was making food. \n\nYesterday, that was practicing for my upcoming driver's test. \n\nThree days ago, it was something as small as lighting a candle so the room smelled nice. \n\nI have decided against all odds and trepidations, I will trust myself. I'm going to do better because misery isn't a state I want to be in. Does it feel good to feel like the world is collapsing around me and I can do absolutely nothing? Absolutely, my depression feeds off of that desolation constantly. \n\nBut I know myself better than I know anyone else. I've seen my best and survived my worst. I know what a person I CAN be. And by golly, even if I can't get that person back, I'm going to try and make myself someone I can look at ten years from now and want to be again. \n\nToday is a good day, not because of all I've done, but despite it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mdz52i/depression_and_covid_dont_go_well_together_but_a/", "title": "Depression and COVID don't go well together, but a small mantra has helped me out a lot.", "social_network": "reddit", "user": "alecaksau", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 54, "down_vote": 0, "creation": 1616794786, "permalink": "/r/DecidingToBeBetter/comments/mdz52i/depression_and_covid_dont_go_well_together_but_a/", "nsfw": false, "first_save": 1635438382.5139148, "replies_charged": false}