{"id": "t5_2tand_t3_q7njpj", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1", "c6df14ee-195b-4e9d-8032-7cca73d46fe8", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "It does feel shitty and depressing. But i feel like all this pain will make me even more stronger person. I am chemical engineering student studying as first year and right now at my birthday, im working at a bar as dishwasher right now while writing this. Even if its my birthday, i believe i should move forward regardless of the situation that i feel lonely or not. I want to thank my mother for giving a birth to me, grandma for loving me so much, father for great lessons and my younger siblings for being my motivation to keep up. I promise that this year is going to be great year regardless. Even though i loved my ex girlfriend dearly even after she cheated on me few days ago. I hope to get over this and see this as a self improvement journey and chance. I was so afraid of my birthday because i was gonna feel lonely and sad, but you know what, i am just gonna accept the fact that its sad but will keep on going. Would love to receive tips on getting over and moving forward. Thank you all.\n\n\nEdit1: WOW thank you all for the encouraging comments. I deeply and happily appreciate it!. I just wanna wish you guys awesome life too!!!\n\nEDIT2: I didn't expect this to explode. Here in Reddit, we have never seen each other, nor gonna meet  but still manages be in one wholesome spirit. You guys/girls have made me smile more and keep pushing on.I will try everyone's suggestions, and keep myself to keep looking forward.  I wanna thank you from my bottom of my heart!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q7njpj/its_my_21st_birthday_today_my_girlfriend_of_5/", "title": "Its my 21st birthday today, my girlfriend of 5 years cheated on me 3 days ago, no friends to congratulate me but i feel like i will be the best version of myself at this age.", "social_network": "reddit", "user": "maajga", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1709, "down_vote": 0, "creation": 1634168326, "permalink": "/r/DecidingToBeBetter/comments/q7njpj/its_my_21st_birthday_today_my_girlfriend_of_5/", "nsfw": false, "first_save": 1635436111.0467663, "replies_charged": false}