{"id": "t5_2tand_t3_ntihkn", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "947d9c8c-f6f8-421d-ba73-f657e7e11fc4", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "There is a lot to be worried about right now. I know the world seems scary and dangerous to navigate. This to us and all is an undeniable experience we are all feeling at some level. It is valid to feel worried, scared, hopeless, powerless and defeated. I too have been where you stand. I was mortified at a grim reality.\n\nI was myself excessively worried and misguided at the truth of the human trajectory. I first discovered doomerism and collapse theory about two months ago. At first, I stumbled upon the subreddit thinking that its claims were intriguing, yet I remained ignorant to what it said. Then, after being worried by it on a deep level I had never felt before, I felt convinced of all of its claims. Everything just added up in my head. It was liberating in a bad kind of manner. Liberating in a negative way that made me feel like my whole world and future were crumbling before my eyes. Every dream and idea slipped into the void of narrow thought and defeated mentality. Nothing was possible anymore. I felt forced to prepare for the great rapture that would change my way of life as I knew it. Sand caught in a desert trapped in a time once cherished now lost at sea and never seen again. Hoping for some more time once spent on an era that I loved. A sinking ship that I had no control over.\n\nWhy do I even persevere? For what purpose? The world is going to end anyway.\n\nWell the truth is, the world is not going to end. Far from it. It may seem like it now, but it won't.\n\nFor starters, Reddit isn't the greatest news site in the world. We are currently in the most informed and connected time in human history, yet biased information runs rampant across the internet, and we are certainly more divided people than our previous generations. But I think something we all can agree on is wanting to know the truth. Similar to traditional forum based internet, Reddit is not a great place for the unfiltered truth. Far from it. Because of this, searching up scientific news on Reddit, especially news on climate change, is the equivalent to using WebMD to diagnose yourself. Sure, what you are reading is truthful, but it is 98% of the time heavily sceptically based and usually blown up in a negative light for news sake. 98% of the time these scenarios are based on the absolute worst case scenario, and even then, it's incredibly irrational and biased and pessimistic news. Negativity sells well, and the companies distributing this news at the end of the day have to make money. Maybe, we should take into account how a majority of this news is being negatized for more eyeballs. Not just for spreading the truth, but enticing audiences by stretching the truth incredibly thin.\n\nSay you have a bad stomach ache that has been ravaging for days. You search on Google, and it tells you that you're likely to have some form of an untreatable disease that will kill you. That's essentially what happens when you feed your brain all of this negative news. I had learned this the hard way through news on climate change. I had gone through waves of news on subreddits such as r/collapse convinced that every headline and comment I was reading was 100% truthful. That is nowhere near the case. All you are going to do is make yourself more anxious and depressed by looking at it, and life is too short for defeatist attitudes.\n\nI know most people don't say this enough, but your health and well-being matter. If you feel you have tried everything, yet you still feel worried about a possible end of the world, I highly encourage you to talk with a family member or therapist about your worries. We, humans, are social creatures, and talking to someone in person is the best way to alleviate your negative symptoms.\n\nAnother thing to make note of is realizing just how much people rely on science for the answer. More recently, I have been feeling more people than ever are excessively worried. I won't lie that I have been excessively worried before and filled with dread. Not only that, but our collective generational hunger for truth, justice, and making an impact in the world, and the fact that we are now interconnected and informed in ways we couldn't imagine decades ago, has entered us into a disturbing reality where the average person worships science to a far greater degree than natural intuition. It is common people bond over depressing negative topics. Whether it's sharing memes about self loathing, or chatting about dramatized pop songs, this generation bonds over doubt and anxiety quite well. It is normal to have these feelings, but we should also recognize that sustaining these feelings hurts us on the inside. \n\nBut what if things are actually getting worse? Well, that very same question has been asked throughout history. It was asked during pre-industrialization, during the world wars, during the cold war, and numerous times before. The mayans theorized the end date, mathematicians predicted a worldwide flood, numerous comets and asteroids, and the infamous Y2K hoax.\n\n To quote [u/Bananawamajama](https://www.reddit.com/u/Bananawamajama/) from a completely different Reddit post:\n\n>but another more well known example is that of Thomas Malthus, who believed he had found an incontrovertible truth that agricultural growth was slower than population growth, and thus there was an inevitable societal collapse which would occur at that limit and society needed to establish population control to prevent that.  \n>  \n>‏‏  \n>  \n>The actual thing that happened was that the Green revolution brought technical advances in farming which increased the yield of growth to a degree which could sustain a larger population. Thomas Malthus was wrong and the people who wanted to stop the lesser people from breeding look like misinformed fools.\n\nIt is important we do not deny facts, yes. But it is also important we keep our beliefs in check and don't assume everything we read is sterile. We can't feed ourselves junk food and expect to be healthy. At the end of the day, the most extreme claims you read about are just that. Claims. No man knows the future, as much as we try to predict it or pretend like it will start to get worse.\n\nIt is also essential to understand that the world won't change next week. Modern generations on average want things on the instant. Instant gratification. Amazon is one of the wealthiest companies in the world for good reason. But all of this desire for the best thing in the shortest amount of time has led us to ignore our human ingenuity and our primordial incentive to invent solutions to problems. Naturally, when people recognize danger, they do everything in their power to work towards overcoming that danger. Only that the time it takes to overcome is not in a noticeable span. Not spans humans are accustomed to comprehending.\n\nIt's important to find our answers through science, yes. But we also find those answers through human ingenuity. It's just natural human instincts that got us through prehistoric times, great reinventions and societies, modern advances and revolutions, and now mankind's modern age. All of this progress is progress to be grateful for. Look at how you are breathing. How you are alive. How all of your dozens upon dozens of ancestors lived their lives and fought against insurmountable odds to make it to where you are now. That is something truly remarkable.\n\nThe hard fact is that no one has all of the solutions to all of human history at any given moment. It takes years of progress to undergo significantly noticeable change. To quote [u/Warpon](https://www.reddit.com/u/Warpon/) from another completely different post:\n\n>If you ask me, I like to think of our progress as a sort of graph like one would see in the stock market. As an example, google the stock price for Apple right now. [Here's a link.](https://www.google.com/search?q=%24aapl&rlz=1C1CHBF_enCA889CA890&oq=%24aapl&aqs=chrome.0.69i59j69i57j69i59l4.688j0j7&sourceid=chrome&ie=UTF-8) The first thing you see is the one day progress: it goes up and down violently, and right now it's in the red. You see this at first and may think that Apple's in a bad spot, but you're just looking at the one day graph. When you zoom out you start seeing the bigger picture. Zoom out to maybe just one or six months and the graph still looks sketchy, with many ups and downs. Zoom out to a year, to five years, and there is a clear trend that stably moves upwards.  \n>  \n>‏‏  \n>  \n>My point with this analogy is that things can always seem like they're getting worse in the short term, and it is natural to fear so. In the long term, however, things look way better. This holds true both for the stock market and for human civilization as a whole.\n\nYou could also look into the analysis of famed economist and business professor [Julian Simon](https://en.wikipedia.org/wiki/Julian_Simon):\n\n>This is my long-run forecast in brief, ... The material conditions of life will continue to get better for most people, in most countries, most of the time, indefinitely. Within a century or two, all nations and most of humanity will be at or above today's Western living standards. I also speculate, however, that many people will continue to think and say that the conditions of life are getting worse.\n\n*(Another fantastic* [*examination*](https://youtu.be/xSQw4X5ET-o) *by Julian Simon.)*\n\nTo be personal, I have been writing this post for myself this whole time. Being able to cope that things will get better, they have been getting better, and will continue to get better. Now and forever. If someone you know or someone on the internet or on the tv has told you before that \"We have to do this and this and this or the world is going to end!\", they are undoubtedly lying or exaggerating the truth. I know my conclusions may not resonate with everyone, but I just want to assure people that we have made it through threats before, and we will again. No matter what happens.\n\nAnd I am NOT saying you are forced to make your life's work about solving climate change. If you have a bold ambitious dream that you feel is your calling in life, go for it! You should not let anything stand in your way from that. Humanity will solve the hardest problems without you, and that's ok. It is beyond liberating to realize only you are in control of your road in life. Yet, it is not your mission to do everything at once. Realizing what you are good at and not good at is a blessing. Progressing change, not just for your favorite field of interest, but of society as a whole is one of the benefits society. But fear and worry are the impacts. Panic and despair are fool's errands. That is not to say we should deny the facts, but it is factual and healthy for us to accept times will be better and to fight for the better times we want to happen. And this is just general life advice, but live your best life. You can do so being as green as possible, but live your best life. Find something you love and whole heartily enjoy doing. Maybe apply your professions wherever you can to the cause you want to help. To the problem you want to see resolved someday. I won't tell you how to live your life or if you should have children or find love or anything like that. All of those are your own choices. Only you are in control of your destiny. Unless aging is cured, we are all on a limited lifespan. The universe is a vast field just daring to be explored, and moping about potential tragedy steals from the present.\n\nOnce we have recognized the problem, we can act on the solution. We have the technology. We have attainable solutions. We can work towards better solutions. But I am not going to sit here and lie to you things will be all rosy. Disastrous things may occur. Some times may appear bleaker than others. But things appear more dramatic in the short term. At the end of the day, as long as we are diligent and we act on our problems, humanity will continue on.\n\nThat is why we persevere. Not because it is likely, but because we believe it is the right thing to do.\n\n*\"The main fuel to speed the world's progress is knowledge, and the brake is our lack of imagination\"*\n\n*^(- Julian Simon)*\n\n‏‏\n\nBest of luck to you, wherever you go in life. ❤", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ntihkn/if_you_ever_fear_the_world_is_going_to_end_read/", "title": "If you ever fear the world is going to end, read this post.", "social_network": "reddit", "user": "Creepaface", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1622974017, "permalink": "/r/DecidingToBeBetter/comments/ntihkn/if_you_ever_fear_the_world_is_going_to_end_read/", "nsfw": false, "first_save": 1635435566.5728939, "replies_charged": false}