{"id": "t5_2tand_t3_omv1xq", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Hi everyone. I just want to tell you how I decided to leave my ex gf en january of this year(2021) and refused to maintain contact with her last week because she insulted because I didn't want to call her to console her for a health problem to her mother. I know it might be seen hard, but she was really bad.  \n\n\nI met her almost two years and a half(2019) ago on Tinder, and when we started dating it was great. But she started with big lies, about her past, about our relationship, about meeting people, about littles things I didn't expect because on my mind it didn't make sense to lie on those situations, but she did, for absurd reasons. We stopped dating after 8 months being together, and she came back with her ex after the split. I was really sad, but tried to move out living my own life focusing in work.  \n\n\nShe came back four months later, begging for forgiveness, because the other guy left her that day(I didn't know it), and now I regret back we came back. After a few months I discoved on her phone(I looked because she was acting weard) that in fact she was cheating on me when we were still together in our past relationship. I got really angry, and acted different to her. We just continue meetting to have sex, and sometimes hung out but in rarely occasions. But I was getting really misserable, I felt like shit continuing with someone I hated so I tried to move out.  \n\n\nI almost did it on the last months of 2020, but she threated to kill herself if I don't go to see her. I made the mistake of go with her, and console because she was feeling misserable and I felt bad for her. We stayed at hotels twice, because I still loved her I think. But on January after a last meeting I decided to not come back with her. So I did.  \n\n\nWe still talked like once month or two(months). The before last time we argue about our last relationship and she said she wasn't cheating because she didn't love anymore, so she wasn't unfaithfull or cruel with me at that time-when she was cheating on me-(she was cruel and told me many offensive things to make feel worse). So, I told her I didn't want to talk to her again. Two weeks after she said her mom wasn't in good health and wanted me to consoler her. I told her I hope her mother becomes better, and I hope she maintain calm and don't do anything stupide(she´s suicidal), but can't call her anymore. She pissed off, and insulted me, told me I'm the worst and unthankfull for all the thing she did for me...I was really shocked, because first, I tried to wish her and her mother the best, and second because she was a really bad gf, so I wasn't unthankful at all. I responded telling all the things I did for her, one by one, when nobody else, even her closest friends or family(including her mother) wanted to be with her. And finally, told her she doesn´t worth it, I didn't care about her life because she was a shitty person. I feel really good after that.   \n\n\nI think I did the right choice not coming with her again. She was a lier, an unfaithfull girl, a bad person, and a boring person. I feel calm right now, and I think life I'll be better after all this mess I did being with her.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/omv1xq/left_my_ex_borderline_gf_in_january_and_decided/", "title": "Left my ex borderline gf in january and decided to no more contact with her last week", "social_network": "reddit", "user": "monotheus", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1626629187, "permalink": "/r/DecidingToBeBetter/comments/omv1xq/left_my_ex_borderline_gf_in_january_and_decided/", "nsfw": false, "first_save": 1635435788.9732938, "replies_charged": false}