{"id": "t5_2tand_t3_5vbmr3", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "**“For after all, the best thing one can do when it is raining is… let it rain.”**\n\n— Henry Wadsworth Longfellow\n\nDuality is a part of life. The sun sets and the sun rises. We inhale and we exhale. We create and we rest. Don't expect happiness to last, but don't expect depression to either. The only thing you should expect is balance. Enjoy the balance because it is only natural.\n\nWhen I finally realized this, it was one of the most profound experiences of my life.\n\nFor a while, I used to hate how my life used to come in go in waves. I would have six months of extreme confidence—then, six months of insecurity. A couple months of productivity—then, a couple months of laziness. Every time I thought I turned the corner and was going to stay happy or productive forever, those undesirable states would reemerge.\n\n**And I would beat myself up for it.**\n\nEventually, I learned to stop identifying those low points as “bad,” and began to embrace the duality. By identifying one side of the duality as bad, I was at odds with **[a law of the universe.](https://www.youtube.com/watch?v=ihs3Zis70ik)** I was at odds with the everlasting presence of Yin and Yang. That caused so much pain.\n\nBeating yourself for not feeling confident all the time will destroy you. Worrying that your feeling of laziness it will last forever— is like watching the sun go down and fearing it will never rise again.\n\nSo when you are suffering, feeling lazy, or lacking confidence— recognize that you will always rebound. It is the law of the universe. Duality is ever present and will always have sway over your life.\nBecome aware of the duality and embrace both sides.\n\nIn doing so, **productivity** and **laziness** will turn into **creation** and **rest**. Confidence and insecurity will turn into self esteem and self growth.\nWhen you are aware and appreciative of both sides of the duality, you will exist in harmony with a universal law—one that will carry-on throughout the rest of your life.\n\nTo expand on this topic, **[this video](https://www.youtube.com/watch?v=ihs3Zis70ik)** will illustrate how duality operates in your life. When you watch, you will learn how you can truly embrace it to make a miraculous transformation.\n\nIf you enjoyed this post, I invite you to subscribe to my YouTube channel--where I first shared this story. I will be super grateful. On [this YouTube channel](https://www.youtube.com/channel/UC2aqULqHl1zwemxAUNul3pw), I share my years worth of experience working with the subconscious mind—allowing you to reengineer your thoughts to magnetically attract happiness and success.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/5vbmr3/naval_ravikant_said_desire_is_a_contract_you_make/", "title": "Naval Ravikant said, “Desire is a contract you make with yourself to be unhappy until you get what you want.” Desirable states of mind come and go. Don't expect productivity or happiness to last forever, but don't expect laziness or sadness to either. Expect balance because it's natural [advice]", "social_network": "reddit", "user": "marotta16", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1487685793, "permalink": "/r/DecidingToBeBetter/comments/5vbmr3/naval_ravikant_said_desire_is_a_contract_you_make/", "nsfw": false, "first_save": 1635437147.1389256, "replies_charged": false}