{"id": "t5_2tand_t3_q5g7j6", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "I didn't have many friends growing up, and in middle and high school I didn't have any at all. I was short, overweight, had a bad speech impediment, was super socially awkward, so needless to say I was bullied pretty badly, and when I wasn't bullied I was treated like I didn't exist. I also realized in 6th grade that I was gay, but that was something I never told another living soul until last year. I would go years without having a friend over to my house, and I would spend weekends in my room playing World of Warcraft or crying or wishing I was dead.\n\nI wanted college to be a fresh start—still kinda short but no longer overweight and my speech impediment has been overcome. But I entered undergrad with this *intense inferiority complex*, which people must have been able to tell, since after a few weeks I was back to having no friends, which didn't really change until junior year.\n\nI'm now in my mid-20s, with top grades and a top graduate program, and I have lots of friends (lots for me, at least, maybe for a normal person it would be an ordinary amount) whom I regularly hang out with who care about me even after I told them I was gay and about my childhood—something younger me never would have imagined—but even when I'm surrounded by friends I still feel crushingly alone. I've started dating for the first time and I've had fun but nothing has seemed meaningful. I haven't been willing to apply for jobs because I've spent my entire life facing rejection and frankly I don't see the point.\n\nThe other night I was hanging out with friends and one of them had a friend visiting from college and they were reminiscing about old times and all I could feel was emptiness inside, that my life has been wasted and the best years are gone, the best experiences missed out on.\n\nBasically, I have a lot going for me now in the present, but I can't take full advantage of it because I'm still so stuck in the past. I've been talking to a therapist about shame and getting over my childhood, but nothing we've talked about has seemed to work. I realize that people with far far worse childhoods and experiences have managed to \"get over it\" and enjoy life—why am I unable to? Would love to hear some advice on this subject.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q5g7j6/how_do_i_get_over_a_lonely_childhood/", "title": "How do I get over a lonely childhood?", "social_network": "reddit", "user": "Zealousideal_Log_970", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1633898218, "permalink": "/r/DecidingToBeBetter/comments/q5g7j6/how_do_i_get_over_a_lonely_childhood/", "nsfw": false, "first_save": 1635435125.7580457, "replies_charged": false}