{"id": "t5_2tand_t3_knwnpd", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "In elementary school, middle school and high school, I was taken advantage of by other students. Instead of standing up to them and rejecting their favors, I started to resent them. Every time I tried to reject their requests, they immediately started to avoid me. It affected my intelligence, my grades and my social life. Fortunately, my boundaries were strong enough to ensure that I wasn't messed with. I started saying no more often and established stronger boundaries. After high school, I cut off contact with all of them. \n\nI would always say yes if they needed something, hang out, copy off my homework, etc. Last time they asked me if they could copy off my homework again, I said no. I had learned my lesson that time. Although I treated my peers with kindness, eventually they began to abuse it. Every attempt to stand up for myself was shot down. I had shit self-esteem. I was full of sadness and resentment. I never felt so alone. \n\nMy peers didn't like me and belittled me, called me names, mocked me, excluded me from things, stole things from me, etc. I let them copy off my homework and my exams. I let them take my things, including my lunch. I bought them things, lent them things, and accepted every request they gave me, to the point where I began to resent everyone in the class. One day in my senior year of high school, a girl  informed me of what was going on with me. From that point on, I was courageous enough to say no when they tried to copy off my homework again. They took complete advantage of me. I felt so used.\n\nThis year, I released my resentment and I'm relearning all of my skills to make sure that I am never exploited again. I am choosing my friends more wisely as well. I'm no longer resentful.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/knwnpd/im_making_sure_no_one_takes_advantage_of_me_ever/", "title": "I'm making sure no one takes advantage of me ever again!", "social_network": "reddit", "user": "benderlax", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1609443925, "permalink": "/r/DecidingToBeBetter/comments/knwnpd/im_making_sure_no_one_takes_advantage_of_me_ever/", "nsfw": false, "first_save": 1635435125.0086045, "replies_charged": false}