{"id": "t5_2tand_t3_idhzgu", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "Original Post : [https://www.reddit.com/r/DecidingToBeBetter/comments/i9zh9m/i\\_quit\\_coffee\\_pizza\\_started\\_waking\\_up\\_early/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/DecidingToBeBetter/comments/i9zh9m/i_quit_coffee_pizza_started_waking_up_early/?utm_source=share&utm_medium=web2x&context=3)  \n\n\n&#x200B;\n\nThank you all for your heartwarming comments. I am thrilled to see the response on this post! I honestly thought it would be buried and no one would care. I read each one of the responses, it is so uplifting. Thank you all! \n\n&#x200B;\n\n# What happened\n\nI was recording myself and while I was feeling like a million bucks, I couldn't ***see*** any tangible changes in my body. One of the redditors pointed out that BIA measurements can be inaccurate based on hydration.  To add salt to injury, my bodyfat felt even looser. It kind of demotivated me.  Bodyfat becomes loose and fills out more space under the skin as it starts melting, but I never knew it until I researched it.\n\n&#x200B;\n\n&#x200B;\n\nI am doing fine now, turns out it was just a phase I was going through not depression. I am back on track after having two cheat meals. \n\n&#x200B;\n\n&#x200B;\n\n\\-I am still vegan but I will make sure my micronutrients are in order. I take iodized salt, D3 and B12 supplements as well as eat a lot of spinach, Kale and broccoli. But just to be sure I made an account on cronometer to track my micronutrients as well. If it happens again I ***will*** be going for a blood test.\n\n&#x200B;\n\n&#x200B;\n\n\\-I know my goal shouldn't be to earn validation of other people but honestly, a part of me still wants it! I hope that goes away.   \n\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n\\-I was a heavy coffee drinker and addicted to caffeine, so quitting cold turkey might have taken a toll on my mindset. However, I've been feeling very energetic and awake without any caffeine. I haven't been lethargic since making the switch to veganism.\n\n&#x200B;\n\n&#x200B;\n\nOne thing is for sure, progress isn't linear. It seems there is no progress for a few days and then all of a sudden you lose 4 pounds in one night. One of the commenters said that fitness isn't a sprint, its a lifelong marathon.   \n\n\n  \nI will keep you all posted about my progress and post some before and after pics of myself as soon as its visibly noticeable.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/idhzgu/update_i_quit_coffee_pizza_started_waking_up/", "title": "[Update] I quit coffee, pizza, started waking up early, started working out, cleaned up my diet, went vegan, lost 12 lbs of fat in just 1 month and now I feel depressed for no apparent reason.", "social_network": "reddit", "user": "hsinoMed", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 87, "down_vote": 0, "creation": 1597954674, "permalink": "/r/DecidingToBeBetter/comments/idhzgu/update_i_quit_coffee_pizza_started_waking_up/", "nsfw": false, "first_save": 1635437551.6938791, "replies_charged": false}