{"id": "t5_2tand_t3_kkw7la", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "Apologies for the long title, I couldn't find a way to condense it further. I'll also be posting this to a few other subs.\n\nAs the title says, I turned 27 years old today. I'm getting increasingly worried about my chances of obtaining an independent, successful, and happy life. My life has been full of missed opportunities and poor life decisions. Allow me to explain:\n\nIt all started in high school (around 2012). I was taking engineering classes at a tech center run by the school I went to. It was during that time that I got interested in radio broadcasting. This was due to the fact that I didn't believe in the propaganda (at least it was to me) that one must go to college after high school to be successful. So, after graduating from high school in 2013, I decided not to go to college and instead go to a one-year broadcasting school. This was the first of three (seemingly) fatal failures on my part.\n\nI should mention at this point that I did briefly consider going to college, even contacting the college my sister was attending. However, my parents wanted to move out there with me and physically check on me every day. I am autistic but mildly so, so they were possibly justified in that, I'm not sure. But it turned me off of going to college awfully quick.\n\nContinuing on, I completed the one-year broadcasting school in February of 2015. I really enjoyed it there. I thought I shot at becoming a radio DJ. However, in three years of on-and-off searching thereafter, I couldn't find any entry-level positions in that field. I gave up that career path in 2018. Trying to get into broadcasting was my second fatal failure.\n\nLastly, I feel I waited too long to get my driver's license. I first attempted to get my license in high school but that effort fizzled out. After several years I got tired of my parents having to drive me everywhere, so after a few months of driving and studying I got my driver's license in July of 2018. I thought that an independent life would soon follow, but sadly it didn't. Because I waited too long, it didn't have any effect on my life. That was my third and latest fatal failure.\n\nSo now here I sit, still mentally and emotionally dependent on my parents with no career direction and very little adult skills. I am dead in the water. I can only conclude that the three failures I outlined above led to this. If I had gone to college, if I had picked a better career path, if I had gotten my license when it would have been most impactful, my life would have been so much different now. This as I see people around me, people I know, people I used to know living such fruitful and fulfilling lives.\n\nYou may be wondering why I called them \"fatal failures\" instead of \"mistakes\". Spilling milk and stubbing your toe are mistakes. The decisions I made transcend that word altogether.\n\nI want to have a family someday, but that seems unlikely to happen. The few girls I talked to were already taken. But did they let me know? Of course not. I wouldn't ask because I think it would be prying too much.\n\nI imagine many of you will tell me to get a job. Believe me, I've tried. I first applied to a local grocery store in high school. However they never contacted me back until it was too late. It wasn't until December of 2018 that I applied to another job, this time at a fast food place. I only applied to that one place. I managed to get an interview. It was a little awkward but otherwise went pretty well. I never got contacted back.\n\nEven if I do somehow get hired to a job, I don't think I'd be able to do survive. I'll have to hit the ground running and I won't be prepared. I'll screw too many things up and I'll get fired in two weeks tops.\n\nI have difficulty deciding on another career. At the current moment my interest is in IT but it seems I drift to different things all the time.\n\nWith all that said, how can make my dreams of a happy, successful, independent life become a reality?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kkw7la/i_just_turned_27m_today_i_still_live_with_my/", "title": "I just turned 27(M) today. I still live with my parents, have no career direction, and have hardly any skills. What can I do to put my life back on track?", "social_network": "reddit", "user": "ThatBroadcasterGuy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1609039533, "permalink": "/r/DecidingToBeBetter/comments/kkw7la/i_just_turned_27m_today_i_still_live_with_my/", "nsfw": false, "first_save": 1635438207.255191, "replies_charged": false}