{"id": "t5_2tand_t3_ptl5om", "request": ["18281d65-fa68-4991-a4a1-8f37346818f3", "4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "I feel stuck in life, everytime I try to do something related  to what I think I want to do, I get frustrated, powerless, stressed out and I dont even know exactly wtf I'm doing and everytime I do something, a new problem shows up and it hinders my ability to keep going and takes away all of my will power and motivation and forces me to fall into a spiral of depression. \n\nI feel like there's not one thing that makes me happy if I'm truly honest... I'm so scared and stressed about my future and I can't even achieve the goals I set for myself cause I don't even know how to get there exactly, in most of the cases...I'm very result-oriented and if I don't see a clear path that will certainly take me to a goal, I feel lost and don't know where to go... I hope that makes sense. I still don't know why I chose this career... I also should start looking for a partner if I dont wanna be an inexperienced gay loner by 30 (I'm 24) but I'm also extremely worried about getting a master's degree and I also want to leave my country afterwards even tho Idk where to go but I don't see future in my homecountry. I even have trouble deciding what shirt to buy lol. I hate going out and doing stuff like a freaking normal human being. I feel so frustrated about a bunch of stuff and I can barely get up from bed every morning, all I think about is stabbing myself to death\n\n\nEdit: thank you guys for your replies. This is my most liked reddit post ever. I'm surprised at the fact that so many of you struggle with this too. I guess it's part of the human experience. Some people just find it easier to trust on themselves and know exactly what they want and what they want to do with their lives. For the rest of us, it all seems obscure, confusing and empty. All we want is to fix ourselves and \nreject our limiting differences to be like those people. We gotta fake it til we make it, even tho we have no idea when are we going to stop pretending. We live our lives battling with our minds every second, we struggle with this conflicting idea of not knowing the difference between what society wants for us vs what we want for us. I see a lot of useful pieces of advice in your comments, thank you. Also, thanks for sharing your own story ❤ love you guys. Good luck", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ptl5om/whenever_i_want_to_do_anything_i_get_paralyzed_by/", "title": "Whenever I want to do anything, I get paralyzed by fear, stress, etc. How do I cope?", "social_network": "reddit", "user": "Admirable-District-9", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 190, "down_vote": 0, "creation": 1632362474, "permalink": "/r/DecidingToBeBetter/comments/ptl5om/whenever_i_want_to_do_anything_i_get_paralyzed_by/", "nsfw": false, "first_save": 1635437105.4798574, "replies_charged": false}