{"id": "t5_2tand_t3_b2yu4h", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "This is going to be a long post, so bare with me if you can :)\n\nWell, the title says it all. At the age of 28 (male, 29 in 2 months) I am officially off of all anxiety and depression medications for the first time in 20 years. This has been a very long battle, one surrounded by incredibly loving and supportive parents, a slightly younger sister who is my best friend, and a therapist and psychiatrist who truly believe in me. This was by no means a feat that could have been accomplished alone, and I am so thrilled to finally be at this point. However....I feel completely lost. I had convinced myself that I would be successful in the production side of the entertainment industry. I graduated school at 23 and I made some projects that didn’t really go anywhere. A few small accolades, sure, but nothing more. During this time, I didn’t exert myself. I found comfort in complacency, and while everyone around me was telling me to push myself if I wanted to succeed in this field, I’d find every excuse to do the opposite. So now, being nearly 29, working a minimum wage customer service job, single, living at home (though paying rent to do so)...I feel completely overwhelmed. Being off of the medications have made me feel again - or , more accurately, feel for the first time in 20 years - and I’m terrified that I wasted my 20’s coasting with nothing to show for it. Yes, I have this personal success in regards to the meds, and I’m not trying to undercut the importance of that. I just feel like I am somewhat of a failure. \n\nThis may be some depression talking, which I will have my therapist and family to help me with, but I feel like I’m running out of time. I feel like I should be further along or more “out together” by this point. I come from a family of very hard working, self made, successful (both on the monetary and personal levels) people. Literally generations of people who weren’t afraid to put their all into something and eventually found success as a result of it. I know that exists in me, somewhere, but it’s been dormant for most of my life and the thought of going all in on something terrifies me. On top of that, being that I’m thinking more clearly, I’m starting to question whether or not I even want to continue pursuing the industry I’ve been mentally committed to for 14 years. \n\nI’m at a crossroads, a quarter-life crisis, and I feel so incredibly overwhelmed. I want a successful life, but I question my ability to actually push myself in order to achieve it.\n\nFor anyone else out there that has gone/is going through this, can you lend some advice? Sometimes it’s nice to hear what others think.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/b2yu4h/for_the_first_time_in_20_years_im_off_of/", "title": "For the first time in 20 years, I’m off of medication. However...", "social_network": "reddit", "user": "Overwhelmed1313", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1553009597, "permalink": "/r/DecidingToBeBetter/comments/b2yu4h/for_the_first_time_in_20_years_im_off_of/", "nsfw": false, "first_save": 1635436088.8208647, "replies_charged": false}