{"id": "t5_2tand_t3_iegwur", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I was in a really dark place last weekend. Life felt like rearranging deck chairs on the Titanic. I didn’t see purpose. I was swept up in a lot of negative feelings and I started to hide from them, to cover them up with distractions like video games and Reddit and drinking. I didn’t want to feel those emotions. \n\n\nBut there was a thought that kept coming back, it asked me “What are you hiding from?”\n\n\nScared and anxious feelings make us procrastinate dealing with them. Painful feelings make us distract ourselves and cover them up. Melancholy and dread make us want to escape and feel anything else.\n\n\nWhy do we refuse to taste half of life? The pleasant emotions we’ll drink all day, but no natural flavor is just sweet. The porn and social media and video games we distract ourselves with have only one flavor, because they are fake. Their only purpose is pleasure.\n\n\nThe real feelings that come from you have so much more to teach you. Maybe you’re scared of hurting someone by being honest about how you feel. What could that fear teach you? Are you scared of being rejected or abandoned? Is your self worth contingent on them liking you? There are so many rich lessons in these emotions. Fear is not a bad thing, it is trying to tell you something.\n\n\nThere’s significant risk in hiding from “negative” emotions. They are usually a very real clue about something missing or misaligned in our life. It can be uncomfortable to confront them directly, but I think we can cultivate a better relationship with these feelings. That's where Sam Owen's quote comes in from the title.\n\n\nI want to see these feelings as road signs. I’m not anxious because I’m broken or worthless, it’s more like I’m driving 80 miles per hour towards a sharp turn. The anxiety is a road sign trying to warn me I need to change my behaviour. \n\n\nPanic attacks don’t mean I am incomplete or will never be \"normal\". They are a barrier coming down across the road by the train tracks. They’re telling me “you need to stop and work through this right now, because it isn’t safe for you to keep ignoring this problem.”\n\n\nDon’t demonize negative feelings, don’t hide from them. They are the best teachers you will ever have. The sooner you start listening to them, the sooner you can resolve the situations that created those emotions. And it's okay to ask for help working through these feelings, there's lots of professionals out there who have solved similar problems for many, your friends can help too, and might even be going through the same thing. You're not alone.\n\n\nDon’t hate yourself for feeling depressed. Don’t criticize yourself for feeling lost or uncertain. \n\nThis emotion is a fortune cookie with some good advice, you just have to try and understand it.\n\n\n\nFurther reading: If this post resonated with you I really recommend The Inner Child Workbook: What to Do with Your Past when it Just Won't Go Away by Cathryn Taylor. Much of the pain we feel today is scar tissue from long ago, even if we don’t realize it. This workbook is helping me heal a tiny bit everyday. The exercises are incredibly thorough, and I still go to therapy but this way I can do so much at my own pace, and then talk to my therapist about it to add insight or answer questions. \n\n\nReading 50+ self improvement books won’t teach you to fly. But if you start letting go of all the baggage you carry, someday you’ll be able to walk again.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iegwur/fear_of_confronting_emotions_is_like_fear_of/", "title": "\"Fear of confronting emotions is like fear of reading road signs\"", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 36, "down_vote": 0, "creation": 1598096008, "permalink": "/r/DecidingToBeBetter/comments/iegwur/fear_of_confronting_emotions_is_like_fear_of/", "nsfw": false, "first_save": 1635436633.2809815, "replies_charged": false}