{"id": "t5_2tand_t3_n5zqhn", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "First of all, let me start by saying that I have one app for official matters, snapchat and reddit (on laptop). That's pretty much it.\n\nI am outgoing but I rarely make any friends whom I'd like to spend time with. I have a couple of close friends, one of whom is someone I met online and the other two I know personally.\n\nBeing an oddball growing up, I always faced the good old dilemma about fitting in and have had a long time bad run with people in general. So, ever since I was 13 and got facebook for the first time, I have spent more time making friends on the internet. I'm in my early 20s rn and I have observed the pattern that at this point, it has become a source of instant gratification and a cure for momentary loneliness and overthinking. It's not as harmful but its not particularly fulfilling or significant either.\n\nSo, I want to ask this. Apart from hobbies and things which I do indulge in whenever I can, how do I fight off loneliness? How do I learn to be idle, alone and still happy? I never really felt a need to learn this before but I have noticed how mind numbing our reliance on the internet can end up being.\n\nI am mostly just running away from the overthinking and I've been trying to meditate as well. Is there anything else that helped you be away from this stuff and be content in your own space?\n\nPlease let me know.\n\nThank you. \n\nGood day xx", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n5zqhn/how_do_i_lead_a_better_life_without_falling_back/", "title": "How do I lead a better life without falling back into the cycle of using social media and talking to strangers for momentary escape?", "social_network": "reddit", "user": "Early-Department273", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1620277703, "permalink": "/r/DecidingToBeBetter/comments/n5zqhn/how_do_i_lead_a_better_life_without_falling_back/", "nsfw": false, "first_save": 1635437995.968987, "replies_charged": false}