{"id": "t5_2tand_t3_pzw9zy", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "c67213dc-0eed-4cac-a781-9bc082742908"], "text": "I think a large portion of my own anxieties and issues are related to one thing: a deep fear of failure. Allow me to elaborate more. A more specific description would be a fear of failing or a fear of appearing incompetent and not knowing how to do something, or not doing something well. Ultimately I've begun to understand that now as an adult not only do most people simply don't care that much to even notice what you do or don't do well, but also that everyone is shit at many things. However this fear I think has severely impacted my life as I reflect on it. It seems to be such a hindrance at me trying or taking risks in my life out of fear I will do it extremely badly. Where does this start from? Was it not getting assurance from a young age that making mistakes is okay? Even if I rationalize it in my mind, the fear and feeling is still always there and I really want to begin to rectify it. \nIn some ways I have begun that. I finally started learning to drive at age 26 and the biggest reason I never learned was out of fear of not knowing how and being bad at doing it. But how can you learn without first being bad at something? I am proud that I took this step but I'm noticing I'm still in this mindset in other areas of my life. Even in my relationship. Does anyone have any tips on how to better manage this fear?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pzw9zy/i_think_i_might_have_identified_my_biggest_flaw/", "title": "I think I might have identified my biggest flaw", "social_network": "reddit", "user": "HarthenOcarus", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1633185189, "permalink": "/r/DecidingToBeBetter/comments/pzw9zy/i_think_i_might_have_identified_my_biggest_flaw/", "nsfw": false, "first_save": 1635435960.9174764, "replies_charged": false}