{"id": "t5_2tand_t3_ax6shz", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "Let me start this off by stating the obvious, depression sucks! Its pretty common these days to hear about people who suffer through it but most people turn the other cheek hoping they'll just \"get over it\". That doesn't just happen over night and it honestly takes quite a bit of effort from the person suffering to get over it. I'll list some of the things I've done in the past and how they helped me.\n\nExercise! Get your ass out there and get a workout in. Endorphins are a natural high and honestly one of the best feelings in the world is finishing a workout and feeling that flood of endorphins hit you. Aside from this, other people will notice results after a while which always feels good. You feeling better about yourself is always a good thing.\n\nMeditation has been huge for me. It helps you to get out of your head. There are tons of guided apps out there these days such as Headspace or Calm. These are an excellent tool to help you stop dwelling on the past, which causes depression and to stop worrying about the future, which causes anxiety.\n\nNutrition is a big factor in this equation as well. The more nutrient rich foods you eat the better you're going to feel. You get out of your body what you put into it. If you're feeding your body junk food, then odds are you're probably going to feel like junk. Feed it healthy foods and you'll feel healthy and more energetic.\n\nPut that bottle down. Alcohol is a handy escape, but it is just that, an escape. An escape that actually makes things worse. In case you haven't figured it out yet, alcohol is a natural depressant.\n\nAffirmations are a good way to get your mind out of the funk that it keeps sitting in. A lot of the problems with depression comes from the fact that we worry that we're never going to get out of it. This is just a phase in your life and its bound to pass if you put the work in to get through it. Instead of telling yourself all the negative feedback inside of your head, start a positive one! Remember this is only temporary and \"this too shall pass\".\n\nSurround yourself with loved ones. Being alone sucks! Magnify that tenfold when you're depressed. Get out and hang out with people you care about and who care about you. Social health is a big factor in overall health. Humans are naturally social beings and need human interactions. It's so tempting to lock yourself away in a room and sleep your problems away when we should be doing the exact opposite.\n\nCut out the porn. It has a huge list of negative side effects. It floods your dopamine receptors and eventually desensitizes you. Its also perceived by some a shameful act, that's why you do it in private and are often hit with a sense of guilt after it. Eventually zapping your self esteem. Cut this out and your self esteem will sky rocket and that's always a huge help when battling depression. Not to mention it'll make you a more compassionate human being overall.\n\nRead self help books and listen to podcasts. The subtle art of not giving a fuck, You are a badass, The happiness hypothesis, Ego is the enemy. These are all great books that you can listen to on audible of you're not a big reader. These are hands down some of the best books I've ever picked up. As for podcasts I usually just got into fitness (Mindpump is hands down THE BEST) and psychology podcasts for the self improvement aspect which in turn helped raise self esteem, promoting self love.\n\nJournaling is a great way to get your negative feelings out on a piece of paper and be done with them for the day. Personally I write them down with the mentality I'm going to get it all out and be finished with it and it works like a charm.\n\nCounseling is something I would pursue if the things on this list aren't working for you. A lot of people find it shameful to seek help and think it makes them seem weak. In fact the opposite is true. It takes a strong person to realize they aren't doing a good enough job trying to fix their current situation on their own and to seek help. There is NOTHING wrong with reaching out for help when you need it. Put your pride aside and seek help.  Make sure you find a therapist/counselor that fits you.  If you feel uncomfortable or that they aren't taking you seriously then try and find another one.  Be picky when choosing your therapist.\n\nFor me personally church helped a lot. My girlfriend and I watch Elevation Church every Sunday and it's been great! If it's not your cup of tea that's fine but for me spirituality played a pretty large factor in beating this as well.\n\nA licenced therapist/doctor will also be able to set you up with medication if you feel it is needed.  If you feel this is the best approach I highly recommend it.  There are, however, people who prefer to do other things to try and remedy the problem before getting put on medication and thus this list was created.  There is nothing wrong with seeking medication to remedy the problem!\n\nIf this can be of help to at least one of you out there then my purpose of writing this is served. I wish you luck on your battle with this nasty monster and remember that it won't be easy but you can do it! It does get better! Your life is worth living!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ax6shz/depression_a_list_of_things_that_may_help/", "title": "Depression... A list of things that may help.", "social_network": "reddit", "user": "XxFata1ityxX", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 514, "down_vote": 0, "creation": 1551703862, "permalink": "/r/DecidingToBeBetter/comments/ax6shz/depression_a_list_of_things_that_may_help/", "nsfw": false, "first_save": 1635435823.9515972, "replies_charged": false}