{"id": "t5_2tand_t3_q124jj", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "c6df14ee-195b-4e9d-8032-7cca73d46fe8", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "This is my throwaway account where I talk about all my sorrows with no one knowing that it's me.\n\nI want to change. I want to feel at peace in life. J want to be happy, with life. And myself. I thought about dying a lot, but I don't really want to. I just want this distress to stop. I wanna have peace. I don't wanna die. Exactly the opposite, I want to be *alive* not to just live. \n\nBut here's the problem I have no freaking idea how to do that. People always have told me I'm smart, I'm mature, I'm respectful but even if whatever they say isn't untrue, it's not enough. I see my other old friends getting somewhere in life. Literally everyone. But me. Now I'm aware comparison is bad even though I do it but this is not the point, I wanna be happy myself I don't want others to be unhappy too. I don't even know if they're happy. Feels like happiness is just a fantasy, so many people don't have it\n\nReason I don't feel motivated to do anything is that I feel as if no matter if I have all the wealth in the world, no matter what I do, if I have close friends or a partner or a good job or good hobbies, this unexplainable discomfort inside me will be still there with me . Although I have almost none of these things but I just imagine myself have the life I always wanted, it doesn't feel like I can be happy in it. Sure it may be better than this but I'll still be miserable. Therapists in my country suck and they're expensive too so it's not an option otherwise I really would've liked it if someone worked with me to figure out what the hell is wrong within me? I really wanna know the answer to this but it's not that easy.\n\nSeems like I'm doomed to have this lingering emptiness inside me that feels uneasy and I don't know how to feel alive. It's always in the background. It won't go away. What does it mean.\n\nI'm so so confused about everything, my gender identity, my sexuality, who am I, what I like, what makes me happy, what makes me me. I'm very jealous of people who are actually at peace, they're not lonely, they have loving people around them, they know what they want to do, they know what they enjoy. I have no idea how they can but they can be at peace in life and this emptiness doesn't cause them discomfort constantly.\n\nI'm very jealous of them. I wish I could not be so empty. I'm only a shell. I'm not even a person. \n\nI guess I just, wanted to know since I don't have the intention to die, then where do I go from here? I'm 18 rn. It legit has been like this ever since I turned 14. I thought going away from my surroundings would help me, to move away to a new country and to have a new and better life. I thought so much about it and it used to feel maybe this is what I should do, I haven't done it yet.  but as I grow up I feel as if I get even more confused. Is everyone the same? Is everyone feeling empty all the time? With no idea what life is?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q124jj/i_hate_that_reddit_and_random_strangers_is/", "title": "I hate that Reddit and random strangers is literally only place I can reach out to for help", "social_network": "reddit", "user": "ThrowAway12348wobxsj", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 255, "down_vote": 0, "creation": 1633340332, "permalink": "/r/DecidingToBeBetter/comments/q124jj/i_hate_that_reddit_and_random_strangers_is/", "nsfw": false, "first_save": 1635436249.126248, "replies_charged": false}