{"id": "t5_2tand_t3_q9bv6r", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "Finding the right people helps, and to do that, you need to get out of your comfort zone\n\nI wouldn’t have said that 5 months ago. But indeed, it’s true. Earlier this year, I cut contact with my friends. I did school on my own. I focused on reading, widening my knowledge and improving my overall attitude towards life, all in isolation. The downside was that my anxiety went higher, and I was avoiding socializing at all cost, even at the expense of my grades. I was able to endure all that because I had this unhealthy and inflated belief that I was the best, that because I was focusing on growth, I was greater than those who weren’t - which I presumed as everybody else.\n\nBut when I started college 2 months ago, I was forced to break out of my comfort zone. It was one of the most challenging times for me this year because my suicidal tendencies came back, which I thought I had overcome 2 years ago. But I didn’t quit. I endured extreme loneliness from being around people I didn’t know. But I knew it wasn’t the end so I pushed through. It was the one of the best decisions I made this year! \n\nAlong the way, I’ve learned to get help. I reached out to my friends again, they welcomed me and understood where I was coming from. I’ve also made friends now in college. And just yesterday, I was interviewing an alumni, a total stranger to me, and it felt energizing. Something I never thought I would have done in a million years. I’m also firsthand learning from teachers, not just words written on books. \n\nPart of self-improvement is finding a sense community in the world around us - something I have neglected because of my blown up ego. Go out and meet people. There’s a lot to learn from everyone.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q9bv6r/i_went_out_of_my_comfort_zone_and_i_became_happier/", "title": "I went out of my comfort zone and I became happier", "social_network": "reddit", "user": "gunpowdergelatineee", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1634390402, "permalink": "/r/DecidingToBeBetter/comments/q9bv6r/i_went_out_of_my_comfort_zone_and_i_became_happier/", "nsfw": false, "first_save": 1635435931.8405464, "replies_charged": false}