{"id": "t5_2tand_t3_b7j9v7", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I've struggled with feeling empathy my whole life and was raised to be highly judgmental of people. Especially judged: anyone slightly overweight, anyone who wore dirty clothes or kids with dirty faces, or any child who wasn't silent in public. Recently, I was tired of the judgmental thoughts and decided to reframe them. The first time I did this went like this:\n\n&#x200B;\n\nSaw a woman at church load a tupperware of food from the breakfast table.\n\nThought \"That's way too much for one person. I hope she left some for the rest of us.\"\n\nThought \"Well, she does walk with a walker. Maybe she's on disability and has to watch her food budget closely. Maybe this is the only meal of the week that she can eat as much as she wants. Maybe it's the only time she gets full.\"\n\nThought \"Oh wow, she will really enjoy those muffins and I'm glad she has them.\"\n\n&#x200B;\n\nThis thought progression only ever happens in my head but it's made a huge difference in how I think of people whom I previously judged. And because my thinking is better, I'm also nicer to them, rather than pretending to be nice while thinking judgmental thoughts. I'm optimistic that with more practice, the kinder, third thought will come first. And if any of you have tips for becoming a more empathetic person, please shout 'em out.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/b7j9v7/when_i_have_a_judgmental_thought_about_someone_i/", "title": "When I have a judgmental thought about someone, I immediately imagine them in a terrible situation instead.", "social_network": "reddit", "user": "ekbromden", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 718, "down_vote": 0, "creation": 1554001622, "permalink": "/r/DecidingToBeBetter/comments/b7j9v7/when_i_have_a_judgmental_thought_about_someone_i/", "nsfw": false, "first_save": 1635437615.0184274, "replies_charged": false}