{"id": "t5_2tand_t3_hvvub6", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "**TLDR; My understanding of what open-mindedness is while using Sokka from** ***Avatar: The Last Airbender*** **to compare his character to the real world. Also, I talk about how you can be more open-minded**\n\nWith what's been going on, I became very frustrated seeing so much fighting and chaos between people of different opinions. It became clear to me that, to encourage peace and prosperity within yourself and with other people, we must evoke one of the most important qualities as a human being: **Open-mindedness**. I wrote this up to give my understanding of this quality and how you can evoke it.\n\n# What Is Open-mindedness?\n\nI found [an article from the University of Pennsylvania](https://www.authentichappiness.sas.upenn.edu/newsletters/authentichappinesscoaching/open-mindedness) that defines open-mindedness as:\n\n&#x200B;\n\n>Open-mindedness is the willingness to search actively for evidence against one’s favored beliefs, plans, or goals, and to weigh such evidence fairly when it is available.\n\nA phrase I like to associate with this is being able to \"put your guard down\".\n\nOver the course of our lives, we take in information to apply it to the present moment. We use it for dealing with people and performing tasks. For example, if you see a hot stove, you are going to keep away from the heat because you learned in the past that it’s not safe to do that. Your body is always trying to protect itself, and it uses the information gathered from the past to determine what is a threat.\n\nOf course, as we all know, the body is never perfect, and that’s what brings me back to my phrasing of putting your guard down. Part of the information that we take in is our values, morals, and generally things that we care about the most. When you come in contact with someone who clashes with what you deeply believe in, the body is going to take this as a threat.\n\nWhy does your body take this as a threat? It comes from fear, and specifically the fear of being wrong. This is why political conversations get so heated, the things we care about the most is how we should live our lives. As a result, when someone presents a possibility that your core values are wrong, the body’s fear response (or *guard*) is going to be held up the strongest.\n\n# Sokka - Avatar: The Last Airbender\n\nI love TLA, and Sokka is one of my favorite characters. One of my favorite things about him is that he is such a great character to highlight the importance of open-mindedness.\n\nLook at him, from the very beginning, he’s pretty distrustful of Aang and calls him out as a traitor. When he meets Suki, he clings to his personal beliefs about what a warrior truly is as a result of clashing with people who aren’t in line with that. In the [Fortune Teller episode](https://www.youtube.com/watch?v=H_zYBbN2FHo&t=1s), we see the negative consequences of Sokka’s close-mindedness. I see this as how much unneeded suffering close-mindedness causes for him. This applies the same way in the real world: we cause suffering to ourselves and to other people.\n\nBut like I said, his close-mindedness doesn’t just come from nothing. As in the real world, Sokka’s personal beliefs came from somewhere. In *Bato Of The Water Tribe* (S1 E15), we see a flashback of young Sokka saying goodbye to his father. His father’s last words to him are that \"being a man is knowing where you are needed the most, \\[for Sokka right now\\], he needs to stay at home protecting his sister.\"\n\nWhen it comes to things we care about the most, the less likely we are to be open-minded to new possibilities. The fear is strongest, and it makes sense. Think about Sokka, do you think the wise words from his father, a man he cares about and misses, are something he would want to be wrong? Of course not. So as a result, Sokka clings to these beliefs.  \n\nThe real-world equivalent to these situations is political conversations. One of the many things we humans care about is how we should live our lives, which is the foundation of political beliefs. This is why these conversations get so heated, the fear of your core beliefs as an individual are at stake, so you are going to go full-on close-minded mode if you so give in to the fear. When this happens, we defend to no end.\n\nIt all goes to show that sometimes, **we have to give up the thing we want the most, and simply admit that we were wrong. When we do this, we better ourselves and create peace for our friends, family, and society as a whole. Given what’s going on in the world right now, we need this more than ever.**\n\n# How can I be more open-minded?\n\n&#x200B;\n\n1. *Be mindful of how your body reacts when you are in an argument or dispute*\n\nOpen-mindedness matters most when it is the hardest to evoke (e.g. Political conversations), so it’s important that you first pay attention to what’s going on in your body first. In these situations, be mindful of what you feel, what you are urged to do, and what your thoughts are. This will allow you to see what changes when the fear response arises, so be sure to make adjustments so you are more prepared for the future.\n\n&#x200B;\n\n1. *Question everything*\n\nActualized.org has two awesome YouTube videos that talk about open-mindedness and this topic specifically. In the video, he asks you to consider the possibility that your mother hatched from an egg. Ridiculous right? But pay attention. The way your body reacts can potentially give you a taste as to how close-mindedness works. You want to apply this as an ongoing and regular principle in your everyday life to keep your mind open consistently.\n\n&#x200B;\n\n1. *Meet new people*\n\nThis is the hardest thing to do out of the three (even harder give social distancing), but for me, meeting people was my ultimate breakthrough in not only becoming more open-minded, but just simply growing as a person. We often get accustomed and comforted in our original friend groups, circles, and the places we come from. Getting our of your comfort zone and befriending people with different likes, dislikes, and ways of life will no doubt make you less prone to triggering that fear response. Not only that, but you will just become a more likable and well-rounded person with more perspectives and ideas under your belt.\n\n&#x200B;\n\n# Final Thoughts\n\nI want to make it clear that being open-minded is HARD. Fear is a powerful force that often overcomes us, but know that as long as you are trying your best and making the effort to be more open-minded, that is the only thing that matters. Good luck everyone\n\n[Thank you all. If you are interested, there is a video version of this post that I recently uploaded, in case you want to check that out instead,](https://www.youtube.com/watch?v=TMv6Xg2-rIo)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hvvub6/what_is_openmindedness_the_importance_of_an/", "title": "What Is Open-mindedness? | The Importance of an Open-mind with Sokka", "social_network": "reddit", "user": "KingJodeg", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1595431889, "permalink": "/r/DecidingToBeBetter/comments/hvvub6/what_is_openmindedness_the_importance_of_an/", "nsfw": false, "first_save": 1635436529.7746508, "replies_charged": false}