{"id": "t5_2tand_t3_piew3j", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "TLDR: I was 18 when I fell in love with my ex. He was my first love, first kiss everything. He was perfect in every way, except, his views on body image issues, and relationships  made me really uncomfortable and insecure. Both my parents were (and still are) depressed. And my family is severely dysfunctional. I have no siblings, only very superficial friendships. I had not processed any of my childhood trauma and had just distracted myself with studies, co curriculars, food and then religion all my life, untill I met him. We broke up and I begged him to take me back but he didn't and since that day, I think about him every day and regret everything I did to drive him away.\n\nHe was 2 years older and felt like a grown up. I think I was trying to look for a foster parent in him. I put him on the pedestal  of a life coach or something and took everything he said to heart. He was an atheist and I sort of stopped having my own beliefs and lost my identity trying to be him. If I liked a tv show, but he said it was trash, I would stop watching it. He once commented that I was 'virtually fatherless' and that opened a can of worms in my subconscious that made life shitty. \nThat was the level of his influence on me. I was head over heels in love and honestly, quite unhealthily attached to him. Would hang on his each word and believe it like gospel truth. I  considered him like a messiah who would make me forget my shitty home life and make me happy all the time.\n\nThe first time we had sex, I got so emotional, I blurted that I'd love to marry him and I aslo added that he may not feel the same and that's ok but I just wanted to say this. And he said that I should lose weight and only then he would marry me. And that just broke me completely. It was ALL downhill from there.\n\nI started obsessing over his exes and comparing myself to them ( something I judged my friends for doing), even though I had been ridiculed for my looks earlier, it didn't affect me much, and I was kind of ok with my body (didn't hate it, didn't love it) \nBut after he said that, I became this insecure psycho bitch \n\nEarlier I never used to get paranoid about his frequency of texting me or him hanging out with his hot lady friends. But after he said this, I just couldn't ever stop obsessively imagining him with someone hotter.\n\nI completely went bananas when he said he wanted to go to a strip club. The image of him looking at naked women with amazing bodies and then coming home to my gross one just shattered me and we had a huge fight, but anyway, I apologised and he forgave me.\n\nWe had a rocky relationship for 1 year after that. We would love bomb each other but then also argue like crazy. I would cry so much and say that I didn't feel loved and wanted to break up. And that would make him cry and seeing him cry I would feel horrible and I would make him cards and write him poems to apologise. We grew further apart during the quarantine and he started the keto diet to lose weight and spoke very disgustingly of fat people. I was super paranoid and would cry every day. I thought he was only with me because both of us were fat and not very attractive, but after he lost a shit ton of weight, I became insecure and would try to demotivate him. I realised my mistake in time though and apologised and never did it again. After another fight over something I can't even recall, I completely lost my shit and said the most horrible things to him and blocked him. (That day was horrible day, I had had a panic attack even before the fight and had taken 2 sedatives right before we fought, this is kot an excuse tho)\n\nAfter that, the next morning I begged him to take me back, literally fell at his feet, but he refused to take me back and never texted me after that. I apologised so much, he said he forgave me but he couldn't be with me anymore. After 3 months of begging him to take me back, I stopped.\n\nI decided to turn my life around, take therapy, read materials that would help me be better. \nAnd all of it is still going on\nI started dating another guy 9 months after the breakup\nAnd being with him made me realise that my ex was not a great boyfriend, but he was an amazing person. \n\nAnd I probably won't be able to love anyone else ever again as much I love and respect him.\nBut I found out he's dating someone else now and he's head over heels in love with her.\nThis didn't make me cry or anything, but I still miss him a lot and regret hurting him so much.\n\nI wish I could love myself half as much as I loved him. The guilt of ruining a good relationship with a lovely person still weighs on me and I am very scared that I'll never find anyone as amazing as him.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/piew3j/cant_shirk_this_dreadful_feeling_of_regret_of/", "title": "Can't shirk this dreadful feeling of regret of having lost the love of my life because of my toxicity", "social_network": "reddit", "user": "butterbuttbut", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1630854910, "permalink": "/r/DecidingToBeBetter/comments/piew3j/cant_shirk_this_dreadful_feeling_of_regret_of/", "nsfw": false, "first_save": 1635436456.5121322, "replies_charged": false}