{"id": "t5_2tand_t3_os453n", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "First off, I just want to say that I’m not defending or justifying anything I did. I know what I did was wrong. I just want to be able to fix it. Yesterday, my bf (26M) and I (25F) went out to brunch with my family to celebrate my cousin’s birthday. We went to this day club/lounge type of spot, so of course everybody was drinking and having a great time. \n\nAfter we left, it was a 2 hour drive home. He was driving because I was buzzed. I let him use my phone for the gps, and his phone was connected to the aux cord for music. He has an android, so we had to use youtube for the music. I was trying to look for a song when I swiped down and the notifications page popped up, to where I saw that he had a message from a girl I’d never heard of before. We’ve had trust issues in the past, and I’ve been cheated on in my other relationships, so transparency is very important to me.\n\nI asked him about the message, to which he replied that he was talking with a cousin of his I guess? As we were talking, his phone locked due to no activity, so I went back to open it up and it prompted for a pin to enter. That was new, as he never had a pin before. I have a pin on my phone, but that’s because Apple Pay requires me to have one, or else I wouldn’t have one at all. He knows it though, and has open access to it whenever he wants.\n\nAnyways, I started losing my shit, as cheating is a huge trigger for me. Also coupled with the fact that I was under the influence made it worse. I started screaming at him, he took his phone from me and I attempted to grab it which resulted in him swerving the car while on the freeway. It got bad. Then he pulled over and said he was just going to Uber home because he didn’t want to continue this fight. I got out and tried to force him back into the car, barefoot and all, and he kept refusing. He tried to walk away and leave and I grabbed his shirt, to which he pushed me away. I gave up after a few minutes of shouting back and forth.\n\nI got to his house since I had to pick up my stuff from there, but all the way I was seething and irrationally angry. Once I got there it got worse. I called him names, got into his face, pushed him into the wall, pushed his head against the door… slapped him. I became someone I didn’t even know.\n\nI feel extremely terrible about it. I abused him because I didn’t respect his boundaries. He called me after I got home and we talked about it. We agreed to take some space.\n\nFirstly, I’m extremely concerned with the amount of anger I had. Why and how did I get so violent? And how do I come to the bottom of that? I feel so terrible for putting my hands on someone I love. There is nothing excusable about what I did, no matter if he really had something to hide or not.\n\nSecondly, how do I properly apologize to him and make this right? I don’t want this to become a cycle. If we go into a honeymoon phase it will only be a matter of time before I go off the rails again. How do I kill this cycle before it begins? I feel so disgusted with myself and greatly ashamed.\n\nAny tips or insights would be appreciated. Advice. I just want to be able to have healthy anger and not explode into some abusive pos. Thanks in advance.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/os453n/i_abused_him_and_i_feel_terrible/", "title": "I abused him and I feel terrible.", "social_network": "reddit", "user": "catxviii_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 37, "down_vote": 0, "creation": 1627322117, "permalink": "/r/DecidingToBeBetter/comments/os453n/i_abused_him_and_i_feel_terrible/", "nsfw": false, "first_save": 1635435082.9101093, "replies_charged": false}