{"id": "t5_2tand_t3_p8kns9", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "Hey guys, I'd really like some advice so I'll make this relatively short. I'm in a sort of unique situation where I missed out on various milestones throughout my young adult years.\n\nI am 29 year old man who is lagging behind in several areas of life for various reasons. I just spent the last couple of years in bad financial state (mixture of getting laid off 3x, trying to start a business and failing, student loan debt, helping my mom with expenses, etc.) which really hampered my ability to do things. But on the surface, it seems like nothing's wrong with me. Physically, I'm 6'1\", 196 lbs @ around 12% body fat, I work a remote job where I make 70k plus/year (just got in April), I am well spoken, I play musical instruments, I read, I enjoy hiking/working out, so many different things.\n\nHowever, I've never been on a date. I've never had sex (most of my friends are in a relationship or married). I have limited travel experience (I live on the East Coast and have never been past the Mississippi, though I have been to Europe). I am also sort of behind financially (many of my friends are getting homes and such).\n\nPart of this can be traced back to the fact that I went to an all boys' school which set me up bad for college. Part of it can be living at home due to a terrible financial situation and being a caregiver to my perpetually sick mom (I will say in the next year I plan on moving). Pretty much, I never got to experience life as a young man and now I'm in a better position to take advantage of things life has to offer. My real fear is that I'm running out of time. I know windows of opportunities have closed on many things but I just want some help picking up the pieces of my life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p8kns9/missed_out_on_my_20s_need_help_on_where_to/", "title": "Missed out on my 20s, need help on where to proceed from here", "social_network": "reddit", "user": "RoomForImproov", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 33, "down_vote": 0, "creation": 1629518605, "permalink": "/r/DecidingToBeBetter/comments/p8kns9/missed_out_on_my_20s_need_help_on_where_to/", "nsfw": false, "first_save": 1635435126.733552, "replies_charged": false}