{"id": "t5_2tand_t3_cgf400", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "I'm 21 almost 22 now and when i was in the fifth grade my parents pulled my brother(in 9th grade at the time) and I out of public school and started attempting to home school us, my parents were in no way educators of any kind and thought it'd be a great idea because my dad worked on the road and he wanted us with him more, my moms idea of homeschooling was to give me the books she ordered from the home school academy and tell me to do the work, she never actually taught me any thing in those books, to my own detriment I acted like the little kid i was and just threw my homework to side, played games, and procrastinated (my brother and i had a hotel room to ourselves while my parents were always in the next room over so it wasn't really hard to ignore the work when they never really checked on us) until we had 3 weeks to do the work and mail it in so my mom made the decision to give me the teachers version and told me to copy the answer but fudge it a little every now and then and I regret to say that i was perfectly okay with this at the time, to me it was heaven stay in the hotel, play games, eat junk food and no school too have to wake up early for.\n\nThe last grade i actually remember doing any work for was 6th grade, after that it was pretty much a repeat of the fifth grade cheating. i never graduated via cheating or actually doing the work and for a few years now its been eating away at me making me doubt my self, I've been depressed for so long and still currently am but it comes and goes, i got fired from the only job I've ever had about 2 months ago because i was in a funk one day at work and messed something up so they let me go and right now its faded enough for me to work up the courage to come on here and ask for advice.\n\n&#x200B;\n\nIf any one has any resources (websites and the like) i can use to try and pick up my education and maybe try and graduate extremely late if that is even possible or even just study to get to the point where i can get my g.e.d. , which I've already looked into and honestly didn't even understand the study guides they give you to prep for it, it would help so much, im tired of feeling like this and i want to be better i just need a little help to get started.\n\nif you believe this is in the wrong /R just tell me where it should actually go and I'll move it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cgf400/decided_to_finally_try_and_better_myself/", "title": "Decided to finally try and better myself.", "social_network": "reddit", "user": "BeardedGamer97", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1563811528, "permalink": "/r/DecidingToBeBetter/comments/cgf400/decided_to_finally_try_and_better_myself/", "nsfw": false, "first_save": 1635437183.617086, "replies_charged": false}