{"id": "t5_2tand_t3_osnhs6", "request": ["f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "Title summed things up. Husband told me he scheduled my dentist appointment for \"next Tuesday at 7:30 am\" and I arrived. The lady behind the counter looked confused, double checked, it is on Thursday. \n\nWe have three kids under 2 (twins) and having someone to watch them while we are both out of the house is super challenging. We had everything arranged for Tuesday, not this Thursday. So its a huge hassle. Not to mention, since it was a dental appointment, I skipped my coffee this morning.\n\nDid I get mad at my husband? Initially, yes. Then I made myself stop and think it through. Would he ever purposefully set me up to fail like that? No. He's my partner. We do our best to lift each other up and make our lives easier. I can be annoyed at the situation, but assigning blame helps nobody (unless this was a repeated problem or something of that nature).\n\nI grew up watching my parents fight and blame each other for every little thing, instead of coming together and solving problems as a team. I am deciding to be better by not having that mindset in my marriage. It helps. A lot.\n\nEdit: this is a really wholesome and supportive community.\n\nEdit 2: why didn’t I schedule my own appointment? Well, I did. I scheduled both our appointments for a week earlier at the same day/time, but our babysitter fell through. My husband let them know and rescheduled mine because it was more convenient that way.\n\nFor the individuals that said “if you did it yourself you’d have no issues” - when you’re in a committed relationship you have a partner to rely on for these types of things. Sometimes mistakes happen, but if I can’t rely on my husband I don’t see any point in being married.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/osnhs6/husband_said_he_made_my_730am_appointment_for/", "title": "Husband said he made my 7:30am appointment for Tuesday, got there and it was on Thursday", "social_network": "reddit", "user": "GirlGotYourGoat", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1658, "down_vote": 0, "creation": 1627394742, "permalink": "/r/DecidingToBeBetter/comments/osnhs6/husband_said_he_made_my_730am_appointment_for/", "nsfw": false, "first_save": 1635438393.7174814, "replies_charged": false}