{"id": "t5_2tand_t3_gfwbwr", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "I’ve never been one for taking chances or risks. I don’t mean going skydiving or something “extreme” like that but more in terms of being okay with not feeling good. I’ve taken a lot of actions to make myself feel safe but they’ve actually kept me from reaching my full potential. I’ve had a false sense of safety because I haven’t done anything to shake the old habitual stuff in a real way, until now. \n\nTo give an example of what I mean, a situation came up yesterday that really proves I am heading into new territory and I’ll start with this for context: I can’t stand the idea of someone being mad at me. I know it roots back into my childhood, my mom was very aggressive (emotionally and mentally- never physically). She was full of rage and anger from her unhealed stuff. I can remember even when I was young that she would get mad me for doing kids stuff, and then as I got older when I was “rebellious” she really got scarily mad because I was defying what she deemed acceptable. She would lose her mind at me. Her energy is extremely harsh and I’ve been told by others it feels like daggers being thrown at you which I totally resonate with. Anytime I went out of line or anytime I was bothering her, I’d know about it on a grand scale. I learned that I was the problem. And then i learned that I was the one who had to fix it. I had to apologize or else my mom wouldn’t speak to me for days. I had to be the one to suck it up because I needed my mom, more than she needed me. So I did. And so, the habit was formed. \n\nI’ve been experiencing some parallels between my mom and a coworker. Everything is a mirror, right? So my coworker is very aggressive but has a sweet spot for me because I’m agreeable and help her (sometimes at the cost to my own inner peace and my own work). It’s been really bad while working from home.  I needed to do my own work but she was calling me incessantly over something our boss needed for a meeting in 45 minutes. This was something she told our boss she had for 2 weeks already. She doesn’t know how to use excel really and working from home she says her computer doesn’t work well for excel. I helped her and then I realized how stressed she was making me and the fact my boss told her to do it. My boss called and when she asked me what I was doing I mentioned I was assisting my coworker with the spreadsheet and my boss lost it. \nI’m done with being the person that does all the work silently. I have a million things to do for my boss and she knows that and our relationship has actually gotten better during all of this. My coworker was taking advantage of me and trying to take credit for work I did. My boss asked why i was doing it because she told my coworker it was her responsibility. I told her that i was told it was a priority and very important that it’s finished quickly. My boss then called my coworker freaking out. Coworker then reached out to me to ask me to send her everything I had done and she had to finish the rest herself. \n\n30 minutes later my coworker reached out asking for me to help with something else “when i had a chance”. I couldn’t believe it! I didn’t answer the email because I was busy and didn’t have any “chances”. I have to stick up for me. \n\nThe next day came and I was getting aggressively written emails from my coworker. I had an idea: I would call her to make amends! To apologize for not answering! To see if she was okay. And then I stopped myself, “why am I so uncomfortable with the idea someone could not like me in this moment? Why do I need to fix everything?” And then my mom came to mind. \n\nMe sitting for hours with the feeling my coworker could be mad at me was really uncomfortable. But I didn’t try to fix it because I realized I did nothing wrong. That is a big step in the right direction for me: not bridging myself on top of a puddle so others can cross on top of me. I’m so used to being the one who gives in. Not doing so made me really uncomfortable. But I can be uncomfortable and still not act on every urge just bc it’s uneasy for me to sit with it. It’s ok to feel weird about a situation because you’re not doing what you usually do, which in my case was self-sabotaging just to make sure someone else was ok with me. \n\nWhat someone else thinks of me in any given moment really isn’t my business. I have to stay true to me and follow the path of growth instead of the one that leads me to places I’ve gone before.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gfwbwr/get_comfortable_with_being_uncomfortable_its_the/", "title": "Get comfortable with being uncomfortable. It’s the only way to grow.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2528, "down_vote": 0, "creation": 1588955339, "permalink": "/r/DecidingToBeBetter/comments/gfwbwr/get_comfortable_with_being_uncomfortable_its_the/", "nsfw": false, "first_save": 1635435177.6301005, "replies_charged": false}