{"id": "t5_2tand_t3_qehydx", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "Edit: I just wanted to say thank you to everyone in the comments! I got way more responses than I anticipated, and I appreciate all of the help so much. I’ve gotten a lot of helpful responses that I plan on incorporating into my life. Hopefully it’ll help others in the same situation as well. 💖\n\nI’ve (22f) got an insecure/anxious attachment style. When I’m taking care of my mental health and doing things I enjoy, focusing on myself and enjoying others as extras in my life, things go really well. I’m able to interact with others and enjoy my time with them, but not cling to them. \n\nBut often, I’ll have a really good interaction with my friend or SO, and I’ll cling to that feeling. I’ll become obsessed. It’s almost like I mistake the good feelings for them being like the “cure” to my unhappiness. I’ll begin to neglect myself to focus on how often they respond, seek reassurance if they’re mad/still like me, worry about the future of the friendship/relationship, have extreme positive mood swings when we talk then crash when we’re unable to, etc. \n\nI’ve also noticed that when someone is anxious to talk to me, or gets very serious, I become very anxious and distance myself out of fear.\n\nIt’s a very destructive cycle. I’m in therapy, and improved a bit. I’ve been told that self-love and enjoying spending time alone will help. But it always comes back. I’m not sure how to truly love myself without depending on others. I’m also worried that if I don’t have a tight grip or my relationships and friendships, they’ll go away. Or that I don’t care about them enough.\n\nI’m not sure if any of this makes sense. But any advice or guidance would be really helpful. \n\nDo I just need got give myself permission to put myself first and love myself? \n\nWhy do I randomly start clinging to others and depending on them for reassurance and validation, when other times I’m ok? \n\nTldr: Off and on anxious avoidant, it’s exhausting and self-destructive, need advice.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qehydx/how_to_overcome_insecure_attachment/", "title": "How to overcome insecure attachment?", "social_network": "reddit", "user": "lavender-witch", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 379, "down_vote": 0, "creation": 1635038266, "permalink": "/r/DecidingToBeBetter/comments/qehydx/how_to_overcome_insecure_attachment/", "nsfw": false, "first_save": 1635436936.3539927, "replies_charged": false}