{"id": "t5_2tand_t3_ol866k", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "My name is Izzy, I'm a 24 year old girl who has an occasional bit of anxiety about life and being left alone. I'm transgender so I often feel like dating is hard for me, and I have a lot of fear meeting new people or leaving the house.\n\nThe past few weeks I've been having a great time seeing a lovely individual, but just yesterday she sent me an email saying she couldn't see me anymore as we both have similar 'anxious attachment styles' and that's something she wants to work on.\n\nI fully respect and understand what she wants to do but also I kind of feel a kick in the guts because, in my mind, we were going really well, and I was making steps to thoroughly break out of my anxious shell to see her. There were specific problems she had with things i said, for example 'i'd just like to know which day of the week i'd like to see you', and I guess all I want to know is:\n\n&#x200B;\n\n* How do I truly work on my anxious attachment style? I would like to be more comfortable alone but at the same time every website or self help thing I look at gives the vaguest most general advice. I don't have this attachment style from a horrible, traumatised childhood or anything; besides my brain injury and well being trans, i'm mostly 'normal'.\n* How do I get over her? I know this seems simple but last night after her email I ended up inviting an ex of mine over and engaging in some self destructive behaviour, drinking on an empty stomach etc.\n\nSorry if that was long. I would just like to be a better person to people and hopefully have some kind of stability in my dating life in the future. Thanks :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ol866k/working_on_my_anxious_attachment_style/", "title": "Working on my Anxious Attachment Style.", "social_network": "reddit", "user": "izzyweir", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1626404542, "permalink": "/r/DecidingToBeBetter/comments/ol866k/working_on_my_anxious_attachment_style/", "nsfw": false, "first_save": 1635438433.3281002, "replies_charged": false}