{"id": "t5_2tand_t3_py98hv", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "I also posted this on rslashadvice but I'm feeling a little desperate, so I wanted to post here too. I hate who I become with romance, and want to find some way to either stop falling in love or... maybe find some kind of balance where i can fall in love and still stay me. \n\nI know love is a good thing, but it's not a positive thing for me.\n\nAll my life I've taken so much pride in being an independent person, not needing anyone, not needing to be in a relationship, etc. I did it mainly because I wanted to 1) focus on my dreams and career, and 2) be more 'present' as a friend, student, daughter. I've even gone lengths to decide that I don't want a life partner because after my first real relationship I realized I turn into a dependent, doormat of a person when i'm in love. It was going so well and I'd played around with one or two casual very casual (as in, I didn't truly have any feelings to be frank) relationships, but then, I met this person, let's call him Nate.\n\nEver since I've known Nate, I've turned into everything I've ever despised in a person's character. I feel like I'm turning into someone who's purpose is to solely find romance or be someone's 'dedicated doormat wife' I can't focus on myself, I keep checking my phone (one text from him can change my entire day, no text can also do that) and I feel like I'm starting to be less 'present' in my other relationships. I'm not dedicating time to my craft anymore, which is shooting up my anxiety, and I find myself losing self-agency, stamping out my own likes/dislikes to become someone that might appeal more to him... and i. hate. it.\n\nI KNOW how i get with crushes and I still couldn't stop it. I don't know what to do.\n\nI miss myself. I miss how I used to enjoy time alone and how I used to be my own best friend. I miss how I used to have pride in what made me my own person. I miss my main concern being how I could contribute to the world, or at the least just be a better, more supportive person to my friends and family. I even miss listening to songs without thinking about him, and eating food without wishing he was sitting in front of me. I really miss myself. What should I do?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/py98hv/i_hate_how_crushes_make_me_feel/", "title": "I hate how crushes make me feel", "social_network": "reddit", "user": "VastBridge9070", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1632964607, "permalink": "/r/DecidingToBeBetter/comments/py98hv/i_hate_how_crushes_make_me_feel/", "nsfw": false, "first_save": 1635435240.5077887, "replies_charged": false}