{"id": "t5_2tand_t3_n2oegt", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "Sooo I had 14 months clean from iv crystal meth use. I was doing great! I moved out of my recovery house after a year, had my own apartment, a job, a girlfriend and was happy. But then everything came crashing down. My gf of 3 years broke up with me, I lost my job and didnt get my dream job. I was devastated and extremely depressed and lonely. This led me back into hell. ADDICTION. I thought drugs would solve my problems and do what I'm best at and that is get high. What I didn't think about is once I put in me i cant stop. This when on for 3 months. I picked up other drugs other then ice such as ketamine, shrooms, perk 30s and xanax. At the end of this run I was so broken physically, mentally and spiritually that I was hoping to go to sleep and never wake up. I wanted to die. I lost everything. Family, friends, all my money and most importantly my soul. Luckily on February 28th, 2021 I had a little glimmer of hope and a willing to get help before my addiction physically killed me and ended my life and I decided to check myself into detox/rehab. I am so grateful today. I have over 60 days clean. I'm back in the recovery house where I was last time, i have a job, gained 40 pounds and am doing better and better everyday.  I pray everyday, go to meetings, have a sponsor, a relationship with my family and money in savings.  I've been stuck in this loop for 6 years since I was 19 and have never felt so good being sober today. I want to live today and not die anymore. Physically, Mentally and Spiritually I'm A OK.  Just wanted to share with everybody. Have a blessed day.  We do Recover :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n2oegt/relapsed_n_sober_again_from_ice/", "title": "Relapsed N Sober Again from Ice", "social_network": "reddit", "user": "tomeskuchen", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 21, "down_vote": 0, "creation": 1619894246, "permalink": "/r/DecidingToBeBetter/comments/n2oegt/relapsed_n_sober_again_from_ice/", "nsfw": false, "first_save": 1635435560.36266, "replies_charged": false}