{"id": "t5_2tand_t3_jdfs9g", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "The title says it all but let me explain. \n\nIf you get home from work and decide to relax right away it’s when you get lazy. So take the last little stint of energy you have and clean up the tasks that you have been neglecting. Every day when you come home cook right away & clean the dishes. Then start Laundry right away while you’re cooking and set a timer on your phone so you don’t have wrinkled clothes because you forgot. Once you sit your ass on the couch is when you start procrastinating and saying to yourself ‘It can wait’. And that is a toxic mentality. I know we are all tired after work, but making sure your home is in complete order takes president sometimes in order to feel more established. \n\nMy other best advice is when you leave a room take something out or take something in. Therefore your bedroom will stay clean, and that random trash/ cup/ dinner plate that’s been on your dresser for 2 weeks will make its way to the proper place. When you leave a room in your home, look around and say to yourself ‘what can I take on my travels through my home so this can be out of sight or put back in place’ This makes tasks get smaller and smaller so they don’t accumulate and overwhelm you. \n\nThis has helped me become more efficient at home & at work and has SEVERELY reduced my stress level as I am now able to sleep better knowing things are complete and my wake up will be easy. Because we all know waking up ‘early’ to finish tasks is almost impossible especially in the coming winter months when it’s so warm and it’s a Damn shame to leave bed. \n\nHere’s my routine. \n\n1. Come home. Fold & pack my gym clothes into my duffle bag, take my dirty clothes and put them into hamper. Prepare my outfit for my next day at work. I fold my stuff right beside my bed in the order of you put them on your body \n2. Clean what ever may need to be accomplished. Still in my work clothes at this point. \n3. Shower. \n4. Cook, wash dishes as I make them dirty. put aside my meal for the next day with utensils, drinks & what ever in my lunch bag placed in my fridge. \nAll this usually takes 2-4 hours depending on my meal size or the mess my family produced during the day when I was working", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jdfs9g/if_you_do_your_tasks_when_you_get_home/", "title": "If you do your tasks when you get home immediately from work/school/errands you’ll accomplish more", "social_network": "reddit", "user": "jjqueens", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1552, "down_vote": 0, "creation": 1603025377, "permalink": "/r/DecidingToBeBetter/comments/jdfs9g/if_you_do_your_tasks_when_you_get_home/", "nsfw": false, "first_save": 1635438056.2215428, "replies_charged": false}