{"id": "t5_2tand_t3_kp6fi1", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "It's been a while! It's been 9 days since I last posted. Merry Christmas and Happy New Year to all of you reading!\n\nI've had a decently productive last 9 days. But before I get to that, I want to talk about some changes I've made to my process.\n\nThe way I originally wanted to do things was to focus on one habit for 30 days, and then move on to a new habit while still maintaining the habits that had successfully implemented.\n\nSimply, this way of doing things stopped working. It was very easy to get overwhelmed quickly. The first month was great. I woke up at 8 am every morning. The next habit was also great. I managed to go to the gym about 5 days per week for a month. After that, things still were going well. I was executing an hour of deep work per day. But slowly, it got harder and harder to do all of these habits every single day.\n\nIf I succeeded in doing 2 out of my 3 habits, I still felt like my day was a failure. It was getting harder and harder to add new habits to my repertoire. Furthermore, I realized that some habits that I had thought were successfully implemented and automatic, simply were not. It takes anywhere from 23 days to several months to successful build a new habit. To think that 30 days would always be enough time was wishful thinking. Once things got difficult, and I stopped getting that hit of dopamine (knowing that my day was a success), I went back to old habits, such as sleeping late and walking up late.\n\nAfter some thinking, I decided I would try something new. I made a list of the habits I most want to implement into my life right now. The list can be seen below.\n\nI've decided that rather than focus on individual habits or a short list of habits, I'm going to simply try to build a lifestyle that leads me in the direction of successfully building all of these habits listed below.\n\nI do realize that most people can only build 1-3 new habits at a time. However, I'm going to try this out and see where it leads. Perhaps I'll change my approach if I see that it isn't working.\n\nThe last 9 days have been good. They haven't been great, but they've been good. I've been doing teeth and skin care almost every day. I've been exercising. I've been meditating at times. I've made some smart financial decisions.\n\nI look forward to this new format. Every day I'll come on reddit and make a post about my day and explain which habits I've made progress on. Best of luck everyone!\n\n**Catalogue of Habits:**\n\n1. Waking up at a consistent early time every day.\n2. Going to bed at a consistent early time every night.\n3. Executing deep work every day.\n4. Exercising every day.\n5. Eating healthy and drinking enough water every day.\n6. Meditating every day.\n7. Limiting phone use and instant gratification.\n8. Executing proper teeth care. This includes using good toothpaste, rinsing my mouth after having tea or coffee, properly brushing teeth twice per day, and flossing once per day.\n9. Executing proper skin care. This includes moisturizing my face twice per day, using a face cleanser once per day, using a face lotion once per day, using vaseline for my lips once per day, and moisturizing my body skin once every two days.\n10. Making smart financial decisions every day.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kp6fi1/day_6169_of_my_selfimprovement_process/", "title": "Day 61-69 of My Self-Improvement Process", "social_network": "reddit", "user": "DoerThinker", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1609623760, "permalink": "/r/DecidingToBeBetter/comments/kp6fi1/day_6169_of_my_selfimprovement_process/", "nsfw": false, "first_save": 1635437566.4812832, "replies_charged": false}