{"id": "t5_2tand_t3_hjpjtu", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "In the past month my girlfriend’s grandmother died while I was in the house, my girlfriend became my ex last Friday and I put my cat down on Tuesday.\n\nI was so concerned about her I completely forgot to dose my morning ~.25 pressed flualp Xanax bar until I noticed the withdrawals. I’ve been on a taper for about two months, down from 2-4mg a day, sometimes more, down to ~.5 a day, once at night and once during the day.\n\nI’m also a frequent drinker. The day I broke up with my gaslighting ex I stopped drinking and the day I put down my cat I stopped Xanax. \n\nToday I’m one day sober and reading my posts shows me my battle.\n\nThank you Reddit. You might have saved my life.\n\nEdit 1: I fully expected this post to be ignored and I came back to 100 upvotes. I know it’s not a lot but thank you guys, I cried this morning, there not many people out there who I feel like care about me but 100 people stopped by to upvote and that means the world to me.\n\nShit I’m crying right now haha. Thank you reddit.\n\nEdit 2:\n\nSomeone said my post was descriptive and I want to share my experience with anyone who finds themselves in the same spot.\n\nSomeone asked me if I was able to do coffee and this was my response:\n\n“I just had my first cup and it made me jittery and anxious, will not be doing again. I’ll probably just drop the habit all together at this point.\n\nI feel extremely sensitive and super aware of my state of being and the energy I put off. Today was my first day seeing people since all this shit went down and I felt awkward. Conversations just weren’t as easy.”\n\nThis is day 2 and so far my symptoms have definitely increased. I am a musician and everything I’ve done in the past few months just sounds horrible and sloppy to me, everyone was saying how much they loved it though so I wonder if I’m just being anxious or if I’m really hearing better? I won’t make major changes until day 4 or 5.\nAlso sat outside for 30 minutes and walked two blocks. Didn’t feel like it but still did. Stay committed!\n\n48 hrs down, I’m forcing myself to eat and stay hydrated and I think is helping. Maybe I’ll be able to sleep tonight?\n\nEdit 3:\n\nToday is by far the worst. I slept a little last night, that sleep that feels like a blink between pitch black to birds cawing outside your window. Not restful at all. I feel all over the place. I was just informed that a friend of mine committed suicide and on top of trying to quit Xanax and a bunch of other commitments I made to myself when I put down my cat, it’s just too much.\n\nI feel mentally and physically drained. My mom called me while I felt like a blank disk after getting the news and I didn’t pick up. I’ve called her about 3-4 times now because I’m just worried something illogical happened to her. All around me is death and I’m just trying to get through 2020 and my Xanax problem.\n\nLife is hard. This year sucks. I will not succumb.\n\nAnd my mom called me back about two hours after this, she’s fine.\n\nEdit 4:\n\nDay 4, more sleep then last night but not nearly enough. Woke up thinking I was hungry and ate some Açaí I had and ended up throwing all of it up. Luckily açaí isn’t chunky and it came up easily. For those struggling with eating, try soups or açaí bowls or fruits. These, if they come up, will hurt a lot less. Been getting frequent migraines so I bought excederin migraine to hopefully thin out my blood a little. \n\nPlease don’t be surprised if you are feeling like you’re getting worse and worse each day, day one I swore I had this but by day 4 I’m reconsidering, haha! I’m not going to cheat, I need to do this and do it right for my future as a musician and human being. I hate who I was on Xanax, just a smiling idiot, I feel much more compelling and “edgy”/dangerous and I’ve been told it’s attractive. Apparently women like men with strong stances, not ones that just conform and fold. I truly believe I’m on the right path and if you’re reading this so are you!\n\nWe just gotta keep pushing.\n\nEdit 5:\n\nMore sleep then last night but not enough. I can’t quantify by hours but I can by qualityX If you get migraines I suggest excederin migraine, I take one in the morning and one at night. I take them Pre-emptively, not sure if this is good or not but it’s helping me. Exhausted and working a lot but I feel much more clear headed. Stomach cramps up in the middle of the morning but it’s not as bad as tapering when I couldn’t eat anything and I would be throwing up.\n\nMost stuff stays down for the day. I feel much less anxious and I wonder if I even needed Xanax before because this new version of me is slightly socially awkward but mentally extremely strong, I’m able to flip from anxiety to confident in a few breaths or some thinking. It helps I have always been a positive person, despite crippling anxiety. Overall I would say the worst days are behind me and now I’m just working on maintaining. I have been eating super clean and healthy as well, not sure if this helps. Like Kale and grilled chicken and shit. \n\nAlways wanted to be healthier so why not now?\n\nEdit Six:\n\nMight be my last for a while, definitely fighting the demons I tried to bury but how I feel much stronger knowing how Xanax felt. I believe if you can do it once you can do it again. Once having experienced the bliss of Xanax you can recreate that feeling. For me I know it’s going to take exercise, good diet and diving into my hobbies. \n\nEveryone has to find their own metaphorical Xanax. \nI found mine in my hobby and passion.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hjpjtu/my_last_dose_of_xanax/", "title": "My Last Dose Of Xanax", "social_network": "reddit", "user": "moeses201", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 219, "down_vote": 0, "creation": 1593660738, "permalink": "/r/DecidingToBeBetter/comments/hjpjtu/my_last_dose_of_xanax/", "nsfw": false, "first_save": 1635435620.6389198, "replies_charged": false}