{"id": "t5_2tand_t3_ljlnwn", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "947d9c8c-f6f8-421d-ba73-f657e7e11fc4"], "text": " It is reasonably uncontentious to say we all want to be happy and the pursuit of happiness is a key driver for the choices we make and our resultant behaviours. Further, we know more about how our minds work than ever before an we have access to physical resources which previous generations simply could not imagine – indeed that we could not imagine only a few years ago.\n\nBut our societies are less happy – and more depressed - than ever. This conundrum is multi-dimensional. In this short piece, I suggest that one thread of this conundrum is that happiness has three dimensions and we have come to focus on only one of these.\n\nDimension 1 – Pleasure: Rapture, ecstasy, warmth, comfort, pleasantness. The pleasures can be externally stimulated, can often be bought, tend to require little effort. They typically experience diminished returns and their pleasures are short lived. Here-in lies the hedonistic treadmill.\n\nDimension 2 – Gratification: a feeling of time stopping, being totally absorbed in an activity as we effortlessly lose our self-consciousness. This requires concerted effort – there are no shortcuts.\n\nDimension 3 – Purpose: belonging to and serving something we value and perceive to be bigger than ourselves. Again, this requires effort and often creates a legacy of some form.\n\nMy suggestion here is that our culture has lost sight of Gratification and Purpose in favour of short-cuts to the pleasures – partly driven by our obsession with disposable mass consumerism. Perhaps our societies would be happier – and less depressed – if we did more and consumed less.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ljlnwn/who_doesnt_want_to_be_happy/", "title": "Who Doesn't Want To Be Happy?", "social_network": "reddit", "user": "EERMA", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1613296342, "permalink": "/r/DecidingToBeBetter/comments/ljlnwn/who_doesnt_want_to_be_happy/", "nsfw": false, "first_save": 1635437671.8304565, "replies_charged": false}