{"id": "t5_2tand_t3_726rob", "request": ["d16532c7-3c5c-45c4-ab79-168cb2cfbb61"], "text": "So here's the current situation:\n\n* I'm 24 years old\n* I have a BSc and a MSc in Software Engineering from one of the best Engineering Colleges in my country\n* I have a 9-5 job in the field that I graduated from (Software Engineering, currently a web developer)\n* The pay is above average for my country, which allows me to live comfortably but I can't push it otherwise I won't save anything\n* I'm able to save roughly ~10% of my paycheck every month and I'm slowly building my savings\n* I'm renting a two bedroom house all for myself which takes roughly 28% of my paycheck in rent.\n* I also have a girlfriend\n* I try to go the gym at least 3/4 times a week before work (early mornings, I get up at 6am every week day)\nNow, this is everything good that I have going on for me, I think. From the outside perspective, one would say that I should be happy, or at least not sad / depressed, right?\n\nNow here's the \"bad\" parts of my life:\n\n* I have no hobbies. Really. And I think this is what's making me depressed as hell. Once I get home, it's like I get carried away by what life throws at me. \"Oh, GF wants to go sailing with the parents and they invite me, let's go\". \"Oh I have to go shopping to buy something I need for the cat, let's go\", \"Oh GF want's to go shopping for clothes and invited me to go with her, I guess I should go\".\n\n* I know that I should be doing something outside of work but I just feel lethargic and carried away by life. I have several drafts of youtube videos that I'd like to make related to my field (My \"dream\" is to have a youtube channel where I can help other developers in the same field as mine), I have blog post drafts related to my field that I won't finish (I'd like to be more active on social media like twitter and in my blog because I know that'll help my career), I'd like to hang around more in StackOverflow (quora-like forum for software engineers) or Quora and help other developers and also to be integrated in some sort of community. But I don't do any of those things. It's like I'm stuck and I can't get out of it.\n\n* It depresses me the feeling that I'm not in control of anything in my life. I go to the gym but it's like I'm not really there. I don't feel it and I'm just doing it my habit now, like it's automatic.\n\n* I'm a slow learner.\n\n* I can't follow through with anything or be consistent with anything\n\n* I can't read anything from start to finish. I just skim through everything. Even when I'm reading stuff in reddit.\n\n* I have a problem with food and binge eating and instant gratification in general\n\n* Sometimes I know that there's something I need to fix around my house and, for some god forsaken reason, I just throw it at the back of my mind and I don't do it. This has cause some discussions with my GF (Note: she doesn't live with me, but cares for my well being)\n\n* I walk around all day with a semi bitch face, if you'd look at me during the day you'll probably say that I'm a homeless or whatever, it's like I have no life in me. I throw laugh maybe once or twice per week (how pathetic is that?). It's like I'm zombie.\n\n* I'm not honest with myself. When I'm at work or out with my gf, I pretend that I'm on a diet, always choosing the healthiest things to eat, but when I'm alone, I'll bing on cookies or whatever. It's pathetic at that point.\nI look at other people (even people who have way less than me) and all I see from their eyes is pure happiness. It's like everyone has found what they truly like in their life and they're happy doing it for the rest of their lives so they have no reasons not to smile. I envy that, so much.\n\nIt's like everyone else has their shit figured out, and I'm still wandering.\n\nAnother thing that really fucking kills me is that when I'm doing anything that's not work or with an urgency, I'm not really enthusiastic about it. Like I'm not there. I'm not happy nor sad. I'm just there. Couple of days ago me and my GF went canoeing with her family and all I could see were smiles and laughs and I was just there, watching and nodding.\nMy GF also said that her parents even asked her if I was ok or upset about something because I rarely smile, even though I'm polite and kind to everyone. Sometimes it feels like I don't have a personality.\nAll these things have caused discussions with me and my GF because sometimes I'm in a bad mood and I'll respond badly to her (even though she's not an easy person, so it's not 100% my fault, but 80% of the times I'm at fault). This is not the person that I want to be.\n\nI don't know any other way to put it. I feel like everyone else is happy but me. Maybe it also doesn't help that I have a constant pressure and background voice in my head telling me that I really should be spending my free time learning new things relevant to my field (this is common in Software Engineering/Web Development). I know I want to improve and build a better career so I should be learning and studying outside of work, but I'm also not sure how. There's so many things that I could do improve my career (study learning paths / side projects / courses / books) that I'll pick up one of those things and I'll drop it after a day or two, and reset with other thing.\n\nThis may sound stupid but ever since I've discovered the self improvement area and the \"living a disciplined life\" that I'm actually more sad because I know that I'll never get to build the life that I want. Why? One stupid little thing is that I can't formalize goals. Any goals. It gets so pathetic that I don't even know how to actually write them and track them (Evernote? Trello? Paper and pen?), it's like I have an idea about the goal but I don't know how to actually write and how to track it.\n\nIt also feels like I don't have the patience to sit down and think about the goals and what I want to achieve in my life. I jot down some words and \"life goals\" together in a paper in like 5 minutes and I never look at it anyway. I think \"ok that's good enough as goals\" and I don't follow through with it. It's like I don't have the patience to thoughtfully think about these things and as soon as I see something that looks as much as close to finished (like a list of goals wrote down in 10 minutes) I assume it done and I'll stop looking at it over the next 2 to 3 days.\nI know this is a huge ramble. I'm sorry for the wall of text. I'm feeling slight better after writing all that out. If anyone out there has any advice, I'll appreciate it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/726rob/i_need_help_reddit_im_not_an_happy_person_and_ive/", "title": "I need help reddit. I'm not an happy person, and I've come to terms with that, even though, from the outside, I have everything in place. I may have depression but I'm not sure. I do know that I'm not ok and I need to vent so that I can't figure this out.", "social_network": "reddit", "user": "throwaway123020994", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1506277494, "permalink": "/r/DecidingToBeBetter/comments/726rob/i_need_help_reddit_im_not_an_happy_person_and_ive/", "nsfw": false, "first_save": 1635437634.5866082, "replies_charged": false}