{"id": "t5_2tand_t3_l0gjsb", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924", "f39f6441-79a5-42c9-8dca-c8455143a12a", "a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "da3e72ac-2059-4c8f-99c6-52edffdec3d2"], "text": "*This post is mod-approved and I hope it's helpful.*\n\nMy name is Jared A. Brock and today is my 35th birthday. It’s been a wild ride: I’ve walked across hot coals, swam up an underground river by candlelight, eaten bull’s testicles, and roasted marshmallows on flowing lava.\n\nI’ve written three books, directed four films, published 400+ articles everywhere from *Esquire* to *The Guardian* to *TIME Magazine*, road-tripped through 45 American states and nine Canadian provinces, helped get some laws changed, and traveled to forty countries including North Korea and the Vatican.\n\nI’ve enjoyed nearly thirteen years of marriage to my seventh-grade sweetheart, and we’ve been blessed to fundraise hundreds of thousands for charity. Though not without **tons** of mistakes and some major setbacks — financially, physically, emotionally, spiritually — it’s been a pretty decent trip so far.\n\nI’m lucky, blessed, downright spoiled. And even though I certainly don’t claim to be wise in any way, shape, or form, here are 35 things I wish I’d learned far sooner. **None of these are rules or commands for you to follow, just personal reflections from a decade of journaling**. I hope they save you a lot of time, energy, struggle, and life:\n\n# 1. “Save the best for last” is terrible advice.\n\nA French monk taught me this one. Every morning, I put on the newest pair of socks in my drawer. Why wear the rattiest pair? When I sit down to eat, I eat the tastiest bits first. Why let them get cold? After every shower, I put on my favorite clean t-shirt. I have a great bottle of 10-year-old Laphroaig scotch in my cupboard, but I probably won’t drink it for months because I received two bottles of reactor-aged Lost Spirits single malt for Christmas.\n\nWhy? Because life is hard enough and we aren’t promised tomorrow. This doesn’t mean we should throw caution to the wind and “live in the moment” at all times, but it does mean we should try to find the golden middle and glean a little bit of pleasure from every day we’re blessed to live. “Save the best for last” is poverty-mentality thinking. It expects worse in the future. Enjoy the best right now — in your marriage, parenting, work, travel, faith, friendship, contribution. Keep all the chips on the table. Be ready at all times to leave without regret.\n\n# 2. Tools use us.\n\nA hammer literally cannot hit a nail without using a human.A saw cannot cut through a board without using a human.A phone cannot deliver ads without using a human.\n\n# 3. Avoid false dichotomies.\n\nWhen given two great options, choose both.When given two horrible options, choose neither.\n\n# 4. Failure is overcome by one word.\n\n“Next.”\n\n# 5. Give yourself a shove.\n\nThe best way to eat more candy and drink more vodka is to leave them side-by-side on the kitchen counter.\n\nYou get it. Willpower is useless. Instead, line up a series of little nudges to automatically get you through your day. If you want to work out, leave your shorts by the door or your cleats in your fridge. My blue diode glasses rest on top of my laptop so I have to protect my eyes before logging online. I can’t *not* see my vitamins when I brush my teeth, or chia seeds when I reach for the Brita. There’s a book beside my bed, toilet, desk, and car’s gear shifter.\n\nLine up enough nudges and you can shove yourself in the right direction.\n\n# 6. Awkward is awesome.\n\nMy best friend says that *The Office* gave society a beautiful gift: the ability to embrace cringe. When you meet someone new and it’s slightly weird, pretend you’re Michael Scott. Just glory and bask in the discomfort.\n\nYou can awkward-proof your life by being bold: Ask for discounts. Ask for refunds. Ask for phone numbers. Ask for pay raises. Ask inappropriate questions at inappropriate times. Lather yourself in awkward and pretty soon nothing sticks.\n\n# 7. Ambition is ruinous for your happiness.\n\nMost goal-setters (myself included) live much of life in anticipation of tomorrow, and when that day arrives, they’re either disappointed by their failures or underwhelmed by their successes.\n\nInstead: trust the process. Whiskey, pasta, bread, beer, and cereal all require just two ingredients — wheat and water — but the outcome is completely different based on the process. Identity precedes action. Determine what you want to ***be***, then determine the process that will get you there every single time.\n\n# 8. The Marines were right: slow is smooth, smooth is fast.\n\nAs teenagers, my friend Tyler and I were in a hurry to get somewhere quickly so we drove 120+ miles per hour for forty-five straight minutes before nearly crashing when the speed burned a footlong gash through the tire. By the time we replaced it with a spare, we were late to our destination by more than an hour.\n\nBut nevermind driving. Pump the life-brakes sometimes, or at least, let off the gas. You might get there faster.\n\n# 9. Most “leaders” aren’t leaders.\n\nCelebrities, politicians, and book-hocking business gurus all call themselves leaders. They’re not.\n\nReal leadership is *influence that serves*. True leaders are selfless and servant-hearted. They put the best interests of others ahead of their own. Politics and media, by comparison, attracts sociopaths like flies to firelight. Never give power to those who seek it. Nearly everyone worth following is dead.\n\n# 10. Old people know better.\n\nHonoring our elders is one of the most underrated practices in our newness-obsessed society. Sure, there are a ton of old crazy far-right conspiracy theorists, but there are also good people who have survived four wars, six recessions, and twelve presidents and are somehow still smiling. Get to know them.\n\nAlso: meet your old-person self. I try to invent a new word every week — one of them is *preflection*. To ponder the present through the eyes of your future self. Take an hour in silence to listen to your eighty-year-old self. They might know something you don’t.\n\n# 11. Fire all your employees.\n\nThe employer-employee relationship creates an unhealthy power dynamic between humans that simply didn’t exist when we worked cooperatively to feed our clan or village. I love my work life so much more now that I only work with independent entrepreneurs who are my equals. For me, it’s either a one-man show (my writing business), an equal partnership (my film company), or a co-operative endeavor. Life’s too short to be a boss or be bossed around.\n\n# 12. Accept that you are a voracious locust of doom.\n\nNail a roll of paper to the wall and write down everything you consume for a year — food, toilet paper, electricity, car fuel, movies, music, social media content, other people’s time, everything. See what I mean?\n\nSaint Augustine said that the human heart can only fully be satisfied by one thing aside from God himself: *everything*. All the sex, all the money, all the power, all the possessions, all the glory. All of it. Nothing short of everything could ever fully satiate the human heart. We are wired for *more*.\n\nUnderstanding this truth is the first step toward real contentment.\n\n# 13. Forget what the market wants.\n\nListen to your gut. Your body knows the difference between good and great. Someone said you should never record a song or code an app or write an article unless it makes you laugh, cry, or orgasm. If an idea doesn’t move you, it won’t move an audience, no matter how “commercial” you think it is.\n\n# 14. Happiness isn’t the purpose of life.\n\nHitler really was following his bliss by offing millions of Jews. I’m sure Jeffrey Dahmer genuinely enjoyed the taste of human flesh. Bernie Madoff seemed content to bilk charities for decades.\n\nHappiness isn’t the purpose of life. It’s not even in the top ten. Happiness is a seasonal fruit, not a foundational root. Find firm and fertile ground.\n\n# 15. There is no ugly.\n\nMy grandpa re-proposed to my grandma on their fiftieth wedding anniversary and called her the most beautiful woman he’s ever known. *Old wrinkly grandma*? Yes. Because we choose our definition of beauty through our thoughts, disciplines, habits, and patterns, be they conscious or otherwise.\n\n# 16. We are what we consume.\n\nThe statistical average American is a walking bodybag of sugar, alcohol, caffeine, porn, pills, and digital stimulus. Imagine how different life would be if our only inputs were nature, sleep, sunlight, organic food, and embodied human interaction?\n\nGuard your inputs carefully.\n\n# 17. We’re going to die quite soon.\n\nMake sure you live first. Practicing memento mori will help.\n\n# 18. Fame is poison.\n\nOne in four Gen Zers thinks they’ll be famous by age 25. One in 3.9999999 Gen Zers are going to have a miserably disappointing life.\n\nWhy do people desire the attention of strangers? Because we all need to love and be loved, to know and be known, but are too afraid to risk personal heartbreak to seek it out. Attention is not affection. Influence is not intimacy.\n\n# 19. Boomers are to blame for half our troubles.\n\nThe Me Generation took a free ride at the planet’s expense and is hellbent on taking the rest of it with them. They’re statistically low on empathy — blame the lead, asbestos, and hairspray if you must — but at least acknowledge the reality that life is hard for everyone, and no one has it easier.\n\n# 20. Children are dope.\n\nKids are the blood transfusion in our sick system. We need to stop manipulating, brainwashing, colonizing, and propagandizing them, and learn from them instead.\n\n# 21. It doesn’t have to hurt.\n\nJoy is a choice.\n\n# 22. Watch comedy before calls and meetings.\n\nFive minutes of gut-busting laughter will prime you for even the most tedious conference call. Your co-workers and customers all have tough lives like everybody else, so brighten their day by pre-brightening your own.\n\n# 23. No ragrets.\n\nTattoo it on your neck. Most people play it far too safe. Instead: optimize your life for the least number of regrets and the most amount of selfless contribution.\n\n# 24. There are better ways to vote.\n\nI’ve manned several local voting stations, and I’ve also hob-nobbed with politicians in Canada, America, and the UK. The reality is that they don’t work for us. They work for their corporate sponsors and private interests.\n\nDemocracy isn’t dead. It just hasn’t happened yet, with all attempts to date being stillborn or aborted. Democracy = one voice one vote. Athens wasn’t a democracy — women, slaves, and tenants had zero say. America isn’t a democracy either — no representative system is, because it’s far too easy for private interests to buy politicians. The charade of voting is illusory. All elections are sham elections.\n\nSo what to do? Vote with your money and time and attention. One sham vote every four years versus tens of thousands of dollar-votes each year? It’s a no-brainer. My wife and I haven’t stepped foot in a Walmart in more than a decade because thousands of its suppliers are based in China, the billionaire heirs are anti-democratic tax-avoiders, and they treat their employees like indentured servants. Vote for pro-democracy third-party candidates if you must — just understand the game, and also vote in the ways that actually matter.\n\n# 25. Everything easy has already been done.\n\nSo run a little further. And if it hasn’t been done, it won’t be as easy as it appears. The question to ask is: what’s been standing in the way this whole time? Achievement is all about knocking down obstacles. Just make sure what’s on the other side is rightly worth the effort.\n\n# 26. Broccoli still tastes terrible.\n\nBut you’re not a child anymore. Adults do hard things.\n\n# 27. Fixed-order scheduling > fixed-hour scheduling.\n\nDiscipline is great, but it’s also subject to the law of diminishing returns. Life is just too dynamic to schedule with military precision. Free yourself from the tyranny of “only people who wake up at 5 AM are successful.”\n\nAll hours are not created equal. It depends on your sleep drive and chronotype. Know yourself. Unapologetically get some sleep, then do your best work at your best time in your best state.\n\n# 28. “Freedom” isn’t freedom.\n\nAmerica wasn’t founded on freedom. America was founded on violent autonomy.\n\nThe ancient Greeks had an entirely different definition of freedom: it was *the ability to choose the right regardless of circumstance*.\n\n>*“We talk about freedom all the time, but we’ve stopped talking about freedom a long time ago. Now we’re talking about autonomy. Freedom is different than autonomy. Freedom has boundaries. Truth is one of those boundaries. And morality is one of those boundaries. Autonomy is the ability to do whatever you want whenever you want in whatever way you want.* *The problem is this: If I’m autonomous and another person is autonomous, and I have preferences and those matter more than the truth, and that person has preferences and their preferences matter more than the truth, when two autonomous preference-seeking beings come together and their preferences don’t match, who is going to win? If truth is on the bottom shelf, truth won’t decide. What will decide will be power. And isn’t it ironic that in our quest for “freedom”, someone gets enslaved?” —* *Abdu Murray*\n\n# 29. Grandma didn’t use toilet paper.\n\nShe used pages from the Sears catalog. Splinter-free wasn’t available until 1935. The Romans used sponges. The Greeks used clay. Francois Rabelais recommended using “the neck of a goose.” Arabians used their left hand.\n\nNever assume our extremely unique cultural moment is “normal.”\n\n# 30. The quest for wealth is destroying life.\n\nWe need a shared global vision. My invented word for it is *benevitae*: the sustainable flourishing of all creation. Our collective goal should be socioenviroeconomic sustainability. Where to start? We’d do well to let biology determine ecological sustainability and real democracy to determine economic fairness. Our current trajectory is worse than the Space Shuttle Challenger.\n\n# 31. Ninety-nine isn’t enough.\n\nWater boils at 100 degrees Celcius. The difference between 99 and 100 is the difference between zero and one. Not-boiling, boiling.\n\nCorollary: 101 doesn’t make it any more boiling.\n\n# 32. Divide-and-conquer is a business model.\n\nNear the end of high school, dozen friends and I binge-watched multiple seasons of LOST in our friend Mike’s basement. It was one of the most hilarious, riotous, enjoyable experiences we had as a group.\n\nAnd it was the last show we ever watched together.\n\nPeople used to go to restaurants in large numbers, to the movies by the dozen, climbing over each other for one of the limited video game controllers, packing out our churches, cheering on our sports teams by the busload. We were almost never alone, and we were far happier. Now we order in, watch Netflix, stream Minecraft, catch the highlights, watch porn, and go to bed. It’s killing us.\n\nResist the urge to be alone. It’s too easy, and it’s the exact opposite of what we really need. The #1 thing that’s correlated to human happiness is human togetherness.\n\n# 33. Self-improvement won’t save us.\n\nThe great lie of individualist-consumerist culture is that we can improve our way to personal perfection and communal utopia. But it’s incrementalism at best.\n\nIt’s just chasing infinity.\n\n# 34. We know nothing +/-.\n\nOn the scale of all that is known, and all that is knowable, our individual understanding is essentially mathematically zero. The entirety of human knowledge is a rounding error.\n\nThis is the beginning of humility.\n\n# 35. The sun is not on fire\n\nThis whole list began in Texas. I was at an observatory in the Davis Mountains and it was the first time I’d paid attention to astronomy since grade school. For three decades, I’d wrongly assumed the sun was a giant ball of flames.\n\nBut there’s no fire in space because there’s no oxygen in space. It just looks like fire because of how our eyes perceive light through the atmosphere and prism.\n\nAs I stared at the real-time image of the sun on the observatory wall, I nearly wept. The sun actually looks like a giant, boiling, grey brain. And then it hit me: I have so many assumptions to set aside and so much left to learn.\n\nSo pay attention. Don’t worship the “question everything” mantra, but instead spend your life seeking truth, and wisdom, and understanding.\n\nYou know what you need to do to get where you want to be.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l0gjsb/35_things_i_wish_i_learned_years_earlier/", "title": "35 things I wish I learned years earlier", "social_network": "reddit", "user": "JayBrock", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 292, "down_vote": 0, "creation": 1611048922, "permalink": "/r/DecidingToBeBetter/comments/l0gjsb/35_things_i_wish_i_learned_years_earlier/", "nsfw": false, "first_save": 1635435559.7014256, "replies_charged": false}