{"id": "t5_2tand_t3_mjw9g2", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "4b69452a-b1e5-47af-a734-ad3c2bdce185", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "Hi,\n\nI have been depressed for over a year and I have put an endless amount of energy to get back to normal, but I have always felt that it never would work.\n\nI have made progress and  I have had some good periods, but it has always turned out bad again since I can’t keep the things I have promised to myself.\n\nRecently things became better after some long sessions with my girlfriend, but when she left everything shattered once again. \n\nToday I have struggled with the worst anxiety, shame and guilt that I have ever felt. I have also faced the strongest suicidal thoughts I have ever felt. I just wanted to disappear. I fought to get better, but it only became worse. Then I realized something...\n\nI have asked for help like everyone tells you to do, but today I realized that I actually have not done it correctly.\n\nI have only asked for the recipe for ‘the cake that would cure my depression’ and I have always tried to bake it by myself, and today I realized that I also needed help with the actual baking. So I admitted to myself that I can’t do this by myself and called my girlfriend and admitted that I am a little toddler that can’t do a shit about my mental health without her and I started to cry my guts out, literally like a toddler. It was my first time admitting that to myself...\n\nBut guess what. That was the solution! Normally I would try to fight on alone, but I realized that sometimes you can’t fight alone. So if you feel like absolute crap and if you have searched forever trying to find your answers, then pick up your phone and call somebody that you trust and say: \n\n“I feel like crap and I can’t make it go away. I have tried to get better endless of times, but I can’t do it all alone. Please help me. I give up. I surrender. I need your help. Please help me”.\n\nI don’t care if it is your mother, father, sister, brother, friend, partner, neighbor, psychiatrist, teacher, plumber, local priest... Just pick up that phone and call someone. You can’t bake that cake alone.\n\nIt probably saved my life today and I hope it can save your life too, because you matter.\n\nRemember...\n\nYou are never, NEVER, alone...!!!\n\nYou can get through this. You just have to pick up that phone and ask for help. Real help.\n\nI support you! We in this community support you!\n\nBest of luck! Now pick up that phone and call someone.\n\nEdit: To all the people referring to my advice and my actions towards my gf as bad and toxic, I asked her if she would accompany me towards my mental well-being cuz I realized that I couldn’t do it by myself anymore. I have tried that for over a year and look how far it has gotten me. Nowhere. I agree that this sort of behavior can be manipulative, but it depends on how you express it. In my case it bursted for me when I called her, so I started to cry a lot and I felt so naked and vulnerable as I asked her to come home (hence I felt like I child, crying, being vulnerable and asking her to come home crying my guts out). She was so happy that I called and got that out of my chest. To the people judging this as bad and abusive, it just shows how little you know about depression, etc. Sometimes you can’t depend on yourself and that is why we have friends, family, partners, so they can give us a push in the right direction. Because without all that, we are all alone. In the long run I am the one responsible for my mental health, but in the short run, to be able to get better, I see it as healthy to have someone to lean on. So please grow up and stop assume the worst about people and every situation please. I am trying to beat depression here and you aren’t making it easier so shut up.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mjw9g2/i_beg_you_please_read_this_if_you_feel_like/", "title": "I beg you, please read this if you feel like ending your life or if you just feel bad.", "social_network": "reddit", "user": "Chader_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1029, "down_vote": 0, "creation": 1617542961, "permalink": "/r/DecidingToBeBetter/comments/mjw9g2/i_beg_you_please_read_this_if_you_feel_like/", "nsfw": false, "first_save": 1635437395.4129822, "replies_charged": false}