{"id": "t5_2tand_t3_ipuhol", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "A few weeks into the lockdown, I hit a low point emotionally. Just a visceral feeling of unhappiness that I could no longer ignore, having suddenly found myself with so much extra time on my hands. I'm sure I had been feeling this way for years, but isolation shone a bright light on it that I could not ignore. \n\nI stumbled upon the Yale happiness course online and decided, totally beside myself, to take it. \n\nThrough the course I worked every day to understand what habits I had that were contributing to my unhappiness, and armed with new knowledge about habit forming, I set a goal to have established a few specific new habits by the time I was to return to work in person in September. \n\nMy first goal was to change my exercise motivation. I previously would exercise in an attempt to improve my appearance, and I could never form a long term exercise habit. My new objective has been to use exercise to improve my mood and to decrease pain (motion is lotion)! Those effects were pretty much immediate (especially the effect on mood) and are really helping me form a lasting exercise habit. \n\nMy second goal was start doing things for people without seeking credit, and to simply derive happiness from knowing my actions had a positive impact on someone else. I can't begin to explain how much this one has changed me.\n\nI am back to work in person as of the beginning of September, and so far I've pretty successfully integrated these new habits into my new, busier routine. My job is currently quite stressful and I'm noticing that I'm handling the stress far better than I ever have in the past.\n\nI'm super grateful that I had this time to focus on myself, that I am fortunate enough to have secure employment, and to live in a fairly remote area so far mostly spared by the virus. And that I stumbled upon a resource that has had such an immense impact on my life. It's been a daily, active effort, but it also gets a bit easier every day.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ipuhol/the_slower_pace_of_pandemic_life_has_given_me_the/", "title": "The slower pace of pandemic life has given me the opportunity to work on myself, and I am doing so much better than 6 months ago", "social_network": "reddit", "user": "spicyspice_85", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1599704254, "permalink": "/r/DecidingToBeBetter/comments/ipuhol/the_slower_pace_of_pandemic_life_has_given_me_the/", "nsfw": false, "first_save": 1635436647.002243, "replies_charged": false}