{"id": "t5_2tand_t3_cc7h9s", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "Just finished reading \\[Mark Manson's The Subtle Art f Not Giving a Fu\\*k\\]( [https://www.youtube.com/watch?v=vUNTvodh2B8&t=1s](https://www.youtube.com/watch?v=vUNTvodh2B8&t=1s) ) - awesome book.  The book teaches us how to stop worrying about the things you can’t control and instead focus on the things you can change. In all its hard hitting glory, it hammers home the point that life is tough and that we need to accept it and deal with. Instead, we need to be laser focused on what we really want in life and forget all the other pointless distractions. \n\n&#x200B;\n\n&#x200B;\n\nThere are certain key principles in the book that I'e learned:\n\n* Life is a struggle no matter what, you have to expect it\n* There are joyful struggles in life, you just need to find out what's worth struggling for\n* Having poor values makes you unhappy (like viewing money as the only way to be successful)\n* Having the right values makes you a better and happier person (such as honesty, creativity, and humility)\n* We shouldnt go through life thinking, \"Why me?\", as though life is imposed on us. Ultimately we must take responsibility for our own lives and change the things we can control while forgetting about the things we can't.\n* Our human intelligence has led us to question our own existence and the fact we must make the most of our lives because life is short. While it's good to have goals we can't let the fear of the future and pressure cause us anxiety.\n* Meditation helps us remain present and live a happy life where we live in the moment and don't worry about the past or future.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cc7h9s/the_subtle_art_of_not_giving_a_fuk/", "title": "The Subtle Art of Not Giving A Fu*k", "social_network": "reddit", "user": "self-development1985", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 47, "down_vote": 0, "creation": 1562914839, "permalink": "/r/DecidingToBeBetter/comments/cc7h9s/the_subtle_art_of_not_giving_a_fuk/", "nsfw": false, "first_save": 1635435823.1768363, "replies_charged": false}