{"id": "t5_2tand_t3_np6cl6", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "I’ve been a lurker on this sub for about a year. A little over a year ago I was 32, immature, selfish, and my life was basically one pursuit of drinking and having fun after another. That all changed when my girlfriend of six and a half years and I broke up. Last February she moved to another state, but we stayed in contact. Still saying “I love you.” Still sexing and flirting. You know, really healthy stuff. She even came to visit last April and we had sex. Then later that month after she had gone back to her new state, she told me she was dating someone she could actually see herself being with and we’d have to stop saying “I love you” to each other and have to put some distance between us. That’s when it all hit me. \n\nI won’t go into detail, but our relationship was tumultuous. She had her issues, but I was immature, selfish, inconsiderate, brash, and drank at least once a week and always too much. I had a lot of addictive tendencies. I did a lot of things I regret. when she told me she was seeing someone else I realized what I had lost and what I had done. To add another layer to this, I had given my kidney to this woman two years prior.\n\nMy entire world came crashing down. I looked at myself and thought about the emptiness I had been feeling since she left that I had been trying to ignore with distraction after distraction. I cursed my idiocy. My arrogance. My coldness. My self hatred and deceit. I decided that it was time to finally face myself because about 8 years prior to that, I had been in a very similar place with my ex before her. It was time to break the cycle.\n\nI started reading introspective books. Trying desperately to understand the why, and discover the how in regards to improvement. I quit drinking for 30 days, quit smoking, and didn’t masturbate for 26 days. I just wanted to get control over my addictive tendencies that had plagued me my entire life and led to so much pain in my previous relationship. If you’ve ever heard of the marshmallow test. I’m definitely one of the kids who ate the first marshmallow.\n\nThis wasn’t the end. Far far from it. This last year has been a roller coaster of back and forth, up and down with the ways I’m trying to improve. In fact, back in January I moved in with some friends in a new state who drink and smoke and I picked both up again and heavily. I was depressed from being somewhere unfamiliar, and then a month later my dog died of old age, so I no backslid. And hard. I was lonely on top of all this and had two meaningless hookups during that time. \n\nHowever, I’m here not only to share my story, but to say that progress and growth are not linear. Here’s where I am today: Four months ago I moved 1200 miles to a new state to get away from a toxic environment. In four months I found a good job (serving at a nice restaurant where the food is expensive and the tips are good), bought a used car, and found my own place to live. I just moved in a week ago and haven’t drank or smoked since. Joined a gym, went on a few hikes, and visited a location I’ve wanted to see since I was a kid.\n\nSelf improvement is hard. Hard as fuck. But you only ever start on the journey because you see within yourself what you could be. Keep that version of you in mind. It’s important to remember that you’re fighting against a presence within yourself that has had control for years and years, and like any uprising, there are battles won and lost, but the point is to never give up the war. Even if you backslide to exhibiting all the same behaviors again, you still possess the awareness that you are doing so, whereas before you did not. So whenever you do these things you can actually feel the pain they are causing you. That is the difference. So take that awareness and that knowledge and try again and again and again. You are worth it. You life is worth it. And no matter how many battles you lose, keep fucking fighting the war.\n\nBelieve yourself. Believe *in* yourself. Say it out loud to yourself. Seriously. Really focus on the words “I believe I can do it” or “I believe in myself” and actually believe it as you say it. Whatever you’re going through; however you want to improve. You can fucking do it. BELIEVE in yourself as vehemently as evangelicals believe in god because you are your own god and you can beat whatever devil you’re fighting. \n\nThank you to everyone who read this far, and especially to everyone who posted before me. This sub has helped me not feel alone in the battle to be better. Thank all of you and each of your beautiful individual journeys", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/np6cl6/its_been_a_journey_and_im_not_done/", "title": "It’s been a journey and I’m not done.", "social_network": "reddit", "user": "Lt_Dangus", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 25, "down_vote": 0, "creation": 1622475831, "permalink": "/r/DecidingToBeBetter/comments/np6cl6/its_been_a_journey_and_im_not_done/", "nsfw": false, "first_save": 1635435407.832839, "replies_charged": false}