{"id": "t5_2tand_t3_mmvcb2", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55", "9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I’d like to start off by saying I know that I’m not an actually *bad* person or irredeemable, because i care about some people in my life and I care about changing. But I know that most ‘normal’ people would perceive me as bad and not want to associate with me if they knew I was the way I am. I worry that I might even have a personality disorder such as NPD, and in that case I can’t help but think what’s the point in anything. Though I don’t know if i do have it everyone sees people with NPD as incurable, and if I had this disorder it would mean I can never be normal and have the normal life i want so much with attachments, love, even children one day and a happy family. I really want to fall in love, and I really want to be a mother one day. I want to have positive emotions, or have emotions with at least some intensity rather than feeling numb or anxious all day. I really hope i DONT have a personality disorder but I know this isn’t just a part of growing up. \n\nToday I’m 17, and around a year ago I became aware of how selfish, envious, entitled and subtly attention seeking I was. I made a change because I didn’t want to hurt the people around me, I noticed that sometimes I could even be subtly manipulative. I didn’t want to hurt my mother who I love so much. I remembered every time i’d made her life harder and felt so much guilt. I even recall a few instances of intentionally guilt tripping her as a child, or complaining excessively. \n\nBut even when I work to be a good person externally, internally I am not. I have both an extremely deep inferiority complex and sometimes even feelings of superiority over certain things (such as academics). I care way too much about how others perceive me, I’m very self aware at least, so I always call myself out. I spend all of my time inside my head, calling myself out on every single thing I do. 70% of my waking time is spent in complete anxiety, dissecting every single thing I think and the motivations behind it. I can’t stop analysing each thought and using it as evidence of me having a Cluster B PD, and if i do what’s the point in living? I’ll never love and get close to people like I want to so badly If i have something like that. What’s the point in living without human attachment. Even before this stage I was so unhappy, I spent all of\nmy time daydreaming about an ideal life where I had some worth and happiness. \n\nI want to die so much. I know i would never do anything to myself because imagining my parents reactions breaks my heart, I love them so much. But I can’t help but wish a car would hit me, or i’d have a sudden heart attack or something because I don’t want to do this anymore. \nI just want to be a normal teenager. Everyone thinks I’m weird and ugly too so i don’t have physical appearance going for me either, and even this post is filled with endless amounts of self pity which is inherently self centred. I don’t know if this post is just looking for sympathy too, or reassurance that I’m a good person but talking about this on here in private gives me some relief. \n\nEven though Im pleasant to everyone around me now, I’m still me. I feel like my default state is just someone bitter who’ll never be normal, I just work to direct my negative feelings inwards and protect those around me. The people around me are happy but I’m so so sad. I think i’ll always be sad and one day i’ll die alone, til then I’ll pretend to be happy or respond with what people want from me even if I can’t feel it. i don’t know if I inherited this but I can’t help but hate whoever passed this down to me and wish i’d never been born.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mmvcb2/im_kind_of_a_bad_person_and_im_really_not_sure/", "title": "I’m kind of a bad person, and I’m really not sure what to do.", "social_network": "reddit", "user": "ocdsuffering", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1617898773, "permalink": "/r/DecidingToBeBetter/comments/mmvcb2/im_kind_of_a_bad_person_and_im_really_not_sure/", "nsfw": false, "first_save": 1635437246.166926, "replies_charged": false}