{"id": "t5_2tand_t3_p0gmvm", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "Today marks the first day of no-contact with my ex. She was my first real relationship right out of high-school. We were together for 5 years and we were planning to commit to each other for life in a year once we both finished school. We watched each other grow up from kids into young adults. I helped her get her license, her first 2 cars, I helped her get into school. She was the first person I felt comfortable opening up to about being anxious and sad all the time. \n\nThroughout our relationship she had cheated on me twice and lied to me countless times. I was so attached to her, attached to the idea of her, I’d always take her back after hoping she would change.\n\nTo be honest I know she’s toxic, she knew I was wrapped around her finger and I couldn’t do much about it. Over the last week she said she needed space to work on herself so I gave her space because I more than anyone was rooting for her to become a better person for the benefit of both of us. She took off her promise ring, shut off her location, and Thursday morning told me “I don’t feel like making this relationship work”. \n\nWe planned to meet up Saturday and talk about what direction our relationship was heading. I planned a full day of activities we both enjoy doing in case it was our last day together, at least we ended it on a good note. Saturday rolls around and she tells me she made plans to go to the beach with her friends. I’m absolutely crushed and spent almost the entire day sitting in an empty parking lot praying more than I’ve ever prayed before for help. \n\nEven now leaving her has been the hardest thing I’ve ever done in my life. The last week leading up to this has been a blur, I haven’t ate more than a bite of food in 3 days. I can’t sleep properly. She was a huge part of my personal identity and without her there now, I feel like there’s a void where she used to be. I know this was the right decision and I know with time I will get better. I’m lucky to have such supportive and understanding friends by my side through this otherwise I’m not sure I would make it. \n\nMy chest feels heavy and I really hope she becomes successful in life. It’s hard leaving behind someone I cared for so much. I hope she accomplishes good things in life and changes for the better. \n\nThank you for listening.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p0gmvm/ending_a_big_chapter_in_my_life/", "title": "Ending a big chapter in my life.", "social_network": "reddit", "user": "ohmanthisguyagain", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 207, "down_vote": 0, "creation": 1628436295, "permalink": "/r/DecidingToBeBetter/comments/p0gmvm/ending_a_big_chapter_in_my_life/", "nsfw": false, "first_save": 1635435990.50854, "replies_charged": false}