{"id": "t5_2tand_t3_mywkex", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I cashed in a few lottery tickets and got $30, not much but i ended up deciding that I want to put a set amount of money aside between my car and my wallet that I can start giving to homeless people. The same day I saw a guy outside of the store I was shopping at and i got my money ready. \n\n&#x200B;\n\nUnfortunately I got hit with the hard reality. The guy seemed like he was coked out, he wasn’t even holding his sign up, it was just in his arm. He told me his sons name and asked for $1, the way he said it made it seem like his son was someone everyone knew. I handed him a 5 before I went into the store and then I looked his “son” up and I didn’t see anything. It’s a good lesson for me to learn, I can’t just give money away and expect it all to be used for good, obviously I don’t know what the guy was using it for but I do think I need to be more careful. I think I’ll start carrying 1’s in my wallet and 5’s in my car that way I can kind of gauge the situation.\n\nDisclaimer: the rest of this post is for my personal use and record to check my progress , However comments, advice, encouragement and criticism are welcome\n\nOTHER PROGRESS\n\n1. Going to try and start showing my affection more \n\n\\- I(21m) Tried to give a coworker I like(39f) a birthday gift this week, long story short, turns out she hates me lol. I spent around 2 months trying to show her that I cared with my actions and words but I feel she’s been hurt too many times because she was very quickly convinced that I hurt her behind her back and completely cut me off from her life. So I’m going to try harder to make sure that the people I love KNOW FOR SURE without a doubt that I love them.\n\n2. Started doing bills\n\n\\-me, my mom and my sister live together, I am the breadwinner because she is on disability but I usually just send her the money to take care of the payments. I’m 21 and it’s about time I learned the value of money and money management. I’m going to be taking care of the bills for a few months. I have some money in savings that I’ll use to make sure I have a clean slate. So I’ll be able to gain experience AND take some pressure of my mom. Win win\n\n&#x200B;\n\nNothing else but Wish me luck, I have plans for this week but we’ll see how it goes.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mywkex/becoming_a_light_week_2_i_gave_a_homeless_person/", "title": "Becoming a light week 2: I gave a homeless person money!", "social_network": "reddit", "user": "Diggydog323", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1619440263, "permalink": "/r/DecidingToBeBetter/comments/mywkex/becoming_a_light_week_2_i_gave_a_homeless_person/", "nsfw": false, "first_save": 1635436854.6796172, "replies_charged": false}