{"id": "t5_2tand_t3_46vsy5", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "[**Video summary of the 10X Rule, for easier digestibility**](https://www.youtube.com/watch?v=pV7GhfDtO4E)\n\n\nThe 10X rule is based on the idea you should figure out what you want to do, what goal you have, be it making a certain amount of money, finding your ideal loved one, achieving a certain body fat percentage, and multiply the effort and time you think it’ll take to do by 10. That way you have a more accurate idea of how much time and effort it will actually take. And if it doesn’t take 10 times more effort then you anticipated, great. It’s better to be pleasantly surprised then greatly disappointed.\n\n\nThis is just one part of the 10X rule though. On the other side of the coin Is 10X thinking. And that is when you take for example, how much money you want to earn, say $100,000, you should multiply that by 10, and figure out the steps you’ll want to take and the amount of time it will take to get that goal. \n\n\nIf you fall short of that 10X goal, there’s a pretty high chance you’ll be above your original goal. And it feels better to fall short on a massive goal then it does to fall short on a mediocre one. \n\n\nWe as humans have a tendency to underestimate what we can accomplish, and therefore set lower goals and not reach our full potential.\n\n\nWhen you apply the 10x rule to your thinking, and then apply the 10X rule to how you act as well, success is guaranteed.\n\n\nThis is ultimately a book about achieving extreme success, success in your work life, family life, and spiritual life. We need to forget about the idea that there’s a ceiling to the amount of success you can achieve, and that you can only be truly successful in one or two areas and the rest of your life will suffer. The 10X Rule has three mantras about success: Success is important, success is your duty, and there is no shortage of success. \n\n\nIf you want to become successful, there’s no one stopping you from doing it, figure out what constitutes success for you and go and make it happen. And remember, in order for you to win, someone else does not have to lose. Just because someone else is successful does not take away from the amount of success you can achieve. \nYou should consider it unethical to not live up to your full potential.\n\n\nThere are 4 degrees of action\n\n**No action** – Means you do nothing towards your goals \n\n**Reverse action** – Means you head in the other direction and come up with excuses for why your dreams won’t work \n\n**Average action** – means you do some work towards achieving your dreams and if success comes then success comes. \n\n**Massive action** – Means that you stop at nothing to conquer what it is that you want to achieve. You’re ferocious in your problem solving, ferocious in your drive, ferocious in your resolve. \n\n\nIn order to operate at 10 X levels, you need to be taking massive action. The secret is that all of these degrees of action take the same amount of energy. If you don’t do anything or you move in reverse, the amount of energy you’re expending to come up with excuses and do other things that won’t help you is the same as if you focus on \nyour target and don’t stop until you reach it. \n\n\nWhen you start taking massive action, you’re going to find that you come across a host of new problems. This is a good thing. If you’re stuck dealing with the same problems year after year, that means you’re not growing enough. You want to have too many people at your speaking engagements, you want to make so much money that you’re in a new tax bracket, you want people telling you to slow down. \n\n\n*Forget about competition*\n\n\nWhen you’re taking 10X levels of action, you will be outworking and outhustling all of your competitors who are stuck on the third degree of action. When operating at 10X you will be in a world of your own competing against only yourself. It’s too crowded in the middle to compete, you’re better off being the powerhouse in your market where you name is synonymous with what you do. Think Kleenex and Q-tips, those are brand names, not the actual name of the product they sell. \n\n\n**Fear**\n\n\nGrant Cardone is often seen as fearless by his willingness to approach new challenges ferociously. He attributes this however not to lack of fear, but to an understanding of fear. \n\n\nFear is a fire that won’t blaze if you don’t give it oxygen. So when you feel fear, that’s the time for action. Not for debating or wondering what the next step is, when you feel fear you deal with it by attacking it and not giving it any room to breathe and grow.\n\n\nCommit first, figure out the details later. Get moving on your tasks immediately and don’t worry about the details too much at the start. However fast you can get started is how fast you can minimize the fear. \n\n\nFear is an indicator that you’re moving in the right direction, it means you’re encountering new problems and are heading towards uncertainty. (say more excited)\n\n\n**Goal setting and getting started with the 10X rule**\n\n\nMake an initial list of goals, then make an initial list of actions. \n\n\nDon’t plan too much, just start taking actions. Do not reduce your goals as you write them down. Don’t get lost in the details. Do not prematurely value the outcome of your actions. Evaluate your goals often, if your goals for the future are only important enough to write them down once a year, then you can’t be expected to have the drive and motivation to complete them. An ideal situation would be to write down your goals every morning when you wake up and every night before you go to bed. \n\n\nApproach what you do like a mission. Keep coming up with new reasons to show up and be motivated. True motivation comes from the inside and keeps you driving towards success.\n\n\nRemember, It is your moral obligation and responsibility to your work, your family, and your future to commit to success. So show up, be all in, and trust that creativity follows commitment.\n\nAnyone have any experience using the lessons from this book? I find when you read this book and you just get in the headspace of the author, you have a lot more energy and motivation. It really makes what you're doing seem fun even if you are working really hard. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/46vsy5/how_to_plan_better_goals_face_fears_and_get_more/", "title": "How to plan better goals, face fears, and get more done. A summary of The 10X Rule by Grant Cardone", "social_network": "reddit", "user": "gmos905", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1456070251, "permalink": "/r/DecidingToBeBetter/comments/46vsy5/how_to_plan_better_goals_face_fears_and_get_more/", "nsfw": false, "first_save": 1635437018.5269866, "replies_charged": false}