{"id": "t5_2tand_t3_brthrj", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I’ve known this about myself for a long time. I frequently procrastinate, half-ass things, run away from responsibilities, and cop out of things. I’ve become very good at doing these things over the years, because I’ve experienced rewards from them. I’m fortunate enough that there are others in my life who are always patient when I disappoint them, always ready to assist when I go back on my word, and ready to forgive when I choose to fail. This means that I’m both my childhood and adult life, I’ve been able to succeed where I shouldn’t have, and put forth little effort and avoid repercussions from it.\n\nFrankly, it disgusts me to think about. I’ve taken advantage of those friends and family who care about me most, and have relied on excuses, my good fortune, and privileged positions to get me out of it.\n\nI’ve always considered myself a “good person,” and I think my friends and family would agree. What what kind of person does the above? What kind of person is aware of a huge flaw with themselves that has the capability of harming themselves and others, and makes the conscious decision that it’s “easy” to not make a change? I’ve been selfish and lazy. And then always made excuses. But no more.\n\nMy excuses have started being pathetic. I’m well into being an adult, and need to stop. My complacency has started hurting others. There truly are consequences to our actions (or inaction), and that decision to procrastinate one small thing and excuse it may end up turning into a much larger issue that was very avoidable. I will no longer live in a way that does not honor myself or those who I care about, and will be true to my potential. No more excuses.\n\nI am posting this because I want to put this down in a way that will allow me to refer to it, possibly inspire others, and possibly get feedback from others. \n\n1.\tMy word will carry weight. I will no longer back out of commitments, and make hollow promises.\n2.\tI will stop procrastinating. Making easy decisions to engage in instant gratification instead of responsibility creates a toxic environment, creates overwhelm, and contributes to me feeling awful about myself and disappointing others.\n3.\tI will prioritize. I will manage my commitments and responsibilities, and will organize them to ensure that I can be successful.\n4.\tI will no longer rely on others (within reason). I will take responsibility and show I can, and will, handle my own life.\n5.\tI will meet my responsibilities head on. No more avoidance. No more copping out. \n6.\tNo more excuses. Whenever I do make mistakes, or fail due to conscious or unconscious decisions, I will own it. Out of respect for myself and others, I will take accountability and do what needs to be done.\n\nIf anyone has any other commitments, actions, or recommendations, and you don’t mind doing the labor of sharing them, I’d love to read them and keep growing. \n\nIf anyone finds themselves in a similar position, where you are not living in a way that’s true to yourself, you disappoint yourself and others, you avoid responsibility, make excuses, etc... join me in this commitment. Let’s take control of our lives and be better. We can, and it’s time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/brthrj/done_with_excuses_and_avoidance/", "title": "Done with excuses and avoidance.", "social_network": "reddit", "user": "alinktothefutur3", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 60, "down_vote": 0, "creation": 1558555501, "permalink": "/r/DecidingToBeBetter/comments/brthrj/done_with_excuses_and_avoidance/", "nsfw": false, "first_save": 1635436045.0031698, "replies_charged": false}