{"id": "t5_2tand_t3_eslxd9", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "As my title probably already illustrates, I'm having a hard time framing what I'm trying to say. I'm going to try to keep it as short as possible, and I guess I can expand if someone thinks a direction is relevant.\n\nI've dealt with depression since I was a child, and for the most part I've just ignored my way past it. Medication and therapy was not my answer, and I've just done my best to weather the storm and keep aware of myself on the bad days when they come. I try to keep a lot of the healthy boxes checked, but as I'm 30 and I'm trying to really make progressive change in my life and my desires, I find myself holding my breath and trying to power through whatever new awareness I have, only to deflate as soon as I lose my concentration. I've fought this my whole life, feeling like I'm in unknown weather, and the only thing that comes out of it at the end is myself back at square one while my good intentions have collapsed.\n\nAs I have gotten older and also as video game models have shifted, I'm having an existential crisis. From a young age, I've always escaped into my games (Pokemon, Goldeneye as a kid, World of Warcraft through high school, misc games through the 20's.) But now I'm just not really getting the satisfaction from any of them. On top of the fact that morally I'm outraged that games these days are half-finished shit chocked full of payments for content. I've been slowly drifting away from games for a few years, especially as most of my social circle stopped playing games together, which I think was a big part of gaming in my teens/20's. I still play with some close friends, but we burn through games and it barely lasts.\n\nI KNOW that what I got out of games was grinding to unlock something for skill or player expression. For instance, Assassin's Creed, unlock all outfits, red dead redemption, get all guns, all outfits, horses, etc. I've always loved customizing, completing collections, and being able to make my experience MY OWN. Now that most games follow a 'pay to unlock' model, I find myself grinding out weapons or skins here or there, but I've lost interest in paying money to unlock a skin, then not wanting to play the game because the incentive is lost as the content was bought. I've spent thousands of dollars over my 20's on games like League of Legends, and I used to argue 20 dollars a month was acceptable, but the buy-in and time investment these days is too high to justify my continued subscription. Or the grind was artifically inflated and dragged out to incentivize financial buyout, which makes content feel tedious instead of rightfully earned (GTA:Online).\n\nSo I'm seeing the divide in where, I don't get the satisfaction I used to out of games, the games themselves have literally changed from what I used to enjoy, and now as I try to find other things to do, I just don't have ANY connection to it. I tell myself that I'm interested in reading, yoga, stretching, writing, drawing, just to name a few. And I do enjoy these things. But there's no maze to them, there's no unlock, no customization, my attention and motivation for them is completely gone. I'm stuck between 'turning my engine over' hopelessly trying to find what I crave from a new game, or I'm listlessly infuriated and bored that nothing in the real world will hold my interest.\n\nI used to remember playing legos for hours on end as a child, and now I struggle to spend five minutes playing Legos with my daughter, and I think it roots back to the 'where's the reward, no reward, no reason to be doing it' mentality. It's painful to admit this or think it out loud. I'm by definition a good dad in 90% of all aspects, but I'm fighting against some deeply ingrained negativity in the fabric of my own persona which makes me feel selfish and unable to connect on a deeper level than 'what interests me' - which is  a catch 22, as really the answer is nothing. I'm terrified for my daughter to imprint this behavior, and I want to learn how to overcome it in myself.\n\nSo, I'm seeing the video game feedback loop issue - almost drug-like, where I want my fix, but can't get it anymore. If there isn't a series of rewards at given intervals, I am not motivated to pursue the actions to obtain them.\n\nI'm seeing my disconnection with real life, which is probably part of the 'drug/video game' mindset I've ingrained in myself, and also part that depression has honestly left me with very little connection to every day life. I have always just escaped from reality, that I have no relationship with it outside novelty here or there.\n\nAnd another big one is, I just hate food. My wife was talking to me the other day about how 'not all food disorders revolve around self-image', and it really made me wonder. Almost everyone in my immediate family has some hate relationship with cooking or food, even into cousins and aunts. I suffer extreme food choice paralysis, nothing stands out. My food choices are defined more by 'what doesn't sound like it would make me feel sick' rather than what sounds good. I hate eating breakfast, almost anything I can think of eating in the morning would again make me feel overwhelmed or sick to my stomach. As I've been supplementing more exercise into my daily routines, I have a stronger appetite, but STILL nothing sounds good, and it feels so shitty to be starving and all thought of food is bleh. I tend to eat a lot of yogurt/cheese/hard boiled eggs/quickly prepared foods (PBJ, bean/cheese burritos) because by the time I'm starving, I just need to eat something. I have no interest in preparing food, because I have no interest in consuming food. I don't know how much of that is a food issue, or ties back into the dissociation with real life issue.\n\nAnyway, I don't know what sort of response I expect, but I had to try to consolidate my feelings and thoughts on this topic. To say it out loud helps me feel like it's real, and not just that I'm a lazy sack of shit. I am a perfectionist, and it's so difficult to be below my own bar in regard to this issue. In dealing with depression and perfectionism, I just sort of learned to 'not care', and now I'm really afraid that I threw the baby out with the bathwater, and I have no idea how to get it back. \n\nI do enjoy going to yoga, it gets me out of the house and I'm held accountable to do something with a teacher present, but my schedule doesn't always allow it, and classes aren't always at the same times. I get a great sense of satisfaction from finding ways to better organize and aesthetically improve our home, but that is budget-restricted and some days I just want to throw everything out, as I can't find a system to provide the positive boost from completing an efficiency improvement circuit. Doing anything for the sake of \"it\" feels so empty. I want to walk SOMEWHERE, I want to drive to A PLACE, but I just don't have the 'things' which make it purposeful. I don't want to just buy new things all the time, I want to find actual meaning in things. Not just consumer/dopamine relief.\n\nHas anyone experienced this? Does anyone have any tangible idea how to re-connect with the pleasure and satisfaction of real life? Can anyone relate to anything I'm thinking or experiencing? Thanks for any of your time you invested in reading about this. I really appreciate it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/eslxd9/30m_struggling_with_longtime_video_game_avoidance/", "title": "30/M, struggling with long-time video game avoidance feedback loops, dissatisfaction in real-life activities, and possible eating disorder? Would love to hear from those who relate or found a solution", "social_network": "reddit", "user": "Zytoxine", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1579743438, "permalink": "/r/DecidingToBeBetter/comments/eslxd9/30m_struggling_with_longtime_video_game_avoidance/", "nsfw": false, "first_save": 1635438157.7980933, "replies_charged": false}