{"id": "t5_2tand_t3_3zv0a2", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "I want to be this person who's always happy, smiling, laughing, polite and forgiving, like nothing could bring me down.\n\n\n\nBut ive been getting even more frustrated and more offended lately and im feeling sick of putting a facade of smiles and laughter in front of people.\n\n\n\nSo when i get upset and angry all i do is clam up and give the cold shoulder. My *friends* have been passive aggressively getting me more and more insecure with myself, mostly unintentional though. I just feel like theyre nosy and stuck up just because they have a clear face and higher gpa, treating me like im not doing everything i can for myself because i dont have what they have. I am trying to improve myself but im at my own pace and patronizing me wont fix me, it's just different for different people, if i wanted such *advice*, I WOULD HAVE ASKED. I just want them to shut the **** up and leave me alone!\n\n\n\nThe thing is, as much as i feel sooo difficult to tell myself to forgive these people, i have to. I cant keep clamming up and stay silent forever. Theyre the people who i have to work together with on most days of the week, they have to trust me, they have to support me, and im expected to do the same to ensure that all of us are productive and that theres no conflict/tension that will disrupt the harmony for everyone else. Im basically stuck with everybody here. I can find and i do have other people outside of them. But most of the time i **have** to be with them and i dont have anyone else during those hours but them.\n\n\n\nSometimes i think i feel like i just want to scream out loud. But no, i tell myself i must not. I wont be that crazy sensitive ***** that's grumpy all the time. I have to stay positive but it's so hard. I silence myself and when i get home i cry in my room alone.\n\n\n\nIt makes me feel pathetic. I wish i dont feel this sensitive, but i do. I keep telling myself not to care, but i do. All i can do is hide my sensitive nature from everyone and pretend it's okay but im just feeling so sick and tired on the inside. The worst thing is theyre the people i consider closest to me but theyre the ones hurting me on the inside. \n\n\n\n\n\n\nIf any of you have thought of a positive way to approach this issue, I'd love to know :]\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3zv0a2/i_look_into_the_mirror_and_smile_tell_myself_its/", "title": "I look into the mirror and smile, tell myself it's okay. I feel like im lying to myself.", "social_network": "reddit", "user": "Theaisyah", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1452163938, "permalink": "/r/DecidingToBeBetter/comments/3zv0a2/i_look_into_the_mirror_and_smile_tell_myself_its/", "nsfw": false, "first_save": 1635437144.147557, "replies_charged": false}