{"id": "t5_2tand_t3_la2c0r", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "I'm a huge geek, i'm an avid cosplayer, and at 29, i'm the most confident and socially outgoing i've ever been in my life.\n\nHOWEVER...\n\nI was NEVER always like this. I was a shy, nerdy, skinny, awkward dude at an all boys school who loved anime and cosplaying, and was absolutely TERRIBLE at talking to people (especially girls!)\n\nI always thought:  \n\\- maybe I was just born this way...  \n\\- maybe I need to stop being a geek to be cool...  \n\\- maybe having a girlfriend is all about luck...  \n\\- maybe things will just get better as I get older...\n\nIt wasn't until a DECADE after I finished school that I realised: NOTHING CHANGES BY ITSELF.  \nAt 26, I was the same lonely nerd with barely any friends, social skills or confidence.  \n\n\nTHEN  \n\n\nFor 2.5 straight years of researching social skills, making attempts, embarrassing myself, crying at my failure, getting laughed at, getting threatened and getting rejected....... I actually got better.\n\nThrough my years of trial and error, I learned so many different things that have completely turned my life around, that I wish I knew as a kid. I'm someone who wished they had friends, someone who used to be completely terrified at embarrassing myself just by talking to people, someone who just wished they knew how to get better. \n\n&#x200B;\n\nIf this sounds like you, I want to help.\n\n&#x200B;\n\nFeel free to ask any questions below, i'll do my best to answer them and provide some useful tips!\n\n=============================================\n\nIf you want more than just small tips and want to seriously improve, send me a DM and we can chat further!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/la2c0r/confidencesocial_skills_coach_for_fellow/", "title": "Confidence/Social Skills coach for fellow geeks/cosplayers. ASK ME ANYTHING", "social_network": "reddit", "user": "mangalphantom", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1612183795, "permalink": "/r/DecidingToBeBetter/comments/la2c0r/confidencesocial_skills_coach_for_fellow/", "nsfw": false, "first_save": 1635438198.8425124, "replies_charged": false}