{"id": "t5_2tand_t3_ptju14", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": " I know my sense of justice is flawed. It's been flawed even since I was kid, before I knew I was autistic, and I have lost control again. I have to keep positive, because if I tried delivering justice online or in person, I know I will go too far one day. \n\nI've seen and heard things that absolute evil on the internet, things I can't stand. Did you see the video about the kid who almost killed his own cat accidently just because some assholes on the internet told him to? \n\nIn middle school and high school, I heard about these things. Injustices in every way, space or form, bad parents, or evil children. People who were the nicest people in the world being absolutely screwed over for nothing but someone's else greed. Discrimination and killing without reason. I guess the internet and the news and the teachers thought exposing us to these evils would make us understand why we shouldn't do them. But they only filled me with a hopeless for the human race. I guess then my therapists and my teachers were right about me. I had very strong emotions and was very sensitive. Problem was, I was too senstive.  I ranted about these things alot. Once, I got almost into a verbal fight with a teacher on race. Another time, for verbal abusing another for refusing to help a friend in ADHD. I even got into physical fights with former friends over these things in primary. When I was almost suspended, and even expelled, I realized that doing these things were wrong. You can't fight evil with evil, or violence with violence. I told myself, no matter what someone does, I don't believe they needed to hurt, or killed. \n\nI tried to look at everything with a calm, cold, logical attitude. I push my anger and frustration away. Or push it down. I promised myself I would never become that kind of person, a SJW, a extremist again. I would never asked for someone to be hurt or killed. But sometimes, I can't help myself. Sometimes I see things, like Trump saying they'll let people die of Corvid-19 rather then deliver the vaccine, I do want to hurt people. I never go through with it. of course. I'm still a good person at heart, or atleast what everyone tells me. \n\nMaybe I should have kept this to myself. Will I be sent to prison for admitting this? An insane asylum? Will I be forced to see a cold and uncaring shrink for the next 20 years of my life? I hope not, as I'm a 20 year old uni student who still has big dreams of making the world a better place. But I can't keep feeling anger. I can't let myself go too far, and do something or say something I will regret. It's happened before. I've lost friends that way. These people, well, I don't know where there are in life now, but it still does hurt to think because of the one thing I do, the one mistake, the one outburst I had, has made them hate me for life. I need to be mature if I'm going to have a job and a meaningful relationship.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ptju14/he_who_fights_monsters_should_be_careful_not_to/", "title": "\"He who fights monsters should be careful not to become one themselves.\" - Fredrick Nietzche", "social_network": "reddit", "user": "ghostpanther218", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1632357748, "permalink": "/r/DecidingToBeBetter/comments/ptju14/he_who_fights_monsters_should_be_careful_not_to/", "nsfw": false, "first_save": 1635435785.090052, "replies_charged": false}