{"id": "t5_2tand_t3_q1z4zo", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "Hello all, although I did detail my journey/decision in another subreddit, I thought it could help here as well - especially for those who are considering starting sex work with or quitting OnlyFans or on another content creation site. \n\nThis is just my experience and is not a judgement on sex work or sex workers in general. I'm sure many others have had great experiences with the work and yes, sex work is work.\n\nI'm a woman in my 40s and had reasonable success with Onlyfans over the past 6 months, especially considering I don't show my face. At first I enjoyed expressing myself sexually and connecting with my subscribers. But I needed to quit for the following reasons:\n\nMy boundaries keep getting pushed, and it became exhausting. People will always want more, no matter what you provide. Some will be upset and treat you poorly if you decline their request. You will face harrassment. It's challenging not to let it get to you.\n\nI lost my sex drive. Turning this fun, expressive element of my life into work, based on the needs of others rather than myself, was harmful to me and my connection with my partner (who supported me/captured content with me throughout this journey). I went from having a very high libido to having none and feeling disconnected from my body and unlike myself. I've never experienced this before.\n\nI was attached to my phone. Not only with creating and posting content and interacting with subscribers, but the incredible amount of social media/promotion that needs to be done to keep new potential subscribers interested. This takes a toll in time, some days 8-12 hours (on top of other work, family responsibilities), it became way too much. I also wasn't spending as much time with my partner, friends and family, which was impacting my life. When I worked out the time for income, I was making minimum wage off OF. It honestly made me understand the issues with all social media, and I have also stepped away from my personal accounts (which is not a bad thing). Time is such a valuable and finite resource we have, we can't squander it.\n\nAnother major reason for leaving is seeing how it was impacting my subscribers. Many would want to purchase customs or needed to take a break from my page momentarily because they needed to pay for food, rent, clothing for kids. Although I did produce quality content and never scammed anyone, I do not feel that OF content is a priority. I would be urging my subscribers to take care of those priority things in their life rather than giving me their money. I started to feel like a shit human for taking their money.\n\nThere were some very positive things I got out of it too - mainly the interactions with subscribers where they were coming to terms with their fetishes or facing a darker time in their life, and just needed someone to talk to. I was honored they trusted me enough to open up. \n\nBut I think I can take these elements I loved and start something new that's outside of sex work. \n\nThank you all for reading, and I'm happy to answer questions and especially help others who have been in my shoes.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q1z4zo/i_quit_onlyfans_because_it_was_harming_me_my/", "title": "I quit OnlyFans because it was harming me, my relationship and my subscribers", "social_network": "reddit", "user": "Entire-Bowler-1565", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 669, "down_vote": 0, "creation": 1633448697, "permalink": "/r/DecidingToBeBetter/comments/q1z4zo/i_quit_onlyfans_because_it_was_harming_me_my/", "nsfw": false, "first_save": 1635436750.7782733, "replies_charged": false}