{"id": "t5_2tand_t3_fz2i61", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "[Link to Day Five](https://www.reddit.com/r/DecidingToBeBetter/comments/fydmni/game_plan_day_five_this_isnt_about_me_anymore/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n[Link to Profile/ Positive Qualities/ Longterm Goals](https://www.reddit.com/r/TrueOffMyChest/comments/fx9ty0/im_ridding_myself_of_selfpity_selfhatred_and/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n**Summary of previous day**: \n\n- In the morning I sent a message to my wife to gently suggest that we talk about the practicalities of our situation. At the same time I let her know the good progress I’ve been making. To my delight she responded to say she’s glad I’m working on myself. She said she could come round to talk after our 1 year old finished his nap. I felt so happy she responded. \n- Because I had the day off work until Monday I decided this’d be a great opportunity to get through some much needed housework. I got so much done! I felt so clear headed afterwards. Working and doing chores can be truly good for the soul, and I know it’s a crucial part of me fighting all my laziness. \n- At 1.00PM I attended an anonymous telemeeting which lasted an hour- but it was great. I’ve accepted the fact that if my mind wonders when I’m at these meetings okay, I can’t expect myself to be doing perfectly. I am absorbing so much when I’m at these meetings, and it keeps me focused on the overall fact ‘I need to be here’. \n- As it was good Friday- at 3PM I prayed a small prayer. According to my religion the son of my Maker died for humanity’s sins (so that we can rise again with Him) and it was ‘on the third hour of the Friday’ that He took His last breath. So pretty significant moment to pray! I felt solemn but peaceful doing so. \n- Not long after my wife came home with our son. It was very emotional. I was so joyful to see my son, he’s such a little character- he’s in at everything. I made a sincere point when my wife arrived to try and actively listen more than share making her aware ‘this isn’t about me anymore.’ We talked about everything. I shared with her the intentions I have to get better. [After much active listening I also shared with her the ‘letter’ that I had wrote which was a very emotional share.](https://www.reddit.com/r/TrueOffMyChest/comments/fxdf5d/i_have_a_list_of_things_i_want_to_tell_my_wife/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). She was truly appreciative of what I’ve done so far but, as I’d wholly anticipated, until I have sustained change for a long time I know things are going to be ‘right’ between us. Time is a healer. I am so determined to keep working at fighting self pity and self hatred and to keep fighting with all my heart, for her, for me and for our son. She decided it best for practical reasons for her to remain staying at her mums for now because I’m working from home we’d need a childcare arrangement for him anyway. It also means I can keep being dedicated to getting into the routine of attending my meetings and working on my mental health. She departed seeming lighter in spirits. God is good. \n- It was literally 7.15PM when she left and my second anonymous telemeeting of the day was beginning. I immediately joined the call and engaged what was being shared. I’d love to disclose the content of what is shared, but it’s massively important I abide by the 12 traditions and keep it truly anonymous. \n- My dad, whose staying with me, made a nice fish dinner (I usually hate fish but I actually enjoyed it) which I was able to eat during the telemeeting (the benefits of virtual meetings !). \n- After the meeting I felt ready to just relax, but instead I pushed myself to pray the rosary. I think it’s so important that I keep persevering with my faith. It helps massively and I know it’s because of all the grace that prayer gives. \n- I ended the evening playing video games. But I felt myself pretty empty doing this without putting a limit on myself, so I eventually turned it off and watched a video interview of Shaka Senghor who was a convicted felon with an insanely amazing story about redemption and the idea of not running from the pain while he was in isolation. I wanna read his book about his story. \n\n**Learning points from yesterday**\n\n- Your emotions aren’t in the driving seat anymore. We cannot recklessly be speeding through life without aim. We need a plan and action every day.  \n\n**Plan for today 11/4/20**\n\n- Self-care: take antidepressants, eat healthily, drink water. \n- Attend a gamblers anonymous ‘drop in’ telemeeting at 12PM\n- Have meditative prayer time in the evening (praying the rosary/ sitting in silence). \n- Occupy self with housework (there’s always lots to do). \n- Attend a vigil service for Easter. \n- Call and talk to a friend.\n- Reach out to someone who might be in complete isolation at this time. \n\n*Note from subject 11/4/20*\n\nI’m gonna try keep these notes a bit more short and sweet. I know it’s important I sustain these behaviours and if I have the pressure of writing an essay every day I might slip up. \n\nI just want to make a comment on the notion that change is uncomfortable, but this fact is good. I felt a sense of that yesterday at one point when talking to my wife. Knowing truly that ‘everything must be different now’ and that I’m going to have to be vigilant every day so that I don’t stumble back into self pity and then acting out... it’s definitely an immense weight acknowledging this new reality. I’ve been sleep walking through life and living in a state of fantasy where my mantra has been ‘feel better, no matter the costs’ and I am now choosing to be awake. I can see all the cracks in my life and yeah, it’s uncomfortable. But the good thing is that it is in *this* state, where I am not running from the lack of comfort, that I facing the truth and fighting for a better life. Although I’m not running on the fuel of emotion anymore, the ironic thing is I know I’ll feel empowered more and more by remaining fighting in reality - and I’ve heard it many times before; it eventually feels incredible to be truly living life. \n\nOne day at a time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fz2i61/game_plan_day_six_change_is_uncomfortable_good/", "title": "GAME PLAN - Day Six. ‘Change is uncomfortable. Good.’", "social_network": "reddit", "user": "iamgettingbetter_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1586602343, "permalink": "/r/DecidingToBeBetter/comments/fz2i61/game_plan_day_six_change_is_uncomfortable_good/", "nsfw": false, "first_save": 1635436208.525763, "replies_charged": false}