{"id": "t5_2tand_t3_jtchl0", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "After 7 months of drinking daily, I have spent 7 days without a drop of alcohol. Of course, I still have hoppy water. This is to make sure my brain and habit monster doesn't get the better of me, but it has been a very strange 7 days.\n\nI have journaled more and dulled the edge of my criticism, both of the self and of others. It still exists, but not as bad. \n\nI am writing again. The thing I hated because I had no reason to do so is now something I look forward to these days. I am even writing in long handwriting. I dusted off the ol' cursive, which is far better than my previous chicken scratch.\n\nI took my leap of faith at doing yet another website, but this time having a focus on doing it. \n\nI am understanding more that where I am now is not where I think I should be. As a survivor of many physical and sexual abuses in my life, that is always going to be an issue. While I am fortunate to be where I am and lucky that it hasn't gotten worse, it is still time to try and be a little better for me.\n\nAnd I am getting up with less pain in the brain and more pain in the everywhere else. The benefit of the Andre the Giant self-medication is coping with pains you cannot relieve. Sadly, it means I have to accept these pains and move forward with them.\n\nI am planning on one more week. Unless I am with some associates after work or a holiday event, I am pretty sure I am not going to drink for a while. At least, this is the plan.\n\nEveryone has a plan until the whiskey punches you in the face.\n\nThis post is not for me to get accolades. I am still going to be standoffish with praise and will come off cold and uncaring. This is always my personality, so please excuse me if I hate every moment that someone tries to encourage me.\n\nThis is more for those who might be questioning if they should stop or not. If you can find a replacement for the habit (alcohol - hoppy water - water) and test it for a few weeks, you can see what you think. \n\nI am not going to praise sobriety. I am not here to bury the brews and exorcise the demons of whiskey. This is an account of someone who has gone 7 days without alcohol and has survived doing so.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jtchl0/what_i_learned_by_not_drinking_alcohol_for_one/", "title": "What I learned by not drinking alcohol for one week", "social_network": "reddit", "user": "meaton124", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 30, "down_vote": 0, "creation": 1605250388, "permalink": "/r/DecidingToBeBetter/comments/jtchl0/what_i_learned_by_not_drinking_alcohol_for_one/", "nsfw": false, "first_save": 1635436627.5182412, "replies_charged": false}