{"id": "t5_2tand_t3_qclphd", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "Hello there , I have been through an emotional torture which i could say made me buid up lots of defenses which reflects so much in my behavior , i have been a possessive,  toxic , tiring pathner.  \n\nam in this relationship which i  very much want to keep and do my   best to last to something big and beautiful but the issue here is i recently realised i am a toxic pathner and had my girlfriend lash out to me that i am very toxic and it's making her feel trapped, unable to explore herself and my actions are gradually pushing her to leave the relationship.  \n\nEver since she voiced that to me, i came to term that i really must be toxic and i need to work on it, i have lately tried reading stuffs online which best addresses the situation and i happened to fall on a reddit post where someone asked what to do if they are toxic , i felt i could leave y'all a cry out for help   as i really want to stop been toxic and be the adorable person i am when calm. \n\nMy insecurities of people leaving me rules me most often, my fear and over assumptions nature makes me build up lots of scenarios which haven't even happened,  my jealosy is getting too much to handle that it's coming forth as been possessive.  I leave my past trauma interfere so much in my head and thus makes me this horrible person am turning out to be, my words are so hurtful when  am mad , i am becoming this person i can't even recognize anymore, \n\nI am willing to enter this journey to not only heal myself but give the right energy and love back to my pathner , i don't want to loose her for real. I'll appreciate any advice and conversation which would help me. And i sincerely apologize pening down this long message to y'all. Coming from a stranger..", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qclphd/i_am_toxic_how_can_i_become_a_better_person_and/", "title": "\"I am Toxic\" How can i become a better person and handle my relationship right.", "social_network": "reddit", "user": "MichelTrick", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1634798855, "permalink": "/r/DecidingToBeBetter/comments/qclphd/i_am_toxic_how_can_i_become_a_better_person_and/", "nsfw": false, "first_save": 1635435359.510765, "replies_charged": false}