{"id": "t5_2tand_t3_kskef7", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Hey Reddit! I just wanted to share my progress and hope that it will inspire others to get better. I suffered from PTSD, anxiety, and depression for several years. Prior to the onset of these, I was a VERY happy and motivated person. I’m naturally Type A so my depression and anxiety completely spiraled to constant suicidal thoughts when I was physically unable to be productive. I sought a therapist who was rough around the edges yet still helped a little, but I stopped seeing her when the pandemic started as she was very late to our appointments. Many of my friends who work in healthcare have told me time and time again that I would continue to be unable to cope with my problems if I don’t seek medication. I denied this for so long thinking that I could force myself out of this by sheer will. Friends, that is not the case.\n\nFinally, my SO did some research and found that I could book an appointment online with anyone in the state! Appointments with mental health professionals are very hard to come by where I’m from. However, the new switch to video-only appointments enables patients to see healthcare professionals regardless of location.\n\nMy psychiatrist put me on Lexapro, which I realize is very common, but it has truly given me my life back. I didn’t realize how bad I’d gotten until I stared to feel “normal” again. No more stress and worrying about everything and everyone. No more escalation to panic attacks. And barely any anxiety.\n \nMy mother has been depressed for 25 years and, like me, had little luck with therapists. She lives in a different state but over the holidays I was able to help her set up a video appointment with a psychiatrist 2 hours away. Her journey began yesterday and I’m so excited for her to finally take care of herself.\n\nSorry for the rambling, but if this helps anyone, I know I’ve done my part. Being on medication is okay and sometimes the only intervention that can help you make real progress. If I would have known a 30 minute appointment and $3 for a prescription is all it would take to make this much progress, I would have done this years ago!\n\nCheers to getting better in 2021!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kskef7/with_access_to_video_appointments_now_its_easier/", "title": "With access to video appointments, now it’s easier than ever to seek help. I finally reached out to a psychiatrist and my life has improved dramatically in just a few weeks.", "social_network": "reddit", "user": "birdhike", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1610047080, "permalink": "/r/DecidingToBeBetter/comments/kskef7/with_access_to_video_appointments_now_its_easier/", "nsfw": false, "first_save": 1635435899.286363, "replies_charged": false}