{"id": "t5_2tand_t3_q4rn49", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "This week I have been advising my subscribers on how to prepare for bad luck. There is an old adage that states that bad luck happens to everyone--the difference between those who succeed and those who collapse is how you react to it. That really irritates someone when they are in the middle of an episode of bad luck--myself included. But it is true. You can't keep bad luck from happening to you--but you can prepare in advance. What you do is first look at the worst it can get. Example--last year I was smart and bought oil stocks when it was low--and then it kept getting crushed. I pictured the worst case scenario--the whole stock market goes, banks fail and now I'm with about enough to buy one Big Mac. And I prepared what I would do. Contract out in my profession, live minimalistic like I did when I was a student and build for a decade. If it wasn't enough to retire with social security then move to a third world country. I would be fine and better than my ancestors. And the worst didn't happen---I kept calm, implemented my plan of moving the stocks over to other assets and everything not only recovered but I gained some profit. Not as much as I hoped but I survived and was even better off. So, end point--you see a storm coming, you look for the worst it can get, implement a plan and you will survive what life throws at you. Hope this helps someone--Charles", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q4rn49/bad_luck_how_to_overcome_adversity/", "title": "Bad luck. How to overcome adversity", "social_network": "reddit", "user": "CharlesHurstCanHelp", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1633806019, "permalink": "/r/DecidingToBeBetter/comments/q4rn49/bad_luck_how_to_overcome_adversity/", "nsfw": false, "first_save": 1635435076.7724597, "replies_charged": false}