{"id": "t5_2tand_t3_pkx7pn", "request": ["1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3"], "text": "No matter where I (24M) live, it seems like I have an inability to be happy. I find negative things about places wherever I am.\n\nI was born and raised in Hong Kong. I was in San Diego studying and working for a couple years, but during that time I became really negative about US politics and the US society. Capitalistic, income inequality, how COVID was handled etc.\n\nI missed my family in Hong Kong a lot during that time and thought that going back would solve all my problems so I went back. It was absolutely amazing being with my family and friends for a couple of months. Also got a great supportive girlfriend during that time.\n\nBut as time passed I became really negative about HK too. How crowded it is, high stress lifestyle, mean people etc. Now I think back to how great San Diego is and want to move back. But this seems like a perpetual cycle of the grass is always greener mindset.\n\nA lot of it has to do with me being dissatisfied with my life. Especially my career. Career isn't going well and I'm still figuring things out. Lots of uncertainty.\n\nI'm really not sure what the issue is. Now I want to leave HK but I'm scared I'm just escaping from my problems, and no matter where I go I'll just remain unhappy, maybe unless I sort my career out.\n\nMy girlfriend and I were speaking about our futures, she really wants to stay in HK to stay with family. Part of me does, part of me doesn't see a long term future for me in HK because of how negative I see this place. But what if I go somewhere else and I'm still this way, and I end up losing being close with my family, and my girlfriend all because I thought I'd find happiness elsewhere? But in reality I was just escaping from my problems?\n\nI'm really unsure and anxious. Any input and advice would be greatly appreciated.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pkx7pn/how_am_i_so_unhappy_no_matter_where_i_live_how/", "title": "How am I so unhappy no matter where I live? How much does environment really matter to my happiness, or should it really come from within?", "social_network": "reddit", "user": "TakExplores", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1631191979, "permalink": "/r/DecidingToBeBetter/comments/pkx7pn/how_am_i_so_unhappy_no_matter_where_i_live_how/", "nsfw": false, "first_save": 1635437052.8290088, "replies_charged": false}