{"id": "t5_2tand_t3_o1u1ae", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "Have you taken off your clothes in front of your lover? Have you put your mask down, your ego to the side and swum freely in the sea of uncertainty? Not knowing what would be the other’s reaction, not knowing if you’d be judged, not knowing if you’d be laughed at, simply not knowing. So much work I did myself, so much I did with others, and still I know I am holding back. A part of me doesn’t want others to see my naked soul.\n\nLet me tell you, something triggered me today. I watched this singer with cancer sing and tell a bit of her story, and I remembered someone from my family that passed away a couple of years ago. I was always proud of myself because the last year of his life I wrote him a heartfelt letter on his birthday, telling him what I had learnt with him as I grew up and thanking him for those moments. Today was different, there was no pride in me. Today I cried because I realised I was still holding back. In that letter, in that beautiful letter, I could still have been more open, more vulnerable... I could have been naked. Instead, a part of me was still hiding, it was still holding back.\n\nIn the same way, how many of my relationships are affected every time I’m not able to be emotionally naked? How many of my interactions with others are not as open and free as they could be? How much am I depriving the world from?\n\nI know a part of me is still hiding because I can still feel it. After all the work over the years, an inner child still interferes sometimes with my purest truth. I also see an avoidant, that under high pressure can’t fully face the mirror and still can’t face himself naked. Even writing this text, I still need to be so cautious not to taint it with half truths that either try to hide or beautify what is inside to be expressed.\n\nI’ve always used the space of my romantic relationships to get closer to that truth, just a bit closer to that nakedness, so I could practice swimming in that sea. However, outside that space I struggled, so now I ask myself: what about all the other people? What about the world? Well, I know a part of me wants safety, it craves for acceptance. I can hear it deep inside: “if I only knew that was safe enough, I would…”, “if I only knew what would be her reaction…”, “if I was sure he would smile as I open up”, “if I only knew the sea was shallow and there were no waves''. Meanwhile, I know there’s no joy in swimming in a paddling pool. Meanwhile, there is this desire for surfing that sea, conquering it, and finding peace in it. That’s because inside lives also a warrior and a king. I don’t want to be dependent on safe spaces to express myself, to be me. There are wounds, I know there are wounds, so let me freely show them. If the sea water stings those wounds, let them sting a little bit, let that be a reminder that they are still there. I can recompose, readjust, heal and dive in again.\n\nAvoiding that sea will only lead me to believe that nothing hurts, that I don’t need to swim, I don’t need to show my naked soul, I don’t need to look at it myself. And that, that is more dangerous than the uncertain sea.\n\nToday, I found myself thanking God and the universe for that moment that triggered that deep emotional reaction in me. Triggers can be a blessing and so can be the past. Both are great reminders that can serve us well.\n\nI don’t want to be misunderstood here. I’m in love with deep, turbulent waters and that’s where I want to swim. However, I also recognise that there is always another level of depth, another level of nakedness, and I don’t want to live my life holding back.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o1u1ae/have_you_ever_swum_naked/", "title": "Have you ever swum naked?", "social_network": "reddit", "user": "sergio_santos_one", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1623925829, "permalink": "/r/DecidingToBeBetter/comments/o1u1ae/have_you_ever_swum_naked/", "nsfw": false, "first_save": 1635435565.2353978, "replies_charged": false}