{"id": "t5_2tand_t3_ltc1d0", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "We've been together for almost 6 years. Two months ago he told me he wanted to become a thruple with one of our mutual friends (monogamous dating but with three people). \n\nThe girl is very similar to me. I'm 21, she's 22. We both are bisexual, pale short girls with long curly red hair and hazel eyes. We look very similar, except for that she is quite underweight and I'm not.\nEver since my boyfriend has expressed interest in her romantically, I can't handle being around her. Being around her gives me extreme anxiety and afterward I feel so insecure it hurts. It feels like she is effortlessly cute while I have to try really hard- despite the fact that my boyfriend says I am cuter than her. \n\nIt's giving me more body issues than I already had, especially since she is the type to wear revealing clothing wherever she goes (and looks great!) and while I'm skinny and wear mostly size small, I don't quite have the body to pull off that kind of stuff without looking skanky or feeling uncomfortable. She can pull off revealing clothing and still somehow look great, not trashy. Here's the kicker: she's insecure too. We've both gone through bouts of body dysmorphia. \n\nI've always had trouble making good friends and hadn't found a good one for about 4 years (social anxiety). Finally this girl comes by and is a really amazing friend and it all came crashing down after 9 months when my boyfriend says he has a crush on her. I'm almost afraid to go make other female friends now. I unintentionally started self isolating. \n\nI said no, I didn't want a thruple and I thought our relationship by itself was perfect how it was. It took him a few weeks to accept that it wasn't going to happen (he didn't understand why I wouldn't want to, with us both being bisexual, and sometimes joke-flirting with eachother, but just because I'm bi doesn't mean I want to date multiple people at once). He said he would try to forget his feelings for her. It hasn't happened entirely yet but he is working on it. \n\nI never thought this situation would happen to us and was not prepared. He always seemed like the most loyal person ever. Now I feel like old news, like I am boring even though he denies it. I can't help but think he wanted a thruple because he wanted something new and exciting even though he claims it's because \"she balances us out\". (Which I don't entirely agree with...) \n\nAnyway he says my anxiety and insecurity about the subject has been a \"constant stress\" on him and is \"making our relationship worse\". He says he knows that there are types of people who wouldn't let this sort of thing get to them so much, especially when he said he would try to give up on it. \nHe says I need to find some way to find security in myself, and stop comparing myself to her. I have a slight underdeveloped sense of self so I unfortunately rely on other people for reassurance because my brain doesn't seem capable of reassuring itself- (what do I know, I could be wrong, and then I don't want to reassure myself of something that is not true). Other people's opinions of myself matter to me almost too much. \n\nI want to learn how to be that confident girl who isn't afraid of being replaced, abandoned, lost or alone. I know this type of girl will come off more attractive than the \"what's wrong with me\" girl anyway. I just can't seem to get there. Every time she is brought up I feel jealous and inadequate. I want these bad feelings to stop. How do I work on feeling less insecure? \n\nTLDR; boyfriend and me been together long time. Suddenly boyfriend want thruple with newly found mutual friend. Friend looks very similar to me but skinnier. I am jealous of the way she can pull off clothes so well and always looks cute. This caused my brain to go \"what's wrong with me\" \"why am I not good enough\" basically very insecure. Boyfriend said he would try to forget his feelings for friend but my insecurity is lingering and bothering him. How do I get over insecurity and become confident in myself?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ltc1d0/my_long_term_boyfriend_told_me_two_months_ago/", "title": "My long term boyfriend told me two months ago that he has a crush on one of our close friends & wants to be in a thruple with me and her. It's caused me to spiral into a hole of insecurity and depression. How do I get better? LONG CHONKER OF A STORY", "social_network": "reddit", "user": "brittlebittle", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 41, "down_vote": 0, "creation": 1614386074, "permalink": "/r/DecidingToBeBetter/comments/ltc1d0/my_long_term_boyfriend_told_me_two_months_ago/", "nsfw": false, "first_save": 1635435282.3897269, "replies_charged": false}