{"id": "t5_2tand_t3_nurzse", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "Ive struggled with low self esteem ever since I can remember. I grew up with my parents struggling financially, I was bullied by cousins for this and I was bullied at school for being ugly. At some points I enjoyed the learning part of school but that didn't last long. I got into an emotionally abusive relationship at 19 and although it lasted about a year   I left completely empty and tired. \n\nFew years later and my sleeping habits are bad . I honestly scroll mindlessly through social media A LOT. I am starting to go the gym  and my eating habits arent bad but I could get better at nourishing my body. A lot of my time is sitting around feeling anxious about not having time. Fear of death , feeling depressed and not wanting to be here anymore and then being scared that I'll actually die because I know that I want to be here but I just no longer want to simply exist as Ive been doing. I want to be present and give life my all. \n\nIve been in community college on and off since I graduated HS. I've dropped my fair share of classes. I'd be doing well and then I'd doubt myself and everything would go to hell. It feels as if I have amounted to nothing. I am ironically a psychology major with the goal of becoming a professor / psychologist in the future.  I'd like to think if I make it then other people who struggle like me can too. \n\nI am now  22 , my final year of community college will be in fall and then my transfer to university will be in fall 2022, I have a part time job on the weekends, I recently got my license which I am so proud of. I am trying to celebrate my steps forward without feeling like I am so late at accomplishing them. \n\n\nI struggle nearly everyday with feelings of not being enough for myself and for my family but I am tired of carrying that weight. Although it maybe some time before I truly stop believing that I am going to try. \n\nMy thoughts are all over so Im sorry if it seems repetitive or like I'm going in circles. \n\nI'm going to come back and do an update on how things are going and I know that this time I'm not giving up. \n\n\nAnd if you read this far thank you and any advice you have is welcome! (Also for anyone who feels like i do look into Jordan Peterson he's helped a lot)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nurzse/i_am_in_constant_fear_of_not_being_enough_and_i/", "title": "I am in constant fear of not being enough and I am tired and done with that", "social_network": "reddit", "user": "gooddaytotryagain", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 25, "down_vote": 0, "creation": 1623112465, "permalink": "/r/DecidingToBeBetter/comments/nurzse/i_am_in_constant_fear_of_not_being_enough_and_i/", "nsfw": false, "first_save": 1635438333.6995285, "replies_charged": false}