{"id": "t5_2tand_t3_hnnrvs", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "I am from a rural small town and I moved away never looking back the day I started college. It has been about 10 years since then, and I have had a relatively stable and happy adult life so far. I have recently become more aware of my increasing “just suck it up and deal with it” attitude and am trying to show more empathy towards other people. I know everyone has their own struggles, and just because mine aren’t outwardly visible, that doesn’t give me a right to be dismissive.\n\nOne of my best friends from high school, and someone who helped me become confident in who I was in a very tough time, has had a struggle with drugs (meth, pills, etc.) for as long as we have been out of high school. As soon as she reached a point where I felt she was almost exclusively hanging out with losers, I started blowing her off entirely. When I came home to see my parents, I didn’t let anyone know. When she called and asked me to come visit, I would make up an excuse. Honestly, I don’t regret doing this. I know that the people she was hanging out with have criminal records and have stolen and pawned over people’s property multiple times. I didn’t want to put myself in a situation where I would be robbed or part of a crime that I had no interest in. Last weekend, she reached out to me again, and told me that she is living with her mom again in a town about 45 minutes away from where I currently live. She sounded very hopeful to see me, and something inside me said that I really needed to give her another chance. \n\nI told her that I would come pick her up and show her around the city I live in and my new place. I justified that if I could control the environment, it would be safest. (FYI, I know this was a bad idea, but I am an average-sized man and live alone, so I’m not afraid of her trying to hurt me or a family member, if she was completely off the deep end.) I drove to her place and she called me four times on the way there. I bluntly asked her if I was showing up to a hostile situation, and she said no, she was just ready to hang out. When I arrived, she was clearly high, and I had no idea where I was picking her up from. I found out it was her (ex?)-husband’s mom’s apartment. We came back to my place, and on the entire drive back she played the first 30 seconds of about 100 SoundCloud rap songs. I tried to ask her questions and see how she had been, but I was met with a lot of strange looks and answers to questions that I had asked 20 seconds prior. I was pretty heartbroken by the state she was in, but I stayed patient. She seemed to just be happy that we were together, even if she was a bit manic. \n\nWe get back to my place and it was more of the same. There was a lot of whispering and mumbling. That really concerned me. She was always loud (not in an obnoxious way), upbeat, and confident when we were in high school. She started asking me what medicine and alcohol I had (it was 9am) and I told her truthfully that all I had was ibuprofen and half a pack of white claw. Fast forward a bit, and we’re sitting on the couch talking. I’ve been trying to engage her with questions about how she’s been and she gives very vague answers to a lot of what I ask. She says she wants to watch something on Netflix, but then pauses it every 30 seconds to talk to me. I wasn’t annoyed. I just wanted to talk to her. I expected awkwardness. She went to the bathroom a lot, and I assume she was either taking something or looking through my cabinets while I’m there. I was starting to worry that I was overwhelming her as a blast from her pre-addiction past. This continued the rest of the day. When we went to get food, that the most normal part of the whole day. She talked to me like a normal person and I was genuinely happy to talk to her. \n\nAs the night went on, I found out that she had been arrested, and spent 3 months in jail last year. I don’t know why, and I didn’t ask. She started telling me more, and directly told me that she was a “a total drug addict” at one point. I tried to offer advice sparingly, and tried to listen more than I spoke. I asked her what she wanted, and if she was happy with how things were, and what she planned on doing to change those things if she wasn’t. I’m not a therapist by any means, but I think she was responding well to what I asked. \n\nShe stayed the night on my couch, and I immediately recognized that was a terrible idea. She got up at least every 30 minutes to go to the bathroom, smoke, or drink water and I barely got any sleep. I am working from home at the moment (and she is unemployed), and I told her I was just going to work in the other room at my desk while she hung around. It was a total disaster. I should have taken her home the night before. After a morning of constant distraction, and her drinking from 7am until lunch, I told her I needed to take her back to her mom’s house. It was a bit like pulling teeth, but she eventually agreed. I knew that if she stayed until after I finished work, it would turn into another slumber party. On the ride back, I told her that I really want to see her again, but I want to have a night where we just get together and watch a movie with her mom and her brother, like we did in high school. I told her as politely as I could that I was not going to hang around any of her friends. \n\nOnce I dropped her off, I started to process her situation for the first time. It was really depressing and I called my mom and told her what had happened. Her mom messaged me on Facebook and gave me more details about what had happened over the years and apologized for any bad behavior. I told her that she was fine considering the situation, and that I wanted to do the movie night to try and see her again.\n\nMy friend has since messaged me and thanked me for letting her come over. She said everyone we knew from her old life had cut her off, and I was the first person to welcome her in years. She said she wanted to get better, and move forward. I told her that I was happy to see her, and that I want to continue to see her as she gets better. \n\nSo that’s the situation. I have basically lived like Mitt Romney since I graduated college, and now I’m trying to reach out to an old friend who needs support. I feel like I am drowning in the deep end, and I’m hoping that some of you have more experience and advice on how to help going forward. I feel like I owe it to her if she wants to improve, and if just takes a weekend visit every month or two, it would be pretty selfish of me to give up on her. What do I do from here onward? How do I encourage her without enabling her? How do I help guide her without patronizing from my position of relative „success?“", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hnnrvs/one_of_my_best_friends_from_high_school_is_a_drug/", "title": "One of my best friends from high school is a drug addict and I feel compelled to help", "social_network": "reddit", "user": "OrderlyLife", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1594236799, "permalink": "/r/DecidingToBeBetter/comments/hnnrvs/one_of_my_best_friends_from_high_school_is_a_drug/", "nsfw": false, "first_save": 1635435193.0639658, "replies_charged": false}