{"id": "t5_2tand_t3_q3yo6y", "request": ["1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3"], "text": "I have been suffering from depression since I was in high school. I didn’t recognize it back then, I had just thought that it just wasn’t in the cards for me to have friends, relationships, or interests of any kind. I felt like I just wasn’t meant to be happy. \n\nStarting in college, I realized I might have depression but still thought it was just how I was, and there was no point in changing it. I accepted my fate as it was. My family accepted it too. They were surprised one day when I said I was going on a date. I got the “you??” Feel from them. I didn’t go on the date. \n\nFast forward through early adulthood, nothing changed until a couple years ago when I started trying to date. I had my first actual date when I was 32. Never even kissed a guy before that. We broke up about a year later and he said “I don’t know what’s wrong with you but…” and even though I didn’t love him and I don’t miss him, those words still sting. Because I started to think there was actually something wrong with me. \n\nI am 35 now and still have no friends. I work enough to pay bills and spend the rest of my time waiting for bed. I don’t have happiness or any positive emotions. I either feel sad, angry, or absolutely nothing. I don’t want this for myself anymore. I want to be able to spend time with people and actually enjoy myself. I want friends to do things with, and I want to go on dates and maybe even get married someday. \n\nI hate that I spent so much of my life thinking I didn’t deserve that for myself. \n\nSo I have finally made an appointment with a psychologist. I honestly have no idea what to expect. But I am hopeful for the first time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q3yo6y/after_15_years_of_serious_depression_and_thinking/", "title": "After 15+ years of serious depression and thinking I don’t deserve happiness, I have made an appointment with a psychologist.", "social_network": "reddit", "user": "TooEmbarrassed7", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1633702673, "permalink": "/r/DecidingToBeBetter/comments/q3yo6y/after_15_years_of_serious_depression_and_thinking/", "nsfw": false, "first_save": 1635437052.4580674, "replies_charged": false}