{"id": "t5_2tand_t3_q3m6uw", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "Like everyone else I think, we all procrastinate in life.  Some it lasted 1 day, 1 month, or more for some and they managed to take their life back in hand.\n\nFor me it's been more than 5 years I'm procrastinating, you heard it right, 5 years, where in my life I always say ***\"I will do it tomorrow\"*** then come tomorrow, and I say I will do it tonight, and I do nothing at all ..\n\n I do my homework the day before, or even the same day, luckily I have a good memory which helps me memorize in a few minutes (30m / 1 hour).\n\nBut since a month, I'm taking Chinese lessons online, (I paid for it each weeks) I'm really interested by Chinese language, I'm having a lot of fun, I'm making huge progress in 1 month.\n\nMy teacher give me some homeworks to do after the call, but as always I do it the day before, or even the day I have the lesson..\n\nIt's so frustrating, because If I wasn't in this ***\"mood\"*** in 1 month I could have learned 100 radicals which have could helped me to read characters and understand them better, or even learn new vocabulary. But no, I'm here waiting, and still waiting, It's like ***I'm possessed by something inside me, I can't resist..***\n\nI really want to be fluent in Chinese in 4 years and more, but If I'm following this path for this future 4 years I'm not going to be nowhere and not even \"fluent\"\n\nIf someone has been in this mood too, and got out, I really need your advice because I'm going nowhere like that, I'm just throwing away something I like.\n\n**TL;dr** : I'm procrastinating a lot, and I want to improve my mental to be more consistent for learning Chinese, and in my daily life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q3m6uw/im_procrastinating_a_lot_i_cant_get_out_of_this/", "title": "I'm procrastinating a lot, I can't get out of this mood since 5 years.", "social_network": "reddit", "user": "EarthBees", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1633652077, "permalink": "/r/DecidingToBeBetter/comments/q3m6uw/im_procrastinating_a_lot_i_cant_get_out_of_this/", "nsfw": false, "first_save": 1635436790.0624254, "replies_charged": false}