{"id": "t5_2tand_t3_ph21ef", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I have been working on a creative venture for well over 7 years of my early life.  Much to the dismay of people who know me.\n\nSpending months..years out of that time to help others in their projects because I had grown in my ability to present a scenario I know what I'm doing remotely.. I craved the empty praise I would get from stringing things together.. (Bad childhood!) \nFor others benefit mind you.\n\nSure, I learn and I tried over time but no more than the average hobbyist in this field.\nThe difference is I just have more time.\n\nToo much time!  I grew tired of having no real results for my labour and gave up learning!  Years roll by..\n\nSuddenly I wake up (figuratively),\nMy life is in shambles. (Literally),\n\nI've not been employed since my early highschool jobs, or have any money to speak of.\nI've burned bridges to relationships all along my journey to failure.\nEven cutting off someone who was taking advantage of my free time by using me in their own projects.\n(For 2 years! No pay.. I'm an idiot)\n\nHere I am free of obligations,  instead of going back to my own project and restarting the cycle, \nfor the first time I'm looking at jobs I never considered \"worth my time\"\nand it feels like I'm starting life all over again.   \n\nGiving up,  but it feels good.\n\nIt feels like ive been limiting myself to what is comfortable or what my \"dream\" is and not to settle etc.. And then ripping the blinders off,\nTelling myself no,  I'm not good at what I do remotely enough to be in a corporate setting being paid reasonably.  This is over.\n\nGiving up on my dream but feeling optimistic about it.. Idk how to explain it tonight I'm dead inside but so happy its all over.\n\nI wish it worked out,  still gathering the courage to break it to my parents.\nTheir son is not the next tech genius billionaire building out of his garage who can provide a well off life doing what he loves. \nIts sad, but that's being an adult right?  Being able to cope with loss,  using logic to realize a lacking in ability..  It's time I grew up!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ph21ef/giving_up_to_grow_up/", "title": "Giving up to Grow up", "social_network": "reddit", "user": "EasyyInternational", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1630662772, "permalink": "/r/DecidingToBeBetter/comments/ph21ef/giving_up_to_grow_up/", "nsfw": false, "first_save": 1635435145.5961456, "replies_charged": false}