{"id": "t5_2tand_t3_ff7y6c", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I go to a university where drinking culture is very prevalent. I would be okay engaging with that, but the problem is I have a very nasty side that tends to come out if I drink enough. It's not that I'm violent or rowdy when I'm drunk, but when someone is rude or mean to me I will immediately go below the belt and make that person feel absolutely horrible about his/herself. And I won't quite grasp what I've done it until it's too late. I think I learned this behavior from years of being bullied myself, having my insecurities casually exploited so many times it's practically normalized to me. It's a go-to response for me to hit someone where it hurts when I feel affronted because that's what my bullies did whenever they were irritated with me. When I'm sober I know good and well that this is an absolutely unacceptable thing to do to anybody, but it sometimes the evil words will just slip out when I'm drunk and I hate that about myself. It's so hard to navigate college when I'm constantly being challenged to either alienate myself or risk having my mean streak come out. I'm not an overly experienced drinker so it's difficult trying to learn my limits too. It's so tempting to just say \"fuck it\" and have a drink with the rest of my friends but I don't want to run that risk of causing drama if anything goes wrong. I don't know if it's even possible to train myself to be better at holding my tongue when I'm drunk or even tipsy. I've talked about this to some of my friends and they don't really believe me because I'm otherwise a very soft-spoken, polite person. Or they just think I'm trying to brag about being \"badass\" or whatever. It's not badass to bring a person to tears over the pettiest of things. It's a terrible tendency that could cost me friendships if I'm not careful. I want to try and get better at avoiding alcohol while still maintaining a good social life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ff7y6c/im_trying_to_keep_my_bad_impulses_in_check_tw/", "title": "I'm trying to keep my bad impulses in check (tw: alcohol usage)", "social_network": "reddit", "user": "rattlingoffthoughts", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1583644327, "permalink": "/r/DecidingToBeBetter/comments/ff7y6c/im_trying_to_keep_my_bad_impulses_in_check_tw/", "nsfw": false, "first_save": 1635438283.5135477, "replies_charged": false}