{"id": "t5_2tand_t3_jp0qtj", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I have always been a fan of progression and growth, but I have my moments. I am joining this sub to help leave the past behind since I contemplate a lot about negative moments. I am 17, soon to be 18, and my growth and evolution are pretty good considering my age and condition.\n\n I suffer from OCD, which many think is just about symmetry however, it is much more than that, do your research. Anyways, I starting heavily abusing weed a year ago and it took so long to get where I am now, which is 41 days sober! During that time of the abuse, I would get so high and lose my inhibition and sense of judgment. \n\nI did stuff I will never be proud of. One thing was I sabotaged the relationship I was in at the time. Fortunately, I have forgiven myself for that. The relationship was great, especially before I became so dependent on weed although there was plenty of times I felt the need to end it, even before I became toxic for her, but she was my first everything so it was extremely difficult, part of me also did not want to feel lonely again which is selfish.\n\nit has been 4-5 months since the breakup, and I usually still get sad or sometimes cry when I see pictures of us on my laptop or think of her. However, looking back, we both helped each other grow so much, but we also became too dependent on each other.\n\n **things to stay sharp within a romantic relationship:**\n\n**Speak up if something bothers you, even if you think your partner will react badly or just won't agree, that is okay. What is not okay is if they disrespect you for feeling a certain way about something.**\n\n**Do not just say what you think they want to hear.** \n\n**never try to be the perfect partner for them (a big thing I would do, just adds more guilt if you fuck up)**\n\n**Do more productive stuff together.** \n\n**Be honest/do not hide stuff**\n\n**ASK FOR SPACE WHEN YOU NEED IT! (very important)**\n\n**Keep communication strong**\n\n**List positives to each other could be about the relationship or anything else.**\n\n**Always reassure them during times of insecurity**\n\n**Listen**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jp0qtj/first_post_here/", "title": "First post here", "social_network": "reddit", "user": "JohnTron58", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1604647233, "permalink": "/r/DecidingToBeBetter/comments/jp0qtj/first_post_here/", "nsfw": false, "first_save": 1635436643.5357778, "replies_charged": false}