{"id": "t5_2tand_t3_8gh2bo", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Everybody carry inner conflicts throughout their lives. \nSome are daily and get resolved almost as quickly as they rise.\nSome are more heavy and it takes a lot of time and effort to solve.         \nI think that most people have some sort of \"root conflict\", a main archetype from which most of their other lesser Conflicts arise from.\n\n&nbsp;\n\nMy conflict is that I'm always changing between 2 states of minds and behavioral patterns.  \nThe first one is of order. Where I am organized with a clear view of my goals.  \nA phase of slow and gradual progression. I am rational, making good decisions for myself.  \nEverything seems to go just as it SHOULD...until I start to notice slowly but surely how much I don't like living this Way.\n\n&nbsp;\n\nI begin to notice how \"dead inside\" I'm becoming. I lose my passion for living. I become boring and monotone.   \nI can't write, I'm losing my sense of humor and all creative thought is gone.  \nI notice that all I do is follow good advice. I'm losing basic confidence and generally fear freedom and making Decisions for myself.  \nI feel socially numb and just disconnected emotionally and mentally from the world.\n\n&nbsp;\n\nAnd something snaps in me. A fire beginning to rise inside.     \nI begin to remember how I can be, how I was.  \nAnd very fast and noticeably I change to the state of chaos. To be honest it is my favorable state.  \nI always know what I want, I always do I want and I do everything with intense passion and lust for life.  \nMy charisma is through the roof, I'm decisive, I'm having fun all the time and I radiate confidence.  \nGood things come your way when you're like this - job opportunities, romantic opportunities and generally I'm much More respected.\n\n&nbsp;\n\nWell, there is a negative side to this. I can be very reckless, indulge in self-destructive and hedonistic behavior and Generally don't plan or think too much.\nIn sober self reflective times I begin to fear this total freedom and impulsivity.\nI begin to miss all the rules, the direction, the good habits and the sense of CONTROL.\n\n&nbsp;\n\nAnd so with a calm and determined mind, I walk away from chaos and reform myself once again to order.   \nThe cycle continues endlessly for more than 10 years (I'm 27).   \nI can't seem to mend these two \"personalities\" in me into one. \n\n&nbsp;\n\nI have a lot of friends who are the first type.   \nKinda socially inhibited, analytical, very educated and \"living by the to do list\" personalities.  \nAnd I also have the \"wild\" friends - the people who are a force of nature, the life of the room that maybe need more Structure in their life.\n\n&nbsp;\n\nBut they are consistent. This is just who they are, maybe they like themselves or not..they are still the same archetype they always were.\nI know that this is very dichotomous and every person is much more complex then Simple and  \"fun dumb\" and \"smart boring\".\n\n&nbsp;\n\n\nI know that a lot of people have a very similar/exact sort of conflict, I would be grateful to hear your thoughts on that.\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8gh2bo/jumping_between_two_states_of_mind/", "title": "Jumping between two states of mind", "social_network": "reddit", "user": "SeriousComparison2", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 69, "down_vote": 0, "creation": 1525264631, "permalink": "/r/DecidingToBeBetter/comments/8gh2bo/jumping_between_two_states_of_mind/", "nsfw": false, "first_save": 1635436523.7127805, "replies_charged": false}