{"id": "t5_2tand_t3_hgktme", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "For the past few months, I've been fascinated with the concept of time, and with the recent scientific advancements in the field of logevity. \nDr. Peter Attia, gave an insightful lecture on the topic at MIT's Whitehead Institute, and [here](https://youtu.be/36Twwc3H0uU) I'll broke down the talk, with as little technical terms as possible (and as succintly as possible, too).\n\nTime is an extremely valuable comodity,\n\nThat's why longevity is so interesting to me.\n\nAnd due to exponential advancements in technology and medicine etc, you theoretically increase your chances of living even longer with every additional year you manage to buy. And what's really powerful in this talk is Peter's framework for problem solving:\n\n> When you're trying to solve a problem, always go through the following chain, in order:\nObjective, strategy, and tactics.\n\nSo let's start with the objective:\n\n## **Objective**\n\nPeter divides longevity into two components: Lifespan and Healthspan (but you probably already know what these are, right?), and our objective is to increase the former and delay the decline of the latter.\n\n## **Strategy**\n\nPeter divides the strategy into three parts:\n\n## 1. The study of human centenarians.\n\nMore specifically, how centenarians die:\n\nWe imagine centenarians living with their super protective genes, up until the moment they get hit by a bus. But that's not true, centenarians kind of die the same way we do, just 20 years later.\n\nAnd guess what? All their lucky genes help them combating precisely on these diseases.\n\n> It's not neo in the matrix, but it's a pretty resistant armor vest.\n\n\nSo with that, we can conclude:\n\n> The key to living longer is delaying of the onset of chronic disease.\n\n## 2. Interventions in Non-Humans\n\nBy looking at nature, if we look from yeasts to flies to worms to mammals, which account for around 1b years of evolution, the interventions that seem most effective in helping our objectives are three:\n\n1. **Some combination of caloric and dietary restriction.** Caloric being quantity of food and dietary, some macronutrient, so a low carb diet for example.\n2. **Rapamycin**, which extends life across all this spectrum, by interfering with mTOR. And it's very promising cause it's been the only intervention so far that extended lifespan in male and female mice.\n3. **Metformin** might also be helpful, though not as potent as rapamycin. It's used to treat type 2 diabetes, but it's currently being tested in non- diabetics for longevity potential.\n\nNow the third part of the strategy is what peter calls \n\n## 3. Molecular insights:\n\n- **Nutrient sensing**\nWe didn't evolve in the environment in which we currently live, and the abundance and quantity of nutrients hasn't been with us more than 1% of our history as a species. Peter argues that the periodic withdrawal from nutrients has some benefit to it.\n\n- **Autophagy**\nAutophagy is the process of a cell eating other cells, is essential for longevity.\n\n- **Senescence**\nIn animal models, cutting out senescent cells reversed aging fenotype. Senescent cells are cells that don't reproduce anymore, and \"poison\" other cells nearby.\n\n- **Inflammation**\nResponsible for CVD and several other diseases, the more we understand the science of it the more we can potentially modulate it.\n\n### Tactics\n\nPeter goes on to describe four main aspects of the tactics:\n\n**Nutritional biochemistry**\n\nBasically, the carbohydrate and protein intake will depend entirely on the individual, based on how much they exercise and how well they sleep, manage distress, genetics etc.\n\nBut what we should strive for is to minimize Insulin levels:\nKeep average glucose low and standard deviation low.\n\nEat as many grams of carbs/proteins as your body can tolerate to do it.\n\n---\n\n**Exercise phisiology**\n\nExercise is important for it's metabolic advantage(lifespan). Peter recommends high intensity interval training.\n\nMuscle reduces insulin levels (glycogen storage), to build muscle Peter recommends weight lifting.\n\nInjury prevention exercises like deadlifts are great for back pain prevention, for example(healthspan).\n\n---\n\n\n**Sleep Physiology**\n\nSleep is extremely common, so it must be beneficial. Good sleep migh promote glucose disposal and fight insulin resistance.\n\nAlso improves testosterone and memory significantly.\n\nPoor sleep is associated with increased cancer risk and early death.\n\n---\n\n\n\n**Distress Tolerance**\n\nMeditation is a great tool for distress tolerance, as well as social engagement. \n\nThe point isn't to regulate distress, but manage our response in relationship to it.\n\n---\n\nThank you for reading, tell me what you think!\n\nSorry for the lengthy post, but it's the most succint I could make it\n\n[Full lecture/breakdown](https://youtu.be/36Twwc3H0uU)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hgktme/how_to_live_better_and_longer_mit_lecture/", "title": "How to Live Better and Longer (MIT Lecture Breakdown on Longevity)", "social_network": "reddit", "user": "DrRotger", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1593222724, "permalink": "/r/DecidingToBeBetter/comments/hgktme/how_to_live_better_and_longer_mit_lecture/", "nsfw": false, "first_save": 1635435499.2837653, "replies_charged": false}