{"id": "t5_2tand_t3_p33e8o", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "1a213df6-3f71-466c-9762-ace119e0102e", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "I’ve gone through relationship after relationship wondering why I had these insecurities and trust issues. The way I acted differently towards my girlfriends than I did to my actual friends.\n\nTurns out, it’s all my fault.\n\nI took after my dad. My dad was really emotionally and physically abusive to my mom when I was really little.\n\nI think I might have seen all of that and processed it as what people who love each other do.\n\nI never physically abused any of my gf’s, in fact I was the one often being pushed, slapped, spat in the face…\n\nBut the emotional manipulation I can honestly say I had a hand in that sort of behavior.\n\nI aim to do better. I scheduled a therapy session to discuss how to remedy these types of habits. Unfortunately due to covid, it’s all the way in September. So, I’ll do my best to hang on until then.\n\nI feel as though I won’t find much help on this thread, but I do want to let others know who’ve gone through something similar that you’re not alone.\n\nIt’s okay to realize that you were the “bad guy” all along. It reminds me of the character “Loki” in the Marvel movies. It was in his nature to lie, deceive, and manipulate all his life, but once he realized that he could actually do good in the world, he decided to go against his nature and devoted himself to being the best most positive version of himself he could be.\n\nWe all have that decision inside of us. Whether to use our gifts for good or evil. It’s up to us to become the best versions of ourselves.\n\nI don’t want to be the bad version of myself anymore. I want to spend the rest of my life being generous with my time, love, and happiness. It may be a long road out of this mess, but I’ll do my best to make it out.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p33e8o/just_realized_im_toxic_looking_to_improve/", "title": "Just realized I’m toxic. Looking to improve.", "social_network": "reddit", "user": "angrykumu", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 290, "down_vote": 0, "creation": 1628785784, "permalink": "/r/DecidingToBeBetter/comments/p33e8o/just_realized_im_toxic_looking_to_improve/", "nsfw": false, "first_save": 1635436824.7102637, "replies_charged": false}