{"id": "t5_2tand_t3_d41az5", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "The 5 Why technique was invented by a Japanese engineer for so-called “lean management”, a famous Japanese technology for efficient manufacturing. But it is suitable and applicable for life strategy as well. The idea behind the approach is very simple. If you face a problem - just start asking why it occurs, and do it as many times as necessary to get to the initial cause. \n\nIt may seem too easy, but it is wrong impression. Especially when it comes to one’s life. But let’s start with a simple example. \n\nLet’s imagine a John, an ordinary man from somewhere. John is upset and doesn’t know why. He start asking himself- why? The first answer is obvious - he is upset because his girlfriend (now, actually, a former girlfriend) has split up with him. But why she did that? She said that he was not ambitious, and that was the main problem. She would like to marry a man who has a lot of big plans for the future, because she believes that it is very important for any man. And he has to admit the she was right, he is not very ambitious. But why?\n\nHe had always thought that ambitious people have to spend their life working and struggling for the future. He was sure that one may be quite happy by keeping a low profile. But was he sure or he just persuaded himself somehow? He asks one more “why” and remembers, that in school, when he was just a boy, there were a lot of chances to take part in some activities - in sport, school politics, school theater etc. But he always avoided them. Why? And if John is honest with himself, he comes to a conclusion that he is (and has always been) just not self-confident enough. It doesn’t mean that John has found a solution. But, at least he has detected a reason, which is, beyond doubt, the first and the most important step towards solution.\n\nIt not always goes so smooth. People are rarely honest enough to acknowledge the inner problems they have. That is why psychoanalysts charge so much - they help us “extract” the genuine reasons for our troubles from deep inside.  But sometimes it goes even easier. For instance, one of my customers, a young women, had a plan to loose some weight. But she was not successful. We started asking why together. On the step number two we came to a conclusion that she just elated too much sweet throughout the day. But why did she do so, knowing that it can ruin her plans to become slim? Because it was an easy and “cheap” way to get some hormones of joy and pleasant. She tried to resist the temptation but couldn’t help eating them. But why did she need those hormones so desperately? Because she didn’t get enough good feelings from their ordinary activities. So she decided to change her life and to add some joy to her day-to-day life, and it helped. It became much easier to struggle with the temptation.  \n\nOf course, this simple technique doesn’t help always. It won’t help if a person have a kind of mental disorder. In such cases there is only one solution - to ask for professional help. It also won’t be very useful if one is not honest with themselves. Everybody has their weaknesses, and we have to admit them, to acknowledge that fact, but it is not that easy. But it at least worth trying. \n\nThe number of “whys” is not strict. It comes from the experience of the people who tried it. Sometimes one need’s less question to come to the core problem, sometimes 7 questions are not enough. \n\nDo you feel unhappy? Or, rather, you don’t feel happy? Start asking why. There is a chance you will find an answer. I will tell you more about life strategy on this page and in my podcast - Svyatoslav Biryulin. Life strategy. Don’t forget to subscribe. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/d41az5/five_why_technique_in_life_strategy/", "title": "“Five WHY” technique in Life Strategy", "social_network": "reddit", "user": "sbiryulin", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 16, "down_vote": 0, "creation": 1568440017, "permalink": "/r/DecidingToBeBetter/comments/d41az5/five_why_technique_in_life_strategy/", "nsfw": false, "first_save": 1635437703.318506, "replies_charged": false}