{"id": "t5_2tand_t3_pku0kk", "request": ["1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "78e8a1f4-314f-439f-8f40-daf7a6da355f", "67ce7893-b918-4235-a31e-1de8eda5cfa6", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "24 M, so throughout my life I have never had a girlfriend or even a relationship, have kissed a girl twice but that's it. I have however been friend zoned at least 3 times, and had multiple crushes that didn't work out for one reason or another (usually just fizzled). \n\nThe reason I am giving this backstory is because I used to be extremely self-conscious about it, I felt like there was something wrong with me, I felt a deep longing and was somewhat unsatisfied and unhappy. Every time one of my friends got a girlfriend for the first time I felt a bit worse about myself.\n\nI took a break from girls and liking them about a year ago and focused on my self-improvement I improved:\n\n* My employability (coding skills and projects)\n* My speaking skills\n* My fitness \n* Became more funny and charismatic\n* I started a Youtube channel which I am really proud of (which I had been planning to do forever)\n* I also worked on so many emotional things and understanding myself and my beliefs etc\n* Became more disciplined with things like sleep hygiene and learning\n\nI grew as a person. I slowly felt myself thinking less and less about not having a girlfriend, but I wondered if I still actually cared or not.\n\nToday I realised that I am fine, even if I am alone for the rest of my life I am fine. That doesn't mean I'm going to stop trying to find someone, but I have realised now that either way I will be happy\n\nAnd it was the strangest thing that let me realise this! *I matched with a girl on Hinge and started talking to them alot*, they are great and things are going pretty well so far but I realised today **even if this totally fails I'm still happy**. I love myself enough to not need the validation of a relationship, I still do want it because it's a wonderful thing to share your life with someone, but I'm not less if I don't have it.\n\nI'm in the fantastic position where if things go well I am happy and if things don't I am still okay with it.\n\n**It's liberating to know that I can desire something, and put effort into getting it but not be dependant on the result.**\nIf you have had insecurities like this before I hope that this helps you :)\n\n**You are fine and worthy if you have someone and you are fine and worthy if you don't have someone.** It's not a reflection of your value, it is just a confluence of compatibility, chance and competition.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pku0kk/i_am_no_longer_afraid_of_being_alone/", "title": "I am no longer afraid of being alone", "social_network": "reddit", "user": "ThePerfectLifeYT", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 461, "down_vote": 0, "creation": 1631177643, "permalink": "/r/DecidingToBeBetter/comments/pku0kk/i_am_no_longer_afraid_of_being_alone/", "nsfw": false, "first_save": 1635437070.7995467, "replies_charged": false}