{"id": "t5_2tand_t3_q5t9j4", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "I write this at 06:25 on a Sunday morning. Family sleeping. The world is quiet.\nMy mind, however, is abuzz. So, I’m up and at the laptop, something I ordinarily try to keep to an absolute minimum of a weekend.\nToday, Sunday, 3 October 2021 marks 54 days before I take on contender-unknown in an amateur charity boxing match in front of 1000 odd folk. We go ‘toe-to-toe’ on Friday 26, November 2021.\nBetween now and then, my mission, in essence, is to make every one of those 54 days count.\nThe purpose of this blog isn’t to spew out clichés like ‘make every day count’.\nI aim to offer an honest account of a journey that will take me, a middle-aged father-of-three, through the rigors of a ‘fight camp’ whilst juggling a pretty demanding full time job for the NHS, a part time gig writing about whisky, busy family life and a recent tendency to catch every bug that’s going. (My top priority is to keep well, fit and bugs at bay.)\nI also hope I’m approaching this challenge with a level of self-awareness. Having been going to a local boxing gym since Spring 2019, I know I'm never going to be a skillful pugilist, much the same as journeyman five-a-sider won't make the starting Scotland XI. \nI hope, however, I can acquit the basics, of attack and defence, to semi-reasonable standard - and combine those elements with heart, passion, determination, resilience, humility, belief and energy to make a decent account of myself against whoever I'm matched with.\nI’ve been reading, listening, drawing inspiration from people who’ve walked this path before (at a much, much higher level) and will draw on their wisdom and experience. I hope to introduce you to, and attempt to  capture the essence, of these folks’ message in terms of how it inspires me in this journey - and in life in general. \nThis blog will also probably be a stream of  ramblings. I have read, however, that ‘journaling’ can help you organise your thoughts – the very thoughts prompting me to get out of my pit at 6am on a Sunday.\nSo, here’s the first thought I’m going to pick out of the maelstrom between my ears.\nThere’s a lot written about thinking positive etc.\nOne of thought that’s in my mind is at the polar opposite; the very negative prospect of being wannered, knocked out, summarily dispatched, humiliated, no less, in front of friends and family.\nI have taken solace in a book called The Cus D’Amato mind. Constantine \"Cus\" D'Amato (pictured below) was an American boxing manager and trainer who massively influenced the careers of Mike Tyson, Floyd Patterson, and José Torres.\nCus talks about the character of champions being determined by several key themes. Fear, Discipline, Anxiety, Adversity and Leadership.\nSo my thoughts are really rooted in fear. Auld Cus has a good take on it.\n“You must understand fear so you can manipulate it. Fear is like fire. You can make it work for you: it can warm you in winter, cook you're food when you're hungry, give you light when you are in the dark, and produce energy.”\n\n\n\n\nThere’s my first rambling summed up in one, concise paragraph. \nMy primary aim is to take the fear (one that Cus, reassuringly, states plagues every boxer) and use that as my energy, my rocket fuel. \nToday – 54 days out, I’m heading to the gym shortly and will work on building my leg strength (squats, presses, raises) and some explosive upper body work. Tomorrow evening we’re in the boxing gym in Glasgow at 9pm. \nThere, I’ll get a sense of the room, the guys I’ll be training with - one of whom I’ll be fighting, 54 days from now - and counting . . .", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q5t9j4/taking_on_fear_join_my_journey/", "title": "Taking on fear - join my journey 🥊", "social_network": "reddit", "user": "RhubarbContent9665", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1633949573, "permalink": "/r/DecidingToBeBetter/comments/q5t9j4/taking_on_fear_join_my_journey/", "nsfw": false, "first_save": 1635438171.1085806, "replies_charged": false}