{"id": "t5_2tand_t3_pp4ny8", "request": ["eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "Just a few hours I broke up with him because our relationship has been toxic. I made a whole pro con list and the cons are much longer than pros. Tbh his presence in my life has hurt my self esteem and mental health because of how he’s treated me. He’s never physically hurt me and tries his best to improve. But yesterday he went too far by talking he was embarrassed of me for having no money and that he believed I couldn’t change and get another job. He’s said much worse before, like name calling and uncalled anger over over very petty stuff. But the past few months he’s been better but still his constant doubts and questioning of my value makes me feel horrible about myself. I had to leave him if I ever have a chance of feeling better. \n\nThe bad thing is I still deeply love him and he’s so persistent. He was sobbing in front of me, begging me, saying he wanted to die. He was saying everything he could to try to change my mind. Everyone in my family dislikes him and so do my friends because he hurt me many times in the 11 months of our relationship. They are my rock in this situation. But still, it hurts so much. But logically I know it’s what I need to regain my confidence and be happier. \n\nI know logically too that I shouldn’t talk to him but I am. I promised that if he loves himself finally and gets better I would give him another chance because I’ve seen him change. But I told him only a chance, only a maybe and we would restart dating very slowly. I only imagine this in a few years when we both have everything together. \n\nBut I don’t know if I should even give him this chance.\n\nHe loves me more than anyone else. He talks about all these sweet things about me. But I made it clear that if ever wants me he needs to work on himself away from me since I need to work on myself too.  He tells me he can change and to an extent I believe it since he did get better before. Still I’m doubtful that’s why I tell him maybe.\n\nI’m doubtful because I know how self centered he can be. If something doesn’t go his way perfectly, he gets pissed and sometimes if he’s mad enough at all the people around him, especially anyone close to him. He’s a pessimist and I’m optimistic and sometimes it feels like drained the life out of me with emotional instability. I told him I can’t deal with it, it hurts me too much. And I don’t know if the part of can actually change but I want to see him try. I want him better but it can’t be me to deal with it when I have my own mental health to attend to. \n\nI need to take care of myself but I can’t when I’m with him. I know the break up was the right decision but the pain is horrible. I wish I could just say this too shall pass and move on. But I know need to feel the pain and embrace it. I know it may make me stronger but it’s soo freakin hard. Especially a very empathetic person such as me telling a sobbing man that I need to leave in for a long time or perhaps forever. \n\nI just imagine him crying at home and it hurts. I don’t want to think about it but I always empathize with anyone I talk to, especially more powerfully with people I’m close to. I wish I didn’t feel so much for people but I can’t help it. I care too much. It actually sucks.\n\nI’m 23 and he’s 25 btw", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pp4ny8/i_broke_up_with_my_bf_but_its_difficult_to_cope/", "title": "I broke up with my bf but it’s difficult to cope", "social_network": "reddit", "user": "Jamjammimi", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1631759779, "permalink": "/r/DecidingToBeBetter/comments/pp4ny8/i_broke_up_with_my_bf_but_its_difficult_to_cope/", "nsfw": false, "first_save": 1635437492.6714172, "replies_charged": false}