{"id": "t5_2tand_t3_nficyw", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I guess I should start off by telling my story.\n\nA few years ago I was diagnosed with a chronic skin condition. After trying out many medications, injections, treatments and surgeries I am finally in a place physically that I can call stable. Granted, I still have a few more operations to go but if I compare myself to how I was 2 years ago, it's beautifully shocking how much better I am.\n\nDue to the pain of my condition becoming so severe, I eventually stopped going to school. With all the hospital visits and strong meds fogging up my brain, it was extremely difficult to keep up with the work as I could barely comprehend a mathematical equation. My school wasn't great with giving me any support either, so I felt even more alone. \n\nI am now in Year 10. Next year I will have to sit through the most important exams of my life so far. Exams that will determine whether or not I can get into a college, or have a future for myself. And I am completely unprepared. Every time I am faced with a difficult question or situation, my head always resorts to bad, bad thoughts because I was so sick of constantly trying and yearning for something I thought I could never do, catch up for years worth of studying in which I was so far behind. \n\nBut I realised that this is my one guaranteed life, I don't know if I have anything after this one, or if I had one before this. I don't want to give this up just because of some exams. It's easy going into the rabbithole of \"why me?\" or \"it's so unfair\" but I need to start trying now.\n\nI'm going to get help. I'm going to get tutors and I'm going to put my head down and really try, not for anyone else, but for myself now. I told myself that I owe this to myself. Whether or not I pass or fail these exams, at least I know I tried and that will be enough for me. \n\nMentally, I still struggle to get help. This may be the closest I get to pouring my heart out, but at least I have started somewhere. \n\nThank you for reading :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nficyw/it_is_1933_on_tuesday_the_18th_of_may_i_am/", "title": "It is 19:33 on Tuesday the 18th of May. I am finally starting my journey to be better.", "social_network": "reddit", "user": "c0rpsedr0ol", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1621362821, "permalink": "/r/DecidingToBeBetter/comments/nficyw/it_is_1933_on_tuesday_the_18th_of_may_i_am/", "nsfw": false, "first_save": 1635436987.7904243, "replies_charged": false}