{"id": "t5_2tand_t3_9xidxm", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "Also a reminder to myself. \n\n1)You don’t want money, you want what money can give you. Find out what that is and pursue it directly or find a more efficient way. \n\n2)People are built differently, predisposition, experience, strategies, beliefs. Perception is a subjective matter not an objective one. Don’t take it personally. \n\n3)Business is about providing solutions, products or service. It’s about making people’s lives more convenient or richer. Provide value first then people will willingly pay for it. \n\n4)Find the asymmetries in life and take advantage of it. \n\n5)There are opportunity costs to every decision made, the one most misunderstood is time with people followed by health. \n\n6)Time, money and confidence are synonymous and mostly interchangeable. \n\n7)If you can only love one person in the world, let that person be you. \n\n8)In life, you don’t necessarily need to be happy. You need a purpose. \n\n9)You can’t control the results of your action, you can only control your efforts. \n\n10)Quitting and saying no are important and valuable skills that are not only uncomfortable but frown upon in society. \n\n11)You have a choice. Not making a decision is a choice. \n\n12)Your biggest detractors are usually the ones closest to you. Don’t reveal your plans. Work them in silence.\n\n13) Oh and also, remember that everything in life is impermanent, the good and the bad. \n\nEdited: Previously I thought “be grateful because it can always be worse” is something we should keep in mind as we never know when someone or something we currently have will be gone. I gave it some thought and changed it with something similar but more useful frame of mind to help in life. \n\nEdited: point number 3\n\nEdited: Elaboration on point number 4. Taking advantage of the asymmetries in life is in reference to risk/reward. Certain things provide high reward for little risk. This is very much emphasized in investing in stocks but I believe can be applied to everything else in life. You could also call it working smart or being a contrarian. An example would be lifting a Boulder with your bare hands rather than a lever. Risk involved is injury. Reward is successfully moving the boulder away from say an entrance/exit.There are lots of asymmetries in life when it comes to opportunities.\n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9xidxm/just_a_few_of_the_nuggets_of_wisdom_ive/", "title": "Just a few of the nuggets of wisdom I’ve accumulated and wanted to share with y’all. Hopefully it’s beneficial.", "social_network": "reddit", "user": "simply_ed", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 519, "down_vote": 0, "creation": 1542338699, "permalink": "/r/DecidingToBeBetter/comments/9xidxm/just_a_few_of_the_nuggets_of_wisdom_ive/", "nsfw": false, "first_save": 1635435431.1857612, "replies_charged": false}