{"id": "t5_2tand_t3_bvdc5v", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "\n\n**Monthly Challenges Background Info**\n\nInstead of year-long New Year Resolutions, 2019 has seen the adoption of monthly challenges for me and a rather decent chunk of my friends. This month was Meditation May, before that was No Profanity April, and I’ve done No Snooze, Stretching, and some other months. \nWorking together with friends to hold each other accountable has been very rewarding. It’s a fun socializing adventure, and it’s fun to compare perspectives throughout the month and explore differences in people’s experience. \n\n**Overarching Purpose to Joyful Jubilee June**\n\nThis month is basically a month of positive expression. It’s an attempt to curb, stall, and remove negative language, negative framing, and be extra mindful of analyzing events with the silver lining in mind. It’s simultaneously something that requires active consideration in reducing automatic negative expressions and in actively encouraging positive framing at all times. \nThere’s an [abundant amount of research](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4161121/) that frames optimism as a physical, emotional, and mental benefit, with optimists living longer, earning more money, having more energy, having more friends, and feeling more purpose and contentment in their lives. \n\nThis month will be challenging in particular because the world is often a negative place, and negative is not only natural, it can actually be pretty healthy sometimes. That’s why this challenge will sometimes feel artificial, sometimes be strenuous, and sometimes force us to work against our natural reactions and genuine feelings towards something.\n\n**Structure and Examples**\n\nI’ve got some structure that I plan to utilize for myself, but as with any month that I am pitching, all are welcome to make any adjustments that they so desire, as long as they commit to something consistent and hold themselves accountable. \n•\tNo negative expressions: No negative comments, complaints, or negative feedback allowed. You can’t say badmouth anyone, diss on anyone’s outfit, criticize media or experiences haphazardly. You have to find the “positive language” variation of said expression. Saying “This is bullshit” during a game of billiards. Re-frame to say “I’ll do better next time.” \n•\tNo complaining: No room for personal frustrations being expressed about the environment, oneself (no self-depreciation talk), or about failures. Comments like “Damn I’m hungry” become “Food sounds lovely.”\n•\tNo sarcasm: Sarcastic comments include either negative language, or a negative tone. Pretty hard to not have sarcasm play out like a backhanded joke, and I’ve yet to discover a genuine positive framing towards sarcasm. \n\n**Exceptions:** \n\nBecause negative feedback is a reality at work, during intense interactions, and in life in general, there should be a way to request a space for “real talk”. For instance, I write movie reviews, and I’ll be mindful to frame most of my reviews as very positive, but I’ll have to specifically identify I’m about to provide negative feedback about something. \nIf needing to engage in “real talk” with a partner that is getting a bit serious, directly communicating a need to discuss something heavy for 5 minutes can create a safe space for negativity apart from consequences. \n\n**Consequences:**\n\n For this month, I’m going to apply 3 gratitudes to any negative statement or expression that is uttered. The punishment aims to undo the negativity by adding positivity, specifically about what that negative statement focused on. “Her shoes are grimy” can be undone by calling out that negativity, then stating “I hope those shoes make her happy. At least she has footwear. And she’s got a dope attitude when she wears gear like that.”\n\n**TL;DR**\n\nJoyful Jubilee June is all about being mindfully positive. It’s about reducing negative expressions, complaints, and instead peppering more positive comments in your life. It’s about love, and warmth, and being hella fuckin’ gooey to yourself and your loved ones. It may be a little fake, a little forced, and a little arduous at first, but hopefully it leads to genuine positivity soon enough. Let’s give it a shot, homies!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bvdc5v/joyful_jubilee_june_a_challenge_month_of_positive/", "title": "Joyful Jubilee June - A Challenge Month of Positive Framing, Sweet Expressions, No Complaining", "social_network": "reddit", "user": "Hyperbole_Hater", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 28, "down_vote": 0, "creation": 1559339145, "permalink": "/r/DecidingToBeBetter/comments/bvdc5v/joyful_jubilee_june_a_challenge_month_of_positive/", "nsfw": false, "first_save": 1635437321.852834, "replies_charged": false}