{"id": "t5_2tand_t3_muhg8l", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "Sorry, this is going to be a long post.\n\n\nI'm (24M), depressed as shit, very much into alcohol and I hate myself a ton, despite being very much selfish lately. I can be caring to the people I care for, when I want to be caring, and I tried hard all my life. I always struggled with depression and hated myself, but I was always an optimist and tried to find myself, find happiness, etc. I think one of my biggest faults is trying to find those things in others. I do go to therapy and I'm currently weaning myself off the SSRI paxil.\n\nIn the past month, I've drunkenly and loudly spoke incredibly serious and cruel shit of my father to my sister, behind his back. He was in the yard, taking a time off of work, and listened to it all. We cut ties that day, I've stopped working with him and I'm now living with my mother.\n\nThe relationship was struggling a lot because of ideological, lifestyle differences (political stuff, perspectives on the pandemic). I'm very much aware of the cowardice of talking incredibly heavy things behind his back. He fucking cried, and I laugh when I think about it, like if I got back at him. It's not funny at all, I don't know how else to cope. We don't talk anymore.\n\nThen I started joking about it a few weeks later to a friend, and she (rightfully) wasn't entertained. She said she couldn't support me being self destructive when drunk. That I should stop drinking. I got really offended and said that I had the guts to confront him, that they always told me to do that someday, and I said things like the fact that I'd cheer her on if she did the same to her grandmother, which made her life hell. Things just got uglier, and we don't talk anymore. I wasn't drinking that day, but then I did shortly after, to cope.\n\nSaturday I cut myself. I never felt like doing that much. Felt terrible. I felt dirty.\n\nSunday I ordered 4 beers and while I was drunk, I was invited to my baby cousin's birthday for next saturday, a cousin of my father's side. I've been avoiding them constantly and I got extremely annoyed at the prospect of seeing them again. They're not abusive, they're good people. I sadly cannot stand my father or his part of the family. I said I was going. That turned my mood to shit. I acted very rude with my mother after that.\n\nWhile drunk, I deleted months-worth of chats with my ex. She treats me wonderfully, always tries to catch up on me, and I couldn't deal with the fact that she is happier in another relationship. I feel inadequate, I feel like a lesser man because of that, lesser than her current boyfriend. I know how rotten this is to say. How utterly lunatic. So I deleted all the chats to not have to look at a happier time anymore. And deleted it for her, too, for reasons I'm not sure. Hurting her is the only option that sincerely makes sense. Getting her attention with something terrible. My other ex did the very same thing to me, and in that angry moment that seemed like the one thing to make me feel better. It didn't, obviously. It felt like shit.\n\n\nToday my ex realized that I deleted the chats and felt terrible. She was meaning to invite me to watch movies on discord with her this week. She felt betrayed, treated like less than human. I listened to her and agreed with everything she said. A loving person doesn't do that. A friend doesn't do that. Agreeing seemed to make everything worse, but I much prefer owning up to my mistakes than pretending that was a fluke, that only the alcohol was to blame, I don't need her sympathy, but I need to make up for the damage I've caused. She said it seemed like I have no remorse, but I do, but it's not fair to ask for forgiveness with empty promises. I don't want to lose her friendship, but I sure did done the work to burn that bridge. It's clear there's no trust between us anymore. It's clear I was an agressor. I need to be better.\n\n\nI'm tired of hurting myself and hurting others. I'm very much aware of the shit I do, letting anger get the best of me and mistreat people who were trying to help, who were there for me. I'll take a time off computers and social media, try bonding more with my family, only use the computer for working, at least for a bit. I really want someone else's input. I don't want validation. I want to get out of this hole. I want to be better, and I really don't know where to start.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/muhg8l/ive_burned_bridges_with_people_who_care_deeply/", "title": "I've burned bridges with people who care deeply about me. Self-destruction is my addiction.", "social_network": "reddit", "user": "drontoz", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 95, "down_vote": 0, "creation": 1618888515, "permalink": "/r/DecidingToBeBetter/comments/muhg8l/ive_burned_bridges_with_people_who_care_deeply/", "nsfw": false, "first_save": 1635435861.7916176, "replies_charged": false}