{"id": "t5_2tand_t3_lmuki0", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a", "8461abc5-2740-47d4-9b1f-f9a34c328cd4"], "text": "They say follow your passion. The question I often ask myself is how do you know when you have it?\n\nTrust me – I’ve thought a lot of about this question and have taken action to seek answers. I’ve done different things in my life in an attempt to answer it. I’ve worked as an analyst, volunteered in NGOs as an English teacher, read an array of self-help (finally realising they say the same thing: just effing do it!), travelled extensively. I even booked a week’s worth of annual leave to find the answer. I mean…wtf…really? Who does that?! Who uses annual leave to figure out their passion? Clearly someone hell-bent like me.\n\nEven when I was in Thailand, I thought I’d get some guidance from talking to a Buddhist Monk in a monastery. That didn’t go down so well when I realised that the monk was gay and was attracted to me – a straight male. He had his own issues since there’s stigma of being a gay monk in a monastery. Long story short, I was the one who ended up giving advice to him. How ironic...\n\nAnd I don’t know if other folks feel this way, but I get jealous of those who already know what their passion is (grrr! I envy you and at the same time happy for you that you are not dealt with the curse).\n\nI mean how is it possible that we go through education all the way up to university and we still end up confused? It makes me reflect on why I even became “educated?” Was it only a means to conform to a system?\n\nI still feel there is a gap in our education system that’s not correctly addressing the issues on the topic of finding passion and inevitably leading us to have this inner conflict (btw…I haven’t attended any educational establishments since 2008 so perhaps there may have been changes since then.)\n\nAnd so, In our quiet moments of contemplation (or even desperation), we get curious in seeking answers and hence we resort to the internet, blogs, online forums (cheers Reddit!). We gather, assimilate a whole range of perspectives coming from all over the world.\n\nNaturally, it’s cost me time, money, anxiety, and sleepless nights. I guess it’s all part of the journey. It’s come to a point now where I’d share what I’ve learnt along the way. Below are some things that I’ve learnt from direct experience on this topic.\n\nThe pressure of finding your passion is absurd. Who is to say that we should know the answers right away? For some reason, I think we’ve been duped into believing that we’re meant to know what our passion is overnight or in a few months. I’ve come to realise that passion is more of an unfolding. The acorn doesn’t become an oak tree overnight.\n\nA willingness to explore new things in the direction of your excitement or curiosity, or some feel good emotion. If something excites you, then act on that excitement. Words that have stuck with me are: “follow your highest excitement to the best of your ability with no expectation of the outcome”. I’ve always been curious about travelling, consciousness, and spirituality. The more I focused my energies in these areas, the more excited and intrigued I became.\n\nListen to your intuition. It’s your unconscious communicating to your conscious mind. If you have a strong hunch about something, explore it with an open mind.\n\nShow some TLC to the 9-5. We all need to be practical and sustain our daily lives. We all know the regular 9-5 job has got some stigma around it. Yet, I take a different view. There are valuable skills we can learn like teamwork, communication, management, etc. Also, there were times where the 9-5 was exciting since the people I worked with were fun to be around (cracking lame jokes, socialising after work etc, creating good times). The people you work with can make a difference even if the work is mundane.\n\nSometimes in the 9-5, we can find stuff at work that captures our interest and puts us in a flow state, and passions blooms from there. From my experience, messing around with data and spreadsheets got me into that flow state (holla if you need excel help). When you do find your passion and decide to pursue it full time, then such skills from the 9-5 are useful.\n\nGet out of your head. I spent too much time thinking about stuff in my head, reading as much information I could. I even came full circle and noticed I was reading the same stuff all over again. Taking action and getting the first-hand experience of something gives better discernment if something vibes with you or not. So, if you’re curious or excited about something, give it a go. In my experience, through taking action, I noticed my own inner conflicts and egotistical nature in my psyche. Taking action brings these conflicts from the unconscious mind into conscious awareness like a bubble rising up from the depths of the ocean. It makes us aware of all the emo stuff we need to deal with.\n\nEmbrace the mystery of finding your passion. The mystery of the unknown keeps us curious, keeps us seeking. I mean what would life be like if all the mysteries were solved? Sherlock Holmes wouldn’t be needed, and on a sadder note, we wouldn’t even get to say our favourite phrase *no shit sherlock!*\n\nWhat activities did you enjoy when you were a child during the imprint period (0-7 years)? This can shed some light. Playing with Lego was my thing. I would build houses, spaceships, cars, and megastructure’s (then I would smash it all to pieces just for the fun of it). Putting things together and building things. I do the same thing as an analyst – it’s just putting different data sets together and getting insights from the data. In a professional working environment, if I were to “smash” datasets to pieces, I would probably get fired (touch wood…hasn’t happened).\n\nBe mindful of social media and its affects. Not something new. We all know this intellectually. Yet, there can be repercussions on the mind at the unconscious level. For some people, it makes no difference, but for others it does. How you react is all that matters. I got content overwhelm…sometimes I still do. I feel like the content out there of selling success in news feeds, insta posts, and blog posts; created more anxiety and a sense of urgency in finding the answer, stressing me out even more, as if it was a like some race to reach the end. But then I asked: why rush? I like instrumental music, especially when it’s performed live in an orchestra.  There’s form, elegance, and a beauty in it. The musicians are fully immersed, in the present moment, and enjoying the process. They are in no way rushing to the end (I mean…can you imagine if they did? How effed up the music will sound!)\n\nI travelled for less than a year as this was something I really wanted to do. I longed for adventure, exploring, trying new foods, and learning about new cultures – all the things that got me excited and curious. I kept a travel journal to capture my memories, experiences, emotions, the highs, the lows, the people I met, and my thoughts. At the end of the trip, I wrote down my reflections on the whole journey, recounting all my learnings and experiences, and in my concluding paragraph, I ended it with the following phrase:\n\n*“The more you cling, the more you push it away, the more you let go, the more it comes back to you.”*\n\nIt’s like a paradox. A paradox will remain a paradox until you get a new perspective which breaks the illusion of the paradox (I feel this comes with experience in the playground of life. *Make sure you go on the monkey bars! mega lolz*).\n\nWhat the concluding sentence meant for me was this: let go of the clinging to the idea of finding your passion (I used to have this image in my mind where I imagine myself saying This is it with a feeling of elation!), or using the conscious, rationale mind to conform to your will.\n\nOnce you stop striving, the mental energy – that was one used to chase the image of you finding your passion and created by your ego or even defending your ego – has now been freed up. There is a kind of mental release, or a pressure off your shoulders. When that happens, consciousness works in mysterious ways and strangely enough when you let go of the need, you then start to see magic happen. Trust the process and have awareness as the events unfold in your life.\n\nThis doesn’t mean to say not do nothing and expecting something will happen. Some form of action needs to be taken to kickstart the process. Otherwise, how will you know what you vibe with?\n\nI like to think that passion is not something sought overnight. Rather, it’s something that it is grown just like the gradual blossoming of the lotus flower. Nature has a superior intelligence that we humans still can’t fathom. Nature doesn’t rush itself. The human organism is part of nature. Therefore: why rush - knowing that we are blossoming too.\n\nI hope these words find you well\n\nReflections from a seeker.\n\nIG: alwaysbeseeking", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lmuki0/im_done_with_finding_my_passion_my_experience/", "title": "I'm done with finding my passion. My experience going down this path thus far (long read)", "social_network": "reddit", "user": "seeker_258", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1613675526, "permalink": "/r/DecidingToBeBetter/comments/lmuki0/im_done_with_finding_my_passion_my_experience/", "nsfw": false, "first_save": 1635435908.5017, "replies_charged": false}