{"id": "t5_2tand_t3_fnpzze", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Tl:Dr; Being afraid means you're about to do something very brave. Get that one thing done, and the next thing won't be nearly as terrifying. Lay down one brick every day and you'll eventually have a brick wall. \n\nFor anyone who's a fan of the franchise, positivity and Kratos are two things that wouldn't normally be synonymous with each other. However, ever since the latest installment of God of War {4} (Dad of Boy), he has had his moments of being a sparkling beacon of wisdom. And a skull-crushing maniac. But we're here for the wisdom. \n\nSpeaking of, about midway through the game Kratos and his son Atreus will find themselves trapped in a cave with a giant orge-like thing (or was it a Golem?). At first, Atreus wanted to fight it whereas Kratos simply wanted out of the cave, but after seeing its destructive powers, Atreus shied away from it. Upon noticing this, Kratos and Atreus have a dialogue that includes these lines: \n\n \n\n>**Kratos** **:** We will fight it.  \n>  \n>**Atreus** **:** Why?  \n>  \n>**Kratos** **:** Because you are afraid of it.\n\nWhen I first heard this I had to pause the game and sit there for a second. I needed a moment to fully grasp the wisdom in what I just heard.\n\nI am someone who grew up with social anxiety. When I was a child and my own father would talk to people I didn't know, while I was still small enough, I would just hide behind his legs until he finished his conversation and we left. He would try to introduce me to people and I would just wave from behind his leg then go back to hiding. He never once placed me out in front of him. The results of his complacency with my impartial attitude with people and social situations would later manifest themselves in my adolescent years and younger teenage years. I would often opt-out of events I really wanted to be in if I found out too many people were involved. I didn't know how to talk to people or engage a conversation for the longest time. I still had friends, but only if they initiated anything with me first. I never went out and made friends on my own until much later. \n\nThis is not my father's faults nor am I trying to blame him. As far as I am concerned, he is the number one dad in the world. However, the fact remains that I can't help but think how I might have turned out if my dad had pushed me out into the thick of things so that I might earn a bit of bravery every once and awhile. Regardless, the point I am trying to make is that this action from Kratos and what his words represent was so profound to me that it sparked a sense of great self-awareness that has followed me ever since I heard it. \n\nWhenever I become self of aware of my own cowardice to approach ANY task whether it's a social situation, a chore, or a task in my profession, I am reminded of this scene in the game. If I notice even the slightest reluctance or hesitation in taking in action, I force myself ahead throwing caution to the wind. That tiny part of me that would rather procrastinate or shy away from what I'm about to do is stomped out by a feeling of \"Well now I **have** to do it.\" \n\nThis is has been an incredibly beneficial stance to take in life. It takes a shit ton of discipline to master at first and can be incredibly uncomfortable, almost feeling impossible. Learning any new skill feels this way. But after enough persistence, it just becomes a part of you. You don't even have to think about it after a while. No more second-guessing yourself. You have given yourself a platform to live your truth and to be yourself. No one can take that away from you once you have it. Just by having a bit of self-awareness about the things that scare you, make you uncomfortable, or seem too difficult to take on, gives you power. Power to change. Power to decide...decide to do better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fnpzze/a_positive_mindset_i_adopted_from_the_god_of_war/", "title": "A Positive Mindset I Adopted from the God of War, Kratos", "social_network": "reddit", "user": "Killerbee442", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1584991048, "permalink": "/r/DecidingToBeBetter/comments/fnpzze/a_positive_mindset_i_adopted_from_the_god_of_war/", "nsfw": false, "first_save": 1635436067.6189797, "replies_charged": false}