{"id": "t5_2tand_t3_j1iigv", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Last week, a few days after my first therapy session, I had a conversation with this Asian girl I was classmates with back in highschool, asking her to do a little exercise my shrink told me to do with people I trusted. It's purpose was to help me develop my eloquence, and I trusted she would forget about it. \n\nShe was like \"You picked the wrong guy. You don't have any friends?\"\n\nThen it hit me. How many friends do I actually have? I don't really have anyone. I used to have many friends back in my teenage years, but they all left far away from here. I don't trust my family to do this exercise with them either. They are really judgemental and quick to blame my shortcomings on \"not focusing on college\".\n\nActually, speaking of college, I don't feel close to anyone there. My other colleagues talk with each other, hang out at the end of the day. I don't see myself approaching them without embarrasing myself. And on top of that, whenever we have team projects to do, I am everyone's last choice. Please note, I don't consider myself better than them. On the contrary. Their performances greatly exceed mine, academically speaking. They have part-time jobs, while I struggle to find work anywhere in my city. And every time I think about that, it makes me wanna swap my brain with one of theirs.\n\nI only have my brother, my girlfriend, and that's it. They are the people closest to me. Don't get me wrong. It's really nice to be by yourself, do what you want and not give a damn about anyone but yourself. But sometimes, this is too much for me to take. Lately my sleep schedule is all over the place, I started binge eating again to put that fire out. \n\nIt can't be my appearance or grooming. I take care of myself as well as I can. Even going the extra mile to make sure my face is pleasant to look at. The only thing I hate about myself is my weight and that my facial hair isn't completely gone when I shave. It made me want to quit shaving and embrace the beard, even though I hate having a beard.\n\nThis feeling I have cuts the mood for me to do anything I enjoy. I'm not in the mood to play any video games, or watch anime, I'm not in the mood to cook anything, I'm not in the mood to read any books, and going outside is out of the question. It rains buckets today. All I can do is just ask myself \"Do I have an actual reason to live?\"\n\nMy birthday is soon. I'm turning 21 this October, and I don't expect any calls or texts from anyone. Not even my family. \n\nWhat is wrong with me? Why do I feel this way? I can't explain this.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/j1iigv/i_just_realised_how_lonely_i_am/", "title": "I just realised how lonely I am", "social_network": "reddit", "user": "M2-99-ROU", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1601320058, "permalink": "/r/DecidingToBeBetter/comments/j1iigv/i_just_realised_how_lonely_i_am/", "nsfw": false, "first_save": 1635437678.0965607, "replies_charged": false}