{"id": "t5_2tand_t3_oyfix8", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "Hello, so background on what I am aiming for. I’m trying to be better and in that process i’ve been constantly researching and planning however i keep failing on execution. One example is for my daily routine. \n\nMornings\nIdeal: I wake up an hour earlier during so I can meditate, yoga and shower. \n\nReality: Even with my countless alarms placed at a distance i have this tendency to wake up only to turn off the alarm and then go back to bed. Only a voice by someone at home will wake me because it means i’m late and i can’t afford to sleep more. I do this only partially awake so sometimes i can’t control myself. \n\nPost Work\nIdeal: I end work on time and If i’m not able to sneak in the yoga in the morning I’ll do it at 6 pm with some exercises before showering.\n\nReality: That at most i feel like i only have 30 minutes for? And even then i can’t seem to find the time to do it because i extend work. Shower takes at most 10-15 mins while my hair wash day is at 45-1hr given the curly girl method so sometimes i have to sacrifice exercise on wash day.  \n\nPost Dinner\nIdeal: I get to divide my time equally to socializing (Valorant/book club), my hobby (reading), learning (currently VBA/Analytics and Investing) and building skills that i can later on leverage for a 2nd source of income. \n\nReality: I can’t seem to fit all of the productive stuff before my entertainment/socializing time. And when i do get to study, I don’t feel it’s effective and i’m just basically reading some stuff without actually gaining anything. \n\nSleep\nIdeal: I sleep latest at 11:30 PM\n\nReality: I somehow always end up mindlessly scrolling through tiktok, reading self help posts or watching another episode until 1:00 AM\n\nSorry about the long wall of text, TLDR is basically the title. I just feel i’m not as productive and accomplished for my age.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oyfix8/how_to_instill_discipline_or_get_out_of_research/", "title": "How to instill discipline or get out of research paralysis?", "social_network": "reddit", "user": "kistunes", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1628162694, "permalink": "/r/DecidingToBeBetter/comments/oyfix8/how_to_instill_discipline_or_get_out_of_research/", "nsfw": false, "first_save": 1635437219.5588055, "replies_charged": false}