{"id": "t5_2tand_t3_kz0won", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "I want to take a break/leave my life for about 6 months at least, I’m currently in college but im more and more realizing that this isn’t for me, since I already changed my major once. I recently turned 23 and am nowhere near to finishing college and rather close to having a burn out. I dont feel right, stopped talking to my family for over a year even tho im still living at home. Can’t get out of my bed for weeks (more like months) and am just unhappy in general, can’t find any joy in anything. So the idea of leaving my current life in western europe for a couple of months and moving to a little apartment in the Mediterranean my family owns came to my mind.\n\nThe biggest problem that occurs to me is: I need to start making money online without any real skills, 400-600 $/€ would be enough. But not with braindead jobs like surveys or anything. Does anyone know a subreddit to post this in?\n\nIn my time off I thought about getting more in touch with the nature ( plants, etc) {subreddit?}\n\nStart working out {subreddit?}\n\nRead a lot of books to improve my mental and physical health and also my knowledge and maybe go into philosophical stuff {subreddit?}\n\nThere are so many more things in my head but since im close to burn out I can’t sort them and tend to lose my overview instantly, but I hope u got the idea of what I was trying to say so if anyone knows subreddits that could find, please let me know.\n\nPS: you might’ve realized already but I’m new to reddit", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kz0won/i_want_to_take_a_breakleave_my_life_for_about_6/", "title": "I want to take a break/leave my life for about 6 months at least", "social_network": "reddit", "user": "onjol", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1610863731, "permalink": "/r/DecidingToBeBetter/comments/kz0won/i_want_to_take_a_breakleave_my_life_for_about_6/", "nsfw": false, "first_save": 1635435450.0249326, "replies_charged": false}