{"id": "t5_2tand_t3_p5ahko", "request": ["18281d65-fa68-4991-a4a1-8f37346818f3"], "text": "I’m not a people pleaser in any sense, at least that’s what I think. However, sometimes, I feel like my happiness hinges directly on the people around me, regardless of whether the feeling is directed at me. \n\nThere’s this tense atmosphere that pervades my home and simmers under the surface of a decent family life: disagreements, grudges, regrets and all that other stuff. Despite how cheery the family looks like at face value, I can’t shake off the underlying negative emotions that run through the house. I’m not too sure whether it’s hard to be happy being in the family, or it’s just hard to be happy for me overall. \n\nWhen my mother gets mad at my brother for screwing up his tests, my mood gets affected too. I still get affected by the fact that I didn’t get into medicine 3 years ago; not because it’s my lifelong dream, but because there’s this feeling of disappointment and “settling for less” I feel in my parents. \n\nI’m not too sure how to generate happiness by myself. I feel like if I go about trying to be happy when everybody’s sad, I’ll end up looking like a fool who can’t read the atmosphere. I feel like I need some external source to affirm my happiness and reflect it to me in a feedback loop, otherwise I can’t stay happy for long, and I’m not too sure why.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p5ahko/how_can_i_be_happy_without_the_input_of_outside/", "title": "How can I be happy without the input of outside people?", "social_network": "reddit", "user": "electricloogaboo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1629095155, "permalink": "/r/DecidingToBeBetter/comments/p5ahko/how_can_i_be_happy_without_the_input_of_outside/", "nsfw": false, "first_save": 1635437106.232681, "replies_charged": false}