{"id": "t5_2tand_t3_cyjmw3", "request": ["8461abc5-2740-47d4-9b1f-f9a34c328cd4"], "text": "Two years ago, i was slowly overtaken by depression.  I was staying in all weekend and constantly trying to play catch up on my school work. My libido dropped down to zero along with me sense of self worth.\n\nOne year ago I landed my dream internship.  Imposter syndrome and a constant sense of numbness made it impossible to appreciate.  The loneliness from leaving my friends behind only made me spiral harder. \n I thought all the people trying to become friends with me secretly hated me and my defensiveness made others uncomfortable.\n\nEight months ago: Despite being asked to return to my dream job after graduation, my depression reached a head. Visiting my best friend and my family didn't even give me temporary reprieve. I couldn't stand to look at myself in the mirror. I found myself visiting the tank of nitrogen I planned to kill myself with. I knew this was unsustainable but I didn't know how to change it.\n\nFive months ago: I'm still constantly behind in my work.  I almost never finish school assignments and do the bare minimum to graduate. My friends take me shopping for graduation clothes. I put on a dress that made me feel like a pixie.  With my unwashed hair in a permabun, I almost look elegant.  I don't buy any dresses that day, but I do get a pair of trendy shorts I feel really excited about. I wear it to go out with my friends and for the first time in years I feel like just another human.  Like an equal who has value.  It only lasts a day, but I realize my life could be better.  I book an appointment with the school psychiatrist.  I finally have hope.\n\nThree months ago: The lexipro I was perscribed is begining to kick in.  I also recently found I CBT work book and am makeing time twice a week to work through it.  I keep a log of my automatic thoughts and begin challenging the thought patterns keeping me down.  I meet a guy through a friend group I skim the edge of.  We danced, he piggybacked me through the city streets, and i fell asleep cuddling with him.  He later rejects me, but I feel ok.  I'm finally stable enough to like someone more than they like me -- and still like myself afterwards.  I'm excited to find someone who will like me back and I feel hope again. \n\nNow: I'm back at my dream job.  I recently got 3 new projects and I feel valuable.  Looking back at the work I did over my internship, I realize I was a really hard worker.  I understand my place on the team and I feel proud of myself.\n\nI found the most amazing housing, sharing a house with the sweetest elderly lady.  We share dinner at least once a week and talk constantly.  I've found kinship with several other neighbors through dog sitting, gardening, and just stopping by for a chat.  I through a housewarming party and many of my neighbors help me prep, bring food, and help clean up afterwards.  I feel at home.\n\nI meet an incredible guy after a series of bumble dates.  He has really similar values to me. He cooks amazing food, is funny, and is passionate about doing non-profit work.  And oh my god, the sex.  After 2 years of hating myself and not even getting turned on, i never thought I'd find myself enjoying 45 minute makeout sessions and surprise kisses in the park. I feel worthy.\n\nFixing my mental health has been a long, painful process.  But it's worth it.  Because I'm worth it. I never think a relapse is impossible, but I find myself living much more in the present.  Right now I feel hope.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cyjmw3/my_mental_health_journey/", "title": "My mental health journey", "social_network": "reddit", "user": "Letscuredepression", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 18, "down_vote": 0, "creation": 1567394466, "permalink": "/r/DecidingToBeBetter/comments/cyjmw3/my_mental_health_journey/", "nsfw": false, "first_save": 1635436336.8409355, "replies_charged": false}