{"id": "t5_2tand_t3_dhd4u6", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I used to snooze my alarm clock 30 times before getting out of bed. I’d set so many alarms in fear I’d be late for work. A few months ago, my morning routine was this: snoozing until the latest time possible and then rushing to get to the subway. Sleep on the subway until I got to work. \n\nI’ve been on a self-improvement journey for 5 years now. I’ve come a really long way. Most of it has to do with the way I think. I’ve been able to separate from my thoughts and recognize most of the stories I’ve told myself aren’t true. I have a steady meditation practice over years of dabbling. And then I realized that maybe I could get some things done before work instead of after when I’m super tired. \n\nWith this intention, I listened to nightly meditations that are supposed to help you wake up earlier. Where intention goes, energy flows right? Well, It wasn’t easy at first. I had to force myself to get out of bed with all I had. I didn’t wanna get out of bed. I really didn’t. I started small. Setting the alarm 15 minutes earlier than usual and actually getting up when it goes off. It wasn’t easy but I started to feel accomplished that I did my meditation before work. I’ve been doing celery juice daily and preparing it the night before for a year now and started doing it the morning of which is the most beneficial. \n\nAfter doing my morning meditations for a few days, I stopped sleeping on the subway naturally. I brought a book or did an online course I downloaded or did some Spanish lessons on duolingo. \n\nSoon after I started to set my alarm a little earlier. 15 more minutes. I was able to do longer meditations and started reading a book that has morning and evening ritual prompts and affirmations for the day. I was able to get them done before work. \n\nEventually, I stopped needing my alarm and wake up earlier naturally. It’s easier to get out of bed I don’t need to force myself. I wake up over an hour before I have to and am able to get everything I want done and shower and be ready for the day. I’ve been getting to work earlier. I have more energy throughout the day. I am more determined now than I’ve been ever in my life. I’ve started to up my yoga practice and have been going to more classes throughout the week. I go to bed a little bit earlier (usually in bed by 10:15PM) and continue with the nightly meditations. I get up early on the weekends when I used to sleep in and I have such long fulfilling days that I get the tasks I have to get done earlier and the ones I want to get done. I am proud of myself, prouder than I’ve ever been because I know I’m doing things that are good for me and I don’t have any guilt in what I “should’ve, could’ve, or would’ve” done because I really am doing so many things that I always knew were good for me but didn’t commit to. \n\nWe have so much power in our experience. We can’t control everything. Some things happen and they’re not ideal, sometimes they’re really really hard and terrible. But we can give ourselves a chance to healthily deal with things that come up by taking care of ourselves. We can transform so much of our journey by committing to being the best we can be, and trying harder. When we fall, we can be determined to get back up instead of giving up when it gets tough. I used to claim myself as the victim of shitty circumstances because some things happened in my life that were really sad. I sat and sulked and thought “poor me”. I ate terribly and did the bare minimum. I kept giving myself passes because “life wasn’t fair”. But I wasn’t doing myself any good. I was just being complacent. And I recognize that I was doing the best I could and I don’t regret what i did or didn’t do, but I’ve learned that I can change the course in which my life is going. I can change what and how I do things. I can get closer and closer to my best self everyday by having that intention and taking action towards it. \n\nWe have so much power, let’s start doing what we can, with what we have. Be grateful. Be compassionate. And do things out of wanting better for your self instead of hating who you are. It’s possible. It really is. If anyone was a lost soul and a self-sabotager, it was me.  And I know we all can change. \n\nWaking up early has helped me live such a better life. Wanted to share this with you all because I think it can transform a lot, and I believe we’re all worthy of beautiful transformation. \n\nHope you all have a great day.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dhd4u6/changing_your_morning_routine_can_change_your_life/", "title": "Changing your morning routine can change your life.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 384, "down_vote": 0, "creation": 1570985747, "permalink": "/r/DecidingToBeBetter/comments/dhd4u6/changing_your_morning_routine_can_change_your_life/", "nsfw": false, "first_save": 1635435490.065047, "replies_charged": false}