{"id": "t5_2tand_t3_lorkz1", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I am 16 years old (male), i am 183cm (6ft) tall, i weigh 100kg (220lb roughly), bmi of 30.8 (roughly). I need to lose 19.8kgs to be at a healthy weight. I have many underlying psychological problems that are currently in the process of being worked on/resolving (depression, health anxiety, social anxiety, general anxiety, worry, suicidal thoughts, 3 forms of ocd and PTSD.) (you better not be soft on me because nobody gets help by being pampered.) I also have health problems that are partially due to genetics and others because of my poor choices (high blood pressure is the easiest one to remember.)\n\nI haven't been happy with how much i weigh for about 3 years. I have tried about 3-4 times to lose weight before and have lost motivation each time. Mostly because the results I was getting were unsatisfactory to my tastes, but the kicker is that when i look back on it after they are plenty satisfactory. Its just the amount of effort that goes into it is quite overwhelming and clouds my judgement (i get that this is a stupid justification for my failures). Whenever i get money, i spend it on food. I always regret it but its difficult to stop myself in the moment (planning on bring this up with my doctor next time i go.)\n\nI dont just want to be better, i need to be better. As of this year i have acknowledged alot of problems i have in life and have slowly tried to adjust better habits. As of January 15th i have broken an 8 year long gaming addiction, i have radically reduced the amount i masturbate (1-2 times a day to once every 3 days), as mentioned above i have begun the annoyingly long but neccesary process to correct my mental and physical health, i have had much more time to focus on my significant other and friends, i have began teaching myself to cook healthier, i have picked up my study for school slowly and i have partially regained control of how much i eat. \n\nBecause of my new found wealth of free time, i am searching for advice on good habits to build.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lorkz1/i_am_just_starting_to_be_obese_at_16/", "title": "I am just starting to be obese at 16", "social_network": "reddit", "user": "dedmemelord", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1613891702, "permalink": "/r/DecidingToBeBetter/comments/lorkz1/i_am_just_starting_to_be_obese_at_16/", "nsfw": false, "first_save": 1635438249.384195, "replies_charged": false}