{"id": "t5_2tand_t3_qfjsmz", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "This is a pretty vague question.\n\nI have posted on here before. I'm 28 years old (28F) and have never been in a relationship or been noticed by men. Never been asked out. I think it's been a combination of things: Growing up in a conservative culture and a household where I was not allowed to date. I had crushes on boys but I was always teased and made fun of, which affected my self-esteem. I went to medical school and really struggled with my coursework. I failed a lot of exams and even had to repeat a year. The school I went to was abroad and also quite small, so a very limited pool to pick from. The guys I developed crushes on there bullied me, really affecting my self-esteem. I used to be extremely jealous of their girlfriends/ex-girlfriends because those girls were chosen by them in the first place.\n\nI've struggled with the idea of being \"chosen\", if that makes sense. I'm a woman who has never been loved in that way. I'm grateful for my family and friends, keeping myself occupied with them and my own life. Still working on my career and other areas of my life. Trying to level up as hard as I can (finished medical school 2 years ago but have been struggling with my licensing exams to get into a medical residency, I feel so behind in my life).\n\nI feel like most women don't know how I feel at all. I don't think they could even fathom such a thing. I would imagine most of you have been in relationships for X amount of years. Regardless of how it ended, someone still chose to be with you. Someone still wanted you initially. You know what that feeling is like.\n\nI know this is a self-love/self worth/self-esteem issue but I can't help it sometimes...feeling that rejection and pain. My mom tells me I need to stop being so desperate. She doesn't understand though because she's been married to my dad for 31 years and before marrying him, she was in a relationship with another guy for 5 years.\n\nI know as a woman you are always supposed to put yourself first, but still, it has been so disappointing and disheartening. A few times, it even felt dehumanizing.\n\nI'd like to understand those of you who have been on the other side. Is this the wrong way to approach this? I would hate it every time my friends would complain about their relationships because (I would never say it to them), but in my head I would think, \"someone still chose to be with you. A guy wanted to be with you. He picked you.\"\n\nThey would often tell me that I'm lucky because I've been spared from all the heartaches, baggage, bad decisions, many complications, etc. that come from relationships. My friends said that they envy me in that regard. They tell me that God/the universe has a very soft spot for me. Yet, they still don't understand how I feel though. It's been very painful. I feel unwanted, overlooked, unattractive, etc.\n\nI'm really trying my best to see my single season in a different light. Trying to cherish it because I do have the time and freedom that people in relationships don't have. I look at women such as Amal Clooney who married later in life (she got married at 36) and I don't believe was in a relationship prior to meeting George. She focused on her work and improved other areas of her life, maturing and developing herself all those years and learning to develop a strong sense of self. When she finally did, the most amazing man came into her life. Someone who she probably never even imagined.\n\nI often wonder if my story will turn out like hers. With all the disappointments I've had and the waiting...I wonder if its for a purpose", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qfjsmz/i_struggle_with_never_being_chosen_how_can_i/", "title": "I struggle with never being \"chosen\". How can I change this way of thinking?", "social_network": "reddit", "user": "futurehero622", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1635177312, "permalink": "/r/DecidingToBeBetter/comments/qfjsmz/i_struggle_with_never_being_chosen_how_can_i/", "nsfw": false, "first_save": 1635436776.2576883, "replies_charged": false}