{"id": "t5_2tand_t3_m5rtqu", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "83780c3f-0425-40b0-bb3a-19c3a369b69b", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "Hi guys and gals,\n\nHope Monday is going well. I wanted to share my 'transformation' over the past 10 years. I've read some very inspirational stuff on here and I remember it helping me during my own struggle. \n\nI've gone from an extreme low to a point where I'm grateful to say life is great. I forget to look back sometimes, but when I do I can't believe how bad things can feel at your worst. \n\nI just wanted to show that big transformations are possible, and although sometimes it might feel hopeless, you will always transform yourself if you keep up a persistent effort, no matter how small. \n\n**Tldr:**\n\n\\- The usual pre-transformation. Nerd, overweight, anxious and mentally poor minded. Not many friends – except on World of Warcraft. Totally counts right?\n\n\\- Multiple serious surgeries triggered wanting to turn life around.\n\n\\- Fixed mindset to growth mindset. Fat to fit. Anxious to calm. Boring to funny. Awkward to confident. \n\n\\- Some dark places and things I've learnt along the way. \n\n# A Bad Start \n\nSchool was a bit of a nightmare for me.  I wasn’t confident, I wasn’t attractive, and I wasn’t happy. I'd constantly worry about what people thought of me. I tried so hard to fit in, at the cost of my happiness and personality. I'd spend my alone time wishing to be someone else, jealous of everyone, and feeling sorry for myself. \n\nI didn't realise it at the time, but I had some issues. My parents had broken up multiple times during childhood, and I saw some stuff I shouldn't have during that. I was sent to a boarding school at 12. \n\nThese things can cause some psychological issues that can take a lifetime to overcome. Mainly a crippling need for acceptance which caused me to embellish facts about myself, and act purely for the entertainment of others. Bad habits, bad times. \n\nMy only freedom was World of Warcraft. Which I rocked up 500 days of play time. As a side note, if anyone's an ex-player I'm sure they can relate, this still felt like the best time of my life lol. That nostalgia. \n\nThankfully, my nerd side provided me one great thing. I got into University to study Dentistry.  \n\n# Surgery\n\nUnfortunately, around 16 they found a tumour in my spinal cord. They wanted to operate quickly but we deferred it till after secondary school (probably a stupid decision in hindsight but I didn’t want to fall behind). \n\nThis operation was around 13 hours long, and recovery almost a year. It was a dark time, and the best thing that ever happened to me. I reached my lowest point, both mentally and physically – but with pain comes change.\n\nI had plenty of nights where I'd cry from feeling low. I'd spend weeks wishing life was different. I'd hide in my room when my brother had parties because I was so unconfident. \n\nComing up to my operation I developed a Stoic attitude organically. I was so sick of worrying I persuaded myself there was no point. I think I wanted to reassure my mum. This idea that **nothing is worth responding negatively to** started as I was wheeled into the operating room. And it has defined my life since. \n\nThankfully surgery #1 went well. And after 5 months of 14 hours/day of WoW, I decided it was time to take control of life properly. \n\n# Finding fitness\n\nI think fitness is the seed of all excellence. \n\nBoy I got fat during the gaming times. The first diet was 50 pounds to lose. It wasn't easy. In fact, I put half of it back on after. But if you want to improve anything about yourself, start at the gym. The benefits aren't just physical. Everything is improved. Attitude, mindset, confidence. \n\nWhen you see what you can do for yourself physically with some consistent effort, you can apply the same philosophy to the mental crap you want to deal with. \n\nI had another operation a year later. 6 hours. My spine is made out of metal now (I'm like Wolverine but I can't grow a beard). But I've worked out ever since. \n\n# The Mental Game\n\nI got pretty heavy into philosophy and psychology after the operations. There was so much I disliked about my thought processes and confidence that I decided to tackle it one step at a time.\n\nI made a commitment to read every day. Workout regularly. And force myself to change. It started with mindset.\n\n**I had a massive fixed mindset**. \n\nAll the classic tell tale symptoms. I went to town on that sh\\*t. It wasn't easy, I still get it from time to time. But forcing yourself to enjoy challenges instead of hide from them, and to stop trying to look good and instead focus on *being good* is has been vital for my mental well being. \n\n**Confidence is fixable**. \n\nIt isn't easy, but that's not the same thing.\n\nFake it till you make it works. But not because you’ve tricked everyone. Because you give yourself a chance to be someone you want to be.\n\nI used to look externally for my confidence. Status, money, popularity. But when I changed my attitude to embrace who I was, the rest was just time, and some awkward situations. \n\n**Humour helps massively.**\n\nOne perk of being a loser was I learnt the power of self-depreciation. It's the easiest type of humour, and completely disarming to people around you. You don’t have to self-abuse (which I did when younger) – but the person who can laugh at himself no matter what is always well received. \n\nI still do to this day. It works well for my career, my attitude towards life, and helps through any anxious feelings. \n\n**The worst thing for anxiety is to listen to it**. \n\nIt took me a long time to internalise this. Anxiety triggers compulsive behaviour, which masks anxiety. It doesn't cure it.\n\nI would avoid so much due to it, even though the things I hid from are the things I wanted most. \n\nTo overcome anxiety I live by rules. Mainly one. If I found myself avoiding or lying through anxiety, I had to do exactly what made me scared.\n\nThese days my friends think I'm a very confident guy. Often, I just don't give myself the time to worry before I act. \n\n**Women aren't scary.**\n\nMy first year of Uni I kissed like 2 girls. And trust me, that wasn't for lack of trying. But I would self-sabotage better than a Russian spy.\n\nBy year 3, I had alright 'game', but terrible commitment issues. I had around 30 flings over 5 years, and was sober for 3 of them. I broke up with all of them. Compulsive behaviour again. \n\nThankfully I changed my outlook a couple of years ago. Again, I set a rule. No more drinking to meet women. No more pretending to be someone I wasn't. \n\nI opened up more, and let me tell you – it was the best decision ever. To find someone who loves you for you is an amazing feeling. I used to laugh at the idea of long term relationships. Now I realise it’s a huge part of an amazing life experience.\n\n**Being depressed is tough, but it's your job to do something about it.**\n\nI've felt incredibly low at points. I understand how crippling it can be.\n\nFeeling sorry for yourself is poison. I know its a tough thing to say, but  there's something about it that keeps drawing you back in. Almost a guilty pleasure. \n\nThere was a year I used to go to bed each night and wish for bad things to happen. Like, I took joy from mentally picturing sympathy from others etc. I thought it was harmless behavior, but the way you think determines the life you live. \n\nYou have to choose to be happy. And that means taking action. Meditating, writing in a journal, exercise, nature etc. They all work if you commit to it. \n\n# Now each day moves me closer\n\nAnyway, I’m conscious of your time. A quick summary of what’s happening now. I recently went back to my old school, no one recognized me. Feelsgoodman. \n\nI’m obsessed with long term progress. I love James Clear, and base pretty much my whole life on incremental efforts. \n\nFitness wise, I managed to get a 6 pack (now gone, enjoyed my lockdown way too much), and primarily weight train 5 days a week. I’m 4 pull ups away from 20, which is funny because 10 years ago I almost cried when I done my first 1.\n\nRelationship wise – grateful to have a lovely girlfriend who is my lifelong partner. She's a proper sweetheart.\n\nAnxiety wise – pretty much gone. I’d never say fully. Anxiety is like an annoying spot that keeps rearing its ugly head.  But it’s about how you respond to it that makes the difference, and I never let it win. \n\nSuccess wise, I’ve been a qualified Dentist for 5 years, and now work as a Cosmetic Dentist. It's a highly demanding job. I wouldn't have managed a day of it 10 years ago. Now I welcome it. \n\nBut I recently handed in my notice. My boss thought I was crazy, but I decided to take a risk and pursue writing. I want to challenge myself creatively.\n\nI've been writing for 6 months. I write an article a week no matter what, and it's been the biggest challenge yet. I wake up 3 hours early to write before work every day. September I'll have more time to focus on it. \n\nI won't post any links, but I write about motivation and building a strong mindset for long term progression. Genuinely love psychology and philosophy and I focus on combining it. I've only got 10 subscribers, but my friends tell me it's good. It's a start. \n\nI love the idea of committing to something for 10+ years. Writing is that thing for me. But if I didn't take the first steps and begin changing the fundamentals, I'd still be hiding in my hole of despair. \n\n# Final Thoughts \n\nI wanted to share this because I’ve been very fortunate in my own transformation, and sincerely hope you guys will be too. There are a few things I live my life by now, and hopefully one of these thoughts resonates with some of you.\n\n1. You can always choose how to respond to any situation.\n\n2. Don’t focus on the end goal. It can be depressing. Fall in love with the process of progress. Life is about the direction, not destination.\n\n3. Being able to laugh when times are tough is the ultimate reaction for a happy life.\n\n4. Being jealous of others isn’t healthy. You should only complete with yourself.\n\n5. It doesn’t matter about your start point, only that you’ve started and that you're moving.\n\n6. Everything you dislike can be changed. Even if it can’t, your perception of it can. Sometimes, you have to approach things one at a time. But life is a lot longer than we consider it to be, and what you can do with it is amazing.\n\n7. Don’t be tough on yourself. You’re the only person you spend all your own time with, might as well enjoy it.\n\n8. Be the person who deserves the life you want and it will come. This is true for careers and relationships. Work hard and treat people well. It's reciprocated. \n\n9. Don't hide your true character. The world is a large place, especially with the internet. Lean into what makes you unique. People resonate with it, and you build a friendship group/ support network based on sincerity and genuineness. \n\n10. The struggle is, and always will be, worth it. \n\n\\----\n\nAnyway, good luck to everyone on their own path. The decision to be better is nothing short of amazing, even if it's the hardest one you'll make. \n\nI'm hoping to keep up with like-minded people. I've been lurking for so long it's almost criminal.\n\nPeace out,\n\nKieran", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m5rtqu/10_years_of_progress_complete_transformation/", "title": "10 years of progress - Complete transformation.", "social_network": "reddit", "user": "KieranDrew", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1615834170, "permalink": "/r/DecidingToBeBetter/comments/m5rtqu/10_years_of_progress_complete_transformation/", "nsfw": false, "first_save": 1635436621.164939, "replies_charged": false}