{"id": "t5_2tand_t3_nqw59z", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": " So I'm a huge doormat. Tbh I don't actually mind it. I like being a nice person, to the point that it kind of freaks people out sometimes. \n\nIdk, I guess it is sort of selfish. I don't really do it with the expectation of getting anything in return, in fact I prefer doing nice things anonymously and especially for strangers so they have no choice but to pass it on or forget about it rather than feel they owe me (I hate owing others so I try not to put others in that position idk). \n\nI do have complex PTSD tho, so there is some survival stuff in there. I get panicky if I feel I've done something that might have even slightly inconvenienced someone else. \n\nThis makes it difficult because not everyone is like that. Which I appreciate tbh and it makes me happy to see people who are capable of being proudly selfish, as I wish I could put myself first without the guilt and shame. But sometimes I just get mad and bitter and jealous.\n\nPeople forget I'm human. My closest friends even ask me if I'm human as I don't seem to need food or sleep the way others do (I do, it's just complicated and a bunch of other problems with social anxiety I'm working on). \n\nI know it's all on me. I spent a long time being angry with everyone else but they're just doing them, I'm the one getting jealous because I feel like I can't do that. \n\nI just don't know. I always forget how bad it can get. Like I can't find the moderation, y'know? I say yes to every single little thing so then when a big thing comes up and I have less opportunity to say no, I feel overwhelmed and like I'm drowning in the responsibilities of others. I forget I have a choice ig?\n\nIdk. I don't really know where I'm going wrong on all this, I just know I'm fucking it up somewhere because no one else seems to have these issues. \n\nLol idk any advice is welcome I guess.\n\nEta: I forgot this bit; idk why but it just always gets to the point where I feel like I have to be a dick to get the point across. I know I probably don't, which I guess is the main question : how do I remind people I'm human before I get to this point where I just want to burn everything to show people I can feel?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nqw59z/how_do_i_remind_people_im_human_without_being_a/", "title": "How do I remind people I'm human without being a dick?", "social_network": "reddit", "user": "voidybug", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1622667403, "permalink": "/r/DecidingToBeBetter/comments/nqw59z/how_do_i_remind_people_im_human_without_being_a/", "nsfw": false, "first_save": 1635438328.0914364, "replies_charged": false}