{"id": "t5_2tand_t3_ogi98f", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "Hello everyone. \n\n21F here. I have been on a self improvement journey and I have posted a while ago saying I was doing great. Unfortunately, life's not perfect so I'm just dealing with those days where everything feels like a waste. I was feeling pretty lazy and still do, but I did force myself to workout today. Feels so great to be productive. \n\nI was wondering how to deal with jealousy when other people succeed. I am very shy and I hate public speaking. I am friends with people who talk so well in class. I feel envious. They are instantly likeable. They talk so well that they are able to get new opportunities. \n\nOne even posted that she got an internship offer from a certain CEO. She is rich and feels entitled. She is so likeable but in reality, she just talks behind people's backs and criticise them but acts super nice in front of them. It's pretty unfair that some people are able to get it all. Rich, smart, likeable, great family and great boyfriend. So, since she posted that story, I feel like crap because I wonder why I couldn't be in her place.\n\nI am stuck in a shitty internship and went through the trouble of looking for one. While her dad has a good position in a well known company and she just had it handed to her. She constantly brags about buying Louis Vuitton, Claudie Pierlot, and Maje. And she also always bragging about her holidays and all. I don't know how to curb that feeling of not feeling enough, rich enough, likeable enough. \n\nI also know that it's good to work on myself. But that's a pretty vague term. It's very confusing and I wonder how I can actually work on myself and think to stop feeling like this. I try focusing on myself but when she brags about her money, I just feel like crap. \n\nThank you for your help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ogi98f/dealing_with_jealousy/", "title": "Dealing with jealousy", "social_network": "reddit", "user": "gwen-09", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1625783861, "permalink": "/r/DecidingToBeBetter/comments/ogi98f/dealing_with_jealousy/", "nsfw": false, "first_save": 1635435127.177469, "replies_charged": false}