{"id": "t5_2tand_t3_piix2e", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "Hello all. So, I am 18F. I used to go to school with this other girl and we were in the same grade. In elementary school, I used to make fun of her quite a bit. I never made fun of the way she looked or told her to off herself (although I do understand that is the bare minimum.) It was never physical. \n\nAt the time I didn’t care how it may have affected her or anything. It was weird. I can’t even remember why I started doing that. I’m sure my intentions were malicious, but I don’t think I was understanding that I may have hurt her feelings with the comments I made. \n\nFor the past couple of days now though, I have been feeling like a bad person. Because who does that to someone else? Who intentionally says mean things to upset? She was the only one I’d talk to in that way. I hate myself for it. It makes me feel as though I don’t deserve happiness or anything positive in my life because this is just karma for how I made someone else feel. \n\nI struggle deeply with my mental health. There are good days, but there are bad days as well. And the bad days are especially bad. I try to forgive myself for the things I’ve done, but it’s hard. \n\nNow, present time and for a long time now, I would never treat anyone in that manner. I don’t say mean things intentionally, and if I say anything mean, I apologize because I don’t ever actually mean it, although how would they know unless I apologized? It’s a burden for me to carry. I am a nice person now and even get angry when someone treats another unfairly. \n\nI have developed and inferiority complex. Anytime that I get treated badly I end up thinking “Maybe I deserved it. I mean, the things I’ve done.” I hate it. \n\nIn either middle school or early middle, I apologized for my wrong doings to this girl. I can’t exactly remember what I said, but I meant it. She even accepted my apology and we became somewhat of friends, not close friends although. \n\nHow do I stop feeling like I deserve to have a horrible life and deserve to feel depressed? Or should I just accept it and let it happen because this is just payback for what I did?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/piix2e/i_used_to_make_fun_of_a_girl_in_elementary_school/", "title": "I used to make fun of a girl in elementary school but I’m nice now", "social_network": "reddit", "user": "littletablespoon", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1630868076, "permalink": "/r/DecidingToBeBetter/comments/piix2e/i_used_to_make_fun_of_a_girl_in_elementary_school/", "nsfw": false, "first_save": 1635436752.5927536, "replies_charged": false}