{"id": "t5_2tand_t3_q8ucx4", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "Recently I got hit by a massive existential crisis. I realized I haven't achieved anything in my life. I was wasting my life away. I've been battling depression and anxiety for a long while because of my stagnation but only recently it hit me this hard. I've worked pointless jobs and have a degree in PR somehow, but I'm not doing anything at all with it.\n\nEver since I was little I wanted to be a scientist. I wanted to get up early in the morning, drink a a lot of coffee, do research in a lab, stay up late at night. It probably sounds foolish and idyllic, but it was always what I imagined I wanted to do. All of my interests pretty much boil down to philosophy, biology and tech.\n\nBut I have big confidence problems. They have effectively stopped me from pursing my interests. I keep thinking I'm just too stupid to be anything like that. There is no way I can come even close to that. Maybe I am, I don't know. But I've realized there is just no other way for me. No other path to achieve my dreams. I've already picked up programming classes and have tried to lay out a semblance of a plan for the next 5 years. \n\nBut now I keep thinking it's over for me. I'll be 25 in a month. Most people have figured it out by now or have laid the groundwork for a successful career. And I will be starting from scratch. It makes me so sad, I so wish I hadn't wasted my life like this. God, I so wish I could turn the clock back 10 years. But how could I have known?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q8ucx4/ill_be_25_in_a_month_is_it_too_late_for_me/", "title": "I'll be 25 in a month. Is it too late for me?", "social_network": "reddit", "user": "Milleniumofhatred", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 676, "down_vote": 0, "creation": 1634322315, "permalink": "/r/DecidingToBeBetter/comments/q8ucx4/ill_be_25_in_a_month_is_it_too_late_for_me/", "nsfw": false, "first_save": 1635437376.248362, "replies_charged": false}