{"id": "t5_2tand_t3_pkhi5y", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "Hey, I'm a brown 19 Year Old male.\n\nI like points so let me try to point out what makes me feel shit.\n\n1. I've started losing hair a ton : So yes, Male Pattern Baldness ahhh. I've spent ton of time on Tressless and whatever else reddit has to offer. Decided that fin is so not the way out. Minoxidil I'm still not sure of. I'll be trying PRP soon. But yes, seeing my hairloss is pretty damning. Im losing hair rapidly, and it's eating up my confidence as well.\n\nI went full bald, but looks really awkward on me because I don't have a full blown beard yet. When it does happen though, I plan to get fit and trim off hair.\n\n2. I'm not following my plans: I make plans. I promise I'll do it. I don't do it. And it KILLS ME. LITERALLY KILLS ME.\n\n3. Porn: The amount of times I've said I'll stop porn tommorow baffles me. The amount of last faps I've had, ahh.\n\n4. No real life fun: Screw corona. That's it. That's my 4th point.\n\n5. I have a shitty hygiene: It's not really bathing and brushing, but about how I keep the room messy and screw a lot of things up etc.\n\n6. I have zero time management skills.\n\n7. I feel like I've lost all my memory power: When I was young I used to be the district memory champion of my age group. Now, I'm just a loser who can't even remember a random ass phone number or simple tasks.\n\n8. Procastination: my tendency to procastinate is costing me my life.\n\n\nSo I've decided to be better. By how much I don't know. I want to. So I'll try my best. Again from Tommorow, I had a time table. I'll try to follow it. And hopefully it all works out well.\n\nxoxo would appreciate some advices or encouragement or anything. Please.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pkhi5y/19_m_sometimes_i_feel_like_im_on_top_of_the_world/", "title": "19 M. Sometimes, I feel like I'm on top of the world and I'll get through this mess. And at other times, I feel like I can't go any lower.", "social_network": "reddit", "user": "Snoo56429", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1631129524, "permalink": "/r/DecidingToBeBetter/comments/pkhi5y/19_m_sometimes_i_feel_like_im_on_top_of_the_world/", "nsfw": false, "first_save": 1635436799.8673515, "replies_charged": false}