{"id": "t5_2tand_t3_ovjt9h", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": " \n\nHi,\n\nI lost my main source of support since December. Can you still be successful if you lost your mentor/source of feeling loved? My brother is acting like someone else and he is blaming me of not putting effort. And he is giving other people's effort as an example but in a calm way. This is really hurting me that he does not see or he likes to see I am \\*fighting\\* with financial issues.\n\nBefore he was saying like we will grow older together, I will always put you as priority because you are almost my little kid. Every money he saved is for my future. He was saying he will leave everything to me when I was saying no way. I never asked for extra money from my brother until I've come the US for PhD. I lost my funding in December but fought for it, continued one more semester, until May. Now I am desperately applying for OPT, without any income. This week I saw that he unblocked me. I tried to explain my current situation and honestly little help. He just listened like a third party and he cannot fund me because I do not have any goal, I do not know what I am doing, I am just fishing to be able to stay in the U.S.\n\nWhen I came to the US, he started to date a girl who did not get family support. He was the main supporter, almost the one pushing me to the U.S rather than Europe. Of course, I am grateful, just saying that this was his idea/his passion for me since day 1 in my college. I cannot deny the sacrifices, support he has done for me. My dad was almost absent all the time except critisizing my discipline, behavior, hygiene habits, attitude, care of my hair even :D etc.\n\nAfter that girl my brother has dated, he started to blame me of being ingratitude of what I have. I started to randomly cut communication, as the best when he likes that way, and the cruelest if he feels the other way. He started to blame me for the years he invested on me.\n\nSince December, I cut off communication but reached out again. Now he is in a different person, distant, calm but saying old empty words when I am asking for confirmation, want to feel that brother love again. His soul is gone. His love for me is gone. Every trouble I have been going through or telling, he has zero empathy, just cold advice or \\*being realistic\\*. I feel like I lost him as he died while he is alive.\n\nI am good when there is a distance between us right now. This is very surprising but I killed the thing about him inside of him this previous six months. But since last week, I have realized something. When I am showing love to my dog, I am doing the same thing when my brother was showing love/being sweet to me until last summer. I am playing with his paws, I am trying to smell his back of neck like a baby. I am smelling his face. This keeps reminding me the love he gave to me, showed to me with his actions. This is gone. He was always there, almost deciding together when I was giving big decisions. Now he is just nodding.\n\nI am trying to stay in the U.S. instead of going back home. Today, I wanted to ask him because I am scared of this decision. I am not able to pay my rent after september. He just listened, he just said if you cannot fund yourself, then come back. It is your decision. Before, I was telling him everything upsetting me, now the maximum time he is giving is five mins, and it is just my career check. He does not care what is upsetting, hard for me anymore.\n\nIn May, he said that if I have a plan, he is ready to fund me while in the U.S. Now today he is saying that, this is not a plan, you do not have any target, you are not even close to find a job, probably you will not find one or take six months and he cannot fund this. Then he hung up when I lost it when he kept giving other people as an example, as better, role model etc. He is also saying that when he is tring to give advice, I am getting angry. I am close to the growth.\n\nWhen he says these, this really hurts. He has some assumptions but really do not know me. And it feels small to explain or prove myself. Even I do, he is smiling and saying oh come on you know this is not true inside. I am not close to the growth. I am not doing without any goal. I am not depending on someone else' money and it is my plan to live my life like that. He does not know me. But he knew me the best 5 years ago.\n\nShould I push staying here? Maybe he is right? We will be always like this now? Did you have something similar and still have mental power to succeed?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ovjt9h/can_you_still_be_successful_without_family_support/", "title": "Can you still be successful without family support?", "social_network": "reddit", "user": "pennylane-626", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1627784051, "permalink": "/r/DecidingToBeBetter/comments/ovjt9h/can_you_still_be_successful_without_family_support/", "nsfw": false, "first_save": 1635435798.5350316, "replies_charged": false}