{"id": "t5_2tand_t3_m0hroi", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "This story might help people facing abuse, especially long time abuse where you feel like you can't escape. \n\n\n\nEven if I don't know any of you it will be very embarrassing for me and I want it like that, I love it actually.\n\nI've been addicted to weed and cigarettes, to porn, to being dishonest, negative and stressed for several years, some month more, some month less.\n\nAt times I also considered it a problem.\n\nBut I have never been interested in taking drugs in the first place and started smoking at 19 (25 now).\nI was actually the one kid of my friends who would be the edgy one because he is clean and does sports and thinks about going forward in life. Party now and then not erryyydayyy.\n\n\nMy real problem was the relationship I got into and the world I have built too flee in.\nDrugs were not the problem. Occasionally I smoke weed. If I see a benefit I will stop weed for how long I need to, its just like one or two days I'll miss it.\n\nMasturbation and porn were not the problem, the shit was deep inside of me and I want to embarrass myself now.\n\nWhen I was 17 I met this girl. Small red flags but is ok. I was in school but already self employed with kind of online marketing and lived in my own shit with nobody paying me.\n\nSo you see, I have very good cards if you ignore that my father was an alcoholic single parent that beat the shit out of me while not even having money to afford anything.\nMy dad and I are very good friends and I forgave him long time, he had his own struggles and is actually a beautiful human being.\n\n\nOkay I had no interest in a relationship because I was doing good on my own, but my lifestyle was so different from my happy party people now, so that I was all alone for weeks and month. School, business, sports, eat, sleep. All I did.\n\n\n\nAt this point I didnt forgive my family for the fucked up shit I had to go through, I didnt want to grow up being 4 or 5 and hear how my cousin beats the shit out of his mum on cocaine.\n\nDid not want to feel how my dad kicked me down the stairs spat on me and called me a son of a bitch who is not his son being 8-9.\n\nGuys. I gave my best all my fucking life. \nBut you cant sometimes and you feel like you cant move but you want to but it doesnt work.\n\nI took the beatings. Still wanted to be the best in school. I took the mental abuse of being called the worst piece of shit on earth everyday and said to myself, dad is sick, its ok. Every. Fucking. Day.\n\nYou wanna know why? There are two types of children with these kind of parents. One becomes like them, one becomes the opposite.\nNever ever did I allow myself in the direction of my father, not one step.\nEvery time I caught myself going this direction I put myself right back into the place.\nThere was no one to defend me, no one to help. I was happy I am this kid that gets beaten because I got so resilient it didnt even hurt my feelings. At some point it was just annoying background noise and what he ever does.\n\nFast  forward Im 18. I feel this girl is starting to fuck with me mentally, but she doesnt know. She hardcore jealous but I think she will grow older, she is 6 month older but you know I have different experience in life. I have a flat. Responsibilities. I think of family and being a good man who earns tons of money later, because I already did for my age. Earned  more than average man in my city while going to school. Not bragging, I just want you to feel the self perception and feeling who I was.\n\n\nThis girl at some point when she gets angry starts to smash my shit, talk in the rudest way, calling me son of a bitch although I told her the secret of my life. The one secret I never told anybody. It's true, my mother did sex work.\nNever identified with that, but never had a feeling that it should be put out there even if I didnt care how people perceive me, I felt like this changes it too much for people who \"think they knew me\".\n\nShe would be jealous on everything, female friends, male friends. To the point I felt shy to do anything with female friends because her reaction was tooooo crazy,hitting me all the time, smashing my shit screaming at the top of her voice \"son of a bitch\"...\n\n\nI have neighbors 70+ and I am very careful to be respectful to my surroundings especially elderly people, even if I didnt like them because they were kinda racist but ok.\n\nSo shes hitting me triggering my buttons non stop im like i dont do nothing i shut my mouth and go but she stands in front of the door crying, if you leave leave for ever!!!!! is what she said.\n\nIm like wtf lets just calm down and talk normal. I will make the tea lady just give us some time.\nBut no, no escape from the abuse. You had to go through it or its 'done' .\n\nNo apology. Never expected any because I tried to understand and forgive her on my own. She had a rough childhood like I did and I hoped I can show her how to deal with problems and lets be better than our parents and make great family. This was my idea.\n\nInvesting in the potential of someone, we were not a match back then. Also this was a time where I was actually sick of fucking around. I had it all from 16-17 and it started to be a waste of time. Weekends were for business and work days for sports and school.\n\nSo I said if I find the girl with the heart on the right spot, I'll make her a woman, I'll make her my lady and we'll make awesome family and live happily ever after.\n\nLOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOL.\n\n\nI went through hell and back becoming addicted to this girl.\nShe abused me over 7 consequent years until a high performer became a cripple hiding in his room, just want to be with his girl, so happy when shes happy. Meeting knew people became different and meeting knew women was kind of ' oh thats kinda wrong '.\n\nBut look, most of my friends are WOMEN. So I lost most of my closest friends over the years, even though we said from the beginning that this won't be any issue, just no sleep overs. yeah right.\n\nBut I was concerned on her health all the time, so I tried to be the right person for her craziness.\n\nBend myself in a way I can't work as a single person anymore. Doing things I usually wouldn't.\n\nIt's been exactly a year now and I slowly feel like I escaped. I escaped the chains.\nIt's been a year since we split and I'm more clear than ever, she loved my energy, she loved what I expressed, she loved how I acted what I did, how I treated her and for sure she loved the D.\nBut one thing she didn't love is me.\n\n\nThere would be so much more to tell like when I would go to work 90 hour weeks far from home and get terror calls at 3 am calling me all names and that I should die. Everyday I was telling myself we will fix this and there would be so much more to tell. \n\n\nDECIDING TO BE BETTER PART\n\n\nOver the years I felt declining in every part of life. Wow. Everyone was like, if someone makes it, it's me.\nThere I am in even more existential pain. Seeing that I am actually not able to handle this and I don't feel like I once did in life.\nI am not as convincing, not as ambitious and blatantly consequent with people. Back in the days if you did something I didnt like - you either never heard from me again or you heard a lot of me. No fucks given never.\n\nThen last year after the breakup I collected the pieces, the leftovers from what I kinda remember was me. Being depressed as hell and feeling suicidal every day. Feeling like dying for month.\nBut also everyday I was shouting at my mirror everytime I felt like I am believing what my head is telling me, that we are shit and we can die and I shouted fuck you.\nI won't listen to this shit, you just mad bro, you just a child. You a small child who decided to relive his childhood trauma with this girl. It is what it is. Except it and stand up.\n\nBut you do this for a month you think okay lets try further.\nYou do this for half a year and start to think bro shit is not working I might be actually tooo fucked up and should get hospitalized fml. \n\nNOT GIVING UP EVEN IF THERE IS NOTHING YOU SEE OR FEEL ANYMORE\n\n\nBut I would never give up on me, otherwise I wouldn't be able to write this. If I would've given up I would've done it properly. Excuse my graphic language, it is what I felt and please don't be like me, reach out for help. In retrospect I could've worked up things better and faster or ease the pain a bit if I reached out for help. But I wanted to this shit on my own I wanted to show me no matter what happens, if we can survive this, we survive every shit on planet earth, you can't kill me. I have been heavily depressed 10 years before and I recovered so I knew that life is worth it from deep down. So please believe me if you doubt this. There was not a single week without at least one traumatizing day. And the beatings were not the trauma type  shit I talk about. Where I come from, I have seen it all. So please trust me if I tell you, your mind over time will be able to fix shit if you try. If you can't from your own there are very trustful programs who can teach you how to fix the brain and work with you and as a person who didn't believe in this in the first place I need to tell you I was convinced otherwise. \n\n\nFIGHT BACK!\n\n\nAnd guess what. Time did help. The scars they are terrible and thick. But they remind me of the mistakes I did in my life. And the mistake was that I let other people dictate how to live or what is right.\n\nShoot first then ask question. Be sorry later. Guys live your life like how you think it's right and if you don't find people who agree with you, consider it if you value what they say, but don't bend for anybody.\n\nNow, if someone is rude to me in any way I will call him out for what he does. I make more mistakes with people now, because I interact more. But if I see I make mistakes I genuinely apologize. For everyone who feels like he can't talk to people anymore. It's okay to make mistakes. It's okay to be cringe. Be open about the cringe we all crazy anyways and if someone tries to act like he's not - better believe he is more crazy then the crazy ones.\n\n\nNot in my job, not in relationships or anywhere you will be rude to me without me being the consequence. I will leave or destroy and I recommend that to anybody who is a victim of abuse. You can't save them. You are most likely not even the problem but their childhood traumas that they now relive with you. I am for real guys it is with most people who get upset in general.\nValue yourself, stand up for yourself and this will boost your confidence.\n\nSay more no, be ready to suffer and leave. Because the longer you stay you living on a suffering credit card that needs to be paid back. And when the moment comes you might have no tools or resources to pay the price.\n\n\nI can do a lot of shit today that I know I was able to do from years ago, feels like I am on my old ways. I am not 100 percent fine, but I am aware of that. My friends know, my family does and so on.\n\n\nTo this day I don't talk bad about my ex girlfriend.\nBut I hear that she is still talking about me in a degrading way in front of her friends.\nLuckily her friends are not my friends. Not just because of my mental lol.\n\nSee, most of you abused people have some resource people suck on and steal from you.\nThere is something valuable which these people feed from.\nMid term you will be miserable and they will live their best life. But trust me, they just got that resource from you and they leave you if there is nothing anymore.\nThey will come back if their shit is empty and they need more sooner or later. \nAnd this is when you will do good because slowly slowly your inner capital will rebuild. Don't expect jumps, don't over estimate jumps in your mood. You probably will fall down again.\n\n\nI beg all of you beautiful people getting robbed of your spirit, run. Run as fast as you possibly could. But when your devils come to haunt you. Dont duck. Once I broke up with this girl and moved like 8000km onto another continent.\nIt was hell how my mind told me to go back and that we need this.\nIt crippled me.\n\nOh btw I am living clean, doing sports and shit and hustling hard, having a lot of fun in live. Still now and then demons come. But no matter I am ready for them. \n\n\n\nTHE PAIN IS LIKE MUSCLE FAILURE\n\n\nI always like to explain things with the muscle thing. It needs to suffer to grow right?\nWhat do you think why don't I give myself up, why am I not an alcoholic abusive piece of shit. I mean I had great role models to be like that but I am none like that and I am proud of it.\n\nWhen I was sick to death of my mental pain I always told myself, look:\nThe muscle is suffering and it will suffer loooong loooong time.\nIt's not just that your brain is traumatized, it can also be that the machinery for building tools is working to protect you. And it's working harder than ever because your brain needs you to reflect and process all of this shit so it doesn't happen again to you.\nSo I tried to look at my severe depression like a muscle that will come out a lot stronger and I feel like I was right somehow - with me at least.\n\nThe ultimate answer of what made me better is deciding to cancel out anybody who is not working in my favor. Fuck your shit. I am me. I know what I do is mostly right. And when it's not I have good people to tell me that I trust with that type of feedback.\n\nDon't ever stop to give no fucks! \n\nNo one can hurt me.\n\n\n\nThanks for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m0hroi/leaving_drugs_and_doing_sports_did_not_make_me/", "title": "Leaving drugs and doing sports did not make me better. THIS did", "social_network": "reddit", "user": "GonnDir", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1615216456, "permalink": "/r/DecidingToBeBetter/comments/m0hroi/leaving_drugs_and_doing_sports_did_not_make_me/", "nsfw": false, "first_save": 1635436507.7384624, "replies_charged": false}