{"id": "t5_2tand_t3_8fxevn", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Recently a friend of mine forwarded a message on our group. I responded with a question. He said he didn't know answer to that question. I replied - then we can't be sure about the authenticity of the claims.\n\nHe replied, but why would anyone lie about this. I tried to reason with him saying that there may be any number of reasons behind sending the message.\n\nI felt like our converstation was a bit unplesant.. **people really feel bad if you dont immediately trust anything they shared with you in a group.**\n\nIn general, I have observed that there are some things that **always trigger** skepticisim in me. These things are\n\n* Excessive praise of some government\n* Broad claims about science being wrong\n* Claims about some phenemenon not being able to be explained by science\n* Major positive/negative change in the condition of some things \n* Rationalization of old time traditions\n\nWhenever I read such messages, I immediately take to internet, in order to verify their authenticity - and if found untrue - i respond to the message with references I found.\n\n**I think the basic reason behind unpleasantness is that, when people share stuff on social media - they are expeting a \"oh wow / amazement\" reaction, but feel bad when they instead get a \"is it really true?\" reaction from skeptics.**\n\n\nHow can I be both a skeptic and pleasant person, during social media conversations?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8fxevn/how_can_i_be_both_a_skeptic_and_pleasant_person/", "title": "How can I be both a \"skeptic\" and \"pleasant\" person, during social media conversations?", "social_network": "reddit", "user": "artrage111", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1525068639, "permalink": "/r/DecidingToBeBetter/comments/8fxevn/how_can_i_be_both_a_skeptic_and_pleasant_person/", "nsfw": false, "first_save": 1635437665.1028545, "replies_charged": false}