{"id": "t5_2tand_t3_qgt1da", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": " “You hang the Hitlerites after they have murdered millions of people. What were you thinking before they had killed millions? Aren’t dozens of corpses enough to make you think? Does it take millions of corpses to stir your humanity?” \n\nThis quote from Wilhelm Reich's essay *Listen, Little Man!* resonated pretty heavily with me when I (mid-20s) saw someone post it on social media a few months ago. Before I explain why, I want to put a disclaimer here that a lot of bad things are going on in the world at any given time and I acknowledge there's only so much any one individual can do about any of them, let alone all of them. \n\nHaving said that, in my more lucid moments I worry about the sort of person I might have been if I had been, say, a citizen in nazi Germany, or a resident of the US south in the Jim-Crow era. And then I think, that's the kind of person I am now, for the comparable problems of the time we're living in right now. I'm secretly terrified of being the sort of person who looks the other way or fails to intervene in order to save their own skin. I'm not naive enough to believe I could ever be a one man army (so to speak), and I recognize that many historical figures who are upheld by many people as heroes were never acting without the support of countless others. I have no grand illusions of changing the world overnight. \n\nRather, I think what I really want is to simply be an influential force *within my domain*, among my friends and in my community. I want to pull my own weight and share my portion of the burden. I don't really care if I end up dying without having any \"great\" achievements, but I want to at least be someone who *tried*, someone who fought for what they believed in, someone who influenced the world for the better even in some small way, irrespective of whether I can know for sure that it will have a major impact on the world in the long run. I want to live in a way that encourages other people to live better, too. Maybe I as an individual can't do anything about, say, climate change, but I want to at least be someone who participated in efforts to address it. \n\nThe point of this long-winded introduction is to say that right now I don't think that's the kind of person I am at all. I'm afraid that right now I'm dangerously close to being exactly the sort of complacent, docile onlooker that I think Reich was addressing in his essay. I feel like I barely do anything. I spend half my life meekly at a miserable job (what job is not at least a little miserable?) among gossipy, judgemental coworkers and under a passive-aggressive, highly judgemental boss. And I feel like I spend the other half hiding in my bedroom, playing video games or watching youtube videos or sleeping. Even though I really want to be involved and be an active participant in life, I find myself barely able to engage in political discussions or keep up with current events. \n\nThe thing that I think is probably one of the core sources of my problems, is that I seem to have a lot of trouble retaining information over time. In the years since I graduated high school I've tried to read books and otherwise learn through other means about subjects ranging from politics and philosophy to sustainable agriculture and media criticism. I also have tried on-and-off to keep up with news and current events every day. But it seems like almost everything I learn rapidly dissipates, until all I'm left with is a vague superficial impression and little fragmentary bits and pieces of things. And so I don't have the confidence to be anything more than a passive docile pawn, because I feel like I still don't understand anything about the world. I even got a degree in sociology (school was also often miserable and I struggled severely with motivation), but I don't feel like I've retained anything meaningful from any of my studies. \n\nSo I guess whatever motivation I've had to learn and be active has slowly eroded. What's the point in trying, if none of it actually helps me form informed opinions about the world or figure out what I actually want? And as it turns out, it's pretty hard not to become a victim of other peoples' judgements and beliefs, when you can't meaningfully form your own. I'm terrible at making arguments because I can never seem to think of what to say. So I've become something of an anxiety-ridden mess. \n\nI feel like I've been stuck in this rut for years now, and its only getting worse. Has anyone else experienced something like this? Like no matter how hard you try you can't seem to formulate a coherent understanding of the world and your place in it? Does anyone have advice about how not to be a passive onlooker who goes with the crowd? Right now the wall between where I am and the kind of life I want to live feels impossibly tall, and I'm really not sure what to do about it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qgt1da/trouble_retaining_information_stuck_in_a_cycle_of/", "title": "Trouble retaining information, stuck in a cycle of being passive and docile", "social_network": "reddit", "user": "anglerbe", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1635328285, "permalink": "/r/DecidingToBeBetter/comments/qgt1da/trouble_retaining_information_stuck_in_a_cycle_of/", "nsfw": false, "first_save": 1635436016.516893, "replies_charged": false}