{"id": "t5_2tand_t3_3r2jf0", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "I have always been in the business of self-betterment, mostly because I have an underlying belief/ fear that I am not enough. \n\n\nRecently I've had an interest in how to be 'Magnetic' -this interest has been sparked by doing a fair bit of solo travel recently, and watching people's social interactions. It’s amazing what happens when you consistently find yourself in situations where a lot of strangers are forced to interact. I've been living in hostels, and for the most part, this has meant forcing myself to be more social, but it has also meant a fair bit of alone time, just kind of observing people interact. I have met some really amazing people, but there's a handful of people who I've met who I genuinely believe must have some kind of super power. Some people just have an essence to them, a magnetism. I found myself (and others) just so drawn to them, and I couldn't understand why. I met all these people separately, they had not one thing in common, apart from magnetism. I've become obsessed with wanting to know the secret to them, why I and so many others are drawn to them, and how to be more like them. I suppose I haven't really explained why I mean when I say magnetism, so I guess I'll just briefly go through a quick introduction to the characters in my mental study.\n\n\n\n**Example 1:** *Guy*\n\nI met Guy in a hostel. I walked into the place, threw my bag on the bunk, walked down into the courtyard, sat myself on a bench, and opened my book. As soon as my ass cheeks landed on the smooth wood of the seat, two bright, wide, deeply blue eyes appeared just above the crisp pages of 'Cloud Atlas'.\n'Come play pool'\nAnd so, I played pool with Guy. He was just electric, he bounced around the place and seemed to know everybody. He sang (very well) at the top of his lungs, and made lots of noises. Animal noises, bird noises, he did impressions, he was like a human soundboard. He had a quote for everything that happened during this game of billiards, he kind of reminded me of Jim Carrey or Robin Williams in that he slipped into weird and wonderful voices and impressions with ease. His brain was on shuffle mode and he would just come out with the most unexpected things. And he was magnetic. He was the centre of every social gathering, and I just felt drawn to him. Yes, he was loud and entertaining, but he could also be quiet and hold very intimate, very interesting conversations that made you feel secure, listened to, and made you like the guy. It wasn't just confidence either, you could tell he was insecure. Heck, he'd tell you he was insecure. He wanted to be liked, but in his kind of honesty and craziness, you forgave him for his desperation. I knew him for a total of 5 days and yet I felt like I’d known him for a lifetime. He was just a magnetic person and I want to bottle whatever it was that made him that way.\n\n\n**Example 2:** *Clara*\n\nI met Clara at work. Clara was magnetic in a completely different way. She was quiet, mature, and let people come to her. She was incredibly talented, but deeply, deeply humble. She allowed you to dig for her talent, and you were always surprised and amazed to learn that yes, she had her own clothing brand. And yes, her debut album did pretty well and her singing voice was phenomenal. Oh, and one of her family members is a well-known celebrity, and yes, her art website is selling at a surprising rate considering she doesn't really tend to it very often. Everybody went to her place for tea and you immediately felt at ease. In a group, people listened as soon as Clara opened her mouth, she wasn't quiet or shy enough that it was a surprise when she spoke, but neither did she ever overpower a conversation. She just seemed to have perfect social timing and a mature, self-assured, measured voice. But again, she wasn't completely self-confident. Within a week of knowing her, I was surprised, and even felt a little strangely honoured, when she showed up at my door with tears in her eyes. She was just sad, she confessed to me. She sat on my bed and she cried and just told me about a couple of things that were making her sad but that really she couldn't put her finger on it. We ate biscuits and watched a film.\nClara and I became very close friends, and I am so honoured to know her. And it is not just that she is my friend that I believe she is magnetic, because I have plenty of other close, even best friends who I know just don't possess the same level of magnetism. I’ve spoken with other people who know her, and we are always amazed to find that she has the same effect on everyone.\n'I don't know… there’s just something weird and special about her' One girl said, and it was if she took the words out of my mouth. Whatever Guy and Clara share, I need to know how to get it.\n\n\n**Example 3:** *John*\n\nJohn was magnetic in all the wrong ways, but possessed this magnetic quality I'm so concerned with all the same. He was magnetic, and he knew it. He had charm, wit, charisma, a killer smile and the kind of cheeky face that knew that he could get away with anything he wanted. And boy did he use this to his advantage. I worked with John behind a bar and his tips were astronomically beyond anybody else's. He had banter with every customer, from old ladies to young ladies to couples to families to tough, working-class blokes. And everybody tipped (This is in a country where tipping the barman isn't really customary.) and everybody loved him. Including me. One night, he just turned and kissed me without saying a word, and I was jelly in his arms without even realising it. You know when vampires in fiction have this kind of 'Glamour' ability? Where they kind of have a hold on you before they go in for the kill? This was John. Eventually all these girls talked about John over their cocktails and realised that yep, he had banged all of them. But he was somehow forgiven because he was just so likeable. Yes, John was confident. After a few dates with him I came to realise that his favourite topic of conversation was definitely himself, and his overly-inflated stories of heroism (Including stories where he single-handedly beat up 10 gang members to protect some arbitrary damsel-in-distress ex girlfriend who had cheated on him but whom he'd forgiven because he's just such a damn good guy) were definitely masking a deep self-worth issue. But he was still magnetic. The room turned to him when he walked in, and the room talked about him as soon as he left. I could never be in a relationship with the guy because, well, everybody was drawn to him and John had a complete inability to say ‘No’. He was a serial adulterer in the making.\n\n I was not surprised, however, when a close friend of his informed me that 'he has this effect on everyone. He has always been like this, but recently its got worse. He's really into psychology you see, have you read *'The Game?'*\n\nAnd that’s when my interest peaked. The Game, as anybody interested in how to pick up women knows, is a book about how to have the same ability that John obviously possessed. It talks about how to be the centre of attention, how to choose a target (woman you want to sleep with) and exactly how to woo her, get her into bed, and make her obsessed with you. As I read the game, I recognised all the steps, without fail, that I had seen John use successfully on me and on so many other girls. This was a game changer.\n\n*Maybe magnetism can be learned? And maybe I can learn it?*\n\nOf course, Clara was an all-over better and nicer person in comparison to John, and was not using her powers of magnetism for evil. But I am still convinced that they share the same trait, even if John might have consulted a kind of *Magnetism Spell Book* to learn the dark arts of picking up girls and making money. Guy possibly had the potential to be a girl magnet, but his whole thing was a bit friendlier, a bit less predatory than John. \n\nSo, I want to be magnetic. I’m a wallflower. Or, sometimes I come out of my shell and say all the wrong things and so return to the safety of my wall. I am socially awkward and have anxiety about something probably 50% of the time. I feel hollow and lacking of personality, and so maybe I’m drawn to these magnetic people because whatever trait they so positively possess, I so negatively lack. So, like a magnet, I stick to them.\n\nYour thoughts? (or Resources, books, studies, psychological knowledge)\n\n[Edit: spelling & grammar]", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3r2jf0/how_to_be_magnetic/", "title": "How to be Magnetic.", "social_network": "reddit", "user": "MrsWhyNot", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 77, "down_vote": 0, "creation": 1446377417, "permalink": "/r/DecidingToBeBetter/comments/3r2jf0/how_to_be_magnetic/", "nsfw": false, "first_save": 1635435836.287625, "replies_charged": false}