{"id": "t5_2tand_t3_9j1b9c", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Hey all, \n\nBefore I get into all this, let me give some background context. \n\nLast year I was not at the best position - serious surgery (resulted in a serious amount of weight loss), long term relationship ended with ex gf along with a few other things going on.\n\nNot the best set up at all really. \n\nI woke up one of the days after my surgery recovery and when I went to try on my clothes it was very evident that my clothes did not fit me at all anymore, but I am not sure what exactly happened - but something in my head clicked / snapped.\n\nDuring the summer I got friendly with someone who still is a good friend - who lost a serious amount of weight and got in serious shape, so I decided to reach out to him to ask for his guidance and advice on what is the best way for me to get back into shape. \n\nHe sent on some detials about training and eating, but he emphasised sooo much to me that the most important part of it all was getting to the gym 5 days a week (to hit everything twice) and to eat enough - a lot easier said than done. \n\nIn the past when trained martial arts / boxing, I would go training in the evenings / nights - however with university and stuff in the way that was not always an option so I decided to do the next best thing. Go in the mornings before everyone else woke up. \n\nThink back to the last time you woke up at 6am - for me personally it was to catch a flight. But I decided to just bite the bullet and head straight into it - no easing in, no 20 minutes earlier everyday. Just set my alarm for 6am the next day. \n\nFirst 2 weeks were tough. Would be falling asleep by 8pm etc but then something remarkable happened - my body got used to it. I got so much more productive. And I sure as hell stuck with it. \n\nFast forward a year and a bit and a heck of a lot of travelling over the summer, resulting in zero 6am starts (more with the night finishing at 6am), and craving getting back to my routine. \n\nBack in university now in my final year so shit is hectic enough with so much work due etc etc and we are only 3 nearly 4 weeks back. \n\nBut I have been back at my 6am starts everyday for the last 5 weeks with the gym 4/5 days a week. \n\nThere's a few things I have been noticing first hand as to what the hell it is doing for my work ethic/ my overall mood on a daily basis: \n\n1.**Brain is on super-focus mode**\n\nAs we all know dopamine is a powerful chemical in our brains - but my god a dose of dopamine before 7am does something to you. It energizes me for the entire day. It is exactly what I imagine drugs to feel like as crazy as that sounds. There has been many time I come home from the gym as my parents are only waking up and they have walked in on me in the kitchen dancing and singing at 8am - they thought I was losing my mind for a while. Nothing is a problem in my eyes at the minute: stress is at an all time low especially compared to all my classmates and college work is a breeze that I have no issues focusing on.\n\nHave you ever seen a snowball rolling down a hill, starts off small but once it gets momentum it is near impossible to stop? The same principle applies to getting up early: getting a positive, productive start to your day adds momentum. Once you've got going (before almost everyone else) the rest of your day runs much better. Even if you stall later on or something goes seriously wrong, the work you have already achieved means your day has been a success. Rise early, and add momentum to your day!\n\n2.**Confidence is at an all time high**\n\nI have seen **SO** many posts on here specifically, telling us that forcing small talk is a good way to help overcome social shyness. Now, bit of a disclaimer but I have never been too much of a shy person - but this is on another level at this stage. But the confidence levels that come with making progression in the gym + this new found energies in the morning is a bit too much to handle at times. I am making small talk with workers in coffee shops, people I happen to sit beside on my commute - whoever it is! Heck I have even been asked out a couple of times, which was a big surprise for me!\n\n3.**Starting Rituals**\n\nCreating a morning ritual is a huge thing for me, and another reason why I started wakingup early in the first place (will write about my morning ritual in a bit more detail if people are interested - big reason why I even started this whole 6 am start again this college semester). \n\nYour morning ritual is basically the order in which you do things when you wake up, and that when you carry it out a certain amount of times it changes from an action to a habit/ ritual, and it is utilizing/manipulating this progression how you can add in new steps that can really benefit you in the long term. \n\nFor me this year, I have started doing readings for college in my spare hour in the morning between 8-9 when I leave. We are only a month or so in and have had a few projects but I can already see that it is helping me keep up to speed and even ahead of people in the class at some stages - which is a very pleasant surprise for me as I am not the best student by any means. \n\n4.**Time Management**\n\nWe all know that person who is always late for everything - for me it was having my friends constantly joking (sort of but not completely) about arriving half an hour early for parties - and I would still end up late. Of course its one thing that might be a bit annoying in a social setting - but when it was effecting college and even exams I decided that I somehow needed a change, I just wasn't sure what that was. \n\nFeeling rushed is a feeling that i have got far too comfortable with - and it was not a good thing or a good way to start my day. Waking up, wolfing down a piece of toast, pulling on non fresh clothes from a couple days before and sprinting to the bus - before realizing that I forgot to brush my teeth or even go to the toilet. Getting up early gives me time to organise my things for university, get a good balanced meal in, think about what I am going to eat during the day and do a to-do list of things that have to be done - both college and socially. \n\nThese are juts a few of the things that i have been noticing first hand as to how rising early is really benefiting me in everyday life - today (11am) I have just finished completed a workout, eaten, done a shopping list for food until Friday and completed a college project a bit earlier than expected - so before running out to the shop I thought I would try throw a few ideas down in a post to see can I help anyone at all maybe better themselves. \n\nWaking up this rested and feeling as if I have so much done with my day already - before my friends have even woken up is just an amazing feeling, that I would recommend everyone at least tries. \n\nIf anything I wish I started doing it a long time ago. \n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9j1b9c/how_waking_up_at_6am_everyday_has_changed_my_life/", "title": "How waking up at 6am EVERYDAY has changed my life.", "social_network": "reddit", "user": "Figrole", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 363, "down_vote": 0, "creation": 1537958047, "permalink": "/r/DecidingToBeBetter/comments/9j1b9c/how_waking_up_at_6am_everyday_has_changed_my_life/", "nsfw": false, "first_save": 1635437680.6624026, "replies_charged": false}