{"id": "t5_2tand_t3_p66zxe", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "I used to be a straight A student, seemingly heading for a bright future. But then I just fell apart, ended up kicked out of an English degree having been unable to read a single book in 2 years. Before that I spent my childhood being abused and neglected, bullied and isolated, and just generally trying to off myself.\n\nAnyway here I am, pretty much dead, with nothing to say otherwise. I'm trapped in my body, stripped of all free will.\n\nI come to you, because I am out of options, I saw pschs for the better part of a decade, given most every medication there is to give, and then in failing that was left to lay waste. I'm in the UK, and NHS is really crap for mental health, especially when it's long term and severe. I often joke they won't even look at you unless your at thier door bleeding from your carotid.\n\nAnyway. I'm not sure what else to do, I haven't even the energy to think, and that's when I'm juiced up on modafinil and caffeine.\n\nPeople say suicide is a permanent solution to a temporary problem, but my problem is very permanent, my problem is me and the entirety of my life. I did once long ago have a brain, I'm not blinded or looking at the through lenses, all too bleak. I know life is worth living, it's just my life that's not.\n\nSymptomatically, I have CPTSD, Executive dysfunction, Clinical depression, Severe social anxiety, Binge eating dissorder, Generalised anxiety, body dysmorphic and also depersonalisation derealization dissorder (dissociation), likely some form of ADHD-PI aswell but assesments take forever.\n\nI'm just incapable of anything right now, my brain is f'ed. I spend 8 hours this morning just trying to put some socks on. Like I wanted to but instead I just sat there like I had some aversion to action. That's what it feels like, I want to do something, even the most mundane and innocuous of tasks but my brain just aborts. I can't even right an email. Takes me a month to reply to an text message, haven't managed to have a shower in good knows how long.\n\nWTF\n\nSo, help! Please? What do I do? I'd take anything short of finding God, there's a much faster way of meeting my maker if it comes to it.\n\nThank you.\n\nEdit: I might not have made myself clear, I have a psychiatrist and see a doctor, but their general interest is just don't have your patient die. They're just interested in your living, what form and quality that take's they don't care. In all fairness, you have to consider chronic underfunding, and lack of education in more endemic and prolonged (trauma-related) presentations.\n\nEdit 2: I can bake it 100 miles by train to uni if I have to. I'm not catatonic. It's just I have no control over what I can or can't do. The best I can figure, I can do something if I'm forced into it. That's how I survived school I think.\n\nEdit 3: Thank you, everyone, so much for your replies, I am slowly getting through them all and trying to respond. \n\n**We're at 23,000 words so far!!!**\n\nIt might take me some time!\n\n&#x200B;", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/", "title": "I'm 20yo M and I feel like I need help just to live. I can't read, I can't shower, I can't remember anything. I struggle to even put on a YouTube video.", "social_network": "reddit", "user": "amenteco", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 973, "down_vote": 0, "creation": 1629216799, "permalink": "/r/DecidingToBeBetter/comments/p66zxe/im_20yo_m_and_i_feel_like_i_need_help_just_to/", "nsfw": false, "first_save": 1635437367.9416578, "replies_charged": false}