{"id": "t5_2tand_t3_2gxffa", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "In the spirit of self-improvement, I'm watching an [online course from Oxford introducing philosophy](https://itunes.apple.com/itunes-u/general-philosophy/id381701367?ign-mpt=uo%3D8&mt=10). I've always had an interest in philosophy but have never before studied it formally. The course is broken into 8 lectures; I'm planning on watching one a day. I figured I would share the notes I took from the lecture in case anyone else is also interested in learning a little bit more about the subject.\n\nDay 1:\n\nThe first renowned philosophers arose in ancient Greece. It is not clear why, but the ancient Greeks were the first to depart from the belief that tradition and religion held all of the answers to life's deeper questions. The most famous Greek philosophers were Socrates, his student Plato, and Plato's student Aristotle. However, there were a great many others. Although the Greeks produced a wide variety of written work from their philosophies, the majority of them were lost with the rise of Christianity in the Roman empire and the resultant destruction of non-religious knowledge (e.g., the burning of the library of Alexandria). Only three major works survived this inquisition of knowledge. One of the most impactful was the work of Sextus Empiricus, a physician belonging to the \"empiric\" or \"methodic\" schools circa 200 AD. Sextus Empiricus' work (and others) saw resurgence with the conquering of Constantinople by the Muslims around 1500. The Christians fled Constantinople and brought with them the previously lost works of the Greek philosophers. The skepticism of the Greek philosophers arrived in the Christian world at a time of great upheaval: the discovery of the New World, the Protestant reformation, and the invention of the printing press. The ideas of the philosophers spread and people once again began to question the traditional purview of religion.\n\nAristotle had developed a scientific theory of the natural world that all elements seek to achieve their natural place. Earth is the center of the universe, surrounded by water, air, and fire respectively. The heavens were made of a fifth element: ether. Galileo at the beginning of the Renaissance introduced a new set of scientific theories based on his observations of gravity and astronomy: all objects continue moving unless acted upon by an outside force.\n\nRenee Descartes (considered the father of modern philosophy) picks up the torch and attacks Aristotelian science through skepticism: \"the only science worthy of belief is the one that can withstand skepticism.\" Descartes accepts Galileo's views of the physical world but believes that the mind is something else, not physical: \"I think therefore I am.\" He begins with the supposition that mind and thought, at least, must be real because they are clearly perceived. He goes on to argue for the existence of God, and that God is perfect and has bestowed upon humans mental faculties that are not faulty. One of Descartes' greatest contributions is his belief that matter's defining (and sole) property is that it takes up space. By extension, all space is filled with matter of some sort. He extends this to a theory that the planets rotate around the sun (and moons around the planets) because their movement generate vortexes that perpetuate movement.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/2gxffa/intro_to_philosophy_day_1/", "title": "Intro to Philosophy - Day 1", "social_network": "reddit", "user": "dorsk", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1411189931, "permalink": "/r/DecidingToBeBetter/comments/2gxffa/intro_to_philosophy_day_1/", "nsfw": false, "first_save": 1635437192.4003386, "replies_charged": false}