{"id": "t5_2tand_t3_fh707i", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I didn't grow up with a positive male figure in my life. My father taught me that men are better than women, and that men are prone to cheating/ not naturally monogamous & that women had to put up with it. He continually put me down growing up and made me feel like I was never good enough. I could go on & on, but I'm sure you get the idea. As a result, I had low self-esteem and didn't know how to choose the right men. Every boyfriend I've ever had were abusive cheaters, and somehow I was always attracted to the playboys/cheaters. \n\nI've been through years of therapy, and am better than I was before. But I still harbor this resentment towards men when it comes to romantic/sexual relationships. I try to remind myself of all of the great men in my life, that not all men are like my father or exes.. I try to think of my close male friends that have been there for me. & I try to remember that there were women that were horrible to me & men that were wonderful to me.  But it's hard to naturally be optimistic. To begin with, I've had horrible taste in men; I've been cognizant of this and have tried to improve. Whenever I'm attracted to someone new, I try to take it slowly & see how they are as a person. But it's just hard for me & I never feel okay with it. I used to post a lot of stuff on social media about hating on men in relationships to the point that my friends warned me that I could scare guys off that way (as of now, I deactivated social media because it was too tempting to keep posting those kinds of things)-- I guess it was a way of asserting myself. I'm 28 now & it probably reflects a certain level of immaturity or insecurity-- I may be aware of this, but sometimes my mind goes to such a dark place.\n\nI don't want to keep being this way, but it comes naturally. As a straight female, it's not working in my favor.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fh707i/how_to_stop_resenting_men_because_of_abusive/", "title": "How to stop resenting men because of abusive relationship with father & exes? I feel like it's holding me from possibly having a healthy romantic relationship one day.", "social_network": "reddit", "user": "Throwaway06202019", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 44, "down_vote": 0, "creation": 1583970900, "permalink": "/r/DecidingToBeBetter/comments/fh707i/how_to_stop_resenting_men_because_of_abusive/", "nsfw": false, "first_save": 1635436519.9341786, "replies_charged": false}