{"id": "t5_2tand_t3_pszouq", "request": ["eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "My (f21) fiancé (m22) and I have been together for the past two years and a half, he really is an amazing person with a great heart and treats me like no other. I am a very optimistic, social and positive person, always seeing glass half-full and get drained when people have negative energy or don’t see the good in things. I started to realize about 6 months into the relationship that he does these things many times but of course didn’t pay much attention since he treated me so well and I was (still am) very happy with him. After all this time I’ve gotten to know his family well (I’m currently NC with his dad and low contact with his mom) and realized they’re both extremely toxic people. They tend to have narcissistic behaviors and manipulate every single situation for it to benefit them. His dad is also negative 100% of the time and NEVER has something good to say about any topic. I came to the conclusion that my fiancé’s behavior comes from them and the traumas they’ve caused on him throughout his lifetime. Today we were talking about a young guy that he worked with that passed away and i commented how “these things make me realize how important it is for us to just do whatever makes us happy because in the end nothing will matter” and he replied saying he agreed but “that didnt mean you could go through life recklessly hurting people just because you’re doing whatever you want” and also argued that the world is filled with narcissistic people who hurt us bc it makes them happy. I asked him if that’s what he thought happiness was about and he said no but kept repeating the same thing. The fact that he relates happiness and deciding to be happy to those arguments worries me a lot because 1. I don’t think that way and I certainly don’t want to be around that energy and 2. I want him to be happy and healthy and get over his traumas. After having this convo he went to bed and didn’t say goodnight (which we always do) which makes me think he probably was triggered with what we talked about. I do want to touch this topic with him again but idk how to without being hurtful or overstepping a boundary, but it is very important for me to get clarity on this. I don’t think breaking up would be a solution without talking about it first because in the end it doesn’t have anything to do with the relationship and there’s so many strengths that we have, but I don’t want it to get to the point where it is a problem. \nI guess I’m just looking for an opinion or what you would do if you were in my shoes? \nThank you!!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pszouq/fiancé_is_negative_came_to_a_realization_it_might/", "title": "Fiancé is negative, came to a realization it might be linked to trauma.", "social_network": "reddit", "user": "Then-Lecture4280", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1632284110, "permalink": "/r/DecidingToBeBetter/comments/pszouq/fiancé_is_negative_came_to_a_realization_it_might/", "nsfw": false, "first_save": 1635437490.2019587, "replies_charged": false}