{"id": "t5_2tand_t3_qh4082", "request": ["b69cf201-6737-4217-b486-9096135546b8", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "9065d046-0977-4ea5-b8e4-e37cd42605ed", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Hi all. I'm a software developer, ~5 years experience, working from home, ~4 months into my newest job. It is boring, daily. I am on a 1 year contract but finding it hard to work every day. My life feels like I'm doing the same day over and over with minor changes. I have been considering leaving the field entirely as a possibility, but I don't know what else to do. \n\nI love art and drawing, I used to work as a graphic designer between university semesters, but the pay was barely above minimum wage and the clients were not very pleasant (they were from the oil and gas industry). I wouldn't mind going back to graphic design if I could get away from those aspects I think. The pay is tough to face though. The average pay in my area is about 55k a year, which isn't bad except that it feels like a massive step down from what I'm making. I made around that much at my first job out of university, no experience. I don't normally care about money, the only thing I worry about it for is for my living situation. I am very sensitive to noise and struggle in shared living spaces such as apartments. If I am only making 50k a year, I don't think I can live in a detached home without roommates, or worse, I'd have to live in an apartment with noise from all sides. If not graphic design, what else is there for me? \n\nI enjoy the problem-solving feeling of programming, but it has become very rare. All anyone wants anymore is forms, it's all the same. And most devs I work with are very anti-social, and I am a pretty darn shy introvert saying that. I want to get to know my coworkers, but no one wants to engage. At my last job, everyone but me worked through their lunches to finish the day sooner, and it had always been that way, so I ate alone in the lunchroom. This week at my job, we have a halloween event scheduled, but I noticed they booked it over lunch and then cut it from an hour to 30 minutes today. It left me feeling dejected that we're not even taking time out of our day to have fun, its during off hours, and very short. I worked at one company that did have fun during work, they had only a few devs and more artsy, designer people. I think that's why they had more fun. It's killing my soul being disconnected and isolated and no one wanting to do anything together. \n\nWhat kind of options are there for me? It would be cool to merge graphic design and programming, but most places have a designer that makes the things for the dev to add to sites. Other options? Any advice is appreciated.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qh4082/want_to_quit_my_jobcareer_but_dont_know_what_else/", "title": "Want to quit my job/career(?) but don't know what else to do", "social_network": "reddit", "user": "throwra_loneliness", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1635361544, "permalink": "/r/DecidingToBeBetter/comments/qh4082/want_to_quit_my_jobcareer_but_dont_know_what_else/", "nsfw": false, "first_save": 1635436444.4854105, "replies_charged": false}