{"id": "t5_2tand_t3_p32u7v", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "Sometimes we don’t need more information, more strategy, planning. Sometimes we just need to be reminded not to give up; that we have what it takes, if not now then we can develop it; and a little motivation to give us that jump start to break us out of the allures of life that pull us away from our dreams and goals. \n\n\nHow can I, a random on the internet, say something to motivate you to achieve your goals? It seems I’ve set a big ask for myself.\n\n\nI don’t know you; I don’t know your goals. I don’t know your situations, what health issues or life problems you’re dealing with. All I can do is offer compassion and say that there is love in this world for you. \n\n\nYou may lose motivation, you may fall off the bandwagon at times, you may get something only to realize it isn’t what you want. You may feel like these problems are only your own, but you’re not *alone*. \n\n\nYou have what it takes to achieve all that your heart desires in this life, within reason. I know that you can develop the necessary skills and traits to make the changes you want, even if those changes are only for yourself. \n\n\nDo you not deserve happiness? Have you made mistakes in the past? That’s fine, we all do. We all fuck up. The fact that you consider it a blunder is the very catalyst that allows for change. If you never thought it was a mistake, there would be nothing to fix. But you can fix it. You can make drastic changes to your life both physically and mentally. \n\n\nFamily, love, friends, money, exploration, invention, all these things don’t mean shit if you are in a bad place mentally. I need you to feel good about your own self. Not to say you will be perfect, but to say that life is short, and you are trying your hardest. \n\n\nAnd what if you’re not? Well, on this very day you can try. Try a little more than usual. Push a little harder. Make that extra effort. Effort to change your life. \n\n\nNobody will do it for you, and if they did you wouldn’t learn. You’d be in a different environment but feeling the same. Once you get the internal fixed, you can begin to fix the external. Of course, your environment influences you also, but that may be outside of yourself. How you react and how you are feeling is internally controlled.\n\n\nYou can do it. You have what it takes. If not now, in the future. You can get those things. The time and effort you spend doubting, if focused on things that can be improved, would lead to results that would astound you. You will never remove the doubt fully but give yourself a little more credit. Even if it’s temporary. Even if it’s for the next fifteen minutes. Just be proud of yourself even though you are incomplete. Even though you have more you want to accomplish. Love yourself, enjoy the process, and keep progressing. \n\n\nLove yourself. And work constantly to give yourself reasons to love yourself. And be accepting when you fall short of your ideals… but never forget that you are loved. That you are capable.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p32u7v/i_dont_know_you_i_dont_know_your_goals/", "title": "I Don't Know You, I Don't Know Your Goals.", "social_network": "reddit", "user": "MelkaThePhilosopher", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1628784148, "permalink": "/r/DecidingToBeBetter/comments/p32u7v/i_dont_know_you_i_dont_know_your_goals/", "nsfw": false, "first_save": 1635437217.30126, "replies_charged": false}