{"id": "t5_2tand_t3_n14cu9", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "When the pandemic lock-down in my country became less strict, I've realized that walking became hard to me. After few months being locked into my home, relying on delivery and quick jumps to nearby store, I've realized that my average daily step count was about 3k steps.\n\nSo armed with the knowledge that 10K steps is better than nothing, I’ve started slowly to build my habit towards 10K steps a day and by doing 10k steps a day, I’ve found some interesting benefits I want to share with you and maybe motivate you to **try** to reach 10k steps a day.\n\n## Benefits of doing 10k steps a day\n\n## 1. Its easy to start\n\nThe main problem is that getting into any sport – requires financial investment and developing a mental love to it. Even simple things like running – requires you at least get comfortable running shoes, and I won’t talk about other sports like gym – which requires membership or equipment if you want to work out from home; cycling – which requires a bicycle – obviously; boxing, rowing, skiing – which all require  equipment / membership and the latter also depends on weather. More over, sport is an individual thing. I hate running. I tried, multiple times. I hate it. Some people swear by it, I suffer when I run. And I don’t like to suffer, so I don’t run.\n\nHowever walking is something native to us. We walk all the time – whether its from the chair to the fridge, from our houses to a bus stop, in a super market, or just by the beach. Walking is natural to human beings. It requires zero equipment (you can even walk barefoot – some  people claim its better, I prefer shoes though) and its practically impossible to hate it – as its the basic form of moving as opposed to sitting.\n\n## 2. Its great for multi tasking\n\nWhen you run or cycle, row or lift weights – you are most likely trying to reach a goal be it distance, number of repetitions, weight of each repetition or speed – but you try to push your body to its limits. And when you push your body to its limits, it hard to do other tasks such as catching up with family or friends. Try to run and have a phone  call with your friend or do bench press and catch up with your family.\n\nWalking on the other hand does not raise your heart rate too much (unless you are doing fast walking) which enables you to do other tasks.  When I walk I tend to use this time to: catch with family or friends, listen to audio-book or podcast, listen to music, or clean my mind and explore, which brings me to the next 2 points.\n\n## 3. It’s good for cleaning up your mind\n\nWhether you’ve had an argument with your SO, can’t figure out a solution to hard problem or your mind is just occupied with thoughts, its always a good decision to take a walk.\n\nBy walking, you are not worried about speed or distance, repetitions or weight, you just move – leaving your mind free to focus on other things. When I’m worried or have troubles concentrating, I’m going for a walk. It helps me clean my mind, get rid of my worries. There is even a walking meditation if you’d like to try it (I haven’t). I usually feel way better in terms of concentration or worries – when I come back from a walk.\n\n## 4. It brings the explorer in you and teach you to appreciate whats around you\n\nHuman beings are explorers. Before creating a settlement, we used to wander in searches for the best place to settle. Close to water source, away from predators, uphill for easier defense. By walking daily – you feed the explorer in you.\n\nYou might have moved to a new neighborhood or live in the same one  for the majority of your life – but how much of it you really know? Can you navigate your way home from any point in your neighborhood without a GPS? Do you know to tell me where I can find a good park or a nice bakery in your neighborhood, without checking Google Maps? I’ve learned to appreciate this exploration, I found some nice restaurants, great parks that are few minutes of walk away from my home and it comes really helpful now, when my wife and I are looking to move to a different apartment. Before I’ve used to walk and explore my neighborhood or the ones close to it, I wouldn’t know who lives in each neighborhood. Is it a good neighborhood? Is this green spot on Google Maps a park or just  some grass with benches? But after exploring my neighborhood and the ones close to it, I know to say where good parks are located. What type of people live in each neighborhood. Whether its a noisy one because its located near a central street or a school or a quiet one because its full of small houses rather than tall buildings.\n\nIt also helped me to learn to appreciate things. When you walk, your mind is free to look around, judge the architecture, explore parks, smell the smell of fresh bread or coffee. The internet is full of  negative stuff, and by taking a walk I balance the negativity with positive appreciation. There was one day when I was walking and a light rain started, but instead of panicking and hiding I’ve just embraced it and walked under the rain, smiling.\n\n## 5. It gives you perspective on distance\n\nBefore I started to aim to do 10k steps a day, I’d look at directions to my doctors appointment, restaurant or a shop, in Google Maps and  judge its distance. 30 minutes of walk, to me back then, considered too long. I would opt for a bus ride or a taxi in that way, even if it took the same 30 minutes. My mind just wasn’t grasping 3-4km of walking as something bearable or worth doing. But after I’ve walked 10k steps for  some time now and realized that it takes around 1.5 to 2 hours and  amounts to around 7-8km – I look at directions differently.\n\nThe other day, I was invited to a gathering activity with my work colleagues. The walk was 45 minutes and 3.5km from the place I live. 5-6 months ago I would have never took that walk, if you’d asked me to. For me at that time, 45 minutes of walking is too much. Today I realize that walking back and forth is not even 10k steps. And by aiming to do 10k steps a day, I decided to take that walk. And was engaged in other activities such as catching up with family, listening to an audio book, exploring new locations and appreciating the beautiful world we live in.\n\n## How to start?\n\nI want to finish with some tips on how you can start building your habit of walking 10k steps a day. Remember 2 important principles:\n\n## 1. You don’t need any fancy equipment\n\nWalking is easy. You need regular cloth and shoes. You don’t need trainers or special equipment. You don’t even need a fitness tracker (however it did help **me** to kick start this habit) –  your regular smartphone probably have a builtin pedometer in it. Just take your smartphone, a pair of headphones and a nice audio-book or podcast – and go for a walk. You can even skip the headphones and the audio book and just walk – looking around, wandering, taking turns you never would have took. Just make sure your GPS works, so you won’t get  lost in your first explorations of the neighborhood.\n\nI tend to split my walks to two segments: one in the day and on in the evening. By taking a daily walk you also expose yourself to the sun which is important in order to get vitamin D, and since its hard to carve 1.5 hours of free time during a working day, I tend to do my longer walk at the evening, when I’m done with work. It also helps me do a mental shift between work and home. I spend most of my time in front of my computer, and sometimes its hard to do a mental shift between work and hobbies since I literally stay at the same place when my work day is over. Some people like to dress up to work even when WFH, and then when they finish work, they switch to their home cloth to signal their brain of a mental shift from work to home mode. I find it too much of a hassle, however taking a walk does the trick for me. If you have a dog, take it with you – it does good to dogs as well.\n\nI also suggest you start small. Identify how much you are doing right now. It  can be 2k or it can be 7k. And then try to increase that number by 1k for each week you were able to do it consistently. If you fail at your next goal, downgrade it back by 1k and do that for another week. For each intermediary goal – you should **not** feel any muscle pain or extreme struggle to do it. If you feel muscle pain the next day, or you find it hard to reach your goal, keep doing it until you find it easy and only then switch to the next thousand.\n\n## 2. Walking is better than nothing\n\nThere is no guideline as to how much time you need to put into active lifestyle. And I’m not a doctor – so consult with one first, but the general consensus is that you should do moderate intensity aerobic and anaerobic activities. However sometimes its hard, some days we feel lazy, and not everyone can workout daily. And walking is better than slumping on the couch.\n\nDon’t stress with the 10k steps **a day** goal if you don’t feel like it. I decided for myself that on days when I’m working out – I might not reach 10k steps. In the end my time in the day is limited and if I did 1 hour workout, I might go for a 30 minute walk that day instead of the full 1.5 hours. If I did a 20km bike ride, I  might skip the walking for that day. Because the end goal is to stay active and healthy, so I don’t want to stress about it if I’m tired after a workout or had a busy day and was able to dedicate only 1 hour for activity that day. But I do try to stay active **every day** whether its aerobic or anaerobic activity, or walking 10k steps.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n14cu9/why_you_should_aim_to_walk_10k_steps_a_day_and/", "title": "Why you should aim to walk 10k steps a day and how to start", "social_network": "reddit", "user": "JikoKaizener", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 227, "down_vote": 0, "creation": 1619702924, "permalink": "/r/DecidingToBeBetter/comments/n14cu9/why_you_should_aim_to_walk_10k_steps_a_day_and/", "nsfw": false, "first_save": 1635435262.3004565, "replies_charged": false}