{"id": "t5_2tand_t3_makmfc", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": " I am currently in my late 20s, and up until this point I can’t really say I’ve done much with my life overall. I’ve almost always put in the minimal effort in school and work, I’ve been bad with handling my finances, I made little to know effort to be healthy, I’ve barely ever dated or had any sort of romantic relationship, and I’ve done nothing to really address my anxiety, stress, mental and emotional issues. I’ve basically just gotten by because I’ve had a solid family and friend support system. \n\nI’ve always had some idea of where I wanted to go and who I wanted to be, but I never really had the drive or motivation to follow through and make it a reality. For the last few years I’ve been working in my chosen industry, but I had been basically working a position that offered no real career future for me, and basically was nothing but a dead end. I also had a side passion with some personal art projects, but I can’t say I was doing much in the way to further that either. Then two years ago, something happened, I think I saw myself from the outside and I got angry, angry at what I let my life become. I can’t be for sure I was aware of it at the time, but I do know I noticed that I started to make little changes in my life. I became more professional at work, I started to exercise a bit, I started working on a side art project again, and I began meditating. But still there wasn’t a long term plan in place.\n\nThen the entire world stopped. Like most other people the pandemic put a pause on many aspects of my life, and derailed a lot of my routines. But after a while, it also gave me a chance to get some perspective. It was a chance to see what I had been doing, and to see where I could go not just in a week, a month or a year, but five years from now. So while I waited, I planned. I looked and plotted a path for my career, a path for getting in shape, a path for getting mentally stable, a path to fulfilling my artistic goals, and a path for financial stability. \n\nSo, when I was finally able to step out of lockdown, I hit the ground running. Now up to this point I’ve lost 57lbs and I am over halfway to my main weight goal, I’ve been seeing a Psychiatrist for a little while, and I’ve received a couple arts grants for personal projects. Although the current gig I’m working still doesn’t offer any career future for me, it is paying me well enough that once I wrap out on it in a couple months, I will be able to transition to another department within my industry to start my real career path, and still stay financially stable throughout the process. \n\nSo this brings me to why I feel this is the most important year of my life. I know my plans and goals might shift or change for the next five years, but where I am now, and what I am able to do this year will help establish the foundation I can build the wrest of my life on, and give me the means to determine my on destiny going forward.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/makmfc/the_most_important_year_of_my_life/", "title": "The Most Important Year Of My Life.", "social_network": "reddit", "user": "FazersandLasers", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1616410219, "permalink": "/r/DecidingToBeBetter/comments/makmfc/the_most_important_year_of_my_life/", "nsfw": false, "first_save": 1635436998.145833, "replies_charged": false}