{"id": "t5_2tand_t3_lqd8er", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "b69cf201-6737-4217-b486-9096135546b8", "4b69452a-b1e5-47af-a734-ad3c2bdce185", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I guess Im just writing this out for me, I wont know if anyone even upvotes this let alone comments but here I go....\n\nMy PhD studies and my advisor emotionally burdened me into a depression that I brushed off as just being tired from school.\n\nIt feels like I lost everything. I grew emotionally distant from my gf of 3+ years so she bailed (other issues involved as well), my research papers got rejected, I was failing my last semester before I would transfer schools (I scraped it together at the last minute thank god), Covid delayed funding to my PhD program so I had to find a job outside research, I had to crash on a friends floor for over a month before moving into a 1200/mo apt with no guarantee Id get a job to pay for it (I did at the last possible moment thank god again).\n\nFor the past 3 months I have been trying to fill in my time trying to meet people (dating apps), play games, or just scroll on reddit - from being awake to passing out. But good LORD has that all backfired on me....\n\nDating apps? I can get approx 1 match a day on average if Im really dilligent about trying. Except for the approx 40-60 total matches I've gotten, approximately 99% just flat out ghost or unmatch. It has really really messed with my perceived self worth.\n\nVidya with the homies? I became dependent and desperate for friends to free up when I was free, to starve off the loneliness, and when I was done spending 9 hours hopping between games with diff friends, I felt it really wasnt that fun and instead of doing something beneficial I just spaced out the whole day.\n\nReddit? Well thats where every other second of free time goes. Waiting for something in line? Reddit. A game to load? Reddit. It takes me 2-3 hours to fall asleep because I wanna just lie down and check up on Reddit. I end up falling asleep during the early hours of my job for brief periods because my sleep schedule is so jacked up.\n\nI want to invest more time in my hobbies. I want to stick to a consistent workout routine and getting more fit. I want to research areas of interest for my dream role. Im just tired of feeling like Im wasting away potential to chase what I would love.\n\nI was never really active on this subreddit, but liked peeping posts from time to time. If anyone at all made it to the bottom here of my rant, thank you so much and I love you. Wish me luck!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lqd8er/goodbye_i_deleted_all_my_dating_apps_i/", "title": "Goodbye. I deleted all my dating apps, I uninstalled certain games that were just time sinks, and after I post this random 3am post, I will be deleting Reddit as well. Depression has taken the love out of my life and my hobbies, and Im off to find that passion again.", "social_network": "reddit", "user": "JmacTheGreat", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2120, "down_vote": 0, "creation": 1614068327, "permalink": "/r/DecidingToBeBetter/comments/lqd8er/goodbye_i_deleted_all_my_dating_apps_i/", "nsfw": false, "first_save": 1635435439.8872669, "replies_charged": false}