{"id": "t5_2tand_t3_pjyb44", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": " \n\n33YO SINGLE MOM IN NEED OF HELP!\n\n**Backstory:**\n\nWorked my ass of in HS to get into USC for journalism. Disillusioned the first year. Studied abroad the second. Dropped out and stayed abroad. Got a high-paying job offshore working around the world and had almost zero living expenses. Worked non-stop. Paid off my student loans and invested close to $100k in three years at age 23. Completed accounting courses online through different community colleges while offshore. Started working with a sustainable architecture company building off-grid homes while I was on land. My roomate committed suicide. Aftermath led to a romantic relationship with a mutual friend who helped me cope. He eventually became weary of my travels and convinced me eloping would help him feel more secure. Big mistake. Was on the way to W Africa for a big project when I discovered I was pregnant at age 24. My birth control had been compromised by the anti-malaria pills. My new husband did not want to keep the baby but I couldn’t get myself to leave the project and continued. As a mother I’d never be able to work offshore again. Kid’s dad became (more of) an alcoholic and couldn’t keep a job, no help there with finances or child care. Continued the accounting courses through a local community college during the end of the pregnancy and some after. Post-partum depression was a bitch. Dropped out of school again, unable to cope with the stress. My (now) ex-husband’s three DUI’s and frivolous spending on top of my little income used up the entire nest egg I worked so hard to save. Worked random jobs to stay afloat. Got a divorce.). Lost whatever was left. Won some consumer debt. My own father had a heart attack and needed help running his construction company. Moved into my childhood home to help. Started drinking to numb the pain of losing all my security so quickly. Focused as much as I could on my son but began losing more and more of myself to depression and addiction. A tinder date suggested I try engineering, so I got myself in school for electrical engineering (I know how it sounds). Pandemic hit. Lost my only form childcare (school) and dropped out of college (again). Drank heavily to cope until I just couldn’t do it anymore. Got sober. Homeschooled my son for the last year and continued running the company. I've paid myself less than $20k the last 4 years out of guilt (my parents are at retirement age and need the money, not an excuse but the one I used). Here we are today.\n\nI am 33yo, single, debt free (thankfully) with $15k in savings and literally nothing else (other than my very loved 9yo son and roller skating) and no current housing expenses (although unhappy with my location I can deal with it). I have been in denial and became stagnant but have finally accepted I will never recover what compound interest could have done with what I had at a young age. My old life is gone. And I am ready to move forward.\n\n**Here is where I need your help**, *DESPERATELY*. Where do I go from here? Is it worth the time and debt to go back to school, for the fourth attempt? I’m capable and know how hard I can work but I feel lost and as though it's too late. Some form of bootcamp? AAS? Apply for jobs based on my experience?\n\nBegging for any insight or advice anyone could provide. I’m stuck and I need help. Please. And thank you in advance.\n\n\\[**TL;DR**: Adventurous college dropout got good paying job and invested $100k by age 23 before unexpected pregnancy brought everything crumbling down. Tried going back to school several times, never stuck. Fast forward to now. Waking up from ten-year nightmare with little to nothing to show. Need help determining a direction and maybe some hope\\]", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pjyb44/how_do_i_get_back_on_track_after_ten_years_of/", "title": "How do I get back on track after ten years of losing myself?", "social_network": "reddit", "user": "soberskater", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1631056022, "permalink": "/r/DecidingToBeBetter/comments/pjyb44/how_do_i_get_back_on_track_after_ten_years_of/", "nsfw": false, "first_save": 1635435071.752504, "replies_charged": false}