{"id": "t5_2tand_t3_p1zkn2", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Disclaimer: I am grateful, as I know that it is a privilege to be able to stay home, but this is a post about how I FEEL. It is not my intention to offend anyone.\n\nMy bf (33M) (of nearly 7 years) and I (27F) have been staying home (we live together) since March of 2020. Thanks Covid! When I say staying home, I mean that I can count the number of times I have been inside of a building that's wasn't my home in the past year and a half on 2 hands. At first, it sounded amazing to be able to stay home together with no obligations of work or being social as we both love to be at home with our cats (yep, we're those people). But after the first 6 months or so, we started to realize that it's only fun for a little while (as did much of the world). With no end in sight, it can be very depressing. We ran out of motivation and energy to do the things we once did when the pandemic began. Our monthly at-home spa days, (2 person) game nights, kitty photoshoots, and adventurous home cooked meals gradually became non-existent somewhere around the 1 year mark.\n\nCut to present day. Even though it's summertime, I've still been inside most of the time because I live in Colorado and the smoke/heat this year has been unbearable! I won't speak for my bf, but personally, I have lost the motivation to do much of anything anymore. This includes basic tasks that are necessary for everyday life and things I used to find enjoyable. Now, they all just seem like a 'chore'. I mainly just lay in bed all day and watch tv or mindlessly scroll on my phone. Then, guilt starts to set in because I never want to do anything and the things on my to do list keep piling up. I was never a overly happy positive person before, but now, I'm so grumpy and negative and it's super hard for me to control, even when I'm aware of it. I don't find enjoyment in anything anymore. I can't even remember the last time I was genuinely happy. \n\nI can tell that it's really starting to affect my relationship with my bf (for obvious reasons) but I also don't know what to do to find my happiness again. I have tried medication and talk therapy and neither were a good fit for me. I know that I should try a different therapist or medication before I start complaining, but it's hard for me to muster the will because I feel like they did more harm than good (side effects and increased anxiety)!\n\nIt feels like no one really understands because a lot of the US has gone back to normal while I'm still posted up inside waiting for Delta cases to drop. I feel like people look at me like I'm just livin my best life chillin at home with no job but in reality, it feels like prison. I'm lonely, depressed, and deprived of socialization and purpose.\n\nAnyone have any advice?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p1zkn2/ive_lost_my_sense_of_joy/", "title": "I've lost my sense of joy", "social_network": "reddit", "user": "steg37", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1628633493, "permalink": "/r/DecidingToBeBetter/comments/p1zkn2/ive_lost_my_sense_of_joy/", "nsfw": false, "first_save": 1635437291.3356628, "replies_charged": false}