{"id": "t5_2tand_t3_q6pv3c", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "In hindsight I find it ridiculous on just how much my social lfie and life in general has relied on social media. How many of my most significant events have stemmed from something on a phone screen. How many of my worst obsessions with girls and rejections have been from social media. How often people have blocked me on social media because of these obsessions. And how much my perspective of people and relationships has been warped due to the fakeness of social media.\n\nSo I decided it was time to ascend to a higher level. I started talking to people more and more in real life and working on my social skills, which surprised me at how much it decreased my need to use social media to try to know people. I then started getting people's phone numbers so I could move all digital communication to my default messages app instead of Snapchat. I took a break from dating apps. There's wayyy too many people to meet up with in my classes anyway. I also used an app to place a daily time limit on my main social media apps. And I stopped scrolling through Snapchat stories/Instagram posts/stories as much. It takes a long time and is wayyy too exhausting, Instagram stories can be toxic, because they have too much politics and I'm not very big in politics, and some of my worst obsessions/crushes on girls have come from scrolling through social media and just happening to stumble upon their posts.\n\nOne day I hope to completely phase out social media from my life completely, and go for long periods of time without it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q6pv3c/gonna_start_pulling_back_from_social_media/", "title": "Gonna start pulling back from social media", "social_network": "reddit", "user": "CEO_Of_Rejection_99", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1634055721, "permalink": "/r/DecidingToBeBetter/comments/q6pv3c/gonna_start_pulling_back_from_social_media/", "nsfw": false, "first_save": 1635438205.488279, "replies_charged": false}