{"id": "t5_2tand_t3_lzrc6c", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Incoming, story time/rant.\n\nBefore I start, I just want to say, pick your arguments and your moments carefully. When the time comes to make tough decisions, back yourself 100%!! Never let anyone make you doubt yourself and your abilities! Never let anyone mistreat you! Be fearless and put yourself first! It’s time to look after you!\nAlso, sorry this is quite long.\n\nSo I’m an apprentice baker/pastry chef (F24). I am half way through my training and have experienced a lot of bullying and mistreatment from other staff and the boss. When I first started (as a pastry chef) I was given a lot of shitty jobs which I knew I would have to learn how to do anyway so I didn’t complain. A few months on and I wasn’t learning anything new. Instead I was doing other unnecessary jobs like cutting 60kgs of butter and pre-measuring ingredients into freezer bags so the others didn’t have to. I wasn’t learning how to make anything. Not even simple things. I started getting into trouble for washing up and was never allowed to read the stock count list so I never knew what needed to be made. I was LITERALLY told not to ask questions and was teased when I cried at work after my cat died (old age). I would work 12 hours shifts and literally not speak a single word to anyone.\n\nEventually, over time, they ended up with one baker. I expressed interest in learning how to make bread and that’s when I learnt that in the hospitality industry, bakers and pastry chefs don’t like each other one bit! I was told that bakers are stupid and selfish. I was shunned even more by the others, who were suppose to be my teammates. I was still a 1st year so I just sucked it up and never stood up for myself. Big mistake.\n\nFast forward a few months and I got to learn the bread and I absolute loved it! (Side note, I worked afternoon/night shift). This bakery is artisan so I got to make sourdough and it is truly an art form! I was treated well by the head baker and was encouraged to ask questions. He could hold a conversation and kept to himself. Rarely bitched and whinged about anything! He let me do nights all by myself while he supervised. I learnt more doing bread than doing pastry. I learnt how to make pies and sausage rolls, savoury and sweet products all from him. \n\nAs more time past they hired another baker and I got shifted off bread and onto a different section. I didn’t think much of it but I haven’t made bread in a few months now. This new baker and I didn’t get along one bit. He is so lazy, took every shortcut he could and always complained it was too much work. He never helped anyone else and left early most of the time leaving us to do (unpaid) overtime. We’d had a few disagreements in the first few months of him working there but one night we had a massive fight about him leaving early. I exploded in anger and called him some names. He was pointing at me and saying “hey hey hey” trying to shut me up which just made me angrier. I ended up texting my boss who came down to the shop. This was at about midnight btw. I told my boss I was ready to quit and called the other baker out on his lies in front of the boss.\n\nIn those few months, a couple of the pastry chefs moved away and I was told I’d be going back to pastry which I was dreading since I didn’t have a good experience previously. So the time came when I got shifted back to pastry. I got less than 24hrs notice to go from night shift and day shift. Literally opposite hours! I didn’t end up sleeping for about 28 hours since I’d slept all day preparing for a night shift to be told to start the next morning. I worked a morning shift and then had to stay awake so I’d sleep better the next night. I cried my eyes out after no sleep and being overwhelmed with the day.\nThe next day I went in to get a key from my boss but also to ask him if I could do pastry of a night time. He said no and argued with me for a bit but eventually we came up with a solution that I could do nights and do pastry. This change lasted LESS than a week! I got a text from him a few days later telling me he wanted me to do bread again. I didn’t reply but I was pretty happy.\nSo, I went to work expecting to do bread and the savoury food but was told that I would be staying on pastry. I was pretty disappointed. This resulted in an argument and him telling me I’m the problem and that I have attitude. I walked out and I haven’t looked back.\n\nThe boss texted me about 30 minutes later and tried to blame me for products they won’t have for the next day. I politely told him that I feel like a gap filler in his business and that I have no true place there. I politely told him that I’ve never been given reasonable notice to roster and role changes and politely told him his business is toxic and unhealthy. I identified his attempt to make me feel guilty which didn’t work. It’s not my business and no longer my problem.\n\nI am free!\n\nIn the few weeks leading up to this, I got pushed around a lot. In the months leading up to this, I learnt to stand up for myself. I always told myself that if the boss ever yelled at me, I’d walk out. I backed myself and my decision 100% and I’m so proud of myself.\n\nIf you are going through a hard time at work, whether you are an apprentice or not, don’t put up with other people’s bullshit. I 100% recommend leaving any workplace that is unhealthy, negative and holding you back from your full potential. NEVER let anyone mistreat you!\n\n*note, I had already lined up a trial shift somewhere else with the intention of leaving so walking out became a lot easier.\n\nIf you have made it to the end of this, I do apologise that it was so long. I tried to shorten it as much as possible without leaving too much detail out.\nI am so grateful for your time and I appreciate all of you! Thank you so so much you wonderful people!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lzrc6c/i_quit_my_job_and_i_have_no_regrets/", "title": "I quit my job and I have no regrets!", "social_network": "reddit", "user": "LazyBones2412", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 27, "down_vote": 0, "creation": 1615125999, "permalink": "/r/DecidingToBeBetter/comments/lzrc6c/i_quit_my_job_and_i_have_no_regrets/", "nsfw": false, "first_save": 1635437998.861644, "replies_charged": false}