{"id": "t5_2tand_t3_lngws6", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "A little background about myself: \n\nI’m a 24 yo student with (almost) a MSc in Computer Science, since spring 2018 I’ve been fighting depression and anxiety after a tragic year in my personal life, when I lost my grandfather for a doctor’s mistake during a heart surgery and my aunt due to suicide. After a couple months I also broke up with my now ex girlfriend after 3 years of a toxic relationship. I was going down a spiral, and had to finish up my BSc in the meantime, but I couldn’t get my shit together and did a lot of stupid and harmful things in those months. After a couple months, in fall 2018 I finished my BSc and started a MSc in another city, I moved away and felt it could have been a new beginning for me. I was dead wrong, I wasn’t rested at all and had to rush to graduate in time and start the MSc, which I did but I was basically burnt out: I couldn’t focus for 5 minutes straight, always found myself procrastinating or doing everything else beside studying. I passed just 5 exams in the first year and it was kinda shocking for me, since I was accustomed to be one of the best students of my class during the BSc, that killed my self esteem. \n(Note: in Italy University is quite different, you have different calls for each exam and you can pass them whenever you want within 2 years and a half from the beginning of the program)\n\nA little jump forward in time to 2019, December, I had to pass 15 exams within February 2021 to graduate in time. I had to activate “playoff mode” if I wanted to make it. I wanted to do it, so I studied my ass off. I passed 7 exams, not bad, but then Covid kicked in and basically I found out that I was hiding the pain and the problems I had under the carpet beyond the things I loved to do (that happened to be things that involve crowds, like concerts or watching soccer matches in the stadium) or getting wasted from time to time. After Covid started, I couldn’t run away anymore from problems I didn’t wanna face. I lost other people and my dog, but I wanna focus more on how I manage to survive all that shit and pass 15 exams, which is basically 75% of my MSc workload in 12 months.\n\n\nWhat I did\n\n- first, in April I went to therapy. It helped me a lot to deal with tons of unsolved issues. Really guys, reach for help if you need it, there’s nothing wrong about it. It probably saved my life.\n- I started to keep an agenda with a todo list, to schedule my day and feel awarded about the tasks I completed throughout the day (I’m using a really cool agenda called Panda Planner)\n - meditation has played a huge factor in my journey, I’ve started in March and it taught me that slowing down is particularly useful for focus and mood. Lately I’ve been trying goal-oriented meditation without knowing it was a thing, trying to visualize my the feelings I’d have when I’d have reached some goal, and it helped me grasp the feelings I could get when I’ll have finished every exam.\n- I’ve started using pomodoro technique (splitting study sessions in chunks of an hour, 50 minutes of hard ass studying and 10 of break), which helped me study longer and better\n- taking care of my body, working out and eating well. Mens sana in corpore sano. \n- opening up to the people I love about how I feel and seeking their support when I’m not okay. Previously I’ve always kept my shit for myself, but having someone that listens to your problems is a great way to cope with them, or at least you don’t have to pretend everything is fine when it’s not. \n- focusing on things I didn’t know well in the exams and prioritizing always the hardest ones\n\nBut probably, the most impactful advice I was given, and that I’m giving now to you, is the following: \nBe tender to yourself, be kind, be gentle, accept you’re not a robot and made of flesh and blood, with everything that come with it, feelings, tiredness, limits, and accept those. Don’t throw yourself down because you planned to study 8 hours but instead you studied 5, just notice it, don’t condemn you, go to bed with a big smile on your face thinking “today I studied 5 hours, what can I do to study more?”. Don’t let your failures define you, focus on what you’d achieved and be thankful to yourself for achieving it, analyzing what you could do to improve, but always being kind to yourself. Your successes define you, not your failures. And tell yourself you’re doing it because you want to, not because you can’t stop and take some time. You can. When I told myself I was studying because I wanted to but it wouldn’t have been the end of the world if I graduated a little later, and some say that might be a loser mindset, I was able to achieve everything I wanted. The entire world puts pressure on you, don’t do it yourself. We’re surrounded by many LinkedIn influencers that say how you cannot think about failure or you gonna fail because that’s a loser mentality, but to me it was the exactly contrary: looking at what I achieved instead of recriminating for my failures and practicing tenderness to myself made me succeed 3x than what I did previously. \n\nA couple hours back I got the grade of the very last exam of my life, passed it with full mark, an exam that I thought to be impossible, and in spring I’m gonna graduate right in time and with a good grade. I’ve cried for happiness, looking back at all the sacrifices I made and how I pushed myself, but with anything but love for myself. \nThis is my two cents concerning my experience, I hope someone finds some useful insights in it, a little bit different from the Motivation2study videos on YouTube. \n\nCheers guys, I’m gonna head back to celebrate! Take care!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lngws6/how_i_passed_15_exams_in_12_months_through_one_of/", "title": "How I passed 15 exams in 12 months through one of the darkest times of my life", "social_network": "reddit", "user": "carrett667", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 318, "down_vote": 0, "creation": 1613744276, "permalink": "/r/DecidingToBeBetter/comments/lngws6/how_i_passed_15_exams_in_12_months_through_one_of/", "nsfw": false, "first_save": 1635435862.7168024, "replies_charged": false}