{"id": "t5_2tand_t3_pqxcuv", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "badbd7e1-4692-457a-97bc-7317bdf8e5c1", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "I am just feeling so happy writing this. So for the past few months and even years, my sleep schedule has been fucked up. I would usually stay up until 2-3am and wake up at 9-10am feeling really miserable. I would use my phone to mindlessly browse YouTube or Reddit to get sleepy while at the same time trying to distract myself from the anxiety inside my head. \n\nI am currently living overseas, away from my family and girlfriend. It has been almost two years since the last time I met them thanks to the pandemic. I have been feeling so anxious about the future. If something ever happened to them, I would not be able to see them immediately. Heck, I wouldn't know when I would ever be back. \n\nHowever, last night was the night where I could fall asleep peacefully. The morning I woke up was the morning I felt so grateful and relaxed too. So here are some of the things that I did (hope they can help you too):\n\n1. Stay away from your phone. I turned off my phone and put it inside one of my kitchen drawers. Usually, I would place my phone next to me in my bedroom. However, by putting it away (really far away) and turning it off, it would really cost me a lot to try to reach it. So I guess sleeping was the better option. \n2. Don't engage in any internet discussion a few hours before your bedtime. Internet discussions or even debates are sometimes pointless but they often keep us energized and awake at night. Anticipating other people's replies usually really screws our sleep too. \n3. Make yourself feel comfortable. For me, it's noticing your most comfortable sleeping position (facing up, side sleeping, face down, etc.) and sticking to it. I also tried to rearrange my pillows so they could make me feel relaxed. Lastly, I adjusted my room temperature and tried to relax my muscles before going to bed as well.\n\nAnyway, I really hope that I can commit to this routine. Starting is definitely a challenge, but being consistent is another big challenge that I have to overcome.\n\nHave a nice weekend, everyone!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pqxcuv/for_the_first_time_in_forever_i_fell_asleep_at/", "title": "For the first time in forever, I fell asleep at 10pm last night and woke up at 6am in the morning", "social_network": "reddit", "user": "sumpitsehat", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 123, "down_vote": 0, "creation": 1632009492, "permalink": "/r/DecidingToBeBetter/comments/pqxcuv/for_the_first_time_in_forever_i_fell_asleep_at/", "nsfw": false, "first_save": 1635435986.3469832, "replies_charged": false}