{"id": "t5_2tand_t3_jd5f3x", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "I don’t know how to handle these emotions so instead I’m writing about them.\n\nHey everyone, I’m on day 6 of no weed which is the longest I’ve gone that I can remember in the past couple years. I don’t have a certain time period for my t break but for right now I’m shooting for a month.\n\nI had the most fantastic week so far. Work has been amazing. People started to notice my attitude has changed.\n\nToday has been one of my absolute best days of my life. Woke up at 6am and went for a run. Kept telling myself “who the fuck are you, out here running at 6 in the goddamn morning. Your an animal!” Ahah couldn’t stop smiling during that run.\n\n Got to work at 7:30 and was chatting with everyone (I’m usually quite reclusive and keep to myself) and meeting a bunch of new people (I just started working at a brand new store).\n\nOne of my coworkers told me I seemed different.\n\nAnother said that I always seem to be having fun whatever it is I’m doing.\n\nI walked past my supervisor and he said a casual “what’s up”.  Unexpected to him I opened up and said “honestly man I’m doing fantastic, this has been one of my favorite days of the year.” I saw him smile through his eyes and he said that was amazing and that it cheered up his day because he was just expecting me to say “nuthin much” or “doin good”\n\nThen for my break I go and sit out on the patio in the sun, reading my book and listening to Jack Johnson which was playing on the outdoor speakers while I watched families come in and out of the store.\n\nIt reminded me of a time earlier in the week when I was doing the same thing, reading out in the sun (except then it was dreams by Fleetwood Mac playing), and this girl I thought was really cute told me I looked really happy out there and that I had “main character energy”.\n\nAfter work I sat out on the patio again to do a self authoring program where I write about what I want my future to look like. This specific assignment was what I want my family to look like and I thought about sitting on a couch during Christmas time, listening to Michael Buble’s “have yourself a merry lil Xmas”, with a wife who loves me and a child ripping open their presents while I’m sipping coffee. I started to tear up in the middle of my work patio. \n\nGot in my car in the parking lot and now hear I am, so utterly fulfilled and satisfied with today I want to cry. I want to cry as hard as I ever have before and let out all the resentment and bitterness i have inside me but I can’t. No tears flow and It kind of hurts.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jd5f3x/6_days_sober_just_had_the_best_day_of_my_life_and/", "title": "6 days sober. Just had the best day of my life and I don’t know how to handle these new emotions", "social_network": "reddit", "user": "a-sad-chad", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2098, "down_vote": 0, "creation": 1602976846, "permalink": "/r/DecidingToBeBetter/comments/jd5f3x/6_days_sober_just_had_the_best_day_of_my_life_and/", "nsfw": false, "first_save": 1635435866.8170586, "replies_charged": false}