{"id": "t5_2tand_t3_o7uyb4", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "Disclaimer: I'm not trying to boast about my accomplishments or journey, just thought that I would share because it's something that I am proud of and also to hopefully inspire others with this snippet from my life. Also when I say \"social media\", I mean Instagram and Snapchat. I still use Twitter, Reddit, and Pinterest. Enjoy :D\n\nHi everyone!\n\nI'm just your average student in America. I remember downloading Instagram and Snapchat in December of 2018. I was pretty happy with it for a while, and then the COVID-19 quarantine situation hit. \n\nI've always thought of myself to be the person that was very social, amiable, and just outgoing. This isolation period proved to be the exact opposite. I'm at the age where being insecure is very normal, but before COVID, I never really felt it. During the quarantine, my school wasn't able to properly supplement the sudden switch to distance education. From March - May of 2020, I remember only meeting with my English teacher twice a week and my math teacher once a week. Let's just say that they gave everyone A's for that semester.\n\nObviously, with everything being closed, I found myself at home with not much to do. This is where I started to really let social media take over my life. I would often see my friends' posts about them going on vacation (yes, really!), or wearing a swimsuit, or anything that dealt with outward appearance. My friends took to learning makeup where I learned a new instrument. I started to notice the difference between my self-development and all the other girls in my grade.\n\nI started to hate myself for not being that invested in clothes or makeup. I wondered if me being more interested in academics and constructive hobbies made me a \"nerd\". Social media wasn't helping at all. I used to spend hours on my phone looking at these apps, and I would only feel empty in the end. What was the use?\n\nObviously, my following academic year was fully online, so I had other things to grab my attention. I don't know what got over me once the first semester was over. I just felt so sick and drained of everyone and everything. Those classmates that constantly talked about \"girly\" things proved to be racist, and would often single me out for being a person of color. \n\nSo, over winter break, I pulled my life together. I set a routine I wanted to follow, goals for the new semester, and awards I wanted to get. On January 1 of this year, I deleted my Instagram and Snapchat accounts. The wave of relief I felt was unbelievable.\n\nNow, I'm done with my academic year and am starting secondary (high school) in August of this year. Throughout the year, I ended up getting lots of recognition for my efforts throughout the year. I also ended up getting the highest rank in the science track at my school :D I don't know if deleting social media was the root \"root\" cause of how I ended up, but I'd like to think it played some role. Ever since, I've been much happier and more content with my life. I also spend less time on my phone and have cut myself off from the toxic people in my life.\n\nI really can't see myself redownloading Instagram/Snapchat. Honestly, I don't think they're crucial apps for me, and I think living without them has made my life better. \n\nIn the future, I hope to learn to take better care of myself. Deleting social media has done wonders for my mental health and I don't think I'll ever look back. Now, I want to focus on valuing my self-worth and learning to say \"no\" to people. I will update you all on how that goes.\n\nThank you for reading my little entry ! Have a wonderful and fulfilled day today <3", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o7uyb4/i_deleted_instagram_snapchat_on_january_1_2021/", "title": "I deleted Instagram + Snapchat on January 1 2021 and I have never looked back.", "social_network": "reddit", "user": "yashshouldstudy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 102, "down_vote": 0, "creation": 1624650175, "permalink": "/r/DecidingToBeBetter/comments/o7uyb4/i_deleted_instagram_snapchat_on_january_1_2021/", "nsfw": false, "first_save": 1635436288.200437, "replies_charged": false}