{"id": "t5_2tand_t3_q7mfip", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "The post may rub some people the wrong way.\n\nIt's hard for me (early 20s) to have any real interests or things I want in life. One of the big wants I have is money. So it makes me want to find a higher paying job because I feel like I have the potential to do it but if you tell me to look for what I enjoy doing rather than for money, I wouldn't have an answer. I'm sorry I don't. I got through job interviews like this by looking up what the progression is and giving a generic answer, i.e. 'I'd like to develop my technical skills in \\_\\_ and leadership skills and become a task lead, and then a group manager, etc.'\n\nMaybe I'm complaining but I've tried to try. I've volunteered, done therapy, joined groups, stepped out of my comfort zone, I majored in different areas in college and it was all mildly interesting but never something I really felt for. The job I do just for money. I've tried to get involved but then I fall back realizing it doesn't matter. I didn't feel more fulfilled. \n\nThe main thing I wanted was social.. to be in a group, friends, love, etc. As the way I've gotten older I was never able to really have closer friends, people I can actually be friends with. Acquaintances always, but never *real* people, you know. The closest reasons I got in therapy was social anxiety-- but also child trauma.. but my root feelings didn't change despite what I thought was taking action. I've also never had a relationship or anything that comes with that. That was really the only main consistent overarching goal in my life. It was the reason I put so much effort into going out of my comfort zone, going to random events just to try it out. Talking to people I didn't know. After pushing those boundaries, of even being open about my struggles with getting to know people, people have always been generally friendly, but I can't be them. I would feel so hopeful and happy after some of these interactions. I'd be alone again feeling like it could work out. I'd hang out with them slowly and then get to meet their friends, I thought. But I can't be them. I want to talk about the real topics, maybe they don't. Maybe they cancel a few times and I can read them enough to know it isn't the priority and then I no longer want to care. I can be loud and assertive but it leaves me feeling more and more empty the longer I try. Because I'll mess up once, no one says anything, or someone makes a comment about me and then everything falls apart. The feelings are there. I'm not better than you-- but I'm probably one of the few who would still be here fighting like I do, and then suddenly I'm *different*\\-- and it's enough and I need to go. \n\nThis doesn't mean I stop. It just means I realize I probably can't be the person who I *wanted* to be. The social person...but that's ***who I am*** right, that's me, I protest to myself. It's so frustrating because I feel like I can't solve this problem to take my content to the next level. I don't know what are the root of these feelings. Maybe I don't know because the pain brought my growth it is a lot of what I'm proud of. I want to do it for myself, but maybe I can't get over 'people came into your life because of your own work. what if you didn't try?'", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q7mfip/what_if_i_cant_change_myself/", "title": "What if I can't change myself?", "social_network": "reddit", "user": "Fabulous-Advantage", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1634164640, "permalink": "/r/DecidingToBeBetter/comments/q7mfip/what_if_i_cant_change_myself/", "nsfw": false, "first_save": 1635436702.09491, "replies_charged": false}