{"id": "t5_2tand_t3_pwihvl", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "4b69452a-b1e5-47af-a734-ad3c2bdce185", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": " I read through this subreddit quite a bit and try to help out wherever possible, and there is one important thing that stands out to me in a lot of the posts here. It is the language that people are using that is actually a major issue for many people.\n\nHere are a few snippets from some recent posts I read:\n\n* “I’m a ruiner. And now I just keep digging myself down further.” “I feel like I’m totally out of options.” “I have no will power, I don’t stick to anything.”\n* “I feel like a fucking loser for being in his late 20's and still living at home. Shit I'm so broke that I feel like no woman will want to be with me.”\n* “I am introverted.”\n\nNot trying to poke fun at anyone as they are people working hard to get better.\n\nWhat I will tell you is this:\n\nWhen you use language like above (and there are many more examples possible), you are not just describing your problem. You are **actively creating (or worsening)** your problem by using this kind of language.\n\nIt all has to do with identity.\n\nWhen you keep telling yourself I am X, Y or Z, those things start to sink into your identity. Those words become a part of who you are. So when you’re trying to improve yourself, the **first** thing you should be aware of and correct is the language you are using.\n\nBoth towards other people, but more importantly: to yourself!\n\n**Let me give you an example:**\n\nWhen you tell yourself you're an introvert, you become one. You see someone that you would like to get to know and want to approach, but you hear that voice in your head going: \"What are you doing? You're way too introverted to go talk to them!\" And so you never take that action.\n\nIt could very well happen that a woman sees the man from the 2nd example above. That she is interested and sends signals, but the man completely ignores them. All because in his head: \"there is no woman who wants to be with me\" and so he won't act on the signals.\n\n**How Your Words Affect You**\n\nBe especially careful with using \"I am\" statements. Your unconscious mind wants to stay consistent with who you say and think you are. Let's say you keep telling yourself that you're a loser.\n\nGuess what happens?\n\nYou're working hard and you're improving yourself! Going to the gym, studying more, looking for a job or starting a business, or dropping bad habits. You notice that you're making significant progress.\n\nUntil…\n\nYour (unconscious) mind goes \"Woah woah woah… we're supposed to be a loser remember? This is not who we are.\" And so you start sabotaging yourself and gradually (or abruptly) stop doing the great things you were doing! Until you move back to your idea of a loser.\n\nEver experienced that? I know I have.\n\n**So mind your words!**\n\nThe key lesson is to be aware of, and change your internal dialog!\n\nFor example:\n\nChange \"I'm an introvert\" to something like \"I'm just a bit scared and excited about going over to talk to them\". One is about the situation, the other one is a limiting belief about yourself (if you want to be more outgoing).\n\nChange language like \"I'm a ruiner\" to something like \"I'm not in a great spot right now, but I'm getting better and better every day!\". One leads to self-sabotage while the other is more optimistic and more likely to make a positive change rather than a negative one.\n\n**Making changes is hard!**\n\nI'm not here to tell you everything will be easy!\n\nMaking a difference in your life takes time and effort. But by the words of Henry Ford: \"Whether you think you can or think you can't, you're right!\". If you don't believe you can make the change, you've already lost.\n\nSo focus on getting the negative language out of the way while you're working on your goals! Stay positive and don't beat yourself up when you fall a bit short on a given day!\n\nBest of luck, you got this! :)\n\nMaikel", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pwihvl/if_youre_deciding_to_be_better_start_with_this/", "title": "If you’re deciding to be better, start with THIS!", "social_network": "reddit", "user": "TheUnchainedLife", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 713, "down_vote": 0, "creation": 1632753642, "permalink": "/r/DecidingToBeBetter/comments/pwihvl/if_youre_deciding_to_be_better_start_with_this/", "nsfw": false, "first_save": 1635436248.3602479, "replies_charged": false}