{"id": "t5_2tand_t3_cdc23r", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "So today some devine cosmic entity told me to man the fuck up. Not in some spectacular way really it was pretty bland but it was definitely heard loud and clear. People say a brush with death has enough impact to make you do a 180 in life but for me it was this fucking ant. \n\nYeah you heard me right. So I'm sitting there throwing a fit outside my house for some irrelevant reason and this godsend of an ant bit me right on my ass crack. It was at that irritating moment I realized I couldn't do it anymore. Just simply done. \n\nSee up to this point in my life everyday was a different metaphoric ant that kept biting me in the ass! Maybe I'm being melodramatic but everyday something would come up and just wreck my mood so bad that it was like an endless loop of rage which would always end with me in tears about my miserable existence. That literal ant was the umph I needed to realize that life's problems don't have to be a pain in the ass and you want to know why?? Because ants don't go looking for you. You have to happen upon them to wreak their havoc. In life you don't just blindly stroll into a problem situation you intrinsically seek it out. There had to be some underlining event or actions you took that brought you to where you're at now and boy did I do a lot of stupid, reckless shit that always ended up fucking up everything. \n\nIts time for a change and it really does happen that fast. You really can wake up and be like \"you know what I'm done being that guy time to be someone else\". It really is that simple. The hard parts keeping up with new you. I just hope the people I care about see me being the new me but whos to say they even care. All there is to it is repetition. Feed a stray dog every morning the dog will stay. Habits good or bad are kept the same way now I just got to feed the right stray dogs. \n\nAll I can really say is I am done being that sour puss aflicted by everything. I am gonna be that guy who has too much pep in his step. I want people to see me and be like why the hell is that guy so happy every day his life is miserable. Truth be told life is bliss what is there to it but that. It's how you live and how you choose to perceive every situation. Happy thoughts happy outcomes. Sometimes it can be that simple, right?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cdc23r/maybe_its_easier_said_than_done/", "title": "Maybe its easier said than done...", "social_network": "reddit", "user": "layered_onion96", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1563159602, "permalink": "/r/DecidingToBeBetter/comments/cdc23r/maybe_its_easier_said_than_done/", "nsfw": false, "first_save": 1635435644.5905027, "replies_charged": false}