{"id": "t5_2tand_t3_q49vge", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "f39f6441-79a5-42c9-8dca-c8455143a12a", "40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "Hey guys,ik this may sound lame but im a 22 year old who lives in Pakistan,with my parents (it's normal and encouraged to live with your parents here and take care of them as you grow older) but i wasted a few years in high school and enrolled late into university i have still 3 years left on my degree,the thing is im currently and independent on my parents financially and mentally,its gonna be 3 years to the degree 2 years to be even settled enough that i can be independent,but as time goes on i see my parents grow older and weaker day by day..im worried that my the time im graduating god forbid something happens to them what will i do like im comfortable thanks to god financially,like there is no worries but what scares me is that,if something happens to my parents what will i do,ill be alone and all like i have this whole house alone,and im not even strong enough to be my own man yet,and i dont get a chance to take care of my parents,i have a brother who is married and settled in Germany,im scared that ill be all alone,ill be a foster,my biggest fear is something happening to my family. Im very close with my parents and i rely them alot, through emotional distress and everything but im scared that unlike my brother who is blessed with a wife,a job and everything he needs Allahumdililah MashAllah but ill be all alone. How will i survive that i know that if anything happens i can go next door wake my dad up and he'll fix it in a jify,but what if he's not there,ill be waking up every morning knowing im all alone in this whole country. I fear that i didnt even get a chance to show my parents what i made of myself like my brother,i will never get to take them on a dinner buy them gifts with my first job,i fear that wont be able to get yelled at by my dad cause i didnt water the garden,i fear that i wont wake up and there will no one going on to take to the mall,i wont be able to be talk to anyone or just lay my head in my mothers lap and feel everything is okay,im very close with my brother but he cant be here physically,my parents wont be able to see that finally they rest i take care of them,i fear ill be waking up every morning without a sound and not hearing my mother get mad that the breakfast is getting cold..i just..am scared. Idk what will i do that before i even get a chance,ill be a foster with no one to make proud,and idk what the use will be of me achieving anything if my parents are not here to see it and be proud like they are off my brother. Im scared,idk who else I could vent this too and i just thought I'd drop this here and yk vent,im just very scared guys idk what will i do if god forbid something happens and I'm still just graduating and I look over there is no one there to cheer me on...im just scared of being lonely.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q49vge/confusion_about_what_would_i_do_without_my_parents/", "title": "Confusion about what would i do without my parents.", "social_network": "reddit", "user": "Arsalan_5658", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1633737021, "permalink": "/r/DecidingToBeBetter/comments/q49vge/confusion_about_what_would_i_do_without_my_parents/", "nsfw": false, "first_save": 1635435545.875291, "replies_charged": false}