{"id": "t5_2tand_t3_gfd9y7", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1", "e234981c-b061-4d83-8134-70d441847f74"], "text": "The title pretty much sums it up, explaining all the details would take an enormous wall of text, so I just hit the highlights. I was in a pretty awful place for the first half of the decade, but once I found motivation, the momentum carried me further than I ever thought possible. For the first time in my life I am dang proud of myself. Can't wait to see what the next decade holds.\n\n&#x200B;\n\nUpdate 1: Holy  cannoli. I genuinely did not think this would blow up like this. Thank you all so much for the kind words and congratulations. I am actually currently in the middle of my very last final (lol) but I will try to answer your questions/messages when I get a chance.\n\nAlso, I am happy to post the enormous wall of text that explains everything, so long as the moderators are okay with it. I am fairly new to Reddit and brand new to this sub, so I don't know exactly how it all works and don't wan't to upset any apple carts haha.\n\n&#x200B;\n\nUpdate 2: Okay, so this is really taking off. I am seriously so glad that you are all enjoying this. So a ton of people have asked for the giant wall of text, so I am going to post it below. Please do not feel like you have to read it all, it is incredibly long haha. Also I wrote it with the plan of posting it originally instead of just the title, but then realized it was insanely long, so it may seem repetitive.\n\nUpdate 3: Thank you all so much for the kind words!!! I am so glad this appears to be making its desired impact. I appreciate you all. I promise I will try to reply to all of your comments and PM’s over the next few days. Also moving in a week so I’ve got a lot on my plate lol. But anyways, I keep seeing a lot of people asking the same few questions, so I’ll try to answer a few here:\n\n\nQ: How was I re-admitted with a 0.9? \n\nA: My school had a policy that one calendar year after academic dismissal, you could appeal your dismissal and re-apply, a sort of second chance kinda thing I guess. I obviously took longer than that, but I had to write a letter of appeal, a plan of action, and I think a few other things. I was also on academic and financial aid probation for I believe the first 3 or 4 semesters after my return until my GPA and QPA met the minimum criteria. I am graduating from the same university that I failed out of originally. Hope that helps. \n\n\nQ: What diet did I use?\n\nA: I followed the P90x nutrition plan as best I could. Mostly just plain chicken, broccoli, and quinoa. No drinks other than water and black coffee almost all of the time. \n\n\nQ: Why engineering and law? \n\nA: Patent Law. \n\n&#x200B;\n\nAlso, to the people that are convinced I am lying, I will happily pm photo's of my transcripts, law school scholarship offer letter, weight loss pics, etc., whatever helps you sleep at night.\n\n&#x200B;\n\n&#x200B;\n\nOkay, here’s the original wall of text haha:\n\nForewarning, this is an incredibly long post. I just feel like everything is so interconnected that I couldn’t explain one thing without having at least two other things explained. I didn’t post this to brag. I posted it for two reasons.\n\n\\#1. I truly hope it will inspire someone who feels as lost as I once did.\n\n\\#2. Because for the first time in my life, I am legitimately proud of myself.\n\nIf you’ve got a few minutes, I hope you give it a read.\n\nTen years ago I failed out of college after three semesters with a 0.9 GPA. I was young and dumb and only cared about partying. I also believe that I was so genuinely afraid of failing, that subconsciously I knew if I just didn’t actually try, then I couldn’t technically fail. But that’s a whole other conversation.\n\nAnyways, I was 20 years old, I was morbidly obese, had a pack and a half a day cigarette habit, and only cared about partying. Embarrassed and ashamed, I moved back home with my parents and picked up a part time job in retail. With no real prospects or clear path forward, I just kept drinking and eating away my feelings.\n\nBy age 22 I weighed 360+ pounds and was working at an essentially dead end factory job that controlled my life, as it was union and did not have to abide by working hour limitations, so I often swung shifts and worked 12/16 hour shifts for months without a day off. I would work afternoon shift and then go out drinking and partying with coworkers until the wee hours of the morning and contribute absolutely nothing to society.\n\nI come from a very blue collar upbringing, so union factory work was considered a lucky career. Deep down I knew I was unhappy, but I had essentially made peace with the fact that this was going to be the best it would get for me. (Please don’t think I’m shitting on manual laborers, factory workers, or unions. They are essential and proud vocations and the backbone of our nation. Several family members and people I highly admire work in such careers, but I just always knew deep down it wasn’t meant for me personally.)\n\nNo degree, no significant other, heavily depressed, and living at home with my parents. My job was union, but I still only made $13/hr and had student loans to pay off that had been deferred for years while I was working part time, so I couldn’t even afford a cheap shitty apartment. Any extra money went to booze, fast food, and cigarettes to try and paper over my depression and feelings of inadequacy.\n\nThen, a promotion opened up at work in a different department and I realized that this could be a great change, so I applied. Luckily I was chosen (despite being a general piece of shit back then, I’ve always had a very good work ethic when it comes to manual labor) and it changed my life.\n\nThe first day on the new job, we came to find out that I could not perform one of the required duties because I was so overweight. It required entry into a confined space, and I literally could not fit my waist through the entry hole. This was the first time in my life that my weight had actually prevented me from doing my job. I went home that day feeling more embarrassed than I ever had in my life and I knew I had to make significant changes.\n\nI started researching diets and changed my diet the following week. Just by changing my diet, I lost 60 lbs in about 4 months. That’s how obese I was, that without even working out, the weight just melted off. As the weight went down, my confidence went up. I began doing p90x workouts (only completing as much of them as I physically could) and I quickly learned that my pack and a half a day habit would prevent me from seriously working out. Shortly after I turned 24, I quit cold turkey after 6 years of heavy smoking. I also seriously tamped down my drinking. I lost a total of 130 lbs in roughly 10-11 months.\n\nThese changes led to more confidence and I wound up applying for a position in management. I got that promotion too, which further boosted my confidence, and for the first time I felt that maybe I wasn’t forever destined to be a college dropout failure. The plant manager sort of took me under his wing and expressed to me how important it would be for me to have a college degree if I wanted to continue climbing, which I did. So in 2016, I re-enrolled in college to essentially start all over at the age of 26. I was terrified, but I knew I wanted it, so I left my career of 4+ years and made the leap.\n\nIt’s been a long four years, and I’ve made some more enormous changes to my future career path, but I will graduate Magna Cum Laude with a Bachelor’s degree in Electrical Engineering and an Associate’s Degree in Computer Engineering. I was originally dual majored, but then decided I wanted to pursue a Law Degree post undergrad. The type of law I plan to practice combines engineering and law, I haven’t become a serial degree collector or anything haha.\n\nSo I sit here today, finally graduating college with two engineering degrees, albeit 7 years late, and a full tuition scholarship to a fantastic law school. For the first time in my adult life, I feel genuinely proud of myself and like I am finally on the right path. I am not a pretentious or braggadocios person, and I hope that’s not how this post is perceived. I am just genuinely so damn proud of myself, finally, and I hope maybe my story can inspire others who feel utterly dejected, as I once did.\n\nIf you’re reading this and you feel like you’ve missed your window, or you can’t change your future, I am absolute living proof that you can, no matter your current circumstances. It’s never too late, you’re not too old, your past failures do NOT dictate your future. Just put your head down, put the work in, and stay focused. It’s so cliché, but I now firmly believe that anyone can accomplish anything if they put their mind to it.\n\nIt’s been an insane 10 years full of ups and downs, and I cannot wait to see what the next 10 years have in store. If you read through all that, I sincerely thank you and I hope that maybe I inspired you or that my story can help someone you know that’s struggling right now.\n\nSide note, there are actually a few more extremely significant things that happened during the bad times, however they are very personal and I’m not quite ready to share them with strangers. But yeah, even as bad as all that bad stuff was, it was actually even worse at points. Been a tough journey, but I feel like I clawed my way out of a personal hell. You can too.\n\nAlso, random fun fact, during this same time period after failing out, but before the factory gig, I actually apprenticed and became a professional tattoo artist for almost 2 years. That’s a whole other story, but yeah, if you feel lost or uncertain in your career path, don’t feel bad, I’ve tried my hand at several paths, obviously hahaha. Just find the one that feels right to you if you can and work your ass off. At least thats what worked for me, we all have unique journeys.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gfd9y7/a_decade_ago_i_was_kicked_out_of_college_with_a/", "title": "A decade ago I was kicked out of college with a 0.9 GPA. Saturday I will graduate Magna Cum Laude with two Engineering degrees and a full tuition scholarship to Law School. I also lost 130 pounds and quit a bad 6 yr cigarette habit during this time. It's never too late. You're never a lost cause.", "social_network": "reddit", "user": "billybates1933", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22082, "down_vote": 0, "creation": 1588879496, "permalink": "/r/DecidingToBeBetter/comments/gfd9y7/a_decade_ago_i_was_kicked_out_of_college_with_a/", "nsfw": false, "first_save": 1635436159.282009, "replies_charged": false}