{"id": "t5_2tand_t3_pehjmf", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "I don’t blame my parents, I believe their intentions were good. After all, they wanted me to get a degree that would guarantee me a job that would continue the family tradition. No useless distractions.\n\nSo I became a teacher.\n\nI didn’t hate it at first, I worked with many wonderful people, slowly climbing the ladder and getting more into educational field beyond teaching.\n\n5 years have passed like a minute, and one day I woke up feeling weird. It was the first time I’ve questioned my career choices, more accurately, the lack of MY choices.\n\nI thought it was just a phase, maybe just a burnout. I tried to love it, I did - I switched a few positions even, attended courses to further my education, took a few vacations, but the outcome was always the same — whenever I thought about my career, I wanted to cry. Panic attacks soon became the norm. I felt out of control.\n\nIt was too late for me to change things, I’ve invested too much time, money and effort. Art school that had been my dream for as long as I can remember wasn’t a choice, not for me at least. It’s for kids who are stubborn and passionate, not for a pushover that I used to be.\n\nI don’t know what happened, but last year it clicked. So what if I try to apply and fail? Nothing will change. So what if I’ll be 34 when I graduate - I’ll be 34 anyways. So what if I won’t like it — I can come back to teaching anytime.\n\nAnd so, folks, I did it. I took the entry exams and got the confirmation today — I’m gonna start college this fall!!!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pehjmf/my_parents_made_me_quit_art_and_not_even_think/", "title": "My parents made me quit art and not even think about art college. I’m 30 now and I’ve just found out I got into a Graphic Design course!", "social_network": "reddit", "user": "moisturizedNhydrated", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1784, "down_vote": 0, "creation": 1630328210, "permalink": "/r/DecidingToBeBetter/comments/pehjmf/my_parents_made_me_quit_art_and_not_even_think/", "nsfw": false, "first_save": 1635436114.6167521, "replies_charged": false}