{"id": "t5_2tand_t3_g92194", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I have just discovered this sub, having read a couple of posts you all seem nice and offer good advice so I figured I would ask for help from you all if possible?\n\nI guess, like everyone, I am a long story. I'll keep it short for now.\n\nI am a 35 year old male,  3 kids and happily married. I am not happy with myself. I don't remwber ever being, but I don't think I'm depressed, I just make stupid decisions and have to face the consequences of them.\n\nThe worst of which is smoking I guess, pot and cigarettes. I have smoked both since I was sixteen but I dunno why as at that age I was anti drugs. I have tried stopping a brazillion times and only ever last week's or a couple of months tops.\n\nComing off make me grumpy and my wife hates it.\n\nMy eldest is 16 and she makes my blood boil, I love her, she is fantastic but my god the attitude and pure disrespect - I don't handle it well and we end up on childish arguments.\n\nMy middle child is 11 and God she is gonna be so much worse than her sister. She is smarter and slyer, I worry about her less due to this, but she is gonna be very difficult unless I can change my ways.\n\nMy youngest is 5, oddly enought with the experience I have, I can handle him fine but still, I need more motivation to do things with him, although when I do, it makes the other two jealous as they are convinced he is the favorite child.\n\nOK so that's a bit of a disorganised rant, apologies, I guess I just want to be better. I need help and have tried so so so so many things so so so many times.\n\nI need help.\n\nThanks in advance.\n\n\nEdit- apologies. Wrong sub.\n\nPeace and love all.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g92194/hi_all_i_struggle_with_myself_and_need_to_do/", "title": "Hi all, I struggle with myself and need to do better, all advice welcome.", "social_network": "reddit", "user": "jebus3rd", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1587998801, "permalink": "/r/DecidingToBeBetter/comments/g92194/hi_all_i_struggle_with_myself_and_need_to_do/", "nsfw": false, "first_save": 1635438339.247508, "replies_charged": false}