{"id": "t5_2tand_t3_ki9rup", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36", "83780c3f-0425-40b0-bb3a-19c3a369b69b", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "At some point along this journey, I learned to value others opinions over my own. Once that seed was planted, it grew untamed and rooted itself into my experience. \n\nTime and time again, when I tried to choose myself, with both a huge fear since I was doing what I was taught not to do, and a knowing it was truly what I wanted, I seemed to be punished for it. This punishment came in all ways that perpetuated a sense of guilt, shame, and a feeling that choosing me was wrong and not to be done again. \n\nThis thread continued throughout my life. I eventually “learned” that others should get my focus if I do not want to disappoint, cause a scene, inflict pain into another’s experience, or be seen as selfish. So I stopped listening to the voice within. \n\nNot honoring yourself comes with so many consequences, it’s hard to know where to start. Valuing another’s opinion and experience over your own is a one way ticket to a place filled with low vibrations, discontentment, and unnecessary suffering. It is also is a breeding ground for resentment. \n\nAll these internal feelings that aren’t released cause dis-ease and disharmony here in this earthly experience. I’m finding that the only time I truly feel at peace is when I take aligned action for myself and move the focus from “them” to “me”. \n\nEven typing this out feels counterintuitive because somewhere deep down, that seed that was planted so long ago still exists, and I still have some feelings like focusing on me is selfish and wrong. But my life experience teaches me otherwise. My intuition tells me the truth: the only way I can contribute anything of value to the world is if I focus on me and stay true to myself. \n\nStaying true to yourself isn’t easy in a world teaching you to grind & hustle, spend money on things to make your better or more interesting, look a certain way to be acceptable and desirable, and to value your production over your well-being. We’re taught to work against ourselves from a very early age. We’re molded into what someone else wants from us instead of what we want from us. By shifting away from our own inner truth, there’s a disconnect that causes a tragedy: we can’t be our best version of ourselves because we don’t even know what that looks like. \n\nOver some years of healing, on a journey I’ll never be done with, I’ve remembered that the way I operate best is by doing what works for me. No matter how much I do for other people, the energy in it won’t be as pure if I do not tend to myself first. I cannot give to another what I do not have to give. And all I have to give is what I give to myself. \n\nWe’re here to live a life that we want to be living. Sure, there’s things in our daily life that we need to do, but most of the time we have SOME choice in how we choose to spend our energy. I hadn’t been choosing me for months and I was feeling the consequences through little-to-no energy, and an overall feeling of not liking how things were unfolding each day. \n\nI finally realized yet again that I am the one who chooses what to do with my time, and it’s time to focus my energy with intention and desire on me instead of with feelings of obligation and misery. \n\nOnce I came to terms with the fact that I get to choose my experience, I started picking activities that worked for me and my inner peace. It’s not work that I have to do on myself but precious actions I can take to help me feeling grounded and at peace, since my life was basically filled with anxiety and dread for a while. \n\nRealizing I have much to be grateful for, even during a global pandemic, was a huge shift also. Was my life really that bad? Or was that just a story I was telling myself? What was my reality and what was what everyone (like news outlets, people in fear, social media, society) tells me my reality is? How are they different? What is my truth?\n\nThere’s so many pieces of information we are lead to on this journey, but some of my most important ones are this: I am the one who gets to choose what I do. If you see this and feel resentment or that I’m wrong, I get it- I’ve felt that way too. I’ve scoffed at certain things that say this when I was experiencing grief from a close loss and when I was triggered from old traumas. “I didn’t choose that, and I didn’t deserve it”. This may be true, but I choose to sit in the stories and suffer more in a lot of ways than if I just choose to focus on me in those times and heal. \n\nWhat happens when you focus only on the experience bringing you pain? You suffer. What happens when you focus on only the “good side”? All that was repressed comes up again. What happens when you let yourself feel both? That is allowing this human experience to happen within you and it’s the healthiest way of being. \n\nI guess all of this is to say that staying true to yourself and your experience is so important and it really is the only way you can be authentically you which unlocks the greatest experience. Choosing what actions you take each day is how you can really take the reins in your life instead of letting life kick you when you’re down. \n\nRealizing that even though we can’t control everything that happens to us but we are responsible for how we respond to it, has been such an important factor in improving my life and it’s always a welcomed reminder when I’m stuck in “victim-mode”. I was stuck there for some time recently. \n\nThe past two days I’ve woke up earlier than I have in a long time because I realized that I choose my day. I have been understanding this more and more lately as I unpack old wounds and stories yet again. Instead of waking up at the last possible minute before I have to sign on for work, I spent a beautiful morning practicing yoga, meditating, drinking a wonderful superfood coffee replacement, journaling, and connecting within. And taking this time for me has allowed me to feel recharged and ready to contribute my energy to others in my life as well, with pleasure instead of with angst and resentment. \n\nYou have so much power in your life even when you don’t think you do. When you’re stuck in a low period, with unhealthy habits piling up it’s hard to see this. But spending just a few minutes on yourself, instead of everyone else around you, creates a palpable change in experience very quickly. And all it takes is your intention and action to really cause a big change in your life experience.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ki9rup/staying_true_to_yourself_and_taking_action_for/", "title": "Staying true to yourself and taking action for you is the best way to shift your energy.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 103, "down_vote": 0, "creation": 1608658060, "permalink": "/r/DecidingToBeBetter/comments/ki9rup/staying_true_to_yourself_and_taking_action_for/", "nsfw": false, "first_save": 1635437756.2325091, "replies_charged": false}