{"id": "t5_2tand_t3_euwqbw", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "Hey all, so I don't know if this is the place to post this, but it's worth a shot, mainly 'cause I don't have anywhere else to put this. So today I was at my lowest point in recent memory, and that was more than enough for me to put away my pride and seek help.\n\n2020 has not started out great, and it really didn't help that 2019 ended pretty rocky as well. It really all started when I got laid off. Looking back, I still needed help then, but at least I had work to keep me satisfied. With the loss of my job, I pretty much just applied for Colleges and Uni's around my city until one took me. A Bachelors of Science program took me in, and while I was delighted, a sense of being behind hit me like a ton of bricks. I've already got an Diploma in a Design field, so going back to College feels like I just waddled back with my tail between my legs. It really didn't help that I had so much free time to bum around and stalk my peers on Snap and IG. I know Gary Vee once said that it isn't about the Destination, rather it's about the Journey, and to stop looking at the Kardashians; but seeing the progress old friends and acquaintances have made compared to me really soured my mood. On top of that, I had to go overseas to see family, and while I love them, the main theme I got out of seeing family members my age is that they're well set to adulthood while I stumble in the dark. From overseas internships, successful relationships and fantastic school life; it was pretty clear they were doing great for themselves. As their family member, I couldn't be happier, but I felt awful for my parents, who could only muster \"MuffinCrumblez is going back to college and doing volunteer work.\"\n\nSpeaking of volunteer work, did you know you could run a New-Year event, manage multiple attendance reports, and prepare meeting notes & activities you aren't going to be there for, all while visiting your Grandmother, who just wants to hang out?! Yeah, me neither! There was a week where I was visiting my Grandma, and all throughout the week, my phone kept on ringing and ringing and ringing. I remember dining with my Grandma and some other family, and while I was saying grace, my phone wouldn't stop vibrating. It turns out, that my assistants, and others I had left in charge, were not doing the jobs I had assigned them to do. And when else fails, interrupt someones vacation, I guess. It got so bad, I had to ask to borrow another phone, so I can speak to the multitude of people that were trying to reach me at once. Needless to say, I was so embarrassed, and for the remaining time, I pretty much only turned on my phone at night, then dealt with those issues while everyone was asleep, costing me my sleep.\n\nIf that wasn't enough, the next day after I got back, I had a unit test, based on the textbooks I didn't have because my order got delayed. So, I take it you can guess what happened there. Fun fact, one of them is still not here, and I've only managed because a professor had a spare and mercy.\n\nI've only been in school for roughly 3 weeks, and I've never performed THIS badly, it was to the point where one of my professors and I had a meeting to discuss how we could keep me caught up. After that meeting, I did something I thought I'd never do, I broke down in public. You couldn't stop the Niagara Falls coming from my eyes, and the pathetic whimpers I was muttering while trying to compose myself to the nearest restroom. It was then, I decided to put away my pride, and go see a counselor.\n\nWhen my walk of shame finally ended, in me reaching the guidance office, it felt like the receptionist knew why I was there. She handed me the disclaimer forums I'd sign, and once I finished it, it was a matter of waiting to be seen. Those 10 minutes waiting we're some of the heaviest 10 minutes I've ever felt, because it really let me muddle over my failures. Once my wait was over, I finally met my guidance counselor, and judging by his reaction, and the fact that I fully broke down in his office, I think he knew as well. Now, to preface the next part, I'd like to say that I've never had any form of meaningful or lasting friendships; so hearing words of encouragement from my counselor had me bawling like a baby. When it was all said and done, I felt like I had someone on my side for once. We worked out a plan, they said that we should keep working on my issues, and that I should keep up with them on a weekly basis.\n\nI felt both relieved and revitalized after I got to air out my dirty laundry to someone who actually cares. I even told them of my abysmal Social Life, and was given some flyers to programs for people who wanted to make friends (yeah, some campuses actually have free classes on how to make friends, crazy right?). They really opened my eyes to it all, and getting my first genuine compliments ever (we went over my previous works in my diploma program) was enough to really appreciate waking up again. It taught me that there are people out there willing to help you back on your feet, and just listen if you need it.\n\nMy next appointment is this Friday, we're going to be discussing in-depth on some personal grudges and baggage I'm lugging around; seeing if there's anything we can do about it. I don't know how well this'll work, but here's to hoping these first steps of putting my ego away will build into something better. :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/euwqbw/i_went_to_get_therapy_counselling_in_the_first/", "title": "I went to get therapy & counselling in the first time in... ever.", "social_network": "reddit", "user": "MuffinCrumblez", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1580168339, "permalink": "/r/DecidingToBeBetter/comments/euwqbw/i_went_to_get_therapy_counselling_in_the_first/", "nsfw": false, "first_save": 1635436205.4456234, "replies_charged": false}