{"id": "t5_2tand_t3_dsdney", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "I am 28 years old, come from Germany and for about two and a half years now I have been dealing with the topics of happiness, meaning of life, reality, truth, read books, and so I also came across meditation, Buddhism, study groups and other interesting things and concepts.  \nI often have inspiring thoughts in the morning & today I had the idea to share some of them with you. I would also like to mention that I formulated the whole text in German and had it translated from a website. If something reads bumpy, it could be because of it. And I also considered in which subreddits this text would fit best. I think its appropriate appropriate...  \n  \nOne of the most important things is undoubtedly the development and cultivation of **mindfulness**. Without mindfulness you don't know what is happening inside and around you. Without mindfulness, you won't know what actions lead to pleasant or unpleasant experiences, such as what is important to free yourself from unhealthy habits and to pursue things that are important to you. There is so much more to write about, but mindfulness is definitely a key to liberation.  \n  \nThen I want to emphasize the importance of **intentions**. From various completely different sources, such as mindfulness, and now also from personal experience, intentions are very important. What are your intentions?  How often do you realize them and keep them in mind? In Buddhism, the intention is crucial whether what you do is healing or unhealing. Makes sense to me, also experience-based. A simple example I can think of would be the homeless person asking you for money. Either you give something or you don't. Why? What are your intentions? And how do you feel about it, what do you perceive? Observe yourself. For example, I have found out that for various reasons I feel most comfortable when I unconditionally and without thinking about it give some of what I currently have with me. Out of benevolence and generosity. And also to condition my mind accordingly, to set impulses.\nSomething may seem \"good\" to the outside, but the inner intentions may be \"bad\". What matters is not so much what you are doing, but with what intention you are doing what you are doing. Do you want to be helpful even when you don't feel like it? Would you like to practice living more consciously and attentively? Or be friendly and compassionate? Calm and grateful? Trusting and confident? Do you want to learn and develop? \n(e.g. Why do I write this article? Do I want to inspire, help, share or do I want attention/upvotes? Do I want to teach, convince, missionize? Or a mixture or something completely different?)  \nIntentions can be consciously chosen and maintained. e.g. friendliness, serenity, react to unpleasant things with acceptance and compassion, and so on. etc. I once wrote down what I wanted to cultivate as basic intentions - what are your basis intentions? How would you like to meet yourself and others and the ups and downs of life in all its facets?    \n  \nThen I would like to highlight **compassion**. More precisely, I mean **loving kindness**, Buddhist metta.  Here you develop and cultivate the wish that you and all other beings may be well. You practice meeting yourself and other people with kindness, compassion, forbearance, leniency, benevolence. As well as mindfulness and intentions, this subject has a transforming effect.  \n  \nI also find the meaning of (not-)wanting and attachment exciting and similarly important. According to Buddha, the basic cause of suffering is \"the attachment to the **desire to have** (craving) and the desire not to have (aversion)\". Here I would like to add that **attachment** does not only mean the desire (not) to have, but also that you want it to be fulfilled. I find demarcation and differentiation important. Learn to let go of the clinging to the fulfilment of the will. If you can also be satisfied with not getting what you want, you gain freedom.   \n  \nI almost forgot **gratitude**. The development and cultivation of gratitude. Gratitude is an expression of appreciation and satisfaction with the present state. Being grateful for a warm, soft bed. For warm water, healthy sense organs. Be grateful for the huge selection of food. Be grateful for the availability of knowledge. Practise being grateful for the small and obvious things.  \n  \nI find the following things worth mentioning in this whole context, I make it a loosely disjointed enumeration:\n * Letting go identifications & expectations    \n * *(...) So stop devoting your life to avoiding pain. (...) You must learn to overcome the tendency to avoid pain.\"*  \n * Do not resist, do not avoid, do not judge, do not presume, do not take personally, do not want to be right, do not cling/hold  \n * Love your humanity, your inadequacies, your weaknesses, your corners and edges, your ego  \n * Forgive the mistakes of yesterday, be grateful for today  \n * Basic trust (that all will be well), letting go  \n * Devotion  \n * The heartwarming Buddhist Metta-Sutta  \n * Breathe & smile  \n  \nI have certainly forgotten some things, e.g. I could still talk about the importance, usefulness & meaning of **meditation**. Or about the ego, or about impermanence,  that might be too much and too incoherent. However, this is an excerpt from my personal collection of wisdoms. I hope I was able to help or inspire someone. What do you think? Stay tuned, you are not alone! May you be happy", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dsdney/what_i_have_learned_so_far/", "title": "What I have learned so far", "social_network": "reddit", "user": "AsgarGER", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1573030296, "permalink": "/r/DecidingToBeBetter/comments/dsdney/what_i_have_learned_so_far/", "nsfw": false, "first_save": 1635437706.3166487, "replies_charged": false}