{"id": "t5_2tand_t3_hzz3gt", "request": ["da3e72ac-2059-4c8f-99c6-52edffdec3d2", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "Got up at 3 am today and worked. This was a childhood routine but today I did this for first time since 2018.  Survived multiple depressive episodes. The previous one almost choked me. Having figured out a lot of things, I am waving good-bye (hopefully) to the egregious monster called Depression.\n\nHere is the juice of my crushed -self.\n\nGENERAL:\n\n1. *KNOW THYSELF MACROSCOPICALLY* : If you are post 25, chances are that you have already taken a form. You are already an artist, a business professional, an engineer etc.  *from the inside.*\n2. Don't even think to undo yourself : THIS WAS MY BIGGEST MISTAKE. You want to run a business but it's too risky, you want to be a dancer but it's too late, you want to go left but the world points on the right because .... logic/reason/fashion/risk....or You sit and think to change yourself for your loved ones......  \nGive it try. Your own fire will burn you sooner or later. \n3. Life is multidimensional. There are many boxes to fill. Only a good career will not satiate you and neither will a family all by itself. Satisfaction and fulfillment arrives from concoction of multiple things ( which change person to person)\n4. Look on the inside, *first* : \"What mistake of mine has brought me here?\"\n5. There will be FEAR, ANGER, SADNESS, CONFUSION in the way and its perfectly natural. \"We all have fear but only some manage them properly\".   \n(Reference: Susan Jeffers' -Feel the fear and do it anyway)\n6. Life is a process.   \n( Reference: Thomas M sterner - The practicing mind)\n7. Life is Non-linear.   \n( Reference: James Gleick - Chaos) \n8. AUTOPILOT isn't natural. It takes 21 days to build a habit but less than to lose it. Same goes for other things. You have to build in the first place and then maintain.   \n( Reference: Daniel Coyle - The talent code)\n\nAdvice on Depression\n\n1. ***KNOW THYSELF MICROSCOPICALLY.*** Go into OBSERVATION MODE. Check if there is any dissociation. Identify your thought patterns. Identify your behaviors, your words, your feelings. \n2. **Talking to a therapist WORKS**: Even if you know what got you in the mess, even if you say that the therapist just tell you back what you tell them, a conversation with professional will help. I can debate this. \n3. Depression is your enemy. Punch it on the face and Yes, **Keep Punching**. That's the only way to beat it. (A hint from science: **\"*****We are in the game of frequencies*****\"**)\n4. **Community support** helps!\n5. **Conscious action.** You know what I mean.\n6.  **Reinforcement**:  This can change life! ( Reference: B J Fogg). \n\nIf you have made it till here, just say - 'I am AWESOME' ( practical reinforcement :D)\n\nFinally a personal belief: *Human consciousness is like a running water. If you do not lift it up, it will run down, no matter who you are.* \n\nThank you.  \nKeep walking.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hzz3gt/ending_a_journey_with_a_list_of_lessons/", "title": "Ending a journey with a list of lessons", "social_network": "reddit", "user": "NeonatePhoenix", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1596022280, "permalink": "/r/DecidingToBeBetter/comments/hzz3gt/ending_a_journey_with_a_list_of_lessons/", "nsfw": false, "first_save": 1635438092.9561186, "replies_charged": false}