{"id": "t5_2tand_t3_p6ah3o", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "b69cf201-6737-4217-b486-9096135546b8"], "text": "I stopped watching **censored for my own personal respects** (a few weeks ago). I stopped smoking herb. I stopped drinking alcohol (wasn’t a daily user but I want everything clean). I cut back on social media heavily, all I have is Reddit and a new insta where I spend less than 30mins per day on now (before I would always go over my limit of 2 1/2 hours).\nI walked away from people I wanted to build with but at cost of my own boundaries and self. Or maybe even them. \nI recognized my own toxicity and have been rebuilding myself + acceptance and self love for years. \nI cleared the slate of the therapists who mistreated me during treatment. \nI signed up for healthcare and finally saw a doctor even if I still have to follow up on some things. \nI began to journal again, I communicate my needs now. \nI left jobs that further perpetuated the pain of my disability. I have started to pay attention to my credit again instead of pretending like it’s something I can’t acknowledge. I went into eating healthier as much as I can in my current environment. I started taking vitamins daily again. \nI have no job, no car, technically I’m housing insecure as I stay with a family member who has control issues and at any moment can just kick me out. \nI have wanted to go back to school for years and finish my degree as I have none either- just about half completed to any sort of degree. In order to do that, I have to pay. In order to have all that I need I must work for it. \nSo to get all the things I need to continue living my best life, I need an awesome paying job- so I stopped lowering my standards and raised them. \nI apply to jobs that I may or may not be qualified for but pay better than what I once signed myself up for. I have no leads, but I’m not completely out of hope bc something has to turn the cheek for me. \nI am doing everything I can think of to make my life better. \nI’ve had a really hard life and none of this is easy for me, especially not smoking bc it really is self medicating. \nI’ve been ripped apart since my grandma died a few years ago among going through some harrowing things I will not put on here. Grandma taught me to be the person I am. I promised her on her deathbed that I’d make her proud. Her death hit me harder than I excepted and I spent time trying still, but I was so wrapped in grief that I really was blind to my own self-sabotage, I am starting over now, with nothing to call my own or anything currently going for myself besides my motivation, goals and change in habits that I consider impactful to my life. \nI’m posting this to continue holding myself accountable and tell someone, somewhere that I’m going to do it. I’m deciding to be so better, better than I was before I lost my grandma. I’m going to make both of us so proud. \nHopefully in the months to come, or even sooner- I’ll have that nice job, I’ll have a car again, I’ll be back in school, I’ll be living on my own, I’ll have a HELPFUL, amazing therapist+medical team, eating clean and living my best life with both enhanced relationships &amp; new ones. I believe in myself and that’s the biggest thing I’ve needed to be better. \n\nTLDR; 3 years ago my grandma died and she’s the reason I am the person I know myself to be. The grief caused me to self sabotage, lose all I had set going for myself (eating clean, stable working, college, living alone, having a car, staying on top of having a therapist, standing in my self love). I promised her before she died I’d make my life great for the both of us and I am finally very serious about it.\nIf you’re grieving/recovering, you’re not alone! You can and will get better. Remember to believe in yourself &amp; stay focused on what matters.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p6ah3o/ive_late_20s_f_dropped_everything_this_is_going/", "title": "I’ve (late 20’s F) dropped everything. This is going to be long so please bear with me if you’d like. I have a clean slate to build anew. TLDR at the end.", "social_network": "reddit", "user": "queenseauni", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 24, "down_vote": 0, "creation": 1629228200, "permalink": "/r/DecidingToBeBetter/comments/p6ah3o/ive_late_20s_f_dropped_everything_this_is_going/", "nsfw": false, "first_save": 1635435360.6331952, "replies_charged": false}