{"id": "t5_2tand_t3_hw08t5", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "So, 2020 has been rough for most of us, but I'm trying to view it as a blessing in disguise and as a transformative (or \"chrysalis\") year. \n\nContext: I am (was) a 2nd year teacher. I have been struggling with anxiety my whole life but teaching seemed to make it much worse, especially this year. I was suicidal, I wasn't eating or sleeping, I cried every day after school etc. I finally had a complete mental breakdown in March and was granted medical leave. Then COVID happened and the world shut down. \n\nThis prompted me to start an intense journey of self-improvement. Some of the things I have done are the following: \n\n- started therapy with a psychologist who doesn't allow for any BS, she calls me out when I make excuses and it's been life-changing, though painful at times\n- started walking outside every day on my doctor's recommendation; the sunshine, fresh air, and endorphins have done wonders for my mental health\n- got the guts to go on my first-ever real date; I've been wanting to date for so long but I'm so scared that nobody will like me that I don't put myself out there\n- started work on my fear of intimacy, which led to me losing my virginity\n- finally took care of my physical body by starting physiotherapy, acupuncture, and massage to fix pain that I've had for years\n- rejoined a gym and started weightlifting again\n- got a cat, who brings me great joy\n- got a sleep assessment to understand why I have such difficulty sleeping\n- resigned from my teaching job and began to examine what I truly want\n- started being more careful with my money in order to save for a house\n- hired a personal trainer and nutritionist to help me get into better shape and be healthier\n\nI know 2020 has been shitty for a lot of people. Quarantine has been tough on my mental health and, unfortunately, job hunting is taking longer than I anticipated.\n\n*However*, I had wished for a long time that I could just pause my life to focus on myself, so I'm choosing to use this worldwide pause to my advantage. \n\nOnwards and upwards, 2020.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hw08t5/2020_is_my_chrysalis_year/", "title": "2020 is my chrysalis year", "social_network": "reddit", "user": "laurenthebrave", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 43, "down_vote": 0, "creation": 1595445924, "permalink": "/r/DecidingToBeBetter/comments/hw08t5/2020_is_my_chrysalis_year/", "nsfw": false, "first_save": 1635437017.1870499, "replies_charged": false}