{"id": "t5_2tand_t3_oaie92", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "Most of the problems that we face in our lives is due to our poor emotional management skills.  Growing up I struggled with understanding my emotions and with expressing them in healthy ways. Some difficult life circumstances led me to repress my emotions. As I will explain in this article, repression is an unhealthy defense mechanism. When I finally got the courage to express myself, I experienced the opposite problem; I would get overly emotional. Finding a healthy medium between repression and emotional explosion is crucial to one’s well-being. Here are 10 ways to improve your emotional health. \n\n**1)** **Understand that all emotions are equal.** \n\nOne of the unfortunate things about the way most of us view emotions is the emphasis we face on happiness and the dismissiveness we show towards other important emotions. All emotions are equally important, and we must treat them with care and respect. Fear is our intuition; it lets us know when are in danger. Anger allows us to set boundaries. Sadness lets us release things that are no longer working for us. Shame allows us to restore integrity. “The Language of Emotions” is a great book that talks about this topic in depth.  \n\n**2)** **Do not chase happiness.** \n\nHappiness is a fantastic emotion. When you are happy, content and feeling joyful about life, you feel like you’re on top of the world. With that being said, happiness should not be chased. You should allow happiness to come and go as it pleases, just as you would with any of your other emotions. Chasing happiness and putting it on a pedestal will ironically lead to unhappiness. Don’t force things. Happiness should come as a by-product of a life well-lived. As it is explained in the book “Flow”, happiness sometimes comes during the flow of things, for example when you are in the middle of working on a project that you are passionate about\n\n**3)** **Do not argue with irrational people.** \n\nThere is little that will diminish your quality of life more than arguing with toxic and irrational people who will bring you down. As a healthy person, you want to live life with calm and centered energy. Furthermore, you want to understand that time is your most valuable resource. Why waste your time on people who aren’t worth it? Why get involved in drama? It’s pointless. It will ruin your mood, ruin your good vibes, ruin your energy, and make you overly emotional about things that don’t matter in the grand scheme of life. \n\n**4)** **Become healthy in other areas of life as well.** \n\nBecoming physically and socially healthy will help you become more emotionally healthy. The human body and mind are interconnected. Exercise, for example, positively impacts serotonin levels in your brain. The same can be said about a lot of healthy practices, such as eating well, sleeping well, socializing, etc. Being healthy will boost your mood and improve your emotional well-being. \n\n**5)** **Do not repress your emotions.** \n\nBottling up your emotions will never end well. Not only will you not develop the skills it takes to understand your emotions and to communicate clearly and effectively, but you will also suffer with physical and psychological health problems over time. Expressing your emotions in healthy ways might not always be easy. Take it one little step at a time and get some help if you need it. When you feel a certain emotion, do not push it to the side; stick with it until it passes naturally. \n\n**6)** **Do not get overly emotional.** \n\nRather than having an emotional outburst and embarrassing yourself, learn how to express yourself in healthy ways. This might be the act of talking to someone who has hurt you and letting them know in respectful terms how it made you feel. It might be the practice of going to the gym and letting off steam. It might be the act of journaling and writing about your thoughts and emotions when you are feeling overly emotional. Whatever your method, it’s important to express yourself and to let off steam in a way that is healthy and socially acceptable. \n\n**7)** **Minimize stress.** \n\nWhether it’s hustle culture, toxic positivity, or social media, we live in a world that is filled with unnecessary stress. Our brains and bodies have not changed much in thousands of years. However, technology and culture have changed drastically in the last few decades. Our brains sometimes struggle in dealing with the fast-paced technology-driven world of the 21st century. It’s important to try to minimize stress as much as you can. Take a break from your phone. Go outside. Have fun with your friends and loved ones. Go on a hike. Get some fresh air. Whatever you do, take time to disconnect and to enjoy life. \n\n**8)** **Live for yourself, not for others.** \n\nLearn how to say “no”. Every day we are faced with thousands of decisions. Make sure that you are choosing what is best for you and what is best for your emotional health. Do not allow external forces to dictate and influence your life and your decisions. These external forces include parents, school, society, teachers, etc. At the end of the day, the only person that knows what’s best for you is you. Listen to your inner voice. \n\n**9)** **Be mindful of the present moment.** \n\nA lot of us spend the majority of our days either dwelling about the past, stressing about the future, or indulging in escapism. We escape reality because we are afraid of confronting it. The reason some people play video games, watch Netflix, scroll social media, do drugs, and drink alcohol is because they want to escape reality. Stop escaping reality. Come to terms with your past, minimize worry about your future, and stay mindful of this present moment. What can you do right now to make yourself smile? What can you do right now to improve your life? \n\n**10)** **Get help if you need it.** \n\nSometimes, all of the steps above won’t help you to the degree that you want because you are in need of external help. There is nothing wrong with this. Sometimes life gets so bad that you can’t do it all yourself. Get a therapist if you can. Contact friends and tell them that you need them. Utilize some of the other services that are out there for people who need help. \n\n**Final thoughts.** \n\nI’m not an expert when it comes to emotional health; not even close. This article is simply a collection of my thoughts, observations, and experiences. I’m sure that in the years to come, much of my thinking will improve, as is usually the case with the passing of time. With that being said, I hope that some of you found some these ideas helpful. Best of luck!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oaie92/10_ways_to_improve_your_emotional_health/", "title": "10 Ways To Improve Your Emotional Health", "social_network": "reddit", "user": "RossWriter", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 31, "down_vote": 0, "creation": 1625003561, "permalink": "/r/DecidingToBeBetter/comments/oaie92/10_ways_to_improve_your_emotional_health/", "nsfw": false, "first_save": 1635435787.239087, "replies_charged": false}