{"id": "t5_2tand_t3_aln4no", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "I’ve always had a problem with this. All my life I’ve thought of myself as a good friend- someone who has people’s backs, with a kind word and a shoulder to cry on during times of difficulty and joy and laughter when there are things to celebrate and appreciate. \n\nBut there is a worm buried deep within this metaphorical apple of life and it is bitter and cold and full of shame and guilt and anger and it’s made me question whether or not I’m really a good friend, or just someone wearing the costume pretending to be one. \n\nI have so many close friends in wonderful committed relationships, and I just ended a very bittersweet long distance relationship after almost four years. Even during that time I always felt jealous and upset when my friends would tell me about the wonderful things their boyfriends would do for them, the gifts and dinners and time spent together that seemed all taken for granted by their recipients, and my own loneliness and pain would be amplified tenfold. \n\nConversely, when my friends fought with their significant others or struggled in their relationships, I would always feel a wicked sense of delight tickling the back of my throat as I comforted them and gave them advice on how to move forward. I mean, I get feelings of schadenfreude reading about other people’s sufferings on Reddit don’t get me wrong, but my own friends? I feel like a terrible human being. \n\nI don’t want to be like this. My insecurities are my own and I want to deal with them without comparing my situation to another or feeling upset or jealous over my own current condition. I hate that my best friend is so happy with her boyfriend and I can’t be 100% happy for them too. I don’t want to be a miserable old crone sitting in my little wooden hut hissing at small children because I can’t let love into my heart. How do I get over this? Where does this pain come from and how do I start to heal it?\n\n): ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/aln4no/how_do_i_get_over_feeling_jealous_and_unhappy/", "title": "How do I get over feeling jealous and unhappy over other people’s joys, and stop the schadenfreude when other people suffer?", "social_network": "reddit", "user": "chichichimichangas", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1548920034, "permalink": "/r/DecidingToBeBetter/comments/aln4no/how_do_i_get_over_feeling_jealous_and_unhappy/", "nsfw": false, "first_save": 1635436212.8275146, "replies_charged": false}