{"id": "t5_2tand_t3_hwkx4m", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "TL:DR at bottom\n\nFor the longest time, I’ve always felt like I was just going through the motions, never getting anything real done. Going to work at a mindless job, staring at my phone through breaks, then going home and watching shows or playing games, going to sleep, repeat. Even on my days off I would just hang out, relax, watch shows and play games, just trying to recover from the burnout of working. Nothing was changing, I never really felt active. I always chased comfort over doing hard things, things I knew I needed to do but just *wouldn’t* do. I felt depressed, and the knowledge that I was wasting my time and my life just sapped all my energy and made it even harder to get out and do things. Or at least that was the justification I made.\n\nSo what am I doing about it? This isn’t just some “today is the first day of the rest of my life” post, I wouldn’t be comfortable posting this until I made a change on my own. For starters, I forced myself to exercise. Got my bicycle fixed, and for the last 2 weeks I’ve gone out for an hour a day, 5 days a week. Not the most intense thing, but from being mostly sedentary, it’s hard, but it feels fucking amazing just knowing I’m pushing myself, and actually moving. Even on days I feel burnt out after work, I force myself to get on that bike and move, no exceptions. And I usually feel better during the bike ride than I would just sitting at home. This is for me, the single most biggest change in my mood and just general energy levels, and I prioritize it over just about everything else. \n\nNext up, I took time to learn every day. Sometimes just reading posts on the subreddit, or a few other subs, but more often I’ve been reading books. Well, I bought a few of books and have listened through one audiobook. I can highly recommend the audiobook: it’s The Decision by Kevin Hart. It’s a big part of my motivation and why I really believe I can make this change in my life. Other books on my reading/listening list: Atomic Habits by James Clear, and The Neurogenesis Diet And Lifestyle by Brant Cortright. Both of these look like things that will provide me answers on how to best change my life in the future, Kevin Hart’s book was more focused on motivation and taking action.\n\nThe third thing is meditation. I now have a year long subscription to Calm, which I believe the financial commitment means I’ll be more likely to stick with it throughout. On 5 consecutive days of meditation and I don’t plan on stopping anytime soon. It feels great just having an active mind, the same way having an active body feels good.\n\nFourth and final thing is starting up my youtube channel. I’m not going to share it, but tackling a creative hobby that I can focus on and physically see the results of my work (views/subs) as a number is good for me. It gives me a goal to work toward, and it lets me fill up my downtime with something productive. Active entertainment over passive entertainment. Plus, if it ever does take off, it can get me out of this job, which would be amazing, but even as it is right now it’s beneficial.\n\nIn short, I’ve found that just making the choice every day to do something active instead of doing something passive is so useful, and it really makes me feel so much better in my day to day. I can now recognize how shitty it feels to just do nothing all the time, and I never want to feel that way again. Don’t be a spectator, be involved. Get out there and move.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hwkx4m/i_refuse_to_be_a_spectator_of_my_own_life/", "title": "I refuse to be a spectator of my own life", "social_network": "reddit", "user": "Captain_Rags", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 18, "down_vote": 0, "creation": 1595528432, "permalink": "/r/DecidingToBeBetter/comments/hwkx4m/i_refuse_to_be_a_spectator_of_my_own_life/", "nsfw": false, "first_save": 1635435494.422121, "replies_charged": false}