{"id": "t5_2tand_t3_i1n5jd", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": " \n\n**My question for you:** What's one decision you could make to increase how much value you are able to share with other people?\n\nIn life, it's so easy to get caught up in self-serving or self-preserving desires.\n\n\"I want more money.\"  \n\"I want more men/women.\"  \n\"I want more food, drink, drugs.\"  \n\"I want more certificates, more awards, more recognition.\"  \n\"I want happiness, peace, comfort, a life free from irritation or stress.\"\n\nThe more we chase self-serving goals, the less we are fulfilled. How much is enough when we are trying to fill a void within ourselves that swallows everything we put in it? The answer is always 'more', because what we have is never enough. We can never be satisfied when we focus on serving ourselves: it is a game that we so desperately want to win so that we can be free from want, and the longer we go without winning, the more we begin to resent the game we are playing.\n\nWhat if there was another game?\n\nWhat if the game was not to chase after pleasure, convenience, self-serving agendas, to make ourselves feel better? What if the game was a game that we could enjoy playing forever because winning this game meant continuing to play it, rather than beating it?\n\nWhat if we just accepted ourselves, and started playing the game of serving others?\n\nThe quality of our lives is massively impacted by the quality of our relationships. Our relationships with ourselves, to our friends, families, and neighbors, to our community and country, to the people all around us.\n\nWhen our relationships are out of whack, we tend to feel out of whack.\n\nWhen we focus on the positive experience that comes from being with people, we tend to exist in a state of gratitude and positivity: the focus on this aspect of life seems to almost attract more of it, because it becomes easier and easier for us to see that which we intend to appreciate, even from unlikely sources.\n\nEven for people who are introverted and uncomfortable, when we are committed to noticing the good, seeing the silver linings, when we become willing to accept that we are not broken or helpless or 'bad' with people but that maybe we have room for improvement that will require us taking responsibility for the ways in which we could do better, then we can become people persons. I know this because I used to identify as introverted, shy, awkward, bad at reading people, bad at flirting, bad at eye contact. All stories. All decisions to adhere to what I believed. Once I decided not to believe all of that anymore, and act as if I was who I wanted to be, I began to build deeper and more meaningful connections. I began enjoying people. I began liking the way I felt about myself when I was with people.\n\nWe don't get to that point by focusing on how other people can be valuable for us: we get to that point by increasing the value that we share with other people.\n\nThe moment we begin opening up for others, others open up for us.\n\nWhen we focus on being valuable for others through our character, then others can value us: they can appreciate us for being who we are, not for what we are or what we do or how well we do what we do.\n\nWhen we focus on serving others, we begin filling that void within ourselves - while this is work that never ends, it is by being in process, by committing to continue being valuable and authentic for others, that we fall in love with the game of life.\n\nWhen we fall in love with the game of life, we fall in love with playing. We fall in love with every day, with every challenge, with every accomplishment. We find purpose and when we live a purpose-driven life that is bigger than our own shallow and self-serving needs, we fall in love with ourselves.\n\nNot because we have acquired more or proven that we're good enough, or made enough money, or become perfect, or anything else:\n\nBut because we are finally able to see how who we are is useful, genuine, and making a tangible positive difference in the world.\n\nWhen we can see that who we are as valuable, regardless of the judgments or opinions of others, then we have all the proof we have spent a lifetime searching for.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n**My answer:** I could be more patient, more present, more willing to risk discomfort by being authentic, rather than avoid 'bothering' for my own comfort and convenience. Softening my rough edges will allow me to stop rubbing people the wrong way, and as I improve the quality of my relationships, others will get more out of me, and that means I will feel more socially confident and harmonious, which is a win-win.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i1n5jd/a_game_you_dont_need_to_win/", "title": "A game you don't need to win", "social_network": "reddit", "user": "ajmillercoaching", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1596260468, "permalink": "/r/DecidingToBeBetter/comments/i1n5jd/a_game_you_dont_need_to_win/", "nsfw": false, "first_save": 1635437127.9916008, "replies_charged": false}