{"id": "t5_2tand_t3_o5lkvm", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "Hey guys! So I’ve meet my current friends at a Meetup for people with social anxiety and we’re good friends. The way they handle social skills is by doing approaches to reduce the anxiety about getting rejected and all that and/or are into pickup/gaming to improve on their dating and with women. In my case, I do rejection therapy to exposure myself to face my fear of being rejected by asking for directions, complementing a person’s dog, etc. But I want to go to the next level and improve my social skills and I want to make friends and eventually going on a date, but I know it’ll take one step at a time and I’m willing to go through short term getting out of my comfort zone in order to crush my anxiety. \n\nMy only concern here is my friends do approaches and having convo with people mostly women in a park or building a convo and eventually getting their number. For me, it’s all about losing my anxiety, not being afraid to talk to a girl if she’s by herself and by group (Depending on the situational context) and most importantly building genuine connections. Do I approach or do I go to Meetup events instead? I’ve been feeling stuck and since I’m 24 and never ever dated before, I really want to have those beautiful experience!!!!!!!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o5lkvm/hey_guys_im_24m_and_ive_always_had_trouble/", "title": "Hey guys! I’m (24M) and I’ve always had trouble approaching and starting a conversation with people Who I never met before due to social anxiety. What can I do or what is the best way to improve on this?", "social_network": "reddit", "user": "kevmart96", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1624363645, "permalink": "/r/DecidingToBeBetter/comments/o5lkvm/hey_guys_im_24m_and_ive_always_had_trouble/", "nsfw": false, "first_save": 1635435401.9005075, "replies_charged": false}