{"id": "t5_2tand_t3_pk7r15", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "Have you ever wondered how people in positions of leadership got where they are? How those who call the shots got to call the shots in the first place? Why are people even listening to them? Is there a dynamic that influences whether someone reaches the top of any given social group?\n\nSome questions have a mysterious property to them — if you address them to 100 people, you’ll get 110 answers in return. *How to get at the top of social hierarchies* is one of those magical questions.\n\n*How do you make it to the top?*  \n*- It’s all about money*  \n*- It’s who you know*  \n*- It’s the most skilled that is the leader*\n\nBut what if the same rules that governed the pecking order at your company or in society at large were the same that orchestrated the dynamics in your day-to-day interactions? What if the same rules that decided who gets elected as the CEO of a company were also the same that dictated who were the leaders in your social circles?\n\nI’m going to address your concerns right now — *this is not an article about power dynamics or about manipulating other people’s perception of you.* I’m not going to tell you to look at people at 45 degree angles when they talk to you or other silly stuff like that. This article will discuss a simple dynamic that you’ll be able to notice the very next time you hang out with your friends. It’s something that will seem obvious once you notice it, yet eludes most people.\n\nHaving said all that… *What puts people at the top of Social Hierarchies?*\n\nBefore answering the question, we need to understand the social context we’re part of. We’ve evolved to fit in a very specific social situation — for most of our time on Earth, we lived in small, closed tribes. This means that throughout our lives, we were more likely than not to interact with the same 150 or so people. Unsurprisingly, cities with their population in the millions are a new social phenomenon; our adaptations were not built around these types of environments. We still carry in our subconscious mind the programming that would help us succeed in the smaller, 150-person tribes, even if our surroundings have drastically changed.\n\nNow, take a moment to think about how you would interact with your community if you knew for a fact that you’re going to see the same people over and over again. You’ll likely start thinking in terms of *social-credit*. You’d start seeing your *investment* in people as a way of ensuring they’ll *repay your efforts* when you’re in need.\n\nIn this regard, the social group becomes a *“bank”* of sorts, where you can make *“deposits”* of *effort* in exchange for *future access to resources*.\n\nNow, a person that continuously invests in the *“tribe”* is likely to be considered an asset to the tribe. Most people would rather have him around than not. People recognise that being on these people’s good side would be beneficial to them. The opposite is also true - annoying these people would likely be dangerous because of the considerable social capital they have built.\n\nIsn’t this interesting? By this way of thinking, *money* and *fame* or even *extraordinary skill* are no longer the only currencies that can be used to gain *status*. While all these things do correlate with status *(because of the same reason described above — being able to both help and hinder people)*, suddenly there is another player in the game. *The simple act of contributing towards the wellness of your social group can and will put you in a leadership position.*\n\nSo, after all that…  \n**What puts people at the top of Social Hierarchies?**\n\nAnything that puts the individual in a position to either be useful to and or be able to hinder another person’s progress. The most straight-forward way of putting yourself in this position is **by consistently contributing towards the wellness of the social group**.\n\n**How does one contribute?**  \nThis is of course dependant on the nature of the social group.\n\nIf the social group is your workplace, you’d contribute by taking responsibility for the more important, challenging tasks.  \nIf the social group is your grappling class, you’d contribute by being consistent in your training and then helping newer people out.  \nIf the social group is your mates, you’d contribute by finding cool places to go to and setting up plans.\n\nBy doing this over a long period of time, you’re going to notice your opinions weighting more and more. You’ll notice that when you speak, people stop and listen. You’ll notice that your input will be valued.\n\nYou might be tempted to say this is all obvious, and to be fair it is — however, I urge you to stop for a second and look around. What do most people do when they want to secure a position on the top of any social hierarcy?\n\nA large chunk of people fail to see *status* as a by-product of investment in the grup. Many people see status as *something to be taken, grabbed*. This is why you see people trying to *“buy”* status by wearing expensive watches or by being the loudest in the group. Of course, most of the efforts of these people fail, yet they are none the wiser.\n\nSo, in short — One way to climb the social ladder is to make sure that the needs of everyone around you are met. Take responsability for the most important and most challenging tasks. Come up with plans and invite your friends along. Contributing to the group is the most simple, yet effective way of building social status.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pk7r15/social_status_a_practical_actionable_guide/", "title": "Social Status — a Practical, Actionable guide", "social_network": "reddit", "user": "better__ideas", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1631096488, "permalink": "/r/DecidingToBeBetter/comments/pk7r15/social_status_a_practical_actionable_guide/", "nsfw": false, "first_save": 1635435439.5843801, "replies_charged": false}