{"id": "t5_2tand_t3_qed4s1", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8"], "text": "Just asked a girl out from my class that I’ve always wanted to but never had the balls to.  I’ve made some changes to my life the past few months that gave me the confidence to go for it.  Unfortunately we didn’t get the response we wanted.  So what now?  Wallow in defeat and depression? That won’t solve anything.  Lower my standards and settle for whatever I can get?  You can make a case for that, but i know I can get the caliber of partner I want, just not now apparently.  The only realistic option is to double down.  Reaffirm the changes I’ve made and make more changes for the better.  Commit to using a planner, meditating every day, saying no when it’s necessary.  Get my work done so I can have time to go to the gym like i was doing over the summer and to go out and meet people.  I’ve come this far so why stop now.\n\nLife is about constantly bettering yourself.  My football coach used to say, “If your not getting better, than you’re getting worse.”  If u don’t strive to make urself better and actually follow-thru on your plans to do so then you will not achieve your goals.  And if you can achieve your goals without putting in the work then your goals aren’t ambitious enough.  We can all achieve more than we expect of ourselves with the right motivation and work ethic.  But it’s up to YOU, no one else is going to do it for you.  Don’t let anything get in your way, setbacks are just an opportunity to readjust yourself.  Figure out what ur doing wrong and keep moving forward.  Keep getting better, or you’ll just be getting worse.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qed4s1/so_something_didnt_work_out_for_u_good/", "title": "So something didn’t work out for u? GOOD!", "social_network": "reddit", "user": "Famous-Date5136", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1635021854, "permalink": "/r/DecidingToBeBetter/comments/qed4s1/so_something_didnt_work_out_for_u_good/", "nsfw": false, "first_save": 1635436922.5767365, "replies_charged": false}