{"id": "t5_2tand_t3_newsyx", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a"], "text": "Last year, I had a breakdown and had to get treatment, this year, I feel like i'm going into climax, since this all started, I guess I didn't have much luck, my plan was to get out of high school, start law university, get an internship, make some money with it, help my family and help myself by working out and learning how to fight ( one of the things i loved to do, but lost), now it's almost two years since that has happened, really struggling with law school, since I wasn't expecting to have online classes, discovered I had ADHD, fast foward to now, i think I have become more mature, since all of this stuff happened, but I still am in the same place, now I am more angery than ever, disappointed with my course, stuck in the same little town, working just to help my father, but getting no money, getting confused since I try to do a lot of things at the same time, losing more and more weight, I can't pay for a gym, I don't want an uncle of mine to pay for it, feeling shitty because in the past I paid for it. I'm thinking that I may drop out of the university, since I haven't been able to do much with it and since that i have spent good time learning in a shitty manner, haven't made much connections, the internships at college are reserved for those who get the best grades in the class, and I didn't get around their grades. I have changed my mentality, but, I haven't changed my reality since then. I also don't have much social life, other than the one I have with my family, my friends are always busy, and I don't get to see them. What can I do to bring at least some joy back to my life? Sorry for any mistakes, english isn't my native language.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/newsyx/getting_close_to_having_a_breakdown/", "title": "Getting close to having a breakdown", "social_network": "reddit", "user": "Constant-Sugar-8591", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1621298931, "permalink": "/r/DecidingToBeBetter/comments/newsyx/getting_close_to_having_a_breakdown/", "nsfw": false, "first_save": 1635437331.0646963, "replies_charged": false}