{"id": "t5_2tand_t3_bx4cqk", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I know it’s really hard to not let people get to you. I know it’s really hard to not feel stressed out by the daily things that go one. I know “let it go” is so much easier said than done. When I’m in a place of negativity these things seem impossible. \n\nBut I also know that no one can get to me without my permission. I know there’s only so much I can do and the rest has nothing to do with me. I know my options are to either change the situation or accept it, because there really is nothing else. So what i can do, when I’m feeling low, is be kind to myself. What I can do, when I’m feeling attacked, is really understand everyone else’s reactions to situations is out of my hands and it’s not my business. I can either react with the same energy or I can respond with a higher frequency. I know I can let everything get to me, let life stress me out, or I can accept things as they are for the time being. \n\nI know I can be at peace amongst chaos. I’ve done it before. But I also know I’m allowed to feel my feelings, but there’s much more productive ways to feel them than going on the attack or defense.\n\nLife moves constantly. Change happens and it’s scary sometimes. But we have a lot of power within us and we don’t have to let others take it away. We don’t have to be complacent in our own lives. We can make small choices that make huge waves of change. \n\nWe are not meant to constantly suffer through life, but it can feel that way at times. But I promise, there’s a lot of potential for growth in our hardest moments, and we can find out how much strength we have when life knocks us down. There’s a silver lining if we are open to seeing it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bx4cqk/we_are_not_meant_to_constantly_suffer_through_life/", "title": "We are not meant to constantly suffer through life.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 603, "down_vote": 0, "creation": 1559751050, "permalink": "/r/DecidingToBeBetter/comments/bx4cqk/we_are_not_meant_to_constantly_suffer_through_life/", "nsfw": false, "first_save": 1635436047.284305, "replies_charged": false}