{"id": "t5_2tand_t3_ndak7q", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "Originally posted on r/LifeUpgrades, but want to share it here also.\n\nRegular exercise has had a more profound impact on me than anything else that I have added to my life. I have personally experienced:\n\n* Improved mood, more positive disposition\n* Stress levels are much lower\n* More energy throughout the day\n* Great sleep\n\nThe key is to make it a habit to break a sweat on most days. A few things that have worked for me:\n\n* Find some sort of physical activity that you enjoy (or at least do not hate) doing. I try to mix up cardio, weights, sports, and walking\n* Confidence is key -- Start small with achievable goals and build from there\n* Force yourself to commit, signing up for local races with co-workers spurred me into action\n* If you join a gym, be sure that it is easy for you to get to (eliminate any friction)\n* If time is an issue, there are plenty of apps available that have bodyweight workouts (nothing needed aside from your mobile phone). Peloton has a great selection of classes even if you don’t have the bike or treadmill\n* Schedule exercise into your daily/weekly plans. I know certain days when my energy levels will be low from work and I will get up early to workout because I know it won’t happen if not.\n* Track your workouts (smart watch or even a notebook) – you can watch your progress and it will increase the stickiness of the new habit\n* Take time for rest/recovery and do not burn yourself out", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ndak7q/regular_exercise_has_had_a_more_profound_impact/", "title": "Regular exercise has had a more profound impact on me than anything else that I have added to my life.", "social_network": "reddit", "user": "bigcityblinking", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 115, "down_vote": 0, "creation": 1621118948, "permalink": "/r/DecidingToBeBetter/comments/ndak7q/regular_exercise_has_had_a_more_profound_impact/", "nsfw": false, "first_save": 1635437508.1541555, "replies_charged": false}