{"id": "t5_2tand_t3_7jz8ue", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "This is going to be a bit longer winded. I wanted to share my story and a lesson I learned, of course through meditation, as a way for others to not make the same mistakes I did. And also as a reminder for myself, to make sure I won't make the same mistakes. Also I'm sorry if this is formatted horribly, I'm on mobile and I will correct asap.\n\n\nI'll start off with a bit about myself. I won't focus on me too much, just enough to help with my story. I had my own issues growing up, which bred a lot of complexes and bad impulses, and bad social habbits. For much of my late teens and very early 20s especially, these came to a head and I let my bad habbits and complexes infect my personal relationships. I never self reflected and always wondered why these things happened to me, and never what I did. And I ended up hurting a lot of people close to me and pushing them away. \n\nWhen I was 22, after one particularly bad experience I was left devastated and alone. With no one to turn to and no real social interaction, I had time to reflect after reading many things online, and I had time to begin to grow. Things made sense, **I** made sense. I had answers. I knew what I did wrong and so many things before. I had the knowledge to grow and improve. It was an amazing breakthrough.\n\n\nThroughout the next year, I continued to meditate, and it really helped me. As things started improving, I started to get into to new situations, new friendships, reconnecting with old friends, things were good. The biggest impact in my life was when I began to reconnect with a group of dear old friends of mine, and things were great and fun and I truly felt happy. I even got into an amazing relationship.\n\n\nWith all this new social activity, I began to fall of my meditation. I gave myself completely into the simple pleasures of life, and the enjoyment I was getting from being socially active again. Besides, I was better, I had learned from my mistakes, what could happen?\n\n\nAs time went on, new stressors came into my life constantly, and they began to take their toll on me. They were small at first, but slowly I began to relapse on old habbits. I started lashing out and hurting the people close to me again.  Complexes from before began to rear their head.  I began to make excuses again for my behaviors. Problems arose in my life that I couldn't explain, but I'm sure it'd make sense in the future.\n\n\nI got lazy. I got complacent. And I let everything get the best of me.\n\n\nI'm sure you can guess where this ended. I hurt and pushed the people close to me away again. They cut me off. At the time I just thought everything was a misunderstanding, I thought that if we just talked things through, it'd be okay, all I had to do was say the right series of words. I made excuses for myself, and I never thought I needed to change.\n\n\nAlone again, I crashed hard to rock bottom. I was depressed, very antisocial with the few friends that did stick around, and marred in self-pity. Over time though, I began to pick myself up, slowly but surely, and eventually began to truly reflect and meditate on what happened. And I did so much wrong. I truly saw what I was putting my friends and my partner through. I felt ashamed, horrible, and sad at my actions. Even deeper, I made corrections, for lack of a better term, to my discoveries during my introductory period into meditation, and I learned so much about myself and who I am even unrelated to my current stresses. Throughout this period of self-reflection and observation, I feel the best I ever have. I know where I'm at in life, who I am right now, how to be the person I want to be and avoid falling into old pitfalls. I'm more confident in my thoughts and know how to express them better, and definitely more slef confident about myself and my future.\n\nI know my story isn't all that exciting, or even unique. It's even quite vague to what exactly happened. But I wanted to share my experience to give this advice: No matter what, keep up your meditation. Self-reflect, observe your surroundings and learn from them. You, the people around you, and the world are constantly changing, and that's okay. But when the changes get to much, and you feel confused or scared, or you may even fall into bad or self destructive habbits, not even ones that just effect the people around you like me, take the time to pause, breathe, and reflect. Don't procrastinate, don't let the pot boil over, even when you think you have the answers, double check and truly reflect. Know that it's okay to mess up and learn from them, and use this knowledge to grow and change to do better. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/7jz8ue/stick_with_your_mediation_and_selfreflection_a/", "title": "Stick with your mediation and self-reflection : A cautionary tale.", "social_network": "reddit", "user": "atalkingsharkiguess", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 75, "down_vote": 0, "creation": 1513338948, "permalink": "/r/DecidingToBeBetter/comments/7jz8ue/stick_with_your_mediation_and_selfreflection_a/", "nsfw": false, "first_save": 1635436074.7615874, "replies_charged": false}