{"id": "t5_2tand_t3_np5o58", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "Once I entered college (August 2020), I had experienced for what in the first time in my life was being genuinely happy and not depressed or suicidal. Unfortunately, some pretty severe family issues occurred and I've been spiraling since November of 2020, and struggling with depression since I was six. I've had a hard time recognizing and being comfortable with my reflection in the mirror. Developing a solid personality that I am proud of has been difficult. I fell into a small depressive episode where I was giving into self destructive tendencies. I got tired of it. I've begun a face routine that includes toner, serums, chapstick, moisturizers and sunscreens. It makes me feel so pretty. It's just one small way of taking care of myself daily that I can keep up with. I just need to keep doing this routine.\n\nI'm still depressed, but now I'm doing something about it. I'm gonna get on antidepressants when I have the chance and get medicated for my ADD (diagnosed at 8.) I've been organizing my laundry to wash, finally. I've been cleaning the past few days and meditating in the morning. I've also been vigilant about washing my dishes.\n\nMy depression has also gotten in the way with my relationship with my boyfriend. I've been much more defensive and insecure. It's not that I'm taking anything out on him, it's just that I've been moody and distant. I don't hang out with him as much as I used to. Sometimes on purpose, sometimes just because I feel recluse. I have much less patience with him, and it's not fair to him. I love him a lot, it's just if I get frustrated with him or feel sad I prefer to exit the situation to collect myself. From now on I'm going to take a moment every day to appreciate him, and let him know he's loved.\n\nThat being said, I am taking more time for myself to spend by myself. I'm getting back into my old hobbies, like playing video games and watching movies. I am trying to remember to be mindful and grateful for what I have. I'm taking it gently, day by day. I am cooking and eating breakfast, lunch, and dinner. These are small things, but they make all the difference.\n\nI'm going to start doing good things for me, like buying snacks to help me gain weight. I grew up really poor because my guardians were terrible with money. We never really got snacks unless they were homemade or if it was a holiday. Sometimes we missed out on necessities, but I was just happy that my family was together. Because of that, I feel guilty buying basic necessities like toothpaste or floor cleaner. It's weird because for a young adult, I'm pretty good with money. I need to get out of this mindset of guilt over buying stuff for myself. I may be a college student, but I can afford a $5 package of gluten free oreos now and then. \n\nLastly and most importantly, I need to stop being wreckless about my health and self-worth. Being s*cidal is frustrating and I feel like I've lost my youth to it. I'm done! I want to age with grace. I want to be a grandmother one day, because I love mine so much. I want to start living, for me. I want to feel good in my body, and dress the way I want. I don't want to be too insecure to wear a dress or a bikini. I'm going to start wearing my favorite and more flattering clothes more often.\n\nThanks, if you've read this far. I'm glad I got out of bed today and drank water. I'm thankful that I could afford the rice I ate this morning. I'm grateful I have leftovers to eat this morning. Many don't have the luxury of meals. I'm beyond thankful for my scholarship, and I'm blessed to have access to an higher education. I'm going to try my best to appreciate what I have in life.\n\nY'all have no clue how long I've been wanting to try and articulate my feelings into these words. This was therapeutic.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/np5o58/deciding_to_be_me_again_after_severe_depressive/", "title": "Deciding to be me again after severe depressive episode", "social_network": "reddit", "user": "EdenFinley", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1622474018, "permalink": "/r/DecidingToBeBetter/comments/np5o58/deciding_to_be_me_again_after_severe_depressive/", "nsfw": false, "first_save": 1635435562.1911368, "replies_charged": false}