{"id": "t5_2tand_t3_i7r9je", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "I'm 32/f and my boyfriend is 30/m. He is a wonderful, caring guy with a big heart but his life wasn't the easiest and now the gravity of his bad life choices is hitting him hard and I want to help.\n\nWe live in the UK, currently in London, so if you could point me to some help and resources it would be best if they are in London. Especially classes or events where we could meet other people that can help or are going through something similar.\n\nMy boyfriend grew up in Essex, his father and mother were in an abusive marriage which ended in divorce. Since the age of 5 he lived with his mother but she never wanted to have kids and he spend his whole childhood playing video games. He was always intelligent but he hated going to school and he dropped out at age 14. His mother wanted to focus on her new partner so she kicked him out, paid rent for a new place for him to live in and he lived alone since 15. His friends all had similar situations so they would often party or play games all the time at his place. He never went back to school, always took low paying jobs (mostly working as a security guard) and he was struggling with depression his whole life.\n\nWe met at CBT which is a type of group therapy and we became friends but because of our attraction to each other we soon started dating. We've been together for a year and a half. I am an immigrant and was raised to always work hard and 'suck it up' when things get hard. I've moved to England, put myself through University and worked as a Graphic Designer.\n\nWhen we first started dating he seemed to be inspired by our differences. I encouraged him to start University, we enrolled him to study Psychology and I was always trying to help him.\n\nNow I can see the problem is much deeper. He has no structure, no self-worth and he is completely lost and overwhelmed. He finds himself not being at the same level as his class mates so he doesn't even try talking to them. He sticks to playing games as much as he can and always submits his essays past the deadline which results in having to repeat the class. He is not a stupid guy, he is just very unmotivated and feels like he already wasted his life. I don't know how to help anymore and I'm reaching a point where his lack of motivation affects me negatively. The easy option would be to just move on and date someone who doesn't have these struggles but I truly believe he can turn his life around and it seems like I'm the only person in his life that is trying to help. All his friends and family have little education, low-income jobs and struggle with similar issues so when he comes to them for advice they don't help.\n\nI am interested to see if anyone can help me find the right resources for men like my boyfriend - who need support and guidance to feel like he is not alone. His friends aren't trying to accomplish anything, I've been doing that my whole life so for him it must be stressful to have two different perspectives on life and I think a class, a group or a couch/counselor who can understand that getting your life back on track at 30 isn't easy would be beneficial.\n\n&#x200B;\n\nI really hope you could point me in the right direction. \n\nHe is going to therapy but I believe that a mix of therapy + support would help him more.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i7r9je/getting_your_life_back_on_track_after_30_without/", "title": "Getting your life back on track after 30 without education", "social_network": "reddit", "user": "werzmanutella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1597150403, "permalink": "/r/DecidingToBeBetter/comments/i7r9je/getting_your_life_back_on_track_after_30_without/", "nsfw": false, "first_save": 1635435488.4330938, "replies_charged": false}