{"id": "t5_2tand_t3_a8xt60", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I apologize if this is long, but I want to give the full story.\n\nI've been a loner my entire life, living in the suburbs of Chicago.  Throughout school I had a handful of friends, and we would talk and hang out occasionally.  Mostly playing video games.  However, I've always been the type of person to come home straight from school and play video games all night.  Around the year 2000, our family got our first computer and since then I was hooked.  Became extremely addicted to the computer and the internet.\n\nI would rush home from school and just sit online all night.  It was amazing, constant new information.  Talking to people around the world, discovering cool websites, being a part of message forums.\n\nIt got to the point where my family would have to unhook the computer power cable and hide it somewhere in the house.  I would either find it and be on when no one was home, eventually I got a spare cable they knew nothing about.  They eventually gave up.\n\nWhen I was 14 I started playing guitar.  I got pretty serious about it and music was all I did even up to this day.  Still on the computer all the time, but it was more reading about music/guitars, participating in music forums.\n\nHigh school went by, still never having a girlfriend, never going to prom or any dances.  Never going to any parties.  Just sitting at home in my room on the computer, doing music related things.  Eventually I got into electronic music and using the computer to make music.\n\nIn college I thought I would go to a music school and get a degree in that, but quickly realized that I didn't want to have the stress of never having any money.  Since I was on the computer so much, and dabbled around in basic website making, I thought it would be natural to get a computer science degree.\n\nDuring this time, my sister was hounding me to go away for college.  Saying that I would become independent and would be surrounded by people my own age in a similar situation. I didn't listen.  My parents convinced me otherwise.\n\nMy parents are very babying.  Especially my Dad.  Always did everything for me because he was convinced I couldn't do anything on my own.  Made sure I never had to struggle with anything.  Always paranoid and scared of everything and would never let me do anything on my own for fear I'd be hurt.\n\nIn the end I got into a local university, lived at home and commuted.  College was just an extension of high school I guess.  Had a few acquaintances from class.  But for the most part, I would just go to class, and then come back home.  Again, continuing to sit on the computer all day, and mess around with music.\n\nUp to this point I still never really learned to be independent.  Parents still did everything for me.  Made breakfast, dinner, washed my clothes, etc.  I never really had to lift a finger.\n\nFinished college, and was out of a job for 6 months.  I was never really good at programming, and was never confident with my skills.  I did computer science because it felt like it made sense, and I knew it was high paying.\n\nI finally got a job making  a modest $45k.  However, since I was still living at home I was able to leverage this and pay off all my loans and basically save my entire checks since I didn't have any expenses really.\n\nI did this gig for about 2 years.  Still never had a girlfriend, all my friends practically left.  Other people I knew started families.  I was 23-24 at this time.  Around the end of this period I would have similar thoughts to what I am having now.  Just this nagging feeling of throwing my life away, not living life to the fullest, and general unhappiness.  I thought I needed to change jobs, so that's what I did.\n\nI'm going to fast forward to 28 years old.  At this point, I am on my 3rd job in 4 years.  Making around $75k (before tax).  Besides the job changes, everything is the same.  Still living with my parents in the same Chicago suburb.  I am still not independent.  Parents still do everything for me, make food, etc.  Still saving a majority of my paychecks.\n\nAt this point I start thinking about moving out.  My sister constantly yelling at me that I am wasting my life, that it is not normal to be living at home in my situation and that I am basically handicapped mentally and in a maturity way.  Eventually, an opportunity presented itself and I moved out, even though my dad was throwing a fit.  New apartment is 2-3 miles from my parents house.\n\nFast forward to where I am now.  30 years old.  Still no girlfriend, still no friends.  I am now on my 5th job in 6 years.  Continually switching jobs, and never staying more than 1-2 years hoping that a job change would bring happiness but it never does.  I now make over 6 figures.\n\nI live in the same apartment, but all of it is just a formality. Everyday after work I go to my parents house where they make dinner, then I lounge around there for a few hours on the laptop, then I drive back to the apartment where I go to the gym and then go back to the apartment and sit there on the computer until I go to bed.  I still do the music stuff, but at this point I am so burnt out on life and brain fried from work that I mostly watch people make music on youtube, instead of trying to make my own stuff.\n\nOn the weekends I wake up and just go straight to my parents where they make breakfast, dinner, and I pretty much sit there all day because I don't really want to be sitting alone in my apartment.  Sometimes I sleep over all weekend.\n\nI am still not really independent.  Still never had a relationship with a woman, and the only friend I have is an old high school friend whom I only text, we never meet in person because he always comes up with an excuse.\n\nI still feel the same way I have felt these last 6 years basically.  A deep sense of unhappiness and unfulfillment.  I am 30 years old, I have no experience with anything, I barely have really seen anything.  I missed out on almost all experiences that people half my age have already experienced.  I switched jobs so many times hoping to find some kind of happiness there, but I still am not really happy.  I'm a software developer but I've never really had the passion for programming.  I switched jobs this last time around because my previous job I wasn't learning much and thought I had to be doing something newer.  Now I realize I just have more stress and I realized I value having more benefits that maximize my time  (PTO, WFH), etc.\n\nAnyways, I am pretty much completely burnt out on life. The only thing going for me is that I have a lot of savings, I am maxing out all my retirement accounts, etc.\n\nI just feel that I am completely wasting my life, and before you know it I will be 40, still in this situation.\n\nI think about the girlfriend situation constantly.  I know my immediate family is concerned, but they keep quiet, and my extended family thinks something is probably wrong with me and I'm a lost cause.  I worry that I am at an age now where most women are married with families.  Single woman at this age are probably divorced with kids, which is something I don't want. I also rarely get any matches on dating apps.\n\nAt the same time I wonder if it really is something that I want?  I listen to morning radio shows where they do paternity tests and the crazy drama that people in relationships go through and I ask myself if that is really what I want to risk?  I wonder if I am fortunate enough to not have that drama in my life.\n\nIn regards to friends, I tried the meetup stuff but it just hasn;t been a success really. It's always the same outcome.  Show up, awkwardly sit around and maybe talk with a few people.  Have an ok time but nothing ever really comes of it.\n\nI also noticed that at least at this age, no one really wants to just hang out anymore.  I am still in that high school mode where I'd rather have a couple people over and we have a gaming session, or maybe even make some music.  Or on a whim go check out some cool retro game store or record store on the weekend in the city.  No one wants to do that anymore.  Everyone is busy with work and has other commitments, girlfriends, etc.\n\nI found that I have become very bitter in life.  A very angry person and just pessimistic.  I hate waking up in the morning for work, and just pissed that it takes up most of my day.  I just hate everything about life.  I do excercise, and that helps a little, but honestly I feel like I don't have much of a future.\n\nI have this constant feeling like I should be doing something great and amazing.  That I should be living my life to the fullest, but I have absolutely no idea what that means.  I wake up every day with a constant sense of dread.  Sometimes going through the workday feeling tingling all over my body from just anxiety and stress.\n\nI originally thought I was going to be saving money to buy a house but I don't even know anymore.  I don't even know where I want to live long term because I have barely seen anything.  And I feel like 1 week vacations to different places wouldn't give you enough insight to make a decision like that.  Property taxes where I live are just ridiculous.  Some of the highest in the country.\n\nI am completely lost and just going through the motions at this point.  At this point, I don't think I have the willpower to change anything, or if I even really do want to change.  I'm just hoping to get advice from people who can hopefully relate.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/", "title": "30 years old, no friends, never had a relationship with a woman, I wasted my 20's as a hermit in my room, my parents still do almost everything for me. Life has become very pointless, and I am just not happy. Been having suicidal thoughts. Help.", "social_network": "reddit", "user": "suicidalwasteofspace", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 714, "down_vote": 0, "creation": 1545595344, "permalink": "/r/DecidingToBeBetter/comments/a8xt60/30_years_old_no_friends_never_had_a_relationship/", "nsfw": false, "first_save": 1635436636.558716, "replies_charged": false}