{"id": "t5_2tand_t3_93pjw7", "request": ["cec7edff-25dc-4102-8d8a-cc3d4b21f09a"], "text": "5 years ago a person dear to me departed for the divine abode. He was 54 years old. Before I share the cause for deterioration of his being, I deem it appropriate to share a succinct description of his life.\n\nHe was my mother's first cousin. Despite the seemingly distant relationship our ties were exceedingly healthy. He didn't have a blood sister. Hence, he adored my mother. He was a fine man. Refined , cultivated, considerate and benevolent would be his major characteristics.\n\nHe was born in a middle class family. His performance in academics had been exemplary since middle school. He pursued a bachelor's degree in commerce and prepared for the laborious course of Chartered Accountancy.\n\nHis determination paid him rich dividends. He passed both the courses with flying colours.\nOn being granted his degree certificate he secured a job as an equity analyst at a leading reinsurance company.\n\nSlowly yet steadily he ascended the corporate ladder. He got involved in a conjugal relationship at the age of 29. Two years later they were blessed with a baby girl.\n\nHe was a human par excellence. But, he did have some flaws. He was a miserly person.\nHis disinclination to spend often led to friction in his household. He despised visiting restaurants , detested intercity travelling and abhorred acquisition of materials.\n\n\n He enjoyed living a spartan life. His was a life not distinct from an ascetic. He was a corporate ascetic. But, it's crucial to note that he was a kind soul. Anytime someone sought help for urgent, important matters he would offer wholehearted support - Monetary and Emotional. \n\n\n\nAll this while he was growing at a pace in his company that could generate envy in others.\nTime passes swiftly. His daughter graduated with a degree in commerce. He encouraged her to pursue Chartered Accountancy.\n\n\n But, she was desirous of pursuing a career in hospitality. He was displeased but didn't prove to be an impediment in her journey.\n\n\nIn the years that passed he had made a fortune. It was enough money to last 2 lifetimes. Now in his late 40s he realised that he hadn't spent as much time as he should have with his family and friends.\n\nHe would often pacify his wife by asserting that they would embark on a world tour post his retirement which was just 8 years away. He yearned to settle in close proximity of the hills. Away from the din, pollution and chaos of urban areas.\nBut, that was not to be.\n\n\nWithout delving in the details I'll share that on turning 53 years old his life was ruined when doctors revealed he was patient of cirrhosis.\n\n\n This was a person who hadn't ever consumed alcohol or smoked cigarettes.\nWe were devastated. It was a heart rending revelation.\n\n\n\nDoctors shared that a liver transplant could help him. But, they weren't confident.\nBut my uncle was keen to survive, to thrive. He had many, many unfulfilled desires.\nFiscally he was comfortably placed and could afford a transplant by taking some difficult decisions. \n\n\n\nThose who are aware of the procedure for transplant operations will know that waiting lists are excruciatingly long. After a waiting period of 8 months, thanks to the Almighty's grace he was presented with an opportunity to undergo the surgery.\n\n\nThose who occupied higher slots in the waiting list refused to accept the organ. My uncle was exultant. His hopes rose. Once again he began to harbour a desire to live.\n\n\n\n\nThe operation was performed by an illustrious hepatologist. Those were distressing times. \nThe surgery concluded. We were emphatically told that it was a success. But, his condition continued to worsen in the hospital.\n\n\n Day after day, his health decayed. After 10 days of admittance in the hospital he gave up on life. He departed for a higher journey.\n\nDoctors informed us impassively. Squeals, cried pierced the waiting room. Tears rolled down our cheeks. We were filled with indignation.\n\n\n\nHe passed away at 54. He didn't enjoy his life. He denied himself an opportunity to enjoy. His dream of visiting countries around the globe was left unfulfilled. And so was his hope of residing in a rural area. \n\n\n\nHe delayed attainment of pleasure. He lived for tomorrow. But, the tomorrow he survived for didn't come.\n\n\n\nThe objective of this post isn't to glorify a life devoid of planning. It's essential to plan for tomorrow and live an organised life. But, it happens frequently that in the fond hope of relishing our future we ruin our present. \n\n\n\nWe nurse a misplaced belief that there's quite some time before the stoppage of our existence. But, we never know.\n\n\nThis very moment could be my last for all I know. I wish all of you a long and healthy life. \nBut I'd like to humbly submit that all we have is NOW. NO ONE GUARANTEES OUR TOMORROW.\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/93pjw7/why_i_decided_to_plan_less_and_live_more/", "title": "Why I decided to plan less and live more", "social_network": "reddit", "user": "worldhello1221", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1533134547, "permalink": "/r/DecidingToBeBetter/comments/93pjw7/why_i_decided_to_plan_less_and_live_more/", "nsfw": false, "first_save": 1635436489.2032318, "replies_charged": false}