{"id": "t5_2tand_t3_fvz07t", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "I am feeling so grateful and humbled today. This day in 2018, I was a 23 year old addicted to heroin. It was a short-lived addiction, around 6 months but it was still Hell. I was involved with a man who was also an addict. I don’t blame him for introducing it to me since I was an adult and nobody put a gun to my head. My whole life was scoring dope. I would travel over an hour to the worst city in my state. I put myself in terrible situations where I could have been badly hurt or killed. All for a very short high. This was not where I was supposed to be in life and I knew it every second. I come from a great, middle class family that loves me. But heroin addiction does not discriminate.\n\nMy boyfriend at the time was how I got the drugs. One day, he was fired from his job when they discovered his stash in his locker. His parents made him go to rehab and that was the last time I saw him. Alone and scared and without drugs, I reached out to my dad who had zero idea what I was going through. The next day, all thanks to him, I was on a plane to Florida to go to a 42 day program. I have been clean since. Today, I don’t rely on substances to get me through life. I’m in the healthiest relationship of my life, I’m going back to school to become a nurse and all of my relationships that I ruined are being fixed. \n\nToday I think about the boyfriend I had back then, who passed from an overdose last June at the age of 25. You were a good person and you did not deserve those demons. I have an old T-shirt of his, I’m thinking of turning it into a teddy bear to send to his parents with a note that if he didn’t leave that day, I wouldn’t be clean today and I credit a lot of my recovery to him even if we did fall out of contact after we left for rehab.\n\nI am not 100% where I want to be in life but I’m on my way and for that, I am blessed.\n\nMy dad rules everybody. I love him so much.\n\nThanks for reading, friends. It does get better.\n\nEdit - Wow thanks for all the overwhelming support and to those with negative things to say I’m very sorry you’re so hurt in life and I truly hope you get help! ❤️ (hurt people hurt people) not that I’d let some incel on reddit get me down but still! 😂", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fvz07t/two_years_ago_i_left_for_rehab/", "title": "Two years ago I left for rehab", "social_network": "reddit", "user": "h0tstepper94", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1264, "down_vote": 0, "creation": 1586180737, "permalink": "/r/DecidingToBeBetter/comments/fvz07t/two_years_ago_i_left_for_rehab/", "nsfw": false, "first_save": 1635435578.3406482, "replies_charged": false}