{"id": "t5_2tand_t3_ml398i", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "As the title says, I quit my \"abusive\" job and got a new one, that according to most people, is normal. But because of how I was treated at my old job, it feels like all these benefits and the way I am being treated is like a dream come true. I'll do my best to explain how I view the old job, what was going on to say it was abusive, and what the new job offers in comparison.\n\nI started my old job back in June of 2016 in owning and maintaining a fiber optic network. I had just graduated college with internships in the field I was interested in so I was set up pretty well to go into the field I wanted to. At first, it was fine. I was doing what I wanted and everything was for the most part \"normal\" I had health insurance and that was pretty much the only benefit. The pay was not great starting off but I kept on board knowing that I would get raises over time and possibly promotions, and the only reason I thought this was because it was a small company, real small, 12 people. As time goes on, I get raises which at the time was very encouraging. I would get them on an annual basis like clockwork with a good review. Not only this, but the company paid for my wedding, and paid off my car. However, this meant they owned the car. Being as desperate as I was at the time this seemed like a great idea - no more car payment!\n\nTime passes, we are at about year 2 of 4 and my responsibilities start to grow beyond to what I have ever learned. For those who have ever worked for a fiber optic network company, you know there are splicers which, in a super simplified explanation connect strands of fiber to each other to get connectivity from A to Z. Given the \"fragile\" state of fiber sometimes this calls for splicers to work well into the night, for us it meant between 11pm and 5am. I became one of the splicers.. The only splicer. Out of the 12 people, I was the only one that would do it because I needed and wanted to stay eager and show I was motivated. I would work 8-5, then 11-5, and then for some reason be expected to work again 8-5 the following day.\n\nOver the course of the next year, I would then be the one in charge of maintaining the system that documents our network, get the permits to expand the network, engineer the routes, coordinate a team to install the fiber, duct, hand holes and sometimes be on that team, be quality control, be HR for my department, draw up any map ever requested by anyone, do the inside work at customer locations, and finally do any and all site walks for new customers.\n\nFor a while I did this well, I was able to handle most of the workload with some delays but some understood that I was basically doing all the work needed to bring customers live. Some things to understand here, the above list of responsibilities is essentially the A-Z of expanding and building a fiber optic network simplified.\n\nTime goes on, and of course I hit that wall and start to get burned out. I had no time to take vacation because if I took a vacation the plant would essentially stop expanding, the whole operation would fall behind. I was burned out. I asked multiple times for help, to which there was no response, repetitively. I finally sat down with the big boss man and explained to him how I was getting burned out, that the amount of responsibility put on me was too much for me to handle. I was told I would get help. 6 months go by and no help shows, no help is hired, and i'm back to asking for it and getting no response. I decided it was time to take vacation for better or worse, my mental health was now in the toilet and I started bringing home the anger, frustration and depression home to my wife. Even in my state I still target the 2 weeks where almost nothing gets done because of the holidays, Christmas! Time to sit back and relax and enjoy some time with the family. I apply for my time, it gets approved by the actual HR department. In the days to come I get a message from the big boss man. \"I see you took 2 weeks off in December\" to which I simply respond \"yes\". There wasn't much more to come out of the conversation, but then suddenly there is a policy change for everyone in the work place \"no employee can take 2 consecutive weeks off, and we will no longer be rolling over vacation time\" My response to this was fine, I'll take the days off directly around the holidays so its not 2 consecutive weeks which is essentially a loop hole in the policy, which is the week of Christmas and news years.  For the record, I did everything right, in applying for this time off. I applied well in advance (\\~6 weeks) so there was almost no excuse to why I wouldn't be able to take the time off, after all, the policy said minimum 2 weeks notice.\n\nWe make it to Christmas of 2020, which now we have our annual Christmas party. This is the time of the year we all get recognized for our achievements, get called out for all the great we did over the year and of course a Christmas bonus (all of which happened in years 2016-2019). I made it to the end of a hell of a year that I worked my literal ass off and sacrificed much of myself to get the work done. We. Got. Nothing. Now, I can live without the Christmas bonus - it helps a lot this time of the year but at this point it was no longer about the Christmas bonus. During the annual \"speech\" not only did I not get any recognition for essentially running the plant, I got told to do more work, and to get it done quicker, that certain projects were all in my hands and that I have all the responsibility. But, it doesn't end here. I stuck around after the speech, fuming at this point. Waiting for maybe a thank you to come my way. My boss walks over to me, and I get a little excited maybe expecting a thank you, you're an amazing employee and I wouldn't be able to do this without you. To everybody reading this, I am sure you already know what's coming. He shakes my hand, \"thank you for coming\" and walks away.\n\nThat was it. That was the tipping point. I was done.\n\nThe past 4 years at this point have been filled with reasons for me to stay but were extremely outweighed by the reasons I should not. For those that have read all the way through, you may be asking yourself \"what about how they payed for the wedding? the car?\". You're right, and these were some of the reasons why I felt like I just did not have an option to leave - it was too generous to my standards. I just could not get out of depression, anger, and being burned out. After the year where I barely had any help or room to breath on a day to day basis, but still ended up getting the job done. I didn't even receive a thank you. For any employers reading this, if you appreciate your employees make sure they know it.\n\nCompare now, to my current job. Same exact kind of company, a fiber optic network. My pay has tripled, I have health insurance, 401k, vision, life, and dental. The responsibilities I used to have are split among 6 people specific to each position and I am now focusing on the area I went to school for. It took my new boss 1 week to tell me that he appreciates my work. It is literal night and day. I no longer work nights, and the way this company is built I am in a support network for my manager who reports to the higher-ups. Did I mention I get paid more for a less responsible position?\n\nMy depression is gone, my anger is gone, I look forward to going to work, and my wife is happy. I have found a place that knows they need people to spread the work load, that having one person do it all is just not possible.\n\nTL;DR This is an extremely long post. It all boils down to this advice. Don't be blind to the environment you are in. I was naive and ignorant to how I was being handled and treated. I wanted to believe that I was going to get some type of big appreciation for all my hard work - if you don't get told that you are appreciated then you need to find a better place to work. I would still be at that company had I received any sort of appreciation. No matter who you are, what you do, the person who employed you still has a responsibility to you to make sure you know that without employees there is no employer. Do your job, but don't let your hard work go unappreciated.\n\n&#x200B;\n\nedit: typeo\n\n2nd edit: Wow! I went to bed last night after writing this thinking it wouldn't get much tread.. Thank you everyone for the kind words and rewards!! This is my first post to get over 20 upvotes.. given I post pretty much nothing ever. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ml398i/i_quit_an_abusive_job_and_now_normal_jobs_seem/", "title": "I quit an abusive job and now normal jobs seem like dreams", "social_network": "reddit", "user": "Cataclystic", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1947, "down_vote": 0, "creation": 1617682429, "permalink": "/r/DecidingToBeBetter/comments/ml398i/i_quit_an_abusive_job_and_now_normal_jobs_seem/", "nsfw": false, "first_save": 1635435085.3723722, "replies_charged": false}