{"id": "t5_2tand_t3_oc6g0h", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": " Hey guys! Thought I might share my own personal \"deciding to be better\" story with you all to possibly give someone else that’s struggling a glims of hope. \n\nI grew up being a very nervous child with authoritarian parents that later became an angry teenager, and for a long time as a young adult I thought that my value as a person was performance based and based on how other people saw me. \n\nI thought that life was suppose to be a struggle and that joy, love and wealth just happened to people that were lucky. I was also taught as a child that ”Rest and recovery is for weak people”. \n\nI was completely disconnected from my own feelings and the signals my body was trying to send me. I faked a smile and a bubbly personality on the outside while on the inside I was exhausted and felt like absolute shit. \n\nI thought extremely low of myself and that nobody could ever accept or love me for who I was. I also thought that I wasn’t worthy of anything good in life; like my dream job, a respectful loving partner, money, or somedays even rest and food. \n\nAfter reading every psychology and self-development book I could find I realised that what dictated my feeling was my brain, and that my brain was a computer that someone else once programmed with their personal beliefs and thoughts about the world. \n\nThis made me the think that; if my brain works like a programmed computer, wouldn’t that mean that I should be able to re-program it?\n\nThis was barely 3 years ago and I have to pinch myself when I think about where I am in my life today! Since the day I made the decision to truly start working on myself and completely reprogram my mindset I have;   \n \\- Moved to a different country  \n \\- I now have my own business doing what I LOVE   \n \\- AND I also found a guy so good I didn’t think people like him even existed!\n\nI guess my point is - If you are reading this and you feel like absolute SHIT inside, PLEASE keep going! I know it feels impossible to get out of that dark hole, but you DESERVE to live the life of your dreams and to be happy! \n\nYou are hanging out in these communities for a reason, because you want something better for yourself! \n\nIf I can do it, SO CAN YOU!! :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oc6g0h/if_this_post_can_inspire_just_one_person/", "title": "If this post can inspire just one person", "social_network": "reddit", "user": "Linnealindstrom", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 28, "down_vote": 0, "creation": 1625217428, "permalink": "/r/DecidingToBeBetter/comments/oc6g0h/if_this_post_can_inspire_just_one_person/", "nsfw": false, "first_save": 1635437301.9912791, "replies_charged": false}