{"id": "t5_2tand_t3_ojlfyw", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "802203c7-ca80-4c23-ad08-f571694cfc55", "feda50cc-891e-47e3-8043-7a171b4cc260", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": " \n\nOne of the more difficult things you’ll have to learn is how to recover from a chain of losses. Having stretches of time where you’re less sharp than what you’d like to be are a normal part of life - learning to navigate these situations where your life doesn’t look like what you want is an integral part of living. Understanding how to efficiently manage these situations can be the difference between having a short productivity hiccup versus falling down a downward spiral that ends up in alcoholism and homelessness.\n\nIn this essay I’m going to explain what is that makes snapping out of a losing streak so difficult, as well as give you an actionable, step-by-step plan to reliably break the cycle. The following is advice that will help you for the rest of your life.\n\n**The main challenge of a losing streak**\n\nWhy is getting back on your feet so difficult after you’ve been taking a few L’s? Some may say that the negative momentum created by the situation makes it harder to get back on track. That’s absolutely true - if for the past 2 months you’ve been going to bed at 4am because you’ve been binging Netflix series it’s going to be very difficult to suddenly go to sleep at 10pm.\n\nHowever, I’d like to propose an alternative response. Maybe the reason for not being able to act like a winner is because you’re no longer thinking the way a winner would.\n\nThe human mind is a wonderful tool; it is also one of the most deceptive tools there is. Convincing yourself that something is real is one of the most shockingly easy tasks there is. It is so easy in fact, that most frameworks you could use to structure your thoughts will eventually become real if given enough time of residence inside your mind. This is not manifestation, this is not new age rah-rah. It is a simple function of the brain - your mind will constantly look at its subconscious beliefs and select external events that match them. In the process, your subconscious beliefs will become stronger, and you’ll identify them more as reality. In this way, your mind is akin to a sponge.\n\nNow, the pernicious problem with being stuck in a cycle of losses is that your thought patterns begin to resemble those of a loser’s. Whenever you try to snap yourself out of the cycle of L’s, you find yourself sliding back. Why is that?\n\nSimply put, you’re trying to treat symptoms. One of the ways people try to get out of the downward spiral is by acting like what they remember they were acting when they were winning. They try to put on a show of confidence; they crack jokes and work hard. Yet it all goes back to the baseline of losing within two weeks. It’s like running up a mud hill.\n\n**The fact is that you can’t fake being a baller when you’re on a losing streak because you don’t think the way a baller does.**\n\nYou can recognise a loser’s mindset pretty easily if you know what to look for. If you’ve been on a losing streak, you’ll be able to tell based on how dense your energy is and what you are preoccupying yourself with. Here’s a few of the patterns you’ll find your mind drift towards while in this mode:\n\n* being mad at people for them not rising up to your expectations\n* being envious of others, despising people for moving up in the world and instinctively belittling them; feeling threatened by their success\n* feeling like success is not attainable, that successful people must be cut from a different cloth\n* being overly suspicious of the intentions of others; feeling like everybody wants to take advantage of you and trick you, or that people are purely egoistical\n* enforcing boundaries in an overly aggressive, uncalibrated manner\n* jealous, codependent behaviour in relationships; failure to draw boundaries when necessary and walk away\n* in a conversation, your mind tends to drift towards how you can impress the person in front of you or get their validation. Feeling like you must “do something” in order for people to like you. General social anxiety and low self esteem\n* when being presented with an opportunity, your mind tends to drift towards the associated risks and difficulties\n* if left in an empty, plain room, without any way to entertain or distract yourself, you feel very uncomfortable\n\n**What’s the difference between a loser and a winner?**\n\nThe main difference between a winner’s and a loser’s pattern of thinking ultimately lays in how they go about managing resources, effort and time.\n\nCarefully read the list of loser-specific thought patterns above one more time and see if you can find anything that links them. It’s pretty subtle, but the common thread is this:\n\n*A loser thinks primarily of protecting what he already has.*\n\nThe scenarios above all deal with some sort of perceived loss - be it loss of social status, self image or resources. The scenarios all present threats to the status quo - a friend no longer being involved in the friendship, the threat of not being perceived as “cool” in your social circle, the threat of a significant other leaving you for someone else, or simply the threat of no longer being stimulated or feeling good.\n\nAnother interesting matter to pay attention to is how losers go about gaining resources, be them material or social. Their strategy primarily relies on taking from others - they’ll ultimately think that transactions are zero-sum games; in order for me to win, you must lose. Therefore they’ll focus on being the winners in all transactions. When you hang out with a loser you’ll notice how he always manages to divert the conversation to something going on in his life (even if the topic is mundane). Why is that? Because he thinks that in order to gain social approval, he must TAKE it from you. So, in order to do that, he bombards you with bits from his life that he thinks you’ll find impressive. People who try to subtly flex are usually massive losers.\n\n*A loser’s main approach to gaining value is by taking it from other people.*\n\nIn summary, the difference between winners and losers is how they manage loss and how they go about gaining value.\n\n**How does a winner think?**\n\nWhile studying the profile of a loser, we’ve looked at two dimensions of his behaviour: How he manages his existing resources and how he goes around getting more. When looking at how a winner structures his thoughts, we’ll study the same two dimensions.\n\nRemember - the loser was mainly preoccupied with protecting the resources that he already has. In stark contrast, the winner does not concern themselves with protection nearly to the same degree. Instead, winners look at creating more of what they want instead of holding onto what they already have.\n\nTake the example given earlier - if a friend of a winner started acting distant and aloof towards him, the winner will of course feel hurt and disappointed . The difference lays in what happens next - The loser will, as mentioned earlier, get mad at the friend and ruminate over how much of an asshole and traitor he is. The winner, on the other hand, will think of ways to meet new people that will make better friends.\n\nIf a girl acts disinterested or bitchy towards our winner, does he respond by chasing her? No, he’ll focus on meeting more girls.\n\nIf a winner sees their friends attain success greater than his own, does he get defensive in an attempt to “save face” and protect his self image? Of course not; he’ll be happy and celebrate the friend, all while using the event as fuel for his motivation.\n\nThis contrast can be encapsulated in a very popular dichotomy that circulates around self help groups - **Abundance vs. Scarcity** mindsets.\n\nSummarised, the loser is concerned with keeping what he has, the winner is focused on getting more of what he wants.\n\nThe second part of the comparison is in my view the most important.\n\n**How winners go about gathering value**\n\nWe’ve established that losers’ strategy for gaining value is by trying to take it away from other people. This is not only ineffective, but also counterproductive; people catch on to this behaviour very quickly and instinctively respond in a negative manner. People don’t really like takers.\n\nSo, what do winners do?\n\nIt’s important to remember our roots. We come from small, 150-people tribes. The dynamics in those small groups shaped us on a deeper level that we can possibly imagine. Our social structures are built around the same ideas that generated success in these small tribes. Can you guess what the archetypal successful tribe person behaved like?\n\nIt’s not aggressive and loud. This idea runs rampant around circles concerned with evolutionary behaviourism, and although it does have niches in which it works, it’s not the ideal strategy. What is it then?\n\n*The person who is most successful in any social setting is the one who contributes the most.*\n\nThis is one of the most important ideas I have ever come across, and unless you have very insightful parents or mentors, it’s unlikely you’ll find it dissected and studied much. It might be thrown around under the guise of certain platitudes such as “try to be helpful” or “sharing is caring”, but rarely is the SHEER POWER of this idea ever discussed.\n\nDo you want to be successful, popular and rich? If yes, adhere to the following advice religiously and you’ll get there sooner than you can imagine:\n\n*Starting from this moment, make sure that any person who interacts with you gains value by being in your presence.*\n\nWhat does this mean? It’s simple:\n\n* If you’re going out with a friend make sure he has fun.\n* If you see a mate while hitting the clubs and he seems kindof lonely and out of it, approach a girl and later introduce her to him. Let him have her.\n* You see a homeless person on the street? Buy them some food.\n* You work as a marketing expert? Share your best knowledge on Youtube or Twitter, for free\n* Go on Twitter and figure out what the best ways to get followers are, then share the knowledge with everyone else\n\nand so on…\n\nContributing touches a very deep chord in our psyche. By feeling like we’ve genuinely contributed towards the success of the tribe, we start to feel deserving of success. Barriers we built around our goals, barriers that stopped us from attaining our desires, are suddenly lifted. We see a cute girl on the street, and it’s almost like we’re no longer that anxious about meeting her; we feel like we’re good people that deserve a good shot.\n\nBut won’t this mean that you’ll give all your value away for free? If I’m a marketing expert and I give out all my advice for free, won’t I lose all the clients that would have signed up for my consultancy call? Won’t I lose all my leverage?\n\nThe *Reciprocation Bias* is one of the most powerful instincts inhabiting the human mind. It’s the very glue that holds the foundations of human society together. If it didn’t exist, the human as a social animal wouldn’t either. When someone does us a favour, we feel a powerful urge to repay it (as long as we don’t feel like the person has helped us specifically to put us in their debt).\n\nBut there are so many holes you can poke in this argument\n\n**How do you help someone and hope they repay you, while also not making them feel like you’re manipulating them?**\n\nThis one is easy. You don’t help any one person in hopes of them, as a specific individual, will repay you. You help people while holding the faith that by extending your contribution to as large of a number of people as you can, that your efforts will be repaid. And they always are.\n\n**What if people just take whatever value I provide and they never return the favour?**\n\nDoes it really matter? By engaging in this form of behaviour, you’ll be more successful than you can imagine. The type of person that does not reciprocate will hold on to whatever value they got from you and barely get much else. Who’s the real winner here?\n\n**But help should be offered for its own sake - Success shouldn’t be a motivator for helping other people**\n\nWho would you want to have success among us? If I were to choose, I’d give all the power to those that contribute the most, those that are most helpful to the largest amount of people.\n\n**Important Note**\n\nDo not give value to people that have no intention of reciprocating. I’m not talking about homeless people, or other people that literally cannot reciprocate, but about selfish friends. You are not elevating yourself above the pettiness of expecting a reward for your help by doing this; all you’re doing is uselessly lowering your status while enforcing a bad behaviour on their part. Don’t feel obliged to give anything to any one person; your value is a privilege that not everybody has access to by default.\n\n**So, after all that. How do I get out of a losing streak?**\n\nThe rest of the essay should give a good idea of how to achieve that, but if you just want an actionable list of steps you want to take, or maybe just a **tl;dr**, here it goes:\n\n1. Focus on small wins. Get winning right now. Take out the trash, take a shower then go get dressed up in a nice shirt. Hit the gym, trim your eyebrows. The key about small wins is that they naturally lead into bigger wins. You need to get into the mindset of chasing more favourable outcomes as opposed to protecting what you already have. Focus on small wins for two weeks straight and your life will look radically different.\n2. Contribute - be as useful as you can to as large a number of people as possible. Read the section above for more details as to why this could be the most important idea that you read.\n\nThere’s a few other things that I could go over, but these are the basics. Stick to these for a few days and you won’t only snap out of your losing streak, but you’ll likely ride one of the most successful waves of your life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ojlfyw/how_to_break_a_losing_streak_what_you_need_to/", "title": "How to break a Losing Streak. What you need to know to make it stick", "social_network": "reddit", "user": "better__ideas", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1626200166, "permalink": "/r/DecidingToBeBetter/comments/ojlfyw/how_to_break_a_losing_streak_what_you_need_to/", "nsfw": false, "first_save": 1635435150.323849, "replies_charged": false}