{"id": "t5_2tand_t3_q9q7hb", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8", "4b69452a-b1e5-47af-a734-ad3c2bdce185", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "\"You never know what can come from your broken pieces until you give your broken pieces a chance.\" -Nick Vujicic\n\n**TL;DR: GF with mental health issues broke up with me. Time to recover mentally, physically and socially**\n\nI listened to a YouTube video with that quote, and it helped. I'd been dating my now estranged (ex?) GF for a few years, off and on. She struggles with ROCD ( /r/ROCD), and one of the compulsions is to keep breaking up to give herself time to \"think things through\", which usually means that she settles down for a few weeks or months, and then gets feeling very sorry that we're broken up and then she reaches out again. FWIW, I wish to the uttermost that she'd let me help her and be part of hear therapy and healing, but two weeks ago, she decided that she needed to take an indeterminate amount of time away from me. Sigh. \n\nThe last year has been really hard. The company I was working with lost funding when covid hit, and they had to shut down everything. I didn't even get my last paycheck. The GF mentioned above was in the same mode of off/on again, and man did it do a number on my self esteem and mental health. I ended up gaining about 20-25lbs, which made things even worse, lol. I've actually stayed pretty active, but stress eating is one of my weaknesses. \n\n**Plan forward:** \n\n1. Get back into intermittent fasting. I actually really enjoyed this a year or two ago, and had awesome results. I found it wasn't that hard after the first week or two. \n2. Lose about 20-30lbs by the end of the year. It may seem extreme, but I think I'll actually lose a lot pretty quickly because I'm \"naturally\" about 10-15lbs lighter than I am right now when I'm not all stressed out. \n3. Workout routine: walk/run about 5k, every day. Strength training 3x a week (I've already started this, and am actually feeling a lot more strong after a couple weeks). \n4. I got a new freelancing gig a couple months ago, and it's actually going pretty well. I need to really start delivering more for them, and I'll start to catch up financially, which will alleviate a lot of my stress.\n5. Reconnect with friends, go out to lunch with friends in my area. \n6. Invite friends and new neighbors to have dinner. There are a lot of grad students in my town that move in and don't really have connections all the time.\n7. Work on a few hobby projects that I've been neglecting\n\nGood luck out there to everyone who's in the arena of self-improvement!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q9q7hb/putting_myself_back_together_after_a_bad_breakup/", "title": "Putting myself back together after a bad breakup, and feeling good about slow but steady progress.", "social_network": "reddit", "user": "minuteman_d", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 28, "down_vote": 0, "creation": 1634438807, "permalink": "/r/DecidingToBeBetter/comments/q9q7hb/putting_myself_back_together_after_a_bad_breakup/", "nsfw": false, "first_save": 1635436916.798691, "replies_charged": false}