{"id": "t5_2tand_t3_c7q0gj", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I'm a 24 year old female and I can't remember the last time I went a night without drinking.\n I can't have one drink without it turning into five or more and it always ends up with me doing stupid shit like starting fights with my boyfriend or going on walks at 3am. My dad is an alcoholic and nearly ruined his life on multiple occasions, and I fear I'll turn into him. So, after a night of heavy drinking and bad decisions, I've finally decided to take matters into my own hands and change. Tonight was the first night in probably two years that I didn't drink, and tomorrow I'm going to an AA meeting. I'm extremely nervous because I have social anxiety and being surrounded by strangers makes me uneasy. I was wondering if anyone who has gone to AA meetings before can just give me some advice on how to get the guts to talk and tell me what should I expect?\n\n\nUPDATE: Damn. I was not expecting to get this amount of love and support. Thank you all so much. My first meeting went great. There were a lot of laughs and tears and I decided to speak a little. I received my 24 Hour Beginner chip and I cant stop looking at it. This is night #2 with no alcohol. I feel very optimistic and hopeful besides feeling weak and shaky. I'm going to my next meeting tomorrow and hitting the gym afterwords. I can not explain how it my makes my heart swell to read the comments of people in my same situation saying my post pushed them to go to a meeting. We're all in this fucked up world together. Much love  💜", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/c7q0gj/im_going_to_my_first_aa_meeting_tomorrow/", "title": "I'm going to my first AA meeting tomorrow...", "social_network": "reddit", "user": "janna787", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 733, "down_vote": 0, "creation": 1561969440, "permalink": "/r/DecidingToBeBetter/comments/c7q0gj/im_going_to_my_first_aa_meeting_tomorrow/", "nsfw": false, "first_save": 1635437608.2592943, "replies_charged": false}