{"id": "t5_2tand_t3_cmvpr1", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "I criticize everything including myself. I'm always finding faults, beating myself up and self-deprecating and if it's not myself then I'm criticizing others. I tend to get snippy, lash out and lean towards petty means in order to get back at someone. It's actually juvenile and draining to be salty, exaggerating the negatives and taking out my frustrations on others. An example would be playing team games such as Overwatch or Dead By Daylight, where I'll message someone and criticize them for sabotaging team efforts, being toxic, or just taking out my anger on them. It did lead to a temporary suspension after some choice words to someone in an argument which made me take a step back. That type of venomous anger is still there today. This also extends to playing video games with friends where we tend to get snippy with others, but I'm often the most prone to being caustic which ruins the harmony in the group. It just makes me look sad, bitter and miserable.\n\nI'm a perfectionist at heart and my hypercriticism comes from being unhappy; I'm prone to playing the victim and lashing out and while I do make efforts to improve my life, I do beat myself up over setbacks and quickly turn to anger. I undermine my own successes because I deduce them as common goals and nothing to write home about. Most of all, I envy people for being \"happy and free\"; they're not taking themselves or everything seriously, they can be comfortable in their own skin and be positive and not overthink everything, and they can let loose. Meanwhile, I'm always in my head, overthinking, critiquing, overanalyzing, if not whining and moping, always being miserable and bitter. This even extends to my dancing, where my friend told me everything I do is akin to \"Dance Dance Revolution\"; instead of going with the flow, every move I do looks good, but premeditated compared to freestyling and having fun. I'm likely the first to point out why something is wrong or that something is stupid. That sardonic, venomous energy gets tiresome and often in arguments, I desperately try to weaponize it in order to shut people down and hurt them.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cmvpr1/how_can_i_less_hypercritical_and_negative/", "title": "How can I less hypercritical and negative?", "social_network": "reddit", "user": "morinothomas", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1565123079, "permalink": "/r/DecidingToBeBetter/comments/cmvpr1/how_can_i_less_hypercritical_and_negative/", "nsfw": false, "first_save": 1635437136.0826786, "replies_charged": false}