{"id": "t5_2tand_t3_a1sa4m", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "**1. You don’t really know what self-improvement is**\n\nA lot of people in the self-help community seem to think that self-improvement means reading books and sharing quotes on social media.\nJust to be really clear, here’s what self-improvement means :\nthe improvement of one’s knowledge, status, or character by one’s own efforts.\nSelf-improvement doesn’t just mean knowing a lot of stuff to feel like you’re smart. It means learning to develop your character and your mindset to get better results in life.\nThe ultimate goal is to get results, not just theoretical knowledge that you never use.\n\n**2. You don’t really know what you want**\n\nI see a lot of questions on Quora asking something like “How can I be a better person ?” “How can I improve myself ?” or “How to improve my life ?”\nDo you really think there’s a right answer to such questions ? The questions are too broad and not specific enough.\nWanting to improve is a good thing, but being too broad about it won’t get you anywhere. You have to know exactly what you want in order to get it.\n\n**3. You want to improve everything at once**\n\nSimilar to #2, some people just want to do everything at the same time. They ask questions like “How do I become more confident, build my self-esteem and find my purpose in life ?”\nDo you see how rich the question is ? It’s too cluttered.\nYou can’t improve everything at the same time. You have to improve on aspect of yourself at a time so you don’t get overwhelmed.\n\n**4. You’re all about the theory**\n\nYou like consuming as much content as possible. You like reading books, watching youtube videos and all that because it gives you a false sense of satisfaction.\nBasically you learn a lot, research a lot, but you don’t apply anything.\n\n**5. You’re too impatient**\n\nYou want to become a better person and you want it now. Instead of going through the process of change, you want to improve yourself overnight which is nearly impossible.\nThe truth is that changing yourself takes time and effort. You can’t become a whole different person overnight.\n\n**6. You don’t commit to one specific outcome**\n\nThis usually happens like this : Let’s say you want to become more confident. You read a book or watch a video to learn how you can do it, you remember one or two things from that, you try one or two things for a few days, you totally forget about it afterwards and then you say that it doesn’t work.\nWell, it doesn’t work like that. To get a result, you have to be consistent. You can’t expect anything if you try something for a few days then you forget about it.\nI see a lot of people saying that “self-help doesn’t work” when all they do is read a book without even trying what it says and then you find them saying “the book sucks”.\nIf you want to get fit, you don’t go to the gym for a few days then you say that gym doesn’t work. That would be crazy !\nSame thing here. Self-improvement requires constant effort. That’s the only way of making a positive change within yourself.\n\n**7. You always look for shortcuts**\n\nYou’re constantly looking for the next “tip” or “hack” to success, confidence or happiness. That’s one of the biggest mistakes you could make. If you’re always looking for the “easy way” to improve, you never will.\nThere’s an old saying that goes like this : “Not everything that shines is gold”. That’s exactly the case with these “tips” you often get. They might be shiny, but they’re not gold.\nThose “hacks” are just shallow pieces of advice, they won’t get you anywhere. The reason why they’re so attractive by the way is because they seem so easy, and we often like to avoid putting the effort, so it seems like the perfect solution while in fact, it couldn’t be further away from it.\nThe bottom line is : stop looking for shortcuts.\n\n**8. You’re not following a specific plan**\n\nThis means that you know what you want but you don’t know how to get there. If you want a certain outcome, it’s not enough to know what you want to improve, it’s also very important to know how you’re going to get there.\nFor example transitioning from someone who’s insecure to a person who’s super confident without having a clear-cut set of steps is extremely hard.\nWhat I’m saying is you must have a plan to be effective.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/a1sa4m/here_are_the_worst_mistakes_that_are_stopping_you/", "title": "Here Are The Worst Mistakes That Are Stopping You From Improving Yourself", "social_network": "reddit", "user": "rafikGk21", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 571, "down_vote": 0, "creation": 1543583346, "permalink": "/r/DecidingToBeBetter/comments/a1sa4m/here_are_the_worst_mistakes_that_are_stopping_you/", "nsfw": false, "first_save": 1635438149.169105, "replies_charged": false}