{"id": "t5_2tand_t3_kw6bfz", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "f48bf32c-05af-4e9d-b00f-8b45a75af78f", "73f5fcd2-0821-49d5-9185-6c084ed10d0f", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "About two and a half years ago I was stuck in a dead bedroom situation, in a marriage with no passion left in it, to a man who was gone on business trips and would not even acknowledge when I sent nudes. I have kinks, he never grew into any - yes, my fault for assuming he would. He also had a problem with habitual lying - the problem was that he didn't think it was a big deal, and I saw lies between spouses as existential crises.\n\nI started with the easy subreddits, the XYZGoneWild ones, a few related to my kinks. Mostly kept it respectable. Over time, it became an addiction. I would check my phone when I was bored at work, which would always end up being more time spent scrolling than I meant to at the start. I put some of my other hobbies aside, porn and sexual objectification of other people online filled an empty spot in my life that kept getting more and more empty. I dove into more and more hardcore subreddits. When I ran out of ideas for new kinks to look up, I used the NSFW subreddit generator to introduce me to things I hadn't thought of.\n\nI started posting nudes just to see if my spouse was the only one that thought I looked unfuckable, then the attention from that started to get addicting. I had never received any attention like that from anyone in real life. It gave me the confidence to put myself first, to prioritize my needs, to stop sacrificing everything for a relationship that was so clearly one-sided. I loved the good times, they were amazing. The bad times were an undercurrent that kept dragging me under and making me question why I was even bothering to try to make plans for my future, when it looked increasingly filled with the unhappiness of being ignored and lied to by the one person in the world that was supposed to be honest with you at all costs.\n\nI finally had enough with my (now ex-)husband's lies when I found a dating app on his phone. It buzzed as we landed in a different country to visit a friend for a new baby's baptism, he got a notification saying he had new matches. That was a tough week to pretend to be happy around friends - I spent most of my time helping the new baby's parents wrangle their other children, threw myself into a role as useful house help.\n\nI knew I was done with my ex, but leaving was so hard after so many years together. I finally got out on my own just before COVID hit, with the plan to have a fun, sexy, flirty, date-filled 2020. I got together with my ex when I was young, and I skipped that whole \"wild young woman\" stage that most women get to experience. For instance, I have never once been bought a drink at a bar by someone that I wasn't in a relationship with - everyone always knew I was taken, and nobody ever had the balls to cross that line even with a drink. I know, who cares, I can buy my own drinks, but I skipped that exploratory stage that so many people seem to have in their youth.\n\nThere came a point where all the scrolling felt hollow. But, with the pandemic on, it felt safer than trying to meet people on dating apps. The few times that our virus numbers were down and I did manage to connect with someone, I felt cheap and used afterwards. I was a convenient hole, my needs didn't matter. I had replaced my ex, who lied to me and didn't care about my needs and didn't fuck me very often, with other people who had higher libidos but were just as unconcerned with what I might want or need. So I told myself that all of my NSFW subreddits were good, they kept me at home and safe, and away from the frustrations of dealing with real people who can be really shitty at times.\n\n Lots of people that I interacted with on those subreddits encouraged me to be free, to embrace my slutty and kinky sides. It felt good to finally be told that it was okay to have sexual needs. It felt validating to know that I wasn't some sort of freak for admitting I am a sexual creature, and that I enjoy sex, eroticism, flirting, and seduction / being seduced. Again, I was able to gain confidence in the things that I enjoy and the things that I don't. I felt like I knew myself better. But the hollow feeling was still there, under it all.\n\nThe pandemic has basically forced me to be celibate in order to be responsible. But it made me so lonely, so jealous, so small feeling to see the myriad people posting home-made porn, talking about how nice it is to be quarantined with their partner so that they can fuck at the drop of a hat, or the people from areas without lockdowns who are still able to be out in public together.\n\nI made a friend off of a chance encounter on a less hardcore NSFW subreddit. We have similar kinks, we understand what makes each other tick. I want to be a better person when I'm around him. I don't think he wants things to go any farther than they already have, but that doesn't mean I can't be better for \\*me\\*, better so that I don't feel like a trashy skank when I am around someone so classy and smart. I want to be the kind of person that is, yes, a sexual creature, but not completely at the mercy of sexual thoughts and content. I want to be someone that \\*others\\* want to be better around. He is a role model for balancing kink with class, and I hope to one day be able to say that I am approaching the impeccable standard he sets.\n\nHe made a comment once about how I posted comments on all of the most explicit subreddits. I knew that I did. I didn't see a problem with it. But then, right at the start of 2021, I realized that I wasn't getting anything out of those subreddits anymore. I had benefitted from them, sure, but the good parts were gone and all I was doing was torturing myself with all of the things that I didn't have, all of the bodies that weren't like mine, or the posts that got more upvotes or comments than mine. It had been a healthy exploration at first, but it wasn't anymore. I didn't like who my comments and post history showed I had become. Sex addicted. Porn addicted. Thirsty AF. Self-control out the window.\n\nI knew I wanted to unsubscribe from a few of them, but every time I would unsub from a couple in my homescreen feed there would always be more. I had no idea how many I was subbed to.\n\nToday, after using the drop-down menu on my home page to open subs in new tabs and then click the Leave button for about an hour, I remembered that the old Reddit UI had a page that would show you all your subs in one place. It also has an easy unsub buttons beside each one, with a little 18+ icon beside the flagrantly NSFW ones. It also has a count of how many subreddits you have on your home feed. By the time I had unsubbed from most of the sex-related subs I was on I was down by around 430 or so subs. I still have a few around, but they are ones related to kinks that I am still exploring. Places where I still feel like I want to grow and learn through a like-minded community.\n\nEven after switching to using the old subreddit page, it took me over an hour to go through everything. My mouse hand is tired, I'm behind on some other stuff I should have dealt with today, but I feel really proud of myself for taking these first \\~430 steps toward being kinky but not trashy, and toward my precious time spent on the people and activities that truly matter to me.\n\nFYI, if you need to quickly unsubscribe from a lot of subs, check out:\n\n[https://old.reddit.com/subreddits/](https://old.reddit.com/subreddits/)\n\nIf you are still reading, whatever you need to do better - get started! You can make baby steps towards the person you want to be! See it and then reach for it! \n\n💖", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kw6bfz/today_i_unsubscribed_from_over_400_nsfw/", "title": "Today I unsubscribed from over 400 NSFW subreddits for my mental well-being", "social_network": "reddit", "user": "make_me_a_good_girl", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2581, "down_vote": 0, "creation": 1610502986, "permalink": "/r/DecidingToBeBetter/comments/kw6bfz/today_i_unsubscribed_from_over_400_nsfw/", "nsfw": true, "first_save": 1635435264.5911217, "replies_charged": false}