{"id": "t5_2tand_t3_prq42k", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a", "b69cf201-6737-4217-b486-9096135546b8"], "text": "Is it natural to have an extremely cringe-worthy, funny, and annoying body movement and sound of a voice? Or is it still curable? If it is curable, I'm gonna tear up for sure because it's something that can still be fixed, if not, I'm gonna bear with it and live in hell.\n\n&#x200B;\n\nIt's been haunting me for years, I'm 20 now, but coping mechanisms, my dream of going to Japan, and my reason to live are what made me still alive and prevented me from suicide til' now. I also feel left behind, from financial, relationship, and social status. It's also been haunting me like having social situations in my dreams, it's definitely a nightmare.\n\n&#x200B;\n\nI was an extrovert when I was a kid, very confident, and cheerful. I wasn't aware when I was a kid that I have a really cringe-worthy voice and body movement until I was in 9th-grade high school(15 years old), that's when I realized this by noticing it from my Sister's quirk. Only two of us have this kind of quirk as far as I can see, my other sister and my mother don't have this kind of quirk, so I'm assuming it's not inherited, I don't know if there's anyone else in the world that has this kind of quirk. I also noticed that only guys can notice that quirk to a girl, and only girls can notice that to a guy like me, that's why I never noticed that to myself just by looking at the mirror and listening to myself from recording.\n\n&#x200B;\n\nThis quirk is one of the reasons why I never planned to go to college, so I planned to become a self-taught programmer instead. I'm just stuck in my room, not even able to go out of my house without wearing a mask, not because of COVID, but because I don't want people that I know to see me. it's so freaking tiring to see girls look at me cringing every fucking single day, I couldn't even talk to any girls, scared AF, except if it's necessary, unlike before, it was the opposite, it's like turning myself upside down from a very confident, popular and extrovert guy, to scaredy-cat, annoying and introvert guy.\n\n&#x200B;\n\nI think my sister gets respected more than me because I noticed guys still respect girls even with that kind of quirk, that's why she never noticed that quirk to herself, so I never pointed that out to her, because I don't want her to end up like me becoming extremely depressed. I've never shared this with anyone, even my family or friends, that's why I'm writing this to know if it's curable.\n\n&#x200B;\n\nOne of the hardships I've experienced since I was 15, is becoming a very awkward boyfriend, so we broke up, being bullied every time there's a singing, dancing, or speech presentation, I even got bullied without doing anything! yeah, literally nothing, just walking and being quiet, not saying anything, looking sad, but still bullied me and treated me like a piece of trash.\n\n&#x200B;\n\nI even tried to do work out so hard when I was in 10th-grade and get buffed up, that's when I was glad it reduced my cringy body movement and able to do dance presentations more, BUT... in return, my voice got even extremely cringy and very low at volume, couldn't even order food, couldn't talk to my parents properly even if I tried so hard to fix my voice with vocal training, my mom told me that I'm not fit to go to a fancy university, and said she just wasted her money for my education, that's when I felt really down. That's when I stopped working out and get back to my old skinny self.\n\n&#x200B;\n\nWriting this made me even realized how fucked up my life really is. I might as well lose my reason to live if my parents are gone because my only reason is to repay them for letting a worthless son like me live. I'm really hoping someone can point out what the actual fuck this quirk is, hoping it's curable because if not, I might uncontrollably kill myself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/prq42k/having_a_fcked_up_life/", "title": "Having a F*cked Up Life", "social_network": "reddit", "user": "CrimsonVirtuoso007", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1632124054, "permalink": "/r/DecidingToBeBetter/comments/prq42k/having_a_fcked_up_life/", "nsfw": false, "first_save": 1635435855.4587886, "replies_charged": false}