{"id": "t5_2tand_t3_pjhs2d", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "When I was 22-23 years old, this was a major problem I faced. Single, in college, but I felt I had nothing I was aiming for. It caused a lot of anxiety. My free time was aimless it seemed. I spent a lot of time playing video games and feeling sorry for myself.\n\nSeven years later, and I’m 30. In that period of time, I attempted two separate businesses. Got them off the ground, and sadly they both didn’t work out. Mix of covid/relationships with my business partners. But, there was real success. And I’m taking the lessons I learned into my next business.\n\nI graduated when I was 26 and did get my degree. At the time when my dread was highest, I was making $9.5/hr and living with my mother. I felt like dog water. By the time I graduated, I had visited five different states, lived in Colorado for an entire summer, and got awarded a $20,000 scholarship from NASA and even had the chance to interview for them.\n\nBy 27, I got paid to relocate to California and I was making a real salary. I did it for a year before I came back and realized, while it was an amazing experience, I was more comfortable at home.\n\nNow after all of this, I’m 30. I fell in and out of love. I felt it all. And I’m finally sexually confident and believe in myself. I changed careers, and am doing what I love making more money than I did with a college degree.\n\nIt took seven years. And every year, there was doubt, self loathing, anger, and laziness. But somehow, things worked out.\n\nJust remember. You’re always doing more than you think.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pjhs2d/to_anyone_who_feels_lostlacking_motivation/", "title": "To anyone who feels lost/lacking motivation.", "social_network": "reddit", "user": "JGWol", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 133, "down_vote": 0, "creation": 1630997514, "permalink": "/r/DecidingToBeBetter/comments/pjhs2d/to_anyone_who_feels_lostlacking_motivation/", "nsfw": false, "first_save": 1635435976.080991, "replies_charged": false}