{"id": "t5_2tand_t3_gr2f9y", "request": ["4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "For context I’ve never really talked about this before and I’m very much concussed and a little overwhelmed, so sorry if this is a little scrambled - I’m 17y/o and my mother is an abusive alcoholic. If that isn’t an warning that this is going to get heavy, I don’t know what to tell you. \n\nI’ve spent the better part of my life avoiding mandated reporters and CFS in favour of staying in my situation to protect and take care my dad, who is also a victim. She would get wasted on beer and whiskey and scream in our faces and toss our rooms all night, run around naked smashing TVs, flipping tables, putting out windows, until finally moving on to beating (primarily) me, because when I see her hitting my dad my first instinct is to get in the middle and take it for him. She tells daily that I’m worthless, a cunt, that she should have aborted me, she hates me, I should kill myself, I’m nothing, etc.\n\nI stopped going to school regularly years ago, never even really felt safe enough to leave my room or talk to people. It feels like I’m going through my life waiting for everybody I meet to realize what a worthless piece of shit I am, and for them to snap and give me a well deserved beat down - a constant state of paranoia, even around the one or two friends I do have. I can’t even enter a room without having at least 3 escape routes planned out.\n\nTwo days ago was the worst fight in a while. At around 3 in the morning she was rampaging, and I had a chair up against my door so I could feel safe enough to sleep (I usually only average around 6 hours, waking up every 15 minutes in a cold panic - and that’s a good night) and my mom smashed my door in almost off its hinges. Mostly just to prove that she could, I think. So I followed her to get the fight over with so my dad could get to work in the morning, and this time I fought back harder and it escalated. My dad watched her rear back and kick me in the face several times - there’s still a dent in the wall where my head was bouncing against it - and even after I gave up she screamed in my face for four straight hours while I tried to stabilize my neck and not vomit, before finally she passed out. I guess that’s what finally did it for him, though, because yesterday we packed what we need to keep and today we’re going on a week-long road trip across the country to stay with some family on his side that I’ve never met. \n\nMy mother isolated him and I from his entire family, and I never really had anybody here but my best friend, who gave me her blessing to leave and is excited for me to live my life, so I’m really excited! Scared, but hopeful - you know? The idea that there’s maybe people out there that love me and want me around is very new and daunting. It also has me thinking about all the things I’d be free to do. I’d be able to graduate high-school, maybe even try real therapy - therapy without editing what I say and worrying about what I reveal to my therapist. Maybe even find out who I am, because I didn’t really get an adolescence or a childhood to figure that out. Concussed and exhausted lizard brain is very pleased at the idea that I could have a life.\n\nAnyway, sorry if that’s a little to heavy for this sub. I guess this is kind of as “being better” as it gets for me, at least for the next little while. Thank you for reading:)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gr2f9y/concussed_exhausted_and_moving_across_the_country/", "title": "Concussed, exhausted, and moving across the country today to escape years of intense domestic violence with a hope for a better life... wish me luck?", "social_network": "reddit", "user": "will-not-bite", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 71, "down_vote": 0, "creation": 1590517169, "permalink": "/r/DecidingToBeBetter/comments/gr2f9y/concussed_exhausted_and_moving_across_the_country/", "nsfw": false, "first_save": 1635437462.9325159, "replies_charged": false}