{"id": "t5_2tand_t3_pn4aw8", "request": ["4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "Obligatory first time poster in this sub, also on mobile. \n\nI (22) have made a habit this summer of getting at least tipsy every night in order to fall asleep by 10-11pm. I didn’t realize I became dependent on it until last week. I tried going to bed at a normal time without drinking, and I wasn’t able to fall asleep until about 2am. I tried again this weekend when I didn’t really have to get up early (though I still wanted to), and again I wasn’t able to sleep until past midnight both nights. I desperately want to maintain my sleep schedule so I can continue getting up early (it’s the first time in my life I’ve voluntarily woken up before 8am on a regular day) but I know drinking isn’t the way to do it. Plus, this much drinking obviously hasn’t been helping my wallet or my overall health either. \n\nI reached out to my best friend and told her I was trying not to drink over the weekend and why. Context: shes 2 years sober and im INSANELY proud of her! But she was very supportive and shared that had been one of her excuses she’d use to keep drinking, but now she takes a medicine that helps her fall asleep. She recommended that if I struggled to fall asleep without drinking, I should talk to my psychiatrist. So, I already have my regular appt scheduled for the end of the month, and I’m going to talk to my doctor so I can be better. For now, I do need to maintain my sleep schedule for school, but by the end of the month I’ll be cutting back a LOT because I want to take care of myself better, and I don’t want the problem to get even worse. Wish me luck!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pn4aw8/at_the_end_of_the_month_im_going_to_cut_back_on/", "title": "At the end of the month, I’m going to cut back on drinking🤞", "social_network": "reddit", "user": "moreacethanspace", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1631491773, "permalink": "/r/DecidingToBeBetter/comments/pn4aw8/at_the_end_of_the_month_im_going_to_cut_back_on/", "nsfw": false, "first_save": 1635437461.1803966, "replies_charged": false}