{"id": "t5_2tand_t3_l0rmnv", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "I tried searching for this question on google paired with \"reddit\"(I do this with everything lol) and the advice is always - work out and set goals. But if already do those things? I've been working out consistently for last 3 years and my diet is squeaky clean so I made pretty big changes to my body by setting goals. I don't think I can go 48 hours without a workout because I'm addicted and at this point people ask ME for fitness advice. My hobbies are music production and coding, and since the pandemic started I've been working on projects nonstop. Now I'm trying to get back into reading a book every two weeks. All this activity is the only thing that's keeping me sane, but unfortunately I can't lift weights 24/7, or sit in front of the computer 24/7 staring at Ableton or PyCharm. I can have a nice, busy day when I don't have too much time to think, I'm all good and satisfied with myself, but the moment my mind drifts a little I remember that there are guys out there in relationships, or in fwb type situations, or having one night stands, or any type of connection to girls my mind goes straight in the trash along with my desire to do anything. I know that reddit is all about \"you only need internal validation\" but I mean c'mon - you do need some external validation. I think my perception of myself doesn't align with how the outside world reacts to me and that gets me stuck in this infinite, negative feedback loop.\n\nI know that 'the grass is always greener on the other side' and that I shouldn't compare myself to other people, but I can't help it. I keep imagining what kind of f\\*\\*cking ego boost it is to have a girl want you so much that she gets intimate with you. My mind would probably break from the cognitive dissonance.\n\nAnyway, I'm not asking how to get girls. I'm not socially inept or anything and I've managed to get dates before but for some reason it always fell through after 3 or 4 dates. It's also a bit tricky with me being a hardcore introvert and a Russian guy from Israel, I think dating dynamics are a bit different for me. Also with the lockdowns there isn't much to do right now. Seeing my inbox is depressing as hell when all the faces are either people from work or that one friend I catch up on movies with.\n\n I'd like to know how can I stop feeling like a total loser because of my lack of success with women though. I'd really appreciate it.\n\nAny advice?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l0rmnv/how_can_i_stop_feeling_like_a_piece_of_garbage/", "title": "How can I stop feeling like a piece of garbage for being 26 and never having success with women?", "social_network": "reddit", "user": "FKillerWhale77", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1611085826, "permalink": "/r/DecidingToBeBetter/comments/l0rmnv/how_can_i_stop_feeling_like_a_piece_of_garbage/", "nsfw": false, "first_save": 1635435821.7450407, "replies_charged": false}