{"id": "t5_2tand_t3_osyxyd", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "I had reached the decision to leave my SO, and was working my way to it, but I found out from a friend he was going to propose. I had to rip the bandaid off, or else it ended in me taking the easy route and crushing the dreams of a \"yes\". That seems far more cruel. It seems way worse to pretend to love someone for longer because I'm afraid of the consequences. That seems like it would be an unexpected sucker punch. \n\nSo I did what no one ever did for me, and I told him exactly why. \n\nAnd I talked it through several times for him to understand. And I'm going to let him get closure. And I'm not going to be cruel and selfish about it, like they were to me. I never once got closure in my past breakups. They just broke my heart and disappeared because they didn't want to deal with the aftermath of their decisions. To me that is selfish and wrong, so I sucked it up and I was brave and I did everything in my power to do it right.\n\nI think this was the right thing to do, instead of just disappearing and leaving him in a pool of self doubt and heartache. I hope that this makes it easier on him, and while I feel like a sack of human water trash and have to face it for a while, I feel this is the fair and just way to do it. Its fresh and painful or both parties involved. Very hard to do.I am happy I've come to this point, and decided to be better when no one did that for me. Wish me luck Reddit", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/osyxyd/i_had_to_break_a_heart_but_i_did_it_like_no_one/", "title": "I had to break a heart, but I did it like no one ever did for me", "social_network": "reddit", "user": "whyamIonly5fttall", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1579, "down_vote": 0, "creation": 1627432177, "permalink": "/r/DecidingToBeBetter/comments/osyxyd/i_had_to_break_a_heart_but_i_did_it_like_no_one/", "nsfw": false, "first_save": 1635436260.203561, "replies_charged": false}