{"id": "t5_2tand_t3_20y33y", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "1. Be humble and others will brag for you. \n2. Look around you for opportunities to help others - you will feel great after, and so will they. \n3. Going to bed early and waking up early is always more rewarding than the opposite. \n4. There’s “Now” you, and “Later” you - you have to decide when it is best to favour one over the other. \n5. Your decisions are almost never as important as you think - what is most important is actually making a decision. \n6. If you stop reading the news, a lot of your anxiety will suddenly disappear. \n7. Check your bank account regularly. Don’t lose track of how much you’ve been spending. \n8. There is a significant difference between “want” and “need”.\n9. Nothing will ever be perfect. \n10. A great project finished is always better than an excellent yet permanent work-in-progress. \n11. Read over your emails twice before hitting “Send.”\n12. You may not have much to relate to with elderly people, but they have stories that would blow your mind. Ask them. \n13. A day to yourself every week is necessary for your physical and mental health. \n14. Go to the doctor. Your fear of needles does not outweigh the value of your health. \n15. Stay in touch with people. You may move far away but you won’t regret having a large social circle.\n16. It is definitely okay to go to the movies alone. I bet there’ll be people there who’ll wish they had the nerve to do it. \n17. Don’t fall into the trap of needing to be “busy” all the time. Going for a walk, reading a book, watching a movie, going out for coffee - these are all valuable ways to spend your time. \n18. If you don’t want to do something, don’t do it. Forcing yourself to go out if you don’t want to won’t lead to a great night - it will lead to you pouting in a corner. Stay in, but spend your time wisely. \n19. What you do is magnitudes more important than what you say. \n20. Don’t worry about being funny and you’ll be way funnier. \n21. Take a breath before you lash out at someone. \n22. Never hang up on anybody, especially your mother. \n23. Your birthday is not about you, it is about your mother. \n24. Cooking is a lot of fun if you choose to get into it. Don’t follow recipes verbatim - learn to improvise and make each dish yours. \n25. Buy books at used bookstores. \n26. Go to the gym. If you really don’t feel like going, just do one exercise. Short is better than none. \n27. You will never get there, so learn to enjoy the process. \n28. The world isn’t as terrible as the news makes you think. \n29. Do whatever you can to preserve the environment. It’s not just good-natured, it’s an innate responsibility that you don’t have a choice but to take part in. \n30. Whenever you feel worried about something that you cannot control, remember that worrying will do no good. If you can control it, then stop worrying and do whatever you can to fix it. \n31. Never be afraid to call people on the phone. Texting can only get you so far. \n32. If everybody likes you, it isn’t real life. Wake up. \n33. Politeness has it’s place, but so does bluntness, honesty, and depth. Don’t be afraid to say something truthful. \n34. Don’t be afraid to have an opinion, just use it respectfully. \n35. Don’t get in arguments on the internet. \n36. Sex isn’t nearly as great as everyone makes it seem. \n37. Your city has far more to offer than you know. \n38. Stop wishing you were someplace else and just be where you are. Your general circumstances are usually outside of your immediate control.\n39. Don’t read movie reviews before you see the movie. \n40. Try genres you wouldn’t think you’d like, at least once. \n41. Watch films in their original language. \n42. Get involved and participate. Raise your hand when people ask for volunteers.\n43. Ask lots of questions in class. \n44. Sit in the front of the lecture hall. \n45. Taking notes doesn’t work for everybody. If it doesn’t work for you, then don’t do it. \n46. Get to know your professor. Make sure they know your name. \n47. Pretend your due dates for assignments are a week ahead of when they actually are. Convince yourself that this pretend due date is real. \n48. Depth is generally more valuable than breadth. \n49. Other people share interests with you, no matter what they are. Find them. \n50. Market your talents and skills. \n51. Acknowledge your abilities and your limitations. Know what you’re good at and what you’re not. \n52. It’s not your money. It belongs to society. Take it in and spend it to improve your life and the lives of those around you. \n53. You are certainly more attractive than you think you are. \n54. Always be early. \n55. If you take transit, give yourself an extra half hour every time. \n56. Don’t promise anything you can’t deliver just to please somebody. An honest negative always beats a deceitful positive. \n57. Under-promise and over-deliver. If you think you can get it done in 5 days, promise 7 days. You have more time and it looks good when you have it earlier.\n58. Design is important. \n59. You will meet many more interesting people if you take out your headphones and are open to interaction. \n60. Most people want to be talked to but are too afraid to talk to others. Be the one who is not afraid. \n61. Take fewer pictures, and spend more time actually seeing things with your eyes.\n62. Don’t be ashamed of what you like to do, as long as it doesn’t harm anybody else. \n63. Don’t be afraid of being weird. Everybody is weird. \n64. High school ends, and your life blows wide open. \n65. Nostalgia is like mental heroin. It feels great but you can’t live off of it. \n66. Social networks don’t do as much for you as they say they do. \n67. Be willing to spend a bit more money on healthy, natural, eco-friendly food and products. Consider it a necessary expense. \n68. Buy nice clothes. You will feel good about yourself when you wear them. \n69. You’ll wish you can grow facial hair until you can grow facial hair. \n70. The hours between 5am and 8am are magical. Rise early. \n71. Sometimes spending a lot of money at once on something can save you a lot more money in the long run on something else. Do the math. \n72. When you’re at work, work. You owe that to your boss. \n73. It’s human nature to gossip. It’s fine to do it, but don’t say anything you wouldn’t want them to hear you say. \n74. Save “How are you?” for when you actually want to know. Have real conversations with baristas and servers. \n75. Sometimes there are favours you just can’t fully return. Do what you can to show your appreciation. \n76. Decorate your room however you want. It should be a place that you want to spend your time. \n77. Congratulate your friends on their success, and hope for more of it. Jealousy makes you into a jerk, and your sincere admiration will be returned to you. \n78. You can’t always be a great person, and you will make lots of mistakes. When it comes down to it, do what you think you won’t regret. \n79. Nobody can be as charming as George Clooney. \n80. Celebrities are just people. Treat them as such. \n81. They are also usually much shorter than you’d think. \n82. After you turn 20 you really have to start giving back. \n83. Not everybody is an artist or a writer, but everybody can be creative and original.\n84. Take inspiration, not ideas. \n85. Your parents lived many years before you were born. Learn about their past. \n86. Travel doesn’t have to be international, nor does it have to be expensive. \n87. If you’re thinking something, chances are others are too. \n88. Look up when you’re walking. The world happens at eye level. \n89. There’s no shame in asking for help.\n90. Sometimes you either have it or you don’t. Learn when you don’t, accept it and try something else. \n91. Persistence and stubbornness are different things entirely. One will make you rich and the other will lead you into a hole.\n92. Patriotism is generally misled, bigoted, and ignorant. \n93. Borders are, for the most part, arbitrary. Be proud of where you’re from but remember that you’re a global citizen first. \n94. Change bad habits one at a time. You will almost always have at least one. \n95. Credit card rewards are not worth the debt. \n96. Admitting you’re wrong is more important than being right. \n97. Say “I don’t know” when you don’t know. Don’t pretend, you will look like an idiot.\n98. Flaunt your curiosity. \n99. Lists are easy to make and hard to follow. \n100. Some things can’t be changed and must be accepted.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/20y33y/i_made_a_list_of_100_things_ive_learned_so_far_in/", "title": "I made a list of 100 things I've learned so far in my life. Perhaps some will resonate with you. Enjoy!", "social_network": "reddit", "user": "audacias", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 206, "down_vote": 0, "creation": 1395356161, "permalink": "/r/DecidingToBeBetter/comments/20y33y/i_made_a_list_of_100_things_ive_learned_so_far_in/", "nsfw": false, "first_save": 1635435837.52081, "replies_charged": false}