{"id": "t5_2tand_t3_mj0sje", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "I had only thought it was some kind of intense personality change. But deep down, I knew there was something more to it. Something I couldn’t put my finger on. \n\nI had heard the phrase “ego death” before, but never bothered to read on it. But today I did. \n\nEverything just clicked. The existential crisis that was eating away at me. How I took on such a nihilistic approach on the world and had stopped doing everything, because I was so lost in my own thoughts. The out of body experiences that felt like I was running on some different energy. I’m not exactly a spiritual or even religious person (most of my family would describe me as an overly logical robot), but that experience sure felt like one. \n\nI used to be quite... problematic. Therapy, depressive episodes, near debilitating insecurities (to the point I would avoid leaving my house), the lingering sadness that never seemed to fade, the extreme need for external validation and for material things.\n\nBut I just.. flipped. One day, I just sat down in silence and asked myself, “Why?”. What is this all for? Why am I trying so hard to impress others, to gain material possessions, why am I living this way? With people I don’t connect with but hold on to so desperately, projecting an image of myself that doesn’t feel authentic at all, not doing anything meaningful to myself? What have I been doing? Why have I been spending my time as if I had so much of it? As if I was guaranteed to live long, when life is so unpredictable? And why haven’t I thought about changing even once?\n\nCue the next few months of ego death. Terrible experience personally. I would be deep in thought everyday. I’d wake up feeling frustrated. I knew something was off but I couldn’t find all the answers to my questions immediately. I’d have major realizations, all of which I wrote down and still keep. I was full of questions, but the only one who could answer them was me. So I thought. And I thought. For days on end I could be seen just pacing, staring at a wall, writing as if it was my last letter, and abnormally quiet for someone as loud as me. At least, that’s what people have said.\n\nBut the storm passed. I had a new take on life. It felt like I just threw away my old identity. It felt surreal, like I was a new person. And for the first time in my life, I felt utterly excited. I didn’t feel weighed down by anything. A complete 180 from how I was. A new philosophy. Positive nihilism. I was cutting out friends who weren’t good for me. I started regaining my motivation, and it came at full force. My shopping carts were empty, as I had lost all desire to purchase things that I didn’t need. I had stopped limiting myself. No more self-doubt. No more limiting beliefs. No more self-pity, and wallowing/feeling comfortable in my own misery. I had decided that the one thing in this world that would fulfill me the most, is if I lived authentically, and became the person who I truly wanted to be. That no-one could make me truly happy, but myself.\n\nI found myself no longer caring about how many friends I had. No longer obsessing over my appearance. No longer spending money on things I didn’t need. I found myself depression free, for the first time in YEARS. Even as the angsty person I was who would have puked at this admission, I can even say, genuinely, that I am happy right now. That I am happy with myself. That I no longer feel confined and chained to external things. I feel so capable, so sure, so content, and so motivated to change and become someone great. \n\nI feel like I have found purpose. Which is to grow. I haven’t felt this sense of wonder since childhood. I want to go out and explore new things. Meet new people. I want to stop laying in bed and doing nothing when life is so short. I want to actually live a life that I won’t regret. For the first time, my head and my heart have aligned with each other. Everything is clear now.\n\nHonestly, I don’t ever want to go through ego death again if I was given the chance to relive it. It was an important yet painful experience. Yet, I’m glad it happened. Because now, I feel extremely liberated, and so free.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mj0sje/i_underwent_ego_death_without_even_knowing_what/", "title": "I underwent ego death without even knowing what it was.", "social_network": "reddit", "user": "Amberthms", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 888, "down_vote": 0, "creation": 1617421930, "permalink": "/r/DecidingToBeBetter/comments/mj0sje/i_underwent_ego_death_without_even_knowing_what/", "nsfw": false, "first_save": 1635436714.7983735, "replies_charged": false}