{"id": "t5_2tand_t3_qbwqmh", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": " Hi!\n\n27F here.\n\nSo  I've been feeling like absolute crap ...for the past 2 years. I decided  to do something, so I've been investing a ton of time and money into  myself. Here's some things that I've already done, but I need more  ideas. I still feel bad, and I was wondering what else I could do to  feel better / improve myself:\n\nMENTAL:\n\n\\-I've  been going to therapy for the past year, switched 4 different  therapists, and finally found the one that works for me. I have a  session once every 2 weeks.\n\n\\-I tried hypnosis for my anxiety..didn't really work, maybe just a temporary relief\n\n\\-Tried CBT - cognitive behavioral therapy\n\n\\-Watched a ton of self help youtube videos, bought myself a CBT workbook\n\n\\-Started taking atidepressants a month ago, I hope they start working soon\n\n\\-I  also have a boyfriend that I really like and am attracted to - both  physically and 'mentally'.. He seems to like me back, but I somehow  can't believe him and am afraid he'll dump at any moment, because that's  what all other men have done in the past\n\nFINANCE:\n\n\\-I have a good steady job & and an appartment in the city centre (can basically walk to work)\n\n\\-I try to budget and save more\n\n\\-Started investing in crypto and some stocks\n\nHEALTH / BEAUTY:\n\n\\-Got laser hair removal on my entire legs + bikini line\n\n\\-Dermatologist and microneedling sessions for my face / acne scars\n\n\\-Am currently looking into laser skin resurfacing for my face, to have clearer / perfect skin\n\n\\-I regularly get my nails done, lash extensions, hair extensions\n\n\\-Bought  high quality skincare (after thorough analysis of the ingredients and  the product's effectiveness) - invested a couple hundred $..\n\n\\-I  regularly get my blood checked, recently discovered a hormone  imbalance, that I am getting treated (seeing my doctor tommorow)\n\n\\-I got tested for food intolerances and allergies and am trying to stick to this diet\n\n\\-I regularly get massages to relax\n\n\\-I just signed up to a gym. I'm already okay, but I could tone up my body a bit\n\nCAREER / EDUCATION:\n\n\\-Finished my masters in a STEM field\n\n\\- I regularly take additional lectures on Coursera and other things in person to get additional certificates\n\n\\-I read a ton of books / listen to audiobooks. I try to read one every 2 weeks\n\n(I've  read all the basics...4 hour workwek, Zero to one, How to win friends  and influence people, The millionare mind, Think and grow rich..Rich dad  poor dad, Simple path to wealth, The millionare next door..Blink,  Thinking fast and slow, Intelligent investor, Everybody lies, basically  anything there is, I've probably read it..)\n\n\\-I also have a personal mentor / career advisor that I talk to on Zoom once a month\n\nSo  this is it, maybe I've forgotten something. I still feel like absolute  crap. I'm jealous of my friends that seem to do way less, and are  somehow happier.\n\nWhat else could I do? I'm running out of ideas...Please help...:(", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qbwqmh/i_feel_like_absolute_crapive_done_a_ton_of_work/", "title": "I feel like absolute crap..I've done a ton of work, but nothing seems to help. What else could I do? Please help..:(", "social_network": "reddit", "user": "_Crazy_Luck_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1634721238, "permalink": "/r/DecidingToBeBetter/comments/qbwqmh/i_feel_like_absolute_crapive_done_a_ton_of_work/", "nsfw": false, "first_save": 1635435345.4728045, "replies_charged": false}