{"id": "t5_2tand_t3_prvurc", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924", "0614cedd-1e86-4144-9fa0-a24c903bac2b", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "It was my first day of secondary school. It was a big scary school, full of older and tough looking kids. I was an innocent, sheltered and soft boy. On my first day in the playground, which was a concrete space with 3 meter cages all around it, much like a prison yard, an older boy came up to me. Offered out his hand and said welcome to the school. I put my hand out to shake his. He had wrapped a metal safety pin around his finger so that when he shook my hand, the metal stabbed into my palm. His eyes fixed on mine. Even then I knew what to do. Not strong or brave enough to fight him, not stupid enough to show pain or fear. I hid my pain as best I could, pulled my hand away and kept walking.\n\nThis is just one experience of many that caused me to build an emotional barrier around myself.\n\nIf you’re scared of being hurt, scared of being humiliated, scared of being seen to be vulnerable, what do you do? You copy the behaviour of those that seem strong, those that seem confident.\n\nYou remove all emotional expression, all sadness, all pain, all fear, all hurt, all sensitivity and you become stone. You express anger or you express lust. These are your only two options to navigate the world of a young man who is afraid of his surroundings.\n\nAll that pain, all that fear, you bottle it up, you don’t let it out past your wall, and it sits there. In the pit of your stomach, churning.\n\nSo how do you deal with this? I first used food. Eating made me feel happy, it gave me a high and the more unhealthy it was, the more I over consumed it, the more of a buzz I got. This was my first addiction, or dependence.\n\nNext came video games. Virtual reality that would help me mentally escape a daily reality I hated. I spent hours playing and it didn't matter how much my parents hated it or what they tried to do to take it away from me, I needed it.\n\nThen came Porn. Fleeting and brief sexual highs to get me out of my head and my now daily anxiety and depression. And like an addict, when the high starts wearing off, you have to increase the dosage.\n\nFood, gaming and porn carried me through my early teenage years. And then one day, I smoked a joint. I was scared and anxious about it and knew it was a bigger step across the line. But once that high took hold of me I remember the sweet bliss of it all. For the first time, I was properly taken out of my reality, out of my identity and I felt free. Free of all the shit I was bottling up inside, free of all of the pain and anxiety that had become my entire world.\n\nThis was a new level and for the next 5 years I used and abused weed until it drove me crazy. Paranoia, anxiety and psychosis.\n\nAt 21 I was an overweight, depressed, dysfunctional college drop out with no prospects, no future and no meaning.\n\nDoes any of this sound like you?\n\nI see it all of the time. The people I work with, the young men I help. These problems are common and this story is almost standard these days.\n\nI got out. I changed my life. I created a life based on meaning, discipline, purpose and love.\n\nYou can too.\n\nIf you want help with this, you want to be pointed in the right direction or you just want a chat, get in touch. I want to create a community where we can help each other and where we can heal each other.\n\nIf this topic resonates with you then check out the video I made on it - link in profile.\n\nPeace", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/prvurc/how_unprocessed_experiences_lead_to_addiction/", "title": "How unprocessed experiences lead to addiction", "social_network": "reddit", "user": "yusefsanei", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 69, "down_vote": 0, "creation": 1632147583, "permalink": "/r/DecidingToBeBetter/comments/prvurc/how_unprocessed_experiences_lead_to_addiction/", "nsfw": false, "first_save": 1635435618.275843, "replies_charged": false}