{"id": "t5_2tand_t3_q0i41d", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "I remembered this throwaway and thought I could ask for some help. I though this subreddit would be right since I need to grow and learn to get out of this situation. If it isn't just let me know and I'll delete this and repost on the right one.\n\nMy parents have made sure to keep me dependent on them. I'm not allowed to learn to drive, anytime I get a job or need to go to school (college) they always \"lose track of time\" and make me late, I can't cook dinner for myself because that's not something a \"child\" should do, ect. I'm 20 years old and I haven't been able to keep a job more then a week because of them. \n\nI do love my parents and I believe they love me (to anyone who checks my other post on this account I don't mention any of this because it didn't seem relevant) but they final push happened and I've decided I need to get out and help myself for a change. The final push being snakes.\n\nSee my family aren't very tidy and I can't clean up everything myself because again, a \"child\" should do that. So we have a mouse problem. I have begged for almost a year for them to do something and they never did. Now we have snakes inside our home. And again they won't do anything about it. I don't feel safe and I'm scared for my pet bird who I love.\n\nI want to leave and finally get out from under thier thumb. The problem is I don't know how. I've never been taught any adult skills. I do have some money saved from odd jobs around the house but it's not enough to get out. I can't rely on my family either since they think my parents are doing the right thing raising me like this and they would only send me back. I can't rely on friends either since I only have two and neither are in a position to help me. So I really need advice on how to get out and how to adult. I'm completely clueless. Please help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q0i41d/ive_finally_decided_to_escape_my_parents_i_dont/", "title": "I've finally decided to escape my parents. I don't know how to be an adult though.", "social_network": "reddit", "user": "TinyFox2935", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1633268984, "permalink": "/r/DecidingToBeBetter/comments/q0i41d/ive_finally_decided_to_escape_my_parents_i_dont/", "nsfw": false, "first_save": 1635438198.0143907, "replies_charged": false}