{"id": "t5_2tand_t3_ocnc88", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "18281d65-fa68-4991-a4a1-8f37346818f3"], "text": "Mental illness sucks, and 2020 was bad for many. I found myself spiraling until November when I hit a new all-time low. In therapy off and on since college, I made an appointment with my primary instead and started medication for the first time in February.\n\nGuys, it's life-changing.\n\nI feel like since then I've gotten my life back and am in a better place than I've been in such a long time. The empowerment of being in complete control of mind and body is a liberating feeling. I haven't had alcohol or nicotine since February and started prioritizing my physical wellbeing, making sure to get plenty of sleep, activity, and water. So, so much water.\n\nInstead of laying awake at night obsessing over some trivial matter I reflect on the good of the day. Wake up each morning with a positive affirmation. When things start to seem a bit much step back, take some deep breaths, and regroup - or step away completely. Practice mindfulness. Stop avoidance. Curb negative self-talk. Meditate daily. Live with intention.\n\nI feel like me, but a much younger childlike me. There's so much beauty and wonder that had became background noise over the decades. \n\nDon't get me wrong, therapy is an amazing tool. I believe everyone should have a therapist, even if only to have an objective third party to talk things out with. I've learned a lot from therapy, but practice doesn't really help chemical imbalance. However, once addressed, the practices elevate everything.\n\nPlease, treat yourself with kindness and patience. Stroke your fire. Be selfish when it comes to your wellbeing. Ask for help. Be your own advocate. Prioritize yourself. Love yourself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ocnc88/asking_to_be_put_on_antidepressants_changed_my/", "title": "Asking to be put on antidepressants changed my life", "social_network": "reddit", "user": "Iamdarkhorse", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 890, "down_vote": 0, "creation": 1625272394, "permalink": "/r/DecidingToBeBetter/comments/ocnc88/asking_to_be_put_on_antidepressants_changed_my/", "nsfw": false, "first_save": 1635435346.0963495, "replies_charged": false}