{"id": "t5_2tand_t3_n7j3ml", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Many of my problems and deficiencies are attributable to a lack of fortitude, discipline and an overall inability to tolerate unpleasant emotional states.\nI operate according to the pleasure principle. I am impulsive and impetuous. I want to feel good now, damn tomorrow. I am the unregulated Id. I am Aesop's grasshopper frolicking and avoiding my the work of food gathering, spending the summer laughing and playing only to starve in the winter.\n\nIt's all about now. I choose the easy path today with an almost pathological disregard for any future consequences.\nit's as if my future self is someone else entirely.\n\nI blow my budget on liquor in a matter of days knowing that there will be no food or cigarettes for the rest of the week.\n\nI get drunk tonight even though I know I will feel like death tomorrow morning.\nI fail to apply myself today, avoiding work now at the expense of accomplishment.\n\nI get drunk tonight even though I know I will feel like death tomorrow morning.\nI fail to apply myself today, avoiding work now at the expense of accomplishment.\n\nI always do what I want and avoid that which is unpalatable.\n\nFor so long, I was the victim. I blamed depression and anxiety. It was the ADHD. It was an addiction, a brain disease, a physical dependency- not a choice.\n\nI have become so adept at avoiding responsibility, that things just seem to happen to me. It's like I am a passenger in all of this, an innocent bystander.\nI have no discipline. And I can't be trusted.\n\nNo matter my grandstanding about sobriety, I rarely make it a day without drink. Sometimes my willpower keeps me dry only for minutes or hours because at the first twinge of anxiety, boredom or guilt, I run to the liquor store.\n\nI can't tolerate these negative emotional states. I crumble.\nBecause of my tendency to escape rather than endure, in order to avoid relapse, I recently ceded control of my finances, allowing my father to keep all of my money and credit cards so that it will be impossible for me a I buy liquor when the urge arises.\n\nIf I am ever going to stay sober, if I am ever to amount to anything, to achieve anything, I need to learn how to endure and cope with stress and unpleasantness.\n\nThe truth is, I do have some legitimate handicaps. I do suffer from profund depression and scalding anxiety. I find it hard to pay attention and complete tasks.\n\nThe stuff of life is harder for me than other people. But I have surrendered to mental illness. I've handed my life and potential over without a fight.\nI have taken the victim role, playing the part of someone without agency, without will. The truth is, I have wasted my life.\n\nI have nothing. I am nothing.\n\nThe truth I have been refusing to admit is that I am still responsible. I need to learn to cope with distress. I need discipline.\n\nThe truth I have been refusing to admit is that I am still responsible. I need to learn to cope with distress. I need discipline.\n\nI have fallen short of my goals. I am not the person I want to be:\nI need to learn to cope with uncomfortable emotions if I am ever to stay sober. I need to learn discipline. I need to be willing to work hard at my goals, to write even when I don't feel like it. To invest the time in acquiring new skills.\n\nIt's easier to watch TV than it is to dedicate time and energy to the pursuit of long term goals. It doesn't always feel good or fun to practice or to work on a project but I need to take on these tasks like an athlete training for an event.\n\nMuhamed Ali said, \"I hated every minute of training, but I said, 'Don't quit. Suffer now and live the rest of your life as a champion.'\"", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n7j3ml/its_as_if_my_future_self_is_someone_else_entirely/", "title": "It’s as if my future self is someone else entirely", "social_network": "reddit", "user": "vestigialreverie", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1620455410, "permalink": "/r/DecidingToBeBetter/comments/n7j3ml/its_as_if_my_future_self_is_someone_else_entirely/", "nsfw": false, "first_save": 1635437762.4575472, "replies_charged": false}