{"id": "t5_2tand_t3_mmiqz5", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": " \n\nI honestly don’t know what to expect by writing this post but I’m going to do it anyways. I am desperate for some support/advice on how to approach this very strange issue of mine. (21m)\n\nTo preface this let's go back to high school and college as I believe it might be relevant to explain how it began. I wasn’t the smartest kid then but I think a lot of that came from having a very poor work ethic & caring about video games more than anything. I still managed to get into college (a lot of cheating contributed to this) & did 4 years of varsity sports. During all of that I didn’t really have many irl friends, but I found a friend group towards the end and am still friends with a couple of the dudes that I met back then. They’re really good lads doing well now.\n\nIn college I decided I was going to strap the fuck down & go all out on my studies. In the beginning of the first semester, my roommates would always think they were annoying me, I didn’t care about being friends with them, etc. for just caring too much about school. Eventually I started to open up to them and this large friend group and started cheating on all of my assignments and exams again. I should mention at this point my whole life I felt “strange” around other people, especially those I didn’t know and during high school/college I had social anxiety. A lot of those college friends saw me as a little different but I was still “cool” enough to hang out & room with them for 3 years. In my third year I convinced myself I had ADHD (which I possibly still might) and began heavily abusing my stimulant medication and weed. Funny enough, this is when I felt the “smartest” & most “socially capable” in my life even those a lot of this can be attributed to chasing the adderall high.\n\nThen COVID started & this is where the fun begins. When I returned home I quickly realized how disgusting my adderall abuse and habits became. Quitting those drugs sent me into depression & I started having problems. I couldn’t care less about school, I started having cognitive issues, anhedonia, & started isolating myself. After trying several antidepressants and experiencing derealization & depersonalization I started to obsess about my problems. I have been literally going on reddit every single day for HOURS for the past 5 fucking months trying to learn what the fuck is wrong with me by reading through people personal stories with mental illness, every single psychiatric medication I could possibly put on, & what I could possibly do to help myself. Moreover I didn’t realize at the time what I was doing would screw me over so hard. Through this I developed very deep & profound self-loathing thoughts analyzing everything bad that has happened to me in my life and completely ignoring the good I have accomplished and what I am capable of. Now I am completely trapped in this cyclical thinking of “I am so fucked” “I will never be normal” “How the are people normal” “What happened to me” “I am going insane” “I will never get out of this nightmare” literally OVER and OVER again. I think about ABSOLUTELY nothing else and this is not an understatement. I am stuck in my head 24/7 unaware of what is going on around me & life is just going by. I can’t have a conversation anymore with my family members, & have become extremely self conscious of every single thing I say. I just started working at a restaurant in order to keep my mind of things. It doesn’t help. I am a MUTE at work and respond to things in one word or one-sentences that people often do not know how to respond to.. The meds I take do not work. They make me tired and the rumination doesn’t stop. It will not fucking stop. Because of this I am suicidal. I do not know a way out of this. I try meditating, exercising, positive affirmations, and nothing helps. I’ve lost my friends, my hobbies, theres no pleasure in life, & I am quite very much delusional. I take full responsibility for what has happened to me. Theres nobody to blame but myself. I just don’t know what steps I need to take to become a normal member of society and think like one. I guess a big reason why I am posting this here because throughout the months of digging through here I haven’t been able to find a single person who has gone through something like this, but there is a very small chance that somebody might know/have advice on what to do to get my thinking straight & the steps I need to take to recover my life. I understand it will be a long process, but I just need to be confident that what I am doing will heal me. If anybody out there can help out there, please speak up. I want to enjoy the only life I’ve got, and more importantly, I’ve got to be here for my mum and my sister.\n\n&#x200B;\n\np.s. sorry this is so poorly written.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mmiqz5/i_need_help_mental_health_story/", "title": "i need help. (mental health story)", "social_network": "reddit", "user": "georgegetsmoney", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1617851536, "permalink": "/r/DecidingToBeBetter/comments/mmiqz5/i_need_help_mental_health_story/", "nsfw": false, "first_save": 1635437766.38331, "replies_charged": false}