{"id": "t5_2tand_t3_c8er3x", "request": ["d16532c7-3c5c-45c4-ab79-168cb2cfbb61"], "text": "Looking back, I cringe so hard at some of the things I did and some of the thoughts I had.  I used to be proud that I was \"sarcastic\" and usually tried to emotionally manipulate women rather than connecting with them I also had a temper and was uncaringly blunt overflowing into rude with most people.  \n\nI'll admit that I'm a good looking guy so getting a date was never hard for me but getting a second or third date felt like an impossibility and the ones that did stick were almost exclusively women looking to just hook up. I played it off like that's what I wanted too but it really did bother me that I couldn't seem to find a woman that actually cared about me. \n\nAround a year ago, I realized I wasn't happy and that I was the only person to blame for that.  I started off by reading books on emotional intelligence and mindfulness then followed that up books about \"how to connect\" with people and finished up with relationship books focusing on meaningful connections, how to express and feel loved, the psychology of love and connection, and women's sexuality.  I  also read a few motivational books like \"Can't Hurt Me\", which I also highly recommend.  \n\nNow that I've really started dating again the difference is so profound that it's blowing my mind.  The best part is that I truly feel that what I've learned is now who I am and not some clever tricks I'm using for my own end.  I feel like I'm a genuinely good/better person now.   So many of my old memories feel like the memories of a different person.  A person I can't relate to. It feels like I suddenly gained a soul. \n\nA month ago, I matched with a model/actress on Bumble.  She said she was looking to film dates for a TV show.  I told her I'm not interested in that but she's fun to text with so we could be text friends.  Fast forward a few months and I say we should meet up for a drink just so we can finally meet.  She gives me the line, \"Okay, I'll stop by your area for one drink at happy hour then I'm heading back to Hollywood\".  Pretty cold but I didn't really care because I'm not really expecting anything from her.\n\nWell, within 30 minutes of meeting me, she excuses herself, phone in hand, and goes to the bathroom.  She comes back and asks, \"where are we going next?\".  We end up going out and spending all Friday night together and having an amazing time. We've already gone on a second date and we're already talking about taking a trip together.  I still don't have many expectations with her because she's always busy with filming and may leave the country to film something soon but it's pretty fucking cool that she's already said that regardless of what happens between us that she views me as a friend for life. \n\nIt's not just with her, all of my recent dates have been successful and I finally have the emotional tools to know what makes me happy and how to find someone that will make me happy and how I can do the same for them.  I'm not even ghosting people anymore and can't believe I ever did that!  I'm able to politely express that we didn't connect how I'd hoped and we aren't the right fit.    \n\n\nFor those that are interested, the books I read that helped change who I am (in the order that I read them) - \n\n* Emotional Intelligence: 42 Highly Effective Techniques to Mastering Your Social Skills, Improve Your Relationships & Boost Your EQ\n* The Science of Social Intelligence:: 33 Studies to Win Friends, Be Magnetic, Make an Impression, and Use People's Subconscious Triggers\n* The Science of Mindfulness: A Research-Based Path to Well-Being\n* Connect Instantly: 60 Seconds to Likability, Meaningful Connections, and Hitting It off with Anyone\n* Improve Your People Skills: Build and Manage Relationships, Communicate Effectively, Understand Others, and Become the Ultimate People Person\n* The Five Love Languages: The Secret to Love That Lasts\n* Open Her: Activate 7 Masculine Powers to Arouse Your Woman's Love & Desire\n* Come as You Are: The Surprising New Science That Will Transform Your Sex Life\n\nA few notes:  There were a few books that came recommended that made me feel *very* uncomfortable reading.  Specifically, a book on \"seduction\".  By around a third of the way through, I felt like it was more like a roadmap on how to emotionally manipulate and control people of the opposite sex rather than building meaningful relationships. The books I listed above are the ones I feel will help you become a good, better person.\n\nI hope this is the appropriate sub.  I just wanted to share what I went through and the message that you are only what you can't (or won't) change about yourself and you have the power to change almost everything about who you are as a person if you're willing to put in a little work. \n\nThis is also super personal and I'm a private person so I'm almost certainly going to delete it after a few days, I just wanted to share my positive experience with a few strangers on the internet.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/c8er3x/im_not_an_emotionally_shallow_asshole_anymore/", "title": "I'm not an emotionally shallow asshole anymore after a year of hard work!", "social_network": "reddit", "user": "slippy0101", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 33, "down_vote": 0, "creation": 1562100123, "permalink": "/r/DecidingToBeBetter/comments/c8er3x/im_not_an_emotionally_shallow_asshole_anymore/", "nsfw": false, "first_save": 1635437628.943664, "replies_charged": false}