{"id": "t5_2tand_t3_nhn34u", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "I am in my early 20's. I have no job, no savings, and no degree yet. I've been trying to get one step closer to my dreams but everytime I do I feel like the odds are against me.\n\nI tried applying for a job, I've been rejected thrice, and ghosted by multiple companies (had my initial interviews then no update anymore). The little confidence I have has gone downhill because of this.\n\nMy mental health has gone worse lately, I oversleep purposely and I dont feel hungry lately so I dont eat much.\n\nAlso, my dad is toxic. He's very unsupportive and would tell us (me and my sibling) really mean and degrading words (and would blame his \"trauma\" on us and everything bad happening to him). We didn't grow up with our mom but everytime she tries to reconnect, she just only wants something for herself (\"borrowing\" money that never gets paid, or asking for a favor etc.) I feel used. My sister cut her off from social medias and now I am in the process of doing it as well.\n\n-\nThere was one night where I was really drained so I cried. I was lying on the bed staring at the ceiling. I am not really a religious person but I prayed and I asked for a sign on what should I do. Should I try looking for a job again or maybe try to go back to school.\n\nThe next day, my sister informed me that the public university near our home is open for admission. So I took it as a sign. I submitted my initial application.\n\nNow, I told it to my dad, I expected him to be supportive this time. I used to study in a private school but he doesnt pay my monthly fees so I had no choice but to stop. Anyway  I thought that transferring to a public school will change his narrative BUT NO. HE IS STILL UNSUPPORTIVE. I FIGURED THAT MONEY NEVER WAS THE ISSUE, HE'S JUST UNSUPPORTIVE. (Disclaimer: Im in an Asian country where parents are expected to send their children to school, there are no available student loans in my country)\n\nAnyway, I still have debt from my previous school so I cant get my records that I need to submit in order for me to be admitted to this public school. I hate how my dad didn't think about paying this, he had a lot of time. \n\nSee? I feel trapped and I feel like the odds are against me. I want to go back to school but my dad isn't helping me. I submitted another job application but I feel really anxious right now. I feel like I would get rejected again.\n\nI just feel really lost and confused right now... I am so behind. My friends and previous batchmates are doing well with their careers. \n\nTl;dr: I feel like the odds are against me. I want to go back to school but dad is unsupportive. I tried applying for jobs but got rejected or ghosted by companies. Has a toxic family that's really affecting my confidence and mental health.\n\n\nUPDATE: I want to thank everyone who upvoted this post, especially those who took time to write encouragements, and advice. This is also my first time receiving awards, it made me happy!! There are also people who sent me a private message, I really appreciate you guys. \n\nI was actually crying when I wrote this, I just really felt down last night and I had no one to tell it (I don't want to bother anyone). I didn't expect for this to get this much attention so getting your attention makes me feel like there are people who cares ( I don't have a strong support system, so really thank you everyone!!!) I want to send everyone of you virtual hugs.\n\nThank you so much, you guys don't know how much you helped me clear my mind. I read all of your comments and I am taking some of your advices (some are not applicable to me). I decided to just focus on finding a job, and I will also now fix my sleeping schedule and eat healthy. I will start taking care of myself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nhn34u/i_feel_sad_confused_and_lost_i_feel_like_the_odds/", "title": "I feel sad, confused, and lost. I feel like the odds are against me", "social_network": "reddit", "user": "stayathomecat13", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 489, "down_vote": 0, "creation": 1621583803, "permalink": "/r/DecidingToBeBetter/comments/nhn34u/i_feel_sad_confused_and_lost_i_feel_like_the_odds/", "nsfw": false, "first_save": 1635436500.0608182, "replies_charged": false}