{"id": "t5_2tand_t3_mqksob", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I am a 19 years old women and growing up, the adults around me always told me that I was gifted, and that I will make huge accomplishments in my live. On one side it's something positive, because it made me believe in myself, but on the other side it also pushed me to set huge standarts for myself. I tend not to accept failure, I always want to be the best in everything I do, even when I just start something new. I am extremely hard on myself and I compare myself to others to an unhealty point.\n\nLast year, I was accepted in a selective program at university and the situation slowly deteriorate, and since the covid crisis I can't control it anymore. Over time I developed a kinda toxic form of perfectionism. My morning routine is : 10 minutes of exercice, shower, make up / hair / dressing up, breakfast and journaling / planning my day. If I don't exercice straight up after waking up, I hate myself, I feel disappointed and anxious. That's the same feeling if after exercising I'm not covered in sweat, if my shower isn't cold enough, if I eat nutella during my breakfast, if I don't start working at 8AM o'clock, if I don't work 8 hours a day, if I procrastinate on my phone ... I always told myself that I wasn't hard enough on myself, and that being more disciplined I can solve my issues and reach my goals (btw, my goal is to be selected for the next year at uni). But the harder I am on myself, the more overwhelmed and the more prone to procrastination I am. I started to regulary have anxiety crisis while studying, procrastinate almost all day, and starting every morning without joy. I failed my january exams and the nurse of my university told me that I have a burnout. Even 4 months after this event I still feel extremely bad about it because I feel like a failure.\n\nI think the root cause of this behaviour is perfectionism and the will to thrive in everything I do. I set for myself goals that are out of my control (being the first, being selected for the next year ... I can control what I do, but not the outcome). Do you think perfectionism is the cause of such experiences ?\n\nIf you relate or if you know anything that I can do, you're welcome :)\n\n(and sorry if some parts aren't in good english, that's not my first language)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mqksob/i_can_finally_put_words_on_my_main_issue/", "title": "I can finally put words on my main issue : perfectionism induced anxiety", "social_network": "reddit", "user": "herako3", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1618381765, "permalink": "/r/DecidingToBeBetter/comments/mqksob/i_can_finally_put_words_on_my_main_issue/", "nsfw": false, "first_save": 1635436837.5800629, "replies_charged": false}