{"id": "t5_2tand_t3_pp1qru", "request": ["c67213dc-0eed-4cac-a781-9bc082742908"], "text": "I've had a rough week, in an effort to keep myself responsible for my actions I'm writing this post. My partner and I broke up last week, and he would have been the person in my life who offered me support in times like these. I am currently having a rough day but want to focus on the things I can do to better my situation.\n\nI found out at a medical appointment today that my parents stopped paying for my insurance (I'm 21 and where I live it's common for parents to pay their children's medical insurance premiums until they're 26. It was also court ordered that my dad pay mine until I was 26.) Finding this out caused me to feel stressed out. I can pay my own insurance instead of relying on my parents. This will look like going back to work while I'm in school - I quit my job in July so I could return to school with over full-time units (it will be a $150 premium for insurance every month and I didn't budget for that.)\n\nIn addition to the insurance shock, my car started having issues today. I am going to have to take action to solve the new car problems, which will probably look like changing the oil and taking it to a mechanic. \n\nI'm trying to see things objectively, even though I am under distress about everything I've discovered today. Even though I wish I had support, I am going to make the choice to take care of myself. So I am going to get insurance, take care of my car, and find a job to help cover these extra costs while I finish my degree. \n\nDeciding to be better is not easy, right now I really want to wallow in sadness and cry in bed while having a stiff drink. Nothing is easy about this. I want to make healthy choices though, which means not doing the easy thing.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pp1qru/choosing_the_hard_options/", "title": "Choosing the hard options", "social_network": "reddit", "user": "Early-March-5553", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1631749018, "permalink": "/r/DecidingToBeBetter/comments/pp1qru/choosing_the_hard_options/", "nsfw": false, "first_save": 1635436287.3701162, "replies_charged": false}