{"id": "t5_2tand_t3_k08981", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "Generally, I'm quite a level headed person. I don't get angry so easily, but when the right buttons are pushed and too much, I absolutely lose my shit. I can instantly go from being extremely calm to yelling in a blink of an eye. And if the going gets much more worse, then I can even resort to hitting objects and throwing stuff across the room. \n\nThe moment I resort to yelling, is the moment I fucking hate every bit of myself even though I continue doing it until I can calm down. The regret hits harder after I calm down, like why the f\\*\\*\\* am I so stupid? The thing is, it's ended a few of my relationships because of how bad it can get.  \n\nI'm desperate to change this part about me, and I've TRIED to seek therapists (3) for this and take anger management courses. Yes, they've helped, but I hate how the structure is pretty much the same across different therapists. Something along the lines of... \"Are you mad?\" -> \"Take a breather\" -> \"Should it make you mad?\" Sometimes, you don't have a breather. Sometimes you can't even think straight because it gets to you.  \n\nReddit...  \n\n1. How can I have more of a \"Fuck it\" mentality/What are some things I can do to remain calm even when the going gets tough?\n2. Are there any books/audiobooks you can recommend that I could read into?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k08981/im_scared_im_going_to_lash_out_and_end_my_next/", "title": "I'm scared i'm going to lash out and end my next relationship. What can I do about my anger? What can I do to stay calm?", "social_network": "reddit", "user": "HSSAL4756", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 20, "down_vote": 0, "creation": 1606235445, "permalink": "/r/DecidingToBeBetter/comments/k08981/im_scared_im_going_to_lash_out_and_end_my_next/", "nsfw": false, "first_save": 1635435768.821064, "replies_charged": false}