{"id": "t5_2tand_t3_k4e9vc", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I (F19) was finally able to admit that I feel lonely in every area of my life: From the platonic, romantic and familial relationships in my life. \n\nAfter finally opening up to an older family friend (35F) she was able to talk me through what’s going on with me. I feel unappreciated by my friends and bf. I realized I’m definitely a giver. I do so much for all of the people in my life, and I speak through my love languages of giving gifts and quality time. \n\nMy bf and friends have seems to have been taking those aspects of me for granted. I was trying to plan a birthday gathering of around 7 people last month. It went through three phases of planning and replanning. I was going to give all my friends and bf’s thank you letters for coming. I had ordered a whole wax stamp set and envelops just for the occasion. I had also planned return gifts to give them that individually matched their personality. But looking back my friends and bf didn’t put it any or much effort to make the plan work. That felt disappointing. \n\nMy bf (M19) and I seem to be having communication issues. Lately it feels like he just avoids talking to me because he finds me to be the indirect source of his anxiety. I recently went through a traumatic event (my first post explains in detail) that many people blame part of him for. And ever since rather than feeling like a survivor of the situation, I just have been feeling like I’ve caused more trouble and insecurity in him. It’s a lonely feeling to be avoided by your own bf for several days to find out he’s mad at you for something you read in your journal. \n\nHe apologized and admitted he was wrong. He said to judge him by his actions moving forward and it looks like he hasn’t done anything to violate my privacy again. But I really have to say I’m hurt deeply like that.\n\nMy parents have recently been blackmailing me on keeping me home. I recently found out that their blackmail is baseless. And I feel so hurt that they’re willing to threaten to report a story that isn’t theirs to the cops to keep me home. \n\nAfter saying all of that and talking through it I was finally able to see that I feel lonely. I just felt mad and sad before but now I can actually name it. \n\nSo I’m taking time to myself and starting to journal again and spend more time alone. I’m tired of just filling my time with noise and people who don’t actually prioritize me like I prioritize them. And hopefully after some time I’ll know how to address properly each aspect of my life. \n\nIt’s a step to where I need to go and I’m glad I found it because it felt lonely and lost these past few months.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k4e9vc/finally_admitting_i_feel_lonely_and_unappreciated/", "title": "Finally admitting I feel lonely and unappreciated in my relationships and deciding to do something about it", "social_network": "reddit", "user": "watertaco47", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 27, "down_vote": 0, "creation": 1606799344, "permalink": "/r/DecidingToBeBetter/comments/k4e9vc/finally_admitting_i_feel_lonely_and_unappreciated/", "nsfw": false, "first_save": 1635436886.4223328, "replies_charged": false}