{"id": "t5_2tand_t3_l091i8", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "I graduated high school in 2012 with average grades and no intention of stepping foot inside an educational facility ever again. I never applied myself, I never tried my best. I did the very bare minimum and spent more time worrying about the unfair dress code than I did about my grades. I planned to become an actress and just magically \"make it\" with nothing but a high school diploma from a school that specialized in the arts under my belt. \n\nWhen I was younger though, I wanted to be a doctor or a nurse. Definitely something in the medical field as I find biology and the human body fascinating and always have. When I was 12, I almost shadowed a friend of my dad's who was a nurse for a day to see what she did and whether I was interested or not. Then I discovered theatre and my whole world became that and nothing but ... \n\nI switched high schools after the first semester of ninth grade to go to a school for the arts and, like I said, planned to become an actress, but didn't want to go to University. \n\nI'm now 26 and though I still love doing community theatre and have an agent, I don't feel passionate enough about acting anymore to work hard enough to pursue it (not to mention, it's just about the hardest business to get into). I want to be a nurse. \n\nSo, I did my research and made the definitive decision to go to post-secondary for Nursing. Since I didn't take the required prerequisites in high school, I have to do the pre-health program at my city's college first which is a year long and gives you a certificate that qualifies you for University programs in the medical field, like nursing, vet tech, dental hygienist, etc. Today, I applied for Pre-Health and I'm so incredibly excited and proud of myself. \n\nThings are going to change. I'm going to work as hard as I can to get the best marks I can, making my chances of getting into nursing (a highly competitive program) and my original dream coming true much higher. I am so motivated ! No more slacking off, no more procrastination. I am going to do this. \n\nAnd I'm gonna be the best damn nurse out there !", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l091i8/i_applied_for_college_today/", "title": "I applied for college today.", "social_network": "reddit", "user": "EnormousCrow", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 114, "down_vote": 0, "creation": 1611020011, "permalink": "/r/DecidingToBeBetter/comments/l091i8/i_applied_for_college_today/", "nsfw": false, "first_save": 1635437522.2547321, "replies_charged": false}