{"id": "t5_2tand_t3_91j2rz", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Hello, I'm 28/M and currently don't have friends. I need help on how to efficiently improve myself for job interviews, work efficiently, and also everyday life stuff.\n\nI was diagnosed with language processing disorder since I was 5 and that it is been happening now. Because of poor literacy , it makes it a lot difficult to practice the soft skills ( could be problem solving skills too) and learning. I understand that I need to keep practicing, but the worst thing it could happen is that I would practice on the wrong things without knowing my blindspots. In others words, I'm wasting time on trying to have my brain to click it but nothing happens. This does affect me to learn things and I have to learn slowly. I also am unemployed and do not know what I want to do other than getting a decent job as my goal.\n\nI have tried to watch movies, doing Uber to practice talking to people, to try to improve my talking skills, but most of the time, I instantly forget what others said. In movies, I had to rewind most of the time to remember what the person is talking about, same thing happen when I take online courses, youtube courses.\n\nI have searched for solutions around the web to find if anyone have the same issue as mine, but most of the time, they would say you have to keep practicing.\n\nI'm sorry if my writing doesn't make sense, but I just want to know what blindspots should I focus on so that I can efficiently practice improve the soft skills/learning skills/problem solving? \n\nWould it be my listening skills, need to expand vocabulary, or need to read more?\n\nThanks", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/91j2rz/help_having_trouble_improve_myself_when_it_comes/", "title": "Help: Having trouble improve myself when it comes to practicing soft skills/learning skills have poor literacy. What am I doing wrong here?", "social_network": "reddit", "user": "anony545454", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1532450823, "permalink": "/r/DecidingToBeBetter/comments/91j2rz/help_having_trouble_improve_myself_when_it_comes/", "nsfw": false, "first_save": 1635438250.884251, "replies_charged": false}