{"id": "t5_2tand_t3_i1ue2r", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290"], "text": "Today I finished my first college class with an A after lots of issues and potentially dropping out. \n\nIn high school I was a straight A student, always staying up late to over study for exams and finish assignments. I graduated high school close to the top of my class and moved on to college naturally. \n\nI went to a large university many of my friends were also going to and was excited. The first few months was a lot of time spent with new friends, met my now ex, and spent more time hanging out and partying than in the library. The first semester was probably the best with an A/B average and I enjoyed lots of scholarships frivolously. \n\nThe second semester my grades were all over the board. I was spending nearly every day with the ex and new friends, and thought any study habits/ ability to somehow do well in high school would automatically transfer. That was the first time I had ever failed a class. A lack of studying and thinking an 8am lecture was too early meant lots of missed classes and that I had to repeat calculus 3. \n\nThat spring semester was when I began smoking cannabis somewhat regularly. I had always smoked a little in high school at parties and the last bit of senior year I found having my pen at my desk was in reality very productive and was an effective study tool. In college it was a very different scene of waking up late and smoking just to play video games, snack, and watch tv rather than at a desk as a study aid. \n\nThat was the summer that I had lost my scholarships. The ex was living with me in my apartment off campus as we were both taking summer classes. She was never big on smoking then as she was never too exposed. Respective of that I made it a habit not to smoke when together and when she would leave. Seems sketchy, probably was. I’m unsure if I had failed the class I was taking or dropped it late in the semester. But my GPA dropped along with it. When it came time to move into a new place for the next school year. \n\nI had become very close with the same friends from the beginning of college. In the spring one of them had a very unfortunate accident and the four of us friends (including the ex) drove downtown to visit her in the hospital nearly four times a week to stay for a few hours each time. She was in the hospital for nearly five months and I had let her borrow my ps4 during tat time to make her stay better. We all became great friends and decided to try and find a house for the  five of us in the upcoming fall semester. \n\nMy ex and I got lucky and found a nice big house with five bedrooms that we all fell in love with. Without many scholarships to afford the house, that’s when I began working my first job. I applied to a blaze pizza next to my apartment and got the job. Even though it was minimum wage, I met nice coworkers and worked hard and stayed late and got better quickly. Never having been used to a paycheck, I found myself enjoying work more and school even less. \n\nMoving into the new house was the start of the end. The ex and I shared the master, bad idea, and the friend who had an accident got her medical card. I focused more on work and became a model employee and had fun, but began smoking a few times a week now. The ex began smoking too and it became a household activity. Between living it up and friends and working most days of the week, I had really put school on the back-burner. \n\nThe ex and I broke up that fall, as now both of us were neglecting school. There wasn’t a particular cause, but we both just felt it had lost its spark after a year and it slowly fell apart. It was very tough and awkward around our house but lucky we had a spare bedroom. I failed most of not all of my classes that fall and at the  end I had considered dropping out in December. \n\nJanuary came around and started fresh at the start of a new year. After a terrible December, I got some of my stuff together and began volunteering at the hospital my friend was staying at. I enjoyed nursing and decided to change my major. I met a nice sorority girl who pushed my to study more as we met on campus to go to the library quite often. COVID then came quick and prevented me from volunteering at the hospital, classes moved online and although I still wasn’t a star student, I had only dropped two classes that spring. \n\nStarting this summer, I stopped smoking just as much as my ex picked it up more each day and I decided to focus on school. Things have been going great with the girl I’ve been seeing, we’re dating now. My job was secure fortunately, and I’m moving up after a year of hard work. The first class this summer I studied hard and finished with a B. My ex is now moving out of the house and this class the second half of summer I studied hours each day, sometimes waking up just to study and then go to work. My gf went home for the summer but we FaceTime nearly everyday and we’ve been best friends since we met. And finally at the end of this summer I got my first A in college in nearly two years. \n\nNext I’m working towards getting my scholarships back so I can quit work and focus more on school. I just made plans to visit my gf’s hometown in another state over thanksgiving, and I couldn’t be happier. \n\nMake sure to focus on what matters and good things will come, you can’t expect it to be easy. \n\nTLDR: Straight A student in high school, had much too fun in college smoking and forget classes and started failing, met an ex and some friends, lost my scholarships and had to get a job. Broke up, worked hard, stopped smoking everyday met a new girl and now I’m finally back to studying. Got my first A this summer in two years of college.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i1ue2r/got_my_first_a_in_college_in_a_long_time/", "title": "Got my first A in college in a long time", "social_network": "reddit", "user": "leebo879", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1596297142, "permalink": "/r/DecidingToBeBetter/comments/i1ue2r/got_my_first_a_in_college_in_a_long_time/", "nsfw": false, "first_save": 1635436650.5005913, "replies_charged": false}