{"id": "t5_2tand_t3_dhcvvb", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I’m going to touch base on a few traps that are self-created by comparing yourself to others. These self-created comparisons will cripple the potential of your deliberate attraction and manifestation results. By understanding the origin of these emotional pitfalls, you will be in a position to do something about it for the better.\n\nI will start with envy, which is the awareness of other’s abilities and skills that give them an advantage over others. Envy is a double-edged sword because not all envy is bad. You can admire and envy a person simultaneously, which is normal and healthy. You can also behold an unhealthy envy which is envy stacked with hatred or disgust. Whichever the case may be, you feel inferior on some level which makes the attributes you envy out of your reach. They are out of your reach when you aren't in the required mindset to obtain those attributes by choosing to remain envious.\n\nWhen you become aware of the abilities that someone has, that gives that person an advantage in life, you can learn from that person and grow. This is because feeling envious signifies that you are noticing a specific ability that you want to call your own. In other words, recognition of good traits that aren't already yours is taking place because you want them for yourself. You want them for yourself because they will help you fulfill your purpose for being here. They will make your travels towards your destiny easier.\n\nThat said, if you are already in a mindset that allows you to be aware of the traits you want to call your own, then you are halfway there (to making those traits yours). The other half is the required work it will take to make those traits yours (hence the envy). This can only happen after you shift your emotions of envy (both good and bad) into the realization of your potential so you can work on strengthening those areas within yourself. Therefore, use your envy as a teacher by recognizing what you envy, then work towards making those attributes your own. \n\nNext is jealousy. Jealousy is the awareness of the privileges that others have that give them the means to move through life with less work or effort than others. Unlike the privilege of having an ability, that we might feel envious towards, these are privileges that need no work, skill or ability to maintain. Jealousy is felt when you realize the struggles you have to deal with are far more significant than the struggles the person you are jealous of has. Jealousy can be of a person’s privileges, perks, freedoms, beauty, and overall “given” upper-hand in life. \n\nWhereas envy can be easily identified and fixed, jealousy is a hidden realization that you are where you don't belong. If you are sharply aware that someone else is getting by effortlessly, to the point of feeling jealous, then you are in the wrong place or position in your life. This is because, if you were manifesting a lifestyle you love, you wouldn’t be in a position to notice how well others are doing because you would be too busy enjoying your own story. Therefore, if this is the case for you, then you need to take a good look at where you are at in life. Take action to realize what kind of lifestyle you would have to live in order to be immune to jealousy. Your newfound realization will be a good indicator of where your next steps towards a new path can begin. \n\nNext on the list of comparisons would be resentment, which stems from intimidation and can morph into feeling like a victim. Resentment is an emotion we have all experienced and will probably experience again. Resentment is like a sticky tar that holds you down if you touch it. An example that almost all of us can relate to would be the resentment we had or have towards others in higher positions, within our workplace, especially the ones directly above us. \n\nIf you love your job and your superiors, then you are in a very desirable spot. However, you may not like your job because you hate your superiors. Dealing with these people makes you aware of your vulnerability, and because of this, you begin to resent these individuals deeply. Once you start to feel vulnerable around these people, the sticky murk has got a hold of you. If there is nothing you can do to rise above the resentment you have of a superior then you need to make plans to move on, either within that company or towards a new one. This is because living with resentment, in one area of your life, will eventually seep into and compromise all the other areas of your life. Resentment is very corrosive to a healthy lifestyle. \n\nOf course, resentment isn't solely a workplace issue. This feeling takes place in any event where you feel trapped or at the mercy of another. It's a feeling of powerlessness due to another. Whatever area of life you are at, where you see yourself as a victim, is where the resentment will be. It's a nasty emotion but a significant indicator of where to find your self-inflicted or allowed weaknesses so you can start to be proactive in regaining your personal power. Resentment is also a pre-judgment trap because once you get stuck to the murk of resentment, caused by a specific individual with specific characteristics, you are very likely to instantly put up walls the moment you notice similar characteristics in another individual whom you have yet to let in. \n\nHere is a quick example to sum this all up. I live in Florida, and in Florida, our carpenter ants don’t eat wood. Over here, they eat food crumbs like all the other ants. Only the carpenter ants up north eat wood (New England states). However, the carpenter ants in Florida like to nest in wet, damaged wood. If a person has a sudden infestation of carpenter ants in Florida, it means the ants are burrowing in damaged wood nearby, which means there might be an unknown roof-leak or tree with root-rot nearby. The ants may be a nuisance, but nothing like the nuisance a collapsed ceiling in the house, hidden black mold, or a tree falling on the house would be. For those who are aware of this probability, the ants are merely a small indicator and warning of the mess to come if the nesting source of the ants is not found and addressed. \n\nJust like we would recognize the nuisance of carpenter ants as an indicator of hidden dangers around our home, you should recognize your ill feelings towards others as an indicator of the hidden demons in your mind. Once the source is addressed, the demons will go away like the Florida carpenter ants who no longer have wet, damaged wood to nest and grow in. Much like the ants, the nasty feeling you get from comparing yourself to others is mother nature's way of suggesting you look around and find the source.   \n\n&#x200B;\n\n\\~Nicholas D’Arezzo\\~", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dhcvvb/envy_jealousy_and_resentment_can_be_your_teachers/", "title": "(Envy), (Jealousy) And (Resentment) Can Be Your Teachers", "social_network": "reddit", "user": "Nicholas-D-Arezzo", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1570984576, "permalink": "/r/DecidingToBeBetter/comments/dhcvvb/envy_jealousy_and_resentment_can_be_your_teachers/", "nsfw": false, "first_save": 1635437865.3995748, "replies_charged": false}