{"id": "t5_2tand_t3_q7vasm", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "I'm not good with words, so I'm just going to put this out there.\n\nI (21F) am so damn proud of myself.\n\nIt's been one year since I broke up with my emotionally manipulative ex. One year since I got my bipolar type 2 diagnosis and my health started deteriorating. One year of just trying to make sense of everything, going to psychiatrists, meeting with friends, just generally trying to keep myself together because I was always *this* close to snapping. I was always downgrading myself in those days, telling myself, \"*There is no way you can get better from this\"* or \"Y*ou're screwed. You're literally screwed.\"*\n\nNo more.\n\nDespite my thoughts, I forced myself to continue and try to make sense of mental diagnosis. I picked up sports (mainly running) where I did the 0 to 5km program so I could stick to a regiment. I spent a lot of my time just grieving. Grieving and grieving and grieving over my lost time, over my life-altering diagnosis, over my self-doubt and my pain. I spent so many days just trying to make sense of it--how can this be me? Why was I made this way? \n\nI am so much better now. So, so much better. I can see that I look healthier and happier from exercising more. My love for my old hobbies--like reading and art--are starting to come back. I have a cat now; she's the love of my life and my emotional support partner when the days are hard. I stopped lashing out towards my friends and family (my biggest shame to this day); we've started getting closer, which I'm glad for.\n\nI don't know what else to tell you except things will get better, I promise. There were just so many times I fell so low and I thought I wouldn't get back up again. I still have days like this, like yesterday, where I just thought nothing really liked me and I was doomed to be hurt my entire life. Don't let the self-doubt eat you. It's a slow process right now, trying to fix myself back up again, but it's working. I spent so long just to even see a tinge of those results.\n\nI am not entirely perfect. I think I still have a long way to go to really be the person I dream to be. I still have problems to fix, stuff I need to deal with. But for now, the distance I've run is more than enough. I am--genuinely--very happy.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q7vasm/becoming_the_person_i_want_to_be/", "title": "Becoming The Person I Want To Be", "social_network": "reddit", "user": "ManyChance9158", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1634199240, "permalink": "/r/DecidingToBeBetter/comments/q7vasm/becoming_the_person_i_want_to_be/", "nsfw": false, "first_save": 1635436447.422864, "replies_charged": false}