{"id": "t5_2tand_t3_71spvo", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "I've always had a difficult time finding the right amount of balance in my life when it comes to social media, digital posture-ing, and information intake. Back in high-school when Myspace was all the rage and AIM was the main way of contacting people on the internet, I flourished in using those things as a tool for creativity - sharing photos, crafting a profile, starting conversations with people I wouldn't otherwise had the chance to talk with, and even finding a sense of identity or uniqueness in the crazy and dramatic world of high school (you know, for that one year I WASN'T home-schooled).\n\nFast-forward a couple of years, social media is the norm, 4 out of 5 Americans are on FB (1 billion on the planet) and we see the overt monetization of Facebook, Instagram, and the like with targeted ads and not-too-useful political dialogue (that, research shows, does little to ACTUALLY change people's initial opinions anyway). We are the product - it's not a secret and everyone know's it - we serve up our data, our info, our thoughts (as I'm doing right now) and they serve us a tool to connect with other people - that's the game and we're all knowingly playing. It's an indispensable service. Yet, there's a slight cringe element to it all - something is a bit off. Not that long ago we started hearing about how governmental agencies are using social media platforms to influence opinions, that American citizens are being spied on by their own government... and we're just making it all the much easier. Phones are even showing ads from keywords people have vocally spoken and never typed in, friends being suggested by FB that we have never had in our phones, etc. Face recognition, shadow profiles... All of this, in my mind, contributed to an \"ick\" factor.\n\nI started taking steps to reduce my footprint - I used the privacy settings that Facebook offers - making all my posts invisible to people who aren't listed as friends. My phone number isn't searchable on FB; I uninstalled the FB app from my phone (which has an incredible amount of permissions including discreet access to your microphone, contacts, location, and camera and unless you un-install it, is always running and draining your battery). I use an app called Folio which basically puts a skin on the mobile browser version of FB along with a lot of features including blocking the activity ticker and embedded ads in your feed, and allows you to message people without downloading FB messenger.\nI got rid of Snapchat - now you may call me a tin-foil-hatter on this one, but all of the facial recognition features were seriously creeping me out. You can't tell me that Snap Inc isn't creating a massive database of your facial profile. We are only a couple of steps away from a more concerning entity having that data.\n\nYet, all of that \"creep-factor\" is not the primary reason why I stepped away from Snapchat.\n\nAs I shared on Snapchat (and eventually on Instagram Now), I began to notice subtle differences in my own patterns of behavior, thinking, and social tendencies. While it was definitely fun to keep up with friends in their daily comings-and-goings, I started noticing how I anticipated notifications - compulsively looking at my phone waiting for a \"ding\" or a light flash, notifying me that someone had sent me something. It made me feel weird - this strange dichotomy of seeing more of friends via these apps but the content was frivolous in nature and very, VERY distracting - making me feel less connected in a way. So I turned off those notifications - if someone sent me something, it would be there, ready for me, when I chose to open the app - on my terms. But that didn't help - I still felt the need to share my daily happenings: things I found funny, being goofy, and I still compulsively checked the apps for new things at any moment I had to spare.\n\nThat strange pressure/pleasure to share, to post, to keep snap-streaks going (it's literally a meaningless number but I don't want to lose it!!), to click thru all the new stories friends have posted. I felt trained - which is true - I was trained. These companies spend big bucks to research how to provide that tiny dopamine hit to keep your eyes on the screen - that novelty, newness, social connection we all crave, all the time. Well, that money is well-spent because it works - it's not a conspiracy and it's not necessarily a bad thing... but I didn't like it. The real-life social consequences of being a heavy Snap user were subtle, but were there. I noticed my desire to deep-dive in conversation with a friend in person had been slightly dampened since I already knew what concert they had been to, where they had eaten, and who they had been hanging out with; I noticed my thoughts would be a bit manic and jumbled after I did check my feeds - comparing, projecting; I noticed I felt the need and the desire to check those feeds while perhaps literally being in front of the people whose feeds I was checking!! All of this felt absurd at times.\n\nSo...You know what? Screw it. I disabled my Snap account and deleted the app. That was two years ago and I haven't looked back - I'm too compulsive and sensitive to social elements and it wasn't right for me. I shifted my focus on using Instagram to share beautiful moments, people, and places - occasionally using the live/now features and it wasn't really a problem. I used FB for event planning, keeping a blackbook of couchsurfers or people met while traveling or about town, and sharing things I found to be neat. \n\nOne of my favorite podcasts, Note To Self, released a week-long tech challenge, focused on questioning our relationship with technology compulsivity and usage (primarily pertaining to social media). I completed most of the daily challenges and walked away from it with a “huh” kind of feeling. That feeling has been festering in the back of my mind for quite some time. This year I’ve become friends with a few people who have a much smaller digital footprint and I found being around them to be refreshing and inspiring. I started becoming convinced that small moments of downtime (the 5 minutes after waking, 5 minutes on the toilet, 5 minutes eating a snack, walking to my car, walking to a store, waiting for a friend to arrive, etc) were being used to check up on the latest happenings on social media when they could be used to daydream or just enjoy living life in the slow lane for a moment. I started learning of this concept of boredom and how our society is reaching a crisis of sorts by not allowing our brains to do some wandering.\n\nFinally, it was a mix of reading “Bored & Brilliant,” watching a movie that parodies Instagram’s #so-cal #folklife culture (Ingrid Goes West), and being grossed out by my own and others’ compulsive need to share. I don’t really care about the motivation (art, creativity or feeding one’s ego or need to be approved of, connected) - the repetitive, pavlovian behavior alone was enough for me to question it and reduce my involvement in it. I disabled my account and deleted instagram. \n\nHaving said all that, I don’t condemn others for their usage, but I personally don’t want it to be a significant part of my life. I don’t want to be in conversation with someone in person and have them suddenly pull out their phone to catch up on a feed - they might as well get up and go into the other room because their mind (along with their ability to listen and be empathetic) go along with it. The connection I have now feels more meaningful.\n\nI want to hold my experiences close, to share them with passion and zeal with the people who are there with me (and afterwards in story-telling with the people who weren’t there). \nI want to be bored at times, have nothing to scroll thru, and allow my thoughts to pass by slowly like clouds drifting across the horizon - being open to creative ideas and epiphanies.\nI want to have moments of privacy that I only share with myself and whoever is present at that moment. \n\nAnd, I will. But only by making space for that to happen. \n\nTL;DR (too long, didn’t read):\nAlways questioned social media usage, became creeped out by privacy concerns and recently more annoyed by pavlovian behavior / obsessive usage / need to share. Deleted snap, insta - and only using fb for travel contacts, events, and photography. Found free time daydreaming to have subtle advantages. Feel more passionate, creative, fuller, and more immersed and connected socially.\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/71spvo/i_quit_snapchat_two_years_ago_earlier_this_week_i/", "title": "I quit Snapchat two years ago. Earlier this week, I quit Instagram too. This is why... (warning: wall of text, TLDR at bottom)", "social_network": "reddit", "user": "inspiremitchell", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 246, "down_vote": 0, "creation": 1506102876, "permalink": "/r/DecidingToBeBetter/comments/71spvo/i_quit_snapchat_two_years_ago_earlier_this_week_i/", "nsfw": false, "first_save": 1635436549.0076053, "replies_charged": false}