{"id": "t5_2tand_t3_i0e9jp", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Not too long ago, I figured out that I could no longer go on living a life that I wasn’t fully myself in. I had grown exhausted with keeping up appearances. I was too tired to continue on a path that I had already been down. It was time to forge a new way of being. \n\nThis journey hasn’t always been easy. I’ve had to face a lot of dark things. But all the things I faced were parts of my story. I felt ashamed of who I was, what I did, and how I did things. I was ashamed of just existing for most of my life. I didn’t think I could do anything right so I buried myself deeper and deeper until I forgot who I even was. \n\nDigging into the masks and layers I accumulated over the years brought some hurtful things to the surface. It brought a lot of pain. It’s a beautiful kind of pain, though, because it’s my life experiences. I never want to shy away from anything I endured or made my way through because even though it hurt, I made it out stronger than ever. \n\nThe dark parts of my life remind that I am strong. I am resilient. And I can thrive even when the world tells me I shouldn’t. I can succeed even when the odds aren’t in my favor. If I tune into my own knowing instead of the mindless chatter of everyone else and society, I can actually unlock experiences beyond my wildest dreams. \n\nI don’t know what lays ahead, but I know whatever comes my way isn’t as strong as I am. I now understand i don’t have to fear life but embrace it- embrace the uncertainty and embrace the challenges because waiting on the other side is a portal of unlimited possibilities. \n\nInstead of limiting myself with replaying the past over and over again, I choose to step into uncharted territory with curiosity and excitement. \n\nI choose living instead of withering. \nI choose to be authentic instead of hiding. \n\nI choose me, over, and over, and over, again.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i0e9jp/i_can_choose_to_do_whats_best_for_me_every_day/", "title": "I can choose to do what’s best for me every day.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1596077257, "permalink": "/r/DecidingToBeBetter/comments/i0e9jp/i_can_choose_to_do_whats_best_for_me_every_day/", "nsfw": false, "first_save": 1635436527.0120854, "replies_charged": false}