{"id": "t5_2tand_t3_gl4gsu", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "Jealousy and envy keep my depression front and center in my life. A solution I see proffered is to reverse it by focusing not on what you don't have but on what you do. I will start out by saying, it's not lost on me that I have certain advantages in life as I sit here and write this. I live in a place with clean running water, low crime, I'm white, and I am alive. But if I'm being honest, I tend not to see those things as this great well of contentment I can draw from. I also have trouble internalizing the \"they may look happy and successful on the outside\" type of advice. I'm aware other people are humans and likely have problems. It's just that they have what appear to be good things in their lives too, which I think we could agree counts for a lot to the human psyche.\n\nThe quick rundown is I'm 35, no degree (dropout), have an okay job (wouldn't say a career), no girlfriend (never has been, depression/avoidant personality), maybe one good friend, hobbies that have all evaporated, and an 8-year old back injury I feel every day and makes exercise almost a pipe dream (but not bad enough to operate on for a number of reasons). With these areas of life–education, occupation, recreation, and relationships–being so \"thin\", I find jealousy comes to me very easily. I can't mount a decent defense by telling myself \"at least I have several kinds of condiments in my refrigerator\" and honestly believe it.\n\nTo me, there's a couple of ways I can look at it.\n\n1. Be more humble. I'm aware of the awful conditions and lives people have, but I find it difficult to keep that in mind throughout the day and always be using the \"well at least I don't have it as bad as this other guy\" doesn't seem to really work. I think I need something to be proud of, not just have something that someone else doesn't, if that makes sense.\n1. Accept that, despite having understandable reasons to be jealous, I have no choice but to endure these feelings and simply continue trying to improve my life in the hopes that maybe my life will be more rich someday.\n\nI don't want to be full of so much resentment and regret but it only gets worse as each year passes. Does anyone have any advice on how to somehow sidestep these feelings or a favorite way someone put it on how to better process them?\n\nTL;DR: I don't feel I have a lot of positives in my life to pull from, so the idea of finding satisfaction in what you have to combat jealousy doesn't seem to be an effective strategy for me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gl4gsu/i_need_some_other_way_to_deal_with_jealousy_and/", "title": "I need some other way to deal with jealousy and envy", "social_network": "reddit", "user": "sonderlost", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1589670816, "permalink": "/r/DecidingToBeBetter/comments/gl4gsu/i_need_some_other_way_to_deal_with_jealousy_and/", "nsfw": false, "first_save": 1635438154.2814312, "replies_charged": false}