{"id": "t5_2tand_t3_n9c7sv", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "About a little over a month ago, I got out of a pretty major relationship that I fully invested my life in. He was the one that ended it with me because he couldn't stay committed to me and he thought I deserved a better guy. Well, my life changed a lot when we broke up because we were living together, I practically dropped my life for him, and just honestly focused on us and the relationship. Due to that I really lost myself. I didn't focus on my needs, my mental health deteriorated, I tried anything and everything to make the relationship work and make him happy, and I dropped my hobbies/passions and pretty much my friends. I was fully invested in the relationship that when it ended, it was a shock to me and I didn't know how to live on my own and for myself. \n\nSmall tiny background on my relationship, for the first year and a half it was literally perfect. Dates, gifts, love, and just amazing times. It slowly got worse once I found out he was cheating on me (not physically but emotionally and flirted and asked for suggestive photos). He apologized and felt bad but it didn't get better cuz I was always on edge and continuously looked through his phone. \n\nHere is what I found that destroyed me: During the beginning of our relationship he would flirt with girls, compliment them better than he would ever compliment me, when the girls would confess they liked him or had a crush on him he would reciprocate saying he wish he knew earlier so he could have been with them over me, he would always look for girls suggestive photos and websites, and yeah. This stuff only happened the first few months we started dating and the last year of us dating. \n\nWhen I brought this up he would turn it against me saying that it's my issue because I'm extremely insecure. That so what if he likes these girl's photos (even tho I asked him not to do that), so what if he finds them attractive, and that this is all my fault. He said I should stop comparing myself and stop being so insecure and he did no wrong. \n\nThis relationship ruined my self esteem and self confidence that I'm extremely insecure now. I don't like being like this when I'm literally about to turn 25 years old (he's 2 yrs older than me btw). \n\nI know I'm not ugly, but I still truly hate myself and my body. How do I get better from this?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n9c7sv/got_out_of_a_major_25_year_relationship_that/", "title": "Got Out of a Major 2.5 year Relationship that Destroyed My Self Esteem and Self Confidence. How Do I Gain Those Back Up and Feel Better About Myself?", "social_network": "reddit", "user": "Euphoric_Gazelle_575", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1620671082, "permalink": "/r/DecidingToBeBetter/comments/n9c7sv/got_out_of_a_major_25_year_relationship_that/", "nsfw": false, "first_save": 1635436853.9266398, "replies_charged": false}