{"id": "t5_2tand_t3_ffvs37", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "\nGreetings fam! I saw that so many of you find solace in creative projects, and wanted your advice. I am a graduate student, and writing (creative and academic pieces - articles, op-eds and theses) used to be my lifeline. Words would flow from my fingertips with great ease, and I never had to worry about stumbling over words, finding perfect phrases to encapsulate my emotions over specific themes, or generally moving forward with my writing in any way whatsoever.\nI had a sharp manic psychosis last May, followed by a hospitalisation. The crash since then has been inevitable, and has taken a severe hit on my life. I spiralled into the worst depression of my life, the colours faded away into nothing , and I lost my way with words. I took a sabbatical from graduate school for the year (still on it) and while my meds have pulled me out of the depression, I struggle so much to write again. It feels like someone chopped off a limb, and I can still feel the haunting phantom cries , but can’t get myself to do anything about it. \nHas anyone gone through the same thing, for any creative process? Do you have any suggestions? I would be so, so grateful. I would be happy to write you something. I’ve been practising writing a little bit everyday but the struggle is tearing my self confidence into shreds. All help would be really appreciated. \nLots of love.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ffvs37/acute_writers_block_since_bipolar_diagnosis_all/", "title": "Acute Writer’s block since bipolar diagnosis. All advice would be welcome!", "social_network": "reddit", "user": "pdmnb", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1583765404, "permalink": "/r/DecidingToBeBetter/comments/ffvs37/acute_writers_block_since_bipolar_diagnosis_all/", "nsfw": false, "first_save": 1635438345.4667304, "replies_charged": false}