{"id": "t5_2tand_t3_onpnix", "request": ["b69cf201-6737-4217-b486-9096135546b8", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "I have a long history of anxiety-based nausea and wooziness. Ive missed class and left work early because of it and always felt fine by the time i got into my car. I also called off a lot.  I always hated that and felt so guilty. \n\nI got a new job in December and love it. Ive missed only half a shift in January for what turned out to be an unusual-for-me aura of a really bad migraine. Like i said i love my job and i want to do well and be proud of my work. \n\nAfter lunch today i started to feel a bit sick. I think my lunch just didnt sit right. I let my boss know and took some pepto bismol and got a sprite from the vending machine. The feeling improved but continued. My partner went on lunch. there has to be one of us there except during the one hour “closed for lunch” period (we stagger our lunches). I told myself since the office would open while she was gone, i would wait until she got back and see how i feel. \n\nI was talking to a coworker and my partner got back. I looked at her and immediately felt my stomach tighten and i felt sick. And i realized i felt fine while talking to my coworker. While i may have been legitimately sick at first, i was now anxious about it and so still felt sick. \n\nI knew i could just tell my boss i wasnt feeling better and get to go home early (while i love my job i would still prefer to be home) but again, i love my job and want to do well and dont want to fall back into the going home early/calling off trap. So I decided to stay. I let my boss know. \n\nWithin half an hour of deciding to stay, i felt perfectly fine and clocked out at 5 knowing i did my best and felt so proud of myself for powering through my anxiety and having what all in all was a good shift. \n\n\nTl;dr: i felt sick at work, got anxious about it, felt sicker. Realized i felt sick because of anxiety, toughed it out and felt better and had a good shift.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/onpnix/i_didnt_let_my_anxiety_win_and_finished_my_shift/", "title": "I didn’t let my anxiety win and finished my shift", "social_network": "reddit", "user": "Shadowthesame14", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 638, "down_vote": 0, "creation": 1626736250, "permalink": "/r/DecidingToBeBetter/comments/onpnix/i_didnt_let_my_anxiety_win_and_finished_my_shift/", "nsfw": false, "first_save": 1635436443.382362, "replies_charged": false}