{"id": "t5_2tand_t3_ponvs1", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Human beings are fascinating creatures — we’re essentially cut from the same cloth, and yet have the ability to weave ourselves into different things. Our choices largely dictate whether we build ourselves into a beautiful tapestry or into a dirty, useless rag.\n\nAnd yet, these choices are not always loud shows of extravagant effort — in fact, success is rarely attained as a result of one grand event. In an overwhelming number of cases, success is a result of daily engagement in a set of uninteresting , mundane tasks.\n\nInterestingly enough, by changing the tasks in which we engage every day, we can change the course of our lives. Therefore, small changes in perspective that result in adjustments in the choices we make regularly *can and will* have a tremendous effect on how our life ends up looking like.\n\nBecoming an authority figure in any given field is a very similar process. In this short essay I will outline a key difference between the people who become influential and those who remain unremarkable.\n\nThe principle can be outlined by the following scenario.\n\n*Let’s say you want to get a job as a Software Developer. You’re curious about what programming language is the most in-demand so you can start a fruitful career.*\n\nWhat do you do?\n\nMost people would head off to *Google* and search a variation of the following:  \n*“Best programming languages 2021”*\n\n…and that’s where the problem lays.  \nBy typing the words above, you’ve consented to forfeit your role as an authority. You’ve given someone else the power to decide for you.\n\nAn influential person would have gone about the same task a different way. Instead of looking at a *“top 10 programming languages”* list they found on *Google*, they would have headed off to *LinkedIn* and *browsed the job offerings page for 45 minutes, noting the trends that emerge*.\n\nThat’s where the difference between an Authority and a unremarkable follower lays.  \n**An Authority does not rely on dead information**\n\nWhat does that mean? What is *dead information*?  \n*Dead Information* is knowledge that’s divorced from reality. It’s information that you understand on an abstract level, and yet have no reference point to anchor it to.\n\nWhen you go on *Google* and look up *“best programming languages”*, you have no idea whether that list has any connection to reality. You simply trust that the person who wrote the article knows what they are talking about and that they have looked at the real world before painting the picture. But the truth is that the people who write these articles as just as prone to committing this mistake as the readers are. A majority of people writing these articles don’t actually spend time gathering data themselves — instead, they simply look at other *“best programming languages”* articles, and simply create a synthesis of those.  \n**What you end up reading is a copy, of a copy, of a copy.**\n\nBy allowing other people to paint a picture of what reality is, you essentially allow yourself to live out an *illusion*. *The world is not static; it’s an ever-changing waltz of chaos and order*. Pillars that we considered unshakable yesterday, will crumble tomorrow. *If you understand that the advice you hear around you is largely an echo of what someone said long ago, you can see how the world that person described likely no longer exists.*\n\nSo, what is there to be done?\n\nI believe it is time to start using our own eyes. *When we want to understand something, we should resist the urge to ask*. We should stop looking at other people to explain to us what the world is and how it works. Instead, we should look around and draw these conclusions ourselves. We should understand the limitations of abstract thinking and language, while accepting that the truth of the world is to be observed, not theorised about.  \n**We should fall in love with live information**\n\nDo I believe we should arrogantly dismiss experts while touting how we know better than everybody else? Do I believe teachers and mentors are useless? Do I believe reading books is a waste of time? Of course not, use your common sense.  \n*Using the wisdom of people before you is the most powerful tool we have* — it’s what differentiates us from other animals. The very ideas in this essay were inspired by far wiser people than myself.\n\nWhat I am saying is that you should verify the information you gather. Don’t allow your knowledge to be divorced from reality. Information that’s rooted in a deep understanding of the world is infinitely more powerful than an idea we read in a blog and thought sounded cool.\n\nOnce you learn to use your own eyes, you can share that with the world. By doing so, you’ll become a beacon people swarm to. You’ll hold knowledge that people are thrirsting for. At the end of the day, the vast majority of people will keep looking at others for guidance, but perhaps YOU can become their guide now.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ponvs1/thinking_for_yourself_the_key_to_becoming_an/", "title": "Thinking for Yourself — the key to becoming an Authority", "social_network": "reddit", "user": "better__ideas", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1631703747, "permalink": "/r/DecidingToBeBetter/comments/ponvs1/thinking_for_yourself_the_key_to_becoming_an/", "nsfw": false, "first_save": 1635435372.2037857, "replies_charged": false}