{"id": "t5_2tand_t3_i8ugel", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "My (23 f) dad has been an alcoholic my whole life (his dad was also a lifelong alcoholic). It’s something I’ve come to terms with the last few years with the help of al anon and the adult children of alcoholics reddit group of which I’m very grateful for. \n\nGrowing up I always put the needs of my parents (especially my dad) before my own, and couldn’t feel content unless I knew they were ok. This has followed me into my early adult years and I continue to struggle with bad news that I know I cannot control. \n\nToday my mom told me that my dad has a doctors appointment next week to see why and where he is losing blood. They assume it’s most likely going to be due to cirrhosis of the liver, which is common in people who are alcoholics, and is the same disease his dad passed away from a few years ago. \n\nI became very emotional after I got off the phone with my mom because I realize that my dad will not be interested in trying to stop drinking (like he has in the past) and am scared it will be fatal sooner rather than later. \n\nWith this being said, when I start to spiral about things out of my control, the first thing to go is my hygiene. I am not interested in taking care of myself when I am going through something difficult. I don’t want to brush my teeth, shower, or interact with my roommates. I want to just isolate myself in my room and just sulk knowing there isn’t anything I can physically do to make things better for someone who doesn’t want to change themselves. \n\nBut today, even though I did sulk and was isolating myself in my room, I eventually got up and brushed my teeth and flossed before getting ready for bed. Usually I would just skip this step completely and most likely would then skip that same step in the morning, and just not take care of myself for at least the rest of the next day. \n\nBut even though I was feeling really low, I took all the energy I had left and just did it. It wasn’t super east like most days but I felt better after feeling clean and knowing I still cared about myself enough to take care of myself. It makes me more optimistic for how my day will be tomorrow. Just wanted to vent and feel proud of myself for steering things in a different direction than what would normally happen. \n\nThanks for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i8ugel/keeping_up_with_hygiene_even_in_the_event_of_bad/", "title": "Keeping up with hygiene even in the event of bad news.", "social_network": "reddit", "user": "bstillstanding", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 133, "down_vote": 0, "creation": 1597298126, "permalink": "/r/DecidingToBeBetter/comments/i8ugel/keeping_up_with_hygiene_even_in_the_event_of_bad/", "nsfw": false, "first_save": 1635437598.5789337, "replies_charged": false}