{"id": "t5_2tand_t3_lt3qvx", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Hello,\n\nMy partner and I have been going through a rough year. His struggles with mental health were pretty intense before the pandemic, but in the first couple months of the pandemic they took a big downwards swing.\n\nIt’s been challenging for me to be supportive of him through this. How can you remain supportive about a problem that seems so unrelenting?\n\nYesterday, he told me that he felt like I was withholding my thoughts, feelings, and experiences from him.\nI think that’s true. \nWhen he’s upset, he gets into this frantic state where the only thing he can think about is how upset he is, but past experiences have shown him that trying to talk about those feelings, will never move the needle about them. Thus, at this point he refuses to talk about them with me, and I don’t know what he talks about with his therapist.\n\nI’m still working on why I hesitate to disclose things to him. I’m not sure if it’s because I don’t want to be a burden to him when he’s upset, I don’t want him to feel like a burden, or that I’m afraid that he’s going to be unreceptive. Maybe some of all them.\n\nWhen I think he’s upset, I worry about making things worse. Which paralyzes me. Of course I want to make him feel better. But past experiences have demonstrated that he’ll often feel worse after talking to me, or to a professional.\n\nHe’s told me that he doesn’t want to be in a relationship with a filtered version of myself. And I agree, I want to be real with him. I think by sharing how I feel, I’ll also be able to better be there for him during his times of need.\n\nI’m making this post as a pledge to myself to be open, honest, and brave about sharing my feelings.\nOf course, I need to be mindful about when I’m sharing those feelings.\n\nIf anyone has advice about being more open during challenging times, I’d appreciate that. Additionally, if anyone has advice about consoling, cheering up, or otherwise helping someone who is extremely distraught, I’d appreciate that as well.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lt3qvx/sharing_feelings_being_vulnerable_to_partner_in/", "title": "Sharing feelings, being vulnerable to partner in need", "social_network": "reddit", "user": "PepperMinkCoat", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1614362678, "permalink": "/r/DecidingToBeBetter/comments/lt3qvx/sharing_feelings_being_vulnerable_to_partner_in/", "nsfw": false, "first_save": 1635435910.116187, "replies_charged": false}