{"id": "t5_2tand_t3_f8z7bb", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "IMAGINE THIS...\nImagine standing in front of 40 people for 9 hrs a day, for 12 days, with each person who has heavily invested themselves to spend their time, money and energy with you, is trusting they will get a HUGE return on their investment.\n\n\nImagine that it’s your responsibility to educate, entertain, empathize, lead and inspire each person to feel safe enough to let go of parts of themselves...\n\n...To let go of that part of them that once protected them, but that now creates a barrier between where they are now and what they truly want in life.\n\nTHIS IDEA SCARED ME...\nThis is an idea, speaking in front of people, that would have scared the $hit out of me in the past, because I used to have a fear of public speaking and I could think of nothing worse than to have the responsibility to speak in front of 4 people for 40 minutes, let alone 40 people for 12 days.\n\nI feared what I didn’t understand, and I was imprisoned by my own limiting beliefs; “I HAVE this fear”.\n\nMY REALIZATION...\nI realized that I didn’t own it. How could I own something that doesn’t exist? It was just a construct of language; dysfunctional self-hypnosis that I’d convinced myself to beleive as ‘fact’ because I had many past experiences to justify this.\n\nOUR BELIEFS...\nWe all believe that our beliefs are factual and right, otherwise we wouldn’t believe them, but some of us ar so emotionally linked to our beliefs that we refuse to consider anything new or different.\n\nBy learning to want a better future more than to want to be right about my beliefs, I became open to new possibilities.\n\nCONTROL & LETTING GO...\nI learned that I could develop the skill of being IN CONTROL of my emotions instead of being controlled by them.\n\nI decided to let go of ‘owning’ my fear of public speaking, and like a unwanted black balloon, it drifted off into the distance.\n\nNow that I had released the fear and dysfunctional story, I had a fertile opportunity to learn a better ‘recipe’ for speaking publicly with confidence and effectiveness.\n\nPLANTING BETTER SEEDS...\nThat’s when I went on a journey attending many public speaking courses (many weren’t very good and a small few were great) & being mentored to understand the ‘hidden secrets’ that courses didn’t teach.\n\nNow...\nI live for these moments. The idea of speaking in front of 40 people for 9 hours a day for 12 days is my idea of one of the most fun, exciting and inspired things to do.\n\nMY REWARDS...\nTo watch the transformations that each of these people make in their own lives is a powerful and memorable experience that stays with you.\n\nTo know that these people walk away more resourceful, more aware, more responsible and more enlightened is a privilege to be a part of.\n\nTo hear about how these people take these tools, concepts and new ways of being and teach it to their kids and grandchildren, empowering the upcoming, future leaders fills me with gratitude and optimism for a better future. \n\nIN 3 DAYS TIME...\nIn 3 days time we start the 18th ASM Mindset Reprogramming Experience showing people the ‘user-manual’ for their mind, and how to help others become resourceful and more successful.\n\nI’m eternally grateful to the younger version of me for choosing to challenge that 30-year limiting belief and create something better.\n\nMY WISH FOR YOU...\nI hope you too realise that you can do anything you want when you...\n- get resourceful, \n- find yourself inner power\n- let go of the dysfunctional self-hypnosis and stories you tell yourself and \n- find a better ‘recipe’ to follow that predictably gets the results you seek.\n\nTHE PRINCIPLE...\nYour thoughts and feelings are powerful tools that when trained in the right way, will lead you to a more fulfilling, more abundant and more loving life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/f8z7bb/learn_to_master_your_thoughts_and_feelings_its/", "title": "Learn to master your thoughts and feelings- it’s the superskill of life.", "social_network": "reddit", "user": "fozrok", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1582582209, "permalink": "/r/DecidingToBeBetter/comments/f8z7bb/learn_to_master_your_thoughts_and_feelings_its/", "nsfw": false, "first_save": 1635437861.1994665, "replies_charged": false}