{"id": "t5_2tand_t3_q220wy", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "So I’ve been waiting for a hospital bed for a week because I feel suicidal. I’m trying to be proactive and take control of my life. I went on a 1.5hr journey to view 2 properties (been homeless for over a year) and when I got back I decided to stop off at the supermarket omw back to the refuge I’m living in to get some food to take to hospital with me, after initially feeling taking anything made me look fake and like I enjoy things and want to be alive and so wouldn’t get help. Anyway I’m omw there and I see an injured bird on the road, the busiest road in the city where all the shops are. feathers scattered across the road, it’s sat there unable to walk. me and another guy stopped and looked at each other. I stopped traffic so it didn’t get run over and scooped it up in my hands and moved it to the pavement. After 30 minutes of calling around google searched animal places I eventually got told by vets for pets by pets at home if I took it there they’d see to it. I don’t drive and it’s about a 30 min walk and I don’t want this pigeon  to die. So I ask if a taxi would mind me taking it it’s not moving. They say no. I don’t drive. I wrap it up in a little soft bag and smuggle it in a taxi to the vets. They had to put it down but at least it’s no longer suffering. It was bleeding/injured underneath and had a broken wing. I am trying not to sound crazy but I was so upset. No one including animals deserves to suffer so deeply. I’ve been sober for 49 days, but I’m letting myself have 2 pints. It’ll probably push me over the edge but I’ve had enough.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q220wy/good_and_bad_day/", "title": "Good and bad day", "social_network": "reddit", "user": "lonerlass", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1633457152, "permalink": "/r/DecidingToBeBetter/comments/q220wy/good_and_bad_day/", "nsfw": false, "first_save": 1635436951.864772, "replies_charged": false}