{"id": "t5_2tand_t3_96sj1z", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Reddit is a website for sharing ideas. By knowing you have content that is of value to others, you are motivated to post it to a related Reddit community. When community members read your post, they have an option to upvote or downvote it. Upon receiving your first upvote, you are filled with joy! You conjured a thought from the depths of your mind(or ripped it off another subreddit) and someone actually agrees with it! As more people upvote your post, you feel motivated to make another. After your next post becomes as well received, you are filled with joy again. From, here you make another post. And, the cycle continues! You eventually post so much that it is natural to you. It takes little thought to begin posting again. **This is the development of a habit in action**!\n\nAccording to Charles Duhigg, author of *The Power of Thought*, habits are adaptive processes that are programmed into the mind through consistent repetition of action. Their primary function is to optimize the amount of energy the brain requires to operate. By recognizing patterns in your behavior, the brain adapts to perform these actions without thought. There are 3 components to a habit: the **cue**, the **routine**, and the **reward**^(1). In the instance of posting to Reddit, the cues are having content worth sharing. The routines are writing (or ripping) a post. And, the rewards are upvotes(acceptance from the community). The 3 components of a habit flow together into a *habit-loop*, as illustrated below.\n\n [https://prnt.sc/khp2su](https://prnt.sc/khp2su) \n\nIt is no mistake that Reddit has an upvote mechanic. Reddit’s karma and trophy system is a form of gamification in social media. Scientific studies have found that gamification does have a **significant** effect on the user. For instance, in a field experiment conducted by professor of gamification, Dr. Juho Hamari, on the effects of gamification, Hamari found there to be 8 reasons for why elements of gamification increases the likelihood of a user to be on a website longer and more often^(2).\n\nThese 8 reasons are:\n\n1. They anchor your performance expectations higher\n2. Having goals increases your self efficacy\n3. Completing goals leads to satisfaction\n4. They create goal commitment\n5. They act as guidance mechanics and provide feedback\n6. They facilitate *psychological flow* through feedback\n   1. Psychological flow is “a state of mind characterized by engagement with an activity that is in the sweet spot between effort and ability”\n7. They trigger social proof\n8. They trigger motivating social comparisons\n\nOf these 8 reasons, 3 of them are most active in Reddit’s system.\n\nThese are:\n\n1. They act as guidance mechanics and provide feedback\n   1. Guide users to post the most popular content as possible which drives more users to the site.\n2. They trigger social proof\n   1. Many users go to communities for answers to their problems. If a popular answer works for others, they will believe it will most likely work for them as well.\n3. They trigger motivating social comparisons\n   1. The karma and trophy system creates a sense of prestige, as long time community members are respected by newer members for being an authority on the subject.\n\nThe term *gamification* comes from, *you guessed it*, video games! According to *Webster Dictionary*, *gamification* is the process of adding games or gamelike elements to something (such as a task) so as to encourage participation.\n\nDo you see what is happening here? No? Well, I do!\n\n**Video games are so effective in addicting their users that other industries are adopting their mind-subverting tactics!**\n\nVideo games are an industry. The most popular titles are no longer made by nerds in their garages. These days, video games are engineered to be as addicting as possible. Corporations understand the minds of the consumers through market research.They pour millions of dollars into getting inside of the minds of men like you and I. They want to know our biggest fears and motivations so they can design content to simulate solutions to these emotions and keep us playing for hours on end. **This is where elements of gamification work in conjunction with the psychology of habits to create a recipe for mass addiction**.\n\nBut, why are men the ones mostly targeted by manipulative corporate marketing? I believe this is because video games are a means of instant-gratification for achievements men would otherwise have to struggle through in order to achieve. Think about it: would you rather explore a new world full of “limitless” opportunities to master many different “skills” or devote years of your life to mastering one specific skill? For the most part, men are the skilled workers that build our world. They fight wars. Build buildings. Lead countries. And, conquer the unknown. But, in the real world, achievement is earned through countless hours of hard work and dedication. While, video games are designed to simulate achievement without requiring too much time or effort to get(psychological flow)2. The easier option video games offers is much more enticing to the minds of many men.\n\nI believe this is best exemplified by the Xbox 360’s, at the time, groundbreaking implementation of in-game achievements. The Xbox 360 spawned a new generation of gamers: *the Achievement Hunters*^(4). These are players whose motivation to play is earning in-game achievements. Upon earning an in-game achievement, the player earns *Gamerscore* which is summed together and displayed on their *Gamercard*. This simulates qualities of MMO RPGs such as World of Warcraft, which is best known for addicting players so much that they stopped taking care of themselves and died! The gamerscore can be compared to experience points, games become questlines, and the gamertag is the character name. It is the Xbox Live Mass Multiplayer Online Game, *XLMMO*4.\n\nAlthough all 8 of Dr Hamari’s reasons apply here, the most significant is number 3: “*completing goals leads to satisfaction*”. This is where the habit-loop comes into play. Upon earning an achievement, the player gets positive reinforcement for unlocking it while playing the game. This motivates them to unlock more achievements(continuing to play the game more). Since many gamers use video games as a compensation mechanism for a lack of success and rewarding relationships in the real world^(3), it is clear that they derive meaning from in-game achievements. With understanding this, the habit-loop becomes very clear.\n\n*The Video Game Habit-Loop:*\n\n**Cue:** Desire for achievement\n\n**Routine:** Playing video games\n\n**Reward:** In-game achievement\n\n [https://prnt.sc/khp3df](https://prnt.sc/khp3df) \n\nIt is important to note that not every gamer plays for in-game achievements. In fact, there are many that could not care less for them. So, how do these people fit into the habit-loop, with having a desire for achievement? These types of players are likely to be the lonely type. They use the social features in video games to attain social success they would otherwise never have due to social phobia or physical immobility^(3).\n\nThe habit-loop is the source of addiction. From consistent success in experiencing the cue, performing the routine, and earning the reward, the mind begins to anticipate the reward at first sight of the cue^(1). This is known as a craving. In the instance of video games, by knowing that you can experience a sensation of achievement, your mind will subconsciously simulate the feeling of reward. That is: **getting the reward without the routine**. This is the emotional motivator that compels the addict to play more and more.\n\nWhether it is earning all the achievements in Halo 27, surviving to round 999,999 with your friends in the 132nd Call of Duty Zombies map, or trolling the little kids on Minecraft, you set out to do something in the hopes of achieving success. Video games were the medium in which you obtained this *achievement*.\n\nSo, now that you understand how video games were able to creep their way into your mind, you are likely wondering: *how do I stop playing them*? Unfortunately, you cannot simply stop playing them^(5). You need something to replace them.\\*\\*Think about it like this: if you are playing video games for 8 hours a day, you will need to find something to fill that time. This is where an understanding of habit comes into play. At this point, video games have become a habit.\n\n**In order to break the habit, you need to replace the bad routine with a good one while retaining a similar reward**^(1). This can be done with discipline. Each day, you wake up with a limited amount of willpower units. Willpower is your ability to defy your cognitive inclinations(habits). Since willpower is limited, you must use it wisely. You must focus your efforts to changing one habit a time.\n\nThis is where you begin your escape from the manipulative grips of video games. You must attack the bad habit at its core by disciplining yourself. It will not be easy at first. But, the longer you persevere, the easier it will get. From my experience with video game addiction, I have found that breaking the video game habit boils down to 4 actions.\n\n1. Identifying the cue, routine, and reward in your video game habit-loop.\n2. Defining a purpose.\n3. Finding a purpose-oriented routine that gives the same reward.\n4. Consistently using the alternative routine to make it a habit.\n\nBelow, I have detailed my experience and how each of these 4 actions played a crucial role in breaking my addiction.\n\n# 1. Identifying the Habit-Loop\n\n**Motivation: Before you can change your behavior, you must understand what motivates it.**\n\nFor the past few years, I was addicted to Left 4 Dead 2. I would play the competitive mode for up to 8 to 10 hours a day! My biggest motivation to play derived from achievement. **Each match I played was an opportunity to get a dopamine kick from achieving some sort of victory**.\n\nI took this game seriously, with close examination of my win/loss ratio. It was very important to me that I won every game I played. This often resulted in “fixing” games. There were many ways I would do this. Most commonly, I would join a public lobby with 3 of my friends. We would “stack” our team, meaning we 4 knew each other while the other team was a mix of random players. We were guaranteed a win every single time.\n\nThis allowed me to create a false perception of skill. Here is an example of my thought process:\n\n“*I have won every single game today. I must be one of the best players!*”.\n\nEssentially, I blinded myself from reality so I could be absorbed with the idea that I was a winner - though I was far from it. With a strike of courage, I saw through my delusion and faced my situation with honesty.\n\nFrom months of introspection, I realized that I led a meaningless life. The problem lie in my approach to life as a whole. I was a hedonist who sought all forms of instant gratification. Masturbation instead of sex. Sweets and sedentation instead of nutrition and exercise. And, video games instead of responsibility.\n\nI had no drive to do anything with my life. This was the result of being too comfortable. **If you are too comfortable in your current position, you will become complacent and remain where you are**. I was so comfortable because my parents did everything for me. Since I had few responsibilities, I had nothing better to do except play video games all day.\n\nThis is how I thought my way out of motivation:\n\n“*I could be achieving a six figure income, running a successful business, but why would I do that? That requires time and effort and I don't even know if I will succeed. Why risk my time and comfort when I can ignore it and enjoy the comfort I have now.*”\n\nBy understanding this thought process, I was able to understand that my lack of real world achievement led me to hide in the simulation of achievement that video games offered me. This was merely a bad habit I had to push myself to break.\n\nThis is what my habit-loop looked like:\n\n**Cue:** Unoccupied / uninterested mind\n\n**Routine:** Playing Left 4 Dead 2\n\n**Reward:** In-game victory\n\n [https://prnt.sc/khp47z](https://prnt.sc/khp47z) \n\nWhat I needed was a drive to rise above my situation. This is something I will touch on in the next point.\n\n# 2. Defining a Purpose\n\n**Motivation: You must have a burning desire to fulfill a purpose. You must know what you are aiming for. This is because you will not be willing to endure an extreme amount of discomfort without a reason to justify.**\n\nTo my dismay, once I understood the root of my problem, nothing changed! I went on for months, hating myself each time I fell back into my video game habit. When I was not home, they never crossed my mind. But, at night, when I was in my room, all by myself, the craving got to me and I loaded Left 4 Dead 2 up instead of studying.\n\n**At this point, I had no drive to fight the urges. That was soon to change.**\n\nIt is important to note that I do not come from a stable family. My parents are divorced and I live with my mom and my younger brother. We do not have the nicest things in the world, but we are happy with what we have. In the past year, my brother’s mental health has taken a turn for the worse. He stopped going to school and taking care of himself. Even worse, he began consistent drug abuse. This behavior has driven a wedge between himself and the rest of the family. It has made living as a whole much more difficult.\n\nDuring the course of his devolution, I was blind. My relationship with my brother gradually died because I was too occupied with video games to be interested in his life. Sure, I would interact with him and his friends, but there was no relationship. I would just sit there and watch them play video games. My brother and I previously had a relationship because of video games. We played Minecraft together exclusively. Having a similar hobby, we shared many stories that brought us together. Though these memories are almost 6 years old, we still relate with them to this day.\n\nAt first, when I became conscious of my brother’s new lifestyle, I tolerated it. I allowed him to go down the drug-fueled path of destruction. Hell, I actually participated in it with him. But, there was a line I was not willing to pass: illegal prescription drug use. He passed it, leaving me to retract from the lifestyle all together. Having witnessed how far he devolved, I became disturbed. The brother I grew up with, the brother I loved with all my heart was in a world of pain and there was nothing I could do about it, well so I thought.\n\nMy brother’s situation was a blessing in disguise. The disturbed thoughts drove me to swear to myself that I would be the best not only for him, but my broken family as a whole. My purpose was to provide for my family. **At the snap of a finger, I stopped playing video games**. I viewed them as an obstacle to the future I had visioned. My heart was ignited with a roaring fire to endure any and all suffering in order to protect my family. I knew I had to be strong to protect them. This meant going to school to have a high paying job in order to be financially secure(financially strong), going to the gym to build my body(physically strong), and persevering through it all(mentally strong). I had to grow from being a boy to being a man.\n\n**I became obsessed with making my transition from boyhood to manhood, because I knew my family needed a man to step up and bear the pain for the betterment of all**.\n\nI got a job and began financially contributing to the family. I took time out of my day to interact with them, talking to them as we cooked and cleaned together. I began learning everyday life skills from them, such as how to cook pork chops and and how to maintain a household. By adding these skills to my tool-kit, I was able to ease my family’s burdens by being able to perform them myself, allowing them to rest.\n\nWhile the well-being of my family was my primary motivator, I was doing this for myself. I understood that having life skills allowed me to offer others value. I believe a man is only as loved as he is valuable. Men are the ones who endure pain for the good of all.\n\nThis experience reminds me of a quote from my favorite TV show, *Breaking Bad*. Walter White’s greatest enemy, Gus Fring, relates with him in regards to being a man and providing for a family. In a conversation between the two men, Gus says, “A man provides for his family. And, he does it even when he is not appreciated. Or respected. Or even **loved**. He simply bears up and does it, because he’s a man.”.\n\n**I chose to be a man because of the pain, not despite of it.**\n\n# 3. Finding a Purpose-Oriented Routine\n\n**Motivation: In order to beat the bad habit, you must replace the bad routine with a good one**^(1)**. By knowing what you are aiming for, you can find a proper replacement routine that satisfies both the habit and your purpose.**\n\nFor me, finding a purpose to change myself was **very** difficult. It was supposed to be! Going from a hedonistic, instant-gratification-seeking child to a responsibility-seeking man was no simple feat. It required me to deconstruct the life I knew and to rebuild it from nothing, all on my own!\n\nI started small by making my bed everyday. Then, I started walking my dog everyday. Next, chiseling my bedtime down from 1:30 AM to 8:30 PM, so I could wake up at 4:30 AM to work on myself. From there, I started going to the gym as soon as I woke up, 3 times a week.\n\n**I am continuously getting better.** This mindset was the key to my video game addiction. By pushing myself to be better everyday, I accomplish something everyday. I have found a new source of achievement in my life. One far more fulfilling and fruitful than the simulated sensation video games gave me.\n\nWhile I achieve something in each area of my life, here is the new habit-loop, with a replacement routine in the instance of achieving the body of my dreams.\n\n**Cue:** Unoccupied mind\n\n**Routine:** Going to the gym\n\n**Reward:** Muscle growth and physical aesthetic\n\n [https://prnt.sc/khp4ru](https://prnt.sc/khp4ru) \n\nThis loop works because I understand that I have nothing better to do with my time other than make productive use of it.\n\n# 4. Consistently Maintaining New Routine\n\n**Motivation: Breaking the old habit requires you to build the new habit. You must consistently perform the new routine to program it into your subconscious mind.**\n\nI believe consistency can be easy if you have the right mindset. Although I was removing video games from my life, my approach to solving my addiction was inspired by them. I chose my goals and inadvertently adopted many of gamification elements that Dr. Hamari’s research showed to improve participation.\n\nThese were:\n\n1. Having goals increases your self efficacy\n   1. By seeing others achieve their own successes, I wrote down my goals knowing if they could be successful, so could I.\n2. They create goal commitment\n   1. I wrote down my goals and put them on my desk, so I see them everyday\n   2. I committed to a measurable goal.\n3. They act as guidance mechanics and provide feedback\n   1. If I do not meet my goal deadline, I access my situation and see what is holding me back.\n4. They trigger social proof\n   1. I surround myself with people who are as motivated as myself. Because my environment only displayed a motivated lifestyle, all I could possibly think and do was to better myself.\n\nInstead of building a video game character, I was building myself. I started to view each task in life as a skill that I could master. For instance, in building my body, I viewed my current body as having developed a quantified level of strength and aesthetic. Something that could be improved with *grinding*. Each time I leveled up(lifted heavier weights), the difficulty increased. I would have to eat more and train harder to see the same progression. I viewed the “level” of my body as a position on a spectrum of mastery. Mastery being my end goal of weighing 200 lbs in muscle mass.\n\n [https://prnt.sc/khp5ai](https://prnt.sc/khp5ai) \n\n**What I had was an achievement mindset. Even when I failed, I looked for a positive outlook on the situation. This is a habit of thought. The more you look for the positive side of a situation, the more inclined your mind will be to find it without conscious thought.**\n\nIn the instance of going to the gym, It took about a month of going consistently before it was rooted into my mind. At that point, waking up at 4:30 AM and driving to the gym was no longer a struggle. It was something I *just* did. It had become a habit!\n\n# Conclusion\n\nYou can break free of your addiction! I know you can because I myself have! The approach I outlined in this post is based upon the idea of “**work smart, not hard**”. While you can arbitrarily discipline yourself, you will be fighting an uphill battle. By first defining a burning desire to fulfill a purpose, you will overcome your addiction with greater ease. I am not saying it will be easy, but I believe you will have greater success with this approach.\n\nWith that being said, your biggest struggle will be finding a purpose to change. This varies from person to person, so there is no one generic solution. However, there is an approach that you all can use: **writing**. You do not necessarily have to have a journal. But, rather, you want to write something similar to what I wrote in 4-actions segment of this post.\n\nHere is an outline to get started:\n\n1. Write down your goals\n   1. Put them where you can see them everyday.\n2. Write down all the qualities that you believe are preventing you from attaining these goals\n   1. Video game addiction, masturbation addiction, poor school grades, etc.\n3. Think about why you possess these qualities\n   1. You may find that many of your qualities exist because of one problem.\n   2. Or, one may be causing another\n      1. Masturbation zaps your energy, making you more likely to be sedentary and play video games / not study.\n4. Outline a specific situation where a specific quality disadvantaged you\n   1. As you write, keep these questions in mind:\n      1. Who did this situation involve?\n      2. When did it happen?\n      3. Why did possessing this quality disadvantage me?\n      4. What can I learn from this experience so I can perform better next time?\n      5. How can I experience a similar situation to test my growth?\n5. Write, with complete sentences, with emphasis on analysis of the quality and the situation\n   1. Write it like a story\n\nBy doing this, you will become more aware of yourself. You will see patterns in your behavior and discover why you are who you are.\n\nIf you want to go the extra mile, write an autobiography. Start with a specific situation in your life and expand out from there(the outline above is a good start). Define chapters of your life, where you highlight themes in your behavior and emotions in that time.\n\nIn order to know where you are going, you must know where you have been. **You must first understand what makes you who you are so you can find a specific solution to each of your problems.**.\n\nI know you can do it my friend. :)\n\nBest,\n\n*Gandamede*\n\n\\###############################################\n\n# TL;DR\n\nVideo games are designed to be addictive. By subverting your mind and making them habit, they subconsciously manipulate your mind to continue to play. It is by attacking the habit at its roots that you will break free of your addiction. In order to do this, you must understand how habits work.\n\nHabits are adaptive processes that are programmed into the mind through consistent repetition of action. Their primary function is to optimize the amount of energy the brain requires to operate. By recognizing patterns in your behavior, the brain adapts to perform these actions without thought. There are 3 components to a habit: the **cue**, the **routine**, and the **reward**1.\n\nHow to overcome your video game addiction:\n\n1. Identify the cue, routine, and reward\n   1. **Before you can change your behavior, you must understand what motivates it.**\n2. Have a well-defined purpose\n   1. **You must have a burning desire to fulfill a purpose. You must know what you are aiming for. This is because you will not be willing to endure an extreme amount of discomfort without a reason to justify.**\n3. Find a purpose-oriented routine that gives the same reward.\n   1. **In order to beat the bad habit, you must replace the bad routine with a good one. By knowing what you are aiming for, you can find a proper replacement routine that satisfies both the habit and your purpose.**\n4. Consistently use the alternative routine for an extended period of time to make it a habit.\n   1. **Breaking the old habit requires you to build the new habit. You must consistently perform the new routine to program it into your subconscious mind.**\n\nReflective Writing Outline:\n\n1. Write down your goals\n   1. Put them where you can see them everyday.\n2. Write down all the qualities that you believe are preventing you from attaining these goals\n   1. Video game addiction, masturbation addiction, poor school grades, etc.\n3. Think about why you possess these qualities\n   1. You may find that many of your qualities exist because of one problem.\n   2. Or, one may be causing another\n      1. Masturbation zaps your energy, making you more likely to be sedentary and play video games / not study.\n4. Outline a specific situation where a specific quality disadvantaged you\n   1. As you write, keep these questions in mind:\n      1. Who did this situation involve?\n      2. When did it happen?\n      3. Why did possessing this quality disadvantage me?\n      4. What can I learn from this experience so I can perform better next time?\n      5. How can I experience a similar situation to test my growth?\n5. Write, with complete sentences, with emphasis on analysis of the quality and the situation\n   1. Write it like a story\n\n\\###############################################\n\n# References:\n\n1. Duhigg, Charles. *THE POWER OF HABIT*. Random House, 2014.\n2. “Why Do Achievements, Trophies, and Badges Work?” *The Psychology of Video Games*, 7 July 2016, [www.psychologyofgames.com/2016/07/why-do-achievements-trophies-and-badges-work/](http://www.psychologyofgames.com/2016/07/why-do-achievements-trophies-and-badges-work/).\n3. Bernstein, Rebecca. “Video Game Psychology: Addiction vs. Achievement.” *Concordia University Texas*, 7 June 2017, online.concordia.edu/computer-science/video-game-psychology-addiction-vs-achievement/.\n4. “Game Studies.” *Game Studies - The Foundation of Geemu: A Brief History of Early Japanese Video Games*, [gamestudies.org/1101/articles/jakobsson](https://gamestudies.org/1101/articles/jakobsson).\n5. “How to Overcome Video Game Addiction.” *LevelSkip*, LevelSkip, levelskip.com/misc/How-to-Overcome-Video-Game-Addiction.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/96sj1z/how_to_beat_your_video_game_addiction_a_habitual/", "title": "How To Beat Your Video Game Addiction: A Habitual Approach From A Former Addict", "social_network": "reddit", "user": "gandamede", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1534109361, "permalink": "/r/DecidingToBeBetter/comments/96sj1z/how_to_beat_your_video_game_addiction_a_habitual/", "nsfw": false, "first_save": 1635436098.7476916, "replies_charged": false}