{"id": "t5_2tand_t3_gv86yf", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Hi all,\n\n**TLDR:**\n\nI am looking to assemble a group of 5 individuals who are looking to launch or transition into a career in a programming-related discipline. Examples of these disciplines:\n\n\\- Data Science\n\n\\- Analytics\n\n\\- Software Engineering\n\nThe group will communicate through Discord and meet on a weekly basis, where I will be teaching Python. While the main focus of the group will be developing technology skills & knowledge, we will also discuss other relevant career-building topics such as:\n\n\\- Resume writing\n\n\\- How to interview\n\n\\- What makes a successful employee\n\n\\- How to own your career\n\n\\- Fun books to read!\n\nLeave a comment or message me your bio (bio template at the bottom of the post) if interested!\n\n**FAQ:**\n\n* Does this cost any money?\n   * No, this does not! I am offering this for free.\n* If you're not charging money, why are you doing this?\n   * I run a one-man freelance analytics & writing business. Part of the services I provide for my clients includes teaching Python to business team members who have **zero** background in programming. Teaching others outside of client arrangements allows me to refine the course material and understand what truly helps people learn.\n   * One of my future goals is to start an organization that develops talent and makes connections between developed talent and businesses that struggle to acquire talent. The average technology professional moves jobs once every 6 months in the area I live in. This means that organizations are always looking for new talent, but often struggle to find talent as the top tier organizations are able to recruit most talent away. \n      * I truly believe that talent development is the way to create more social mobility from poorer/less privileged locations. Currently, organizations hire based on markers that are largely reliant on having a lot of money (college education, personal network, etc.). I believe that a talent agency that is based on *developing talent* *that doesn't have traditional markers of \"success\" can find success in the market*.  \n      * Teaching tech and career skills for free allow me to work on test this business idea and find its weaknesses.  While I can't promise it right away, my end goal is to link those I teach to real jobs using my personal and professional network.\n* Why only 5 people? Why not open this up to more?\n   * I believe in starting small, nailing down an operating model, and then scaling up. Additionally, I think online groups with lots of people often fail because most people aren't comfortable sharing in a forum of 10+. \n\n**Who should join?**\n\nThose who would like to participate should meet several requirements. I do not state these requirements to leave people out (though they naturally will), but rather to make the group as successful as possible. I want those who join to gain real value out of this! My goal is to scale this to all interested peoples, but starting small and taking things one step at a time is essential.\n\n&#x200B;\n\n1. Location - You are located in either the eastern or mid-west USA. My experience hails from US corporations and I am far less familiar with corporations outside the country. Additionally, keeping the group make-up of those within a certain geographic area will allow us to operate in similar time-zones (no 12+ hour time differences).\n2. Programming Experience - You have **little or no** experience programming. If you already have experience writing code the course material will be too basic for you! I don't want to waste your time.\n3. Socioeconomic Status - You come from/are in a **lower socioeconomic status and might not be college-educated.** While I won't put a specific number to this metric, the end goal of my organization is to spur mobility and education in lower-income areas. Those who have a lot of money can afford more expensive teaching (such as college education) than what I'm offering!    \n4. Mindset - You're ready to make a change in your life and learn something new. You're ready to commit to a minimum of one 1.5-2 hour meeting per week. I may be teaching, but we're all learning together.\n\n**My credentials**\n\nSo what do I know about technology? I have worked in corporate analytics for 3.5 years and have a Certificate in Data Science from Georgetown University. I am also a graduate of Penn State University with a degree in Health Policy and a minor in Economics. I have managed a team of entry-level analysts in the past and understand what organizations are looking for in terms of hiring/promoting employees. \n\nI currently work as a freelance analytics professional where I provide analytic capabilities and education to my clients. I am also a freelance writer!\n\nThe 5 individuals who join this program will also be sent my resume & LinkedIn profile as further proof!\n\n**How do I let you know I want to join?** \n\nIf you would like to join the first session please send me a DM with the following information.\n\n1. Name\n2. Location\n3. Age\n4. Email\n5. Professional Experience - Where do you work right now (if anywhere)? Where have you worked in the past?\n6. Why do you want to get into technology?\n\nIf you are not in the first session I will still record your email/Reddit username and reach back out the *moment* I am creating further sessions. \n\nI apologize in advance for those who are not in the first session. It is sincerely not my desire to exclude anyone, but I am only one person and prematurely large groups will serve no-one. I will scale this ASAP and come back to this community again.\n\nIf you have any questions or comments please leave them below! \n\nBest,\n\nArjun Arun", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gv86yf/looking_to_learn_how_to_code_lets_make_a/", "title": "Looking to learn how to code? Let's make a mini-community around it, join me!", "social_network": "reddit", "user": "arjunmjarun", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1591107676, "permalink": "/r/DecidingToBeBetter/comments/gv86yf/looking_to_learn_how_to_code_lets_make_a/", "nsfw": false, "first_save": 1635437855.9910872, "replies_charged": false}