{"id": "t5_2tand_t3_9por8b", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290"], "text": "I'm 23 years old, a senior in college and now no longer a part time employee at a Fortune 500 company. I worked there for 16 months, and honestly, I hated it. \n\nEvery day I counted the minutes on my computer screen. A lot of the time I left early, or wouldn't work, or did school work. On top of that I didn't care about the job and hated being there, and they could tell. Even if I thought I was playing it off well, they could tell. This led to a short meeting with my boss and supervisor, where I was told today would be my last day. \n\nAt first I freaked out, and granted, I'm still kinda freaking out. Honestly though, as I worked out my game plan in the coming months, I felt this weird sort of duality. I was embarrassed, ashamed, upset... But also excited and hopeful. There are so many things I have let slip... And so much of that went back to how actively my job made me feel down and negative. \n\nThere's a lot of curve balls that will happen in our lives, but it's up to us to still swing and hit a homer. (cheesy, I know)\n\nI'm not going to let this be a negative thing in my life. I'm going to let this be a wake up call. Assess what led to my firing and make sure it never happens again. It also has lit a fire in me, this hunger that I feel I haven't felt in a long time...\n\nThat walk to my car was one of my worst, but I'm going to make it lead to one of my best. \n\nLike a board on my office said, \"It's not the problem that's the problem, it's how you're reacting to the problem that's the problem.\"\n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9por8b/i_just_got_fired_and_its_going_to_be_the_best/", "title": "I just got fired and it's going to be the best thing that ever happened to me.", "social_network": "reddit", "user": "Dr_DaddyDuck", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 255, "down_vote": 0, "creation": 1539988804, "permalink": "/r/DecidingToBeBetter/comments/9por8b/i_just_got_fired_and_its_going_to_be_the_best/", "nsfw": false, "first_save": 1635436644.9882603, "replies_charged": false}