{"id": "t5_2tand_t3_jryx9r", "request": ["78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "In Summer 2017 I was in a dark place, even though I didn't really understood this by that time. I just graduated from High School, my grades were not exceptionally good but not bad either, but I had a problem... I had no Idea what was coming next. No, actually I didn't really care about what was coming next. Ever since the beginning of my last year in High School, the thought of me graduating and having to take a nosedive into the REAL world made me uncomfortable and sometimes even scared. Whenever my family or friends asked me about my plans for the future I reacted insecure or defensive, and I always tried to change the topic asap. \n\nAs a child I was outgoing, I laughed a lot and and was popular among other kids. But when I entered my teenage years, something changed. In school I came into a new class, and some of the guys I made \"friends\" with turned out to be extremly abusive bullies. To make it short, the next couple years were hell. The teachers and classmates didn't have the courage to help me and I made the mistake to not tell my parents anything about the bullying because i was ashamed. This is not the only reason for my change in character over the next years, but it started a process in me that turned me into a introvert and shy person. Around close friends or family I felt safe enough to show my real character but for outsiders I was WEIRD. I didn't really take care of my looks, I was nervous when I had to talk in the class and don't even get me started on talking to girls. At 15 I started to smoke weed on the regular, which helped me to deal with my depressive thoughts but turned me even more into an introvert than before. On parties and in clubs I always felt out of place and couldn't have enjoyed them even if my life depended on it. Like I said, my behaviour around girls was a mess, as I was always nervous and felt under pressure while speaking to them. Ofc, my choice of fashion and style didn't help me either in this matter. \n\nSo back to Summer 2017...\nAt 18 years old, I had no idea what to do with my life, I had never even kissed a girl and my favourite thing to do was to smoke weed with my friends and playing videogames alone in my room. After school I started working on a job I hated and quitted after a couple months. Almost all my friends moved out of town after school and I was trapped in my parents home waiting for... well I didn't even know what. Then around February of the next year, I decided to move to the other end of the country to study at the university. And every once in a while nowadays I take my time to thank God (or whoever is at the receiving end of this prayer) for this decision.\n\nI moved from my village to a city far away from my hometown. In hindside, this helped me a lot to leave my old, self-sabotaging me behind. I didn't realized this at first, but the more time I spended in my new home, the more weight was falling off my shoulders. Out of sudden speaking to strangers wasn't so difficult, I didn't feel so tired the whole day anymore. Soon I found myself surrounded with new friends that shared my interests and understood me as a person. I started to take more care of my looks, and half a year after my arrival I met my first girlfriend. The relationship was kind of a mess, but to feel loved by somebody in this way was a special experience. University itself wasn't going too well first, I was enjoying my new life with friends, girls and partying a bit too much. But this wasn't the most important thing for me anyways, because for the first time in many years, I really ENJOYED LIFE. \n\nSo fast forward to 2020...\nWhile I'm tipping this text in my phone, my new girlfriend that I have for half a year now is sleeping next to me. My 16 y/o me would've never believed that a women like her (she is a super sweet person and looks ridiculously good) could ever be my girlfriend. After I finish this post I will fall asleep without having to worry about my future. I'm on my way to pursue my dreamjob in university and my family is proud of me. When I looked into the mirror a couples years ago I was often a bit ashamed, nowadays I have a warm feeling of happiness that I changed for the better. Ofc not everything is perfect in my life, but I feel like I am strong enough to deal with everything that is coming my way.\n\n\n\nTo everybody who's reading this who might find themselfes in that 18 y/o me: keep your head up, surround yourself with people that get the best out of you(!!!) and be thankful for the positives thing you got in your life. The way out of feeling so stuck in your situation is easier than you think, if I did it you can do this too.\n\nEdit: btw, something I also did to get out of my situation was to visit this sub. Not that frequently, but from time to time I looked around here. It won't solve your problems all alone, but I think that it was important for me to get inspired and take notes in other peoples stories, to build up the believe in a better future. \nAlso important: Make your bed and brush your teeth in the morning. Everything coming along the way over the day will be a bit less difficult.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jryx9r/at_18_years_old_i_was_a_depressed_introvert/", "title": "At 18 years old I was a depressed introvert, afraid of responsibility and playing around with suicidal thoughts. 3 years later I can proudly say I turned my life around and see everything I wished for myself slowly turning real.", "social_network": "reddit", "user": "Jasperburr3005", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1573, "down_vote": 0, "creation": 1605059866, "permalink": "/r/DecidingToBeBetter/comments/jryx9r/at_18_years_old_i_was_a_depressed_introvert/", "nsfw": false, "first_save": 1635437928.8089838, "replies_charged": false}