{"id": "t5_2tand_t3_lz0pxt", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "How much are you living your life right now, how much are you hiding from?\n\nHow many high quality moments did you get yesterday? Moments you can sink into and feel everything about it without guilt or shame. Moments you want to be in. Moments that mean more than “I don’t want to face something else right now so this will do.”\n\nThose are the times when I get the most out of life. But low quality moments are very different. Low quality moments are time wasting activities, they are procrastination activities, coping mechanisms. Often they aren’t productive because you’re avoiding a task or decision that you need to do - but that’s not the worst part. The worst part is how they make you feel. You feel guilty, dread, shame, lethargic, anxious. And those low quality moments often create a cycle of bad decisions. You don’t want to work on the project so you have a few drinks instead. While you’re drinking you eat unhealthy food. Then you drink too much and feel awful the next day and can’t get work done then either. Suddenly this one coping mechanism lowered the quality of the next 24 hours of your life. And sometimes a lot more.\n\nThis is not a “ra ra ra just do it #hustle #NewYearNewMe” post. This is just a suggestion that you start thinking about what quality moment will be produced by each decision you make. Is this going to make you feel shame? Will you be proud after you get it done? Try not to weigh each decision as “Do I want to do the hard thing or the easy thing?” It’s more accurate to say “Do I want to feel proud and accomplished I got that done or do I want to feel guilty I didn’t do it and continue dreading the task?”\n\nI’m not saying it’s bad to scroll through reddit or watch movies or play video games. Those can be very high quality moments if done for the right reasons. But if you’re using them as a coping mechanism then you lose twice - enjoying it less while you do it and regretting it later. If you want to win twice then you can get the work done now and celebrate later with a guilt-free relaxing activity.\n\nHow much time have you spent distracting yourself because you were hiding from work? For me it is thousands of hours. And the whole time I’m feeling gross and knowing the work will still be there when I put down my phone. So many low quality moments I can’t get back. I am starting to get a lot of grey hairs now. Years are passing faster and faster and no one knows how much they have left. I don’t want to look back on a life where I chose again and again that high quality moments weren’t worth the effort. I don’t want an epitaph that says “he did a lot of nothing because he was scared things wouldn’t go well.”\n\nYou can have a very rich life by doing things that are free with people you care about. You don’t have to wait until retirement or until you have X dollars to really enjoy your life. But you have to choose those high quality moments. Sometimes that means choosing work or doing something scary. But you’re choosing how you’ll feel after the fact too. You’re choosing how much meaning today will have. You’re choosing how much you live today vs how much you hide from life.\n\nA high quality life is not about climbing mountains or working yourself to death. It’s about making decisions that create satisfaction instead of regret. A high quality life is not about how much you get done, but did you decide to try or did you decide to hide? A high quality life is not about how lucky you are or what other people do to you, it’s about what decisions you made and if you regret them or if you know you did the best you could.\n\nAbove all, a high quality life is something you choose. It’s something you choose because you decide that coping mechanisms might be easy and familiar but they can’t give you the life you want.\n\nThe low quality decisions we made in the past are behind us. We need to make a decision about today. What’s it going to be?\n\n\\----------\n\nFurther Reading: If this post resonated with you then I think you would get a lot out of Meditations by Marcus Aurelias. He writes in a very no-nonsense way. He’s not trying to motivate anyone, he isn’t trying to sell anything (he’s been dead for 2000 years), he’s just explaining what does work and what doesn’t. He simply tells you “stop doing things that make your life worse.” What we get out of life is up to us, and reading one paragraph from Marcus each morning with my coffee does so much to help me choose more high quality moments. I hope it can help you too.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lz0pxt/you_need_a_higher_quality_life_than_coping/", "title": "You need a higher quality life than coping mechanisms can give you", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 51, "down_vote": 0, "creation": 1615034145, "permalink": "/r/DecidingToBeBetter/comments/lz0pxt/you_need_a_higher_quality_life_than_coping/", "nsfw": false, "first_save": 1635438111.8984025, "replies_charged": false}