{"id": "t5_2tand_t3_oyk4or", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "Everyone here, I am assuming given the name, has the desire to improve. Improve in what way though? Theoretically, someone could seek to improve their skill of being an asshole or scam artist. Improving itself is not enough. We want to know *what* we should improve towards. \n\n\nWe also don’t want to improve in one area of our lives just to realize it isn’t what we wanted when we finally get there (if we ever get there at all). We want to know, as much as possible, what we want throughout the course of our lives as to avoid regret and channel our efforts properly. So, we need to define what the good life would be, define what success is, what makes a good X, where we want our lives to be so we can attain those ends. This allows us to gauge if we are improving in the ‘right’ direction. \n\n\nBut *what is* the right direction? Given the way you were raised, the language you speak, your society, religion, socioeconomic status, etc., will determine to a massive extent how *you* define the good life, or what your personal goals are. \n\n\nWhen I was younger – and yet still not that young – I was struggling in my life, not making any progress, feeling suicidal, dealing with heartbreak, feeling like I’d hit rock bottom. I would look up to the sky and ask the quiet entity I believed in, ‘what is my purpose’? This isn’t the first time I asked this question; in fact, I had asked it many times throughout my life. I thought I had a destiny laid out for me. All I had to do was simply stay alive and sooner or later it would just happen. I knew I might have to work, communicate, put effort in, but I thought it was guaranteed to happen if I just stayed alive. I would elevate to the status I was seeking naturally, and when it wasn’t happening it made things worse.\n\n\nRegardless, hoping for guidance, I would ask. *What is my purpose in life? What should I be aiming towards? Is this it? Will I achieve greatness? Is greatness something I even want? What about wealth? Will I ever attain peace? What is the point of all this?*\n\n\nIt was quiet. Very quiet. But upon deeper reflection, it wasn’t completely quiet. My thoughts were very loud. Getting more stressed by these thoughts than I was already, I decided to take action – any action. Sat and thought about my talents and skills. Decided what I *didn’t want* and did the opposite. I didn’t want to feel like a failure, I didn’t want to stress for money to pay rent and buy some things I wanted. I didn’t want to feel heartbreak again. I didn’t want to fail.\n\n\nWhat do you believe in? Is there a cosmic plan for you, a kind of destiny, an objective meaning to life? Do you believe in a subjective meaning in life where you define what the meaning of life is? Or do you believe there is no meaning at all?\n\n\nImprovement is good, but without it being rooted in some deeper meaning it will always be surface level. You can’t dodge these existential reasons. They will creep up again and again throughout your life. The more we deal with them now, the more peace and more accurately we can aim ourselves and our efforts.\n\n\nWe need to investigate and answer these questions, if not objectively than for ourselves. To have lasting motivation we need to have adequate motive. To have adequate motive, we need to have a meaning in our lives. The stronger and more deeply rooted that meaning, the more we can put up with, the more effort we can exert, the less willing we will be to do things that go against our conceptions.\n\n\nBefore you answer what you want out of life, sit and think about what the meaning of it all is. At least for yourself. Ideally it would be an ethical end, positive, or good. Something that goes beyond yourself as to keep pushing you even when you yourself are losing motivation. But I can’t think of a more sure-fire way to fail than to not have a strong meaning or purpose of your life and its direction.\n\n\nYou also don’t have to do this alone. There are *many* great thinkers out there dealing with these questions. Kierkegaard, Nietzsche, Sartre, Camus are just a few philosophers that discuss these topics at length. There is also a plethora of psychologists that tackle these exact questions. Or talk it out with friends. \n\n\nOnce you’ve decided on the meaning or goal of your life, the purpose of it all, then we can discuss the necessary skills and characteristics needed to achieve your *own personal* definition of such.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oyk4or/what_is_my_purpose/", "title": "What Is My Purpose?", "social_network": "reddit", "user": "MelkaThePhilosopher", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1628175536, "permalink": "/r/DecidingToBeBetter/comments/oyk4or/what_is_my_purpose/", "nsfw": false, "first_save": 1635437221.2768028, "replies_charged": false}