{"id": "t5_2tand_t3_ob3mc9", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "Just though I'd vent on here. I (20M) lost my virginity last fall when I was 19, and it really wasn't until this year that I started having success with women. Since then I've been with 3 women through various dating apps. Through those dating apps, I met my girlfriend who I care about deeply.\n\nHowever, I've been noticing that I still have an incredibly unhealthy viewpoint toward sex. I have difficulty understanding hookup culture, and to me, having sex is still a big deal. When I heard about my girlfriend's previous hookups with random guys at college, I was disgusted and incredibly jealous that she would share that sort of affection and intimacy with people she hardly knew. I was jealous of those guys as well, because I viewed having sex with my girlfriend as something incredibly meaningful, that I earned that sort of intimacy with her by building an emotional connection with her. I also feel insecure because I've never been a part of that hookup culture, and it makes me feel like an idiot that I place so much weight on sex when it can happen in a night like that. I've had one one-night-stand, which makes me hypocritical, but for some reason it feels different hearing about it from my girlfriend.\n\nFor context, I have been experiencing performance anxiety and ED, which I believe contributes to my unhealthy viewpoint toward sex. This causes me to see sex as something more unattainable, and to value it in an unhealthy way. I also tend to over-sexualize my girlfriend, in part to compensate for the ED issues.\n\nI know this viewpoint is unhealthy, and I just wanted to know if anyone else has experienced this mindset and possibly how they grew out of it. I think it originates in part from starting my romantic life so late, and its something I want to grow out of.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ob3mc9/trying_to_gain_a_healthier_view_of_sex/", "title": "Trying to Gain a Healthier View of Sex", "social_network": "reddit", "user": "throwaway1768493028", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 15, "down_vote": 0, "creation": 1625078455, "permalink": "/r/DecidingToBeBetter/comments/ob3mc9/trying_to_gain_a_healthier_view_of_sex/", "nsfw": false, "first_save": 1635437506.4505837, "replies_charged": false}