{"id": "t5_2tand_t3_pbvcgt", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "I am confused about who my ex was. So I guess by posting here based on the experiences of other people I can get an idea on who the person was.\n\nI am a shy person and I find it difficult to quickly open up to people. I trust some people easily and I have had experiences where I had to go through difficult situations because of that. For the past few months I have been grilling myself over my ex. How I lost a good woman, how I missed out on so many cute little moments and how I could've made her happy. I just want to describe my ex here to understand what the hell was actually happening.\n\nI met her(22F) during high school and I immediately fell in love. She had a sort of mystery about her. We talked in person only a few times and rest of the conversations happened via text. The relationship was one sided for almost one and a half year.\n\nShe didn't want to make the relationship public and I was always a bit shy to make the first steps. I waited for her permission or consent to get anything rolling. I didn't know what to talk about, should I hug her or not. There were a lot of times I wanted to meet her but either she shot me down or things didn't come together. There were points where I waited for her to start a conversation or fucking do something but she just seemed avoidant and I felt really sad. I believed it was because she was shy and didn't want to embaress herself infront of her friends. I accepted that.\n\nSoon I left for college and she took a gap year for medical entrance. Things went good, she could only use the phone for one hour a day and sometimes I went to meet her. At some point we started having phone sex and we loved it. We used to watch porn together. But she always made it like I made her do the things and she was just in it for me.\n\nShe didn't crack medical exams and she started going for degree in our hometown. I was in engineering and I was struggling af. College was hard. My brother got diagnosed with bipolar. So things at home weren't going good. We started struggling financially. I hated college. Couldn't find a purpose, tried volunteering in some communities and may started over working there because I saw it as my only escape route.\n\nShe wanted more time from me. She always wanted me to call her. If I didn't pick up the phone she immediately assumed that I was ignoring her. She will send a lot of messages but would soon delete it before I could read it with a steady head and reply. I was going through a tough time and I made a mistake of not completely opening up to her. But she still wanted me to live in her fantasy world. I initiated for a break a few times but I didn't want to make her sad and we went back into the same cycle.\n\nSometimes I would tell her that we might be heading in two different directions. I promised to marry her during the initial phases of our romance but two years into college, I was confused about everything and when I shared this doubt, she used to tell me that I cheated her and I was not to be trusted and all this hurted like hell. I only wanted her to take some initiative and drive the relationship forward.\n\nI strongly felt like she didn't accept my flaws and wanted me to only play a role in her fantasy.She once day called me and cried that she only wanted me to marry her and have a baby with her.That scared the shit out of the 21 year old me. During this time she wanted to meet me and wanted me to make all the plans and I was puzzled as hell, not just because of her but with my whole life. She even called to me to have sex but I was confused about my feeling for her and didn't want to leave an emotional scar.\n\nLast year on February she texted me that her best friend in college proposed to her and asked me what she should say. I thought she was kidding and told her to say yes. I have met this person and another one of her friend earlier on an occassion and I didn't feel a good vibe with them.\n\nA week into the lockdown, I started relaxing and tried to contact her again, she told me that she is in a new relationship. I thought she was joking but something was really cold. It finally hurt my ego and I blocked her. All this happened via text.\n\nLockdown made me work on myself. I understood some of my anxiety issues and discovered that maybe I was going through a mild depression and survival mode through my college. I didn't enjoy anything much during college and I was mostly sleepy and had no energy. She used to blame for that too. Last January I apologised to her if she ever felt like I hurt her.\n\nJune 2021, I called her. She told me that she was only testing me when she told she was in a new relationship and only got into the relationship after 4 months. She waited for me and since I didn't call, she thought I didn't care. She told me that she thought I needed a therapist or counselling back then but since I didn't go to meet her she didn't take the initiative. That hurt me too.\n\nThat shattered my whole reality. I didn't know what to do. I always thought it was my mistake that I didn't know how to express my love. I felt bad for initiating the phone sex and I felt bad for expressing my feelings. She told me that she didn't have a single happy moment with and she was comfortable and happy in her new relationship, that I always worked and ignored and didn't call her everyday. She felt like I was using her.\n\nWhen I finally opened up to a close friend of her's, she told me that my ex didn't discuss anything about the relationship with them. She always closed the details about me. But she introduced her new bf to everyone in her circle.\n\nI made me feel worthless. It makes me sad that I worked for my career and didn't focus enough on her. That I lost a good woman. That I didn't have the guts to take action at the right moment. That I couldn't really ever open up to another person.\n\nDid I take her for granted? Was she always testing me? If she was not happy then why didn't she try to do something and always left everything upto me?\n\nTL;DR: Can't sum it up in a few sentences. Please try to help me out with some idea of this person.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pbvcgt/i22m_need_some_perspective_on_my_ex_i_am_being/", "title": "I(22M) need some perspective on my ex. I am being hard on myself and it's ruining my mind.", "social_network": "reddit", "user": "catch_404", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1629966837, "permalink": "/r/DecidingToBeBetter/comments/pbvcgt/i22m_need_some_perspective_on_my_ex_i_am_being/", "nsfw": false, "first_save": 1635436978.0502765, "replies_charged": false}