{"id": "t5_2tand_t3_dgaqa7", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "I dug myself a hole so deep that there was no way out in sight. I lost my place, quit my job, maxed out my credit card and moved into my best friends room. I laid in bed and waited for things to get better, telling myself I just needed more rest. Maybe I did, but I became trapped in the reality I created and nothing was going to change until I faced my underlying issues.\n\n I was dependant on anyone and anything. It began when I was sixteen, I discovered boys and created an inaccurate ideology of what a relationship was supposed to be. I thought about it endlessly, trying desperately to bandaid a void of love that only I could fulfill. Over the years it caused debilitating mental suffering that started to seriously affect my physical health. I developed every symptom of type II diabetes, I've had serious chest pains for years, and have fainted multiple times. My body was deteriorating from substance abuse, but I couldn't be bothered to do anything about it. I felt completely and utterly worthless.\n\n*I’m gradually rediscovering the value of life and it gets better everyday.*\n\nFor last week I tried putting myself first and listening to my gut. It has begun slowly, by finding things that bring me joy. I started listening to podcasts and meditation music, those moments of peace reminded me of the demeanour I once knew. I became confident enough to be honest with someone about how badly I was struggling. I am eternally grateful for my support system. I accepted that it was okay to ask for help, then with a light push and local resources, I decided I didn’t want to live in a constant state of void anymore. I made some calls, brushed my teeth, washed my face, set an alarm and went to sleep at midnight. This was a big step from my habitual six to ten in the morning bedtimes. I woke up with the all too familiar feeling of dread, but decided to get dressed, shower and persevere. I started to panic when it was time to leave, I couldn't go back to bed and admit defeat, the idea terrified me. A choice was made, I couldn't keep endlessly waiting for other people to fix my problems, I fought for myself. \n\nWhen I accepted it was okay to be alone I was overjoyed with an immense sense of freedom, I fell in love with myself again. My journey with mental health isn't over, but I regained a quality of life I never knew to be imaginable and I now possess the wisdom to keep it that way. *Progress isn’t linear, but when you make the decision to prioritize your own well being, everything else falls into place.*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dgaqa7/my_mental_health_has_been_declining_for_ten_years/", "title": "My mental health has been declining for ten years, and two months ago I hit rock bottom.", "social_network": "reddit", "user": "emtard_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 41, "down_vote": 0, "creation": 1570772981, "permalink": "/r/DecidingToBeBetter/comments/dgaqa7/my_mental_health_has_been_declining_for_ten_years/", "nsfw": false, "first_save": 1635437783.030521, "replies_charged": false}