{"id": "t5_2tand_t3_n40wp0", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "We all have tons of shit that we want to get done in our lives and we simply can't balance them all. either you freeze because of the tons of the things that you have on your shoulder or you only focus on one or two and discard the rest. what's the solution? Getting up each day and planning the day based on what activities you have worked on in previous days, which activities you have skipped the most, which deadlines is getting closer, and how important each activity is to you and decide what to do and in which order based on all the factors above. sooo why do we don't that? cause it's so freaking hard. It adds a ton of friction for really getting things done. considering all the details and making decisions based on that is so exhausting for the brain that it rather shut down and do nothing for the day instead of solving the above equation. \n\nFortunately, that's exactly what computers are good for. Solving equations. That's why my friend and I created an app to take the deciding part out of your day and only leaving you with getting real work done.\nIt takes all the above into consideration and prioritize and order your activities every day. you get your plan every day on your first visit. It's called “Actie” and it is completely free. use it and see how does it fit in your everyday routines and let me know what you think.\n\nIt’s available on both Google play and App store.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n40wp0/if_you_wanna_get_better_you_need_to_decide/", "title": "If you wanna get better, you need to decide less.Here is HOW!", "social_network": "reddit", "user": "Aghareza", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1620060397, "permalink": "/r/DecidingToBeBetter/comments/n40wp0/if_you_wanna_get_better_you_need_to_decide/", "nsfw": false, "first_save": 1635435284.2744973, "replies_charged": false}