{"id": "t5_2tand_t3_nu1bg8", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "Where to start, I'm 32 and got a schizophrenia diagnosis 10 years ago. So, I'm on disability which combined with mom's income helps give my niece a good life(mom has custody). I've had an internet addiction for probably 15 years, and a drinking habit for 8 years, and I'm 6 months off nicotine.\n\nOn to the story. 2020 hit me hard and I've been struggling with a lot of stuff but all that wound up in me not losing weight last summer like I did in the summer before it. Instead, I not only gained, I shot past my original start weight of 235lbs and up to 245lbs, which makes me class 2 obese according to the BMI scale. That terrified me, and got me thinking about changes I need to make. Real ones. Major ones. Lifestyle ones.\n\nTo start, it's only for 35 days. That lines up to over a month and a little bit after I get a medication refill. A good trial period. I will also take a look back at it all and see if I want to continue these hardcore changes.\n\nI've already been off reddit for the better part of the last month and a half, but I am vastly restricting my time on discord. Weekends only, and no notifications, so I have to intentionally check it. I had responsibilities on one of my discord communities, but I'll explain to them that I have to take some time off. Those two social medias were all I had left, but I spent all my time chatting on one or the other.\n\nI'm reserving my computer to work on my hobbies, write on my blog, to play games on. Nothing else.\n\nToday is day 2 off alcohol and it's been insanely easy compared to every other attempt. I think the medicine did wonders and I just haven't tried a forced sobriety streak. \n\nI'm not sure anyone here has any experience with avolition, but I have it bad for a lot of stuff, even basic hygiene stuff. So,I set up a daily routine in my Daylio app, and my getting ready routine is to weight myself, take my meds, brush my teeth and put on deoderant. Then an evening routine for meds, brush teeth, floss, and journal. Since I set that up, I've completed it both times today and yesterday. I only normally manage to just take my meds each morning and night.\n\nI swapped my uber eats pass for a pass to the loseit app, and I'm back on logging all my calories. I'm also not eating till noon and stopping eating at 8pm. The calorie tracking is to make sure I eat enough in my window to last me till the next day.\n\nFinally, walking has done wonders for my weight loss journey before, so I found this new game called Fitness RPG, and it converts steps taken into a currency in the game. That game also has a daily list of things to do that are just good for you and you get more fit currency from it. I also use my fitbit app for more detailed tracking of heart minutes, step goals, and sleep tracking. Then I found a third dopamine hit for getting my walking in, which is the rings on the google fit app.\n\nI know the weight I hit was cause of a large meal on thursday, and it's already been passed through my system cause I clocked in just under obese class 2 this morning with 3lbs lost. It's still the wake up call I needed to take control of my life.\n\nI will also report back after the 35 days are up.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nu1bg8/i_hit_the_scale_yesterday_morning_and_realized_i/", "title": "I hit the scale yesterday morning and realized I had to change everything.", "social_network": "reddit", "user": "LivingAgency8", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1623031211, "permalink": "/r/DecidingToBeBetter/comments/nu1bg8/i_hit_the_scale_yesterday_morning_and_realized_i/", "nsfw": false, "first_save": 1635437520.6003377, "replies_charged": false}