{"id": "t5_2tand_t3_m0sq27", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "Self-security is very important, but I think it's good to be careful about not resorting to total independence by mistake. I think **healthy interdependency** is often overlooked when it comes to common discussions about self-love.\n\n&#x200B;\n\nThis year, I've witnessed the power of connections by meeting a lot of kind Redditors. When I socially participated and stepped out of my comfort zone, I gained invaluable growth. Redditors that generously give in various ways and post their stories, advice, questions, and encouragement have all contributed to raising me in some way—*every single person*. I didn't learn all this stuff from my parents.\n\n&#x200B;\n\nTo me, it's no different than love. It may not always be interpersonal, but it's a generous form of love through small commitments that benefit people you never knew. I learned different ways to see the world, ideas I can apply to my own life, and things about myself that I may have not discovered on my own.\n\n&#x200B;\n\nIn January, I was:\n\n* extremely depressed\n* alone\n* unable to stand up for myself\n* suicidal\n* lacking in self-esteem and self-confidence\n\n&#x200B;\n\nBy this month of March, I have:\n\n* improved my conversational skills\n* made friends\n* realized an underlying trauma previously unknown to me\n* improved my self-confidence and self-esteem\n* started reading books out of my own interest\n* learned why it's harmful to compare my life to others'\n\n&#x200B;\n\nI even started and ended an emotionally neglectful relationship in a *month's* time— all because researching and reading about the knowledge, advice, and similar experiences of other people forced me to develop the courage to assert my value as a person. I never *once* stood up to someone I was close to and told them they're wrong before. Instead of having constant brain fog and emotional pain, I feel like my good ol' self again!\n\n&#x200B;\n\nAll of this happened simply because I decided to meet other people, and I'll never forget the love that everyone has so generously given me. These experiences motivate me to develop greater security within myself, as well as be in a better position to extend my self and nurture the growth of other people—*especially* those I haven't met yet. For the first time, I'm not doubting myself as much as before.\n\n&#x200B;\n\nDon't underestimate the kindness of people looking to help you by just being themselves.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m0sq27/selfsecurity_is_important_at_the_same_time_dont/", "title": "Self-security is important! At the same time, don't count out seeking healthy fulfillment in friendships and connections!", "social_network": "reddit", "user": "rapidSpinningTurtle", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1615244766, "permalink": "/r/DecidingToBeBetter/comments/m0sq27/selfsecurity_is_important_at_the_same_time_dont/", "nsfw": false, "first_save": 1635436702.4049308, "replies_charged": false}