{"id": "t5_2tand_t3_l1tj2z", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "Yes I hopped on the trend-but I feel like this is like an updated version. \n\n6 months of no social media besides reddit has taught me a lot of things. I permanently deleted Instagram, Snapchat, Tiktok and Facebook. \n\nFor one I don’t need to know every little thing that goes on in other people’s life’s. I don’t need to compare myself to these people. Most of the people only post the best things happening in their lives. I don’t need to compare myself to Instagram models that post sexy photos as most have filters, photoshop and etc (I am very insecure about my body bc of this). \n\nI don’t need to follow people I haven’t spoken to in months, and years just to make sure their lives are alright. I don’t need to get sad when people don’t wish my happy birthday (even if the social media app tells them it’s my birthday). I don’t need pointless likes and comments from people who have seen me at my lowest and done nothing but watched. \n\nI survived the past 6 months without these and a whole lot of other things social media comes with. I don’t need social media (except for reddit). I love Reddit. \nI learned that I don’t need all of these things and the addictions to these pointless apps. I learned that the people I used to worry about on these apps didn’t give a damm about me. They would only speak to me when they wanted something. \n\nI am a senior in college, and I failed two classes. Part of the reason why I failed was because my depression. I need to focus on my mental health, and school right now. I don’t even think I’ll ever get back on those sites. I just don’t think I belong there anymore. \n\nHere’s to focusing on my life and putting myself first. Here’s to minding my damm business and being productive. \n\nEdit: \n\nThank you for all the awards and comments! Also wanted to add I’m 6 months sober of Self harm!! \nShoutout to my husband for convincing me to delete everything and convincing me to stop (which social media did in a way with pain shopping). \n\nWhat do I do on my free time ? Well mostly reddit-but I don’t use it more than 6 hours a day, Netflix, Hulu, read, gonna start replaying the flute again when I can buy one, drawn a few sketches. \nI’ve been focusing on weight loss, I cook, clean, and work. We go back to zoom college next week so at least I’ll have homework. All of these things combined are more than enough to keep me busy! At-least until I graduate then I’ll have to find more things to do.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l1tj2z/deleted_all_social_media_except_reddit_6_months/", "title": "Deleted all social media (except Reddit) 6 months ago", "social_network": "reddit", "user": "Midnighttonigght", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1311, "down_vote": 0, "creation": 1611213895, "permalink": "/r/DecidingToBeBetter/comments/l1tj2z/deleted_all_social_media_except_reddit_6_months/", "nsfw": false, "first_save": 1635436431.5691154, "replies_charged": false}