{"id": "t5_2tand_t3_jg92j3", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "Some quick background: I've worked as a software engineer for the past decade. Don't get it twisted though- even though I'm from the US I am not making the big bucks. Far from it. For the first few years of my developer career I went from contract to contract, until they dried up and couldn't find work for a year. This was seven years before COVID. I no longer was able to support myself and moved in with one of my parents. Meanwhile I continue to search for jobs including full-time ones.\n\nI'm now in a somewhat strange situation with motivation here. I am stuck in a job search \"trance\". Even though I barely have enough money for myself (and ineligible for unemployment), I am living comfortably with my family. I get free room and board. I have no obligation to pay rent because the place is so cheap. Any jobs I get now are just short term contracts that pay worse than I had when I was living on my own.\n\nI grew up in a low income household paid my way through college with loans and Pell grants. (The loans were not big and were since paid off) My parents just managed to do a good job saving enough for retirement after their steady careers. They're over 60 now, and I'm almost at 40.\n\nSo that's the situation I'm dealing with. I've been doing personal self-learning, personal projects, and more job seeking and mock interviews going on and off for 5 years straight but I'm not pushing myself enough. It took me a long time to realize that getting supported by my parents and my crappy job opportunities go hand in hand. After living with my mom for a few years, she's not as aggressive about pushing me to find work as she used to be.\n\nMy warm, comfortable safety net is holding me back. And people that pay their own way know what it takes to light a fire under their ass. So how can I do that for myself? Should I go homeless and live on the street/my car? Or is that too drastic. That sounds like it will make things too much worse so I am looking for other ideas on how to drive motivation when I am in a lull of not being uncomfortable enough, but still disappointingly broke.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jg92j3/im_demotivated_and_out_of_work_but_im_surrounded/", "title": "I'm demotivated and out of work, but I'm surrounded by a safety net. What are some things I could do to get motivated again?", "social_network": "reddit", "user": "Loquat-Flimsy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1603402131, "permalink": "/r/DecidingToBeBetter/comments/jg92j3/im_demotivated_and_out_of_work_but_im_surrounded/", "nsfw": false, "first_save": 1635437038.296718, "replies_charged": false}