{"id": "t5_2tand_t3_ki3oes", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "I'm so tired of constantly feeling this way and I want to stop, but I can't seem to argue with myself because my own counter-arguments make sense. I also hate that this entire problem seems to solely be about sex. It's so sad and pathetic. I'll explain. \n\nI don't currently have a girlfriend, and haven't dated much, nor have I had many sexual encounters. So the frustration is pretty big already. When I do go on dating apps, like Bumble and Tinder, I'm constantly reminded how much like a dog I am - waiting for some woman to throw a morsel of attention my way, getting one match maybe in two weeks or so. It feels so fucking pathetic. All the while, for girls, it's a completely different experience. They can scroll through hundreds of matches, pick one when they're bored, start a conversation randomly, and then jump to someone else when they get tired of it. This also translates to real life. I'm friends with this girl who is pretty much exploring all of her sexuality and it's making me so angry that I can't have that too. Because it's so easy for her. If she wants to sleep with someone, she can, because the choice to do it is hers. 90% of the time no guy is going to say no. She's slept with people she's just met. She's been with multiple people at once. When we met, she wanted to sleep with me too, and eventually we did. But I feel pretty much like a tickmark in her list of guys she's fucked and can call when she's bored. As a guy, I can't have this, unless I look like brad pitt or something, or have a ton of cash. I hate, hate, hate how imbalanced it is between genders. \n\nI hate that I have to put in so much fucking effort into making conversation, into making myself into something people would be attracted to, while this isn't true for women. What effort would they have to put in? Basically just decided yes, or no to whichever guy is hitting on them. Again, I understand I'm generalizing, but it is true for most. \n\nI'm becoming more and more hateful and hostile, and it's warping my thinking. I get more satisfaction from rejecting women than from having a conversation. At least that way I have the upper hand. I hate that I'm like this, but the solution is what? To just accept that this is how it works, right? And be okay with it. And be okay with not being able to explore my own sexuality and be frustrated by that and focus on other things instead, right? \n\nI don't know how to fix this, are there other solutions that I'm missing? I'm so tired of being so hateful and angry. I want to change, please could someone help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ki3oes/help_me_stop_being_an_incel_please/", "title": "Help me stop being an incel, please!", "social_network": "reddit", "user": "packsonJollock89", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1608636946, "permalink": "/r/DecidingToBeBetter/comments/ki3oes/help_me_stop_being_an_incel_please/", "nsfw": false, "first_save": 1635438117.716476, "replies_charged": false}