{"id": "t5_2tand_t3_ix51qj", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "Small background - Me (M32) and my colleague (F27) worked together for almost 4 years and decided to quit the Big4 we worked and started a professional consulting firm on our own. Though she is 5 years less experienced than me, I thought it would be fitting if we be equal partners in our new venture. After a year in the venture, we got an opportunity to collaborate with another consulting firm which is run by an old friend of ours. \n\nThe other friend, (M 40) has almost 19 years of experience but still treats us fairly in sharing Billings and teaching us stuff if we aren't aware of it without any air of superiority or condescension. \n\nBut off late my partner started feeling that he is being a bit too bossy on allocating work and asking delivery on priority. I emphasised that he is quite a chill guy and so talk it out. But she refrained. Maybe due to the fact that he is almost thrice as experienced as he is and immensely brilliant and we'll networked. So, it is quite okay to feel intimidated. \n\nSo, she has started cribbing to me very often which kinda takes away the peace and satisfaction which I get from a day's work. \n\nBut today, I decided, enough is enough. You stand up and talk to him if you feel offended or whatever. I have been babysitting you for all my time in the Big4 since I was her reporting manager. But not anymore. We deal with our stuff on our own. \n\nI hope I am right.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ix51qj/been_a_caretaker_of_my_office_partner_now_i_dont/", "title": "Been a caretaker of my office partner. Now I don't want to do it anymore and let her fight her battles herself", "social_network": "reddit", "user": "CaptnThor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1600709596, "permalink": "/r/DecidingToBeBetter/comments/ix51qj/been_a_caretaker_of_my_office_partner_now_i_dont/", "nsfw": false, "first_save": 1635438147.4338202, "replies_charged": false}