{"id": "t5_2tand_t3_ohv6nc", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "I have it all, anxiety, agoraphobia, depression, CPTSD, alcoholism. I’m pretty much alone because I can’t trust others. I so badly want to reach out, but when I do, I lash out to protect myself and drive others away. I absolutely loathe myself and have no idea why anyone would want to be near me. I think about suicide every second of every day, and I’m only here because my death would make people sad. I don’t enjoy anything so there’s no escape from the darkness. I can barely function. I have panic attacks and cry suddenly, even at work. I can’t afford therapy or a counselor. \n\nI don’t want to be this way anymore. I can’t escape this vicious cycle alone. \nThis morning, I woke up with the tiniest iota of…”motivation”? Latched on like a gator before returning to the murky depths.\n\nMy hopes:\n\n• Stop wanting to die\n• Gain confidence\n• Trust people or at least not be controlled by every good or bad thing they do\n• Function like a human being (go in buildings instead of passing them out of fear, stop freaking out then freaking out about freaking out, etc.)\n• Stop thinking I’m in love with someone just because they’re the tiniest bit decent to me\n\nI’ve been at rock bottom for a decade. I have constant chest pain and probably will die before I’m 40. Please help, any little bit of advice or…anything. I’m so lost.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ohv6nc/help_im_having_a_rare_moment_of_hope_and_want_to/", "title": "Help. I’m having a rare moment of hope and want to take control of my life.", "social_network": "reddit", "user": "stahpetbitchstahpet", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1625966815, "permalink": "/r/DecidingToBeBetter/comments/ohv6nc/help_im_having_a_rare_moment_of_hope_and_want_to/", "nsfw": false, "first_save": 1635437982.2627387, "replies_charged": false}