{"id": "t5_2tand_t3_hvd42a", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "I've written a lot of things over the years, short stories, opinion pieces, drunken film reviews, too many haikus, but for a long time I only wrote half a novel. Until now.\n\nI loved my idea, and I knew where the story was going, but a series of bummer life events combined with my preexisting depression and anxiety issues caused me to freeze up. The fear of hating the finished product combined with a loss of drive halted my biggest work yet. I had writer's block not because of a block of ideas, but a block of motivation.\n\nThen quarantine happened.\n\nI've had some time off from my job that I dislike deeply. It is a necessary evil for now, but it saps me of whatever left over vigor I have on a daily basis. Quarantine allowed me to flip my third shift schedule back to days, gave me time and mental clarity, and I latched onto it. Writing four game reviews a week and working on my podcast were so cathartic, and showed me that I don't lack the passion, just the drive when I'm feeling emotionally taxed.\n\nI carved out some time and finally buckled down on my main project. The book that I had spent five months starting and two years postponing, was finished in a mere two days.\n\nAnd now I feel free.\n\nNow that I'm not just working on the one thing, I'm finding the inspiration to continue the story elsewhere, add to the world, develop smaller tales that can be easier to knock out once I return to work. A weight has been lifted, the burden of such a big piece of my writing life much easier to carry.\n\nI'm not ready to publish yet, though I've got some trusted people working through it for feedback, so the journey of this particular piece isn't completely over. It's pulpy as can be and ridiculous, however despite my usual anxious discomfort with my own work, I really enjoy it myself.  \n\nThe hardest part has passed: just getting the friggin thing out of my brain. Hopefully I can ride this confidence and satisfaction even as I return to my normal life, so I can continue to focus energy on my truest passion.\n\nIf you feel stuck on a project, I hope you can overcome your hurdle as well. Because the end result of simply getting that thing done can be enough to completely shift your outlook on whatever your medium is. Thank you for reading this post, seemingly my second novel.\n\nTL;DR:\nTook quarantine time to clear my head and focus on writing, channeled that energy into finally finishing my long overdo first novel, it's pulpy as hell but I feel free.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hvd42a/after_two_years_of_farting_around_i_finally/", "title": "After two years of farting around, I finally finished my first novel", "social_network": "reddit", "user": "eBoneSteak", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 21, "down_vote": 0, "creation": 1595356911, "permalink": "/r/DecidingToBeBetter/comments/hvd42a/after_two_years_of_farting_around_i_finally/", "nsfw": false, "first_save": 1635438146.7450085, "replies_charged": false}