{"id": "t5_2tand_t3_jvar65", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "**\\[SERIOUS, LONG\\]** This is quite a long post as I felt the first step to recovery was to get it out of my system. So please bear with me.\n\n&#x200B;\n\nExactly a year ago, my (20M) sister(24F) died.  It was too brutal for me. My parents were completely shattered and both actually went into a deep depressive episode. I saw that immediately and said to myself - 'Dude, you cannot get weak right now. Your parents need you more than ever'. So for the whole year, I did not even shed a single tear- in the hopes that my parents would see this and think that things are not completely lost.\n\n&#x200B;\n\nThis somehow worked. I've seen many parents who after losing their child stay depressed for years long. This, fortunately, wasn't the case in my parents. But it took a massive toll on me. Not crying during the day made my nights worse. I had terrible thoughts (what if my parents also died? Whether I had been a good brother to my sister? Did I make her proud?) which kept me up at night. And when the day dawned, I had to put on a smile in front of my parents.\n\n&#x200B;\n\nWhile I was very happy that my parents were doing an amazing recovery, things kept going downhill for me. I actually couldn't study. Whenever I sat with my textbook open, the dark thoughts again crept my mind and I had to take a walk or just watch Netflix or something just to take my mind off it. I was really good at maths and logic before, but after this, it took me a full minute to do even some basic calculations. I am gonna be honest here, the only way I could sleep at night was to masturbate. It was never out of horniness. But because I just wanted to get some fucking sleep, I would masturbate and the release would put me instantly to sleep.\n\n&#x200B;\n\nThis had an even worse effect on me. The next morning, I would always beat myself over doing such veil things after my sister died instead of working to make her proud. Unable to study, my grades went drastically down. And being an electronics engineer trying to go into IT sector, not only the stacks were against me, but my GPA only made matters worse as I had the added dread over how I would survive in real-life. I thus had to resolve to cheat in tests. I absolutely hated this practice before and my sister who was a gem of a student never indulged into it. And I had made a promise to her that neither would I. But to stop this downfall, I had no option but to give into it and this makes me even sadder.\n\n&#x200B;\n\nBefore all this, I was in a perfectly good shape. But due to corona and online classes, physical activities became less and less. And so here I was - fat, depressed and someone, who is horribly ashamed of not being able to make his parents and sister proud and has his future all in tatters. Telling all this to anyone always felt like I was acting like the victim and making excuses, hence I never expressed it out. Hell even typing this is giving me huge pangs of guilts over victimizing myself. There is a deep voice in my head which is screaming at me. Saying how I am an ungrateful piece of shit. Just a big fat fuck, who would amount to nothing in life. I just hate myself.\n\n&#x200B;\n\nI want to talk to someone. Reach out to someone who I can trust. But being the anti-social piece of shit that I am, I do not have any such friends to confide into (sure I have friends, but not close one) and hell no would I confide into my parents who are just healing themselves. \n\n&#x200B;\n\nAll this has made me into a bit of nihilist. I really don't see any point in doing anything as the thought that my life (the one that I had envisioned before all this) is already dead. I see no bright future. The dark voice inside me is proving too powerful. I hate myself and am always a mix of sad and angry and I an fucking tired of it now. I miss my sister so fucking much. I loved her more than me and my parents. I don't think I will ever find someone who I'll be loving as dearly as I loved my sister, and THAT makes me so sad.\n\n&#x200B;\n\nI want to get better. I need to get better. I miss my old and happy parents. I miss my sister. I miss my old self - the one who had a nice physique, who was intelligent and had a proper goal in life. Everything is looking dark. Hate the world and me. I feel like I am no longer actually living. Every day feels like a jail to me. I am absolutely devoid of any compliments (only my sister used to give that to me). Even tho my parents are doing an amazing recovery, everyone is attributing that to them reading religious books. No one recognizes my pains, my sacrifices and it fucking hurts.\n\n&#x200B;\n\nI just need to love myself again. Find myself again. Be myself again. Someone please help", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jvar65/i_fucking_hate_myself_please_help_me_be_the/", "title": "I fucking hate myself. Please help me be the person I once knew I could be", "social_network": "reddit", "user": "Guy-Without-A-Plan", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1605547303, "permalink": "/r/DecidingToBeBetter/comments/jvar65/i_fucking_hate_myself_please_help_me_be_the/", "nsfw": false, "first_save": 1635436626.6322973, "replies_charged": false}