{"id": "t5_2tand_t3_n2gx8c", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "You seem really uneasy whenever you don’t have something to do. It’s like if you’re not working, or helping others, or engaged in some other distraction that you really fall apart. Why is that? \n\nMaybe it’s a coping mechanism. I do it too sometimes, because it’s hard for me to be by myself. If I’m always helping others or working then I don’t have to be with my thoughts. Maybe we would rather give all of ourselves away just so we don’t need to be alone with ourselves. Maybe right now that is easier. But it shouldn’t be.\n\nWe shouldn’t sacrifice our health and happiness because we’re running from parts of ourselves we haven’t healed. We shouldn’t use the world’s to-do list as our distraction. We are only succeeding at hiding from our problems. We’re not living a life. We’re not creating memories or growing. Just hiding from the pain for one more day.\n\nYou are never going to escape yourself. Your thoughts and pain and trauma will always be there when this distraction ends. All your hobbies and past times now are just sticking your head in one hole-in-the-ground at a time. Can you see that this is sand through the hourglass you won’t get back? \n\nYou’ve only got 85 years on this planet, give or take. How much will you spend running from thoughts and pain that are too hard to deal with?\n\nI wish I had an easy fix for you. I wish I had found one for myself. And yet the only one I have is “whenever facing this pain is easier than running away, you’ll do it.” It’s like we use training wheels until someone takes them off of our bike and we get tired of falling constantly. Does running from your pain hurt bad enough right now? How long have you been running now? Have you made the same mistakes time after time after time like I have? Are you tired of hating yourself? How much do you hate where all this running has taken you?\n\nBecause I’m pretty sick of it. I’m tired of watching the same movie and knowing how it ends. I’m tired of burning my hand on the stove and knowing I’ll touch it again tomorrow. I’m tired of knowing I’m making the wrong decision as I make it. I’m tired of taking on one more distraction or doing one more favor or doing whatever I can to stop facing this pain I’m hiding from. \n\nMaybe we never grow until we have to. Maybe the wrong answer has to hurt incredibly bad to make us choose the right one. Maybe we’re all stubborn and stupid. Maybe wisdom is a lie and the “wise ones” just got tired of the pain sooner than I did. \n\nBut I’m so tired. I just want to see a fork in the road and walk forward knowing I didn’t self sabotage this time. I want to sit alone with myself without pain or hatred. I want to give that self critical voice in my head less ammo to use against me. I want to be proud of who I am. I want to feel like I’m not the biggest failure of everyone I know. I want to think that all the hard work I’ve done was more than just defeat with extra steps. \n\nWe don’t have to feel strong or courageous or brave. We just have to decide we’re done repeating the same mistakes. I’ve decided I’m done. Have you?\n\n\\---------\n\n**Further Reading**: If this post resonated with you then I think you’d really benefit from the Waking Up app by Sam Harris. It’s the best tool for developing mindfulness I’ve ever found, and for me that’s the key to learning to stop repeating the same mistakes. The more thoughts and feelings you notice, the more chances you have to fix things before they get bad. You’ll feel the ambient heat of the stove as you reach for it and not just when you get burnt. Then we can start making choices that hurt less.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n2gx8c/you_cant_escape_your_problems_by_solving_someone/", "title": "You can’t escape your problems by solving someone else’s", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1619870235, "permalink": "/r/DecidingToBeBetter/comments/n2gx8c/you_cant_escape_your_problems_by_solving_someone/", "nsfw": false, "first_save": 1635436505.1821194, "replies_charged": false}