{"id": "t5_2tand_t3_9j2kx4", "request": ["311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "Thoughts with relations to themes and intention \n\n1) My current situation in detail\n2) my past and it's failure \n3) my potential \n4) smear campaign against me \n5) what i shouldn't do\n\n1) \nI'm 18 years old.\nA physical description.\nI have unruly uncut brown hair, dermatitis, tanned skin, white teeth, a small frame, bony body, average sized penis, small bony legs, flat feet.\nI'm half russian and half english.\nMy parents think I'm a drain, I have to retake my A Level Exams and it will be harder for me to get on my desired course at university.\nI'm socially anxious when it comes to Instagram and social media and am a perfectionist.\nI'm a relatively talented pianist and chamber musician, I also enjoy jazz. I love reading. I have a daily routine I'm more or less establishing, I'm applying for an interim job and working towards my desired grades. I have no sex life and I'm confused on the subject of my own sexuality. I have few friends and my personality is relatively obnoxious and off-putting. \n\n2)\nMy past; lordy \nIn primary school I was eccentric and energetic and fairly intelligent.\nFrom 9-12 I went to the purcell school.\nI liked being a legend, I'd pride myself on fitting in and being respected and being the alpha of my friendship group, I was also ridiculed by boys and generally well liked by girls. My personality was awesome. \nFrom 12-18 my father moved me to his school.\nI won't diverge but the man is relatively stupid, although I love him and respect him, his thinnly veiled narcissism and efforts to intimidate me are quite funny tbh. My mother is on the same smartness level, she's a bubbly personality. \nMy personality shut down more or less and I was depressed. I did ok at gcse. I was hated by most people. I didn't really care about being popular or cool etc lol I befriended the uncool kids and rejected the rugby kids.\nI was always insecure on how to use social media, likes etc especially as I'm such a perfectionist over my own identity. \nDuring A levels I felt insecure with girls so I got clout on twitter lol, I tried to fit in with cool kids lol but they were all admitting to projecting personas out online lol. I basically failed those 2 years. I'm retaking etc.\nI communicate on twitter, it's my punching bag for neuroticism. I detail ways to function better in my environment although ironically my functioning is dominated by my compulsion to tell myself how to function better so I'm so busy mentoring myself I don't actually function lol \nI use twitter for that. I use Linkedin to post my acheivements and visualise my future goals. I use Instagram as a sarcastic outlet lol with friends \nI always idolised this girl, in my mind at least we like eachother on some level, her friends did at least, but I went all neurotic and we all cut eachother off. Other people and I cut eachother off too. I understand the reasoning why, I was playing with their emotions because I don't value them. I saw loads of people as a mechanism for myself to vent to in a somewhat ironic sense as I'm not actually a narcissist lol \nI dominated my whole sixth form because I'd effectively function higher then everyone else. There were certain rumours going around over a school s- and other miscellaneous rumours, these were 100% thematically, definitively false rumours as part of a smear campaign against my reputation. \nI viewed my ego and career as more important then sex so I'd reject girls to jerk off instead. \n.\nWith one girl the themes were; my bf would kill you, oh my bf broke up with me, oh alexxx, stop \nthen i said loads of graphic stuff and then all of her friends were objectified like 'asianpuss', in obvious reference to genitalia. \n.\nDuring school, themes would be; alex you're unrealistic, miscellaneous stuff I like etc and nothing that actually related to me so exposing everyone's inherent retardation, then this changed to ; sorry alex, don't drag us, yasmins p**sy, and effectively functioning higher then everyone; my strength, this teacher, miss Farhan effectively sleeping with me; it was loads to take in. \n\nObviously the trolling is lit \nMy failure was ; lack of gym, being a dbag with girls, academic failure, letting myself be walked on, misrepresented, misunderstood and allowing my reputation to become a pinata  \n\n3)\nmy potential; \n\nacademic; \nobviously I'm smart \nI can get \na*aa in \nfrench, music and maths \nI can go to ucl, kcl, ulip, a Russell group uni for mfl/law.\nas long as I don't steer from realising my potential\n.\nclout \nI understand public perception\nI'm good at trolling lool \nOnce I realize academic potential and network hard, I can gain clout, I can start a fashion house.\n\nself respect, respect i demand, self care: \nI deserve all three of the above as prerequisites to a relationship with me \n\ngym: \nI deserve to be ripped \n\nReddit: \nI deserve to use this platform productively \n\nmusical: \nI deserve to learn more piano and music repertoire\n\nlifestyle:\nI deserve to fulfill my daily goals, go out, publish on Instagram etc \n\nnetworking: \nI deserve to use LinkedIn \n\nHabits: \nI deserve to read books and exercise etc \n\nfashion: \nI deserve good fashion \n\nrelationships: \nI deserve relationships and those individuals deserve relationships with me premised off the above principles and self care in terms of academic and life education.\n\nfunctioning: \nI deserve to sleep 8h a day in my uni dorm, at my old folks, in a hotel either by myself or with a special someone, a girl or a guy \nI deserve to use a gym every day in the morning or evening \nI deserve to lose my virginity with someone and that it feels natural \nI deserve friends who respect me instead of imposing self crafted obligations on me \nI deserve to acheive my potential and goals \nI deserve to hook up with women if we both want to on nights out \nI deserve to work a job \nI deserve to drive a car/bike \nI deserve to set up shop/a company \nI deserve to realise all of my ambitions\nI deserve to play sport\nI deserve amazing friends \nI deserve amazing relationships\nI deserve to boast of my good fortune, my potential etc \nI deserve to see my future and present as bright full of potential and prosperity for me to make an impact on the world \nI don't deserve to see nothing but bleakness because I'm smarter then most and I say that not as a boast but bc it fucking hurts \nI deserve to function like anyone who uses this community and posts their success stories \nI deserve to boast about how excellent individuals perceive me as amazing and when I'm on their level I have high self esteem \n.\n4)\nSmear Campaign against me \n\nSchool s- \nstrange one \netc \n.\nConcerned for alex \n.\nFirstly \nInsta clout thots saying this; I literally thot on ig so hard lmao so theres no argument \n2)\nthe school s thing came from a rant i had on private social media. Some people thought they had the obligation to report this when I was just dragging retards loool , it was academically motivated. \n\n2b)\nbare people at my old school thought they were obligated to laugh at me, label me, etc \nthing is \nI rejected these people \nI didn't care about these people \nTheir reasoning was bullshit \nThey had no value to me \nSome guy called craig \nI don't know this guy! \n\n3)\nI'm a narcissist \nI'm an egotist \nevery ist \n.\nAll false \nI systematically check for bias \nand \nI love critique \nbut only when \nI set the purpose of the relationship and \nI define the obligation to someone instead of them imposing that obligation on me \n.\n4)\nacademically weak \n\nfalse \ni have diplomas in piano \ni will get a*aa \nafter all i fucking trolled all the staff loool \n\n5)\nsex life \n\nim at my old folks and i don't have a car yet \njust feels odd \ni will hopefully be going to parties with friends \nmy gap year involves parties, networking, work, sports, travel etc \nuploads to Instagram \nmy entrepreneurial ambitions \nI'm 18 \nI'll lose my virginity like lil yachty \nthe potential flaws are \nnot keeping my mouth shut \nnot being honest \n.\nif theres no attraction I would move on \n.\ntbh \nguys think I'll steal their girls so I feel some ostracism \nbut \nI see no reason for \nno new friends at uni\nmy shell company \nlife \nand my network \nmy friends \n.\nin my relationships \nit needs to be \n\nleadership \ninsta \ngrades \nuni \nsexual kinks \nfantasies\nplans \nexecution \nbed \nmusic \nacademia \nnetworking \nreading \npicking myself up from failure \npurpose of conversation \n1) love \n2) functioning because we fucking love it \n3) if you wanna have sex, I'm not a freak you see \n4) no bias! no ego!\n5) ambition\n6) grades \n7) i love your personality \n8) networking \n9) talent \n10) hygene \n11) body/gym\n12) motivation \n13) communication criteria \n14) skepticism\n15) listening \n16) being an alpha dawgy\n17) culture \n18) values \n19) efficiency \n\nalso \noffending people \nbreaking rules \nviolating people \naesthetics \ngetting emotional reactions \nego \nmiami \njob \nuni \nacademia \nmy wisdom \nleadership \n.\ntreating girls like \nthey're my sister \nunless \nshe wants to be friends \n.\ndefending my friends \n.\nbeing a leader \nnot a troll\n.\nbeing authoratitive and compelling \nthrough \nig \nlinkedin\n(twitter)\n.\npurpose behind my \ncommunication\nin line with \nrelationships\n.\nif relationship is strong \nthats amazing because \n.\nmy goals are being accomplished\n.\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9j2kx4/thoughts/", "title": "Thoughts", "social_network": "reddit", "user": "dopamineway", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1537969151, "permalink": "/r/DecidingToBeBetter/comments/9j2kx4/thoughts/", "nsfw": false, "first_save": 1635437889.4459734, "replies_charged": false}