{"id": "t5_2tand_t3_ntnbfz", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "I am naturally very shy and that has taken a toll on my confidence in the past. I'm the type of person who likes to break things down in a very orderly manner (logic, analysis, synthesis) to solve a problem.\n\nI was really sick and tired of the advice on the internet which seemed to be either: A. Extremely formulaic (Step 1 - Eye contact, Step 2 - Say your name, Step 3- etc.), B. Hackneyed (Just be confident), or C. Sketchy af (I'm looking at you PUAs and Sales Gurus). All around nothing really resonated with me.\n\nNow, I am a musician. Been playing guitar for 17 years! I am a huge nut for music theory; I find it one of the most interesting concepts in the world.\n\nThat being something I am really passionate about, I began to attribute everything in life to how it could be translated via music theory. Social skills eventually became one of those things – and music theory really helped it make sense!\n\nSince then, I went from shy guy to TEDx Speaker, #1 Amazon Bestselling Author (more than 10k copies worldwide), and have made lifelong friends, had outstanding relationships, jobs, and more! Social skills was the greatest gift I could give myself.\n\nWith that said, for anybody looking to better themselves but you're sick and tired of the advice that's out there, here's my two cents:\n\n**Find anything that makes sense to you and use that as a framework for what you want to learn.**\n\nThere are a surprising amount of connections between seemingly different domains! If you can understand one thing, it makes it easier to understand all.\n\nOf course, if you're interested in social skills and music – just hmu!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ntnbfz/how_i_overcame_my_fear_of_talking_to_new_people/", "title": "How I Overcame My Fear of Talking to New People", "social_network": "reddit", "user": "DaSpurdOfStonkStreet", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1622990702, "permalink": "/r/DecidingToBeBetter/comments/ntnbfz/how_i_overcame_my_fear_of_talking_to_new_people/", "nsfw": false, "first_save": 1635436843.1097481, "replies_charged": false}