{"id": "t5_2tand_t3_fd0g5h", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "  I'm sure you all see these types of posts a lot, I've read a handful myself and figured it might help me to make a post of my own. I really can't bring myself to use my time effectively at all. Even typing this is difficult, my mind shoots things like \"Why are you even wasting time with this\" or \"Reddit's not a therapist\".\n\n  I have a lot of aspirations, whether they're realistic or not is one thing, but I'd like to stream playing games I enjoy, create traditional and digital art, record and edit videos, work on concepts for games of my own, write stories, and create my own music. A lot on the plate, but I don't feel overwhelmed by having a lot of goals. I know if I apply myself enough to the things that I want to do, that I can make it in any of these fields. However, I find myself struggling using my free time well to advance myself in things I like to do.\n\n  I work part-time at a grocery store, and even though it's part-time (roughly 20-30 hour weeks) it feels like all of my time is spent at work. I can't work less because I have bills and rent to pay, and I can't work more because I already feel overworked enough at the job.\n\n  When I do feel motivated and work on a creative project, be it an art piece, a video, a song, an idea in general, I surprise even myself with my potential once I apply myself. The problem I'm facing is applying myself often, and disciplining myself to be working on something regularly.\n\n  I know not to expect a cure-all reply, but anything that might have helped you or someone you know during something similar would be greatly appreciated.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fd0g5h/struggling_with_discipline_and_productivity/", "title": "Struggling with Discipline and Productivity", "social_network": "reddit", "user": "blakehollows", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1583265589, "permalink": "/r/DecidingToBeBetter/comments/fd0g5h/struggling_with_discipline_and_productivity/", "nsfw": false, "first_save": 1635437032.0370688, "replies_charged": false}