{"id": "t5_2tand_t3_mqjurw", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "0da85390-0cd4-4819-ba1c-07c5e448265a", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Hi - Not sure what I'm looking for. Advice I guess. Resources. Ideas. Books to read, movies to watch, blogs, therapists, retreats, whatever. \n\n(this is definitely a first world \"problem\". I realize I'm in an incredibly privileged position to even have time to think about this)\n\nI'm turning 34 in a few days and I feel like I'm just not engaged with my life. I bought a house 2 years ago (dead dad money helped with the down payment), I have 2 cats and a dog. I foster pets for a local rescue. I have a full time job that I mostly enjoy and that I'm grateful for. I talk to my mom and one of my sisters regularly. I visit most of my extended family at least once a year. \n\nI just don't feel like I'm really living. Like there must be something more. I have a few friends in my area. Even a few people I'd consider close. But none that are lifetime friends, ya know? They're good people, that I mostly enjoy being around. But the people I'd rather see more often live in other parts of the country.\n\nI don't have anything that I get excited about. Fostering makes me feel needed and helpful. I like being around my animals. I feel good when I do a good job at work. It makes me happy to give gifts to friends and family, or do things for them. I smile when I see flowers. Little things like that make me feel happy for a brief time. But nothing truly thrills me. Lights me up. Makes me excited. \n\nI don't do anything to bring me joy on a regular basis. I don't know what I could do that would bring me joy. I sleep, wake up, work, take care of my animals, eat. See friends sometimes, usually over a meal or running an errand. \n\nMy dad died at age 62 suddenly a few years ago. He wasn't a very good dad growing up, but our relationship got better as I got older. He was very good at living his life tho. He made time to do what he loved to do: ski and see his friends. I remember on the funeral home's memorial page someone left the comment that he was a \"gregarious lover of life\". It made me so happy so see that. To know that he enjoyed the time he had here. \n\nI'm lucky to be alive. I'm relatively healthy, all my limbs work. My family is all healthy. We all have homes and jobs. I'm so fucking privileged. Am I ungrateful? Entitled? Spoiled? What is wrong with me?\n\nIs this all there is?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mqjurw/i_feel_like_im_just_floating_thru_life/", "title": "I feel like I'm just floating thru life", "social_network": "reddit", "user": "solarpowerednaps", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1618377498, "permalink": "/r/DecidingToBeBetter/comments/mqjurw/i_feel_like_im_just_floating_thru_life/", "nsfw": false, "first_save": 1635436850.583671, "replies_charged": false}