{"id": "t5_2tand_t3_lwfhtl", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "\nSo a fear of success is well established, used to explain reluctance to take a promotion or start a business etc. But it could also be perceived as nerves. My question is rather can a fear or avoidance of happiness exist?\n\nThe background to this is the fact it’s how my personality seems to work - even my gf has picked up on it. I actually tend to make choices and decisions that are detrimental to my happiness. Some are spur of the moment decisions that I’ll later regret, or it’ll be avoiding events or activities that I know to be beneficial to my mental well-being. \n\nIt almost feels as though I relish in being miserable. Often I do enjoy being grumpy, though this is what I’d call good grumps akin to Larry David, I enjoy complaining and being grumpy sometimes. Furthermore when I am in a bout of depression, it feels better to forcibly remain somewhat sad when an opportunity to improve presents itself. Is this because I don’t want to be happy or is this the trap of depression? Depression is like a comfy sofa I don’t want to leave, even though it’s time to stand up. \n\nI’m constantly wondering whether I don’t want to be happy, and whether that’s a permanent flaw or just a passing phase. Have you felt something similar? And if so have any advice. \n\nThough I’m not quite sure of the nature of happiness, maybe it’s moments of goodness in life or a passive mood. However why does it feel like my brain, or myself, tries to avoid it?\n\nI even joke with my gf, admittedly it’s probably wrong to make light of it, that I’d never kill myself because then I wouldn’t be able to be grumpy any more. But it makes us chuckle and is never meant with any suicidal thoughts of mine - I’m sticking around whether it’s to make myself miserable or find enlightenment.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lwfhtl/does_a_fear_of_being_happy_exist/", "title": "Does a fear of being happy exist?", "social_network": "reddit", "user": "croplolly", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 16, "down_vote": 0, "creation": 1614727545, "permalink": "/r/DecidingToBeBetter/comments/lwfhtl/does_a_fear_of_being_happy_exist/", "nsfw": false, "first_save": 1635435465.1984031, "replies_charged": false}