{"id": "t5_2tand_t3_opdgv5", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "Many of us know what we need to do to attain our versions of success. At least broadly, if not exactly what needs to be done. Have a goal (or goals), be consistent, keep getting better, adapt when needed, form a team, be grateful, avoid burnout, work, work, work. Work.\n\nWork. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work.\n\nWork. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Work. Chill. Work. Work. Work. Work. Work.\n\nWe know this, we dread it, we look for distractions, we procrastinate. Why? Because we simply don’t want to put in the work. Or maybe we don’t know what needs to be worked on. Or maybe we don’t feel like progress is being made. Or maybe we don’t feel the work is getting recognized. Or maybe we don’t see the value in it anymore. Or maybe…\n\nThe fact is there’s no way around it. When at a job, we seem to work easily, or there are others to hold us accountable, or X amount of money is enough of a motivator to get us docile and working for 8 hours a day. When it is for our own goals, it seems to require so much more effort. We easily procrastinate.\n\nNothing you read here will get you closer to your goals. Only work. The actual action part of putting your goals and plans into action, consistently, obsessively. Work. Stop reading here and work even if it’s only for ten minutes on a project or goal.\n\nWe seem to forget and think that work needs to be fun. It doesn’t; it takes effort, which isn’t always fun. But if you don’t put in the work now, you may never get around to it. It’s amazing how much progress can be made if we dedicated full time to our projects like we do at work. These goals may make us financially free, healthy, have better relationships. Things that are invaluable. Yet we don’t see the value when we aren’t getting paid per hour. Every hour you put in towards your goals may bring hundreds or thousands of dollars of value to you in the future. If you knew you would get paid X amount per hour working on your habit, would you do it? Would you procrastinate? Would you work on it only when you feel like it? \n\nPerhaps, it’s still work after all. But it’ll never happen if you don’t work. All the planning, all the discussions, all the thinking will be a waste and bring you mental stress for no reason if you don’t act to bring them into fruition. It would almost be better to remain ignorant of what you could accomplish if you don’t start, or continue, putting in work towards making it happen. \n\nDon’t let yourself down. There is no shortcut. Work.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/opdgv5/you_dont_need_motivation_you_need_to_work/", "title": "You Don't Need Motivation, You Need To Work", "social_network": "reddit", "user": "MelkaThePhilosopher", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1202, "down_vote": 0, "creation": 1626959276, "permalink": "/r/DecidingToBeBetter/comments/opdgv5/you_dont_need_motivation_you_need_to_work/", "nsfw": false, "first_save": 1635436769.7501836, "replies_charged": false}