{"id": "t5_2tand_t3_pxeghm", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "Bear with me, this is my first reddit post. \nFor some context. This is the best relationship I've been in. He is funny, kind, smart, true to his word, handsome, hot, great in bed... I, on the other hand, struggle with self-worth and feeling accomplished or enough in life. I come from a really messy childhood where I was mostly neglected and sometimes abused. I've worked really hard both in therapy and alone to not repeat those patterns but I clearly still struggle. My biggest trigger is when I feel inadequate and easily replaceable. \n\nIt was his birthday recently. I'm moving back to my birth country where he lives after more than a decade of living abroad. However, first I have to settle my affairs here and clear my rental flat. The day he had his birthday was the only day I could arrange for a car and a trailer to haul my stuff (a two bedroom 🥲) out of my place and to my parents' attic. This took waking up early after a really late night, packing, carrying things to the 6th floor without an elevator, rearranging things... I also gave much of my clothing to my siblings (who I won't see for months) and we had fun together while they tried it on and they were so excited about new stuff. It took me all day and I only sat down to eat and scroll through my phone after 10PM. \n\nI forgot about his birthday until very late and only remembered when I saw his best friend's instagram post captioned \"birthday boy\". I rushed to send him my wishes and apologized for it being so late (text because of different countries and he was out and not online). The next day I still felt bad even though he said it wasn't a big deal for him and how it's common for people to sometimes be preoccupied with their own lives. For me, it definitely would have been and we've had conversations about how special birthdays are for me and how my mother would forget mine for years in a row. I was super disappointed in myself. \n\nToday, some days later, he mentioned how he thought his friend only cared about himself looking cute in the picture he posted, for example, he cut off the top of his head. I asked, \"the birthday boy photo?\" He said yes and made a comment how I wouldn't have even remembered had I not seen it. I admitted that that's possible, and I think I apologized again. \n\nThis is where the hurtful part is. He said, \"even my ex remembered before you did\". This comment really hurt me and I called him a \"petty bastard\". He was taken aback by this and said \"I've just been called a bastard\" in a disappointed tone. I was sorry right away and realized what I said was hurtful and that I shouldn't have said it. I apologized, saying my behavior is in my control and that I shouldn't have said that but that what he said really hurt me and that he should be aware of how that comment made me feel. At first he thought I was too sensitive and that I should have realized he said it as a joke. Maybe he meant it that way but I was hurt because I felt compared and less than. Then he said that if I say something like that to him ever again, he's going to hang up and I'll never hear from him again. This really shook me and scared me. I don't want to lose him. I don't think name-calling should exist in a healthy relationship, and I told him this. I know this is verbal abuse and I don't want to hurt people and be an abuser.  I said I would do my best to respect this boundary but I know I've done this before when I've been really hurt so I didn't feel I could promise him this would never happen again. This makes me scared of myself that I could so easily and carelessly ruin this good thing I have. I'm really struggling with guilt and fear over this. \n\nPlease give me advice on how to make sure this never happens again? What do I work on? I think part of it has to do with impulse control, how do I work on that? The issue is, I don't even entirely know why I said what I said, and that bothers me. Can you help me understand the emotional mechanisms behind what happened and why I said that? \n\nThanks in advance!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pxeghm/i_namecalled_my_boyfriend_how_do_i_make_sure_i/", "title": "I name-called my boyfriend, how do I make sure I never do it again?", "social_network": "reddit", "user": "Wild_Nose_8786", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1632859129, "permalink": "/r/DecidingToBeBetter/comments/pxeghm/i_namecalled_my_boyfriend_how_do_i_make_sure_i/", "nsfw": false, "first_save": 1635435076.4612339, "replies_charged": false}