{"id": "t5_2tand_t3_9f5rul", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "After seeing my friend's Instagram story about his non-negotiable goals, I started to ask myself: What are dreams? Why have them?\n\nIt's easy to get caught up in the minutiae of the material world--we need to call our parents, pay off those student loans, and the chores won't do themselves.\n\nFor many, it may seem foolish and impractical like to think about dreams. Aren't dreams only reserved for self-help junkies and people who attend Tony Robbins seminars? Dreams won't pay my bills or help me move out.\n\nTrue, they won't. But they can.\n\nThe reason is large, but simple. Here me out.\n\nThe nature of the universe, and all things in it, is to expand as much as possible within its lifetime. When a seed is planted, it germinates and grows into a large oak. When a baby is born, it grows physically and mentally into a strong and wise person.\n\nAs humans, it is in align with the law of the universe that we expand our capacities until we reach our fullest potential. Dreams are the perfect vehicle for that. They are compasses that point to love, goodness, and delight; they are the purest forms of our humanity.\n\nDreams are our true first loves--we never questioned their validity as children. We just knew they made us feel like we were stars in a sky of joy and eternity. Nothing was more magical or good. Nothing felt more right than when we were doing the things we loved.\n\nLike children, dreams grow best in an environment of quantum possibility, of \"yes.\" After all, everything is a \"no\" until it is a \"yes.\" The space between \"no\" and \"yes\" is where your dreams plant their roots and where you learn and grow.\n\nIf self-actualization is the ultimate goal in this lifetime, then naturally, dreams act as benchmarks to promote our growth. If you have a clear goal, you will give yourself constant yes's until you've made the impossible possible.\n\nDreams give you the energy to forge a reality in which you want to live. It takes tremendous effort, but when every cell in your body is screaming that this is the right path, there is nowhere else to go but forward.\n\nYou can grow without dreams, of course, but do you think you will give yourself yes's for something you don't really want? When we don't know who we are, we often force the yes's because others tell us to do so. Growth without a direction, however, is being lost at best, and a cancer at worst.\n\nWhy grow instead of reduce, you may wonder. To reduce yourself is to shrink away from life's challenges, degrading yourself as your worth and self-belief falls away in chunks. However, you can only cut away so much until you are in a state worse than death.\n\nDeath is a release into the universe from which you came. However, what you become is undead--someone who is given the gift of life but is sabotaging themselves from truly living.\n\nThe opposite of degradation is expanding yourself to fit the size and depth of the universe. You may be surprised to hear that it will fit like a glove, because ultimately the formless and unlimited universe is the home from which you came and to where you'll go back. It is your truest form.\n\nDreams belong in the realm of infinite possibility, where innovation and creativity, will, desire, and hope also lie. When we allow ourselves to enter this realm, we can harness the power of its potential.\n\nOf course, like all things magical, the doors of this realm only open for the ones who believe, the ones who say \"yes.\" This is why mindset is all the rage in the self-help world. Opening the doors to a limitless version of you is simply a decision.\n\nAlthough dreams live in the formless realm, one would be foolish to believe that they are divorced from practicality. Where do innovations come from? By definition, the truly innovative does not come from the already accepted social norm. Where does artistic inspiration come from? An idea for a groundbreaking business plans? The courage to help an oppressed people? The creativity and belief required to solve a pressing problem like climate change? These are all born of the formless realm--the limitless world where your inner child lives, not in fear like our practical selves, but in wholeness.\n\nDreams must be protected like children, because, like children, they are ridiculed and forced to conform to the material world of  \"real adults.\" Some children are unable to protect their dreams so their dreams are battered, limbs strung apart. These children are so heartbroken that some think it's better to give up and become a \"real adult.\" After all, nearly everyone else is doing it.\n\nI’d like to clarify that being a “real adult,” a sheep, a follower, isn’t a bad thing. It’s merely a choice, just like happiness, freedom, and the courage to think for oneself. Likewise, even if you think you’ve lost yourself among the judgements of others, you haven’t. You can enter the world of quantum magic as soon as you decide to.\n\nLastly, a dream is not a distraction from taking action or the urgency of reality. It is merely the spark of believe that you can create your desired reality. It is the foundation upon which all purposeful action and strategy is built.\n\nThe choice is yours. Dreams can indeed help you pay your bills or, even better, inspire you to pay the bills doing something you love. If you want to be more thorough, creative, and little extra, create a passive income source and an automated system that not only pays your bills but also saves and grows your investments.\n\nYour life force is unlimited, and dreams are merely tools to help you expand your capacity in this lifetime. Once you remember that, mastering the world of form--where you are right now--is just another step to take toward the best you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/9f5rul/why_our_dreams_are_quantum_magic_and_the_answer/", "title": "Why Our Dreams Are Quantum Magic And The Answer To All Of Our Problems", "social_network": "reddit", "user": "neotenousmenace", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1536739172, "permalink": "/r/DecidingToBeBetter/comments/9f5rul/why_our_dreams_are_quantum_magic_and_the_answer/", "nsfw": false, "first_save": 1635436216.1127458, "replies_charged": false}