{"id": "t5_2tand_t3_g8a2ut", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "As the title says, I used to be super positive and cheery, and I was pretty deep into the self improvement mindset (daily meditating, going to the gym daily, eating healthy, positive affirmations, and reading great books self-improvement). This all changed after a pretty major traumatic event in the first 4 months of last year where my family and I were basically going to be homeless without much savings due to another family member who lived with us. Throughout the whole ordeal I felt the need to \"save\" my family and myself (even though I'm just a college student without a degree as of yet) became anxious and not \"myself\" and went down a path where I couldn't do anything without fear of catastrophic failure. My grades dropped that semester, I stopped going to the gym, felt insecure, the works. On top of that I was always repeating the same thoughts about the stuff that happened earlier in the year. I got better after changing many things in the summer and got back to the gym, got a 4.0 GPA in the fall (like I did before Spring 2019), made a lot of friends, and brought myself back for the most part (although the lingering fear of failure and rejection brought me down and made me too anxious to do some things that I wish I was more firm about).\n\nNow with the whole COVID pandemic I feel like I'm seeing a repeat of last year, I'm \"graduating\" college in the next month or two, and I feel the same feelings I did last year but at home which makes it better in a sense because I have time to work on myself in private. Motivation and hope are fleeting feelings that come and go, and I'm basically stuck on my computer either doing my homework or stressing about applying to jobs (had an amazing offer before COVID that was cancelled), how not to go homeless, how to make money, how to keep the side business I made up and running (software development), and other things.\n\nMy question is basically, how do I get out of this rut and stop living in fear? I know I'm not at my potential now because I've seen what I can do and who I actually am (prior to 2019), but it feels so far away at this point and all I feel like I can do is sit around and stress about it. The more I try to relax the more I start thinking about the things that I need to be doing with my life and how I'm behind (I'm only 20/21 so I know its not true) and panicking.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g8a2ut/used_to_be_super_positive_and_cheery_but_after_a/", "title": "Used to be super positive and cheery, but after a traumatic event last year I became anxious and not \"myself\". How do I get back to my ideal self?", "social_network": "reddit", "user": "jam23194", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1587885249, "permalink": "/r/DecidingToBeBetter/comments/g8a2ut/used_to_be_super_positive_and_cheery_but_after_a/", "nsfw": false, "first_save": 1635437222.1218483, "replies_charged": false}