{"id": "t5_2tand_t3_4cessx", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "Let me tell you about myself. I am middle aged, have a 20 year old son , who is incidentally doing well both academically and as a person. ( in the sense, he is not very mature, but exceedingly self confident. Perhaps he is a few years away from mental maturity)\nI am well educated, very knowledgeable and an artist ( play classical music ).\nI am a single parent (mom). Raised my child by myself. My mom helped me by just being there with me. My son and I both owe our good health to her and her awesome cooking.\nMy parents gave me good education. But they were very naive people and unknowingly did a lot of awful things. 1) they themselves trusted and believed a lot of people and lost a lot in life.\n2) they spoon fed their lack of self belief into me.\nNow diffidence is ingrained in me. I find it very difficult to appear confident. I believe , \"I appear as a person who is shady \".\nI have realized all this for the past 2/3 years. Taken a lot of corrective steps . But still a lot more to practice\nMy parents did a lot for me. But seldom conversed. Thus I never had or have a counselor or a confidant.\nI have started thinking and analyzing a lot nowadays. Reddit is a treasure i discovered through my son. ( I am from India).\nI am socially awkward and very shy. Perhaps this comes out as me as a shady person. But the thing is , I am not.\nPerhaps I had ADD in my childhood , which my parents failed to understand and take corrective measures. They were loving but , their punishments though not physical, was very emotionally abusive.\nToday , I with a string of degrees, have not found a lucrative career. I work in a junior college as a lecturer/teacher. I do not own a house. Perhaps never will. I have few luxuries or entertainment.\nMy work environment is this way. --- June to December- with students. Time is hectic and time spend with students is fun and productive. Jan - March-- Exams Corrections. Now I have to sit with other Aunty teachers. These people are postgraduates but only few of them have real knowledge. They come from conservative backgrounds and when I attempt something different, they see it as a wonder. Very frankly I do not value them greatly as individuals , barring a few. I feel they are just gossipy old aunties who inadvertently have a career.\nI feel very bad that I have not been able to achieve great things because of my lack of confidence. I am stuck up in this place because I have not got anything better.\nMy students,( I have a feeling ), most like my teaching and me as a person. But i do not know how to be strict. In this process, a few of my classes have been noisy.\nIn this process, some of my students have taken me for granted.\nIn my life too, people take me for a gullible person, but come in for a rude shock once I do not fall prey to any manipulations.\nI do not have any debts , am very hard working and I look after my mother and son.\nAfter a lot of redditing and TED TALking I have corrected my posture. Now I have got some relief. But this is not enough.\nPlease help me to appear strict. I do not want to be taken for granted by anyone, lest alone my students. How not to be taken for Granted?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/4cessx/how_to_be_strict_and_not_be_taken_for_granted/", "title": "How to be strict and not be taken for granted?", "social_network": "reddit", "user": "printmirror", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1459245884, "permalink": "/r/DecidingToBeBetter/comments/4cessx/how_to_be_strict_and_not_be_taken_for_granted/", "nsfw": false, "first_save": 1635436989.6531541, "replies_charged": false}