{"id": "t5_2tand_t3_fx4a3v", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "Real happiness does not depend upon an object or an event. But look at our happiness. Look at the kind of happiness we have. We say that we are happy because of something. Real happiness has no ‘because’. We say that our happiness is dependent on the presence of such and such person, or the happening of such and such event. We say that we will be happy when we get that result. So our happiness is a dependent happiness. Dependent on what? That result. When that result comes, then we will be happy. Otherwise we cannot be happy and till the time that result does not come, how will we be? Sad. Because if happiness is there in the result, then till the time the result is not there, we cannot be happy. Our happiness is a very-very dependent happiness. It is not self-sufficient. \n\nReal happiness, on the other hand, does not depend. It is totally internal to you. It is your own, intrinsic. Nobody can take it away, nobody can give it to you. But then look at the kind of happiness we have. We say that he gives me happiness, or a particular activity gives me happiness, say playing gives me happiness. This happiness is necessarily dependent on something else, and this happiness cannot be there till you are not sad. \nYou have to be sad to be happy. If your happiness is dependent on something, you have to be sad to be happy. Say, the result is about to be declared. You are greatly afraid that you may fail in a particular subject. \nAnd you are nervous and shivering. Now the result is declared, and you find that you have passed. So you are very happy. The intensity of your happiness is directly proportional to the intensity of your fear. The more afraid you are, the happier you will be. So to be happy you first have to be sad. When your happiness is dependent upon the result, then to be happy you first have to be sad. \n\nWhat kind of happiness is this? -1 + 1 = 0. \n\nFirst be sad, then be happy. What stupidity! You are sitting over here and your shoe is hurting. Your shoe is hurting and you are greatly stressed out. And then you go downstairs after this session and take-off your shoes, and you feel a great relief. This is what dependent happiness is. On the other hand, there is something called self-sufficient happiness, the name for that is Joy. It does not depend upon something. It is there. It is your intrinsic nature and that joy is nothing but watchfulness, a silent awareness.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fx4a3v/happiness_and_joy/", "title": "Happiness and Joy", "social_network": "reddit", "user": "AcharyaPrashant_", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1586342502, "permalink": "/r/DecidingToBeBetter/comments/fx4a3v/happiness_and_joy/", "nsfw": false, "first_save": 1635437316.2134047, "replies_charged": false}