{"id": "t5_2tand_t3_omspso", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "Our environment can beat our free will into submission when our minds are passive. If I go to my room without a purpose, I’ll find myself feeling lazy, getting distracted on my computer, or laying down browsing my phone. That’s the effect my room has on me, some people can easily study at home. However, when I know why I’m going to my room (perhaps to find something or have an assignment due and want to work), I can actively control the negative effects of this environment. Not that they’re objectively negative, but for the purposes of getting better and achieving my specific goals, they are harmful. For relaxation, recharging, and sleeping, they’re good. \n\n\nWhen my mind is focused, I receive the freedom to break out of my environment. It’s crucial to improving oneself to be aware of the effects our environment is having on us. Now when I want to focus and get work done, I leave home and sit at a café. Sure, I can risk the possibility of getting distracted at home and try to force my way out of it by actively charging my mind. Or I can reduce the effort required by simply going to a café. Many people there are studying or working, it’s hard to procrastinate, and to stop I’d have to go home. I’m already here, it’s easier to get work done.\nI would have never gotten there and made the necessary changes if I had not reflected on the effects my environment was having on me. \n\n\nOur environment can control us when we are not focused, but it can also make things easier. What can’t be avoided is the reflection needed to analyze yourself in your current environment. If you’re feeling lazy, it might not be because you are a lazy person, but because your environment makes you feel lazy. You can actively break this by charging your mind with thoughts of urgent action and take control against it, or you can go somewhere else where that energy is abundant. You can then spend your willpower on getting work done instead of fighting the desire to procrastinate. \n\n\nTake a moment and reflect; are you accomplishing what you set out to do today? If not, is it because of your environment or because your mind is passive (or both)? If your goal is to study, would you get more work done if you were surrounded by people studying? Is your mind actively thinking about studying, or was that a goal you thought about accomplishing in the morning, then forgot about? When the environment matches the active thoughts of your mind, it’s easier to enter a flow state and focus on whatever task is at hand. \n\n\nIt’s good to check in at times, through reflection, on how you’re feeling in your environment. Are you controlling your environment, or is it controlling you? It can only control you when you are mentally passive. As soon as you come to the realization that you’re being lazy, and you don’t want to do that, you can get up and enforce your will on the environment or slide back into passivity. Or you can leave and surround yourself with an environment where people are doing the same thing which makes it easier on yourself to feel the same way.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/omspso/a_slave_to_environment/", "title": "A Slave to Environment", "social_network": "reddit", "user": "MelkaThePhilosopher", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1626622260, "permalink": "/r/DecidingToBeBetter/comments/omspso/a_slave_to_environment/", "nsfw": false, "first_save": 1635438041.445364, "replies_charged": false}