{"id": "t5_2tand_t3_ovr67k", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "Hey guys! As I said before since I'm 24 and realizing that how quick time is going by that I'm not taking life to its full advantage, since for most of my life I was always going to school and then home, then graduated from high school and then I've been through some mental health stuff ever since that time.   \n\n\nI had to leave college and it took me a few years to get through my depression, anxiety and OCD with professional help, now I just got a new job (First one) and now I got paid earlier today and it made me feel good, but I've been thinking and since I'll be turning 25 in a few months from now, it makes me think where the hell did time go and at times I feel like I'm younger than 24 and realized I haven't taken full advantage of life and I have regrets from my teen years and adult years of not going to parties and having good times or never had a relationship before. \n\n\nDon't get me wrong, I'm happy that I'm doing so much better with my mental health, having a new job and gaining work experience which feels so good and most likely going back to college this fall. So  I'm on the right track. All I'm worried about is at times I have some regrets with my youth life. I just want to gain the life experience and living life to the fullest and to develop new hobbies and how do I develop new hobbies? As with dating, obviously I realize I need to work on myself and improving on myself on a day to day basis, but can I do to improve on myself and what can I do to develop social skills and building relationships with women in both friendship and dating? \n\n\nIn conclusion, I really want to live life to the fullest and to make the most of life, in every aspect whether is school, work, dating and hobbies, I guess I have to try new things and also learn how to invest money into the stock market, and to start traveling. I know it's a lot and It's going to take one day at a time for me but I just want to start living life to the fullest and enjoy my 20s, youth and the rest of my life. Thanks everyone!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ovr67k/hello_everyone_im_24m_ive_been_reflecting_of_my/", "title": "Hello everyone! I’m |24M| I’ve been reflecting of my life as of lately, and I noticed that I need to get out of my house more because at times I don’t take life to it’s advantage and I really want to change to gain all this life experience that I want to live.", "social_network": "reddit", "user": "kevmart96", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 31, "down_vote": 0, "creation": 1627820594, "permalink": "/r/DecidingToBeBetter/comments/ovr67k/hello_everyone_im_24m_ive_been_reflecting_of_my/", "nsfw": false, "first_save": 1635435120.3913739, "replies_charged": false}