{"id": "t5_2tand_t3_6zxa75", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "So today I did a bunch of small things that might seem small, inconsequential and insignificant, but for me it was > 0. Mind if I share?\n\n+ Touched up my CV, pinged some people on linkedin about possible openings, etc. \n\n+ Went to a mattress shop and tried a bunch of mattresses. I don't sleep well at night, and I suspect my mattress has something to do with it. Even though it's high quality and was rather pricey at the time, it might be too firm. At the end of the day, I truly believe a good night's sleep is one of the most important factors for productivity, happiness, etc. I couldn't find a mattress that was soft enough, but even that is some progress (I know where not to look and that I need to explore other options).\n\n+ Went shoe shopping. I need new shoes. Couldn't find ones I liked, but again, this is some progress by itself if you look at it a certain way.\n\n+ I took snapshots from a video of me giving a lecture, and added those to my tinder profile. I think they are very good pics. Will also be useful to whenever I open an OKC account.\n\n+ Printed a couple of articles I hope to read. Circling back to the sleep thing, I'm going to try to do the 'no screens before bed' thing. Hope it would work.\n\n+ Posted a question on reddit how I can make some side income from a spare bedroom I have.\n\n\nThere are a lot of challenges ahead. A lot. No promises tomorrow will be a >0 day, but at least I had today (nearly midnight in my time zone so...). Thank you for reading. :)\n\nTL;DR: Did stuff.\n\n\nEDIT 9/14: Thank you so much for the virtual embrace. I'm glad I posted.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/6zxa75/finally_had_a_nonzero_day/", "title": "Finally had a non-zero day", "social_network": "reddit", "user": "Optimesh", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 89, "down_vote": 0, "creation": 1505334205, "permalink": "/r/DecidingToBeBetter/comments/6zxa75/finally_had_a_nonzero_day/", "nsfw": false, "first_save": 1635438291.5011892, "replies_charged": false}