{"id": "t5_2tand_t3_mcuqf8", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "For a really long time I have had low self-esteem. It's tough, I know, but I am working on it.\n\nThe one thing I have suffered alot is the fact that I am unlovable. I can't seem to trust people. I feel like a burden sometimes. Early on, I let these emotions unconsciously control me, but after my breakup I am try to be aware of my emotions. And, oh boy, it's a mess.\n\nFor starters, in my previous relationship(first), I was an asshole. I couldn't seem to trust this person. I was so fucking insecure, it makes me want to throw up. I was a jealous, codependent, manipulative, possessive, insecure, low self-esteem, overthinking piece of shit, who feared abandonment. I used to snoop her text messages and always monitored her activities (who tf monitors spotify activity?!). I let my exes past bother me. I had sex with her once and then due to COVID, we were not able to meet. I got insecure about her past hookups and her previous exes. I was insecure about her male friends. I was insecure about how my social life/circle was smaller then hers. I was insecure about how her career was better than mine(she is a medical student). I literally put her on a pedestal. I couldn't trust her. I always was an anxious fuck. I hurt her alot btw. I used say things like, I am not that good and that she shouldn't have dated me and all, blah blah blah. Btw, these are my issues and I am not saying she didn't fuck up as well. In the later stages of our relationship, she kinda started to disrespect me and basically started ghosting me and did some bad things, too. Oh btw, I have same issues with my friends sometimes, where I think I am a burden on them. And that they'll leave me. \n\nNow the only thing I ask is that, I want to learn how to being able to trust people, especially romantic partners and women. How to not be a jealous fuck and realise the difference between platonic and romantic relationships. How to be a better person in general?\n\n\n**TL;DR : I want to learn how to trust my partner and people(especially, women) when they say that they love me. I want to learn not to worry about getting cheated on and live the life in present. Basically, I want to learn how to fight(or befriend, whatever) my inner demons of insecurity.**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mcuqf8/i_20m_want_to_learn_how_to_trust_people_who_love/", "title": "I [20M] want to learn how to trust people who love me and how to fight my inner demons.", "social_network": "reddit", "user": "GREYOMEGA24", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1616666602, "permalink": "/r/DecidingToBeBetter/comments/mcuqf8/i_20m_want_to_learn_how_to_trust_people_who_love/", "nsfw": false, "first_save": 1635435155.0211184, "replies_charged": false}