{"id": "t5_2tand_t3_pv736b", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "c6df14ee-195b-4e9d-8032-7cca73d46fe8", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "9065d046-0977-4ea5-b8e4-e37cd42605ed", "67ce7893-b918-4235-a31e-1de8eda5cfa6", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "These prompts might uncover some painful baggage you haven’t looked at in a while. If something really resonates, write a comment about it. Myself or other readers might have advice/books/podcasts that helped us with a similar problem. All of these are issues I’ve struggled with so I guarantee you are not alone.\n\n**Your Needs**\n\nWhen was the last time you asked for your needs to be met? When was the last time someone did something for you? How did it feel? How does it feel now that your needs are not being met? Would anything bad happen if you asked now? If something bad did happen, what would that tell you? Do you want to be involved with people or coworkers that don't care about your needs? If your needs are rejected isn't that a sign you should make changes in your life so your needs can be met? What would it feel like to have people that cared a lot about meeting your needs and did not resent you for asking? Is it worth a few uncomfortable conversations to change your environment and go find those people?\n\n**Your Happy Place**\n\nWhat kinds of things make you truly happy? When was the last time you did them? If you committed to doing one of those things over the next week no matter what, how could you make it happen? What is the worst case scenario of what would happen if you did that? Would anyone be seriously offended you took time for yourself? Would anything bad happen you couldn't fix? Would you be happy you made the time down the road? Could it maybe give you good perspective about how much these things mean to you, and help you prioritize better in the future?\n\n**Shower Arguments**\n\nWho do you argue with the most in your head? What do they say to you, and you to them? How much do these mental conversations resemble your real interactions with them? Do you imagine them saying awful things to you when they do it only infrequently in real life? Do your mental versions of them reflect who they really are or just how they made you feel at times in the past? How much good has come from these shower arguments? How much time have you spent focused on that instead of something more pleasant? Would you prefer to be thinking of pleasant things instead? Is it worth trying to learn skills like mindfulness so you can recognize these when they happen and choose other actions?\n\n**Comfort Zone**\n\nWhen was the last time you got outside your comfort zone? Have you found new experiences to be helpful in the past? Did they show you new things you enjoyed, or give you a new perspective? Did they help you bond with people you care about? Have those experiences gone well more often than they've gone poorly? What have you been meaning to try? What is the worst case scenario if you do?\n\n**Social Anxiety**\n\nWhat things would you like to do but you have social anxiety? What meetups or new experiences have you heard good things about but you're terrified of how people might judge you or be unkind? Have you done things even though you were socially anxious in the past? Did anything bad happen that you couldn't recover from? Even if you try something and it's awkward, does it cost you anything in a way you can't recover from? Have you tried these in the past and felt nervous but had significant benefits once you did it? If the cost is something you can recover from and it might have a big benefit, then why not try it out?\n\n**Rekindle Old Friendships**\n\nAre there people you use to get along with really well but haven't talked to recently? Would you like it if they reached out to you to catch up? What is the worst case scenario if you reached out to them? They would probably feel the same excitement if you took the initiative to reach out. It might be sad if they ghosted you how happy would you be to rekindle that friendship? Would that be easier than meeting brand new people? Do you think you can take 60 seconds to say you miss them and would like to catch up in person or over a call? Can you message 5 people? How awesome would it be to get even one “Yes!”?\n\n**Too Busy To Feel**\n\nHow do you feel when you don't have anything to work on or keep you busy? Is it pleasant? Do you feel frantic? Do you need to be busy and feel productive to be comfortable? Why do you have to feel productive to feel good about yourself?\n\n**Timesucks**\n\nIs there an activity that consistently eats up much of your time? Do you get anything out of it? How do you feel when you finish it?\n\n**Self Worth**\n\nWhere do you get your self worth from? Is it a job, attention from others, social media, a title, or some other external validation? How consistent and secure is that self worth? Are there times the rug gets pulled out and you feel awful? Are you able to see self worth in yourself outside of these external factors? Do you feel like you're good enough even without any of that validation?\n\nWhat about yourself can you not accept? What parts aren't good enough? Are they things that you think can be improved? Most are. But can you accept that this is where you are today, and that accepting where you are is the first step to taking steps forward? How would you feel if you were good enough? If you didn’t have to change anything about yourself to be ok? Learning to accept yourself will get you there.\n\n**Alone With Your Thoughts**\n\nHow do you feel when you're alone? When you're not checking off a to-do list. When you're just being present, alone with your thoughts. Is that scary? What uncontrollable thoughts come up? What activities do you usually reach for to distract yourself? What could you read, journal, discuss with a friend, or practice to make this introspection time less scary? Wouldn't it be nice to be able to enjoy sitting still, rather than distracting yourself constantly? \n\n**Monkey On Your Back**\n\nIs there something that's been distressing you or causing you pain for a long time? Can you get therapy or try a therapy book? Other people have tools that could help you break through this plateau.\n\n**Your Discontent**\n\nWhat changes do you think you need in your life to be happy? How many of those changes are not under your control? Can you continue like this knowing that when you feel happy is not up to you? Why are those things essential for your happiness? Is there a different path you haven't considered that could be fulfilling for you? One where you have more control over your own destiny?\n\n**Your Support System**\n\nDo you feel alone? Can you connect with others? Is there someone you could call right now who would answer the phone and listen? Even if you haven’t been vulnerable with each other in the past, would it feel good to get this out of your head a little? When was the last time you leaned on someone like this? How would it feel if they said they had gone through something really similar, and you knew you weren’t alone?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pv736b/83_questions_to_troubleshoot_your_life/", "title": "83 Questions To Troubleshoot Your Life", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 713, "down_vote": 0, "creation": 1632577676, "permalink": "/r/DecidingToBeBetter/comments/pv736b/83_questions_to_troubleshoot_your_life/", "nsfw": false, "first_save": 1635435948.4480224, "replies_charged": false}