{"id": "t5_2tand_t3_chqffc", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "These 2 things are the things im most worried about porn and texting girls online. Its like im trying really hard to impress women online so i can prove to my self that im \"alright\" and nothing is wrong with me.. \n\nBut in actuallity im boring/not cool/not funny/not likeable/not friendly/not charismatic/ not charming/not fun/not intelligent or smart, i think im very dumb im tottaly wasting my life on nonsense stuff...\n\nBut idk who i am, idk what i should be saying, idk what im supposed to say to people.. i treat everyone the same..\n\nIdk how to be interested in people and thats why i cant make friends.. i just stand inside home and say nothing.. i have nothing to say really.. so i have lost interested in making friends.\n\nMy dream is to become a football player for that i have to leave country.. but i dont even have a job. \n\nI try so hard to be valued/noticed and try to get attention from girls. Im really lost. And i bore the fuck out of girls that i talk to. Its always one sided chat. I always text first..\n\nI have tried my entire life to impress people but i get nothing, i just become the same old lonely loser who isnt important to anyone and no one cares about him or loves him.. \n\nI cant make any fucking friends man i aint close with anyone. I text girls and its always one sided convos.\n\nWhat do i need to do?\n\nIm reading 12 rules for life rn.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/chqffc/how_do_i_stop_being_a_loser_who_cant_talk_to/", "title": "How do i stop being a loser who cant talk to women and cant make friends? I think im not good enough for anyone. I hate my self and my family.. what do i do to make people like me?? Whats my biggest problem?", "social_network": "reddit", "user": "hamacule55", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1564074124, "permalink": "/r/DecidingToBeBetter/comments/chqffc/how_do_i_stop_being_a_loser_who_cant_talk_to/", "nsfw": false, "first_save": 1635435834.8369677, "replies_charged": false}