{"id": "t5_2tand_t3_pfqs03", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "Hi all,\nFirst post here! \n\nIve never been happy with my body, and have experienced disordered eating at various points in life. A few years ago I was at my lowest adult weight and somewhat slim because I was heavily depressed, unemployed, sleeping a lot, and barely eating. \n\nNow I’m in a much better state - full time employed in a fulfilling job, independent, happy in a relationship. I gained back a bunch of weight so I wasn’t “skinny” anymore, but I figured I wasn’t overweight and the weight gain was just a result of, you know, actually living my life, eating three meals a day due to my work schedule and energy needs, you know. \n\nBut of course COVID happened and we’ve had a lot of lockdowns. The combination of not getting out much and stress/boredom eating has meant I’ve gained a fair bit of weight over the past couple of years. I don’t own scales, but I’d say I’m definitely overweight now. I’ve had to start buying large/x-large size clothing and that made me feel very miserable, not to mention the fact that I’m probably heavier than my slim boyfriend. \n\nI started running five weeks ago, which I actually enjoy (that was huge bc I always hated exercise!), and attempting to cut down my eating, which I absolutely hate lmao. \n\nI’ve simultaneously been trying to eat less junk (cheese and chocolate are my big weaknesses), and reduce portion size. I try to still eat things I enjoy like pasta and rice, because a lot of normal low calorie meals just aren’t enjoyable for me, or too fussy to make. I let myself have coffee and Coke Zero because at least they’re low calorie treats. But it feels like maybe I’m not cutting back enough, because i don’t feel like I see any progress, even with the running. \n\nI keep seeing pictures of slender or muscular women on reddit and feeling depressed that I’ll never look like that unless I apparently remove all joy from my food. \nI get hungry easily and I love food, so the idea of cutting back or only eating salads is really disheartening. \n\nIt feels like a no win situation and I’m wondering what’s the point. I feel like I’ll be unhappy with my appearance no matter what - I have weird bone structure so I’ll never have a thigh gap or big hips even if I lost a ton of weight. I’ll never be pretty and waifish or fashionably curvy - I’m afraid if I even succeed in building muscle, I’ll just look like a rectangle. It’s so depressing. \n\nI think I just want some advice or encouragement while I’m having this low point. It just sucks worrying I’m not doing enough or that what I am doing is pointless/not making a difference.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pfqs03/feeling_torn_about_desire_to_look_better_and/", "title": "Feeling torn about desire to look better and desire to just enjoy life", "social_network": "reddit", "user": "exobiologickitten", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1630490698, "permalink": "/r/DecidingToBeBetter/comments/pfqs03/feeling_torn_about_desire_to_look_better_and/", "nsfw": false, "first_save": 1635436712.1315558, "replies_charged": false}