{"id": "t5_2tand_t3_q1rzrp", "request": ["c6df14ee-195b-4e9d-8032-7cca73d46fe8"], "text": "I have been addicted to porn mostly throughout my high-school years, which I believe led me to having no relationships whatsoever with other girls.  I am going to turn 21 this month and I started attempting no fap for almost a year now, but I keep on relapsing usually after 5 to 6 days. I don't want to be controlled by this addiction anymore, since the benefits of it I keep hearing of seem to be what I might just need, but I can't seem to go on for too long and I found someone who wants to hire me as a graphic designer. The issue is that I am still a beginner and I only know the basics of it and I really want to learn more. I have bought courses on Udemy to get better but I believe that masturbation plays a role in how much I avoid learning more. I usually learn about 1 hour per day, but I can do so much more but I am not motivated enough, but no-fap can help, but I have been failing it constantly. I try to stop my urges as much as I can but all it takes is one moment and I might lose control again. I am honestly tired of this habit but it is so imbedded in my brain that it makes it really hard to quit. I need some advice.\n\nAs a side note, I workout at least 3 times a week, but that doesn't solve everything. I noticed that getting busy with chores and such can be helpful, but when you're stuck at home because of the pandemic this is kind of rough. I really want to better myself but I don't feel like I am doing properly it if I can't hold in my urges to masturbate after just 5 to 6 days.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q1rzrp/been_attempting_nofap_for_almost_a_year_now_but_i/", "title": "Been attempting no-fap for almost a year now, but I would relapse after less than 10 days. I want to feel the benefits of it because I now have the necessary tools achieve a potentially good job (graphic designer)", "social_network": "reddit", "user": "KonQuerGate", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1633421737, "permalink": "/r/DecidingToBeBetter/comments/q1rzrp/been_attempting_nofap_for_almost_a_year_now_but_i/", "nsfw": false, "first_save": 1635436934.7298017, "replies_charged": false}