{"id": "t5_2tand_t3_l2by18", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "NSFW for drug use, really timid stuff, though.\n\nI used to smoke very occasionally, mostly with friends when I needed to get past social anxiety or manage some chronic pain. Since the pandemic, I've been a daily user, and have been smoking at increasingly inappropriate times. I've been noticing my memory being a lot worse (which is totally new for me) and I had a particularly scary moment where I realized that I totally spaced on major work project that I should have been working on.\n\nToday, I packed up my supplies in a safe container and took them to the trash. I'm a little scared about going cold turkey on this, but I clearly am not in the right place to handle it responsibly. I set up a therapy appointment to talk about my depression and anxiety, and hopefully look into meds that will help better than what I currently have. I'm really excited to start job hunting once I can pass a drug test again, and to be able to get through the day without craving more. Since I've come home I've only looked for my vape like 50 times, so that's progress I guess.\n\nEdit: Woah,I didn't expect the response to this! (69 comments, nice!) Thank you all, I'll have to wait a bit to read it all.\n\nEdit 2: Thank you all, especially for the support and the awards. Honestly, I kind of just wanted to put this out there to hold myself accountable. People seem worried about my situation with psych meds - so, I'm currently on antidepressants and antianxiety meds. They've helped make my life livable, but don't really make it enjoyable. I just want to discuss other options, once I level out from my weed use. \n\nFor people saying I'm over reacting to weed, I get where you're coming from, but you also don't know where I've been with this. We're talking about my lying to family and friends, risking my job, and using pot to solve everything from boredom to intense mental health problems. My relationship used to be pretty healthy, but right now it's not and it got pretty seriously ugly. I'm not here to judge anyone who uses, because for the right people it's a super helpful medicine. But, that's just not the case for me any more.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l2by18/threw_out_my_weed_scheduled_a_psych_appointment/", "title": "Threw out my weed, scheduled a psych appointment", "social_network": "reddit", "user": "ivolkswagen", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1646, "down_vote": 0, "creation": 1611275899, "permalink": "/r/DecidingToBeBetter/comments/l2by18/threw_out_my_weed_scheduled_a_psych_appointment/", "nsfw": true, "first_save": 1635435432.2022111, "replies_charged": false}