{"id": "t5_2tand_t3_px4li3", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Hi reddit, I am 24 years old and I have been feeling that my life is not going the way that I would like. I finished my degree a year ago and I was worried about my job so I decided to start looking for it seriously, I was trying several things and it worked recently I got my first job and although I do not earn enough to live alone, it is not bad.\n\nI believed that getting a job would be the solution to my discomfort since it would open a new chapter of my life but it has not been like that. Not because the work is bad, it really is something that entertains me. So I thought that maybe I should invest my free hours better and not spend them watching YouTube\n\nSo I began to learn English, study an opposition to have a better job in the future, I have started investing, I read books, I exercise frequently, I try to meet new people ...\n\nBut nothing has worked, I don't know why I feel like my life is extremely monotonous. I rarely feel happy and it is increasingly difficult for me to find motivation for things that before did not involve much effort or that I even enjoyed.\n\nI have thought about moving, going to live abroad (I am from Spain), traveling as I can with the money I have saved ... The typical things that one thinks when you need a change. But I'm not at all sure that this will help me live a fuller life.\n\nHave you ever felt like this? How have you managed to solve it?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/px4li3/i_need_a_change_in_my_life_but_i_dont_know_which/", "title": "I need a change in my life but I don't know which one", "social_network": "reddit", "user": "Algoro97", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1632829508, "permalink": "/r/DecidingToBeBetter/comments/px4li3/i_need_a_change_in_my_life_but_i_dont_know_which/", "nsfw": false, "first_save": 1635437985.2325585, "replies_charged": false}