{"id": "t5_2tand_t3_j24m9j", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "This same close friend just lost his dad to a sudden, powerful heart attack.\n\nI literally just got home from the funeral and I’m still reeling from this realization. \n\nI’ve always been an overall happy, optimistic guy. I like being happy, I like seeing the brighter side of things. And hand in hand with that, I’ve always felt that I’m very honest and open with my emotions. I know what I’m feeling and I don’t have any fear to face it.\n\nAfter the service I went to go talk to my friend, and we chatted for a bit. It was very very sudden and out of nowhere, so he was rightfully emotional, but when he hugged me goodbye he told me he loved me and it hit me like a brick wall. Not necessarily with overwhelming emotion but by shock at the fact that it was so hard for me to say it back.\n\nI really do love this guy like a brother, and it was shocking to say the least that I couldn’t just immediately let myself be open and vulnerable and say the words “I love you too.” Which, I did say, but the amount of effort it took was something that really scared me.\n\nI remember being able to tell people I loved them all the time a few years back. It wasn’t hard, and I meant it. I suspect this to be remnant from a horrible break up that really rocked my world. I truly thought I had reached a point of being at peace with what had happened with that, but it seems there are a few more things to overcome and work through.\n\nI hadn’t realized I’d had this emotional stunt in my life, and I thought I was the same old me for so much of this time. But this experience has put a lot of things in perspective and I’m excited to work back to being able to express myself again.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/j24m9j/today_a_close_friend_told_me_he_loved_me_and_it/", "title": "Today a close friend told me he loved me and it was a shocking wake up call", "social_network": "reddit", "user": "StarfishWizard", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1601402552, "permalink": "/r/DecidingToBeBetter/comments/j24m9j/today_a_close_friend_told_me_he_loved_me_and_it/", "nsfw": false, "first_save": 1635437616.7384768, "replies_charged": false}