{"id": "t5_2tand_t3_f71ccn", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "Based off a paper heavily studying the material, the conclusion states that:\n\n>There is some evidence that reading problem-focused self-help books tends to be helpful for people with specific problems. As yet there is no hard evidence for the effectiveness of reading growth-oriented books. This is a regrettable omission on the part of academic psychology. \n\n*Bergsma, A. Do self-help books help? Journal of Happiness. 9, 341–360 (2008).* *doi.org/10.1007/s10902-006-9041-2*\n\nSo for things like bipolar disease and anxiety, you might benefit by reading a book that addresses that specific problem. However, general feel-good books (Amazon's top 10 in the self-help category) probably won't do you any good. \n\nBack to the study:\n\n>If this interpretation is correct, we can speculate that the quality of the advice offered in self-help books may be less important than the quality of the reader. **It is the reader that decides to drop the options that do not enhance satisfaction and keep on track if some advice seems to work out fine.** If a self-help therapy works we should first congratulate the ‘client’ not the ‘therapist’. \n\nSo it isn't about finding the best books, it's about the person who actually takes action and applies the advice that works for him/her. **It's about the reader who is smart enough to think for themselves and not cling to some neat sounding self-help ideas.** That's no different than those who held on to communist and fascist ideas despite when finding evidence to the contrary. And we all know what happened to them.\n\nSo who are you?\n\nAre you going to waste time reading \\*entire\\* books to get more generic self-help ideas or are you going to start thinking for yourself and pick out and \\*do\\* the ones that work for you? Have faith in yourself and your own intelligence.\n\nBack to the study one last time (you libertarians out there will like this):\n\n>**In self-help the role of the reader is even more important.** Maybe the self-help books function in a way that is similar to travel guides. Most readers will not follow the book page by page, but will study parts of the book \\[...\\] to enhance the freedom of choice in an individualistic society. The books show options for thinking and acting from the psychological toolkit of the individual that are underdeveloped or could be used more often. Perhaps we may trust the readers to use the advice as long as it helps for them. This optimism is greatly enhanced by the fact that individuals flourish more in individualistic and free societies (see for reviews Veenhoven, 1998, 1999). **Most individuals are apparently \\[more than capable\\] to choose options in life that work for them.**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/f71ccn/what_does_the_science_say_about_selfhelp/", "title": "What does the science say about self-help?", "social_network": "reddit", "user": "Upper-Illustrator", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1582239038, "permalink": "/r/DecidingToBeBetter/comments/f71ccn/what_does_the_science_say_about_selfhelp/", "nsfw": false, "first_save": 1635436553.2031877, "replies_charged": false}