{"id": "t5_2tand_t3_pzz1tk", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "Well, I'm 26 and have had a bad year of slacking. I was pretty fit at the beginning of the year, my job is pretty physical and I was snowboarding pretty often until I had a knee injury that took me out for the season. Lots of physio later, I managed to get one last ride in before my seasonal contract ended.\n\nMy gf and I have spent most of the year waiting for covid restrictions to settle a bit in her home country so we could travel. After our contracts ended, we put most of our stuff in storage and moved halfway across the country to live with my mum. We weren't sure if the borders would open in a few weeks or a few months. It turned into the latter. We didn't get work in my mum's city because we couldn't commit to something. Cue, four months without a job and I spent most of that time being a lazy slug. All I did was smoke weed and fuck around. My gf did some gardening so she had some source of activity. \n\nAnyway, we're in her home country now and all I do is eat. I'd say I've gained about 15 pounds this year. I quit smoking cigarettes last December and have noticed that my appetite has come in super strong. I was always pretty slender, but not anymore. I know it comes with the post 25 y.o. territory, but damn. I feel terrible in my body and I'm tired of it.\n\nYesterday my gf's dad explained to us how to properly brush our teeth (he's a retired dentist). And you know what? It's amazing what a difference it makes. My teeth feel cleaner, they look considerably whiter already. So that's one habit I'm adding to my daily life. Being more conscious of my oral health. Today I flossed for the first time in a couple weeks. I'm going to start flossing everyday before I go to bed. I know it's simple, but it's something I've neglected. I really dislike going to the dentist due to some bad experiences, so I'm starting the process to make their job easier and less dramatic for me. \n\nI'm also making my bed in the morning. Again, it's simple, but it really does make a difference in how I perceive the room and start of my day. \n\nLastly, doing two exercises that I can do anywhere. Glute bridges and wall raises. I found an awesome youtuber whose content I enjoy and he shows easy calisthenic exercises with progressions. He has a video on building posture and I'm starting with two exercises. No equipment needed, just a wall and a floor. Once in the morning and once at night. \n\nI love being active and seeing what my body can do. I used to rock climb weekly and was really strong a couple years ago. I've slipped into lethargy since I stopped working and it's terrible for my health. Physically, mentally, and emotionally. I know I need to take care of my body, especially with the long list of injuries I've accumulated. It's the only body I have, and I know I'm not that old. But it's to prevent being in a walker in my 60s. It's to prevent losing my teeth in the following decades of my life. It's to prevent depression that I've fought off in the past. I might not be the fun partier I was in my late teens and early 20s, but I'm stable now. These are only 3 habits to start with. I'm ready to be a better person now and not push it off until later. Because later goes from next week to next month to next year and that's wasted time. I'm not going to wallow in pity that I wasted a good portion of 2021, I'm going to use this as a baseline for a better future.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pzz1tk/im_adding_a_couple_of_habits_to_start_being_better/", "title": "I'm adding a couple of habits to start being better", "social_network": "reddit", "user": "Subject37", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1633194181, "permalink": "/r/DecidingToBeBetter/comments/pzz1tk/im_adding_a_couple_of_habits_to_start_being_better/", "nsfw": false, "first_save": 1635436292.5931518, "replies_charged": false}