{"id": "t5_2tand_t3_ouhddl", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "My anxiety and low self-esteem reached its worst during my PhD (in a STEM field) in UK, where I realised I was just a money making machine for the University and no one really cared for my work. I finished my PhD, and then pursued a post-doctorate hoping if I produced an applicable research that people could use, then I'll be valued. Nope. The only upside was, I was now able to make rent and essentials through the post-doc salary (as opposed to the PhD times).\n\nI questioned what all of this was for. All my work, my time, was hoping to get recognition that I was good at something. Monetary recognition being one of them. At the end of my post-doc, with multiple publications in good journals, all I had was an opportunity to do another 1.5 year post-doc with an annual salary which was £7000 less than than my previous position.\n\nScrew it. I was out of academia. Have just joined the industry and am pissed off, because I didn't research enough before getting into the University. I jumped on an opportunity of PhD, because that's what the \"brilliant\" people did. Because I assumed my supervisor had my best interests in his mind. All lies. Supervisor couldn't care less about my work, he was only in it so he gets free-labour for his spin-out company, and how to make a sellable product. University only cared about if I was paying them their fees. It's all about money!!\n\nI now realise its all about money. Doesn't matter how 'great' my research is, if I don't make money for someone, no one cares. I'm going to try my best to never let myself be in a position where I am almost begging to make rent. Never again. Academia, I'm sure is great for some people, but for me, it was not what it markets itself as...a place of knowledge. BS. If the knowledge is not profitable, no one cares.\n\nIf money is what works, then I'm going for it. Screw \"working for the good of humanity\". I had a plush job earlier, which I left for my PhD, thinking I was going to make a \"difference\", I'm going to go and make my services useful to someone who wants to compensate properly. Who shows appreciation beyond just saying, \"oh that's nice, how can we sell this?\". I don't want to check my bank balance everytime I'm out with my friends, to see how much buying that dinner would set me back by. My skills are valued in the industry. I'm sticking to the industry. For all the promises the University made about establishing me as an \"expert\" in the field, all I got was huge debt and mental illness. It's not worth it. I'm worth more.\n\nI'm taking charge of my own life now, money, health (physical and mental) and time.\n\nThanks for reading my rant. I apologise in advance if I offended anyone in academia.\n\n&#x200B;\n\nEDIT: I got my first ever Award on this post, after yearss of being on Reddit. Thank you kind stranger! You've made my day", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ouhddl/i_will_improve_my_anxiety_and_low_selfesteem/", "title": "I will improve my anxiety and low self-esteem, coming out of academia, and going for money", "social_network": "reddit", "user": "DragonWarrior008", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 24, "down_vote": 0, "creation": 1627637424, "permalink": "/r/DecidingToBeBetter/comments/ouhddl/i_will_improve_my_anxiety_and_low_selfesteem/", "nsfw": false, "first_save": 1635435091.7355685, "replies_charged": false}