{"id": "t5_2tand_t3_og9dlx", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": " ***We*** *all have big goals.*\n\nMonumental goals. We dream big. Imagination has no bounds. But our time has limits.\n\nOur creative mind does not take into consideration that we are indeed mortal beings on this blue planet and at any moment, our time could be up. After we dream our dreams and set our goals, the logical mind takes over and goes into panic mode. There is simply too much to be achieved in too short a time. To add to that, sometimes, each goal is completely different than the other. So there is no way to logically combine them. There is way too less time during the day to tackle all these goals.\n\nSo the logical mind gets into a state that is similar to what writers face from time to time — A writer’s block. It just gives up and silently drifts into the background leaving the steering wheel unattended. In comes the Creative mind thinking of ways to now spend all the free time that is ahead, now that there is no logical way to spend it.\n\nCreative mind has no accountability tagged to it as that is the job of the Logical mind. So without anything to do, Creative mind works to think about ways to have fun. Watching YouTube videos, browsing Facebook posts, catching up on news, going into Wikipedia adventure.. the list is limitless.\n\nFor the person who is undergoing this phase, this fun is not your pure innocent fun but one that is accompanied with a nagging guilt that this fun moment was not earned. This guilt is bought on by the thoughts of the Logical mind looming in the background observing the Creative mind at the steering wheel.\n\n# How do we avoid this? Stop dreaming up big lofty goals? Put yourself down telling yourself that you are incapable of achieving anything? On the contrary.\n\nEvery human being has the potential and the capability to achieve what they set out to do. The only reason why there are only few who actually achieve their goals is because they approach their goals and their day differently when compared to those who only dream.\n\nOne important differentiator in this approach is that they plan their day and schedule goal achieving tasks into their day. This is Carpe diem at its practical best.\n\nMany of us are able to visualise goals, break these goals into achievable tasks. What is needed next is that extra push to get started and complete the first task. Once that is done, to get an additional push to take on the second task and complete it. One cannot rely on inspiration and motivation alone to drive us to complete all tasks until a goal is achieved. We need a better way, a more feasible approach. And that approach is Day Scheduling.\n\nWe are much more likely to work on a task if it is planned in our day calendar or agenda. When was the last time you missed out on a meeting that was planned either at work or with friends. Once something is planned in our agenda and we make a note of it in either our calendar or phone, we are more than likely to stick to it.\n\nHow do we implement this?\n\nBreak down your goals into manageable and logical chunks or tasks  \nEstimate how much time it would take to complete these tasks  \nIf it is difficult to put a time estimate, try a different approach and time-box that task. For example, if you want to read a book but you are unable to split it into a chapter per day, split it into tasks that are time-boxed for half an hour per day.  \nNow that we have a good idea of the time needed for each of the tasks, pick up your Agenda(your diary or the Calendar on your phone) and block time or schedule the tasks throughout the day\n\nMake sure to leave time for relaxation and fun activities between tasks  \nThe best time to do Day Scheduling is the previous day before you go to sleep. So your sub-conscious mind is aware that you have a purpose for the next day and that gives you the additional push to get out of the bed when the alarm goes off.\n\nKeep in mind that you may not be able to accomplish all that you planned for the day. Life happens and some unplanned tasks come up throughout the day. But you can be rest assured that you are moving in the right direction.  \nYou may not complete the marathon but hey, you are at least taking baby steps and not just lying down on the couch.\n\n# Seize the day! Carpe Diem!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/og9dlx/day_scheduling_how_to_seize_the_day/", "title": "Day Scheduling - How to seize the day", "social_network": "reddit", "user": "Lonecfawolf", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1625757611, "permalink": "/r/DecidingToBeBetter/comments/og9dlx/day_scheduling_how_to_seize_the_day/", "nsfw": false, "first_save": 1635438038.667907, "replies_charged": false}