{"id": "t5_2tand_t3_dcq3pb", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "In the past I never understand the concept of balance. I was always extremely up or extremely down. I was always go big or go home. While that might seem that they level each other out, they don’t, at all. I’d jump from one extreme to the other in hopes that eventually I would reach some sort of middle ground between them. I never did with this approach. \n\nLast year, starting in August of 2018, I started a “no-social media” 30 day challenge. It was easy for me after a few days to see how much benefit came from it. Time and space opened up for other things. That lasted for over two months. October 1, 2018 I started whole 30. Midway into October I started meditating everyday. December, I started juicing celery juice everyday, and then the holidays came and all those challenges kind of fell off. Life started to get tougher. My dad died in May of 2019. I realized that we can’t plan or adhere to everything so strictly. It took a while for me to understand that balance isn’t doing a bunch of challenges months in a row. Life happens. Things come up and distractions occur. But that doesn’t mean I have to give up everything. \n\nSlowly but surely, I started incorporating daily celery juice back into my life. I’m on day 26 of meditating but not because of a challenge. I eat a healthy balanced diet and don’t think about food obsessively. I have been doing a book with exercises on love. I’m doing these things because I WANT to do them FOR ME. It took a little time to get in the rhythm and incorporate them into daily rituals but I can say I’m happier now than ever and I know they are part of the reason. I’ve been waking up every day before 6 am naturally before my alarm which has never happened to me. I’m a 25+ snoozer kind of gal, or at least I used to be. I’m not anxious at work anymore, something I used to dread. Life is going well and I know it’s because I’m putting in the work but the biggest thing is I am not putting in the pressure. \n\nWhen I did all the challenges it was something I demanded of myself. It was as if I couldn’t do it unless there was a challenge. Now, I’m just doing things because I feel like doing them. I know meditation gives me space but if I miss a day, I can do it the next day and it’s not something to beat myself up over. I remember when I ruined my 130 day streak of meditating and it was like the world ended. I was SO upset. And then I stopped for a few months. I signed up for amazon fresh to ensure I would have celery juice daily and when they were out I would be a complete wreck, “but I have to do it” and now I just simply go to the natural market by walking 10 minutes and get what they have when I want it. This book I am doing has morning and evening exercises, I’ve missed a few and just picked up the next day where I missed it. I eat sweets when I feel like it and I have a beer if I want one.  Naturally, I want them less now and go off of how I feel rather than following a strict regime that doesn’t allow for it. \n\nBalance is something I never had in my entire life but I’m getting glimpses into it everyday now. It’s peaceful. It’s loving. It’s doing things because I love myself and want to grow instead of because i hate myself and need to change. There’s a huge difference between the two and it becomes more apparent everyday. \n\nYou don’t have to force things to make them work. It’s just about finding balance. And I’m extremely grateful I’m finally figuring out what that means, at this point in time. \n\nSending you all love and peace and balancing energy. I hope you have a beautiful day.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dcq3pb/balance_is_extremely_important_for_a_healthy/", "title": "Balance is extremely important for a healthy lifestyle and I feel like I finally understand what it means", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 53, "down_vote": 0, "creation": 1570105232, "permalink": "/r/DecidingToBeBetter/comments/dcq3pb/balance_is_extremely_important_for_a_healthy/", "nsfw": false, "first_save": 1635435268.6315875, "replies_charged": false}