{"id": "t5_2tand_t3_bspnbj", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290"], "text": "My co-worker and one of my best friends from college go to the same fitness classes after work every day. When I found out I told  them to introduce themselves to each other one day. So they did and they started talking here and there. \n\nLast year, my co-worker, who sits literally 6 feet away from me all day, said that my friend from college - let's call her Sarah - asked my co-worker if I was weird. \n\nMy co-worker responded no. Then, Sarah kept pressing. She said \"are you sure, I mean he's just so weird with his jokes and stuff like isn't that hard to work with?\" I do joke around a lot. But my co-worker defended me and said that no, I wasn't hard to work with and that I'm not weird. Then my co-worker told me about the interaction and I was really upset about it. \n\nThis whole thing just came out of nowhere. I mean Sarah has always been a great friend of mine and I was really surprised that she felt this way about me. I called her up and told her that I heard she was talking junk (to put it lightly) and I  told her that I can't consider her a good friend if that's how she feels about me and we cut off ties. \n\nUnfortunately, but also fortunately, she dates a good friend of mine. So it was kind of hard to avoid her and we ended up talking it out and making up. We slowly rebuilt our trust in each other and life moved on. \n\nToday, we went to her boyfriends graduation and on the car ride up she told me that when she first started her job she overheard her boss complaining that the new girl was \"weird and hard to work with\" and that as a recent grad she was just super intimidated and frightened by that comment. She said it completely shut down her excitement about the future and it took a while to get over. \n\nShe was hired last year, about the same time she called me weird and hard to work with. Since \"weird and hard to work with\" is a very distinct insult I thought maybe her experience at work influenced her insult towards me. So I asked her straight up. I said ... do you think you called me weird because you were projecting your insecurities from work? After some hesitation she said yeah.\n\nIt really made me think. It almost made me feel bad for being angry with her in the first place. If I had known that it was just a projection of her trying to overcome one of her own insecurities I would have has empathy. \n\nWe've all been there. I thought about the times that I criticize others behind their backs and it's painful to admit but a lot of the time I am usually criticizing someone for having a trait or skill that I'm envious of, or having a better career than me or better goals than me. I'm like 90% more likely to find fault in people I'm jealous of lol. I think thats true for a lot of us. \n\nSo after this debacle with my co-worker and a good friend, I've decided to try and tease apart people's true intentions in their commentary rather than just internalizing at face value. And I've also decided to start checking myself more; making sure that what I say and how I behave is genuine and not just an emotional reaction.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bspnbj/had_a_realization_today_on_how_to_deal_with/", "title": "Had a realization today on how to deal with criticism", "social_network": "reddit", "user": "jokingonyou", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 283, "down_vote": 0, "creation": 1558752032, "permalink": "/r/DecidingToBeBetter/comments/bspnbj/had_a_realization_today_on_how_to_deal_with/", "nsfw": false, "first_save": 1635436648.7661242, "replies_charged": false}