{"id": "t5_2tand_t3_lkgteq", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Hello,\n\nI'm not doing great at the moment so I might sound more dramatic than I should be.\n\nBut here is the situation..I just broke up with my 2 years girlfriend, my best friend told me I've been a pain in the ass this last year, I've a job I don't like where I put energies that I don't have, there's a pandemic and it's winter time, and I live alone.\n\nThe good things in my life are my will to change, my dog, maybe living alone is not so bad, and I'm soon gonna get a camper van which has been a lifelong dream of mine.\n\nLooking back, I don't know whether I was the cause of everything bad, or if things just got not matching with the person I am anymore (my girlfriend was great at the beginning, my friendship were fulfilling me up to a certain point, but still nothing is perfect..).\n\nI feel guilty that everything is going down this direction, but might also be that it's a moment to go through the pain and realize that I might just need to open a new chapter of my life.\n\nBut things have to change, drastically, and I don't know where to start.\n\nI just started therapy, so that's a plus, but I'd like to get further help either from the Reddit community, or from resources, or activities, that might do me good and help me find clarity.\n\nHave you felt in this situation before, and did you get out of it? I know \"time will give you the answers\" or \"hold tight and things will change\" but also, what can I actively look into or do, so to help myself?   \nWhat was for you that, now looking back, discovered that had to change? What helped you in changing yourself while in these moments?\n\n&#x200B;\n\nThanks, and sorry for the kinda whining post, but yeah shit hit the fan right now.  \n\n\nCheers!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lkgteq/i_think_i_have_to_flip_my_life_maybe/", "title": "I think I have to flip my life maybe", "social_network": "reddit", "user": "mircofragomena", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1613405680, "permalink": "/r/DecidingToBeBetter/comments/lkgteq/i_think_i_have_to_flip_my_life_maybe/", "nsfw": false, "first_save": 1635435909.3016136, "replies_charged": false}