{"id": "t5_2tand_t3_omp6nm", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "Hi everyone,\n\nFirst a bit of a background: last year I graduated around June. From June to July I did some student work at the same start up I did my internship at. \n\nAround mid July I started to look for work, almost none stop except for 1 week of vacation in August. I managed to finally get a job around September (as a junior digital marketing consultant) in which I had to learn a lot of new things relatively quick to keep the job and be useful. The only things I knew were some bqsic digital marketing concepts because it didn't get a lot lf attention in my marketing bachelor. \n\nThis jib unfortunately ended this year in February due to C. In this period I had a bit of vacation from 25th of December to 3th of January.\n\nFrom February to around the end of April I was looking for a new job which I found in the beginning of May. I managed to convince them by telling them that I like to learn (which I really do) and they said that this convinced them to give me the job. They agreed to give me time to learn our CMS and some coding needed for my digital marketing job. \n\nSince then I was able to learn some things and show that I indeed have some things to offer to them aside from my limited experience.\n\nHere comes the problem: I have a hard time learning new information about our CMS etc. It feels like I'm easily tired and distracted. This worries me cause I want to study and learn new things so that I can grow and keep my job. But I fear that I have maybe pushed myself to hard the past year and that I pay the price for it. \n\nAny advice on getting back in the saddle?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/omp6nm/getting_going_again/", "title": "Getting going again", "social_network": "reddit", "user": "nickvandrepol", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1626609485, "permalink": "/r/DecidingToBeBetter/comments/omp6nm/getting_going_again/", "nsfw": false, "first_save": 1635436461.0439754, "replies_charged": false}