{"id": "t5_2tand_t3_fnhfji", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "Since we are all staying at home, and especially for those who can't work too much right now, you might be feeling a bit bored. But chances are, there are also a few things that you have been putting off doing! Life usually gets in the way, so this is your chance. You will definitely cross off quite a bit from your list, if you want to try this challenge. The only key moment is the planning!\n&nbsp;\n\nI made a video documenting my experience if you are interested: [https://youtu.be/LMC86infe3M](https://youtu.be/LMC86infe3M)\n\nFor those who prefer a few highlights and takeaways I summarized them below!\n\nSo I ended up doing pretty much all the things I had planned to do, but I can't say that it happened smoothly. Here was my rough strategy:\n\n1. Plan the whole week\n2. Plan time for partner / mom / important people in your life (call them, chat?)\n3. Plan some topic days e.g. learning day or editing day (don't mix too much!)\n\nMake some rough notes in your Google Calendar / To-Do app or a piece of paper with things you would like to do on each day. When the day comes, take those rough things, say \"get some gardening done\" and break them down into actions like \"replant plants\", \"put fertilizer in soil\" etc. Then start crossing things off.\n&nbsp;\n\nDraw a line under those essential things you wanted to do and write down a few things that would be beneficial in general like \"do yoga\", \"meditate\" or \"journal\" so you can do them if you have any free time. Don't  try to plan the whole week ahead, that was my first mistake.\n&nbsp;\n\nClearly not procrastinating at all doesn't mean all you do is work.. so I had a really bad fallout by day three. And then I had to reconsider a few things. The things that I realized were:\n\n+ When friends randomly wrote me or wanted to call for something, it was stressful, because I didn't plan it. All kinds of unplanned things happen all the time, so leave some buffer for that so you don't feel bad for not having time.\n\n&nbsp;\n+ I didn't plan enough fun activities. I realized even if you are very crammed for time you should always plan fun activities otherwise you won't last long. Minds need to be shut off too, so plan for fun!\n\n&nbsp;\n+ Nature time is super important for your general well-being. At least go to your window or your balcony and sit there for a couple of minutes, take some cleansing breaths, maybe even leave the window open so your air quality improves!\n\n&nbsp;\n+ Planning is important if you want to do a lot without getting stressed. I use Microsoft todo's and Coogle calendar to make brain dumps in the morning. Make sure you get it all out of your system before you start, then - execute.\n\n&nbsp;\n+ Plans should be liquid because things happen and if something isn't appealing to you now e.g cooking, but you're not hungry, then you should be free to push it back.\n\n&nbsp;\n+ If you don't feel like doing something on your plan, try it for one minute or for 5 minutes. Maybe you will get into it, maybe you will still feel that way, but more often than not you will end up getting things done! If it doesn't work just forgive yourself and leave it for later. (See previous tip)\n\nAnd that's what I learned from a week of intense stuff-doing and I will continue doing this for the future for sure but with some more leisure time, because life is about the fun too! I hope that helps someone else!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fnhfji/a_week_before_the_lockdowns_began_i_did_a_one/", "title": "A week before the lockdowns began I did a one week no procrastination challenge: no distractions, no phone, no TV, nothing unplanned. Now might be the best time for you to try it too! It's a great way of catching up on a lot of work in a short amount of time. Here's my method and takeaways.", "social_network": "reddit", "user": "Mindfuldesigns", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 443, "down_vote": 0, "creation": 1584957538, "permalink": "/r/DecidingToBeBetter/comments/fnhfji/a_week_before_the_lockdowns_began_i_did_a_one/", "nsfw": false, "first_save": 1635435478.4930062, "replies_charged": false}