{"id": "t5_2tand_t3_htt0si", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1"], "text": "I will try and keep this brief, but I am happy to PM anybody in greater length if they are going through something similar. \n\nI wanted to share the fantastic news that I am no longer physically dependent on benzodiazepines. I have gone from taking 40mg a day last year to nothing, and I feel excellent. \n\nI started taking them for fun in 2015, and continued to do so until mid 2016 when my friend had two seizures two weeks after taking an incredibly high dosage during a party. I didn't take any until late 2017, when I used them to escape my anxiety as a result of a mentally abusive relationship.\n\nI started self medicating with benzos (not prescribed) which enabled me to be normal in social situations after having my self-confidence crushed, my trust in people perish and my belief I deserve better destroyed. \n\nThey worked. Too well.\n\nLate 2017 to early 2020, I managed to reduce my daily consumption from 40mg a day to 10mg. Lockdown provided me with the opportunity to eliminate social interaction, reducing the need to take the benzos for social anxiety and the chance to regain independence from those blue circles. \n\nI have all the typical withdrawal symptoms: shakes, nerves, headaches, body aches, anxiety disturbed sleep etc. But I was in a controlled environment, home. I didn't have the temptation of taking a pill to resolve my issues because I know if I had a panic attack, an embarrassing incident or an awkward social situation during my working hours, I could sit in a room alone in silence for 10 minutes to calm down.\n\nI now feel normal. I used to be jealous of people who could function in life without taking a pill: the idea seemed foreign and distant to me. Now it doesn't, and I am happy.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/htt0si/i_got_out_of_my_benzo_addiction_during_lockdown/", "title": "I got out of my benzo addiction during lockdown, and I am so happy.", "social_network": "reddit", "user": "worldmapofmybrain", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2031, "down_vote": 0, "creation": 1595125548, "permalink": "/r/DecidingToBeBetter/comments/htt0si/i_got_out_of_my_benzo_addiction_during_lockdown/", "nsfw": false, "first_save": 1635436185.284551, "replies_charged": false}