{"id": "t5_2tand_t3_fqlgpy", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "     Waking up hasn’t always been easy. I haven’t always lived up to the morals bestowed upon me by society, and for a time, I never questioned those morals. The world, and perhaps more broadly, life itself, seemed so cut and dry, yet I seemed incapable of coloring within the proverbial lines. I know with much certainty exactly what happiness isn’t and the question I now find myself attempting to answer isn’t even the obvious converse. I don’t ask “What is happiness?” because I know quite well what it looks like and where it dwells. Often, happiness and I spend a great deal of time with each other. The question I posit is as such: “What exactly does it mean to live a meaningful life?”\n\n     I was raised Episcopalian, or “Catholic Light,” as my mother would often joke. As such, the standard Judeo-Christian set of morals were heavy influences during my upbringing. I wasn’t to lie, cheat, steal, or violate any of the ten commandments; Lest I receive punishment here on Earth, and quite probably in the afterlife as well. One can imagine the fear Hell might instill in a child and other than what could be considered bad days, I was by most accounts a good and morally upright kid. In hindsight, a good lesson I have learned is that everything is always changing.\n\n     Somewhere between the bodily changes associated with growing up and the kinds of changes from which reality asserts itself, I began to question my religion, my morals, who I was, why I was here, and nearly every other existential question ad nauseam. Seeing myself as a smart person yet struggling to merely figure out who I was and what I stood for rocked me to my core. For such a long time in my life, there was this two lane, one way highway that consisted of school and religion, and so long as you stayed facing forward, the side streets, interstates, and dirt roads were just scenery. Somehow, and for reasons still unknown, I careened off of this highway and drove until I was no longer sure if I was even on a road or just parked in a field somewhere. \n\n     I had my first drink and my first smoke when I was 12 years old, turned to other drugs around 15 years of age, and by the time I was a freshman in college, I could party circles around the seniors. Despite all of this, I managed to keep a decent grade point average, a girlfriend, and a job. For a while, at least. For a while, I had a plan to finish school and become a pilot. I had dreams of marrying my girlfriend, exploring the world, and eventually settling down with kids. I had things figured out and I knew how to have fun while I was accomplishing things. Or, so I thought.\n\n     The problem I came to know was simple. My moral compass had either been broken or simply ignored. Likely, it was the latter. I feel as if I have always known right from wrong. At first, it was because Moses had the writing of God carved into stone, objectively telling me what was OK and what wasn’t, and I accepted that. But as a person experiences life, we learn about the sheer complexity of reality and truth. We may not grasp the entirety of the situation, but we can gaze upon its paradoxes and convolutions and resolve that perhaps right and wrong are not simply binary. Still, I knew right from wrong. I suspect we all do. I also suspect that from time to time, we choose “wrong” on purpose. \n\n     Perhaps we experiment with life. Maybe we’re bored. For some reason though, I made a lot of the “wrong” choices, almost as if I felt consequences just wouldn't apply to me. I failed some classes, cheated on my girlfriend, and did many things of which I am certainly not proud. I came to believe I had ruined my young life. I became depressed. Depressed and anxious thinking pushed me towards more bad decisions which lead to more anxious and depressed thoughts and a spiral formed which lasted just long enough to scare the shit out of me. At some point I realized I needed help and sought therapy. \n\n     Here, the seeds of meaning were planted in my thoughts. With the help of a professional, I could ask myself the right questions, rather than suffer the onslaught of interesting but irrelevant existential questions I had previously been asking. I was encouraged to exercise, meditate, and read other philosophies and took an interest in Buddhism before finding a form of comfort in the Tao Te Ching. Not only had I started paying attention to my moral compass, I had begun to recalibrate it. \n\n     What I found from this point was, for me, quite profound. While I had been trying to figure out who I was, I would essentially pretend to be other people. Around one group, I was the cool party guy. Around another group, I was quiet, smart, and reserved. Around my girlfriend, I was the perfect boyfriend. Around single women, I was a ladies man. Around my family, I was the morally upright Christian I was raised to be. I was all of these things to all of these people, and it worked beautifully. Beautifully that is, until these groups of people would meet and my corresponding personalities became glaringly incongruent. I simply couldn’t see that while I was searching for myself, I was none of the things that I was pretending to be. I was simply someone who was searching for himself. Without seeing myself for who I was, I couldn’t accept myself for who I was. I felt I needed to find myself before I could accept myself. \n\n     To me, a lot of meaning in life can be squeezed out of the simple acceptance of oneself. This doesn’t mean one must be happy with oneself. Just that one must accept one’s position and mental posturing for what it is. You don’t have to like what you see. \n\n     We cannot find meaning while pretending to be someone else because meaning is catered to the individual, and if we are trying to be or wishing we were a different individual, we’ll receive the wrong meaning, which won't make sense, and will only leave us feeling frustrated and defeated. After I accepted that I didn’t know who exactly I was, I was free to find out. Really, I’m still not sure who I am, but that fact excites me. In my confusion I experienced a lot of life, and at a young age. I have had a rollercoaster of emotions, lived with the guilt and shame associated with humiliating mistakes, and I have truly loved, lost, laughed and cried, and I wouldn’t trade my depressed years for anything. I wouldn’t take back any of my bad choices because they are ultimately what have given my ever-lengthening life meaning. \n\n     Life expects you to live it. Life will tell you the wrong answer to a question you never asked and expect you to write an essay about it in only four pages. It expects you to get out of bed, easily or otherwise. In its meaninglessness it asks you to find meaning and to give it to others, then scoffs at your confusion. All of this is good. Struggle is where the seeds of meaning are planted while its fruit is borne in success. \n\n     On being able to see somewhat clearly: I find my life will always have meaning. Every good thing that has ever happened has only been good when compared to past evils. Even when I do what I feel is wrong; When I feel sad, or broken, I can find room to rejoice. I can rejoice in the fact that today I’ve a new respect for what is good, because I lived through something that was not. I’ll always struggle and I may not constantly smile, but I will always have a smile and I will always try to help others see the light. \n\n     I’ve often imagined myself as too young to consider a legacy, but if I die today, I will have left one. A paltry, silly, short lived, and confusing legacy. People around the world have been affected by me. I pollute and swear and sometimes I drive too fast, and that affects the world around me. I can see how my smile and my love and kindness can have an impact as well. So, should I make it to 100 years old, and my tiny legacy stays its course, will my life have meaning? Yes, it will. Since I can choose, I’d like to spread joy and love throughout the world. I want people to understand that even though reality is hard, it’s quite alright to be soft. \n  \n     We all struggle in similar ways. Maybe one day I’ll author a book, or record an album. My legacy, should it grow, will be one of (at least an attempt toward) understanding one another as well as ourselves. Our inner worlds are just as big as and a part of the outer universe, and both are expanding. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fqlgpy/came_across_an_essay_i_wrote_for_an_intro_to/", "title": "Came across an essay I wrote for an intro to philosophy class I took three or four years ago. Wanted to put it somewhere and I hope this is the right place.", "social_network": "reddit", "user": "booty_dharma", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1585406711, "permalink": "/r/DecidingToBeBetter/comments/fqlgpy/came_across_an_essay_i_wrote_for_an_intro_to/", "nsfw": false, "first_save": 1635438279.6450443, "replies_charged": false}