{"id": "t5_2tand_t3_jxam80", "request": ["1a213df6-3f71-466c-9762-ace119e0102e"], "text": "With depression at an all time high during Covid, even the smallest accomplishments can be enough to bring some happiness into our lives. Share what you’re proud of! Let the achievements of others push you to better yourself. \n\nWe all go through our own ups and downs, but sometimes we can’t seem to get climb out of that hole. Depression is not something that goes away like the cold, it stays with us. Sometimes we can fight it and show it who’s boss, but sometimes we get so low that it feel we’re stuck under a dark cloud. This is nothing to be ashamed of, as you are not alone! \n\nI’m making this post for those that are looking for advice, for those that are willing to give advice and help others, and more importantly, to share the small accomplishments we do on a daily basis. It’s the small accomplishments that can really get us to think clearly and climb out of the holes we are in.\n\nIf you are sad, and need someone to talk to, let us know what you’re going through. We redditors love to help each other out, so please reach out for help. We may not be able to solve your problems or have all of the answers, but I can assure you that you are not fighting this alone. If you show up, we’ll bring the shovels and snacks. Let’s dig you out of that hole you’re in, together. \n\nWelcome to the climb to a healthy mind, we’re glad you could join us :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jxam80/tell_us_something_that_youre_proud_of_yourself/", "title": "Tell us something that you’re proud of yourself for doing! Let’s share our happy moments! With depression at an all time high during Covid, even the smallest accomplishments can be enough to bring some happiness into our lives. Share what you’re proud of!", "social_network": "reddit", "user": "Tdehn33", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1605817897, "permalink": "/r/DecidingToBeBetter/comments/jxam80/tell_us_something_that_youre_proud_of_yourself/", "nsfw": false, "first_save": 1635437070.0476017, "replies_charged": false}