{"id": "t5_2tand_t3_klfvfx", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "All of us have the same 24 hours. The same 60 minutes in an hour, the same 60 seconds a minute and the same moment to moment. Its how we use it, its how we use each moment to the best of our ability.\n\nNow, obviously we have to rest and give ourselves rest when we are awake but really its our choice. Its our choice to take breaks that do provide inspiration and motivation to focus on our mental health, self, passions, business, anything !\n\nI read this quote a little while ago and it was: **when feeling like giving up, give yourself rest.** Its that in itself. We must give ourselves time and have patience to continue what we believe, to keep it pushing, especially during these times that have been challenging but have allowed us for solitude for our mental health, our well being and what we truly want for ourselves. Its a daily challenge, **i hear you & i am here for you.**\n\nUp until last summer, I was numb and I was completely happy about it. I knew the pain I was feeling with my last partner was still there, unexpected ties cut and as well as my identity really starting to come up to the surface, with slowly being released from the day to day self inducing alcohol and marijuana numbing. I was happy with it all, **we must be.** We must act on how we feel and release the need for dwelling, especially when we are hurt. Follow what you feel but remember, to continue to pray and speak to God, The Universe, Divine, Higher Power, Source etc., through it all. We will be guided and pulled through the hole in the ceiling into blooming into our true authentic divine selves. It takes time but life is as well. We must try and do the best we can everyday, one movement a day, **together, separately.**\n\n**Today:** Go listen to my new podcast. **Number 13 - Rewiring Anxiety.** On All Streaming Platforms.\n\n**Send me a message with your takeaways.** LIVE YOUR LIFE DIVINE SPIRIT. I believe in you.\n\n**I love you.**\n\nDrey <3", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/klfvfx/this_moment_now_76/", "title": "This Moment Now (76)", "social_network": "reddit", "user": "striclyspoken", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1609117714, "permalink": "/r/DecidingToBeBetter/comments/klfvfx/this_moment_now_76/", "nsfw": false, "first_save": 1635438464.5684776, "replies_charged": false}