{"id": "t5_2tand_t3_pjquy2", "request": ["1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3"], "text": "At the age of 11, I started experiencing symptoms of depression. At the age of 13, I checked myself into the hospital because I was so scared for my own safety and genuinely didn't want to be a part of this world anymore. I began therapy after that, but I wasn't taken too seriously and in the end got dropped by the start of quarantine at the age of 14.\n\nI remember the constant breakdowns during quarantine, lying in bed quietly crying to myself so that my family couldn't hear me. It wasn't until I finally confessed how hard everything's been to a friend that my life began to change. I continued working hard at school, and eventually took up exercising again to try to ease my body image issues.\n\nThat year was probably the hardest, followed by my happiest year: this year. I worked so hard on everything: eating, sleeping, exercising, socializing, so that I could get to this point. Exercise FEELS AMAZING. The endorphins, the feeling of sore muscles indicating that they're growing, the feeling of accomplishment for getting yourself through that tough workout.\n\nI never thought with my depression and anxiety, social anxiety especially, that I could actually have lots of friends and maintain the friendships. But a thousand phone calls later, a couple hangouts later, and I seemed to get the hang of it.\n\nI dropped *toxic people* from my life and *focused on me*. And finally, I *gained confidence*. I'm okay now. Therapy helped, I bet lots of other methods that doctors have come up with such as medication helps depending on the circumstance, but I believe **we are who we choose to be.** Sometimes you have to fake it 'til you make it. Like when you first get a job and you want to prove to your supervisor that you understand and are picking things up quickly, when you're really not.\n\nYou have to act like that best version of yourself. What habits do they have? How do they treat themselves? How do they feel about themselves?\n\nI'm not 100% okay with myself, or ready to settle though. I want to achieve bigger goals, and to continue bettering myself.\n\nToday, I'm 16. 2 years ago I didn't even know if I'd make it this far, but I'm so so glad that I did, and that I can see what I've achieved and how I've grown as a person.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pjquy2/overcoming_depression_we_are_who_we_choose_to_be/", "title": "Overcoming depression. We are who we choose to be.", "social_network": "reddit", "user": "Forgotten_Lemon_28", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 385, "down_vote": 0, "creation": 1631033207, "permalink": "/r/DecidingToBeBetter/comments/pjquy2/overcoming_depression_we_are_who_we_choose_to_be/", "nsfw": false, "first_save": 1635437074.5409186, "replies_charged": false}