{"id": "t5_2tand_t3_ltnc88", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a", "f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "If you want positive feelings, it’s up to you to create them.\n\nHave you ever tried to force yourself to feel happy or motivated? Feelings don’t really work like that, though, do they? \n\nWhile you can’t choose your feelings, you can choose your actions. This is important because if you want positive feelings, you can create them with positive actions. \n\nYou want examples? I have examples:\n\n* To feel calm and relaxed, listen to short guided meditations on YouTube.\n* To feel strong and healthy each morning, do pushups or other simple bodyweight exercises for a few minutes.\n* To feel a sense of purpose and connection, volunteer your time. \n* To feel active, take a walk at lunch to stretch your legs.\n* To feel clear and more aware of your emotions, journal when you’re upset.\n\nYou can choose actions that will make you feel good. You’ve done this before. Can you think of a time you felt great and productive after getting a lot done? And don’t come at me with the “I hate journaling” or “I hate exercise” excuses. I do, too. And it’s even worse because I’ve done this enough that I KNOW I can feel better as soon as I do those things. \n\nThat is what this is about. Small actions that taste bad can create big feelings that taste great. Said another way:\n\n\"Comfort is not the *first step* to growing as a person; it is the *result* of that growth.\"\n\n*Dis*comfort is the first step towards growth, and that’s okay. If good actions create good feelings, then the time you need good actions the most is when you feel awful. \n\nGood actions are the rope you can use to pull yourself back to safety when life ruins your day. Too many people are waiting right now to start that positive change. They’re thinking they need certain shoes to start running, or that they need to feel completely prepared to try something new. \n\nDo me a favor and imprint these onto your brain:\n\n* You don’t have to feel cheerful to get things done.\n* You don’t have to feel ready to try something new.\n* You don’t have to be brilliant to attempt a rough draft.\n* You don’t have to feel emotionally strong to look up therapy exercises or journal out your feelings.\n\nYou don’t have to do these things well. You just have to do it, and you will feel better after. \n\nI’m just asking you to work on the stuff you can control. I don’t know if you’ve ever sobbed while staring into a mirror and wished that you didn’t feel so broken or worthless, but those are not feelings you can just wish away. Again, we don’t get to choose our feelings, but we can choose good actions that create good feelings, and we can create good habits that we use every day. No, it won’t make life perfect but I can promise you that taking these steps will make life better. Don’t worry, we’re going to start small.\n\n**Set Small Goals**\n\nSmall is simple, simple is consistent, and consistency is power.\n\nStart small and take the absolute smallest positive action that you know you can accomplish. Make your bed every day as soon as you get out of it. Go for a short walk every day. Write down one sentence of something you’re grateful for. You can do something small like these every day, and those actions will continuously create positive emotions that begin to change your life. You want to get to a place where you do this on autopilot so you have good habits to lean on when you need them.\n\n**Create Good Habits**\n\nGood habits should be opt-out, not opt-in.\n\nIf you can create routines of positive actions that you do every day regardless of how you’re feeling, then dark days will be much easier to manage. Not that you have to go for a morning walk if there’s a blizzard outside, but it’s better to do good things by default than try to start a new habit when you feel terrible. Having a variety of these habits will help when it’s impossible to execute something on any given day.\n\nYour happiness baseline will be MUCH HIGHER by doing positive things on autopilot, and the more you get used to them, the less willpower it takes to continue. You’ll do them because you want to, because you know how they make you feel. And you can add to them or adapt as you learn what works for you. Optimize it for whatever makes you feel the best and help you continue growing as a person.\n\nYou can choose actions right now that will create the feelings you want, and you can turn them into habits that give you those positive feelings every day. Feeling bad today is not an excuse – it is actually a reason to get started. \n\nYou can create good feelings by choosing good actions. What are you waiting for?\n\n\\------------\n\nFurther Reading\n\nIf this resonated with you, then I highly recommend *Miracle Morning* by Hal Elrod. That book changed my life by showing me how much better my life was when I traded a little extra time on reddit in the morning for actually doing things that made me feel better. The quality of my life has been so much higher just because I get a “positivity injection” in the morning regardless of how I felt the day before or if I woke up feeling negative. It illustrates the power of choosing what feelings we want to create, and the book has great systems and advice and ideas for how to make a positive routine you can maintain. There’s also a very supportive community of people all making these positive changes together and encouraging each other…want to join them?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ltnc88/good_actions_create_good_feelings/", "title": "Good Actions Create Good Feelings", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 25, "down_vote": 0, "creation": 1614429703, "permalink": "/r/DecidingToBeBetter/comments/ltnc88/good_actions_create_good_feelings/", "nsfw": false, "first_save": 1635435864.1774108, "replies_charged": false}