{"id": "t5_2tand_t3_imwyfu", "request": ["78fd6fdb-9773-43a2-a009-a544155322bc"], "text": "I was manipulated by someone I care about deeply. I was continuously being told how much I meant to them and that I made them happier than they'd been in years, made them feel motivated to better themselves. They helped me in major ways, selflessly. I was told by them that they believed we met for a reason. This person is a beautiful soul on the inside. I know this because I caught a glimpse of that soul. It enchanted me. Connecting to this other soul was effortless and I felt that they truly listened and heard the things I said. \n\nBut this person was very damaged due to being emotionally neglected through the years, leading to a beautiful person putting on a very \"brave face\", which involved playing a narcissistic character that could not feel pain, and would destroy anyone who dared even try to poke the bear that was their mindset. \n\nThis mindset was that constantly using drugs and having sex was the only way to feel anything at all (this was stated by them to me). This person hid so much pain behind the mask of someone who is invincible. Me, being extremely sensitive to the feelings of others, as well as seeing goodness in this person that I believe is rare in the world, chose to follow them down the hole in hopes to pull them out. I didnt know how far it would go. I became a shell by attempting to heal someone who decided long ago they wouldnt be healed, because I would later realize the idea of putting away the mask that kept them safe from harm terrified them even more than being alone forever. \n\nThis hole I followed them down lead to me, a father of an 18 month old little girl, doing hard drugs almost daily for weeks (i have never allowed my daughter to be around those things, I'm only saying that a parent should never be living like that). I'd put my daughter to sleep and then do cocaine every night. This person, who obviously did the same, thought there was nothing wrong with it, or if they did, it didnt matter compared to the potential pain of being sober. I think some part of me thought placing myself in their shoes would let me be able to understand how to help them. I was never attached to the idea of being *with* them, I just wanted the best for them regardless of if they were with me. \n\nSo how did it all end?\n\nThey got high on meth and messaged me calling me a psycho and that I had some sort of conniving scheme behind my friendship with them. Even though I basically gave them anything I had to offer, apparently they still thought I was somehow planning some way to use them. I'm not a stranger to trust issues, but they told me they couldnt trust me even more than they couldnt trust anyone else. \n\nI bought them clothes. I stole for them, (and then they took the \"credit\" in front of \"friends\" for stealing \"cool\" stuff), I fed them, I gave them a place to sleep, an ear to listen, and a shoulder that they repeatedly cried on while telling me things I'd never say to anyone who wasnt my soulmate.\n\nBut that's not how it was.\n\nThat was when I broke down, asking myself how could they feel that way? How could they not see that I truly care? I never cared about being their \"hero\". You know why? Because all I wanted was for SOMEONE to be. I couldnt have cared less if it was me. But that was my mistake, begging someone to feel love when they disabled that ability long ago for the sake of their ego and security.\n\nSlowly but surely I'm letting it go. I dont cry every day anymore when I remember the lies they told me about not only how they felt about me, but the lies ABOUT myself to me. I dont break down when I remember the ways they sexually used me, which I only realized the severity of after the fact. I realized that I was used in every way only to be told that I was a psycho and that they never wanted me around, even though they took everything I had to offer without a blink. \n\nThey were so, so good at \"caring\" that I could NOT comprehend how someone could act that well. \n\nBut I'm not going to sit around and be sad because someone went out of their way to hurt me, very badly.\n\nI left the hole, and will never again sacrifice my peace and my happiness with Life for someone determined to not feel the same way about Life. \n\nTo be clear, I'm sober. Very. And I'm very happy. My little girl is my entire world, and she is thriving. Sometimes I still cry myself to sleep, thinking, how could I have ever taken time away from her just for that person? How could I have left her with a sitter while I went to their house and did drugs? I could sob for hours on end thinking about how I wish I never did. But I did. The only options are continue to live in the past, or to create your new life every single second of every day. I chose the second one.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/imwyfu/the_one_that_saved_me_was_myself_dont_always_try/", "title": "The one that saved me was myself. Don't always try to save everyone around you.", "social_network": "reddit", "user": "WestFisherman8", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 205, "down_vote": 0, "creation": 1599290474, "permalink": "/r/DecidingToBeBetter/comments/imwyfu/the_one_that_saved_me_was_myself_dont_always_try/", "nsfw": false, "first_save": 1635436353.940618, "replies_charged": false}