{"id": "t5_2tand_t3_fr5s76", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "I am kind of a hedonist. That said, often when I do something rather unhealty, I excuse it with \"I treat myself to XY\". For example, in restaurants I have the tendency to order unhealthy, greasy food like fries with the excuse that I don't eat this way at home (which is only partially true). Or when I sit in front of the TV, I am doing that under the assumption that I am treating myself to some relaxation after a long work day. \n\nNot only did I realize that, but I also realized that every behaviour and decision matters. It adds up and becomes my life. \n\nWhy don't I treat myself to a nice, vitamin-rich salad with chicken full of protein? This is much better from my body and it tastes very good too. Or eat an apple instead of gummi bears?\n\nWhy don't I treat myself to a fast-pace 30 minute walk (and watch netflix afterwards)? Moving is an investment in my physical health and mental health. \n\nWhy don't I treat myself to 30 minutes of journaling to learn more about myself instead of just numbing my feelings by playing video games? \n\nWith more mindfulness I am much more in tune what actually is good for me vs. what only seems good or satisfiying. \n\nI probably will never be the kind of person to only eat greens, no sugar, no TV run a marathon etc. But every step into that direction will give me a better quality of life and a better health. \n\nRe-framing what indulgence and spoiling myself means, makes it easier to keep it up. \n\nAnd re-framing is such a powerful tool for getting better in different aspects in life. Oftentimes we think about stuff in a certain way, but never question, why we think about it in this way. Seeing a different angle or a different view point can help to dissolve unhealthy habits and thoughts.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fr5s76/reframing_what_it_means_to_indulge_oneself/", "title": "Re-Framing what it means to indulge oneself", "social_network": "reddit", "user": "good_days_will_come", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 49, "down_vote": 0, "creation": 1585487995, "permalink": "/r/DecidingToBeBetter/comments/fr5s76/reframing_what_it_means_to_indulge_oneself/", "nsfw": false, "first_save": 1635437779.7282445, "replies_charged": false}