{"id": "t5_2tand_t3_p8p1i2", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I've \\[30M\\] had a few things go wrong with my life recently.\n\n1. Relationship broke down, because she didn't want to put in much effort. I was expecting her to try as much as I was, leading to ill feelings from both sides\n2. A lawsuit threatened against me, because I wanted to back out of a contract before the other party signed it, which I think is within reason. But the threat coming from someone who up until that point had been very nice to me, shook me.\n3. My supervisor wanting me to work for free, even though I'm not in that organisation anymore. I assured my previous employer that I'm willing to help out if the new hires need something. But wasn't expecting to be asked to asked to just continue doing what I was doing earlier.\n\nI've realised that the I have naively high expectations of kindness of people in general. That if I showed them that I was willing to do a lot for them, then they would want to be considerate of me as well. But in end, it felt like a one-sided relationship and either being taken for granted or taken advantage of.\n\nI am usually a happy, nice guy. But these recent incidents are hinting towards me having to manage my expectations of kindness and efforts from people. Not to give people the benefit of doubt, until they've shown that they deserve that benefit. That's fine, but am afraid, that might hamper my feelings of hope from life, which I don't want to dampen.\n\nHow did people on this forum manage to deal with the feelings of disappointment that comes with realising that the world is not necessarily as nice of a place as you'd imagined it to be?\n\nMore importantly, how did you learn to thrive in the world after the acceptance? How did you figure out what the rules of the game are?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p8p1i2/how_did_you_accept_that_the_world_is_not_as_nice/", "title": "How did you accept that the world is not as nice as place as you'd imagined, and learned to play the game for what it is?", "social_network": "reddit", "user": "DragonWarrior008", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 32, "down_vote": 0, "creation": 1629541133, "permalink": "/r/DecidingToBeBetter/comments/p8p1i2/how_did_you_accept_that_the_world_is_not_as_nice/", "nsfw": false, "first_save": 1635435129.9126225, "replies_charged": false}