{"id": "t5_2tand_t3_pktkic", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "I am someone who has let fear lead my life for a long time.\n\nLooking back, so many decisions that I made or didn't make came from a place of fear.\n\nA lot of these were in social situations where a friend would invite me out to do something fun and there were going to be other people there I didn’t know. And instead of being in a present and open mindset, I allowed fear, usually through the lens of anxiety, to have the say, which was always **no**.\n\nI didn’t want to go and feel anxious and then I would get in my head about how I would be perceived, what I would say, and then all of the small details about the event, like where it would be, what the place would look life, how we would be sitting etc.\n\nMy anxious and fearful mind would feast on every morsel of detail it could, generating more and more fear. Saying No was far easier than doing all of this.\n\nThere were also things that I wanted to do or be. I could feel this intuitive sense of purpose but instead of surrendering to that and allowing myself to be guided by that feeling, I would allow fear to once again come in and close it off.\n\nFor years I knew that I had value and I knew that the things I have been through, the lessons I have learnt would and could also help others. But when I’d think about the idea of having to put myself out there in front of people and make videos or do presentations, once again I would allow the fear to stop me.\n\n**Doubt kills more dreams than failure ever did.**\n\nI have come a long way and there are still things that I feel fear around, but instead of listening to that fear, I give it space, I give it acceptance and love, because the fear is just a part of me that feels unsafe. Instead of wanting to get rid of that, I need to show up for myself and make that part of me feel safe and feel love.\n\nThis is what people mean when we hear of self-love or self-compassion. **It is not rejecting a part of yourself that only exists because it has been previously rejected**.\n\nThis fear comes from a part of us that at one time was not seen or not heard or experienced trauma. This events then goes unprocessed and manifests in smaller ways throughout our life such as feeling anxious about going to a party.\n\nIt is not the party you are worried about but it is your fear response that is worried that whatever happened to you, usually in childhood - that hasn't been processed, will happen again.\n\nSo this is why you need to do the work. Through therapy, meditation, journaling etc you do the work and you process these early experiences that are now rearing their heads in your life as anxiety and fear.\n\nThis then allows you to start living an authentic life of purpose and direction.\n\nI still feel this fear when I am doing certain things, but the question I continuously ask myself is:\n\n**Is the fear bigger than the dream**.\n\nThe answer is always no.\n\nIs this fear I am currently feeling, bigger or more significant or more important that the thing I am going after, than my ideal life.\n\nNo.\n\nSo don’t stop moving forward.\n\n\\-\n\nI've made a video on the subject, so if this resonated with you then check it out - link in my bio", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pktkic/is_the_fear_bigger_than_the_dream_how_i_have/", "title": "Is the FEAR bigger than the DREAM? - How I have helped deal with my fear and anxiety", "social_network": "reddit", "user": "yusefsanei", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1631175238, "permalink": "/r/DecidingToBeBetter/comments/pktkic/is_the_fear_bigger_than_the_dream_how_i_have/", "nsfw": false, "first_save": 1635435978.54253, "replies_charged": false}