{"id": "t5_2tand_t3_2w4qhp", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "Note: This is pure fiction and you should not use logic on my crazy rambling.\n\nImagine that the universe somehow 'crashed' like your pc Or like a *Broken record* and you're stuck doing the things that you did today, or the thing you were doing during the last hour, and you can only repeat your day or hours doing the same task you were doing when it happened, you get stuck doing that for the rest of your life... So how do you think you would end up?\n\n**Example;** you were browsing reddit for 5 hours today? Well, it looks like you will have to reddit for 5 hours the same subreddits for the rest of your life, you can't spare any of that time for study or other stuff even if you want it.  Or let's say you ate like a desperate and stuffed your mouth with junk food and didn't feel like going to the gym, Well you can only eat that for the rest of your days, and you can forget about the gym, it's out of your reach now.\n\nSo start to think, if you get stuck doing the stuff you're doing for a whole year, with the same habits, let's say 2 years... By then you'd doube your size and your weight, if you managed to survive. \n\nIf you woke up at 11am, and overslept, then you get to oversleep everyday, and that's no bueno.\nIf you took 3 hours of your day to study a language and got 'stuck' doing that for 2 years by then you'd be fluent. \nIf you took 2 hours to study anything, you will be an erudite on the field.\nIf you were working and being a productive memeber of the society you will have at least earned good money. Or even better if you were an entrepreneur working on improving your own bussines like a website, then you will have one of the best blogs in quality.\nIf you were redditing 5 hours a day you would have a lot of stories and jokes that you would have forgotten by the next day...\nBut even if that's what you like, try to get stuck doing that, but only for an hour, leave time for other things!\n\nIt would be nice to have watched a movie you never watched before and now you get to watch a new movie everyday (You can change the movie, not the action)\n\nWhat I'm saying is to try to not go to extremes in your life, if you're planning to starve to lose weight,  be careful because you could be stuck doing that and you would not last 10 days...\n\nSo, read, watch something new you like, excersice, work to be better, make money, spare a moment to enjoy with your loved ones, and have lil short breaks for your guilty pleasures...  Because if you get stuck doing that for the rest of your days, your life would be bliss.\n\nSpoiler: You can get stuck doing something you want, and that's the beauty of life, you have the power do to anything you want with your time. ;)\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/2w4qhp/how_to_realize_if_youre_wasting_your_days/", "title": "How to realize if you're wasting your days...", "social_network": "reddit", "user": "STOP-ENJOYING-THINGS", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1424129187, "permalink": "/r/DecidingToBeBetter/comments/2w4qhp/how_to_realize_if_youre_wasting_your_days/", "nsfw": false, "first_save": 1635435659.5460734, "replies_charged": false}