{"id": "t5_2tand_t3_4votzw", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "You're facing bad times now! Someone told you something that made you mad! Now you're trying to figure it out, maybe he was right, man. Maybe he's being a jerk! Maybe life was mean to you, making you lose your wallet. Why did I have to be born this way? If only I didn't have concentration problems, I would have payed more attention in class and had aced that test. If only I were smarter, I would have figured my life out when I was 16. I could have gotten that better job. I could have not missed all these opportunities!\n\nYes, that's right! You know you could have. It didn't have to happen this way. It is possible that things could have worked out for you.\n\nIf it were up to you, you would have chosen only happiness. But life got in the way. **This was not your fault.** Things did not work out the way you wanted to. Or else, you would be swimming in happiness right now. Right here. There would be only bliss and joy and wonderfulness!\n\nAll the bad things that happened to you are not you. This anger that you feel right now, this sadness, this regret... it is not you. You were simply caught up in all this. You are the one who experienced these things, yes. But they are not the real you!\n\nBe you in a happy situation or a bad one, you are still you. The same person! You have the power to feel happiness or anger. You can go through all these things. You can feel, and that's the big thing in being a human. Sometimes it works for us, sometimes it makes us cry. But it does not change who we are. You are always the same being deep down within. No matter what happens. No matter what you're going through. You are you. The worst possible version of yourself and the best possible version of yourself is exactly the same person!\n\nSo don't lose yourself in yourself. Don't think of yourself as the sad one. You're not the person who feels bad. You're the person inside of you who, in spite of everything else, wants to feel good!\n\nAnd I want you all to know, that when I look at you, I see the best in you. The best that you can be. That's true love! Know who you really are, deep within, and no matter what, never forget this.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/4votzw/it_could_have_happened_differently/", "title": "It could have happened differently.", "social_network": "reddit", "user": "OneOfYesterday", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1470086026, "permalink": "/r/DecidingToBeBetter/comments/4votzw/it_could_have_happened_differently/", "nsfw": false, "first_save": 1635435654.2128186, "replies_charged": false}