{"id": "t5_2tand_t3_o6fkij", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "I have this problem that's really been getting to me. Generally I'm a happy and well adjusted person, I think most people would look at me and say that I'm doing well in life.\n\nHowever, I struggle a lot with insecurity, and I think it's about time I put it out into words and tackled this feeling head on.\n\nI'm out of work right now due to being in public education and not having a set career (I'm young and jumping around from year to year instead of being in one district in one job), and now that I have a lot of free time, well to be honest my insecurities creep in and I start having a lot of negative thoughts.\n\nA big thing is I feel a LOT of creative energy... but I simply don't know where to put it. As far as I can tell, it's because I tend to focus so much on end goals. I like the idea of being known for certain things, and compare myself to people who have succeeded in that field. I have a lot of different interests, but not really a set goal ever.\n\nFor example - I love fantasy and sci fi. I want to be a writer in those fields. I sit down to write, and I don't love it. I want to be a published and renowned author but can't finish a story.\n\nI love video essays. I want to make one. I start to write, and the ideas dry up. I don't want to edit.\n\nI want to make video games, I want to draw, i want to garden or become a game streamer. I look at people I admire and think *I want to be them*, but I can never get started. I'm unsure if I'm just unmotivated or if these aren't things that interest me.\n\nIf I do manage to get started, well my ADHD kicks in and in a week I've lost interest. If I wanted to become a streamer, now I have zero interest in putting my life online and showing my face - especially considering a goal of mine is to be a public school teacher. If I want to become a writer, well then a week later I can't imagine sitting there alone staring at words all day - that bores me out of my mind. If I want to draw art... well you know where this is going. With a couple days I've lost any interest in it.\n\nI can't say for sure where this comes from, but I am a perfectionist in the worst ways. I fear failure and putting out work that I don't think is exactly perfect, and so I have very little to show, creatively. \n\nNow, I am a great people person and I have many wonderful friends and family I adore, but I don't necessarily have a creative outlet that I'm proud of, I simply want to have exactly what I'm looking for but I fear investing a significant amount of time in one thing, as my interests change and then I've lost interest in it a week later, and now it sits in my mind chewing away and making me anxious. I don't want to start anything because of this, and so I have a ton of energy but have zero to show for it.\n\nHow do people just *do* things, without fear or care about the future or perfection? I want to just follow my creative flow wherever it takes me yet I keep holding myself back because I can't stop comparing myself to an idealized version of both my finished product and those who are \"known\" for their craft. I want to get better about this!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o6fkij/creativity_perfectionism_and_that_feeling_youre/", "title": "Creativity, perfectionism, and that feeling you're missing something but have no idea what.", "social_network": "reddit", "user": "thedonoman", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1624463420, "permalink": "/r/DecidingToBeBetter/comments/o6fkij/creativity_perfectionism_and_that_feeling_youre/", "nsfw": false, "first_save": 1635437243.3933544, "replies_charged": false}