{"id": "t5_2tand_t3_ofgmm0", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Hi there. I'm overweight on the scale (70kg/155lbs when I'm 5'1\") but based on appearance I just look a little chubby.\n\n\nI grew up in poverty, and I never had any nutritious food  growing up. Mainly rice with canned fish or instant ramen, salt or sugar, dried fish or nothing - the reeks of poverty. Also count in that I'm an orphan, guardianless, and all the abuse growing up...\n\n\nI'm fortunate to be naturally intelligent and I got scholarships, and now I am a licensed engineer. I have a stable job, still single. Good salary. Having the time of my life.\n\n\nBut I am having a problem controlling food. Initially, I just think that I so deserve eating good food. Like 'when I was younger I can never eat a whole chicken leg, and now I can afford unli-wings' or 'I can't believe I can drink milk tea now when back in the days I can't even afford bottled water'. It's been four years since I am earning my own money, I still haven't gotten over that 'I so deserve this' phase.\n\n\nThe problem is it's not healthy. I may not be feeling anything yet, but soon I sure will. Since early this year I have been trying to stop myself eating sugary stuffs, but I'll just slap back harder.\n\n\nIt's rainy where I am so I would want to stock food supply, but I just can't stop eating until I can't see my storage empty: just a few minutes ago I ate the whole supply I intend to have for 2 more days. I failed again. How could I discipline myself? \n\n\nI'm trying to be compassionate to myself since I'm still processing a painful breakup. But I think I did all the work I can do, and it's time to level up. It's my birthday this July 22. I want to change this side of me...\n\n\nHoping I could get applicable advice.\n\n\nAlso, I am living in a country where there were no accessible mental health care provider which doesn't cost my whole monthly salary per session. Therapy is not an option. If there is, I most certainly went already.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ofgmm0/i_cant_store_food_since_i_cant_resist_eating/", "title": "I can't store food since I can't resist eating until I empty my stocks. Needs serious advice.", "social_network": "reddit", "user": "EngrMyla", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1625655726, "permalink": "/r/DecidingToBeBetter/comments/ofgmm0/i_cant_store_food_since_i_cant_resist_eating/", "nsfw": false, "first_save": 1635436617.4275842, "replies_charged": false}