{"id": "t5_2tand_t3_pfy8tr", "request": ["18281d65-fa68-4991-a4a1-8f37346818f3"], "text": "I realised I am a toxic person not just to my partner but also to myself. I am over jealous. I easily get jealous over unnecessary things. I feed my insecurities by overthinking and being paranoid of things that's not even true resulting to me being upset, feeling anger and sadness. It also makes me think that I am not good enough. I was so scared by the thought of my partner leaving me. It upsets me when there are other things that make him smile and happy other than me. I wanted it to be only me. That should be me... which is unhealthy. My partner has his own life to live and there are  things that could make him happy other than me. And I should be okay with it. It's okay. His world shouldn't revolve just around me. I should stop getting jealous over petty things and be happy and support him and grow with him. After all, I don't just hurt my partner, I am hurting myself, too. Spending so much time being jealous and upset.\n\nI realised it's just my fear of being left alone. And I am being  a cry baby who always seeks affection and attention. I don't want to be like that. I realised I was being selfish and I should try to understand that my partner is human, too, who also gets tired trying to live his own life. That it's not always a lovey dovey day. I want to be the person who makes him smile, who makes his day better as much as I can when he's feeling down but then again I can't always do that. Who knows if it's a video game or funny videos or talking with his friends would make him feel a lot better. I prefer me of course, but if not, I should just accept it, be okay with it and be happy for him. I want to be strong enough to stand for both of us when he is feeling weak. I want to take care of him.\n\nThe last time I wrote here is about me feeling hurt because of  \"changes\".  Sure thing, it did hurt me. I often try to stop feeling hurt and I feel anger instead. I guess that is my defense mechanism. I understand now that it's easier if I just let my emotions flow. Be sad about it. Feel the pain. Until it hurts no more.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pfy8tr/i_realised_i_am_a_toxic_person/", "title": "I realised I am a toxic person.", "social_network": "reddit", "user": "ramendate", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 889, "down_vote": 0, "creation": 1630516003, "permalink": "/r/DecidingToBeBetter/comments/pfy8tr/i_realised_i_am_a_toxic_person/", "nsfw": false, "first_save": 1635437102.5486312, "replies_charged": false}