{"id": "t5_2tand_t3_o89cmk", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "Tell me which crutch you use. The thing you reach for to fill the moments when it’s uncomfortable to be with your thoughts. Is it social media? TV? Weed? Booze? Alcohol? Which distraction feels better than those thoughts you're hiding from?\n\nHere’s the thing. Your mind is your home. It’s the home only you can clean, the only demon you can’t escape, the voice track you can never turn off.\n\nThich Nhat Hanh says when we neglect our mind for too long it becomes messy. When we move from one distraction to the next, there’s no time to mow your mental lawn. You can’t do the mental dishes, vaccuum your mental carpet. Life’s pains make us track in all kinds of muck from day to day. It doesn’t stay clean just because you’re not looking at it.\n\nIt’s not fun to clean though. You have to be present with your thoughts and emotions. You have to listen closely to the pain and fear, understand what relationships are worrying or stressing you. It is very hard to resolve these things without feeling, processing, understanding. It’s the right path forward, but it is uncomfortable. \n\nWhen you have free time and you feel almost panicky without something to do? When you’re feeling anxious about something and you scroll through apps or lose yourself in video games? When the pain is too much and that bottle of wine blesses you with numbness and apathy?\n\nThese are your crutches. These are the tools you use to cover up the thoughts and feelings you can’t deal with. These are you deciding that you’ll put off cleaning your mental home for one more day.\n\nI have my own crutches too. I’m so tired of wanting to be numb. I’m tired of reaching for crutches that keep me from feeling. It’s true that life hurts. Life never stops hurting. There’s never a point that you figure it out and things get easy. But how much pain have I already blotted over with White Out? If I keep covering things up I don’t know how much will actually be left. If you censor every uncomfortable feeling in your life then you’ll never figure out where they’re coming from. If you refuse to look at blood then you can’t find the wound and heal it.\n\nWe’re not bad people. We’re not weak. We haven’t wasted our lives. It just takes time to realize these kinds of crutches are holding us back, not holding us up. You are allowed to sit with the pain. You can put it into words in a journal too, if you want to understand them a little better. What I’ve found is asking/searching for help is much easier after you can articulate the pain a bit. You’re not the first one who has felt these things. Other people put down their crutches and healed, we can too.\n\nSo take a good look at your crutches. Things that steal you away from the present moment and things you run to when the present doesn’t feel good. I think it’s time to put those down. Life is happening now. The ups are intertwined with the downs. Let’s stop hiding from the downs, because you’re missing a lot more than you realize.\n\n**Further Reading**: If this post resonated with you then I’d recommend the book Radical Acceptance by Tara Brach. She taught me how to accept the painful feelings I was trying to escape. You don’t have to numb and distract yourself. You can face those feelings. And once you accept that they’re there you can sort out your baggage. You’re not broken, you just have some healing to do.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o89cmk/can_we_talk_about_your_crutches/", "title": "Can we talk about your crutches?", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1624708370, "permalink": "/r/DecidingToBeBetter/comments/o89cmk/can_we_talk_about_your_crutches/", "nsfw": false, "first_save": 1635435559.0051603, "replies_charged": false}