{"id": "t5_2tand_t3_pr5qwz", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "f29068b1-c751-4543-b3a6-9d58b1182ab7", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "Hey Reddit,\n\nBefore I start I would like to say that this is a mixture between a rant (ease my mind/destress) and a cry for help (a little dramatic but I can't think straight because its 3:12 am) Btw, most of this is my backstory so if you're interested in a random teen's backstory there you go. Otherwise I can understand the skip to TL:DR\n\nI would like to introduce myself as a sheltered college student who is just now realizing that his social skills are on the level of an elementary school kid (I know, a little dramatic but I'm pretty sure its true). Recently I've been included into a friend group (which I desperately needed as a freshman) but I don't know how to start conversations like I did with my friends in high school (which I've slowly started to lose contact with). Fair warning, I'm going to be doing the parenthesis (insert thought) thing often so bear with me. \n\nI really do want to get better at talking to people because I feel super lonely and don't want to go 4 years without creating the life bonds that so many people find in college. I've gathered that in order to make friends, you need to find common ground. For example, today I went out with 4 other people. All four were into K-pop and despite being Korean, I had no idea what they were talking about. Now don't get me wrong, I know who Jungkook and V are, alongside groups like TxT, BTS, BlackPink, etc (don't worry if you don't know what I'm talking about), but I don't listen to that kind of music (I know, easy fix is to just listen to the music). \n\nI think the lack of teen/hip hop/pop culture knowledge comes from my childhood. My parents (Amazing people don't get me wrong) had standards for me that my already timid personality didn't want to break or change. I adopted the mindset early that my parents were right and I was wrong (Again not the correct mindset in hindsight but hey I was a child) and just accepted that's how things go. I saw other kids being disciplined in similar ways and seeing them cooperate as \"good children\" and I just followed their lead (If you didn't already guess I'm more of a follower not a leader/introvert rather than an extrovert). As I'm looking back, I realize that my lack of curiosity was left behind in that early development stage of my life. My questions were answered in a way that made me start thinking to myself rather than aloud. I was too scared of being told I was wrong, too scared of being chastised that I wasn't thinking critically. \n\nMy nature and personality developed to be introverted. That abnormally quiet kid in class. I wasn't able to convey my emotions clearly and often would be stuck thinking about what I was going to say and the moment would pass by (You can imagine the enormous amount of anxiety I felt in Socratic seminars in high school). I don't even have confidence to speak my mind when I'm talking to my friend group (I feel like the only reason I'm able to type all this is because I'm staring at a screen instead of thousands of random people on the internet...) so I'm always thinking to myself. I made some really embarrassing and relationship harming decisions in middle school (\"join the club\"). As I mentioned before I didn't know how to convey my emotions (still don't) but I lashed out because I was so afraid of the image that my friends had of me would change which lead to me losing my closest friends. (If you got to this point tysm because I really don't know where I'm going with this).\n\nFor better or for worse most of my friends that I had in middle school went to a different high school than me because what high school you attended was decided by zones meaning areas were \"zoned\" toward a certain high school and the only way out of that school was by applying to transfer which was a wait list type system. So I started a new life at my high school. I still knew some people from my middle school but my high school had these small learning communities (which was a really cool idea message me if you're interested on how it worked. I'll briefly explain it here) where the idea was that a group of students shared the same teachers to develop strong interpersonal relationships that weren't broken after a year due to a large student population insuring that there was a very low possibility of seeing the same people twice. Here I was able to meet a bunch of new people and I think I made friends pretty easily. \n\nEven though I had made friends, I realized that I was feeling lonely because I was missing a relationship that was close and intimate in a way that best friends were. Since I was a unique case where I went to a middle school were I wasn't zoned, I didn't know anyone at my high school. I realized a little too late that people who had been able to develop their own unique personalities had their own best friends. It was junior year that I realized that I didn't have a best friend (sad right?). I had joined many clubs and organizations offered to students in an attempt to meet and befriend as many people as I could and it worked, but I still felt that I was missing something. Even the people from my middle school had found themselves a solid friend group with their respective best friends. I found a group of friends that I could interact with and hangout online for hours at end. These were the type of people who would go out at 12 am for McDonalds and do stupid stuff like drive somewhere 10 miles away on a school night. I would never go so I always felt like I didn't belong. Since everyone had figured their social tree out by then I found it hard (granted I didn't try too hard to hop ship) to find a different group of people. Before I knew it COVID hit and college apps were due and I said goodbye to my high school connections. \n\nI decided to apply as a psychology major because I want to understand how the human mind works (I hope y'all don't find this weird) whether that's at a super scientific biological scope or a general stereotypical therapist \"tell me about your deepest darkest secrets\" but I don't think that's going to get me anywhere. \n\nAt this point all I would like is for some advice and if anyone is willing to talk to me (via messaging because the internet can be a weird place) and help me in any way that would very much appreciated. Some people might say just practice, but I would like those people to understand as a shy person who still thinks they don't have the mental capacity to convey their emotion despite being a young adult doesn't find it easy to walk up to a random person on the street and say let me tell you about my backstory and why I feel empty inside and void of personal and intimate connections with my peers. \n\nTL:DR: I don't know how to integrate myself into a social environment and I would like tips on how to improve my social skills.\n\nP.S: If this is the wrong subreddit I'm going to be sad but let me know by message if u want to help ;-;", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pr5qwz/how_can_i_develop_social_skills_that_will_get_me/", "title": "How can I develop social skills that will get me through college?", "social_network": "reddit", "user": "UnsociableMediator", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1632048629, "permalink": "/r/DecidingToBeBetter/comments/pr5qwz/how_can_i_develop_social_skills_that_will_get_me/", "nsfw": false, "first_save": 1635436293.9479835, "replies_charged": false}