{"id": "t5_2tand_t3_q847y2", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "&#x200B;\n\nThanks in advance for listening (reading) me rant.\n\n**TL;DR:** I'm in the process of packing right now. A bit upset and scared because I'm moving from a major metropolitan area to a random town. My ex-husband isn't military but moves to different areas every a few years! I move with him to stay with my children, but I feel like its holding me back.  He has a digital career and mine is location/service based. I can't afford a lawyer and I don't want to lose custody.  I have sons so I think its important for them to be with him, I don't know what to do and don't want to live in the places that he does.\n\nEdited to add: Even though we have joint custody, they spend a majority of time with him since he has the ability to live in better neighborhoods and send them to better schools. I will work with an lawyer but I am scared that he would throw tons of money at lawyer and use my past mental health issues and current financial instability against me.  I am working hard to become stable so that this isn't an issue.\n\n&#x200B;\n\n**Full backstory:**\n\nSo here's the deal. I've spent the last 8 or so years dealing with high levels of depression and anxiety. I've always been a little anxious and had bouts of sadness here and there, but I think several things made me spiral downwards: untreated baby blues, ADHD, being in a very verbally abusive marriage, then being unable to take control of my life after my divorce.\n\nEven though I was divorced, I still spent time making things easier for my ex. Which meant moving about 4 times. Not only did that take money that I do not have, but it kept me from progressing in my own life.  If I had it my way, I'd stay my with my grandmother for a few years and saved money.Anyway, I haven't started any serious romantic relationships and I've only had McJobs. That's not on him though.  One reason is that if I had to move again, I didn't want to have choose between job/relationship and my kids.  Also, I blame my anxiety.  I was terrible under pressure and would avoid jobs with high responsivity and stress. As for relationships, I felt that no one would want me since I was older, fat and had two kids.\n\nFast forward to now.  I'm taking medication for my ADHD, which has made my more productive. I am looking for ongoing therapy/counseling that I can afford.  I'm completing my accounting degree and I'm also picking up a nail tech license. I'm losing weight.  The more \"W\"s I get, the better I feel about myself. I think that is what was holding me back before. Not only was I taking \"Ls\" everyday, but I had him constantly telling me how terrible I am.  Anyway,  I'm actually looking forward to things now . I've made plans and goals. For example, I want to own a spa and a doggy daycare.\n\nBUT, here's the thing. My ex keeps moving and l move with him for some reason.  When the kids were young, I made sure we would both be in their lives that's why I always moved with him. Nothing is slowing him down, though. He has a live in girl friend, just bought a house in suburbs and has a completely remote career and side business. He's thinking about moving AGAIN in the next 2 years. I think he will settle there. But who knows!\n\nOn the flip side, I couldn't get into tech. I tried and failed over and over. This was before I started medication, so it could have been different. But I don't want to be medicated just to work.  I found things that I do like and I actually excel at. That's one reason I went into accounting. Its not my favorite, but at least there's remote firms, its a stable career and pays OK.  On one hand, I hate the fact that I'm molding my life to conform to his. On the other hand, I'm still pursuing things that are dear to me - even if its on the side.  I just wish I could do something 100% for me.\n\nI haven't even touched on the kids. They are elementary aged and there is a lot going on with them. One example is this: One of them handles losing friends very badly. We lived in VA with many military families. We are not military.  He'd make a good friend and they would leave or we'd move again. For a while, he thought HE was the bad guy because his friends never stick around. I just want to give them stability to grow up with a friend group.\n\n&#x200B;\n\nAny advice or encouragement is greatly appreciated. Thank you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q847y2/i_feel_like_im_not_in_control_of_my_life_advice/", "title": "I feel like I'm not in control of my life (Advice needed. This is a bit long)", "social_network": "reddit", "user": "realedazed", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1634231740, "permalink": "/r/DecidingToBeBetter/comments/q847y2/i_feel_like_im_not_in_control_of_my_life_advice/", "nsfw": false, "first_save": 1635435080.0470378, "replies_charged": false}