{"id": "t5_2tand_t3_q9k48j", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "In this week's topic for my subscribers I am focusing on how to continue forward--even with sudden job loss, economic turmoil and even physical disease. The nutshell of the channel weekly was this. First, don't live over your means. Being in debt makes you a bullseye when the economy goes into recession or you have a sudden job loss. You should live well below your means and have a LOT of assets stored just in case. Second. Job loss. You should always be up'ing your resume when times are good, not when you suddenly find yourself downsized. Get those certifications while you are in a state of prosperity. Be ahead of everyone in good times and you will be ahead of everyone in the unemployment line--and not for long. If you have a house you should already have met with a property manager so you can rent it if you have to relocate to another job market--and know in advance where your job market thrives and be ready to move. You may even get passive income renting that house. Third--physical calamity. I will not turn over my assets to the insane system here in health care. I already know where I will go overseas where care is affordable. If I am in Hospice--it will be with a nurse from Fiji. I'd rather give her 20K for a few months then everything to a healthcare conglomerate. End point--these points of pre action will always keep you on that path to keep advancing while others are stuck in that sudden mud. Hope this helps someone--Charles", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q9k48j/how_you_can_be_better_by_being_prepared_in/", "title": "How you can be better by being prepared in advance for the worst.", "social_network": "reddit", "user": "CharlesHurstCanHelp", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1634416760, "permalink": "/r/DecidingToBeBetter/comments/q9k48j/how_you_can_be_better_by_being_prepared_in/", "nsfw": false, "first_save": 1635435065.6441183, "replies_charged": false}