{"id": "t5_2tand_t3_p3kcip", "request": ["4b69452a-b1e5-47af-a734-ad3c2bdce185", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "Recently, I've (30 M) been house hunting in a big city in UK. Every house that I liked got taken in a matter of hours after I viewed it. Thus, in a state of panic, I signed a tenancy agreement to a house without having seen it in person. When I went for the viewing, I realised the location wasn't favourable. Thus, wanted out of the agreement before moving in. But because I've signed it already, I can't anymore and am liable to pay the rent whether I live there or not. This has made me descend to a state of extreme regret and self-loathing over the past week or so.\n\nHowever I've made my peace with it now, as the tenancy is only for a year and the house is not bad. I will train myself to focus on the things I can control over the next year and make sure I don't take any decisions in a state of panic or 'scarcity' mindset.\n\nI've made similar rushed decisions in my past relationships as well. I clung on to the first person who showed me any sign of affection, because I believed that I won't find anyone to love me romantically. Inevitably, the relationships went downhill. In retrospect it probably was because of my neediness and desperation to impress the other person.\n\nI'm going to dedicate the next year to learn how to be a rational optimist and get more self-esteem. I'll learn to take my time observing rationally before making any big decisions, be it in relationships or signing contracts of any kind. I'm investing in improving myself, physically, cognitively, financially, socially and emotionally to feel better about myself in general.\n\nJust to ask the community. Am I overreacting considering the rental agreement mistake as a huge catastrophe?\n\nEDIT (20 Aug 2021): For anyone who cares... They found a new tenant, so I'm no longer liable!!!! Can't believe my luck! Thank you!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p3kcip/deciding_not_to_make_decisions_in_a_state_of_panic/", "title": "Deciding not to make decisions in a state of panic", "social_network": "reddit", "user": "DragonWarrior008", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 24, "down_vote": 0, "creation": 1628848665, "permalink": "/r/DecidingToBeBetter/comments/p3kcip/deciding_not_to_make_decisions_in_a_state_of_panic/", "nsfw": false, "first_save": 1635437468.892881, "replies_charged": false}