{"id": "t5_2tand_t3_kpxwmb", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "This is going to be a long one\n\nHere i am again, 12 PM, sitting on my bed and feeling like shit for no specific reason. I had a great new years eve with friends but after they left, im back at feeling hopless and low. It's not like im afraid they will leave me, i love my friends. In fact, i really needed some time alone. But when im finally alone, that's when all the negativity repeats itself. Like a bully telling you all kinds of things like the bad things you've done and what a loser you are and why you should just kill yourself. While im trying my best to shut him up because i know it's bullshit. I love who I am but at the same time I don't even know what that means. Im sick of it. I don't know how to love myself anymore.\n\nHere is a bit of backstory. When i was 11 I was diagnosed with Aspergers syndrome. I didn't know what that meant and i didn't care much, because I always felt like a black sheep around everyone. So what was that stupid label gonna do for me anyway? Nothing, except for my parents to actually treat me like a black sheep too. The kid with the big ass manual and suddenly they were the professionals in knowing what I needed and almost forcing me to take adhd pills that suppressed my mood in every way thinkable. Because later on we found out I had adhd too. But fuck that, I was me, and I wanted people to know the real me. But this has caused me to shut off from everyone and completely burrying all my emotions.\n\nI remember when I was about 15 years old, we went on vacation to australia and we visited a music store there. Me, who listened to a lot of rock music at that time, decided hey why not learn to play the guitar. The first thing I did when we came home was buy an electric guitar and played the hell out of that thing everyday after school. I loved it. I finally began to understand myself better. I discovered my creative side and the reason I love making music. The music I listened to and the songs I wrote spoke back to me, comforting me. Like a hug from a loved one when you haven't seen them in years. It was like every note I wrote held more meaning than any word I ever spoke to anyone. It was my only outlet of self-expression, and it still is. I'm thankful that I found that part of me.\n\nThen around my 19th birthday, I more or less got kicked out of the house. I was always in a fight with my stepdad throughout my puberty and it got to the point where we were yelling to eachother everyday and sometimes even beat eachother up. My mom calling the police and everything. That just made me feel even more like a giant asshole. I reached my limit and deciced to evade him completely, only showing my face for 10 minutes during dinner and then going upstairs to play guitar or go drinking outside with friends.\nThen around my 19th birthday they were looking for like a care home for autistic adolescents where I would live. But of course there was a waiting list. A friend of mine his mom saw I wasn't doing too well and she spoke to my parents to take care of me while I was waiting to move to the other place. I stayed at my friend's house for 4 months and I am forever grateful to his mom for helping me out.\n\nAfter that I didn't speak to my parents for quite a while. I was upset, angry, I was done with everything. I didn't know how to feel and started smoking weed to calm me down and help me unwind a little. But it was only to numb myself from all the pain and shame I refused to accept. I began experimenting with more and more kinds of drugs like xtc, shrooms, ketamine, 2cb, only trying to find a sense of self. My first time doing xtc tho I felt so much love for my friends and had so much empathy for everything. The rage and hate inside of me was slowly decreasing after that and I began to appreciate life more.\n\nBut while that was a very pleasant experience for me, I realised it's not the outside things that bring you happiness and fulfillment. It was then that I started to become interested in buddhism, spiritualtiy and every other aspect of self-exploration, for example the mbti personality test and zodiac signs and learned a lot from that.\nTurns out i'm the INFP personality, which means Introverted Intuitive feeler perceiver (https://www.truity.com/personality-type/INFP) and it's very closely related to the pisces zodiac sign, which I am also. I think that's kind of funny. It basically means I'm extra sensitive to every thought and emotion that pops up but also like to see the best in people and to give them a chance to find a place for themselves in this world. But that also counts for me. It' my responsibility to create a life of fulfillment for myself instead of focussing on how much money is in the bank.\n\nI told myself to face the facts. If I wanted to feel happy, I had to let go all of that built up rage towards my parents. But that wasn't going so well. I began to smoke more weed, almost everyday, trying to get into deeper thinking and hopefully letting go of that anger, but it just let me feel nothing at all.\nIt was then that I decided to take ayahuasca at a retreat close to amsterdam. For those of you who don't kmow; ayahuasca is a centuries old medicine from the amazonian forest made from leaves and vines and brewed into a tea. Ayahuasca is known for healing past traumas and to remove blockages in your life. And it sort of did. I was finally able to speak about my frustrations to my parents and wanted to move forward. We are more close than ever now. Life went uphill for a while after that.\n\nBut now about 1,5 year after my ayahuasca ceremony, the feelings of despair and loneliness are coming back. I have decided that I want to help people heal who also struggle with these kinds of problems like I do with the help of music therapy and meditation. But I just can't make one single step towards it. My self-doubt is forcing me to rather stay in bed all day watching Netflix and yet again, I am evading the problem. I know damn well the steps I need to take, but something inside of me is refusing me from doing it.\n\nIf you have any advice for me, please let me know. I want to feel like myself again.\n\nAnd thank you for reading this, the fact that you've read it this far shows me that pleople care", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kpxwmb/my_head_still_feels_like_one_big_fog/", "title": "My head still feels like one big fog", "social_network": "reddit", "user": "McSjonnie9261", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1609723437, "permalink": "/r/DecidingToBeBetter/comments/kpxwmb/my_head_still_feels_like_one_big_fog/", "nsfw": false, "first_save": 1635437676.7764084, "replies_charged": false}