{"id": "t5_2tand_t3_mhnjww", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "Today I got a phone call. “Is this Quartz_Starbursts Properties? Do you still have your rentals, or no? I had a friend rent from you in 2015 and she said you were amazing.” Really, really, long pause... “No, I don’t have any condos anymore, but tell your friend thank you, and I hope you find what you’re looking for.”\n\nI was a really good landlord.  I exclusively rented to new Marines entering officer’s school and their spouses, and I took a lot of time to educate them on how not to get screwed by future landlords and how to avoid the long list of scams that are purposefully perpetrated on new service members and their families.  My rental never sat for more than a a few days, due to word of mouth.  That’s right - rental, singular. I started a company, made it plural, because I had a $100k in equity in that rental and I was about to buy more.\n\nI didn’t graduate high school with my peers. I never finished anything. I joined the military, did okay, but generally let everything hang, and never accomplished a single thing. Grew up in a tiny town, with a tiny sense of reality, in a family that new how to work hard, but generally knew little else, and frowned upon planning anything or engaging in anything beyond the front lawn. Looking back, there’s constant bone crushing apathy, or some serious depression and anxiety and a bit of childhood trauma disguised as apathy, and a deep sense of worthlessness that’s hard to describe.  Well, not so much disguised as apathy, but masquerading as an apathy monster that could devour every bit of life.  When I finished basic training, I cried for a day. I just assumed I’d wash out, and that would be that. It didn’t occur to me for another 8 years that I could actively pursue that feeling of accomplishment and put effort into my existence. \n\nEven then, it wasn’t for me. I left the military in the midst of the Great Recession - because who plans major life transitions - just role with it, it’ll be fine.  Brand new baby with relatively new wife who is very old friend. Bar tending in my late twenties. Some savings from military time, but it’s getting thin. No one is hiring.  Post 9/11 GI Bill is signed into law, I could kiss John McCain on the lips.  All I have to do is enroll in college and you’ll pay for my housing and extra money for food? I can do that for 6 months and treat it like a job for paycheck.  Kid’s gotta eat. Wife needs a place to sleep. I’ll make it work.\n\nI pass all my classes. Get paid.  Feel a bit of accomplishment.  Son is 4 months old, diagnosed with genetic disorder, needs first surgery.  Wife gets Graves’ disease, is hospitalized. Chaos. Pure chaos. Savings is gone. School is over.  Bar tending is not cutting it. Move across country to live in in-laws basement.  Apathy monster is in in full effect.  Live in basement at 28, get decent job in call center, use newly acquired college skills to hang on through training. Do okay. Make what should be minimum wage. Try to listen when son’s 12 different specialist doctors are talking, try to help wife through treatment.  Cannot get out of bed in morning, but cannot face the alternative.  Son will not have good life, even if I try. Son will never be “normal.”  Son is going to need “care” forever.  Wife gets low paying entry level government job.  Get insurance. Schedule all sons appointments in big city children’s hospital where all specialists are specific to his genetic disorder. \n\nBoss at call center NEEDS to know why I need 2 days off before a weekend (when all specialists can be seen). This place only lets you have 12 minutes a day for bathroom breaks. Two days is too much. “You’re going to need to explain. In detail. Or you’re not taking the time.” Can’t explain that son is broken, can’t look him in the eyes. Sales are not good and this man runs my life. Something breaks in my head, I have no security, no control, no right to medical privacy, nothing.  Fuck this apathy. Fuck this life. I’m taking my son to appointments and I’m not explaining it to anyone.\n\nAsk wife/long time friend... “hey, can I quit right now, go to appointments, and do the college for paycheck thing again.  I know that sounds crazy, and we’re approaching 30, but I can’t do this anymore.” Wife sees something is broken, but in a good way. Says that I’ve been there for her and him and I can do what I need to do.\n\nI finish things. I learn what all 12 specialists are supposed to be doing and teach myself all the genetics that I can.  Learn son is not broken, learn that son can be empowered by my life. Learn that I’ve been looking at it all wrong, doing it all wrong. Apathy monster comes out, I fail a semester at 30 years old, but I get back up do it again, succeed.  Finish things, makes lists, get moving, keep moving. For him, for her.  Use GI Bill money to buy a condo, fix up condo super nice using my small town poor-boy skills, raise son as fully engaged super father, go to appointments, schedule appointments, make it work. \n\nMake deans list in senior year. Get paid internship, 1 out of 400 applicants. 31 years old, veteran, good story, sell it like there no tomorrow, because there isn’t. Kid needs to eat, lady needs a place to sleep and no man will ever tell me that I cannot take my son to appointments.  Graduate at 32 years old.  Move up quickly, terrified, truck driver’s son in a suit and tie, sitting at tables bigger than a semi trailer, fight the imposter syndrome, fight the apathy. Keep it at bay, get a counselor, get therapy, learn that I’m broken, learn that I’m not worthless, learn how to do big fantastic things. Empower son. Empower wife. Wife gets masters degree.  We need to eat, we need to sleep, we need security, nothing else matters.  \n\nSon is 9.  Wife is 34. Buy new home. Rent condo to Marines, start side company for rental, soon to become rentals.  Career is still moving. Life is beyond wildest dreams, reach peak level of security. Help those who are needing a place to sleep and food to eat. Leave hope in my wake wherever I go. \n\nDoctor says to wife “I wish I had better news, but the lump is not benign. Not something to expect at this age I know, but you’re young, so we can treat aggressively.”  Wife has extremely aggressive breast cancer.  Chemo must start in three weeks.  Chemo destroys her. Cannot work. Sell condo. Pull out half of only 401k I’ve ever had. Put $50k on credit cards. Chaos. Pure chaos.\n\nApathy monster is in full effect. Stay good for son. Hold him close, hold him tight. Fight the apathy with everything I have. What was this all for? To restart life at 32 just to have it taken apart price by price? 8 months of chemo, bi-lateral mastectomy, 3 months of radiation. She lives. Broken, we’re all broken, but she lives.\n \nCareer is good. I’ve managed through the chaos.  Fuck this apathy monster. Rage at the universe. Double down and turn apathy into energy.  Reach new heights, take years to pay down debt, will never own another condo, will never have properties - plural. But that 100k bought a life, let it go. Let it all go. \n\nPandemic. At home for a year. Running operation of 80-100 people. Never worked remotely, any of us. Chaos, pure chaos. \n\nGet a phone call “is this Quartz_Starbursts properties...” the apathy monster comes out of its hole. Lumbers around... what would it be like, all these years later? 5 properties? 10? Would I have wealth to hand down to children? I hate the American medical system with the deepest passion. What the fuck is this all for? Will it happen again?\n\nIt will probably happen again. It’s my sons 16th birthday today and I am going to enjoy every moment of this evening with him! Fuck you apathy monster. I know that I can ride out asteroid strikes to my life and keep on kicking. So instead of sitting here for one more minute, and entertaining you, go back to your hole. Let me tell this story to someone.\n\nI doubt anyone is still reading. But if you are, here’s the deal: I couldn’t imagine doing what I’ve done, and survived a year like 2020 in the beginning. It’s nearly crushed me, and I’m in complete control of every aspect of my life.  It would have destroyed me back then.  So if you’re out there, and you’re making yourself better, KEEP MOVING. Keep fighting your monsters. Not just for your well-being now, but so you can weather the grandest storms and keep moving later.  Deciding to be better is a gift to your future self, your future family, to your life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mhnjww/sometimes_it_will_fall_apart_be_better_when_it/", "title": "Sometimes it will fall apart. Be “better” when it does.", "social_network": "reddit", "user": "Quartz_Starbursts", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 112, "down_vote": 0, "creation": 1617251309, "permalink": "/r/DecidingToBeBetter/comments/mhnjww/sometimes_it_will_fall_apart_be_better_when_it/", "nsfw": false, "first_save": 1635436839.3317966, "replies_charged": false}