{"id": "t5_2tand_t3_g7r9yw", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "- Let me know your thoughts, comments, advice, etc.-\n\nDate: April 25th, 2020\nListening to: Angus MacRae\nSnacking on: Mandarins\nTime: 9:00am\n\n\n  I wonder how I’m feeling. I’m ok. Haven’t slept since yesterday. I’m thinking of the act of breaking our limits. It’s been a while since I’ve done that. Last time was definitely 4 years ago. It ended in major heartbreak. I feel as if that heartbreak is the reason why I haven’t pushed myself since. It wasn’t like it was the end. I could’ve salvaged the situation; came back stronger. That’s the functionality of breaking your limits. You discover the error in how you handled the fall; with that knowledge my limits have expanded, as well as my grace.\n\n  I’m very far removed from my limits as of this moment. That is the discomfort of my comfort. Knowing that I’m not drawing nearer to my limits, It hurts. To know that I’ve removed myself from life; from the challenge of it. I am an escapist; I run. I cannot face. I fear that conflict will bring me pain, although I’m aware that I can manage pain. I’ve experienced pain, all too much for my short lifespan, maybe the last blow broke my internal barrier. Maybe my internal barrier had been broken all along, and my heart had been taking the damage. Maybe I’ve been lying to myself. A heavy heart bears heavy armour, and maybe my armour was lighter than I thought it was. \n\n  Maybe this is the process of rebuilding. Maybe writing will help it along. Nothing else has worked. Maybe it’s a misguided attempt at regaining what was lost; my ambition, my drive, my passion, and my Determination. I can’t seem to find it anymore. It’s not where I once left it. My phone, my laptop, my inability to focus; they have taken over my life. When did I lose so much ground? \n\n  Maybe I can’t find passion, it has to find me. Maybe I have to be reflective and appreciative of my previous Determination in order to win it back. Maybe you don’t pick your own Determination, It picks you.\n\n\n  Determination is a treasure; It’s a conscious spirit, If you are not appreciative of It then It leaves you. If you don’t push, you aren’t pushed back. If you don’t give, you aren’t given back. If you don’t appreciate determination, It doesn’t appreciate you. When once It was your friend, It is now your bane. It doesn’t want you, no amount of excuses will bring It back. Remember what It did for you, and forget what you gave up in return. Remember not your sacrifice, but your willingness and its abundance instead. You’ve focused on your loss, rather than your willingness in incurring those losses. It wasn’t that you worked hard, it wasn’t that you sacrificed so much, it was that you willingly gave it all away. It was easy to give up in order to transcend, but now you’ve forgotten the key to sacrifice; willingness.\n\n  Determination, I want to thank you from the bottom of my heart. Waiting for You is the reason that I live. You are unlike anything else in this world: The flow You bring and the peace that accompanies it, not the pleasure but the fulfilment of having You, and the animalistic passion You inspire. You are what it means to be human. With You, justification of life is unnecessary, and the sting of death is forgotten. The aroma that You give off is intoxicating; it mystifies those that smell it, they cannot help but to fall for Your alluring presence, and who can blame them. Everyone wants a taste of greatness, and with You, I could taste it in my dreams. You charmed me, You enticed me, You gave me hope. You have left me, and without You I am incomplete. \n\n  I miss You.\n\n  - Lazy Man", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g7r9yw/the_journaling_of_a_lazy_man_wanting_more/", "title": "The Journaling of a Lazy Man Wanting More", "social_network": "reddit", "user": "LazyManChronicles", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1587809851, "permalink": "/r/DecidingToBeBetter/comments/g7r9yw/the_journaling_of_a_lazy_man_wanting_more/", "nsfw": false, "first_save": 1635435827.9774494, "replies_charged": false}