{"id": "t5_2tand_t3_kxllm4", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I’ll share something with you that cracks me up: A lot of people I know seem to think I have a lot of discipline and willpower.\n\nI’ll let you in on a little secret:\n\nI’m incredibly lazy. I fail at my daily habits multiple times a week. I cheat on my diet. I skip going to the gym (for months at a time). I give in to my addictions all the time.\n\nI’m anything but disciplined and strong-willed. I spend hours a day lazing around on the couch, mindlessly watching stupid shit on Youtube. Give me a choice between doing what I should do, and doing what I want to do, and I’ll almost always go with the thing I want to do.\n\nI’ve always been poorly-disciplined. And you know what? It doesn’t matter. I’ve learned to be kind to myself, to not beat myself up for it, to just accept my laziness and make the most of my life anyway.\n\nSo how have I achieved any of my goals? How have I gotten myself a great dating life, [lost a tonne of weight](https://kyil-extra.com/how-i-lost-weight/), done a photo-a-day challenge without missing a day, started two websites, become a life coach, rack-pulled 200kg, blah blah blah?\n\nBecause even though I’m a lazy piece of shit sometimes (often), even though I lack willpower and discipline sometimes (often), I still take tiny little baby steps forward each day.\n\nThere’s a reason I never shut up about the book, The Slight Edge. It is THE reason I’ve been able to achieve 95% of my goals, without any willpower, and certainly without any discipline. The idea in the book is that: as long as you’re working on your goals a tiny bit each week, as long as you’re taking more steps forward than backwards (even if those steps forward are pathetically small), you’ll eventually hit your goals. Progress is measured over the long-term; it doesn’t matter how many lazy days you have, as long as you also have some good ones thrown in there too.\n\nThe bad days don’t matter.\n\nIt really doesn’t matter how many fuckups you have, or how many times you cheat on your diet or get lazy with your goals. It doesn’t matter how many times you fail, or embarass yourself, or pussy out on a challenge. All that matters is you just never quit.\n\nMaybe one day I’ll set up my camera and do a time-lapse of my day so I could see how much of it is spent lazing around on the couch, self-medicating, avoiding the things I know I “should” be doing. I know it’s easy to look at peoples accomplishments and say, “I bet he’s a badass” – I’ve lost count of the number of times people tell me they can’t do what I’ve done because “I’m not a badass like all of those successful people out there”\n\nAs a 'successful' guy that people have put in that group, that's bullshit.\n\nI’m the last person on Earth you’d ever call a badass (if you really knew me) and I do not want you to use your “lack of discipline” or “lack of willpower” as an excuse not to achieve your own goals. You can find your own success, if you’re willing to put aside the notions of willpower and discipline, and instead focus on just taking baby steps each day and never ever quitting.\n\nThere’s other things you can do too – I’ve spent years figuring out how to get myself – a very lazy bastard – to actually work on his goals. I call these things my “cheats”. One cheat that’s helped is bribing myself – and boy do I use this one all the damn time.\n\nI bribe myself to go to the gym. “If I go to the gym today, I’m allowed to buy an expensive steak and enjoy it.. but only if I actually go to the gym.”\n\nI bribe myself to write articles like this one. “If I write an article, I’m allowed to then spend the rest of the night watching mindless Youtube videos until I fall asleep.”\n\nI bribe myself to do even basic tasks like doing the dishes or cleaning my house – I have to bribe myself every single time I need to do chores. “If I start cleaning the house, I’m allowed to listen to my favourite music or a podcast I’m really into.”\n\nSteal this cheat from me – use it yourself. Bribing has been my go-to method for dealing with my lack of willpower and my total unhinged laziness. Bribing yourself with nice rewards really does make it a lot easier to do the things you don’t really want to do. It really is really damn effective – you’re giving yourself a planned reward for completing tasks you don’t really want to do. Just make sure you pick bribes that are healthy – don’t tell yourself, “If I go to the gym today, I get to inject heroin into my arm!”\n\nAnd on the flipside – be careful with berating yourself and yelling at yourself to work on your goals. It definitely works for some people (if it does – great). But I’d caution against doing it too often; it can very quickly develop into a pathology or devolve into self-hatred. Most guys who are into self-improvement are already cunts to themselves sometimes; you might find a bit of love and kindness works better at actually getting yourself to work on your goals.\n\nYou can also “cheat” by only working on one or two big goals at a time (it’s fine to also work on a couple of small goals at the same time – as long as they’re very small goals). Prioritising just one or two big goals makes it a hell of a lot easier to put in the consistent daily work – because you’ll simply have more free time, more mental energy and more emotional energy to focus on those one or two big tasks, rather than being stretched thin across a bunch of big goals.\n\nLast year, I was prioritising writing for my site and working out at home. I was completely neglecting my dating life. Because I was going hardcore with writing and the gym and nothing else, I don’t have to rely on willpower or discipline or forcing myself to tackle multiple giant goals at once.\n\nAt other points in my journey, I’ve focused solely on my dating life + going to the gym – and neglected just about everything else. I put aside my career, my finances, my social life and a bunch of other things, just so I could go hard with feeling like I could be good with women and improve my body. And again, that didn’t require much willpower or discipline – because I only had to tackle a couple of things at a time. Slow and steady won the race for me.\n\nYou can do the same – just pick one or two big goals you want to achieve, and make those your main priority. If you have extra smaller goals to add on, just make sure they’re very easy to do and take almost no effort – the idea is they shouldn’t be draining your willpower or discipline. Focus on the one or two big goals, and you’ll find you don’t really need much willpower at all.\n\nYou can also “cheat” by making your habits so pathetically easy you can’t help but do them. If you want to go to the gym, instead of saying, “I have to go to the gym and do my full workout”, you make it so easy you can’t help but do it. “I only have to walk to the gym. As long as I step foot in the gym, I’m successful. I’m literally allowed to walk into the gym and then immediately walk out – as long as I go to the fucking gym.”\n\nYou’ll find by lowering your goal to “I’ll literally just step 1 foot into the gym”, you will always go to the gym. That’s so pathetically small you will never skip it. On your absolute worst days – eg a day where you have a really bad flu or something – you’ll drag your sorry ass to the gym, put one foot inside, and then turn around and go home. Congrats! You were still successful – you stuck to your goal.\n\nI know that seems very weak – after all, how the hell does stepping 1 foot into the gym actually help you get a killer body? Because it’s building a habit. If your absolute worst day is “I still went to the gym” – isn’t that better than “I sat at home being lazy”? It means the millisecond you feel better, you’ll go to the gym and crush your workout – because you’ve already built a habit of going to the gym.\n\nAnd you’ll find on many “bad” days, if you can just drag your butt to the gym, often you’ll get there and think, “Ok, I didn’t want to come to this stupid gym but I’m here now. Maybe I’ll just do some lazy bicep curls or something then go home.” You’ll start doing your curls and you’ll realise, “This feels ok, actually. Maybe I’ll do a bit of bench pressing too.” You’ll do that, and before you know it, you’ll end up “accidentally” doing most of your workout. You’ll go home, feeling like a fucking boss – it started out as a shitty day, and you turned it into a pretty damn successful day – just because you stepped foot in the gym.\n\nIf you didn’t have that pathetically-small goal of “I will just step 1 foot into the gym”, there’s no way you would have gone to the gym. It would have taken too much willpower – willpower you didn’t have, because you were having a shit day. Having a super easy, pathetically-small goal ensures you will always be successful – even on your bad days.\n\nThis is the concept behind the book Mini Habits – you set such a tiny task that your success is basically guaranteed each day. Over time you’ll build up a habit of always actually working on your goals (even just a tiny bit – baby steps).\n\nFocusing on the end goal is another good “cheat” – let yourself fantasise about your end destination, what your life will look like when you get to your goal. If you’re trying to lose fat, and you’re finding it hard to go to the gym, let yourself really obsess about what it’s going to be like when you have the body you’ve always dreamt of.\n\nGet a big piece of paper out (or use your laptop) and write down exactly what your life will look like when you hit your goal. In the case of going to the gym, let your mind go wild:\n\n\\------\n\n“When I get down to 10% bodyfat, I’ll finally have abs, which is something I’ve always wanted but never thought was possible. I’ll feel so fucking proud of myself for finally looking elite; I’ll be able to look at myself in the mirror and smile. I probably won’t even believe that’s me staring back; what a feeling that’ll be.\n\n When I’m lean, I’ll have an amazing jawline, so I’ll literally just have to stand there and I’ll naturally look good in every photo I take of myself. Girls will tell me how good my body looks, which will be incredibly validating – I never ever dreamt I could have a girl tell me I have a good body. That’ll seem so surreal and I’ll probably even cry with joy as soon as she leaves. \\[Andy’s note: Yes, I have done this\\].\n\nPeople will be nicer to me in general (the halo effect), and I’ll get more looks on the street – I’ll feel noticed. It’ll be easier for me to get promotions at work, because people will respect me more – they’ll assume if I look this good, I must be worth something. I’ll find people wanting to be my friend more. It’ll seem like the whole world is nicer to me now that I’m lean.\n\nBest of all, I’ll have proof that I’m capable of doing something that’s pretty hard – I’ll have proof I’ve achieved a big goal. And not just any goal – this will be a big goal that requires discipline, and patience, and many months to achieve. I’ll know that if I’m able to achieve something big like this, I can go on and achieve the next big goal, and the next, and the next. I’ll be showing myself proof I can literally do anything. The sky’s the limit.\n\n\\------\n\nPretty god damn motivating, right? Focus on that every day, read it out loud to yourself in the moments where you’re lacking motivation and lacking willpower. It might seem like I have a lot of discipline and willpower, but really I’m just “cheating” a lot by focusing on my goals and fantasising about how amazing it’ll be when I achieve them – especially in the moments where I struggle to do the things I “should” be doing.\n\nMy friends who’ve achieved great things do the same – they obsess about the goals they want to achieve, and how their life will look when they get there. Then they take tiny little baby steps each day towards their goals; no willpower required.\n\nWhen it comes to discipline with vices and addictions, I have no willpower there either. Put a bottle of whiskey in my house and it’ll be gone 2 days later. Leave me at home alone and chances are I’ll waste half the day jerking off to porn. Tempt me with junk food and I’ll likely eat all of it, until I’m 6000 calories deep and bloated and gross and feeling utterly disgusted with myself.\n\nSo, cheat like I do – remove those vices so you’re not tempted. I never ever ever have alcohol in my apartment; otherwise I’ll just drink it. If I’m going to a bar, I leave my wallet at home and just drink water. I use a browser extension to block porn websites so I can’t visit them. I make sure there’s never any junk food of any kind in my apartment – I haven’t had junk food in my cupboard for the last 5 years.\n\nIt goes deeper – I know there’s certain things I couldn’t stop myself from doing (I have a very addictive and obsessive personality, as two of my coaching clients have even pointed out). I’ll never try any drugs that have even a hint of addictiveness to them. Alcohol was enough of a learning experience for me (I held off having my first drink until I was 22, and when I started drinking, I quickly became a drunk-every-day alcoholic).\n\nI’m bad with eating too, especially when I’m on a diet. I have such little willpower I’ve literally thrown food out so I won’t be tempted to eat it… Then gone through the bin and dug it out and eaten it anyway. The way I stop this is by “ruining” the food – eg running it under the tap so it’s soaked and wet, or breaking it into little bits and pouring salt all over it before I put it in the bin. That’s not glamorous, but I’m human.\n\nI’m really not kidding when I say I have zero discipline when it comes to my addictions, so I just never put myself in a situation where I’d have to use willpower to control myself. You can steal my “cheat” here too – get rid of all temptation. Maybe you struggle with food; get rid of it. Maybe you play too many video games; uninstall them all. Maybe you watch too much Netflix – cancel your account. Out of sight, out of mind.\n\nYou can have those vices back once you’ve achieved a few of your goals – after all, rewards are nice. But if they’re hindering your progress right now and getting in the way of your success, remove them.\n\nI’ve discovered other “cheats” that help me – I struggle with writing for this site sometimes – and my lack of willpower and discipline hasn’t helped. The way I’ve made it work is to not have a structured or planned time in which I write. I just laze about on the couch (usually watching YouTube), and when I feel like writing, I write. Yeah, that’s lazy – but it requires zero willpower and zero discipline. And given I’ve written over 278,000 words for this site so far, I think it’s working for me.\n\nThe final “cheat” I’ve discovered is to outsource your motivation. I don’t have any discipline with the gym – I’m a lazy bitch. So I pay an expensive powerlifting coach to keep me accountable and force me to keep making progress. I’m not motivated so I literally hand him money to be motivated for me. I get to be a lazy bastard, knowing that as long as I’m paying him, he will motivate me and push me and force me to reach my goals.\n\nIf you’re struggling with your diet, pay someone to keep you accountable. If you’re struggling to keep up a habit of hitting on girls, pay someone to keep you accountable. Stop relying on your own fleeting/non-existent discipline, and just pay someone else to be your external-discipline.\n\nMost of my coaching clients aren’t super disciplined, but it doesn’t matter. They’re doing what I do with my strength coach; outsourcing their motivation to me. They pay me for weekly check-ins so I can keep them accountable and push them if they’ve been lazy, and help them get back on track if they’re in a rut. They know they sometimes struggle with discipline, so they pay me to be disciplined for them.\n\nAnd finally, I’ve said this a million times – you can’t assume I have my shit together all the time, just because I’ve achieved a few goals. I’m full of doubt, full of insecurities – that’s just part of being a human. The only reason I appear to have my shit together is because my successes cover up my failures; my highs distract from my lows. I’m also a very optimistic person who prefers to focus on the good, rather than get bogged down in the bad; so most of what I show you is my successes.\n\nThe only way I’ve been able to achieve anything is by implementing all these little cheats, and figuring out ways to bypass discipline and willpower. Yes, I’ve actively avoid discipline and willpower – I run from them. I’m a lazy bastard, but I’m also a cunning one 😉\n\nYou can do the same. Steal all of my cheats, and trick yourself into looking like a disciplined person. You can be a complete fucking trainwreck and still achieve great things. Being a bit of a loser doesn’t exclude you from being a winner.\n\nGo out there and fucking win.\n\n\\-Andy", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kxllm4/discipline_willpower_dont_fucking_matter/", "title": "Discipline & Willpower Don’t Fucking Matter", "social_network": "reddit", "user": "handyandypandy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1610680061, "permalink": "/r/DecidingToBeBetter/comments/kxllm4/discipline_willpower_dont_fucking_matter/", "nsfw": false, "first_save": 1635437602.4229283, "replies_charged": false}