{"id": "t5_2tand_t3_ndv5vb", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "There were a few incidents that cause me to go down into a spiral of depression, but ig i was good at pretending it was all good no one really cared and ihad always been a secretive person so never told any of my friends what i was going through. In my country and the traditions ig depression and therapy is a taboo, parents feel like their honour or some shit is lowered if their son / daughter commits suicide so the thought of end it and the thought of disappointed and letting my family down if i killed myself were always in a clash. I used to weep almost every night and couldn't sleep and couldn't eat. Getting up to go through the fucking day felt like such a hard task but again had to do it cause my teachers wouldn't grant leaves and my parents didn't want me to skip college for some bullshit reason and hence i spent my days at there just distanced and away. I remember my home page for my browser was a website on most effective ways to end my life , it was givenupallhope or something i don't want to look it up because its just too traumatizing. Fast forward a few months living like this i had found muscle relaxants that would cause severe drowsiness and make me lethargic enough to put myself down, had lost weight and felt like shit. I did try to ask a friend to hook me up with some anti depressants but she forgot i guess and I didn't want to seem like i was seeking attention so i decided to let it go.\n\nIt was in the most weird pill sedated state that i had a logic less realization that i would just stop existing and it wasn't the joy of living but the most scary feeling to stop existing i swear i cannot explain what that was, i spent the rest of the night insanely crying no idea of what i was gonna do, the next morning i decided to just get up and wash my face that's it. slowly moving forward from that to eating and saying hi and deleting the chrome page.\n\nIts been almost a month and yesterday morning i had enough motivation and energy to get up and go downstairs to get a piece of bread from the shop. And i dont know why or how i felt and saw the colors the tree was a bit green the road was black the wall was white the sky had some colour and i think i remember all of this time period in such a pale colour.\n\nIt still a journey but i guess i felt a bit happy like it was a goal or something, my first thought on writing this post was how people will think im a junkie or what they'll judge me or if someone will think of this post as utter bullshit but thats my goal for today to share this with some people who wont know who i am and i wont have to face the judgement that will cloud them.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ndv5vb/saw_colors_after_a_long_time/", "title": "Saw colors after a long time", "social_network": "reddit", "user": "Negative_Zombie_2888", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1621191418, "permalink": "/r/DecidingToBeBetter/comments/ndv5vb/saw_colors_after_a_long_time/", "nsfw": false, "first_save": 1635436997.3341486, "replies_charged": false}