{"id": "t5_2tand_t3_fc12ro", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Hi all,\n\nLet me share my story. I grew up in shitty times in Eastern Europe, in a pretty violent place. At my early 20s we used to do all kind of shit stuff, felt invincible, had all the ego and confidence in the world and would get into fight for no reason. Somewhere around my mid 20s after series of incident I decided to change. From street hooligan and grifter to model citizen. Now, at my early 30s I am completely different person - polite, reasonable, helpful and apologizing. I avoid troubles like a plague, sometimes at the expense of being a \"chicken\". I look a bit nerdy now, with glasses and big smile, but still can street fight pretty good - two times tried to be robbed, not ended well for the wannabae robbers. I'm neighbour role model now. It sounds great at theory, but I feel conformist. For example, if somebody messes my order I don't even mention it so this would not make them feel bad, if somebody tries to screw me at shop, I just say \"ok, I will think about it\" and leave, without making a fuss. Old me would at least make some verbal assault and assert dominance. New me is always looking for solutions with minimal traction. I'm now just the opposite of what I used to be. But I think sometimes to be little edgy is necessary. \n\nSometimes people take my actions as sign I'm weak and they can screw with me. My course of action is to walk away, not making any problems, not even saying anything than apologizing. I will not even think about the try for confrontation in five minutes.  \n\nWhat I fear is that if I react to some situation a little bit aggressive, things **will** get out of control. Don't get me wrong - I live happier life with almost no stress and I like it. But I also lost my macho, this seems to be the trade off. How does one balance these two? I think both polarities are not good and man have act strong or soft depending on the situation, but it's not working for me. It's like the ex-convict who found religion and now is annoyingly righteous. \n\nI seek advice from people who found this balance. How did you manage to stay manly without being jerks? How do you keep things under control? What was the 'a-ha' moment?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fc12ro/finding_balance_between_being_chicken_or_macho/", "title": "Finding balance between being chicken or macho", "social_network": "reddit", "user": "bassta", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1583098458, "permalink": "/r/DecidingToBeBetter/comments/fc12ro/finding_balance_between_being_chicken_or_macho/", "nsfw": false, "first_save": 1635435281.0615845, "replies_charged": false}