{"id": "t5_2tand_t3_pazycv", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": " \n\nMy name is Collin McSpirit and I am currently a psychology student with a fascination and history with video game addiction!! I created a Discord server called Rs-addiction-help to talk about Depression, Anxiety, and Suicidal Thoughts. If you are a normal passer by, come in to join the discussion with managing video game addiction and depression!  Thank you very much for stopping by.  If you have any questions please comment below and I will do my best to answer as soon as possible.  My passion is to help people so if you know of anyone struggling, give them my discord information and I will personally talk to them.\n\nCMcspirit22#9695\n\nInterview Conducted by Sean Carter\n\nJust Log Off - Collin McSpirit\n\n**For sixteen of his twenty-six years, Collin McSpirit lived in the addictive clutches of the video game RuneScape. Now, he’s a psychology student at the community college of Denver raising awareness of the adverse psychological effects of technology. In this interview, Collin discusses how video game addiction affected him and offers advice.**\n\n**My questions are in bold; Collin’s responses are edited in plain text.**\n\n**What makes RuneScape so compelling?**\n\nHow much time do you have? Haha! If any members of the RuneScape community are reading this, they know how it is: once you’re a ‘scaper, you’re always a ‘scaper. Like any MMORPG, you have skills. If I mine a rock, I don’t just get an ore, I also get some experience. Each skill has a max experience level of 99: when you achieve that level, you get a skill cape. That’s a powerful incentive. It takes dozens of hours to get to that level, but you’re compelled to want that cape. It looks good, and many people have it.\n\nThere’s an expression on RuneScape: “no XP waste.” It means, *don’t stand around, always gain experience.* When you gain experience, it releases dopamine, so you’re wasting your time if you’re not doing it.\n\nThen there’s the interesting part: you can buy gold with real money. Gold is the in-game currency, and it’s used at banks and at something called the Grand Exchange. Buying gold with real money is against the game rules, but many people do it.\n\nThere’s a fully evolved economy. There are people who just chop trees, go to the Grand Exchange, and put their lumber in there. Somebody buys it, and the logs go to use for fire-making or fletching or another skill. Sometimes there are multiple steps: with ores, people can make them into bars and gain smithing experience. Then they can make the bars into armor and gain more smithing experience. Finally, they can sell that armor for real money. Yes, there’s real-world trading. \n\nSome Venezuelans play RuneScape as a full-time job: they make money in the game and then convert it to real currency. Sometimes, they earn more doing that than the minimum wage they would get in the real world.\n\n**That's fascinating. So it's like the modern global economy writ small, even with specialization. It's consuming.**\n\nYes, yes, consuming. Absolutely. There is a draw to it. Whenever you’re going out to kill a boss, you can get a rare armor drop, and then there’s a chance of making real-life money too. There are backup incentives. \n\nWhat happens is that players get depressed. I played for so long that I knew many other people there that suffered from depression. We all talked about it. They also talked about drug use and drinking. It’s crazy. The poor guys are so addicted… many of them are still playing today.\n\nI can’t play it in moderation. I’m like an alcoholic: I can’t have just a couple of drinks, it’s all or nothing. I quit because it was taking up too much of my brain.\n\n**Could you explain how you got into RuneScape and how it took over your life?**\n\nI started playing video games with the Game Boy Color. Everyone was playing Pokémon Red or Blue; I had red. My gaming tendencies were probably implanted then.\n\nI got into RuneScape starting in fourth grade. Nobody thought much of it then. We would run over to the computer lab and play it when we waited for the bus. This was in 2004: it was a browser game that ran solely on Java. We would play it during sleepovers, between classes, that kind of stuff.\n\nAfter my parents got divorced, my mom let me quit all my sports and extracurricular activities, so I used the extra time to play RuneScape. I would sit around for eight hours a day, doing nothing but playing online. \n\nI played RuneScape off-and-on during high school. The classic saying is “once a ‘scaper, always a ‘scaper.” Even if you haven’t logged on for 400 days, it’s easy to pick it up any time and start using it once a day. When I did play it, I played it seriously, trying to get as much experience as possible to get a coveted 99-level skill cape. \n\nAfter high school, I joined the Marine Corps and did well. However, after I was honorably discharged in 2017 due to health issues, my situation got a lot worse. I felt that I hadn’t properly served my country. I started eating and drinking more, and my health deteriorated. I rarely saw the sun. Doctors told me I had a chemical imbalance and I was prescribed electroconvulsive therapy.\n\nAfter ECT, I picked RuneScape back up where I left off. Sunk costs compelled me to keep playing. I didn’t want to give up on my experience from thousands of hours of play. That’s not uncommon: many of the top players have spent upwards of 50,000 hours on the game. Even lesser players with skill capes (such as myself) need to spend 86 hours for each cape they earn, assuming they earn a sizable 150,000 XP an hour. There are exclusive high-level areas and communities for level-99s. I couldn’t just abandon that.\n\nThough I initially used RuneScape to cope with my depression, as it took over my life my depression aggravated.\n\nIt took a failed suicide attempt to convince me to quit. Now, the ECT’s starting to kick in, and I’m doing well. I’m a musician who does local gigs and a proud carpenter. I just want to emphasize that RuneScape hooked me in and led me to a really low point. If you’re playing RuneScape and you’re heading that way, my advice is to quit now.\n\n**Can video games be good in moderation?**\n\nSure. In moderation, video games release endorphins. You can go on with your friends and go do a heist or something. But when you start getting too into it, your life gets taken over by a façade. The turning point is when video games become isolating rather than connecting. The last days of an alcoholic are drinking alone, not partying.\n\nMaybe that’s why I liked RuneScape so much. It’s a solo game. This makes it better for escape: in solo games, you have an avatar, and you can just be a fictional character in a fantasy world. Multiplayer games bring reality back by introducing other people, which makes it harder to escape.\n\nBalance is the key.\n\n**If there are any RuneScape players reading this, what advice would you give them?**\n\nI’d say, “log off.”\n\n**They might complain, “It's not that simple.”**\n\nI know. \n\n**It's like life.**\n\nI know. \n\n**It's like logging off from life.** **It's like suicide.**\n\nAlmost is, man. Maybe it’s better just to wean off. It was tough for me. I was thinking about RuneScape at all times because it was my life since fifth grade. It started ingrained in me. \n\nI just want to say here: if you feel like you are addicted, just start somewhere, start getting outside, start eating better. \n\n**It’s not a pill, it’s a process.**\n\nExactly.\n\n**Thank you for your time.**\n\n*Collin runs the Discord server RsAddictionHelp for people who feel that RuneScape is taking over their lives.*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pazycv/lost_over_51_lbs_after_a_failed_suicide_attempt/", "title": "Lost over 51 lbs after a failed Suicide Attempt in 2019 - UC Santa Barbara Student interested in my Runescape Addiction Story. Talking about Electroconvulsive Therapy(ECT), Suicidal Thoughts, and Depression! Here's the interview:", "social_network": "reddit", "user": "RsAddictionHelp", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 24, "down_vote": 0, "creation": 1629850949, "permalink": "/r/DecidingToBeBetter/comments/pazycv/lost_over_51_lbs_after_a_failed_suicide_attempt/", "nsfw": false, "first_save": 1635435241.2637198, "replies_charged": false}