{"id": "t5_2tand_t3_fahmiw", "request": ["b1a66ef4-3e71-4d03-875c-961dbcef2285"], "text": "So about a month ago I found myself in a situation not exactly of my own design in which I was entirely without screens. No phone, no tablet, no laptop, no TV. The single time I have been on a device in that period of the was using a library computer to submit my tax return.\n\nThe short of it is that this has been the most productive, depression-free period of my life since I was about 13 years old. I have since decided that this is how my life is going to be. I have purchased a cell phone, but an older flip-phone model which is not useful for anything else but calling, and annoying to text on (to discourage it).\n\nI don't want to fall into /r/phonesarebad territory but... The conclusion I have reached is that phones *are* bad... For a certain population of people.\n\nThe most surprising benefit I have received is that I now enter \"flow\" state when I sit down and immerse myself in a task. I haven't felt this since I first got a phone at 16 (10 years ago). My hypothesis is that even checking your screen every 60 minutes or so, even for 5 seconds, is enough to break concentration. This has been evident in my meditation practice as well... I've been meditating for YEARS, but I feel like I've made more progress in 30 days than in the near decade of almost daily practice. The more I'm living this lifestyle, the more I'm coming to the conclusion that our brains are simply not meant to have a quick dopamine fix at our beck and call.\n\nWhat really crystallized all this for me was a TED talk on positive psychology (https://www.ted.com/talks/martin_seligman_the_new_era_of_positive_psychology/up-next?language=en#t-2801). The interesting and relative part is that there are three types of happiness that I'll sum up as hedonic (pleasure), engagement (flow states and accomplishments), and meaning (higher purpose/spirituality).\n\nWhat has been found is that hedonism has the least influence by far on most peoples' baseline levels of happiness and contentment. Meaning is the most, bit it is only slightly higher than happiness derived from vocation and enjoyment. In addition, genetics is the primary determinant as to whether someone responds to hedonic forms of happiness. We all know someone like that... Someone who is just happy all the time, derives joy from the simple things, just kind of floats through life never seeming to be discouraged by hardships. As a drug addict, this kind of enlightens to me why some people can just go on a bender on the weekend then just pop back up and go on with life, while others get caught on this accelerating hedonic treadmill that is addiction.\n\nMy aha moment has been that I'm not someone who responds much to hedonic happiness. I think a big reason I fell into addiction is because drugs are so powerful that they were really the first time I felt a direct sense of euphoria. I thought that was what I wanted and was looking for (isn't the point of life to be happy?) but the unfortunate reality is drugs very quickly become just maintaining a baseline, and even when you do get those highs, they aren't fulfilling.\n\nAnd that's the crux of it. I don't think the point of life is happiness, but fulfillment.\n\nI think I derive fulfillment from a mix of meaning-based and engagement-based forms of happiness, leaning more towards engagement.\n\nAnd that's where ditching the screens has worked wonders.\n\nIt was really revealing when I used an app to track time spent on certain apps on my phone. There are plenty of engaging and fulfilling things you can do online, but news-flash: you probably aren't doing those things. Reddit is a perfect example. I think pretty much any site where you scroll to get to new content is a form of hedonic treadmill. There is a very short burst of initial pleasure when you first open the app for the day, but the diminishing returns are *steep*. There is nothing fulfilling about scrolling on Reddit. A very small percentage of people do things like create communities, but if we are being honest that is probably not you.\n\nThe other aspect of having a device connected to the internet is all the information out there, and that can be useful sometimes, but I have found information is almost as much a trap for people prone to depression as sites like Reddit or even drugs are. Due to various circumstances in my past, I have developed this notion that is I just think hard enough I can overcome any problem. This has led to absorbing information compulsively. I can't tell you how many wikipedia rabbit-holes I've gone down. But the truth is that for people with anxiety especially, thinking is the enemy of doing. I have used information as armor when there isn't actually any opponent, and all it does is slow me down.\n\nAfter the first 3 days, living this life has been easy. I have a library with internet/computers almost literally nextdoor, and with computers that aren't shitty and slow. I've never even felt tempted to use them beyond submitting taxes. You might think it is hard to live in our modern world without devices, but it's not. 20 years ago people did everything without them, and while it seems a while different world, the nuts and bolts are not.\n\nEven if you aren't going to ditch the devices, think about ditching internet in your home. Get a couple gigs of data on your phones, and use the wireless that is literally everywhere these days. Having the limits of needing to walk a couple minutes to get internet will curb the compulsion of checking Reddit every 30 mins when you're immersed in something.\n\nBeyond that, I would be comfortable saying my depression is in remission. I may not actually have ever been depressed... I have simply been looking for fulfilment in entirely the wrong place for the last 10 years. Who wouldn't feel depressed?\n\nI'll leave it at that. I hope somebody who was thinking about this already might be tipped over the edge by my positive experience. I don't have any illusions that this post is going to be a revelation to everyone, and I'm not normally one for proselytizing, but my experience has just been too life-changing not to share. And who better than a bunch of people who who have decided to be better?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fahmiw/a_report_after_1_month_without_screens/", "title": "A report after 1 month+ without screens", "social_network": "reddit", "user": "Edores", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 27, "down_vote": 0, "creation": 1582832556, "permalink": "/r/DecidingToBeBetter/comments/fahmiw/a_report_after_1_month_without_screens/", "nsfw": false, "first_save": 1635436382.6062176, "replies_charged": false}