{"id": "t5_2tand_t3_a8wi0l", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "This has been an awful year. I have not achieved what I wanted to achieve, and things that were important to me have either fallen by the wayside or have been broken. I have been too weak to really care for myself the way that I actually need. It takes me a long time to get going. Sometimes the effort feels herculean. I am 27, and I know I have achieved many things that others my age have not, but in some ways this makes my life easier than it should be and has created a degree of complacency which likely isn't healthy. And even so there are many things that people my age are doing or have done that I should have by now. \n\n&#x200B;\n\nI often feel unlovable when I know I shouldn't. I often feel unattractive when I probably shouldn't care. I often feel unhealthy, which is completely in my control; I'm just failing to care for me.  I feel like I am not living to my potential.  I have not achieved the degree of actualization with which I could be content. I am an adult who does many adult things, but I don't fully feel like an adult. I feel inadequate.\n\n&#x200B;\n\nI have not worked hard enough. I sometimes feel like I've tried my best with many things, but I realize I haven't tried my best with everything. \n\n&#x200B;\n\nMany things I don't regret, but some things I do. I know I have faults in my personality that I need to work on, but on the whole I know that I am a good person and I can't be too cruel to myself there. No one can say that I wasn't exceptionally kind, but perhaps not always with the lightest touch, even then there were reasons. I know I deserved better but that is neither here nor there. I wish relationships could be more easily repaired so that there could be a new normal that isn't painful. I sincerely hope that is something that can be done. \n\n&#x200B;\n\nI'm scared that this is the way my life looked in 2018 is going to continue, and that would be terrible.\n\n&#x200B;\n\n2019 cannot look the way 2018 did.\n\n&#x200B;\n\n**I'm done.**\n\n&#x200B;\n\nAnd I just wanted to put this somewhere public as a reminder. As this year washes away, the next is not allowed to be the same. If I work to be better, perhaps there will be better for me. I just don't want to waste any more time and I really need to make conscious steps to get going. I want to feel worthy. \n\n&#x200B;\n\nHappy to accept any help anyone has to offer!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/a8wi0l/im_done/", "title": "I'm Done.", "social_network": "reddit", "user": "SpadesHeart", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1545586250, "permalink": "/r/DecidingToBeBetter/comments/a8wi0l/im_done/", "nsfw": false, "first_save": 1635436071.339106, "replies_charged": false}