{"id": "t5_2tand_t3_l7ga6v", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "******LONG READ ******\n\nSo lets begin with the good. I am 27 (M) she is 28 (F).\n\nMy ex and I were together for 6 years. I became very close with her family and siblings. Constantly going over to their houses for family events, dinners, and doing double dates with her siblings and their partners. Each week we made sure to go on a date forsure and spent many other days throughout our entire relationship. My ex and I were best friends, she doesnt have any friends. We took trips each year together, we got 2 animals together, we lived together for 4 years together. I would always do romantic gestures like leaving things on her car after work, or flowers randomly, or bath and spa nights. I put her on a pedastal and did my best to make her feel truly loved. \n\nWe never fought and honestly barely had any arguments about things. Thats how well we fit together. Similarly we had many of the same interests and even tried each others interest. I was there for her through tough times when both of her grandparents tragically passed away. I was an usher to walk the caskets down, which can tell you how close I was to her family. Each year I went with her family on family trips. \n\nFurther, we had similar values. We both didnt smoke, didnt do drugs, highly valued our religion that we share and had many similar world views and values for relationships. We valued each other enough to stay in communication every day no matter what by texting or talking. When we lived together, it was never an issue with cleanliness, cooking, etc. We both did our part and never expected the other to have to do such. We had similar future goals and dreams (travel, marriage, family, living on a lake, etc.) \n\nI can continue, but lets just say that we both felt very happy and in love together. We both expressed this daily. I never lied to her, I never cheated on her, I never did many things that would hurt someone outright. Further, I always tried to support her with her trauma and her own issues.\n\nNow for what happened:\n\nMy ex has a trauma history from her past 2 relationships. Abuse and lying. Neither relationship lasted more then 6 months. This happened when she moved away for college before she met me. She mentioned it to me, and told me how she can find it difficult to trust at times because of this. I always remembered this and made sure to never do anything sexual when we drank because I didnt want her to feel any negative way regarding that. As well, I consistently tried to build that trust and never hurt that trust until this last year.\n\nShe grew up homeschooled with all of her siblings in a strict household ran by her narcissistic and autistic father. For example, living at home at 28 she still has a curfew otherwise her dad yells at her. She fears her parents and wanta to make them happy and proud, seeking validation by doing right constantly. An example of this was when she started college it was for a career they suggested. Being in this environment, she has social anxiety and thus has 0 friends. All the years I was with her she made 3 friends and cut them out within 2-3 hangouts. \n\nMy ex was diagnosed with CPTSD, depression, anxiety, and that was before we met. Those things all but went away or here I thought the first 5 years.\n\nSo no issues for 5 years, 6th year we have 3 things happen. I was planning to get engaged in 2021. As well, after college (end of 2019) we both moved back to our parents houses as we searched for our first jobs post college. Covid began, making it hard.\n\nFirst thing:\n\nMy ex and I go to my cabin. She gets on an ATV with my cousin, I make sure they both have helmets and I tell my younger cousin she needs to drive very responsibly because my girlfriend was on it. She said thats okay and I even told my ex if she would rather drive with me she can, yet she was alright going with my cousin. \n\n15 minutes later they are involved in a head on collison with a truck going around a very sharp turn at like 15 miles per hour. I was following them in my car and I was behind them by like a few hundred yards so I didnt see it happen due to the curve. Anyways I ran to my exes side. Held and compressed her leg as she was bleeding. Fast forward, I followed to the hospital and went into her room and waited the whole time with her. She was able to leave within 2 hours and had a tear in her muscle behind her knee, as well as a traumatic brain injury, and further a deviated septum.\n\nWe go back to my cabin, and I pretty much take care of my ex the next 24 hours til we leave for home. I helped her bathe, get dressed, made meals, grabbed ice or heat stuff, and even tried cheering her up by watching comedies she likes. \n\nAfter dinner my aunt (mother to my cousin) asked me for help. I asked what for and she explained to me that my cousin didnt finish her test to drive the ATV before we left. I told her that I feel uncomfortable doing that and so I opted out. An hour later she asks me again but now tells me that if I dont that the state could sue my grandparents. My grandparents live month to month on their retirement and social security, thus I felt obligated. Later I found out they had insurance and that she was manipulating me. However in this moment my ex felt like I broke her trust by taking this test that I felt obligated to take. She felt like I intentionally set out to cover it up that my cousin should not have been driving. I see where she is coming from but also I felt pressured into it by my aunt and I explained this to her but she said it hurts her still and her trust was broken. I apologized by writing her a letter explaining how I never intentionally meant for that.\n\nNow fast forward 2 months, my ex is still healing and I bring up possibly going to my cabin for a holiday and asking if she wanted to go. She said absolutely not, because my uncle and cousin may be there. I said I understand but this worried me because I was thinking about our future and how it would work regarding family occasions. I brought this up to her and we had a disagreement about it. I asked if they could come to a future wedding of ours, or if we held a family holiday would they be able to come? To which she said again absolutely not. I expressed how I felt about this considering this uncle was the one I was closest to. I said do you think in time your feelings will change? And she said no because of the permanent damage she felt from the accident. Then she brought up covering up for my cousin and that I should never speak to them again because of the pain they put her through via the accident and trust breaking. I took about a week to consider everything. During this time she thought and convinced herself I was choosing them over her BECAUSE I was arguing with her about them being in my life for future events. My family members also never reached out past the first week following the accident and she felt hurt by this. Yet, I reached out constantly and was supporting her healing process. I even wrote to her parents my apology for the damage she had been dealt. Unfortunately I will touch upon this later but her dad banished me from their house and family events.\n\nI blocked my cousin, aunt, and uncle and sent them a long message regarding everything. Up to this point 2 months after the accident I had not spoken to them, and had been supporting my ex's healing progress. So not only did I not speak to them, but I blocked them and wrote what they did wrong and how it was not acceptable. Thus in this moment choosing her over my family members. She came back at the end of that week despite all of this and said my actions showed I chose my family over her and she felt very hurt by this. She said my actions to argue against her for people who hurt her was clear to her how I felt. These arguments were never yelling or anything, it was simply me asking if they would be able to be at certain events and my reasoning why I would appreciate them there. And even after me making my actions clear about not speaking to them since, and blocking them, she still felt betrayed because as she said, \"my actions are clear and you chose them over me.\"\n\nWell we dropped this topic moving forward because she was focusing on healing and I blocked them. Yet she still seemed hurt. Now her father is a great person, yet he is strict and he has autism. She never shared with her parents all the details. Simply the details of the accident. Before the accident I was at her house 2/7 days in a week I would say because that way my ex and I could see each other because she liked being at home. Then 2/7 days at my house. And 1 of those 4 days we would do a full date all day or all night. Anyways, since the accident her father grew very resentful to me. Despite my apology in writing, and even in person. He would argue with my ex that she needed to break up with me and that I was not a good person because I let her get on a dangerous machine. Mind you my ex is 27 and I am not controlling thus I did what I could by warning my cousin to be safe and giving them helmets. So her father blamed me, and he told I am not allowed over to their house. So now, my ex and I only saw each other at my house and less. Even so, my ex told me that she had to lie to her father where she was going because he would consistently yell at her to break up with me because I am not a good person for letting her get hurt.\n\nFast forward 3 more months, were still doing weekly dates and still having sex frequently. We are getting into a better place as we close into graduating. At this time, we were at our parents doing internships. I still am not allowed over and she is even having me pick her up a street over because she did not want her dad to see when we would spend time together. This was hard for me but I never argued about it and just understood despite how bad I felt that her dad hated me when I didnt cause the accident. We are spending less time together because of her father on her back, and because she doesnt prefer to always come to my house (I have smokers in the house and she hates the smell, as do I but I need to deal with it until I could move out again) i would always spray and light candles to make it better.\n\nEvent 2:\n\nNow another month forward we are now into the beginning of 2020, we find out that we are unexpectedly pregnant. We used birth control but it must have failed. She brings out the test and as I wait I am smiling thinking about everything. When she brings them both out they are both positive I hug her and then I begin to have a panic attack. Let me make an important note here, I have an anxiety disorder which she knew about. My panic is breathing heavy, heart racing, face likely looking panicked, and intrusive thoughts. These thoughts began to come out, as I explained to her this: \"I am so grateful and happy for this. I am worried though because neither of us have jobs, we are living at our parents and you dont want to live with me because of your parents, as well your parents are going to be mad at me even more then they were with the accident.\" She begins to cry, and tells me this is suppose to be a happy moment. I tell her I agree 100%, and I am happy, but we are going to need to figure some things out so that we stay happy. I dont want her and I to struggle financially in any way, I grew up poor and thats why I push myself to work and find a career. She agrees but still seems really sad. \n\nI see her about a week later and she begins telling me we need to go to her therapist. I ask why and she says we need to make a big decision. Continuing I ask whats that. She said we have 3 options, keep our baby, give our baby up for adoption, or abortion. I tell her thats okay and we go to her therapist. During this session she breaks down crying because she is worried about everything, she speaks for atleast have of the session about her parents and why she is worried they will disown her, and why she is worried about their opinion about premarital sex and a baby our of marriage. We leave with the therapist telling us to come back in a week with pros and cons for each option. \n\nAfter seeing her cry and worry, I spent the next month looking for work 8 hours a day. Yet it was covid layoffs happening and so I couldnt find squat. Anyways, a week later I bring my pros, my cons, as does she. I preface the talk with saying I want to keep our baby, I have been looking for work, and I dont want her parents to be a reason why we choose something like this. Then I also say I will continue to step up.\nWe give our pros and cons for each and hers are mostly focused on her parents and the lack of financial security. I understand and we talk about the options in therapy.\n\nAnother week and at this point we are going together to all of the doctors appointments. She talks to me and asks me what do I want to do? I tell her she seems pretty set on abortion based on our talk in therapy, that I want to keep our baby, but if not then I still want children in our future. She tells me she is leaning on abortion, and I tell her I will have to support this decision.\n\nFinally she and I go to a doctors appointment and the whole time I am nervous because the night before I was highly debating buying an engagement ring and proposing to her. Yet, I was arguing with myself because I didnt want her to feel like I was doing this only because of the situation. During this appointment I was in my head and distant as I contemplated it. Afterwards, she mentioned how my actions were pretty clear in this appointment that I was against having our baby. I told her I was only distant because I have something on my mind I cannot share with her, because mentally I still hadnt decided. She didn't believe me. I couldnt pull the trigger because like I said I didnt want her to resent me thinking that I was only doing it for this reason.\n\nA week later she scheduled the abortion and told me that she decided to go forward with the abortion. \n\nThe day comes and I drive her there, outside I tell her we can leave and that we do not need to go in. She trudged in, and seemed very distant, understandably why. We go into the room and I am asking all of these questions out of concern for her during this. And then we wait, I told her we could leave, but she said no. \n\nIt happens and then I bring her home and do my best to make everything both comfortable and enjoyable by making her favorite dinner, and watching her favorite movie etc.\n\nWe do not talk about it and do not have sex for 2 months. I told her I am not going to pressure any of that and when she is ready we can go slow into whatever she wants to do. We are having good sex again, but she is very worried about anything getting into her. So we begin to see her therapist again, still we both are looking for jobs, and still doing our weekly dates as best as we can with covid and not being able to go to her house. \n\nFast forward 2 more months. And she got a job! I am still looking because in my field (teaching) they were distance learning and not in need of subs nor teachers. Soon summer was upon us and she was working 40 hours a week.\n\nEvent 3:\n\nWell by this time, I was pretty depressed by the abortion, the previously mentioned betrayal she felt from the accident, and now my lack of finding work. On top of all of that, with her working so much, I only got to see her max 9 hours a week. I associate that to both her busy schedule and her withdrawing from me. But during this time, I would mention getting married in our future and having a family when we are ready and simply telling her I still wanted that. I maybe brought it up once a month and she would cry and tell me she is not ready right now for those and that in the future she might be. I would tell her, I fully understand and that I only bring it up to assure her I still wanted that with her. \n\nWell for 3 months we handle this, and juggling little time spent together on her end, I had a bunch of free time because I was still looking for work. I would ask her to go out and do things (hikes, walks, water activities, movies, etc.) And she would tell me how she is busy and cannot until the weekend. Before all of this her and I would go on walks almost 4/7 days if not more with her dog for like an hour. I was becoming needy because I would ask her to include me in those things. I would sometimes cry and ask her if she wanted to see me, and she would respond that she sees me already as much as she wanted to in a week (9 hours). \n\nShe had me over for a family bbq and mind that at this time I had not been over to her house in almost 9 months. When I use to come over for many hours every week and help out her mom and spend time with my ex and her family. When I was there I was nervous. I stayed outside in the backyard with her siblings. When they wanted to go into eat, I denied the food because I didnt feel welcomed by her father and thus I didnt want to eat the food out of fear of him saying something. Well they grab food and come back out. My ex however does not. 3 minutes later I get a text telling me to leave and meet her near her house because her dad just yelled at her when they were alone in the kitchen. I slipped out and we take a walk and she is hurt, her dad told her that if she didnt get me off their property he was going to divorce her mom because of her. This hurt me deeply that he would say that. I texted her mom telling her thank you for inviting me and that her husband told my ex those things. \n\nNow to the most current thing:\n\nStill in this realm of feeling sad due to time spent, and everything, my ex and her family go on their family vacation. The one normally I always go on, yet I was not even invited and my ex never brought up considering inviting me. They leave for a week and I am happy for them to be going.\n\nWhen they return I plan a date for my ex and I the following day. It goes really well until the end. She begins telling me about the trip and how her sisters friends went. This made me feel sad and left out and I began to cry. I explained that I just felt excluded from her life the past few months. Especially now between the bbq and the trip where other people not even affiliated with any family member aside from being friends with them was invited. As well as the lack of her inviting me to do things we use to do together.\n\nShe is mad and tells me it is completely out of her control. And I tell her I understand completely that part (cabin/bbq) yet I wish she would try to invite me to more parts of her life I can be a part of.\n\nThe next day she is majorly distant, and so I call her and she tells me she is pissed at me. I give her a few days. Then we meet up and essentially she tells me that she doesnt know if she can give me what I need anymore. Going on to tell me that she doesnt see a future together, she doesnt want to have children with me, doesnt want to get married. She tells me that she spent a week having fun and that I ruined it by bringing all of that up. Then that we need to have space and a seperation. 1 month but we are still together she clarifies and that were not dating other people.\n\n2 weeks pass, and she texts me she cannot do it anymore. She calls me and tells me she wants to break up. I beg and plead, and she tells me she doesnt trust anything I say, she feels heart broken, she feels I hurt her, and that my actions have showed her this. She tells me she has given me many chances and that she keeps getting hurt. I try to defend myself by saying I understand but I have never made the same repeated mistakes of hurting her. She says nonetheless that they happened and unintentional or not, she is done being hurt. This hurts me because I truly never did do the same mistakes over and over again. She ends the call by telling me I love you.\n\nA week later we meet in person to talk about the break up. We talk for 3 hours. During this talk, she tells me many things that floor me mentally but I simply just take it because I didnt want the possible last moment to be negative. \n\nShe tells me that she has had so much clarity the last 3 weeks. She said that she realized first that I broke her trust and that really hurt, but then being she was in such a vulnerable place from this moment with the accident that when she had to decide about our baby, that I WAS THE REASON she chose to have the abortion. She goes on to say that my actions showed her I didnt want to have our baby with her, that my actions of having a panic attack and being distant were clear to her (despite me never once thinking I didnt want to have our baby with her). She broke down telling me this and I simply told her repeatedly I am sorry you believe that but that was not the case and it seems what I tell you, you do not believe. She said my actions were clear. So she essentially blamed me for our abortion, and the accident. Yet I chose her in the accident by both supporting her and blocking my family, as well, with the abortion I was supportive of her and keeping our baby, not to mention she never brought this up ans her reasons were focused on her parents opinion and her fear of that.\n\nThen she goes on to say our relationship became so toxic the last year that she now needs to find herself and heal. That she needs major space and time and that maybe in the future we could be together. Then she said she may need years of space from me to have a clean slate from what I did to her. She said she loves me, that I am an amazing person and I will have a great life. She will always care about me and is grateful for the amazing times we spent together. But she said she needs to do what is right for her. \n\nShe removed myself, my friends, and all of my family members from social media. Removed all of our photos and posts. Did not block, but asked me not to contact her. Which I have respected for months now. She said I can keep the animals and all of our belongings in storage from when we lived together. She has 0 friends as I believe I mentioned before because she has trouble both connecting and trusting them. But her one sibling that I am still friends with has posts on her wall that my ex posted and tagged her in so I can see them. They are about essentially \"Someone who loves you wouldnt do this, or someone who loves you shows you in their actions\" and other stuff seemingly out of resentment towards me. \n\nSince our breakup I have felt deep deep remorse, for our abortion, and the blame she put onto me. As well, grief, from her leaving me and outright projecting so much of her pain she never mentioned previously onto me.\n\nI have been doing better each day, working 3 jobs now, planning trips, and my future. Been on depression medication that helps also my anxiety for months since our breakup and seeing 2 therapists weekly. \n\nSo of course this was a long story. Sorry. But I wanted to get it out of my mind since I havent been sharing this with anyone except my therapists. \n\nWhat is your take on what has transpired? I am struggling deeply with all her blame. I feel like I was supportive and she told me I was not as much as I could have been. Meaning I didnt meet her expectations and ultimately she concluded by that, that I was just downright NOT supportive at all. Which like I said I feel is so untrue :(\n\nTLDR: My ex and I had no issues, then it all fell apart after an accident, her abortion, and a lack of spending time together this last year. She blames me for being unsupportive and says I was not there for her when she needed me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l7ga6v/she_said_i_was_not_supportive_and_that_she_was/", "title": "She said I was not supportive and that she was unhappy because of me. I feel I was, but then she blamed me and left me with all that blame. I have decided it is time for me to find peace with this.", "social_network": "reddit", "user": "MissingPossum", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1611886539, "permalink": "/r/DecidingToBeBetter/comments/l7ga6v/she_said_i_was_not_supportive_and_that_she_was/", "nsfw": false, "first_save": 1635435896.4483995, "replies_charged": false}