{"id": "t5_2tand_t3_ievx0t", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "Hello world,\n\nI had a wall of text here, but to fit all the details of my story in would require far too long. And to be honest, it doesn't matter. \n\nI'll give you the short of it instead.\n\nI had expectations that my ex wife and I were falling back in love. As of this last March, we're living together again in the house we still co-own (long story, bad divorce agreement), we're having sex occasionally, and we're able to talk without killing each other.\n\nI told her how I felt about two months ago, and everything stops. She says she's not ready. I keep doing what I think I need to do, and things just get worse. My feelings of worthlessness, emptiness, and loneliness come rushing back in.\n\nLast week, it all came to a head. She was away visiting family, and I decided to drink to dull my emotions. It turned in to an all week ordeal, and she came home to me being drunk. Probably a good time to mention that I'd been sober for about 7 months, which was one of MANY determining factors in our divorce.\n\nThis last week, there's been nothing but fighting about the house and her thinking that she needs my name off the mortgage ASAP. I had a moment of clarity that she never intended to be back in a romantic relationship with me and that this was much more of a situation of convenience for her than anything else.\n\nThat moment of clarity was like a gift from the heavens for me. I realized plainly and clearly just how I have been acting in my life. I realized that despite being sober and working a program of recovery, I was still clinging to so many things from my past. I realized that I was allowing other people's feelings toward me to dictate my level of happiness and worth.\n\nForget all that nonsense. It ends now.\n\nWhile there a whole host of things for me to work through in this situation, I'm making the decision to live my life for me. I can't be happy for other people. I can't stay sober for other people. I can't improve myself for other people. I can't build the future that I know I'm capable of for other people. For these things, I need to do them for MYSELF. I can't control what other people think, say, or do, so I'm done worrying about that. As long as I do what I need to do to live my life according to my needs and values, I will ensure my own happiness.\n\nA few of the things that I'm actively begining to do for myself...\n\nI'm hiring a lawyer to figure out what to do with this damn house and I'm moving out as soon as I know we're both ok financially. We've co-owned it for 4 years since our divorce. Enough is enough. \n\nI'm going back to therapy. \n\nI'm starting over on my twelve step program.\n\nI've deleted social media, except for Reddit.\n\nAnd a bunch of other things. \n\nAnyways, I'm going to end it here. Thanks for reading.\n\nEdited for a couple details.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ievx0t/expectations_and_living_in_fantasies_aka_how_i/", "title": "Expectations and living in fantasies, AKA how I got here", "social_network": "reddit", "user": "constantly_better", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1598151695, "permalink": "/r/DecidingToBeBetter/comments/ievx0t/expectations_and_living_in_fantasies_aka_how_i/", "nsfw": false, "first_save": 1635437166.8752766, "replies_charged": false}