{"id": "t5_2tand_t3_nt7f21", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Hey y’all, I walked away from a friendship that was weighing me down mentally. I (25f) had a friend, we’ll call her Janet. At first glance, she’s great, thoughtful, always putting her hand up. Except none of it was genuine. \n\nOne favor and you don’t hear the end of it. Someone buys their first home and she questions how it’s possible when she’s so much more ahead of them financially. She ReALly wants to help Ron get that job but it’s too bad they nor their entire family for that matter, didn’t want to finish school. Her jealousy/hate? was on fire and she was always talking like she was above it all and taking jabs at people. No one was safe from her judgment. \n\nI’m good friends with her cousin and Janet was very possessive of her. Perhaps she saw this as a threat, because she would intentionally find ways to exclude me, then pretend it didn’t happen. Her cousin was always trying to make up for Janet’s actions. \n\nIt was all so petty and a lot psychologically. I slowly distanced myself and brought this up to her, but she didn’t take it well. Completely flipped on me like I was crazy, left me hanging mid-convo, and blocked me from everything. \n\nWhile I don’t regret having the courage to try to talk this through with her, I also feel defeated and shaken from a response I should’ve expected. Ultimately it was a toxic space I needed to get away from. I just hope I’m not the only one who sees it. \n\nAny advice on how to move forward from an experience like this?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nt7f21/ending_an_unhealthy_friendship/", "title": "Ending an unhealthy friendship", "social_network": "reddit", "user": "butnowhy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1622932997, "permalink": "/r/DecidingToBeBetter/comments/nt7f21/ending_an_unhealthy_friendship/", "nsfw": false, "first_save": 1635436507.3432925, "replies_charged": false}