{"id": "t5_2tand_t3_dibgr7", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": " \n\nHi guys! this is the last video script for my book review series on \"Atomic Habits\". Let me know if you are interested to watch the video and i will send you the link! Hope you find value in this. Feedback and comments are appreciated!\n\nImagine yourself as a runner and after doing all your preparations, training and the actual run, you finally reached that finish line and get your medal. How about when you have been putting your hours in at work in hopes for that promotion and finally after all the years, you get it. Everything we do is in pursuit of a reward, whether this is consciously done or subconsciously done. Habits are the same way. The behaviour we are hoping to develop is motivated by a desire to solve a problem. Either this is to obtain something or to relieve ourselves from pain.\n\nRewards are the end goal for any habit. It satisfies that craving we feel when we start an action and also teaches our brain that “if we do this action, we are going to get a reward”. By the same token, our brain is also working to associate that reward to the cue. The Habit Loop comes in full circle at this point. If the Cue, Craving and Response/Behaviour is what starts the habit, Rewards is what can keep you from doing it. Without any rewards, an action will not be sustainable and become a habit. Therefore it is important that we make the reward satisfying. Immediate satisfaction of a craving is the key for doing it. One of the best tools that James showed in his book is the habit tracker. In Maslow’s Hierarchy of Needs, the feelings of accomplishment falls under the Self Esteem category which is very high in the hierarchy second only to Self Actualization which is another term for enlightenment. The habit tracker is a very simple tool to create a sense of accomplishment consistently that it helps with your self-esteem over a long period of time. There are a lot of apps that you can use to track your habit but the one personally used before is Habitica, which is an 8bit RPG style habit tracker. It functions like a game but in real life and rewards you with experience and points to level up your character. It also has a community behind it if you want to make use of the 2nd Rule of Behaviour Change in one shot. It definitely helped me be more organized with my day to day tasks especially during my very busy career at that point in my life. If you want to keep it as simple, then grab a habit journal. Write down the habit you want to adapt and create 31 boxes beside it for each day of the month. Check it off with a colored marker or a simple tick, really up to you. There is no right or wrong way of doing it, set it up in a way that you will enjoy because what is important is the fact that YOU will get that satisfaction from rewarding yourself. Habit Tracking is very powerful because it creates a very tangible measure of your daily wins and motivates you to continue the streak. If you want to break bad habits, make the reward unsatisfying is the rule to follow. The best way to do this is through a habit contract and having an accountability partner to enforce it. James’ example is his friend who wanted to lose weight so he created a contract that if he starts to procrastinate on his goals, he will have to pay his trainer $200 dollars. This example is very powerful as it creates a painful reward to the habit of procrastination which forces you to be accountable for your actions.\n\nNow that we have gone through the 4 rules of behaviour change, I want to know how are you going to apply these into your daily life. What kind of habits are you hoping to adapt in your life and how can you use these 4 rules? Comment down below your answers and if you haven’t already checked the previous videos, you can find the whole series somewhere on the screen right now. Be sure to also check James Clear’s Atomic Habits, there’s a link in the description. Once again this is Dare to be Better and Thank you for watching!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dibgr7/how_satisfaction_can_sustain_habits_4th_rule_of/", "title": "HOW SATISFACTION CAN SUSTAIN HABITS - 4th Rule of Behavior Change (Make the Rewards Satisfying)", "social_network": "reddit", "user": "daretobebetter07", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1571161475, "permalink": "/r/DecidingToBeBetter/comments/dibgr7/how_satisfaction_can_sustain_habits_4th_rule_of/", "nsfw": false, "first_save": 1635438107.3047733, "replies_charged": false}