{"id": "t5_2tand_t3_ll2sqd", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "When I was 15 years old, I first came across your book \"The Alchemist\". I was only a child but I somehow knew that it was a book to carry around in my pocket. And that I should always remember Santiago.\n\nWhen I started university, I was severly depressed and anxious, and I was desperately looking for a way out. One of those days, I came across your book \"Aleph\" in the library. I remember getting very excited because the man behind The Alchemist had written a book where the protagonist was a Turkish girl like me. And her name was \"Hilal\", which happens to be the synonym of my name.\n \nA few years went by. When I was 21, I decided to go on a journey to California. I only asked for healing from that trip. I decided to go there to meet my spiritual teacher who had been an amazing guide, friend and almost a father to me for about 4 years. I was certain if I'd found a way to get to him, my issues would have magically dissolved.\n\nI arrived. After a couple of days, I discovered a book lying apart on a shelf. The colorful cover and the familiar name Paulo Coelho immediately grabbed my attention: The Valkyries. I remembered Santiago- with his relentless desire to see the world and find his treasure.  Now I was in Los Angeles looking for MY treasure.\n\nThe Valkyries was a book about connecting to your angels. And in those days, I was frantically looking for them. The book revolves very much around you and your master 'J', which also happens to be the initial of my spiritual guru in Los Angeles-Joseph. What's more, I had discovered the book just a few days before my road trip to Las Vegas, going through the Mojave Desert- the desert where the Valkyries lived. \n\nThere was so much synchronicity. I was getting more and more convinced that I was on the right path.\n\n\n-\nLet's fast forward to the present. I returned from that trip 9 years ago with my usual unenlightened self and a couple of good memories. During my years in the pursuit of enlightenment, I've come to accept that the light is not out there to wildly search for. Today I'm still that 15 year old muddling through life in an effort to make sense of things. I'm just holding onto however much light I have at my fingertips.And I'm trying to treasure it as much as possible.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ll2sqd/my_journey_a_letter_to_paulo_coelho/", "title": "My journey -A letter to Paulo Coelho", "social_network": "reddit", "user": "validbreadth", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1613478493, "permalink": "/r/DecidingToBeBetter/comments/ll2sqd/my_journey_a_letter_to_paulo_coelho/", "nsfw": false, "first_save": 1635436845.681623, "replies_charged": false}