{"id": "t5_2tand_t3_ju21wi", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "What if you didn't have to do everything on your own? What if there was someone that could say “It’s okay, take a breather, I’ll handle this and you can rest and close your eyes for a bit.” What if you could believe them?\n\nDon’t take it personally, I’m just thinking out loud. You’ve been on your own for a long time. You’ve had to cover every base. You’ve had to think about all the worst case scenarios, you’ve had to stay in control constantly because you were the only you trusted to do things right.\n\nYou see, this made a really big impression on me at one time. I had been so used to being and doing everything. I was the one who had to plan everything, to be superman in a crisis, to always be the shoulder to lean on. It’s like I wasn’t allowed to have problems. I couldn’t have a weakness because that would mean I couldn’t be there for someone who needed me. I wasn’t allowed to be human.\n\nBut this isn’t sustainable. I did that for so long and I got so used to pretending that I didn’t have problems. But blocking a dam doesn’t mean there’s no water. It just means that the water pressure builds up. It builds and builds until it’s too much. And then right as the dam was about to break, I met someone who I could trust. This sounds so small, and yet it was everything. It’s like walking a tightrope your entire life over lava and then suddenly the lava becomes pillows. Like all of this incredible pressure and the horrible consequences behind every possible mistake evaporated. Like I could finally be myself instead of being whatever others needed me to be.\n\nHaving someone I could lean on made me realize how much I had been pretending for so long. How long I had been trying to be everything for everyone. It was a massive relief, but it was also scary. I could see what a painkiller life I had been living. Pretending to be okay means never getting to say “I’m not okay.” It means never admitting when you’re in pain. It means you’re covered in wounds that never get to heal because you’re busy bandaging someone else. \n\nHaving someone who could hold the world together while I caught my breath reminded me that I was human. I wasn’t a superman. I never wanted to be one. Being superman means you’re alone, saving the world one crisis at a time. I’d rather be on a team with someone who fights for me and saves me when I need it, and vice versa. \n\nI’m not criticising you. I’m not saying that you need anyone’s help. I’m just asking if you’ve ever had that luxury before. How long have you been on your own? Maybe the last person who helped you also hurt you. Maybe you’re scared of leaning on someone. I wouldn't blame you, I got hurt really bad too. I trusted someone who I thought accepted me. I thought they would always have my back because they said they loved me. I thought that I was never going to have to be alone again. I was wrong. \n\nThere’s a thousand thorny paths we can take, I’m not telling you what to do. But shouldering all the world’s problems on our own is such a hard path to choose. I simply ask that you keep your eyes open. Especially if you’ve felt the comfort of a helping hand in the past. Especially if you understand how nice it is for someone else to be picking up slack where you can’t. There’s a lot of people out there who could treat you right. There’s others who want to fight in the trenches for you. But you have to find them. You have to separate yourself from bad fits to find better ones. You have to put yourself in the room to find the person who will fight for you. It’s not easy, and it won’t happen overnight, and who knows if that’s even the right path for you. \n\nI just ask the question: Can you remember when you trusted someone? When you weren’t on your own? When you didn’t have to be everything? I remember. And I’ve decided I want to find it again.\n\n\\--------\n\n**Further Reading:** If this post resonated with you then you might benefit from “The 7 Principles of Making Marriage Work” by John Gottman. Hold up, don’t freak out. You don’t have to be married to read this book, it helps singles as well as couples. It is a research based analysis of how couples create and maintain healthy relationships, as well as the data-driven warning signs of a relationship falling apart. Especially if you’re anxious about opening yourself back up to others I think this is a great resource on how to build something meaningful, sustainable, and beneficial for everyone involved. Dating doesn’t have to be emotional russian roulette. I avoided a lot of pain by reading the research of someone who has studied this for decades. Let's read the manual before we try to fly this plane.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ju21wi/do_you_remember_how_it_feels_to_trust_someone_you/", "title": "Do you remember how it feels to trust someone? You don’t have to do this alone.", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1605361097, "permalink": "/r/DecidingToBeBetter/comments/ju21wi/do_you_remember_how_it_feels_to_trust_someone_you/", "nsfw": false, "first_save": 1635435483.204273, "replies_charged": false}