{"id": "t5_2tand_t3_6ehtn3", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "**Charisma is the most appealing quality an individual can have.**\n\n&nbsp;\n\nCharisma results from a blend of self-confidence and positive emotion. Tapping into charisma will lead you to have more positive relationships with friends, make you more attractive to the opposite sex, and (perhaps even more than skill or talent), help you succeed in your business ventures.\n\n&nbsp; \n\nYou probably don’t need to be sold on the value of charisma. However, the obtainability of the quality is a different story. Charisma is elusive. Generally, it is considered be something that you either have or you don’t.\n\n&nbsp;\n\nCharisma can be developed, but it requires an unconventional approach. There’s a catch-22 involved in any attempt to develop your personal magnetism; the harder you try to be charismatic, the less charismatic you will be. \n\n&nbsp;\n\n**The Charisma Trap**\n\n&nbsp;\n\nI’ve read dozens of books and watched hundreds of videos purportedly teaching how to become more charismatic, magnetic, and confident. I’ve tried everything from visualization techniques, to hypnosis, to NLP in my (desperate) attempts to become more socially appealing.\n\n&nbsp;\n\nNone of these methods worked. Pithy self-improvement advice that teaches you what to do, what to say, or how to say it is (unintentionally) missing the point of what charisma is and how it functions.\n\n&nbsp;\n\nThe charisma trap arises from the fact that the more effort you put into coming across as charismatic, the less charismatic you become.\n\n&nbsp;\n\nIt is true that being a better listener will make you more charismatic, but trying to force yourself to be a good listener will make you less charismatic. The act of putting conscious effort into making a good impression is itself bringing attention to the self-evaluation that you’re not good enough as it is. \n\n&nbsp;\n\nTrying to be charismatic is in itself an insecure thing to do. If you were already charismatic, you wouldn’t feel any need to judge whether your tone of voice is silky enough or whether you’re being positive enough or whether your eye contact is strong enough. \n\n&nbsp;\n\nWhy? Charisma results from not being self-conscious, from not using your attention to monitor yourself. Someone who is charismatic is by definition, not worrying about the impression they are making. This is a lesson that has been difficult for me to learn. In fact, it’s taken years. \n\n&nbsp;\n\nAnd there’s a reason why it’s taken me years. The part of my mind that wants to be more charismatic is not the same part of my mind that is capable of being charismatic. Your interest in improving yourself is a logical, self-aware desire. Yet, the logical, self-aware part of your brain literally shuts off when you are at your most charismatic. How’s that for a catch-22? \n\n&nbsp;\n\nCharisma is strongly related to what’s known as social flow. If you’ve ever lost track of time because you were enjoying a social interaction so much, you’ve experienced this state. When you were in this state, you were charismatic, confident, charming, etc. Unfortunately, this state is elusive to most people. \n\n&nbsp;\n\nFlow states are a scientifically well-documented experience in which you feel your best and perform your best. In this state your sense of time dissipates and you are totally immersed in whatever you’re doing (in this case, social interaction). \n\n&nbsp;\n\nMost importantly, in a social flow state, the part of your brain that flow researcher Jamie Kotler refers to as your, “Inner Woody Allen” goes silent (the scientific term for this is transient hypofrontality: meaning the prefrontal cortex shuts down). \n\n&nbsp;\n\nYour “Inner Woody Allen” is the self-critical part of your brain, the part that is monitoring how people are reacting to you. It is the part of your brain that triggers insecurity and defensiveness.\n\n&nbsp;\n\nWhen you’re in a social flow state, this part of your brain (the prefrontal cortex) goes silent. This just so happens to be the same part of your brain that exerts conscious effort into becoming more charismatic, i.e. part of your brain that thinks, “Did I say that a little awkwardly? I should speak with a more assertive tone to be more charismatic.” \n\n&nbsp;\n\nWhen you’re in a social flow state you won’t judge yourself, you’ll feel like everything you say and do is the best option, and because you feel so confident in your actions and words, those actions and words will come across more charismatically. \n\n&nbsp;\n\nA certain tone of voice or choice of words might be more charismatic than another, but these details are insignificant when compared to the underlying fundamental of being in a charismatic state versus a self-critical, defensive state. \n\n&nbsp;\n\nThere’s a concept in psychology called emotional contagion. It means that emotional states are contagious the same way that yawning is contagious: if you feel good interacting with someone, they will feel good interacting with you. When you are in a social flow state, you will feel your best, and so you will come across as highly charismatic. \n\n&nbsp;\n\nDetails like eye contact, vocal tonality, and body language are insignificant when compared to the power of your emotional state. Even if focusing on those things didn’t trigger insecurity, it would be still be far more effective to learn to enter social flow states because that’s the primary source of charisma, that’s the ‘it factor’ that charismatic people effectively tap into.\n\n&nbsp;\n\n**States Become Traits**\n\n&nbsp;\n\nWe tend to make a fundamental assumption about charisma that makes our efforts to build it unnecessarily difficult. We think charisma is a trait, but it is in fact, a state. Those who are generally charismatic are very skilled at accessing this state (of social flow) whereas for others it is a very rare occurrence. \n\n&nbsp;\n\nThis understanding completely alters the approach you should take to becoming more charismatic. Your goal changes from altering your traits like the type of body language you use or the tone of voice you speak in, to learning to effectively enter a social flow state. \n\n&nbsp;\n\nYou’ve almost certainly been in social flow states before, even if only very rarely. In his best-selling book, The Art of Seduction, Robert Greene Writes, “We may also experience this in a social or work setting— one day we are in an elevated mood and people seem more responsive, more charmed by us. These moments of power are fleeting, but they resonate in the memory with great intensity. We want them back.”\n\n&nbsp;\n\nOf course, once we experience this, we develop a sense of frustration because we cannot normally access this state. We then try to replicate the experience without knowing that the effort we’re exerting (like trying to force humor) is a doomed strategy. \n\n&nbsp;\n\nThere are effective methods to building charisma, but they have nothing to do with thinking about your eye contact or your body language. \n\n&nbsp;\n\n**An Outward Gaze**\n\n&nbsp;\n\nThe less you focus on yourself, the more charismatic you will become. People in a charismatic state are not in their own heads during a social interaction. They are focusing their gaze outwards, on the people they are interacting with. Most people have a habit of relating everything that happens in a social interaction back to themselves. This is a form of defensiveness that kills charisma. \n\n&nbsp;\n\nWhen in a social interaction, change the focus of your thoughts to the other people you are interacting with. Instead of thinking about what their actions and words are saying about you, think about what they’re saying about them. There’s an important nuance here, you’re not judging others, you’re curious about them. \n\n&nbsp;\n\nWonder why people are saying what they’re saying, wonder why their body language is the way it is, wonder why they do what they do. The trick to leverage this technique so that it brings you into a social flow state (and therefore triggers charisma), is that you aren’t consciously trying to answer these questions, you’re only asking them. \n\n&nbsp;\n\nIf you try to answer the question, you are accessing the judgmental part of your brain that easily becomes insecure and defensive. If you are only curious about what people’s actions might mean, you will trigger a flow state. You will be shutting of your self-consciousness and changing your focus outward. This outward focus is a fundamental element of charisma.  \n\n&nbsp;\n\n**Take Social Risks**\n\n&nbsp;\n\nThe more socially confident you become, the easier it will be to access a social flow state. It’s much easier to feel positive and confident in social interactions when you know that nothing bad can happen. To prove this to yourself, the most effective strategy is to take social actions that you’re afraid will lead to negative consequences. This practice will powerfully develop your social confidence. \n\n&nbsp;\n\n**What is Confidence, Really?**\n\n&nbsp;\n\nConfidence is simply a self-evaluation of your ability to successfully engage in a particular activity. Take driving, for example: \n\n&nbsp;\n\nHopefully, you are fairly confident driving your car at this point in your life. When you first started, however, you were anything but. Your first attempts at driving can be exceptionally nerve wracking, there’s 2000 pound machines only a few feet away from you and if you make one wrong move, YOU DIE. \n\n&nbsp;\n\nFortunately, each time you drove and you came out of the ordeal okay, your confidence in your abilities increased. What was initially terrifying eventually became totally mundane. In fact, most drivers build so much confidence in their abilities that they believe it’s safe to text while driving, even though statistically it’s as dangerous as driving drunk. They’ve accumulated so much evidence that nothing bad will happen when they drive, that they start to neglect even real dangers inherent to the task. \n\n&nbsp;\n\n“But driving’s not the same as social confidence!” Of course not, but social confidence is built through the same process as any other type of confidence. When you are in a social situation, there are a variety of options of what you can do or say at any given moment. Similar to how in chess you have a variety of potential moves.\n\n&nbsp;\n\nIf you are not confident, many of these options will seem dangerous. For example, you might imagine that leaning in to kiss the girl will result in a humiliating rejection or that saying the joke that came to your mind will make you look stupid. \n\n&nbsp;\n\nWhen you are socially confident, social risks will seem unimportant. You’ve already faced these risks enough that they no longer provoke much anxiety or trepidation. This is just like the fact that once you’ve driven enough hours the inherent risks to the task no longer have an emotional effect on you.\n\n&nbsp;\n\nTo become more charismatic, you must build you social confidence because if you are worried about the negative consequences of your actions it will be nearly impossible to enter social flow.\n\n&nbsp;\n\n**How to Build Your Social Confidence**\n\n&nbsp;\n\nTo build your social confidence you must go out into the real world and face your insecurities.  Fear of social tension, rejection, and awkwardness are almost universal (although many individuals wouldn’t admit they have them). The following exercises will force you to face and overcome these fears.  \n\n&nbsp;\n\n**Get A Free Item**\n\nTo overcome your fears of social tension and rejection, go to a store and pick out any item. Bring that item to the cashier, and try to convince them to let you have it for free. You can use whatever strategy you want, what matters is that you ask to for a freebie. For most people, this is rather uncomfortable because it can create social tension, something almost everyone avoids. \n\n&nbsp;\n\nWhen you try this, you will find that nothing bad happens. At worst, you’ll have a slightly tense interaction. At best, you’ll get the item for free. Facing the perceived risk of social tension and rejection will build your confidence. You will learn that the actual experience of rejection wasn’t nearly as bad as the negative emotions you felt anticipating that rejection. \n\n&nbsp;\n\nTo get the maximum effect, do this every day for at least a week. The more stores you attempt this with each day, the more confidence you will build. I recommend doing this until you are totally comfortable with it and it is no longer a source of social unease. \n\n&nbsp;\n\nIf you get upset when you are rejected, you are taking yourself too seriously. You should be able to laugh at yourself immediately after this exercise. Until you get to a point where you have a lighthearted attitude towards it, you still have much to gain from this practice.\n\n&nbsp;\n\n**Ask a stranger on a date**\n\n&nbsp;\n\nAsking a stranger on a date has a similar purpose as the previous exercise, but is particularly valuable if you don’t have the kind of romantic relationships that you want in your life. \n\n&nbsp;\n\nThe purpose of this exercise isn’t to successfully get dates, it’s simply to face your fear of romantic rejection. Whether or not you get rejected is irrelevant. You’re going to be so direct that there is a very good chance you will be rejected. (However, you might be surprised and end up with a date or two.)\n\n&nbsp;\n\nWalk up to strangers at a mall, a bar, or your college campus and simply say, “Hi, I thought you were cute and I was wondering if you’d like to go on a date sometime.” \n\n&nbsp;\n\nDoing this may be extremely anxiety provoking. Don’t set yourself unrealistic expectations. If you go out and are unable to approach a stranger because you’re too anxious, that’s okay, just stay out for at least 30 minutes and try again the next day. \n\n&nbsp;\n\nThe first time I successfully approached a stranger like this it took me over two weeks to do so. I walked around (without approaching anyone) feeling like an idiot again and again. Eventually, the frustration of not approaching a stranger become more painful than my anxiety of being rejected: and I stepped up and did it. \n\n&nbsp;\n\nIt might take a while for this shift to take place, but it’s worth it. You must force yourself to leave your house and enter a venue with people to approach every day until you just can’t take the frustration anymore and you actually approach a stranger. After this, don’t ‘stop. Keep going until you are comfortable meeting people. This is a process that may take weeks, but you will get a drastic increase in self-confidence from doing so, and you might even get a date. \n\n&nbsp;\n\n**Awkwardness**\n\n&nbsp;\n\nWith the following exercises, you will intentionally risk being perceived as awkward. The nearly universal fear of being embarrassed, humiliated, or laughed at is a major source of our insecurities and defensiveness. \n\n&nbsp;\n\nWhen we overcome our fear being judged by other people for our awkwardness, we free ourselves to take off our social masks and to interact with people in a more genuine, charismatic way. \n\n&nbsp;\n\nYour first challenge is to lie on a busy sidewalk for a minute. Simply lay down as strangers pass by. You may get a couple of looks, and it’s even possible someone will ask if you’re okay, but that’s all that will happen. You might feel like people will judge you and laugh at you, but you’ll find that nothing of the sort happens. No one cares. This exercise will experientially show you this nearly universal truth. People are far too interested in themselves to care about someone lying on the sidewalk; noticing that people don’t care is very freeing. \n\n&nbsp;\n\nPractice this daily until you are comfortable with the exercise. \n\n&nbsp;\n\n**Dance in Public**\n\n&nbsp;\n\nThis is using the same concept, but it takes it up a notch. Dance in public, you can dance in whatever way you want, the key is to let loose. The more flamboyant your dance, the better. It may seem like dancing in public would be social suicide. You might think your reputation will be ruined. Your mind will likely come up with a litany of excuses to avoid doing this exercise; but once you do this, you will find (again) that no one cares much. At most, people will find it funny or give you a bit of an awkward look: but nothing damning or noteworthy will happen. \n\n&nbsp;\n\nYour goal should be to do this for at least a minute every day until you’re comfortable with the exercise.\n\n&nbsp;\n\nIf you do the exercises above until you are comfortable with them, you will notice that you will become much more at ease in social situations. You will have faced your insecurities head on, and your social confidence will greatly increase as a result. \n\n&nbsp;\n\nThe point isn’t to learn how to be awkward, it’s to learn to be comfortable with awkwardness and social-pressure. Facing these uncomfortable emotions head on will force you to let go of your defensiveness and increase your confidence. As a result, it will be much easier for you to access a social flow state and therefore, you will be perceived as charismatic. \n\n&nbsp;\n\n**Conclusion**\n\n&nbsp;\n\nWith what you’ve learned in this short Ebook you will be able to enter a social flow state more easily, and therefore you will have more access to your most charismatic self. Learning to focus your attention outward and making a habit of facing your insecurities head on will notably change how you relate to others; and therefore, how they respond to you. \n\n&nbsp;\n\nAs with anything worthwhile, this is not an easy process. These exercises won’t work miracles. To get the results you want, you must practice them repeatedly until they become comfortable for you. \n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/6ehtn3/the_charisma_blueprint/", "title": "The Charisma Blueprint", "social_network": "reddit", "user": "Socialinception", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1496263347, "permalink": "/r/DecidingToBeBetter/comments/6ehtn3/the_charisma_blueprint/", "nsfw": false, "first_save": 1635435843.7645497, "replies_charged": false}