{"id": "t5_2tand_t3_ic878c", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "Before I start , I have to tell you that I started this because of this community. While you all are digital avatars to me,the love is real. I posted after 2 weeks and then after 75 days.  I am glad I made it this far.\n\nToday I gave a personality test. And it was different this time. I was honest. All these years I have tried to be someone I am not. And trust me its a real thing. There is some thing as \"you\". I think most of our traits can get better with practice. And it is true. You can really excel being someone you are not. Maybe a lot more than by just following your heart. But you will never have the peace that comes of living your true identity. After 195 days of daily meditation, I can tell you with certainty ,that we are not vegetables. We have these things we want badly in life. For me one of those things is freedom. For somebody else it can be Structure or maybe Wealth among a zillion other things. And those few things mean the world to us. And it can't be compensated with a hoard of other things. \n\nEveryday since the day I started meditating it has been a tussle with my mind. Some times I win sometimes I lose. Every time I win ,my mind breaks down a wrong perspective I have and brings me closer to myself. I finally know what peace is. Its like peeling an never ending onion trying to reach the bulb. \n\nSo whats all this story for ? I want you to try it out. Just maybe you'll fall in love with yourself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ic878c/i_completed_195_days_of_daily_meditation_and_i/", "title": "I completed 195 days of daily meditation. And I want to tell you something.", "social_network": "reddit", "user": "_gr71", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 440, "down_vote": 0, "creation": 1597779991, "permalink": "/r/DecidingToBeBetter/comments/ic878c/i_completed_195_days_of_daily_meditation_and_i/", "nsfw": false, "first_save": 1635435803.833494, "replies_charged": false}