{"id": "t5_2tand_t3_pzzxzb", "request": ["1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "4b69452a-b1e5-47af-a734-ad3c2bdce185", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "I spent most of my mid-20s unemployed, depressed and hopeless. I became the black-sheep of the family. My family looked down on me and had no hope for me.\n\nMy brother told me a couple of times that I should commit suicide or leave the house and stay on the street so that there would be more food for the rest of the family, which I could not argue with.\n\nMy mother had also laughed at me at one point and told my brother to laugh at me because I have nothing. I believed I was nothing and of no value in this world.\n\nFor a long time I questioned my existence. It hurt so bad when my brother told me I was nothing and that I chose to not assist in house bills, when the reality was that I really struggled to get a job...And yes I know, how dare I not pay any bills as an adult. I am aware of this.\n\nAt 25 years old(2018) I made a decision to pursue a different career. I started learning programming on my own. I eventually started doing low paying to 0 paying gigs.\n\nAt 26 years old(2019), covid hit, and I try to get what ever gigs I could, not much luck though.\n\nNear the age of 26 years old I got a short term internship, which paid peanuts.\n\nLanding this internship gave me hope, and it was around the time I started changing my mindset and allowing myself to feel positive, and have faith that I already had the things that I wanted.\n\nBetween 26 years old and now 27 years old, I've managed to turn my life around.\n\nAfter that internship, I went on to receive employment at a medium sized software development company elsewhere, and the rest is history.\n\nI now pay most of the bills in the house, and my family now treat me differently. My family does not threaten, despise, or insult me anymore.\n\nI'm the one they depend on the most now. Despite all this, I receive no acknowledgment from my family that I'm taking care of them, the way my brother received acknowledgement when he was doing the most. It's fine though.\n\nI'm glad to realize I'm not nothing as I used to think.\n\nIs so much easier for me to get work nowadays.\n\nMy life continues to get better, and I know it will continue to get better. I'm not depressed anymore, I'm happy, I'm not closed of from the world anymore, I interact with more people now, and I've made new friends and connections after been isolated for sometime in my mid 20s.\n\nNext up, is to move out the folks place and get my own.\n\nI'm not looking for any advice, I'm just writing this in case my story could help someone else.\n\nEdit: Thank you all for your supportive responses. Despite everything's that's happened, I still love my family, and I know I'll get to a point where I'll move out soon and still be able to help them out if need be.\n\nAnyone else having struggles during the 20s, keep your chin up, and expel all negative thoughts and feelings from your mind and feelings. Start having faith/believe/knowingness that you already have the things that you want.  \n\n\nAlso, try not to be anxious for anything in life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pzzxzb/from_mid20s_unemployed_loser_to_successful_late/", "title": "From mid-20s unemployed loser to successful late 20s", "social_network": "reddit", "user": "Kindly_Ask7277", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 974, "down_vote": 0, "creation": 1633197149, "permalink": "/r/DecidingToBeBetter/comments/pzzxzb/from_mid20s_unemployed_loser_to_successful_late/", "nsfw": false, "first_save": 1635437059.6933844, "replies_charged": false}