{"id": "t5_2tand_t3_qbuobl", "request": ["473631e8-2345-457d-a713-cea0ac6f1975"], "text": "So....for about 4 years I’ve struggled with mental health in more ways than one. \nSuicidals thoughts are mans best friends sometimes. \nI gaslighted myself more than any one ever did to me. I picked on every part of me because they were flawed, or so I thought \n\nAbout 4 weeks ago I went to the dentist for a checkup. And it happened to be that I would be getting a root canal(still in the process). That was an awakening for me that I had to get up. \nThe reason being was because I had intentionally let my teeth root because I felt no worth. Absolute worthlessness, you wouldn’t even know cause I would always cover it with the jubilated self that I was. \n\nRight now the process is BIG. \n\nI’ve cut my everyone out of my life. And I just want to start over. I just want to see that person because all the hate. I don’t know how I’m going to do it but I’m going to do it. \n\nI also pray and read my Bible. God has become my best friend 😌☺️. \n\nToday while looking at myself in the mirror, I was about picking on myself, I immediately reprimanded myself not to.\n\nLike I deadass said “don’t you dare” 😂 \n\nFeeling whole is not the end result it’s the journey that makes everything worth it. Knowing so well that the pain doesn’t last forever gives me hope. \n\nWhat inspired me to write this was reading about everyone’s journey, and the GROWTH. \nTHE GROWTH. 👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽 yassssssss. \n\n\nI’m so happy that I’ve found a community where I feel safe. 😌❤️", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qbuobl/its_a_wierd_transition_for_me/", "title": "It’s a wierd transition for me", "social_network": "reddit", "user": "Academic_Fishing", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1634711872, "permalink": "/r/DecidingToBeBetter/comments/qbuobl/its_a_wierd_transition_for_me/", "nsfw": false, "first_save": 1635437352.4558682, "replies_charged": false}