{"id": "t5_2tand_t3_nvsrpk", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "(I’m on my phone and my apologies for weird formatting.) \nI wrote this on my journal and wanted to share it with you all.\n\nI decided to settle on my own pace, and not to rush things. I’m always ashamed of who I am and where I am standing. People my age, people I’ve known before are going out and living their life. They have their own chapter and they have their own pace. \nFrankly, they won’t give a fuck. Maybe they will for a little bit but they got their own stuff to deal with.\nThey’re independent. That’s what I want to be. To stand on my own and not have others worry and walk on eggshells around me. \nI always look away and see their backs to me. They’re so far away. I want to go there. I keep wanting and wanting and I keep losing my footing and I stray and I get lost. The more I try to rush there, the more I lose sight of where I’m going. \n\nNow I am aware. Now I won’t look at them. A peek is good but I’ll stop looking.\n\nNow I look at where I am and I realize I’m not really far. And I’m not near them either. \nThe truth is I’m not really meant to be where they are. Because that’s their path, it’s their own chapter that they wrote, a road only familiar to them but not to me, because that is where I am not meant to be. \n\nI have my own. It’s incomplete. It’s full of tears and bumps and holes and it’s not finished. I have to take things at my own pace. It doesn’t have to be quick, doesn’t have to be slow either. It can be however I want it to be. Tomorrow may be rough, but tonight I am warm.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nvsrpk/i_decided_to_live_at_my_own_pace/", "title": "I decided to live at my own pace", "social_network": "reddit", "user": "Gay_Gayer_Gayest", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 48, "down_vote": 0, "creation": 1623235423, "permalink": "/r/DecidingToBeBetter/comments/nvsrpk/i_decided_to_live_at_my_own_pace/", "nsfw": false, "first_save": 1635435244.2071307, "replies_charged": false}