{"id": "t5_2tand_t3_po33e1", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "Trigger warnings: Suicide\n\nThere is a very **emotionaly graphic description of how it feels to die**. I'm offering a **unique perspective,** even if this doesn't apply to you, there's a lot to gleam from this.\n\nThroughout, though I may seem coldly empasioned, it is for my advantage being realism, I do not impose at all a view - not intentionaly - but through prescriptivism (as putative as it may be) I present to you only compasion and understanding for yourself. The reality reads as harsh and cold - deluded even - for it is that: cold, hard, unfair, indecent. But what is underwritten in this - I hope you'll see - is compasion for yourself - comfort in the romantic sense of acceptance.\n\nPlease enjoy, and critique -- even oppose if you wish! If not the message than the writting. In what we do, whether in critique we construct of destruct, from that we learn.\n\n&#x200B;\n\n***My reponse***\n\nDying is something you can do at any time; it is your recourse and escape, for when thing's get too bad, and you can no longer cope, you have your way out. It's a wierd and wisted way of thinking about it, but when you realy wont be able to take it, then you'll kill yourself, but that's usualy a moment in which your absent, almost beside yourself, the rest is stuggling though, that temptaion that you can escape it, and the struggle against that temptation: that which feels like it's day and night. The long and short of it is, if somehow you manage to make it from one day to the next, as if platform to platform, you'll get better at dealing with it, copping with it. I can speak for a gaurantee that thing's get better, but I'm quite sure one of two thing's happen, you either learn to cope, bear whatever it is that you call your own existance, or thing's become to unbearable to where you will yourself. Even simpler: if you won't be able to bear it, you'll die. You won't be stuck in this nightmarish fear of perpetual doom, you won't be stuck forver enduring something you cannot bear. That say's nothing of living ofcourse, but that ought quell your fear, you'll never be stuck in a stituation in which you can't manage. By deffinition, as long as you live you can handle it. And if you die, it is because you could no longer handle it.\n\n&#x200B;\n\nWorst come worst and that ever happens, know thats not on you, that is not your faliure or weakness. Having said that, it is anything but a peaceful ordeal, and you're quite right in having grasped it. Dying, killing yourself is something poised in doubt. Live and you'll likley live in regret, for the next day you'd wish yourself to have gone through with it the day, the month, the year before, but always too late. But if you do, it's something of a shamed experience, your thoughts become scattered and paniced, you rush from one life to another, none your own. All the would be's and could have's, everything, everyone that could have been your own - that you could have live'd vicariously or directly. Everything that floods your mind, the drowns you, robs you of your breath, make's you despratley claw and inch back to life, none of it is your own, it is everything beside, what somehow, some way could have been your's, if not for being just that one stupid decision out of reach. It feel's like the worst tradgedy, like eternal momentary doom, even the second and third time over, if ever you try. It's not as if your mind's evacuated, left with that empty airy clear water darkness, the peace that's only there when you know everyone ever is gone; no one can get to you. You don't even in your last moment's get that peace or final reprieve, you get almost that final gut punch, that's so much worse, just for spite. If there ever was any design to existance I'd say it was a some some brilliantly cruel twisted irony. But in truth it's traumatic. Dying is near more traumatic than anything else. It's like living out every loss and regret of your life, mocked and tortured - dominated by every single other person that surives you - you'd likeley never even spare a thought for yourself, just all those lives you'll never live.\n\n&#x200B;\n\nYou're right. You'll die wondering. That's not to scare, initimidate even, you out of trying. That's just the reality of what would happen. You must, I quess, even now, to some degree have realistation of that to have the fear, and all I am saying is that that is well founded. I can't speak for normalcy, more than what appears as resounding nature, not that that really speaks to much, but yes, for what little it is worth living shouldn’t be this hard. But it is, and honestly I don't know if it get's any easier, not with any sort of real certainty. You have the opportunity to try, and your against no certain odds; at worst you fail in living and so die, but atleast then you might know. Practicaly, I think you always question yourself, always face up against a sneeking little doubt, even if you face it having lived and done your very level best. Though your time maybe be finite, as is ours collectivley for each of use, you are far from runing out. So righ now, that only distinguish factor, the only thing determing whether you have more time is you, it is upon your will whether or not your time is up.\n\n&#x200B;\n\nTierd, and exhauseted, and hoplessley despaired I have no doubt you are. Broken even? Yes. Despite our aversion, are repudiation of the notion of the idea, people get broken, one whole piece or part by part until there nothing left but a sinking vestige or husk. We are fragile creatures; we live and die, in our effort trying desperatley against that inexerable, honest, intentless truth. We're fragile. Sometime's we break. Sometime's we can't be put back together again. But there is alot to try before you can afford to hold that certainty in knowing that you can not be fixed - you'd be litterally tring to prove a negative.\n\n&#x200B;\n\nIf you are so fundementaly broken, and there exists a minuite possibility that you are just that, you're efforts would go to seeing to your undoing, making up, reversing, correcting, I don't know how many decades or years. Do you think that you can honestly acopplish such a feat in such short span of time? Weeks don't equate to months, nor decades to years. You're tending to a life, don't be daunted by that, but don't overlook the enormity of that.\n\n&#x200B;\n\nThere's a lot of work to be done, you said yourself, life is hard. That's not a burden you should shoulder alone, nor something you can do soley on your own. Fixing people, isn't at all an easy thing, and often a craft task for people alot smarter than you or I. I belive you've already tried so much, thought so much, done so much, but rather than thinking of that as a faliure of mind or will or achivement, think to what it says: to needing greater help, to greater sevirity, to the fact that there are more piece's. Of therapy, just as an example, the is cbt and dbt and cat, emdr and act to name just a view, each for unique distinct maladies, and behind these maladies there are so very many different causes, and all of this without sparing any though to meds, or drugs, or people, or experience, or living. I all of there is so much scope.\n\n&#x200B;\n\nThe best at often time's we see of ourselve's or other people is brokness. Not how that person was broken, we misfortuned enough not even to be able to see the broken pieces, where they are scattered or left behind. This isn't wholey physical, you can't take to your mind with a scalpel and some pills, and pick out with any emidiate certainty that you broke this, dislocated that and are missing a couble of those. There's nothing to put a bandaid on and send you on your sad, missered, merry way.\n\n&#x200B;\n\nThat's the reality, and being knowing of that truth, I think you ought be able to occasion yourself despair. Entireley is it undertandable to weaken on some days and be stronger on others, to tire come day upon day after day as a tirade, to be left able only to drift with the ebbs and the flows into the night and through to the other side.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/po33e1/i_wrote_this_for_someone_thier_last_cry_for_help/", "title": "I wrote this for someone: thier last cry for help. This is honest: a lived perspective on suicide. This could help a lot of people - those on the underside; where suicide is a solution to a problem not temporary but permanent, those in a recurent cycle of living half life's and seeking ends.", "social_network": "reddit", "user": "Tian____", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1631627173, "permalink": "/r/DecidingToBeBetter/comments/po33e1/i_wrote_this_for_someone_thier_last_cry_for_help/", "nsfw": false, "first_save": 1635435132.9957724, "replies_charged": false}