{"id": "t5_2tand_t3_q9als6", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "114bcb12-fed9-47f6-9822-139ba09eebbf", "dad7176f-3c72-4511-aa4c-f36221d5b3c7", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "“None of this is what I ordered,” my friend said, staring at a bag of Taco Bell tacos with broken shells, nachos without cheese, and burritos filled with something pretending to be meat. That bag would have disappointed someone who wanted Taco Bell, but his Uber Eats order had been for Jack in the Box. This wasn’t just the wrong order, it was the wrong restaurant! I’ve seen less sadness on a dog’s face after getting neutered. \n\nAren’t his words the perfect bumper sticker for life? Life doesn’t care what we ordered. Doesn’t care what we wanted, worked for, thought we needed, or put on our five year plan. How many of you had planned a bunch of travel for 2020? I did. I was going to take a different trip every month. I was going to finally visit Europe. And then COVID happened. That wasn’t what I ordered. \n\nMy first reaction, as usual, was to complain and feel sorry for myself. For some strange reason this didn’t help. It usually doesn’t, but I wanted to try again just in case. Failing that, I found this advice from Roman Emperor Marcus Aurelius: “The impediment to action advances action. What stands in the way becomes the way\"\n\nLet me see if I can translate the latin: “Quit your bitching, use this setback to your advantage.” \n\nOuch. Point taken. In my case this meant “Okay you can’t fly to travel right now, but there’s a lot of places in the US you can drive to that you haven’t seen. Get on it.” I could also apply the extra time to things I had been putting off, read more, you get the idea. The point is *it doesn’t really matter what you ordered from life, what matters is how you use the cards you’re dealt.*\n\nYou always have the choice to make the most of your situation or cling to the plans you made yesterday. And the former is always better than the latter.\n\nSometimes it’s hard to find silver lining in the curveballs life throws us, I’ll own that. Sometimes life absolutely sucks and things happen that are objectively bad. In those times I’d encourage you to practice a virtue. What I mean is that losing someone you care about is awful, but it can be a reminder to cherish and be grateful for the ones you still have. Being stuck around unkind people is not fun at all, but it can be incredible practice for mindful observation of your emotions and ensuring you do not overly identify with the unhelpful ones. Not all hands you will be dealt are good hands. *But there is a constructive way you can play any cards you ever get, and it’s your job to find it.*\n\nYou know what a curveball in life actually is? It isLearning something you didn’t know before. Maybe Plan A was “Marry Sally,” but then Sally cheats on you. I would argue Plan A was actually a bad plan, but you didn’t know Sally was a cheater before. Now you do. Your dream job wouldn't hire you for reasons you can’t control? Business partner screwed you over when you thought they’d always be there for you? All of these are Plan A’s that had incomplete information. The curveball was just life giving you some facts you didn’t have before, and now some other plan makes more sense. Don’t feel like a failure because your first plan didn’t workout. You know more now. It’s okay to let go of yesterday’s plans and make the most of what cards life gave you today.\n\nIt’s good to have plans, but just know that life might have other plans. You might not get what you ordered, but you might also get something better. You can make the most of what you have or be the victim of your life story. What’s it going to be?\n\n**Further Reading:** If this post resonated with you then I highly recommend Meditations by Marcus Aurelius. The Stoics are a charming bunch in that they give very practical advice and it’s just as relevant now as it was 2,000 years ago. Life doesn’t have to be complicated. This book taught me to make the most of the cards I was dealt, and it can do that for you too.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q9als6/none_of_this_is_what_i_ordered_a_life_lesson_from/", "title": "None of this is what I ordered (A Life Lesson from Taco Bell)", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 20, "down_vote": 0, "creation": 1634385614, "permalink": "/r/DecidingToBeBetter/comments/q9als6/none_of_this_is_what_i_ordered_a_life_lesson_from/", "nsfw": false, "first_save": 1635435073.475644, "replies_charged": false}