{"id": "t5_2tand_t3_q45e7b", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "Hey people, this is my first time posting here and I kept saying I was going to change but I touched rock bottom and I have to do it. Sorry if my english is kind of broken.\n\nMy girlfriend of 3 years broke up with my yesterday because I said I was going to change, but never really did.\n\nLong story short, I cheated on her once by flirting with a girl from Facebook, she send me nudes, and my girlfriend found out. I cried and cried and made excuses, like \"I was drunk!\" and \"It was my sister than was joking!\" and stuff. We broke up for like 3 weeks and later she forgave me, but nothing was the same. And I kept doing shady shit. I kept flirting with girls, kept asking for nudes, denying my relationship so I could flirt with girls. Sometimes having nudes from my ex and sending them to my friends (not my current ex, but still, really terrible), screenshotting text messages that I got from girls, sending them to my friends too so I could be like \"yeah, bro, I get all the bitches\" or \"yo this girl is a slut she wants my dick so bad lol\" (yeah I know pretty disgusting). Even laughing at them for talking to me and stuff. Always lying to my friends too, because sometimes the girls weren't even interested in me like that but I always wanted to make myself seem like a sex god or something. When I was partying with girls I was always trying to be near them like some kind of leech. A month ago she started seeing that I talked to a lot of girls, always replying to their Instagram stories, hearts and saying shady shit. And found out about some comments and conversations, and everything went to shit agian. We took a break. And I was starting to change, but mostly my discipline, and my egocentrism. We kept talking anyways, and we started to hang out again and she was saying that I seemed different and she wanted to give me another opportunity, I was so happy. But we were at my place, and she asked me to use my computer so I said \"sure.\" But the problem was the last night I was fooling with some friends and I found a semi nude of a ex girlfriend and I was like \"hey bros want to see my exs ass lololol\" or some dumb shit like that. So I downloaded it, and she then saw the picture. She went crazy and asked for an explanation and I was like \"uhhh I have no idea, it must be something else or a bug.\" she said to me \"I am not stupid, you are lying again, tell me the truth\" and later she asked me \"When did you download this picture\" and I said \"uhh like 2 weeks ago\" and she said \"Liar, I checked, it was yesterday. You broke my heart again I have to go.\" I wanted to cry so bad and I tried to make her to stay but it was too late. I fucked up again and I fucked up the real opportunity to be with her. Now it's over and I don't know what to do. I am really depressed but I want to keep trying to change all these idiotic, mysoginistic, egocentric, selfish, narcissist and impulsive decisions. I've been reading books about discipline and changing to be a better person.\n\nIt's not even that I get dopamine or happiness by doing this shit. It's just to fulfill my ego. And I can't keep doing this. I deleted all the nudes, all the old screenshots, and I really decided to be better. Not even for her, it might not even have a solution now. But I want to be different, a loyal, and good person. Just like how I say I was but I just kept lying to myself. I keep talking to her like everyday but it's not the same. It's over for now. And if I really want to try it again I want her to see me as a different person, not this guy right now. I want to kill my old self to make it revive like a brand new person. \n\nI also drink too much. Like when I'm bored, sad, happy and whatever. Right now I'm at college and it was really hard not to buy some beer to chug it in the bus. But I didn't, because I want to change. I don't want to keep being an inmature little guy that lies and makes excuses about everything in life.\n\nI make excuses at job, at college, with my family and obviously, with my now ex girlfriend.\n\nWhat are some advices about new habits I can take? Some books I can listen to? Meditation? I don't know. I'm doing to do anything to really change and be finally happy. and maybe, be with her like a brand new person. Thank you for reading and if you want to ask anything or recommend anything I'm down to ANYTHING. Thank you again my friends, this is a new beginning for me. And I'm at least happy to realize it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q45e7b/my_girlfriend_broke_up_with_me_because_i_keep/", "title": "My girlfriend broke up with me because I keep doing shady stuff, being selfish and egocentric.", "social_network": "reddit", "user": "Awfulest", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1633722747, "permalink": "/r/DecidingToBeBetter/comments/q45e7b/my_girlfriend_broke_up_with_me_because_i_keep/", "nsfw": false, "first_save": 1635436711.815068, "replies_charged": false}