{"id": "t5_2tand_t3_gv6spf", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I (22,F) generally have a tough time reaching out to my friends on a regular basis and this has just lately begun because a phase of intense depression/anxiety (contemplated suicide) and a horrible breakup.\n\nThis is the first time I tried to completely isolate myself from everything and everyone except my parents. My parents (especially my mother) and I've had some troubles over the years but it's mostly talked about and resolved and I know they feel bad for certain things. There are certain aspects I've derived from them but I'm not mad at them. I think they were just trying to figure themselves out too. They're constantly now trying to be better not just for me, but for themselves and trying to understand my point of view which I appreciate a lot.\n\nI find it easier to contact my parents (especially my dad) than my friends because I have less social anxiety towards them. This hasn't been the case over the years but it has been for a couple of months now especially after COVID. If I have nothing to say to them, they'll go on with the mundane things they did or are planning to do which I find refreshing to listen to. Sometimes I go in a rut where I don't contact anyone and just keep on sleeping. Texting my friends doesn't help a whole lot and because of the breakup, I have this thing that people aren't permanent in my life. But I do have one set of parents who will always love and care for me.\n\nI know everyone doesn't have the privilege to say/do this, but if you can, try to talk to your parents once in a while. It's life-changing, I promise you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gv6spf/talking_to_my_parents_regularly_has_been_great/", "title": "Talking to my parents regularly has been great for my mental health", "social_network": "reddit", "user": "confusedAndLost8345", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 34, "down_vote": 0, "creation": 1591102455, "permalink": "/r/DecidingToBeBetter/comments/gv6spf/talking_to_my_parents_regularly_has_been_great/", "nsfw": false, "first_save": 1635437853.314153, "replies_charged": false}