{"id": "t5_2tand_t3_if5kdk", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "Sorry the title sounds confusing, you’re probably thinking “how on earth do you even confuse the two?” Well... I’ve always found it hard not to feel slighted by others’ behaviours. I was very self-righteous. In order to lay off of this toxic way of thinking, I started becoming a lot more empathetic and compassionate towards people, their situations, and their stories. \n\nI started to take more responsibility for my own feelings. I try to rationalise that “this person did this thing because they are genuinely busy” rather than “they’re ignoring me, I must cut them” (which had been my defence mechanism up until recently).\n\nBut I feel that now, I might be doing it to the extreme. Even if a guy I like isn’t interested in me, and is stringing me along, I’ll do the opposite - “he’s only replying when it’s convenient for him without considering my time or feelings” becomes “well he didn’t specify when he’ll be less busy, but I know from what he said in the past that he’s probably busy, so I’ll give him space”. \n\nHow to be able to take ownership of your feelings without accusing, blaming, or feeling personally slighted, but also not be pushed around or be taken advantage of?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/if5kdk/where_is_the_line_between_your_ego_dictating_your/", "title": "Where is the line between “your ego dictating your views almost to extremism / narcissism“ and “becoming a doormat”? How to make sure you don’t fling yourself onto the polar opposite side, when you’re too used to one? And how to know how to keep the balance?", "social_network": "reddit", "user": "helteringskeltering", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1598198098, "permalink": "/r/DecidingToBeBetter/comments/if5kdk/where_is_the_line_between_your_ego_dictating_your/", "nsfw": false, "first_save": 1635435256.3791761, "replies_charged": false}