{"id": "t5_2tand_t3_pu6vqa", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "I've been floundering around unemployed for several years trying to get my mental health together, but I've reached a point where I really need to make some progress into being a functional person. I worked at a grocery store right out of high school while doing community college, until I moved onto a 4 year school and started working in a restaurant for about 2 years. Both jobs started strong, but they steadily got so stressful that I would get the urge to drive off the road on my way into work. I pushed through it, but it got to the point that I was having panic attacks when I'd start getting ready for work. I'd slowly go into work less and less as time went on until I was calling out all the time. Throughout this time I was heavily leaning on the mental health resources provided by my university, and they eventually provided me with a medical withdrawal. With that, I lost access to mental health care and was given medical leave from my job. This happened in 2014. \n\nI haven't done much since. I've been living on a computer more or less. I don't speak with people or go out. I don't have friends. I live with my boyfriend's family. I don't have a valid driver's license or health insurance. I tried looking into disability, but from what I can tell, I waited too long and would have to work more in order to receive any. I've been a burden for far too long, and I've really got to find something for myself that isn't \"when this fails you can just end it.\" \n\nMost of the stress and anxiety seems to be from working with and around people. I love plants and animals. I'm very comfortable in nature. I don't mind hard work, tedious work, boring work, etc. \n\nAnybody have any ideas or advice? I need to find some way to be gainfully employed or live without being a burden that my mental health can handle.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pu6vqa/31_year_old_college_burnout_cant_figure_out_how/", "title": "31 year old college burnout can't figure out how to get it together", "social_network": "reddit", "user": "cumstacking", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 29, "down_vote": 0, "creation": 1632437971, "permalink": "/r/DecidingToBeBetter/comments/pu6vqa/31_year_old_college_burnout_cant_figure_out_how/", "nsfw": false, "first_save": 1635435972.558586, "replies_charged": false}