{"id": "t5_2tand_t3_iq0zxx", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "  Idk if i can post these here, just kinda cathartic to get it out there. \n\n   Not a lot of things can survive a mental breakdown. Not a lot of marriages nor a lot of friendships. Idk what happened, but i somehow found a girl who stuck through it all with me. I can never forget that. \n     Not a lot of my friendships survived, matter of fact most of the people that knew me once usually act like they don't when they see me. I don't blame them, I do the same, but I do it because I'm fucking embarrassed about my past actions. I saw myself become something that I am very embarrassed about. I remember feeling as if I wasn't in control of my own actions and that I too was a spectator of whatever events were unfolding. I'm really glad I sold all my guns when I did. Idk how I manage to not kill myself, I was already putting loaded guns in my mouth in 2012 well before I completely lost it. I remember trying to see how much pressure I could apply to triggers on different loaded guns while I had them in my mouth whenever I was alone. I walked around doing laundry with my .40 cal in my mouth of times while my wife was at work. My teeth gripping the steel gave me such an odd sensation. I'm glad I got rid up my guns when I did. It hasn't been too long since my last flip out where I was wishing I could kill myself, with a gun I stole from my brother's house. I was praying that I would have the strength to do it.\n      I had a childhood best friend that joined the army a few years after I did. After I had been discharged for about a year he was discharged because he's a fucking boot (Hah). After i got out all i could do was drink and then when he got out we were constantly hanging out and drinking. He was my bro before the army and yet our friendship didn't make it. I don't blame him, but it still sucks. He probably got tired of seeing a close friend become some druggie that chose to drink or do drugs over trying to provide for his wife and kid. \nMy wife made good money which definitely hurt my fragile little boy ego. I can now look back and see myself for what I was. A little boy. Time to grow up I guess.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iq0zxx/life_after_mental_breakdown/", "title": "Life after mental breakdown.", "social_network": "reddit", "user": "dailythrowaway001", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1599734884, "permalink": "/r/DecidingToBeBetter/comments/iq0zxx/life_after_mental_breakdown/", "nsfw": false, "first_save": 1635435470.197331, "replies_charged": false}