{"id": "t5_2tand_t3_msx9no", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "hi everyone!\n\nVery excited to join this community, big ups to all of you for being so self-aware and choosing to be better every day.\n\nI am a very ambitious person. I've always been a dreamer, fantasizing about going to this country or doing that project and I do have follow through. I am 28f, and looking back on my 20's, I am proud of myself for following through with many of the dreams I had.\n\nbut the best thing about accomplishing dreams is that you get to dream new horizons. I'm on that right now. building an additional house in my parent's backyard (economy is tough but this is an ideal option), getting married, starting grad school, and starting a business are all on my horizon.\n\nall of my passion projects mean the world to me. they really give my life meaning.\n\n ever since covid hit, I hit  a wall. it's really hard to focus. I work full time at home (part of my job is speaking with COVID+ patients so it's always front of mind), and throughout my work day I make a to-do list of all the things I want to do after work. but then 5 pm hits and I'm exhausted and can hardly motivate myself to do the things I love. I go on a walk and cook dinner and just kind of zone out until bedtime.\n\nwhat are some tips, tricks, resources etc in utilizing that afterwork time to get some passion projects done? I'd love whatever has worked for you or ones you know.\n\n&#x200B;\n\nmuch love y'all", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/msx9no/keeping_motivated_in_covid_times/", "title": "Keeping motivated in COVID times.", "social_network": "reddit", "user": "what-is-it-tho", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1618687583, "permalink": "/r/DecidingToBeBetter/comments/msx9no/keeping_motivated_in_covid_times/", "nsfw": false, "first_save": 1635437244.520867, "replies_charged": false}