{"id": "t5_2tand_t3_mm4b39", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "I challenge myself, and you, if you are interested, to do the following:\n\nDo 10.000 tasks in as little time as you can.\n\nWe can do them badly in the start. That's totally OK, if that's what gets us going. But the key is to start *acting* again, to start working towards our goals. Our goals don't have to be clearly defined from the start, they will become clearer as we go. And as we go, we can do the tasks *better*. We find out what works for us, and what doesn't. I am an overthinker, a perfectionist and procrastinator. For me, I think the only way to get me moving forward is to *just do it.* \n\nWhy 10.000 tasks? That is the number I figured I can do in about 90 days if I really work hard. Tasks are supposed to be small, such as clipping my nails, to doing my laundry, to reading a chapter in a book (so, sometimes they are equal to the goal, but when the goal is larger you can also call them sub-tasks). For example, for an exercise routine, I'd note down every exercise as a seperate task (but not every set... so 3 sets of pushups counts as one task). I'll track all of my tasks in a notebook.\n\nEventually, tasks will be put into *routines.* Such as an exercise routine. Or a morning routine. These help me get more done. I have long wanted to make such routines, but I think a desire and commitment to *get 10.000 things done* shifts routines from a burden to a helpful tool, as you can get more done if you combine things that fit together.\n\nAs I will be doing things longer, I will gradually learn how to *do them well.* That means, not only will I try to do them efficiently, but I will also see how I can aim for a better outcome. Improve my exercise routine. Cook better meals. Etc. And, by *doing things well* I also look inward. I will try to make things fun and learn to do things mindfully. Otherwise, all these 10.000 things may unneccessarily feel like a burden, and I think that's counterproductive, as it raises my chances of procrastinating.\n\nPerhaps I can do this in 90 days. I will need to do about 110 tasks every day. That sounds like a lot, but remember, these are also subtasks. So, doing groceries is a task. Cooking dinner is. And doing the dishes. If I do 5 different exercises in my routine, then I will have done 5 more tasks. Reading 3 chapters in a book is another 3 tasks. I even count brushing my teeth. So, some tasks may take me up to 30 minutes, but others only take me 2 minutes.\n\nAnyways, even if I find that 50-70 tasks is my optimum for a day, then it's fine to take longer, but for this challenge I will see if I can do this in 90 days.\n\nPersonal context: In the past 9 months, I lost my mother due to cancer, my job, my girlfriend, and so much more. I lost my motivation to make something of my life. I somehow found a new girlfriend, but my relationship ended again. We have a 3-month long break, and may want to try again afterwards. Losing her was a blessing in disguise: I see that, even though we cared so much for each other, we couldn't make it work due to our personal stuff. She wants to grow on her own. And that is what I will do. 90 days to do this. I want to find my *joie de vivre* again. I want to take responsibility for my own life, no matter what happened to me. And that is my reason for going on this journey.\n\nI am curious what you think of my method, and if you have any ideas on how to improve it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mm4b39/method_10000_tasks_challenge/", "title": "[Method] 10.000 Tasks Challenge", "social_network": "reddit", "user": "Jastrus", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1617808399, "permalink": "/r/DecidingToBeBetter/comments/mm4b39/method_10000_tasks_challenge/", "nsfw": false, "first_save": 1635435575.2830586, "replies_charged": false}