{"id": "t5_2tand_t3_l8503m", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "I have a girlfriend that I loved dearly in my heart and has always been there for me and genuinely loved me. When we started, all I ever think of is her well being and ways to make her happy and she also see my efforts and appreciates them from the bottom of her heart. I'm the guy that gives big gesture to make his partner feel appreciated and I'm also the kind that will say \"You light up my life\" with pure genuinity and a big and genuine smile and she's the kind that will hug me tightly back when I say things like those. Luckily she's the sweetest woman I've ever met but not because of innocence but because she's strong. I also have a lot of resolve and when I want something done, it will be done with efficiency and heart. One thing I have though is porn addiction. Maybe me being always unappreciated and treated badly before has made me a smart, strong, caring, and warm hearted person but has driven me to porn addiction. I told her about it and she fully gives me all of her support in fighting it. I used to only make it to 1-3 days in no fap but when she entered my life, I made it to 3 months. \n\nThings are going well until I made a weak mistake and go back to porn. I'm into hardcore things too and I did not just come back for one video, it's a big episode. Now I feel extreme guilt, emptiness, and depression. I have also said some extremely mean things to her while we're both in bed because I think I'm a piece of shit and she deserves better and I'm trying to drive her away. She just quiets down and hugs me, when I ask after my mind goes clear on why she didn't respond, she says that I'm not the one talking and she loves me too much and just wants me back. She said she knows the real me. \n\nNow I feel extreme guilt that I can't even look at her physically and appreciate her beauty. I can't even focus cause all I think of is the disgusting images and her feeling down. I'm underperforming and my mind is too full of negative thoughts. I also don't enjoy things that are usually fun. I don't know what to do anymore. I feel very very small. I feel like suicide. She still treats me very greatly but I can tell on how much she's trying hard to assist me. We always make love without even thinking about penetration and just hugging tightly and appreciation of each other but now all I ever think of are very gross things that I don't want to think anymore. She deserve someone better but she's sticking to me like glue for some reason. Now I'm at 7 days of nofap again but still feeling like trash and I am depressed daily. I don't know what to do anymore.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l8503m/price_of_pornography/", "title": "Price of pornography", "social_network": "reddit", "user": "jvyrdn024", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 48, "down_vote": 0, "creation": 1611956231, "permalink": "/r/DecidingToBeBetter/comments/l8503m/price_of_pornography/", "nsfw": false, "first_save": 1635438442.1776025, "replies_charged": false}