{"id": "t5_2tand_t3_dvlf9e", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "2170e8f5-f784-48b1-a4db-f3b547d87da6", "0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": "I don’t know who needs to hear this but I typed up a very long piece of advice for a post on this subreddit and it can be applied to most aspects of your life. I have been suicidal for about a decade now and after surviving two attempts on my life, I feel like I’m finally learning the lessons that not only would have saved me a lot of pain but also could have seriously reduced my depression, helped me stay in school, maintain healthier relationships, and not be reliant on drugs and alcohol. So whether you’re struggling with self-confidence, body positivity, mental illness, or you’re just plain miserable, these ideas could turn your whole identity inside out. I’m currently trying to take my own advice and really practice what I preach because even though sometimes I hate myself, I cannot leave the people who love me behind in this world, not yet anyway. So If not for yourself, be better for them.\n\n\nIf you ever find yourself feeling lost, depressed, hopeless or even just discontent with where your life is at right now, you need to take a good look at what your values have been and be honest and realistic with yourself about what you want them to be. I don’t mean your morals, I mean what gets you up in the morning. Everybody has a thing, belief, purpose, that affects every single decision they make more than anything else. For some people it’s god, for some people it’s themselves, for some it’s family or money or sex. Reflect on what gives your life the most meaning, and be brutally honest. \n\nNext, think about the qualities you want to have instead, ask yourself WHY you want to have those qualities, and then plan the actions you have to take to get there based on what you value the most (or want to value the most even if you don’t right now. You think you care about your wife but looking back, you realize you wouldn’t have cheated on her if you didn’t care about your own happiness more). \n\nThis does not work if you are not honest and realistic. If you value having friends that care and support you, you have to realize you need to value and support others first (and yourself). You ask yourself “why do I want good friends?” And the answer is pretty simple. Because you’re a human who has social needs and you want to feel supported by and connected with people who share similar values as you. If you decide your top priority is to be beautiful, ask yourself why? What is “beautiful” to you, is it just being prettier than your friends? Because if you define success based on how superior you are to others then you will always feel like a failure because there will always be someone more attractive, smarter, stronger, etc. than you. So if being beautiful isn’t about being more or less attractive than other people, does it simply mean being attractive to everyone? Because in that case you’re fucked again. Everyone has their own preferences, there will always be people who find you attractive (or funny or cool or annoying as fuck) and always will be people who don’t, whether you look like hallie berry or marge simpson. So does that mean beauty is getting attention, money, and instagram likes? Also a big nope. Danny devito is one of the most famous people in the world and he’s not exactly a model but god damn is he a beautiful human (Attention is not a need, real connection is). \n\nWe need to feel apart of a community to stay sane, just like we need nutrition, exercise,  intellectual challenges, and a stable environment. (All of our goals are to thrive, not just survive.) So what does beautiful even fucking mean if it’s none of this? Well look at it this way. Almost nobody wins the genetic lottery but it doesn’t mean you aren’t beautiful. Yes it can be advantageous in society to have a symmetrical face, an hourglass figure, large muscles and nice hair. But what will really get you far in life is MENTAL GROWTH, SELF RESPECT, and WORKING TO ACHIEVE YOUR newly evaluated and not-so-shitty GOALS. So unless you consciously decide that all you want in this short life is to be a narcissist, surround yourself with people who don’t value you, and/or constantly seek pleasure instead of real fulfillment, you NEED to forgive and accept yourself. Accept your flaws in your genetic code because they’re not your fault (fault≠responsibility. You have to choose how to handle whatever cards you were dealt) nor can you do anything to change them! It’s your “flaws” that make you perfect. Love what makes you different from other people because that is what makes you beautiful. \n\nIf you stop beating yourself up for not being “good enough” and start acting on your goals that you have made based on your values, all of a sudden you will find that you are good enough. If you want to stop caring about one thing and start caring about another, you have to change your actions because actions are what dictate our emotions, NOT the other way around. Unfollow those artificial instagram models, stop talking to people who are toxic, start working out your mind and body, treat yourself with love and you will start loving yourself.\n\nEdit: created paragraphs, hopefully it’s easier to read. I hope what this lacks in structure is made up for by its content.\n\nEdit 2: Thank you for the award, anonymous user. I added an important little note about the difference between fault and responsibility, something I didn’t understand for most of my life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dvlf9e/take_control_of_your_life_and_decide_to_be_better/", "title": "Take control of your life and decide to be better. You’re fucking beautiful and you deserve it.", "social_network": "reddit", "user": "northcoastian", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1513, "down_vote": 0, "creation": 1573614362, "permalink": "/r/DecidingToBeBetter/comments/dvlf9e/take_control_of_your_life_and_decide_to_be_better/", "nsfw": false, "first_save": 1635435166.142922, "replies_charged": false}