{"id": "t5_2tand_t3_nyupa0", "request": ["c67213dc-0eed-4cac-a781-9bc082742908"], "text": "Stop expecting life to get easy\n\n* Life will not finally be easy when you read the right book.\n* Life will not finally be easy when you find a girlfriend/boyfriend.\n* Life will not finally be easy when you lose the weight.\n* Life will not finally be easy when you get the job.\n\nIt seems like you think something is missing. It’s like you’re impatient for the struggles and uncertainty and pain of life to be over. You just want to get the missing ingredient so your life can be easy/simple/better. \n\nIt’s never going to happen.\n\nIt doesn’t matter how much you read, who is in your life, what your weight or bank account look like. The default human nature is to look for problems, focus on pain, ideate on worst case scenarios. That nature will never go away. You can’t turn it off, you can’t unlearn it. And you’ve worked so hard making yourself better any remaining problem or pain feels like you’re not done.\n\nYou’ll never be done, my friend. That vigilance for problems is an evolutionary tool that kept us alive. It’s an overactive alarm system looking for tigers and trying to push you to store more grain for winter. It’s not designed to keep you happy, it’s fear and anxiety trying to keep you alive. A lot has changed in the last 2,000 years and we don’t need this constant alarm shrieking anymore, but our DNA is what it is.\n\nThis is not a nihilistic post, it’s just a warning label on your brain you’ve never seen: “Anxiety Engine Light Always On.” You need to recalibrate your expectations. Don’t expect life to get easy. Don’t think that an easy life is a reward you get for working hard enough.\n\nLife is struggle. There are always challenges, always things we could do better, always some discomforts. We master one level and suddenly we’re on a harder one. We “figure out” how life works and then life changes. It’s okay. That’s the nature of life and I just want you to stop thinking it’s your fault. And just because it’s hard doesn’t mean you’re a screw up.\n\nAnd even though life is a struggle, you can decide to make it mean something.\n\n* Anxious because you want to try something and you don’t know how it will go? You can feel scared home alone or you can feel scared as you try it anyway.\n* Scared because you don’t feel qualified for your dream job? You can feel terrified and paralyzed or terrified as you click “Submit application.”\n* Terrified of what might happen if you ask that person out? You can feel terrified of the possibilities and sit still or feel terrified as you walk up and do it anyway.\n\nYour life won’t ever get easy. But you can make it worthwhile.\n\nStop expecting life to get easy. Don’t wait to enjoy life until the struggle is over. Decide to be present and smell some roses today. Work hard but take some time for gratitude and message someone you care about. Your life is happening right now. You can’t get today back. It’s not going to get easy later so make sure today matters. What are you waiting for?\n\n**Further Reading**: If this post resonated with you then I highly recommend *The Obstacle is the Way* by Ryan Holiday. This is one of my favorite books because it shows you how to look for the hidden opportunities in every situation - both good and bad. It takes a little effort to learn but once I saw that I could learn from everything that happened to me, it was way easier to stay positive because even when life gave me a curveball I could get something out of it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nyupa0/stop_expecting_life_to_get_easy/", "title": "Stop expecting life to get easy", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1623585260, "permalink": "/r/DecidingToBeBetter/comments/nyupa0/stop_expecting_life_to_get_easy/", "nsfw": false, "first_save": 1635436247.78831, "replies_charged": false}