{"id": "t5_2tand_t3_mgwgva", "request": ["c67213dc-0eed-4cac-a781-9bc082742908"], "text": "I’ve been moderately hurt by a few people in my life. I’ve been bullied, isolated, and had to deal with the consequences of some bad choices my parents made. However, nothing has been extremely serious/dangerous or life-threatening. When I think of these people, I see their humanity and their struggle so well, and I really hope that they are happy/will become happier and live good lives. Forgiveness comes easily, and I am somehow such a kind and understanding person towards them.\n\nWhen it comes to myself, I logically know that what I have done in my life never caused anyone significant harm. Sure, I may have thrown a tantrum when I was a kid or stopped talking to a friend for a week because I was hurt by them, but I’ve apologized profusely, tried to do better and learn from my mistakes as much as possible, and for the most part, I’ve been on the victim end of things rather than that of the perpetrator. However, I still can’t forgive myself for every little mistake I’ve made, every silly or stupid thing I’ve said in a conversation, and all the ways I feel I’ve messed up and keep messing up (like forgetting to do the dishes). If I treated another person the way I treat myself, it would be classified as emotional abuse. I KNOW what I am doing isn’t healthy for me and I have no reason to feel this way. But I keep refusing to understand, accept, and forgive myself? Does anyone know why this is?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mgwgva/why_is_it_so_easy_to_forgive_others_but_not_myself/", "title": "Why is it So Easy to Forgive Others, but Not Myself?", "social_network": "reddit", "user": "Katieagerton", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1617158940, "permalink": "/r/DecidingToBeBetter/comments/mgwgva/why_is_it_so_easy_to_forgive_others_but_not_myself/", "nsfw": false, "first_save": 1635436261.0997303, "replies_charged": false}