{"id": "t5_2tand_t3_iwevia", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I find myself struggling a lot with the concept of living in the moment, enjoy the present, or feel the pain in the current uncomfortable situation, plan for the future, and have goals.\n\nThere are many gurus like Naval Ravikant that believe \"Desire is a contract that you make with yourself to be unhappy until you get what you want.\" So be happy with whatever you have and don't wait for the future. Or Seneca: “ The greatest obstacle to living is expectancy which hangs upon tomorrow and loses today”\n\nOn the other hand, without having a future that excites or inspires you, the present becomes meaningless and without purpose. According to Viktor Frankl in Man’s Search for Meaning, it’s actually impossible to be happy in the present without a future you’re striving for. As he stated:\n\n“What man actually needs is not a tensionless state but rather the striving and struggling for a worthwhile goal, a freely chosen task.”\n\nBoth of these make perfect sense to me and can see the benefit in each one in isolation.\n\nWhat usually happens in real life is that I go from one extreme to another meaning that for a while I go hard on myself, doing everything according to the plan for the future, not giving in any momentary pleasure for a better future. I get tired then start the next phase which I just relax and do whatever I find pleasant at the moment and not caring about the future. And this cycle goes on and on.\n\nI believe there is a balance point but for some reason can't connect the dots and see the full picture.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iwevia/live_in_the_moment_or_plan_for_the_future/", "title": "Live in the moment or plan for the future", "social_network": "reddit", "user": "bysa64", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1600612329, "permalink": "/r/DecidingToBeBetter/comments/iwevia/live_in_the_moment_or_plan_for_the_future/", "nsfw": false, "first_save": 1635437678.5233335, "replies_charged": false}