{"id": "t5_2tand_t3_qdqmx2", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "e234981c-b061-4d83-8134-70d441847f74"], "text": "I had a job at a restaurant making about $11 an hour. I was promised a raise to $12. I didn't get it. I was told I was still going to get it but I was originally told that about 2 months ago that it would start going into my pay.\n\nYesterday I was \"Fired\" and the issue mainly had to do with pay. Although it was somewhat a different issue my reaction and words were based on my lack of being paid what I was promised.\n\nAnyways can you all help me? I will number my issues so that you can reply a bit easier by adding those numbers to your reply if you want to.\n\nA few notes to keep it easier: I live in the USA. I am single. Never Married. No Children... I also have NO friends and NO family (And that isn't an exaggeration)\n\nSo Now I Want To Do Better. Here are a few things I have wanted for a while:\n\n-1. I would like a better job. I would prefer to either love the job or be paid high. Normally you don't get either. I would like a job paying $12-15+ an hour. I could take lower for a really fun job like if I was paid to make youtube videos or draw comic books everyday I would be fine with $7.25 an hour because I would love what I do... \n\nQuestions: \n\nHow can I get a better job that I may actually like?\n\nWhat are some job/career recommendations that don't require a college degree?\n\nWhat are some ways I can make extra money now?\n\n-2. I would like a better car. Honestly my car looks really cool and considering it cost less than $2000 and I've had it a couple years I really love how it looks. BUT the past six months I have had a lot of issues and now I feel out of place. I know my car could use a spark plug change  but it has many other issues including one I think I fixed for $8 with JBWeld that I was quoted for over $1500 at a mechanic shop. The main issue is that it has a lot of issues and issues that coincidence with other issues such as oil in the spark plugs area. I am afraid to fix something and then the car dies anyways.\n\nQuestions:\n\nSo you think it would be better to keep my current car or buy a new one?\n\nShould I only fix the issues I am fully aware of that are reasonable price?\n\n-3. I would like a home or an apartment. Yeah... I live in my car currently. I can save a decent amount of money doing this and although food costs a lot more it is still very inexpensive. At some point I want to get a home or an apartment. With a job I could only really afford rent of $500 up to $1000 a month. Also I have No Credit. It's not good or bad... I just never have had any loans or anything.\n\nQuestions:\n\nWould it be better to rent an apartment or mortgage a home?\n\nIs buying a home on mortgage a valuable investment?\n\nCan I do these things with no credit? \n\n-4. I would like to invest in my hobbies. I have a few things I want to be very good at: Art/Drawing and Martial Arts. I have not had any training in either of these. My favorite is drawing. I would love to be able to draw perfect. Right now my drawing ability is okay but compared to the drawings others can do I'm not that great. I would love to improve and even make money with it. Second is Martial Art. I just want that so I can defend myself if I ever need to. I don't want a career out of it. I also know how to play chess, solve a rubiks cube and other puzzles, and I used to be able to play musical instruments like piano and string instruments. I also write fanfiction and I like writing... But Ultimately my DREAM is to draw comics and write stories for people and for myself. I have so many ideas and I wish I could convey them...\n\nQuestions:\n\nIs it worth investing my time on bettering myself in Art or Martial Arts?\n\nWhich would be the best hobby of I want to monetize it or put out for public?\n\nHow can I do these things while also working?\n\n-5. I would like to travel... Not Everywhere but I have wanted to go to the Philippines recently. I have talked to people online and they seem friendly and smart. I have been quite adverse to Americans... Yeah I live in the USA. I don't like that so many people love drugs and sex and promiscuity and \"partying\"... I may be wrong but most Americans seems selfish and tasteless. Now I may not know much about Philippines but the people there do seem nicer and have less crazyness going on... And I know it's very cheap there and if you make $20,000 US Dollars a year you are equal to the top like 10 percent in Philippines. Their minimum wage is about $200 USD per month...\n\nQuestions:\n\nDo you think it would be worth traveling to Philippines someday?\n\nIs it okay if I look for a partner who may be like me in a foreign land?\n\n-6. I would like to retire someday. I plan on potentially retiring someday. If I retire in the USA that will take a long time but I want to do things so I actually can. I struggle now and save as much money as possible so someday I can retire. If I wanted to retire in the Philippines I could with $200,000 (Even $100,000 is enough) and keep all that money of I get 0.04 percent from like stock investments or something. I don't want to work all my life and achieve nothing.\n\nQuestions:\n\nDo you think it is possible to start investing money into the stock market to help my retirement goal?\n\nIs it alright to struggle now and save what I can in hopes of getting there someday?\n\nIs retiring in another country okay if it is more realistic money wise?\n\n-7. EXTRA QUESTIONS:\n\nHow can I balance all of these things? Normally I Just place all my time at work and save what I can... I have an issue thinking that I am wasting time if I am not at work but time and time again these jobs show me how little they care and their pay also reflects that.\n\nWhat should I do with my life?\n\nIf you were in my situation what would you do?\n\nAny other helpful suggestions or words? \n\nPlease help me! Thanks!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qdqmx2/quitfired_from_job_want_a_better_life/", "title": "Quit/Fired From Job. Want A Better Life.", "social_network": "reddit", "user": "MarinetteXLila", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1634937815, "permalink": "/r/DecidingToBeBetter/comments/qdqmx2/quitfired_from_job_want_a_better_life/", "nsfw": false, "first_save": 1635435220.4530203, "replies_charged": false}