{"id": "t5_2tand_t3_kscqke", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "To be present and in this NOW space is truly amazing. I have always been full of love and it never crossed my mind to break a little piece of that to myself. I was so busy running a household and busting my ass to “create a future” and in the meantime the present was slipping away. All my energy was focused on the love of my life, 3 kids, a full time job, deteriorating health, and the process of buying our first home. \n\nHave you ever been so connected with someone that you can just feel something is off, a vibe to your soul? I put myself in observation mode and scrambled to be his everything. When you blame yourself for everything. Then the person you love more than anything, who is suppose to love and protect you as well, also blames you for everything it can take a toll on your well-being!!\nLoaded with selfishness, no self esteem, and health issues I tried to take the easy way out. \nI didn’t have any support. I didn’t want to have a battle in family court. We spent over a decade of life together, planned a future, and somehow he became an angry stranger, overnight! I disgusted myself even more after my suicide attempt. That next morning realizing if “my plan” worked my baby girl would’ve found me. Reading his disgusting messages that morning. Realizing he had NO respect for me as a person let alone the mother of his kids. \n\nI am not a victim of my circumstances. I am not blaming him for my selfish act that day! I chose to ignore things, to think one day he would be as sweet as he once was. I am not the same person I was back then. I am not even the same person I was last week. I am the creator of my destiny. I am creating a story I want to read. I am grateful to be here for my babies. At dinner time laughing with my kids and thanking the universe I am still here!! \n\nI choose to show up in every single moment like I’m meant to be here, for myself, my kids, and the universe. I am not perfect and I never will be perfect. I decide to be better and everyday I get to decide what I can do differently! \n\nI used to hide my true thoughts and feelings. I used to try and keep the peace while destroying my inner peace. Shame, guilt, and regret were my inner critics weapons. \n\nLOVE, LIGHT , PEACE, and JOY are some of my favorite tools. Unconditional love and forgiveness because I don’t want to erase or replay. I am who I am because of my journey. I self regulated myself to get to this level. It wasn’t easy and it was worth it! Nothing is worth losing this feeling. It is magical! \n\nPlease be kind to yourselves, leave the past in the past, and remember every morning you can wake up and decide who you are going to be!! If you need to reach out to someone for support, I will listen!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kscqke/im_happy_to_be_alive_and_aligned_with_myself/", "title": "I’m happy to be alive and aligned with myself", "social_network": "reddit", "user": "AwakenME_ME", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1610024201, "permalink": "/r/DecidingToBeBetter/comments/kscqke/im_happy_to_be_alive_and_aligned_with_myself/", "nsfw": false, "first_save": 1635438465.5933664, "replies_charged": false}