{"id": "t5_2tand_t3_nnvpgx", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I wasted my 2020 and I only started studying in December and I was in a new school so my 2020 were a waste and I lost all my friends and I had bad mental health during that time. I have gained a lot of of weight and so I wanna lose weight make friends preferably that help me grow like people on these kinds of subreddits or discord or anyone. I also like playing games so any suggestions are welcome. I also want an accountability partner who doesn't just ghost me. My sleep schedule is messed up I sleep when at 10 am and wake up at 6 pm.\nI wanna get my sleep schedule on track and I wanna  develop good habits and finally feel better about myself. I wanna get into a good college and finally feel better about myself. Please help.\n\nSo I had a great year before(2019-2020 before my exams) lockdown but in the end I had a fever and weird things started happening. Like I had nightmares about my friends bullying me, and my mind was telling me lies. Like I used to meditate so I gained a new awareness when I could analyse my thoughts and I remember that I would get thoughts like when I was enjoying myself with friends that\" I need to study and I didn't have time for friends\" or when it would assume the worst about someone. My 2018 was really traumatic, I was bullied a lot, most of my friends left the school and it was my worst year. I used to be in a boys only boarding school so people there were really sneaky and manipulative. But I could see when my mind was misinterpreting things. Since lockdown started I was already in a bad place, I had GI distress and I had an sleep paralysis episode, I would run out of breath suddenly my sleep schedule was erratic. I had exams during that time and a friend crossed me and I was doing great and then I remembered how I used to waste my life before that 2019 and how I should have left that school during 2018. \nI had trouble pooping but after taking laxatives I pooped but it felt incomplete. It was so bad that I had trouble studying because I was on toilet all day of it. The doctor was useful and he was a hack everyone knew that. Thankfully I studied well that year and I only had to revise. Anyways after my exams happened my parents asked me to come back home. I was in 11th grade. After some months the problem started to go off and I felt good to be home. I was a straight A student btw. I actually tried a coaching institute but due to my bad health I performed poorly and I was just done with my studies the world everything. Also I had tried really hard in 2019 to make my problems go away but they didn't. A. I was the most disciplined I ever was. I had lost weight during that time, made good friends who really helped me, also a bully had gone away(he was really pathetic, fighting with every single person, bullying anyone he could). I felt like I had lost even though I made a lot of progress. Everything looked like bullshit, the teachers just made us memorize things without teaching the concepts. I had to study and learn everything on my own. When online class started I was kinda happy but soon after my parents shouted at me and my mother told me that because of me everyone in my house doesn't study. I ghosted my friends because I was ashamed of myself and didn't want to feel worse. After parents shouting I started locking myself in my room and watching netflix all day, shows like seinfeld and friends they really helped me stay alive. I was really suicidal, I had lost interest in everything and I had tried really hard in 2019 to make my problems go away but they didn't. Also a lot of people told me that my face looked sad. And they thought at first that I was too innocent and I was.\n\n\n\nAnother tangent \nAlso I became increasingly cynical during that time,(at the start of 2020 during my exams) learning about capitalism, the gross exploitation during history, and seeing about how people were trying to manipulate you to get what they want. Everyone was marketing their products and services and acting as if they knew what was best for your. Even teachers. I also watched a lot of videos on YouTube about capitalism, exploitation and the injustices going around the world. I was hurt a lot, nobody cared when I was getting bullied (I even stood up and complained to teacher but after a few time they stopped listening), nobody tried to help and talk to me like a human being. Everyone just commented and left like I was a character of a tv show. I know I had my head up ass and I understand that I was conflating some things and projecting my hurt onto the world. However I wanna note that I didn't tell people about my feelings or otherwise they could have used them against me. One of my \"friend\" who stole a lot of money from me and others(he was caught for stealing money from other people) used some secrets against me and I saw other people doing the same to their friends whenever they had a fight.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nnvpgx/my_life_has_been_turned_upside_down_since/", "title": "My life has been turned upside down since lockdown and I want to stop living in denial and make some changes.", "social_network": "reddit", "user": "Crypto_Genetic", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1622320270, "permalink": "/r/DecidingToBeBetter/comments/nnvpgx/my_life_has_been_turned_upside_down_since/", "nsfw": false, "first_save": 1635438350.9944046, "replies_charged": false}