{"id": "t5_2tand_t3_i0b78a", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "[Part 1](https://www.reddit.com/r/DecidingToBeBetter/comments/hu1cgp/so_ive_decided_to_be_better_all_around/?utm_medium=android_app&utm_source=share) [Part 2](https://www.reddit.com/r/DecidingToBeBetter/comments/hw2k24/so_ive_decided_to_better_myself/?utm_medium=android_app&utm_source=share)  [Part 3](https://www.reddit.com/r/DecidingToBeBetter/comments/hzqgul/so_ive_decided_to_better_myself/?utm_medium=android_app&utm_source=share)\n\nAlright, so things are looking better.  There are still a lot of things I need to do, but they are slowly getting done.\n\nI had a 2nd interview today.  I believe I got the job and I'm just waiting for the confirmation email.  We'll see.\n\nI met someone recently.  She lives downstairs and she's awesome.  It could become something or just turn into nothing.  Honestly, I'll be happy for a positive friend.\n\nI am still repairing old relationships, but that is all going well.  Very well.  My friend, the love of my life that can truly be a friend now, asked me for a favor that I will happily oblige when the time comes, so I'm happy about that.\n\nMy relationship with my dad has been strained, but we are working on it.  I like that one in particular.\n\nSo, mostly positive things, but there are negatives.  My current living situation is *not* good.  There is a lot of tension and expectations (even jealousy) that is floating around.  Even though we've discussed these things, my roommate is immature and says things she doesn't mean.  \n\nSo I will soon be leaving, if I can make the last part of this post wrap around to the first.  Fingers crossed, because I am truly trying to do better and stop wallowing in apathy.\n\nThanks for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i0b78a/so_ive_decided_to_better_myself/", "title": "So, I've decided to better myself", "social_network": "reddit", "user": "jusmithfkme", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1596065301, "permalink": "/r/DecidingToBeBetter/comments/i0b78a/so_ive_decided_to_better_myself/", "nsfw": false, "first_save": 1635436531.396078, "replies_charged": false}