{"id": "t5_2tand_t3_kbqf6i", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "I have been trying to code. I started in 2017, luckily I got offered an opportunity due to being at the right place and time. But I lost interest and pursued trying to get into the media/tv/film industry.\n\nI liked working on set but I wasn’t fixated on that. As long as I was working in a network or a company that was associated/directly involved with film and tv I would be happy. But I doubted that I had the chance to get a good career. That most likely I would get a crappy Job in that industry and be living on minimum wage.\n\nSo I convinced myself to try coding again this year. I started learning again and coincidentally made friends with professional developers. I was enjoying it. But then I lost interest and I just found it hard to get interested again. It was partly to do with how difficult it was for a self study to find a job and I felt unsure that I could even get hired. My housemate who studied computer science changed his desire to be a developer and became a consultant; always reminded me that he didn’t see me as a developer. \n\nIn his perspective: I never talk about coding; I don’t keep to date with technology or those working in that industry; he rarely sees me coding. I hired him as a mentor but our last and first session was weeks ago.\n\nI realised that my main motivation for coding was superficial such as money, status, cool work environment, validation of intelligence; there was no passion or love there. I put all my hopes in front end coding job to provide me an exciting safe life. But, now after deciding not to go down that direction, I am unsure what to do. \n\nI feel have been stuck in limbo since graduating; only working in minimum paid jobs and just barely getting by in life. I live in England, you get 4 years loan for undergrad and I have used up my loan so going back to uni is a ‘no go’. I don’t have that kind of money. \n\nI have a habit of picking something that seems mildly good, putting the shutters on and just running towards that goal without any consideration if it’s beneficial for me. So worried I might be in the same situation in the future, I just hate working in minimum paid jobs. I want to get out of the situation, I am willing to do the work, just reluctant to pick the wrong direction.\n\nSo advice from anybody who decided to quit career aspiration to find something else suited for them would be beneficial. \n\nHow did you guys get out of career limbo?\n\nEspecially those who were working in minimum paid jobs.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kbqf6i/how_to_get_out_of_limbo/", "title": "How to get out of limbo?", "social_network": "reddit", "user": "Confidentallyme", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1607785173, "permalink": "/r/DecidingToBeBetter/comments/kbqf6i/how_to_get_out_of_limbo/", "nsfw": false, "first_save": 1635435480.9820583, "replies_charged": false}