{"id": "t5_2tand_t3_ghrgz5", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "Yale's famous [happiness course](https://www.coursera.org/learn/the-science-of-well-being/home/welcome) is available for free right now through Coursera, and it is AWESOME. But if you don't have the time for it, I wrote up a (very, very) brief summary of its contents. Again, I highly encourage you to check out the course for a lot of science, sources, and more information, but hopefully this brief summary is useful for someone.\n\n* Things we think will make us happy that don't:\n   * having a high paying job\n   * having a lot of money\n   * technological and societal advancements (we are no happier on average today than 40 years ago)\n   * cars, material possessions, true love, perfect body, perfect grades\n   * basically, through \"hedonic adaptation\", these things make us happy only briefly before we either start comparing to others again and/or move onto the next  thing we think will make  us happier\n* About 40% of  our happiness is under our control (not determined by genetics, etc)\n* One of the biggest takeaways: our minds'  strongest intuitions about how much we will like something and how happy it will make us (OR how unhappy it will make us) are often wrong\n* Our minds don't think in terms of absolutes - we judge relative to reference points (e.g., my house is nice but not as nice as the neighbors')\n* We don't  realize that our minds are built to get used to things (i.e. hedonic adaptation).\n* Things that actually make us happy/how to be happier:\n   * rethink what \"awesome stuff\" is\n      * invest in experiences over things\n   * thwart your hedonic adaptation\n      * savor enjoyable moments; take a second  to really be there and enjoy it\n      * use negative visualization (\"what if I didn't have this awesome thing?\")\n      * think as if today was your last day to increase gratitude (esp.  in terms of jobs)\n      * practice gratitude daily\n      * reset your reference points (i.e., what are you comparing your life/stuff to?)\n      * interrupt consumption (take a break from a good movie or fun thing; it will make you appreciate coming back to it more - commercial breaks actually increase enjoyment of shows)\n   * Things that actually make us happy\"\n      * signature strengths in a job  > money\n      * \"flow\" in a job >  money\n      * growth mindset > fixed mindset\n      * practicing kindness\n      * social connection (even when you think it will not make you happy!!!)\n      * time affluence > money (value your \\[free\\] time more than money)\n      * mindfulness via meditation\n      * exercise\n      * good sleep\n   * implementation\n      * use situational support (e.g., putting candy in a drawer instead of on your desk will make you less likely to eat it; set yourself up for success)\n      * set specific goals\n      * practice goal implementation intentions (i.e. If it is this time in this place, I will do this behavior)\n      * Practice WOOP - Wish, Outcome, Obstacle, Plan\n\n&#x200B;\n\nIf you have questions, I really recommend checking out the course. There are a ton of awesome additional resources and content. Some of the \"things that don't actually make us happy\" were really hard for me to buy until I actually listened to the science and studies behind them. Note: I am not saying that these things are 100% true in every case, I am just presenting information from the course (which I did find to be very convincing).", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ghrgz5/summary_of_yales_famous_science_of_wellbeing/", "title": "Summary of Yale's famous Science of Well-Being Course", "social_network": "reddit", "user": "candrade2261", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 149, "down_vote": 0, "creation": 1589216343, "permalink": "/r/DecidingToBeBetter/comments/ghrgz5/summary_of_yales_famous_science_of_wellbeing/", "nsfw": false, "first_save": 1635438412.7526207, "replies_charged": false}