{"id": "t5_2tand_t3_nfxd8k", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Well, I made it to a 3rd job interview with a company who I really like and admire.  It was in-person and they even paid for me to take a covid screening before entering their facility.  I met with a panel of 5 engineers and they hit me with their toughest technical questions, and fundamentally I aced it.  Eight years of experience were rolling off my tongue.\n\nThen came the solder proficiency test.  There was one engineer there who was skeptical in nature, asking me some off-schedule questions which implied doubt.  He pointed to the smallest, hardest reach component on a circuit board and asked me to rework it.  To his credit, he did help me adjust the microscope, which was nice.\n\nI was at an unfamiliar workstation, and these components are really really small, very densely populated.  I was nervous going into the interview about the solder proficiency test and my anxiety didn't fail to deliver:  My sponge was not wetted and therefore the solder tip would not stay clean and therefore the solder just wasn't flowing for me.  My mask was fogging up my glasses impairing my vision, there was no brush to remove debris, I didn't have any familiar equipment, and like I said, the solder just wasn't flowing for me today.\n\nIt was kind of embarasing, sitting their fumbling with the part in my tweezers under a microscope while everyone waited for a result.  It took way too long but I completed the first and second test, barely, and certainly not up to standard.  At least one of the engineers was sympathetic, pointing out my technical knowledge and stating something positive at the end of it all.\n\nBut I knew I botched it.\n\nDang if only I had requested to wet the sponge before I began! \n\nThis whole thing brings up feelings for me, going back to middle school, when the teacher had to pull the test out of my hands while I struggled to finish on time.  And then I ended up a ritalin kid.. \n\nThere are two ways I could interpret this.  One: Maybe I just need to work a little harder at my weaknesses and I am just steps away from being the best damn technician in los angeles.  Two:  Maybe I am meant for something more than assembling tiny parts in a laboratory in an industry that is, by necessity, unforgivingly perfectionist, and it is time to consider what the next decade of my life ought to be.\n\nI am disappointed in my performance today but there is a silver lining:  We learn more from our failures than we ever will from playing it safe.\n\nCan't tell you what it is that I learned, but maybe it will reveal itself in time.\n\nMaybe I had invested a lot of hope into this opportunity that it might propel me into a happier phase of my life, and maybe happiness is my own responsibility.\n\nI want to say that I am grateful.  I am grateful to have a job to go to tomorrow, even if its complacent.  I am grateful to have an apartment with four safe walls and refridgeration and running water and heating and cooling.  I am grateful to have opportunities, and brains (when they work anyways), and fingers, and air, and life.  By most standards I live the life of a king, even though I have no queen, and feel kind of burnt out at the end of the work day.  I have weekends, beaches, and hobbies and passions.  I have hope, I have life, and I have love.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nfxd8k/tough_job_interview/", "title": "Tough Job Interview", "social_network": "reddit", "user": "blueeyed_ranger", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1621403066, "permalink": "/r/DecidingToBeBetter/comments/nfxd8k/tough_job_interview/", "nsfw": false, "first_save": 1635436025.2286382, "replies_charged": false}