{"id": "t5_2tand_t3_79h0ep", "request": ["311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "Hello Redditors!\n\nI'm going to do my best to keep this as short as possible, while still bearing my soul into this post so I don't know how short I can keep this, but here goes nothing...\n\nI've been in a dark place for about five years now, but I put myself there and I take full responsibility for it. I was attending a great four year college, living on my own and yet I was so miserable and suicidal because I honestly felt like my life was not mine. It only took two and half years for me to flunk out of college and moved back in with my controlling mother. I would only fall into a deeper depression and soon would attempt to my own life, the rock bottom of my life. \n\nSo, I became a shell. I did not care about myself or life. My mother told me to enroll in community college and get licensee to nurse, because that's what she does and I did. She told me to get a job, so I got a job in sales. At first, I was just walking around half-dead. I would attend classes, but wouldn't retain a thing. Then, I would go to work and just sell whatever that person came in for. No motivation, no drive, nothing. Until, I met my current manager, Ace. He was the first person to see that I still had life in me, and that I still wanted to succeed despite all my downfalls. He took me under his wing, and went above and beyond for me as a manager. He recognized that I had a gift in sales, and pushed me from having the worst numbers in the market to being one of its top performers. I never would have thought in a million years that sales was my calling, and I can't see myself doing anything else...ever.\n\nNow, I'm climbing out of that dark hole I never thought I was going to escape. I recently got offered a new sales job that's going to pay me more than enough to get out of my Mom's house and prosper. I know for fact, I no longer want to attend community college and get a nursing license.  Those are things I know. However, I am terrified of my Mom. She's been controlling my life for the past 21 years, and I know when I tell her I'm moving out she's going to try and put her hands on me. I am terrified of withdrawing from school. Monday is the last day to withdraw from all classes with a 'W' and that's what I plan on doing, but I would like to go back to college and get a degree in Human Resources. I am terrified that I am going to fail and that moving out and dropping out of college (again) will be a mistake. But, I am ready to jump. I want to jump. I feel the intense urge to jump, and do something that makes me happy for once.\n\nI talked to my Dad this morning about my plan, he told me I would regret it if I did this and yet I still feel the need to do this. I know need to do this. This is how I am deciding to do better. I'm just here looking for some advice to do better, and stay better.\n\nTL;DR: I just need some kind words right now, for taking a big leap in my life right now when I don't know where the fuck I'm going to land. That would be appreciated. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/79h0ep/im_terrified_but_im_ready_to_jump/", "title": "I'm Terrified, But I'm Ready To Jump.", "social_network": "reddit", "user": "cartoonsxcereal", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1509290188, "permalink": "/r/DecidingToBeBetter/comments/79h0ep/im_terrified_but_im_ready_to_jump/", "nsfw": false, "first_save": 1635437887.3034515, "replies_charged": false}