{"id": "t5_2tand_t3_kz1k07", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": " tw: cutting, drug abuse, grooming, no contact sexual abuse\n\nalso i'm not sure if this is allowed because it is kinda nsfw, i understand if it gets taken down\n\nI don't have any close friends I can share this story with who might understand and who don't know her so I came to reddit. I can't believe it took me this long to realize she was grooming me.\n\nThere’s a three-year difference between us and when I was 11 she (14) befriended me and I thought I was the coolest person ever for having a friend much older than me. She was aware of my struggling mental health and once mentioned how she cut to cope. At the time I would pick at the skin on my legs to cope. I don’t remember the first time I cut but I know it was because she told me about it. meeting her started my 6 year struggle of trying to stop cutting. I remember being so worried about her and her cutting that I didn’t even prioritize myself. Fast forward a few years I made a porn tumblr and encouraged her to do so as well. There she posted nudes, thankfully, I did not. She still casually refers to wanting to cut when she was upset, I was confused and asked her “where do you cut because I don’t see any scars anywhere on your body?” I remember being extremely jealous, *how come her skin is soft and smooth and mine isn’t?* She got confused and said that she **never cut in her life**. She had no memory of that moment 6 years ago or any time before that when she mentioned that she “did cut”. So she lied to sound cool in front of an 11-year-old and kept that lie going until she was 20. \n\nWhen I was 17 she (20) claimed she was abusing medicine and drugs (but I can’t believe her on that because of her lie about cutting honestly) and while she “discouraged me” she kinda still went “it helps me, so do it if you want”. And I almost did. Another layer of stress added onto me because I thought she was cutting and now she’s doing drugs. I didn’t know what to do and I felt responsible. I felt like if one day she overdosed it would be my fault. So I stuck around and was always there for her because she was lonely and needed a friend and she would always say I was her only friend. \n\nHer parents pressured her into getting married to a guy 8 years older than her right out of high-school and while she had the choice to say no she didn’t care enough about it and just “went with it”. Surprise, he was a shitty person and she started cheating on him. Neither her boyfriend or anyone else other than me knew she was cheating. I didn’t know what to do. I hated her husband, he was a creepy abusive creep and I thought to myself this was the exception. But cheating is cheating and it’s wrong. Especially since her boyfriend had no clue. Additionally, she had slept around with other people as well.\n\nWhen I was 17 her (20) and she was telling me how she “got high” and recorded her boobs I felt like she wanted me to ask to see it so I asked and she sent it. It kinda went to “your turn” and I did eventually send her a nude because I was a dumb kid who thought she was pretty and wanted to be called pretty by a pretty girl. She mentioned to me once over a call how she had sex with a girl and how awesome it was and I told her I was questioning my sexuality. She told me that I should come over and “find out” if I wanted. I was kinda giddy and flattered. A pretty girl wanted to have sex with me???? And I was going to, until I told another sorta friend at the time about it who vehemently disagreed with the idea and I didn’t go (she didn't know the whole story) I was mad that she used my moment of confusion and weakness as a way to try to get into my pants and mostly mad at myself for being gullible and naive.\n\nWhen I told her I made a porn blog on tumblr, instead of scorning me like she should have she hyped me up and encouraged me. And when I said “but I’m still a minor” she went “but you need this and you’re ‘the exception’”. and i believed her. she encouraged me to send pictures to strangers as a way of “empowerment” and “having fun” and kept comforting me whenever I was worried about my age. I still felt guilty so ironically I cracked down other minors in the community to make myself feel better about being here. \n\nThroughout this entire time she was controlling, jealous, and wanted her to be my only friend. she chose what i thought and my opinions and what i liked. sometimes i wonder who i would have been had i not met her, but there's nothing i can do about the past.\n\nI ghosted her a couple of months back, stopped cutting and am slowly and hesitatingly forming better friendships. I have a better therapist and while I know a lot of you aren't religious, I'm finding a lot of comfort in religion. And for the first time in 6 years, I don't want to die anymore.\n\n**SIDENOTE: If you are a minor and in the 18+ community. Stop it.** ***There are no exceptions.*** **I know this wont stop you from watching porn, but I'm begging you to not pretend to be an adult (or worse inform adults you're a minor) to be sexually explicit, you're hurting yourself more than helping.**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kz1k07/at_age_17_and_after_6_years_of_abuse_i_cut_off_my/", "title": "at age 17 and after 6 years of abuse, i cut off my groomer and am finally feeling that maybe i am deserving of love", "social_network": "reddit", "user": "jesseisacutiepie", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 33, "down_vote": 0, "creation": 1610866540, "permalink": "/r/DecidingToBeBetter/comments/kz1k07/at_age_17_and_after_6_years_of_abuse_i_cut_off_my/", "nsfw": false, "first_save": 1635438248.0924711, "replies_charged": false}