{"id": "t5_2tand_t3_gfxm2v", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48", "311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "Most peoples mind can easily grow out of control. Just like if you dont take care of your lawn or car it can easily become a big mess or problematic. The same is true for ones mind - it needs to be taken care of with mediation, discipline, healthy food, positive thoughts, self love, knowledge/wisdom, etc.\n\nLearn to discipline the mind, otherwise you will be easily swayed into seeking only pleasure instead of joy and fulfillment. Pleasure rarely ever yields long term peace or real joy.\n\nLet me give you an example. Lets say one desires prosperity and achieves success in that area. With an *untrained mind* a wealthy person can easily became abusive or controlling with others, they may seek super rich foods to indulge in, they could get involved in excessive drinking, partying or harmful sensual pleasures - all of these things only give short term pleasure and rarely ever yield long term peace or joy. On the other hand, lets say a person with a highly *trained mind* accumulates a lot of wealth. They can enjoy their life greatly but also be of help to those who sincerely need it. Instead of seeking immediate gratification or pleasure they will seek true joy and fulfillment. Instead of being immature, they can develop leadership mentality. Drinking and partying (if one desires that) can be done with discipline and moderation. This lifestyle has a much greater chance of resulting in a true and healthy peace, happiness and overall life satisfaction and fulfillment.\n\nSurely you have heard stories of people who achieved great success or wealth and they went down a path that lead them to complete misery - this was due to an untrained and undisciplined mind. Then you have have heard stories of those who had the same success and wealth, but also had enriched lives. This means joy and happiness, but also things like harmonious relationships, respect, a sense purpose, a peaceful mind and fulfillment.\n\nThis is your life, make it the absolute *best one possible.* So play to your strengths and know that you are worthy of happiness. This is the birthright of each and every person (not just a select few). Welcome success, prosperity and joy into your life. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gfxm2v/a_trained_mind_leads_to_happiness/", "title": "A trained mind leads to happiness:", "social_network": "reddit", "user": "world_citizen7", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1588959423, "permalink": "/r/DecidingToBeBetter/comments/gfxm2v/a_trained_mind_leads_to_happiness/", "nsfw": false, "first_save": 1635437128.906595, "replies_charged": false}