{"id": "t5_2tand_t3_ab75ck", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "This is copied and pasted from a post I made to r/offmychest the other day. I guess I’d really like some suggestions on how to feel better as I have no idea where to begin to move past this stage in my life and grow and flourish as a person. I hope this is allowed in this sub. If not, I’ll delete it. \n\n\nIdk how coherent my thoughts are atm. I’m also just going to say the first adjective(?) that cones to mind and feels right, no matter how much or little sense they make.\n\nLately I’ve been feeling like my spirit/body/soul is clogged, like it’s been used and abused and it needs to be cleansed and freed. I think one of the major reasons for this is because I was raped a few months ago. I’ve been dealing with depression for years beforehand but I’ve mostly felt “myself” and free. I can always tell when I’m not feeling this way as I can see the way people act when we interact. When I’m feeling myself, I feel energised by people’s presence and vice versa. When I’m not, I’m sure they can feel my energy shift. This has lead me to believe auras are real. I’ve always felt like an outsider but now I just feel incredibly lost. This has lead me to partake in some questionable behaviour, like casual sex, being more risky with drugs, neglecting my studies a bit, and I just want it to stop. I guess I want to find and free myself, but how?? I don’t know what to believe in or do anymore. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ab75ck/how_can_i_cleanse_myself/", "title": "How can I “cleanse” myself?", "social_network": "reddit", "user": "marshnellow", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1546263180, "permalink": "/r/DecidingToBeBetter/comments/ab75ck/how_can_i_cleanse_myself/", "nsfw": false, "first_save": 1635436553.9245613, "replies_charged": false}