{"id": "t5_2tand_t3_o2ri99", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "So I posted about realizing how much of a shit parent I have been to my kids (7m, 5f, 1f). I wasn't giving them enough attention, I've been.. I won't say \"mean\" or \"abusive,\" but if someone called me that, I wouldn't deny they're right. I haven't spanked the older two in years because I realized that spanking, even as a swat on the behind, is just not the parenting style I want to use. Regardless, I've been inconsistent, and my punishments range from too much for the situation, or not enough. \n\nBefore I started seeing my therapist, I started with just small things that I already know. I listen to their stories, even if it means stopping what I'm doing for a minute. I tell them \"no\" much less, because I realized most of the time I didn't know why I was saying No in the first place. I'm more engaged with them.\n\nI've started seeing a therapist for multiple reasons. I've experienced abuse in my own childhood all the way through adulthood and it has affected my parenting, my marriage, my life. One of the things I told my therapist I wanted was to be a better parent, because seriously, I have the best kids in the world and they deserve the best parent I can be. \n\nShe works with a school during the school year, so she tells me what *she* does with \"her\" kids. The one I've implemented first is using a 1:5 ratio of negative/positive. If I say something negative, I should have 5 positive things to say to them, as well. She said 10-15 positives for particularly troubled kids, and while mine aren't \"troubled,\" I basically just try to fit as many positives as possible into the things I say to them. *\"That was such a smart decision you made!\" \"I love how patient you are with me while I finish what I'm doing.\" \"I love what a good sister/brother you are when you share! That shows what a kind person you are!\"*\n\nAnd it's working! Using the therapist's tools has lead to a great effect. They're listening more, they're thinking about their actions more. It's really a beautiful transformation to watch, even with such a short time. And I'm proud of myself, too. It's hard to getting in the habit, but knowing I'm doing the right thing is making it so much easier. \n\nTl;dr: I realized I've been a shit parent, and started seeing a therapist. The tools she gave me have been helping me be a better parent, and I love the results I'm having \n\nThanks for reading!\n\n\nEdit:\n\nThank you so much to everyone for your support, kind words, advice, and awards. I really don't know how to express how truly touched I am. And when I say that, I mean literally; it's something I'm trying to learn in therapy lol. I've spent a fair bit of time tearing up and crying reading the things everyone has said.\n\nTo those of you who reached out and said you wished your parents were like mine.. especially the ones still living with your parents.. my heart truly aches for you, and I'll keep your stories in my heart to help remember why I gotta keep doing better. Not that my kids aren't enough to remember, of course; knowing what potential future I have with my kids and the lives they could grow up to have is fuel to the fire. I hope desperately that your parents do what I'm doing now and say \"hey, I need to do and be better.\"\n\nTo those of you who said reading this made them realize they need to do better themselves.. I'm so glad my story was able to touch you. I know how it feels to look at yourself and realize how much better you need to be doing as a parent *(spoiler alert: it sucks.)* The good news is that the brain isn't fully developed until 25, so if your kids are still young like mine, there's still time for us. And if they're my age, my mother is proof that there's still time to change your relationship with your adult child. \n\nThank you so much, again, and good luck!!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o2ri99/realizing_im_a_shit_parent_progress_update/", "title": "Realizing I'm a shit parent- progress update", "social_network": "reddit", "user": "Th3FakeFatSunny", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 263, "down_vote": 0, "creation": 1624029588, "permalink": "/r/DecidingToBeBetter/comments/o2ri99/realizing_im_a_shit_parent_progress_update/", "nsfw": false, "first_save": 1635435363.2978377, "replies_charged": false}