{"id": "t5_2tand_t3_pl9u2v", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "My husband (25M) and I (25F) had to have an adult conversation with my parents about a month ago regarding their parent plus loans they took ours for my financial aid. They believe that it is my responsibility to pay that amount by logging into their account, attaching my bank account, and paying it for them. Obviously,  this is completely wrong and a falling out has occurred where they are turning family against us, specifically me. I'm getting text messages, phone calls, hate-filled messages about how I am not considerate of their feelings and it's my fault people are feeling this way. \n\nThen I start my first year as a teacher. I make it one day, and the next I have a complete panic attack; the shakes, hyperventilation, headaches, and dry heaving. I would keep trying every morning but I would have panic attacks. It's now to a point that I am not working. I have been to the doctor and was diagnosed with General Anxiety Disorder. I never thought that I would have something like this. \n\nI forced myself into therapy and it sucks, but it's helping, along with the meds. Every day has been a struggle and the feeling of not wanting to be alive anymore is slowly going away. I started exercising more, creating a routine for myself, reading more, just trying to keep a calm mind. I will have good days where my mind isn't a thousand voicing shouting how horrible I am and then I get a hateful message from family. \n\nBut today I had the smallest whisper of reason, and today was a good day. Every day is getting better. That doesnt mean life doesnt suck, but its getting there.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pl9u2v/my_life_was_just_shit_on_and_im_finally_hearing/", "title": "My life was just shit on and I'm finally hearing the whispers of reason.", "social_network": "reddit", "user": "gabigale23", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1631232234, "permalink": "/r/DecidingToBeBetter/comments/pl9u2v/my_life_was_just_shit_on_and_im_finally_hearing/", "nsfw": false, "first_save": 1635435778.838512, "replies_charged": false}