{"id": "t5_2tand_t3_nfkjfh", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "I am almost 22. I haven’t had any clear addiction to substances, but I’ve spent the last year and half smoking on and off with friends. Sometimes religiously, others not at all. \n\nI don’t drink often, but I do socially. The issue is I take advantage of occasions that encourage overdoing it. Friends wanna get drunk, I will too. Hard week, lots of stress, let’s gulp down to squeeze the anxiety out.\n\nThroughout these few times I have overdone it (it’s like 3-4 times per year as I see it), I have found myself in a few really bad experiences. My two most recent ones, were a time I broke a heart while drunkenly speaking, the other I got punched and knocked out at a party for absolutely no reason whatsoever.\n\nIt’s time I face these experiences for what they are. Yeah, they may make intriguing stories to tell, but in reality they are just reminders. Reminders that I keep running from my fears and I keep drowning myself in  my unresolved psychological repercussions. So, on behalf of this wonderful attempt I am making these months, to grow and mature even the slightest bit, I hereby promise myself I’ll stop trying to numb my problems by making a mess of myself with alcohol & as I have been doing already, I will not fall victim to smoking again. I need to resolve what needs resolving sober. Otherwise it’s one more lie on the stack.\n\nI wish you all the best in your situations, whether similar or different, better or worse. We can be content without messing with our mind and health.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nfkjfh/a_flat_no_to_any_form_of_substance_abuse/", "title": "A flat no to any form of substance abuse.", "social_network": "reddit", "user": "P4rmen", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1621367900, "permalink": "/r/DecidingToBeBetter/comments/nfkjfh/a_flat_no_to_any_form_of_substance_abuse/", "nsfw": false, "first_save": 1635435169.7571533, "replies_charged": false}