{"id": "t5_2tand_t3_bqb8n5", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "Y'all say self improvment is the key but i dont know where to start.. would self improvment or stop chasing approval would fix any of those below? :/\n\nMost say love your first or work on your self first etc... i still absolutely hate my self...cause\n\nIm not cool, im invisible, im boring, i dont have confidence, low self esteem, chasing approval, im not charismatic, girls dont want me... no one wants me, aint important to nobody im not witty, i dont have humour, i dont have my own opinions, im a brainless pathetic dude, so no one loves me, im not charming, im not intelligent or smart, im a bitch r/niceguys worst kind of people... and i dont know how to fix any of this shit\n\nI dont know how to hold a convo with people mostly girls, i dont know how to make friends, i dont know what stuff to talk abkut or what topics... i dont know how to be interested in people.. i purely want to be interested in them but approval seeking/being boring from me doesnt give me a chance to get to fucking even know them...\n\nSo i will never meet any girl, im bad at small talk, at the start of meeting new people im scared of what im gonna say.. cause they might not like it or thought its boring or stupid.\n\nAnd i always chase other people for validation to make me feel worthy or im good enough or im a cool person.. but i always get ignored and end up beating my self up.\n\nI always based my self on how many Rts and likes i got.. i would cry and feel unimportant when others would get it.. and would think they have everything that i dont have. Most i was obssessed with was girls. I was invisible:(..\n\nI also chase them because im desperate for attention and friends, i dont have anyone that thinks im important at all, nd my parents have their own issues.. \n\nI see others having friends and girls chasing them i compare my self to them like an idiot and i look at others like they are fucking gods.. \n\nand my opinions arent imporant enough..\nI dont have any interesting ideas or opinions. \nMy mind isnt creative like that.\n\nMy most convos are like an interview, the other person gets bored and just gives me on word replies.. \n\nMy only goals now are getting a GF or my hobby is porn..im lazy af. I dont know who i am or i dont know who should i be, im lost, i dont know what the fuck to do anymore..\n\nMost you all say to do hobbies. Well i live in a towm called Harir in Kurdistan/iraq its a small towm only hobby is soccer and other is Gym \nI dont have money for it. And most jobs suck ass here.\n\nAnd therapists arent available here.. iraq is 4th most curropted country in world.. something like a therapist wont be here. I want to move out oneday..", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bqb8n5/how_do_i_love_my_self_more_and_stop_people/", "title": "How do i love my self more and stop people pleasing to be my friend and how to make friends? or stop chasing fucking attention?", "social_network": "reddit", "user": "hamacule55", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1558228130, "permalink": "/r/DecidingToBeBetter/comments/bqb8n5/how_do_i_love_my_self_more_and_stop_people/", "nsfw": false, "first_save": 1635435842.4426591, "replies_charged": false}