{"id": "t5_2tand_t3_oq4w4y", "request": ["4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "To start this i want to say that this my 1st time posting something like this i mostly lurk and sorry if there are spelling mistakes English isnt my 1st language, so please bear with me and i plead for your help.\n\nMy relationship of 4 months has just ended, i'm crying alot and im not feeling well at all. Most people would tell me that 4 months is nothing and that i shouldnt be so hurt, maybe they're right, but i really thought that i've found someone who i will be with for a long long long time and i allowed myself to be vulnerable and i ended up getting hurt. I just don't know what to do right now, i feel lost...\n\nWe met on tinder, we are both 22yrs old and it was long distance, but like 2hrs drive. It was really hard, but we were managing it. We had plans that when she finished her college, she would go to Masters study in my city , and then find work. I know long distance sucks but we achieved it somehow.\nHer reasons for breaking up are, that she is depressed and she doesn't love herself, that she has a low opinion of herself. That she doesnt want to feel good only when i compliment her. She also says last few weeks she was very moody and is changing moods alot, which is true. One point she is coldish, another she is very loving. But this is not forgeign this happened before, so i thought nothing of it. She said that ever since we returned from our 10 day holiday that she started more and more hating herself. And i dont know what to think, she doesnt want my help, she says she wants to do it alone, to fix herself on her own, that everyone helps her and doesnt want me to help her. I dont get that part, maybe im dumb , but if i ever felt that way i wanted her to be there for me, but whatever.\n\nAfter this and past experiences(which i frankly cant write as it would take alot and this is already a long post) i would like to reavaluete myself. Im the type of guy that would give everything for the person and more. Ofc im not a doormat i respect myself, but cant help notice that people that are in long relationships(that of which i know personally)dont treat their SO as good as me. And maybe thats where im wrong... But i just cant be someone im not, im a kind person by nature i believe in \" Treat others as you want to be treated\". This breakup obviously happened out of blue, i even asked if this was the problem, but i was assured it was not...\nMaybe im just unlucky in this period of life, i dont know...\n\nSorry for venting, i just needed to tell all of this to people that dont know me and wont be biased. I really would want someone to help me, i feel like im drowning and i dont know how to handle something like this in the future... Im just looking for an advice and an honest opinion. So please help me !\n\nTLDR: Always feel like its my fault for a breakup and i dont know why.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oq4w4y/am_i_the_problem_in_my_relationshios_or_is_it/", "title": "Am i the problem in my relationshios or is it just my bad luck, and if i am want to overcome this?", "social_network": "reddit", "user": "BlindingLightsss", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1627054524, "permalink": "/r/DecidingToBeBetter/comments/oq4w4y/am_i_the_problem_in_my_relationshios_or_is_it/", "nsfw": false, "first_save": 1635437436.6929634, "replies_charged": false}