{"id": "t5_2tand_t3_q33ihh", "request": ["1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I am 21 year old female with history of depression and anxiety over the last few years which has gotten worse after the pandemic. My sister is getting married in November and I do not feel an ounce of happiness or excitement for her. I am not close with either of my parents so do not really have a support system. I really want therapy but I do not do well with explaining emotions through calls and honestly cannot afford therapy right now. I also have a business school entrance exam in November but can’t really make myself to do study hard anymore. It feels like I do not care about anything in my life anymore. I really tried a construct a routine of studying eating healthy food and exercising for the past one year but I cannot bring myself to it anymore. For the past couple months a have been falling into repetitive episodes weekly which have now converted into more of a permanent situation of depression, loneliness and feeling nothing. I don’t think I have experienced any joy since the past year and half. I feel like my mind has reached it’s capacity after such a long period. I do want to get better and stop feeling no emotion whatsoever all the time", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q33ihh/how_to_stop_feeling_nothing_and_depressed_all_the/", "title": "How to stop feeling ‘nothing’ and depressed all the time?", "social_network": "reddit", "user": "Sweaty-Initial2743", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1633590235, "permalink": "/r/DecidingToBeBetter/comments/q33ihh/how_to_stop_feeling_nothing_and_depressed_all_the/", "nsfw": false, "first_save": 1635437073.6669157, "replies_charged": false}