{"id": "t5_2tand_t3_qfk0h3", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "c6df14ee-195b-4e9d-8032-7cca73d46fe8", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "&#x200B;\n\nI want to learn to speak up for my self because some people only become more nasty and cheeky when you remain silent and ignore them. People going in front of you in lines or once insulting you means somehow that they can continue to insult you until they get a reaction but when you stand up for your self they laugh, which makes you never stand up for your self again and take even physical abuse but it is mostly psychological like them throwing things at you. Like, I didn't sign up for that, it is them who are disrespectful but I am tired of having to throw things back or speak up for my self, it seems unless someone cool spoke up for me they didnt go away and just continued to push and hover over me because they knew I couldn't handle being touched. How is that a weakness, you are clearly making me uncomfortable and enjoy it. They never change so I want to change and prevent such situations. Like what do I say? I was never good at comebacks, arguments anything. And at the very best if I am not threatened to be beaten up I get told to shut up and I do and listen like a good little girl since I have been victimized since childhood and conflicts make me feel like I am drowning with no access to oxygen and it feels like my entire body is on fire and in pain. How do you...just argue back and not break down mentally or want to run away?\n\nHow do you not feel a huge hole in your stomach and severe physical pain from just defending what is yours from someone who is nasty and continues to take and take and take while you try to blend with the walls and become invisible while they think your quitness is annoying and rude, but if you ever talk and laugh they attack you. I have had a lot of situations like that in school and it seems to be related to anxiety, and people attacked me more when I was unsure, anxious and insecure but I could not control my fear or shaking, I almost felt like fainting. However since such situations are part of life and I can self isolatre so much, I want to learn how to manage them. I want to learn to push back/fight back and make such people lose interest in me. What is so interesting about my mental illness preventing me from speaking due to fear and them taking advantage out of that and thinking they are on top of the world is beyond me. All I do is just do my thing and there is always some guy and his friends to ruin it, while it mostly happeend in my teen years I want to learn how to prevent it, as a woman. I want to live my life and not hide in my room behind a screen all day. I want to smile without feeling like someone is going to bully me again, because I am happy and they can't handle it. I have had teens and old people be mean to me on the street and the bus, but I don't know why, which is why I am writting this. I cannot prevent their behavior, only I can control how I can react, so how should I react? What is the correct way to react? Do you glare? Laugh? I am not witty and tend to freeze. Talking to people definetly helps but my goal is to make aquintances and friends, to cope with the years of loneliness since the age of 9 and also not be attacked. For me friendships and respect are important and I rarely got respect. It seems my insecurities and anxiety or overloudness/quietness makes me a target. I want to stop being a target and learn what makes one to avoid this behavior", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qfk0h3/how_do_you_speak_up_for_your_self_without_causing/", "title": "How do you speak up for your self without causing a scene if someone wrong you if you never learnt how to, because you grew up in abusive place and your peers bullied you, so you remained shy and anxious and avoided people and situations? How do you stand up for your self without breaking down ?", "social_network": "reddit", "user": "Soft-Clue-6345", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 922, "down_vote": 0, "creation": 1635177898, "permalink": "/r/DecidingToBeBetter/comments/qfk0h3/how_do_you_speak_up_for_your_self_without_causing/", "nsfw": true, "first_save": 1635435120.6997714, "replies_charged": false}