{"id": "t5_2tand_t3_hxsnpq", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": " Hi, reddit. This is a throwaway account, however that's not important.\n\nI sexually assaulted someone, and I would like to know how and when the best time to apologise would be.\n\nFor context, this was during our mid-late teens, and we were in a relationship for 7 months. I was young, stupid, and ignorant of how consent works in a relationship. While memories are hazy, I wholeheartedly believe now that some thing/s that I did, I took her consent for granted. The years have gone by and I have definitely come to understand how consent works, and that consent should be asked constantly in situations that involve intimacy, amongst other situations. I also understand that my behaviour and how I acted sexually during my relationship was strongly influenced by pornography and the sexual fantasies that developed as a result of it.\n\nAfter our break-up, we spoke for a while until I decided that I didn't wish to speak to her anymore, as I did not feel comfortable talking with her (she was my first \"official\" girlfriend), and have since never spoke. Recently, it's come to my attention that she's been sub-tweeting about me, and labelling me as a r\\*pist, although not directly naming me. Her realisation that my actions were wrong has caused me to rethink my actions, and I believe that I'm in the wrong.\n\nI want to apologise to her, but I don't know how and when would be the right time to approach her. I believe she doesn't wish to go public, and in one of her tweets she said that a photo of me in a friend's instastory triggered her.\n\nMore context, she suffers from long-lasting depression, and has been even before her and I were in a relationship. I believe my ignorance of depression and handling depression has also led me to do wrongful actions, such as attempt to control her (e.g. force her to stop smoking, force her to stop drinking alcohol - these are ones that I remember I've done).\n\nI've directly affected her and the people around her negatively, and I want to take responsibility for what I've done.\n\nThank you for reading.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hxsnpq/tw_i_sexually_assaulted_someone_and_i_dont_know/", "title": "(TW) I sexually assaulted someone and I don't know how to apologise.", "social_network": "reddit", "user": "pathtoclarity", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1595705473, "permalink": "/r/DecidingToBeBetter/comments/hxsnpq/tw_i_sexually_assaulted_someone_and_i_dont_know/", "nsfw": true, "first_save": 1635437030.5218997, "replies_charged": false}