{"id": "t5_2tand_t3_psrqm1", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "[Last Post (2 Months Ago)](https://www.reddit.com/r/DecidingToBeBetter/comments/ouoaa4/in_one_year_i_want_to_be_the_person_i_want_to_be/)\n\nThings that I posted about wanting to improve:\n\n1. Fashion/Style\n2. Being Healthy\n   1. Teeth/Bodily Health\n   2. ADHD/Depression/Trauma\n   3. Exercise\n3. Passing my French test\n4. Saving 15k.\n\nIn the last post I mentioned picking up a second job: Not only did I leave that second job after a week, I left my first one as well for a new one.\n\n**Job/Health/Saving:**\n\nNew Serving/Waiter Job: Union protections, Extremely good benefits, accessible by public transport, 401k. Decent pay. Mandated, **Mandated** 30 minute break for a double. 1 square meal per shift. Not just fried stuff either, there's veggies, milk, fruit, coffee, bread, etc.\n\nThe benefits are amazing. Of the various types of doctors that I'm planning on seeing for my health issues, there are at least 5 of each type which are easily accessible by public transportation in my network.\n\n**Annual Deductible: $300. Out-Of-Pocket Max: $800. Monthly Premium: $10.**\n\nYeah.\n\nHowever, the pay seems to be a little less than stellar, without going into details, my general impression is that the income at a place with worse insurance and without Union protection would allow me to save a good deal more. As a server/in the tipping based restaurant industry, especially now, it's hard to predict.\n\nSo I have a conflict of two different priorities: Addressing health issues vs. Saving more money\n\nI've moved around a lot, so I've been able to personally put the \"Wherever you go, there you are\" to the test. Since I graduated from college in 2018, I have moved between between 7 - 9 times, depending on how you define \"a move\". One thing is certain: Going to a new place does not cure any of the mental issues that I have. However, the different environments changed the level of which I was able to cope with them.\n\nAssuming I keep my current job and save $1ish-k/mo, here are my options:\n\n1. Move/Immigrate to France in 2022 with $15k.\n2. Move/Immigrate to France in 2023 with $30k.\n\n\\#2 is the smart move. I'll have a much larger financial safety net. More time to spend in therapy. More time to study the language.\n\nBut I'm impatient with the fact that I'll be here in Chicago for 2 years, working a meaningless server job serving steaks to lawyers in this restaurant, and when I consider the fact that I *could* chance it and just run off next year, I'm extremely tempted. I could just take the jump and figure it out as I go. But once I get to France, it'll be awhile before I'll be able to get the same level of assistance with my mental health when I'm over there, plus I'll have to figure out how they're whole system works, work with therapists who don't share a native language, attempt to access those facilities as a foreigner, etc. From my understanding it's not as bad as it sounds, but it's certainly more complicated than what I'll be able to access here once my 90 day waiting period is over.\n\nImmigrating to another country will be taxing on my mental health at first, but eventually get better as I'll start to find myself in a general cultural and social climate that's I'll (hopefully) find more compatible. If I can just get myself to wait that extra year, I can go into it with less financial stress, with more time spent with a therapist to address more deeply my fundamental mental health issues... But I just get so antsy for some reason when I stay in one place for so long. I'm not really sure why. I think I use the novelty of being in a new city as a crutch - And I gotta tell you, it does work and have a positive effect on my mental being. But eventually banality comes back to town and whatever it is that's causing me this chronic mental pain over these years starts to come back into focus more clearly.\n\nI'm tempted to walk away from this and take a higher paying job now, even if it sucks more and causes me more stress, and try to jump ship in one quick year... But as I'm sure as it's clear to you, this is the wrong choice. But I can't help this feeling of panic. This feeling the need to rush out the door the second I can. I've been doing it for awhile now.\n\n**Priorities:**\n\nLooking back on my last post, I think one of the most important things I've learned over the past two months trying to accomplish all of these things at once is that it's impossible. Things must be prioritized. And if things at the bottom of that priority list kind of fall off in order to maintain things at the top, then that's okay.\n\nExercise is a weird one, because it's super important and yet it's not something I \"care about\" so to speak. Recently I signed up for a nice gym with helpful instructors and it's a 90 second walk away from my apartment. The problem? $215/mo. It doesn't matter how nice or perfect it is. After reflection, I simply can't afford that. No, a 20 minute run every day will not make me as sexy or strong as working out at a gym will, but at the end of the day I have to ask myself: What's most important?\n\n**Limitations:**\n\nOver the past two months, I'm starting to more clearly see what my limitations are for trying to accomplish multiple things at once. Since my last post:\n\n1. I interviewed around.\n2. Landed and started a new job.\n3. Joined a gym.\n4. Read 3 books (within a 2 week span).\n5. Knocked off a shit-ton of stuff off my to-do list.\n6. Started French class.\n\nYou know what happened though? My daily french practice fell by the wayside. I mean, shit, my French test which is critical to my ability to move over there is in December. There was a lot going on and that's okay, but I think if I was going to point out one major \"negative\" part of these two months, it would be how pushing my personal limitations led to the scrambling of my priorities. And now, one of the most central components to my plan to do what I want to do was left largely abandoned for this time period. Yes, concerted and consistent language study is taxing, but in the end it's got to be done. I let myself get courted by the novelty of studying extra Spanish to talk to my new coworkers, by the idea of spending more time and money at the gym to exercise not just for healthy but for sexiness and strength, with the books I read, I would read them for like, 5 hours a day every day. These are all very good things! But it threw off the balance, it placed themselves higher than my priorities. They weren't net negatives, but they were smaller net positives.\n\n**Career:**\n\nThe night going into 9/20, I couldn't sleep at all. By 4am I was sick of it and just decided to get up. I just started browsing reddit, watching youtube. I ended up watching [\"The Dutch Solution for Safer Sidewalks - Continuous Sidewalks\"](https://www.youtube.com/watch?v=9OfBpQgLXUc) by the Not Just Bikes youtube channel, and it hit me.\n\nHoly shit. What if that's it? What if I'm meant to be a designer/engineer? I was always good at math in school and I have the sort of brain that thinks of all the possibilities, breaks things down into smallest possible units, etc.\n\nThat's obviously all very new, just a day old, and while it hasn't taken the forefront of my mind yet with everything else going on, it could be pretty significant for my life going forward.\n\n&#x200B;\n\n**TLDR:** Got a new job with great benefits, decent pay. Maybe figured out what I will want to do for a future career. Realized that trying to do too many things at once sent my priority list into overload, and some of the most important things ended up being the ones that were most neglected. Struggling with the feeling of urgency to move away in one year, even though the smart play is to leave in two.\n\nI tend to do things in big, sporadic, energetic movements, and the idea of staying in one place and chugging away little by little scares me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/psrqm1/becoming_the_person_i_want_to_be_2_month_update/", "title": "Becoming the person I want to be - 2 Month Update", "social_network": "reddit", "user": "ceilingfanwatchparty", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1632257443, "permalink": "/r/DecidingToBeBetter/comments/psrqm1/becoming_the_person_i_want_to_be_2_month_update/", "nsfw": false, "first_save": 1635435249.2319489, "replies_charged": false}