{"id": "t5_2tand_t3_mftnar", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "Hi Everyone\n\nI have stumbled upon a very trying time in my life and having tried to do online tasks and surveys etc I have not been able to make much progress. The time has come to sell my most valuable possession to just help be able to settle rent and some unexpected expenses this month. I do work full time but since the struggle I have taken on supporting my family of 5 (parents and siblings). I tried to attach images but its blocked out.\n\nLooking to sell my beloved laptop (only had it for 6 months initially purchased it to launch my business but this can wait as survival comes first), samsung S9 and my not so long ago obtained sound bar. Circumstances have changed at home and I need to sell these urgently to assist my family and yes its a direct result of the pandemic (the local pawn shops said they cant afford to pay its value so to rather try sell privately as the laptop and soundbar are still relatively new)\n\n**Laptop Specs:**\n\nAcer Aspire 315 Core i5 10th gen (1035g1) 8G 512SSD still under warranty. It comes with original packaging and slip and all accessories\n\n**Sound Bar Details:**\n\nJBL Bar 2.1 Deep Bass, with all accessories and warranty documents\n\n**Phone:**\n\nSamsung galaxy S9 64gb, slight scratch at corner but still in great condition. No accessories or original box\n\nInternational shipping available.\n\nI am honestly praying for the highest price that you could possibly afford as these are the last items of value that I could sell to make a slight difference in our situation at home.\n\nYou can message me directly or in response to this post. Any tips, guidance and warnings are welcome as well.\n\nThank you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mftnar/last_items_of_value_for_sale_please_consider/", "title": "Last Items of Value for Sale (Please consider supporting especially if you were already in the market for these items)", "social_network": "reddit", "user": "Pali-25", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1617036124, "permalink": "/r/DecidingToBeBetter/comments/mftnar/last_items_of_value_for_sale_please_consider/", "nsfw": false, "first_save": 1635437537.5218186, "replies_charged": false}