{"id": "t5_2tand_t3_nv7r3j", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "e234981c-b061-4d83-8134-70d441847f74", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "I think we all have had the dream to be rich or famous at some point in our lives, but my brother and I have always felt like we had to be rich/famous to prove our worth since we were raised in a toxic and abusive environment. Our parents are both hard workers (lower middle class), but shoved ridiculously high expectations on us to be perfect and present ourselves favorably to others. My dad would make me read business books and “self help” books and encouraged me (through screaming) not to go to college and start my own business. I’m in college, and told myself I would work and grind so hard that I would be rich. I’ve switched my major from conservation biology to a more “realistic” major to make money, and rarely see the people I care about. I believed I would work until I’m rich and provide for my friends, which would justify it. This year was incredibly depressing. I suffer from burnout regularly. Recently I got a job cleaning for the summer between semesters. While I clean, I’ve been listening to philosophy and those ‘I don’t dream of labor’ videos. I made a new email for my YouTube so I wouldn’t get my old recommendations, which were mainly negative. Spending time listening to other perspectives has totally opened my eyes. Now I’m watching alternatives to capitalism, why hustle ‘culture’ is addictive and makes you depressed, and rediscovered my original passion for nature. The veal has been lifted and I can finally see the flaws in my logic. I’m not helping my friends or family by ignoring them today and maybe helping them in the future with money. I’m a slave to consumerism and working tirelessly for things I don’t really care about. I don’t want to waste my life working. I’m going to add value to the world instead of just taking from it. I will work to meet my needs and spend more time on my passions and helping others and the environment in small ways, larger ways in the future.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nv7r3j/dont_want_to_be_rich_and_famous_anymore/", "title": "Don’t want to be rich and famous anymore", "social_network": "reddit", "user": "Previous_Werewolf_67", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 91, "down_vote": 0, "creation": 1623168691, "permalink": "/r/DecidingToBeBetter/comments/nv7r3j/dont_want_to_be_rich_and_famous_anymore/", "nsfw": false, "first_save": 1635436502.2092013, "replies_charged": false}