{"id": "t5_2tand_t3_ofcy6x", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "I (24F) was with my ex (26M) for 7 years. He dumped me because he lost feelings and didn't see a future with me. He said I did nothing wrong, and it was all him. But he would say that there were times he would look at me and even question if he wants to be with me. His friends said he seems happier when he would be out without me there. That they didn't really know me.\n\nLooking back, I feel like I am a narcissist because I feel like I only cared about myself and didn't take his feelings into consideration. I loved with all of my heart and gave him every piece of me and did everything I could to make him happy. I was overly jealous and insecure. He has made comments throughout the years saying that I am controlling and that I only say things to \"get it off my chest and feel better about myself.\" His best friend died in April and he took it hard and was grieving. He wanted space, but I didn't give it to him. I felt bad and I wanted to be there for him so I felt bad giving him space and not helping him during this time. Then we were barely talking, and I felt anxious not knowing were we stood. He said he wasn't sure if he wanted to be in a relationship. So I pushed and pushed and kept messaging him, when can we meet up and talk? \n\nWe met up and talked in May and he dumped me because he lost feelings for me and didn't see a future with me. I wanted to work it but he said no. I feel like I was toxic here because I gave him my phone and told him to delete my album of us on Facebook, gave him back his key, then went in my car and cried and blocked him off of everything.  But then for the next 2 months I begged him back every day, sending long text messages. Only for him to ignore me or say no, \"you are only hurting yourself more just so you know\", \"I already told you how I felt from the get go.\" But he mostly just left me on read. I feel like my contant begging is definitely toxic, I am harassing him, but I miss him and want him back. But I blocked him and stopped reaching out, I am over it. I haven't reached out. I am working on myself and moving on, I don't want to beg anyone to be with me and even if I did continue to message him, it would push him even further away and ruin any chance at getting him back. But I am just trying to move on and talking to other people.\n\nSome reasons I feel like a narcissist and toxic\n\n-he never had any issues with me, it was always me having issues with him and starting arguments. He never complained once it was always me.\n\n-he felt distant for years and I felt like he didn't give me enough affection or love me that much. At the 4 year mark out of our 7 years he said his feelings weren't as strong. So I would ask for constant reassurance if we were good. He said we were fine, no issues, why do I always ask. I feel like I expected too much from him, I put too many high expectations on him and wanted all of his love and affection. At times I feel like I expected the bare minimum, but maybe I just kept wanting more.\n\n-after we would hang out on the weekend and I went home, I would overthink things, then text him paragraphs about things that bothered me. It annoyed him because why couldn't we talk about it in person when we seen eachother.\n\n-when his bestfriend died i noticed he was adding mutal girl friends on social media, they were mostly acquaintances, so I told him \"I trust you 100%, you can do what you want, I am just curious as to why you are adding all of these girls on facebook?\" He thought about breaking up with me then. He is grieving his friend, but I didn't take his feelings into consideration. I cared about reassurance and my feelings and wanted to talk to him about it so I felt better. To calm my overthinking. If I put myself in his shoes, and he asked me that I would be upset too and think he didn't trust me.\n\n-he never gave me a reason not to trust him but I was overly jealous and insecure. I thought I was doing healthy communication telling him how I felt and what made me uncomfortable. But what me uncomfortable wasn't valid. Because I trusted him but I made a big deal and constantly questioned him about insignificant things. I guess I did it for myself to make myself feel better and to know he loves me and wants me. I should have stopped overthinking\n. \n-i should habe never kept stalking his follower count, it isnt healthy and when I would see a new girl he would be following, I would get upset. I wouldn't ask him about it because then I would crazy and knew I was overthinking. I would only question if it made me uncomfortable.\n\n-he said I was controlling at times because after our breakup i begged for us just to do a break instead and only be faithful to eachother. He said we arnt even together anymore and you are trying to control me. I would always ask him about his day, what he was doing, where he was at and who he was with. But I never did it to be controlling, just because I cared about his day and wanted to know about him. I would always respond cool, have fun! (: but maybe I didn't need to ask where he was and who he was with.\n\n-a few years ago his best friend flirted with me and he had a girlfriend. If I was the girlfriend I would want to know. I thought hard about it and decided to tell her the truth. When I told her the truth I told me ex \"I feel good about myself for telling her, I am happy I was able to do it.\" He said I was selfish, I didn't care how telling her this information was going to hurt her feelings and I only told her to make myself feel better. He held this against me for years and that is why he always says that I only say things to make myself feel better. \n\n-i feel like I would always talk about my day, always open up to him, always talk about me me me, I would ask about his day but he was always vague and never went deep into conversation. I always asked him for advice. I feel like I relied on him too much. \n\n-when ever I would talk to him or say I feel like he doesn't show me enough affection, he would say I would always blame him for everything. That I never do anything wrong and it was always blame him for things.. He always put the blame back onto me and I feel like I had to walk around eggshells around him. But MAYBE it was actual him! Maybe he felt like he had to walk around eggshells around me because I was always starting stuff! Ugh \n\nI feel like I genuinely lost a good relationship and a great guy due to my behaviors. When we first broke up I blamed him and went off on him. But now I habe been apologizing to him, telling him the break up wasn't his fault. It was all of mine. I listed all of my faults and what I did wrong and that I am working on it and I will wait for him as long as I have too. I wanted a second chance but I have left him alone and blocked him. Trying to move on but I know it is done and even if we did get back together it wouldn't be the same.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ofcy6x/am_i_toxicnarcissist_i_feel_like_i_lost_a/", "title": "Am I toxic/narcissist? I feel like I lost a genuinely good relationship and lost a good guy. How do I deal with the self blame? I want to be better rather than constantly beating myself up about.", "social_network": "reddit", "user": "attackattack47", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1625637466, "permalink": "/r/DecidingToBeBetter/comments/ofcy6x/am_i_toxicnarcissist_i_feel_like_i_lost_a/", "nsfw": false, "first_save": 1635435798.191293, "replies_charged": false}