{"id": "t5_2tand_t3_hxi2jf", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "I think all of my life I am scared of wasting time. I always want to maximize fun and minimize shit. Working is boring and sucks so instead just focus on fun things. However this also means I cant study well and I get bad grades because I dont put in the time. I hate \"putting in the time\" i feel like i am wasting my life. But i think in order for me to fix this i need to be able to not give a shit about time. It's interesting because I feel like no matter what job I will do my life will suck ass. No matter how much money I make i will not be happy. I just want to play video games and sleep and eat. How funny, I think even that would get boring eventually. \n\nI kinda fucked up some classes a little bit, I'm taking online classes and they are a bit messed up since I didnt turn some assignments in on time. I dont want to come home from work and then do something I hate. I want to do something fun. It's ironic tho that everything fun takes time. \n\nI guess \"opportunity cost\" is a good example. I lose being able to play video games when I do homework. I lose being able to hang with friends. I lose being happy. It's funny because I think I'm not happy after doing these things, only when I am In the middle of doing them.\n\nI am always looking to be entertained. \"Fun things\" expand to suck up all of my time. If I could I would just have fun all day. But I have to grow up sometime. I wonder what adults really look forward to in life, is it sex? Probably I mean unless you are in a relationship it's kinda time consuming right? Like go on a date etc, or you could go somewhere like a bar and then find someone a bit quicker. \n\nI dunno I guess I'm just kind curious about the world lol, I feel like I havent changed much in like 6 years. Man I'm bored.\n\n I think ironically enough as someone who used to be someone who was able to delay gratification, and now cannot delay gratification at all because I deleted my gratification for so long I never got it. I do things that ade heavily time inefficient, I read things or play games that have a long time to beat. It's weird sometimes I like playing games but alot of the time I just like beating them and knowing everything.\n\nWhat do I want in life? I want to not be bored, I want an easy stress free life where I can play game and stuff and have fun with people. I do have some relationships with people but I do feel like I kinda hang out with people I dont like certain parts of but I guess thats everyone. \n\nHmmm I want an easy job that pays alot of money (enough to not have to work a bunch) so I can play games, however also I think video games dont give me as much joy as I say they do, they give me some joy tho.\n\nI guess what I am saying is I am deciding to start not thinking.  A lot of the time I worry about things and worry if I am right and question myself. Sometimes this prevents me from doing mistakes.\n\nHowever I believe it is better to make mistakes and not learn from them, then it is to learn from your mistakes but be paralyzed by them. I will just do things and see what happens. I will not worry about the end goal as much. I will think less. Ignorance is bliss after all, especially since if people are ignorant to an extent they can believe anything, so if I can make it ignorant, I can believe whatever I need to, in order to make myself happy. \n\nHappiness is a state of mind not bases on external factors so I will try to be more happy by just being happy and self righeous. Intelligence is not super important,  but confidence and luck is. \n\nSo I guess all this is saying is I believe in myself lol, kinda annoying that I have to make a proof in order for my mind to accept it but whatever. I will believe in myself even if it doesnt make sense or isnt right. Believing in ones self is how one becomes happy. Love thyself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hxi2jf/time_is_not_as_important_as_it_seems/", "title": "Time is not as important as it seems", "social_network": "reddit", "user": "ThrowAwayNoMotivate", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1595658202, "permalink": "/r/DecidingToBeBetter/comments/hxi2jf/time_is_not_as_important_as_it_seems/", "nsfw": false, "first_save": 1635435635.680335, "replies_charged": false}