{"id": "t5_2tand_t3_qa9mld", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "I started my 20’s just getting kicked out of my house for throwing a big party and dropping out of college after ending my freshmen year with a 1.8 gpa. I found some friends who agreed to move in with me and for two years I was just enjoying life. Eventually though I began to feel aimless and like I wasn’t going anywhere and decided to go back to school. I took a couple of classes a semester (it was all I could afford) but still wasn’t taking things seriously. I finally got my wake up call in organic chemistry though, both due to the difficulty and an amazing professor who helped me see my own potential. He helped me get my life back on track and I owe a large portion of my current success to him!\n\nAfter 9 years of undergraduate studies, clawing my way back from a 2.3 sophomore gpa to a 3.49 graduating gpa, 2 MCATs, 4 application cycles, countless rejections and people telling me I’d probably better start looking for a new dream, I officially can say I have been accepted to a medical school and will begin in July of 2022! It’s been my dream since I was 5 so I’m more excited than I can put into words. \n\nNever give up guys and gals, you’re only one “yes” away from beginning your success!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qa9mld/started_my_20s_with_a_18_gpa_and_homeless_ended/", "title": "Started my 20’s with a 1.8 gpa and homeless, ended my 20’s (turned 30 at the beginning of the month) finding out I’m going to be a doctor and in a 7 year long amazing relationship.", "social_network": "reddit", "user": "SaiyanStrong117", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2595, "down_vote": 0, "creation": 1634510919, "permalink": "/r/DecidingToBeBetter/comments/qa9mld/started_my_20s_with_a_18_gpa_and_homeless_ended/", "nsfw": false, "first_save": 1635436112.4534621, "replies_charged": false}