{"id": "t5_2tand_t3_3fhabc", "request": ["da3e72ac-2059-4c8f-99c6-52edffdec3d2"], "text": "I have two questions which are probably related - How do I become a more interesting person and find something to have pride in?\n\nTo give a little background, I'm 32 years old.  I don't have much in the way of interests aside from computers and the outdoors.  The problem is that I find myself turning to escapism not so much to hide, but to find some interest.  For example, I recently got back into an MMORPG that I had left for some time just to have something to do when I came home from work.  I quickly remembered why I left when I reached a level where there isn't much to do in the game.  On the weekends, I find myself sleeping - a lot.  I can sleep 20 hours out of the day or more.  I wake up, think about getting up or doing any of the things I should be doing, but decide to go back to sleep because in dreams I'm doing something interesting or being around people who like me more than those in real life.\n\nI have a girlfriend, but frankly she brings out the worst in me at times.  I try to talk to her, but she's usually bored with whatever I have to say.  Thing is, I'm in a weird situation where she's basically all I've got.  We get along well when we're in some novel situation like out on a trip or something, but we barely tolerate each other when we're just hanging around.  We go out to dinner, and she barely listens to what's going on in my life.  It's not my imagination either, I can tell her something over dinner, then tell her again later, and she acts as if it's a surprise.\n\nMy job is OK, but that's all I would call it.  I work in IT, a network administrator for local government.  It's an honest living, and I make a decent middle-classish salary at it.  Again, though, it's dull as a doorknob most of the time.  Even I can't stand a lot of people's IT war stories.  Nor is it really anything to be proud of - to most people, I'm just a computer guy.  Even the advancement possibilities are frankly pretty dull sounding - IT manager or exec.\n\nI found myself in a meeting a while back with some of the police IT guys, and I have to admit, I was a little envious.  While they weren't as techie as my team or as knowledgeable, they had the badges and the guns.  Even if they spent their days behind desks and monitors, they were cops.  Love it or hate it, our society has a certain respect for those guys.\n\nI've considered changing careers, but it feels too late for that.  For one thing, I couldn't imagine having to start over.  Not only would I have to go back to some sort of school, but I'd be back at square one.  I'd have to do unpaid internships and starting salaries almost half what I'm making now.  None of that really works when I'm supposed to be a responsible adult making some sort of living for myself and starting a family.\n\nThe other suggestion I hear often is to find a hobby.  I'm not really sure where to go with this.  I don't have any real passions in life.  I used to be a lot more interested in computers and technology, but having made it my career for the past 15 years or so, I'm rather burned out on it in all but the professional sense.  My other interest, the outdoors, is limited.  I get to go out hiking every couple of weeks, but that's about it.  On top of that, I've hiked most of the trails near home so many times that it begins to feel repetitive.  I'd be up for more challenging hikes or even climbing mountains, but my girlfriend isn't up to it.  I'd be a bad person to just leave her behind, and somehow it just wouldn't be as fun doing it alone.  \n\nStill, the idea of reaching the summit of a mountain, and achieving something to be proud of is an appealing thought, especially in a life that feels as ordinary and dull as this.  Every now and again I'll buy something to try and satiate this feeling, but possessions are hollow.  I get a momentary feeling of pride in an object and in showing it off, but it dulls quickly too.  Instead, there's that idea that I should be investing in myself instead somehow, but I'm not really sure how.  Training and certification would be one angle, but I find it difficult to make myself focus and watch training videos, and the certifications themselves feel empty.  I get a piece of paper from some vendor that says that I passed some test; none of them feel like important milestones.\n\nI'm sorry if this post sounds a bit \"first-world problems\", and that there are people who would want my job or my situation.  I'm tired of just surviving and doing only what is necessary to keep going.  I feel like there should be something more to life.\n\nTL;DR What can a 32 year old do to find interest in his life, be more interesting to others, and to feel some sense of accomplishment or pride?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/3fhabc/how_to_handle_a_lack_of_interest_in_life/", "title": "How to handle a lack of interest in life?", "social_network": "reddit", "user": "tehorangecat", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1438490032, "permalink": "/r/DecidingToBeBetter/comments/3fhabc/how_to_handle_a_lack_of_interest_in_life/", "nsfw": false, "first_save": 1635438094.476024, "replies_charged": false}