{"id": "t5_2tand_t3_l5yn1a", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "Pls help, if you can comment I would greatly appreciate some insight \n\nI really wish I would've look back at myself sooner, but I have a deep sense of fear that I am a narcissist, probably covert. I’m freaking out and I need some advice or someone else’s pov. \n\n\\*\\*\\*Sorry this is going to be long\\*\\*\\*\n\nI've always had friends, but only ever a few close friends and as time goes on it seems like most of those friendships have become dormant, and any new ones have dwindled away or ended very badly.\n\nI did experience trauma from a young age, I was bullied, I had a narc. stepdad from ages 9-14 and within that time I had my father pass away, my family unit changed and moved, and just emotional abuse from my stepfather occurred as well. Then suddenly my mother was single and I was thrown into a completely hands off way of parenting.\n\nI have been treated for anxiety/depression. I've brought up to counselors that I may have NPD before, but it's been dismissed, even though I think I haven't revealed enough of myself for it to be diagnosed.  I will restart therapy in a few weeks.\n\nI've always been very afraid of confrontation, I am extremely sensitive &amp; have been described as a sore loser. I have very low self esteem, yet find myself to have a superiority complex- whether it's thinking back to times when I've acted superior, or was I act or think like that now. I was always going for leadership roles in HS, and often times gained them, but now feel as though I would do it just for a leadership position/looks and maybe I never really put in the work I thought I did. I just wanted to look good/hard-working. As I look back, it's almost as though I've thought I was an underdog or that I was entitled to all this. I sometimes exaggerate, and am not afraid to make myself out to be more humble, hardworking, and earnest than I really am.\n\nI am realizing this now as I examine my current relationship with my boyfriend. I recently moved to a new state with some family, and when I arrived here I downloaded Tinder as a way to meet people, and also for the thrill of online dating (validation...). I swiped on my current boyfriend 5 months ago and we have consistently been talking since, and dating since Nov. I always feel like my emotions are out of control. I throw small fits, ignore his needs, I have criticized him before in a rather passive aggressive manner, and sometimes it feels like I'm controlling him/am genuinely selfish and never think about him.\n\nThis isn't the first time I've had a relationship (not just romantic) play out like this. My roommates my first year of college and I had a very poor ending to our friendships. Mostly because I was wanting to leave a friend group and told one member about what was going on, instead of just addressing everyone or finding a way to make myself fade from the group. She ended up telling the others what I said and I received very harsh and severe backlash. One was telling me about how I am selfish, drama-seeking, careless, and only care about myself. Another, after I apologized for not being more straightforward n explaining why I was wanting to end the friendship, told me I didn't really know what I was apologizing for, said I was childish (as many narcs are), and they also made comments such as, \"because that's below you\"  when I explained how I was going to return someone's items. And, from the person I originally confided in, that I was often the one in the wrong during past issues, but always needed to be consoled. And to this day, I often check up on their socials, wanting to feel that I was the victim and that I am doing so much better than they are, when I know the reality is that- even though I wanted to leave, I still was probably the toxic person, and they are doing better without me and wouldn't even think to contact me again.\n\nEven in HS I had a very unhealthy first relationship, I realized this a couple years later when a friend mentioned I really only wanted a boyfriend, not the guy I was with. I have often felt regretful for how I treated him.\n\nPeople always tell me how sweet I am, compliment me for kindness, etc. But, it feels like it's because I'm so good at hiding who I really am behind a kind, humble facade. I feel like I never really let people get to know me, and if I do, I always end of being toxic, overly emotional, and a total hurricane. Or I get close to people, but make sure to keep those behaviors away. I've been told I'm a people pleaser at times, but then once things are truly ending in fire with someone, they reveal to me that I actually am the one who's narcissistic.\n\nI am so concerned about this. Realizing how much of a villain I truly am, and how this current relationship is already set upon a rough path due to my possible abuse. I've hurt many people, and the reason I have most likely lost my close friendships is my lack of consideration for people and tendency to be self absorbed. I've always felt a bit alone, and that's likely the reason.\n\nI have childish tendencies, am hard headed, seemingly like to be in control if someone is close enough (like my current bf), always am irritated at someone but never say a thing, and I truly believe I am most likely a covert narcissistic - I think of myself to always be the least recognized, but most hardworking, am always jealous of people, flaunt things like an award I won in HS or that I can speak another language, and am such a fake person, idk who I am, I have basically no hobbies, and am almost scared to have to rely completely on myself so I search for ways I can rely on someone else for things in the future. I always throw pity parties and through pouting and crying the other person always does something about it, even if most of the time I can't help the tears, I feel like I do this on purpose, but unknowingly so-- if that makes sense. \n\nIt's scary to come to terms with it, but I think it's the truth and I just never wanted to admit it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l5yn1a/19f_help_am_i_now_just_realizing_that_im_a/", "title": "19F Help, am I now just realizing that I'm a narcissist?", "social_network": "reddit", "user": "t_dsam_m", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1611730648, "permalink": "/r/DecidingToBeBetter/comments/l5yn1a/19f_help_am_i_now_just_realizing_that_im_a/", "nsfw": false, "first_save": 1635437563.3133008, "replies_charged": false}