{"id": "t5_2tand_t3_ilwt2a", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "86d5962a-1e68-4adb-a875-32e3eedd428d", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "Hello :)\n\nI'm just looking for a bit of advice on how I can improve my self confidence. I'm sorry if I ramble, but **I'll have a tl;dr at the bottom**\n\nI (17 year old girl) want to learn to respect myself. I'm not someone who would normally talk about their feelings very often, and I don't like to be vulnerable, but I'm willing to admit that I have to start respecting myself.  I'm sure a lot of people can relate to this and I need to remind myself that I'm not a hopeless case.\n\nHere's my problem: my opinion on myself is (very) critical and I tend to look at myself as...\"lesser\" than others. It's as if everyone around me is so important and so real, but I'm just a mistake. I feel like I'm not worthy to be living in the same world as they are. When I think of other people, I think about how they all have free-will, they all have the ability to go so far in life. Wow, they're so smart. They're so witty. They're doing everything right. When I think of myself, I think of how every move I make is a mistake. The things I do in this world don't matter. I'm just as human as anyone else is, but for some reason, I have a hard time believing that I am just as valuable as they are. I know that sounds crazy. \n\nI don't have a lot of self-motivation or drive to do anything, really. I've always wondered why I constantly procrastinated and always made up excuses for not doing work. Recently I realized that it could be because I just don't see the point in doing work if it doesn't make me happy. I think if I started to see the good in myself and see that I am worthy of great things, I could find a reason to work. I'm in high school; I'm about to graduate this year and I'm worried about college right now. I think if I'm able to respect myself and justify the work that I do, I would be able to motivate myself to work hard and have a bright future. I want to find a hobby that I enjoy. I thought maybe that would help me respect myself. Finding something that makes me feel like I'm really doing something to make people happy or even just make myself happy.\n\nI am healthy, but that's just because I'm young. I don't have a great diet. I don't worry about my weight, I'm not underweight or overweight, I'm right where I need to be. I take care of myself, but not as much as I'd like to. I don't exercise. I want to exercise, but every time I consider it, I just think, \"what's the point?\" I don't have a lot of motivation to do anything, like I said earlier. My hygiene isn't an issue, I take care of myself in that, uh, regard. But being a teenage girl, of course, is really difficult to be confident when there are so many beautiful girls in the world. I've never really worried about my looks, I'm okay with the way I am, it's not a struggle for me. But.. I do think that if I *liked* the way I looked, I might be able to be more satisfied with myself. I'm talking about maybe improving my skincare routine or figuring out how to tame my curly hair. I don't have a lot of acne, but my face just gets a little bit red and I'd like for that to go away. I know it wouldn't be too difficult.\n\nEvery time I try to pamper myself, I think about how I don't deserve to look pretty or feel good about myself. It seems like reaching satisfaction with the way I look or feel is impossible for me because I'd just mess it all up.\n\nI don't have any excitement in my life. I do the same thing every day. I take care of my mom. I stay at home all day. I rarely go outside. I don't really go out (especially in these times of course) and I don't have a lot of friends. It's not that I have a hard time making friends- it's just that when I do make a friend, I constantly worry about whether or not they like me, or if they're just doing me a favor by hanging out with me. It's hard for me to get close to people because of that.\n\nFor the last few years I've really, really improved my attitude towards life and I'm really happy with the progress I've made! I used to be a very negative and pessimistic person, but now I'm able to look on the bright side of any situation. That's my proudest achievement, I think. I'm proud to call myself an optimist. Since I've made that progress, I know that I'm able to change myself. I know that it's possible for me to get to the place that I want to see myself at emotionally. I know that I can respect myself. I know I can do it. But there's a little doubt in my mind that eats away at me and tells me that I can't do it.\n\nI think I need a little bit of a push first.\n\nI know I rambled...a lot. I'm sorry.\n\n**TL;DR: I have a hard time with the way I see myself and the way I criticize myself. I always see other people as more valuable than I am. I want to be able to respect myself.**\n\nSo, I was wondering if you guys had any advice on how I can get started with learning to respect myself? Maybe I could change up my daily routine? Maybe I could be more active? I need to find a way to have a different (more positive) perspective on myself. \n\nI just want to find a place to start, you know.\n\nThank you so much for you guys' help :)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ilwt2a/i_need_advice_on_how_to_respect_myself/", "title": "I need advice on how to respect myself", "social_network": "reddit", "user": "fignewtonfigmented", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1599150600, "permalink": "/r/DecidingToBeBetter/comments/ilwt2a/i_need_advice_on_how_to_respect_myself/", "nsfw": false, "first_save": 1635436518.2958, "replies_charged": false}