{"id": "t5_2tand_t3_az1smc", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "# Disclaimer: I copied this straight from Guide to Purposeful Success, I am not intending to steal from the original source of content - just trying to give back to this subreddit as you guys have helped me a lot\n\nWe're going to set ***Really*** Smart Goals – goals that not only provide a target for us to strive towards but goals structured in a way that empower us to achieve.\n\n**Step 1: Ensure Our Goals Are Aligned**\n\nBefore we set Really Smart Goals and give it the structure needed, we first have to ensure the goals we’re aiming to achieve are:\n\n· Aligned with what we truly value,\n\n· In harmony with our core principles,\n\n· Facilitate the fulfillment of our fundamental needs, and\n\n· Contribute to the “successes” that truly matter to us.\n\n**Step 2: Set SMART Goals**\n\nOnce we’ve understood the purpose behind each of our goals and made sure they are aligned with and contribute to our long term mission, we can begin to structure them using the SMART Framework. Simply put, the SMART Framework consists of the following five components:\n\n· **Specific:** What specifically would we like to achieve?\n\n· **Measurable:** How do we measure success and what metrics do we use?\n\n· **Achievable:** Are our goals achievable?\n\n· **Relevant:** Are our goals aligned with the key components highlighted in Step 1?\n\n· **Time-Bound:** What will be our timeframe and when will we aim to achieve our goals by?\n\nOne mistake I used to make was to try to fit all the answers to these five questions into one sentence for each goal. With this approach, there’s a higher risk of unintentionally dropping off some of the criteria, which defeats the purpose of using the SMART Framework. It’s much more effective to create a table where we can fill in individual responses for each of the five components. I’ve decided to build and organize my SMART goals in excel and it looks something like this:\n\n**Step 3: Break Down Our Goals**\n\nTo prevent biting off more than we can chew, it’s best to break down our yearly goals so we can make incremental progress throughout the year. We have the choice of breaking our yearly goals into quarterly, monthly, weekly and daily goals. Personally, I’ve decided to break down my 2019 goals into monthly and weekly targets complemented by daily actions with the aim of building these daily actions into habits ultimately. With this decision, I created three additional tabs in my excel worksheet:\n\n**“2019 Goals”** captures all my goals for the year.\n\n**“Jan Goals”** captures all the goals I’ll develop additional strategies for – with these strategies then being transformed into monthly goals for me to advance towards. For example, goal 37 in the example above is a goal I need to further break down, and there are multiple ways to break down this particular goal. One way is to calculate the returns I need per month to achieve the yearly goal of 25% p.a. return. This turns out to be 1.877% per month on a compounding basis, which translates to turning $20,000 into $20,375 in Jan. Another way to break down this yearly goal is to categorize our portfolio into different investment types and set a target return for each category. For simplicity sake, let’s assume there’s no brokerage cost and we choose to only invest in ETFs and small caps. We’ll allocate $15,000 to ETFs and $5,000 to small caps, leaving us with a multitude of target return choices for each of the two investment types. How we allocate our capital will depend on factors such as our risk tolerance; but in this case of a 75%-25% split, we can aim for 16.67% p.a. return for ETFs and 50% p.a. return for small caps or 6.67% p.a. return for ETFs and 80% p.a. return for small caps and so on. Once we’ve decided on our categorical targets, we can then design daily actions to help us achieve our monthly goals.\n\n**“Daily Goals”** captures all the goals that will be actioned on a daily basis. For example, goals 27 and 29 in the example above will be copied into the Daily Goals tab. Once I’ve copied all my daily goals into this tab, I’ll create a daily/weekly checklist. This checklist will look something like this:\n\n**“Auto Goals”** captures all the goals I’ve already built a habit around – such as eating more than two fruits a day, listening to podcasts on the way to and from work and so on. With these habits already developed, there’s no need for us to create a checklist to tick off as we can just simply let these habits occur automatically. However, these goals originated from Daily Goals first and were transferred to this tab only when I’ve developed them into habits after continuously actioning them on a consistent basis. With these Auto Goals, we’ll be able to action them automatically, allowing us to have more time and brain capacity to achieve more. Habits are truly powerful tools capable of transforming one’s life – we have a collection of posts on why we form habits, how habits work, how to break bad habits and how habits can help you create the life you want to live. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/az1smc/how_to_set_really_really_smart_goals/", "title": "HOW TO SET REALLY REALLY SMART GOALS", "social_network": "reddit", "user": "TheRealCharlieMunger", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1552123961, "permalink": "/r/DecidingToBeBetter/comments/az1smc/how_to_set_really_really_smart_goals/", "nsfw": false, "first_save": 1635437141.2038202, "replies_charged": false}