{"id": "t5_2tand_t3_m48qb4", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "Flow state: feeling *in the zone,* being fully immersed in a feeling of energized focus, full involvement, and enjoyment in the process of an activity. The complete absorption in what one does. The creator of the concept, Mihály Csíkszentmihályi, has even called it “the secret to happiness” - Check out his great [TED talk](https://www.youtube.com/watch?v=fXIeFJCqsPs) about the subject! \n\nBut! There's another popular self-improvement concept, called mindfulness, that I’m sure a lot of you are aware about. In its most basic form, it is the practice of purposely bringing one's attention in the present moment without judgment.\n\nMindfulness and flow are both beneficial states of mind, but are they difficult to experience simultaneously? After all, flow involves losing self-awareness within an activity, and mindfulness involves maintaining self-awareness throughout or even despite an activity.\n\nThat is the question I decided to look into.\n\nThankfully, researchers have done, well, research on this exact topic. A 2014 paper titled \"[*The Experiential Incompatibility of Mindfulness and Flow Absorption*](https://scottbarrykaufman.com/wp-content/uploads/2015/02/Social-Psychological-and-Personality-Science-2014-Sheldon-1948550614555028.pdf)\" did indeed find evidence that\n\n>boosting a person’s ability to remain mindful during an activity might actually undermine their ability to get absorbed in that activity.\n\nThat being said, they also proposed that\n\n>engaging regularly in mindfulness practice might ultimately increase flow ability, by helping to ‘‘sweep out the mental cobwebs’’ that prevent people from entering flow states, and/or by teaching people to concentrate in single-minded ways that contribute to flow states.\n\nThe aforementioned study was, however, quite theoretical in design. Lots of research has looked into the question using more practical analysis. For those who aren’t familiar with the methodologies, here’s a simplified explanation of the main two, *intervention* and *correlation*.\n\n**Correlation**: researchers survey, or in some way measure, participants level of flow, and level of mindfulness. Then they look into the data, and analyze whether the people high in mindfulness happen to be higher in measures of flow.\n\n**Intervention**: researchers measure levels of flow at baseline. Then they introduce an intervention, like a weekly meditation practice. After a set amount of time, they measure flow again, and see whether it increased, decreased, or stayed the same.\n\nSo, here’s a summary of the research I looked into:\n\n|**Participants**|**Method**|**Result**|\n|:-|:-|:-|\n|**307 Athletes:** German|**Correlation**|Examination of the bivariate correlations revealed positive correlations between mindfulness and flow (r = .27, p < .01) [\\[12\\]](https://ir.lib.uth.gr/xmlui/bitstream/handle/11615/44037/11945.pdf?sequence=1)|\n|**21 Baseball players:** Taiwanese|**Intervention:** 4-week program.|After the workshop and follow-up 1 month later, there was improvements in flow state (P=0.001; P=0.045) [\\[11\\]](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6307497/)|\n|**12 Athletes:**|**Intervention:** 8-week program.|Greater increases in mindfulness from baseline to posttest were associated with greater increases in flow [\\[10\\]](https://journals.humankinetics.com/view/journals/jcsp/10/2/article-p99.xml)|\n|**13 Athletes:** University students|**Intervention:**|Significant increase in flow after mindfulness intervention [\\[9\\]](https://journals.humankinetics.com/view/journals/tsp/25/2/article-p177.xml)|\n|**92 Elite athletes:**|**Correlation:**|Mindfulness correlated with flow [\\[8\\]](https://journals.humankinetics.com/view/journals/jcsp/8/2/article-p119.xml)|\n|**32 Athletes:** 11 archers,21 golfers|**Intervention:** 4-week program.|Levels of state flow attained by the athletes also increased between the first and final sessions [\\[7\\]](https://journals.humankinetics.com/view/journals/jcsp/3/4/article-p334.xml)|\n|**47 Cyclists:**|**Intervention:** 8-week program.|Changes in mindfulness experienced by the intervention participants were positively associated with changes in flow [\\[6\\]](https://iaap-journals.onlinelibrary.wiley.com/doi/abs/10.1111/aphw.12063)|\n|**182 Athletes:** University students|**Correlation**: Cluster analysis|The high mindfulness cluster scored significantly higher in measures of flow [\\[5\\]](https://www.sciencedirect.com/science/article/abs/pii/S1469029207000702)|\n|**57 Elite soccer players:** Portuguese males|**Intervention**: 8-week program, including 9 sessions lasting 90 to 120 minutes each session|Mindfulness and psychological flexibility were positively related to flow [\\[4\\]](https://dialnet.unirioja.es/descarga/articulo/7361749.pdf)|\n|**13 Soccer players:** Female|**Intervention**: 4-week program. Asked to do three 10-minute meditation sessions per week, though there was low compliance.|Repeated measure analysis of variance indicated no statistical significance between experimental groups or time points [\\[3\\]](https://etd.ohiolink.edu/apexprod/rws_etd/send_file/send?accession=miami1406716606&disposition=inline)|\n|**63 Musicians:** University  students|**Intervention**: Two separate 20-minute individual practice sessions that occurred over two (consecutive or nonconsecutive) days.|Results from a repeated measure analysis of variance found non-significant changes in flow [\\[2\\]](https://scholarsbank.uoregon.edu/xmlui/bitstream/handle/1794/24195/LaveryThompson_oregon_0171N_12305.pdf?sequence=1&isAllowed=y)|\n|**294 athletes**: Recreational and competitive|**Correlation**|Examination of the bivariate correlations revealed positive correlations between mindfulness and flow (r = .27, p < .01) [\\[1\\]](https://ir.lib.uth.gr/xmlui/bitstream/handle/11615/44037/11945.pdf?sequence=1)|\n|**Elite athletes:**|**Correlation**|Together, mindfulness and self-compassion explained 27% of the variance in athlete’s experience of flow [\\[0\\]](https://search.proquest.com/openview/607b06ab515ea6c110690d0ea64104b8/1?pq-origsite=gscholar&cbl=30153)|\n\n**TL;DR: 11 out of 13 studies show a positive relationship between mindfulness and flow. The other 2 show no effect.**\n\nI guess you can add this to the list of benefits from keeping a mindfulness practice!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m48qb4/mindfulness_vs_flow_opposing_selfimprovement/", "title": "Mindfulness vs Flow: Opposing Self-Improvement Concepts? - SCIENCE REVIEW.", "social_network": "reddit", "user": "FakeyGram", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1615650121, "permalink": "/r/DecidingToBeBetter/comments/m48qb4/mindfulness_vs_flow_opposing_selfimprovement/", "nsfw": false, "first_save": 1635435468.1350274, "replies_charged": false}