{"id": "t5_2tand_t3_jh8m75", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "Stop lying to me and saying you’re okay.  Stop pretending it’s normal to have topics you can never discuss with anyone.  Stop refusing to feel things because the pain is too much.\n\nI’ve seen this movie before, I was in it. For decades I stoically told people my dad died when I was 7 as if the scars weren’t there. The movies where dads died that made me cry uncontrollably? That didn’t convince me I needed therapy. The stupid “Walk a little straighter Daddy” song that instantly made me break down no matter where I was? I still denied I needed help. Even when I got therapy for a break up at 27 I confidently told the therapist we didn’t need to talk about my childhood because I had it “all figured out.” I was just there for dating issues anyway. I didn’t fool my therapist, and you’re not fooling me.\n\nI am not being critical. This is not holier-than-thou bullshit. But I finally made it onto the raft and I am trying to give you a life vest. It hurts people that care about you to watch you struggling to keep your head above water.\n\nI realize you don’t think things are that bad. You’re so used to the armor you put around your heart, the band-aids and painkillers. All your coping mechanisms feel normal. But they’re not. \n\n* Are there triggers that bring up unbearable emotions unless you avoid them?\n* Are there certain topics you absolutely refuse to discuss even with close friends?\n* Is there pain you locked in a box so long ago you couldn’t even talk about it out loud if you were alone?\n\nListen to me. This avoidance bullshit is killing both of us. Imagine the person you cared the most about was withering away with a disease that had a cure. Imagine they were in pain every day and they gritted their teeth and told you they were fine. And the cure wasn’t easy but it was out there and they refused to seek it out. Could you watch them suffer? Could you look them in the eye as they shivered and let them lie to you that they felt fine? You don’t have to do this alone, and you’re not a burden to others just because you ask for help.\n\nI care about you. I want the best for you. I’m not saying you’re broken, and I’m not saying there’s anything wrong with you. I know what it feels like. You’re so accustomed to your crutches and avoidance habits that you forget some people can look at their trauma and they have more choices than A) feeling nothing or B) breaking down uncontrollably. That’s a sign you have baggage to unpack.\n\nFor the last time: I love you and I have lived in your hell and I could not get out of it alone. You’re not a failure for admitting you are in pain. You’re not broken if you ask for help. You’re not worthless because you can’t do it on your own.\n\nTherapy is beneficial for most of the hard things in life, not just the big stuff. My life got better when I went to a specialist who was trained to solve problems like mine. Someone who had helped hundreds of other people with nearly identical things. Sure, some therapists suck. Some car mechanics suck too. But are you going to keep sitting in that broken-down car for the rest of your life or try a few mechanics until you find the right one? You’re too important to me to let you limp around on those crutches for the rest of your life.\n\nPlease stop telling me you’re fine. Your pain is on the inside, but you’re not the only one it is hurting.\n\n\\-------\n\nThat painful event you hide from? Write a letter to the main person involved, be they living or dead. This letter stays with you. That way you can be completely honest and raw. It can’t undo the past, but there’s feelings inside you that need to get out. There’s things you need to say. I’ve found it incredibly therapeutic to write to my dad and it was also a helpful stepping stone to get where I could articulate my feelings and make more progress on my recovery.\n\n**Further Reading**: Going to therapy can be a bitch, and it’s not cheap. Do you think you could try The Inner Child Workbook by Cathryn Taylor? It’s full of exercises and you can do it self-paced to help you unpack a lot of painful baggage in private before putting it in front of a stranger. I still think seeing a specialist is incredibly important, mind you, but this is an incredibly good first step. That book gave me a chance to heal. You’re not alone. Do you want to feel better?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jh8m75/stop_telling_yourself_you_dont_need_therapy/", "title": "Stop telling yourself you don't need therapy", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1747, "down_vote": 0, "creation": 1603544846, "permalink": "/r/DecidingToBeBetter/comments/jh8m75/stop_telling_yourself_you_dont_need_therapy/", "nsfw": false, "first_save": 1635435444.3920584, "replies_charged": false}