{"id": "t5_2tand_t3_mjr8zy", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "Long story short, I’m a 20 year old socially anxious shut-in NEET who’s been neglecting every aspect of his life for years.\n\nI came to the conclusion that overthinking is the source of all my problems. I also fall prey to perfectionism, analysis paralysis, Information overload and FOMO.\n\nThe problem is that these counterproductive thinking patterns prevent me from attempting to overcome them. It’s Catch-22. There are countless resources on overcoming perfectionism and overthinking, which is overwhelming, so avoid it entirely. \n\nI can’t move forward in life because there is too many options in how I can move forward. For example, I neglect my health because I feel lost in the sea of information on diet, exercise and my ailments. And I haven’t even begun tackling a big financial decision I should have made months ago. \n\nI question everything. I can’t be certain of anything. I’m paralyzed and I feel like I’m losing my mind. I ponder pointless questions like “Is there objective truth?” or “How can I be sure of anything?“ or “Why do anything?”.\n\nMy problem is not that I’m unable to push myself to do things, but that I’m unable to convince myself that an action is correct. I even discard personal experience e.g. I know that good sleep and going on walks make me feel a lot better, but it’s not enough for my brain to be convinced that I shall focus on building these habits. \n\nAfter my only close friend, who could motivate me to act in spite of my indecisiveness, had left me, I just gave up on attempting to better myself. Even since then, I couldn’t convince myself to do anything other taking care of hygiene. \n\nHow do I find the basis, the justification for doing anything? How do I become convinced, certain of something? It seems like I cannot prevent doubt from originating and I cannot force myself to believe something. \n\nI saw two therapists so far, but they were of little help. Please, internet strangers, give me some pointers.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mjr8zy/overthinking_is_ruining_my_life/", "title": "Overthinking is ruining my life", "social_network": "reddit", "user": "overthinkoverthink", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 65, "down_vote": 0, "creation": 1617519915, "permalink": "/r/DecidingToBeBetter/comments/mjr8zy/overthinking_is_ruining_my_life/", "nsfw": false, "first_save": 1635437511.4260032, "replies_charged": false}