{"id": "t5_2tand_t3_om4eco", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "c5413f89-ceff-4d4e-ab55-742c6af6ff43", "a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707", "67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "Sacrifice.\n\n> An act of giving up something valued for the sake of something else regarded as more important or worthy – Random dictionary app on mac 🙃\n\n\nWe value comfort, right? We don’t want to lead a life of consistent pressure, stress, and pain, in short – suffering. We don’t want to suffer; we want to flourish. How can you convince someone who has found some measure of comfort to leave it? \n\n\nYet, this is the very thing we seem to ask of people to attain success. Leave the comfort of your home and go to the gym. Wake up earlier so you have time to work on your side project. Talk to random people to build more confidence in your conversational skills. Ad infinitum. Sooner or later, we want peace. \n\n\nWe are in a weird limbo. We desire comfort so our lives are not in constant chaos; yet we must sacrifice to keep progressing, lest we stagnate. \n\n\nWe must sacrifice to even have the possibility of going beyond where we are now. \n\n\nUltimately, what we are sacrificing is comfort. Comfort in the present to do something you don’t want to do. The degree with which you are willing to be uncomfortable has positive effects when it’s directed towards the attainment of one’s goals. You may naturally and easily be confident. Or you may be so scared to present you shake, and it may be more comfortable to not present. Boil it down to fight or flight if you want. However, you can never start that journey of being confident while presenting if you are not willing to leave your comfort zone. It may actually have the adverse effect; you might get more terrified in the future. \n\n\nI believe it possible to mentally strengthen yourself to be able to take charge even when every cell in your body wants you to pull back. However, that’s not possible if you are not willing to make the sacrifice. \n\n\nSacrifice this present moment where you are comfortable to force your will on the world (or at least on yourself) and act towards a goal you have set for yourself. It will never happen if you don’t.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/om4eco/you_will_stagnate_and_fail_if_you_are_not_willing/", "title": "You will stagnate and fail if you are not willing to make a sacrifice", "social_network": "reddit", "user": "MelkaThePhilosopher", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 786, "down_vote": 0, "creation": 1626529043, "permalink": "/r/DecidingToBeBetter/comments/om4eco/you_will_stagnate_and_fail_if_you_are_not_willing/", "nsfw": false, "first_save": 1635435067.2428176, "replies_charged": false}