{"id": "t5_2tand_t3_bzdv0j", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I've been struggling with this for a while, I'm now realizing, and it's severely impacting my mental health. If you decide to read, thanks a lot, sincerely. This may be a bit rambly, but I *need* to get all this off my chest somewhere. It has been weighing on me. \n\nWithout disclosing my age, I'm rather young. That 12 years we have to mitigate climate change -- my life won't even be halfway over by then. Not to mention some other grim projections I've seen that do not make the future seem like a desirable setting to live, if you see what I'm getting at. \n\nThroughout my life I have already struggled with depression, contemplating plenty over the years whether it is worth living. Just when I'm coming around to life, it seems, my optimism and will to live is fleeting because of all this dreadful news and pessimism towards the future of our planet - of us as a species. It's frustrating - I want to get on with life. Yet, I'm returning to my old vices, hoping that if I mindlessly follow one of these many destructive, meandering paths that my unconscious demise will arrive, releasing me from the stress, worry, and reality of climate change and all that ensues. Not that I really want that to happen. It's just easier than grappling with the guilt I harbor over knowing I could be more environmentally-conscious, in addition to being a better person overall. \n\n**I want to decide to be better in spite of it all, and that's why I'm really hoping this post will be acceptable here.** But I get hung up on some things. . .\n\nThe future really doesn't seem bright to me; deforestation in the amazon under Bolsonaro, other environmentally-ignorant or otherwise opposed leaders enacting financially driven policies and legislation(s), exacerbating the issue that affects us all for personal, (ultimately) trivial gain, declining animal and insect populations. . . ; so on and so forth. Perhaps it's a consequence of the information age. If I wasn't so distracted and disheartened by the abundance of news highlighting the poor state of affairs our planet's in. . . I'd feel a lot better . . . but that would be a case of \"ignorance is bliss,\" right? I already do that enough, and that's partly where my guilt comes from; ignoring climate change so I can attempt to get on with life! \n\n\nI've tried bringing it up with my family, but they're not much help - one person says don't fret, \"you must believe there are more good people in the world than bad, everything will be fine\" while another whispers in my ear \"there's a civil war on the horizon. you better be ready for it - which side you on?\" \n\nI do not want to grow up to die in a war for water; I don't want to toil through my prime years to earn a meager life in a world ravaged by conflict; hell, I barely want to be alive now in my relatively privileged, modern life. But, sometimes I do. Most of the time, it's just that the future doesn't seem working towards. \n\nSo I'm turning to this subreddit. How the ***fuck***, can I get myself to believe the future is not as bleak as it may seem? How can I get on with life, help the effort rather than hurt it? I know there aren't any definite answers as to the prospect of life on Earth, or what will happen, but fuck, man. I need something to keep me going. \n\nI feel like I'm wasting water every time I wash the dishes, or do the laundry. \n\nI hear birds chirping outside my window and think it's only a matter of time before they're gone, then look down at my cup of coffee and wonder how many people had to suffer to produce it, how many insects got killed from the insecticides used to grow the beans, how many resources I consumed to make that cup just to keep my wasteful, worthless ass up(that's the depression talking). \n\nIt's not an uncommon way for me to think, and it needs to change. It's not healthy. I want to be better, but in the face of such a significant issue I am weak. \nWhere do I start? \n\n\n**P.S.** if you read this(and furthermore, if you comment) bless you. It took a lot of energy to write this so I may not respond promptly but to anyone who does comment, I appreciate it so much. Thank you. I feel like this post was very angsty and whiny but fuck it. I needed to express this. **If this post does not belong here please redirect me to the appropriate subreddit(s).** Thank you.\n\nEDIT: I expected this post to flop, I am overwhelmingly thankful for all of your input thus far. Y'all have undoubtedly improved my day. Thank you so, so much. It's appreciated.\n\nEDIT 2: I just got back from a great day out, an uncommon thing for me, and my god, this thread has exploded. I'm too overwhelmed to address the 38 messages in my inbox rn(most I've ever seen at once). God, I am just stunned. Thank you all, I'm so glad this thread got some traction. \n\nI feel this palpable goodness flowing through me right now, my fingertips are trembling as I type. I'll stop them from dancing across the keyboard with this:\n\nthank you, from the bottom of my fucking heart, to those that have responded; and I hope anyone who feels similar to me has found something of worth in this thread. I am certainly, without a shred of doubt, now better off than I was this morning when I felt birdsong was cacophony, simply due to mindset. Reddit is beautiful sometimes.  \n\n<3", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/", "title": "[Help] My overall productivity and mental health has severely declined lately due to all of this depressing environmental news, and the general \"we're fucked\" attitude that seems so prevalent . . . How can I find a way to keep living without feeling like it's all in vain?", "social_network": "reddit", "user": "Frusciante_Fucker", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 722, "down_vote": 0, "creation": 1560266738, "permalink": "/r/DecidingToBeBetter/comments/bzdv0j/help_my_overall_productivity_and_mental_health/", "nsfw": false, "first_save": 1635435627.4850733, "replies_charged": false}