{"id": "t5_2tand_t3_pmq84k", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "So let me set the scene. I was first exposed to pornography at age 7. And from 2011, until 2019, consumed it frequently. In early 2019, I wanted to change my life. I was sick of feeling down all the time and looking at porn regularly. As such, I began to work hard, and successfully managed to stay away from pornography for a year and a half. I began overworking in that period, and by late 2019 was severely burnt out and depressed (as advised by my psychologist), however my discipline was at an all-time high. At the end of said year, I took a break from working for 2 weeks as advised by my psychologist, however after this break I began to see lapses in my discipline. Flash forward to September of 2020 and this lack of discipline became so rampant that in September of that year I relapsed for the first time since January 24th, 2019. Ever since that point, I have been struggling with relapsing every 2 or so weeks since then. \n\nIn April of this year, I met my current girlfriend, whom I love incredibly. I disclosed my struggle to her fairly early on in the relationship, and to my gratefulness she has been nothing but honest, supportive and incredibly caring about the situation. She has disclosed to me, on several occasions, how much it hurts her, and on each I have felt a deep sense of regret for what I do. I have broken many promises I have made to her regarding porn usage, and know what I have done is despicable. \n\nDespite this, I can’t seem to stop myself. I work for long periods in which everything seems to become semi-bleak, and the only thing I want at the end of those periods is some form of sexual satisfaction. Thus, I turn to porn, usually in a binge-like capacity, in which I consume pornographic material for multiple hours at a time. When the thought of watching porn arises, most of the time I am helpless to stop it, even after remembering how much it hurts my girlfriend. \n\nThat brings us to today, where, despite knowing the consequences of my actions, I consumed pornography for eight hours without break. I did not try to stop, nor did I tell my girlfriend what I had done until after I was finished. I have messed up bad, and I don’t know what to do. I’ve tried just so so many techniques and yet still can’t seem to kick this parasite. \n\nI have recently been diagnosed with mild high-functioning autism and years ago was diagnosed with generalised anxiety disorder and obsessive compulsive disorder. I have also been advised by my psychologist that I seem depressed as of late. I have been finding things very difficult to deal with and have been having existential crises. I fit just about all the criteria for compulsive sexual behaviour disorder. I also believe that I have some form of unresolved trauma from that 2019 period of work. I have phone appointments with my psychologist due to COVID, and I do not feel comfortable talking about my pornography with her, because if I do, my family will overhear. I honestly don’t know what to do because I am spiralling out of control and fear my relationship and life will crumble if I keep using pornography. Any help would be greatly appreciated.\n\nThank you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pmq84k/i_need_help_battling_my_porn_compulsion/", "title": "I need help battling my porn compulsion.", "social_network": "reddit", "user": "Pleasant_Pangolin263", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1631442104, "permalink": "/r/DecidingToBeBetter/comments/pmq84k/i_need_help_battling_my_porn_compulsion/", "nsfw": false, "first_save": 1635436004.4312692, "replies_charged": false}