{"id": "t5_2tand_t3_ncbivf", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "I am ecstatic!!! I’ve never been consistent going to the gym ever in my whole life (I’m 23M). I’ve never made any kind of progress. Normally when I go, I just pick a random weight and a random exercise and then just doing and it feels meaningless, and then I stop going for months. It’s a viscous cycle. \n\nBut I have 2 amazing friends who have been pushing me non stop to work out with them. They are always asking me to go with them, even though I know I can’t do the same weights and activities that they can. One of them even takes the time to put together a workout plan FOR ME. I’ve been going been going to the gym with them about 1-2 times a week for the last 2 months. \n\nBut 3 weeks ago it really hit me. I was at the zoo and I stepped on a scale that compares your weight to a hippo, and discovered I was 15lbs heavier!!! I looked in the mirror when I got home, and realized that I’m growing a belly, I’m getting fat!!! \n\nSo ever since then, I’ve taken every opportunity to hit the gym, and yesterday was a break through I never thought I’d have! ACTUAL PROGRESS!!! I’ve never ever been able to bench over 135 my entire life, and I just beat my record by TEN POUNDS!!! My whole body is sore, but I can feel myself building muscle!!! I’m also making a conscious effort to stop drinking sodas, and I set a goal of no soda at all until after July 23rd. \n\nMy next step is to take up walking/jogging. I’m building muscle in the gym, but I also need to shed this fat. I’m going to go on a walk as soon as I’m done making this post, and I’m excited about it!!\n\nPart of me wishes I could have found this motivation without the help of my friends, but the other part of me is just so grateful that I have friends like this who care enough about me to help me be better. Now I just need to harness this motivation and discipline, and continue forward one step at a time. Time for my walk! And if you read this whole thing, thank you <3", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ncbivf/i_just_benched_145_lbs_for_the_first_time/", "title": "I just benched 145 lbs for the first time", "social_network": "reddit", "user": "Koda_Paws", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 26, "down_vote": 0, "creation": 1621006698, "permalink": "/r/DecidingToBeBetter/comments/ncbivf/i_just_benched_145_lbs_for_the_first_time/", "nsfw": false, "first_save": 1635435551.041524, "replies_charged": false}