{"id": "t5_2tand_t3_7m82q8", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Hi,\nThis may seem like a rant but it's just an epiphany that I came across lying in bed last night. For starters, I've always believed myself to be a fairly intelligent individual, at least within my age group (I'm 17). I've always harbored the belief that I'm destined to do something great and all I ever heard from people was how much potential I have to becomes extraordinary which fueled those presumptions. \n\nWell, I'm now beginning to understand just how fucked up my thinking is. I've become tremendously grandiose, my values are shallow and the only way I feel like I'll succeed in life is if I make something special of myself. I'm setting myself up for failure by imposing such high expectations of myself and my perfectionistic standards are constantly not being met. \n\nI've also realized just how horribly self analytical I am. All I ever do is criticize myself and never give myself any credit. I beat myself up for the smallest mistakes to the point where I'm terrified of failing in the slightest bit. \n\nBefore I set out to do anything, I always contemplate the fuck out of it. In my head, I come up with many reasons for as to why I should do it and how it may benefit me. But on the other hand, I start contradicting all of those beliefs which hinders me from accomplishing anything at all resulting in a horrible lack of self discipline. All I do is think, hardly ever act.\n\nI've always had difficulties socializing with my peers and only ever really had a few friends as a result of bullying. Because I always felt inadequate in many social aspects of my childhood, I felt the need to compensate for it by trying to be the smartest one of them all. I guess in some way, it made me very reserved and only amplified my social anxiety. \n\nAnd the thing that really stuck out to me last night is that, I get off of having people call me smart. I absolutely love it. It's all just a huge ego boost for me that temporary relieves me of my constant feelings of inferiority. I feel like my intelligence is the only affirmation of my worth and even that isn't very special considering I hardly doubt I'm anywhere near the top 20th percentile. My self esteem is so low, the only way to undermine it is by feeding the ego, just to free myself of the shame I experience throughout the week. \n\nI feel like I should be grateful for being privileged in that sense but I'm beginning to comprehend just how much of a negative impact it's had on me. I value intelligence over everything else. Nothing is more significant to me than that and it's quite depressing actually. I've chosen the shittiest values I could've and now reaping the consequences of it. It's something that must be changed in my life. I can't keep living the way I have been, I'll never attain a sense of contentment and peace by comparing my intellect to others. There's much more to humanity than just intelligence and it's just something that I need to accept into my heart and mind. \n\nSorry for this long ass post that probably made no sense but I just had to write it down and post it to somewhere. This seemed like a good thread for it. I probably sounded like an egocentric douche the entire time but hopefully some of you guys may relate. Thanks for reading. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/7m82q8/realized_that_intelligence_has_been_obstructing/", "title": "Realized that intelligence has been obstructing asset to me all these years", "social_network": "reddit", "user": "ldamien65", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 25, "down_vote": 0, "creation": 1514299190, "permalink": "/r/DecidingToBeBetter/comments/7m82q8/realized_that_intelligence_has_been_obstructing/", "nsfw": false, "first_save": 1635437864.5017955, "replies_charged": false}