{"id": "t5_2tand_t3_97lk1z", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "So I'd like to start by saying I have a lot of stuff I'm trying to improve in myself, and I'm not trying to \"change\" anyone, but rather help them make changes\n\nSo I'm 20, and I have a 20 year old cousin who my brothers and I have become very close with, especially in the past 2 years. He is funny, fairly smart, and has one of the biggest hearts of anyone I know. But he is also shy, awkward, complacent, and takes ZERO responsibility for ANYTHING. Since graduating high school, he has basically lived in his room at his parents house that he has lived at since he was born, hating his environment, resenting his parents and younger sisters. He doesn't work, he doesn't have a license, doesn't go to school, has some close friends but doesn't talk to girls at all.....He claims he wants all these things, saying he wants to get a part time job, leave home, start working out with me, etc. etc. etc.\n\nOur whole family is trying to help him out, and some of our mutual friends even come to me and say we NEED to get him a new situation. His parents, WHOM I LOVE, are completely enabling him, and even hindering his progress, and everyone realizes this except them. And he resents them for it, but also blames them for everything!!! \n\nLike this summer has become a battle even trying to get him a replacement social security card!!!!! He is just SO lazy, and SO afraid of making any progress, and I can't seem to help him.\n\nWe all think it'd be great if he came to school, at least part time with me this semester and lived with me and my friends, and maybe worked part time. He seems to like this idea, yet without being motivated won't lift a finger to make it happen. He is living in a swamp of Cognitive Dissonance!\n\nAs a psychology student, I honestly like trying to help figure all this out, but as his cousin and friend, I'm terrified what will happen when all his friends go back to school and he spends another year in this situation\n\nWhat can we do to help him???\n\n(Also, probably going to post in multiple subreddits)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/97lk1z/how_do_you_help_a_friend_get_motivated_in_their/", "title": "How do you help a friend get motivated in their life, and stop making excuses?? NEED HELP", "social_network": "reddit", "user": "UserNameTaken1998", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1534363624, "permalink": "/r/DecidingToBeBetter/comments/97lk1z/how_do_you_help_a_friend_get_motivated_in_their/", "nsfw": false, "first_save": 1635436094.7120264, "replies_charged": false}