{"id": "t5_2tand_t3_l3zk9c", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "I feel like I'm always struggling to open up. I haven't had any physical contact with my school friends for 3+ years (moved countries) so my social life has taken a big hit. Whenever I go out I feel like I can't smile openly or talk because my ugly smile will pop out or I'll say something stupid. I can't be at ease and take thinks lightly, I'm insecure and I fear of being judged for no reason \n\n\n\nI also can't keep a conversation going irl. Like beyond the hi hello part idk what to say. How do I become more fluid around people and friends and not be so stiff and think less? My sibling on the other hand is the complete opposite who can start a conversation with anyone off the streets and be on their likable list.\n\n\n\nHow do I stop overthinking and just..go with the flow? This insecurity of mine made me push myself to avoid social interactions and think that I'm better at home alone. I don't want to be like this. I don't want to turn into an extroverted social butterfly but I certainly don't want to be an insecure antisocial lifeless person. I just want to be normal around people...There's someone I know (borderline friend) who's calling me over at their place, should I go? If I go how should I progress? How to be more casual and outgoing?\n\n\n\nEdit: forgot to mention that I was a horrible person who judged everyone for quite some time. I judged people for not being on my imaginary tier and thought I was superior and some other bullshit. I also pushed many away and didn't initiate conversations, they were the ones initiating so things just died off. How do I fix this? I know now that I used to be horrible but I feel like this judgy side of mine pops up sometimes because I'm afraid of being judged myself and am insecure so I use this bullshit to make myself feel better", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l3zk9c/how_do_i_become_more_comfortable_around_people/", "title": "How do I become more comfortable around people and be more fluid?", "social_network": "reddit", "user": "a2cthrowawayint", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1611495368, "permalink": "/r/DecidingToBeBetter/comments/l3zk9c/how_do_i_become_more_comfortable_around_people/", "nsfw": false, "first_save": 1635435959.3361661, "replies_charged": false}