{"id": "t5_2tand_t3_owkdca", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "Hey everyone,\n\nI am 27 years old and I am working on improving my life. I started college in 2016 when I was 21 to try to get my life together. Due to a multitude of factors I am only just now graduating with my bachelor's degree later this month. I am hoping to get a my first \"real\" job soon and start saving up a down payment to purchase my first home in 2022. I have also started working out to try to put on some weight and I plan to start doing martial arts in September.\n\nMy issue is that I have been facing feelings of regret and hopelessness for the past couple months. Even though I am finally graduating I still feel depressed because I feel like I wasted my 20s. I focused too much on school and work and never went out and did anything. I've never had a girlfriend and I have been too ashamed of living with my parents to try dating for the past 6 years. I am afraid I won't be able to get a job that pays well enough for me to afford a home and I am sick of waiting to start my life. The housing market in my state has been going insane and I am afraid of being priced out of the market. Just hearing about the housing market makes me feel hopeless.\n\nI feel like I am so close to getting everything I want but at the same time it feels so far away. I have been struggling with feeling tired and unmotivated and have been half-assing my school work. I have managed to delay gratification for nearly 6 years but now waiting even a week to graduate from school feels like torture. The thought of waiting 6 months to save up a down payment feels like forever and I almost can't handle it.\n\nDoes anyone have any advice on how I can stay motivated? How can I get my patience back? How do I focus on the future and stop feeling so much regret?\n\nThanks for reading my long ass post. Any advice is appreciated.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/owkdca/fumbling_in_the_end_zone/", "title": "Fumbling in the End Zone", "social_network": "reddit", "user": "Wakameboy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1627928174, "permalink": "/r/DecidingToBeBetter/comments/owkdca/fumbling_in_the_end_zone/", "nsfw": false, "first_save": 1635438039.2851877, "replies_charged": false}