{"id": "t5_2tand_t3_inp35t", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36", "4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "About a month and a half ago I was diagnosed with atypical depression. \n\nMy symptoms were: sleeping 12-13 hours a night, eating constantly, heavy laden limbs (felt like I was tied to a bunch of sandbags), anhedonia (nothing brings me pleasure, joy, or satisfaction), sensitivity to rejection and criticism, anxiety all day but especially in social circumstances, irritability, etc.\n\n\nSince that time, I've made a little progress. \n\n**(the tl;dr of this)**  I'm now sober, I started taking anti-depressants, reading, doing workbooks, journalling, brushing my teeth twice a day, writing a book I had stopped working on, finishing and submitting a magazine article, working out, playing guitar, and meditating.     \n\n\nAll of this stuff doesn't feel like much thanks to the anhedonia. Even writing it out, I don't feel like I really accomplished or that it's really worth sharing. That, I've come to learn, just comes with the territory. I could write a library full of best-sellers and have a giant golden statue dedicated in my honor and it would feel about the same as laying in bed not doing a thing. But... *I did things*. I DID accomplish changes. Even though I don't feel much different, even with the meds, I look at that list and know \"I wasn't doing that stuff before, and now I am.\" That's something I'm trying to learn to be proud of. It's still a struggle every day, but at least now some healthy things are happening.\n\n\n**If you want more details, the rest is the stuff that's been helping me**\n\n\n\nI have some **workbooks** I'd love to recommend to others:\n\n-Cognitive Behavioral Therapy Workbook for Depression\n\n-Cognitive Behavioral Therapy Workbook for Anxiety\n\n-Mind-Body Workbook for PTSD (I've been through some trauma, and this helped even though I don't have PTSD)\n\n-Dialectical Behavioral Therapy Skills Workbook (emotional regulation)\n\n-Anger Management Workbook (for my irritability)\n\n\nI also started reading some **books:**\n\n-Super You by Emily V Gordon (for raising self-esteem)\n\n-Healing the Shame that Binds You (shame/guilt)\n\n-Chasing Perfection (being too hard on myself)\n\n-The Imposter Cure (feeling like I don't deserve good things)\n\n-Codependent No More (As I had been using romantic relationships to alleviate my symptoms, and then ending them when they stopped working)\n\n-De-escalate by Doug Noll (great book on how to cease arguing with others)\n\n\nAside from just reading, I've also decided to make some **key changes** in my life: \n\n-I stopped drinking and using substances to alleviate my symptoms. I was never a hardcore addict and didn't have withdrawals or anything, but I did have some addict behaviors like drinking alone, smoking to feel better, etc.\n\n-I started a half and half rule to stop procrastinating: I'll do one lazy activity like watching a youtube video, and then I'll follow it up with an active one like writing or working out. Sometimes I'll do two things at once, like writing while listening to music or working out while watching a video.\n\n-I started journalling a lot. I write my thoughts, emotions, things I find helpful from books and workbooks, and anything I want.\n\n-I learned that people with depression generally find doing creative things helpful, and started writing more, playing guitar, writing poems, and randomly freestyle rapping terribly while alone in my car. \n\n-I started celebrating more to make my accomplishments feel more real. I try to dance a little every day after reading it was an ancient egyptian treatment for depression, and sometimes I'll turn on a video of a fireworks show and grandly announce my accomplishments of the day. Both make me feel goofy, but feeling goofy helps too.\n\n-I broke the cycle of failing relationships and stopped looking for romantic and sexual relationships for the time being. My psychiatrist said that many people with my symptoms recover over time and go on to live normal lives, medication free, but in the meantime I can't imagine any relationship being a good idea. Neither love or sex bring me real joy or satisfaction anymore, and just feel like... well... like being in a room with somebody. Just kind of neutral. \n\nI needed to break my cycle of using love as an anti-depressant and giving up on it when I no longer felt happy. Part of this disorder is it gets worse over time without treatment (and started when I was 13, didn't seek treatment til 31), so at first romantic and sexual relationships were amazing for almost their entire duration. As I got older, sex without romance stopped doing much for me, but love worked great so I stopped having casual sex and became a relationship-hopper. Then, the relationships would bring my happiness for awhile (could be 2 weeks, could be 9 months) before they stopped. The last time I tried to start one was in May, and it was completely neutral all the way through. I hate hurting people too, so this cycle hurts everybody involved (but often them moreso me, which makes me feel guilty and ashamed for trying)\n\n-I've begun trying to experience more things that are new to me. Music I've never heard, movies I've never watched, games I've never played, etc. \n\n-I started taking a multivitamin and try to get some sun every day\n\n-I work out at least one part of my body every day\n\n\n**Questions that have helped me**\n\n-Will this action help me progress?\n\n-Are these thoughts self destructive?\n\n-Is this healthy or unhealthy?\n\n-Am I committed to change in doing this?\n\n-Does this thought sound like a hero said it, or a villain?\n\n-Am I filtering out other possibilities because I'm anxious/depressed?\n\n-When I'm relaxing, am I releasing all my anxiety? Why not? It's the perfect time.\n\n-Can rest also be progress?\n\n-What emotion is blocking me from enjoying this?\n\n-Am I acting as a victim, savior, or villain? (drama triangle)\n\n-How can I be a failure if I keep trying until I succeed?\n\n-How can I be perfect when everyone is fallible?\n\n-Am I catastrophizing? \n\n-Am I taking credit for blame when I didn't have control?\n\n-Am I waiting for inspiration to act? **Act without inspiration**\n\n-What would my inner child want me to do right now?\n\n\nThis is all I've really learned so far, and I've by no means mastered these things, but I wanted to share to help others and because writing these things out also helps me. Thanks for reading! Best of luck to you all.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/inp35t/ive_started_making_progress_with_atypical/", "title": "I've started making progress with atypical depression! It's not much, but it's something. I added some stuff that's been helping me.", "social_network": "reddit", "user": "MettaLettas", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 26, "down_vote": 0, "creation": 1599410070, "permalink": "/r/DecidingToBeBetter/comments/inp35t/ive_started_making_progress_with_atypical/", "nsfw": false, "first_save": 1635437782.247947, "replies_charged": false}