{"id": "t5_2tand_t3_pz1fml", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "c6df14ee-195b-4e9d-8032-7cca73d46fe8"], "text": "I've known for a couple years that I'm psychologically dependant on it to an unhealthy degree. The kick in the ass today that finally made me really give a shit about myself was learning about how particularly detrimental such an addiction can be to someone with ADHD. Just... Google it and you'll see. \n\nI've been smoking regularly since age 15--a whole fucking decade. And important, developmental decade. \n\nI may have given myself mild but permanent brain damage, and that terrifies me more than just about anything. I pride myself on my mind and my creativity! And what the fuck do I have to show for it? What have I done with it besides let it sit and rot in a haze of apathy? When am I going to start using the things that I actually appreciate about myself?\n\nI'm gonna do my best to start the therapy I've needed for years--I have the insurance and I can start at any time. I haven't had the self-care or motivation to do it, and as much as my husband has been supportive of me doing what I need to, I'm a fucking adult and the only person who can actually start helping me, is me.\n\nMaybe without the influence of constantly being stoned or in a post-high fog, I can scrape together enough gumption to start doing all the things I've been putting off--therapy for multiple issues, getting a GP and a checkup (I have not been to a doctor in a decade), getting my rotten wisdom teeth out, starting my transition in earnest... so much to do. Let this be my first step!\n\nFor once in my life, I find it fortunate that I'm not financially independent (I'm a NEET / stay-at-home spouse.) I've sat down and talked to my husband about this and how, even if I change my mind later and ask him, I need him to be strong for me where I'm failing and remind me why I'm quitting. I've \"tried\" to quit before but, deep down I really didn't want to, and I would always end up telling him how bad it is in my head and how much I \"need\" weed to feel better.\n\nThe only thing I could argue I \"need\" weed for are my periods, because no painkiller works for them. I'm fairly certain I have mild endometriosis. Oh, right, gyno appointment, another thing for the list... and another reason to avoid weed, so I can focus on doing something about the illness instead of the symptoms.\n\nAny advice from others who have had a CUD (cannabis use disorder) and quit would be very helpful. Now that I know yesterday's bowl was my last, I'm having serious cravings already, and my willpower... it's trash. I gave my pipes to my MIL so they won't be there to tempt me and so I won't get desperate and scrape the resin out.\n\nGod, how did I let it get like this...", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pz1fml/im_done_abusing_my_brain_and_lungs_im_quitting/", "title": "I'm done abusing my brain (and lungs.) I'm quitting Marijuana. Advice would be nice, please!", "social_network": "reddit", "user": "Lagtim3", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 248, "down_vote": 0, "creation": 1633066206, "permalink": "/r/DecidingToBeBetter/comments/pz1fml/im_done_abusing_my_brain_and_lungs_im_quitting/", "nsfw": false, "first_save": 1635436613.7693553, "replies_charged": false}