{"id": "t5_2tand_t3_j4jnt9", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "How do I not lash out on my mom for my own feelings of sadness of being single\n\nIf you see my post history, you'll notice that I am struggling some days now about being single. I am have been very fortunate to receive kind words from all of you who have taken your time to help me and shed some light onto my situation. I have been feeling anxious, depressed, panicky, and fearful that I am single and may not find love. Everyone around me in moving on in their lives and I feel like I'm the last one left on the shelf. \n\nA lot of people have told me to not focus on the negative, but to set my attention on bettering myself, engaging in everyday happiness, surrounding myself with people who care about me, etc.\n\nHere lies the problem:\n\nI work two jobs but understand that I should go out, even if it means on a walk. I don't like to go alone and so I like to take my mom. She is a single mother who has exclusively devoted her entire life to raising me, taking care of me, working day and night just to support me. It's time that I now return the favour, and although I'll never be able to treat her shower her with everything she deserves, I can try. \n\nWith that, I have made it my intent to always take her out whenever it's nice out. I like to take her for walks at the park, somewhere nice to eat, shopping, etc. Whatever we are able to do, and whatever we can afford to do, we try to do. She is always super excited and as am I. It's a nice way for us to relax our minds. \n\nBUT, she will say something on our walk like \"Wow, the trees are so beautiful, what a lovely walk\" and immediately, I say \"Yeah, well, everyone else is going on walks with their lover and here I am going on walks with an old lady\" Or, whenever we are at a nice place to eat, she will say \"Wow, the food here is so good!\" and I respond with \"Well, no one ever goes out with their mom. They all go out with their friends and lovers\"\n\nI say extremely hurtful things to my mom and I am aware of it. She did nothing to hear those nasty things from me. I love her so much and I want to keep on giving, but I am just miserable in my own life that I can't seem to just enjoy what I have. But at work, I'll tell people how I went for a lovely walk in the park with my mom and how it is important to spend time with your parents because they won't be around forever. I'm very blessed to have this time with her.\n\nI feel crazy because I KNOW and UNDERSTAND just how precious my time is with my mom but then I'll say mean and nasty things to her.\n\nI am upset and sad in my own romantic life and I am projecting it onto her.\n\nWhy????? :(", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/j4jnt9/im_being_a_total_axxhole_to_my_mom_because_of_my/", "title": "I’m being a total axxhole to my mom because of my own feelings of sadness because I am single and desperately wanting a romantic companionship", "social_network": "reddit", "user": "Serendipiaa1", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1601748081, "permalink": "/r/DecidingToBeBetter/comments/j4jnt9/im_being_a_total_axxhole_to_my_mom_because_of_my/", "nsfw": false, "first_save": 1635436638.4256668, "replies_charged": false}