{"id": "t5_2tand_t3_pjdb8f", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "This morning my (21F) partner (23M) moved back to their home state. It happened really suddenly, I found out this Saturday he would be leaving today. They had been waiting for a job offer that never came, so he had to move back home to his parent's. I'm struggling with this loss a lot because we had a really beautiful relationship and I don't feel prepared to handle the emotions I am experiencing. Our relationship would have been one year next week, and I am half expecting him to show up at my door even though I know it's irrational and not going to happen.\n\nI love him very much but we both agreed that long distance relationships wouldn't work for us. We are still in some contact (I asked that he let me know when he's arrived at his hotel tonight so I know he's safe and he asked that I go on a hike and take a picture of the summit for him.) We both love each other, there is no anger in our separation, just pain. Does anyone have healthy coping mechanisms for getting past the rough patches in the very beginning? I'm avoiding drugs, alcohol, and other romantic endeavors. I anticipate that we will stop communicating regularly once he makes it back to his home, I know it's not always healthy to stay in communication with an ex.\n\nThe sudden nature of this breakup feels a little traumatic because we are still so in love. I know that the decision will ultimately be beneficial for him as he starts his career, but I was holding out hope that he would get the local job. \n\nI understand that there is no cut & dry solution for dealing with a breakup, but I'm hoping you guys can give me better advice than Pinterest quotes suggesting men are trash. I love this guy, that isn't going to change. He is a good person who never wronged me, how can I move on?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pjdb8f/advice_on_dealing_with_sudden_breakup/", "title": "Advice on dealing with sudden breakup", "social_network": "reddit", "user": "Early-March-5553", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1630979073, "permalink": "/r/DecidingToBeBetter/comments/pjdb8f/advice_on_dealing_with_sudden_breakup/", "nsfw": false, "first_save": 1635435359.8055668, "replies_charged": false}