{"id": "t5_2tand_t3_lpfqht", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Some months ago, my girlfriend broke up with me, after 7 years together. January was living hell for me. Nothing made sense anymore. My relationship was a pillar in my life, and once it went down, it felt like it took down pretty much everything around me. It hurt, I saw no meaning in life, in work, in anything. I spent my days in pure nothingness. Every day, I thought that I just wanted to die to be released from the pain, and I even did think about killing myself many times.\n\nWith help from my family, friends, therapy and my own tools (healthy ones), I very slowly started to get up. Most days were bad. Then there was a breath of goodness some days. And then some days went back to being bad. But slowly I started to get up...And then I realized that it wasn't bad that some things stopped making sense. That meant I could find new meanings, and go after new things. Sure, the pillar that my relationship was took a lot down with it, and that means I have an opportunity to rebuild the structure in a new way, a way that can bring me more happiness and more meaning. I then realized that there were so many things shackling me that I hadn't even noticed.\n\nAnd so many good things have happened in the past weeks, because I decided to accept the past and live the moment, to truly connect with what was important to me and with what was deep within myself. I feel so free, so light. I've met new people (friendships and romantic interests), I'm discovering new music that makes me feel well, I'm in profound touch with my feelings and thoughts, I'm looking into starting a new career (my current career doesn't fulfill me), I feel eager to care about my style and appearance like I hadn't in a long time. So much goodness has come out of the breakup and I wouldn't deny myself any of these wonderful things, even if it hurt really bad when she broke up with me.\n\nSometimes life gives us the opportunity to become better, to become happier, even though sometimes it doesn't look like it. It's up to us to get whatever is thrown at us and to grow, improve, and become even more human. As tough as it may be, there will be something really worth it in the end. Like Churchill said, \"if you're going through hell, keep going\"\n\nI am really, really proud of myself as a human being. And it is rare for me to be proud of myself like this. It was no little pain I felt, and, still, I not only survived - I thrived in it. I cried today, but in joy. In joy for the blessings that I received, for the opportunity to become a better person, to find new ways and paths that will make me happier and more whole. I cried smiling as I hadn't smiled in months - even before the breakup. It's like the tornado became a light, sweet breeze, that is now gently pushing me towards my destiny.\n\nThis is a reminder for myself in the future - I went through hell and came out of it much stronger - and for those of you who are going through a similar pain - a breakup mainly, but any kind of intense pain too. Don't give up! You will become stronger after all of it, and, although I know it may be hard to believe now, I can assure you this is true!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lpfqht/im_ready_to_say_my_breakup_was_the_best_thing/", "title": "I'm ready to say my breakup was the best thing that could have happened to me", "social_network": "reddit", "user": "lernem", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1212, "down_vote": 0, "creation": 1613970509, "permalink": "/r/DecidingToBeBetter/comments/lpfqht/im_ready_to_say_my_breakup_was_the_best_thing/", "nsfw": false, "first_save": 1635435555.6641278, "replies_charged": false}