{"id": "t5_2tand_t3_q1ba0v", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "Goes like this: “Why can’t I remember so many words when learning languages? Why do I make mistakes?”\n\n\nI’m a language learner trying to master 3 (soon 4- French is in the works) languages. I’m not in this for fun or just to prepare for some 3-day trip, I actually want to be really f****** good  at all 3 languages. I’ve decided to dedicate my life to this labour (sounds cult-like, I know, but I really feel a strong sense of passion for what I’m doing) (that is, I don’t aspire to be the idiots who claim to speak 20 languages but can only utter a few simple words and phrases). And after that, maybe I’ll learn a couple more- Russian perhaps?\n\nIt’s not that I’m terrible at them: for Spanish, I’ve reached a pretty good level- for those who know the CEFR scale, it’s around the C1 level, while for Italian and Portuguese, I do have an intermediate level when it comes to writing and listening and reading comprehension, but I struggle with speaking at times due to lack of vocabulary. \n\nHowever, I feel a little (actually, very) upset  because I learn 20x3 words everyday ( 20 words for each language). I do everything possible. I write (or type) each of them down, with definitions, examples and tags (eg. verb, adjective). However when I try to recall them the next day, I am unable to remember about 80-85% of them. And let’s not even talk about what I’ve learnt the day before or the previous week. \n\nThis is not a question of goals either (I am learning languages for the sole purpose of learning the language- anything else is a result of that).\n\nI’m missing out on so many words that could potentially enrich my vocabulary. It sucks. And mistakes suck even more. \n\nMy routine (so you understand why I feel this way- it’s hard to squeeze in another language this way, isn’t it? ): I go all-out to study and try my very best at all 3 languages. I read multiple newspapers and books from 4-5 different countries EVERYDAY, listen to podcasts in each language, write at least a 200-word essay in 2 languages every week, and try to squeeze in a couple of hours of speaking practise, if time and energy level permits. I’ve essentially transformed my routine into one reminiscent of a military base/camp, no frills with a lot of drills- at least for now.\n\n*I don’t learn languages to stop halfway- that is to say, I’m not willing to learn any language just to learn basic phrases, words and grammar- If I’m learning, I’m learning all the way and for life.\n\n*I’m aware that some of the text here is recycled, bear with me- just not feeling my best rn.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q1ba0v/how_do_i_get_rid_of_the_negativity_cycle_when/", "title": "How do I get rid of the negativity cycle when learning foreign languages?", "social_network": "reddit", "user": "throwaway36019", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1633371210, "permalink": "/r/DecidingToBeBetter/comments/q1ba0v/how_do_i_get_rid_of_the_negativity_cycle_when/", "nsfw": false, "first_save": 1635436799.5999098, "replies_charged": false}