{"id": "t5_2tand_t3_lacg4c", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": " I used to enjoy reading books during my school days which now feels like forever ago. But as I grew up and saw more easy and low effort forms of entertainment, reading began to feel like a chore. It is several time easier to fire up a YouTube video or scroll memes endlessly for cheap entertainment. At the back of my mind I still have a fleeting desire to read books. There is still a bit of romanticism towards the *idea* of reading books but in practice, the list of unread or half-finished books just keeps growing. My attention span has plummeted. I used to be engrossed while watching good TV series and movies but now my monkey brain has taken full control and I can't stop scrolling memes while watching them. Sitting down and watching movies without distractions feels like a project in itself. \n\nA few weeks back I stumbled upon r/digitaldetox and watched a follow-up video by [exurb1a](https://www.youtube.com/user/willunicycleforfood) on [digital hygiene](https://www.youtube.com/watch?v=VpHyLG-sc4g). What I took away from it is that, internet addiction is just like any other form of addiction and need to be dealt with with a firm hand. Internet has made my brain addicted to instant gratification. My brain is seeking an instant dose of Dopamine which most of the content online caters to. Digital Detox aims to starve the brain of that instant dose of Dopamine and make it seek sources of delayed gratification; to switch from pleasure to happiness. And hopefully, with time, the compulsive need to find cheap low effort entertainment will die out. \n\nSo for a month, I will stay off YouTube, Reddit, 9gag and other meme sites. I use other social media sites very sparingly so staying off them will not be a problem. I am already dreading doing this as it will take every ounce of willpower I have and more to pull it off. I'm hoping that it will get easier with time. Additionally, to keep myself losing my sanity, I will be picking up the Dune Trilogy which I have been putting off reading for years. I have asked 2 of my flat mates to hold me accountable and any time I spend more than 5 minutes on the above mentioned platforms, I will have to chug a spoonful of Tabasco hot sauce. \n\nHere's to the Digital Detox. I hope I have the mental strength to pull it off.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lacg4c/i_have_decided_to_start_a_digital_detox/", "title": "I have decided to start a \"Digital Detox\"", "social_network": "reddit", "user": "sattyrox1000", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1612209504, "permalink": "/r/DecidingToBeBetter/comments/lacg4c/i_have_decided_to_start_a_digital_detox/", "nsfw": false, "first_save": 1635437773.4834547, "replies_charged": false}