{"id": "t5_2tand_t3_lxoycp", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "When I say crippling, I mean it. I’ve accomplished nothing with my life literally nothing. I live in fear and I’ve been a lost soul for years.. maybe all my life. I mentally abuse myself and have made myself believe I can’t do anything. But I’m 24 and finally trying to change this. 2 weeks ago I sat there thinking... I only have two options: either I make a change or I’ll end up doing something drastic to myself one day.\n\nI found [unf*ck your brain](https://open.spotify.com/show/3Zq2XDpVrtadTR1xOfzhzo?si=SQZaMrL3RlOo9jUKbHj5GA) by Kara Loewenthail which is overall for women who are lawyers but I think it’s beneficial for everyone really. I’m not a lawyer nor do I want to be. She explicitly says in her introduction she’s “very analytical and I don’t believe in woo talk or vibes, or anything fluffy that you can’t actually apply to your own brain and your own life”.\n\nHer teachings are rooted from cognitive psychology-based techniques. So she’s not going to be all “you are beautiful, you’re so worthy meh” I’ve only listened to 2 so far but I can tell she understands you cant start from A (crippling depression) and get to Z (top of the world, healed) with positive affirmations alone. Positive affirmations are helpful but you have to rewire your brain to believe it just like you believe all the mean things you say to yourself. She takes you through each step (A through Z) to get there.\n\nI appreciate it so far, hopefully this helps someone else who is just tired of their self talk and broken spirit.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lxoycp/unfck_your_brain_podcast_is_actually_helping_my/", "title": "Unf*ck Your Brain podcast is actually helping my ongoing crippling depression", "social_network": "reddit", "user": "myneighbortotohoe", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 16, "down_vote": 0, "creation": 1614876140, "permalink": "/r/DecidingToBeBetter/comments/lxoycp/unfck_your_brain_podcast_is_actually_helping_my/", "nsfw": false, "first_save": 1635435455.2532585, "replies_charged": false}