{"id": "t5_2tand_t3_642ga3", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Hi, guys! \nSee, I am a school student and if I were to broadly categorize my life and aspirations into 2 types, I'd label them as work (school) and personal.\nNow, you see, I detest school. It's not as if I am not good at it, or can't be. I have the intelligence and aptitude for it. What I lack is the interest and good habits (such as working hard). But most importantly, I hate it. Even the thought of school makes me shudder in dreadful agony. It drains me of all positivity and fills me with worry, anxiety and other such emotions regarding my lack of effort, declining result and worry about the future. I'd say it's the student's equivalent of being stuck in a job you hate. Also, I am in India, so I assume you guys can understand just how fucked up the situation of education in this country is. Overpopulation and lack of teachers leads to high, hyperbolically high competition. Just imagine, the lowest marks required for admission in the best government university in the NCR, Delhi is 98.5% for Psychology Bachelors. And millions of students apply for it and only 50-60,000 seats are available. Never mind the ones which are reserved for the undeserving. So, yeah, thought I'd give you a glimpse of the fucked up system of this country.\n\nAnyways, I digress. So you see, my position in my work life drains me of any good thing and fills me with negativity and the impulse to just escape. It robs me such that I am not left with even the thought of being able to freely follow my dreams, the personal life. Now it's not as if my personal goals consist of things that'll just ruin my life or make me complacent. No. If I follow them, they'll not only improve my quality of life but also imbue me with skills and knowledge that'll make me a much better human being. But I believe that the reality is that I am just scared of going after what I want and letting my schooling negatively effect me. I truly believe that I am responsible for my misery and that if there's anyone who can get me out of it is me as well.\n\nNow if I were to keep these 2 aspects of work and personal life as work-personal. Then right now, I am in a lose-lose situation. I am losing in my work life and each day my hate for it and my country's system grows and this loss drains me and makes me stressed. Hence I feel powerless to even begin thinking of my personal life. If I were in a win-lose or a lose-win situation it would still be understandable and much more copable. But I it's not even that so let alone thinking about a win-win situation.\n\nI truly want to change my life. Accept that I am the only one responsible for it and the only one who can change it. But I need some help, some guidance. I am in a really miserable, pitiful, dead from the inside kind of state right now.\nIf I were given the hope and the chance to focus completely on my personal life without any worry of school, I'd gladly do it. I can make a career out of my personal goals. I am interested in languages and can pursue a career as a linguist, or public speaking. \nGod, I need some assurance. However, I believe that assurance never really comes for anyone wishing to change their life. That they are all scared in the beginning and it's all about taking that leap of faith.\nDeep down I believe I am just really scared.\n\nThank you for reading and responding,\n\nPranav", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/642ga3/feels_like_i_am_stuck_in_a_loselose_situation/", "title": "Feels like I am stuck in a lose-lose situation", "social_network": "reddit", "user": "Pranav1999", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1491592179, "permalink": "/r/DecidingToBeBetter/comments/642ga3/feels_like_i_am_stuck_in_a_loselose_situation/", "nsfw": false, "first_save": 1635436095.4179924, "replies_charged": false}