{"id": "t5_2tand_t3_kr6eh5", "request": ["1a213df6-3f71-466c-9762-ace119e0102e"], "text": "We are all carrying around daily baggage; stressors, anxieties, money payments, tasks that need to be accomplished, goals, our love life etc etc. With all these constant feelings of worry and pain, its easy to lose track and forget what the meaning of life is, **gratitude of the present moment, to be alive in itself.**\n\nWe are constantly consuming social media, news, articles, movies, tv shows; having those \"fomo\" *Fear Of Missing Out*, feelings, that remember, we allow ourselves to feel. We all think that we all have to be aware of everything new that is happening, the latest album, the latest netflix show, the latest person that went viral, the latest artist, the latest clothing release, the latest new thing that we MUST have, but do we ever stop and ask ourselves why? Why have we been conditioned to feel this way? Why have we allowed ourselves to be conditioned this way? Why have we never taken a step back and realized that life is still happening, even if we have no idea of the \"new\" it thing?\n\nUp until a few years ago, I had always been a subject to this. Always wanting to be \"apart of the crowd\", not missing out because I thought that I'd be looked at as \"weird\" \"a loser\" \"strange\" \"out of it\" etc etc. Until I realized, when we are **ALL** focusing on not missing out on \"the new thing\", what is really happening is that we are missing out on ourselves. Missing out on our life right now. Missing out on the **present moment.** Missing out on waking up and saying wow, **I am alive**, I was allowed to start a new day, which ultimately is more important than any \"trend\", any \"new thing\" etc. \n\nNow realizing that we have been conditioned to forget the true **meaning of life**, which is **happiness, family, gratitude, empathy, kindness, perspective, joy and presence, we can change that**. It may honestly feel overwhelming or even uncomfortable to start focusing on these aspects of life that make us, **human.** We have to start and we have to start **today.** As we have seen in the last almost year, our world has changed and will consistently change in this coming year. Remember that being aware of whats to come may cause fear for a brief moment, but of course it will, when we have been shown otherwise our whole life. \n\nTake a breath. Take a moment for yourself. Meditate Daily. Pray Daily. When we are connected with God, Jesus, the Universe, the Most High; we are putting all of our faith and life into everything above this planet, rather than other human beings that are just like us, something else that I can get into it, but we will save that for another day.\n\n**Today:** Get fresh air. Get outside. If you haven't meditated before, go to youtube and search \"Meditation for Beginners\". It will make you feel uncomfortable but anything that pushes comfort zones is actually what is meant for us, in this present moment and whats meant for us for our longevity. Pray as well. Ask for Guidance. Ask for Help. I believe in you. With all of us, changing the way we think, act, feel with ourself, that will then lead to us changing together. **Together, Separately.**\n\n**I love you.**\n\nDrey <3", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kr6eh5/happiness_in_life_85/", "title": "Happiness in Life (85)", "social_network": "reddit", "user": "striclyspoken", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1609876936, "permalink": "/r/DecidingToBeBetter/comments/kr6eh5/happiness_in_life_85/", "nsfw": false, "first_save": 1635437074.2519135, "replies_charged": false}