{"id": "t5_2tand_t3_psabnf", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "First I want to say that I hope everyone is doing well ! \nAlso I am a recovering substance abuse addict. That’s where my question fits in. \n\nBasically I’ve recently been exercising daily, I’ve started taking vitamins and have cut sugar ( especially sugary drinks out of my diet ) \nI’ve been working out. So hard to get started, but I can feel results in the last 2 weeks. They aren’t strenuous, but I’m a lot farther then I was as I want to and decided to be better. \n\nI do have psych problems. Anxiety and depression. Also I am tired so much of the day. So my question is in your opinion if I’m taking a medication ( which I am ) completely as directed, would you consider that getting better?\n\nThe medication is called Modafinil. Ive abused it in the past and that is why I feel really guilty taking it and feel like I’m doing the wrong thing every time I take it. \n\nIt helps me stay up 12 hours rather then sleep all day. ( 12 hours is just an example. ) it is prescribed for chronic fatigue / daytime drowsiness. \n\nI abused it in the past to where I stopped using it. \nNow I take it exactly as prescribed and it works for me really well. It is a medication to promote awareness. It’s considered a stimulant, but not like adderall etc ( which I used to abuse as well ) \n\nBy taking the dose as prescribed do you consider it something I shouldn’t take at all because I have abused it. \n\nLiterally have problems keeping my eyes open for more then 60mins during the day. Always tired. \n\nI want to make sure I’m getting better. Maybe you have to be a past addict to know why I feel guilty just taking it. \n\nIt’s all opinion, can I have yours please. Thanks in advance.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/psabnf/is_this_better_pros_and_cons_question/", "title": "Is this better. ( Pros and cons question)", "social_network": "reddit", "user": "Zombiefood40", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1632194259, "permalink": "/r/DecidingToBeBetter/comments/psabnf/is_this_better_pros_and_cons_question/", "nsfw": false, "first_save": 1635435080.3521981, "replies_charged": false}