{"id": "t5_2tand_t3_orodsv", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "I don’t know if anyone experiences this where their mind tends to try to alter the reality they leave in, thus leaving you with a sense of hopelessness  and in a state of isolation. For my while entire life I had many fights between my my inner desires and my mind. My mind often than not tries to muster up some bullshit of a false reality where I perceive people as awful human beings and me being  a part of that equation as well. Not only that but it like to make me seem less awful than everyone else but still awful in my own right. I’m tired of my mind trying to outcast me from the rest and build me against people. I am able to see how each and everyone of us are hurting in own right. Majority of us are just trying to do the best we can with this one life that we are given. Why does my mind refuse to acknowledge that? It consistently tells me to be better and how I need to do better all the time. As with that it pinpoints every single flaw that appears in every person I face as if that’s the only thing that makes a person. No matter how good they are or could be my mind fights me to recognize that. It wants me to submit to viewing people and myself in this light often, majority of the time I really want to give up. It is tiresome. I really want to be the best version of myself that I can see myself being . One thing I want to change is my mindset on how I perceive the world because it’s not as terrible as my mind would like to think. I have found joy in so may areas of my life and have a great circle of friends. My family is not perfect because no family is,we have come so far as unit. We are all working on maintaining a healthy relationship with each other and I’ve seen so much growth.\n\nSo why can’t I accept that shit !? Even with myself, it’s constantly trying to bring me back to my former state of negative thinking and I don’t want to go back there.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/orodsv/damn_you_my_mind/", "title": "Damn you my mind!", "social_network": "reddit", "user": "mickeyme1272", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1627262111, "permalink": "/r/DecidingToBeBetter/comments/orodsv/damn_you_my_mind/", "nsfw": false, "first_save": 1635437303.5125396, "replies_charged": false}