{"id": "t5_2tand_t3_paqwro", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "**THEN.**\n\n I grew up in a very abusive family. My siblings and I were emotionally and physically abused by our mother, aunts, uncles, grandmother(s), father, and cousins for as long as I can remember. When you are raised in that kind of environment it becomes your norm. I didn't even realize how bad my upbringing was and was in denial when I was diagnosed with PTSD (not surprised about the bipolar disorder because it runs in the family). That's also when I started to realize that I had major gaps in my memory. My brothers or sisters would be pouring their hearts out about something horrible that happened when we were kids and I would not remember what they were talking about at first. It was like they had to jog my memory in order for me to remember all these awful things that happened to us. \n\nFast forward to my first long-term relationship; spoiler, it was toxic and abusive. I didn't even recognize it as abuse because it felt so comfortable to be gaslit, verbally abused, torn down, getting his anger taken out on me, etc. He reminded me so much of my mother sometimes and it didn't click for me that it was a red flag. I just wanted to feel love and I thought that was it because most people that I loved treated me that way. But my depression started getting worse and two things clicked for me:\n\n1. I made a half-joke with my ex when he asked me if I was sad. I said, \"I'm always sad.\" He then looked at me and said, \"well that makes me feel some type of way. Why are you always sad if were together? Shouldn't having someone truly love you make you feel less sad?\" He will never know that this was the first time he really opened my eyes. I started asking myself why our relationship only seemed to make my depression worse. \n2. This quote that I read at the beginning of our relationship kept coming up in my mind for no reason. Something along the lines of, \"Be wary of those that feel like home too quickly, especially when home was never a safe place.\" This boy felt like home so quickly. \n\nFinally leaving him made me remember a lot of the abuse I went through for the first time. So I cut him off along with the majority of my family. \n\n**NOW.**\n\nNow that I'm in a better place, I decided that it was time to start dating again. I met this guy and we started off as fwbs, but that was short-lived. He is the exact opposite of my ex, and it felt refreshing at first. Long story short, my brain keeps making up reasons why I should run. It keeps telling me that his kindness feels uncomfortable and misplaced. I was sad one day, and I didn't talk to him (ignored his calls and texts). When I got back to feeling okay (the next day), I apologized to him for abandoning him. To my surprise, he said I didn't have to be sorry about that and that he understands. \n\nHe doesn't see me as an object. He's very kind and gentle with me. He makes me laugh. He has no red flags so far (I'm hyper-vigilant now that I know what kind of abuse I'm susceptible to). He makes me feel good about myself. He randomly tells me how much he appreciates my time and company. He told me that I deserve more out of life. I got too drunk at his apartment one night and woke up in his bed, with my errings on the nightstand in his clothes. He told me I passed out on the couch and he moved me to the bed, made sure I took my earrings off, and got me some clothes because I didn't want to sleep in my clothes. \n\nThis guy seems like he'd be really good for me. I never came up with reasons to leave my ex, and he was awful to me. So I know that I am self-sabotaging at this point. I'm happy to be aware because I was seriously telling myself silly things like, \"he's a happy person, you're going to ruin him\", \"He won't understand you're depression, it's too much\", \"he's too nice, why is he being so nice? I don't know what he wants...\" and \"you won't be able to really open up to him, you might scare him away, do you wanna be in a relationship like that?\"\n\nHow do I stop thinking like this and allow myself to be in a healthy relationship? How do I stop letting my past ruin my future at happiness? How do I get comfortable with being treated like this? Why does it feel so wrong? Lol, lots of questions. Anything helps!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/paqwro/how_do_i_get_comfortable_with_the_kindness_of_a/", "title": "How Do I Get Comfortable With The Kindness of A Romantic Partner and Stop Self-Sabotaging?", "social_network": "reddit", "user": "-individuals", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 20, "down_vote": 0, "creation": 1629822971, "permalink": "/r/DecidingToBeBetter/comments/paqwro/how_do_i_get_comfortable_with_the_kindness_of_a/", "nsfw": false, "first_save": 1635435932.4449558, "replies_charged": false}