{"id": "t5_2tand_t3_igg9do", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "I'm not exactly sure if this question belongs in this subreddit, but I feel as if hearing from people who were very likely in a similar position as me will be most beneficial. For context, I am a sophomore in college who is majoring in Computer Science, and my career as a programmer began Freshman Year second semester. I have completed two courses so far, and am not take data structures and algorithms. I have a few difficulties and need some advice. First, I truly feel that this is my major, and the career I want to embark on, but I'm having trouble truly engaging in my studies. So far the only code I've written has been class assignments, and have never been able to create a program on my own time. I think my lack of engagement comes from seeing, and feeling a lack of growth, even though I have been putting in many hours into my studying, and truly trying to understand concepts. I think I feel like I'm not growing because I dont have my own personal projects, where I am coding, and figuring it out truly on my own. (For assignments I would get help from tutors/ a lot of code would be given, and only modifications were asked).\n\nSo my question to you all is, how did you start to truly engage in your studies, and learn to love what you do. AND what are some solid beginner projects that are challenging, but not impossible?\n\n&#x200B;\n\nP.S originally posted this to r/learnprogramming, but this subreddit seems much more appropriate.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/igg9do/need_advice_from_college_students_programmers/", "title": "Need Advice from college students! (programmers specifically, but anyone can help)", "social_network": "reddit", "user": "WannaBeDev01", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1598375075, "permalink": "/r/DecidingToBeBetter/comments/igg9do/need_advice_from_college_students_programmers/", "nsfw": false, "first_save": 1635435505.227741, "replies_charged": false}