{"id": "t5_2tand_t3_o9wegv", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "I have to say, I never took myself as a person who cares about what other people think of myself.\n\nI've been on therapy some time quite ago, and I've felt so much peace when I started to stop caring about what other people think of me.\n\nIf I'm honest, I always try to be perfect person, responsible, hard worker and maintain the rules, and when I do a mistake, either at job, life, relationships and such, I start to feel so bad, I self hurt myself with negative thoughts telling how incorrect and bad person I am.\n\nAnd you know? I don't care anymore. All the answers are in myself (and all your answers are in yourself!) You don't have to tell why you do this, what are the reasons or even feel sorry if you did something you liked or even if you made a mistake! We are all humans and we all do mistakes. Now, you are trying to be better because you realized you committed a mistake, but don't feel over ashamed of yourself.\n\nPardon yourself and continue living being a better person! Don't let the others try to disrupt your process. Don't let a magazine, your friend, an online website or whatever you saw.\n\nYou are you, and you are in a progress, and if you did mistakes, only you know the answer for it! \n\nSo breathe, relax, learn and be responsible for your mistakes, but never ever feel that only because the society says something is bad, doesn't meet you have to be guilty forever. \n\nI write this while feeling so much peace with my self because I've learnt to be responsible for my mistakes, I accept them, I embrace them, and I try to be better, but never ever let any other person destroy my peace anymore!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o9wegv/i_stopped_caring_about_other_peoples_opinion_and/", "title": "I stopped caring about other people's opinion, and I've never felt better.", "social_network": "reddit", "user": "Mitsu_x3", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 273, "down_vote": 0, "creation": 1624923992, "permalink": "/r/DecidingToBeBetter/comments/o9wegv/i_stopped_caring_about_other_peoples_opinion_and/", "nsfw": false, "first_save": 1635438041.7466605, "replies_charged": false}