{"id": "t5_2tand_t3_nrmgoh", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I was supposed to try a new antidepressant, venlafaxine. But I have bad emetophobia. My doc specifically said that I should not research side effects online, because she knew that I would be scared if I read them. She warned me that venlafaxine has really bad withdrawal symptoms, and I must take it on a full stomach to help nausea.\n\nUnfortunately, having done extensive research on nearly all kinds of antidepressive medications, I already knew the horror stories and the gastrointestinal side effects of the venlafaxine. She prescribed me 150mg. I thought that 150mg was a really high dose to start such a rough antidepressant, so I got myself 37.5mg, my plan was to slowly increase the dose to 150mg.\n\nI’m currently in a bad situation. My depression and anxiety is taking a toll on me. Fortunately the suicidal thoughts subsided.\n\nI’ve given myself a promise a couple weeks ago. I was going to eat less, exercise daily, shower often and brush my teeth. I never skipped exercise, I lost lots of weight, I don’t smell anymore and I brush my teeth twice a day.\n\nI’ve also promised myself to get out of my comfort zone, do the hard and unpleasant things that must be done.\n\nAnd, I guess the first hard thing that needs to be done is to get on effexor. But, I can’t bring myself to it. I’m emetophobic.\n\nGetting nauseous pretty much guarantees a panic attack. I get low blood pressure, light headedness, cold sweats etc, racing thoughts and panic etc.\n\nSo now, I can’t take my medication. Because it’s hard. I promised myself to do the hard things, and I feel like I’ve failed myself. All of the stuff I’ve been doing, they are nice and good for me obviously, but none of them are very difficult. There is no anxiety involved. Well, getting out of the home was a little anxiety inducing at first but it quickly disappeared.\n\nAnd I promised myself that I would face my anxieties. And I can’t. I can’t compromise on that. I have to face my fears, but I just cannot bring myself to start this goddamn fucking drug.\n\nThis is me running into my comfort zone when challenged with something hard and uncomfortable to do. If I can’t even do this, how am I going to keep improving. Why? Why does my brain has to be always so fucked up? Why can’t I bring myself to start this fucking medication? I feel like I have failed again. I have surrendered to this fucking anxiety again. It got the hold of me.\n\nUnless I can beat my anxiety, I won’t be able to get better. Exercise, healthy eating, personal hygiene, none of these things matter. I need to be able to face my fears. And I couldn’t. I have surrendered again.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nrmgoh/it_feels_like_i_have_failed_again/", "title": "It feels like I have failed again.", "social_network": "reddit", "user": "nitratehoarder", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1622750390, "permalink": "/r/DecidingToBeBetter/comments/nrmgoh/it_feels_like_i_have_failed_again/", "nsfw": false, "first_save": 1635436619.2736268, "replies_charged": false}