{"id": "t5_2tand_t3_hfqs3j", "request": ["4cac5c46-c6ee-4ff1-b7d3-66c39b6c4873"], "text": "The #1 obstcle is the thought of \"the trouble of getting better is not worth it.\" What makes you go \"i wanna get better no matter the cost.\" How do you get that resilient positivity?\n\nI'm 22 male. I eat extremely bad junk food for breakfast lunch and dinner. I dont have a sleep schedule. Most of the time dinner is breakfast and lunch is dinner and its always the juiciest junky processed foods like cheeseburgers. Its never real food. Theres also desserts. I drink sweet coffee like water and theres always stuff like cakes and donuts around. \n\nTheres also watching porn 5-10 times a day. Sometimes 3 in a row when you're really really down. Theres lack of hygiene. \n\nI could go on and on about these nasty habits but you get the idea. Im at a point in my life where it takes insane levels of dopamine to keep me alive. Take away my food or whatever, I'll actually stab myself out of anger or something. There were rare occasions of burning myself when no amount of bad habits could give me the satisfaction I needed. The burn helped calm me down mentally.\n\nSo I tried overeating therapy and therapy in general for years and it didn't work. I've been warned about my physical state. I'm obese with risk of diabetes. It runs in the family. I cant run without chest pain. \n\nSo if i can't find the motivation to get better even when im in this much pain and bad shape, how do you guys simply decide to get better and follow through?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hfqs3j/serious_question_what_makes_you_want_to_get_better/", "title": "Serious question. What makes you want to get better?", "social_network": "reddit", "user": "adam1298", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1593107894, "permalink": "/r/DecidingToBeBetter/comments/hfqs3j/serious_question_what_makes_you_want_to_get_better/", "nsfw": false, "first_save": 1635438143.32147, "replies_charged": false}