{"id": "t5_2tand_t3_n3wiw0", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I won't go into crazy detail unless people want.\n\nLost our son, it devastated me. Used that event to spur motivation to change my life, since I wanted to be around for our oldest son. 340lb at 30 years old doesn't lead itself to a long life.\n\nLost the weight, built some muscle, ran a 5k, changed my life.\n\nEDIT:\n\nSince people asked. My son was born April 1st in 2019. His name is Weylin. At birth, he was strong and healthy with no concerns. However, my wife tested positive for Strep Group B, so they had her on antibiotics at the time of delivery.\n\nThree weeks into his life, he wasn't feeding. He would cry softly, and not eat. He eventually started keeping his eyes closed and go limp. \n\nWe rushed him to urgent care, and his BP and temp were low. They did a series of tests and found that he has a bacterial infection in his brain caused by the SGB. Ultimately, it traveled to his brain stem, and we had to decide to take him off life support.\n\nThis devasted me. More than I knew possible. While I never had suicidal thoughts, had it continued, it likely could have gotten there. I remember vividly my wife and I trying to keep a brave face for our oldest (at the time 2). He didn't know where his brother went, but he would see us sad.\n\nMy weight ballooned more than it ever had. I just kept eating. I didn't know whether out of grief or what, but either way, I was constantly binging and just feeling terrible. One night, I had just finished my Toppers medium pizza, my wife's half of her pizza, and 14 chicken wings, and I broke down about how miserable I was.\n\nI decided to make the change and get my life under control. I wouldn't be around much longer if I let things continue as they did. I redownloaded MyFitness Pal, deleted all my history, got my TDEE (total daily energy expenditure - maintenance calories) from tdeecalculator.net and started fresh. Just counting calories and eating 1000 calories less than my maintenance every day.\n\nA year later, I had lost 150lb, I started working on gaining muscle, I ran a 5k, and my life has been 1000% better ever since. I have confidence back and my wife and I just welcomed our third child Fynnigan into our lives.\n\nThank you for all the support <3", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n3wiw0/in_april_of_19_we_lost_our_youngest_son_sent_me/", "title": "In April of '19, we lost our youngest son. Sent me into a spiral of depression and binge eating. That June, I decided to use his death as motivation to change. I lost 150lb and gained self respect. I used to weight 340lb and dropped to 190lb.", "social_network": "reddit", "user": "Artist_X", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3089, "down_vote": 0, "creation": 1620049735, "permalink": "/r/DecidingToBeBetter/comments/n3wiw0/in_april_of_19_we_lost_our_youngest_son_sent_me/", "nsfw": false, "first_save": 1635438242.9590352, "replies_charged": false}