{"id": "t5_2tand_t3_mdi64n", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "I've been a part of this subreddit for a long time, feeling so joyful seeing people supporting each other's journeys. I never post anything, one of the main reasons being that I might not get any validation from people and it would just get lost in a sea of posts. Also, I overanalyze the smallest of things. If I were to post, I wouldn't be satisfied until I went through it multiple times.\n\nWell, its time to fight my demons, starting with posting my first draft without overthinking. Is anyone else faces this problem, I encourage you to make a small post yourself :) If I can do it, so can you. \n\nWithout giving away much, I've transitioned into a very important phase of my life right now which requires multiple hours of study, dedication and hard work. Some of my vices which have sabotaged many opportunities in my life are:\n\n1) I am a serial procrastinator, I don't work on anything until the very last minute which leads to my grades dipping low.\n\n2) I am still figuring out myself and lack self-belief and self-love. Thoughts like I don't deserve anything pop into my mind every other day.\n\n3) My biggest fear is fear of rejection/failure. And sometimes when tasks seem very daunting, like this phase, I get very anxious and postpone work until I'm forced to finish it. In short, I give projects which deserve weeks of effort just a few hours.\n\n4) I'm currently daunted with a lot of tasks and am facing a lot of pressure because of my own fault. I'm always tense, can't get enough sleep, constantly tired and this has made me very cranky, frustrated and a terror to be with. I sometimes act out and become very toxic with my near and dear ones and feel terrible about it.\n\n5) During these past few months, I've stopped exercising and have put on many pounds, I feel very unmotivated and unfit.\n\nFrom this moment, I'm going to work on all of these and strive to be a better worker, increase my grades and be a better human overall. I'm making this post to be accountable to all of you. I'd appreciate any tips to help me combat my issues. Lots of love to all of you and I hope you have the most wonderful day.\n\n(PS: I'm going to keep my post notifications off, allot 30 minutes per day and try my best to reply to all of you kind souls.)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mdi64n/an_attempt_to_take_control_of_my_life_with_my/", "title": "An attempt to take control of my life with my First post!", "social_network": "reddit", "user": "Pecadillos", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1616739245, "permalink": "/r/DecidingToBeBetter/comments/mdi64n/an_attempt_to_take_control_of_my_life_with_my/", "nsfw": false, "first_save": 1635437333.212166, "replies_charged": false}