{"id": "t5_2tand_t3_idxrnv", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "I made a post here the other day about being a recovering heroin addict. And I appreciate all the support in that thread. But one of the sort of \"unwritten rules\" among a lot of recovery groups is to not get involved in any new relationships in your first year. Well, I took this to heart as I did not exactly have a great track record for healthy relationships in the past. I would often get caught in mutually destructive relationships with another alcoholic or someone who was also just trying to use love as a means to prop up their self-worth and so the whole thing would become toxic and unfair.\n\nI would become jealous and insecure and resentful and bitter, then use drugs to push all that down, eventually leading to taking no action to address the problem and ultimately let the relationship crumble. Or I would just get involved in superficial relations just to make me feel wanted and attractive. Rinse and repeat.\n\nI took these problems very seriously and tried to work on my list of character defects throughout my sobriety. I feel like I made great strides. I truly love myself (most of the time) and no longer feel dependent on validation from my preferred gender to have self-esteem. Almost to the point of being too extreme the opposite way, in that I love living my life on my own. But I decided after all this time, I wanted to try and find someone to share some of my happiness with. I have all this love in me that I want to give to other people, which includes a potential girlfriend. I started talking to someone right at the beginning of this month, we FaceTime almost every night, and things have been going well enough that we decided to both get tested for COVID so we can plan to meet in person soon.\n\nNow again, I have never really tried to date in sobriety and that alone is weird for me, as pretty much everyone in their 20s drinks (I have no problem being around drinking but it can be a bit of a weird dynamic sometimes when I am not drinking myself). And now it's even weirder with the pandemic as we are extremely limited in the sorts of activities we could do, having to be extra cautious and all that.\n\nBut the problem from me comes again from these deep seated fears and insecurities and trust issues that cause me so much stress and anxiety that it doesn't even seem worth it anymore. I'm a very sensitive person and I overthink things a lot, but my spiritual practice has also allowed me to be mindful and observant enough that I can see these thoughts and feelings as they arise and fortunately not act on them so as to cause harm to the other person. But what seems to be happening, is that I just internalize things and start to spiral into states of mind I no longer want to live in.\n\nAn example, (and then I'll stop rambling I swear) is that this girl I'm talking to has her own baggage and mental struggles clearly. Just like everyone else. But it puts this fear in me that she is doing exactly what I used to do, just using me for her own self-worth and that if I get too close, she is just going to bounce and I'll be left feeling rejected and foolish. Something that has happened many times in the past. From what she has told me about some past relationships, I question whether she should be getting involved with someone romantically (even though I know it's not really my place to say). We were supposed to meet in person yesterday and after a day of her not communicating that well, she cancels. I get caught in this argument with myself where one side tells me that if I don't trust her intentions and have a bad gut feeling, then I shouldn't date her. But the other side tells me those are just my own fears manifesting and trying to sabotage me. I don't want to act purely on feelings of fear, I would rather act on feeling of love. I don't want to idealize a relationship and hope I meet someone who lives up to some impossible standard for me, but I also don't want to repeat the same behaviors of my past and get into an unhealthy relationship.\n\nIt's insanity. Is this just what dating is? I truly thought I had let go and moved past most of this shit, until I get involved with a woman I actually really like. This fucking sucks. I don't want to hurt anymore people and I don't want to get hurt. It sometimes seems like the best way to do that is to just not get involved with anyone. But dating as the new person I am \"takes practice\" if you will so I can't avoid it forever if I want a meaningful relationship. I've been in this serious funk for the past 24 hours and can't seem to shake. This girl texts me this morning and I don't know what to even do from here.\n\nThank you for reading my whole rant here. If anyone can relate in some way, I appreciate any input. Love all of you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/idxrnv/ive_recently_tried_to_open_myself_up_to_dating/", "title": "I've recently tried to open myself up to dating again after almost two years of being single. And I hate it.", "social_network": "reddit", "user": "DopeyDeathMetal", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 894, "down_vote": 0, "creation": 1598020170, "permalink": "/r/DecidingToBeBetter/comments/idxrnv/ive_recently_tried_to_open_myself_up_to_dating/", "nsfw": false, "first_save": 1635436622.4416075, "replies_charged": false}