{"id": "t5_2tand_t3_ov4hmh", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "\n[Long Post, tldr below]\n\nMy whole life I’ve lived with a judge over my shoulder. I was named after Jesus and felt pressured to be like him since I was 5. Catholic guilt amirite. My upbringing played a part too, parents were young and a bit impatient with me. \n\nIn my mind, every action had to be questioned and every act had to be explained. It was just the way I lived for 21 years. Negative self talk filled my everyday thoughts and it killed my confidence in everything. I tried my best to help people since I feel good doing so but fear always took over. The people I helped could tell, my heart was in the right place but I was so scared to mess up that I created this over-selfless persona. My social anxiety also made it hard to talk to people and fear made me feel inauthentic. My fear was so bad that I couldn’t even put some of my favorite songs in my playlist because I was scared of being judged by other people. Even posting this post is firing fear in my brain.\n\nI coped with everything in the book. PMO, endless self sacrifice, constant self bashing, anything to make me feel better. None of it worked. Hell, the constant PMO and NoFap cycle made my mental state WORSE.\n\nFive days ago something “clicked”. I woke up wanted to start living and that this excess negativity had no place in my life. I though it was random, but I now see that I had been putting in solid work for the last year. Meditation, exercise, therapy, Support Groups, Reaching out for help, even scary stuff like telling my parents about my anxiety/depression. I had been doing so much good but my fear and negative mindset never let me see the progress. \n\nNow I see how far I’ve come.\n\nSpiritual growth has been a big help. I was raised Catholic and grew up thinking I was either all in or all out. Left the church when I got to college. I rejoined a month ago. Now, my SO is bisexual so imagining how the church would treat her killed me. I left the Catholic Church again two weeks ago. I’m now much happier practice stuff from all places. I pray to my Saints and God, I use Buddhist meditation practices, I try to live by my vata dosha, and I love exploring the creation of life via science. I’m spiritually fulfilled and I don’t even know what group to put myself in haha. (Half Catholic?)\n\nThis last week has been a blast. I feel so much happier and better about life. It started with simple positive affirmation and motivational . I started pouring my anxious energy from fidgeting into my work. I stopped tracking PMO/NoFap streaks and now focus on staying sober from MO part. I actually listen to others instead of projecting my insecurities. The people in my life saw a change too. They think I’m more confident and sure of myself (I still have a hard time accepting that). The list goes on, y’all get the idea. There’s plenty of anxiety and fear still running in my head but I have the tools and mindset to face and overcome them now. I finally feel authentic and like a real person!\n\nI want to thank my SO for all her support, my family, my support groups for being real homies, and HealthyGamerGG for their content. I am thankful to have their support in my journey.\n\nThanks for reading all the way through, I had a lot to share! Hope anyone reading this has a great day and that you are successful in your goals!\n\ntldr: homeboy lived with fear, anxiety and negativity. felt like shit. explained how lifestyle/spirituality/positively helped me grow and realize my past progress. now being more authentic and growing steadily 😌 (still got hella anxiety thoooo)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ov4hmh/deciding_to_no_longer_live_under_fear_facing_my/", "title": "Deciding to no longer live under fear, facing my negativity, and accepting my growth!", "social_network": "reddit", "user": "QuesaritoJesus", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1627725531, "permalink": "/r/DecidingToBeBetter/comments/ov4hmh/deciding_to_no_longer_live_under_fear_facing_my/", "nsfw": false, "first_save": 1635436714.5065958, "replies_charged": false}