{"id": "t5_2tand_t3_p1t5cx", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Hey guys, I'm not even sure what to say to describe what situation I'm in now. But I guess in short, I think I'm gradually losing my will, my goals, my vision of getting to the future I once imagined. I'm still an undergraduate but very close to my graduation, but I just cannot find the motivation to study and finish my last 4 subjects anymore. I'm very unhappy that I'm stuck in my home after getting forced to come back from Australia because of Covid. I have no friends here since I just moved to a new city, the friends that I have the most connection are back in Australia since I've been there for 1 & 1/2 year. Everyday has been a repetitive hell to me, I feel numb and suffocating to my surrounding because my house is nothing but never ending family politic and drama working in the shadow.\n\nI feel that as of now, I'm living my life on the pillar of pleasure, addiction(not drugs, mostly games and binging on YouTube) and the privilege of of being a student from a privilege family that supports my financial needs (not that I spend a lot just holed up in my room). I try to read books, review my lectures, going for workout or just doing anything that is beneficial but requires effort, these few things just gets the better of me. I feel that I'm like most of the victim in Saw movies, I did not put effort to endure the pain to get the chance of a new life.\n\nI mainly started to feel lost when I actually fulfill my dream of studying overseas in Australia. It felt unreal to me on the first night when walked around the city. The feeling is so amazing because I always think that I'm an incompetent person and would not be able to fulfill this goal of mine. But this also got me thinking, now that I'm here, now what? Classes in a western country is struggling for me as I'm really used to not think much about what I have been taught. Over time, I just feel really lost  that should I really be here, not being able to handle the study and hanging out with friends wasting my parent's resources. But in a way, I still feel that I'm in a better place there with my mates in our sharing house than flying back to my home because I get the vibe from the others that they are all working hard to pass a subject/reach their goal and it makes me feeling that I should work hard too as we all should be. But coming back, I hate coming back to home, it's always drama and some unfortunate events just happened after I came back. This whole vibe in my home is killing me and the isolation of this pandemic. Idk who can I turn myself to, I'm an awkward person that I don't really have a friend that I can open my heart fully to, it's so hard.\n\nBut I really want to walk out of this. I watched a lot of videos from Jordan Peterson as well, and a lot of this words are really good advice. But idk what to do and most importantly is my unwillingness to do things that I should to progress in life. I don't even know if I can say that I'm having some mental illness or I'm just a lazy person, even I think a lazy person have some better idea of knowing what to do and it needs to be done.\n\nIf you think that I might be a hopeless person, I do not mind. But please, tell this hopeless what can he do to work it out 1 step at a time.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p1t5cx/struggling_to_find_a_meaningful_something_to_live/", "title": "Struggling to find a meaningful something to live for", "social_network": "reddit", "user": "Tangerine_Stock", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 20, "down_vote": 0, "creation": 1628614140, "permalink": "/r/DecidingToBeBetter/comments/p1t5cx/struggling_to_find_a_meaningful_something_to_live/", "nsfw": false, "first_save": 1635435436.9895952, "replies_charged": false}