{"id": "t5_2tand_t3_pzenxl", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "c5413f89-ceff-4d4e-ab55-742c6af6ff43", "c67213dc-0eed-4cac-a781-9bc082742908", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "I'm a 17 year-old male, and I am desatisfied and disappointed with where I am right now. \n\nLately, I have become aware of a certain group of problems that are making life bitter for me, namely my albeit not horrific but still self-destructive habits (internet addiction, masturbation addiction, lack of healthy sleep schedule, sedentarism, lack of propper daily organisation and being antisocial) and, of course, a separate group of worries that revolve around figuring out what I want and where I want to go.\n\nI have started college recently, where I found a group of like-minded people that share my interests. I live in a decently well off family in a very scenic and beautiful region of my country. I have very few problems with my parents and have a good support system. And, according to all my teachers and close family members, I have a huge potential waiting to be directed. \n\nI should be the happiest person on Earth, yet, I feel emotionally numb and I'm not giving myself me-time or decently spent free time at all. I feel like I'm not living like I should, and I believe blocking out this emotion has led to my numbness.\n\nMy issues are solvable, I'm fixable, and I'm more than able to become a good person that lives well. I don't want to keep feeling like this day after day. I had enough. My biggest obstacle is me. All of this nonesense is not doing me any good, and I'll be much happier once I have gotten rid of it. \n\nFrom now on, I shall take action to mold myself into the person I wish to be. It's not like I have some terrible background, a crippling disorder like ADHD or a deeply sitted childhood trauma that needs professional help like some of the poor devils here do. In fact, those people pick themselves up and get on with life. My brain is my only obstacle, and I will not tolerate being in this state anymore. \n\nIt can't be that hard to meditate once a day, to go jogging three days a week and to keep a coherent daily schedule. I want to work, live and love. I don't want to live in my tiny room anymore, with my fragmented attention span and static-filled brain that gets me dizzy. I have grown out of this. It's time I set myself free.\n\nI shall keep you all updated on how my incremental changes take me to a better place one step at a time. It's so easy and comfortable to be lazy, disorganised and hedonistic. Some people even make it their way of life, but all it has brought me is pain, and my body has been ringing the alarms all along.\n\nLET'S BE RESPONSIBLE! \n\nONWARDS!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pzenxl/lets_just_get_on_with_it_already/", "title": "Let's just get on with it already.", "social_network": "reddit", "user": "MuzzleloadingAmateur", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 140, "down_vote": 0, "creation": 1633114760, "permalink": "/r/DecidingToBeBetter/comments/pzenxl/lets_just_get_on_with_it_already/", "nsfw": false, "first_save": 1635435337.4818275, "replies_charged": false}