{"id": "t5_2tand_t3_priczv", "request": ["4b69452a-b1e5-47af-a734-ad3c2bdce185"], "text": "I have so many flaws that the pandemic has made worse. I cram. I have no sense of delay gratification. I'm lazy. I have a bad sleep schedule. Worst of all, I feel intrinsically arrogant about my abilities that I subconsciously feel like I don't need to work on it. I'm all talk with little substance.   \n   \nI had an incredible summer releasing all my pent up energy, partying with friends but I fumbled my internship return offer. Now my college had a bunch of housing problems and I'm back at home this fall. My parents are nice but suffocating and nosy. I'm falling back into my pandemic darkness. I commute over an hour one way and classes feel like shit, as my social life has contracted. With social distancing rules, it's next to impossible to hang out or \"over stay.\" I've stopped going to the gym because the need to schedule is somehow too much for me.         \n         \nWorst of all is I've wasted a month of potential interview prep and interviewing. I'm in tech and it's stupidly competitive and I'm burning my time at home depressed browsing Reddit, procrastinating on homework. All I need to to tough out 2 more months of interview prep and land *something.* I go to sleep every night knowing this with my heart at 100 mph as I squirm in guilt and anxiety.       \n       \nI fucked up but hopefully that changes today. I wasted the morning \"optimizing\" stupid stuff so I won't get distracted. I bought a new desk lamp so I can't pretend its too bright/dark at night to work. I bought a new desk so I can't pretend it's too small and cramped. I bought some multivitamins and coffee shots so I can't drag out some fucked up morning routine for 5 hours. I got a night mask to \"force\" some sleep instead of browsing until 3am.        \n       \nI deleted my games on my PC. I set strict timers on my phone, and deleted dating apps and Reddit.   \n   \nOf course this is all fluff. I really just have to sit down and fucking DO SOMETHING useful. Wish me luck everyone.        \n     \n&nbsp;\n\n\nHere's my current to-do because why not...\n\n- Finish presentation for thesis   \n- Read 2 chapters and finish a long PSET\n- Need to review 3 online lectures, practice problems for test\n- Interview prep (a ton)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/priczv/im_a_senior_in_college_and_i_really_need_to_get/", "title": "I'm a senior in college and I really need to get my shit together to find a job", "social_network": "reddit", "user": "jokerjest", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1632091802, "permalink": "/r/DecidingToBeBetter/comments/priczv/im_a_senior_in_college_and_i_really_need_to_get/", "nsfw": false, "first_save": 1635437442.5004096, "replies_charged": false}