{"id": "t5_2tand_t3_o2z0vh", "request": ["02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "I'm gonna try to make this as short as possible, I'm 21 years old, I'm a very insecure person, I'm insecure about my posture and myself, some days I can't even smile. I also have extreme anxiety plus my health isn't the best as well... I rely on others to give me attention if they don't I get depression, if I have plans with someone I spend all day worrying about it and I kill all my productivity with just waiting around either rewatching a TV show for the 10th time(at least) or watching useless YouTube videos. I'm this close to become depressed. \n\nI have an addiction to fast food, and gaming, I spent a small fortune on fast food and useless stuff I don't use, I signed up for a gym member ship that I cant commit to it, even though I need for my posture its becoming really bad :( and I can never study each time I try to study I end up watching a show or playing a game, I tried moving all my stuff out of my room so I HAVE TO study but I end up thinking about stuff and end up with nightmare thoughts, I have SAT's in 14 days which I barely studied for because I probably have ADHD.\n\nI used to be the most charismatic person, I used to wake up 6 am everyday walk to work and have an organized day, but now I changed to the worst, I sleep at 1 am (that's if I sleep) I wake up 10 am minimum and waste my morning doing nothing, and wait till its night time so I can play \"as a reward for my productivity\".\n\nI'm depressed, too poor to go to therapy, I don't know how to prioritize my life and commit to achieve my goal, you might see me as a loser which I probably am, but I see lots of potential in myself I'm a really nice person, I'm a genius(147 IQ according to a trained psychologist) and I put other people's needs before mine(which is wrong I know, but I can't help myself), it's really a waste if I don't work on myself and become better, especially when I have confidence if I work on something I will achieve it no matter what, but the problem is I focus on the non important stuff like my city project in minecraft or driving 30 mins just to see my crush in her workplace or whatever.\n\nI just want to finally get accepted to college and commit to my life instead of wasting it.\n\nHow can I **START** becoming better?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o2z0vh/i21m_really_want_to_be_better_but_i_always_either/", "title": "I|(21M) REALLY want to be better, but I always either find an excuse or too lazy or I do literally anything but being productive .", "social_network": "reddit", "user": "Hishamy99", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1624046822, "permalink": "/r/DecidingToBeBetter/comments/o2z0vh/i21m_really_want_to_be_better_but_i_always_either/", "nsfw": false, "first_save": 1635436617.7152421, "replies_charged": false}