{"id": "t5_2tand_t3_of1van", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "I'm looking advice in moving past some moderate social anxiety/insecurities. \n\nI've developed a much better relationship with myself by employing a mentality of dating myself when I have free time. Long road trips, solo movies/events (pre-COVID), museums, etc. I've learned to enjoy my own solitude and company and it's been swell. \n\nHowever, there's some other stuff I want to do that is super decidedly coupley and I've been keeping myself from certain activities that I'll have to tackle solo. My friends are either coupled up and I don't want to third wheel them or flaky. \n\nHow can I get past this feeling 'weird/creepy/sad' and just go out and do some cool shit that might be coupley by myself? There's a prominent fear of being judged or 'coming across' as sad / lonely / creepy that is very specific that I am having a very hard time getting past. \n\nLet me make this make sense: I'm talking about activities like night time glow in the dark kayak riding (they sell solo or tandem tickets), or a guided forest walking tour through a specific scenic area. \n\nThese are examples of certain experiences I want to experience - whether alone or with a partner - but the noise in my head and my worries about appearing creepy or weird/being judged by the other 'couples' is very strong and prominent. I know there's a version of me that will not give a fuck about what people think and can do these things and have a swell time and learn something by myself and not bother anyone; but there's something blocking me from being that person.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/of1van/sucking_it_up_and_dating_myself/", "title": "Sucking it up and dating myself.", "social_network": "reddit", "user": "nunyabidness425", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 80, "down_vote": 0, "creation": 1625598840, "permalink": "/r/DecidingToBeBetter/comments/of1van/sucking_it_up_and_dating_myself/", "nsfw": false, "first_save": 1635436797.335512, "replies_charged": false}