{"id": "t5_2tand_t3_ax7xqg", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "Hi,\n\nI have a question regarding an issue that has so far felt insurmountable. \n\n Although I don't watch series, I do find myself having to watch 'something' interesting during breaks and especially while eating. An exception would be listening to an interesting podcast (like RadioLab or a comedy podcast). Otherwise, I feel like I'll shrivel into a ball of lethargy and boredom. It almost feels like.. a lifeline, when I think about it. Like something I can't do without. The problem is, even when I set time plans, I end up disobeying them coz I don't 'feel' like I've gotten the right dose of entertainment yet. This is one major reason why long-term plans tend to gradually disintegrate. \n\nSo.. I guess I'm describing.. An addiction. \nIt's not like I need hours on hours, I just overdo breaks and entertainment time. Which is why I haven't watched a single series since last September. Because I know it is the fastest way to endless self destruction.. A YouTube video is short and ends.. A movie is long..but ends, with generally no sequel. A podcast only requires my listening, so I can also do other things. (Btw I don't really use social media so its not a source of entertainment) These are.. lesser evils, which I ironically sometimes find myself overindulging on. 15 min isn't enough. 30 min isn't enough.. 1.5 -2 hours.. Is enough of a break. I guess I wait for myself to get to that \"chill bliss satisfaction\" state before my brain is like..ok, we've had enough now.\n\nMy question is..how can I just be satisfied w a 15 min break AND get back to work right after . Yes, I've tried pomodoro, and an app called TimeDoctor, but seem to lose discipline w following them gradually.\n\nI'd appreciate any piece of insight.\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ax7xqg/hooked_to_entertainment/", "title": "Hooked to entertainment", "social_network": "reddit", "user": "Jada_Li", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1551711102, "permalink": "/r/DecidingToBeBetter/comments/ax7xqg/hooked_to_entertainment/", "nsfw": false, "first_save": 1635435642.3516464, "replies_charged": false}