{"id": "t5_2tand_t3_lx5e83", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "Hi. For a long time I’ve read a lot of your posts and I’ve been blown away with the positivity and determination I’ve read. Today I’ve decided to share my own story about wanting to be better. \n\nA year ago my marriage fell apart. I walked away because I was unhappy, depressed, lonely and felt like we weren’t a team anymore and were living separate lives. For a year I’ve struggled emotionally, been diagnosed with severe depression that I am actively trying to combat every day and most importantly I’m reflecting on things in order to be a better person and acknowledge that things in the marriage could have been bettered by me too and if I’d made more of an effort. For a long time I sat with guilt that tore me apart. Guilt that I’d walked out on my marriage, guilt that I’d left my wife in a lonely place, embarrassed that I’d failed and ashamed I was less of a man for doing this. \n\nThis slowly started to ease and repair itself. I still worried daily about how my wife was coping but knew she had a huge support network of family and friends so I knew she would be okay. Is eventually let someone else into my life, only for it to be affected by overhanging divorce proceedings, emotion about the trauma I had felt and was still experiencing. It started putting a huge strain on things, which wasn’t fair. \n\nThe final straw came last week when my emotions drove a wedge between us. Some may say I jumped too quickly into something after going through what I have been, and I suppose that may be correct, but she has been a huge pillar of support but there’s a cracking point in everyone. At that point i knew where my priorities were. I knew beyond any doubt that my marriage was over with no chance of reconciliation. That one was dead in the water a long time ago. I knew I had to look forwards and move forwards and not be looking over my shoulder all the time and moving sideways. \n\nI guess what I’m trying to say is I finally realise the time has come to fully move on and let her move on too. My wife and I both acknowledge that we weren’t happy and in this year of separation we have started to flourish and get ourselves moving towards the best versions of ourselves again. I need to think about my present and my future now, and letting the girl I’m seeing know I have moved on fully and my focus is on moving forwards. I have a long way to go to be the person I want to be. But I’m working on it. Each day is a learning curve and I’m learning more things about what makes me ‘me’ and my new relationship should get the chance to blossom. Tomorrow isn’t a guaranteed thing. Tomorrow may never come and this whole experience has taught me to grab life by the bollocks and make the most of what we have and what time we have left. We are all in charge of our own happiness and by fuck I’m going to be happy, learn from my mistakes and live my life now. \n\nThank you for listening. It means the world x\n\nEdit: spelling", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lx5e83/moving_on_and_being_a_better_person/", "title": "Moving on and being a better person", "social_network": "reddit", "user": "Tallscotsman", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1614808538, "permalink": "/r/DecidingToBeBetter/comments/lx5e83/moving_on_and_being_a_better_person/", "nsfw": false, "first_save": 1635436545.9312837, "replies_charged": false}