{"id": "t5_2tand_t3_89rm30", "request": ["9ad14901-6d2f-44f9-8b16-48a4f40b66ab"], "text": "Depression has eaten away my personality, stolen my joy, and has made me into an ugly person. I can hold my own for small, superficial periods of time. I look fine on the outside and some may even find an interest in me in the beginning. Anything past that time however is where the curtain starts to fall. After a certain amount of time, the truth is exposed to all I that I really am: a sad, angry, anxious, immature and empty person who's always in some kind of emotional pain. A negativity hangs over me where ever I go and in due time, ruins all my relationships (not just romantic). I can't commit to anything because of it (I'm scared to attempt anything because I don't want to see proof that I really am stupid and worthless) so now at the tender age 22, I have nothing to show for who I am. No real talents, just maybe singing and eating. I feel so guilty to my mother that I consider committing suicide so frequently (she doesn't know) and that I would ever consider hurting my family and friends like that. There's a black hole in my chest and in my head... I'm crying just typing out how ugly the inside of me really is. There is no light in me.\n\nI mutually follow this person I used have a thing with on instagram. He was sweet, kind, and so positive. Even leaving me, there were no ill feelings. I'm over it since it's been quite some time and we weren't quite the right fit because he was so positive to the point where I couldn't even have a chance to navigate through my bad feelings before getting to the positivity part. Anyways, I saw he had a new girl and she seemed interesting and cute so I checked out her profile and boy, did that hit me hard. Not because she was with him but because she had this beautiful light to her. Immediately you could tell, she had an amazing soul about her. Always smiling, it made her beautiful. A happy heart, talented in every area I had failed in, so happy it was just beaming out of her. Art, religion, travel, positivity, etc. this girl had it all.\nA nice, pure girl.\n\nI am tainted. I say I'm Catholic but I have many disagreements to it, break so many rules, yet I can't never leave it because there's a part of me that needs God even though I'm an idiot. Nothing sticks in my head at school, so I'm barely getting by in college without ever really learning anything. I might even get expelled. I can't handle difficult situations and shut down or start arguing resulting in people close to me calling me immature and irresponsible. I've been in this predicament so long, I don't know if I can get out. It's like quicksand, the more I struggle the further down I go. I fear I'm reaching my limit and might do something stupid. If you've ever seen Suicide of a Mannequin Boy on youtube, it feels like I'm watching the past and can relate to it so personally.\n\nI've scheduled counseling and that should start in a month. I need solid plan to get better because I'm at the end of my rope. I don't want medication because it just might finish me off. No I'm not against medication but my brother is schizophrenic and it was not an easy thing to see the toll it took on him. I want to get better even though I doubt it (and even though I feel like once a reach a happy point I'll die because life is just like that). I just need help in thinking of how to get a plan together.\n\nIs it pathetic to say I want that warm, warm light for myself? I don't know who I am anymore, maybe that's good thing since it means I can rebuild, I just have to kill old habits. Most of this was just rambling. Sorry. Any suggestions on a plan?\n\nEdit: Thank you very much for taking the time to write all the kind words and thoughtful advice. I'll take it to heart and somewhere down the road I will post an update on how I'm faring with the advice. I made a mistake on the short film I have mentioned above, it's called Death of a Mannequin Boy made in the Vancouver Film School. I always go back to it sometimes for comfort when I feel lonely but mostly as a cautionary tale. It's one of the reasons why I wanted to get better because I didn't want to end up like the main character.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/89rm30/how_do_i_turn_my_darkness_into_light/", "title": "How do I turn my darkness into light?", "social_network": "reddit", "user": "_orsohelpme", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 63, "down_vote": 0, "creation": 1522863209, "permalink": "/r/DecidingToBeBetter/comments/89rm30/how_do_i_turn_my_darkness_into_light/", "nsfw": false, "first_save": 1635435311.6316519, "replies_charged": false}