{"id": "t5_2tand_t3_p62go1", "request": ["da3e72ac-2059-4c8f-99c6-52edffdec3d2"], "text": "This title sounds like a clickbait YouTube video, but it's unfortunately the truth. Allow me to elaborate.\n\nI am a teenage girl into her late teens and I have had a crush on various boys ever since I was 9. I noticed a pattern was that I'd fall out of love if I knew they liked me back and suddenly get annoyed by all the attention I received from them, but I'd feel miserable if I knew that the boy did not hold any feelings towards me.\n\nRecently, a boy has developed feelings for me after I have pursued him for a few months. I still think that the \"crush\" feeling is there but I think it is fading fast. However, I do cherish him as a really great friend or person, and I guess to some extent I just want validation that this relationship is \"the one\". I know - I'm young and there's a lot of time ahead of me, but the problem is the boy doesn't know about my current feelings. \n\nHe has always told me that if I don't like him anymore (he and I both have low self esteem), I am to tell him honestly. Thing is, I don't want to lose this friendship (because I still... like him? I think? The English language needs a word for this) because I still do care about him. But I am so scared that I have been leading him on and I don't want to hurt him if this is the case.\n\nAlso, I hate that I do this. This isn't the first time and I've chastised and chided myself for this. I don't understand why I feel this way, chasing a boy then not loving him anymore, but I need a way to genuinely love someone and not just enjoy the dopamine. I do have a budding social circle and many friends, and so far I've barely had problems with keeping those relationships (but then again, it could be because they are around me all the time). They ship me and this boy but they don't know we actually like each other, but I do think some of the pressure is getting to me.\n\nWell, sorry for the long one. I'm hoping for some advice that could quell my worries - maybe validation. I've tried to be as honest as possible here so that it may be as accurate as possible, but I don't see a solution right now. \n\nThank you, everyone.\n\nEdit: A few people have pointed out that I show signs of BPD or Dismissive Avoidant attachment. I think for the first time in my life I believe that I might have BPD, but I am so glad I can finally put a name on the Dismissive Avoidant attachment. I have a couple of mental illnesses, like depression, anxiety, compulsions, intrusive thoughts, and an inferiority complex (I do not go one day without some form of these screwing with my brain) and only recently have I started seeking help. Here is some of my background so that I may be properly analysed and you all have context.\n\nI was not abused growing up. If I am to reflect on my childhood, I daresay I had a normal upbringing. My parents never pressured me or made me care about my grades throughout my younger years. Every material item I wanted, I eventually got - as the younger sister, I was spoiled a lot. After I played with it for a while, I would get bored and eventually forget about it, then after about 6 months, I would remember it and it would be a novelty again. Unfortunately, I do believe this had an effect on my psyche as I was used to getting what I wanted and then one day, I realised other people had it better, I couldn't be better than everyone etc and it really hit me hard. I still suffer the effects of that to this day (inferiority complex). \n\nRight, I'm supposed to talk about my upbringing. I daresay I have a transactional relationship with my parents, but not because they are bad parents, but because I am a bad daughter. I say what my parents want to hear so that I do not get into trouble, which leads to a lot of hiding and manipulation. In fact, I am really good at manipulation but I really do not like doing it as it doesn't make the other person feel good (although it does, in the moment, satiate my inferiority complex). Back to my parents: when I get something, I would consciously act nicer as a way to \"pay them back\", and they would make a deal out of it if I didn't (though not as a sense of blackmail, but I think out of obligation). \n\nThis was a long edit. Thank you for taking the time to read this and I hope this helps with understanding the situation.\n\nEdit 2: I told him this afternoon over a cup of bubble tea as we were walking home together. He is truly very understanding and he hasn't changed his behaviour towards me at all. Now that he knows, he is prepared to let go when the time comes. I have told him explicitly it's my fault many times but he refuses to say that it is. Honestly, he's too sweet and I really, really don't deserve someone as caring and understanding as him. Of course - he's not perfect but then again, I am far from it too. I really hope that both of us are happy at the end.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p62go1/i_fall_out_of_love_every_time_i_know_the_boy/", "title": "I fall out of love every time I know the boy likes me back and I hate this. How do I stop being such an attention seeker?", "social_network": "reddit", "user": "ibrokebatterypacksb4", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 61, "down_vote": 0, "creation": 1629202074, "permalink": "/r/DecidingToBeBetter/comments/p62go1/i_fall_out_of_love_every_time_i_know_the_boy/", "nsfw": false, "first_save": 1635438089.7993288, "replies_charged": false}