{"id": "t5_2tand_t3_iw32p3", "request": ["f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "Your love, your kindness, your compassion, your connection, your friendship, your teachings, your  lessons, your light are all incomplete if they are not directed at you first.\n\nI’m finally learning through all of my experiences that if I am not my top priority - if I do not take my own needs and desires into consideration before everyone else, I am not only setting myself up for major depletion but I also am not serving others. \n\nAnytime I put another before me I am telling the universe that they are worthier & deserve more than I do. \n\nI deserve just as much as you & you deserve just as much as me. And it is both of our jobs to focus our energy on where we have power, meaning only in our own lives. \n\nWe’re so often taught that it’s a disgrace to be “self-ish” and misidentify taking actions, setting boundaries, and saying no for our own well-being as being a selfish thing to do. I’m now recognizing that being selfish really only means having an ill intent & taking wrongful actions towards others for my own gain. Selfish is an act from the ego, while taking action for yourself first is an act of self-love & from the soul. \n\nSelfish is not saying yes to yourself and no to others. It is not taking action that will disappoint others when you have your own growth & well-being in mind. It’s time to reframe what we believe being selfish is because we have a lot of people walking around (hi, me) thinking that having their own best interest at heart is somehow wrong & that we need to people please in order to be “good”. \n\nI need to put my own needs before the ones of those around me in order to serve us all better. It is an act of love. \n\nWanted to send this message to anyone who needs to hear it right now, because I know I totally need this reminder.\n\nIt feels good to feel whole again because I’m taking care of me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iw32p3/its_time_to_take_care_of_you_first/", "title": "It’s time to take care of you first.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 43, "down_vote": 0, "creation": 1600558368, "permalink": "/r/DecidingToBeBetter/comments/iw32p3/its_time_to_take_care_of_you_first/", "nsfw": false, "first_save": 1635438463.6397057, "replies_charged": false}