{"id": "t5_2tand_t3_oyypgn", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "**I wrote this script so I could film a video on it, but just didn't have it in me to record it. I hope these words are helpful to you**\n\nAt some point in your life, these thoughts must have crossed your mind:\n\nI don’t know what to do with my life. Life is hard and tedious, I’m suffering, why am I suffering, is this suffering worth it?\n\nAnd of people who answer no, likely they still choose to live another day, even if they do so begrudgingly\n\nI believe from fear of what happens after death, or not wanting to hurt the people who love you\n\nI still struggle with these thoughts and feelings and when I went looking for answers I didn’t find much\n\nAnd if I did it was pretty scattered, and took a lot of time to mentally process before it was helpful\n\nBut eventually I thought of 3 metrics of how to live, which has helped me through a lot of depressed states\n\n**It’s better to live a slightly “selfish” existence, than for you to not live at all.**\n\nDepending on your culture and personality type you may not resonate with this, especially because for the majority of people I’m pretty sure you want stuff. Whether that stuff is a girlfriend, a boyfriend, sex, a car, a house, there’s likely something in life you want\n\nI used to believe that you shouldn’t want or expect anything out of life because nothing is promised, and if you want anything it’ll keep you from appreciating what you have now. And I used to be really proud of how little I wanted, I felt like I was a more zen person being able to detach myself from the materialism and pleasures of the world. But now I feel there’s a duality to wanting things, especially possessions, and it can even be good to cultivate your desires. For example I used to really judge guys who loved cars, and would cringe so hard if their phone home screen or desktop background was a picture of their dream car\n\nOn one hand I’m just in awe, because it felt like they were so confident that having that car would definitely make them happier, but empirical data overwhelmingly shows this isn’t the case, so why did they still want the car despite the evidence?\n\nOn the other hand I can’t help but respect their natural interests, and if the aesthetic or performance of a car really excites you, it wouldn’t be right for me to say that’s stupid or “selfish”. In fact, there are times I’m envious of that desire. A strong desire, something that excites you, can keep you going in life, it can give you the fire to get out of bed when it’s cold and early, and be that light at the end of a tunnel, and for some people that’s a car and that’s okay. And even if you feel your desire is the stupidest thing ever, I would encourage you to be at peace with it, cultivate it and pursue it.\n\nPersonally I hope it’s not a car, it could even be an abstract concept, one I like a lot is to love and be loved.\n\nBefore I move on I want to give credits to Danganronpa, a character named Kaito inspired me to write this in a scene, when after the death of one of his friends he says\n\nWho cares if you don’t have a reason to live?\n\nCan’t your reason for living be something simple like good food or your friends?\n\nWhich I disregarded at first because it just grossly oversimplifies what you should base your life on, but that’s just Kaito’s character, he’s a kind hearted, simple minded guy, and all of us I believe have met “simple” people who have simple wants and pleasures, and I’ve even looked down on people for being “normal” or basic, and maybe you’ve also secretly judged them too. But part of you may also be secretly envious, because while we’re deep in our thoughts, they’re off enjoying life and connecting with people, so maybe our introspection isn’t worth clinging onto if it inhibits us from living well\n\n**Socializing & Belonging**\n\nWe are social creatures, it is in our biology to need social connection. The same regions in your brain that regulate dopamine when you’re hungry fire when you’re deprived of social interaction. In prison, one of the most feared punishments is being put in the hole, which is just social isolation. I’d even wager many prisoners would rather take a beating than subject themselves to social isolation.\n\nBut in our culture we glorify the idea of the lone wolf, the alpha, the edgelord, the gladiator, brands based one one player, one personality, even if it’s a team sport. When in reality those people are some of the saddest and loneliest people you’ll ever meet. And even outside these categories it’s really tempting to prioritize comfort over bonding, especially if you have a good and well respected job, and you want to come off as strong and capable, well-adjusted and normal, but to find and develop real friendships and relationships requires vulnerability and rejection, both of which are, respectively, already extremely uncomfortable.\n\nSo this process requires patience and courage, and continual hope that you will eventually meet the people you’re meant to meet.\n\nAnd it’s likely you already have at least one friend in your life who you can’t help but smile, make jokes and laugh with just by hanging out, and feel comfortable sharing pain and joy with. Make it a point to spend time with them at least once a week, don’t wait for them to hit you up. Friendships end by assuming it will remain strong without consistent meaningful contact. Marriages end if a couple chooses not to plan meaningful dates anymore, under the assumption that they see each other everyday anyway so it’s like they’re “dating” 24/7. But just like we shouldn’t rest on our laurels, we shouldn’t assume a relationship will remain strong without being purposeful\n\n**An element of the unknown**\n\nMystery, adventure, excitement, and the longing for something new. All these feelings are tied to an element of the unknown. Whether we know it or not we satisfy this need in our lives with things like traveling, romantic pursuits or our consumerist demand for Apple to release a “new” and “better” iphone every year. Even something wholesome like having children, a big allure of parenthood is the unknown of how your child will navigate the world and form their identity, and being able to see and contribute to that.\n\nAnd we can keep making travel plans, go on cute romantic dates, have sex, buy the new iphone, raise kids, raise our kids’ kids, and all these things will likely bring us some form of happiness\n\nBut we’ll always crave more, and we’ll grow accustomed to every new pleasure we experience or acquire.\n\nSo how do we introduce a consistent and sustainable element of the unknown in our lives. A few things immediately come to mind: Sisyphis, Astronauts, Outer Space and God\n\nLong story short, I’m sure you’ve heard of it, Sisyphus is the guy in greek mythology who has to roll a boulder up a hill but once he does the boulder rolls down the hill so he has to roll it back up for eternity. Personally, this story terrifies me because it hits so close to home with how most of our lives play out, and there’s nothing we can do to escape that destiny. However in our case, if we’re privileged enough we might be able to pick what kind of boulder we roll up the hill. And outside of the things I already mentioned, the most “exciting” “boulder” I can think of is being an astronaut exploring outer space, and space truly is the final frontier remaining for humans to explore\n\nSince we’ve geographically recorded every place on Earth and documented almost every species of animal, which is great for the progress of education but has almost killed our spirit of adventure.\n\nImagine life, just a few centuries ago, you’re sitting in a pub, there’s no internet, and a traveller just returned from a voyage. And he’s like, guys there’s this animal out there, on the other side of the continent, it’s like a dog sheep thing, it’s tall and it’s neck is so long it can just stand around and eat the leaves off the top of trees. Without the internet, you might conclude that this guy’s crazy or he’s seen a magical animal and your imagination might run wild with what other beasts exist and what the world is like where they live. But today, if I were to describe to you a fantastical beast, as long as you can find it on google, you probably wouldn’t give a shit about it, like it’s cool and interesting it exists, has these features, and thrives in this environment because x, y & z, but there’s no feeling of mystery anymore\n\nBut space is so mysterious, perhaps infinite, so I can see the allure of billionaires wanting to go to space, but personally I don’t give a shit about space either because even though these people are witnessing and experiencing the most awe inspiring, adventurous and mysterious thing this world has to offer, this experience can lead them to depression.\n\nI feel like this implies something about the human spirit, that we were never meant to reach the apex of anything, and if we do it we’ll either find a new apex or be miserable.That we have a constant longing to achieve our goals, but we don’t realize we don’t actually want to achieve them, at least not fully. Figures like Walter White from Breaking Bad and Kobe Bryant come to mind, they didn’t stop at the top, because even the top wasn’t enough\n\nWhich reminds me of my favorite Chance the Rapper verse:\n\nGod is better than the world’s best day. God is better than the best day this world has to offer.\n\nAnd I hope you don’t think I have an ulterior motive trying to convince you you need to believe in God, because even if you don’t believe in God you can still think of God as a concept and still benefit from what I’m about to say.\n\nAs humans sometimes it’s frustrating trying to understand God. When I heard people say God is mysterious in his ways to justify every tragedy, I used to roll my eyes so hard. I would think if God exists why would God allow this tragedy to happen or if God wanted us to believe God exists, God should appear before us and perform impossible miracles like a magician. And I used to be really frustrated with this, deep down I wanted God to exist, but also wanted hard evidence before I could believe.\n\nBut now I wouldn’t have it any other way because if God was a God I could fully comprehend, that is no God of mine. Wouldn’t you also reject a God you could fully understand? Because we expect God to exist at an infinitely higher level than us, beyond our three dimensional perspective, and beyond the knowledge and understanding we could ever hope to accumulate, that’s the minimum we would expect of God before we would ever accept a being or entity to be God. So even though the mystery can be frustrating, we wouldn’t want it any other way. And if we accept the existence of such a God to truly exist, and believe that God is part of our lives and wants to guide us, we are blessed with a consistent and sustainable source of an element of the unknown, which cannot be found anywhere else in the world", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/oyypgn/why_do_you_still_choose_to_live/", "title": "Why Do You Still Choose to Live", "social_network": "reddit", "user": "leexrnr", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1628220993, "permalink": "/r/DecidingToBeBetter/comments/oyypgn/why_do_you_still_choose_to_live/", "nsfw": false, "first_save": 1635435549.4704788, "replies_charged": false}