{"id": "t5_2tand_t3_ar1z5w", "request": ["da3e72ac-2059-4c8f-99c6-52edffdec3d2"], "text": "I am a 21 year old male from Peru, who has been struggling with weight for a couple of years now. I have never really cared for my body, nor cared about looks. Therefore, I wasn't really bothered by the 10-15 extra kilograms (22-33 pounds) I've always carried on. However, being a medical student I knew that carrying that extra weight is not good for my health, but I guess I always chunked it to future me (please notice that I don't consider myself a procrastinator, and I do not tend to procrastinate in other areas).\n\n&#x200B;\n\nRecently, I went to the doctor, who told me it's being overweight that has given me 2 lumbar hernias, as shown in the MRI (which would explain the annoying back pain that's been cutting my sleep short). He also said that loosing weight should be my #1 priority right now. The hernias are rather small right now, but if I don't start taking care of myself, they will continue to grow and will requiere surgery sooner than later; something that I'd rather avoid\n\n&#x200B;\n\nOnce I got home and saw myself in the mirror, I felt genuinely disgusted at what I saw. \n\n&#x200B;\n\nI have tried dieting some years ago, and it actually worked. I consulted a nutritionist and managed to get to my ideal weight (68 kg-ish), though I still had a lot more body fat than I should (which is still a health concern) because I have never been into exercising. Unfortunately, over the years, I've managed to eat my way back to being overweight. I would gladly try dieting again, but right now my family is not in a position to afford a nutritionist, mostly because my medical education is sucking the funds out of my parents' pockets.\n\n&#x200B;\n\nI feel like I need to make a stop here in order to answer questions you might have reading this part. Here (Peru), it's unusual for university students (college isn't really a thing around here) to leave their parents' house until well after they have graduated; and once they are working on their career-line. Furthermore, parents are usually able to pay for their childrens' education out of their own pockets because most universities are rather affordable (compared to the US, for example). The main reason I mention this is because I wouldn't want anyone to get on me for living with my parents; and because living with my parents is an important reason I eat so much. \n\n&#x200B;\n\nBoth of my parents are overweight and my father is a diabetic, who does little to take care of himself, despite my numerous attempts at trying to make him more responsible in that area. My mother really likes to keep sugar-high, fat-high food around the house because \"what else is she expected to serve guests if they arrive unexpectedly?\". When I get anxious, I crave for food; and most of the time it's that unhealthy weight-gaining food mom and dad have lying around that satiates me. Anxiety is an important trait of my personality; and while anxiety disorder has been crossed out by a psychiatrist, I tend to get really anxious without an apparent explanation. No major crisis or crying or the many nasty symptoms someone who does have anxiety disorder is forced to go through, yet \"anxious\" if a common mood for me. \n\n&#x200B;\n\nSo here I am, 21, with a body that's given me a disease proper of an 50 or 60 something; and an obesogenic environment. I'm really worried about this situation and I'm afraid it might start taking a toll of my self-esteem. Where do I start?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ar1z5w/its_about_time_i_did_something_about_my_weight/", "title": "It's about time I did something about my weight", "social_network": "reddit", "user": "PokerFacePeruviano", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1550268853, "permalink": "/r/DecidingToBeBetter/comments/ar1z5w/its_about_time_i_did_something_about_my_weight/", "nsfw": false, "first_save": 1635438094.124935, "replies_charged": false}