{"id": "t5_2tand_t3_n4utra", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "f39f6441-79a5-42c9-8dca-c8455143a12a", "ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": " \n\nYou unfriend her because you love her too much, and as long as you still talk to her, see her everyday, you will never let her go.\n\nShe changed her avatar, and you surely lose sleep tonight. To describe the feeling? Short of breath, heart skipping beats, feeling nausea (probably because of the food). But it was not that bad, not like last time. You know that grieving will not do anything good, you just can't stop the emotions. Will keeping checking her Facebook help you to get used to it, or can you get better by forever staying out of her account? You don't know, that is why you are writing this. You hope that through writing, you could think more clearly, and may come up with a solution to your problem.\n\nHow do you get better this time? Did you even actually get better? You used to think that keeping grieving and loving, staying in a state of pain can make a miracle come true, and although it did bring you and her back together once, you know that it will not happen this time. So what will you do?\n\nYou focus on you. Thanks to that Tinder date for helping you realize that. You will not get her by stalking her Facebook, texting her all the time. You (may) get her (or someone like her) by making yourself better.\n\nSo what should you do?\n\nFirst, youneedtogotosleep. The only reason keeping you up at this time is her changing the avatar, and oh boi, if you sleep now you are going to have a bad time.\n\nYou're gonna study. God help you, cause the semester is almost over. One more week and you are done.\n\nYou're gonna set a goal in the summer. Get buff, get some skills that make money, study stock markets, learn French. They make you a better person. Also internship, get that recommendation letter bud.\n\nYou're gonna go dating. Holy shit only 2 dates and you already find someone that you get more obsessed with than her. What will happen if you date more? You are beginning to get more confident in yourself, and cheers to that.\n\nGo out with your friends. Don’t forget them. They are lovely and can be your true friends. Make more too!\n\nAnd that is it. You have the solution. Calm yourself down and relax. It is going to be okay. You will feel shitty for a while, and that is totally fine. You are proud of yourself, you know what you can do to get better.\n\nNow it is your choice to do it or not.\n\nBreath slowly, let things flow through you, and feel yourself getting sleepy.\n\nGood night Tom.\n\np/s: Sorry for the bad grammar or vague wording, I was writing it for myself, and just wanna share it to you guys", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n4utra/i_visited_my_exgirlfriend_social_account_and_was/", "title": "I visited my ex-girlfriend social account, and was super depressed. This is something I wrote after. Hope that will help someone", "social_network": "reddit", "user": "Ikaynt", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 73, "down_vote": 0, "creation": 1620154152, "permalink": "/r/DecidingToBeBetter/comments/n4utra/i_visited_my_exgirlfriend_social_account_and_was/", "nsfw": false, "first_save": 1635435799.8689098, "replies_charged": false}