{"id": "t5_2tand_t3_nsawab", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "b69cf201-6737-4217-b486-9096135546b8"], "text": "That I'm heading straight into an endless dark tunnel. I feel like now that I decided to grow up, I stopped using drugs, trying to be more active, talking to people, the fog clears up and it lets me see the road and where I'm going. Looking back at my youth where I had no care in the world, I didn't put any effort on myself whatsoever as I was scathing by. I didn't make any friends, no connections, no marketable skills, nothing. I'm turning 25 next month and seeing all my friends from college doing something with their life, getting married, being promoted, it crushes my soul. Everybody has a significant other and is planning on settling down, I mean everybody except me. I haven't met anyone and IT IS because of the lack of effort on my end. I've had people putting efforts on me, getting to know me, all I did was shut them away. And now they've moved on and I'm still where I'm at when I was 18. \n\nI hate this feeling of how I'm making baby steps towards where I want to go where everybody else is running and rushing. And every little thing I've done right, opens up for me to see 10 big things I've done wrong in the past. I'm trying to fix everything but seeing how much time it will take is disheartening. I'm walking all by myself in this world, but I have my parents as my emotional support. Knowing that they're not gonna be around forever makes me cry at night.\n\nI woke up this morning to this premonition of me walking down a road that leads to a tunnel, I look around the beautiful scenery of the lakes and the woods. As I look back I see my parents waving goodbye on the sunset horizon, and I'm sobbing, trying to force myself walk back up the road to them. I don't want to keep going anymore, but I'll eventually be in that tunnel that leads to hell. I've been feeling physically ill thinking all of this as I'm itching to go back to my old ways. I have no choices other than keep on going, because I feel like I will be in hell either way.\n\nI'm sorry if the nature of this post is grim. I've been wanting to open up this feeling I have for a long time. I'm tired of keeping smile on my face. I just want all of this to be over soon.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nsawab/i_decided_to_be_better_and_now_i_see/", "title": "I decided to be better and now I see...", "social_network": "reddit", "user": "nos-urprises", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1622828518, "permalink": "/r/DecidingToBeBetter/comments/nsawab/i_decided_to_be_better_and_now_i_see/", "nsfw": false, "first_save": 1635435390.5377023, "replies_charged": false}