{"id": "t5_2tand_t3_osl3jh", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "Edit: Wow this blew up. Thank you for the awards and recommendations kind strangers. I hope whatever it is that you're struggling gets over soon or you get the power to deal with it and learn from it! Seek discomfort! ⚡ \n\n\n\nI'm not a bookworm at all. I run away from books. But, non-fiction and self development books interest me. It took me 2 years and so many attempts but I finally read a book from start to finish. I used to try to start reading and give up. At one point I even reached halfway through the book but gave up because I felt lazy. But after failing multiple times, I realised that I want to make a habit of reading every day and slowly but surely I was able to read my first ever non-fiction book, The Subtle Art of Not Giving a F*ck by Mark Manson from start to finish. I read 10 pages per day. Though I missed a couple of days here and there because I felt lazy but hey I got it done and I'm sorta proud of myself. Along with this I've been trying to build a habit of drinking water everyday in the morning, along with exercising. It has been going good so far. I'm on like a 14-15 day streak. I still have a long way to do to work on myself. Overthinking, insecurities, my own issues, fear of failure and rejection, etc are things that I need to figure out and solve. But as a depressed individual for almost 5-6 years now I'm proud of the fact that I've been able to build this much momentum. Let's hope it doesn't get torn down and even if it does, I'm not giving up. Slowly but surely I will win back my life and know who I am. Small steps lead to huge rewards or greater progress. \n\nThat's all. I didn't want to brag but I wanted to share this tiny accomplishment. \n\nThank you for reading beautiful human, I hope whatever is troubling you will go away and you'll learn something new about yourself every single day!❤️\n\nAlso BTW, which is the next book I should read?\n\nHere are the contenders...\n\n1. Everything is F*cked : A book about Hope by Mark Manson \n2. Mindset by Carol Dweck \n3. Start with Why by Simon Sinek \n4. IKIGAI : The Japanese Secret to a Long and Happy Life \n5. Never Split The Difference by Chris Voss \n6. Atomic Habits by James Clear (I've read like 30% of the book but then gave up as I got lazy and picked up The Subtle Art of Not Giving a F*ck by Mark Manson. Should I revisit this book now or later?) \n7. Some other personal development book. If so, then please leave the name down below. \n\nThank you kind stranger!!❤️😄", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/osl3jh/after_struggling_and_giving_up_for_2_years_or_so/", "title": "After struggling and giving up for 2 years or so, I finally finished reading my first non-fiction book! Low key kind of proud of myself.", "social_network": "reddit", "user": "jash_goda", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 609, "down_vote": 0, "creation": 1627385694, "permalink": "/r/DecidingToBeBetter/comments/osl3jh/after_struggling_and_giving_up_for_2_years_or_so/", "nsfw": false, "first_save": 1635435344.3587618, "replies_charged": false}