{"id": "t5_2tand_t3_py3des", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "I  hear it all the time. Let go of your past, let go of your traumas, let  go of your anger, etc. When I was 14 I had such horrible anger issues  that I was mistreating my younger sibling. When I realized the impact I  was having, I did everything I could to stop. I couldn't understand what  people meant by letting go, though. I was so angry and so hurt, but  since I didn't know what to do... I just shut it all down. I closed it  off completely, and my behavior did get better, but I didn't get better.\n\nIt  turned internal, and I started treating myself that way instead. Around  18-ish, I blew up in anger again. Things got nuts, then I shut it down  \\*again\\* because the hurt and anger was more than I could handle, and I  knew I could either feel it and be alone and have no one, or shut it  down again and have people in my life again. It's a complicated  situation, but I chose what would keep me going, and shut it down.\n\nAnd  now I'm here again, but instead of just one or the other whichever I  decide... it's more like it's just a day-to-day process of which one  will come out this time. Some days I fight everyone and everything, I  feel like a teenager again. I can't keep my mouth shut when I should, I  can't ignore idiots who are picking petty fights, etc. And then on good  days, I'm calm, and understanding, and kind and everything that I want  to be.\n\nI just got out of a  horribly abusive situation with a manipulative person who targeted my  vulnerabilities, but honestly, I think this was a long time coming  anyway. This just made it happen faster. And now I'm just trying to  understand, what does it mean to 'let go' of the ways people have hurt  me and let me down?\n\nI've been let  down since I was born. Abused in every way someone can be, neglected in  huge ways, invalidated at every turn and shaped to be someone who builds  their sense of self on what other people need from them. I've come a  long way from then, but it doesn't change how messed up it's made me  inside, and it doesn't change that I don't \\*really\\* know how to let go  of my past to become who I want to be today.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/py3des/what_does_it_mean_to_let_go_and_how_do_you_do_it/", "title": "What does it mean to let go, and how do you do it?", "social_network": "reddit", "user": "frigginfroggie", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1632945611, "permalink": "/r/DecidingToBeBetter/comments/py3des/what_does_it_mean_to_let_go_and_how_do_you_do_it/", "nsfw": false, "first_save": 1635435775.4648268, "replies_charged": false}