{"id": "t5_2tand_t3_krutnh", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "When we focus on what does not matter eventually, we are going to waste a lot of our energy and time. It can hinder us from achieving what we actually planned to. \n\nHere are questions that you could ask to guide you to focus on what really matters and let go of what does not.\n\n1. Is this who I want to be?\n2. What is my end goal?\n3. Does this lead me to the life that I want to live?\n4. What is really important to me in life?\n5. Which action is beneficial to me?\n6. Will this matter after 1 year, 3 years, 5 years…?\n\nI can give you a scenario so that you can understand even better:\n\nLet's say someone sent you a text that is a bit offensive to you. Now your intuition might tell you to fight back. But you know you can do better. Then you can take some time to answer those questions that I mentioned above like this:\n\n[**1**](http://1.is/)**.Is** **this who I want to be?**\n\nYour answer: No. I want to be a friendly, kind, peaceful person.\n\n**2.What is my end goal?**\n\nYour answer: I want to reach a win-win situation.\n\n**3.Does this lead me to the life that I want?**\n\nYour answer: If I keep reacting negatively, my life could be full of dramas. Then I cannot grow.\n\n**4.What is really important to me? Peace or drama?**\n\nYour answer: Friendship and peace of mind are important to me.\n\n**5.Which action is beneficial to me?**\n\nYour answer: If I react with calmness and kindness, that is beneficial to me my physical and mental health.\n\n**6.Will this matter after 1 year, 3 years, 5 years…?**\n\nYour answer: Not at all.\n\nHope this method helps you. Happy new year to all!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/krutnh/sharing_a_personal_approach_for_how_we_can_focus/", "title": "Sharing a personal approach for how we can focus on what matters and let go of what does not", "social_network": "reddit", "user": "mindsofcreators", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1609960248, "permalink": "/r/DecidingToBeBetter/comments/krutnh/sharing_a_personal_approach_for_how_we_can_focus/", "nsfw": false, "first_save": 1635435479.4340727, "replies_charged": false}