{"id": "t5_2tand_t3_pbtq84", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "So right now it’s 2am on Thursday morning.  I decided to give up video games tuesday afternoon/night.  So Wednesday was the first full day where I avoided any and all video games.   Even a bigger deal because Im still out of work until September 1st. so I had plenty of opportunities.  \n\nIt was a pretty great day.  First the negatives. I didn’t eat that well but didn’t really go over that much either. I also watched a little more tv than I should but nothing too extreme. \n\nNow the good!   I feel like I accomplished a lot today.  I’ll be honest, I’ve never skipped bathing all together but sometimes I’ll just stand in the shower and just let the water go over me.  Soap up super quick like under arms and chest then rinse and get out and not comb my hair.  But today, well technically yesterday now since it’s 2am, I scrubbed entire body, shampoo and conditioner, combed my hair etc.  got dressed in some slightly nicer clothes.  Not just Nike shorts and a T-shirt.  \n\nI went out, bought some bottled water, Powerade zero (zero calories), and some razor blades to shave.   I usually just let it grow then do a quick electric buzz.  \n\nI read some today which was relaxing.  \n\nCooked some fries and a burger.  Not healthy but it’s better than being depressed and having microwaved crap or fastfood.  \n\nI actually did the dishes same day instead of piling them up in the sink for a week\n\nI also did laundry.   \n\nI went on codecadamy and spent some time learning how to code!\n\nI also have this app that teaches you Japanese.  I did a little months ago but stopped.   I started again and plan on doing atleast a couple times a week!   \n\nStill have some things to do.  Want to start going to the gym and eating better regularly but I think today was a pretty awesome day! Go me!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pbtq84/small_victory_but_i_didnt_play_any_video_games/", "title": "Small victory, but I didn’t play any video games today!", "social_network": "reddit", "user": "tyler_durden2021", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 296, "down_vote": 0, "creation": 1629958810, "permalink": "/r/DecidingToBeBetter/comments/pbtq84/small_victory_but_i_didnt_play_any_video_games/", "nsfw": false, "first_save": 1635438035.4376156, "replies_charged": false}