{"id": "t5_2tand_t3_jiskyf", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "my family is as dysfunctional as they come and when I was young I just looked away foolishly thinking that it'll never bother me but it came back with vengeance and that has had a huge impact on me and my depression. especially in the last 2 days where everything went REALLY really bad.\n\nand I've just been not in a good place these past few days and constantly thinking about stuff.\n\ntonight I had a moment of clarity when I kinda said to my self \"aren't you being a little selfish\"\n\nso I thought about it. I have depression and anxiety and I'm constantly thinking why me? why does my life have to be this way? why do I always get fucked? why me?\n\nand I realized what if my parents are in the same situation? what if they have become toxic people because of life but in reality they need help? (just like I do) and their son sitting a few feet away is just so self-absorbed that he can't even see them.\n\n..\n\nso I did a little workout at 3 am, took a shower at 4. sat on the couch just thinking about things till 5:30 when my dad wakes up. said \"morning dad\" to him in a loud, clear but good voice. (i usually say it in a dim, repressed voice)\n\nwent into the room my mother had just woken up too and was sitting on the bed. said morning to her too and kissed her on the cheek and asked her how she was doing. she was a bit surprised but seemed a little happy about it.\n\nand so I've decided to be a good, cheerful person (loudly cheerful if I have to be) for my family if it means I have even the slightest shot at pulling them out of their toxicity, I know it's not that easy but I have to try the other option is just turning my back on them and moving out which I don't want to do. and hey if I can help maybe it'll be good for me as well.\n\nI really hope I can stay loudly cheerful in their life so I can keep them from becoming extremely bitter old people.\n\ngive me strength.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jiskyf/ive_decided_to_not_be_selfish_and_be_a_better/", "title": "I've decided to not be selfish and be a better person for my family", "social_network": "reddit", "user": "MrYeetPhd", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1603764494, "permalink": "/r/DecidingToBeBetter/comments/jiskyf/ive_decided_to_not_be_selfish_and_be_a_better/", "nsfw": false, "first_save": 1635435898.5798683, "replies_charged": false}