{"id": "t5_2tand_t3_jtkzx5", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a"], "text": "Hi i'm James, and I want to be better. \n\nI have been reading this subreddit for a while now, so it's my turn to be honest and explain where i'm at and where I want to be. I am a part time photographer and entrepreneur on the south coat of the UK but my lack of self confidence and bad habits are really getting in my way. I have suffered with social anxiety and depression for as long as I can remember, but i've just finished a round of therapy and we have uncovered that my underlying issue is a profound lack of confidence. I appear it on the surface but I know I care too much about others opinions. The truth is my business has turned over more this year than last year, which can only be a positive. But I am not putting enough into it when I know exactly what I need to do to push it to the next level.\n\nSo, what do I intend to do about it? After all, all of this self awareness means nothing if it doesn't equal action. One thing I learned in therapy is that gratitude is damn powerful. It allows you to notice the great things in your life, as well as recognising my achievements, no matter how small.  So, I am going to start a gratitude diary, noting down what I achieved that day, what I am grateful for, and anything else positive.\n\nI also want to tackle this self confidence issue directly. There is no doubt that I have put on weight in the last 4 years. I am the heaviest I have ever been, eating more shit than ever and don't move enough. I am going to slowly improve this by cutting out takeaways, drink more water and try to make more health conscious decisions. \n\nI often make big leaps like this but they fail, so I am going to update on here and keep myself accountable. My DM's are always open, so feel free to chat with me. \n\nSpeak soon, \n\nJames", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jtkzx5/i_want_to_be_better_for_myself/", "title": "I want to be better for myself", "social_network": "reddit", "user": "jamesingephotog", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1605291432, "permalink": "/r/DecidingToBeBetter/comments/jtkzx5/i_want_to_be_better_for_myself/", "nsfw": false, "first_save": 1635435885.5667367, "replies_charged": false}