{"id": "t5_2tand_t3_h8wxh9", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "This is a repost as I still really need help with this.\n\nI have a problem that's hard to define. People are either friends to me, or nothing- I have a really hard time finding the grey area. I feel really stupid, and my gf has told me that I \"expect too much out of friendship & people.\" When I form a new friendship, and the feelings are intense it's one of the greatest feelings in the world. I am generally a loner and introvert, and often too outspoken to get along with people with large egos (a characteristic that has made plenty of trouble for me)- so when I find someone I connect with it's almost like a high.\n\nBut decay comes to all things, and that includes friendships. When I moved as a preteen I lost all my friends to distance, silence and time. I'd spend months and years wishing for my old life back while rejecting new opportunities. As I grew, I became more mellow about it- but I feel I'm more intense than most. I'm surprisingly soft spoken about how much I love my friends, I'm not the clingy type but the intensity is always there under the surface, and generally I show it through my actions. You need a favor? I will do anything in my power to help you. Because I love you all so fucking much, every friend I've gained and drifted from- the feeling is so goddamn intense, even if I seem placid, isolationist, and calm about it. Once I accept you into my life you feel like a limb to me, indistinguishable from myself. And being an admittedly (and proudly in an Ayn Rand style) selfish person, there is no closer form of intimacy I can give someone.\n\nBut as strong as the nice feelings are I always hear a little voice in the back of my head (not literally, but y’know) \"this will end someday, everyone will abandon you, no one really loves you because humans are incapable of love- they'll use you to get ahead and justify it.\" Really dark, nihilistic stuff that I do really believe but try not to focus on. The sad part is how often I'm proved right- but lets not focus on that. People be dicks sometimes, but that is no excuse to not be better.\n\nMy real problem is I will allow these feelings to cause me to withdraw, I stew on it and it makes me feel more distant- and because I feel more distant I take actions to make myself more distant. I inquired after my good friends health because of current events, but he doesn't even make the time to respond. Man, we used to be inseparable- but that old chestnut of distance and time is slowly erodes the bond I see it time and time again. Now there is a part of me that just wants to delete the social media I used to contact him and make it so he can never talk to me again short of showing up at my house. The more intense the connection, the more extreme these feelings (and sometimes when I fuck up real bad) the eventual action.\n\nI know I'm crazy or something. Other people can handle emotional distance without feeling like it drives a wedge between them and their former friend.\n\nI cannot comprehend on any level how you cannot see or talk to someone for a long time, and then when you see them your overjoyed to see them. I know a lot of people are like this, but all I feel when I see my \"used to be\" friends after all that time is pain and loss so unbearable I will run away before being spotted if and when possible. If I can't do that, I feel like I'm having a panic attack the entire time while I pretend to feel normal and a mental breakdown shortly follows. Sometimes if I’m at my worst I’ll just freeze, and that will cause the connection to die.\n\nSo I know this is a problem, I understand logically why it's bonkers, but emotionally this feeling is always the same. I can change the way I respond to this feeling, actively working against these destructive impulses- but I wish the feeling itself would someday leave me. Is that too much to ask you think? A few months ago I froze and distanced someone who is probably the closest person to me outside of my GF due to this insanity, outside stressors and some very poor decision making. They were the first person I repaired a relationship with after going through this destructive cycle… and that’s good. But it should have never come to that, goddammit! I’m determined to never do that shit again, almost losing that friend was the final straw to make me stop being so fucking insane about this. I think I can handle that- but am I stuck with my brain feeling this way forever? Stuck in the reality that while I can change my actions and behavior this bizarre fear and pain will never leave me- I’ll just be really good at dealing with it? That’s something I’m prepared for- but not something I want.\n\nIt overboiled a bit today, and I realized this should be my first post to this sub. Today I worked 13 hours of hard labor and turned all the negative feelings into physical exertion, but I need a better way to deal with this than just rage… it’s the only thing that’s worked for me so far- but I’m a very “turn anger into your strength” kind of guy. A lots been on my mind recently, we’re all a little crazy due to quarantine (and I will probably keep quarentined no matter what for at least another 6 months if not longer- GF has a bad immune system). I have \"lost\" one friend to parenthood (I'm CF and yeah- when you're friends have kids you really do fade from their lives, this is probably the least made up of all my attachment issues), feel distant from my other friend because they won't respond to my concerns of their safety for the past 3 days yet has the time to fucking play games, and am getting used to some changes with some of my other social circles that make me feel a little weird- but I logically understand they are positive. I hate feeling this way. In every happy moment I'm always thinking about how painful it will feel when it ends. I feel like I can’t ever value the happy moments for that reason. When a relationship ends, all the happy memories become painful- to the point where I actively try to suppress the memories of us hanging out and joking because they aren’t happy memories to me anymore- they hurt more than any other thoughts I can conjure in my own head. I know other people don’t feel like this, most people I think value the memories of friends dead or gone, but I feel like I let the fact that “it’s over’ sour the experience. How to put it… you know the expression “It is better to have loved and lost, than to have never loved at all?” I strongly disagree. I’d rather never even have anyone in my life and live in complete isolation if it meant that I wouldn’t have to go through the pain of losing them. I know most people don’t feel that way, but I feel that SO strongly.\n\nThe only relationships I don’t feel this way about is romantic ones, at least during, because I tend to date seriously and try to find life partners. Perhaps it’s because I feel I’m working towards something permanent, whereas with friends I feel like eventually it will end. I support this claim with the fact that when a romantic relationship ends (rare for me, but does happen- my last GF who I was with 8 years for example) I fall into the pattern of what I described with the loss of friends, even actively erasing my memories to the best of my ability.\n\nOk, I should stop rambling. Point is: I would love some insight from the people of this sub. Self-improvement isn’t an overnight thing, but I’ve always at least had a direction I knew would help. On this one, I feel lost on my own. I don’t even know where to start with this problem. I can change my actions, I can be objective, but how do I stop FEELING a way I consistently feel in this pattern? Any insight you can provide me is very much welcome. Thank you for taking the time to read, and those of you who respond: thank you for taking the time to help me. Even if I have a hard time forming and maintaining connections, your time and effort is something that I appreciate very much, dear stranger.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/h8wxh9/please_help_me_with_my_anxiety_and_fear_of_loss/", "title": "Please help me with my anxiety and fear of loss.", "social_network": "reddit", "user": "donmud", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1592152339, "permalink": "/r/DecidingToBeBetter/comments/h8wxh9/please_help_me_with_my_anxiety_and_fear_of_loss/", "nsfw": false, "first_save": 1635436532.0054033, "replies_charged": false}