{"id": "t5_2tand_t3_639ahd", "request": ["311ea9af-70b8-4905-9c8c-652e4d2dd930", "9a31773a-0b18-4cff-b1f2-4e2cb034ce49"], "text": "Just had a streak of complications and nonsense happen. My invested plan for the future fell apart, and I'm back living with my parents.  \n\nInstead of sitting on my ass waiting for life to throw me a bone, I decided to move to another province with no plan other then moving in with a friend there.  \n\nChange is hard, I'm very intimidated by all this, but I'm going through with it. Sure I can stay here and eventually get prosperous with my job. But I'm not happy here. I have enough savings to take this gamble and find happiness in life.\n\nWriting all this down makes it feel more real, that it's actually happening. I can't wait around for happiness anymore I need to do something myself to find it, here's hoping this works out!\n\nI was on the right track for awhile, until the person I tied all my happiness to left. I can't have backwards progression because of one individual, after all I'm the only one who can control my happiness right?\n\nOf course I have a back up plan. I'm always planning. Although zero have worked, at least having a plan keeps me motivated to keep trucking. My current job is with the government, so I'm allowed to leave for a year and work elsewhere without losing my position and seniority. \n\nAlthough this job feels like I'm grinding my life away (it's retail) at least if I fuck this one up I have something to fall back on.\n\nAnyway that's my rant in hopefully the correct sub, just wanted to get it all organized in my head and I find this helps. Wish me luck!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/639ahd/my_life_has_been_stagnant_for_too_long_time_to/", "title": "My life has been stagnant for too long, time to make a dramatic change.", "social_network": "reddit", "user": "solcarbine", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1491250436, "permalink": "/r/DecidingToBeBetter/comments/639ahd/my_life_has_been_stagnant_for_too_long_time_to/", "nsfw": false, "first_save": 1635437890.2820833, "replies_charged": false}