{"id": "t5_2tand_t3_p7lfi1", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "ae1f8c6a-a092-4d44-9c65-df014de8e434", "b69cf201-6737-4217-b486-9096135546b8", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc", "802203c7-ca80-4c23-ad08-f571694cfc55", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": " Dear people of Reddit,\n\nI'm writing this first post looking for some insight from male strangers on my current situation. I submitted this on r/dating_advice too and waiting for it to pass the filter... (Ladies feel welcome too, but I'm particularly interested in what a man's perspective would be on this or someone who's been through similar things) I don't know where I should start. There are actually two men troubling my mind at the moment. I have a feeling this will be a lengthy one, as there are many issues with me to unpack. So thank you in advance to those who will bear with me.\n\nThe first one is in the military, we met on Tinder 6-8 months ago in a French overseas department. We both live there. I'm a teacher. He's 37, divorced, two kids (13 and 4) from 2 women, they all live in metropolitan France.\n\nBefore I elaborate on him, maybe I should tell you about my experience with Tinder and the damage done. Feel free to skip through this part until the /!\\\\/!\\\\/!\\\\/!\\\\/!\\\\/!\\\\/!\\\\\n\nBack when I was 18 I was in a relationship where I almost got married and pregnant with a (then)31 year-old man who was also a father of 2. This guy was emotionally, seksually and sometimes physically adusive and manipulative. He got me under his thumb in no time, I spent 4-5 years trying to become his ideal submissive trophy wife to have him shatter all of my self-esteem, drive, ambition, will for life. I was isolated from everyone, he had made himself my whole world. He was inside my mind. After I got out of it it took years for me to get over it, process everything that had happened, well, all the stages of recovery you can think of. The hardest wasn't forgiving him. Once I'd understood what he was and why, it became quite clear how resenting someone for being what they are is useless and futile. The hardest was to forgive myself for having allowed it to happen. For having let go of my dignity, my sanity \"that\" easily and for so long. For having jumped head-first into the madness and chaos he had instaured in my life. How eagerly I was waiting for the aduse. I was so disappointed in myself. I used to be an intelligent, level-headed and talented girl, and set in my ways too. So yeah, I have a hard time accepting that it happened to me and trusting myself with men and feelings. So I just decided not to bother with them altogether.\n\nAfter this breakup I was surprised to no longer be sad very quickly. I was actually enjoying a new improved quality of life. Without the constant anguish and walking on egg-shells. I was free! I got drunk on that. I started letting dudes from the gym pick me up. (I'd started working out, I had one month before having to see him again to collect my things at his place. If I couldn't feel strong facing him, I sure wanted to look it. Needless to say, one month of intense working out got some result but not enough to \"intimidate the sh:t out of him\" as I wanted!) Then I moved on to Tinder. I had one plan: give all of the feckbois out there the time of their lives. Now don't get me wrong. I'm generally a kind person. I never wanted to play them. I wasn't in a \"getting my revenge on the oppressor\" kind of spree at all. I just figured they were the easiest not to get anyone's feelings hurt and avoid drama. Any guy who wouldn't be on my back, who wouldn't demand anything from me apart from a great shag would do. No judgement, no justifying anything. Just good seks and laughter. I got with all kinds of dudes, eye candy or fugly. I was Tinder's unicorn. I had a great time. But then as you can imagine, another toxic pattern built up. I would only be drawn to unavailable men, which was what I wanted at first consciously, but as time went by I think I internalized that. At some point I needed to snap out of that phase.\n\nWell, it's difficult. I'm extremely awkward when it comes to natural seduction in social settings. Tinder is so convenient when you just want some instant kinky time (as a woman). But I don't see myself meeting my \"SO\" on there. I became conscious and aware of this problem and decided to take it easy, work on it one day at a time. I do want to have a family someday, I'm sure I would make a good mother. But I don't want it at all costs. In the meantime I've been working on myself, my skills, my professional and social life. I strive to be a well-rounded functional adult. Physically and mentally healthy. Now I'm used to being by myself and fine and balanced with it. I dialed down the seks crazed phase and started actually dating men but with less energy and I also have other things going on in my life.\n\n/!\\\\/!\\\\/!\\\\/!\\\\/!\\\\/!\\\\/!\\\\\n\nSo Yeah, I moved to this French overseas department last year and due to COVID and lockdown and being a workaholic, I resorted to Tinder again and matched with this military man. He invited me over at his place for a steak and wine lunch. Perfect. I didn’t get any feckboyish or kinky vibes from him, just regular guy on Tinder, so I held back on the straight-forwardness with him. When I got there my favorite band was on so it was huge green flag. I basically spent the whole afternoon singing along his SOAD’s greatest hits playlist. He is actually a great guy and we hit it off nicely. Our first pillow talk was about how he was thinking about getting a vasectomy and he can't wait to be released from his duty to get back with his little boy. So I immediately understood this was going to be very casual. But the thing is, he is not the \"casual\" type. A couple weeks in seeing each other, he wanted to have the \"what are we, where is this going\" talk. I was taken by surprise, you know, my first morning coffee sips at 6 AM, I was not prepared. He wanted to know how to behave with me in public, with PDA and such. He noticed I’m not very physical outside of seks. He is considerate and asks about my boundaries.\n\nIt’s hard not to notice, but that’s also something that comes from that first traumatic experience. (This aforementioned ex couldn’t stand me touching him, trying to initiate seks, or do anything that could disturb his sleep. And he was a napper. He was the one who did the touching, cuddling and handled the seks. He had to be in control. For example, he never accepted me to be on top during seks in our 4 years together. so I learned and internalized to not be clingy and not display affection when not solicited.)\n\nIt’s not that I’m not affectionate and don’t want to be warmer, but it’s very difficult for me. Not only because of being damaged this way through constant rejection from the only person that mattered to me at the time, but also because these are very intimate gestures that mean something more to me than just good seks chemistry, and I absolutely dread feeling vulnerable. So I can come across as incredibly cold when inside I’m actually melting. This guy has no idea how much I appreciate, respect and admire him. I try to show him in other ways and I think he gets it.\n\nAnyway, we were cruising and he wanted to put words on it. I told him I’d heard what he’d said before and that although I wouldn’t hate the idea of “going steady” with him -which is what was already happening kind of organically- I didn’t see where this would take us as we only have one or two years together before he gets back to the city where his son is. I can’t promise to be exclusive. Furthermore, I don’t mind PDA but I don’t want you to look like a fool if we’re seen together one day and the day after acquaintances of yours see me with another dude, I don’t want to cause any complicated or embarrassing situation. He said he understands, but he’s not someone who can really date “casually”. He admits he catches feelings easily and believes in it hard very fast (hence the 2 babymamas) and he also had one very traumatic experience with an abusive woman. But we like each other, let’s just live whatever we have to live and see what happens. We left it somewhere along these lines. Then things moved pretty fast, we spent a lot of time together. He met my friends, I met his. I wen through a rough spot when I was in-between two apartments and he housed me during more than a month. We lived together kind of like a couple and things went very smoothly. We’re both very respectful of each other’s space, we’re both quiet people. He cares for me and treats me better than I’ve ever been treated.\n\nThe thing is, I’m no doctor but I can tell he is depressed. I assume because of this unresolved trauma with his ex and of his 18 years in the military I don’t know much about, and maybe loneliness. I can tell he is fond of me but is not happy with me because he thinks he’s holding me back and knows we have a deadline. He thinks he’s not good enough of a lover because we don’t have the same drive. I try to reassure him on that but being the romantic cripple I am, I don’t always find the right words or moves. I feel helpless as to his depression. I’m not even sure he acknowledges it himself.\n\nI flew back to Paris for the summer and right before I left he told me he knew about another guy I was seeing (I had not seen this guy since before we started dating but he thought I had due to out-of-context texts he stumbled upon. Long story short, he thought I’d shagged a guy a couple weeks before, which I hadn’t) but wasn’t mad at me or judging me or anything. He just wanted to let me know it had been on his chest and tried to keep it to himself but couldn’t because he realized it was not something he was ready to accept and he had been thinking of letting me go but couldn’t bring himself to break up with me. I explained the situation and showed him the texts, my thought process on why I had almost given in to a seksual urge but immediately had second thoughts and called it off because I didn’t want to do something I knew could hurt him even though, technically “I had the right to”. And in my mind back then, it was not something worth mentioning to him “hey hun, almost cheated on you but didn’t, give me a cookie?” So I just kept to myself, happy to have made a good decision (or reversed a bad one) thinking it wouldn’t have been fair without having at least tried to improve my side of the problem with our out-of-synch seks drives. I’d figured I should at least try “moves” or have an honest conversation (which I had no idea how to open…I know how difficult of a topic it can be for men, an ill-brought conversation could make things worse) before looking for D elsewhere. So here I was, feeling so wholesome for weeks, even being closer to him and displaying more affection, not knowing for a second how distraught he’d been this whole time. He never let it show, didn’t treat me differently during this time.\n\nI feel like shit. I eventually managed to explain myself and show him what the situation was actually like. But it was incredibly sad. I never wanted him to feel like he was not enough. His intent wasn’t even to blame me for anything, he is just sad and it breaks my heart to see this man hurting because of me. He said he didn’t want to keep me from living my life and meeting someone. But I still want to be with him because he simply makes me feel good. I know we don’t have a future together and that holds me back from loving him and opening up to him as I should. He does me so much good, he really doesn’t realize how much. He’s teaching me what genuine love and care between a man and a woman feel like. But I feel I’m no good for him because I can’t give him what he needs and I can’t make him happy.\n\nWe “made up” before I went on vacation. We didn’t text a lot but we’re both looking forward to seeing each other again. He told me to enjoy myself and not hold myself back for him if something has to happen with someone, as long as he doesn’t know about it. And that being apart for a while will be good for us. I just got back yesterday, he’ll be here next week. I’m excited to see him and sad at the same time. I’m certain he’s taken time to muster up the energy he needs to break up with me. And if he doesn’t I’ll be the one to have to do it eventually before he’s miserable. It saddens me deeply.\n\nNow the other man I mentioned earlier, who's on my mind these days.\n\nSomething did happen with someone else during my time away that shook me a little bit. My latest turmoil and if you’re still reading, I think after this one you will have a more comprehensive picture of the depths I’m swimming in. So here I am at my parent’s place, 2 weeks in my less-busy-than-expected vacation, swiping on Tinder (My bio read something like “around the region for the holidays, first round’s on me! Beer emoticon”.) I match with a gym bro, abs-bathroom-mirror picture with no bio, conversation goes as such (roughly translated from French) Him: what are you looking for on this ap? Me: “just to get some, wbu?” Him: “Wow are you being sarcastic or is this the most straight-forward answer I’ve ever gotten?” Me: “lol I’m not here for long, no time for sarcasm”, etc. So we meet up. Up until here, nothing unusual. But from the first moment we started talking we sent each other a series of red flags and all that happened consecutively feels like a chain of misreadings and ill-conceived ideas on both parts. I’m much nicer in person than via message on social networks, I’m not good at or comfortable with the whole getting to know people via text thing. I use texts to set up IRL encounters in the timeliest manner possible. So I naturally understand when the guys on Tinder are not great entertainers either via text. So we agree on me meeting at his place at a given time. I get there, park, and call him. Get his voicemail. I stroll around waiting for him to call back because I can’t stand still and always need to keep my legs busy, and he calls me back less than 2 minutes later “sorry, are you still here, you didn’t leave did you?” and went to get me at the gate. I was a bit surprised he thought I’d leave at the first ringtone not picked up, maybe some women do behave impatiently like this, I don’t know. I hadn’t realized that, when he got down at the gate what he saw was me walking away (but I was just strolling!) Anyways. I wasn’t feeling at my peak energy but I was feeling just fine and not picking up ominous vibes. When he showed within my sight I was shocked at how attractive I found him.\n\nDamn, he’s attractive. I’m not used to being phased like that by a guy anymore. We engage in small talk. He asks whether I’m always this straight-forward, etc. I have to admit I don’t remember precisely every bit of the conversation because I was swooning over him and trying hard to keep my composure. It was also a bit late and I was tired from the day of family reunions and socializing. He asked pretty straightforward questions and I was fumbling with my words, a bit dumbfounded. Let’s say I didn’t blow his mind with my wit and smarts. I did make attempts at jokes or goofy comments but he didn’t really laugh or make me laugh in the two times we saw each other, and that’s a bit of a red flag for me. But anyways, we still had basic conversation about ourselves. He mainly talked about himself, he wanted some info out there in the known. I put my foot in my mouth when I said I felt invited to be straightforward like this with him because of his frisky picture on Tinder. He seemed to take offense and clarified that actually, he was obese 2 years ago and now he’s into fitness and he’s just proud of his abs. Oops. I’m into fitness as well and I am educated on weight loss as I made cash on the side during my student life coaching people to get fit and healthy. I also am familiar with all main channels related to the topic on French and English-speaking YouTube. But I didn’t tell him. I think all I was able to say was something like “well, dang.. Great job you look great… you don’t even seem to have loose skin” and he proceeded to show me he actually does (he had to squeeze really hard, it’s hardly noticeable, the texture of the skin is a bit different when you squeeze it but everything is holding where it should, so I think he looked great, to my taste anyway). He told me about his routine, his drastic lifestyle changes (he also practices nofap. I asked how it's working out for him and he admitted he's been on edge. I asked how about masturbating but not to porn? He said well what's the point to that? - Well you could please yourself to a nice memory or a fantasy, make your imaginaton work, idk. he didn't really react more on this), etc. He told me he’s recently single and asked about my situation. I was still trying to figure out the proper way to phrase things with him. I failed and he assumed I am “cold-hearted” with the guys I’m seeing. I tried telling him that it’s not as simple as that but I wasn’t good with words that night. I got another red flag when I felt as though he was asking questions already having a preconceived answers and just listened to the cherry-picked bits that confirmed what he was already thinking. I brought up in the conversation how I grew up abroad, I’ve travelled a lot, etc but he didn’t express too much interest in this. So we talked a bit about politics and science, but even then I didn’t have the energy to go passionately into these conversations. So we moved on to the bedroom. I always, always get the surprised reactions after the first time I have sks with someone. I have no idea how things go down with other women, but apparently I am way better at it than I seem. Maybe I look or behave very vanilla, and I don’t initiate it nor act in a sexually arousing manner until I actually have a guy’s hand on me. But once I’m started I’m not easily stopped. So we had an “exceptional” time (his words, I’m not giving more details you get the picture, not here to brag) and after we were done he was verbal about how pleasingly surprised he was, how I’m nothing like I seem IRL and behind a screen, this was very unexpected, etc. He noticed as well that I’m not cuddly or kissey but asked for cuddles afterwards and I was more than happy to oblige. I was on vacation but he was working full-time weeks, so we were able to see each other once again after that and it all went as well as during the first time. But then, he didn’t go out of his way to see me again before I left even though I hit him up a couple of times (very politely and at decent hours). This felt a bit hard on my ego but it was fair and I understand why.\n\nI live 10k kilometers away from him anyway.\n\nHe's on a grind and needs no distraction.\n\nI’m pretty sure he has me marked under the label “freaky cold-hearted nympho” and chalked off the \"girlfriend material category\".\n\nJust like me, he is not the texting type. There’s nothing I can do to convince him I’m something else than what he assumes. I didn’t have the opportunity I wanted to show him what I’m about and I feel stupid I acted this way. How could he not get the wrong idea? The only thing I could do and did, was leave him a vocal message to let him know I really enjoyed meeting him and all of his company, that I was sorry we couldn’t see each other again before I left, but was looking forward to hitting him up - with his permission - next time I’m around. And wished him all the best and to keep grinding. I felt like a 14 year-old recording it, but I figured no matter what his intentions were, he would be happy to hear this, hoping to hit him in the right place and at least I could contribute to making him feel confident about himself. He indeed seemed glad, he replied instantly in the same manner, it was likewise, etc. I shouldn’t hesitate to hit him up, and depending on his dating situation it will be a yes or a no.\n\nI can’t stop thinking about him. I hardly even know him, I am aware this is pure infatuation but I can’t help it. I also think it has to do with pride or ego. This is the first guy I meet in a while that I am actually physically attracted to, who is single, childless, perfect age, good career, good education and manners, etc. He’s the whole package and I’m not getting it. This really leaves me a bittersweet taste of unacomplishedness, of missed opportunities. Like I lost something I never had.\n\nA part of me wants to pursue him but I don't know how to go about it. He's obviously not interested in keeping in touch in the meanwhile. We didn't even exchange our social media. So I'll just have to wait until next summer and see how I feel about it after a year.\n\nSo there, I’m done with the storytime. Now I’m left with all these questions that harass me daily. How do I break out of my toxic cycles? Do I still have time?\n\nI always get stuck in this zone. I’m the girl you’re glad you met and remember about but never contact again, I’m an experience, a fantasy fulfilled (physical traits)\n\nEither that or “we would have been great together if the circumstances….”\n\nHow do I get my stars fricking realigned?\n\nHow do I let go of the fear that keeps me from actually trying with the worthwhile ones?\n\nHow do I overcome my fear of projection, or of toxicity and codependency?\n\nWhat should I do about my steady military guy? Am I allowed to be selfish and stay with him when I know he will end up hurt? Am I responsible for his feelings in this way? Is it so bad that I'm using him as a therapeutical relationship? Is he better off without me? Do I have nothing to offer him, even if just for a pre-limited amount of time that is worth the temporary pain of the break up?\n\nWell, this wasn't easy for me to get out on paper. I apologize for the bad writing and thank you if read me until here and understand or share part of my struggle.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p7lfi1/27f_struggling_to_learn_how_to_function_on_the/", "title": "27F struggling to learn how to function on the love and dating scene after trauma and years of bad decision making", "social_network": "reddit", "user": "vademecum976", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1629400245, "permalink": "/r/DecidingToBeBetter/comments/p7lfi1/27f_struggling_to_learn_how_to_function_on_the/", "nsfw": false, "first_save": 1635435092.0280259, "replies_charged": false}