{"id": "t5_2tand_t3_jotvc8", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I live a very comfortable life and have been very complacent lately. My job is good and I do not struggle to pay bills. I am slowly trying to improve myself outside of work by eating healthier, working out and setting small goals. Slowly, I am improving but I feel like my job is causing me to get back in a loop of being unproductive. \n\nI work in a small dark room with a bunch of screens and my job is very heavily reactive rather than proactive. Because of this, I tend to have a lot of down time at work causing me to waste time looking at social media, YouTube and anime. At first I liked having all this time to watch all the stuff I enjoy while getting paid but now after two years I feel as unproductive as ever. The pandemic has made it even worse since I’m a lot more antisocial now and when I talk to strangers I feel like I have no value to offer but just stupid social media stuff, YouTube and anime. \n\nI want to become smarter and learn more skills that I can be proud of instead of the bullshit that’s completely overriding my mind now. Bullshit is fine sometimes but to the level it is now that my brain is taking videos of the 10th random YouTuber’s reaction to one of my fav episodes of whatever the fuck in order to pass time really can’t be good for me, as fun as it may be at the moment. \n\nI’m open to reading books, I want to learn about things but I don’t know where to start. I want to watch/read something cool about history or society. I want to watch a fun show/documentary to teach me about random shit. I want to learn a skill where I can take courses online and become good at it. I want to fill my head with more shit that inspires me. I feel like I could be learning something cool but I don’t know what that thing is. I don’t really know know what I want to get into. So what can I get better at? How can I use this time to improve? Is there anything you recommend I teach myself and get really good at? \n\nSo far I have this cool geography app where I am learning where every country is in different parts of the world. That’s some cool fun knowledge to know. That’s one step in the right direction for me but I would appreciate more suggestions and ideas of different things I can do with this time. \n\n(Also, before you think I’m lazy and don’t do my job, my job solely relies on being reactive to problems that arise and there has been less and less problems because of COVID. I also do my work as soon as I get it and don’t normally take breaks between tasks causing me to have a lot of downtime when I’m done.)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jotvc8/24m_with_too_much_time/", "title": "24M with too much time", "social_network": "reddit", "user": "PUMPFISTS", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1604619569, "permalink": "/r/DecidingToBeBetter/comments/jotvc8/24m_with_too_much_time/", "nsfw": false, "first_save": 1635436041.5159376, "replies_charged": false}