{"id": "t5_2tand_t3_m8bsfc", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "I am struggling to move on. I have been in therapy now for 6 months going once a week. My therapy has helped my anxiety and depression.\n\nBut now I have developed a deep rooted fear. This fear is larger then any I have experienced in my life and thats why I am struggling so much. I continue to try and unpack it and feel better but I feel no progress mentally. I am still stuck.\n\nThe fear is that of being hurt again. The fear of pouring my heart into another person like I did and the outcome of them leaving me. I have anxiety and likely an anxious attachment style which is probably why I put my ex on a pedastal and poured my heart into her. Its unhealthy yes and I need to work on that but my biggest focus is this fear I have now. The thought of dating and opening myself up makes me more terrified then anything I have ever thought of honestly. I have been unpacking it but I still fear deeply. \n\nI am young and have a whole life of opportunities ahead but a part of me feels I may just be alone out of the fear. Then another part of misses intimacy and misses being with someone and all those facets. But the fear outweighs the latter. \n\nMy original story I detailed what happened and yes it was from my perspective but I tried my best to just say it how it was. I was left being blamed and I understand I made mistakes but I never wanted to give up on her or us. Since breaking up 7 months ago I have been in No Contact because she cut me out of her life and acts like I both never existed nor exist now. This hurts me so deeply because I have never been cut out of anyones life and the honest to gods truth is that the pain she experienced I never intentionally caused and when it did happen I beat myself up mentally so deeply that when she was blaming me I was very close to taking my own life. I felt so bad for the pain she was feeling and I was beating myself up just as much as she was blaming me. This feeling still comes and goes where I feel deep regret and remorse, and the worst part of it is I feel like I would die to try and fix this issue, I would bleed, sweat and give all my tears, and yet I am left with an inability to do that because I want to respect her own wishes when she asked for no contact to heal. \n\nHonestly I cry just at the thought while writing this about being hurt again when I tried so hard and poured so much love and vulnerability into the relationship.\n\nBelow is going to be a link to my original story. \n\nHow can I move past this fear? How can I live not thinking about her and the regret I carry?\n\nTLDR: I still love my ex, I developed a deep fear of possible heartache, and every day is a struggle in some way because she cut me out and blamed me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m8bsfc/i_want_to_be_better_but_i_am_struggling_i_need/", "title": "I want to be better but I am struggling. I need help.", "social_network": "reddit", "user": "MissingPossum", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1616138549, "permalink": "/r/DecidingToBeBetter/comments/m8bsfc/i_want_to_be_better_but_i_am_struggling_i_need/", "nsfw": false, "first_save": 1635437548.4588552, "replies_charged": false}