{"id": "t5_2tand_t3_44a3rr", "request": ["8461abc5-2740-47d4-9b1f-f9a34c328cd4"], "text": "I have a book to recommend to depressive pessimistic types that indirectly helped me to become better when I was afflicted by depression. It's not your typical book, it's a collection of short diary entries called: \n\n**The Book of Disquiet by Fernando Pessoa**\n\nA word of caution though, it is not a rallying or uplifting book (so you shouldn't try it unless many other books haven't helped). I would say that it is a *seemingly* very depressive, nihilistic book, *seemingly*. Having read a lot of self-help books in my time, I feel justified making the outrageous claim that it is **the best self-help book ever written**, simply because it paints the world's most elegant picture of a man dealing with his perpetual despair, emptiness and lack of direction; covering many random but significant elements that most men have come across yet been unable to express. \n\nSome quotes:\n\n>As we wash our body so we should wash destiny, change life as we change clothes. \n\n>The beauty of a naked body is felt only by the dressed races. \n\n>Civilization consists in giving something an unfitting name, then dream about the result. And indeed the false name and the real dream create a new reality. The object really becomes another, because we turned it into another one. We manufacture realities. \n\n>The consciousness of life's unconsciousness is intelligence's oldest tax. \n\n>Being a retired major looks like an ideal thing to me. What a pity you couldn't eternally have been just a retired major. \n\nI'm not advocating that we should look down on this or any other man to silently judge your worth more favourably knowing their despair and empathizing with their total lack of motivation, but I want to note that humans have a peculiar way of absorbing information through contrast, envy and myth that is not fully understood. It really is the elegant presentation of the every little bit of content that makes me recommend this book. \n\nThe book grips you with its prose, which is something I identify with as lover of books, but then something special happens when you feel your feelings understood and expressed clearly in the content -- you can actively move away from depending on those feelings, you can peel yourself away from being oppressed by them. \n\nI advocate the age old tactic, pessimistic because of intellect, optimist because of Will.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/44a3rr/an_unorthodox_book_recommendation_for_pessimistic/", "title": "An unorthodox book recommendation for pessimistic and procrastinator types.", "social_network": "reddit", "user": "foresculpt", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1454664012, "permalink": "/r/DecidingToBeBetter/comments/44a3rr/an_unorthodox_book_recommendation_for_pessimistic/", "nsfw": false, "first_save": 1635436338.1626763, "replies_charged": false}