{"id": "t5_2tand_t3_p9r5w5", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "Exactly 3 weeks ago today my fiancé broke up with me via text. He said he was going through mental health issues and needed to focus on himself. Is it true? I have no idea but he did confide in me previously about his mental illness so that part is true. We were together 3 years and the break up was sudden. I was shocked, angry, sad and anxious but finally I feel like I can breathe properly again and focus on my upcoming goal I’ve been working on for a while: moving to Japan.\n\nI accepted a job offer in Tokyo back during the beginning of the pandemic (April 2020) and Covid pushed back my departure date from July 2020 to September 2021. I’ve been patiently waiting while working my crappy college job to keep me afloat and pay bills but finally got government exception to come over for work. Got my visa application approved and visa in my passport!\n\nThe breakup had me down and mildly depressed for about 2.5 weeks. However over the last few days, I’ve been eating better, leaving the house more and even began packing my bags for the big move. I even found an apartment I liked and will sign the lease and put the deposit down while I’m quarantining in Tokyo. Im super excited for this new chapter in my life even if it is without him and I cannot wait to make plenty of new memories!\n\nSorry if this sounds braggy but I’ve been down and out that finally I got a glimpse of clarity and feel genuinely happy and proud of myself for doing this and making it this far.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p9r5w5/fiancé_broke_up_with_me_and_im_moving_overseas/", "title": "Fiancé broke up with me and I’m moving overseas soon", "social_network": "reddit", "user": "itsabubblylife", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1629688155, "permalink": "/r/DecidingToBeBetter/comments/p9r5w5/fiancé_broke_up_with_me_and_im_moving_overseas/", "nsfw": false, "first_save": 1635436453.2683318, "replies_charged": false}