{"id": "t5_2tand_t3_kpyb88", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "114bcb12-fed9-47f6-9822-139ba09eebbf", "5d0f6d96-af53-4a9d-aba2-c5967c631e40", "f29068b1-c751-4543-b3a6-9d58b1182ab7", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "* in other words, tone the anxiety down by understanding the fact that it's an illusion because:\n   * you are **working towards something** .yes , *\\*things might look bleak right now*\\* **but you fool yourself when you lose sight of the fact** that **TEMPORARY** situations don't define your reality\n   * i told myself today that if i have the energy to worry about bullshit, im distracting myself of energy to worry about what really matters: what i want and my work to get there.\n   * **every thought wasted on negativity is another thought that could be spent on  improving yourself** or do what you need to do to get where you want: there is no excuse (not literally, but it's good to tell yourself this lol)\n   * ***and remember. y****ou can't be ambitious or productive* while focusing on **what you cannot contro**l.\n      * Therefore, the past is **IRRELEVANT and don't beat yourself up** for it. being ambitous and productive------> **DIRECTING ur FOCUS ONLY on what you CAN control(present & future).**  Hope this helps.\n   * \\--------------------------------------------------------------------------------------------------------------------\n\n**about me :**  *it's long- sharing my story solely to talk about where i'm coming from. if it's long,  please just don't read  & skip it lol. main points are* **first & last 3 bullets**. *sorry if there are typos- Took forever just to write this out \\**\n\n* I'm a 26 , currenly living in my car as a result of father accusing me of doing something which I did not do & consequently kicking me out right before he went back & told my mother 'I have one last chance\". sleeping in my car because I don't think the conditions which I have to meet for his\"once chance\" after being (falsely accused)  are fair since they include not speaking to my younger brother when he does something that negatively impacts the living conditions of others. i brush my teeth, cook,  etc at home but sleep in my car & apply for jobs in the library to escape from a lot of intergenerational trauma.I come from a really broken and dysfunctional home y'all would never know.\n* I dropped out of Cornell University  (yes, the one in Ithaca, New York) where I got in after transferring from community college. Didn't have to report SAT scores to get in as a transfer, also not URM nor a legacy. I went there against my own will, because that was the only way I was going to receive help from dad to have undergrad paid. Throughout undergrad, I knew very little about being financially indepndent  & had little confidence in doing so because I've always been taught (And witnessed others doing) completely the opposite.  Once I was 25, obviously I knew all of this was essentially fabricated lies told by dad to use me as a prop to cater to his narcissitic desires. HE literally stopped speaking to me at 13 just because I didn't dress the way he wanted and never said a word to me after that (until I got help for him to pay for my college in exchange for him controlling my academic career)  unless the subject matter was about the bare minimum.\n* I dropped out of Cornell because while it was a great school , i was sent there to fulfill my parents' dreams, not mine. not only that, I was doing horribly in the field that i was \\*sent to major in\\* , which wasn't because of the school but rather because I have always been   made to major in something entirely different. Excelled in AP social science, read presidential biographies & history books for bed time when I was a kid. Tried doing an internal transfer to change my major, couldn't do it there b/c of my transfer status. Because I was barely getting by in studying a major that catered to my father's desired career outcomes for me at the expense of destroying my own career goals, I was really scared about my future. Again, I had very little faith in myself of being financially independent & didn't know I had other options. So I had panic attacks every waking second unless I was listening to a lecture or sleeping...I feared for my life, woke up every morning during the last month screaming. So I left. Once I left, things got a bit worse: for months, I couldn't sleep, I couldn't formulate sentences, I couldn't speak, I couldn't comprehend what others were saying to me..my existence felt surreal. I felt like I was in a glass cage, because I coudln't even interact with the world around me as I couldn't speak nor even recall what even those in my immediate family were saying to me for MONTHS.\n* The craziest part is, before all that, I recovered from from having 5 years worth of depressive episodes that took place as a result of my dysfunctional home environment. In the face of statistics reporting the outcomes of those who come from where I come from, I was on track to graduate college in 4 years right after high school. I was not addicted to anything. I didn't care about boyfriends and never had one for that reason . I spent my weekends either studying or hanging out with good friends who cared about me. Not only did i  manage a solid academic performance, I stayed away from bad substances & bad people, in addition to not experience a single mental illness for 3 years. I volunteered every weekend. I struggled with feeling like shit all through my childhood because of my home, but for the first time for 3 years I COMPLETELY  forgot what it was like to be depresed. Then it all changed once I allowed my father back into my life, and once he exploited my financial vulnerability by forcing me into something that wasn't beneficial to me nor my career. He took advantage of the fact that  from a young age,  he stripped any confidence I could ever have in financing college on my own by lying to me (for 10 years) about what my future would be like if i didn't listen to him. and while I was depressed when I was younger, for the **first time in MY LIFE**, I was diagnosed with 3 mental illnesses at once. for the first time in my LIFE, I couldn't speak, read, write, or hear for MONTHs. for the first time in my LIFE, I was diagnosed with a form of bipolar disease. a**nd it all happened because my father re-enetred my life** (after cutting me off at age 13)  , for which he only even did upon me basically agreeing to allow him to vicariously live through me by being the kind of daughter to do what he told me he always wished he had done,  but did not do. **I allowed this because (at the time) I wasn't familiar with how to do it on my own.**\n* Once I was able to speak , read, write, and listen again, I transferred to UT Austin because they had the major I wanted to study which I also needed for my career. UT is also where I wanted to go since childhood. Dad agreed to UT this time, & I bought into him guilt tripping me (big time) for certain things, so I was still under his control. I remember how scared I'd feel whenever he'd call. Although I regained my cognitive abilities, I still struggled with a daily 8 hr (per day)  addiciton to scratching my hair and talking to men on sex websites. That's because the relationship with my former close friends dwindled when I returned home & couldn't speak hear etc for a few months. Despite being an extrovert and a former social butterfly, I never made many friends at UT because I'd spend 4-6 hours a day after class scratching my head. When that addiction was over, I had to catch up on what I was behind on as a result of scratching my head. I always prided myself on valuing myself based on personal traits, but it was hard to love myself for my pesonality & intelligence when it's like those things became deeply scarred after feeling like shit at Cornell. So it was much easier to just talk to people on the internet who would give me attention when I needed human contact. For the previous 20 years of my life, I've never been addicted to anything. These addictions literally arose (FOR THE VERY FIRST TIME)  after I was exposed to certain experiences at cornell which only occurred as a result of allowing father into my life . Anyway, despite struggling with a minimum of a 56 hour weekly addiction, being starved most of the time (dad didn't like me eating out on his card etc..wanted me to cook which was hard to do as an addict) , and living in my worst nightmare (living in an apartment with cockroaches for three years..roaches scare the fuck out of me ),  I didn't obliterate my academic career/grades which declined pretty signficantly from the 4.0 I maintained before speaking to dad again. Despite all that, I still have a GPA that would allow me to for either gain admission to elite law schools (including cornell) or obtain signficant scholarships to anywhere else granted that I kill the entrance test to get into law school.  By the way, the sole reason I mention \\*elite\\* law schools is to refer to what is still on the table for me DESPITE what i've been though in hopes of inspiring.\n* Recently  graduated with a degree in political science in September.  Took an honors course last semester,finished my last 3 semesters with university honors . didn't settle for the easy courses- took some of the most rigourous  reading and writing intensive courses of my major each semester. Was told many times by a professor (who did some research for the Supreme Court) that he thought I had a lot of insight about the law and was really surprised why I didn't get like A's on the tests, and a few former study buddies who I took that class with & whom are now in law school told me the same thing.  remember him e-mailing me a extra judicial opinions (outside of class work )just to get my opinion about them after I spoke to him in office hours about assigned reading material . It was because when i wasn't in class I was scratching my head lol which i didn't say.\n* Since graduating, I have spent a few hours every day journaling and have done so for month.  Before i transferred to college, I was not addicted to anything, nor did I really have any mental illnesses, both of which changed once I resurrected ties with my father again.\n* I've been spending tons of hours journaling and rewiring my brain to unfuck  myself &  unlearn whatever i learned by allowing my father back into my life again. THis is an effort to regain core beliefs & the strong sense of self that I had which  allowed me to succeed before I started speaking to him again. I know that I will never completely feel the same and nor is that my goal. I have simply been journaling & rewiring my brain not to go back to the way it was, but rather to regain control of my mind in general. So far, it's done wonders for me.  Since graduating, i have gotten rid of both addictions which i used to do 8 hrs/day every day . Unfortunately after I regained the stamina I needed to move on with my life, the next few months  were spent literally playing police officer to look out for my parents for all the B.S. that my siblings made them go through every day. In doing so, I was accused of doing something I didn't do, got kicked out but am cool with that because instead of spending every day staying in a broken home simply to look out for those in it who don't care about mine, I can finally focus on myself again. Unless they kicked me out,  I was just too concerned for my parents to be occupied with anything other than defending them against my siblings' bad behavior towards them in their own home. I've never really gave a fuck about what my siblings used to do and have always been career driven, but again that changed once I became more sensitive in general as a result of the mental health issues I experiences as a result of resuming contact with father.\n* so here i am, a recent college grad who was also regained her sense of self & has stopped the adictions that were plaguing her for six years. I've unfucked myself of the false narratives my father made me believe about myself. I will never be the happy go lucky person I was before my I was exposed to traumatic experiences against my own will, but I am an optimistic person who has clarity and control over my mind now. currently unemployed & sleeping in my car. I have financial goals i want to take care of: having my own place (in my favorite city with my favorite pet) , emergency savings, advanced rent, etc that I'm excited to obtain. Once im secure those and unless i change my mind, I plan on going to law school and financing it myself to graduate with minimal debt. Since my dad controlled the college career I worked so hard in high school to even obtain without any of his help, I am going to rewrite my narrative and control the next phase of my life, which includes being the best godamn law student at the very best school i can get into since that's what i wanted to at age 15. I help myself manifest this by keeping my favorite books with me at night, including pictures of my favorite U.S presidents as I wanted to be one of them at the age of 8  and still do.\n* I have to remind myself of this post  because  I don't care how crazy it seems,since  it was crazy for me to have:\n   * even got into cornell as a non URM, non legacy given where I came from\n   * re-enroll as a full time student at university just 3-5 months after I couldn't speak, listen, read, write, or concentrate after experiencing montths of constant panic attacks each day for MONTHS\n   * even graduated UT as someone who was CONSTANTLY ADDICTED  to something when she wasn't in class, eating , or sleeping  while still having the GPA to get into top 10 law schools (I literally only mention TOP not to say that I will go there, but to show what is possible for me to achieve despite what i've been trhough to inspire others)  ..\n      * while also taking the most rigorous reading & writing intesnive courses each semester..while taking those courses and being told by a professor in those courses that I was able to speak about the law intelligently & come to class well prepared, etc...\n   * even graduated UT as someone who was even graduated UT as someone who was CONSTANTLY ADDICTED  to something when she wasn't in class, eating , or sleeping; even graduated as UT to someone who most of the time was starved of food, even graduated UT as someone who didn't have a car, as someone who didn't have more than 3 friends each year, and as someone who lived her worst nightmare for 3 years by living in an apartment with roaches.\n   * gotten rid of my addictions, gained independence by telling father I will be making my own decisions from now on, & unfucked myself of subconscious beliefs that allowed what is stated in the above bullets to even occur", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kpyb88/i_started_getting_anxious_because_theres_a_huge/", "title": "I started getting anxious because there's a huge disconnect between where I am right now versus where I want to be. When this happens, remind yourself of what life will be like if you keep going, and that the anxiety is an illusion since you spend ur current life working towards your future life.", "social_network": "reddit", "user": "Cat_Eyed_Goddess94", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1509, "down_vote": 0, "creation": 1609724816, "permalink": "/r/DecidingToBeBetter/comments/kpyb88/i_started_getting_anxious_because_theres_a_huge/", "nsfw": false, "first_save": 1635435090.392163, "replies_charged": false}