{"id": "t5_2tand_t3_kz2968", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "I am at my worst point mentally and it's time for some change, but I don't even know where to start. \nI've been struggling with anxiety and depression since I was 11 and throughout my teenage years I isolated myself, even eating lunch behind the school building in high school. I had friends, but my parents were extremely strict so I avoided hanging out with them due to the anxiety of getting in trouble for being out of the house. As such, I turned to video games and youtube as comforts. When I turned 13, I started working and completely withdrew from being a teenager, I wanted to be perceived as older. When I was 16, I began working full time and left high school to go to community college. It was around this time I became extremely dependent on altered mental states and I wholeheartedly threw myself into drug addiction. In spite of this, I was still able to perform well at work and school. I moved out at 18 and ever since then, every waking hour I'm off the clock has been spent high and I feel fucking disgusting. \nI lost myself somewhere along the way and I'm not sure how to repair what I've broken. I mourn the loss of my teenage years, while others were off hanging out with friends and making memories, I was working. \n\nNow, I'm in a pretty good place financially. I'm 19 and have around 10k in savings with my own apartment and car and I'm set to graduate college next year with a bachelor's in Applied Linguistics at the age of 20. Hell, I know I'm smart enough to get a Master's if I can get myself together. On paper, I've got it all together, but I am a shell of my former self. I've been coasting off of the \"gifted kid\" thing for so long I don't even know if I can genuinely try at anything. I hate school and I hate work, but what I hate more is confrontation, so I'll put up with them because it's easier than quitting.\nEvery day I'm just sprinting for the finish line, the time when I can smoke a few bowls, mentally numb myself, and binge eat. I spend all my free time eating to excess, watching YouTube, and smoking weed. I have been doing this every day for over a year now and every morning I wake up feeling ill due to the overeating. In spite of this, I'm extremely thin and gaunt looking. I used to be very physically fit as I used to play a lot of sports but when I began working, I quit all physical activity. \n\nI feel so old and so gross. I can't relate to anyone anymore (especially not those my own age) and I spend much of my time just thinking about the state of my life while doing absolutely nothing to change it. I just watch every day as I am eaten away by my vices and by my commitments. I feel perpetually bitter as I see others praised constantly for very little while I've been working my ass off for years and nobody gives a shit. I want to be young again, I want to feel young again. But when I come home from work, I have nowhere to go so I stay in my apartment depressed. The anxiety of being alive is absolutely crushing and every day I worry about how this lifestyle could effect me permanently. I know I should seek therapy, but I'm not sure where to start. While I feel as if I've set myself up for a reasonably successful future, I'm afraid that my lifestyle will eventually come to a head and the house of cards will collapse. I feel like my entire life I've just been trying to get to the \"next step\" because it'll make me happy and now I'm realizing I missed out on a lot of opportunities to be happy and I don't want that trend to continue.\n\nThanks for reading this, if you did. I could really use some help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kz2968/ive_hit_rock_bottom_mental_health_wise/", "title": "I've hit rock bottom mental health wise", "social_network": "reddit", "user": "Yukon27", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1610869732, "permalink": "/r/DecidingToBeBetter/comments/kz2968/ive_hit_rock_bottom_mental_health_wise/", "nsfw": false, "first_save": 1635436868.564437, "replies_charged": false}