{"id": "t5_2tand_t3_n7nu16", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "**Good - Simple, easy, effective**\n\n1. Make bed right after waking.\n2. At least one walk outside every day.\n3. Send one compassionate/thoughtful/kind message each day. Super uplighting and enriches relationships.\n4. Clean for 15 mins right before bed so less screen time and house is clean when you wake up\n5. Read one positive/motivating thing every day.\n6. Have a dedicated mental reset time at lunch of 5 PM because you'll veer off course during the day.\n7. Task blocking. Put dedicated time on calendar where you only work on one thing. Context switching is horrible for human efficiency.\n8. Scheduled recharge/free time. It won’t happen if you don’t reserve time for it.\n9. Separate big chunks of different work with physical activity. Eg 4 hrs of homework, quick walk, then cleaning/errands. It refreshes the mind and will keep you from burning out.\n10. Start every single day with 5 minutes of exercise, journaling, reading, and meditation. It doesn’t sound like much but it will start each day on a positive tone that builds momentum.\n\n**Bad - Things to limit or monitor**\n\n1. Track the biggest source of stress each day. Anything that is the top of your list for more than 3 days needs to be handled ASAP because you pay its emotional tax every day.\n2. Pay close attention to what music you listen to and how it makes you feel. If your music makes you feel anxious/depressed don't listen to it while you work.\n3. Pay attention to what things you do to distract yourself or avoid work. Social media, food, porn, etc. You can get tons of time back by culling those.\n\n**Ugly - Uncomfortable truths but game changers if used properly**\n\n1. Try things before you feel ready. You’ll never feel ready but you’ll learn from trying.\n2. Finish things before you feel done. You’ll never feel done but done is better than perfect.\n3. No zero days. Even if it’s a tiny step make sure every single day moves your goal forward. Once you start quitting it’s hard to stop. Small steps add up.\n4. All work needs to be visible (kanban board or similar). Check it every day because it will become very obvious if progress isn't being made, and prevents WIP from getting stale.\n5. Think about yourself less. Everytime you meet someone ask yourself what you could learn from them (changes perspective, reduces friction, more constructive attitude)\n6. Adequate sleep is critical, low carb diet, plenty of water etc\n\n**Further reading**: If this post resonated with you then I highly recommend The Book of Joy by the Dalai Lama and Desmond Tutu. Why? Because I think you’re like me and you focus too much on the productiveness of your life and not enough on the quality of your life. This book taught me how important meaningful relationships, gratitude, and compassion are. Those should be your goals, not productivity. Do you feel like something is missing? Then doing the same stuff faster probably isn’t the answer. This book can show you what you’re missing. The audiobook is fantastic because the authors are best friends and their stories/teasing/banter is endearing and hilarious.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n7nu16/19_essential_productivity_habits_and_better_goals/", "title": "19 Essential Productivity Habits (And Better Goals Than Efficiency)", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 43, "down_vote": 0, "creation": 1620475516, "permalink": "/r/DecidingToBeBetter/comments/n7nu16/19_essential_productivity_habits_and_better_goals/", "nsfw": false, "first_save": 1635437315.3871794, "replies_charged": false}