{"id": "t5_2tand_t3_q79d3j", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "c67213dc-0eed-4cac-a781-9bc082742908", "c6df14ee-195b-4e9d-8032-7cca73d46fe8", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "The title really says it all. Notice how I said \"content\" and not happy? The reason for that is because happiness is temporary but contentment is something that can last much longer. As a young adult who has been through some really traumatic shit, that is what I have realised about life. That no matter what the situation is, no matter how awful it is, no matter how many people is in your life, you have to remember that you ALWAYS have you. And it might sound sad but the reality is, there is so much power in that.\n\nBecoming content with yourself is a hard journey to go on, especially when it seems like the world is against you or you have been dealt a shit hand at life. Bad stuff will always happen and you have no control over that but if you have a good solid foundation of understanding within yourself, it will make a huge positive difference when bad times do happen. \n\n\nSome things I have learned:\n\n1) Loneliness is a massive thing I have personally struggled with. Being alone can feed your negative thoughts and like anything, can be harmful in large quantities. Being able to find peace in being alone is  crucial and if you can be okay by yourself, you can do absolutely anything. Part of tackling loneliness is ultimately down to your own personal development and I have found that the more work I have done within myself, the easier it has become to enjoy my own company. \n\n\n\n2) People will always come and go, that's a lesson I had to learn at a very young age. You can't go your whole life using people as a shield or a safety blanket. Understand that you are the main character in your life and everyone else is a temporary secondary character. I'm not saying don't bother to make friends or relationships with others because that's also important in itself. But learning to be independent and do things by yourself, will not allow other people to hold you back and you won't feel stagnant in your life.\n\n\n\n3) Don't rely on others to make you feel better or for any form of validation, self love can go such a long way. And I don't mean bubble baths, scented candles, face masks and wine. I mean true self love. Where you hold yourself accountabe for your own actions, where you do the things that you've been procrastinating, where you eat healthy because you know its good for you, where you tackle your anxiety head on by going outside by yourself. No one said it would be easy but in doing all of these difficult things, you will make you feel 10000 times better by taking a proactive approach. \n\n\n\n4) Feeling negative things is a good thing! When something bad happens to you, it's okay to feel depressed and hurt. It's okay to get angry, its okay to cry, it's okay to break down. It okay to feel feelings. I don't think many people actually understand that in order to let go and move on from something, you need to allow yourself to feel your real emotions and not let pride stand in your way (because sometimes the problem is you/your actions!). And of course, everyone would avoid negative feelings if they could but the reality is that if you push those feelings down, I can guarantee you that they will resurface at some point down the line and it will be a bigger mess to clean up. \n\n\nThe main thing is, is that you have to genuinely WANT better for yourself. Not just like the idea of becoming better, doing it as a comparison to others or bullying yourself into becoming a better person. But really, really want it. It's only then when you can make the life changing decision to work on yourself. While working on yourself, you might find that there are many parts of you that you don't like and that's okay. That's the whole point of personal development, it's recognising what needs to change.\n\nThe main thing to remember is that as long as youre living and breathing, you are the ONLY consistent factor in your life. Make sure that that the only consistent person in your life is content with person they truly are and the life you have built for them.\n\nEDIT: Thank you for the awards kind strangers!\n\nEDIT 2: I never expected to get such a positive reaction to this post, people commenting saying that this has helped them is absolutely heartwarming. I'm moved that I have been able to help people by simply typing my thoughts onto a screen. Here's to unapologetically becoming your true authentic self.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q79d3j/the_key_to_self_improvement_is_learning_to_be/", "title": "The key to self improvement is learning to be content within yourself", "social_network": "reddit", "user": "ghhhptj", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 678, "down_vote": 0, "creation": 1634125513, "permalink": "/r/DecidingToBeBetter/comments/q79d3j/the_key_to_self_improvement_is_learning_to_be/", "nsfw": false, "first_save": 1635435334.4011412, "replies_charged": false}