{"id": "t5_2tand_t3_8nrn5j", "request": ["b1a66ef4-3e71-4d03-875c-961dbcef2285", "cbd1933a-caaa-464d-8e4c-373318982c62"], "text": "This morning, I woke up happy.\n\nI've been struggling with depression for, gosh, it seems like forever. It's been at least a year and a half of very deep depression, but it's been part of my life for at least 4 years. The intensity waxes and wanes, but it's been very very bad for about 5 months. \n\nI've tried SO many things. I've learned SO MUCH about myself; made an enormous amount of progress towards untying some of the habits of thinking that have kept me stuck; learned that my feelings are just sensations in my body that I interpret as emotions, and that I don't need to buy into them or DO anything because of them. I've gotten pretty deeply into spirituality. I've learned to accept things I cannot change. I've changed my entire diet. I've gotten on a regular exercise regime. I've read EVERYTHING I can get my hands on about depression and anxiety and tried everything I could try. \n\nAnd still, happiness eluded me.\n\nI'm not even talking about generalized happiness. The sensation of being even briefly happy over the course of the last several years has been so muted that it barely registers.\n\nBut today, I woke up happy.\n\nThis used to be how I'd wake up every day\n\nI wrote out the exact sensation in my body, just in case today is a complete fluke and I can't remember how it feels in my body. I thought I'd share it for anyone out there who is struggling with this as well. \n\nIt's a trickle of excited energy that comes from my left side of my chest (as far left as the edge of my arm pit, as far right as the edge of my sternum). It radiates up to my throat, which feels a bit tight, and, if I follow it further, touches on my ear drums (the muscle that you move to dampen sound) and up to the top right sinus cavity above my right eye.\n\nIt radiates out to the spot on the underside of my elbows near my funny bone, and to the lower inside corner of my hand.\n\nIf I turn my attention to my back, it radiates out my shoulder blades and (a bit more generally) out my low back.\n\nI can feel it in the left side just below my ribs, which can be activated when I hold my breath or tighten my abs. That, then, amplifies the signal down to the outside back of my knees, and to my toes, which really like to be pointed right now. \n\nI don't feel it in all these places at once. It's more like these are subway stops and there are trains running to each place, so I feel the energy more strongly in those places when the train stops there briefly.\n\nIt has a specific frequency, a thrumming, that peaks and wanes. I'll bet the binaural beats \"euphoria\" setting would actually work for me right now (it's never actually worked for me). I'm half tempted to see if I can track the periodicity of the cycle. I think it's less than a second.\n\nThere is a bigger sense of body feel (stretching feels good) and a strength (like I could push my muscles to go at 90% and it would feel like taking a race car out and opening up the throttle).\n\nAs of this moment, it has been nearly 4 hours of feeling somewhere between warmly contented and mildly euphoric. I am so profoundly grateful that I _can_ still feel happy. Even if I revert to the darkness very soon, today gives me hope that I can make it through.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/8nrn5j/i_woke_up_happy_depression/", "title": "I woke up happy! (depression)", "social_network": "reddit", "user": "bearnamedbear", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1527857625, "permalink": "/r/DecidingToBeBetter/comments/8nrn5j/i_woke_up_happy_depression/", "nsfw": false, "first_save": 1635436384.239055, "replies_charged": false}