{"id": "t5_2tand_t3_i6arpr", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I used to feel like I was a victim to my life. Like I got the shit end of the stick in a lot of ways. Having been adopted, my first dad passing away 11 days before my 5th birthday, his whole family disowning me, my dad who’s was in my life since i was 6 getting sick with dementia & Parkinson’s (he died last year, 6 days before my 28th bday), I had an entire slew of abandonment issues and grief that ran the show in so many ways. \n\nI thought in order to have a good life, things had to work out in your favor. People were lucky, and then there was me. Miss damaged because life dealt “harder” cards. \n\nI now understand that life isn’t what happens to you, but how you respond to what happens. Do you react quickly to things through habit instead of mindfulness? Do you victimize your situation? Do you self-sabotage? If the answer to any of these things is yes, welcome - you’re human! And I’ve done all of those things too. \n\nEven though we can’t control what happens, that doesn’t mean that life is doomed. We can choose to respond by pausing. We can choose to do things differently than ever before. We can focus on positive things instead of worst case scenarios. We can unpack the hard things that have happened with compassion. We can view the things we done that are extremely questionable through a different lens. \n\nAlthough we could have done “bad” things in the past, it doesn’t mean you’re bad. It just means you were unaware, and it’s time to be aware. Feeling guilt or shame about what you have done just creates a cycle of more guilt and shame and self-sabotage. It’s time to forgive the unforgivable. It’s time to apologize (if safe to do so). It’s time to view yourself as someone who deserves forgiveness. \n\nWe only do better when we know better. But it’s time to step up and take the actions that help better your life. It’s time to respond instead of reacting in the same ways you’ve done in the past that didn’t work for you. It’s time to change things up. \n\nRealizing you can control how you respond to things is vital to deciding to be better. Your life is your responsibility. Navigate with compassion (we’re human and learning). Evolve through curiosity. Grow through the tribulations. \n\nIt’s time to step into your power. Knowing it’s yours is the first step. Exploring how to harness it through experience is the next step. Repeat this over and over again. See what unfolds. \n\nWe can’t control the outcome of things but we can control our input. That’s where our power lies. Focus there. Watch what happens. I promise, it’s worth it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i6arpr/once_you_realize_you_can_control_your_response/", "title": "Once you realize you can control your response, things drastically change for the better.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2597, "down_vote": 0, "creation": 1596935780, "permalink": "/r/DecidingToBeBetter/comments/i6arpr/once_you_realize_you_can_control_your_response/", "nsfw": false, "first_save": 1635436505.902176, "replies_charged": false}