{"id": "t5_2tand_t3_64gh6h", "request": ["da3e72ac-2059-4c8f-99c6-52edffdec3d2"], "text": "It is a strange world (western world) we currently live in. Indeed, the amount of possibilities for the willing individual are nearly infinite. It is a first in history, a time where the common man takes his survival for granted. Food is more than abundant, the comfort of our houses is unparalleled and security is a given in most areas. What it took to be a man before is now irrelevant. I strongly think that modern humans, with all their basic needs fulfilled, are in the best position to aspire to higher ideals, that is, attain selfhood. What is selfhood? Worry not, this question will be answered soon. Nietzsche believed that the goal of mankind was to overcome itself, or, if you prefer to become something better in every way.\n\n\n\n Information is now more available than ever. You can get information on anything you want in a matter of seconds. Isn’t that amazing? Think about it for a second, you have an infinite amount of knowledge at your disposal, everywhere, anytime. Information is an essential part of the individuation process, another term, this time used by the Swiss psychologist Carl Jung, which is basically more or less the same thing as attaining selfhood. Internet is a precious tool that now allows men and women to really dig and find valuable information which will greatly aid them in their journey. The path that once only a few select individuals chose to take, is now more accessible than ever.\n\n\n\nUnfortunately the great majority of people, the ‘’mass’’ fall prey to the perverse aspects of modern technology and culture. Indeed, the Internet is a great tool but it can also be a great deceiver. One can easily spend most of his existence in a confused daze, addicted to the alluring ‘’activities’’ (porn, social media, Netflix, video games, etc.) offered in the digital era. Modern Medias also convey a lot of false ideas, ideals and attitudes to the mass. The willing individual must be critical of everything he sees and use reason to find truth. He also must detach to those ‘’activities’’ and find meaning in creative work. \n\n\nAs I mentioned earlier, the path to individuation, that is, becoming who you truly are at the core, is more accessible than ever but it’s also the case for the easy path. The easy path is short gratification, living according to society’s ideals and values, attempting to ‘’fit’’ in and so on. This road is what most individuals will blindly chose to follow. We can compare those two different paths to food. One can easily decide to eat fast food every day; it tastes good, it’s convenient, fast and simple. However, after a while, the impacts of such a diet will be harshly felt. Ultimately, the individual will feel unhealthy, even though it felt good in the moment. On the other hand, if the same individual decided to indulge in a healthy diet; vegetables, good fats, whole grains and so on, it might be much less satisfying than fast food in the moment, but in the end, the individual will feel much healthier mentally and physically. It is quite the same with the two paths described earlier; one feels good on the spot but is ultimately unsatisfying while the other leaves one satiated and content in the end.\n\n\nIt is then your choice to make. It’s important to remember that in today’s society ‘’the stars are aligned’’ for the men who are ready to make sacrifices and commit, body and soul, to this goal. On this note I will leave you with a quote from the roman philosopher Seneca:\n\n ‘’The pressure of adversity does not affect the mind of the brave man... It is more powerful than external circumstances.’’\n\nHappy grind\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/64gh6h/the_modern_situation/", "title": "The Modern Situation", "social_network": "reddit", "user": "Sowlo-", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1491784723, "permalink": "/r/DecidingToBeBetter/comments/64gh6h/the_modern_situation/", "nsfw": false, "first_save": 1635438095.2931886, "replies_charged": false}