{"id": "t5_2tand_t3_pwtpir", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "I am 30 year old male who is a registered nurse who makes decent money with no debt, no responsibility, yet I am pretty depressed. Just brief background on my situation is that I moved to a different state to a small college town couple years ago to get some work experience. I have been on night shift for a good year and half now. I barely have any friends here, very little hobbies, and I work most nights. My love life is non existent.\n\nI feel like  I have a deep angst with mainly my love life right now. In my 20s with long periods of being single it didn't bother me as much because I can say that I was focusing on school or career. There was a light at the end of the tunnel thinking once I get my career then all other things will sort itself out. Now that I am 30 there is social pressure and pressure I place on myself to find someone, get married, have kids. I feel like the 30s is where its still socially acceptable. At 40 it would be a bit weird. Its a weird age to be in as most of my friends are either in long term relationships, married, or have kids so they are too busy to hang out. On top of that I think I am the only person amongst my relatives that is still single. People in my age group and younger all have someone but I don't. Relatives would asking me if I am seeing someone. Side chatter that I must be gay. Its not fun.\n\nWhy am I still single? I think I have some issues I need to work out. I tend to have higher standards of who I want to be in a relationship with like her being physically attractive, humble, kind, good emotional intelligence, outgoing, some sort of career. I mostly meet people through dating apps.  I feel like I have some of those qualities so would like my spouse to have the same.  It seems like the girls I am interested in don't want me and the girls I have no physical attraction towards tend to give me a bit more attention. I can be a bit introverted in my normal life and don't have much opportunities to socialize outside of work. The few relationships I have been in I tend to have one foot in and one foot out. Scared to fully be vulnerable. Why am i this way? I am scared to get hurt in one sense. Break ups are painful. My first relationship it took me over a year to get over it. The other is probably looking for something better. \n\ncontributions to my depression lack of love life, few friends, work night shifts, work all the time, little to no hobbies or life outside of work. I miss the blissful ignorance. The last time I think I was truly happy was when I was in my early 20s freshman/sophomore year of college. Life now seems meaningless and a drag. I feel dead inside, devoid of emotion. I don't know the answer. I am thinking about moving to a different area. A bigger city where there is something new and exciting for me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pwtpir/how_to_lower_expectations_and_just_genuinely_be/", "title": "How to lower expectations and just genuinely be happier in life... dating, career, love life.", "social_network": "reddit", "user": "samantha145151", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1632786440, "permalink": "/r/DecidingToBeBetter/comments/pwtpir/how_to_lower_expectations_and_just_genuinely_be/", "nsfw": false, "first_save": 1635435618.587714, "replies_charged": false}