{"id": "t5_2tand_t3_qae9qq", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "Today, I felt my mood just take a complete nosedive after a steady decline. \n\nBack in the spring and summer, I got serious about diet and exercise, went out to join some new groups, and really did all of the things within my ability to control that I could to try and get a life I could tolerate. It was going \"well\" for a while, but after months I felt the same wave of dread and self-hate at the fact that I was still so alone in life. I still wasn't \"part of the group\" for anything, I hadn't gotten any closer to being in love with someone, and I still hated being the person that I am. And so the past three weeks or so has been this big internal fight against my old binge,eating habits and my desire to just withdraw from people so I can't be excluded. And I sit here knowing how badly I screwed up the \"progress\" I made over those several months. I'm terrified of going onto my scale again, to the point where I can't weigh myself tonight for fear of being unable to sleep once I see that number. \n\nBut what hurts the most is that all that \"progress\" was not even real progress. So what if I lost over 20 pounds? So what if I learned new skills, got out and saw new people, can run a mile again, etc.? I'm still the same person beneath all of that. The things that are actually important, like having a sense of belonging, feeling wanted, having a place in the world and a direction in life? None of that changed one damn bit. It's like I was just off in a self-delusional dream land that whole time. \n\nThat aside... \n\nIf I had about 5 months of \"doing the right thing\" that I completely fucked up in the past 3 weeks of \"why does any of it fucking matter if I'm still the loser I always was?\", is the reason it fell apart because i wasn't on the right track long enough? Say, had I stuck to good habits for a year, would that be enough to start having a life I don't hate? Or was my idea of good habits not harsh and unrelenting enough? Or was I never doing anything correctly in the first place and my strategy was doomed to fail because it was the wrong strategy? Because I can't keep wasting time on wrong strategies if that's the case. I'm almost 30 and I haven't even started what I would consider a \"real\" life yet, if I ever start it. I need to become a real, worthwhile, consequential person as quickly as possible to make up for my lifetime of failure.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qae9qq/how_do_i_stay_on_the_right_track_long_enough_for/", "title": "How do I stay on the right track long enough for life to actually get better?", "social_network": "reddit", "user": "NauticalFork", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1634527295, "permalink": "/r/DecidingToBeBetter/comments/qae9qq/how_do_i_stay_on_the_right_track_long_enough_for/", "nsfw": false, "first_save": 1635438214.2228544, "replies_charged": false}