{"id": "t5_2tand_t3_pibc8p", "request": ["b69cf201-6737-4217-b486-9096135546b8", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I \\[25F\\] am having trouble trying to turn my life around. My biggest issues are lack of persistence, procrastination, and what I believe to be some sort of junk food addiction.\n\nI was diagnosed with generalized anxiety disorder + depressive episodes earlier this year (although it has been a part of my life since childhood, but I never had the guts to see a therapist until now), so I have been taking antidepressants (escitalopram) since June. They've helped me become more motivated and less anxious so I started working out regularly, but still gained some weight because I can't seem to stop eating junk food. On top of gaining a few pounds (which is a shock for me because I've always been more or less fit), I have some health issues due to which I should cut out all refined food and focus on eating healthy, or I will end up having fertility issues - at the least. However, although I am aware eating healthy is good for me in every possible way (for my physical & mental health, fertility, skin issues, weight, mood, and overall wellness), I can't seem to cut out junk food such as pastry, chips, cakes, etc. I always feel bad after eating that stuff and it also affects my digestion and my skin, but I still keep eating it. I have been trying to start eating keto/paleo for a while now, and I even started counting calories, but every few days I give in and eat some crap like croissants or a whole bag of chips. I eat a lot of fruit and vegetables, so eating \"healthy food\" is not the problem for me - it's cutting out the \"unhealthy\" stuff. I know it's fine to eat that every now and then, but I find it difficult to stop once I start eating this stuff. Is there any way to fix this? I fear that I won't be able to fix my diet until I see some serious damage to my health, and I definitely don't want that. \n\nI know people tend to binge eat due to some unresolved personal issues, but I don't think that's the case here because I really feel like my life is better than it has ever been. I have a job I like, a few close friends who are there for me and I am in a healthy relationship (1y+) for the first time in my life with the most amazing and caring boyfriend. As far as self-improvement is concerned, I am trying my best in that aspect but I still think it's not enough and I often procrastinate. I read books on diet, motivation, and mental health, I am seeing a therapist (CBT), regularly taking my antidepressants, getting enough sleep, and working out 3-5 times a week. I would like to be more diligent in this field as well because I sometimes lack the motivation to read or do something useful with my time. I often find myself watching dumb Netflix shows or just scrolling through social media for hours. I also love learning languages, but I can never get myself to sit down and study, although I know it would make me feel better. \n\nI recently finished my MA in humanities and started working at a really successful company in a position that has nothing to do with what I studied, but I really like it and am considering a career in this field. It is a student job (since that was the only position I could get at that time), and I only have the option to work via student contract till the end of this month, which means that from October I will either be working there full time - if they decide to keep me on - or I will be unemployed. It will probably be the former, but I am never an optimist when it comes to me so I'm always prepared for the worst. \n\nI have been trying to get better and more disciplined for years now. I have always considered myself lazy and have gotten through school and uni as a straight-A student mostly based on my \"wits\" with very little studying. I always have a planner with me, I tried bullet-journaling, I tried all sorts of mobile apps, and everything I could think of to organize my life. I like being organized, I like making lists and ticking off tasks, I feel great when I spend my time doing something useful, but I can't seem to stay on track and always end up wasting my days. I'd really like to change that and be able to have the best life I can have because there is nothing stopping me from getting there except for myself. I'd appreciate any advice on how to stop sabotaging myself and get better.   \n\n\nTL;DR I am having trouble staying disciplined, working on myself, and cutting out junk food. I have the motivation, but I fail when it comes to taking action. Any advice?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pibc8p/i_am_having_trouble_taking_action_and_staying/", "title": "I am having trouble taking action and staying disciplined. How do I stop sabotaging myself?", "social_network": "reddit", "user": "ineffable18", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 18, "down_vote": 0, "creation": 1630840878, "permalink": "/r/DecidingToBeBetter/comments/pibc8p/i_am_having_trouble_taking_action_and_staying/", "nsfw": false, "first_save": 1635436443.877257, "replies_charged": false}