{"id": "t5_2tand_t3_pse69o", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "The problem is that I always had this huge resistance to having set schedule and obligations. In school and uni it was bearable since I could relax and do nothing for most of the time, and then was able to focus and be effective on exams. I was able to make some money doing manual labor on and off, and that was pretty enjoyable since I could work just enough to have pocket money.\n\nEver since I started working professionally full time about 7 years ago, my quality of life on a day to day basis has dropped significantly. Objectively, my life is much better. I moved out and live on my own. I manage to buy stuff I find interesting, travel, and have interesting experiences with the money I earn.\n\nI have a pretty good job with reasonable workload and good pay, and I find my profession relatively interesting. I have been always getting good feedback from my superiors. Currently I work remotely, but honestly it hasn't changed my outlook as much as I hoped it would.\n\nBut the issue is that I am miserable for most of my days when I have to work. I have that nagging feeling, like I owe someone money. Like I have to fake that I enjoy it all the time. I alternate periods of very high and very low productivity, where I just mindlessly surf. I really don't like my fake nice professional role.\n\nThis produces frustration that spills into my free time. I really don't enjoy the afternoons of my workdays that much. I have issues with overeating, and started losing my temper much more than usually. I had some scary road rage episodes recently...\n\nThe only times I actually enjoy are the holidays (Luckily I have about 25 days off per year) and Saturdays. The difference in my enjoyment of the day when I am on holidays and when I am working is night and day.\n\nI know about the FIRE movement, and am on track to be financially independent in a few years if everything goes as planned. But I feel like this is running away from the problem, that I would like to solve. I am still young and want to make more money and build my wealth some more, and I think I am good at the actual work that I do.\n\nAnyone had similar issues, and managed to make it better? Any advice would be helpful at this point.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pse69o/help_overcoming_resistance_to_having_to_work_at_a/", "title": "Help overcoming resistance to having to work at a job?", "social_network": "reddit", "user": "320d__", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1632210718, "permalink": "/r/DecidingToBeBetter/comments/pse69o/help_overcoming_resistance_to_having_to_work_at_a/", "nsfw": false, "first_save": 1635438040.8405535, "replies_charged": false}