{"id": "t5_2tand_t3_iynv1w", "request": ["c5413f89-ceff-4d4e-ab55-742c6af6ff43"], "text": "I've been struggling with getting out of my bed because it's SO comfortable that I simply don't want to get up and start the day.\n\nI usually stay for a whole hour in bed just because it's warm and comfortable. A lot of the times I'm not even sleeping, I'm just there for the warmth, which means a complete hour wasted. I'll repeat what I said in the past sentence because I realized it only recently: I'm not staying in bed for more sleeping time, I stay in it because it's so warm and comfortable that I don't want to get up. As I said, I'm not even sleeping, I'm just really slacking.\n\nHere's what I do:\n\n\\- I wake up at 9h50 (my work is flexible, I can start it at anytime) with an alarm. I have an alarm also for 9h55 and 10h, which I just turn off and stay in bed.\n\n\\- Then I put an alarm for 10h30, 10h35 and 10h40 just so I don't accidentally fall asleep again and wake up long later, call it a \"checkpoint\". However, I also just turn it off and stay in bed.\n\n\\- When it's 11h I get guilty enough and get up. When the 10h30 alarm sounds, I end up thinking \"oh, so I have 30 more minutes until I REALLY have to get up\". Then it's already 11h and I'm guilty again.\n\nI'd love to have my alarm set to 9h50 and to be able to get up at 10h. It would be wonderful. I know I won't be able to go from getting up at 11h to 10h in a week, I'll do it gradually, but I need some advice, because nothing that I have tried seems to work, unless I have an appointment, then I will be up whenever is needed.\n\nI go to sleep around 1h40 - 1h50 and no, I don't want to change that now, because 1h40 - 09h50 means \\~8h sleeping and I'm fine with that.\n\nWhat I have already tried that didn't work:\n\n\\- Putting my cellphone away from my bed so I have to get up to turn it off. I'll just eventually return to bed, and some of the times I tried it I didn't even hear the alarm\n\n\\- \"Willpower\" aka \"tomorrow I won't get up so late\". Didn't work at all, not even close.\n\nI think the biggest challenge is convincing myself to get out of an extremely warm and comfortable bed. I haven't been able to come up with something that will convince me to get up.\n\nAny and all advice is welcome. \n\nThank you.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iynv1w/cant_get_up_from_bed_its_too_comfortable/", "title": "Can't get up from bed - it's too comfortable!", "social_network": "reddit", "user": "lernem", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1600912243, "permalink": "/r/DecidingToBeBetter/comments/iynv1w/cant_get_up_from_bed_its_too_comfortable/", "nsfw": false, "first_save": 1635435991.5684118, "replies_charged": false}