{"id": "t5_2tand_t3_m0a9w1", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "Hey everyone, this past week has been one of the lowest points in my life, if not the lowest. 5 days ago I was kicked out from my girlfriend's parents house after getting broken up with after dating for a year and 4 months. I have been going through a real rough time with this break up, and wanted to share a small progression victory, and hoping to document more down the road.\n\nDay 1: Day after breakup, took off from work, the worst roller coaster of emotions has yet to hit. Had my weekly virtual therapy session so it was good timing. Slept and stayed in same clothes I've been in from work day before (as breakup happened right after work). Couldn't eat the entire day, couldn't drink anything, so much stress, heartache, anxiety. Slept 4-5 hours.\n\nDay 2: This day was the worst so far. Took off from work again, woke up multiple times throughout the night. Experienced panic attacks, sadness, anger, severe depression, and the worst pain and grieving I've ever had to deal with before, so much loneliness. I couldn't sit still, I wanted to be unconscious to not deal with all this hurt. Took relaxer pills to help calm me down. I drank a few sips of water, and force ate a McDonald's sandwich. I managed to finally change clothes. Slept maybe 2-3 hours.\n\nDay 3: Woke up at 2am, stayed up and managed to go to work. Emotions weren't as severe as yesterday, I managed to connect with a few friends and spirits were better. I decided to finally step foot in the gym, with almost a year of not working out. I was in for 20-30 minutes before I became overwhelmed with emotions and being drained from no sleep and not eating, and left. Saw couples walking around and going out Friday night, so that night was difficult. I finally showered this day though. I also managed to journal a letter to my ex that I'd keep to myself, helped a ton to let me fall asleep. Slept better, 5-6 hours.\n\nDay 4: Morning was rough, waking up with emotions of loneliness and sadness, multiple times through the night. However, I managed to setup my computer and clean my disaster of a room, which kept me distracted and made me feel accomplished. I ate 2 PB&J sandwiches and 2 McDonald's sandwiches, and drank a protein shake. Drank a lot more water this day as well. Was able to FaceTime family and connect with a friend that night and leave the house, so this day was mostly nice. Slept 4-5 hours.\n\nDay 5 (today): Woke up only twice this morning, though I woke up with deep emotions again. Today was also productive. Went to the gym for an hour today and had a much better workout.  Drank a lot of water. Ate chicken, veggies, and rice. Drank a protein shake. And also did my laundry. Watched inspirational videos to improve my mood about what I'm dealing with. I plan to go to the gym tomorrow again, after work. I'm hoping tonight to have a better sleep, and hoping the 'waking up sad' emotions lessen.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m0a9w1/5_days_after_the_worst_breakup_of_my_life/", "title": "5 Days after the worst breakup of my life", "social_network": "reddit", "user": "kv_ika", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1615187535, "permalink": "/r/DecidingToBeBetter/comments/m0a9w1/5_days_after_the_worst_breakup_of_my_life/", "nsfw": false, "first_save": 1635438066.1317601, "replies_charged": false}