{"id": "t5_2tand_t3_kv9hz0", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "* *note:*   T**his post is not about** how I am not going to respond at people who come at me the wrong way  (honestly hard for me, and anyone else  to do regarding when it's about something really personal ), **but it's just about how I've figured out being able to respond while NOT letting the irrelevant (peoples' \\*opinions\\* and not facts about me) OVER RIDE with what is relevant (my obligations: job, eating meals, exercising, etc). techniques/mantras i've told myself to manage all that  listed below!** but if you are able not to respond, obviously that is excellent and if you're able to do that, constructive advice is also welcomed. im just sharing what works for me hehe. and if my technique becomes self destructive, i'll change it (which i've already started doing today)\n* I'm not posting this to brag as there isn't anything in the title that I've done to even brag about, **it just feels good to share something to share overcoming one of my greatest bad habits which is something I haven't done in a long time,** *since it symbolizes that i refused to allow my REALITY to be consumed by toxicity by prioritizing myself over other peoples' opinions about me-as if im writing  and controlling my own story, instaed of having it fabricated by others.*\n* **UPDATE -plz read if u have time: WOW!:)** so i get pretty riled up when like, close family send me nasty texts about things personal to me. was already diagnosed with bipolar, so hearing that kinda gets me in a manic state. even after working out, I was still manic. While i still fill anxious, for the first time in a looonggg time the mania is manegable- i didn't have to \\*respond \\* to get myself in a stable state- usually confront them just to calm myself down. so working out helped, but my mind began to race less once I occupied myself with plans for my future, reminded myself of the goals I've always wanted to achieve. i didn't give up, and im still anxious, but a lot more stable now...cuz im being productive by thinking about my goals. In their effort to define who i am with their opinions of me and therefore distract me,i redirected my focus to WHAT does define me, which is where i invest my time & energy, which I've chosen to invest in BECOMING GREAT at the career skills that matter to me, so that THAT CONSUMES MY REALITY.  don't focus on the noise outside y'all, feed yourself on the inside and dont give up on feeding yourself. still gonna respond tho lol.\n\n\\---------------------------------------\n\n* The past 2.5 years, I've been confronted with text messages/social media messages with family members/old friends giving their \\*opinion\\* and not their \\*Facts\\* about who i am as a person, and my  life decisions that have not put myself nor anyone else at risk.\n* When I left my immediate family to continue journaling, exercising, applying for jobs etc in an effort to become independent without doing so in a toxic environment, I was confronted by text messages from a cousin once she was made aware of this, etc.\n* You're damn right I'm going to confront her back and i still will. It's just a self defense mechanism for me; otherwise i bottle conversations up and bottling things up leads me to really bad places which screws with my productivity. am not confronting her to have a conversation with her (as well as others)  to let her know i do not need to respond her \\*opinions\\*  (and not facts) about me in an effort to cut her off completely.\n* While i did talk about this in an earlier post, the things is that for the first time, i did not start my day with responding to someone's opinions about me. I did not start the day being so riled up with what was being said about me by toxic people,and I did not skip meals because of it, etc.\n* Instead, I was finally able to practice a thought that I wrote in my journal entry, where I wrote to myself the importance of  (not letting what's irrelevant over ride what is important aka my obligations which consist of:  finding a job to even have the luxury of worrying about what others say, cooking food for myself, etc)\n   * This morning, I told myself that if my confrontational ass who's never walked away from an argument (but has always strived to shut it down instead before cutting them off) wants to respond to people's opinions and not their facts about me, then I will place limits on this somewhat unhealthy habit, by:\n      * setting limits: I dont do back and forth text messages- I've told them to come to dallas and say it to my face. but since they wanna make up excuses, i'll say what i have to say after i take care of my obligations (exercising, brushing teeth, journaling, eating breakfeast)\n      * and i will not respond more than once, or at maximum, TWICE a day (AFTER i do my mourning & bed time routine)\n      * therefore, i will not let this bull shit CONSUME me and prevent me from finding a job, aka something which i currenly don't have but would need to technically even have the luxury & time to respond to them, but it is what it is.\n* thank you for reading if you did! idiots can be really toxic-posted this to share & help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kv9hz0/for_the_first_time_in_25_years_instead_of/", "title": "For the first time in 2.5 years, Instead of starting my day by responding to toxic messages about me & getting consumed by them, I began the day by brushing my teeth, dressing nicely, eating a healthy breakfeast, exercising for 40 mins while looking pretty doing it, & planning my week.", "social_network": "reddit", "user": "Cat_Eyed_Goddess94", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1003, "down_vote": 0, "creation": 1610392059, "permalink": "/r/DecidingToBeBetter/comments/kv9hz0/for_the_first_time_in_25_years_instead_of/", "nsfw": false, "first_save": 1635438336.1596718, "replies_charged": false}