{"id": "t5_2tand_t3_ngryd7", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1"], "text": " One fine day, it dawns on you that the cause of all your problems is that you think too much. You think and regret about the mistakes in your past, you think and worry about your future and you think and worry about your current situation and where you are in life when compared to your circle of friends.  \nThere should be some way to stop these futile thoughts, to somehow control the emotions that gush forth with no practical implications that are positive. You do some research and find that meditation is the answer to your problems.  \nWow.. now you can become the wise old guru of the mountains with answers to life and its problems. So you decide to get started right away. You dig some more on the internet and come up with plenty of websites that talk about meditation. There are plenty of apps, websites, videos etc and you finally zero in on a handful that look promising.  \nIn most of the instruction videos, you notice that the meditation guru has a serene setup before the meditation even starts — a yoga mat, incense sticks, posters, meditation clothes, beads, pendants, candles and whatnot. This matches with the image that you commonly associate with anyone doing meditation, thanks to the picture portrayed in most movies about meditation.  \nYou decide that you definitely need to buy all this “basic” stuff to even get started and you spend many hours surfing for the best meditation articles and products.  \nStop.  \nI am going to now take the liberty and assume that you have at some point in your life been in a state of complete focus while working on a task. It could be anything like vacuuming, walking to the store, going for a run, playing a game or even reading an article on meditation which is what you are doing right now. I sometimes go on a run or ride my bike. At some point in the run, I notice my breath going in and out of my body, I look down at the pavement and am mesmerized by the odd patterns of the pavement tiles or when running on the road, by the little stones wedged together by the concrete making patterns that I never knew existed. When I am in a train and I look out the window, I am hypnotized by the different shapes of the buildings that zip past me or the varied landscape. Even when I am reading something like how are you doing now, you notice how some random letters bunched together are able to make meaningful sentences and ideas.  \nStop.  \nYou are now meditating.  \nYes, even at that fleeting moment, when your mind was focusing on these tiny things, you were meditating. This is mindfulness meditation at its practical best.  \nDispel all your thoughts about meditation and trying to become the meditation guru. The purpose of meditation is to bring your focus on the present and that is what you have achieved in the above examples. You don’t need that expensive meditation mat, that scented candle, that dedicated time to meditate. Sometimes you cannot afford the money or the time.  \nMeditate when you go about your daily tasks. At any time, all the time. Stop a moment while you read this to notice your breath. If you are like most people, you are taking very short breaths in and out. As you read this line, take a deep breath in and a deep breath out.\n\nRepeat 3 times..\n\nDeep breath in… and out.\n\nBreathe in … and out..\n\nBreathe in … and out.\n\nGet back to your regular breathing pattern.  \nCongratulations you have completed your first meditation practice.  \nMeditation is all about the present moment.  \nSeize the moment and seize the day!  \nCarpe momentum.. Carpe diem…!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ngryd7/seize_the_moment_heres_how/", "title": "Seize the moment... here's how...", "social_network": "reddit", "user": "Lonecfawolf", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1621488997, "permalink": "/r/DecidingToBeBetter/comments/ngryd7/seize_the_moment_heres_how/", "nsfw": false, "first_save": 1635436182.424118, "replies_charged": false}