{"id": "t5_2tand_t3_o3x5ei", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "Close to a year ago, I got out of a relationship that while it didn't last long (only a few months and long distance), it left an impact and I developed very strong feelings for this person (a first in a long time). In short, she was the first person in a long time that I felt like it was a two way street and I wasn't making the most effort.\n\n Following the breakup I was devastated, and because of the pandemic I wasn't able to distract myself with the hobbies or seeing people like I normally would. She's gotten into a new relationship a few months ago, and seeing the way she talks about him that she didn't with me has led to a lot of overthinking and anxiety, and questioning if I'll ever feel like that for someone again or if I'm worthy of those feelings.\n\nFast forward to now and I'm going out more now that I'm vaccinated, I'm back at the gym (weightlifting and boxing are my favorite hobbies and I'm THRILLED that I can do them again), sleeping and eating well, and these thoughts for the most part have disappeared. I've also found a new job that I love and bought my first apartment and my closest friends have seen successes as well which has made me really happy.\n\nHowever, I think because of those months spent overthinking and anxious, they still intrude my head from time to time, though they aren't as severe. I've never felt like the type that needs to go out every weekend to feel fulfilled or need to be in a relationship before I was with her, but thinking that this is how it's going to be for years scares me at times.\n\nWhat's your best advice for dealing with this?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o3x5ei/i_want_to_learn_how_to_love_myself_and_being_alone/", "title": "I want to learn how to love myself and being alone", "social_network": "reddit", "user": "paopu_boy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 29, "down_vote": 0, "creation": 1624161736, "permalink": "/r/DecidingToBeBetter/comments/o3x5ei/i_want_to_learn_how_to_love_myself_and_being_alone/", "nsfw": false, "first_save": 1635436716.0144806, "replies_charged": false}