{"id": "t5_2tand_t3_e24idx", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "Fellas, I want to get better. But this sentence is grammaticaly traps us. Because the reason you want to get better is the reason you are not. You can't be something you are not.\n\nThat is to say, the one who must be improved is exactly the same person who is going to make the improvement. This is a vicious circle. How can inadequate make itself adequate? \n\nYou can't improve yourself. You are going to have to accept that. That is fundamentally a grammatical error. That is why you and I are always failing. \n\nBut what you can do is to accept yourself. You are enough. This is not a motivational sentence. You didn't come to this world. You came out of it. If the world is a magnificant tree, you are the fruit of it. Not the bird on its branch. That is why you have no idea about this world. Because you can't and don't know it. You are inside of it. Like a fish in water. And that makes you enough. What is fruit's purpose? To be a tree? Then what is tree's purpose? See don't try to ask yourself 'What is the purpose?\" because there is none. And that makes you enough.\n\nYou, just as you are, a fruit the world grew. You can't be the biggest fruit. You can't be the best fruit. You even maybe weird shaped but there is still seed in you. That is why you are fundamentally enough. Accept yourself. Don't try to be biggest, juicy fruit when you are not.\n\nNow about me. I need your help. I am 23 year old (M) severely depressed and self-destructive young fella from Turkey. \n\nI stopped going to classes at 20 in my second year in college. Just to have no hopes in future. I didn't want to live. I wanted my worst. I wanted to be thw worst. I hated everything about me. I loved hating me. So i decided to kill myself at the age of 22 when normally i should be graduating.\n\nBut I didn't make the jump. I just didn't care being dead. I said 'Fuck it if nothing matters lets just stay alive and suffer more you piece of shit.'\n\nBut fellas now i see. I see that nothing matters, world is fundamentally suffering and that is okay. I decided to accept myself and I want to live. I want to get in contact with my seed and flourish it. I am smart, I am really good loking but I just hated myself. I loved hating myself.\n\nNow is time to love myself. Not that it matters but because it is nature's will. Don't try to be a god. Just drop into the soil and flourish your seed asshole. You don't know shit about existence. It is becoming a problem just because you are trying to explain it. You egoistic, mind slave. Get out of your mind and do as you are told to be happy. \n\nAnd you know what, universe speaks to you. You just have to let it flow. You just have to get your ass into the class and gym whatever. And 'It' will do you. And you will do 'IT'. Just like a jockey and a horse. They are one. One moves and the other adjust. In your case you move and the universe adjust and vice verse. You have nothing to worry about. Because you weren't alive 100 years ago and won't be alive 100 years later. Do what you are told. Universe is speaking to you always. But your mind is telling you that you are just a stranger in this world and you are born and suffer through this existence until you are dead.\n\nAh my friends, i want to get out of my mind. But it says me ' You don't have a college degree, you are in a shithole country, you have no skills, no work experience, you just know English and that is it. You are the lowest scum in the entire world'\n\nFellas, how do i not listen to my mind? I want to live but I have no idea what to do? I have a few ideas but I don't know. What do I study, I have no money, I am a manchild. I am smart but appearently not smart enough to rule my mind.\n\nWhat skills do I learn? I have no idea what to do.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/e24idx/getting_out_of_your_mind_into_the_reality/", "title": "Getting out of your mind into the reality", "social_network": "reddit", "user": "anoxci", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1574802333, "permalink": "/r/DecidingToBeBetter/comments/e24idx/getting_out_of_your_mind_into_the_reality/", "nsfw": false, "first_save": 1635436551.8814096, "replies_charged": false}