{"id": "t5_2tand_t3_nlkhjw", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1", "02754bd2-1501-4057-b4ae-2ac097eb5da1", "5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Edit: TLDR— achieved my goal of getting to go college for free, feeling slightly empty and lost now that that goal is no liger a driving force.\n\nNot sure if this is the right sub for this but oh well.\n\nI’m 18 and I’ve never been great at at setting short term goals for myself, but when I was younger, I made it my goal to get into college on a scholarship. I’m graduating high school soon, and I’m grateful to say that I’ve been able to accomplish that goal. But, I haven’t done anything since. I don’t really have anything pushing me now, since I already achieved my goal that I’ve had for years. Again, I’m extremely grateful for the opportunity, yet still feel a little emptiness inside, which makes me feel guilty because this is something I’ve worked sooooo long for. I think part of the reason of this is because I’ve always expected “excellence” from myself, and rarely celebrate any achievements myself. Congratulations from others don’t make me feel any better, they just make me feel bad because I feel like I’m not doing enough to celebrate.\n\nI’m not really sure where to go next at this point. I still don’t really know what I want to study, although I tell people medicine when they ask. I find it interesting, but I just don’t know how I’ll be able to choose a career path when I have so many varying interests.\n\nNot really sure what the point of this post was. I have absolutely no reason to complain about anything and am very fortunate, just a little bit lost, even though it definitely doesn’t seem like that from an outside perspective.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nlkhjw/feel_pretty_lost_after_achieving_a_lifelong_goal/", "title": "Feel pretty lost after achieving a life-long goal.", "social_network": "reddit", "user": "2021CollegeAcc", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 8, "down_vote": 0, "creation": 1622044892, "permalink": "/r/DecidingToBeBetter/comments/nlkhjw/feel_pretty_lost_after_achieving_a_lifelong_goal/", "nsfw": false, "first_save": 1635436154.5855222, "replies_charged": false}