{"id": "t5_2tand_t3_hu7i42", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "Okay so the thing is I've been severely depressed for 5 years and I'm truly tired of being like this. I can't afford therapy so I would like to cure my depression, gain self confidence, be accepting of how I look (I have a baby face and I'm a guy) all by myself or with the least help possible. I don't really have any routine planned as this is the first time I'm doing something like this and its really weird as I surprisingly don't miss social media but I don't know where to go, what habits to form, what to do while quarantined. \n\nThrough this depression, I consistently doubt my every single belief as a child and even the values my parents enshrined in me. When I ask myself serious questions like what makes you feel happy or grateful, what's something you want from your life, what are your deepest desires, etc, I can't seem to think and come up with anything and even if I come up with stuff like I have food on my plate, a roof over my head, a great family but it feels like insincere in some way as I've also become emotionally numb and exhausted. I have even forgotten what love is. I'm serious. I'm one of the nicest and kindest human beings on earth but I don't know what love is. What is wrong with me?\n\nDo any of you have advice on how to combat all this I mentioned before and improve my life drastically? If so, then please comment down below or PM me. \n\nThank you beautiful human!\nStay safe!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hu7i42/ive_recently_deleted_almost_all_my_social_media/", "title": "I've recently deleted almost all my social media apps except two (Reddit and WhatsApp for work) to fix myself and I don't know where to go from here!", "social_network": "reddit", "user": "jash_goda", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1595190514, "permalink": "/r/DecidingToBeBetter/comments/hu7i42/ive_recently_deleted_almost_all_my_social_media/", "nsfw": false, "first_save": 1635436455.1394696, "replies_charged": false}