{"id": "t5_2tand_t3_pk15me", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "Tonight I realized just how bad of a person I am. I opened myself up completely to my boyfriend and all I could say afterwards was to take our daughter and leave. I don't love myself, I don't want myself, I don't want to exist. Until now, I could hide it decently, but I ran out of meds and now I'm fully spiraling downwards. I keep taking opportunities to help myself and then destroying everything.\n\nI don't know if I feel love. All that I told my boyfriend made him break down crying. He asked if it meant nothing to me... and I said it didn't because I'm spiraling, I don't care. About anything. I'm not a person, I'm a parasite. Essentially since my birth I haven't changed at all. I'm so angry and I hate everything. If someone even exists near me, I get pissed off. I know a lot of my brokenness is a trauma response, but it's not an excuse. I'm pregnant. If I won't be better for myself, I have to do it for my daughter and her father. I have nothing outside of them because I did it to myself. And now I'm trying to get rid of them too. My entire life, people have been telling me to stop pitying myself, but this isn't pity. I'm not blind to how I punish others for my weakness. It's pure hatred.\n\nI hate myself so much that I have to change. I hate myself for making my boyfriend cry that I push everyone to grow except myself and that I need to let go of my abusive father. I love my father so much. He hates me and hurts me and part of me thinks I was born to pay for his mistakes, but he always comes to my side when I'm scared and alone. \n\nI can't have my daughter and boyfriend around that. They don't deserve it. They don't deserve me sabotaging myself to feel pain when my father feels too disgusted to keep hurting me. I don't know how to be better. But I want to try. I need to try. I have to try.\n\nI'm going to start by studying for the GED again and getting a better job. And I'm not walking away from my family.  Not anymore, not ever again. I want them to be proud of loving me. I already made a doctor's appointment for meds. I can do this.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pk15me/the_tiniest_of_baby_steps_happened/", "title": "The tiniest of baby steps happened", "social_network": "reddit", "user": "feathermafia", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1631066329, "permalink": "/r/DecidingToBeBetter/comments/pk15me/the_tiniest_of_baby_steps_happened/", "nsfw": false, "first_save": 1635436448.503736, "replies_charged": false}