{"id": "t5_2tand_t3_mp1zy7", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "Tonight I'm deciding one more time to be better. \n\nI've always written really harsh letters to my future self. Threatening letters, guilty letters, filled with anger, sadness or hope. Judging this future self who is yet to be, but who will probably do whatever it can with whatever it has. But you know what, I'll be kind with you, future self. \n\nSo many times I have felt hopelessness and despair at night, before going to sleep. Said it would be my last night. And so many times I have still decided to try again, the next morning. No matter how bad I was feeling. Today is one of them. I came home and cried hysterically, like a baby. And my heart is still broken. Finished a french show called Mental and it hit very close to home. Cried again like a baby. Reread a reddit post I wrote a few months ago where I was being kind to my future self and it helped me more than any other letter I've ever written. \n\nSo future me, I love you. If you're feeling sad it's okay. I'm feeling sad as well. But tomorrow will be okay. You will see your best friends again, and laugh. You will be part of a group and feel like you belong again. Meet someone you feel so connected to and you won't be able to wait to share everything about you with them. You will read a book and feel addicted, discover a show and feel like it's a masterpiece, taste some food and feel like you're in heaven. You will touch snow again and love the sound of it, look at a beautiful sky and feel at peace. Enjoy a hot chocolate or an ice cream in front of an anime. You will forgive yourself and learn from your experiences. Find a new song and listen to it for days while imagining different universes. \n\nNo matter how long it takes, you will look back one day and be proud of yourself. I don't know what to say to make you feel better but know that I love you, and I'm proud of how far you've come. You've done your best. It's okay now. You can go to sleep and wake up tomorrow. I love you so much. \n\nI can't wait to live all the things I can't imagine right now but you've probably experienced. \n\nWonderful things I know. \n\nLife is worth living.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mp1zy7/im_deciding_to_be_kind_with_you_future_me_finally/", "title": "I'm deciding to be kind with you, future me. Finally.", "social_network": "reddit", "user": "Moewen", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1618183599, "permalink": "/r/DecidingToBeBetter/comments/mp1zy7/im_deciding_to_be_kind_with_you_future_me_finally/", "nsfw": false, "first_save": 1635437161.783824, "replies_charged": false}