{"id": "t5_2tand_t3_nstsl5", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "78e8a1f4-314f-439f-8f40-daf7a6da355f", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Do you realize how many things you’re doing right? Maybe they all seem like autopilot right now, but they are more rare than you think and I’m proud as hell of all the things you do well.\n\n**1. You don’t give up**\n\nI’m not saying it’s easy. I’m not saying you enjoy every item on your to-do list. But you’re doing it. You’ve been doing it. So many people gave up before they got as far as you have. You really want things to get better, and I’m proud that after everything you’ve been through you’re still in this. You work so hard and you never give up, and if you look back you’ll see how far that has taken you. That’s a lot to be proud of.\n\n**2. You genuinely care about people**\n\nYou probably don’t even give yourself credit for this. “If you can help someone then you do it, that’s just what you do” you might say. But a lot of people don’t. How many problems have you helped people solve? How many people have felt lost and you talked them through it? I’m not saying you’re perfect, but I’m so proud of the impact you have on others. You care about them, and it doesn’t even matter how many you’ve helped. If you’ve helped one person then the world is better because you were here. Everyone you’ve helped is lucky you’re here.\n\n**3. You’re not afraid to try things**\n\nOkay, maybe you’re kind of afraid. But you still do it. Most are too scared of failure to try new things. You might feel fear, but you know moving forward is more important. I love that about you. You try things and learn from mistakes and keep trying. You’re like a relentless archer that kept shooting and shooting and got closer with every arrow. Very soon you’ll have so much practice you hit the bullseye every single time. You are creating the life you want for yourself, and it’s closer than you think.\n\n**4. You take care of yourself (kind of)**\n\nBecause I care about you, I want you to take care of yourself. And you’re decent at it. I think you still work too hard sometimes, and you give away a ton of time to other people. But I’ve seen you set boundaries, I’ve seen you cut out toxic people that were holding you back, I’ve seen you take time for yourself when you really needed it. I don’t think either of us are perfect at this. But you’re important to me and I’m glad you take care of yourself the best you can.\n\n**Conclusion**\n\nI know it feels like there’s a long way to go, maybe you’re not where you want to be. But please give yourself credit for everything you’re doing right. More people look up to you than you realize, you’ve made a difference in more people’s lives than you realize, and you’re doing more things right than you realize. These were just a few. Thank you for being you. None of us are perfect, but there’s a lot of people who are really glad you’re here.\n\n**Further Reading:** This letter is to my friend Charles, but if you do those 4 things then I’m proud of you too. I found Charles after I read The Book of Joy by the Dalai Lama and Desmond Tutu. That book taught me how important meaningful relationships are and taught me the tools to go out and create some (compassion, empathy, gratitude). Because that book helped me create great relationships (and therefore joy) I think you should read it too. \n\nWishing you all the best - MattTheMentor", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nstsl5/im_proud_of_you/", "title": "I'm proud of you", "social_network": "reddit", "user": "MattTheMentor", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 33, "down_vote": 0, "creation": 1622892864, "permalink": "/r/DecidingToBeBetter/comments/nstsl5/im_proud_of_you/", "nsfw": false, "first_save": 1635437323.4772267, "replies_charged": false}