{"id": "t5_2tand_t3_pl0iah", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1", "e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "After I went to school, I got a job as a designer in a corporate environment. I really bonded with my  coworkers, but the management was completely toxic. Regardless, I dove my head into the work. After years of gaslighting, manipulation and miscommunication, I finally snapped. I was numbing all of this with an unhealthy amount of alcohol. I was quite literally killing myself, as I found I already was showing signs of liver damage. My internal pain and bitterness was not only hurting me, but also my relationships. When I reached my personal bottom, I decided to go to therapy. Therapy revealed just how broken and insecure I was. This all prompted a major personality overhaul, and helped me deal with a lot of struggles from my past. I quit drinking, started eating healthy and lost 40 pounds. I gained the courage to quit my job and find something better. I now work for a small design firm, where I feel completely accepted for who I am. My manager values my personal and career growth. With all of my extra mental energy, I felt empowered to learn a new program that would help our company get new clients. Tomorrow I start my first day as a professor teaching that program. I couldn’t be happier about my progress. I feel truly fulfilled, and feel more ready than ever to keep writing my narrative. Coming from a rural Midwestern town, most of my friends and family don’t understand my progress. Figured this would be a safe space to share a little bit of my story of deciding to be better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pl0iah/i_quit_drinking_quit_my_toxic_job_and_went_to/", "title": "I quit drinking, quit my toxic job, and went to therapy. Now I’m in a job I love and tomorrow I start my first day as a college professor.", "social_network": "reddit", "user": "austinmclark", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1898, "down_vote": 0, "creation": 1631202773, "permalink": "/r/DecidingToBeBetter/comments/pl0iah/i_quit_drinking_quit_my_toxic_job_and_went_to/", "nsfw": false, "first_save": 1635436114.039385, "replies_charged": false}