{"id": "t5_2tand_t3_lr4xtp", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "I see a lot of posts about people currently having a hard time, and it’s really valuable to have a place to go to talk to people who get it. It’s also good for me to read some stories to remember exactly what it felt like like for so long. From a book I read once: “Depression is a slower way of being dead”. I went though abuse, being poor, foster home, friends die when I was a kid, drug & alcohol addiction, rehab, lots of psych pills, psych facility for suicide, more psychologists than I can count, military service overseas that messed me up a bit, ECT... the whole gambit.\n\nLooking back though, I wouldn’t change it. The simple fact is that I like who I am now after the storm has cleared. I don’t think I would want to experience those things again, but they’ve taught me things I don’t believe I could have learned any other way. Resilience, mental toughness, hard work, empathy, enduring pain for a purpose, patience. Those sorts of things. I eat well and exercise as a habit now because I forced myself to do it to try to get out of depression. I can play guitar because of all the years I spent alone with nothing to do (guitar relieved my anxiety and kept my mind occupied). It’s allowed me to be there for a few close friends who opened up to me about their depression and thoughts of suicide after I told them what I’d been through. All of the reading I’ve done has pushed me to see things deeper than I would ever have before and to learn about creating true meaning and a strong personal identity. I believe I handle pain and loss better now than most people because I’ve had 25 years of battling through it. I still have rough times, low weeks and electrified/hypomanic weeks, but overall it’s worlds better.\n\nIn the end it’s shaped me. I wouldn’t have believed at 15 years old I would come to appreciate my depression. Not to be dramatic, but those thoughts don’t come easy with a gun in your mouth. But now that I’m on the other side of the precipice I’m very thankful I never gave up.\n\nFor you, maybe things will improve, and maybe they won’t. The point is you’ll never know if you don’t try every treatment available to you. It took me 25 years to find the answers, and the journey has taught me so much that I use in my daily life beyond recovering from depression. Like most of life, the journey is the thing.\n\n“As the sun seems brighter and more clear when it comes on a rare day of English summer after ten months of dismal skies than it can ever seem in the tropics, so recent happiness feels enormous and embracing and beyond anything I have ever imagined.” - Andrew Solomon\n\n... or in other words:\n\n“If after every tempest come such calms,\nMay the winds blow till they have waken'd death!”\n- Shakespeare \n\n\nTLDR:\n\n“Be patient and tough, someday this pain will be useful to you”. - Ovid", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lr4xtp/choosing_to_see_my_depression_as_something_thats/", "title": "Choosing to see my depression as something that’s shaped who I am today in a positive way.", "social_network": "reddit", "user": "RagnarStained", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1614145297, "permalink": "/r/DecidingToBeBetter/comments/lr4xtp/choosing_to_see_my_depression_as_something_thats/", "nsfw": false, "first_save": 1635438006.4788098, "replies_charged": false}