{"id": "t5_2tand_t3_6yqj6u", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "I'll try not to make this too long, I know it's a rant but I need to put this somewhere where hopfully people read it.\n\nMy Mind is Conflicted and ripping in two places, and I feel like I'm giving too much time on certain things and people. One side of me wants to keep doing this after all I done and be good to them, and the other I say is a \"Wolf\" and just wants to shut everyone out, not give a crap, and be to himself for who knows how long and work on improvement. Sounds good but...let me tell you where I'm at:\n\nRight now I'm in a college, waiting for a \"friend\"(Lets call her Eve) to get out class. She's my \"friend\" I say because we do a lot of \"stuff\" when we are alone and denies being a relationship. Although I love Eve dearly and she does too, she doesn't want to be with me, and openly admits to me flirting with people and possibly going with them sometimes. There are also times where she was close to having sex with them just because.\n\nNow I know your probably thinking, \"why don't you leave this girl, clearly she's out of wack?\" Not so simple.\n\nWhat happens when you are literally someone's last hope of sanity? Like literally their only peace.\n\nThere has been a couple of times where Eve contemplated and almost committed suicide with her depression pills. She lives in a home that is not exactly the place for peace. It gives her a ton of stress, and she has no freedom to do much for two reasons: One, let's say she has a overweight family member that asks to do everything for her. Eve can't be out too long because this family member practically relies on her for many things. Without Eve she will sit in her room, Eat, sleep, not do a Damn thing. \n\n\"Well why can't Eve tell her no?\" Low self esteem. And this person will guilt trip/manipulate her and make her feel bad. Can't do anything. If I say something, welp, good luck trying to see Eve now.\n\nAlso two: There is another family who threw his son at her, who in short, total brat. He doesn't listen, give a attitude, pretty much very out of line spoiled child. Beatings don't do much, he still doesn't listen. And the family member isn't good either; puts her down, throws unescessary responsibilities at her, and is a free loader to boot. Oh yeah, this person hates the first family member, and they squabble, a lot.\n\nCompounded with Eve' s last breakup two years ago, which caused her to have a total meltdown, and to stay in a hospital for a couple days, you have one mentally troubled person. Therapy doesn't work...\n\nI work.\n\nWith me she's happy, bubbly, no stress, and just enjoys herself. If I'm not there, heaven forbid her family does something or gets crazy. Which is why I'm extremely special to her cause I make her really happy, and helped her through so much pain over the years. \n\nBut I'm stuck....because inside me wants me to be extremely wealthy.\n\nEver since I was 8, and I saw a Porsche for the first time, I wanted to be a millionaire. You ever had a nagging voice in your head? This is mine every time I try to apply for a job or an interview:\n\n\"You're better than this.\"\n\nWhich I believe I am since high school, I heard this from teacher's and friends. They saw me as an achiever, which is why I try to be perfect even though there is no such thing. I can't see myself with a job, but with a project that makes me get to that point of passive income over my year of living. I had jobs before, each one I never liked, whether dishwasher or server.\n\nBut what happens when you have family members that don't believe in you and practically force you to do something you hate? Which also conflicts with your soul, telling you to frontload your goals and be very busy until you reach a particular point.\n\nMy Mind races, now I have trouble sleeping, because I know what I'm supposed to be. I see myself as this extremely social person who can network and build success for himself, but I can't do that with this problem I have. I want to achieve success, because a fire in me believes I can. At this point, with high expectations from family members, forcing me to do something I don't want, and with a friend who relies on me for sanity, since nothing is working besides me, I don't know what to do. Only $170 to my name, I want to work with this to start off steadily.\n\nI want to reach my peak, but don't know where to begin. I want answers, advice, criticism, anything. I'm lost with the flow right now.\n\n\n\n\n\n\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/6yqj6u/close_to_ruin/", "title": "Close to ruin", "social_network": "reddit", "user": "Mr-Aran", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1504822199, "permalink": "/r/DecidingToBeBetter/comments/6yqj6u/close_to_ruin/", "nsfw": false, "first_save": 1635437186.2547724, "replies_charged": false}