{"id": "t5_2tand_t3_pj221w", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "Hey, so for a while I've been feeling very bad because of something that's been happening to me that I keep reacting to really badly. \n\nPretty much, an online friend of mine's been paying next to no attention to me, and it really sucks. We've had an incredibly great friendship, we've had a ton of fun together, we helped each other a lot (and I especially helped them \\[gender identity stuff, spending time together, helping them out with some stuff etc\\], I think I'm the main raison along with their recent partner that they're at the highest point in their life, and they themselves said I did contribute to this point), we met up physically (been 3 weeks), we discovered lots of stuff together, we also fell in love even if at different points which made it so we didn't end up being together, yadda yadda... just to say we had a great relationship so far.\n\nProblem though, ever since we came back home from the trip we had together I noticed they didn't really put any effort of their own in the friendship. Now, they did get a partner while I was at the trip which can and is a big reason as to why they don't spend as much time as we used to. They did find another friend they seem to have a great connection with and, that's great. But on the other hand, it just feels like I'm being thrown in the trash. We shared so much shit, we met up together irl, we discovered tons of shit, and now what? Because I've been sending them DMs, I've been trying to put effort in that friendship, but either I didn't get any answer or got a response 10 hours later when beforehand they responded almost directly and we engaged in long conversations or we called, played games etc. and we also talked about playing on a Tuesday when it was a Sunday, and when I tried to remind them on Tuesday they didn't respond at all and they said they forgot, and while it's technically fine (altough they said they were testing their GPU so they could've just checked my DM since they were online on Discord) I know that wouldn't have happened before the trip because we used to stick together a ton. Just to say that when I approach them first, I either don't get any effort back or get some effort that feels very out-of-place considering the state of our friendship before that trip we did together, and when they approach me (they sent me a dumb video we laughed and reacted to, and when I asked \"so how's stuff going?\" to try and have an actual conversation I didn't have an answer back) it doesn't last **literally** longer than 5 minutes and when they say we'll play they end up forgetting, which again is fine cause forgetting is shit that happens to everyone! But it feels dumb when I try to remind them and not have a single answer the entire day when again I know that wouldn't have happened before that famous trip. I keep feeling forgotten and even betrayed, because I put so much effort into something that ultimately doesn't change, in hopes that it does change into an actual friendship that we had before that trip instead of me trying to come up to them, barely getting anything back and then giving up on the friendship that I so miss.\n\nI'm trying to think of what went wrong there and I genuinely can't think of anything bad I did. There was like, one thing I did that was after the trip (we adressed it) but it wasn't so bad that it's the reason I get constantly ignored after it was adressed. A friend does get the same treatment (of being ignored almost all the time) as well who didn't do anything wrong towards them.\n\nDoes anyone know what I should do? I've talked about it to this same friend who had the same treatment and they told me I should talk about it with that friend but I'm genuinely lost in what I should do. Should I talk about it ? Should I just wait until they come back to me ? Because when they sent me that dumb meme I thought they were putting effort into this friendship just to end up being ignored again and feeling extremely hurt, and I'm scared that would happen again. I suppose I can wait for them to come back again, because again when I put effort into it it doesn't avail to anything. \n\nThis all puts such a heavy mental toll on me. I have to be honest, It's been pestering my mind for the past 3 weeks and I've noticed myself being a lot more tired. Sure, school started again on my side but it's really not far-fetched to think this has a big role in my mental and physical tiredness. If anyone has any tips or ideas on how I should think about and approach the situation, I'd be really thankful. Thanks in advance and hope everyone has a great day ❤️", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pj221w/i_feel_hurt_because_i_feel_forgotten_in_a/", "title": "I feel hurt because I feel forgotten in a friendship, help", "social_network": "reddit", "user": "Farowlol", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1630943522, "permalink": "/r/DecidingToBeBetter/comments/pj221w/i_feel_hurt_because_i_feel_forgotten_in_a/", "nsfw": false, "first_save": 1635435089.90809, "replies_charged": false}