{"id": "t5_2tand_t3_n3puzx", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "  You definitely read the title correctly, the guy that typed this is totally a manipulative scumbag and after his girlfriend broke up with him today. He’s come face to face with reality of the fact he can’t take of hold accountability for anything, and he puts up this tough guy front when in reality, he’s a quiet depressed loner.\n\nMy girlfriend and I where off and on a lot, we were always bumping heads and break up over stupid stuff, like me being distant and etc. \n\nInstead of manning up and being honest about why I was distant, I started blaming it on my anhedonia and introverted nature. Sure, that may be true but I was distant because I only wanted to have sex with her whenever I wanted and I’d avoid her after going ghost, yet I lied to her and not just her but myself. After a while of lying to yourself, even you start to believe it.\n\nWe ended up in a really big argument one night and I decided that I was gonna change for her, I was gonna open up more and enjoy time with her and let her in, but after so long of lying I couldn’t. It truly started to feel like.. “Just leave me alone but come over whenever I want.” maybe it was always like that, and things got worse.\n\nShe realized things weren’t improving but I’d lie to her to keep her around, “I’m changing for you, we gonna be good just wait on me.”, just to only text her when I wanna see her. I was lying and manipulating her, we’d get into arguments and I’d blame it on my past on why I act the way I do towards her, I’d always find some way to flip things back on her and I’d come up with lies on the spot to make myself feel good, to comfort my shadowed ego, to help me hide the pathetic reality of who I really am and what color my soul is.\n\nThis isn’t the first time I’ve done this, I did this in my previous relationship. I always become so manipulative and controlling for my own benefit, I’d act certain ways without even realizing it, it felt so natural yet so forced at the same time. On the outside it was one way and looked shiny, yet on the inside the light was dim and got darker the further you went and right in the center was me. \n\nUsing the good females in my life most men would kill for as just objects, I’m a disgusting person.. with no type of morale, no honor, nor self respect. \n\nSo she broke up with me and I reversed it and put the blame on her again, and she ended up saying never mind, but I realized what I was doing. Is this all I’m going to amount to? Tricking women for a orgasm for time to time instead of working on myself trying to become the young man I can be, to capitalize on my potential? So I let her go, I told her I respect her decision and that she’s doing what’s best for her. That she finds a man that properly knows how to treat her, I admitted everything to her and she called me out my name and blocked me. \n\nI took a deep breathe and cried, and today at 2AM in the morning, I decided. I’m going to change for real, I’m going to become the man I envision my future self to be, I’m going to build my path and become kind and successful, genuine and charming, intimidating yet seductive, fierce and sweet at the same time, I’m going to look good and feel good. I’m going to learn to appreciate the people in my life and smile towards the bigger picture. I got stuff to do, a life to live, work to get done. \n\nI don’t wanna be that manipulative scumbag anymore so today I’m deciding to be better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n3puzx/im_a_manipulative_scumbag/", "title": "I’m a manipulative scumbag.", "social_network": "reddit", "user": "ReminiscentWhale", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 25, "down_vote": 0, "creation": 1620024609, "permalink": "/r/DecidingToBeBetter/comments/n3puzx/im_a_manipulative_scumbag/", "nsfw": false, "first_save": 1635435816.1238253, "replies_charged": false}