{"id": "t5_2tand_t3_b14v36", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "When we think of traits people could possess, we think of things such as hard-working, reliable, intelligent, well mannered etc. What we don’t think of is those traits are an accumulation of a foundation set by oneself. You’re probably thinking Anthony what the fuck are you talking about, well let me explain.\n\nHow can anyone be hard-working if they don't have the discipline to push past mental barriers, how can someone be reliable when they don’t have routines set in place to keep them reliable? What I’m getting at is there are 4 traits everyone should implement first before they try to pursue anything in life.\n\n* Repetition\n* Routine\n* Habits\n* Discipline\n\nYou see these 4 traits here are compounding traits when you can implement these traits well other aspects of your life will begin to grow and flourish. Your brain is literally a combination of neurons, these neurons fire daily and are a mixture of your habits and routines. We are literally living the same day over and over again through our subconscious mind. The worst thing is we don’t even fucking know we are doing it. So when you repeat something countless times it becomes ingrained in your mind. “Neurons that fire together wire together”\n\nIt’s ok getting all fired up for your new job but if you don’t have the 4 key traits set in stone I can guarantee it won’t be long before you begin to fall off the mark and head downhill. Have you ever noticed a colleague at work begin to go off the rails a bit? He was such a good employee, to begin with, but then after a while, you started to notice a decline in his motivation and enthusiasm to do a good job. These are a combination of experiences that he has now associated with that job, he’s started to repeat certain bad habits that now make him late for work. Instead of going to sleep at a reasonable time, he’s staying up till 2 am watching his/her favourite TV show.\n\nYou might even notice an employee who isn’t very good at his job at all, it then begs the question. Why the hell did he apply for this job anyway, or even worse who the hell thought to give him that job role was such a good idea? When people are not fully optimised then the results they produce are mediocre at best. I understand that sometimes the jobs we work or the careers we pursue are not fulfilling and it can be hard to motivate yourself to stay interested. On the flip side though if these 4 traits are set in stone then at least you can begin to craft a lifestyle you want to live.\n\nSo let me break down these 4 traits and give a detailed explanation on each one. Ready motherfuckers?\n\n1. Repetition\n\nI’ll say it till I'm blue in the fucking face and the proof is in the pudding. What we repeat, we repeat over and over till it becomes so ingrained in our mind, it actually feels strange to not do that task. This goes for everything in life, if you sit and eat the same shitty foods then when you finally want to go on a health kick then you struggle to actually maintain that health kick. Why do you think forms of media are so popular? YouTube, Spotify, Instagram, FaceBook, News and Television. It’s because for the majority of our lives we have been exposed to these forms of media. No, wander this generation known as the millennials is fucked. They are literally repeating these things on a daily basis and it's actually fucking their minds up when it actually comes to doing meaningful tasks.\n\nSo how do you break the pattern of something you repeated for such a long time? It’s fucking easy and this is the clever part all 4 of these traits are interlinked with one another. To form good habits you must implement a routine. A routine that you do on a daily basis, this routine requires discipline, because you aren’t going to want to do it, to begin with. Once you conquer the first mountain of change, that routine becomes a habit, a habit that if you don't repeat will feel strange, just like the shitty routines and habits you repeat now. It would certainly feel strange if you didn’t do them.\n\n2. Routines\n\nA routine is something we do on a daily basis, we all have one. The majority of people’s routines look like this. Typical weekday. Wake up, shower, shave, brush teeth, get changed for work, commute to work, work, eat lunch, work, commute home, gym, cook food, watch television and finally retire to bed. Pretty standard right. Let’s spice that routine up a little for someone who’s a tad lazier. Wake up, hit snooze, sleep more, rush to get ready for work, commute to work, work, social media, work, social media, lunch (eat shitty foods), work, social media, commute home, skip gym, order takeaway, go to bed. Rinse and repeat each day for 60 days and bang you have a routine that would feel strange if you didn’t do it again the next fucking day. As you can see both routines are quite contrasting but the second one is something a lot of people do. No, wonder that in such a short space of time they can become even lazier, not value anything and gain a shit ton of weight and a shitty attitude. The second routine is this person not being fully optimized so when it comes to doing something meaningful, he’s like “meh can't be bothered today”\n\nLike I said they are all compounding traits so it will begin to affect other areas of your life, laziness will ensue and you neglect to clean your place or wash your dishes and eventually neglect to look after yourself. No wonder the number of cases of depression are on the rise. It’s easy to blame depression on negative results but when you don’t have certain aspects in check it begins to take its toll as well over time. It’s even more predominant in people who know what they need to do but they don't actually fucking do it. \n\n3. Habits\n\nGood habits take a lifetime to form and are easy to break, bad habits take less time but are even harder to break. Why? It’s simple, it's far easier to commit a bad habit then it is a good habit. It’s easier to get out of bed at whatever time you feel than it is to drag your ass out of bed at 6 am. It’s easier to order a takeaway then it is to stick to your diet regardless of how shit your day has been. Do you see where I’m going with this? When you decide to change any aspect in your life, drastic change is always non-favourable, Why? You won't be able to stick it out for very long, your mind won’t be able to cope with the sudden influx of change to the routine. That’s why all the January gym goers don't last past two weeks. They go full tilt for 2 weeks but the last 351 days of the year they did jack shit and guess what? Yep, you got it because they repeated this routine for the last 351 days why are the 14 days of torture going to make you change?\n\nBaby stepping habits are the easiest ways to implement change, getting yourself into a routine of hitting the gym has to start with you actually just going to the gym. This is for the serial procrastinators for some it won't be so drastic when you’ve become so accustomed to this shitty habit and routine then even the thought of going to the gym is daunting as fuck. Try just going to the gym, don’t actually work out, just go to the gym. Then after a week of doing that try a 15 min session then build on that. Slowly but surely you will work your way up to that routine where you're hitting the gym 5 times a week for 60 mins a time or whatever your goal is.\n\nTrack your progress on a piece of paper, right I hit the gym this many times this week for this long next week i'll up the ante and do it for an extra 15 mins. 9 times out of 10 this won’t happen and you will end up getting in a full workout. This method can literally be applied to any aspect of your life as well.\n\nBut Anthony what about all these people who do mad shit and lose like 5 stone and get in the best shape of their life, they didn’t baby step, they just hit it full tilt. Well, I can guarantee that somewhere someone has said that if they didn’t shape up and lose weight soon they will be in a pine box, 6ft under the ground. There is no bigger motivator than death and fear trust me.\n\n4. Discipline.\n\nThis is the shitty part, discipline is probably the most important one. Trust me even when you’ve been going to the gym for like 5 years, or consistently getting up at 6 am there will be days where you don’t fucking feel like it and that’s where discipline comes in. Discipline is knowing the right thing to do and doing it regardless of how you feel. So when the alarm clock is ringing and it feels far easier to hit the snooze button than actually dragging yourself out of bed. You will drag your lazy ass out of bed regardless.\n\nYou might ask, well what about motivation? Let me tell you a little secret motivation is complete bullshit. I’ll give you an example, you ever watched a motivational video on YouTube? That shit really gets you fired up listening to inspirational quotes from people such as Will Smith, Jocko Willink and Joe Rogan. You feel all fired up ready to crush life and then you wake up the following day and revert back to your old ways. Sound familiar? That’s because motivation is bullshit, it’s basically an emotion, you are feeling excited and full of enthusiasm in that moment. Doesn’t mean it’s gonna last, which it doesn’t. This is why, discipline is so fucking powerful. It’s the kryptonite of the mind, you basically negate what your mind is saying and do it regardless.\n\nSo if your a lazy piece of shit how do you go about implementing discipline into your life? Honestly i think you know the answer and it’s in everything you just read above this section. Habits/Routine/Repetition, when you start building habits and you repeat them daily regardless of how you feel you will begin to discipline yourself. \n\nWhen you start to define yourself in a new light and begin to change, your mind will scream all types of shit at you “You aren’t good enough” “You're going to fail” “Look that blog post you wrote never got read” Overtime, these voices will begin to fade. The more you repeat the habits you want to implement the more the mind will begin to accept the fact that it’s becoming part of your lifestyle.\n\nRemember. **To form good habits you must implement a routine. A routine that you do on a daily basis, this routine requires discipline, because you aren’t going to want to do it, to begin with. Once you conquer the first mountain of change, that routine becomes a habit, a habit that if you don't repeat will feel strange, just like the shitty routines and habits you repeat now. It would certainly feel strange if you didn’t do them.**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/b14v36/4_traits_everyone_should_master/", "title": "4 Traits Everyone Should Master", "social_network": "reddit", "user": "Dextorian", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 19, "down_vote": 0, "creation": 1552592989, "permalink": "/r/DecidingToBeBetter/comments/b14v36/4_traits_everyone_should_master/", "nsfw": false, "first_save": 1635436555.0160978, "replies_charged": false}