{"id": "t5_2tand_t3_c67ohb", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "This is slowly becoming one of my favorite inner forums on  Reddit, so quickly I just want to say thanks for providing such a welcoming place to speak freely. It feels like I can finally word dump into a place that will usually have responses of encouragement and support. That feels great from the other side of the computer :) \n\n&#x200B;\n\nI'm new to this community, so I think it would be best to preface this with a short introduction. \n\nMy name is Lucy, I'm 19 years old and currently studying psychology at university. I've come to this side of Reddit mainly to hold myself accountable for choosing self-care every day, and also to offer support to others when I can, or give insight. \n\n&#x200B;\n\nRecently I've been struggling with my self-image and self-care. I tend to look at other girls my age and even my friends and envy how  put together they are, how they always have their hair and nails done, get good grades and how literally whichever angle you look at them, they're soft around the edges and give off REAL ANGEL ENERGY (lol).\n\nI know its a waste of time to compare yourself to other people. For most people, you're probably right, but for me, I have an idea in my head of how to reach that standard for myself and they are my prototypes. I know that when I put effort into my appearance and take care of myself I feel like I'm accomplishing something. But its definitely been lacking recently, and especially while I'm at school. \n\nWhen I get stressed, BORED, or sad, my self-care goes out the window. I stop showering, brushing my teeth, doing my homework, studying, making healthy food, leaving my room - the whole works. You would never know by looking at me that I struggle with these things, but when I start to spiral, I spiral hard.\n\nSo yesterday after work I went to my nearest pharmacy, picked up some nail polish, a face mask and a new body wash to inspire me to take care of myself. I spent a whole hour and a half (WOW! look at me go lol) showering, shaving, face masking, painting my nails, moisturizing, and I felt so much better.\n\n&#x200B;\n\nI just wanted to come here to hold myself accountable to take care of my mind and body. To accept my body for where its at right now, and love it unconditionally, no matter if its where I want it to be or not. I want to love myself as though I already emulate my friends who \"have it all together\" and I think once that happens the rest will fall into place. \n\nSO anyways, Hi! Nice to meet you. I can't wait to explore this community more. :)\n\n&#x200B;\n\nxo", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/c67ohb/hi_im_new_here_and_just_want_to_word_dump/", "title": "Hi! I'm new here, and just want to word dump :)", "social_network": "reddit", "user": "lucysantilli", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 36, "down_vote": 0, "creation": 1561653180, "permalink": "/r/DecidingToBeBetter/comments/c67ohb/hi_im_new_here_and_just_want_to_word_dump/", "nsfw": false, "first_save": 1635438282.6018772, "replies_charged": false}