{"id": "t5_2tand_t3_lheg5u", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "I'd like to keep this short and the point. \n\nSocial media has pushed this idea of working 24/7 with minimal rest calling it \"the grind\", how you should sleep at 1AM and wake up at 4:30AM and get back to work. There may be exceptions in the population who can somehow pull this off, but even for them I'm sure it's a limited amount of time they can do it until it begins to negatively effect their lives.\n\nI know everyone has different sleep needs, some can sleep for 4-6 and feel fine with a bunch of stimulants, and some need a little more than 8 hours. Regardless, figure out what your real need is, that actually makes you feel alive and well when you're awake and try to hit that amount every day.\n\nStudying, starting a business, whatever it is, none of this is easy, this journey is not a quick one, you won't get from point A to B in one week. Focus on sustainability, quality over quantity, it is a marathon. \n\nGet your sleep on point, it's one of the few things you can and should manage. Your brain/body will thank you, your life quality will improve, and your work quality will improve. \n\nGo get it, have a great day!\n\nEdit: Thank you everyone for your comments, and the awards, I really appreciate it! I've been struggling with overlooked things such as sleep, diet, for most of my life. I've learned that something like this if you don't figure it out about yourself, it can be an uphill battle. It's un-winnable, until we come up with some gene editing that can allow us to sleep less, which is not something I'm aware of currently. \n\nThe most important things are the things you can manage, to better your quality of life, double down on those, you will be better equipped to handle most anything life throws at you. (Within reason)\n\nIf you think this can help someone then please share it, other then that, thank you again and I hope you all have a wonderful day. \n\nAnd remember, You can be better tomorrow than you are today.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lheg5u/stop_neglecting_your_sleep/", "title": "Stop neglecting your sleep.", "social_network": "reddit", "user": "XManeEX", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1480, "down_vote": 0, "creation": 1613023816, "permalink": "/r/DecidingToBeBetter/comments/lheg5u/stop_neglecting_your_sleep/", "nsfw": false, "first_save": 1635436461.8803067, "replies_charged": false}