{"id": "t5_2tand_t3_m7cwk8", "request": ["0d7e25ab-b0e9-4c71-b798-0a512354dd36"], "text": " I stopped smoking two months ago.\n\nI’ve been working out everyday for 3 months (even in rest days I end up doing yoga or walking. Out of pleasure, escapism… whatever you wanna call it.\n\nI’m such a great cook too. I love dairy and carbs more than life but really it’s mostly veggies, fish, nuts, fruits. I barely crave junk food but the times that I do indulge I don’t make myself feel guilty anymore. I also have never looked better and I don't have to keep track of my weight.\n\nI also got a great psychologist. She’s an advocate in women’s rights with 30 years of experience and I feel so safe around expressing myself.\n\nI floss, brush my teeth and don’t skip a day of skincare. I meditate within the first hour for 15+ min.\n\nI turn off my phone and read at least an hour every night and I try to stay away from trashy tv. Only trying to watch International/Art House/ Classical movies/documentaries.\n\nI read on mindfulness, stoicism, non-violent communication and other topics. (Podcast, Audiobooks, YT)\n\nI gave myself a break from dating and while sex do sometimes happen with partners that I trust. It’s the first time that I genuinely couldn’t care less if I ever see them again. I used to be so obsessed with how men perceived me, if they texted, if they didn’t. I am now truly invested in taking care of my needs first.\n\nDon’t get me wrong, there’s still things that are so hard to manage. I can’t seem to find energy to look for a job. I feel so anxious about going back to work, to people. I mostly feel like an impostor. That I’m not worthy of the things that I want. That I don’t deserve it all if there’s so much suffering in the world. I am really trying to make it my priority but hey, this is me trying SO hard to get better. I procrastinate a lot too, I still panic at making calls or small interactions. I lay awake with sense of regret of not doing things sooner, or re-doing everything but I so try to let it go. On top of having my heartbroken a year ago, friendship fallouts, turning 30, losing my job and a pandemic. And I could go on forever in how things could be better.\n\nI am grateful that I’ve given myself the chance to be a version of myself that I like. The chance to not be that fucking miserable. I couldn’t stand being someone I hated, it was so tiring. I’m so very happy of the woman I’m becoming and am. Everyday I realize more and more of the beauty I carry. The beauty that comes from healing. I am once again, excited and hopeful for the future :D", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m7cwk8/releasing_a_decade_of_unhealthy_habits_anxiety/", "title": "Releasing a decade of unhealthy habits, anxiety and depression one day at a time.", "social_network": "reddit", "user": "niurkamarc420s", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 75, "down_vote": 0, "creation": 1616021359, "permalink": "/r/DecidingToBeBetter/comments/m7cwk8/releasing_a_decade_of_unhealthy_habits_anxiety/", "nsfw": false, "first_save": 1635437746.2062273, "replies_charged": false}