{"id": "t5_2tand_t3_o9q1kj", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "e234981c-b061-4d83-8134-70d441847f74", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I really don't know how to start this because I have so many problems that have so many avenues and will take so many years to fix. I don't even know where my story begins, probably high school, probably sooner, probably later - but either way I'm here. So as I look around at the majority of my companions and close friends, I can see that they all are pretty much emerging into their lives while I just...haven't. Most of them are in committed relationships (long-term, engaged, or married), most of them live on their own (or own property), most of them are working good/high paying jobs, most of them have traveled to many places, and pretty much all of them lived out their 20s in a decent manner. I on the other hand am behind in several areas.\n\n**I'm still a virgin -** No one, not even my closest friends know this. People may suspect it, but this is a terrible secret that I keep close to my chest and I know that being one at this age is a death sentence. All of my friends know I've never had a girlfriend but I've just made up stories of hooking up in college + after. COVID definitely didn't make things better. I pretty much missed my window to get it out of the way (college, I went to an all boys high school) and meeting women is significantly harder. I've never even kissed a girl when a large percentage of my cohort are sexually experienced. I'm going to have to fake this but I definitely don't know how. No one I know can relate at all. I'm pretty used to being the third, 5th, 7th, 9th, etc. wheel and it sucks.\n\n**I still live at home -** I've lived at home for the past 9 years. I started living at home junior year and commuting to college, mainly as a way to save money. I thought it was going to be temporary but a combination of debt, low earnings after school, and periods of chronic unemployment extended this to now. I live in a medium-sized East Coast city that I don't necessarily have any love for. I plan on moving out early next year, possibly somewhere a bit away from here.\n\n**I'm in debt -** I have lots of credit card debt from my periods of unemployment and trying to start my own copywriting business. I could have moved out in 2019 but I wanted to get rid of as much debt as possible so I took advantage of it. I planned on moving out in 2020 but a month after COVID hit, I was laid off. I am doing the same thing now (I have a job) and trying to just get out of this credit card debt. I know moving at this time would keep me still mired in credit card debt. I am tightening my wallet and biting down *hard*. Doing the Dave Ramsey approach.\n\n**Limited travel -** The last time I really traveled was 2015, to go see my aunt in Europe. I was 23 going on 24 then. I was optimistic, I thought that would be the beginning of travel for me. The last time I went anywhere was to New England for my friend's bachelor party and that was in 2019. A lot of my friends have done international travel multiple stints or have gone different places in the US.\n\n**No real social circle -** My social circle shrank after college (normal) then dissolved after I pulled the plug on Facebook in late 2016. I was always the one reaching out to people and going to events with these people I used to hang out with. I originally did it as a \"test\" to see which of them would notice. I had the feeling that I was always just an \"extra\" but I wasn't really sure. No one reached out. Several of them got married and I never got an invite. It hurt for sure but it made me realize that they weren't true friends. Now, I feel like I'm too old to really make new friends.\n\nI'm not a *total* loss, I do have some things going for me (though not much).\n\n* I'm 6'1\", so decent height\n* I weight 195 lbs of muscle, probably single digit body fat. I have had a gym habit of 6-7 years, 4x a week, definitely one of the only things that keeps me sane\n* I'm a musician, I play guitar and piano (still at a loss finding people to play with)\n* I'm relatively well read\n* Decently paid - 70k for main job + some freelance work\n* Work a remote job that I just got in April, meaning I can work anywhere\n\nNot really things that can make up for my deficiencies for sure and 8 years of lack of progress being out of college. Probably the biggest one is being a virgin. Nothing can make up for a lack of game and lack of getting girls when you were desperate for companionship (college and my 20s).\n\nBut unfortunately I still have a lot of time left on this planet and I wanted to get some advice on how to proceed.\n\nHave any other guys been in a similar situation and how did you deal with it?\n\nThanks for all the help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o9q1kj/seriously_behind_in_life_would_appreciate_some/", "title": "Seriously behind in life, would appreciate some insight (29M)", "social_network": "reddit", "user": "RoomForImproov", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1624904198, "permalink": "/r/DecidingToBeBetter/comments/o9q1kj/seriously_behind_in_life_would_appreciate_some/", "nsfw": false, "first_save": 1635435139.1328404, "replies_charged": false}