{"id": "t5_2tand_t3_m3198r", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "Salahuddin was stabbed and robbed while making a pizza delivery in Lexington, Kentucky on the night of April 19, 2015. \n\nWhen he delivered the last order that day, he was attacked by three men, severely beaten and robbed. And one of them even stabbed him. The wound was fatal, so he died very soon. He turned out to be a 24 year old Trey Alexander Relford and two of his companions. And here comes the final hearing. The hearing was attended by the murderer and by the victim’s dad - Abdul-Munim Sombat Jitmoud.\n\nBeing on the witness stand, Sombat Jitmund claimed that \"Forgiveness is the greatest gift\". He addressed Relford directly and said, “I’m not angry at you.“I’m angry at the devil,\\`\\`''I blame the devil, who misguided you to do such a horrible crime.” He continued: “I forgive you on behalf of Salahuddin and his mother.” \n\nAfter Jitmoud gave his statement, the Judge wiped a tear and called for a break in the hearing.\n\nWhen court resumed, Relford apologized to Jitmoud for his son’s death. “I’m sorry about what happened that day,” Relford said, wiping his eyes on the collar of his orange jail uniform. “I do applaud you because it takes a powerful man to know that someone has hurt them and to get up there and say what you just said. I can’t imagine the hurt, the pain. There’s nothing I can do ... I thank you for your forgiveness.”\n\nSombat Jitmoud stood, took a step or two toward Relford, and extended his hand offering a tissue. Then the two of them shook hands AND hugged each other.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m3198r/father_forgives_and_hugs_man_involved_in_his_sons/", "title": "Father Forgives And Hugs Man involved In His Son's Killing", "social_network": "reddit", "user": "AStorybyTet", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 13, "down_vote": 0, "creation": 1615498138, "permalink": "/r/DecidingToBeBetter/comments/m3198r/father_forgives_and_hugs_man_involved_in_his_sons/", "nsfw": false, "first_save": 1635436870.6609578, "replies_charged": false}