{"id": "t5_2tand_t3_l117fj", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "cec7edff-25dc-4102-8d8a-cc3d4b21f09a"], "text": "My mom has never been happy that I’m not Uber Christian like her and she used to have a lot of narcissistic tendencies that I honestly never thought she would be able to get past. Over the last 6 years she has though for the most part. She not only is pro mental health now but knows how to talk me out of a panic attack quickly. I got sick 5 years ago and it’s turned into multiple surgeries, many hospital visits, her having to come in to the city to help me out sometimes, her financially helping me because I’m now on disability (she an accountant so she’s super good at that shit too)\n\nThroughout all this though she would still try to guilt me into saying god bless on the phone every time we went to hang up. Exulting that my brothers even caved into her and say it each time, but I don’t lie about anything to her about emotions, or I didn’t. \n\nOn my birthday last month my grandma passed away in the morning, my grandma was my hero, her mom. It was incredibly devastating because it happened so slow yet so quick. She had severe Alzheimer’s and she was admitted to hospital 24 hours or less before it was decided to stop life saving treatment and 17 hours later on the morning of my birthday she passed peacefully. They wouldn’t even let my grandpa in the hospital room until they decided to stop life saving treatment and I was 3 hours away, mom 6 hours away so none of us could travel or get there to be with family because of all the restrictions. \n\nAfter she passed i decided to do anything necessary to help my mom grieve. My illness is terminal and I buried 7 other friends last year  alone so I’m no stranger to grief and stages of death. I’m probably the best person to have in a crisis because of how well I can pull people together and let them know it’s okay to have their feelings. So, I started saying god bless to my mom on the phone and suddenly she stopped saying it all together.\n\nI thought I was being clever and used reverse psychology and suddenly she wouldn’t bug me about it anymore.. we talked about it today though because I wanted to point out to her this change... she broke down crying and said it was because she was so mad at god. Not because grandma is with him now but because she prayed for a while to stop her pain but she never once thought it would be on my birthday. Oddly, all the female cousins in my family and me are born in December... my cousin had baby girl in December so the “trend” seems to be continuing.. but of all the days my mom was so angry that he took my hero on my birthday.\n\nOf course now I was crying too because so much happened in December. A family friend died, the surgery I’ve been fighting for that was finally supposed to happen got postponed, I had to cut ties with a toxic brother who made my family think I was the cruel one splitting up the family and then my grandma? All in 2 weeks? I’m 27 years old and I’ve buried 48 friends and family. My 11 year old niece who killer herself, my best friend and advocate, my brother from another mother when I was young.. then I dealt with being shunned by a community because of being raped. about two months after that I was diagnosed with my conditions and told if I was super lucky I’d get 10 horrible years and loose all my independence. \n\nAnd why has mom now stopped pushing her beliefs on me? \n\n\nMy mom was mad at her god for taking so much from me, and doing it again on my birthday. How the fuck am I supposed to deal with those emotions when I don’t believe in her god? \n\nSo yeah, I decided to be better. Now it’s my turn to step up and I told my mom about how I was reframing holidays to be less painful, that this was the same.  That we need to honour her, her and my grandpa had 70 years of marriage... that we every day we need to do bette and be better like her. This woman never once judged me for going goth, a 4’8 church greeter, never once made me feel pushed away because of my looks. She switched to knitting my black toques instead. The woman that always had made extra because she expected unexpected guests. The woman that without fail always showed up in my city the day of a high school band trip with two buckets of cookies for each band bus. \n\nI am the woman I am because of her, and my mom may have taken more after my grandpa than her but she has her heart even if she didn’t know how to communicate it before. So I sucked up my damn feelings about religion and I told my mom that it happened on my birthday because god knew that out of everyone I was the only person in our family who could handle it and help everyone else handle it too. Sometimes we have to say things that we might not believe in or make us uncomfortable to help others get through a bad situation in a healthy way.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l117fj/i_thought_i_used_reverse_psychology_on_my_mom_to/", "title": "I thought I used reverse psychology on my mom to get her to stop trying to guilt me into saying “god bless” when we hang up on the phone but the truth nearly crushed my heart and I’m the one who changed.", "social_network": "reddit", "user": "ladyinblack27", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 336, "down_vote": 0, "creation": 1611115256, "permalink": "/r/DecidingToBeBetter/comments/l117fj/i_thought_i_used_reverse_psychology_on_my_mom_to/", "nsfw": false, "first_save": 1635435542.7780447, "replies_charged": false}