{"id": "t5_2tand_t3_q42z7z", "request": ["b69cf201-6737-4217-b486-9096135546b8", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "I’m 28 years old and I suffer from PIED. I gave up watching porn sometime in Feb but I have frequently relapsed several times. I give up. There has to be a better strategy to refrain from all of this right? If yes, please let me know.\n\nLet me talk about my situation in detail here though.\n\nI have been watching videos since I was in 9th or 10th grade and it increased to everyday frequency since 2018/2019. I noticed my erections had rapidly become weaker and then gone. It was so hard to maintain one. I didn’t know what to do but I continued with PMO every night regardless. Now I am getting opportunities to hook up but I just can’t get it up. I don’t even get morning wood. I don’t know what to do at all. How do I get morning wood back? How do I get normal erections back? \n\nI think my lifestyle also hasn’t helped. I pretty much sit for long hours (12 to 14) at my work. When I’m home, I’m always sleeping on my bed. I rarely get any exercise, I have a really big stomach for a lean guy, I have low self confidence and low self esteem issues. I lose temper very fast these days. I’m currently unemployed and spend my time watching movies and shows all day long sleeping on my bed except for one hour when I exercise. I also have an unhealthy addiction to junk food as well. My will power to stick with something is literally dead or non existent. I have become extremely lazy too. Even to cook myself food, I become a slave to instant gratification. I really don’t know what to do here because no matter what I try, I fail.\n\nI’m willing to put in the effort to change. Can somebody please tell me how they overcame their problems and what they did to achieve that? How did you get your morning wood back? How did you get erections back to normal? I have no libido at all, like I haven’t felt horny in years. I also have death grip syndrome, I think. When I’m getting a BJ, I really don’t feel anything and I have never cum from that. I’m lost. I sincerely request you to give me all your suggestions and let me know the kind of things and experiences you guys went through so I can do the same for my life, I’m sick of being a loser and a fap loser too. I want to start winning and grinning. Please help with your advices.\n\nMuch love to you all, xoxo.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q42z7z/please_help_me_to_be_better_and_recover_from_this/", "title": "Please help me to be better and recover from this.", "social_network": "reddit", "user": "Heartonawave27", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1633715515, "permalink": "/r/DecidingToBeBetter/comments/q42z7z/please_help_me_to_be_better_and_recover_from_this/", "nsfw": true, "first_save": 1635436445.40564, "replies_charged": false}