{"id": "t5_2tand_t3_7ph0m8", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "I have so many various courses of action I'd love to be taking...but it seems like an immense amount of organization would be required for one to achieve all of these goals, let alone incrementally chip away at each one...does it seem realistic to practice all of these things daily? I have pretty much unlimited time. Just traveling Asia right now trying not to fall off into \"obscurity\" while out galavanting. I've been very undisciplined my whole life and am trying hard to change. I tend to fluctuate in and out of habits of self destruction and self improvement, and really earnestly want to put in the work to stabilize the ever-fluctuating relationship I have with my self. Here are the tasks I'm trying to organize my days around and try to do all of these at least often enough to progress, if not day in and day out. (Like I said, I'm completely free, and the only thing holding me back is myself, and perhaps the chaos of being abroad.)\n\n-to be in better shape (workout 5 days a week with bodyweight)\n-to be a better musician, learn music theory (I play guitar)\n-to become very well read\n-to practice writing (this is difficult for me unless I have a very quiet uninterrupted space, which can be difficult to consistently have while traveling out of a backpack on a budget. Also maybe this is an illusion?)\n-to do some kind of spiritual practice be it mindfulness or one-pointed concentration \"meditations\" (I reckon one doesn't need to sit with eyes closed to pay attention to the consciousness, I can drink milk tea in a busy ass city and be sharp as a razor if I were to muster the energy to diffuse arising derailing thoughts and emotions)\n-to learn a lot of yoga (not just the asana part but the whole 8 limbed practice)\n-to learn at least the basics of Hindi (going to India in a couple weeks)\n-to maintain all of these practices while still being open to explore new things while in an extremely novel environment\n\n\nIn addition to the above, I'd like to create passive income streams or at least manifest some sort of gameplan to achieve this when I'm at home again. Although, there aren't really many resources existing at home that would augment my ability to do this better than I'd fair doing so on the road, aside from a desktop computer and an environment where I can isolate and immerse in the creative/brainstorming process. I dropped out of highschool at 16 and reckon my best bet would be to create some sort of marketable content, namely writing of some kind, which when I have an idea in mind comes naturally to me. Never in my life will I work under anyone else unless I'm learning something of great value. Fuck a 9 to 5, that's never been for me. It's not super urgent but I'll bet it's wiser to begin the brainstorming process now even while flinging my brain at all of this near overwhelming novel information flowing all around me...and it isn't too difficult to do these things it's just a matter of being on point, consistently, and taking the time to do the things methodically and lucidly. It frankly annoys me how distracted I get from my work.\nAt home however I reckon it is far easier to maintain a consistent routine approach to tackling these processes in depth...perhaps that's what's lacking, a solid schedule. ---Say, wake up, do some yoga, go get some coffee and high protein foods after, do high intensity interval training in the hotel or outside my tent or whatever, then go out and acquire some post workout food, maybe do some reflective journaling over tea, then find somewhere nice to hang out undisturbed and practice music for some hours deliberately, then go for a walk and clear the mind, loosen up, sit somewhere new and quiet to read/take notes/learn a new language, get some more healthy food and handle errands, relax, then before bed devote an hour to creative writing or something? I'm super vague and ethereal in my thought process so my actions seem to reflect this lack of specificity aswell. \n    Really it interests me, any sort of time perceived as \"wasted\" or at least not mined for all of it's potential...like...if I'm not occupying my time with my crafts and loves and inspirations and sculpting my ideal Self, what worth is that time? What I mean is, psychologically, what is the allure of procrastination? Of self sabotage? Of not spending the days always doing these things?\n\nI have problems with eating lots of shitty food and then getting down on myself and succumbing to other forms of hedonism and frivolous distraction which in turn spiral me downward into a complacency to shirk my daily workload for becoming all I can be.\n\nI tend to oscilate between a type of mindset where I say\n\"Oh I'm young fuck it let's loosen up and have some fun\"\nAnd\n\"I'm young and have so much life in me that to waste the potential for growth so early on would be a tragedy\"\n\nI'm almost 22 and really want to live an enriched life but I either push too hard and burn out (as if to compensate for my extremely comfortable spoiled life of hedonism up to very recently) or am a complete lazy do-nothing who thrives on sensory stimulation and instant gratification.\nI'm sort of at my wits end with this up down cyclical resistance...but realize I have to sort of loosen up to get my grip if you understand what I mean.\n\nI understand how blessed I am and am not discontented with my life as it has been lived fully and deeply despite my youth, however as an idealist I am awake to the potential to self-actualize as a youth in my position and really don't want to squander my opportunities by giving in to the temptations of airily insubstantial ephemeral pleasures which exist in the easily accessible bubble of comfort I enable myself within...\n\nAnybody have any similar experiences/ could any9ne lend perspective on this dilemma?\n\nHopefully this \"you used to text box so fukyerpostm8\" thing doesnt happen. Really would love some input from someone who actually speaks english...\n\nBlessings,\n\nYour friendly neighborhood Dolphin", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/7ph0m8/so_many_ambitions_how_to_conquer_them_all_without/", "title": "So many ambitions, how to conquer them all without burning out?", "social_network": "reddit", "user": "Existencedolphinftw", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1515604429, "permalink": "/r/DecidingToBeBetter/comments/7ph0m8/so_many_ambitions_how_to_conquer_them_all_without/", "nsfw": false, "first_save": 1635436100.5926862, "replies_charged": false}