{"id": "t5_2tand_t3_ir437e", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": "Is what we are in essence merely a person, a personality, a bunch of thoughts, memories, past, future, emotions and sensations? Are we only this body and mind or is there something beyond?\n\nIn absolute reality there is no person, no personality, no thoughts, no memories, no past, future, emotions nor sensations. In absolute reality these are merely concepts appearing in the vast infinite unchanging expanse of the true infinite nature that is the awareness which is aware of all experience and experiencing this moment. Without awareness you could not experience this moment because there would be no awareness of it. Be aware of that awareness.\n\nYou have realized that what you are is not suffering, can't die, has no limits, does not come and go, it is unchanging and ever-present, timeless and infinite. You are not any thought, emotion, sensation, personal identity or effect appearing in consciousness. All these are clouds coming and going in that unchanging stillness which you are. Without the stillness the clouds could not be. The stillness is the fundamental zero that must be in order for anything to exist in harmony. The stillness that you are IS harmony itself. And beyond.\n\nDo not identify as any thought, emotion or sensation appearing in consciousness for it is not what you are, you are that nothing in which it is all appearing. Nothing can exist without the nothing that is the source of all experience and it is the witness of all experience. It is that which is dreaming this dream. Just like how you go to sleep and dream a dream, but you are not anything that is appearing in the dream, you are that formless infinite consciousness that has no limitations upon what it can dream. You are that infinite dreamer but you believe you are the body and mind that are dreamed.\n\nWhat you are can never be lost neither can it be confused, depressed, anxious, miserable, personal, a certain type of person, guilty, ashamed; whatever the thought, emotion or sensation that appears; it is not what you are at all, it is merely an object appearing in the dream. Just like you are not anything appearing in the dream; because you are the infinite dreamer in whose mind it is all appearing; you are not any thought, emotion, sensation or even who you think you are, because that is only a thought appearing in the dream. What you truly are is that infinite consciousness, the time has come to wake up to what you truly are therefore you are reading this text in this present moment.\n\nThere is nothing for you to do in this life, for you are not the one living life nor the one doing life nor thinking life, you are that infinite source eternal consciousness beyond life and death that is dreaming all of this, you have no need to do anything in the dream for it is only a dream and all dreams are taking care of themselves and are unfolding in harmony. The only way for the dream to not unfold in harmony is for you, the dreamer to believe you are this dreamed body and mind, appearing to be limited, and because of this limited perceiving you are not able to perceive the infinite harmony that the pure consciousness, the dreamer is. You are that.\n\nThat infinite dreamer consciousness is manifesting in each body-mind to perceive a different dream but the consciousness that is dreaming it is the one and the same consciousness. We are all this one dreamer, dreaming to be separated. There is nothing but the dreamer, the infinite consciousness, dreaming to be multiple forms, it is only a play ground, a dream, you must be aware that you are the dreamer, when you are aware that you are the dreamer there is peace, joy, love, serenity, that is the perfume of your own infinite nature.\n\nThat dreamer that we all are is the source of all creation (obviously) actually this all makes complete sense and it is so completely obvious that this is a dream it is foolishness that we even believe we are this body and mind even though we are dreaming another body and mind each time when we dream. Wake up. You are the dreamer itself no anything appearing in it.\n\nOnly the dreamer can understand what this post is talking about, if one is deeply identified with the body-mind he will reject all of this and somehow not be able to understand this. If you understand this and know this in your direct experience then you are blessed. You are awake now in the dream. This is what \"awakening\" means; waking up from the dream and to know ourselves to be that which is dreaming the dream, infinite, eternal, timeless, unchanging, and all of these words are truly only concepts for that indescribable infinite consciousness that each of us are in essence. Do not believe yourself to be anything else since it is obviously only a thought or concept appearing in the dream. You can't be anything else other than the dreamer, if you look in direct experience this is too obvious.\n\nYou are not a gender, age, job, experience, object, body, mind, thought, emotion, sensation, imagination, desire, intention, you are absolutely nothing. You are literally nothing. You are not anything that can be named, you are not the past, not the future, all of these are merely clouds appearing in the dream, you are the unchanging dreamer itself that is aware of all of these temporary clouds. You are the unchanging eternal one dreaming all of this. This is being pointed so directly honestly the whole world will wake up to themselves being the dreamer of dreams from this text. All your beliefs, concepts, ideas, attachments; they are all temporary objects appearing in the dream also. You are none of them, do not buy into any of them; they are merely limited objects appearing in the dream. You are that infinite unlimited source of creation, you are that zero that is dreaming all of these objects that are actually created from that same source; infinite consciousness. There is nothing separate from the source for the dreamer is all there truly is. If one believes it is separate from the dreamer, it is straight up delusion.\n\n\\- Sebastian Key", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ir437e/is_what_we_are_in_essence_merely_a_person_a/", "title": "Is what we are in essence merely a person, a personality, a bunch of thoughts, memories, past, future, emotions and sensations? Are we only this body and mind or is there something beyond?", "social_network": "reddit", "user": "IAMEternaILife", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1599876207, "permalink": "/r/DecidingToBeBetter/comments/ir437e/is_what_we_are_in_essence_merely_a_person_a/", "nsfw": false, "first_save": 1635437130.2828841, "replies_charged": false}