{"id": "t5_2tand_t3_ohnk7b", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Here is TIP # 1:\n\nInstead of trying to be superman I narrowed my focus to 3 things\n\n\\-social skills\n\n\\-Creating\n\n\\-Reading/Studying\n\nONE THING can bring you the most Return on investment. Not all habits and tasks are created equal.\n\nWillpower is limited and comes and goes. You need to make that one thing a habit.\n\nTip # 2:\n\nI don’t have a SET routine, I like to keep my schedule open and flexible.\n\nInstead I have DAILY and Weekly Goals that I HAVE to meet, no matter what, every single day.\n\nOne of those goals is to create 2 youtube videos a week.\n\nTip # 3:\n\nAt the very beginning of the day is when I feel most creative, so this is a good time for me to brainstorm and research my next YouTube video.\n\nI want to put most of my energy into what’s important, and right now that is creating.\n\nIf I decide to check emails, and stress over little things I won’t be as creative so I save those for later.\n\nTip # 4:\n\nI have to be very mindful of my mental state while sitting and working.\n\nIf I sit for too long and start to get stressed, I’ll literally start to go crazy. After 4 hours, 5 hours of work, I won’t be thinking as clear and won’t make the right decisions. So I try to cap out before that happens.\n\nTip # 5:\n\nNothing is more important than your mental health. That is the foundation of everything creative you want to do.\n\nYou are important. The way you feel matters. You have so much potential. Do YOURSELF a favor and put away all the digital screens for a minute. An hour, honestly for the whole day. And watch your mental health improve and motivation skyrocket.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ohnk7b/productivity_tips/", "title": "Productivity Tips!", "social_network": "reddit", "user": "Necessary_Bat4479", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1625940084, "permalink": "/r/DecidingToBeBetter/comments/ohnk7b/productivity_tips/", "nsfw": false, "first_save": 1635436503.2430975, "replies_charged": false}