{"id": "t5_2tand_t3_k1bi6e", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "\\*\\*\\*\\*\\*one week\\^\\^\\^\\*\\*\\*\\*\\*\\* I didn't even have to quit for long before I realized that just the thought of stopping smoking itself made my perception of myself more positive. I now realize that I have been smoking to upkeep an image of myself, one that is self destructive and doesn't want to challenge myself.\n\nI'm also realizing now that there are so many things that I've been wanting to do with my time and money that I haven't even had a chance to consider because I've been smoking most of the day for years, which takes quite the toll after a short amount of time. I want to be 100% sober by new years, which may seem like quite the feat, but it's been a goal for several years now that seems within sight. I am tired of distracting myself constantly and being unable to feel my true emotions because they are always masked by substances. I am tired of spending all my time alone because I get too fucked up to be around anyone else. I am tired of gaining weight over this past year. I'm tired of not putting any effort into my own life! I only get one so why have I been so relaxed, so asleep?\n\nAnyone who is considering making a change for the better in your life, I hope that you can convince yourself that the change is actually what you want, because once that shift in perspective happens, it becomes easier, even rewarding to do things that are good for yourself.\n\nI am FAR from where I want to be as a person in my ability to deal with my emotions in a healthy way. I am FAR from where I want to be in terms of health, relationships with others, and willingness to be uncomfortable. But I am one step closer in the right direction thanks to one small decision.\n\nthanks for reading and best of luck to you. as terence mckenna would say,\n\ntake it easy, but take it!\n\nm", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/k1bi6e/today_marks_one_day_without_a_cigarette_the_first/", "title": "Today marks one day without a cigarette, the first time I've reached this point in years. Some thoughts on the progress I've made so far and how this experience has affected others in my path to becoming better!", "social_network": "reddit", "user": "m_chutch", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1193, "down_vote": 0, "creation": 1606379208, "permalink": "/r/DecidingToBeBetter/comments/k1bi6e/today_marks_one_day_without_a_cigarette_the_first/", "nsfw": false, "first_save": 1635438055.2778685, "replies_charged": false}