{"id": "t5_2tand_t3_p8xzcb", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "c67213dc-0eed-4cac-a781-9bc082742908", "b1a66ef4-3e71-4d03-875c-961dbcef2285", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "The first time I tried meditation I couldn’t do it.\n\nI was 19 years old at the time, and healthy to me was drinking orange juice after a long night of drinking alcohol.\n\nI kept hearing about meditation and its benefits, so, I sat down alone, closed my eyes, and all I got from it was a HUGE wave of thoughts that I couldn’t sit with. \n\nSo after a few failed attempts I decided that meditation wasn’t for me. \n\nIt just seemed like a waste time, and honestly I didn’t feel like I needed it.\n\nLife was good, I was having fun and I didn’t have much responsibilities. \n\nLittle did I know meditation would one day change my life and help me unbottle emotions that were stored deep in my mind.\n\nBut more on that later\n\n2 years passed, and I hit 21. My days of getting messed up at parties aren’t as often and I have more responsibilities.\n\nTheres also this really INCESSANT need to succeed. But not the inspiring kind. A need based in fear. \n\nYou see, I dropped out of college and now that all of my friends are starting to graduate, it seemed like everyone had their life figured out\n\nI’m no longer okay with JUST having fun and enjoying life..\n\nI have this tattoo on my arm that says, enjoy now, but It was ironic, because, that was the last thing I was doing.\n\nI have a deep anxiety. A fear of failure. A need for everything to happen now.\n\nEven though i try to be healthy, my mind can go out of control. Ive never been taught to manage my own thoughts and stress levels.\n\nI would often burnout and binge \n\nOnly to get out of my binge the next day feeling guilty for taking a break.\n\nTrying to grind my way through life.\n\nI’m gaining success in my business and I’m able to go full time in videography in 2019,\n\nbut like a lot of other people, I’m neglecting my mind.\n\nWorking all day and drinking tons of caffeine starts to amp up my anxiety, and I start to feel like I’m losing control\n\nWhile watching one of my favorite YouTubers, Yestheory, they mention meditation and how it helped them control their anxiety\n\nSo I say screw it, lets give it another try\n\nAt the time, I probably meditated once a week\n\nIt was unbearable,\n\nI didn’t see the point in doing nothing when there was so much that HAD To be done.\n\nEventually I hang with a friend who is also trying to get into meditation, and he said, yo we should meditate together.\n\nWe sit down and put on a 10 minute guided meditation.\n\nAnd for some reason, It was a much more profound experience.\n\nThe act of meditating with a friend, with another human being, with another presence gave me a sense of peace and calm that carried on for the rest of the day. \n\nFinally for the first time, I felt the benefits of meditation\n\nI felt so good about it that I ended up buying a meditation app.\n\nThis is what changed the game for me.\n\nYou see, I’m a frugal person, so when I spend 60 dollars on a year subscription, best believe im getting my freaking moneys worth.\n\nThe infrequent once a week meditations turned into more frequent 5 time a week practices.\n\nI started to understand the practice, \n\nI realized, you can’t control your mind. \n\nYou can only observe it,\n\nLet all of your thoughts in, and then let them go. \n\nSlowly but surely I was convinced that meditation was helping me.\n\nBut let me be honest.\n\nDuring my first year I would go weeks without having any amazing experiences, like I did the first time, those were far and few between.\n\nIt took a lot of discipline and faith to keep on meditating but eventually it DID pay off.\n\n1 year later, what used to seem impossible was now actually kind of easy.\n\nI could go 10-15 minutes without losing my mind \n\nThe benefits are subtle.\n\nIts like a muscle that you train over the course of a couple of years, and its something you have to practice frequently to keep.\n\nI notice that I have a bit more anxiety when I haven’t been meditating\n\nJust like I notice I start to lose muscles when I haven’t been working out.\n\nWhenever Im in a Bad mood or feel very uncertain about something, meditation helps bring me back to MYSELF.\n\nIt helped me realize that a lot of problems aren’t actually that big of a deal, that yeah I have a lot going on, but no matter what.. \n\neverything is going to be alright.\n\nI started to feel more confident throughout the day.\n\nI started to notice that I had a sense of calm in my conversations with people. \n\nI could hold eye contact longer\n\nAll the times I saw people preaching the benefits of meditation now made sense to me, \n\nWhen not too long ago it just seemed\n\nLike a complete waste of time.\n\nI really started to amp up the meditation during quarantine. I was bored, and had so much free time that a routine was essential.\n\n20 minutes a day, every day.\n\nThis is when I had one of the most profound experiences\n\nIt was 8 months out of my last breakup.\n\nIn the beginning of the break up, I was running away from my thoughts, I wasn’t meditating as much and would much rather distract myself, then deal with the sadness that comes with a break up.\n\nIt wasn’t until 8 months later, when covid happened that I actually dealt with what’s going on inside. \n\nYou see thats what I think meditation does.\n\nIt forces you to confront your own mind.\n\nSo one morning Im meditating. \n\nI feel a deep sense of peace come over me.\n\nThis happens like 1 or 2 a month.\n\nYou get a euphoria that is unexplainable.\n\nLike taking a drug, you just feel so damn good from nothing.\n\nAfter the meditation I get on my computer with a calm mind and I see a video, it was called “If the world was ending you’d come over right” \n\nBasically a cheesy music video about a couple that broke up, but went to see each other because the world was ending.\n\nand It just struck a different chord with me. Being in the beginning of a pandemic and not having dealt with my old emotions, all the sad feelings resurfaced and I just started bawling.\n\nThis was the first time I had cried since the breakup \n\nEverything that was bottled up came pouring out and all of sudden im ugly crying out of no where.\n\nI did this for like 20 minutes on and off. It hurt. It was hard, but afterwards, It felt like 100 pounds had been lifted from shoulders, \n\nAs im writing this script, I can feel those emotions again, the feeling of the weight being lifted. And I want to say that it was that day, 8 months later that I actually got over my break up.\n\nI attribute this to meditation because I don’t think those emotions would have surfaced and I would have been able to let them go if I didn’t have the space in my mind to do it.\n\nAnd that made me realize, as human beings, we hold on to things emotionally way longer than we think, and we just leave them bottled up inside.\n\nMeditation helps you discover yourself in new ways.\n\nIts time to figure out who you truly are.\n\nTo take a step back from all the things going on in the world.\n\nBecause ultimately all your goals, everything you have and everything you know, will be gone.\n\nAnd the one thing that you want to have figured out first before the end of your life, is yourself.\n\nSo guys if you made it this far, then holy fuck, I really appreciate you.\n\nAnd if you want to subscribe on YouTube or see the video version of this, link is in the bio!\n\nI hope you discover new things about yourself whilst meditating and have more peace in your life,\n\nPeace", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p8xzcb/how_meditation_changed_my_life_and_anxiety/", "title": "How meditation changed my life and anxiety", "social_network": "reddit", "user": "Necessary_Bat4479", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 53, "down_vote": 0, "creation": 1629575220, "permalink": "/r/DecidingToBeBetter/comments/p8xzcb/how_meditation_changed_my_life_and_anxiety/", "nsfw": false, "first_save": 1635435778.075781, "replies_charged": false}