{"id": "t5_2tand_t3_issftp", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "\\[This is a long post, sorry for that\\]\n\n  \nHi everyone, \n\nI'm kind of overly attached to my friends and one of them has just moved to another city, so a few days before his departure I decided to give him a huge farewell present. It wasn't the first huge present he got from me, but this time he said something that I've never really thought about, even though many other people told me similar things in the past. He said that he believes I have 0 self-esteem and for that reason, I try to increase my value by giving him (or other people) too many gifts. He said I keep saying \"sorry\" all the time and that I never say \"no\", especially to him. \n\nNow he has left and I'm sort of thinking about myself and how I interact with the world around me. I've already written a post here a long time ago, about being really aggressive on social networks and definitely an asshole when discussing something. For the first time, I start connecting the dots and I fear that this mixture of arrogance and submission stems from the fact that I do in fact feel as if I'm not worth at all.\n\nJust to give you a taste of what happens in my brain everyday, this is a list of common behaviors that I display, depending on the people I'm interacting with:\n\n* I say \"I'm sorry\" or I feel extremely guilty for anything. For example, if I call a friend I tell him \"sorry for bothering you\" and I do feel sorry, terribly sorry and guilty for interrupting his day. \n* I buy too many gifts, sometimes expensive ones even if I don't have much money. If a friend of mine loses his mobile phone, I feel the urge to help him buy a new one. This goes from small things, like a meal at McDonald's, to huge things, like the almost $1000 worth gaming computer I bought for another friend. \n* If someone doesn't reply on social networks, especially if I see that this person is online multiple times, I start thinking \"gosh, he hates me and I am definitely annoying him\". Sometimes I misinterpret messages, like when a friend of mine wrote \"stop writing me for a sec\" and I believed he didn't want me to annoy him, while he was actually testing how notifications work and a message from me would have interrupted his test. \n* When I play video games, I feel great when I win but I feel totally useless when I lose even one match out of 20. When my depression is really intense, this ignites suicidal thoughts or amplifies them.\n* I follow strangers on Instagram and this parasocial interaction is exaggerate. I'm happy when they succeed in something and I'm sad if they have problems. Like, seriously sad. This leads me to believe that it's somehow my fault if they're not happy, because there \"must\" be something I can do to help them. I rationally know that this makes no sense, but that's how I feel. Staying away from Instagram has reduced the problem, but every time I open it, things are the same.\n* On social networks, especially Facebook/Reddit, I feel as if I \\*have\\* to say what I believe. It's not that I feel right or wrong, but I just need to express my opinion on everything. If someone doesn't agree, then I become too involved with the discussion and this leads me to waste hours and hours of my time on every single topic. If I try to interpret this through the \"maybe I have low self-esteem\", this could explain while I feel \"satisfied\" or appreciated when people like my comments or reply in favor. \n* I need to know how people are doing in life. I ask \"how are you\" like every single day, which is too much when people don't do anything special in their lives. If they don't reply with a \"detailed\" answer or if they don't share their lives with me, then I feel as if I've done/said something wrong or I'm useless. \n\nYou can imagine how dangerous this trend becomes when my depression kicks in. As I said, I sometimes have suicidal thoughts and this kind of pattern of thoughts is the perfect ingredient to increase the \"why are you still alive? Just kill yourself\" feeling.   \nI'm going to a psychologist but since I'm not at home right now, the next meeting will be in something like 2-3 weeks and we still haven't discussed about this issue, but I'll do it for sure.\n\nIn the meantime, how do you cope with similar feelings? Like this fear of being rejected or this self-hate. Do you have any solution or exercise that might help? \n\nThanks a lot for your attention and sorry for the long thread.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/issftp/i_might_suffer_from_extreme_low_selfesteem_how_to/", "title": "I MIGHT SUFFER FROM EXTREME LOW SELF-ESTEEM: HOW TO FIX THAT?", "social_network": "reddit", "user": "DanieleJava", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1600112762, "permalink": "/r/DecidingToBeBetter/comments/issftp/i_might_suffer_from_extreme_low_selfesteem_how_to/", "nsfw": false, "first_save": 1635436522.2959094, "replies_charged": false}