{"id": "t5_2tand_t3_ixw2x7", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I'll try to keep the background information short. In 2017 I started university majoring in Mechanical Engineering. I was 17 at the time and was personally not ready for university. When I didn't understand a topic I didn't go to office hours, I didn't ask for help, and I wasted all my time playing video games and being lonely. Needless to say In October of that year I got put on academic probation and got dropped from the College of Engineering. I took all W's for my classes and re started college in 2018 with 0 credit hours under my belt. I switched into Graphic Design because I liked tech and art, but I didn't enjoy the program or job options so I switched to IT with a minor in CS. I wanted to major in CS but was afraid of falling again as it's in the CoE, and a few people in my life told me I wasn't 'CoE material' after I flunked and it really got to me. This spring I made Dean's list for the first time and have a GPA of 3.4. I am meeting with my advisor on Monday to become a CS major with an IT minor.\n\nWhat I've learned:\n\nIt's ok to mess up as long as you keep trying. The second part of that is important. I had the chance to not go back to college when I left that October. That would have been the easy way out. But I saw how my mom was struggling to provide money for us and I started to think about what I wanted for the future. My mom had always done whatever she could for me and I felt guilty by not doing anything with my life. I felt like I was too stupid for college, but I still decided to go back and at least try. I didn't make the best grades my first semester back but I passed all of my classes so that got me off probation.\n\nPlease seek help if you have mental health problems. I have Bipolar Disorder (type 2) and didn't even know until summer 2018. After that I started therapy and medication and that worked wonders. I didn't feel the effects immediately. It took 3 months to start seeing the start of progress in therapy and three different types of medication to find the two that work for me. Before that all came together I still felt depressed even though I was getting help. I haven't been suicidal since early 2019 (awful breakup) and even though I still have depressive symptoms, I haven't had manic episodes in a long time. For loneliness, I started to crawl out of that when I began to join clubs. I joined a few clubs and I just recently joined a winter sports club. I also learned that just because I'm in a relationship doesn't mean I'm not lonely. For example, when I was in a relationship in 2019 I was incredibly lonely because the relationship was toxic and I isolated myself from my friends. I have reconnected with my friends and feel so much better now. Do I still get lonely? Yes, but even though I am lonely I know I'm not alone. My family is a big support system for me and I can't believe I used to take them for granted.\n\nHow did I make Dean's list?  For the first time in a long time I saw that I had a future ahead of me, growing up I always had trouble planning for the future because I never planned on living past 18 or 21. Now that I wanted to live and succeed I began to start being proactive with my study habits. I made a planner that I wrote down every single assignment around the first weeks of class. I would set a timer for 30 mins and do work un-interrupted for that amount of time and that helped. I would start things days (or weeks for midterm/final papers). I started going to office hours and emailing my professors and TA's. I actually cared about what I was doing and that was amazing motivation. Knowing what you want to do in the next few years makes your current day to day plans have meaning.\n\nI am not perfect or by all means an academic pro- I'm 20 years old so I still have a lot to learn about the world. This semester is a lot harder than spring's, I still mess up assignments. I still play video games for longer than I should and I haven't been to the gym since March. But I am more mature now and recognize how these things affect my future and plan accordingly. I will graduate in Fall 2022 if everything goes to plan and I cannot wait for the day I get to hold my B.S and start my new future. I hope this post helps someone who was in my position in 2017. Best of luck to everyone.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ixw2x7/from_academic_probation_to_deans_list_my_college/", "title": "From academic probation to Dean's list - my college experience so far.", "social_network": "reddit", "user": "AeroNauseous", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1600808057, "permalink": "/r/DecidingToBeBetter/comments/ixw2x7/from_academic_probation_to_deans_list_my_college/", "nsfw": false, "first_save": 1635437034.192536, "replies_charged": false}