{"id": "t5_2tand_t3_aoj3li", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Apologies in advance if this isn't the right sub for this - if there is a better place to post this, I can post elsewhere. Originally posted in a different sub and the mods there recommended this sub as being a more appropriate place for the advice I am seeking.  I'm using a throwaway to try to keep things anonymous.\n\n​\n\nReddit I could really use your help and advice. I know this is really long but I have tried to include the whole story. Please let me know if anything needs further clarification.\n\n​\n\nMy entire life I have always been very focused on academic and career achievement. I graduated from a competitive high school with a perfect GPA, went to an Ivy League college to study something I was passionate about, and worked multiple jobs after college to gain experience and save some money up to eventually get into the grad school program of my dreams (I'm being intentionally vague about the kind of program as if I'm specific there is a nonzero chance it could identify me).\n\n​\n\nMy first semester of school, things all started to fall apart. My dad became very acutely and seriously ill. Being the overachiever that I'd always been, I somehow (and naively) convinced myself that I could do it all - be there for him, every weekend for as long as it would take, driving several hours home and back and being in the hospital, while also studying in a very intense program and that somehow it would all work out. The stress of it all - being in a new place where I didn't yet really know anyone, in a really stressful program, with a very sick parent (my relationship with my other parent has always been complicated and we are now estranged, more on that in a moment) led to the resurfacing of my own struggles with depression and anxiety. I told myself I just had to keep it together until I \"aged out\" of my dad's insurance (because in my mind the absolute last thing he needed while going through things was to worry about me) and I almost made it...at the end of the semester and just days before my 26th birthday, I had a complete breakdown (hello, understatement) and become suicidal. I was hospitalized for six days in an in-patient psych unit until I stabilized enough to be released.\n\n​\n\nThe following semester in the spring I returned full-time to the program and passed all of my classes and in the summer completed a re-exam for a first semester class I had failed. I thought I was back on track. Unfortunately, I had gotten an additional diagnosis of ADHD while going through all of this and while I had been working with professionals to develop new/better study strategies, the process of adapting how I learned and studied was not an overnight one for me and I continued to have academic struggles and failed another course.\n\n​\n\nMy program allowed me to repeat that course - which I did, successfully - and continue forward. Things were going much better and I was in a better place. I was managing my mental health conditions with the help of doctors and new coping strategies. My dad was doing better and the whole experience had strengthened our relationship. My grades were not nearly at the top-of-my-class level that I had been used to - which had been a major blow to my sense of self-worth - but I was keeping my nose to the grindstone and I was determined to graduate.\n\n​\n\nThen it all fell apart...again. I got a phone call that my dad was back in the hospital and I just saw what had happened my first year about to happen all over again. In one of my classes, we had an upcoming exam - which I did very poorly on, since as soon as I had gotten the news about my dad I was on my way down to be there. Over the course of the next few months, he had numerous procedures/surgeries. I agonized constantly over what to do and no matter what I chose it always felt wrong and that my priorities were never in the right place. The final surgery that he had I wasn't even there for because I had an exam scheduled for the following day which I somehow managed to pass. As soon as he got sick again, I met with my psychologist and came up with a plan to try to not have this go the way it did the first time and with the exception of one of my classes, I did overall pretty well that semester and was still able to be there as much as I could be for my dad. Despite all my efforts, though, and a very high final exam score in that one class, I was still 2 points shy of a passing grade.\n\n​\n\nAt this point, for anyone keeping score, I had now failed a total of 3 classes. My academic situation was not good and while the powers that be in my program had been very sympathetic towards me the first two times (something that I am eternally grateful for) - the third time was where they said no. I went through the appeal process (which consisted of appealing to a committee of people and then the dean of the program) and was ultimately told that they understood everything I had been through but I was no longer allowed to continue and they would process my \"withdrawal\" immediately. A week later I was out.\n\n​\n\nI was devastated. On the one hand, I completely understood their decision. I had had ongoing academic issues and ultimately had nobody to blame but myself. On the other hand, I knew of other people with similar academic records that had been given additional chances to be successful (and who are now close to graduating) and so it felt like not only was I a failure - I was a failure that had worked hard for a dream that I didn't deserve and wasn't capable of achieving.\n\n​\n\nI'll be honest. I didn't get out of bed for a month after all of this. I very seriously considered suicide again. I truly felt like if I was a failure in this then I didn't deserve the privilege of life and my family would be better off if that was the end of my story.\n\n​\n\nOver the past few years, I have slowly but steadily built a new life for myself. I work in a related field doing research that I love and is meaningful to me. I found a partner that is wonderfully loving and supportive and we have been in a relationship together for about a year. I have been in therapy and worked on my various issues and have stabilized to the point where (under doctor supervision) I have been able to successfully come off antidepressants. I have come to terms with the fact that my mother is severely mentally ill and I have cut ties with her completely. Last fall, I finally got a diagnosis for a chronic condition that I have had since college (and probably also contributed to my struggles in my program) and have a good doctor that is helping me manage that.\n\n​\n\nI'm in a better place in my life now in my early 30s than I was in my mid-late 20s. I think that the decision that was made a few years ago was probably the right one - I had some things that I needed to work on (another understatement). But I think that now, if I could be given another chance, that I could be successful. I have had multiple people encourage me to appeal and try again. A new dean started with the program last year and while it is a longshot chance, other people have encouraged me to reach out and write a letter and ask that my standing with the school be reconsidered.\n\n​\n\nHere's where I turn to you, Reddit. What do you all think? Do you think I would be out of my mind to ask for another chance? Or should I roll the dice and ask? If anyone thinks I should ask - are there official and proper ways to do this, or is writing a letter to the dean the best way to go about this?\n\n​\n\nThank you in advance for any and all advice you can give me.\n\n​\n\nTL;DR: Worked my whole life to get into the grad program of my dreams. Had multiple academic issues while going through personal and family struggles. Was kicked out. In a better place now and wondering if/how I should appeal to get back into the program and finish my degree.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/aoj3li/a_few_years_ago_i_31_f_withdrew_from_the_grad/", "title": "A few years ago I [31 F] \"withdrew\" from the grad school program of my dreams. I've been encouraged to appeal again and try to go back but I don't know the right way to go about this (or if I even should) and need help.", "social_network": "reddit", "user": "gradschoolhelpthrow", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1549648396, "permalink": "/r/DecidingToBeBetter/comments/aoj3li/a_few_years_ago_i_31_f_withdrew_from_the_grad/", "nsfw": false, "first_save": 1635437869.7121453, "replies_charged": false}