{"id": "t5_2tand_t3_bxhika", "request": ["221a05fc-6bbf-424e-808a-6b3e01891c48"], "text": " \n\n*“Success is a process of diverting one’s scattered forces into one powerful channel.” -* James Allen\n\n&#x200B;\n\nThe most important part of success is gaining clarity and knowing exactly what you want in life. Never lose sight of what you want to accomplish or attain in life. Many people work hard every day, but don’t know what they want. They have no clear idea or direction for their lives. They don’t have any major definite goals.\n\n&#x200B;\n\nIf you don’t have clarity, it’s okay. We’ll help you set and achieve your major life goals.\n\n&#x200B;\n\nWe’ll help you plan and organize your time so that you can actually accomplish your most important goals as quickly as possible.\n\n&#x200B;\n\nThe key is to set your major goals and prioritize them. Then create a plan to use your time effectively. We’ve set the most important categories to help you plan.\n\n&#x200B;\n\nWe’ll walk you through step by step on how to use each category to help you reach your goal.\n\n&#x200B;\n\n&#x200B;\n\n**Join the Top 3%**\n\nLess than 3% of the population has clear written goals or know what they want in life.\n\nJust the very act of writing down your goals will place you above 97% of the population!\n\nGoal setting is the master key to success.\n\nYour ability to clearly create a plan to reach your goal will help you achieve success more than any other skill.\n\nWe’ll help you get started.\n\nGrab a notebook and write these down. Then you can transfer well thought out goals and plans into Time Block to review at any time.\n\n&#x200B;\n\n&#x200B;\n\n**Goal Setting Exercise:**\n\nYou must write down your goals. Goals that are not written down are only wishes or fantasies. A wish is merely a weak desire with no energy behind it. People do not turn their wishes into reality.\n\nWhen you write down your goal on paper, you solidify it. You turn it into something concrete and tangible. You can pick it up, look over it, and hold it in your hands. When you take it out of your imagination and put it into a tangible form, it becomes real.\n\nWrite down your goals, clearly and vividly. Make it as detailed as possible, exactly as you would like to see it in reality.\n\n&#x200B;\n\n&#x200B;\n\n**Analyze your life**\n\nFirst, analyze your life.\n\nTake 1 minute to write down your top 3 most important goals. Now write down your top 3 concerns or worries in life right now.\n\nAnswering these will give you a quick snapshot of your life.\n\nYour top goals should be solutions to your worries. You can solve your problems by working to achieve your goals.\n\nYour concerns and worries represent your past. They show you where you’re coming from or want to move away from.\n\nYour goals represent your future. It shows you where you want to move toward.\n\n&#x200B;\n\n&#x200B;\n\n**Finding Your Goals**\n\nIf you have a difficult time finding your most important goals, do this.\n\nWrite down 10 things you’ve always wanted to be, have, or do. Have fun with it, let your imagination run wild.\n\nImagine you have no limitations. It can be things you want to accomplish in business or personal life over the next 5 years. Don’t worry about it being realistic or achievable for now. Just imagine it’s possible for you to accomplish.\n\nNow glance over your list. If you could automatically have one goal accomplished within 24 hours, which would it be? How about your second or third? These should be your top goals.\n\nYour number one goal should be your most important one to accomplish (at this time). By achieving this goal, it should help you achieve all the other goals or make them irrelevant. Your major goal should have a major central purpose or theme. Ideally you want it to be in harmony with your core values.\n\nIf you do not choose your major goal correctly, you’ll waste your time, energy, and effort with little progress to show.\n\nAsk yourself, *“If I accomplish one goal, which one would help me achieve all my other goals?”*\n\nUsually, a major goal is a business or financial goal. It can also be a health or relationship goal. Regardless, your goal should become your ‘mission’ in life. All other activities should follow secondary to your major goal. When you select and decide on your major goal, you will be able to focus your energy on a single point. It will give you clarity and allow you to use your time wisely, leading you to achieve success.\n\nOver time your goals will change. Always calibrate and ask yourself the above questions to address current concerns and where you want to be heading in life. Doing this will bring clarity about what you really want, who you are or who you are becoming. You’ll be able to solve your problems by adjusting and clarifying your goals.\n\nIf you have a big ambitious 10X goal, you want to break it down into smaller subgoals. You can set milestones or deadlines to help you reach your major goal. You can set monthly, quarterly, or yearly goals to reach each smaller subgoal you set.\n\n&#x200B;\n\n&#x200B;\n\n**Timelines & Deadlines**\n\nAlways have the long view when setting and working on your goals. The longer time perspective you can have, the more successful you’ll be at reaching your goals.\n\nYou want to set:\n\nLong Term Goals: 10-30 years\n\nMid Term Goals: 4-10 years\n\nShort Term Goals: 1-3 years\n\nAnything shorter than 12 months will be your process for attaining your goals. They will be your daily tasks, routines, and good habits you build. They will be the actions you take to get you toward your goal.\n\n&#x200B;\n\n**Make Action Plans:**\n\nStart planning and organizing your tasks to reach your goals. Goals without a detailed plan of action can be stressful. It’s like trying to build a house without a blueprint. The more detailed your action plans, the more quickly and likely you’ll achieve your goals.\n\nAsk yourself, *“What specific steps do I need to take to achieve my major goal?”*\n\n&#x200B;\n\n**Prioritizing Actions:**\n\n**Monthly:** Based on your 12 month goal, what can you do monthly to reach it?\n\n**Weekly:** Based on your monthly goal, what can you do weekly to stay on track?\n\n**Daily:** What is the most important task you can do daily to reach your sub goals?\n\n&#x200B;\n\n*“If you do not set priorities, other people will set it for you.”*\n\n&#x200B;\n\nIt’s okay to say “No” to people. Only work on your most important tasks.\n\nYour ability to set priorities is critical to your success. You need to separate the urgent things from the truly important things. Most urgent things are usually in your face requiring an immediate response, but they’re usually low value. They won’t have a significant consequence on your long term future. Important tasks have a significant impact on your future if they are done or not done.\n\nDon’t go on the path of least resistance. People work on easy, low value tasks while procrastinating on the large important tasks. Go against this and work diligently. Don’t waste your time on small easy tasks that contribute little to your overall success. Work on important tasks, that can make a big difference in your life.\n\n&#x200B;\n\n&#x200B;\n\n**Finding Important Tasks:**\n\nMake a list of 10 activities you do daily or 10 tasks you need to do to reach your goal. Out of those 10, there will be 2 or 3 activities that are more valuable than all the rest put together. Circle your top 3 most important items. These items will give you the biggest results. Often they will take time and are difficult to do.\n\nBut these are the important tasks that you want to attack. Work on them first thing in the morning when you’re full of time and energy. Work on them until they are completed. Focus only on them, ignore all other tasks until they are complete.\n\n&#x200B;\n\nUse the **A,B,C,D,E System** to prioritize.\n\nYou prioritize your goals and tasks according to consequences, by how important they are.\n\nA = Very Important, must do items. Serious consequences if not done.\n\nB = Mild consequences, do after completing “A.”\n\nC = No consequences. Do if A & B are done.\n\nD = Delegate. Have somebody else do it.\n\nE = Eliminate. Don’t waste your time on it.\n\n&#x200B;\n\n“A” are goals and tasks that have the biggest positive impact on your life and future. They have serious positive or negative consequences if you do or don’t do them. They should be your top priority items.\n\n“B” are important but not as important as A. They should be done after you complete A items.\n\n“C” are things that would be nice to do after A and B are done. They could be fun activities or hobbies you do.\n\n“D” and “E” are very low value activities with no consequences if done or not done. You can save immense time if you delegate or eliminate them all together.\n\n&#x200B;\n\nFor example, when making an action list you can order it like this:\n\nA - Finalize presentation for meeting\n\nB - Finish report\n\nC - Go out for dinner\n\nD - Delegate dry cleaning\n\nE - Don’t watch netflix until report is done\n\n*Tip: When spending free time, be conscious of your time and set limits. For example, if you’re watching a show, don’t binge watch for hours on end. Set a limit for an hour or two. Don’t lose track of your time. Save your time to do something that will make a positive impact on your life, like reading a personal development book.*\n\n&#x200B;\n\nWith Goals, make a list of all the things you would like to accomplish in 1 to 5 years. Then go down the list and write A, B, or C in front of them. What you really want or need to do, what would be nice to do, and what’s fun to do but not so important.\n\nThen take your A goal and create a plan of action. What are the things you have to do, things you should do, and things nice to do to help you accomplish your goals.\n\nYou can apply ABCDE to any area. Use it for your tasks, obstacles, solutions, plans, or any part of your “Major Goals.” When creating entries, just put the letter in front of your title. Remember to set deadlines with your ABCDE’s.\n\n&#x200B;\n\n**Goals**  \n**Title** \\- “A1: I will increase my income by 50% DUE: 12/30/20”\n\nYou can take this system further by numbering them. When writing goals, the numbers can help you organize them by rankings of importance.\n\n&#x200B;\n\nHere’s an example:\n\n**Major Goals:**\n\n**A1:** Maintain optimal health and lower stress.\n\n**A2:** Spend genuine time with family and friends.\n\n**A3:** Take ownership of relational problems.\n\n**B1:** Increase income by 25% within 1 year.\n\n**B2:** Read one personal growth book a month.\n\n**C1:** Learn how to play guitar.\n\nYou can easily keep track if your major goals with this system.\n\n&#x200B;\n\nEx.\n\n**Goal:** A1- Health, live long enough to see great grandchildren.\n\n**Obstacle:** A1 - I need to stop eating fast food and junk.\n\n**Solution:** A1 - I will make a habit to eat more raw greens and vegetables and to work out 4 times a week.\n\nWhen working on plans, solutions and tasks, the numbering can help you organize by sequence of steps.\n\n**Tasks:**\n\nA1: Finalize Report\n\nA2: Send in Report\n\nB1: Respond to work emails\n\nYou want to work on your A1 task until it’s finished before moving onto A2. Only when you finish your A tasks, do you move onto your B tasks.\n\nIf tasks pop up during your day, you can put the letter they fall under and add them to your master list. You can rearrange your list any time. Just pull out your list, assign letters and number them in the order you want to do them.\n\n*Tip: It’s helpful to take 5 minutes before you leave work and prioritize your important tasks for the next day, while it’s fresh on your mind. Doing this will save you time and help you get right back to where you left off for the next day.*\n\n**Action Tasks:**\n\nYour priorities should also be your actions for the day.\n\nGet your list of tasks and organize them by priority.\n\nList your day’s activities and prioritize and rank them by order of importance.\n\nYour organized list will serve as a map to guide you from morning to evening. Go from most important task to least important, by time of day. When you have these written down, you can free up mental energy to focus on important things instead of worrying about forgetting things. Having a list of all your important tasks to refer to will reduce stress, anxiety, and worry.\n\nDevelop the habit of using your master task list to guide you daily.\n\nTime Block was made just for this purpose. Transfer your list onto the Major Goals section.\n\n&#x200B;\n\n**Summary**\n\n1. **Find your Goal!** Grab paper and make list of 10 goals you would like to accomplish. Look at your list. If only one could be completed in 24 hours, which goal would have the greatest positive impact in your life?\n2. **Set a Deadline:** When do you want to accomplish this goal by?\n3. **Brainstorm:** Ask, *“How can I achieve this goal?”* Think of 20-30 different ways to achieve your goal. Pick the top 3 solutions you come up with and make a plan to apply it.\n4. **Prioritize:** Prioritize your most important tasks. Then make steps, what needs to be done first, second, and so on.\n5. **Take Daily Action!** Break your goal up into small chunks and work on it daily. Don’t get overwhelmed by looking at the big mountain top. Look only a few feet ahead of you and take small steps daily.\n\nWhen you work on your biggest goal, all of your other goals will follow by itself.\n\n&#x200B;\n\nIf you like this guide, Check it out on Amazon:  \" How to Find and Achieve your Major Life Goal \"", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/bxhika/how_to_find_and_achieve_your_goals/", "title": "How to Find and Achieve your Goals!", "social_network": "reddit", "user": "AuxoPro", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1559832210, "permalink": "/r/DecidingToBeBetter/comments/bxhika/how_to_find_and_achieve_your_goals/", "nsfw": false, "first_save": 1635437140.3809252, "replies_charged": false}