{"id": "t5_2tand_t3_l9idoz", "request": ["e234981c-b061-4d83-8134-70d441847f74", "0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "So due to some pretty shit circumstances over the last few years, I got completely overwhelmed and struggled to find my footing for years:\n\n1. Home became extremely unstable with all my family fighting constantly, I was the youngest by a wide margin but was expected to put my needs aside to console my mother and put up with abuse and violence from others.\n2. I had my own issues with my body image and identity going on but it all got pushed aside and proffesionals didnt take me seriously, resulting in further distress and mental health problems\n3. This had a knock on impact into school, which combined with bullying, impacted on my education which further hurt my mental wellbeing, I actually didnt score what I needed to in my GCSE's to carry on doing the subjects I had hoped to, and this was a kick in the balls for someone with learning difficulties. Felt like all my struggles were for nothing.\n4. Went to college to find another way around to the path to animation and art (what I love) for a career. Struggles with depression and anxiety and my other issues made this difficult. I was shamed by my parents for needing medication and therapy to cope with my panic attacks.\n5. University roles around and i nearly drop out from how bad I spiral out of control with my mental health, but manage to completely swing for the fences with all nighters and come out with an MA and a decent reel to get some work in media production. In this time, I'd sought out help for my long term issues and had mostly recovered from panic attacks but depression remained.\n6. Due to lack of work, I had to take extra jobs on the side for a crap boss for low pay. Saved for several years to get money together.\n7. Mum gets cancer, narrowly survives the surgery to remove it.\n8. A few years go by, family conflict and a violent incident end up brining years of pain back and i confront my family in a heated exchange that shows them up for who they are. I realize my father is a narc and is a gaslighter and emotionally manipulative and abusive.\n9. Six months later, Mum's cancer returns and has spread to her brain. No way to save her, it went from grade 1 to grade 4 in the weeks it took for the sample to be analyzed. She dies summer 2019.\n10. I get no time to process my grief before my father begins to use threats of blowing the inheritence just to spite me when I ask for a basic boundary to be respected. I feel alone.\n\nSo that's the issues, and now, I'm finally in a position to do a lot better:\n\n1. I've moved out, got my own place and it's all been paid for in cash, so nor mortgage.\n2. I've become a yoga instructor, having travelled to India and the break from my problems let me properly grieve and process the loss of my Mother.\n3. I've started an online business with an uncle who is determined to help me.\n4. My body issues were confirmed to be gender dysphoria (I've had suspicion I was trans most of this time) and I am happy to say being on hormones and transitioning has put me in such a better mental place. I feel genuinely happy for the first time in I dont know how long\n5. Ive been brushing up on my animation again to develop even better work so I can be more marketable and hopefully, combine the yoga, animation and the online business with my uncle to work from home and be my own boss with a lot of freedom.\n6. Ive realized I have a terrible fear of relationships from how my family behaved, as I have little other reference for them or boundaries, and I used booze, hard workouts and masturbation as a high to chase to distract from my pain. I have cut back on some of these and barely drink. I am pursuing a healthier mental state before I contemplate serious dating and will work on myself for a long time before I find the right person.\n7. I went to counselling. My father claimed my head is 'in need of fixing' because I dont like being punched. The last 8 months of my life has involved 2 sessions a week of abuse related counselling that has allowed me to see it for what it was and I am now fully equipped to deal with him and my own pain (and he's going to get confronted soon). I believe he may have shot himself in the foot with the gift of having his behavior dissected beyond the excuses of 'Im just all business and no feelings, I make mistakes, it's not a big deal stop being soft, Im the bigger man here' etc.\n8. Ive got back in touch with my own feelings and wants, and its freed me up to feel creative and playful, like a child again. Im even hopeful for the future in spite of the worlds madness right now.\n9. Im building a plan to travel the world when COVID ends and see and do everything I want to do before I settle down, which I intend to move to Canada for, and out of the UK.\n10. Ive dug out all my old characters and notes for a story I made in my high school days, and Ive started it as a novel using my grief as a reference for two of the old characters as a 'chapter 0' before the original idea plot starts. Im 18,000 words in and Ive finally done something with my baby. Its wonderful going back to it and doing something with it.\n\nIve found a way to turn it around completely, and it's going to show me exactly whose with me and who my people are. Not everyone is a violent, horrible person, and Im worthy of so much. I can control my life now, and nobody can tell me who to be. I expect transition will be tough in parts, but I know I would basically die if I didnt do it, and Ive felt dead inside for years dealing with all this. I turn 30 at the end of this year, and it's been a wild 15 years full of lessons and hard knocks, but it made me who I am today.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/l9idoz/massive_plans_and_finally_started_them/", "title": "Massive plans and finally started them", "social_network": "reddit", "user": "helsbellz", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1612117560, "permalink": "/r/DecidingToBeBetter/comments/l9idoz/massive_plans_and_finally_started_them/", "nsfw": false, "first_save": 1635437565.5313945, "replies_charged": false}