{"id": "t5_2tand_t3_of8s8b", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "1a213df6-3f71-466c-9762-ace119e0102e"], "text": "To start off, I (23F) got broken up with about two days ago by the most amazing guy (25). Our plans to celebrate his birthday next weekend, the plans for our future trip, friends’ weddings, and our plans of moving closer to each other have just vanished out of nowhere. I became overly attached, depended on him for happiness, and was always nitpicking him because I genuinely thought that there had to be something wrong. We never fought in person but over text and when we were apart, I would be anxious and start a fight.\n\nI’ve been in two relationships in the past that was very bad. I think I have an anxious-attachment type of attachment style in a relationship which makes me very codependent and I tended to lose myself. I’ll mention that I have diagnosed depression, generalized anxiety disorder, ptsd, and childhood trauma before I say the rest.  I’d tell them things like “I want to sleep and not wake up” or “there is no point to living.” I’d get mad if they didn’t reply fast enough because if they cared they’d always make time for me. However, in the first two relationships, I didn’t think I was doing anything wrong so naturally I thought this was how a normal relationship is.\n\nThis time around, I did the same thing. I NOW recognize all of this behavior as guilt-tripping and manipulation. He called me out for that and I was in shock. Because he said it in a way that clicked in my head and because I cared for him more than I have for anyone else, I accepted I was wrong. I didn’t realize how my actions him because I was too focused on myself and my mental health. Although I’m allowed to feel how I feel, that is no excuse to put all of that baggage into one person. It gets tiring when your whole relationship is fighting so I get where he’s coming from. \n\nToday, I decided to be better. I called a counseling crisis hotline for immediate help and to untangle my thoughts. I’ve set up intake appointment to discuss medication and a therapist. Although this relationship has ended and I am still grieving over it, he pushed me to get help. Though not intentional, I never want to hurt people by manipulating, gas light, or guilt-trip anyone ever again. It will take work to retrain my mind to be healthy but I am willing to do this for my own sake. It’ll be healthier for my relationships with the people who are still in my life too. I’m ready to be better.\n\nI know he will never read this but I hope he knows I never meant to hurt him. I didn’t realizing I was doing anything wrong until the day I got broken up with and I’m willing to own up to my mistake. I’m sad to lose one of the best human beings I’ve ever met but also grateful that he meant so much to me that it has influenced me to change. I’ve learned so much about love, myself (good and bad), and that there are genuinely good people out there in this relationship. And I believe I can get better if I start now and stay consistent. And I will continually track my progress and hope to come back with a more positive post!\n\nTo people who have been/are  toxic: The first step is admitting/realizing that you are wrong. Ask yourself what it’s stemming from. Ask yourself if you’d be okay if your partner acted the way you did. Realize that your partner is a whole separate person, you shouldn’t want to change them to be perfect; you should want to grow together and build yourself up. Get outside help if you need it. If you feel yourself about to burst at your partner: write your emotions down, talk to a friend, take a minute to write it down, take a deep breathe to calm yourself instead of acting out of pure anger. It takes a toll on them and could be potentially traumatizing for them. Learn from me. Try to heal instead of taking someone down with you.\n\nTo my recent ex: I hope you find peace and heal from this. I wish I could take back all the things I’ve said to hurt you and realize that it was all stemming from made up situations in my head. It’s not an excuse but it wasn’t personal. But that’s why I’m getting help. I hope the next person gives you the same if not more love, respect, and happiness that I tried to give you. I have so much love for you.\n\nEDIT 1: I am so overwhelmed by the support. I’ve been crying all day,  talking to my friends, reading other posts. I am so excited to grow!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/of8s8b/i_realized_i_was_the_toxic_one_in_the_relationship/", "title": "I realized I was the toxic one in the relationship…", "social_network": "reddit", "user": "Purple_Dish_8010", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 892, "down_vote": 0, "creation": 1625621143, "permalink": "/r/DecidingToBeBetter/comments/of8s8b/i_realized_i_was_the_toxic_one_in_the_relationship/", "nsfw": false, "first_save": 1635435774.182491, "replies_charged": false}