{"id": "t5_2tand_t3_qgt8ec", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "I'm 24 years old and it's now been a year since I finished my college degree and entered the job market. \n\nIt was a year of many achievements but as the months went by I realized that I don't really know myself and I don't have the slightest idea of ​​what I want to do with my life. This is probably not the best place to express my feelings, but I really need to vent to someone and some clarity in my head. I don't know where to start so I'm just gonna start writing...\n\nI left my parents' house because I wanted to stop being a financial burden for them. Although I feel good about it, I miss them so much. I don't really live close by (literally I have to take a plane to see them). And life in Portugal is quite complicated for a young person who is trying to be independent, where everything has a very high price and the salary, simply cannot cover so many expenses and hope to be able to leave some aside for savings or down payment for a house. My mother, despite not showing it, got into an almost depressive state when I left and I'm here not being capable of helping her.\n\nI'm living in a rented apartment with my girlfriend, our relationship seems to have deteriorated over time and I feel like this is my fault. We get into a routine, where the days are just - waking up - working - depressing - sleeping. I feel like I don't love her like I used to and I don't see myself making a living with her. By the way, this has been the main theme of our discussions - \"Do you want to have children with me? A dog? Are we going to save for a house? We have to think about the future!\" - Future! Future! Future! \n\nDamn! Here I am completely unhappy with my job (I do customer service, many of you must already be feeling this discontent) - People treat you like a dog, your co-workers look at you sideways and your boss thinks exclusively on how to get richer at the expense of poor recent graduates looking for a first job and entering blind at the first opportunity that comes their way. \n\nI spent a whole year going to job interviews, I went to the capital several times for face-to-face interviews, meetings via zoom, numerous recruitment processes, I even looked for opportunities abroad and NOTHING! \n\n **Two things may happen!**\n\n When I think I'm going to get the job, I get that beautiful \"(...) we found a candidate who fit the job profile better.\" or when I'm even in a good position in the recruitment process for a company, I get discouraged because apparently it wasn't something I wanted to do, but I signed up on impulse due to the frustration I'm feeling and it's starting to become unbearable lately. \n\n I've already thought about everything! Ending everything in this life, quitting my shitty job and going back to my homeland, being with my parents, saving more, being in my own corner with a quieter job and keeping my sanity mental. \n\nI don't know... But once again this is my problem! \"I don't know\" what to do with my life. I just wanted time to stop for a bit!\n\nI believe that many here are going through something similar and I would like to know your opinions and advice. Many will say \"you already know what you want to do, you just wrote it unconsciously\" but I would like to have your testimony anyway. \n\nSorry for the long post, but I was never good at expressing myself either by speech or words. \n\nThanks", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qgt8ec/im_24_and_i_dont_know_what_to_do_with_my_myself/", "title": "I'm 24 and I don't know what to do with my myself.", "social_network": "reddit", "user": "Stocmer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 39, "down_vote": 0, "creation": 1635329105, "permalink": "/r/DecidingToBeBetter/comments/qgt8ec/im_24_and_i_dont_know_what_to_do_with_my_myself/", "nsfw": false, "first_save": 1635435343.2361271, "replies_charged": false}