{"id": "t5_2tand_t3_knyzfl", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "Below is the list of the best books that I read in 2020. What a year has 2020 been! I mean did anybody see this coming back in January? I must admit, just like most of the people in the world, I had read the news about COVID-19 coming from Asia in Dec 2019. And, just like anybody else, I dismissed them easily. What a good lesson! But anyway, if there was anything positive out of 2020 it was that I got to spent a lot of time with my family. I hope that a lot of people could say the same.\n\nAnd … I spent a lot of time reading. I broke my previous record of 30 books and I read 35 books in 2020 (woot!) I also read more than 10.000 pages for a second year in a row. I read early in the morning before the working-from-home madness would start. I read on the weekend during the quiet time.\n\nIn this article, I listed the best books that I read in 2020. This time I’ve broken the list down into genres. Not always the genre that the authors picked when they published their book, but the genre that I would assign to it.\n\n# Selection criteria\n\nThis year, I have selected seven of the genres that I primarily concentrate on and I have selected the best book that I’ve read in 2020 in each category.\n\n# Biography: The Moment of Lift\n\nI am starting with biography (alphabetically) and the title that I want to share with everybody is The Moment of Lift by Melinda Gates. I have been a fan of the Gates for many years and I hope to meet them some day. Their annual letter to friends inspired me to create my yearly review process (more details: Yearly Review). I have been waiting for a book by Melinda ever since I learned more about her. Yes, she comes from a very good family. Yes, she was fortunate to marry one of the richest people in the world. But what matters most is what you do with the hand you’ve been dealt and not so much the actual cards that you see in front of you. And she had done so much and so silently.\n\nIn 2020 there was one demographic that suffered the most: women. Women everywhere took additional unpaid work as Melinda calls household work. Women everywhere had to pause their careers to take care of their kids who had the challenge of studying from home. Even though, this book was published before the pandemic, it will open your eyes about a lot of the challenges in the world. I would recommend it in parallel with Factfullness by Hans Rosling.\n\n# Business: Good to Great\n\nNext is the business category. Even though my blog is named after James Collins’s book Good to Great, I must admit I had never actually read the book itself. I have studied passages out of it in business school (e.g., the Level 5 Leadership concept) so that I get to the level that it requires. I would not recommend this book to just anybody. It is based on massive data (source: Goodreads): 6.000 articles, 2.000 pages of interview transcripts, and 384 MB of data. James Collins uncovered the secret sauce that makes good companies great. He compared the great companies that he and his team discovered to the good companies that did not make that leap.\n\nThis book will be good for you if you work in a corporate environment anywhere and great for you if you want to build one yourself (pun intended). You will learn more about the level 5 leaders, the hedgehog concept. What I found especially interesting and relevant is the following sequence: get the right people on the bus, get the wrong people off the bus, and then figure out what to do.\n\n# Health: Yoga Mind, Body & Spirit\n\nHealth was a big topic in 2020. Along with sleep (which I covered in more detail last year) and diet (which I am just starting to wrap my head around), exercise is the most important ingredient of the healthy and energetic life. I have been doing my regular exercises, but I needed something else to unify mind, body, and spirit. This something for me will be yoga. I started with Yoga Mind, Body & Spirit because it contains a very thorough description of the physical part yoga (i.e., your body, your organs). And also, each asana (or pose) is described in detail with different levels of difficulty.\n\nI would recommend this book to all beginners. And in few years, I would probably be able to recommend it to the advanced practitioners as well (when I become one myself). I am personally starting gradually. I spend several months just doing the basic exercises in the beginning of the book. And now, I am only doing 15 minutes each weekend and I’ve just started with the standing poses. \n\n# Philosophy: Stillness is the Key\n\nEach year I read one of Ryan Holiday’s books. I could have read them all at once, but I think this would have diluted the message. This year, I finally read Stillness is they Key. It was on my to-read list long before it was published. And I am really happy that I read it during 2020, because a lot of the philosophy in it is really relevant. I am always captivated by Ryan’s examples. He always finds a real-life example to use to illustrate his points. And Stillness is the Key is full of such examples.\n\nAs always with Ryan’s books, I would recommend this one to anybody. Read them in order though (i.e., start with the Obstacle, continue with the Ego, and end with the Stillness). Try to through the Daily Stoic somewhere as well. This book helped me solidify my stillness practices and it also helped me define new areas where I need to continue looking for it.\n\n# Psychology: Flow\n\nPsychology was another very important topic for 2020. Similar to Good to Great, I have been avoiding this book for a few years. In 2020, I finally felt that I was ready. And Flow delivered on the hype and its promise the psychology of optimal experience. Mihaly Csikszentmihalyi spent his life researching what he calls “optimal experience”. His book has been quoted in many of the books that I have shared with you in previous years. But, as often is the case, the original is a masterpiece.\n\nI would recommend this book to you only if you have a solid foundation. Experiencing flow is one of the most rewarding experiences. Tapping into this force leads to optimal performance, increased happiness, and, above all, just pure success. It is not a magical formula though. Flow requires a lot of effort, concentration, and deliberate practice.\n\n# Self-help: The Power of Habit\n\nThis is my main passion and I always try to read a lot of self-help books. And the Power of Habit was yet another book which I avoided in previous years until I feel ready for it (this looks like the main theme of 2020). Charles Duhigg researched and discovered the habit loop (i.e., cue-routine-reward). He studied some of the best performers in the world and distilled their skills down to the habits that have. He also identified a simple (but not easy) process for changing a habit. And finally, he studied and wrote about organizational and communal habits.\n\nSince we are living about 50% of our days on habit, I would recommend this book to just about everyone. You need to get deep and start documenting your habits to make sure that they work for you and not against you.\n\n# Spirituality: Awareness\n\nAgain, an important area of concentration for me. I differentiate Philosophy from Spirituality by the area of implication. While the former improves primarily the mind, the latter improves primarily the soul. And as we learned in Stillness is the Key, you need both to generate stillness in your life. Anthony de Mello is an internationally acclaimed spiritual guide who wants to wake us up, because he claims we are sleeping the collective sleep of humanity. Since, it is impossible to teach you what it means to be awake, he shows you what it means to be asleep.\n\nI have always fascinated the point toward which most philosophies and religions converge (Taoism, Stoicism, Buddhism, Christianity, Islam). Anthony is drawing on his extensive knowledge in all these fields to show us that this point which cannot be described is being awake. And everything else is being asleep.\n\n# Bonus: Algorithms to Live By\n\nI only want to list one more book which did not make the cut, but it is worth your attention. This one is for the inner geek in me always trying to organize, put in order, and computerize the world. This book will teach you how to apply computer algorithms in everyday situations that you are all facing. Our lives are an endless set of problems with predefined constraints. Not unlike a mathematical or an informatics problem. Why not use what we have learned over the past century?\n\n# Summary\n\nLooking back at my previous year’s list of best books, this is what I said in the summary: “There is no reason why you cannot make that time for yourself in 2020.” Well, I did not mean that much more time. For 2021, I only wish that, as we hopefully recover from the pandemic, we will not lose the things that we learned in 2020 about the things that matter the most.\n\nRead more, enjoy more, be more!\n\nTin Mayer\n\nAuthor", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/knyzfl/tins_list_of_best_books_2020/", "title": "Tin's List of Best Books 2020", "social_network": "reddit", "user": "tinmmayer", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1609451930, "permalink": "/r/DecidingToBeBetter/comments/knyzfl/tins_list_of_best_books_2020/", "nsfw": false, "first_save": 1635436638.817314, "replies_charged": false}