{"id": "t5_2tand_t3_6cetvn", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "When we focus on ourselves, we prevent ourselves from experiencing the world outside of our own head. Living in your head is detrimental, too often, the thoughts in your head are less like a cheerleader squad, and more like a team of football players giving you a swirly. The ability to connect with others starts with the ability to disconnect from yourself. To make a positive impression on others, stop thinking about how charming you’re being (or not being) and stop analyzing what people are thinking about you, instead, start showing curiosity towards other people.\n\n&nbsp; \n\nTo practice this shift, understand that human interactions are rich with potential insights. See this as a sort of game, make interactions with people an opportunity to understand their motives and beliefs.\n\n&nbsp;  \n\nWonder what people are trying to accomplish with their words, why they’re saying what they’re saying, why their body language is tense or loose, or why they have a particular social habit. The primary goal of this is to shift your focus off yourself and on to the people you are interacting with. Doing so will not only engage you more in social interactions, but it will also make you more engaging. When you do this, your interactions stop being opportunities for you to focus on your own problems, and instead become opportunities to connect with others and enter a state of curiosity. ", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/6cetvn/the_ability_to_connect_with_others_starts_with/", "title": "The Ability to Connect With Others Starts With The Ability to Disconnect From Yourself", "social_network": "reddit", "user": "Aghayden", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 88, "down_vote": 0, "creation": 1495341812, "permalink": "/r/DecidingToBeBetter/comments/6cetvn/the_ability_to_connect_with_others_starts_with/", "nsfw": false, "first_save": 1635435836.8443108, "replies_charged": false}