{"id": "t5_2tand_t3_m6zscq", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6"], "text": "A picture from St. Patricks Day in 2012 popped up on my facebook today. In it, I was smiling, but I remember that day so well. \n\nI remember it because I fit into a size small shirt for one of the first times & I felt like I was finally worthy of being liked in some way, but I was also still clinging to hatred & self-loathing in many others. \n\nOn St Patty’s Day in 2012 I went to the city for my first & last time for the parade. I constantly wondered if everyone I was with would think I was cool. The adderall & drinking help that feeling a lot though. The disordered eating made sure I didn’t take up too much space. \n\nI looked at the picture and felt so much love for 2012 Erin because to feel sorry for her would just bring back old habitual ways of navigating for me. I see her. I see her struggles. I see her thought patterns and I feel compassion. I forgive her for not thinking she was worthy. I love her for everything she is going through internally. And most of all, I honor her & am grateful to her. \n\nI used to think that everything I did wasn’t good enough. But I now see that the girl who was always searching for ways to love herself is the reason I am where I am now. I didn’t know how to get to self-love at that moment, but I do now because I was curious enough to try different things and figure out they didn’t work and maybe something else would. \n\nI didn’t know that on that day, 9 years later, I would be a completely different person. I didn’t know that the path I would take would lead me to self-discovery, forgiveness, compassion, and so much love. \n\nBut it did. \nAnd I am forever grateful for how far I’ve come.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m6zscq/just_because_you_dont_know_where_youre_going/", "title": "Just because you don’t know where you’re going doesn’t mean you won’t get somewhere beautiful. Be grateful for the journey.", "social_network": "reddit", "user": "erinpanzarella", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2256, "down_vote": 0, "creation": 1615985827, "permalink": "/r/DecidingToBeBetter/comments/m6zscq/just_because_you_dont_know_where_youre_going/", "nsfw": false, "first_save": 1635435335.6167188, "replies_charged": false}