{"id": "t5_2tand_t3_enr9oy", "request": ["5755acc2-0c2d-4be4-9289-8d3e1d926290", "5f5800f0-4f93-434b-b4ea-20780c889498"], "text": "A year ago today, i learned i had mild anxiety, but however mild it was, i was fed up. This was just the last straw that broke the camels back. I hated who i was and wanted to change.    \n\nI think i have dramatically changed to a better person over this past year, and i hope my list helps you decide to become better too!\n\n**So first, here is the list of stuff that i did accomplish over the past year**   \n\n* Keep schedule.\n* Plan out to do list for the day   \n    * I actually made my own template, that way i could have stuff i needed to do everyday, and then blank ones too. [Here](https://docs.google.com/spreadsheets/d/1Fv0WAQACRSRaTeANuvsHG6w-aiHJdy7ps8ePyp5sfoc/edit?usp=sharing) it is if you wanna modify it to fit you\n* Take multivitamin\n* Find hobby/join club    \n    * I started participating in a DND group and started a sludge metal band.   \n* Gym 3 Times a Week (Make Schedule)\n    * NGL this doesn't always happen 3 times a week, but most weeks that aren't insane.   \n* Do 30 mins of creativity a day. Songwriting, Drawing, Writing, Worldbuilding, etc.    \n    * I do probably 1 1/2 to 2 hours total a day.    \n* Use face lotion/moisturizer/sunblock everyday\n* Get a better haircut    \n* Use a planner/calendar to keep track of dates and deadlines   \n* Brush teeth at night    \n* Blue light filter on phone and pc after certain time   \n* Read every day\n* Fix posture     \n    * This came with the gym       \n* Drink as much water as possible\n* Floss      \n    * I found these things called \"flossers\", they are incredibly convenient      \n* Try to improve my creative skills as much as possible\n* Dream Journal and Drink water when wakeup\n* Take contacts out at night\n* Prioritize. Put schoolwork first, then my creative pursuits, then social life, then fucking around on social media, not the other way around\n* Maintain organization in all parts of life. Cleanliness, Emails, Car\n* Every time i walk in and out of room, put something in it's place.\n\n**And here is the second half of the list, this is the stuff that i'm still working on**   \n\n* Much less social media (and only the good subreddits) and screentime in general. Don't fall asleep on phone. Don't check phone as soon as i wake up.     \n    * I have got better at finding and only consuming from subreddits that elicit joy, but i am still pretty guilty of the rest.  \n* Eat better    \n    * I have always been the \"chicken and fries only\" kid up until now (19). I have gotten much better, with different types of meat, drinking juice, milk and water instead of pop (which i really treat more as a desert now), im still bad with a lot of fruits and vegetables, but i have definitly made progress. \n* Take 10 mins a day to meditate     \n    * This happens maybe only once or twice a week, i need to get better.   \n* Beat it less/No porn    \n    * This is a list item that i didn't take super seriously until recently. I lost my virginity a couple a months ago and couldn't reach orgasm because i had beat my dick so hard for so long, and i realized that i had gotten into more and more taboo porn subjects, and i felt kinda icky. Im on the road to recovery (i only consume porn maybe once a week, and normal porn only. I now use lube to masturbate and do it less often), but this has been by far the hardest to do.   \n * Keep a mostly regular sleeping pattern (before the sun comes up)     \n    * I started my coop (paid internship) this semester, so that kinda forced me to.    \n* Stop procrastinating    \n    * Even though ive gotten good at prioritizing myself, i still find myself putting things of in order to relax or party.   \n* Cut sugars as much as possible      \n    * As ive said, i cut out pop, which has helped, but i am far from \"as much as possible\".   \n* Create a budget and become financially literate    \n    * This hasn't been too much of a priority. Im fortunate enough to have my parents helping me pay for tuition and housing, so managing an income hasn't been the top concern, since i don't have a major source of income yet. Im getting there.   \n\nI'm more than happy to answer any questions", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/enr9oy/one_year_ago_i_decided_to_be_better_here_is_the/", "title": "One year ago i decided to be better! Here is the self improvement checklist i made, and the progress ive made on it!", "social_network": "reddit", "user": "destructor_rph", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 36, "down_vote": 0, "creation": 1578854096, "permalink": "/r/DecidingToBeBetter/comments/enr9oy/one_year_ago_i_decided_to_be_better_here_is_the/", "nsfw": false, "first_save": 1635436644.2470558, "replies_charged": false}