{"id": "t5_2tand_t3_qf5bes", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "It’s quite a long story, but I’ll try to keep it short. I have a family member who abused weed consumption for as long as I can remember myself. We could gather together one day and he would be stoned and zoned out. At the same time, he could act as if nobody noticed. It made me pissed so damn much that I’ve decided to never use ganja in my life. Ever. I was aggressive about it. When the theme of drugs came up in a casual conversation in our family, I would suggest to kill not only those who sell drugs but also those who use it. And that person would bring up something like “Oh, but weed is not really a drug, right”, THINKING THAT NOBODY KNOWS ABOUT HIS ADDICTION, but I knew. It made me mad, and so I would say something on purpose just to make that person mad without knowing that I know. \n\nSo, I guess you already know where I’m getting at. Few months ago I smoked marijuana myself. The company I was with were heavy smokers (also, my friends), and so I knew what we were about to do. And for some reason I was OK with it. \n\nThat experience was one of the worst experiences in my entire life. The fear that I had… One panic attack after another. I thought I’ll die. I couldn’t think straight. And it was at my friends house, so it required me to go home. And in this condition how could I go home? One of my friends suggested me to lie down on a couch. It didn’t help. I was going back and forth between toilet (because I thought that I will piss myself) and that couch. When I was able to think at least a little bit straight, I ordered a taxi and went home right away. When I came home, I did my very best to act straight in front of my parents, said hi and jumped in bed in my room. The next day after all those panic attacks my stomach was hurt and it made me throw up. \n\nBy now you maybe thinking: could it be even worse? What if I say, that I did it again in a couple of weeks? I don’t know why I did this. I feel so much shame and guilt. WHY I DID THIS? I hate myself so much. \n\nIs it because I envied my friends who were laughing and having fun while being stoned? So, I did this in order to prove myself that I could have fun too? \n\nWhy does this drug has a positive effect on everybody else but not on me? Why did I even agree to smoke weed? I wish I never did this. I feel so much guilt that it kills me. ALL THESE THOUGHTS KILLL ME INSIDE EVERY SINGLE DAY. I have this constant anxiety, which cripples me and doesn’t allow me to be productive and enjoy life in full. \n\nI want to “not want” marijuana. Right now it’s been more than 3 months since my second and last time I smoked weed. Since then there was only one time when my other friend (outside of the mentioned friend group) has invited me to smoke with him, to which I said “no”, but I still feel myself very weak. And I hate it.\n\nI want to, sort of, say no and be confident in myself that I will never, ever, EVER even think about consumption of that drug. But I can’t. I’m afraid of myself. I feel as if I betrayed myself and now I can’t forgive myself for it. \n\nHelp me, Reddit. I want to be better. I’m tired of being afraid of myself.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qf5bes/im_seeking_help_from_these_weird_thoughts_about/", "title": "I’m seeking help from these weird thoughts about marijuana", "social_network": "reddit", "user": "Decent-Ad9135", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1635122920, "permalink": "/r/DecidingToBeBetter/comments/qf5bes/im_seeking_help_from_these_weird_thoughts_about/", "nsfw": false, "first_save": 1635436757.1716092, "replies_charged": false}