{"id": "t5_2tand_t3_lj2cbc", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "The feeling like I'm (16F) wasting my time has gone on my entire life, I remember even as a 6 or 8 year old I worried about this and I could never enjoy anything. I've lost the ability to differentiate between what is productive or not because of it.\n\nBecause I'm panicking about being \"productive\" but also suffering from a crisis where I'm constantly questioning if something is productive I want, I feel mentally drained and I just scroll continuously since I can't handle the stress of anything else. (even though I'm still stressing)\n\nI want to be better, but I don't know how to shake this feeling off. It attaches itself to anything I do or think of and it makes me not enjoy anything. I know I'm young and have my life ahead of me, but I want to make something of myself.\n\nI've tried writing down all the productive activities I've done daily, but I still have this feeling that drains me. If anyone has any advice I would appreciate it a lot.\n\nEDIT: omg !! I can't believe the response, it's so heartwarming and I could cry tears of joy. Thank you all so much ! I've been so busy, so I'm so sorry if I haven't replied to your comment individually.   I'm just so relieved that other people understand what I'm going through, and how they are going through the same thing, I always thought I was the only one. I'm going to take all of your advice, firstly I plan to stop using Instagram completely, just cold turkey it, (it's the only social media platform I use) Then I want to try and get a therapist, I need to learn how to relax and enjoy my teenage years. I used to go to therapy before lockdown, but honestly I disliked the views of that therapist and I felt so much guilt because she was expensive. Anyway, the response was overwhelming and I can't thank you all enough!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lj2cbc/how_to_stop_constantly_feeling_like_youre_wasting/", "title": "How to stop constantly feeling like you're wasting your time?", "social_network": "reddit", "user": "breadookay", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 17, "down_vote": 0, "creation": 1613229432, "permalink": "/r/DecidingToBeBetter/comments/lj2cbc/how_to_stop_constantly_feeling_like_youre_wasting/", "nsfw": false, "first_save": 1635438065.2230823, "replies_charged": false}