{"id": "t5_2tand_t3_cfdfee", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "I'm not sure if this where I can post this.  I wrote something about my experience with depression and how I'm going about recovery.  \n\nI was a senior in high school when I first acknowledged my depression.  I felt like I was in my own dark world when a negative energy seemed to start controlling me and my thoughts.  Before that I remember some negative thoughts floating around my head that only seemed to stem from smaller self-esteem issues.  Now it was real though.\n\nTo put a timeline on it, 2010-2011 was my senior year.  Nine and a half years of not feeling like my true self.  It feels like 20 years at this point.  \n\nI didn’t get a leadership position in band.  A girl didn’t like me.  Bunch of other smaller things happened.  I took those things personally instead of channeling my frustration in positive ways.  When I think of band these days, I think about the fun I had and the friends I made.  And I haven’t thought about that girl since high school.  \n\nI thought I was stuck, alone, and hopeless.  I didn’t know who to talk to about it.  Obviously I could approach my parents and talk about anything with them.  Or I could talk to my younger brother.  But I didn’t want to scare anybody.  I thought it was just a phase and that it was going to ride itself out.  Like the Suns during the Nash era.  They lost the playoffs consecutive seasons.  Or when the Cardinals lost the Super Bowl.  Or when Christopher Nolan lost an Oscar.  Or even when my ex broke up with me.  I got over those.  \n\nThis was a lot bigger than basketball, and I didn’t really get over it.  Coincidentally, the Suns still suck.  \n\nGraduation rolled around that May, and despite that I was walking on stage to receive my diploma, I still felt sad.  I just pretended I was happy for an entire evening.  \n\nFor those of you reading this, I do need you know I was NEVER suicidal.  Taking my own life was not a way out.  I needed to overcome this in a bigger way.  Otherwise, depression wins.  I’m stubborn and slightly competitive.  Fuck depression.  \n\nAt the beginning of my senior year, I signed up for a film photography class.  My happiest times were learning ways to manipulate light and shadows.  It really helped keep my mind healthy and happy.  Dude, my first roll of negatives were so good.  I still use my Pentax K1000.  \n\nAfter graduation, I signed up for improv comedy classes.  Thinking on my feet during games helped my mind free itself from overthinking.  Then I took up more hours at my job.  It wasn’t enough though.  I was still depressed.  \n\nThere were good times though.  I went to Israel twice.  I studied abroad for a short while in Ireland.  During that same trip I travelled to Amsterdam and Germany.  I think this is where I discovered my love for seeing the world.  And my love for Guinness.  I had a girlfriend at one point, and that was fun until it ended.  \n\nOvertime time though, it would come back because I wasn’t doing the things I loved everyday.  My insecurities got the best of me.  Like maybe I was too short.  Like maybe my ADD was childish.  Like I felt stuck as an assistant manager at a movie theatre.  I felt bad that I was not anywhere near I thought I was going to be when I received my bachelors.  I wanted to be making movies, not counting BunchaCrunch at a movie theatre.  \n\nOne day towards the end of this past September, I kept having dark thought after dark thought, and I decided I had enough.  It didn’t help that I was drinking a little bit.  I Tweeted about my depression and that I wanted to change.  I chose Twitter because it’s my smallest platform.  I didn’t want to scare everybody.  I just wanted someone to know what was going on.  I received phone calls and messages from family and friends.  But now it was like all eyes were on me, and I had to do something about his “phase”.\n\nOctober rolled around.  There was a week that, after it passed, I realized I forgot to take my Adderall (I renewed my prescription when I was promoted to manager).  I didn’t notice it at first because I was super focused at work, and I had been in a good mood all week.  I felt lighter, more pleasant, bouncier, like myself.  I started thinking highly of myself.\n\nLike maybe I am small.  Tom Cruise is small.  I've watched that dude save the world a dozen times.  Everyone loves Tom Cruise.  ADD is childish?  Beck once said you need a childlike quality to produce music.  Assistant manager at a movie theatre.  Well, about a year ago I chose to get into education before the movie theatre chose me forever.  \n\nWhen the new year rolled around, I felt like I was finally ready to get some help.  Since I had a positive energy, I felt motivated to get help.  My therapist basically said I’m doing good, I just need to keep myself busy.  \n\nWriting everyday has become important to me.  Flushing out my feelings in the way I want.  This whole essay is riddled with grammatical errors, but it feels like I’m speaking honestly.  That feels good.  Writing and reading go hand in hand, so I make an effort to read just before going to bed.  \n\nBacktracking a little bit to after my breakup -- literally the day after.  I renewed my membership at LA fitness.  I got fit that Spring and Summer 2016.  That was a good half of ‘16.  When one sets goals for himself, and he achieves them, he inherently gives himself something to feel good about.  Lifting things a bunch of times?  Yeah.  I can do that no problem.  Fitness allows me to clear my head before everything bottles up.  \n\nI also rediscovered my love for making and finding new music.  I signed up for a DJ class at my community college a few years ago.  It made me remember being in a dark room for the first time.  Was I going to do anything with DJing?  Who gives a fuck?  I was having fun getting my hands dirty.  I was going to do music whether it be DJing, guitar, for myself, or in front of other people.  \n\nLast, but not least, one of my bigger steps was deleting Facebook off my phone and logging out of social media when I am not using it.  \n\nThese days are about going to sleep in a better position than when I was when I woke up that day.  Doing activities that make me happy.  Everyday.  If I can workout for at least an hour that day, play a few songs that day, write a paragraph or two that night before I go to bed, and read a chapter or two before I fall asleep, take a photo a day until film dies.  That sounds like a good day, and that’s all I need my days to be. \n\nSometimes I will have relapses.  In this case, I take a walk, watch “The Office”, meditate a second time that day, and remember the people I love and the things I love.  \n\nThis has been long, so I will wrap up by saying just a few more things.  Happiness is a journey, not a destination.  It cannot be accomplished over night, and it isn’t permanent.  It requires daily effort.  Furthermore, it’s okay not to be okay.  Depression is so common that it cannot be ignored.  Please reach out to someone if you think you have depression.  Surround yourself with good people and people who you love.  Likewise, if you notice someone is not feeling right, drop in once in a while.  It will help the person in question keep their mind off it.  Lastly, I would like to thank all of the people who have been in my life during this stage.  You helped me through it.  Just please know that everything is good.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/cfdfee/my_experience_with_depression_and_my_road_to/", "title": "My experience with depression and my road to recovery.", "social_network": "reddit", "user": "RavenclawPaw", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1563571625, "permalink": "/r/DecidingToBeBetter/comments/cfdfee/my_experience_with_depression_and_my_road_to/", "nsfw": false, "first_save": 1635437702.0753107, "replies_charged": false}