{"id": "t5_2tand_t3_pfv037", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Hey guys, \n\nafter seeing u/LCBrianC offer some free coaching to the community a few weeks ago, I was inspired to do the same. So for the next two and half weeks, I would like to also offer my help.   \nJust as with u/LCBrianC's offer, there won't be any kind of selling going on before, during or after the coaching. Instead, it is going to be entirely about you.   \n\n\nSome info about me: I have studied psychology and economics (BSc.) in the past, before I found my way to coaching. While studying psychology I met my business partner whom I later had a successful temping agency for medical staff with. I'm from Germany, so our business was located in Berlin.   \nAfter a few years I sold my shares to my business partner (at the end of 2019), because it became too stressful for me. So since the beginning of 2020, I have coached 55 people for roughly 350 hours.   \n\n\nRight now I have 3 clients who work with me long-term, but I don't want to get complacent and miss any potential learning and practice opportunities that can make me into a better coach.   \n\n\nIn my coaching, I use everything I know to help you achieve what you want in life or business; I don't limit myself to a particular style or approach. It's more about doing whatever I can to help the person in front of me. If I had to pin myself down somewhere, I would say that I am a mindset coach. I help you shift into different modes of thinking or mindsets that empower you to achieve your goals or vision in life.   \n\n\nIf this sounds interesting to you, let me know. I am happy to give you up to four sessions between today and September 30th.  \n\n\nI'm looking for people who:  \n\n\n* Know that they can do better in life, but are not doing so. You have all the how-to, but simply doing it is an entirely different matter for you.\n* Want coaching but can't afford it. I prefer to work with committed individuals who really want to improve their lives. Especially because this is free and you are giving me your time to make your life better. So take it seriously. If you want to continue after the free sessions, it has to be your idea. I won't push you into anything. \n* Can commit to once a week somewhere between 9:00 am and 8:00 pm CEST (That's 12:00pm to 11:00am PDT, 3:00am to 2:00pm EDT and 02:00am to 1:00pm CDT).   \n\n\nIf you are interested and want any more info, feel free to comment or message me directly. I'll do my best to help 👍", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pfv037/free_coaching_anyone_courtesy_of_ulcbrianc/", "title": "Free coaching anyone? (Courtesy of u/LCBrianC)", "social_network": "reddit", "user": "Xlino1", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1630506398, "permalink": "/r/DecidingToBeBetter/comments/pfv037/free_coaching_anyone_courtesy_of_ulcbrianc/", "nsfw": false, "first_save": 1635436018.1542592, "replies_charged": false}