{"id": "t5_2tand_t3_neut2k", "request": ["badbd7e1-4692-457a-97bc-7317bdf8e5c1"], "text": "It was SO HARD coming out of the breakup, slowly realizing that I was actually abused in that relationship… a lot. But at least that finally explained why I was so ANGRY all the time. And sad. Especially on Mondays.\n\nThe first few weeks were the worst. would wake up and just cry every single day. I couldn’t concentrate at all. Obsessing over the relationship. Throwing things at the wall. Also I struggled to eat, and sometimes I just congratulated myself at the end of the day for managing to get through and choking down at least a bowl of cereal. Somehow, probably since I was new and we were all newly remote, I survived at work. But only until some months later, I got the scary news that my JOB was in a risky state too.\n\nBut by then I had gotten much stronger emotionally. I tried all sorts of things to get better. Early morning running. Journaling. Yoga. Therapy (👍🏼). YouTube videos. Called my friends and family constantly. Reading about trauma and abusive relationships. Journaling. Painting. Scrapbooking. WHATEVER I thought could help. I leaned into the things that helped, and forged a path for my own survival. And I worked HARD. I set small goals for myself. Pushed myself. Gave myself rewards. Consoled myself after failing and pushed myself to try again the next day. I developed a routine of doing good things every day.\n\nAnd NOW I finally am starting to reap the benefits. My job is no longer an awful scary gauntlet to survive everyday, I’m on top of it. I’m myself again and myself is someone who is great at her damn job ☺️. My morning running routine which I took on to keep me sane, combined with my new healthy diet (if I hate everything I eat anyway, why not use this time to cut out junk food?), combined with quitting drinking (OVERALL good idea) has changed my WHOLE BODY. I have beautiful toned legs and arms, a fresh sun kissed face and I’m closing in on that sixpack I’ve wanted since high school. 🤩\n\nMy mood and anxiety are still I’d say p bad on average but SO MUCH BETTER.  I’m so proud of myself and for surviving an awful situation 🏆 I’ve never in my life had the self confidence I have now now that I’ve learned to love, take care of, and appreciate myself ❤️❤️❤️ \n\nThanks for listening 🌻", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/neut2k/best_monday_in_months/", "title": "best Monday in months", "social_network": "reddit", "user": "the_oh_see", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1621293147, "permalink": "/r/DecidingToBeBetter/comments/neut2k/best_monday_in_months/", "nsfw": false, "first_save": 1635436142.501276, "replies_charged": false}