{"id": "t5_2tand_t3_jowp1h", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "This has been my biggest failure. My lack of self-reflection on my sexist misogynistic behavior and my subsequent performative feminism. I’m 25/ male and this has effected my relationship with my 21/woman partner.\n\nI didn’t want to look at what could have caused this repugnant behavior because I wanted to focus on how to make damn sure Ive erased it. But to fully grow I can’t allow myself to not look at some of the variables that influenced my conduct; by ignoring these not only do I allow myself to interact with them and not grasp their harm, I allow others to interact with them and learn this vile behavior as well. The first thing I did after looking at myself and asking why I am the way I am, was to turn those I interact with most frequently: my friends. Before college, all my friends were men. Men that grew up in the same small conservative town who made sexist jokes openly in class, at parties, and other social events. After college I’ve became close friends with women but that didn’t eliminate my ignorance, I was able to hide it not destroy it. Looking back, I’m not sure if I truly grew or if those friends I’ve made felt uncomfortable addressing my ignorance. I look at the friends I’ve made in college that are men and I see similar traits to those from primary school and I wonder why haven’t I called them out more frequently, outside of the explicit act, why haven’t I called them out for their micro aggressions? Is it fear? Fear of their reaction or fear that if I call them out I’d have to call myself out. So I didn’t.\n\nBut it’s not my friends or society’s fault, I’m an adult. I seek growth, education, and conversation for the issues that plague our society, so how the hell haven’t I seen my own deficiencies in these areas. It’s easy to agree with condemning misogyny, obviously, but is it easy to condemn the misogyny within me. I rebuke sexism and despise the diminutive patriarchal society, so why can’t I address the disgusting parts of me? And the bullshit answer is I didn’t have to. I wasn’t explicitly sexist, I wasn’t being called out, I was surrounded by people who acted with the same discriminatory behavior. I had the privilege of believing that because I said I stand against sexism, I was immune to being apart of the problem. I actually believed that because I had surrounded myself with women that I in turn must be different from the misogynists who harass/assault women. Without ever looking at the man in the mirror and saying what are your thoughts on this and what words are you not saying that are tied to sexism, I truly thought I was doing enough.\n\nWould I have been as effected if someone I didn’t know tell me what I said was misogynistic instead of someone who I care for and respect? I doubt it, and there lies another problem. There is an objective malignant aspect within me, and that’s misogyny. Regardless who confronts me about it, I need to be receptive and reflective on how I can change. Sexist behavior doesn’t necessitate context. You’re sexist if you say, think, and believe these things whenever, publicly or privately. Even at this moment, writing this is solely performative, growth and evolution is in the perpetuity that I continue to acknowledge that this is a very real hurtful damaged part of who I am and that I denigrate all women when I perpetuate sexism.\n\nI wrote this because I'm not sure of the next steps to properly address these abominable traits within me. I don't want this to simply be an acknowledgment but instead a metamorphosis that begets visceral growth and eradication of these internalized behaviors. I am asking for any advice and guides to further me in this process so that I can see applicable growth.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jowp1h/how_to_address_my_misogyny_and_sexism/", "title": "How to address my misogyny and sexism", "social_network": "reddit", "user": "Corduroypills", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1604630119, "permalink": "/r/DecidingToBeBetter/comments/jowp1h/how_to_address_my_misogyny_and_sexism/", "nsfw": false, "first_save": 1635437851.775745, "replies_charged": false}