{"id": "t5_2tand_t3_n6fxnt", "request": ["83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "She wrote me saying this 8 months after no contact through the mail and just the way she wrote it seems so hurt and pointing blame. Following this will be my side of it and it just makes me so sad because I have CLEAR EXAMPLES of how it was not the case that she wrote. I have been unpacking it once a week in therapy. \n\nDear (x), I found out I was pregnant late January 2020 after we had used protection and I took a Plan-B pill. I told you that I was pregnant immediately when I found out. You instantly freaked out and told me that you did not want to have a child. I asked you why and you said that you had too much going on in your life and listed so many reasons as to why you did not want to have a child. You broke my heart and I felt so rejected by you voicing this objection. After this interaction with my you, I felt extremely alone and did not know what to do. I felt abandoned by you and I felt that I could not rely on you to take care of me and our child. I sunk into a deep depression and anxiety and thought about killing myself multiple times a day. I did not feel like I could take care of a child … I had just been hit by a truck and was still struggling with numerous physical and psychological problems due to the accident. I also had no job, no money, large school debt, and just so many other unstable factors in my life at the time. It was probably one of the most difficult decisions I have ever had to make to terminate the pregnancy and that is something I will always be living with. I had an intentional miscarriage in and I hope to never be in that situation again in my life. I am left feeling hurt, angry, and sad by all of this. \n\nNow my part: Before reading this I must say this, it is long but for the purpose of context. I am a caring person and as you read I hope you will know that I tried to do everything with no malicious intent and just no intent for hurt. Yet she doesn't see this and that kills me because she only sees what she interpreted.\n\nI am 26 and she is 28. \n\nMy ex and I were together for 6 years. \n\nWe almost never fought and honestly barely had any arguments about things, those were usually civil conversations voicing issues or concerns then discussing how we can fix them together or individually.  We met in college, moved in together in secret from her parents for 3 years, then moved apart to our parents(only 15 minutes apart) as we finished college. \n\nNow for what happened:\n\nMy ex has a trauma history from her past 2 relationships. Abuse and lying. Neither relationship lasted more then 6 months. This happened when she moved away for college before she met me. She mentioned it to me, and told me how she can find it difficult to trust at times because of this. I always remembered this and made sure to never do anything sexual when we drank because I didnt want her to feel any negative way regarding that. As well, I consistently tried to build that trust and never hurt that trust until this last year.\n\nShe grew up homeschooled with all of her siblings in a strict household ran by her narcissistic and autistic father. For example, living at home at 28 she still has a curfew otherwise her dad yells at her. She fears her parents and constantly made decisions to make them happy and proud, seeking validation by doing right constantly. An example of this was when she started college it was for a career they suggested. Or she hid us living together for 3 years because her parents believe in marriage first. Her father - he doesnt hold his tongue. One time he threatened to divorce her mom had he not got his way with demanding his daughters boyfriend to leave the house. Being in this environment, she has social anxiety and thus has 0 friends. All the years I was with her she made 3 friends and cut them out within 2-3 hangouts. \n\nMy ex was diagnosed with CPTSD, depression, anxiety, and that was before we met. Those things all but went away or here I thought the first 5 years.\n\nSo no issues for 5 years, 6th year we have things happen. I was planning to get engaged in 2021 on our anniversary because we would have had jobs and such, as well she told me I needed to ask her parents and they wanted me to have a career in place to support their daughter. As well, after college (end of 2019) we both moved back to our parents houses as we searched for our first jobs post college. Covid began, making it hard.\n\nTraumatic Event:\n\nWe are now into the beginning of 2020, we find out that she is unexpectedly pregnant. We used birth control but it had failed. She brings out the test and as I wait I am smiling thinking about everything. When she brings them both out they are both positive I hug her and then I begin to have a panic attack. Let me make an important note here, I have had moments of horrible anxiety which she knew about. For example, my dad had a heart attack and my anxiety caused me to have a panic attack. My panic in this moment of the pregnancy is breathing heavy, heart racing, face likely looking panicked, and EXTREMELY intrusive thoughts. I normally have intrusive thoughts as my primary anxiety symptom. \n\nThese thoughts began to come out, as I explained to her this: \"I am so grateful and happy for this. But I am worried though because neither of us have jobs, we are living at our parents and you dont want to live with me because of your parents, as well your parents are going to be mad at me since this has happened before marriage as you said before how much they value that.\" \"I dont know if I am ready to be a father because of all these circumstances.\" \"I will be a first year teacher and that will mean I need to work a bunch outside of school to plan lessons and such and I dont want all of the responsibilities to be on you.\" \"I just dont feel ready.\" \"I grew up poor and I dont want you to ever deal with that.\" \"I dont know if I am ready to be a father because of all of these circumstances.\" My panic turned into a trance where I thought and voiced \"I just dont know or feel ready to be a father.\" \n\nShe begins to cry, and tells me this is suppose to be a happy moment. I tell her I agree 100%, and I am happy, but we are going to need to figure things out so that we stay happy. I dont want her and I to struggle financially in any way, I grew up poor and thats why I have always pushed myself. Its what motivates me. She agrees but still seems really sad, and she goes home then after this. Texting me how sad she felt because that was suppose to be a happy moment for a couple to experience but my panic attack and anxiety made her feel worried. (As I said nothing I was saying was false during my panic attack, it was all real issues we were facing right then. We didnt have jobs, we didnt live together, we were not engaged, and she was recovering from an accident she was involved in.) She told me she felt worried, and I just told her we need to figure everything out and it will be okay. I also would preface I was saying \"i dont know if I am ready to be a father because.... then listing reasons above (no job, not married, not living together, first year teacher would mean she would need to step up a bunch since I would be doing a lot of work outside of work to plan). \n\nI see her about a week later and she begins telling me we need to go to her therapist. I ask why and she says we need to make a big decision. Continuing I ask whats that. She said we have 3 options, keep our baby, give our baby up for adoption, or abortion. I tell her okay and we go to her therapist. During this session she breaks down crying because she is worried about everything, she speaks for atleast half of the session about her parents and why she is worried they will disown her, and why she is worried about their opinion about premarital sex and a baby out of marriage. We leave with the therapist telling us to come back in a week with pros and cons for each option. \n\nNow, another week later, not as emotionally charged from the news of an unexpected pregnancy, I wrote her a letter explaining my panic, apologizing for the hurt she felt directly from my panic, and how I was not worried about me specifically but rather worried about how I was going to take care of her and our baby. \"My intrusive thoughts came out as I am not ready, but really I meant I dont know how I will figure everything out such as finding work, getting engaged and marrying you so your parents are not mad at you and I, and I just dont want you and I to struggle like my parents did.\" As well with this letter I give my pros and cons to each option but preface with saying that whatever I say does not matter because I cannot make the decision and further, I will support whatever she decides. We give our pros and cons for each and hers are mostly focused on her parents and the lack of financial security and her being on recovery from the accident. She NEVER mentions before the abortion about my own panic and not being able to rely on me. I understand and we talk about the options in therapy.\n\nShe tells me about pain, and so we go to the emergency room as she is worried about an eptopic pregnancy. I am in the room holding her hand and when they tell her its not, I feel relief and I am happy everything is fine. Yet she doesn't seem to see this. \n\nAfter seeing her cry and worry, I spent the next month until the abortion looking for work 8 hours a day. She didnt see this because she and I lived seperately. I would tell her I am looking, but I just assume now she felt hurt and didnt believe me and my effort since all she already took from everything was that I didnt want to have a child with her, which honestly swear to god was not the case at all. Yet it was covid layoffs happening and so I couldnt find squat especially as a teacher and so I was looking elsewhere for whatever I could find.  Anyways, a week later I bring my pros, my cons, as does she. I preface the talk with saying I want to keep our baby, I have been looking for work, and I dont want her parents to be a reason why we choose something like this. Then I also say I will continue to step up.\n\nAnother week and at this point we are going together to ALL of the doctors appointments. She talks to me and asks me what do I want to do? I tell her she seems pretty set on abortion based on our talk in therapy, that I WANT to keep our baby, but I also see the pros if we go with abortion we can get careers and set up our lives and not struggle financially then plan to have children, but if not, then I still want children in our future with her. She tells me she is leaning on abortion, and I tell her I will have to support this decision. I tell her it kills me to be leaning towards abortion because I have wanted to have a family with her and be married to her for so long now. But finances have held me back and thus why now that we graduated I look forward to the next few years in that we can make money, get married, and have kids. It kills me to this day we went with an abortion. I tell her that I believe abortion is our best option given our circumstances but to be clear I still want a family with her in the future when we are more financially ready (both having jobs).\n\nFinally she and I go to a doctors appointment and the whole time I am nervous because the night before I was highly debating buying an engagement ring and proposing to her. Yet, I was arguing with myself because I didnt want her to feel like I was doing this only because of the situation. During this appointment I was in my head and distant as I contemplated it. Afterwards, she mentioned how my actions were pretty clear in this appointment that I was against having our baby. I told her I was only distant because I have something on my mind I cannot share with her, because mentally I still hadnt decided. She didn't believe me. I couldnt pull the trigger because like I said I didnt want her to resent me thinking that I was only doing it for this reason.\n\nA week later she scheduled the abortion and told me that she decided to go forward with the abortion. \n\nThe day comes and I drive her there, outside I tell her we can leave and that we do not need to go in. She trudged in, and seemed very distant, understandably why. We go into the room and I am asking all of these questions out of concern for her during this. And then we wait, I told her we could leave, but she said no. \n\nIt happens and then I bring her home and do my best to make everything both comfortable and enjoyable by making her favorite dinner, and watching her favorite movie etc.\n\nWe do not talk about it and do not have sex for 2 months. I told her I am not going to pressure any of that and when she is ready we can go slow into whatever she wants to do. We are having good sex again, but she is very worried about anything getting into her. Almost like having a PTSD episode after sex, I tend to calm her down each time and I understand her anxiety. I continue to tell her if she doesn't want to we dont have to until she feels comfortable. So we begin to see her therapist again, still we both are looking for jobs. \n\nFast forward to the break up (NONE OF THIS WAS SAID BEFORE THE BREAKUP): she tells me that I was unsupportive, and that my actions were shit. She said if I cared I would have proposed to her, I would have found a job, and that my panic attack showed her that I didnt care about her. This hurt because all of this was wrong. I tried telling her but she just kept saying she cant trust nor rely on me any longer. She said that I was not the man she thought and that I broke her heart into a thousand pieces. She said that my actions showed her and this just killed me because I tried... I truly did. But she had these expectations that seemed like she wanted me to have a job, propose, and make sure we keep the baby all within a month before the abortion because \"if i did that I would have shown I cared\". Further she took my panic attack that was worrying about realistic things and even more so focused on how I would provide her with stability and happiness and said that when I panicked it showed her that none of this was right. She said \"when a baby is announced it is suppose to be an amazing moment for a couple, but you ruined it and made me feel rejected and made me panic. Had you not panicked I likely would never have considered the abortion.\". As I detailed above I was as supportive as I could have been and she just lived by these expectations and when they were not met, she blamed me despite my efforts. \"Your efforts were shit. You could have done it if you really cared and you know that. But you just choose to blame it on your anxiety.\" \n\nThis ^ has been the most traumatic thing in my life. Abortion and then for her to blame me during the breakup 8 months afterwards. But not once talk about those feelings before.\n\n6 months later after the abortion... \n\nWell by this time, I was pretty depressed by the abortion and now my lack of finding work. On top of all of that, with her working so much, I only got to see her max 9 hours a week. I associate that to both her busy work schedule and her withdrawing from me. But during this time, I would mention getting married in our future and having a family when we are ready and simply telling her I still wanted that. I maybe brought it up once a month and she would cry and tell me she is not ready right now for those and that in the future she might be. I would tell her, I fully understand and that I only bring it up to assure her I still wanted that with her. \n\nWell for 3 months we handle this, and juggling little time spent together on her end, I had a bunch of free time because I was still looking for work. I would ask her to go out and do things (hikes, walks, water activities, movies, etc.) And she would tell me how she is busy and cannot until the weekend. Before all of this her and I would go on walks almost 4/7 days if not more with her dog for like an hour. I was becoming needy because I would ask her to include me in those things. I would sometimes cry and ask her if she wanted to see me, and she would respond that she sees me already as much as she wanted to in a week (9 hours). \n\nShe had me over for a family bbq and mind that at this time I had not been over to her house in almost 9 months. When I use to come over for many hours every week and help out her mom and spend time with my ex and her family. When I was there I was nervous. I stayed outside in the backyard with her siblings. When they wanted to go into eat, I denied the food because I didnt feel welcomed by her father and thus I didnt want to eat the food out of fear of him saying something. Well they grab food and come back out. My ex however does not. 3 minutes later I get a text telling me to leave and meet her near her house because her dad just yelled at her when they were alone in the kitchen. I slipped out and we take a walk and she is hurt, her dad told her that if she didnt get me off their property he was going to divorce her mom because of her. This hurt me deeply that he would say that. I texted her mom telling her thank you for inviting me and that her husband told my ex those things. \n\nNow to the most current thing:\n\n\nWe argue about her not giving me any time to see her (1 day a week and only for a couple hours) then she says that we need to have space and a seperation. 1 month but we are still together she clarifies and that were not dating other people.\n\n2 weeks pass, and she texts me she cannot do it anymore. She calls me and tells me she wants to break up. I beg and plead, and she tells me she doesnt trust anything I say, she feels heart broken, she feels I hurt her, and that my actions have showed her this. She tells me she has given me many chances and that she keeps getting hurt. I try to defend myself by saying I understand but I have never made the same repeated mistakes of hurting her. She says nonetheless that they happened and unintentional or not, she is done being hurt. This hurts me because I truly never did do the same mistakes over and over again. She ends the call by telling me I love you.\n\nA week later we meet in person to talk about the break up. We talk for 3 hours. During this talk, she tells me many things that floor me/kick my brain mentally but I simply just take it because I didnt want the possible last moment to be negative. I didnt argue at all but listened and apologized.\n\nShe tells me that she has had so much clarity the last 3 weeks. She said that she realized first that I broke her trust and that really hurt, but then being she was in such a vulnerable place from this moment with the accident that when she had to decide about our baby, that I WAS THE REASON she chose to have the abortion. She goes on to say that my actions showed her I didnt want to have our baby with her, that my actions of having a panic attack and being distant were clear to her (despite me never once thinking I didnt want to have our baby with her). She broke down telling me this and I simply told her repeatedly I am sorry you believe that but that was not the case and it seems what I tell you, you do not believe. She said my actions were clear. \"Had you not reacted the way you did, I likely would not have chosen to get an abortion.\" She said. So she essentially blamed me for our abortion, and the accident.\n\nThen she goes on to say our relationship became so toxic the last year that she now needs to find herself and heal. That she needs major space and time and that maybe in the future we could be together. Then she said she may need years of space from me to have a clean slate from what I did to her. She said she loves me, that I am an amazing person and I will have a great life. She will always care about me and is grateful for the amazing times we spent together. But she said she needs to do what is right for her. \n\nShe removed myself, my friends, and all of my family members from social media. Removed all of our photos and posts. Did not block, but asked me not to contact her. Which I have respected for months now. Then months after she blocked me. She said I can keep the animals and all of our belongings in storage from when we lived together. She has 0 friends as I believe I mentioned before because she has trouble both connecting and trusting them. But her one sibling that I am still friends with has posts on her wall that my ex posted and tagged her in so I can see them. They are about essentially \"Someone who loves you wouldnt do this, or someone who loves you shows you in their actions\" and other stuff seemingly out of resentment towards me. \n\nSince our breakup I have felt deep deep remorse, for our abortion, and the blame she put onto me BECAUSE of my anxiety. I blame myself deeply for having a panic attack and having anxiety. As well, grief, from her leaving me and outright projecting so much of her pain she never mentioned previously onto me.\n\nI have been doing better each day, working 3 jobs now, planning trips, and my future. Been on depression medication that helps also my anxiety for months since our breakup and seeing 2 therapists weekly. \n\nI am struggling deeply with all her blame. I feel like I was supportive and she told me I was not as much as I could have been. Meaning I didnt meet her expectations and ultimately she concluded by that, that I was just downright NOT supportive at all. Which like I said I feel is so untrue.\n\nI tried to communicate but it just feels like now she only listened to what she wanted to hear and only saw the actions she wanted to see, which unfortunately are the ones that hurt her. I told her I never intended any hurt, pain, rejection, or trust breaking. I realize intent or not she was hurt, and would ask how she could forgive me. Unfortunately she wouldn't forgive me and left me with chances, like \"I have given you more chances then I should and I just continue to get hurt.\" To which I just felt like it was a losing battle since I never once repeated my mistakes once they were brought to my attention I tried diligently to never do them again. Panic attack - therapeutic options explored, taking the test and arguing about my family - cut off my family members, struggling with depression and not seeing her but 1 day a week and having times of negativity and crying during that day - when mentioned I got onto depression medication and started therapy and even asked her to go to therapy together. She kept score of her hurts and would not forgive me despite not repeating mistakes.\n\nI honestly feel like since breaking up, she considers me her reason for her trauma. She blamed me a bunch during the breakup. It kills me because I am a very caring person and even just knowing this has made me contemplate suicide because it kills me to think that she feels that I did any of this to hurt her or cause her trauma.\n\nWhat is your take on my story with my ex? \n\nTLDR: My ex and I had no issues, then it all fell apart after her abortion and blaming me because she felt rejected, like she couldn't trust or rely on me, and blamed me for my anxiety attack. She blames me for being unsupportive and says I was not there for her when she needed me, yet I feel I was but just not up to her expectations.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n6fxnt/she_wrote_me_8_months_later/", "title": "She wrote me... 8 months later", "social_network": "reddit", "user": "EcstaticBunny", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1620330709, "permalink": "/r/DecidingToBeBetter/comments/n6fxnt/she_wrote_me_8_months_later/", "nsfw": false, "first_save": 1635438348.377653, "replies_charged": false}