{"id": "t5_2tand_t3_p0y38g", "request": ["2170e8f5-f784-48b1-a4db-f3b547d87da6", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "Something I realized today is that I'm glad my undergrad has been what it is. It's totally different than what I expected of myself in high school. High school I was much simpler. Wasn't happy with myself but I didn't think things would change, just thought school would just get harder. Though among the more complicated life that began during my undergrad is actually a lot to appreciate. I appreciate my suffering, even if I caused it myself. I appreciate the good that intersected with myself and created suffering. I appreciate myself, for recognizing I am the cause of my suffering. I made some goals in Month \\~7 and I cannot believe I actually completed them. Today mark's new challenges for me though, and I'm not quite sure If i'll make it. I've been on a journey, It was a hard journey. Though without suffering we're spoiled. And of the journey, there's pride in progress, and knowing there's more journey, there's excitement for progress to be made. Which is the optimistic perspective. Before, it was a battle of Mental Health, Heartbreak, Confidence, Self-image, and career goals. I've accomplished the career goal concurrently with improving my mental health to a point where I can say I'm no longer depressed, I'm very happy with myself. I've grown into the character, with the confidence & attitude I need to socially and romantically succeed at the bar I want. Now it's a journey of physical health, and the next tier of ambition in my career. I spent this summer participating in a prestigious internship, in a beautiful city, where I made great friends and had some nice flings. A summer high school me would have considered a fictional pipe dream. Though since I got my first shot in May, my Heart has become extremely worry-some. Progress in answers from my medical engagement has been astonishingly slow and non-productive.  I'm holding off on a second dose before I get some confidence it isn't Myocarditis. I engaged medically too late was a problem. I'm surprised I still have these issues but they're really worry-some. Though while tackling them, I gotta tackle snowballing internships and graduate recruitment. I hope I survive, and I really hope I'm just being dramatic. But if I don't, I'm happy to have seen myself grow, and to know that I can conjure growth in myself. I know that, thats just would have happened with me and my story. Growth.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p0y38g/month_36_of_52_of_my_undergrad/", "title": "Month 36 of 52 of my Undergrad", "social_network": "reddit", "user": "reflectionzxc1547", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1628501524, "permalink": "/r/DecidingToBeBetter/comments/p0y38g/month_36_of_52_of_my_undergrad/", "nsfw": false, "first_save": 1635435391.3615725, "replies_charged": false}