{"id": "t5_2tand_t3_dmr9zc", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "So I've been told I should seek counseling for a number of things, but I keep hitting this hurdle where I'm not sure I want to because I don't know the progression of it all. \n\nBelow, I'm going to outline my thought process, and explain how I've tried to reason with the question and some of the hypotheses I've developed.\n\nHere are the issues: I'm unhappy because I don't belong anywhere. I don't have a social life, dating prospects, talent, success. I'm overweight and my face is really unpleasant to look at. Nothing about me stands out in such a way that people would like me. \n\nOkay, so there's all the issues. Going to therapy would work on my thought patterns and processes. Logically, it won't change my face's appearance, but maybe it would help me stay motivated to lose weight. Okay. That's a +1. Social life? I don't see the causal link here. When I think of the reasons people have for liking other people(compatible personalities, charm, good looks, talent, etc.), I'm not sure how making me feel better about myself would fix the objective issue that I'm not a good fit for anyone. A happy guy who doesn't belong or a miserable guy who doesn't belong? I don't see the happy guy as any better off. It kind of looks like this:\n\n1. Start therapy.\n\n2. ????\n\n3. Profit.\n\nSo I struggle to see the steps. Same with dating. I'm not sure how therapy would make me someone's \"type.\" Happy and alone or miserable and alone. Again, the happy guy seems no better off. Likewise for being talented/successful. Being the kind of writer other people want to read is not at all affected by my current feelings. It's all about my talent, and again, whether or not I am compatible with other people's tastes. So really, all the problems that most need fixing hinge on whether or not I can become \"the right fit\" at all. For friendship, dating, and writing, that is the central thing that I am missing, and the one thing i need most. \n\nSo, apologies for the lengthy explanation. It's just me trying to use logic and reason to reach a solution of some kind. Are there pieces of the puzzle that I am missing? Despite the thought I've given it, I feel like there are elements to this that I'm not fully understanding or taking into consideration.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dmr9zc/can_anyone_here_explain_the_stepsprocess_of_how/", "title": "Can anyone here explain the steps/process of how therapy leads to having a truly better life? Not just feeling better or having a different mindset, but actual life improvement?", "social_network": "reddit", "user": "NauticalFork", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1571972306, "permalink": "/r/DecidingToBeBetter/comments/dmr9zc/can_anyone_here_explain_the_stepsprocess_of_how/", "nsfw": false, "first_save": 1635435826.372603, "replies_charged": false}