{"id": "t5_2tand_t3_nzma0o", "request": ["b69cf201-6737-4217-b486-9096135546b8", "e234981c-b061-4d83-8134-70d441847f74"], "text": "Amotivation and procrastination are a reallllllll bitch. I’m not sure when it happened, but I realized that my particular flavors of amotivation and procrastination were seasoned by a particularly spicy “All-or-Nothing” mindset. \n\n**For example:**\n\n* the whole house is in a state of disaster and there is no way I can clean IT ALL, so I won’t clean AT ALL. \n\n* I need to shave my legs while I am in the shower and that will take a long time—time that I would rather spend doing something else—so I won’t shower. \n\n* I don’t have time to cook two veggies and an entree so I will just go to bed instead of eating \n\n* I’m not sure if I have the energy for a 15 min walk so I will watch YouTube. \n\n**This is treacherous because in my illogical perspective the INVERSE of these things is also “true”**\n\n* the house is actually clean except for this one insignificant dish in the sink — meh I will save it for later when I have more dishes to do *this is a trap*\n\n* I don’t want to waste water to just shave my legs so I will do it in the shower *this is a trap*\n\n* I do have energy for a 5 min walk but that won’t be of any benefit so I will just watch YouTube. *this is a trap* \n\n**I have created a world where every conceivable scenario is either impossible to complete or insignificant until it BECOMES impossible to complete**\n\n.\n\n**The truth**\n\n* starting is the hardest part\n\n* once I start, I will likely do more than originally planned because it is kinda fun. There comes momentum with starting a task that CAN be transferred to other tasks. \n\n**Now I start a ONE MINUTE TIMER as soon as I get home and tell myself I will be active FOR ONE MINUTE with no obligation to be active at the end of the timer. Know what? I’m always active after the one minute timer and I have a cleaner house, healthier body, and a more peaceful mind.**", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nzma0o/chipping_away_at_allornothing_mentality/", "title": "Chipping away at “All-or-Nothing” mentality", "social_network": "reddit", "user": "Psycryatrist", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 52, "down_vote": 0, "creation": 1623675720, "permalink": "/r/DecidingToBeBetter/comments/nzma0o/chipping_away_at_allornothing_mentality/", "nsfw": false, "first_save": 1635436460.2224755, "replies_charged": false}