{"id": "t5_2tand_t3_g791xp", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff", "b69cf201-6737-4217-b486-9096135546b8"], "text": "  \n\nHe does not know from where to start, but he will narrate some realities about his life. Originally, his a quite reverent person. He finds many difficulties staying focus on his aims, thus sometimes he derives off the trail.\n\nOccasionally, he feels sad and gloomy and ask himself daily if he is doing the right thing or not. Weight gain became something common that amplifies more his interior blues and sorrows. He tried various workouts like treadmill, calisthenics and even running for hours but no results were proved. Until that day when he saw a TV show talking about French cadet officers drilling in addition to their various and prolific agendas, he immediately gained inspiration and started reflecting about his new plan to begin his weight loss journey. The same evening a dear friend insisted to take him to the gym, the man could not refuse the offer of a dear colleague and accepted to go. That evening the guy trained like a monster according to the instruction of his comrade, then felt a complacent sensation because he never trained alike before. From that day, he never stopped working out as well as following a strict diet.\n\nIn 3 months, he lost around 16 kg which made him extremely happy. He was measuring his body alterations in front of the mirror and he even did a comparison of 2 pictures to show noticeable transformation. Few weeks later, a deadly virus appeared threatening lives all over the world. So, as a precaution all the nearly graduated military groups must stay in their units. The first time he heard about it, he was confused and couldn’t think about something else except leaving in order to join his mother. But in fact, he didn’t know that this confinement was something beneficial for him. Before everything occurred, he was mulling over about isolating himself to seek happiness and lose all the extra weight he gained during his injury, but in a peculiar way god granted his wish and gave him this opportunity to sees his aims.\n\nThe virus is still thriving in a scary way, which means the confinement will perpetuate to an undefined period. He can feel how tired his body became due to the monotonous routine. Two months approximately of similar activities, it’s compared to swimming in the opposite direction of waves that prevents you from moving forward. They say, creating a routine is sometimes useful to feel better and secure but again, in his circumstance this is inadequate. \n\nHis folks started to notice the change and acknowledged his efforts. There were many external motivations from his surroundings but he never put all his faith or reliance completely into that one part. There is another part which is more significant, it is the internal motivation, it demands a great will power to keep it functioning since it’s the only one that never fades. However, people around you are not going to be wherever you go, that is why internal drive override and preserve you on track.\n\nThis week had an incredible precipitation which is considered a bad meteorological condition for others but for him, it is a climate that shed the usual bland mundane. where the grey sky releases his depression in order to free himself from all the overwhelming emotions he gathered during the year. It gives him strength and a potent feeling of going further without turning back. He takes in consideration every detail he encounters and makes it a positive experience or lesson because as Helen Keller says “life is a succession of lessons that you need to experience in order to understand”.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g791xp/military_boy_exceptional_change/", "title": "Military Boy Exceptional Change ...", "social_network": "reddit", "user": "exelone_mehdi", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1587737508, "permalink": "/r/DecidingToBeBetter/comments/g791xp/military_boy_exceptional_change/", "nsfw": false, "first_save": 1635436065.366114, "replies_charged": false}