{"id": "t5_2tand_t3_qbs54k", "request": ["b69cf201-6737-4217-b486-9096135546b8", "feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "Firstly I am a pretty self aware person, I’ve done a lot of therapy over the years which I respond well too but at the moment with the significant increase in demand in mental health services, I’m not able to get into see my therapist or find a new one who may be able to help. \n\nSo I want to learn how to not control every aspect of my life - especially my dating life. \n\nI have realised that my stupid need to control everything in my life has probably been what has ended my last few relationships (long term and short term). \nIn the long term relationships I think it was the controlling of the schedule (we had young kids and were both working full time and every bit of time was accounted for me trying to be everything to everyone which just suffocated our relationship - I no longer need to be anything to anyone, except a mum to my kids and a healthy happy version of myself for myself). \n\nNow as a single mum, Im dating and I cruise along for a few weeks and then my insecurities kick in and I’m like ok what is this? If it’s something let’s do it, but if it’s not, or your unsure then I don’t have time for this… which sounds like a healthy way to look at dating… \nexcept that I’ve realised I have a fearful avoiding attachment style which causes me to be moody and push and pull emotionally both in my own head and my partner/person I’m dating. And this has happened with 2 people I’ve seen potential with but it gets full on and I’ve scared them. \n\nI had some trauma from my childhood/teens which has lead to PTSD. I have done all the work I possibly can to move through that trauma. However I do think that some of the above mentioned is related to some abandonment issues I have. \n\nI want to make it clear than I can be very detached from  my partner and never control them, just have a over bearing need to control my life and if I don’t feel in control I go to pieces. \n\nOther noteworthy things; I’m secure in my life, grateful for the privileged  life I’m creating for my kids and I, don’t desire to get married or have more kids, but would like to find a partner to grow old with. \n\nSo I am deciding to be better and I would love recommendations for books, podcasts or other media/reading that could possibly help me start to let go of control and work on moving to a more “secure attachment t style” while I wait to get into therapy. \n\nTL:DR I would like recommendations for podcasts/books etc to help me move to a more “secure attachment” style from a fearful avoidant, and to learn to chill and not have to control every minute of every day in my life.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qbs54k/i_want_to_learn_how_to_be_more_secure_and_chilled/", "title": "I want to learn how to be more secure and chilled in dating.", "social_network": "reddit", "user": "what-evsy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1634701312, "permalink": "/r/DecidingToBeBetter/comments/qbs54k/i_want_to_learn_how_to_be_more_secure_and_chilled/", "nsfw": false, "first_save": 1635436446.4954076, "replies_charged": false}