{"id": "t5_2tand_t3_peafsx", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "It’s been “the year of like realizing things”, to quote Miss Kylie Jenner. The shift that has had the biggest impact is that I learned about healing a wounded inner child (where most of the trouble I’ve gotten myself into seems to stem from). Anyways, I’m in my early twenties and I’m finally seeing my parents as two well-intentioned, complex, but traumatized human beings. (As a result of their trauma,) I think my mother is a narcissist and my father is depressed and soothes with alcohol. I intend on eventually putting in the effort to forgive them for the harm they unintentionally caused my sister and I growing up....but right now, I’m giving myself the space to grieve. Unfortunately, I’m living at home and find myself constantly triggered. I don’t feel emotionally safe around my biological family members, but I don’t have many friends either. \n\nI’m super concerned about depending too heavily on the few friends I do have, in fear that I will push them away with my...heaviness. I find myself only able to fully and enthusiastically engage in conversations revolving around healing. Not in an “let me emotionally dump on you” way; more like I’m  genuinely curious to understand how other people were raised and how they are dealing with the baggage that may have been passed on to them, or if they even see it that way to begin with. But none of that is super fun stuff or anything suitable for small talk, which is why I’m also hesitant to try to make new friends at the moment.\n\nI know this phase of my life isn’t going to last forever. I have lots of hope. And I am blessed to have access to therapy. But I feel so alone at the moment. How can I meet this need, this need for love and belonging?\n\nThank you for taking the time to read through this and for sharing your experience and/or suggestions. <3", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/peafsx/where_to_find_a_supportive_environment_for_all_of/", "title": "Where to find a supportive environment for all of this...heaviness?", "social_network": "reddit", "user": "abril72", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1630295658, "permalink": "/r/DecidingToBeBetter/comments/peafsx/where_to_find_a_supportive_environment_for_all_of/", "nsfw": false, "first_save": 1635435551.7171812, "replies_charged": false}