{"id": "t5_2tand_t3_ff88n2", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "\nI’ve spent hours trying to come up with words to say and nothing ever seems right. I’ve typed many paragraphs but nothing seems just right. Honestly because what the real truth is I don’t want to let go. I don’t want to give up..one of my fears in life is losing you forever. I’ve always thought you will always play some part in my life. All I’ve ever wanted N was for you to love me the way I love you. I’ve wanted the love I feel for you to be reciprocated.\n\n I remember when we were dating you said to me that you felt bad because you didn’t care as much as I did. You never loved me as much as I loved you. I always knew that deep down but I avoided it because it truly does hurt. Throughout the years I always came up with excuses for you to as why you didn’t want to be in my life. Maybe he needs time. Maybe he’s too busy. Maybe he’s just not ready. Maybe he needs to date other people. Maybe he needs to focus on himself. Maybe it’s just not our time. \n\nI’ve waited for years for you to message me and say I want you. I’ve waited for you to want me to be apart of your life. Not only have I waited but I’ve done crazy stuff just to try and be apart of your life. I’ve drove thousands of miles and spent thousands of dollars just to be in your arms again. Just to be able to touch you. Just to be in the same room as you. When I was with you in Boston you said some stupid things to me. We were walking and you mentioned my laugh “There’s that laugh”. You also said that I should start singing. I’ve never been able to sing my whole life. \n\nYou’ve always made me believe in myself. You’ve always made me feel like I can be anything I want to be. If N thinks I can be a singer then I can be anything right? Before I was with I never saw a future in my life. When we were together I saw such a bright future. Anything that involved you to me was a bright future. As long as I had you by my side. Remember how you promised to take me to Dubai one day? It’s funny all the little things I remember. \n\nI’ve tried to understand you N for a long time. I’ve tried to understand you while you were hurting me over and over. None of it will ever make sense to me because I could never do what you have done to me. It’s okay though. I’ve now started to realize that I can’t make you love me. I can’t make you see my worth. All I can do is let you go. Let go of all the good and the bad. I can’t fight anymore. I have to accept that our story does come to an end. Even though I never wanted it to. I have to do this for myself. I can’t settle for less anymore. I used to be okay with having you in my life for the wrong reasons but I’m not okay with it anymore. The best thing I can do for myself and for you is to let you go. \n\nThis year I realized I don’t want anyone in my life anymore that doesn’t bring me nothing but happiness. Unfortunately you don’t bring me happiness anymore. It’s weird because you made me the happiest I have ever been in life but now you bring me nothing but pain. I truly appreciate everything you’ve ever done for me. I cherish every moment we’ve spent together. I will never not love you because thats just not who I am. I honestly wish you nothing but the best in life. I don’t know what your dreams are anymore but I hope you achieve everything you want and more. I hope you wake up everyday with a smile on your face and go to bed every night with a smile on your face. \n\nI want you to find true happiness. I want someone to light up your world like you once light up mine. I want you to experience that even though it won’t be me. Because you deserve all of that and more. Never let someone shine down on your parade no matter what role they play in your life. Be true to yourself and never stop fighting for what you want in life. Surround yourself with positive, forgiving, caring, and honest people because anyone other than that doesn’t deserve a moment of your time. All I ask for is happiness. That’s my goal in life is to be happy and for the people I love to be happy even if it doesn’t include me. All I have left to say is to just let me go please..So we can both heal and flourish. Asheghetam N.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ff88n2/let_go_n/", "title": "Let Go N.", "social_network": "reddit", "user": "princessmaeha199920", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1583645952, "permalink": "/r/DecidingToBeBetter/comments/ff88n2/let_go_n/", "nsfw": false, "first_save": 1635436552.8996117, "replies_charged": false}