{"id": "t5_2tand_t3_ayjsr2", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "I feel like I want to know how to live the best life I can, but I'm not really sure how. The question keeps gnawing at me.\n\nI see a lot of advice suggesting people to determine their [values](https://www.amazon.com/Subtle-Art-Not-Giving-Counterintuitive/dp/0062457713) and live them out. The advice giver usually then suggests values like \"honesty, creativity, hard work\" or some other vague descriptors as an example. \n\nI once read a book called Triumphs of Experience, where the author measured the subject's lives on a [Decathlon of Flourishing](https://www.artofmanliness.com/articles/love-is-all-you-need-insights-from-the-longest-longitudinal-study-on-men-ever-conducted/) and suggests that supportive relationships allow us to be our best. I get that these are all different approaches people to take when struggling with finding meaning in life.\n\nHow can we know what is best? How can we come up with concrete values and have confidence in their pursuit. Life is only lived in one direction, but it would be nice to know: okay if I aim in this direction, of live with this set of values I'll know I've done well. \n\nMaybe practically, do you lay out everything that life might have to offer (career, family life, friendships, dating, places to live, hobbies, artistic expression, entertainment to consume, and so on..) and think about how you feel about these various pursuits, then commit to some with confidence?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ayjsr2/how_can_i_figure_out_what_to_improve/", "title": "How can I figure out what to improve?", "social_network": "reddit", "user": "Thro_awy88", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1552004323, "permalink": "/r/DecidingToBeBetter/comments/ayjsr2/how_can_i_figure_out_what_to_improve/", "nsfw": false, "first_save": 1635436554.3414464, "replies_charged": false}