{"id": "t5_2tand_t3_padh6n", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "TL;DR: In trying to protect myself, I closed myself off to so many of the “expected” events of youth. I missed out on close, emotionally intimate friendships, parties, other social outings, sporty activities, and a whole lot of laughter and fun.\n\nI have only recently accepted the fact that I have trauma and started trying to unbury the thorns. I was abused as a child and since then I developed a great fear of being touched by others. I have not let myself be touched for about 13 years now, asking people not to hug or touch me. Ever since I started facing my wounds that I had been ignoring, i have felt a very deep, deep regret and loss because of the way I behaved in middle school high school and the beginning of university. I always had plenty of good friends and was never lonely, but was closed off and kept them at a distance. I turned down parties. I never participated in almost anything, like summer camp games or pool parties, because of my fear of getting touched. My friends were very understanding and never insisted, but now I’m so full of regret of all the youthful fun and laughter I missed out on, I wish they had insisted. \n\nIt’s becoming a problem, I can’t stop thinking about the past, wishing with all my heart I could go back and choose differently. Now that I’m readier, I really wish I could be young again and let myself experience everything. It pains me so much that can’t go back. I know I need to let go, and start looking forward instead, but there’s reminders everywhere, especially when I hear about my cousins in high school.\n\nAlso, I feel so guilty for my child self. Before the abuse, before everything, he was free, courageous and unafraid to live life. He loved intense, exciting experiences and I admire him so much. \n\nIm so so sorry i hid you away and closed the door on you, little me. Please forgive me. I wish I could go back. I wish I could have known the person you might have grown up to be if I had let you. \n\nNow, I’m so excited that I’m finally opening up and letting myself know life! it feels like setting sail to a great adventure! I am so ready! But along with all the excitement and expectation there is this gnawing regret, and I don’t know how to let it go.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/padh6n/how_to_get_over_all_of_the_experiences_i_missed/", "title": "How to get over all of the experiences I missed out on in youth?", "social_network": "reddit", "user": "TheQuestToBe", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 31, "down_vote": 0, "creation": 1629768582, "permalink": "/r/DecidingToBeBetter/comments/padh6n/how_to_get_over_all_of_the_experiences_i_missed/", "nsfw": false, "first_save": 1635436802.2535472, "replies_charged": false}