{"id": "t5_2tand_t3_ptuhun", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8", "b51a8628-03a2-4f6d-a371-f9070ccbc2e4", "c6df14ee-195b-4e9d-8032-7cca73d46fe8", "1a213df6-3f71-466c-9762-ace119e0102e", "18281d65-fa68-4991-a4a1-8f37346818f3", "0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "Warning: personal experience. Maybe social media is good for you and that's ok.\n\nNot so long ago I made a post here about my journey to make my life better. Deleting all my social media was a part of it. I notices that it is better not to do things that \"makes you feel good in one moment but then you feel like shit\". Sugar, smoking, fast food. And social media, of course.\n\nWhat have I noticed:\n\n1. 99% of my \"friends\" in Instagram or Facebook don't care about me. They don't even noticed I don't use my social media account for half a year. I left contacts (messenger and phone) to everyone, but only 2 people wished me happy birthday, 1 guy called 3 days later and said if I want to have a walk. Also 3 people, who don't even remember about me for years, asked me for a favor. I said no.\n2. I realised I don't want to see any posts on social media. Seriously, I don't care. You had a journey to islands, got a car, made a painting, eat healthy. It is not interesting for me. It is your life, it's not a part of my life, I am not a part of your life. Damn, I don't really care what my real friends post on social media. Instead I'll welcome them to my appartment, we'll have some tea, share stories, they'll show me some pictures. Maybe we'll have a trip to the nature. You know, real communication, not this \"phone-sex\" friendship.\n3. Attention span. Damn, it was a real problem for me. Now I can concentrate for more than 20 seconds. Once again I enjoy reading, just like when I was 10 reading \"Treasure Island\" or \"Harry Potter\" after school.\n4. I become more confident and happy. I read many arcticles about links that depression and low self-esteem has with social media. I think it is true. Not so many \"likes\"? Feels bad. Now approval of 350 people has no influence on me. It is only me now to compare.\n5. Before quitting social media there was always something to feel sad about. Oh, this guy is 5 years younger and he is more succesful. That person with whom I went to school is traveling around Europe, having very interesting journeys. This guy has perfect relationships. Everyone is better than me, live more happy life. Why I was using social media for years if it felt so bad? I don't know.\n6. FOMO. Now it is just 4 letters, not an anxiety that I miss something, sitting at home.\n7. And right now a realisation that hits like a nail in my head. **It was not even fun**. I was wasting my time for years on thing, that doesn't gave me fun or joy. Something a little-bit exciting, but not fullfilling. Like a spoon of sugar instead of healthy dinner when I was hungry.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ptuhun/150_days_without_social_media_7_things_i_noticed/", "title": "150 days without social media. 7 things I noticed.", "social_network": "reddit", "user": "Silversiberia", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2199, "down_vote": 0, "creation": 1632401382, "permalink": "/r/DecidingToBeBetter/comments/ptuhun/150_days_without_social_media_7_things_i_noticed/", "nsfw": false, "first_save": 1635436497.4387445, "replies_charged": false}