{"id": "t5_2tand_t3_pjd1mf", "request": ["b6268088-7e96-402f-b095-10310f65dbaa", "c6df14ee-195b-4e9d-8032-7cca73d46fe8"], "text": "So I'll prefaxe this by fully owning up to the fact that I haven't been as high functioning of a person as I should be for quite a while now. It started off as fear and depression, then gradually over time turned into a rediscence to really push myself to do anything even remotely \"difficult\", then eventually became a complete cycle of laziness and being a near- complete shut in, and the notion of soing much of anything and moving my \\*ss or being out in pu lic or interacting with people or even really using my mind or self control to do anythign more difficult than wallowing around in despair, literally feels impossible for me.  So in this state, I've become completely negligent and sometimes just let things I'm technically \"supposed\" to do just slide.  Like for ex- I randomly lost my license \\*again something I never would normally do, and have been meaning to replace it, but it's like I just am in the habit of not taking charge, like putting the mental effort into getting much of anythign done- it's like my mind just instantly rebels and I end up unconsciously screwing myself over because I don't even get to the part where I recognize that I need to perhaps put it on my calendar to go to the fricking DMV... basically anything I really don't want to do, I notice I have developed this llreally frightening tendency where my mind just instantly turns off further processing/awareness of what else I need ot do in order to take care of whatever headache inducing, undesirable, yet necessary mundane task like this that I have to do, and so then I forget about it, and it never gets done until someone else finds out (usually when it's either too late or almost about to be,) and in an embarrassing way ends up saving my ass. Embarrassing, becuase it's humiliiating to point out this kind of incomptetence to anyone, let alone my parents, who are  the most recent people to have found out about my most recent blunder of this sort, that bieng this ridiculous license issue.  I mean I don't know how I could get so F\\*cking lazy in thefirst place to where now it's like rather than always trying to stay on top of things like a normal functional human being as I used to, now my tendency is to give so little of a f\\*\\*\\*\\* that sometimes I don't even like respond to things that would normally create panic and then cause someone to rise to action to prevent things from getting completely out of control.  I mean how do I even fix this when it's just like how my mind has automatically started to operate? How the hell do I snap out of this and start being a fully thinking, normal human again? Can anyone even faintly relate to this or am I the only loser whose ever eperienced this?  And having people scrutinize me thesse days, only makes it worse usually rather than motivating me to stop because I guess on some level its become learned helplessness and so if someone criticizes me, (again mainly parents) for underperforming or fucking up, rather than feeling healthy shame like I used to and using it as a catalyst to STOP being a lazy fuckup and correct the behavior, it's like I think I can't change it anyway, and then get extremely angry at them because it just feels like a personal attack, and in general I just hate being treated like some sort of an idiot.  I need help.\n\nEDIT/UPDATE:   I don't know if everyone who has responded is going to necessarily see this, (though I do hope so,) but I just wanted to say a very large, and emphatic THANK YOU  to all of the people who have taken the time to read this and respond with such thoughtful, kind, and helpful responses. I'm frankly overwhelmed to the point of near tears at the unexpected tremendous outpouring of the kindness and support, and people sharing their own stories. This honestly started off as a post simply to rant and vent that I honestly never even expected anyone to necessarily take the time to respond to it, let alone relate to it on such a deep level, so this has not only been extemely cathartic and helpful for me personally, but I'm also glad to see that it evidently has served to open up a wider conversation that so, so many can evidently relate to, far more than I even realized. I just wanted to say thank you again, your advice and thoughts and shared experiences have been  taken to heart and are very much appreciated, and I can't express how touched I am by again by all of the surprisingly primarily positive responses and encouragement this has received, (even to those of you who couldn't stand my lack of paragraph breaks x,D, I'll try to be more weary of that in the future, this had just been a true off the cuff and spur of the moment cathartic rant so... hopefully y'all can understand xD).  Anyhow, you guys are fabulous and God bless each one of you. :)\n\n&#x200B;", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pjd1mf/how_to_fix_extreme_laziness_brought_on_from/", "title": "How to fix extreme laziness brought on from sedantary lifestyle to get back to being a normal high achieving person?", "social_network": "reddit", "user": "Practical_Falcon905", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 675, "down_vote": 0, "creation": 1630978057, "permalink": "/r/DecidingToBeBetter/comments/pjd1mf/how_to_fix_extreme_laziness_brought_on_from/", "nsfw": false, "first_save": 1635435543.4701197, "replies_charged": false}