{"id": "t5_2tand_t3_mk1uox", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "I have days where I can wake up early, prepare and eat 3 decent meals, absolutely blow through all my work, and even find some time to spend on hobbies/ socialisation/ exercise. However, these days are becoming increasingly rare and it's worrying me. \n\nI have days where I don't know why, but I just can't sit down and work. Its not even like I don't like studying, I just can't work. I can lock my phone away, but I will just sit at my desk and stare at a wall for an hour. I'll listen to a lecture (they're pre-recorded, thanks COVID), but then I have to listen again because nothing registers. It will take me 2 hours to eat breakfast, and I probably won't eat/ eat a minimal amount of food because I just can't find the will to feed myself. This results in my uni work piling up and me getting more and more anxious, exacerbating the problem. \n\nI don't understand why I can function so well some days and be so demotivated on other days. I feel like I'm failing, especially since other students in my degree seem to be able to have what I consider a \"good day\" every day. \n\nI try to take care of myself as much as possible- I don't eat junk, I try to get outside, and I try to sleep at least 7 hours. I've even started seeing a university psychologist to try and sort out any mental issues that may be holding me back. But as I said, this becomes impossible on a \"bad day\". \n\nIf you have any experience or advice, please help me. I'm lost as to what is the next step in trying to fix this problem.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mk1uox/how_do_i_maintain_my_energy_for_working_more/", "title": "How do I maintain my energy for working more consistently?", "social_network": "reddit", "user": "Lithrops", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1617560960, "permalink": "/r/DecidingToBeBetter/comments/mk1uox/how_do_i_maintain_my_energy_for_working_more/", "nsfw": false, "first_save": 1635438003.050497, "replies_charged": false}