{"id": "t5_2tand_t3_nxirao", "request": ["b6268088-7e96-402f-b095-10310f65dbaa"], "text": "Maybe someone can give me some advice or feedback. I’ve decided to do better and be better but how ?\n\nI wish I could take my own advice so bad. So many of us do. I’m an addict of 41 years of age. On and off for the last 20 years. From Heroin to Ritalin. At this moment I’m taking Kratom and a diazepam everyday. To some people that’s not recovery, but without trying to justify or make an excuse ( on ssi for anxiety and depression) and the Kratom some how makes me not want opioids. ( people say it’s an opioid) maybe it is, but it’s not going to kill me.  Anyway my two vices. I’m very proud of myself for how far I have come. I’ve been inspired by so many people and things I have red in r/recovery ( other ones too don’t want to mention, there’s some strict rules on some pages about promoting others and I’m just saying Reddit as a whole is a life saver. \n\nWith my recovery I don’t know what to do.  I need to work out and exercise, eat right, fix up my hygiene and keep it consistent, but how do I make a to do list. \nSimple question I get it………..\n\nI am just so overwhelmed now. I can’t say how clean I am from the adderall, heroin, opioids etc. I have slipped in the last 3 month and took the way over prescribed stimulant or nootropic Modafinal. ( I see a huge potential problem with that’s future and abuse ) \n\nHow do I make a to do list? I can’t work or drive right now. I get a check once a month. After my divorce I’m so blessed to say I moved back with my Mom. Better then being homeless I have no shame when it comes to this. \n\nI am on Netflix and Xbox way too much. Well basically that’s all I do. That and I come on Reddit, twitch, messenger the “normals now” \n\nI do have social anxiety really bad. I mean right now the thought of hanging out with someone I haven’t seen in like 3 years sounds horrifying. Later tonight though or on other days it doesn’t. I just can’t get my priorities straight and I think maybe one person will be able to relate with me and possibly give me some feedback. It’s like I’m in recovery, but not living a sober life. \nI want to be a contributing member of society. I want to get back into school. I’m really finding out who I am now. I was always SOMETHING, but now I’m figuring out how to be somebody. \n\nSo many past mistakes I’m still dealing with. Any help ? ( please )", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nxirao/please_help_me_help_myself_to_do_better_feedback/", "title": "Please help me help myself to do better. ( feedback )", "social_network": "reddit", "user": "Zombiefood40", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1623425561, "permalink": "/r/DecidingToBeBetter/comments/nxirao/please_help_me_help_myself_to_do_better_feedback/", "nsfw": false, "first_save": 1635435555.3078778, "replies_charged": false}