{"id": "t5_2tand_t3_ew1hv1", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": " (tl:dr at bottom but I suggest reading it all)\n\nUntil very recently, I believed I was a night owl.\n\nNaturally, I thought this because I'm typically groggy in the mornings, don't feel like doing anything, and would typically prefer more sleep to anything else in the morning. Put simply, I just hated mornings, there was really nothing to look forward to.\n\nThis is a mindset that I have been trapped in ever since middle school, all the way through high school and into college. Until college, the school system naturally required me to wake up early in the morning. This, only to begin loading information in my brain that I really had no interest in. Reading books that are so out of touch with modern society, that morals are hardly applicable or of use at all. Learning different equations and finding dreaded derivatives that I knew would never serve me. Or doing busy work science projects that tended to be more boring than fun.\n\nAfter having school the whole morning and into the afternoon the first thing I'd look to do when getting home is relaxing. This, either by hanging out with friends, playing video games (which led to addiction), watching Netflix and other shows, etc. Before I knew it, it was night time and 0 homework had been done. So I would stay up late doing homework, then sleep late, and the cycle would repeat.\n\nNow transitioning into starting my business, I would naturally schedule all of my tasks toward the end of the day because school had led me to believe I was a night owl, and that it's when I performed best.\n\nBut one day I just decided to sleep in early to give waking up early (5AM) a try. With the help of this awesome app named Alarmy and coffee alternative called Mud/Wtr waking up was a breeze. This ended up being one of the most productive days I've had in a while. I felt more alert, focused, efficient, and creative in general. This had set the tone for the rest of my day, no task was left unchecked. I felt as though I had more time in the day to work with, although I was awake for roughly the same amount of time this day. I actually enjoyed the morning, and performed better than I typically do at night.\n\nSchool had given me this belief that I'm a night owl, but it was simply because I didn't enjoy what I did every morning, and what was to come. When in actuality, mornings are my most productive time and their actually quite pleasant when doing something you really want to do. Since that day I've been waking up early every morning, and I love it :)\n\nTL:DR - If you're a night owl it may be because you are trapped in a mindset school or work has given you. Reset your sleep schedule (pull an all-nighter or do whatever you must to try get to sleep at a good time to get sufficient sleep for your goal wakeup time), and make sure you focus on a passion project or learn about your favorite topics or a new skill you're interested in, you may find it's your most productive time like I did.\n\nThanks For Reading", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ew1hv1/from_night_owl_early_bird/", "title": "From Night Owl 🦉 ----> Early Bird 🐦", "social_network": "reddit", "user": "TomFosh", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1580368038, "permalink": "/r/DecidingToBeBetter/comments/ew1hv1/from_night_owl_early_bird/", "nsfw": false, "first_save": 1635437698.2779238, "replies_charged": false}