{"id": "t5_2tand_t3_h08d0a", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Sorry for the long read, I've tried to highlight the main problems in italics. Thank you in advance for any advice you may have for me.\n\nSo I have some issues and I can't get help right now due to the pandemic. I visited the free psych in my college (it's a medical college and we can consult any doctors free of cost) but it wasn't really a pleasant experience as my parents are part of the problem and they wanted my parents to be part of therapy too which they didn't support. Anyway, it's all been much more stressful these days with my dad and grandfather having COVID and me having to act like the head of the family since my mother couldn't handle it. I'll visit a psych once the pandemic settles but that could be another two months here. But I'll definitely visit one whenever I can. I can't do it online because my family is with me 24*7 and I can't do it without them noticing. \n\n\n1. *Lack of privacy* I live in a three roomed house with six people (parents, grandparents and younger sister) which means I rarely have any privacy. I sometimes feel like I need a break from family because they can be so overwhelming and non understanding but I can't really do that enough. I try to stay in my room at those times but it isn't always possible. Like I can't even cry in peace in my room because anybody can come in at any time.\n\n\n2. *Relationship with father* I have always been really close to my father, but ever since I've joined College and been on my own and basically become more of my own person, I've noticed how he's somewhat of a narcissist, he constantly uses cuss words (he thinks that's normal to shout at his family and use such words and pass derogatory comments), he won't listen to logic and will say hurtful things which he knows will hurt me the most. I felt distressed so tried to detach myself but living in the same house and being financially dependent makes that hard.\n\n\n3. *Relationship with mother* She's one of the people I'm closer to at home but she is sort of complicit in this. She is a typical indian mother and has learnt since her childhood that she's supposed to take care of the household and she does that in addition to her job but she's constantly dissatisfied with life and my father's behaviour as well but doesn't take a stand and just tells me how my father loves all of us and isn't a bad person on the inside. This has caused some resentment from my part but we have a positive relationship overall. But she panics a lot and has a negative outlook on life.\n\n\n4. *Anxiety/emotional issues* I feel really worried about the smallest of things, like if I have offended somebody over something small or if a friend hasn't talked to me in a bit or takes too long to reply, I worry that it's because of something I've done wrong. I keep feeling like the people I'm close to will leave me because I'm not good enough for them and I genuinely feel like a burden at times. This makes me feel anxious and I often cry at seemingly small issues because I make them to be really big in my own head. It also makes me clingy and over-attached to the people I do end up being close to. I even cry while arguing and that just ends up making me unable to argue. Feeling bad and self pitying and crying is something I really struggle with. I seek external validation and approval.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/h08d0a/need_some_advice_to_be_a_better_person_with/", "title": "Need some advice to be a better person with prevailing conditions", "social_network": "reddit", "user": "uncomfortably_-numb", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1591785703, "permalink": "/r/DecidingToBeBetter/comments/h08d0a/need_some_advice_to_be_a_better_person_with/", "nsfw": false, "first_save": 1635437692.2371848, "replies_charged": false}