{"id": "t5_2tand_t3_no06o6", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1", "eb0f138c-ffda-471e-89d2-94e4c266eeb8", "86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "I just wanted to share my story. \n\nMy family was pretty twisted. Anything less than perfection was failure, and even when I did score 100% for tests, that was just considered normal. No encouragement or affection. I had red marks on my skin that lasted for days because my dad hit me with his own hands. I couldn't bring myself to socialise with other children because my parents tried to instil competition in every stupid thing. I was kicked outside at night during winter, and they didn't let me in until midnight. I wasn't even wearing a coat or anything to keep me warm. They yelled at me for speaking and they hit me harder when I cried. I cried alone so much as a child.\n\nMy best subject used to be maths, and it eventually became my worst subject. My parents and teachers berated my failure. I was convinced that I was just stupid and intellectually inferior, so I gave up. Looking at numbers or equations still gives me a sense of dread or failure. My attitude worsened, and no one cared. They focused on my younger siblings, and I couldn't find a reason to continue living. I wanted to talk to people and make friends, but I was an expert at making the mood awkward because I didn't know what to say. I'd overthink everything, try too hard and be rejected. I looked stoic on the outside, but I cried over every single rejection at night.\n\nI know I sound like a wimp and all, but I can't stand the dark or cold. It makes me feel terribly anxious and alone. It reminds me of my childhood which wasn't really that great. I trembled when people (especially teachers) raised their voices at me, and I couldn't bring myself to trust others. I was possessive of my belongings and I either liked it or hated it. No middle ground. Long story short, I was pretty messed up and I couldn't bring myself to ask anyone for help because no one wanted me.\n\nI'm studying to become an English teacher now. Next to parents, I'd say friends and teachers are the next most important influences. If my teachers encouraged me, or just at least asked me why I was behaving the way I did, I think I could've been happier. I wanted just one adult in my life to hug me and tell me that I did well. It's amazing to see how much one person can change your life. Compared to before, I'm more optimistic and talkative. Teachers can either be your worst enemies or best supporters depending on the situation. \n\nI know that there's people who went through worse, or are hurting badly, and not everyone can express it well. So don't judge anyone, and treat them with warmth even if they act like jerks. Condemn their actions, but don't turn your back on them. Turns out my dad was also abused as a child, and he went through a lot of pain. We've patched up our relationship and I can finally say that I have a father. I wouldn't have made it this far without occasional acts of kindness and joy given to me by the few people who stayed beside me. \n\nIt's a long post, haha.. sorry.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/no06o6/its_possible_for_people_to_change_if_you_show/", "title": "It's possible for people to change if you show them kindness", "social_network": "reddit", "user": "7thFall", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 34, "down_vote": 0, "creation": 1622336038, "permalink": "/r/DecidingToBeBetter/comments/no06o6/its_possible_for_people_to_change_if_you_show/", "nsfw": false, "first_save": 1635437311.488215, "replies_charged": false}