{"id": "t5_2tand_t3_mk7gku", "request": ["883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Sorry for the wall of text and context. \n\nSo I have OCD and my biggest theme is my relationship. I keep having this fear of us breaking up or maybe we're not right for each other, etc.  I know this is all OCD and not something I should really be concerning myself with but i did realize something about myself throughout the past few months.\n\n I used to be in a mindset of wanting everything and wanting to be liked by everybody. Part of this ended up manifesting as me completely keeping people seperate in my life. My school, family, job, and relationship were completely seperate and I loved it. I was able to keep up whatever facade I needed so that they would all like me and trust me. I hated the rare instance when different aspects of my life interacted because I was scared they would say something that would contradict and everything would fall apart. \n\nA few months back I had some sort of epiphany or event. I honestly can't describe it and do it justice but basically every bad deed, every transgression just came rushing to me all at once. Where I once thought I was a genius I was now literally sickened. I realized just how bad I was. I was an evil manipulative, terrible person and i wanted to change.  I wanted to be better. I told my fiance everything i thought and remembered and i was so sure he would break up with me. He ended up not, and we've been together ever since. \n\nI love him and want to continue our life together. But I noticed that I still keep \"pocketing\" him. Trying to keep him separate from friends and family. He's met my family on multiple occasions, and most of my friends as well. I still invite him to things but I get this weird sick nervous feeling seeing him interact. How do I get over this?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mk7gku/how_to_stop_pocketing_my_partner/", "title": "How to stop pocketing my partner?", "social_network": "reddit", "user": "Pablosimonbolivar", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1617578629, "permalink": "/r/DecidingToBeBetter/comments/mk7gku/how_to_stop_pocketing_my_partner/", "nsfw": false, "first_save": 1635437995.3154361, "replies_charged": false}