{"id": "t5_2tand_t3_dcxfu4", "request": ["a7c86f93-c54a-48d9-ab5d-279eb28f4463", "536226a2-908e-4c12-ae92-c03734007707"], "text": "The article I just read— “27 Low-Key Plants Perfect for Your Office”, or something like that, has me lusting after a ZZ Plant and mayyybe another cactus or two! (I have six already, so I probably don’t need more, but they’re SO cute!) And who doesn’t love doting on something to help it grow? \n\nOkay, maybe some of us don’t like it. Some of us are even bad at it. (Me!) Hence my low-key plant search 😂😂😂. I’ve killed like four orchids, even after having an orchid expert re-pot a gorgeous lavender one for me in the hopes that it would flourish. \n\nIt didn’t. \n\nFinally, I realized that I don’t have the right light source for orchids— Fun fact: they LOVE direct, eastern light, and all I have is indirect northern and southern. So… no orchids for me.\n\nSerious whomp whomp. \n\nBut all of this plant contemplation got me to thinking about working with what we’ve got. I’ve got the capacity to help a plant live its best life, but I have to work with my north/south light situation.\n\nAnd we’ve all got the capacity to help ourselves shift our mindsets and grow our inner confidence, but sometimes we have to work within our boundaries and personalities. \n\nEmma Watson was not born to be the same kind of confident as Rupaul or Amy Schumer. But she certainly IS confident. \n\nYou were not born to be the same kind of confident as everyone else. But you certainly CAN be confident. \n\nSometimes you have to work with what you’ve got— and not let comparisons hold us back from trying entirely. \n\nThere is SO a way for you to grow courageous and confident, sweet friend! It’s true. You just need a little guidance on how to make your northern and southern light work for you 😘\n\nI crafted a quiz that helps you to follow a path to confidence for yourself. And I created it for a few reasons:\n\n*>\\*>\\*>\\*>* Because quizzes are fun. They just are! There’s probably a scientific study somewhere on why we humans love quizzes so much, and it probably talks about how we love gaining insights about our big beautiful brains.\n\n*>\\*>\\*>\\*>* It gives you some of those beautiful brain insights about bringing your confidence A-game in a way that’s authentic to YOU.\n\n*>\\*>\\*>\\*>* Science and research are important to me as an educator, and I’ve studied enough about good ole psychologist Carl Jung and his theories on personas and archetypes to know that there is some good theory in there (even if it’s not given as much ra-ra-PR as Freud’s theories). \n\n&#x200B;\n\nSo while quizzes are just fun, there’s some REAL insights to be discovered and uncovered here. Because bottom line, babe, you are SO ready to be courageously, unapologetically Confident! You ARE! I promise. \n\nAnd you can be, as long as you’re not trying to grow orchids where the cacti belong. Love yourself, own your heart, and know that there are strategies that are perfect for maximizing YOUR brand of confidence. \n\nAnd I’ve streamlined them for you! \n\nYou not only get a quiz that tells you your ideal confidence style, you also get a free little 10-page workbook filled with:\n\n*>\\*>\\*>\\*>* Love letters and pep talks from me to YOU!\n\n*>\\*>\\*>\\*>* Information about your confidence style\n\n*>\\*>\\*>\\*>* HOW to start applying that confidence style to your mindset\n\n*>\\*>\\*>\\*>* Action steps for getting started\n\n&#x200B;\n\nIt’s perfect for a Saturday morning coffee reflection sesh, or a late-night light-a-candle-for-yourself-and-drink-wine sesh. (If it takes you longer than 30 minutes, you’re probably over-thinking it. Embrace your inner cactus life, babe. Let the comparisons go. Love who you are 💙)\n\nAnd right about now you miiiight be thinking, this is NOT for me. Quizzes are dumb and there’s no way I can be confident anyway.\n\nAnd to you I say: Stop, sweet friend. Stop selling yourself short. You deserve to be confident, and you can claim this for yourself in an act of fabulous self-love.\n\nThere are so many ways to be confident, and being the calmly confident YOU that you were meant to be is possible for you, sweet friend! Whether you find yourself to be a little sweet, or a little bookish or a little goal-oriented, or reallllly into cacti, there is a confident side of you just waiting to grow! Nourish it. \n\nTake the Quiz:  [http://braveheartopenmind.com/confidence-quiz](http://braveheartopenmind.com/confidence-quiz) \n\n&#x200B;\n\nLove, and cheers, and warm cactus vibes from me to you,\n\nKayla Vavra\n\nP.S. When you finish the quiz, tell me what you think of your results!! I read every email I get and I seriously LOVE hearing from you 💙🥰 \n\n*>\\*>\\*>\\*>* [kayla@braveheartopenmind.com](mailto:kayla@braveheartopenmind.com)\n\nP.P.S. Here’s the link to that plant article, if you’re just dying to flex your green thumb at the office!\n\n [https://fairygodboss.com/career-topics/desk-plant](https://fairygodboss.com/career-topics/desk-plant)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/dcxfu4/confidence_advice_a_cactus_metaphor_clearly_a/", "title": "Confidence Advice + A Cactus Metaphor (Clearly a perfect pairing!)", "social_network": "reddit", "user": "KaylaVavra", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 0, "down_vote": 0, "creation": 1570137745, "permalink": "/r/DecidingToBeBetter/comments/dcxfu4/confidence_advice_a_cactus_metaphor_clearly_a/", "nsfw": false, "first_save": 1635436554.7443092, "replies_charged": false}