{"id": "t5_2tand_t3_jhog9w", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "Long story short, I am very hard on myslef.\n\nI work incredibly hard during the week (60+ nonstop hours of labor/work), but when I'm not working, I feel like a failure if I'm not being productive or taking care of my personal life.\n\n**Backstory:** When my ex left me, she said she was tired of being with a man-child and I guess it caused PTSD, because now adays on the weekends, I am incredibly tough on myself if I don't finish what I now write daily as my \"todo lists\". To a degree, she was right though. I used to do nothing on weekends and let my personal \"shoulds\" never get attended to. I.e., I wouldn't schedule dr visits when I should, I'd slack on getting back into college, I wouldn't live up to ideas and goals of what I should be doing and staying motivated in life.\n\nNow it seems after the relationship, I am forever pushing myself and feeling like a failure if I am NOT pushing hard enough. - Does that make sense..?\n\nAs an example, I wrote a weekend todo list and I added about 20 bullet point entries. If I don't end up doing them all, I feel like a failure and I feel like \"relaxing and doing nothing\" is a failure of my weekend. As in, \"I didn't complete what I intended to do.\" and I become hard on myself - and so the cycles goes.\n\nI am now trying to \"schedule\" my hobbies and past times just to feel like I can play a video game as a reward or as my plan/schedule allows (1 hour play Nintendo as an example).\n\nBasically -- Are there books that tackle whatever it is I am feeling? It feels like I am incredibly hard on myself if I am not being productive, and now, it's at a point that if I fail at completing what I want to do, I feel like I am lazy and inadequate.\n\nAny help here is appreciated. I wrote my 20 item to do list for tomorrow and I pray I wake up on time and don't waste my day off <-- That is my mentality I cannot help to feel about myself that  I don't want to have to beat myself up over. This is the feeling I am trying to stop because it feels like Atlas and the world on my shoulders.\n\nAre there any good books I can read on this topic? I tried to Google it but got general \"Self Help\" books. Nothing seems specific to this exact topic", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jhog9w/book_recommendations_for_when_you_are_being_hard/", "title": "Book recommendations for when you are being hard on yourself?", "social_network": "reddit", "user": "InforMedic", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1603605340, "permalink": "/r/DecidingToBeBetter/comments/jhog9w/book_recommendations_for_when_you_are_being_hard/", "nsfw": false, "first_save": 1635436876.4850395, "replies_charged": false}