{"id": "t5_2tand_t3_j4d1wr", "request": ["f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "It's been a wild ride learning how to let go of the first person I truly loved. I'm F19 and I, admittedly, have so much to learn. I was very patient and self-sacrificing for him to the point of self negligence. \n\n\nHe's cheated on me, emotionally hurt me, and lowered my self-esteem. Despite all that, I still stayed for him out of \"love\" until he dumped me a month ago. I became so accustomed to being treated as someone without value and always adjusting myself to curtsy favor from him.\n\n\nLast week, I hit him up to just ask for my money that he owed me. We then began talking and he asked me to take him back. I went back into the rabbit hole of trying please him again as I seriously considered it. But just this afternoon, he and I had a fight, leaving me in tears. And it was then I finally realized, \"Fuck this. I don't deserve this. He doesn't deserve my love.\" It was like my breaking point.\n\n\nI sent him a final message expressing all my resentment I had for him, telling him all the pain he caused me and how I needed to learn to love myself again. I blocked him from every form of social media. We live in different cities currently, so I have no worries seeing him around.\n\n\nI was a fool for letting myself go through that for nine months. He cheated on me on our second month of dating. I've learned now, and know better. I still feel my longing to care for him, but I'm learning to give my love to people who deserve it - most especially to myself.\n\n\nTo anyone here reading my story, please know what your worth is and always prioritize yourself, whether or not you're in a relationship. Do not tolerate people treating you badly. And that if you're in a relationship where you don't feel loved and prioritized, it's okay to let go.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/j4d1wr/im_finally_letting_go_of_my_toxic_first_boyfriend/", "title": "I'm Finally Letting Go of My Toxic First Boyfriend", "social_network": "reddit", "user": "brendonhealy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 70, "down_vote": 0, "creation": 1601718074, "permalink": "/r/DecidingToBeBetter/comments/j4d1wr/im_finally_letting_go_of_my_toxic_first_boyfriend/", "nsfw": false, "first_save": 1635436510.8106263, "replies_charged": false}