{"id": "t5_2tand_t3_728xvx", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "Kinda nervous atm, just sold two technics 1200 mk2 turntables which represented a lot for me in the last 10 years.\n\nI wanted to be a DJ, or thought I did. I made some decisions to start pursuing it a long time ago, but always felt more obliged to be doing it out of some ego based need for validation as a good dj, rather than out of a pure love for it. Don't get me wrong, I LOVE the music, which is why I pursued DJ'ing in the first place. But it quickly became just another tool for my over stretched, perfectionist mind to lash me over because I just never felt good enough.\n\nAlso, the 'party' scene and lifestyle which is so intertwined with dj'ing (at least for me) became very toxic. I'm not saying that dj'ing has to involve drugs or alcohol, that would be silly. Many amazingly talented dj's are totally sober and that's rad. But for me  I have to take drastic steps to change every aspect of my life, which meant I had to stop hanging out with certain people (party friends) and also had to let go of certain symbols of that lifestyle which could so easily trigger old patterns back in to being. \nI know because that happened several times. I relapsed so many times because I would fall back in to the trap of dreaming about dj'ing at parties and would start a lot of the same behaviors that got me in trouble in the first place. Again, sounds irrational, but addiction and perfectionism aren't exactly irrational, so i had to take extreme measures.\n\nAnyway, I've also been working towards a minimalist lifestyle for about 5 years. I've been progressively getting rid of stuff since I had such unhealthy attachment to my \"stuff\".\n\nI accumulated so much crap because I couldn't pick a few things to spend my free time and money on, so I chased after every hobby or interest. I'm sure there's a way to do that, but for me I just stressed my self out trying to take on too many costly pursuits at once. All that ended up happening was I ended up stressed because I felt like I was failing at multiple things instead of just a few like before.\n\nAnother reason I am getting rid of stuff is because I don't know what I want in life and so I'm shedding anything that represents old wounds or that doesn't bring value to my life now. My goal is to get rid of it if I have no honest intention to use it.\n\nThe turntables were a big thorn in my side for a long time because I knew I should get rid of them but couldn't bring myself to do it, even though I never use them anymore.\n\nThey had to go.\n\nNow I've just got some sports equipemnt (bike, snowboards), clothes, some kitchen stuff, about 150 records, a computer, mattress, some camping/hiking stuff, and a car, and I'm still gonna whittle that collection down too.\n\nI'm scared and a little sad, like I kicked an old friend out, but I think in the long run it's for the best since I have thought about doing this for ages, I need the money, I committed to getting rid of them in order to fund a tattoo I got this summer, and most important of all, I feel deep down that I MUST let go of anything that doesn't add to my life in order to be the version of me that I want to be. I need to make bold moves, even if they're difficult otherwise I'll just remain complacent my whole life and that is a hell I can no longer stomach.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/728xvx/just_sold_my_turntables_major_minimalism/", "title": "Just sold my turntables! Major \"minimalism\" achievement unlocked!!", "social_network": "reddit", "user": "punchitchewy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1506298648, "permalink": "/r/DecidingToBeBetter/comments/728xvx/just_sold_my_turntables_major_minimalism/", "nsfw": false, "first_save": 1635436097.3524988, "replies_charged": false}