{"id": "t5_2tand_t3_pvcdvi", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "f4b140f9-3bde-46aa-962c-0d5a533bbaa8"], "text": "Hi Reddit, \n\nI’m 24F and have been trying to get better at direct communication and boundary-setting with others. It’s not going well, and I’ve realized it’s because I don’t actually value myself enough to advocate for my needs. Have been in therapy for years with limited (but some) growth. \n\nI grew up in a home environment where it was beneficial for me to shelve my own wants and needs in favor of my parent’s. I’ve always viewed myself as a nuisance and as taking up too much space; this self-concept made me a very good child, but it’s totally maladaptive as an adult. \n\nI know the things I need to say and do, the self-talk I need to give myself, but at my core I just can’t seem believe I’m allowed to have wants and needs. As a result, I freeze, panic, and over-compromise constantly to keep the peace with others and make them happy. That approach usually works in the short-term, but I end up feeling frustrated and walked on in the long-term—especially because I know it’s my fault for not speaking up! I’m the only one that can change my life, but how can I truly convince myself that I’m not being selfish?\n\nTL;DR: I want to improve myself, but have difficulty wanting good things for myself/believing I deserve them. Self-sabotage is familiar, but also making me miserable. How to convert self-hate into self-esteem?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pvcdvi/how_to_make_the_leap_from_selfsabotaging_to/", "title": "How to make the leap from self-sabotaging to self-respecting?", "social_network": "reddit", "user": "WaldenPwned", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 22, "down_vote": 0, "creation": 1632593684, "permalink": "/r/DecidingToBeBetter/comments/pvcdvi/how_to_make_the_leap_from_selfsabotaging_to/", "nsfw": false, "first_save": 1635435433.7854414, "replies_charged": false}