{"id": "t5_2tand_t3_jmaxby", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "(Apologies for formatting/not adding a flair I am on mobile, also for the clusterfuck of words I am honestly just tipping words out of my head and onto the internet and hoping they make sense lol)\n\nI joined the sub to get help and tips for improving my social skills and to feel less alone in my struggle with social anxiety, but slowly noticed over time it was filled with incel/\"nice guy\" language and self-defeatist/self pitying attitudes and I was feeling like shit any time I read through it. Nah not here for it mate, all the advice on there sucked anyway lmao so girl bye. \n\nDon't know what I'm trying to say with this, I guess just watch out for the content you consume and how it's affecting your mood, curating what you're seeing even a little can make a huge difference. It was a mistake I made myself for years and i'm over feeling hopeless and the self-perpetuating cycle of feeling shit->consuming shit->wallowing in my own shit.\n\nThis is the only self-improvement sub for me now because it's the only one where I feel hope for the future rather than despair when I scroll through, which is the only way you can truly self-improve and move forward. cos guess what you ain't going anywhere unironically arguing over how to be \"alpha\" and \"social hierarchy\" and rating people by numbers lmao. I like that there's actual constructive and intelligent comments and advice on here. So yeah hopeful content only from now on, the rest of these people can fester in their toxic pity party of despair til they're ready to grow up lol. \n\nThanks for all of your stories, i really love the community on here and feeling that we're actually helping each other. It's been  a godsend during lockdown and as my country enters another semi-lockdown I feel like i'll be on here a lot more.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/jmaxby/unfollowed_the_rsocial_skills_subreddit/", "title": "Unfollowed the r/social skills subreddit", "social_network": "reddit", "user": "skyskater", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 41, "down_vote": 0, "creation": 1604267704, "permalink": "/r/DecidingToBeBetter/comments/jmaxby/unfollowed_the_rsocial_skills_subreddit/", "nsfw": false, "first_save": 1635438223.6155608, "replies_charged": false}