{"id": "t5_2tand_t3_nv6o4g", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "Hello, I am writing this not to look for people to pity me but I genuinely just need advice and people to talk to before I lose my mind. I really want to save my relationship\n\nBackground: \nI am a respected person among my peers and people trust me and I love and cherish meeting people and building relationships. \n\nStory:\n\nMy girlfriend for 2 years (the first and only serious relationship I’ve been in) broke it off last year because of a night that I will always regret until I die. \n\nI cheated on her… but not repetitively just one night with my so called “friends” who ended up leaving me with some girl i hardly knew who had a thing for me and took advantage of how bat shit drunk I was. Definitely not an excuse yes, but I really wish I had a real circle of friends who would have helped me out at a time of weakness.\n\nAnyway so i ended up hooking with that lady while I was fucked out of my mind and when i woke up i regretted it instantly and felt sick to my stomach.\n\nSo I told her the following day I met up with her. She lost it and beat the shit out of me (as she should) I apologized and told her what “happened”. Prior to that i was reading a lot of articles about what i should do online, one said\n\n “if its your first time and it will never happen again, take it to your grave”. \n\nI am not that type of person the point that i told her right away somewhat backs up that I really am not that type of person and i regretted ever last piece of it. But when I confessed I saw how hurt she was and I was so scared of losing her that i took in the advice and bended the truth… just so we could move on and fix our situation.\n\nFast forward to today, I thought my progress was going well, I was honest, transparent, there for her, loving and caring for her and i cut off my “friends”. But the half truth i told her lingered inside me and it ate me up still. And just recently i found out the definition of “Trickle Truth”. \n\nSo yesterday i finally came clean and told her everything. And lets just say its not going good. She still hasnt kicked me out nor told anyone close to her but, she is so disgusted with the sight of me, and hurt again. Telling me be prepared because its 50/50 this time around… Im scared and I feel so stupid.\n\nHow can i fix this? I really want to work for this even harder than the first time we broke up. I love her so much and I have shown that i really am wanting to be better… i just fell short by not being completely honest the first time around. And theres no one to blame but me…", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nv6o4g/desperate_really_need_advice_and_someone_to_talk/", "title": "Desperate, really need advice and someone to talk to.", "social_network": "reddit", "user": "jefbeentrill", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1623166494, "permalink": "/r/DecidingToBeBetter/comments/nv6o4g/desperate_really_need_advice_and_someone_to_talk/", "nsfw": false, "first_save": 1635435159.9661937, "replies_charged": false}