{"id": "t5_2tand_t3_mzo1je", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40", "b69cf201-6737-4217-b486-9096135546b8", "0da85390-0cd4-4819-ba1c-07c5e448265a", "0d7e25ab-b0e9-4c71-b798-0a512354dd36", "f136a0fe-70bb-422f-8a7d-5b2519e7773e"], "text": "For probably a combination of issues, I just don't feel like furthering my own well-being.\nI have no big sense of where I will be or where I want to be. The future is a blob I don't want to think of, existence, but especially success, feels like a chore, and not like a beneficial one. \n\nI don't know how to help or solve my thinking, and I feel like a lot of advice people give ignores one or more factors, most often just \"uwu accept yourself, here's a flannel for you with vagina pins and rainbows on it!\". \nIt doesn't seem to have any good effect, and it feels very alone watching Contrapoints \"Shame\" on repeat, trying to extract knowledge that while it doesn't feel like it applies to me, well, at least she admits it isn't always \"pride\". \n\nJust started a new college, first time on meds, and it was all going good. \nHaggled myself some benefits for while I'm still studying, got psychiatric help, started school and quit the jobs that were killing me physically and mentally. \n\nI have a new girlfriend who's trans just like me. We're doing ok, and love each other a lot. Both fine with whereever the other ends up, binary or not. Been together a few months now and meet in the summer, hopefully after she gets a jab.\n\nI have both parents, another one that I haven't seen in half a year or so that is a little bit more dysfunctional, wife and dad are struggling, she has self-denial/sadness/anxiety bouts about her queerness. I had to distance myself somewhat. \nThe other side is great tho, high achieving, the man is friendly and in the same industry as I study, good kids (his), they're a ball of happiness and dog makes me so happy to be with. Mum literally has my back in so many things.\n\nWith school, everyone around me is so good to me. They have been understanding, given endless second chances, and though understanding of the ADHD stuff is sometimes lacking in our country, the human sides are all right where they need to be with school, I feel like.\n\nLiterally, things are the best they have ever been for me. I do value all of these things that are there or that I've built (the job before the last one, the new education, managing my finances etc).\n\nI feel fucking deflated. \n\nI don't feel a reason or pull towards furthering my own interests. I don't care about most things that I used to care about. \nI also don't want to be seen as some \"independanttt dont-need-no-man womah\" as it reminds me of the very radical people and feels very wrong to me. This depresses me because I know those \"feminist actions\" are all anyone will ever see in any accomplishment of mine.\nI can't imagine a future and I can't cope with the schoolwork anymore cause I just let EVERYTHING pass by for the last few months. My school and career especially.\n\nI told my psychiatrist about not feeling comfortable in my skin, and whether it could have sexuality/gender undertones, but the only guy who has a gender monopoly in our country basically said \"fuck yall\" to the social ministry and resigned and now nothing has been decided yet. Even if he was still there, he is very conservative and I don't think he would say anything but \"I don't have time for this!\".\n\nI suspect the future of living \"as a lesbian\" scares me and makes me feel off. That's one of those things. It deleted any vision of the future and it's just completely demotivating. I never wanted children besides adoption maybe waayy later in life, and I love all the facts about my gf as who she is, nothing bothers me or its not like I'm not attracted.\n\nIt's just... The future. Which is a big gray blur and something I am extremely efficient at not thinking about. I don't know how to get my will to live and do back, or an egotistic myth/story/vision of myself to work towards. That's all that ever worked for me.\n\nI also banked on having to halfway compete with a man, mitigate the issues of straight dating... A lot of the things I did was to be equal and comparable to one, and to be able to attract a cute and this is weird but... a femme one.\nThe fear of being the female underclass of society (me being AFAB), escaping from possible teen pregnancy or assault or abuse, making sure of my safety and living in a dignified way and happily motivated some of my biggest efforts with school and work. It was GOOD to do human shit because it... Humanized me and helped me be seen as equal?\n \nGradually that vision, those fears and efforts eroded (even before my gf) and I just forgot it like many of my other ADHD hyperfixations. There's no fear anymore. No one to compare to. (idc if she's more successful or that she's bigger than me.. Like good on her? Good on us?). \n\nShe says she can't support a full other person or anything, and she does not want a pillow princess slug with no ambition, so what I am currently living is high key unsustainable. \n\nI'm into my fem sides a lot more and makeup and cosmetics provide a temporary feeling of progress. I don't want to be seen as butch, rebellious, I don't want to be DEsexualized or infantilized, I don't care for radfem things, especially as many of the people with those ideologies would hurt my person. \n\nBut I have put a plug on the spendings, realized that it does not help solve the underlying problem, and the space left over is empty and braindead for now. There could be a lot of joy in it for a healthy person, but rn it doesn't help, it's a distraction. \n\nI feel like every step towards independence or something success-y is one in the wrong direction. I still value nice things and a good life financially and security. But I just don't feel like doing anything for it, and I sometimes get a flashy thought that it would make me something I don't want to be, or closer to that. \nAnd I used to - it was through coping mechanisms, but I was working towards something tirelessly. \n\nMy own childhood pics used to motivate me and call me out on shitty behavior a lot. They don't do that anymore. It's like \"yea it's a kid what of it\". I don't dream about being exceptional, and I don't see any way to be curious, interested, authentic. I miss that. I know it's not really the meds, because I felt that during the first 4 months a lot. \n\nAnother thing I've thought about is that suddenly there is no novelty or \"aha, but. Unpredictable.\" identity anymore, and I fall into stereotypes, and yea maybe that's cringe, but finding the edge of orginality in who I am helped get at least something done. \n\nWhat's more formulaic than a wlw who is a success hag that \"needs no man\", like, gross. Not gross because of types of people, I guess I just find stereotypes gross. They're boring. Tedious. They remind me of death and decay. I can't live without being subversive, surprising and alive - at least to myself, I don't need to subject others to the \"cringe\" if you find it so or anything. But I'm just no longer interesting to myself. \n\nI just see \"meh some girl\" in the mirror and her boring  ass self is of no pleasure to me. She's partly boring cause she's AFAB, I'll admit that. That's what's going on in my brain, so why hide it? \n\nTL:DR; Everything good, me feeling like an useless slug. LGBT stuff? Feminism (in radical forms especially) is suddenly a little bit... distasteful? School and success is not appetizing (it really used to be). Boring boring boring boredom and cliches.\nIf anyone has experience, please help!\n*It's gotten really bad and I'm failing everything, stressed but unable to do anything.*", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mzo1je/nothing_to_improve_for_dont_feel_like_furthering/", "title": "Nothing to improve for, don't feel like furthering my own interests anymore at all. What to do?", "social_network": "reddit", "user": "anongynies", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1619528798, "permalink": "/r/DecidingToBeBetter/comments/mzo1je/nothing_to_improve_for_dont_feel_like_furthering/", "nsfw": false, "first_save": 1635435451.8703372, "replies_charged": false}