{"id": "t5_2tand_t3_mcb2rf", "request": ["86d5962a-1e68-4adb-a875-32e3eedd428d"], "text": "My employer, as part of a weekly newsletter, asked folks to submit how a year of telework has affected us.  I submitted this:  \n \n\n\"I maneuvered through this pandemic with the virtual support of friends and family. Yet, I shelter alone with a dog who doesn’t listen well. I am accountable only to myself, and since I am not a fan of myself, I let things fall apart around me. I faced depression, I let my health deteriorate, and I struggled to be the person I was before I  closed my front door. All the while, I grew frustrated because I saw a  world where people were losing loved ones, people rising up against causes, and people gaining voices that they hadn’t had before. I felt my problems were selfish and petty, yet I couldn’t work through them.\n\nWhat  I do realize is that hope is subtle. You take the trash out that was sitting in your kitchen for a couple of days, and your life is a little better. You do three loads of laundry. You clear brush from your yard.\n\nOne year and two days after I was told to shut out the world, I am scheduled to drive-thru Dodger Stadium’s parking lot and get the first needle in my arm. I believe that this little effort will give me that boost of hope to stop thinking my problems are petty and start making the changes I want to make. Making the changes, I GET to make.\"  \n\n\nI received optimistic messages who were facing the same challenges.  In one exchange, I replied:  \nThank you,  You made me feel so good, I think I will take out the trash.\n\nShe replied:  \nAnd I will brush my hair.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mcb2rf/taking_out_the_trash_and_the_subtly_of_hope/", "title": "Taking Out the Trash, and the Subtly of Hope", "social_network": "reddit", "user": "bearfeedmitch", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1616605982, "permalink": "/r/DecidingToBeBetter/comments/mcb2rf/taking_out_the_trash_and_the_subtly_of_hope/", "nsfw": false, "first_save": 1635437593.7238734, "replies_charged": false}