{"id": "t5_2tand_t3_iywty8", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Hey y'all, I saw a post here about a month ago with a similar premise and I wanted to express my thoughts for my decision.\n\nSo, I've decided to delete Reddit from my phone. Not my overall account on Reddit, just the app. Here are the reasons why.\n\n1. This is the most crucial year of school for me. Studying is a priority, and Reddit has been a huge distraction. While I have other social media, I have a soft spot for this app and end up wasting so much time endlessly scrolling, a habit I don't notice on Instagram or Facebook or Twitter. I do it before studying, during my study breaks, after studying, at bus stops, before going to sleep, when I wake up in the morning. Its not meaningful anymore, and refraining from it I think will be a change for the better.  I will now be able to access Reddit only from my pc, for specific reasons, not from my phone.\n\n2. My interest for this app has slowly depleted. I usually browse Reddit for memes, but other hobbies as well. I'm subscribed to various subreddits but very few give me interesting content anymore. Maybe it's because I've spent a great deal of time on it or the overall quality of posting has diminished, I don't know. I intent to unsub from many soon.\n\nThis is not a goodbye. I will still be using Reddit, just in a more controlled and healthy manner that benefits me.\n\nThank you for listening and I hope you're heading towards a better self.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/iywty8/ive_decided_to_delete_the_reddit_app_from_my_phone/", "title": "I've decided to delete the reddit app from my phone", "social_network": "reddit", "user": "Derschka", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 65, "down_vote": 0, "creation": 1600952529, "permalink": "/r/DecidingToBeBetter/comments/iywty8/ive_decided_to_delete_the_reddit_app_from_my_phone/", "nsfw": false, "first_save": 1635438254.138724, "replies_charged": false}