{"id": "t5_2tand_t3_n4ljjb", "request": ["39752c96-520e-4d3a-a89c-d1ffe47fe6e7", "f29068b1-c751-4543-b3a6-9d58b1182ab7", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "\n\n^CW: ^sexual ^assault \n\nI'm a little hesitant to post this, because it's kind of...*a lot*...but it feels really important that I get this off my chest. \n\nSix years ago, I lost everything; I lost who I was, lost the life I had built, lost the dreams I'd had for my future, and lost the energy to keep on fighting. I was struggling with PTSD and chronic pain, fell into a severe depression and then developed an addiction to opiates, which only made everything so much worse. I eventually managed to get clean, but by then the damage was done, and nothing really changed. I still couldn't claw my way back out. I think that may have been one of the most devastating parts in all of this -- trying so goddamn hard to get clean, to clear that hurdle, then feeling the initial surge of hope when I finally did it, only to realize as I reached the other side that there were still countless hurdles stretching out in front of me. I didn't have the energy to keep trying after that. \n\nI gave up. \n\nFor a long, long time, I've just been standing in place, miserably hopeless; I've spent *years* going nowhere and doing nothing.\n\nBut something seems to have shifted over the last couple months. I don't really know why, but I feel different. I've been trying to get better. It's like I've finally started moving again; I can actually imagine some version of my future in which my life isn't like this anymore, which is something I haven't been able to do in *years,* and it's like that tiny little flicker of hope has given me just enough energy to try to push myself forward, inch by inch.\n\nI haven't felt like this in such a long, long time. It was almost six years ago that my life completely fell apart, and I've been trapped in this constant downward spiral ever since. It started back in the summer of 2015, when I was sexually assaulted while working overseas. I was injured during the assault; my attacker slammed my head into a brick wall, tearing my occipital nerve and ultimately leaving me with a traumatic brain injury. \n\nThat was all it took; everything unraveled after that. It happened so quickly, but it *completely* destroyed my life. I was left with chronic  pain from the injury, and the pain that I developed that night has never really gone away. I still get headaches and frequent whiplash from the nerve damage. The TBI also initially left me with some mild speech, memory, and attention deficits, and while the deficits have largely improved over time, they still come and go...and when it first started they were completely overwhelming. \n\nThe pain, the deficits, the memories of my assault, the PTSD...it was more than I could handle. I couldn't sleep because I had panic attacks and nightmares almost every night. And the shame/humiliation that I felt was overwhelming. I wanted to forget, but those awful memories had become like a permanent fixture in my mind. Nothing my doctors did really seemed to help, so out of desperation and hopelessness I began to abuse opiates. I just wanted to feel better and I wanted to stop caring. I wanted to be able to sleep through the night. I wanted to feel good again. And sometimes it worked; but the addiction rapidly destroyed what little I had left. I lost my job, had to drop out of grad school, was quickly buried in debt, and was forced to move back in with my parents. \n\nAt that point, I gave up. I sank into a deep depression, shut myself away from everything, and doubled down on the drug abuse, just trying to find some relief. And so for almost four years, I did nothing. I stayed in bed all day, every day. I barely ate. I slept fitfully. And my room slowly began to decay all around me. At some point, I couldn't even reach my bed anymore because of all the trash, and instead began spending all of my time on the tiny loveseat/couch that I keep in my room, which is so short that my legs hang over the end with the armrest cradling my knees. I haven't slept on a real bed in several years. On top of that, the only functional light in my room stopped working a couple years ago and I haven't had the motivation to fix it, and I eventually nailed a blanket over my window because I couldn't stand seeing the mess that surrounded me...so my room is almost always dark. \n\nI have been laying on a shitty, broken loveseat surrounded by trash in a dark, lonely room for *years.* \n\nThen, two years ago, by some fucking miracle, I got clean. I'm still not sure how, exactly, though I know that switching to kratom (and then carefully weaning myself off of that) certainly helped. I owe that to a random Redditor, actually, who suggested I try using kratom to wean myself off of the opiates; I had initially thanked them for the advice, but told them that I was done trying to get clean, that it would never work. They pushed. They urged me to give it another shot. I eventually relented, thinking that this would be my last attempt at getting clean and then I'd just be done. I'd finally given up. \n\nThis one random person is the reason that I was able to get clean. Because it actually worked. It took me a while to really process the fact that I was finally on the other side of that miserable addiction, and when I finally understood that it was over, the amount of hope that I experienced was overwhelming. I hadn't felt hope in *years* at that point. I had tried to get clean so many times over the years, had gone into violent withdrawals every time; I was hospitalized for severe dehydration after vomiting incessantly for several days in a row during withdrawal, even developed a hiatal hernia because the withdrawal made me throw up so forcefully and so frequently that part of my stomach eventually herniated up into my esophagus (I did *literally* puke my guts up) and it was fuckung agony, so I had consistently failed. I'd completely given up on ever getting better. And then there I was, on the other side of it. \n\nI started daydreaming again, thinking about my future for the first time in years, reveling in the belief that getting clean had been the biggest hurdle standing between me and my future, and that having finally reached the other side, I would be able to finish putting my life back together once and for all. \n\nThe hope quickly faded, though. I gradually realized that I was still in too deep. My life was in absolute ruins and it became increasingly apparent that fixing/rebuilding it would be monumentally more difficult than getting clean had been. I couldn't do it. I sank even lower. I was so disappointed, and my body's broken rewards system (in the absense of the drugs) made it so hard to feel anything but hopelessness and emptiness. I didn't know how to enjoy things anymore. I didn't know how to live my day-to-day life without drugs and I was fucking miserable. \n\nI just wanted to be dead. Suicide wasn't an option -- I've lost loved ones to suicide before, I've seen the absolute devastation it leaves behind, and I refused to put my family through that pain ever again -- but I quietly wished that I was dead every single day. I was done. I stayed clean because I was terrified of having to deal with the absolute agony that is withdrawal ever again...but I gave up on moving forward. \n\nFor two more miserable years, that's how it went. I felt like I was trapped in a nightmare. I was rarely eating, rarely sleeping, doing nothing. I lost about sixty pounds in one year. I would frequently go several days in a row without sleeping and on two separate occasions, after staying awake for four days straight, I began to experience the symptoms of sleep-deprivation psychosis and had to go to the emergency room to be sedated. I felt like a zombie; I couldn't kill myself, but I felt like I was already dead. \n\nBut something curious began to happen a few months ago. \n\nI genuinely don't know why, but I slowly started to feel like I wanted to *try.* Just one more time; just one more push. What have I got to lose? \n\nI started working on little things to keep me busy. I felt like I had more energy. I didn't want to be alone as much, and began spending more time with loved ones. I started trying to eat and sleep again (albeit fitfully). I knew that if I could find ways to distract myself from the pain and the awful memories then maybe I could start to push through it. And for the first time in years, I feel drawn back to my old hobbies again, gradually beginning to do artwork and reading comics like I used to, finding small things to look forward to and things that make me feel productive. I've slowly started making things again, playing with different crafts that I had long abandoned. I used to be an artist; I used to make sci-fi replicas and sculptures and resin crafts, and I wanted to do all of those things again. I wanted to feel like a *person* again. \n\nI have even begun the long, exhausting task of cleaning up my room, and though progress is slow and easily overlooked, I will gladly take tiny fits of progress over none whatsoever. \n\nI haven't felt like this in years. I wish I could explain why this is happening now; but it's like getting clean, sometimes it feels like everything has to align before things start to improve, and it's taken me *so fucking long* to get all of my ducks in a row but I think that things really are getting better. I don't want to get ahead of myself or let myself get too hopeful again, but something is really different this time. I *feel* different. It's like slowly waking up from a years-long fog, like sensing that you're finally coming out of it and just desperately trying to grasp at that sense of clarity. \n\nMaybe this is just how much time it's taken for me to start to come to terms with everything I've lost. Maybe this is what it feels like to finally begin making peace with the fact that I will never be the person that I used to be, can never return to the life I used to have, that those things are gone and I'm different now but that there can still be some future worth living in. I feel like I've spent all of these years just refusing to accept it and desperately trying to claw my way back into my old life, and when that failed, I refused to recognize that my only other option was to move forward instead. I feel like I'm starting to accept it. I'm starting to move forward again. \n\nI've lost six years of my life...but I've seen people survive much worse. There's something else I should mention: \n\nI've seen this happen before. \n\nWhen I was eight years old, I watched as my mother fall apart; she'd lost two of her sisters to suicide (separately) and it destroyed her. Her mental health rapidly deteriorated and she sank into a severe depression. For years, that depression, combined with other mental health issues, absolutely crippled her. It wasn't until nearly a *decade* later that she finally recovered. But for those ten long years, I watched as she locked herself away from the world. I watched as she repeatedly tried to kill herself, watched as she turned to opiates to cope and watched as she developed an addiction. I remember helping to feed, clothe and bathe her whenever things got particularly bad, and because she was schizoaffective, I would often have to calm her down during psychotic episodes. But I convinced myself that if we could just keep her alive long enough, then someday she would get better. I spent my adolescence just trying to keep her alive and waiting for \"someday\" to come along. \n\nAnd then it finally did. She started to recover. She got clean; she got onto the right medications. She started inching her way back into the world. And she got *better.*\n\nAnd she would eventually help me the way that I had helped her.\n\nMany years later, as I struggled through my own withdrawal, my mother was there beside me. She held me up, kept me hydrated, rubbed circles in my back -- all the things I had once done for her, when I was young and she was battling her own demons. And when I was crippled by depression and trauma, she was there for me as I had been for her, calming me down through the panic attacks, listening to me as I cried and rambled, just sitting next to me whenever I was too tired to talk...and reminding me that things would get better, someday. That all I had to do was live though it.\n\nWe've held each other up. And I don't know if it's cruel irony or just a logical progression, the fact that I eventually wound up following in my mother's footsteps like that. \n\nBut here's the thing: I was there when she clawed her way back out of it. Even after ten awful years, I watched her get better.\n\nI know it can be done. She is my proof that things don't have to stay like this. If she can survive ten nightmarish years, then maybe I can survive these last six. \n\nI think my mother taught me something very important all those years ago -- that it's never too late. No matter how much time you've lost, no matter how bad things have gotten, it is *never* too late to put yourself back together again. I want to be whole again, and I think I'm finally ready to try. I'm ready to accept what happened to me. I need to make peace. I'm ready to find a way to move forward again.\n\nAnd I've been thinking for a long time that if I can get through this, I want to go back to being a peer counselor. My dad is a mental health professional/social worker and he encouraged me to go into peer counseling years ago. Obviously I need to get my shit together first, but I've been through an awful lot and I think it would be good to channel my energy into helping people who are dealing with these things. I learned how to help people like my mom a long time ago. I think I was pretty good at it. I want to help people again.\n\nI'm sorry, I know this post is kind of all over the place. I just wanted to share this, because I think this sentiment is important -- it's something many of us need to hear. And I don't want to take this feeling for granted. I really, really hope that this is something that lasts. I'm just so fucking tired of living in the dark all the time, and I think I'm finally ready to claw my way back out now.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n4ljjb/after_drowning_in_depression_ptsd_and_addiction/", "title": "After Drowning in Depression, PTSD, and Addiction for Six Long, Awful Years...I Think I'm Finally Starting to Recover", "social_network": "reddit", "user": "SixteenSeveredHands", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1657, "down_vote": 0, "creation": 1620126080, "permalink": "/r/DecidingToBeBetter/comments/n4ljjb/after_drowning_in_depression_ptsd_and_addiction/", "nsfw": false, "first_save": 1635435781.4198828, "replies_charged": false}