{"id": "t5_2tand_t3_makqfp", "request": ["f29068b1-c751-4543-b3a6-9d58b1182ab7"], "text": "I'm 18 now and it's now been a week since i last smoked weed.My relationship with weed is a hard one, i started smoking weed because i didn't want to be home, (this was before my parents got divorced and there were always fights at home) i didn't have a lot of friends at the time so it made sense to do something while i was running away from home, smoking weed.\n\nEver since i started smoking weed i've been using substances to cope with my life. First it was weed, then alcohol, then ketamine, then 2cb.About a year ago i had a semi-pschychose while on 2cb, everything felt like a dream and it felt like i wasn't in  control of my own actions. When you start using substances at such a young age  you start to wonder if you ever experienced \"real\" life.But quitting is hard because after a certain amount of time you start to make friends who like smoking weed/abusing drugs as much as you do.\n\nI can honestly say that in the past 5 years, this is the first week i've (voluntairly) not smoked weed.               But it brings up a lot of stuff from the past, the kinda stuff why i started smoking in the first place.        It's hard to deal with and i feel a lot of anger, and resentment towards myself. I'm angry that i let it get this far, i'm sad that i've wasted so much time already.\n\nall in all i'm a big ball of emotions and i never used to be like that.most of all i'm proud that i finally took the step to improve myself.\n\nI want to be better, i want to live up to my full potential, but i know i'm always just 1 bad day away from being back where i started.\n\nI'm not religious but this quote always resonated with me on a spirititual level:\n\n\"God, grant me the serenity to accept the things I cannot change,courage to change the things I can,and wisdom to know the difference\"", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/makqfp/ive_been_addicted_to_weed_and_other_substances/", "title": "I've been addicted to weed and other substances since i was 13", "social_network": "reddit", "user": "Ok_Papaya_9524", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1616410646, "permalink": "/r/DecidingToBeBetter/comments/makqfp/ive_been_addicted_to_weed_and_other_substances/", "nsfw": false, "first_save": 1635436994.2703001, "replies_charged": false}