{"id": "t5_2tand_t3_pn5hsw", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "Ever since the end of high school I've been an anxious and generally sad person. I grew up in a strict family and school was the most important thing to my parents. I grew exceptionally afraid of disappointing them, but at the same time I had other interests and hobbies and I wanted a social life. Unfortunately, I was never the smartest student so for me I had to put in so much work just to be average. I ended up neglecting a lot just to do my best in school in fear of those disappointing looks.\n\nWhen college came around, my workload was way more than expected compared to high school. My anxiety worsened. When there were days that felt way to overwhelming, I would attempt to reach out to friends or family about my problems, but I ended up feeling disregarded a lot of the time. \n\nI then decided to just bottle up my feelings and get through school. I kept telling myself that it was okay to keep neglecting myself for the time being because I can just make up for it when I graduate and start working.\n\nNow, a new graduate holding their first full time job, I still feel like shit. I've been in a healthy relationship for over a year now, I've made up for my missed doctor's appointments, I started going to the gym and I reconnected with a really good friend of mine, but I still feel stuck. A major part of it is for sure the pressure I put on myself at work, but it's also like I lost touch with parts of myself that I really liked and can't seem to pull them out again.\n\nI truly want to feel good again and that is why I've finally decided to open up more and start therapy. I'm definitely scared to talk about my feelings to a stranger, especially since my multiple attempts to reach out to those around me failed, but this has been long due.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pn5hsw/finally_decided_to_get_therapy/", "title": "Finally decided to get therapy", "social_network": "reddit", "user": "IonizingBoba", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 7, "down_vote": 0, "creation": 1631496188, "permalink": "/r/DecidingToBeBetter/comments/pn5hsw/finally_decided_to_get_therapy/", "nsfw": false, "first_save": 1635436450.980593, "replies_charged": false}