{"id": "t5_2tand_t3_ik40sh", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7"], "text": "It's been almost a year since I had a major mental breakdown. The months and years leading up to it were agony. Allow me to start from the beginning.\n\nFor as long as I could remember, since my mid teen years (I'm now 26) I'd been miserable. Not for any particular reason. I just thought that's how I was. I was critical, angry and over emotional about almost everything. I had no ambition, no hobbies, no social life. There was always one constant though, someone who meant the world to me and we stuck by each other through our worst.\n\nLast year it peaked some time towards the end of the year. I was at a point where I couldn't go to the supermarket without having a panic attack. My irrational fears of small things manifested into being scared of **everything** I couldn't leave the house without feeling overwhelmed, but being stuck in the house was having a negative effect on me too. I would sleep all day, or just lay in bed in the dark for hours. Not saying or doing anything, because I didn't feel worth it. I felt phantom pains that weren't there, I thought my appendix burst or I was having a heart attack. I also suspected I had cancer or another big illness. This was due to Tomophobia. I thought about suicide **every single day** and it was exhausting. \n\nThis all came to a head when that person left me. We were by each others side almost every day for 7 years. I felt like my favourite person in the world abandoned me when I needed her the most. I don't blame her. I know she tried her best. There's a lot she didn't know about my mental health that I kept to myself, which may seem hard to believe since I shared a lot, regardless, I told her I wouldn't have wanted to be with me either. I understand her reasons, she wanted a different life than the one we shared and I agree with them. I had to learn the hard way that sometimes if you love someone, you have to let them go. \n\nSoon followed my friends, I never asked anyone to choose, but they chose to stand by her and leave too. During the most difficult time in my life I was completely alone, I didn't have a very good relationship with my parents or siblings so I reached out only when necessary. I'll never forget the way my Mother cried when I told her about the absolute disdain I had for my own life or how my Brother showed genuine concern that when their expecting baby was born she wouldn't have an Uncle. It haunts me.\n\nI was grieving a loss that I never anticipated, and it hit me hard, I felt each of the stages of grief, and became holistically aware of the entire thing.\n\n*I read a quote somewhere and it has stuck with me ever since, \"depression has a funny way of turning every emotion into apathy.\" This is extremely accurate. The thing is, although I was unable to express it, I was always excited about going out to events, or away for the weekend or do literally anything that meant spending time with the ones I loved, but depression took that all away from me. Now all I have are bad memories of good times.* \n\nAfter that I shut down and went into hiding, I was forced to look at myself under microscope and the person I was. I removed myself from all social media, stopped talking to anyone that wasn't immediate family or colleagues at work and I started working hard to rebuild my life. I got professional help and received medication alongside CBT, which has been more worth my time than I could ever have expected. My phobias have gone. I moved from the small town I grew up in to the bigger city where I worked anyway, I made new friends and repaired relationships with old ones that I felt like I had wronged in the past. My network has never been bigger and I know that each of them genuinely loves and cares about me. I keep certain people at a distance, but I know that is my way of defending myself in case they decide to leave me too.\n\nWhen everything settled down and during lockdown, I had a long time on my own to think, to pick up the hobbies I used to love, I started playing music again, learning a new instrument and practicing singing, as well as finding some new artists and genres that I love. I found a new love for fashion and customizing clothes. I began reading and creative writing. I started working out and getting into as many positive habits I could. I also made a bucket list and have growing aspirations for my life. I've been able to travel across the UK, seeing a plethora of wonderful sites and enjoying meals out with people who are interested in me. 6 months after originally deleting it I got social media back and decided to share the things I love, I follow similar accounts and now I have an endless feed of positivity, streetwear and bunny pictures.\n\n*I'm still often surprised by other's reactions to me, I compensate from what I know I've been through with over confidence and making jokes but people tell me I'm likable, charming and attractive, it still shocks me because before I have always thought of myself as the opposite. People like me? It feels good.*\n\nSince I've dedicated my time to helping others, I am working closely with charities and am starting my own, which takes a lot longer than I'd have expected. I have had the opportunity to find out what kind of a person I am, not long ago I saw a guy passed out in a sketchy subway. Long story short I sat with him and kept him talking whilst I phoned an ambulance. I am someone who takes action in crisis, I just want to help. This has been a constant in my life, but I never gave myself credit for it.\n\nI found my \"real self\", in which some in the depression communities call it and it isn't the person I was. I didn't think I was a bad person, but I got lost somewhere, and there's a lot that I regret. I'm an intelligent person, I've been commended by someone very close to me on how self aware I am and I'm not above admitting I was wrong. I was apathetic, overly critical and mean. I'm not yet sure whether I was abusive in my relationship. I'm still trying to work through that. There's only so much someone else can take to have to deal with me. I have read that these are symptoms of depression too, but I'm not here to make excuses.\n\nRegardless, I have learned a lot in the last year. People are complicated, as such I treat everyone with kindness and respect, but for those of you who are struggling, you don't have to be a product of your past. I can't change what I did before and I never knew how much development I was capable of, and I am far from the same person I was this time last year. \n\nHow do I summarise all of this in one post? So much has happened. I could honestly type 10x the amount I have here. Don't get me wrong, I still have issues, who doesn't? All I know is that I feel like I'm finally on the right track. I haven't thought about suicide in months and for the first time ever, I enjoy life. I just wanted to share my story. Thanks for listening. Stay safe.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ik40sh/i_26m_am_so_proud_of_myself_1_year_after_a_mental/", "title": "I [26M] am so proud of myself. 1 year after a mental breakdown and I'm enjoying life. [Essay inside]", "social_network": "reddit", "user": "AverageCabbagee", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1598899881, "permalink": "/r/DecidingToBeBetter/comments/ik40sh/i_26m_am_so_proud_of_myself_1_year_after_a_mental/", "nsfw": false, "first_save": 1635435825.181805, "replies_charged": false}