{"id": "t5_2tand_t3_pvivv2", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110", "39752c96-520e-4d3a-a89c-d1ffe47fe6e7"], "text": "I'm currently on a trip across America, I am a J1 student (work and travel program) and basically I came with my friend all the way from Europe, we worked at one town for 3 months and the 4th month is so called Grace period, where you can travel as much as you want, wherever you want as long as you have money for it. I've been to New York, Boston, went on a cruise to Bahamas, now in Miami and people would think \"he is having the time of his life\" but the truth is that I'm not sure if I am. I have this constat feeling of anxiety, my heart rate is jumping all the time, sometimes feel harder to breathe (but just a little bit) and that usually goes away when I start doing something that I need to focus on but then again, I need to rest and when I try to take a nap, suddenly my heart races, heavy breathing again and because of that I have storming thoughts in my head that just won't let go. I have been working 86 hours a week for those first three months and now I'm constantly traveling and going around, on the four day cruise I was partying, slept around 12 hours in 4 days... I know that definitely took a toll on me, but I somehow feel there is something else, how can I have this high heart rate, heavier breathing for this long (it has been 6 days), when I try to figure out if there is a problem in my head I get really tired of thinking and just give up, because it is frustrating that now, on vacation I'm feeling down like this and it is bugging me really bad. I can't remember now when did I have a moment where I just layed down, took a deep breath and had a smile on my face and I feel satisfied with everything. I actually gave it a lot of thought about what could be the area I need to improve, but it is tough to take actions on that because I'm faaar from home, always on the move and need to try to have as much good time as I can. There is a lot to talk about here and I wrote this in the state I explained here so maybe I missed something but I really wanted to say this out loud somewhere, I just wrote a quick summary and this is actually my first time posting something on reddit, I feel like this community is filled with so many wonderful people and am hoping someone can give me some dircetions. Thank you in advance, peace and love to everybody!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pvivv2/i_feel_like_i_cant_calm_my_mind_down/", "title": "I feel like I can't calm my mind down", "social_network": "reddit", "user": "malimonkey", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1632615754, "permalink": "/r/DecidingToBeBetter/comments/pvivv2/i_feel_like_i_cant_calm_my_mind_down/", "nsfw": false, "first_save": 1635435074.7488801, "replies_charged": false}