{"id": "t5_2tand_t3_4e37fu", "request": ["05842298-75b9-449e-b597-63b6ca7ef528", "993cdb0a-41e0-4441-9b0f-122e1a942924"], "text": "[**Video Summary For The Happiness Hypothesis**](https://www.youtube.com/watch?v=8ChQyGnfPm4)\n\n\nThe Happiness Hypothesis takes into account both leading scientific research on human behavior and happiness, as well as the philosophies of the stoics and Buddhists to determine how we can be happy. In this summary we will cover ways to increase our happiness set point, and understanding the truth about why goals increase our happiness.  \n\n\n\nThe book attributes happiness to both inner control, as practiced by the Stoics, as well as external forces, which many marketers misconstrue to be using material objects to buy status. \n\n\n\n**The Happiness Hypothesis formula can be effectively seen as H = S + C + V**\n\nHappiness equals our happiness set point, plus our living conditions, plus our voluntary activities. \n\n\n**Happiness Set Point**\n\n\nSome people just have a higher level of set happiness automatically then others. This is where the glass half empty or half full analogy can be used. Some people look at life as opportunities to strive and get ahead and overcome, while others look at their life like a set of challenges and set backs that are difficult and annoying and why can’t everything just work out properly for once Jesus Christ! \n\n\nThere are three ways we can change our automatic thought patterns in order to increase our happiness set point: \n\n*Meditation*\n \n*Cognitive Therapy*\n\nAnd *Prozac* \n\n\nMeditation involves sitting down and focusing on your breath for 10 to 20 minutes every day. It helps to focus your attention in a non-analytical way and change automatic tendencies. Where our default thoughts automatically head to negative and fearful directions first, meditation helps them to automatically accept situations and become solution oriented. \n\n\nCognitive Therapy is used to treat anxiety and depression and involves being aware of our thoughts, and consciously finding alternative and accurate ways of thinking, which in turn will change your automatic thoughts.\n\n\nProzac and other selective serotonin reuptake inhibitors have been shown to be as effective as cognitive therapy in changing automatic thoughts of anxiety and dread. The downside is this is not a naturally occurring phenomenon and the benefits only last so long as you remain on the drug. Where as even after finishing cognitive therapy the benefits will remain. \n\n\n**Conditions of Living**\n\n\nAlthough we have set levels of happiness there are outside factors that contribute to our over all stress levels. These are things like a long commute, conflict in your relationships, lack of control in your life, or even making more money. Being poor is stressful and reduces happiness. The threshold to make the biggest change in happiness is $70,000 per year. Once you make enough to cover your living expenses and have enough to spend on good voluntary activities you’ll be as happy as you need to be. \n\n\n\nIf we take most peoples best and worst case scenarios for life, winning the lottery and becoming paralyzed. You may think the first person will have a huge long lasting life of bliss, and the latter is destined to a life of misery. But really after a year they both go back to their default happiness set points. The lottery winner will have a huge burst of happiness up front but as she changes careers, gets a new car and buys a new house, the adaptation principle allows the mind to go back to life as usual pre-lottery win. Where the paralyzed person will have a huge hit to happiness off the bat but as they are in physiotherapy and see they can make little progress every day towards getting better, the mood will increase and with it their happiness set point will return to normal.\n\n\n\n**Voluntary Activity**\n\n*Progress principle*\n\n*The progress principle states that pleasure comes more from making progress towards a goal, then from actually accomplishing your goal.* \n\n\nWe need to have goals, but understand that accomplishing them will only give us a brief increase in happiness. All those fridge magnets were right when they said: “It’s about the journey, not the destination.” The real proven path to happiness is the journey and along the way we need immediate feedback to tell us if we’re going towards or away from our goals.\n\n\nFind healthy activities to do such as building strong relationships in the community or diet and exercise, and pick goals within that space that you can make progress towards every day.\n\n\n**Strong Relationships**\n\n\t\nHaving strong family and community relationships is paramount to being happy. Religious people are often seen as more happy overall then non-religious people. You could say God makes them happier but the likelier situation is that being involved in the church community and having a sense of connection to others is what increases happiness. We need to form strong relationships with lovers, friends, our children, and our family in order to maximize our happiness. \n\n\n**Conclusion**\n\n\nIn order to be happy, we need to have a high happiness set point, which can be increased with meditation, cognitive therapy, or Prozac. We have to have our conditions ideal, which is higher then poverty levels of income and less draining relationships in our life. And our voluntary activities need to be healthy hobbies that can build strong relationships and give us goals to strive after.  \n\n\nThe Happiness Formula is Happiness = happiness Set point + living Conditions + Voluntary activity\n", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/4e37fu/heres_a_few_ways_to_become_a_happier_person_a/", "title": "Here's A Few Ways To Become A Happier Person. A Summary Of The Happiness Hypothesis", "social_network": "reddit", "user": "gmos905", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1460238684, "permalink": "/r/DecidingToBeBetter/comments/4e37fu/heres_a_few_ways_to_become_a_happier_person_a/", "nsfw": false, "first_save": 1635435662.4061713, "replies_charged": false}