{"id": "t5_2tand_t3_mob5hv", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "Hi,\n\nPlease help me unfuck my life.\n\nI'm 28. My parents paid for my college education and are still supporting me financially to this day. They have always been excellent providers. I never went hungry and was given many tools to succeed.  When I lived under their roof, my parents were extremely authoritative and punished anything less than excellence with physical violence, revoking access to technology, and threat of abandonment. I was made to feel terrified of being disowned at an early age and remember flinching when my parents came near me for most of my childhood. I'm also transgender and didn't comprehend this until much later in life. I always felt that I had to overachieve to receive \"love\". Consequently, I developed habits of lying and addiction. \n\nI constantly lie to everyone in my life including close friends, family, and coworkers. The lies I feel most ashamed of are lies that started after graduating college. My parents wanted me to focus on my education so I was never forced to have a real job. After graduating, I was unable (or maybe not willing enough?) to find a job in my field. I was living in an apartment in the same city I studied in and had no intention of going back home to the place where I felt repressed. I lied to my parents about actively looking for a job to continue receiving their financial support and was instead numbing myself with sex and drug addictions. It was around this time that I realized I was transgender. \n\nI got a job that was commission-based as an independent contractor while beginning my transition. Beginning to navigate the world as a trans woman and a professional person at the same time was a lot for me to handle. There were times when I wouldn't work for days or weeks at a time and was instead spending time with people who enabled my addictions.\n\nThis job helped me get to where I am in life but I don't see myself in this career path for much longer. I think because I always knew I could fall back on my parent's support, I didn't have the drive that someone else would have to be consistent in a job they didn't like. This is a deep source of shame for me. I have intentions of switching to a career path I'm more excited about and there is a massive amount of material to cover before I can pull it off. Currently I feel like the trope of the adult who's still living in their parent's basement. \n\nI want to confidently exist in this world as an adult woman. I find myself struggling in almost every aspect of life from maintaining habits, being professional, and nurturing platonic relationships. At a certain point, I don't think I can continue to blame my parents. I'm envious of people who are friends with their family. I feel that I've subconsciously been running away from them my entire life because of the way they raised me. Now, they seem just as disappointed in me as I am in myself. I've severed relationships with people who enabled my addictions and stopped spending money on drugs. I don't know what to do next. I've never done my taxes before. I've hardly made any money compared to how much I've had to accept from my family. I feel like a fraud when I speak to other people my age. I want to pursue my ideal career path but feeling free/independent seems like a greater priority. I have no idea where to start. I want to stop lying to people and feel like I can stand in my truth. I want to be able to send and receive love to more people in my life. What do I do next?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mob5hv/please_help_im_28_a_pathological_liar_and_still/", "title": "Please help. I'm 28, a pathological liar, and still leeching my parents.", "social_network": "reddit", "user": "pleasehelpfixmylife", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1618082432, "permalink": "/r/DecidingToBeBetter/comments/mob5hv/please_help_im_28_a_pathological_liar_and_still/", "nsfw": false, "first_save": 1635437259.5012667, "replies_charged": false}