{"id": "t5_2tand_t3_p687hf", "request": ["6ceab702-5227-4f28-a3a3-a47a0f7f3110"], "text": "Hi, sorry, this be a longer post and sorry in advance for my bad english.\n\nYeah, this will sound like a lot of posts I see around here aka \"I'm already 2x years old and I don't know what to do with my life, I got no passion, etc\". One minor difference is, that I'm already 48 years old with two kids... But most times I don't feel like an adult at all. I always choose the way of least resistance; if there is nobody pushing me, I could waste most of my days playing video games and I'm very easily influenced in most decisions since I often can't decide what I want.\n\nOf course I manage my job (but also doing the bare minimum, which leads to a strong imposter syndrome). I also think that I'm an ok dad, but of course it could be better. So I'm not totally useless in day to day life, but I have a severe lack of self discipline, passion, decisiveness, work ethic which all lead to the feeling, that I never really have grown up. Over the years I read countless self development literature, but almost never acted on it. And in the last years even finishing a book becomes harder and harder. \n\nReading all the other posts from young people in their 20s turning their lives around always makes me wonder if there's still hope. Of course on a logical level I know that you can always change your life. But the longer you wait the harder it gets because the negative thoughts are so engrained in my self-image. If you didn't succeed in any real change in over 40 years it gets harder to even try anymore...", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p687hf/48_years_old_with_2_kids_and_still_not_feeling/", "title": "48 years old with 2 kids and still not feeling like an adult", "social_network": "reddit", "user": "Trying_2b_better", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 34, "down_vote": 0, "creation": 1629220732, "permalink": "/r/DecidingToBeBetter/comments/p687hf/48_years_old_with_2_kids_and_still_not_feeling/", "nsfw": false, "first_save": 1635435083.3530288, "replies_charged": false}