{"id": "t5_2tand_t3_c1wyst", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "What's up guys! I hope this post proves helpful on your journey to becoming your best self. It is my goal to help you Make Life Yours, so we are exploring happiness ... backed by science! Let me know what happiness means to you!\n\n\\---------------------------------------------------------------------------------------------------------------------------------\n\n# “Happiness depends on ourselves.” – Aristotle \n\nWe all have ideas about what happiness is and how to get it. Maybe it’s driving the car with the windows rolled down, stereo up, and singing at the top of your lungs. Maybe happiness is something as simple as a good book or being comfortable to be who you truly are … deep inside. Ask yourself, “what does happiness mean to me?” Happiness depends on you; make life yours!\n\nI strive to be happy with everything I do. For me, this means exercising daily and being with the people I care for. But wouldn’t it be nice to always be driven to a happier self? I would love to be the best I can be, as I’m sure you would too, so I researched the simplest ways to start *now* … backed by science! Let’s take a look:\n\n# 11 Hacks to Happiness\n\n**1) Exercise – 20 Minutes Will Maximize Happiness**\n\nWhat happens with our bodies when we exercise is well-known – we build muscle and stamina over time. But when it comes to our brain, mind, and attitude, it isn’t as clear. \n\nWell, it turns out exercise (even in small amounts) can make you happier!\n\nHere’s How:\n\n1. It releases ‘feel-good’ chemicals in our brain\n2. It reduces stress\n3. It energizes you\n4. It’s a confidence booster\n5. It fights insomnia\n\nThe University of Bristol [published a study](https://www.dailymail.co.uk/news/article-1095783/People-exercise-work-days-happier-suffer-stress-productive.html) which analyzed the moods of participants after exercising. They found on exercise days people’s moods improved greatly after the workout. 79 percent of the participants stated emotional improvements were better, and 74 percent said they could manage their workload better after a workout. \n\nWhat’s best is only 20 minutes of exercise is enough to maximize happiness. In her book, *The First 20 Minutes,* Gretchen Reynolds uncovers you don’t need to train like an Olympian to get the happiest results. A much smaller workout will get you to the peak.\n\n* *“The first 20 minutes of moving around, provide most of the health benefits. You get prolonged life, reduced disease risk – all of those things come in the first 20 minutes of being active.”*\n\nI challenge you to challenge yourself! Get out early tomorrow morning and go for a run! You will be more energize and focused throughout the day, and when it comes time to sleep … well … you’ll turn into a baby.\n\n**2) Spend Time in Nature – It Will Boost Positive Emotions**\n\nFrom camping deep in the woods to spending a day on the water, I never seem to get enough of the great outdoors. Thankfully, now I have an excuse to spend even more time in nature! Not only does it boost happiness, but it has numerous health benefits too.\n\nAccording to the University of East Anglia, the more [time spent in nature reduces the risk](https://www.sciencedaily.com/releases/2018/07/180706102842.htm) of cardiovascular diseases, high blood pressure, and stress. Working with 20 countries, researchers compare people with little access to nature to those who spent large amounts of time outdoors. The team found that spending time outside is linked to great health benefits. \n\n* *“In fact, one of the really interesting things we found is that exposure to ‘greenspace’ significantly reduces people's levels of salivary cortisol – a physiological marker of stress.” – Caoimhe Twohig-Bennett*\n\nIn another study, conducted by Gregory Bratman of Stanford, [participant’s emotional states were assessed](https://www.sciencedirect.com/science/article/pii/S0169204615000286) after taking a walk in a natural or urban setting. Those who walked in nature experienced less anxiety and more positive emotions compared to urban walkers. \n\nThe best thing about this happiness hack is how easy it is! In his book *The Happiness Advantage,* Shawn Anchor recommends spending at least 20 minutes in the fresh air:\n\n* *“Making time to go outside on a nice day also delivers a huge advantage; one study found that spending 20 minutes outside in good weather not only boosted positive mood but broadened thinking and improved working memory...”* \n\nThis is good news for everyone who worries about changing their habits. You can fit this into your busy schedule … no problem! \n\nI challenge you to spend *at least* 20 minutes outside every day, rain or shine. Try being the first one up and going for a morning run. You can even hang a hammock and catch up on some missed reading! Happiness starts with yourself; make time for you.\n\n**3) Eat Healthy – The Proof is in The Vegetables** \n\nOur nutrition isn’t limited to only affecting our bodies. In fact, it’s been proven that a healthy diet boosts our mental health faster than physical health. \n\nIn [a study conducted](https://www.uq.edu.au/news/article/2014/10/fruit-and-veggies-pave-road-happiness) at the University of Queensland, researchers followed 12,000 people for two years. They analyzed whether the participants ate vegetables and fruits, how much they ate, and at what times. Then, the individual’s life satisfaction was assessed. People who ate more fruits and vegetables per day had higher happiness and satisfaction levels than those who didn’t! \n\n* *\"Eating fruit and vegetables apparently boosts our happiness far more quickly than it improves human health.\" – Redzo Mujcic (study co-author)*\n\nWhile this is certainly impressive, what’s even more jaw-dropping is that nutrition has become an effective strategy for overcoming depression! \n\nA [trial conducted](https://this.deakin.edu.au/self-improvement/how-to-eat-your-way-to-happiness) at Deakin College measured the therapeutic impact of eating healthy. Felice Jacka worked with 67 people overcoming depression. Some of them were receiving psychotherapy, others were taking antidepressants, and a handful was using both. After 12 weeks, the people who received nutritional counseling were found to be significantly happier than those given social support throughout the day.\n\n* *“Unprocessed diets higher in plant foods, healthy forms of protein, and fasts are associated with better mental health outcomes. We're increasingly understanding that the gut is really the driver of health, including mental health…” – Felice Jacka*\n\nWhether you need a little help getting out of bed in the morning, or putting a smile on your face, I challenge you to eat better! \n\nYou’re probably asking “[but what *should* I be eating](https://www.reddit.com/r/productivity/comments/bs1y1s/eating_healthy_and_performing_better/)?” I’ve got you covered! Here are my top three favorite foods packed full of nutrients:\n\n1. **Blueberries**\n\n* Need some powerful antioxidants? Blueberries should be first on your list. This fruit is part of the “superfood” group, along with goji berry and raspberry. Blueberries also help to improve memory and brain power; go tackle your day!\n\n2. **Spinach**\n\n* Spinach is loaded with healthy macronutrients. It has been shown these nutrients slow cognitive decline – during the day, and with age. Aiding in clear thinking, this can help you perform quicker and longer … and boost happiness.\n\n3. **Salmon**\n\n* This fish has an awesomely high omega-3 fatty acid content. This is great for improving memory and mental performance. Get to it. Boost your mood, your memory, and up your game!\n\n**4)** **Sleep More – You’ll Be Less Negative**\n\nGetting a good night’s sleep needs to be at the top of your to-do list. We all know that sleep helps our bodies and minds recover from the previous day. But what you might not have known is you’ll be less sensitive to negative emotions!\n\nThink about the last time you woke up on the wrong side of the bed (not literally). You probably felt like a pin dropping would send you into a fury. \n\nFor me, this was last week; not even coffee, eggs, or bacon could cheer me up! The worst part was this affected my work, which then affected my sleep because I stayed up trying to finish everything. This cycle went on for three days before I got back to my rhythm. The good thing is I now know the trick to a positive attitude: get your damn sleep!\n\nIn [the BPS Research Digest](https://digest.bps.org.uk/2011/03/21/an-afternoon-nap-tunes-out-negative-emotions-tunes-in-positive-ones/), they cite a study which outlines how sleep affects your sense of negative emotions. Out of 36 participants, half took a nap in the afternoon after completing a task. Using facial recognition, it was found those who took the nap became less sensitive to negative emotions. It even enhanced their ratings of positive expressions!\n\nIn the book, *NutureShock*, Po Bronson and Ashley Merryman illustrate how sleep can affect your attitude:\n\n* *“Negative stimuli get processed by the amygdala; positive memories get processed by the hippocampus. Sleep deprivation hits the hippocampus harder than the amygdala. The result is that sleep-deprived people fail to recall pleasant memories yet recall gloomy memories just fine.” – Bronson*\n\nThe book goes on to cite a study in which college students were asked to memorize various words. The result? Participants memorized 81% of the words with negative connotations and only 31% of the words with positive connotations. Would you rather be thinking “cancer,” or “sunshine?”\n\nThe lesson here is to make sure you get your ZZZ’s in! Go ahead, use this as an excuse to take an afternoon nap, I know I will.\n\nI challenge you to create a nightly routine. An alarm for when you need to go to bed – not just for when you should get up. Escort electronics out of the room … hey, even try some meditation or an evening run!\n\n**5)** **Meditation – Focus Up, Fear and Anxiety Down**\n\nWhat CAN’T meditation do? It already improves attention span, clarity, and focus. It can even improve your IQ! Well … it turns out it’s powerful stuff because it can boost happiness for you too. \n\nNeuroscientist Sara Lazar [published a study](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3004979/) showing how meditation increases your ability to deal with stress and discomfort. In fact, regular practice shrinks the amygdala – the portion of the brain responsible for fear and anxiety. Think about how much happier you’d be without that discomfort! \n\nAs well, [a study published](https://www.ncbi.nlm.nih.gov/pubmed/23724462) by the US National Library of Medicine shows how meditation affects cortisol levels in the body. Fun fact: cortisol is the hormone responsible for stress. Too much of it can lead to anxiety, mood swings, and sleep troubles. Out of 30 students tested each had shown a significant decrease of cortisol (AKA they were happier)! And this was only after four days!\n\nI used to be resistant to meditation. I’d rather watch Frozen 10 times over with a group of 5th graders than sit in silence. \\**Shudder\\** But now, I’ve been meditating consistently (20 minutes each morning) for the past four months. Here’s where I saw differences:\n\n1. It helped boost my confidence\n2.  It helped me maintain focus throughout the day\n3. It made me more emotional … I used to be super closed off\n4. I now enjoy the little things in life way, way more\n5. My outlook on life is more positive and I feel happier!\n\nI challenge you to take this easy step, right now. Change the way you think and change the way you feel. Even if you are thinking “this is ridiculous I’m already amazing…” just try it!\n\nThese are my favorite apps for practicing:\n\n* 1 Giant Mind\n* Headspace \n* The Mindfulness App\n\n**6)** **Practice Gratitude**\n\n* *“Gratitude unlocks the fullness of life. It turns what we have into enough.” – Melodie Beatty*\n\nThis practice is super simple, and it will have a great effect on your outlook. Gratitude goes hand in hand with mindfulness. It helps you to focus on the present and appreciate what we have now, rather than obsessively wishing for more. \n\nIn 2003, Dr. Emmons of the University of California [published a study](https://greatergood.berkeley.edu/images/application_uploads/Emmons-CountingBlessings.pdf) in the Journal of Personality and Social Psychology. 200 college students split into three groups and were asked to keep a journal on blessings, annoyances, or neutral events. After two weeks, those in the blessings group reported being more positive about their lives and more optimistic about the future. After 10 weeks they had fewer physical ailments and even spent more time exercising. Now that’s a double-whammy for happiness!\n\nOther studies have explored how gratitude can improve relationships. For example, when analyzing groups of couples, gratitude helped improved their bonds. Those who expressed happiness for their partner felt more positive towards the other person. They also felt more comfortable expressing concerns. \n\nI challenge you to begin practicing gratitude today. Keep a journal and write down three things that are specific for that day. The best part about this is the days keep giving! I’m always going back to my journal to see what happened last week or last month … it puts a smile on my face.\n\nHere are five ways (tried and tested by yours truly) you can become more grateful:\n\n1. Spend more time in nature … I find it calms me down\n2. Appreciate a friend … just because they’re them\n3. Spend time with the ones you love … give them love too\n4. Commit one random act of kindness each day … even for a stranger\n5. Enjoy the little things in life … they’re what really counts\n\n**7)** **Satisficing vs. Maximization – Better Results with Less Stress**\n\nThis is one of the most interesting topics I have come across while creating this piece.\n\nSatisficing is the concept of doing what’s “good enough” for the desired outcome, rather than doing the absolute best. It is the opposite of maximization, which means you only accept the best. \n\nLet me explain!\n\nThink about the last time you maximized on something. Maybe it was an essay, at the gym, or even cooking dinner for the family. It was probably stressful as hell because you were trying to get the *best* result out of the work you were doing. \n\nIn 2002, Dr. Barry Schwartz [published a study](http://www.wisebrain.org/media/Papers/maximizing.pdf) which analyzed happiness in both satisficers and maximizers. The results? Satisfiers are happier than maximizers. As well, they often maximize without even try to. \n\nFor example, when making a decision satisfiers will choose one that is good enough. The maximizers will search until they are certain their choice is best but continue to worry about the other options long after the choice has been made. \n\nHere’s where the interesting part comes in … after a satisfier has made a decision, there is still room for improvement. This allows them to upgrade to a better option if the moment presents itself. Without trying to find the best option they’ll end up with it anyway, and without the stress, a maximizer would have!\n\nThis is incredibly easy, and helpful to do today. If you tend to spend too much time analyzing options, I challenge you to let go of some expectations. Opt-in for the choice giving you the results that are *good enough* and keep a watchful eye for upgrades along the way. You’ll find that you have less stress because you won’t spend as much time worrying. You’ll also be able to get your work done faster … leaving more time for fun in the sun!\n\n**8)** **Spend More Time with Who You Love – Relationships are Worth More Than Money**\n\n* *“We are happy when we have family, we are happy when we have friends and almost all the other things we think make us happy are actually just ways of getting more family and friends.”* – Daniel Gilbert\n\nSo many of us think happiness comes from status and monetary reward. While these may bring a sense of fulfillment, they take away from what truly makes a happy life: our relationships. Personal relationships have the largest impact on your happiness … so spend more time with the ones you love!\n\nIf you can’t be swayed from a monetary focus, what if I told you your relationships are worth more than an extra $100,000 a year? A study in the [Journal of Socio-Economics](https://www.bakadesuyo.com/2012/01/what-are-your-relationships-worth-in-dollars/#ixzz2b33s2ANx) states the following: \n\n* *“Using the British Household Panel Survey, I find that an increase in the level of social involvements is worth up to an extra £85,000 ($108,000) a year in terms of life satisfaction. Actual changes in income, on the other hand, buy very little happiness.”*\n\nRead that last line one more time … “Actual changes in income buy very little happiness.” You can increase your income by massive amounts each year and *still* not achieve the happiness everyone craves. To put other life events in perspective, here is what the Journal valued them at:\n\n1. A happy marriage is worth $105,000 a year\\\\\n2. Seeing friends and family regularly is worth $98,000 a year\n\nThis is a helpful reminder that all of those “paths to happiness” aren’t as important as you think. Spend time in the present and spend time with family in friends. I challenge you to be happy now … don’t wait to complete those paths to happiness.\n\n**9)** **Help Others – Give Back to Get Happy**\n\nHelping others is not limited to giving up time cleaning up the neighborhood or at a soup kitchen. In Shawn Anchor’s book, he brings a twist to spending money called “prosocial spending.”\n\n* *“...when researchers interviewed more than 150 people about their recent purchases, they found that money spent on activities—such as concerts and group dinners out—brought far more pleasure than material purchases like shoes, televisions, or expensive watches. Spending money on other people, called “prosocial spending,” also boosts happiness.”* \n\nThe Journal of Happiness also [published a study](https://www.bakadesuyo.com/2011/04/is-there-a-way-to-create-a-positive-feedback/#ixzz2b2m2LMBe) exploring this concept:\n\n* *“Participants recalled a previous purchase made for either themselves or someone else and then reported their happiness. Afterward, participants chose whether to spend a monetary windfall on themselves or someone else.* *Participants assigned to recall a purchase made for someone else reported feeling significantly happier* *immediately after this recollection;* *most importantly, the happier participants felt, the more likely they were to choose to spend a windfall on someone else* *soon.”* \n\nBut if you’re like me, happy and broke … don’t worry … spending time on others is as valuable as money. In his book *Authentic Happiness,* Martin Seligman says this:\n\n* *“We scientists have found that doing a kindness produces the single most reliable momentary increase in well-being of any exercise we have tested... Here is the exercise: find one wholly unexpected kind thing to do tomorrow and just do it. Notice what happens to your mood.”*\n\nHere is your challenge! Find one kind thing to do tomorrow and just do it. After you master that, try volunteering:\n\n1. Volunteer at a local school … you can be a positive role model for a child\n2. Spend time at a senior center … you may learn from those who have traveled before you\n3. Fix and serve meals … you can help someone find their next meal, and offer a smile while you’re at it\n\n**10)** **Just Be Yourself – Wear Your Own Shoes**\n\n* *“Happiness flows easily and effortlessly when you just let yourself “Be Yourself.” — Michael Fordyce*\n\nIf there is one thing out of this *entire* list to start doing now, it’s this. Be happy with who you are. You don’t need to “be accepted” or try to fit into other’s expectations. For that matter, you don’t need to fit your own expectations to love yourself and be yourself. \n\nThink: who do you want to be in five years? No matter who you will be, you don’t have to wait five years to be happy. If you love yourself now and enjoy the journey to your future self, you’ll always be content. \n\nIf you be yourself today, amazing things will happen.\n\n* You will find your tribe. You’ll be surrounded by people who love you for the real you and support your goals.\n* You will be trusted. People will feel secure in knowing you are who you say and act like you are.\n* You will be more confident. You won’t need to worry about impressing people and changing who you are in certain scenarios.\n* You will be less stressed. There is no need to act differently in certain environments … it’s so much easier to be yourself than to be fake all the time.\n* You will be happier. Your happiness is based upon your own ability to step into greatness while wearing your own shoes. \n\nLiving a life that shows who you truly are is the best way to happiness. What if you had to live someone else’s life? We are in an amazing time where people can express themselves and be who they truly are. People will support you, there is something for everyone. \n\nUse this to your advantage. If you’re wearing someone else’s shoes … take them off and put yours on.\n\n**11)** **Organize Now and Set Goals for the Future – Find Your Purpose**\n\n* *“If you want to live a happy life, tie it to a goal, not to people or things.” – Albert Einstein*\n\nHappiness and productivity are linked. \\**Cough Cough*\\* What a good reason to start making changes! \\**Cough*\\* \n\nHere are four reasons why the more productive you are, the happier you’ll be:\n\n**1.** **Make a To-Do List … And Stick to It**\n\nThe more you accomplish, the better you will feel about yourself! Whether these tasks are big or small … it doesn’t matter, just get ‘er done.\n\nThe only key is finishing the task! When you scratch off a task from a job well done, your [brain releases dopamine](https://www.psychologytoday.com/us/blog/mouse-man/200904/what-is-dopamine) and quite literally improves your mood. \n\n**2.** **Set Goals SMART Goals**\n\nMake sure your goals are SMART (specific, measurable, attainable, relative, timely)! Setting these types of goals can give your self-esteem a real boost. \n\nNot only that but now you have something to look forward to! When you have a purpose, you will be happier to jump out of bed and tackle the challenges of life. \n\n**3.** **Manage Your Time Wisely**\n\nWhen you’re on a productive streak, hitting a spot with nothing to do can be discouraging. The better you manage our time, the more productive your days will be.\n\nThe more productive your days … well … the happier you will be too!\n\n**4.** **Find Purpose in Your Productivity**\n\nProductivity is important, but it doesn’t mean always being busy. Being busy means doing more and more things. Being productive means doing something with a purpose.\n\nWhat is it you want out of life? What are your goals? Answer these questions for yourself and align your productivity with them.\n\nAs illustrated by Einstein, true happiness can only be attained when you work for your passions and goals. I challenge you to review this list of happiness hacks. Make a list of what you want to try today and stick to it! Put these in your schedule and set some goals. Manage your time and make a productive leap towards happiness! Life is short. Make it count.\n\n# Key Takeaways \n\n**1.** **Take Care of Your Body**\n\n* You only get one body; take care of it. Exercise, eat well and make sure to relax. Remember, “happiness depends on ourselves,” so boost yourself up and give yourself power.\n\n**2. Respect Your Mind**\n\n* Your mind is the most valuable asset you have. Allow yourself a good night’s rest to recover from a long day – you’ll be less sensitive to negative emotions. Meditate to reduce your stress and anxiety. Practice gratitude to be happy with the present. And when you’re faced with a decision, try satisficing, you’ll end up maximizing results without the stress. \n\n**3. Cultivate Relationships**\n\n* Daniel Gilbert has a point when he says “…other things we think make us happy are actually just ways of getting more family and friends.” Increase your social interactions, especially with the ones you love. And when you volunteer, remember, spending time on others is just as valuable as money.\n\n**4.** **Be Yourself**\n\n* If there’s one thing to start doing today, it’s being yourself. Living a life that shows exactly who you are is the fastest way to happiness. If you’re wearing someone else’s shoes, take them off and put yours on.\n\n**5.** **Be Powerful**\n\n* Here is your reason to start making changes: happiness is linked to productivity. True happiness can only be attained when you work for your passions and goals. Sure, we may all learn from reading, but to put something into practice … that is where real power comes from. Start today!\n\n# We want to be – so desperately – happy with ourselves because we are unique … we are free … and we are powerful. Make life yours and be your very best self.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/c1wyst/11_hacks_to_boost_your_happiness_backed_by_science/", "title": "11 Hacks to Boost Your Happiness … Backed by Science", "social_network": "reddit", "user": "trevormcmahon", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 87, "down_vote": 0, "creation": 1560827050, "permalink": "/r/DecidingToBeBetter/comments/c1wyst/11_hacks_to_boost_your_happiness_backed_by_science/", "nsfw": false, "first_save": 1635437684.6500366, "replies_charged": false}