{"id": "t5_2tand_t3_422i3j", "request": ["78fd6fdb-9773-43a2-a009-a544155322bc"], "text": "Hey team!\n\nI made a website on personal growth for gamers (if you couldn't tell from the title). At the core of it is me just exploring different ways to make life fun while becoming a better person.\n\nIn the most recent patch of it, I've been taking Jungian psychology / MBTI and reskinning it to fit with RPG elements.\n\nIf you don't know how cognitive functions (mental wiring) work, I'll explain it really quickly so I can get to the fun stuff. We all have preferences for how we learn and make decisions. Learning - Sensing (concrete) or iNtuition (abstract). Decisions - Thinking (logic) or Feeling (...feelings). There are introverted (based on your subjective / personal experiences) and extroverted (objective / unconnected to your personal experiences) versions of these.\n\nThe system for my website basically explains all this in terms of RPG classes, races, pre-made characters, spells, gear, enchantments, and abilities. There are two races that fit the Elf and Dwarf stereotypes while still explaining how introversion and extraversion actually works. Each of the styles above turn into classes - warrior, hunter, mage, and healer. They each have goals and unique abilities.\n\nBasically it's all there to turn you into a Hero and give you the controller to your life. It'll help you with stress. It'll motivate you by showing what puts you in a flow state. It'll teach you how to talk directly to the core of people.\n\nSo... part of why I'm sharing this now is because I just made a video series and a book about it on the website. The series is the \"Call to Adventure.\" You can find it on the front page if you're interested in watching me get over my uncomfortableness in front of the camera :P I definitely have some room to grow, but nobody starts off perfect.\n\nI know this type of thing isn't for everyone. I'm perfectly okay with that. I just want to help the people who are interested in it. I'd love constructive comments and a little bit of love. I've put a lot of time into this and it's a personal passion.\n\nThe website is www.boss-mod.com and it's called **BOSS mod** - Bring Out your Stronger Self.\n\nThanks a lot!\n-Sherman", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/422i3j/a_gamers_guide_to_personal_growth_fixed/", "title": "A gamer's guide to personal growth FIXED", "social_network": "reddit", "user": "zorosherman", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1453416277, "permalink": "/r/DecidingToBeBetter/comments/422i3j/a_gamers_guide_to_personal_growth_fixed/", "nsfw": false, "first_save": 1635436355.1667912, "replies_charged": false}