{"id": "t5_2tand_t3_h7meyq", "request": ["e234981c-b061-4d83-8134-70d441847f74"], "text": "I am a mid 30s male on this website for over a year. I have been reasonably active on this site as I am somewhat inactive in my real.life, fighting ill health and mobility issues (I had a spine injury) for little over two years now. \n\nI started off with all the memes and fun stuff, but was soon drawn into the dark underbelly of politics, conspiracies and political conspiracies. These became a channel to vent my frustrations with my health in real life - transforming, metamorphing into attacks on them whose political ideologies I disagreed with and being attacked by them in return in a meaningless internet slug fest. And as the muscle that we work becomes stronger, this vice started getting stronger around me - in the moments of weakness when I was frustrated and emotionally sore, I started venting it out on political subs as conspiracy subs. \n\nThere were moments of lucidity when I saw the meaningless of this, but another failure on health front and back I was like  drug addict, to fight pain with pain. \n\nI am.not saying that the world is great or there are no biases on subs or everything is suddenly rosy - no I am.not saying that. All I am saying  is, so what if it is like this? It is not worth fighting over. It is just internet website. You gain nothing from beating anyone here. Zilch. Zero. Infact it's net negative. \n\nI saw a post on r/mademesmile and it clicked something inside and I decided in that moment that it's not worth losing precious moments of life drowning yourself in the eco-chamber of negativity. There is lots of positive as well and if you absolutely have to be in an echo chamber, be in the one where you hear vibrations of love, happiness, joy and humanity and not in those where there are just shrieks of hell.\n\nRace, religion, color of akin, country of origin, sexual orientation, political viewpoints, economic status....there are so many divisions that we can divide ourselves into, but let us all unite as humans.\n\nI seek forgiveness from anyone and everyone that I may have made feel bitter or angry or small or any negative in any other manner from many of my attacks. Also, I forgive anyone and everyone who attacked me or mocked me. And I tell you, as my brother, it's not worth it.\n\nImmediately after posting this, I will unsubscribe from all the subs that propagate negativity. I will update this group once I am done pruning.\n\nOnce again, I seek forgivenes for my attacks or any other way I made anyone feel bad.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/h7meyq/realising_internet_points_dont_matter_every/", "title": "Realising internet points don't matter, every social media site ii's an echo chamber where you easily get drowned in your own bias and it's not worth it at all", "social_network": "reddit", "user": "Sage010101", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 346, "down_vote": 0, "creation": 1591974564, "permalink": "/r/DecidingToBeBetter/comments/h7meyq/realising_internet_points_dont_matter_every/", "nsfw": false, "first_save": 1635437559.7095692, "replies_charged": false}