{"id": "t5_2tand_t3_pfyemh", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf", "f29068b1-c751-4543-b3a6-9d58b1182ab7", "83780c3f-0425-40b0-bb3a-19c3a369b69b"], "text": "I think I’ve always been a very loving and wholesome person, but my life has been pretty rough. And I’ve gone through some dark days. I used to be so cynical and hateful towards the people because for a very long time I had no one in the world who gave a shit about me.\n\nBut then I met some people. Really good people. People who consistently loved and believed in the best in me no matter what. Even before completely knowing me they welcomed me as if I’m family. Granted, it’s a small portion but it still hits home. And I realized that more than anything, love is the most healing thing there is. As cheesy as it sounds.\n\nI want to be a person who can show up for others. I want to give back that feeling of open arms and a belief in the best of people.\n\nI see myself down the line being a big part of the community and giving back where I can. I love to lead and plan so I’d love to be the head of something. I know that I will still encounter people who will hurt me and take advantage of my kindness. I’ll be burned so many times. But I want to remember that despite it all, there are good people out there. And I can be one of them.\n\nLmk if you have any ideas of where I can start! I’m only 20 (F), going on 21, so I know I’m very young. I look even younger so most people don’t take me seriously and will talk down on me. But that’s not anything new to me that I can’t survive :)\n\nBTW, I am not religious. But if I were then church would be perfect for all of this lol.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/pfyemh/i_want_to_be_a_good_person_and_build_a_community/", "title": "I want to be a good person and build a community", "social_network": "reddit", "user": "maekyosity", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1630516452, "permalink": "/r/DecidingToBeBetter/comments/pfyemh/i_want_to_be_a_good_person_and_build_a_community/", "nsfw": false, "first_save": 1635435143.3434465, "replies_charged": false}