{"id": "t5_2tand_t3_ik2d85", "request": ["67ce7893-b918-4235-a31e-1de8eda5cfa6"], "text": "Been having issues in my marriage for years, trying to fix things and promote change and growth in my spouse. Even after he admitted he has been committing adultery from the beginning (eight years!) I tried to fix things for his sake because I could see that the more he dug in his heels against change, the more his life was falling apart, and mine too, and he needed the family support to succeed. And I loved him, and wanted better for him than he was doing to himself.\n\nBut I knew something was deeply wrong and he not only ignored my requests for change but each time I brought up how I was suffering from his behavior, it got worse. (Wouldn't show up to work, wouldn't come home, wouldn't get off his games and help around the house if he was home.) He knew I was feeling suicidal and I finally understood that he didn't have it in him to care. My suffering didn't matter to him and I had to let his life fall apart.\n\nI've gone no-contact and now less than a month after serving him, I've gotten a 4.0 in my first college term, self-published a fiction story, started getting better sleep, bought a ukulele and practice every single day, journal, and I'm building a habit of working on a new drawing once a week to practice that, too.\n\nI moved all his belongings out of my bedroom and redecorated. Lastly, I'm starting a new fantasy novel focusing on emotional manipulation, and of course the character inspired by my husband dies in the end, and I write a little each day.\n\nBest of all, I'm not spiteful that he didn't love me or himself enough to change. I'm a little tickled he's jobless, broke and unemployed despite all the help I tried to give him, but mostly I'm just thankful he made it clear who he is, and allowed me to have the peace I deserve. I haven't wanted to harm myself since I served him.\n\nI could be angry about everything but instead I'm so tired of not being happy that I've chosen to just do that. And I haven't been this happy in more years than I probably realize. I never would have thought divorce would bring me so much peace.\n\n\n*Edit:* Wow! I did NOT expect this kind of response or for this to blow up so much! Thank you, thank you, thank you for all the awards, encouragement and kind words! This has been amazing.\n\nI didn't want to share this for praise or karma and certainly never expected any awards, I just wanted to talk about how excited I am that things are finally going well and I'm getting closure.\n\nBut I had another reason for sharing, and it seems like I've managed to serve this purpose based on some of the comments. I was hoping that if anyone was in a similar situation where they might want to get out but don't know if they can or should yet, that life on the other side of a toxic relationship is beautiful. I'm so happy to hear some of you are thinking of leaving people who might not be good for you because someone chose to speak up.\n\nI can't keep up with the comments but I can give some blanket advice here to anyone in that situation.\n\n1) It is HARD. No one can make the choice but you, which means no one can make it for you and you have to decide what's the most important to you. For me, I stayed longer than most people thought I should have but I wanted to be free of doubts in ending it, knowing I tried *everything*. That was important to me.\n\n2) Please, please, please establish a support system. Start talking to the people you know love you, and if they aren't supporting you doing what's best for yourself, find people who do and talk them to death because you'll need to process. If someone makes you feel like you're talking about your relationship too much for them, don't get discouraged, just find someone else. A therapist, an online friend, whoever. This is your life and you deserve to process your grief that the relationship you thought you had is not what's real. Whether it ends or not, it's still grief over a life you thought you had. Respect that and you'll heal better.\n\n3) You cannot change other people. And even if they don't change, it's because THEY are broken and are failing themselves. It's not because you aren't enough. You can never be enough for the wrong person, but you will be for the right person, even if that's you.\n\n4) You will be okay on the other side if you leave, even if it looks scary or takes a while for the pieces to settle. You will be.\n\nBest of luck to all of you contemplating staying or leaving. Please be safe. Tell a friend ahead of time so they know what's going on in case things get ugly. You guys are the best, you can do this.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ik2d85/i_decided_to_stop_giving_my_husband_chances_to/", "title": "I decided to stop giving my husband chances to change, and I changed instead. I'm divorcing him and now no longer suffering from suicidal thoughts and insomnia, and learning new skills instead!", "social_network": "reddit", "user": "rock_kid", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6092, "down_vote": 0, "creation": 1598894823, "permalink": "/r/DecidingToBeBetter/comments/ik2d85/i_decided_to_stop_giving_my_husband_chances_to/", "nsfw": false, "first_save": 1635438171.824358, "replies_charged": false}