{"id": "t5_2tand_t3_hzo113", "request": ["e2b0c51d-d8b4-47e2-9068-3f62f435f3fc"], "text": "Hey what's up everyone!\n\nI have always heard people talk about Reddit, but for some reason I have not joined until today, so I wanted to briefly introduce myself!\n\nI am a Canadian-born, home-schooled, down to earth dude who absolutely loves spreading the message of self-mastery.\n\nI have a 9-month-old border collie, a beautiful wife and a baby on the way due in January of 2021!\n\nI have discovered that inside of me is infinite wisdom and intelligence that I can tap into and use at any time to guide me towards my highest purpose.\n\nWhen I discovered that I was born to do great things and spread a message through public speaking, I was working a high-paying career as a welder in the Canadian oil field.\n\nI remember waking up every day with anxiety and depression because I had no time freedom, friends, a girlfriend or even happiness...\n\nSure, my bank account was on the rise every single day, but my inner peace was spiraling downward and it wasn't getting better, so I had to make a change.\n\nI am so glad I walked away from that career and pursued personal development along with my dream of public speaking because I am in full alignment with my deepest desires now.\n\nAnd so the point of this post I suppose is to inspire you to take action on your deepest desires.\n\nTrust me, when I walked away from my $1,000 per day income I was TERRIFIED\n\nAnd yes, it has not always been easy, but this path I chose has been 100% worth it!\n\nDo you have a dream that you have not yet taken action on? What is it?\n\nReady to make today your day?\n\nMuch love,\n\nTobias", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/hzo113/intro_how_i_went_from_selfdestructive_thinking/", "title": "(Intro) How I went from self-destructive thinking, anxiety, and depression to a life of fulfillment and pure inner peace (most of the time)", "social_network": "reddit", "user": "TobiasJMaskell", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1595973529, "permalink": "/r/DecidingToBeBetter/comments/hzo113/intro_how_i_went_from_selfdestructive_thinking/", "nsfw": false, "first_save": 1635436718.8981342, "replies_charged": false}