{"id": "t5_2tand_t3_fw5bad", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "**\\[EDIT\\]: For those who might search or even for myself, it was mild PPD and overwhelming emotions due to Breastfeeding. Much better now.**\n\nI was redirected here from another subreddit so here goes nothing.\n\nI was pregnant what feels like, all of last year and am now 6 months post-partum. This is a very much wanted baby and I love, love, love her to bits. After months of not bonding well and a difficult breastfeeding journey, I am so overwhelmed with love for her.\n\nThat being said, I'm become a very demanding person that wants to control everyone around me and I do not how to change that. This is what I've been told by my family and they mentioned that it's miserable for them to live with me, including my husband. This breaks my heart because I'm the kind of person that lives to please everyone. I've been told that my nature is to help others so this judgement is saddening to me. I demanded throughout my pregnancy that my husband share chores around the house. He was kind and obliging to do so. Breastfeeding is important to me so I've been demanding my mom to help out more(that she really doesn't like doing like cooking, dishes etc). I am by no means a soft-spoken person i.e have a loud voice so everything I say can come off as \"yelling\". I was told that I'm not listening to them when they have to say something but the only reason I'm not listening them when they say is because I'm guilty of doing all the bad things. I'm responsible for every scream-fest that happened in the last few months. My doctor did mention that I might have mild post-partum depression and suggested therapy but between working three jobs, searching for a job and taking care of a baby, it's difficult to allocate time to therapy. I wish there was a pill that would just make me a better person.\n\nAlso, I'm so angry these days. I get mad when someone eats the pasta-dish I made for myself. This is stupid, I know. They're family and I should let it go but I get mad that they didn't help me make the dish in the first place nor bothered to tell me that they want some, so I could've made some extra. I hate myself for being short and impatient with everyone around me\n\ntl;dr: I've become a mean-sprited, demanding, angry and overall awful person that just wants to be right during arguments and doesn't want to listen, in the fear of being wrong. I don't know where to start and what to fix first. Has anyone dealt with a person like me or been a person like me? Please help.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/fw5bad/how_do_i30f_change_myself/", "title": "How do I[30F] change myself?", "social_network": "reddit", "user": "throwaway2020change", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 5, "down_vote": 0, "creation": 1586201663, "permalink": "/r/DecidingToBeBetter/comments/fw5bad/how_do_i30f_change_myself/", "nsfw": false, "first_save": 1635438269.1767778, "replies_charged": false}