{"id": "t5_2tand_t3_p3ykeg", "request": ["7becc3f1-2642-46f0-9b20-b8ae6b2e627b"], "text": "I am recently divorced, and I am the guardian to a 16 year old. He was with me for the summer but I had to take him back to my Ex last weekend. I thought I would crumble. The past few weeks have been an emotional mess. BUT I DIDNT. I didn't crumble and it's been the best week in so long. \n\n\nSUNDAY\n- I realized my birthday coming up was going to make three years of sobriety. I bought myself a little cupcake and a candle and a lighter, and I let myself have a little moment of gratitude, for nothing and no one but myself. \n\nMONDAY\n- I got a lead on a new job \n- I started Guitar lessons and LOVED it!!! \n\nTUESDAY\n- I Jumped out of a plane!!!! I didn't tell many people before hand, I didn't talk to anyone the morning of, it was just for me. I went alone. And I was so present and aware. I felt so confident brave and strong. \n\nWEDNESDAY\n- I had plans but let myself rest instead, choosing enjoyable excercise instead \n\nTHURSDAY\n- I was social and proactive with looking for a job \n\nFriday\n- I absolutely DESTROYED my personal record on my bicycle. Literally doubled it, and with relative ease. By asking for advice on another thread and changing a few small things, and just telling myself I could..... I was actually shocked at the results. \n\n\nI also feel like I was able to detach from someone I had been relatively codependent on lately, not reaching out, not feeling panicked to talk with them all the time. Just. Such a good week. And wanted to share.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/p3ykeg/honestly_just_a_fantastic_week/", "title": "Honestly just a fantastic week", "social_network": "reddit", "user": "improve-indefinitely", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 98, "down_vote": 0, "creation": 1628903902, "permalink": "/r/DecidingToBeBetter/comments/p3ykeg/honestly_just_a_fantastic_week/", "nsfw": false, "first_save": 1635437381.250942, "replies_charged": false}