{"id": "t5_2tand_t3_nkgjm8", "request": ["c67213dc-0eed-4cac-a781-9bc082742908", "78e8a1f4-314f-439f-8f40-daf7a6da355f"], "text": "I live alone in a 1 bedroom, so it's easy to justify not cleaning up. I've been going through a weird depression episode these past few months and it has to do with me not knowing what I want to do for a living. No job has ever made me happy. I feel confused and lost on what my purpose is.\n\nAnyway, I let my apartment go. I mean... I really let it go. Trash everywhere, clothes everywhere, dishes piled up in the sink (which forced me to eat take out everyday), my shower was dirty, my sink was dirty, I haven't vacuumed my carpet, I haven't done my laundry in months....basically my apartment looked like a nightmare. It was truly weighing down on my mental health. I was taking multiple days off of work and just sleeping and indulging all day long. Not answering friends phone calls, not going out on the weekends, etc. I was not in a good head space. \n\nWell, today I woke up and felt sick to my stomach at the environment I was living in and I spent about 6 hours deep cleaning my apartment. I got into every little fine detail I could think of. I even vacuumed my carpet atleast 5 times over just to make sure I got every single last bit of dirt. Did all my dishes and cooked a home-made meal tonight. I even had the energy after cleaning to go hit the gym. I fell victim to myself and somehow justified that I should just give up on life. Well I don't feel that way anymore. I just want to be a better person, and I believe it starts with a clean place which then creates a clean mindset. I feel like I pushed the reset button and I'm ready to get back to my old self. I just want to be happy.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nkgjm8/i_decided_to_deep_clean_my_apartment_after_months/", "title": "I decided to deep clean my apartment after months of being in a depressive episode", "social_network": "reddit", "user": "CryptocastYT", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2132, "down_vote": 0, "creation": 1621915052, "permalink": "/r/DecidingToBeBetter/comments/nkgjm8/i_decided_to_deep_clean_my_apartment_after_months/", "nsfw": false, "first_save": 1635436298.5515993, "replies_charged": false}