{"id": "t5_2tand_t3_5hxst7", "request": ["84f5a3ef-70d7-4e19-b197-e6292c477526"], "text": "10 Lessons I Learned After Battling With Cancer Twice By The Age Of 25\n\nToday I am so excited to share my story and hopefully, it can make someone’s’ life easier by testimony. It is a story of how I survived cancer by devotion, sacrifice and literally fighting my way out. It is beyond doubts the toughest episode of my life, it was a short period in which I reflected on a lot of issues especially on the two precious lives of my children which still need me so much for support.\n\nHere is how it all started… Mid 2013, a growth mass was discovered in the lower part of my abdomen after I felt a bit of discomfort while performing a regular lifting weights session at the gym, and a week after, it was diagnosed as a cancerous tumor. My attending physician told me to prepare for surgery and that my condition was going to be monitored closely for a couple of years because this cancerous tumor was still at an early stage. After a simple operation, this whole phase passed swiftly and everything went back to normal, further treatment was not necessary, as the surgery “supposedly” removed it all. My story then took a dramatic turn in March of 2014, just about 8 months later, in a routine checkup, a scan revealed a metastasis, that is, a secondary tumor. It was basically a recurrence of the previous tumor but this time on the bottom side of my lung in the lobe close to my heart.\n\nThis prognosis caused me to undergo a phase of 28 chemotherapy treatments besides surgery to dislodge waste. The chemo reduced the almost 9 cm Cancer to a mass of 1.5 cm, it was now time to “get in” and take that piece of my lung out to determine whether what remained was just dry waste or a reduced tumor but still cancerous, it was chopped off and examined. The time to wait for the results seemed like forever but finally, the day to see the doctor came (writing this now, I still feel the chills from that wait). The doctor came in holding the paperwork with the results, his words reading those results to me are arguably the most astounding words I have ever heard…\n\nWith a smile, he beautifully affirmed “MR. TOGNARELLI YOU NOLONGER HAVE CANCER!” \n\nJust like that, months of misery came to an end and now is my time to share a miraculous comeback with the world. Here are 10 lessons I learned during and after battling with cancer- twice at the age of 25.\n\n1- To Never Mind The Negative Sentiments People Have About Me\n\nDuring my chemo, I sometimes had to walk through the streets and malls with a bold head, without eyelashes and eyebrows. I could almost feel the piercing eyes of people, the obvious questions on their minds reflected on their faces as they stared at me. Occasionally, I would catch some people with the pointing finger right in the act, mostly likely saying how I looked like an alien. Today nothing of that sort matters, the experience developed a strong psychological fibre to withstand the prejudices of people. And because of this, I can confidently do things without caring the negatives people will say. Unless I desire, I know I have absolute power over the kind of results I get.\n\n2- Developed A Firm Grateful Attitude\n\nUncertainty was the bedrock of my struggle with cancer. The days were dangerous especially on account of the chemotherapy treatments, the majority of cancer patients can testify that the drugs can literally cause you to pass out and never come back. The uncertainty of the treatment and the disease itself led me to cultivate a sense of deep gratitude for each moment and delight in each miraculous day.\n\nI never realized the importance of a simple breath and much I had taken it for granted. It had to take the lung operation to remove the tumor for me to appreciate the importance of a free breath, I woke up intubated to a whole network of tubes and hoses to help me breath. It was at this point that I realized how little aware people are of little vital things that help us live on. I resolved to be thankful and to appreciate all that life offers. It was a lesson on developing a firm attitude of gratitude.\n\n3- Remain Appreciative For What I Have\n\nToday we live at a time when most people in society concentrate on things they do not have and the things they would love to have, they further lay aside what they already have or ever had. A society which operates on the notion that “The grass is always greener on the other side of the fence”.\n\nIt is an error to think that your neighbor is doing better than you or is in a more comfy position in terms of having more cash or is experiencing more success. By doing so, we underrate the capacity we have and end up shying away from our noble duty due to fear of failing.\n\nDuring my cancer therapy, I saw people who looked far much better and healthier die and those in seemingly worse conditions recovered and lived on.\n\n4- The Perfect Time Is An Illusion\n\nThere is never a perfect time to do something, during my sickness I read something that changed my perception of my illness, which is “to live life is not about waiting for the storm pass, it is more about learning to dance with it”, this is exactly what I decided I would do.\n\nI was not going to go about cursing nature for what was happening to me so I could live or get an easy pass, I decided to acquire as much wisdom as I possibly could, experience the fullest of life, be grateful for the miracle of life and be compassionate for those who are in similar and worse position. I was going to tell my story for encouragement of people who grumble about small issues they can easily change.\n\n5- We Are What We Eat\n\nSadly, I didn’t know the gravity of the statement “you are what you eat” until I went researching the unique connection between the food we eat and the probable disease the food may cause. I investigated GMOs, processed meats, preserved foodstuffs, dairies, pesticides, and chemicals in vegetables and fruits, synthetic sweeteners, colorants, etc.\n\nMost of these foods are actually a load of poisonous chemicals that are guaranteed to alter the DNA to the extent of creating a cancerous tumor in the body. My research results led me to literally having a strict Vegan diet.\n\n6- Live Life In The Moment And To The Fullest.\n\nLife is short and probably full of troubles, this is a fact not so easily accepted. Life must, therefore, be lived to the fullest as we live it day by day- it is not a rehearsal, it is real time and is instantly happening.\nThis is not in any way suggesting that we should not plan the future or not to have an outlook of a future life. I am stating not to misuse the one thing we are sure of and that is today this minute, this second, NOW.\nIt is said that, to live unrealistically in the future is a source of anxiety, to live in the bygones is to live in depression whereas living now is purely being alive. Living in the present helped me recognize the numerous opportunities each day brings and the many times wasted by dwelling on yesterday and in a naïve future.\n\n7- We Are Responsible For Our Actions And Decisions\n\nThe bitter pill for an adult is that you are responsible for your own life. I was in some way responsible for the disease, and all other predisposing conditions.\n\nIt is not of any help to hide behind the “CANCER RUNS IN THE GENES” curtain, I acknowledged causing a lot of the physiological conditions which I would have otherwise avoided. For example, when I relocated to the US, I drastically changed my diet I habitually tried all sorts of meals, this heavily increased my weight, I was idle, took medications and did things I wasn’t supposed to.\n\nIn my heart I accept that this might have awakened the sleeping lions, it was the obvious trigger of the buried cancer.\n\n8- Others Aren’t To Blame.\n\nThe blame game is the easiest game in all the world, especially when things turn sour and don’t go as planned. It is much easier to blame others for the failure to attain a goal, live up to our responsibilities, missed opportunities, etc.\n\nIsn’t it a marvel that the most affluent people in the world equally have 24hrs per day? The same as you and I. the distinction then lies in how time is managed. If I really want something, I look for opportunities to generate it and if I fail trying, I always stand back up, wipe myself and take another go at it. I have no time to blame who didn’t do what, time on that treatment bed and seat taught me that the blame game won’t just help.\nHesitation and Justifications will ruin the momentum, waiting for the favorable condition to act is vain, and may cause you to just wait forever.\n\n9- Knowing Who I Am\n\nAt the peak of my treatment, I only desired to sleep at all times, I didn’t feel like seeing or indulging anyone, my drive was low and all I longed for was to be alone. Coincidentally, this condition helped me introspect and come to a deeper knowledge of who I really am.\n\nI was able to discover the other side of me that no one ever thought existed– not even myself. I took on an intimate love for my personal development, spiritual meditation, writing, art and study of human behaviors. Further, I took a keen interest in knowing the way I do things and just how sometimes we are kept on a leash of not living how we deserve and we how we want to live.\n\n10- Never To Wait For The Approval Of Others To Live The Life I Deserve\n\nWe all have aspirations and hopes, nonetheless, studies show that only less than 5% of any group really lives to see any success.\n\nThis statistic made me note an error, I personally advocate for the idea that we all have a singular purpose in our life experience on earth, and that this purpose was given to each person as an individual. For this reason, it’s not proper to expect that the world will approve of your aspirations.\n\nMore often than not, you will get views that suggest, this is crazy, this is impossible, it can’t happen, etc. however, the answer lies in knowing that you have a singular and a unique purpose. Others will never see things the way you do, don’t wait for their approval. Surprisingly, most people will not even dare try for fear of failure.\nMy cancer episode caused me to have a sense perseverance and a strong voice from the interior lauding me not to let time fly away, to be morally upright, to live life today because tomorrow is only a dream, to aggressively defend what I love and never to give up.\n\nI truly hope my testimony can somehow impact in your life for the better!\nWishing you success and health to each and every single “cell” in you!\n\nFelipe “The Survivor” Tognarelli\n\nhttp://www.thegeniuspower.com/how-cancer-saved-my-life-10-lessons-i-learned/", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/5hxst7/10_lessons_i_learned_after_battling_cancer_twice/", "title": "10 Lessons I learned After Battling Cancer Twice", "social_network": "reddit", "user": "TheGeniusPower", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 12, "down_vote": 0, "creation": 1481562978, "permalink": "/r/DecidingToBeBetter/comments/5hxst7/10_lessons_i_learned_after_battling_cancer_twice/", "nsfw": false, "first_save": 1635436217.4268243, "replies_charged": false}