{"id": "t5_2tand_t3_qfupno", "request": ["b51a8628-03a2-4f6d-a371-f9070ccbc2e4"], "text": "I’m Chris. I’m a fun guy. I like fishing. I like laughing. I have the most warped and outrageous sense of humor you’ve ever experienced. I can turn anything into a joke and laugh at it. I’m also the absolute most intense, fiery, hardcore, relentless, and driven person you’ll ever meet.\n\nI’m new to Reddit, but I’ve been around the internet a lot over the past 12 or 13 years. I’ve been seeing some of the posts about being motivated and inspired and staying consistent and I genuinely don’t get it.\n\nI’ve mentored/spoken to over 150,000 people in my time about subjects like this.\n\nIt is completely impossible that you are motivated by little sayings on a pretty picture. That’s just stimulation. It makes you feel good.\n\nMotivation is something only you can do, and it only comes from progress.\n\nProgress = Motivation\n\nWhen you can tell you’re really getting something and getting better at it, you get way more motivated to do it, don’t you?\n\nSometimes what we have to do is stop trying to be this individual living life internally, just us and our attitude and our phones, and we have to grow. \n\nSeeking out motivation is an endless road going nowhere. You need to seek out new information.\n\nLife has a way of telling you it’s time to grow and when our vocabulary is limited to just a few words, we generalize everything into these few categories and just repeat things that were never the solution before and they aren’t going to be now and we feel a little bit better for the moment, but tomorrow it’s right back into the same in constructive patterns.\n\nYou’re not “unmotivated.” It’s time to grow. It’s time to learn. It’s time to stop googling it and go ask someone who knows and actually learn something this time.\n\nWhat you’re calling, “unmotivated” seems a whole lot more like, “unfulfilled”.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qfupno/if_i_may_share/", "title": "If I may share…", "social_network": "reddit", "user": "RealChrisWoodward", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1635209107, "permalink": "/r/DecidingToBeBetter/comments/qfupno/if_i_may_share/", "nsfw": false, "first_save": 1635436792.1069884, "replies_charged": false}