{"id": "t5_2tand_t3_q2d978", "request": ["b69cf201-6737-4217-b486-9096135546b8", "c6df14ee-195b-4e9d-8032-7cca73d46fe8", "7becc3f1-2642-46f0-9b20-b8ae6b2e627b", "78e8a1f4-314f-439f-8f40-daf7a6da355f", "883794f3-030f-4844-8950-6e28281dfa3f", "f48bf32c-05af-4e9d-b00f-8b45a75af78f"], "text": "Today, I realized that I deserved better. \n\nI was in a relationship with a guy who didn't want to do anything but work his dead end job, play games and talk about sex. \nI found out he was talking to his ex wife (she divorced him) and another girl who claim they're just friends, except that those messages were very sexual on his end. They don't want him like that. \n\nLast night, I lost it and started crying. I told him that I really don't need this stress in my life... and he called me a stupid dumb bitch, because I will not \"put out\" like other girls do and he can get some. He has told me I'm stupid for following others and willing to go be independent, when I should be with him.\n\nI have a full time job and I go to school. I rarely get to spend any time with him, and if it is texting, we are always fighting because he's constantly talking about sex. He never really supported me doing well in life, and yeah, that should've been a red flag. Now I know better. \n\nI decided to finally block him on everything 2 hours ago, without warning.  I'm going to change my phone  number as well.\n\nHe can have those girls. I'm working on me now.\n\nEdit: Dear God, my inbox! I read everyone's comments here and I started crying at work here. You all are so amazing. Now I KNOW I made the right decision in my head and my heart. It will take time to heal, and I absolutely refuse to go back to him.\nThank you all so much for your support, sweet comments and awards! 🥰 much appreciated.\n\nEdit 2: I changed my phone number!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/q2d978/i_left_a_toxic_relationship/", "title": "I left a toxic relationship.", "social_network": "reddit", "user": "Mynameispiragua", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1236, "down_vote": 0, "creation": 1633495350, "permalink": "/r/DecidingToBeBetter/comments/q2d978/i_left_a_toxic_relationship/", "nsfw": false, "first_save": 1635436432.8013859, "replies_charged": false}