{"id": "t5_2tand_t3_mtp9kx", "request": ["f39f6441-79a5-42c9-8dca-c8455143a12a", "883794f3-030f-4844-8950-6e28281dfa3f"], "text": "Hi\n\n&#x200B;\n\nI exercise daily. I eat healthy. I dont have any addictions. I work full time. Im responsible with my money. I have a therapist that i see every week (and shes good. i like her). I meditate consistently. Im able to set goals and see them through, like running a marathon or training to be able to do a handstand. I have various \"hobbies\" that i think are cool and dedicate enough time to get good at, like archery or longboarding. And also have \"hobbies\" that are just simple things like reading or video games. I try going out to new things like homeless volunteering or random meetups, i dont even like going to new social things, but i still make myself. Because how else will things change. And ive also tried medication that the psychiatrist is very confident would help with not enjoying things.\n\n&#x200B;\n\nBut i just dont get it. I dont connect and GENUINELY enjoy anything. The only time i feel this feeling of life not being worth it, go away, is when i can spend a whole weekend with friends. During those times, motivation for life stuff returns and i feel more engaged. Those times are however rare. We are almost entering our 30's and people just naturally want to be with their partner after work and not 'hang out' as much anymore. Please dont turn this into a critique on my friends, they are fine people. This is just what happens when you get older. So forcing my friends attention with needy-ness isnt a good option.\n\n&#x200B;\n\nMy family is also not an option for connection. They are a toxic trap and ill just leave it at that.\n\n&#x200B;\n\nIm still actively trying to connect with someone dating wise both through the online apps and chatting up random people in person. But have no luck so far. I know this area in my life is certainly a problem as ive never been in a relationship. I dont think i really understand what love is or if i ever even did. Or if its needed in life. But its not something i can force. just keep attempting to make happen. And yes, ive asked my friends if they know anyone to set me up with, they dont. I (assume) finding someone would help, based off the fact that when im in company of people i care about (friends) life becomes worth it again as i mentioned above. \n\n&#x200B;\n\nThe real problem is that despite the fact that i do all the things i \"should\" be doing. Im losing. Im losing life energy and becoming more and more tired and more and more callous with my emotions. 6 years of being like this isnt good.\n\n&#x200B;\n\nIm not really looking for cheer me ups. If you guys were in my position, what specifically would you do? Ive ran out of self solutions.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mtp9kx/how_to_fix_life/", "title": "How to fix life?", "social_network": "reddit", "user": "user2puser", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 6, "down_vote": 0, "creation": 1618792399, "permalink": "/r/DecidingToBeBetter/comments/mtp9kx/how_to_fix_life/", "nsfw": false, "first_save": 1635435867.8226526, "replies_charged": false}