{"id": "t5_2tand_t3_i6bsk0", "request": ["5d0f6d96-af53-4a9d-aba2-c5967c631e40"], "text": "Some things that I've been dealing with. I pretty much hate everything.\n\n* I always think about negative scenarios about myself and terrible stuff that's going to happen to me. So many things that happened to me in life and so many things I did in life have got me into these negative thoughts and scenarios inside my head for years. I can't control them and if I think about them my mind becomes all over the place for no reason. When I try to think positively or do something, those negative scenarios come back to my mind. They frustrate me a lot.\n* I've always seen different kinds of hallucinations and me speaking to them every day in either a neutral or negative manner ever since I was a very young child. Hallucinations of either people I know in real life, people online, cartoon characters, or \"made-up\" people. I see them every day and I talk to them as if I'm talking to myself.\n* I'm always negative towards everyone, whether it would be my family members, relatives, schoolmates, people online, everyone. I keep hating people every time I see them. Fake positivity and emotions from everyone in this society bothers me so much. I keep arguing and fighting with everybody, no matter with whom or what. The biggest struggle I have in life is dealing with people. I always isolate myself in my room because of that.\n* Whenever I eat food or drink something, I always get this uncomfortable and unpleasant feeling that I'm eating or drinking too much, despite me looking for them if I'm hungry/thirsty. I leave tons of water bottles either half, full, or empty in my room for days. I even eat in my room more often than in the kitchen, leaving a huge mess. Sometimes I also don't want certain food that I'm given because of their texture/taste.\n* Whenever I play games on my computer, I get eye strains and a strong headache and become overly addicted to them, to the point where I get extremely tired and bored of their repetition and the fact of how mundane they are, to the point where I actually want to quit them for a while or forever. My brain gets drained and has no relaxation at all.\n* Whenever I listen to any kinds of music, I always get overwhelmed, upset, angry, and sad. For some kinds of music, I actually want to cry out of sadness, because of the way the music was made/the song was sung. Music makes me mind go crazy, it drains my brain way too much, leading to a large headache and me stopping the music immediately, especially if it's extremely loud.\n* I can't focus reading books. I find them extremely long and boring, I have an extremely difficult time reading them as well as looking at them. I almost never read them in my life. There's so much information that I don't feel like comprehending them, especially if there are no visuals/pictures inside them at all.\n* Whenever I watch TV shows/movies or videos on YouTube, I get easily bored and receive eye strains sometimes from the latter. Not as much as with games though, but still. There's literally nothing to watch these days, just local news that I don't want to bother watching.\n* Whenever I try to take a walk or run outside, I immediately get tired as well as my legs and overall physique becoming tired, overwhelmed, and passive. I generally ride the bicycle as an alternative of walking/running.\n* Whenever I try to ride the bicycle, I get a huge headache and become extremely tired and overwhelmed and end up having no amounts of motivation to go all around the town, especially when there's a lot of heat outside.\n* I have no motivation to clean up my room, I hate doing it. I let my mom fix my room as well as my bed. My room is currently a mess right now and the walls are starting to become dirty again after my mom cleaned them up. I hate doing any sorts of work at all.\n* I never feel like taking care of my personal hygiene, even though I'm always told by my family members to take care of myself. When I get into the shower, I just have thoughts about not wanting to get inside it but I end up doing anyways. I get extremely overwhelmed and uncomfortable when smelling hard hygienic smells, they make me want to somehow vomit.\n* I don't like going anywhere. Going somewhere is just a complete waste of time for me, I just want to stay home. Home is the only place where I actually want to stay in, I don't want to do anything productive at all, but that's just me.\n* I hate doing pointless college work and all I end up doing is procrastinate and wait until the last day to start working on it, to the point where I turn all of the stuff in late. I just end up doing work till midnight and/or even after that. At one point or two, I turned things in at 3 am and/or 4 am. I procrastinate in college work extremely often.\n* I always overthink whenever I try to say or type something online, because I don't know where to even start. It takes me a very long time to think about things and type them online or tell something in front of other people in real life.\n* Trying to exercise, weigh lifts, do any ball activities, singing, and dancing, are just pointless things to me. I am scared to do these things in front of other people because I'm poor at doing all of these things. For the first two, I'm extremely lazy and underweight and I can't lift weights that are even 10 pounds. For the latter two, they are things I have no clue about nor have experience with them. Doing the latter two will make me look like a fool. As for ball activities, I only have a small ball that I end up kicking around in my basement and I gain nothing from it other than trying to act stupid for no reason.\n* I don't get why so many things become so popular. I hate so many popular things because they just become popular for no reason other than for being popular. It makes no sense to me whatsoever.\n* Because of all the issues I mentioned, I lack motivation to do anything. I do all of these things at once and I get immediately negative and overwhelmed towards. I just end up hating everything.\n* I just think that life is completely pointless and has no objective meaning, purpose, point, importance, or reason, whatsoever. I don't know why I'm living, I don't know why we exist, I don't know where did we all come from, I don't even know whether this world exists or not, everything is just a total waste of time to deal with. I'm just extremely negative, cynical, pessimistic, nihilistic, close-minded, sadistic, rude, and angry towards everything.\n\nHow can I overcome all of these issues? Where should I even begin? I want to try and change myself for the better.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i6bsk0/i_have_extreme_negative_thoughts_and_perceptions/", "title": "I have extreme negative thoughts and perceptions about everything around me. I can't motivate myself to do anything. How can I think differently about anything?", "social_network": "reddit", "user": "-Sky_Nova_20-", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 4, "down_vote": 0, "creation": 1596940177, "permalink": "/r/DecidingToBeBetter/comments/i6bsk0/i_have_extreme_negative_thoughts_and_perceptions/", "nsfw": false, "first_save": 1635435458.3182695, "replies_charged": false}