{"id": "t5_2tand_t3_npho7f", "request": ["ae1f8c6a-a092-4d44-9c65-df014de8e434"], "text": "Can anyone relate to me? I need advice..\n\nI need some advice!\n\nI am fairly new to reddit so I’m not really sure how this works lol.. and sorry if this is kinda long..\nAnyway... Ive really struggling to understand my emotions and why I react to things the way I do. I am a 19 year old female and understand that my brain is to the point where it is really starting to mature. But let me give you some background information on me to help you help me lol..\n\nWhen I was about 2 years old my mother was killed in a car accident, I grew up with my father and my father was been remarried twice since the time my mother passed away. His ex wife was the on that was there throughout my childhood and was very abusive towards me ( considering I was the only child that was not biologically hers, once my older sister moved out) She was very emotional and physically abusive (i never spoke to my father about this ). She was also very addicted to pain pills. (And use of other drugs) my father then divorced her soon after she kicked me out of my house for telling my father she was dong drugs in the house around my little sister. I was 12 years old when she took me to my grandparents house (my mothers parents) and told me I wasn’t allowed to come back until my father got home from work. \n \nMy father was and still is a tug boat captain, so he was never really there when I was growing due to him having to be gone 6 months out of the year.  My father was my best friend when i was little. I was always tryin to spend all the time with him when he was home. But when he got married to his current wife (she is wonderful, and a great mother figure for me) everything changed and I never understood why. He got remarried when I was 13, and growing up without my mother at that age was very difficult. My father didn’t really know how to be there emotionally for me, so i just felt really alone. That is what I believed to cause us to have a terrible relationship when i was growing up. I always felt he would take his wife and step kids over me. \n\nas i go older I realized how narcissistic and manipulative he has acted towards everyone around him. Growing up he always had to have control. If he didn’t have control he would go through these manic episodes, and just rage until he got what he wanted. My father has gotten physical with me only a few times that I can remember (because he didn’t have control in that situation so he reacts in anger) once i reached high school things had gotten even worse with my father. I moved out of his house when i was 17 because I couldn’t handle the negativity any longer. So I graduated high school and 3 days later moved out. When i moved out we would go months without talking which felt like the normal life because he never reached out to me when he was working for months at a time. \n\nAbout 2 years ago i got with my current boyfriend and i was explaining to him that my father and i’s relationship has always been kinda rocky during my teenage years to now. When we were talking about this he kinda gave me another prospective to look at, and i thought about it or a while and i thought well hell I believe in second chances. So i tried talking to my father and it took a long time for me to get comfortable with him. But after about a year i got comfortable to explain to him how I felt and it went well at first but by the end of it, he told me how i felt was wrong because of this and that. One promise my father made to me for many years was if I went to college he would pay for it. I started cosmetology school in august of 2019 and when i was in school I was almost kicked out due to my father not paying the bill. So that caused us to argue more  and eventually i had to apply for student loans to pay for school so i could stay in and finish. By the time it was time for me to graduate there was a balance that had to be paid before I could get my diploma. After he had promised me to pay for chocolate i asked if he could just pay the small balance (compared to the starting price)there was. he told me he would have it paid by April, needless to say he doesn’t end up paying it and i have to pay it. So its starts a big war between us and i stuck up for myself for one in my life towards him and he was so angry he used my mother against me, and told me she wouldn’t be proud of me. And completely cut him out of my life. it’s been a couple of months and it’s really had an impact on my life and I can’t decide if i made the right choice. It’s really taken a tole on my mental heath and its starting to affect my relationship. My biggest fear is being abandoned and my only parent has done that to me. \n\nI guess what I’m asking is how do i get over the feelings i have to better my mental health and have a healthier relationship with my boyfriend. \n\nI’m sorry this was so long, but if you have any advise for me please leave it down below. Thank you in advance!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/npho7f/i_have_a_bad_habit_of_thinking_negatively_and/", "title": "I have a bad habit of thinking negatively and want to change that.. any advice?", "social_network": "reddit", "user": "Babycakes3003", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1622508142, "permalink": "/r/DecidingToBeBetter/comments/npho7f/i_have_a_bad_habit_of_thinking_negatively_and/", "nsfw": false, "first_save": 1635435294.893234, "replies_charged": false}