{"id": "t5_2tand_t3_qgq21p", "request": ["dad7176f-3c72-4511-aa4c-f36221d5b3c7", "c67213dc-0eed-4cac-a781-9bc082742908"], "text": "My (20f) boyfriend (22m) is a social butterfly. Very easy to like and charming. He’s a 6’7, hot, smart, funny and kind man. \nAnother great thing about him is that he’s always had girl friend groups, which I think is a really good thing. I really do get along and love his girl besties, most of them are lesbians anyways, but when it comes to girls I’m unfamiliar with, I’m immediately jealous. I’ll assume they have history or that the girl wants to fuck my boyfriend. Obviously, he’s very liked by women and men alike as he’s been friends with both all his life, but I’m just always assuming the women are on a mission to get him in bed. \nWeirdly, I don’t feel the same jealousy towards men (we are both bisexuals) and even encourage him to let me know if he wanted to take steps towards experimenting with men. \n\nI really do trust my boyfriend not to cheat on me, but I how do I \"trust\" him not to crush or fall for another girl who’d he’d leave me for, or that would make him regret staying with me.... That’s my worst fear. \nI’m also envious of him, for not being jealous/envious like me. I resent him because I wish I had his confidence and security. I also resent him because he’s never had his boundaries disrespected like I have (previous partner) and so he’s never had a reason to become hyper vigilant. I hate my jealousy so much, it makes me feel weak and immature. \n\nI just don’t believe that I am enough. That there isn’t someone objectively better for him than me out there and that the person isn’t coming to steal my boyfriend. \nI just don’t believe I’m \"it\". \n\nI want to change for the better. Even if he isn’t the man I spend the rest of my life with, I’m tired of not feeling like I’m \"it\". I’m tired of wanting to be other people. I feel like I deserve to think I’m the greatest person I know, as narcissistic as that sounds. I want to work on self love and acceptance. \nI don’t know how. \nAll the advice I’ve read sounds like culty coachy bullshit.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/qgq21p/im_tired_of_being_an_envious_and_jealous_person/", "title": "I’m tired of being an envious and jealous person, especially in my relationship.", "social_network": "reddit", "user": "bipbopbip666", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 33, "down_vote": 0, "creation": 1635315289, "permalink": "/r/DecidingToBeBetter/comments/qgq21p/im_tired_of_being_an_envious_and_jealous_person/", "nsfw": false, "first_save": 1635435814.3381321, "replies_charged": false}