{"id": "t5_2tand_t3_nzmzyr", "request": ["b69cf201-6737-4217-b486-9096135546b8"], "text": "I've wanted to lose weight purely for shallow aesthetic reasons, and I ain't gonna pretend that I wanted to lose weight for anything else. I followed cico (specifically counting calories, eating in a calorie deficit, and not restricting myself on any junk good) to lose 12 lbs and my goal was to lose 20 lbs (and still lowkey is). However, I found that as I lost more weight it was harder to keep losing because it became a lot harder for me to stick to my calorie goal all of the sudden, I was a lot hungrier than I was before eating the same amount of calories. Maybe it's because I have less fat to burn, maybe eating a lot of junk isn't doing it for me anymore, idk.\n\nAnyhow, I went to the dentist and since I got 3 cavities I decided to stop eating sugary food until I set an appointment to get fillings. And I unintentionally found out, when I don't eat so much sugary junk food and when I eat nutritious food instead I have more energy, I sleep better, and I generally just feel better (shocking ikr). I didn't even know that when i was eating so much crap I was feeling subpar because of it. And when I ate sugary crap 2 days in a row after my break I felt like shit again.\n\nSo now I've decided to seriously cut back on my sugar intake (I'll give myself one cheat day a week), I'm going to avoid foods that aren't nutritious, and I'm going to avoid added sugars as much as I possibly can so I can just generally feel good. It's become more than weight loss for me, but about just being healthy and eating to nourish myself  for a better quality of life.\n\nTl;dr: I'm going to stop eating junk food (except for one cheat day a week) so I can be healthier and feel better, not to lose weight.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/nzmzyr/gonna_eat_healthier_not_to_lose_weight_but_to/", "title": "Gonna eat healthier not to lose weight but to feel better.", "social_network": "reddit", "user": "Triangle-Buddy", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1109, "down_vote": 0, "creation": 1623677922, "permalink": "/r/DecidingToBeBetter/comments/nzmzyr/gonna_eat_healthier_not_to_lose_weight_but_to/", "nsfw": false, "first_save": 1635436444.7355669, "replies_charged": false}