{"id": "t5_2tand_t3_kml892", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "\nShower. Not a bath, a shower. Use water as hot or cold as you like. You don’t even need to wash. Just get in under the water and let it run over you for a while. Sit on the floor if you gotta.\n\nMoisturize everything. Use whatever lotion you like. Unscented? Dollar store lotion? Fancy 48 hour lotion that makes you smell like a field of wildflowers? Use whatever you want, and use it all over your entire dermis. \n\nPut on clean, comfortable clothes. \n\nPut on your favorite underwear. Cute black lacy panties? Those ridiculous boxers you bought last christmas with candy cane hearts on the butt? Put them on.\n\nDrink cold water. Use ice. If you want, add some mint or lemon for an extra boost. I always use lemon. \n\nClean something. Doesn’t have to be anything big. Organize one drawer of a desk. Wash five dirty dishes. Do a load of laundry. Scrub the bathroom sink. \n\nBlast music. Listen to something upbeat and dancey and loud, something that’s got lots of energy. Sing to it, dance to it, even if you suck at both.\n\nMake food. Don’t just grab a granola bar to munch. Take the time and make food. Even if it’s ramen. Add something special to it, like a soft boiled egg or some veggies. Prepare food, it tastes way better, and you’ll feel like you accomplished something. \n\nMake something. Write a short story or a poem, draw a picture, color a picture, fold origami, crochet or knit, sculpt something out of clay, anything artistic. Even if you don’t think you’re good at it. Create. \n\nGo outside. Take a walk. Sit in the grass. Look at the clouds. Smell flowers. Put your hands in the dirt and feel the soil against your skin.\n\nCall someone. Call a loved one, a friend, a family member, call a chat service if you have no one else to call. Talk to a stranger on the street. Have a conversation and listen to someone’s voice. If you can’t bring yourself to call, text or email or whatever, just have some social interaction with another person. Even if you don’t say much, listen to them. It helps. \n\nCuddle your pets if you have them/can cuddle them. Take pictures of them. Talk to them. Tell them how you feel, about your favorite movie, a new game coming out, anything. \n\nMay seem small or silly to some, but this list keeps people alive.  \n\nYour absolute best won’t ever be good enough for the wrong people. At your worst, you’ll still be worth it to the right ones. Remember that. Keep holding on. In case nobody has told you today I love you and you are worth your weight and them some in gold so be kind to yourself and most of all keep pushing on!!!!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/kml892/things_to_do_during_a_depressive_state/", "title": "Things to do during a DEPRESSIVE state", "social_network": "reddit", "user": "jnpln", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 123, "down_vote": 0, "creation": 1609270724, "permalink": "/r/DecidingToBeBetter/comments/kml892/things_to_do_during_a_depressive_state/", "nsfw": false, "first_save": 1635438247.266289, "replies_charged": false}