{"id": "t5_2tand_t3_n6xpgq", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "I have neglected my friends, I didn't even care to go to my best friends bachelor party, I couldn't make a speech because I'm so anxious to do it. Ive never up until recently cared about peoples birthdays, I have just been trying to give something last minute, often pathetic gifts. I have poisoned family gatherings with my bad mood.I have lost friends because I don't call them enough. I don't know when their birthdays are. I most often didn't say happy birthday to any of them. I don't have any close friends right now. I have some lose ends im trying to repair.\n\nI think I grow up sensitive. I was low key bullied. I didn't go to parties as an young adult. I was scared of people. Scared of everything. I thought the world was cruel, and the people in it. I have been so filled with cynicism and bitterness. Even thought I have been relatively young. I was the outsider that no one understood. I was a misunderstood genius. Above and over the rest. The reality I didn't amount to anything. But I was this great potential. I often thought I would be a famous musician. I dreamed of being adored, recognizing my genius. In reality I didn't even create anything. Hardly wrote or had any kind of creative output.\n\nIf im sick I have no one to call except my parents. They are good people. But I find myself acting resentful to them, except when im trouble. Then I come crawling to them asking for help. I don't consider myself a good person. I have not lived a good life. I have hurt people. Some directly. Most people I have not hurt in an epic way, just more like a passive indifference way. I felt scared, ashamed to write anything sincere, to show any kind of dependency. Afraid to death of looking foolish. I have had some social anxiety. During oral presentations in school I was so nervous the teacher would sometimes talk to me and ask me if everything was okay. When I was even younger other students would laugh at me and make fun of my shaking hands.\n\nIm afraid of my own wedding, how pathetic it would be. Or my own funeral. I feel a strong sense of regret. I need to do things different, and it starts with other people. I still struggle with this anxiety and depression. When someone is very outspoken or happy confident I judge them. My bitter heart can't stand them. Who do they think they are. Please God soften my heart. Let me see the good things in other people. I don't want to be selfish. I want real connection. I don't want to be ashamed and scared of people.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n6xpgq/i28m_have_lived_selfishly_consumed_by_my_own/", "title": "I[28M] have lived selfishly, consumed by my own misery, unable to look beyond myself", "social_network": "reddit", "user": "Jay-Kay44", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 10, "down_vote": 0, "creation": 1620391713, "permalink": "/r/DecidingToBeBetter/comments/n6xpgq/i28m_have_lived_selfishly_consumed_by_my_own/", "nsfw": false, "first_save": 1635436857.5493996, "replies_charged": false}