{"id": "t5_2tand_t3_lobu4y", "request": ["ff741fcc-6aaf-4026-98e1-e39d57c6eaa8"], "text": "Hey everybody,\n\nso I was the happiest guy, you know, people were inviting me to their parties, because I was the guy who would lighten up the place. But I also had a clear way (I am working for environmental nonprofit and in culture) and I was finally on the right track. But anyway I partied quite a lot and one time I go to this party and have a lot of cocaine and boom. Next day my life is changed. That was January 2020. I got into a really weird state, developed some kind of agarophobia and had constant anxiety, like imagine having the stress before an exam but having it 24/7. And sometimes panic attacks came. One year passed. I get quite a bit better, no more 24/7 anxiety, just a weird feeling but with a hope that in one more year I'll be back to normal. Okay, so it's January 2021. After a long time of not seeing friends due to corona, we had a little party, because one of my friends had a baby. Somebody brought cocaine there. I was drunk, I was stupid and had a little. Boom I am where I was one year ago. I mean, it's a bit better, because now I have the experience but stiiiiiill I am extremely pissed at myself, I want to travel back in time and slap myself in the face. Now I also developed insomnia, I get usually about 4 hours of sleep and the wake up with my heart pounding.\n\n&#x200B;\n\nUsually I could cope with things somehow. I thought to myself the classic - this experience will teach you something. But this? Okay, I am not doing drugs again ever in my life, but that's it. It's just a constant shitty feeling and I want to get rid of it, want to get better and want to be able to say at the end of the day - okay, this was a nice day.\n\n&#x200B;\n\nSpending time with my girlfriend helps a lot, I am also adopting a dog, so hopefully that helps. I am trying to exercise, run, accept the situation but still, the feeling of constant anxiety is so overwhelming that it's just hard. I will be contacting a mental health professional next week. Do you have any thoughts on what you think can help me? I reaaaaaaaaally want to get better and just feel normal again.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/lobu4y/want_to_get_rid_of_constant_anxiety/", "title": "want to get rid of constant anxiety", "social_network": "reddit", "user": "dancingsundancekid", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1613841774, "permalink": "/r/DecidingToBeBetter/comments/lobu4y/want_to_get_rid_of_constant_anxiety/", "nsfw": false, "first_save": 1635438062.369658, "replies_charged": false}