{"id": "t5_2tand_t3_n09oee", "request": ["114bcb12-fed9-47f6-9822-139ba09eebbf"], "text": "I’ve been wanting to write one of these for 2 years but was too scared to bring myself to write one because I didn’t want to admit that there was a problem. My girlfriend and I have a very long history, almost 5 years in fact. We met when I was 17 and she was 15, I had been in relationships before but this felt very different, It felt very real and I was scared of it.\n\nI’ll never forgive myself for the lack of respect I gave her that year, I really wish that I could go back in time because she didn’t deserve to be treated the way I treated her. She was so loving, kind, supportive, and understanding to my situation, and she didn’t deserve to be treated the way I treated her.\n\nI cleaned up my act, embraced my fear of love and we had an amazing next year. I put all my effort into changing from a person who was very hurt and scared by love to someone that embraced it to the fullest. I became unbelievably supportive, understanding, and loving, I finally felt like myself again but then she developed a crush on one of my brother's friends.\n\nThis really hurt me but I felt as if I deserved it from how I treated her. I really wanted to be a supportive boyfriend through her crush because she said to me that she wanted to get over it so she could be with me. I was accepting of her crush, shit happens, it’s okay to be attracted to other people, we’re human beings, you just have to be aware and you can’t act upon it. She said to me, the only way she could get over it was for me to set up “hangouts” where I would manufacture an environment so they could see each other and she could hang out with him “as a friend”.\n\nThat never really sat well with me, I tried to explain to her that if you have an attraction to someone else in while in a relationship you have to pull back before you can be platonic with that person. I never felt as if she listened to that, she used the excuse “I’m just an affectionate friend”. This is when things really started to go wrong.\n\nShe has a lot of childhood trauma, her family treats her disgustingly and really terrible things happened to her at the start of that year, I really think she used her “crush” as a form of escapism to get her through her final year of high school.\n\nIt took me a long time to admit this but I think I was emotionally abused by her. I was at a point in my life where I was healing from very negative relationships and was struggling with my self-worth as people would constantly view me as weak and I wanted to be more than that. I was searching for new friends and at times I think she took advantage of that. She would make me feel really bad if I didn’t organise hangouts for her with that guy, she would say things like “You’re never going to make friends if you don’t put yourself out there” when I really didn’t want to have endured observing my girlfriend hang out with a guy she liked. I was too scared to confront her about how it made me feel because she would make me feel guilty, it would feel like if I said something about it that I’d be making a scene and that she would never speak to me again.\n\nI did this for a year, I became numb to the situation, and as the year progressed it felt like she just became crueler. I just felt disregarded, voiceless, invisible. She was at an age where alcohol was really accessible for the first time, so she goes to parties abused substances and I couldn’t tell her to stop because she’d get mad at me.\n\nI was so mad at my friend too because knowing that we were in a relationship and how much I loved her, he would still flirt with her now, even more, when he found out she had a crush on him but he said that “he wasn’t interested”.\n\nTowards the end of that year, I could sense that she was going to have a catalyst moment, where she would change and realise what she was doing. She had that moment on a vacation with me and my brother's friends. People could finally see the way she was treating me on that trip, I finally felt valid after a year of not being but one of the guys made up an accusation (that was later proven to be false) that she tried to sleep with him.\n\nThis deeply upset me, I didn’t want to believe it, I didn’t believe it. They all turned on her and I couldn’t help but think that this would be the thing that made her change. It didn’t.\n\nCoronavirus happened and for an entire year she grieved the end of her friendship with the guy she liked to me, It would really hurt because I hated him, I hated hearing that she still cared about him, because I knew he treated her feelings as if she was a toy. She really wanted to be his friend, and even though I couldn’t bear the thought I reassured her that one day he’d forgive her and that they’d be friends.\n\nThose guys treated her disgustingly, they gaslit her, pretended to have feelings for her and when she ultimately abused substance and got physically hurt to take the blame off of them for egging her on they shifted all the attention on her.\n\nDuring me consoling her she became even angrier towards me, resentful, I endured it because I knew she was hurting, I didn’t take it to heart. I just wanted her happiness. I really wanted her to make new friends help show her that the guy she had a crush on is a terrible person and that she could do so much better.\n\nWhen coronavirus became less existent she was able to go to university and make new friends. I was excited for her, it felt like things were changing, but she became even angrier towards me. She met two guys and wasn’t able to be in their classes. I did everything in my power to get her into that class with them and she would take out all her anger on me when things went wrong. I didn’t take it to heart, she was hurting.\n\nI finally got her in that class and I couldn’t help but be a bit worried because of what happened with my brother's friend, I was silent, I didn’t want to make her feel guilty because I wanted her to have friends. I noticed her becoming very distant to me and I knew it was because of one of the new guys she made friends with. I confronted her about it and she said that it was fucked up that I said that when she met her new friends she became distant, she made me feel really guilty. I would listen to things she says about one of them, things he was interested in and then I’d watch her do them to herself, like dying her hair darker because he was attracted to darker-haired girls. I didn’t say anything because I wanted to trust that she was making friends.\n\nA few days she broke up with me because she said that It wasn’t about me because I was “perfect”, but I had become a trigger to the situation with my brother's friend and she felt like she couldn’t get over the unresolved trauma while dating me. She said it would make her act out because she resented me and she knew she was treating me badly and that I didn’t deserve that I absolutely respected and understood her decision because I just wanted her to be happy and heal. But the other day she tells me she has “feelings” for one of her friends that she just met.\n\nShe knows nothing about this guy, and I have enough self-worth to know that he could never give her the respect, understanding, and patience that I gave her and she confirmed that she knows that. She said she really wants to view him as just a friend and will try to but I’m terrified. They’re hanging out tomorrow and I’m scared she won’t distance herself a bit from him, I’m scared somethings going to happen. I feel so voiceless, Invisible, and betrayed. I love this person so much, she is such a beautiful person and I want her to heal.\n\nI’m scared that she’ll never be happy in life because rather than getting professional help she thinks that the buzz of meeting new people will make her problems go away. I love her but I don’t know what to do, I just wish she would come to me tomorrow after seeing him and say that I was right.\n\n I am struggling to process if I’m allowed to feel sad for being emotionally abused when I had been previously a bad person in our relationship and hurt trust.\n\nWhen I was 17, I met my now 3rd ex-girlfriend, for that entire year my 2nd ex-girlfriend lead me on and played with my feelings. I feel terrible because I was romantically involved with both girls and I cannot forgive myself for being stupid, dumb, young and hurting my 3rd ex-girlfriend.\n\nWhen she was sexually assaulted and her father had a stroke I wasn’t there for her as much as I would have liked because I was over occupied by the excitement of my career. I feel fucking terrible about this too. \n\nShe then developed feelings for my brothers friend, and proceeded to emotionally abuse me by making me create environments where they could see each other so she could get over it. She would say that she was doing it for the benefit of our relationship and because she wanted to get over it to be with me. But she would also cry in front of me about the fact that he would never like her.\n\nI did everything I could to help and prove to her that I wasn’t who I used to be, and I did. I changed into a better person that was in touch with myself.\n\nWhile she liked my brother friend she would put me down, yell at me, lash out, it at times was unbearable. I felt voiceless so I reached out to her friend as a cry for help. Conversation between us more like venting but unfortunately turned resentful because I hated how she was treating me and how my ex-girlfriends family was treating her.\n\nThe next year my girlfriend found out I was venting to her friend and was extremely mad at me, asking why I couldn’t have just broken up with her and how I was cunt for saying what I did. I feel terrible because of what I said but I needed someone to talk to because she was gaslighting me and I wasn’t allowed to say I was upset by the situation because it would make her feel guilty.\n\nThe night that she fell and hit her head I was emotionally exhausted and vented to my brothers friends about how she treated me. It took me a few times to fully be honest about everything I said that night to her because I was scared.\n\nShe then went on that entire year to talk about how she missed and wanted to be friends with the person she liked. She would argue with me almost every night, sometimes it felt like she would look for arguments because she resented me. \n\nTowards the end of our relationship she locked me outside of her house and yelled at me because I promised her that I would help her get into a certain class which didn’t work that day.\n\nShe started to hit me and self-harm in front of me.\n\nI’m not saying this to compete with who did what and what was worse, I just feel like because I hurt her that I’m not allowed to be upset that she hurt me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/n09oee/am_i_a_good_person_do_i_deserve_to_be_upset/", "title": "Am I a good person? Do I deserve to be upset?", "social_network": "reddit", "user": "throwawaySSSCCCMRT", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1619596053, "permalink": "/r/DecidingToBeBetter/comments/n09oee/am_i_a_good_person_do_i_deserve_to_be_upset/", "nsfw": false, "first_save": 1635435179.7812438, "replies_charged": false}