{"id": "t5_2tand_t3_g8e5uq", "request": ["feda50cc-891e-47e3-8043-7a171b4cc260"], "text": "I'm in my head a lot. This realization came to me recently. It makes me calm. So I thought I'd share.\n\nWe're flawed. Everybody is. We do well sometimes, we mess up sometimes. We might feel so guilty about what we did, and try to punish ourselves for it because we think of ourselves as a failure, a defect. How could I let it get so bad? No one worthy of admiration would do this. Hence, I am inferior to others and deserve less. \n\nEveryday is a battle. I'm so tired. I just want to get it done once and for all. One sprint. Then I can relax. But hey, you mess up again. It's suffering. \n\nBut, after years and years, I've made peace with the fact that nothing stays the same. I knew of it. Of the constant change and struggling. But I feel like this is the first time I really get it. Yes, it's an ongoing, repetitive process. Every single day, there are things that require effort. Some days it's easy. Many days it's hard. But it's normal. This is normal. And we are all normal. Nothing is wrong with the way life works. Nothing is wrong with us. It is the way it is. Because time passes, things keep moving forward, so do we. And we can move along the natural course of things. It's only normal. \n\nThe good news is, It's a privilege to have a chance to work on something. Because without putting in work, there won't be any real joy. So we're lucky, really. This is life. There's limited time for each of us. We're here. We're changing along with time. Drops of happiness/contentment here and there are all we get, mixed with some mandatory hardship. There can't be one without the other. Then that's it. Then we're truly nothing, and we don't have to change with time anymore.  \n\nSo, feel lucky, or just feel normal, every time you work on something, be it taxes, paper due tomorrow, tough conversations, or simply getting out of bed. We get to do it because we're alive. It's normal we have to do it. It's normal we sometimes fail. We're normal.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/g8e5uq/were_normal/", "title": "We're normal.", "social_network": "reddit", "user": "bnanacupcake", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 49, "down_vote": 0, "creation": 1587906912, "permalink": "/r/DecidingToBeBetter/comments/g8e5uq/were_normal/", "nsfw": false, "first_save": 1635437854.750894, "replies_charged": false}