{"id": "t5_2tand_t3_d7hjhi", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "When I was 21 I was diagnosed with PCOS. I gained an astronomical amount of weight in a short period of time. I have so many symptoms and generally just felt so disgusting all the time I didn’t see the point of even trying. So I didn’t. For years. I got married and I was unhappy. I was working at a job I hated. I was living in a place that I couldn’t stand. \n\nSo I decided to leave. I left my husband and moved back home to live with some friends. I slept on their couch for a year before we decided to move to Washington. I got my own room again, left my job at Starbucks for an opportunity that paid better, and started to repair the damage I’d done to my life. Then I became complacent again. I was smoking more cigarettes than ever since my commute had gone from 10 minutes to an hour. I ate like garbage. I was at my heaviest and my anxiety and depression were at an all time high. I had so many health issues that I couldn’t even name them all. Most of them stemmed from my PCOS but the others were my fault. \n\n•I finally made a doctors appointment. I got on medication to help me quit smoking, since I’m not a gum chewer and I move around so much at work that the patches don’t stay on my body. As of right now, I haven’t had a cigarette in two days. I would go through a pack in a day and a half before this medicine. \n\n•I started going to the gym a few weeks ago and I’ve stayed consistent with it every day. I began meal prepping. The scale only says I’ve lost 2lbs, but I’ve gone down two pants sizes and most of my shirts fit better than they ever have. \n\n•I bought a Fitbit and I log every step and calorie and my sleep schedule to hold myself accountable. \n\n•I’ve started doing yoga and meditating. I talk to myself positively. I still slip up and say really mean things about myself and my body. It’s a work in progress. \n\n•I finally filed for divorce after leaving 2 years ago. \n\nChanging my mindset wasn’t easy.  It’s only been a few weeks and it’s been mentally and emotionally challenging. I just keep reminding myself how much better I feel now than I did a month ago. If I feel this good now, imagine how I’ll feel in another month. \n\nI decided I wanted to be better and I’m committed to staying that way. I’m grateful for this sub.\n\nEdit: you guys are so amazing and supportive. My heart is so full from your responses. Thank you so much!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/d7hjhi/a_couple_of_weeks_ago_i_woke_up_and_i_decided_i/", "title": "A couple of weeks ago I woke up and I decided I was tired of my own bullshit", "social_network": "reddit", "user": "deadbeatromance", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 624, "down_vote": 0, "creation": 1569105247, "permalink": "/r/DecidingToBeBetter/comments/d7hjhi/a_couple_of_weeks_ago_i_woke_up_and_i_decided_i/", "nsfw": false, "first_save": 1635436042.324009, "replies_charged": false}