{"id": "t5_2tand_t3_m05jux", "request": ["67305ca4-ce30-4c37-9a02-05d70fe958db"], "text": "When I was 17 my mom died suddenly of a massive heart attack. She was a 3rd grade teacher who LOVED helping children. She once said “if money were not needed, I’d teach for free”. That’s how much she loved helping kids learn. \n \nWhen my mom died I struggled so hard with my relationship with God. People kept telling me “this is Gods plan” over and over.. and I started to think “okay so it’s Gods fault I lost the most important person in my life”.  WRONG. I wrestled with this for years. \n\n\nIf someone hit her car I could blame that person, if an error was made in surgery I could blame the surgeon, etc. \nSo when people said “well it’s God’s plan” they gave me someone to BLAME. I have stopped people mid sentence before and said no.. don’t say what you are going to because if you do all it does is make me mad at God and I need him to get through this. \nI was questionable with my faith for a long time.. but I realized that I had to believe in God and heaven if I ever want to see my mom again. \n\nI told friend this past week who also just suddenly lost her mom, that while God is at work, so is the devil and he will do anything to make you question your beliefs...To tune out the people who give you God on a platter as the person to blame, because in reality they’re TRYING to help. Trying to comfort.. but it isn’t. So I won’t ever say that to anyone grieving. I clung to God being the person who took my mom from me for too long to do that to anyone else. \n\nFreak things happen and I truly truly believe it has nothing to do with God. He gave us free will. So when we die, his job is to just let us into heaven or we go to hell. \nI don’t think he points and says “that person- they’ll die today” he doesn’t do that. \n\nThis has been on my mind for so long and it felt nice to get it written out.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/m05jux/keeping_faith_after_losing_a_loved_one/", "title": "Keeping Faith after losing a loved one.", "social_network": "reddit", "user": "KalaJuly", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1615169974, "permalink": "/r/DecidingToBeBetter/comments/m05jux/keeping_faith_after_losing_a_loved_one/", "nsfw": false, "first_save": 1635437163.3378258, "replies_charged": false}