{"id": "t5_2tand_t3_i3hcj7", "request": ["8e5fe1ef-2706-4539-b5ef-34d7e826cdff"], "text": "**Is there an endpoint to self-improvement?**\n\nMany people start improving themselves, assuming if they achieve their goals it’ll fix all their insecurities and solve all their problems.\n\n* “If I had more luck with the opposite sex, I’d be happy.”\n* “If I was strong and fit, I’d be happy.”\n* “If I made enough money to pay all my bills and buy any toys I want, I’d be happy.”\n* “If I \\_\\_\\_\\_\\_, I’d be happy.”\n\nThe problem with putting the focus and importance on the goal (and not the journey) is you’re defining an endpoint. You’re saying there’s a certain point you can get to where you’ll be happy and satisfied and won’t need to keep busting your ass with self-improvement.\n\nThe truth is **you should never want to relax and stop improving.** If you’re not improving, you’re atrophying.\n\nIn life, you’re either on an upwards trajectory (towards your goals), or a downwards trajectory (away from your goals). There is no in-between. If you think you’re “treading water” and staying still, you’re really moving away from your goals. Success doesn’t come from staying still.\n\nA concept you’ll often hear from many people is, “I want a partner who loves me for me”, or “I don’t want to have to keep pushing myself, always putting up a front and trying to be strong.” They’re complaining about having to improve themselves and actually make an effort to achieve the things they want to achieve. *“**It seems like a lot of work**…”*\n\nSo what, you want to give up completely, not strive for anything, sit around playing video games, being complacent, just “existing”?\n\n**Existing = sitting around just waiting to die.**\n\nTruth is you should be working on bettering yourself every day anyway; *it should be a core part of who you are.* It’s a core part of being human, and a key piece of the *happiness puzzle*.\n\nThe day you feel like a completed product in one area of your life is the day you move on to the next area that needs handling. If you’re finally able to date people you're into or find a partner, then it’s time to move on and start killing it with money/career. If you finally hit that gym goal you’ve been working on for 5 years, then it’s time to set the next goal. If your business finally makes 100k, then it’s time to work towards 200k.\n\nYou’ll never ever be satisfied with who you are as a person or where you are in life. *You’re not supposed to be.* You should definitely **be happy and proud of your achievements;** but that’s not the same thing as *satisfied.* Satisfied implies there’s no more work to be done, no more improvements to be made, nothing else to get better at. There will *always* be more to improve. You will never be perfect or complete - and that's a GOOD thing.\n\n**Self-improvement is an in-tray that never gets emptied.**\n\nOnce you get a taste for working on goals, pushing yourself, working on your mission, *achieving big things* – you’ll never want to stop. You’ll always want *more*.\n\nAnd that’s a really beautiful thing. You’ll never, ever, ever, ever be bored. You’ll never, ever, ever be directionless. You’ll always know what it is you need to do, and where it is you want to go. You’ll have a sense of confidence & self-knowledge most people could never even dream of. You’ll know who you are, and who you’re going to be in 1 year’s time.\n\n**Eventually you’ll be satisfied with always being a little dissatisfied.**\n\n\\-Andy", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/i3hcj7/selfimprovement_is_a_lifelong_endeavour/", "title": "Self-Improvement is a Lifelong Endeavour", "social_network": "reddit", "user": "KillYourInnerLoser", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 3, "down_vote": 0, "creation": 1596539173, "permalink": "/r/DecidingToBeBetter/comments/i3hcj7/selfimprovement_is_a_lifelong_endeavour/", "nsfw": false, "first_save": 1635436057.618697, "replies_charged": false}