{"id": "t5_2tand_t3_b4jjpx", "request": ["7fde63f7-407d-4821-90f0-161dfc11df39"], "text": " \n\nI see so much noise on the internet about to truly change your life you need to implement habits and routines that are beneficial to the goals you are trying to achieve. As true as this is there is still a hidden agenda behind building everlasting habits. \n\n&#x200B;\n\nI’m probably not on my own when I say this but building habits fucking sucks, same goes for routines. We are stuck in our old ways and when it comes to change we somehow figure out a way to resist these new habits, be it, excuses, procrastination, pure laziness or always somehow reverting back into our old habits.\n\n&#x200B;\n\nThe issue is, changing bad habits is fucking hard work. It's far easier to build new habits that compound over time and spill out into various other areas of our lives than it is to try and change a bad habit. The reasoning behind this is simple, the habits we repeat on a daily basis all start with a cue which leads to a routine habit and finally a reward. Let me break this down so you can see where I'm coming from.\n\n&#x200B;\n\nI’ll use myself as an example I had a major fucking issue with YouTube, watching endless amounts of videos on random shit that didn’t really hold any monetary value to my life, we’ve all been there 2 hours deep into a random video search and you end up watching some crazy cat video or how Pablo Escobar built his empire. The thing is i went on YouTube to actually watch an educational video (Cue) When I ended up watching these random videos and repeated this process that became (Routine) The (Reward) was the cheap dopamine hit that followed when I watched something that grabbed me emotionally, for example when I'm watching a funny video on YouTube.\n\n&#x200B;\n\nSo as you can see first came the cue shortly followed by the routine, and finally the reward for my actions. Repeat this process for about 2 years and voila I built a bad habit. When i say build a compounding habit that can spill over into other aspects of your life bad habits can also do this too. You see repeating my YouTube binge ended up affecting other areas of motivation, procrastination and also attention. It got so fucking bad that when I sat down to work I'd somehow find myself back on YouTube doing the same fucking thing over and over again.\n\n&#x200B;\n\nSo how does a time-wasting sack of shit change this bad habit? You stand at the top of the tallest building and yell “I’m a worthless YouTube whoring idiot… I'm kidding don’t do that you’ll get some weird looks, it's actually a lot more simple than you think. You need to identify the cue, routine and reward you get from certain habits and cultivate a new routine. The cue will always be the same and you’ll get the reward you subconsciously desire.\n\n&#x200B;\n\nMy reward was being emotionally captivated by a YouTube video, basically, it made me laugh or moved me emotionally, after repeating this process countless times I became addicted to emotional joy. I know what you're thinking your a fucking dude man the fuck up. As true as this is we cannot help it when something catches our interest on an emotional level. It’s the zest behind storytelling and it’s all around us. The films we watch, the music we listen to, the marketing campaigns we see, even the books we read. The world is full of various influencers and companies trying to gain our attention through various emotional based stories, even things that make us laugh are playing on emotion. Ever watched a motivational video on YouTube, that shit makes you feel like Thor. Able to take on the world and earn so much money you can reenact the Dan Bilzerian lifestyle. The issue with this is like anything emotions come and go, our emotions are influenced by our environment so at that moment we might feel good but then we revert back to feeling like a worthless piece of shit once the novelty of that funny video wears off.\n\n&#x200B;\n\nTo change your routine you must be consciously aware of your cue and routine, what triggers that bad habit? A smokers cue could be stress, the routine is smoking a cigarette to relieve that stress and the reward is that sweet sweet nicotine.\n\n&#x200B;\n\nWhat is your cue? Why is it that you commit that bad habit daily? What can you differently that builds a new habit but you still get the same reward? This is when you enter the habit building zone and it fucking sucks, to begin with.\n\n&#x200B;\n\nYour mind will be screaming at you to pick up your smartphone when you first wake up in the morning, to smoke that cigarette when your boss stresses you the fuck out, to watch another YouTube video when you should really be working on your dreams. You need to change that routine to something that produces the same reward.\n\n&#x200B;\n\nI managed to pinpoint my reasoning behind watching so many YouTube videos, that was to be emotionally captivated, so when I had the urge to type that dreaded web address into the search bar, I'd catch myself and pour my need for an emotional reaction into my work. Fun Fact this blog post was a result of wanting to watch shit on YouTube.\n\n&#x200B;\n\nTo begin with, your mind will be screaming at you to do that routine that you commit daily but the more you repeat the new habit the more it becomes ingrained within your skull. Research shows that 21-30 days of repetition begins to build a habit. I call bullshit I would recommend more like 50-60 days before it becomes something of an actual habit.\n\n&#x200B;\n\nTo put it simply, humans are designed to have daily habits and routines this becomes like an autopilot mentality within our mind, sometimes we don't even know we are doing the things we are doing so when you commit a bad habit enough times you will eventually proceed to do this on autopilot.\n\n&#x200B;\n\nSo find your cue, fix your routine, embrace the reward and repeat that shit over and over again till you don't have the urge to commit that felony we call a bad habit. Cues are all around us, they happen over and over again on a daily basis the only difference now is that when you are presented with a cue, you know the steps necessary to not fall back into that bad routine/habit.\n\n&#x200B;\n\nIf like me when you first start out and you’re totally fucking screwed, start at the beginning and work your way up from there. If you can't wake up in the morning at a set time, fix that shit first, if you find your morning habits and routine are in check but you can't work for long periods of time then fix that. If you procrastinate like a mother fucker then find out what the cue is and change the routine.\n\n&#x200B;\n\nIt’s a very slow process but if you stick at it over time you begin to see new habits and routines form and eventually you will craft the life you so desire. JUST STICK FUCKING AT IT.\n\n&#x200B;\n\nOne final note before you all runaway and start trying to build new habits, don’t try to change multiple bad habits at once, pick the one you want to change the most and focus on that first. You will fail if you try to tackle more than one. The saying “Jack of all trades, master of none” Focus on one and keep fighting till you slowly start to slip into that new habit, you will notice once that pattern is broken you’ll start to find rewards from your new found routine.   \n\n&#x200B;\n\nTL;dr Why Habits Don't Stick", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/b4jjpx/why_habits_dont_stick/", "title": "Why Habits Don't Stick", "social_network": "reddit", "user": "Dextorian", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 11, "down_vote": 0, "creation": 1553350113, "permalink": "/r/DecidingToBeBetter/comments/b4jjpx/why_habits_dont_stick/", "nsfw": false, "first_save": 1635438080.9863045, "replies_charged": false}