{"id": "t5_2tand_t3_ch6na9", "request": ["9065d046-0977-4ea5-b8e4-e37cd42605ed"], "text": "Whenever I'm reminded of someone whom I feel wronged me, I find it impossible to control my resentment and anger towards them, and I tend to be destructive about it. I've thrown away gifts, deleted photos and videos etc over the years, and it always makes me feel better in both the short and long term. People, on here and in many other places, often say that such feelings are unhealthy, but why are they? That resentment and anger is often the only time I feel anything, and it usually empowers me. Positivity of any kind irks me and puts me off completely, so much so that I strictly avoid or even come to hate people who feel like that, especially those who are put off by my own behaviour.\n\nIn fact, I'm trying to compare how I felt yesterday when I first started taking meds (oddly relaxed and apparently more pleasant and open according to a coworker, my mother and my therapist) to how I feel now (angry, resentful, feeling like I miss how I felt once but ruthlessly despise the person whom we both mutually cut ties with) and I feel more alive and straight up *better* now. I don't understand why this is the case, but that lack of understanding is something I mostly feel through being angry at the fact that I'm different from other people, or, much more importantly, that others are different from me. When I'm doing this comparison, I see yesterday's self as being blind, weak and empty.\n\nOriginally I wanted to ask this simply out of curiosity as I dislike the idea of the sub, being someone who very heavily prioritizes refusing to change for anyone else's sake, but as I'm now starting to come off that \"angry high\" I'm now more legitimately interested in what I could do to change this. It's not something that I enjoy outside of these angry high moments, and it only serves to fuel my depression and stress me out further. I'm mostly just annoyed that I've lost many good friends in my life through things they blamed on me that I simply couldn't change enough for their liking (though in many of these cases, while the breaking point was caused by me, the underlying reason often had to do with them, like trying so desperately to avoid any sort of negativity and competition that they cut out anything of the sort in their life), and I have struggled to replace them since.\n\nI've recently been diagnosed with depression and anger issues and I'm one psychiatric session away from an ADHD diagnosis (didn't have enough time in those 40 minutes and the medication clashes with my current medication), if that helps. This is the second day of me taking medication for the first two (trazodone and gabapentin, along with cinolazepam for sleeping better and avoiding night terrors), and today I feel like the medication has, if anything, had the opposite effect.\n\nEdit: One major thing I struggle with is empathy. I can easily predict how others feel, but it's impossible for me to put myself in other people's shoes or care about them in any way other than focusing entirely on myself. Learning how to have more empathy as someone with ADHD probably deserves its own question, thinking on it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ch6na9/how_do_you_avoid_seeing_things_like_forgiveness/", "title": "How do you avoid seeing things like forgiveness as a form of weakness? How do you reject resentment and anger without immediately feeling lesser?", "social_network": "reddit", "user": "dniwehtotnoituac", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 9, "down_vote": 0, "creation": 1563965587, "permalink": "/r/DecidingToBeBetter/comments/ch6na9/how_do_you_avoid_seeing_things_like_forgiveness/", "nsfw": false, "first_save": 1635437694.3837855, "replies_charged": false}