{"id": "t5_2tand_t3_icc6vg", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "I am entering my senior year of high school. Upon reflection, I’ve realized that I’ve wasted most of the best years of my life.\n\nSince I entered high school, I feel like my life has fallen apart. In my classes, I had none of my friends from middle school. In middle school I had played volleyball, basketball, and was on the track team. However, I convinced myself that I was terrible at all of these and stopped participating in all of these sports. \n\nLuckily, I was able to be academically successful and have been an all A student who only took advanced courses. The thing is, I never tried hard and did the minimum to achieve these grades, and now I regret not pushing myself and continuing on the academically gifted course that I was in during middle school. I know I should be thankful that I performed as well as I did, but I will always wonder if I could have done so much more.\n\nMy routine began to become awful my freshman year and got to the point last school year that I would go to sleep at 3 a.m, wake up at 5:30 a.m, and nap for 3+ hours when I got home from school. During the school day, I fought to stay awake and could hardly think, but I, luckily, maintained my grades. I tried, repeatedly, to fix my schedule, but I always went back to my unhealthy one. Due to my unusual routine, I lacked a social life and would sleep or read a book until midnight, which is when I would finally feel enough motivation from the time crunch to begin my homework.\n\nOver quarantine, I’ve only gotten worse. My negative thoughts towards myself have dramatically increased, I lay in bed all day constantly napping and sleeping 8+ hours at night, and for the first month of quarantine I drank quite a lot every night. I’m gaining weight, and have been feeling terrible about myself because I know something must be wrong.\n\nNow that I’m filling out college applications, I cannot answer the essay prompts very well because there is nothing significant in my life and I’ve done nothing special. I feel like my whole life has been a waste and I know I need to change, but I can never bring myself to do it and I feel like I’m drowning myself and each day my own weight pulls me further under.\n\nBasically, I know it will take time and small steps, but I need to change my whole lifestyle because I cannot continue this way. I’m thinking of waiting a few months until I turn 18 and seeking help from a mental health professional because I don’t want my family to know. However, I, also, want to begin taking steps ASAP to better myself. I’m deciding to be better, but idk how to do it in a way that will be successful in the long term.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/icc6vg/ive_17f_decided_to_be_betterbut_have_no_idea/", "title": "I’ve (17f) decided to be better...but have no idea where to start", "social_network": "reddit", "user": "MelancholicMirror", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 14, "down_vote": 0, "creation": 1597792914, "permalink": "/r/DecidingToBeBetter/comments/icc6vg/ive_17f_decided_to_be_betterbut_have_no_idea/", "nsfw": false, "first_save": 1635436878.2358835, "replies_charged": false}