{"id": "t5_2tand_t3_gj6vjg", "request": ["0614cedd-1e86-4144-9fa0-a24c903bac2b"], "text": "Trigger Warning: Self-harm, suicide\n\nI grew up in a rather competitive environment and being Asian and migrants, my family, and society has always had this standard for me and people in similar situations as me. Getting good grades and getting awards for education was a basic necessity. Or else both your family and the society looks down on you. In my state, there are only 2 mother tongue schools (we had to attend classes every Saturday) so everyone kinda knows each other and rumors or news spread fast. My Mum and I were friends with some of the people in our society but overtime we kinda drifted apart. Most of my mother tongue classmates are very competitive and they can be petty sometimes if someone does better than them. I was not the smartest but I worked hard and got results expected of me which made a few of my classmates bully me for being a teacher's pet or know-it-all, even though most of the teachers gave me a hard time as well. Even now, though some of the mothers of my classmates do make an appearance over time and make comments to make my Mum feel bad about me, I've moved on from being that soft-spoken girl who used to put up with all the bullying and ridiculous remarks from adults. A lot the things these people did and just life itself back when I was younger made it very difficult for me to fight for myself and my life. I wanted to end my life and I almost did in 2012. At the end of high school I begged my parents to not let me go for the class so during uni while some of them still attended classes, I stopped and honestly it was one of the best decisions I made.\n\nThrough uni I continued working hard and got first-class honors and a silver medal, soon after graduation I got to work with a well-known professor and his research lab. It's been 2 years since I started working and I'm grateful for all the opportunities given to me. I'm a happier person, I no longer self-harm (it's been 8 years) and I have many things to fight for. But despite being in a better place and fulfilling my dreams slowly but steadily, no one has told me they are proud of me or that I'm doing well, or I'm enough. I tell myself that and I'm happy I can rely on myself, deep down I do hope for someone in my life to tell me I'm doing well. That I'm enough. Does that make me entitled? Does that make me a greedy or selfish person ?", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/gj6vjg/i_just_want_to_hear_someone_tell_me_that_im_doing/", "title": "I just want to hear someone tell me that I'm doing well or that I'm enough, does that make me entitled or selfish?", "social_network": "reddit", "user": "montalpe", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 2, "down_vote": 0, "creation": 1589401209, "permalink": "/r/DecidingToBeBetter/comments/gj6vjg/i_just_want_to_hear_someone_tell_me_that_im_doing/", "nsfw": false, "first_save": 1635438275.3447273, "replies_charged": false}