{"id": "t5_2tand_t3_ogt2ih", "request": ["0da85390-0cd4-4819-ba1c-07c5e448265a", "828b2e6f-bc58-47e1-8d9d-f9744d8db1b1"], "text": "I embarked on a new career this week as a personal trainer. A dream job that I didn't even know was my dream a few years ago.  \n\nThree years ago I was at my lowest. I had a drinking problem due to traumatic life experience - you literally couldn't write my life. I was in a dark, dark place; barely doing my job and damaging relationships all around me. I was that party girl, I was that mate. I was also a bloody great actress and everyone thought I was great. No one knew I'd cry myself to sleep most nights.\nOne day I just decided to go for a walk, and it felt good. So then I went again the next day, and the next day. Next I went for a run. It gave me a small amount of joy in my miserable life. I then joined a running group, where I met the most amazing and supportive people. Next I was signed up to and completing 10km races. The most amazing part, is that I stopped drinking. I didn't even really notice, I just stopped. I was training early in the morning, so I'd leave nights out early and stick to water. I took on more physical challenges, I learned to swim and ride a bike, and did a triathlon. I was thriving. My diet changed to supplement my new lifestyle. I lost all the drinking buddies, which I'll admit was hurtful, lonely and sad. It was so needed though. I made all these lovely and supportive friends. People who wanted better for me. I looked at my successful career and realised I didn't want to do that anymore. I only did it because I was good at it. So I quit. Got a job as a bartender and enrolled in college. It's 18 months later and armed with my PT certificate and sports management qualification, I started at a gym on Monday. \n\nIt's been a long and tough journey, but it's so worth it. I never thought I'd be here - this healthy and happy. I wanted to share this, as I want to give hope. If you need that change or want to change, just find something that brings you joy. When you find it, don't let go. Pursue it, live it and enjoy it.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/ogt2ih/i_had_to_be_better_it_was_either_that_or_the/", "title": "I HAD to be better. It was either that or the gutter.", "social_network": "reddit", "user": "Full_Cauliflower_277", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 55, "down_vote": 0, "creation": 1625827770, "permalink": "/r/DecidingToBeBetter/comments/ogt2ih/i_had_to_be_better_it_was_either_that_or_the/", "nsfw": false, "first_save": 1635437300.8470132, "replies_charged": false}