{"id": "t5_2tand_t3_j34tn6", "request": ["da3e72ac-2059-4c8f-99c6-52edffdec3d2"], "text": "Me and my fiancée broke up recently. And i thought I missed her so much that I should beg to get her back. I got so hard down on myself that I thought no one will ever love me and like how I look like she does... How could there be? I don’t even like me.\n\nShe’s only shown me how little I mean to her in return. We’re not getting back together. She doesn’t want me. My heart dropped through my stomach and hit the floor before being wedged permanently in my throat. It’s painful to swallow hard truths if your metaphorically suffering from a cartoonish cardiac whiplash.   \n\nIt was a toxic relationship from the get go and all the revisit to the idea of the relationship with her made me realise how unpleasant and abusive she really is and was. Totally un-self aware and mean and tactless. Often about my appearance and weight. Often in front of others and my family, which made it worse. She went on rants about me. Screamed at me. Spat at me. I thought I deserved it all somehow.\n\nSee I’ve never been beautiful. I’ve never been the one to get any looks or have anyone whistle at me or ask me for my number. I don’t go out with friends of an evening and expect to meet anyone, and the only thing I do pull at the end of a night out if the tray of greasy takeaway closer to me while everyone else wanders home.\n\nI feel invisible and yet simultaneously, a red faced caricature, full of sweat and billowing, bulbous folds and chins and made of all the clumsy, unflattering moments everyone winces at. I hate who I am. I can feel how everyone else hates me too.\n\nOver the years my own fucked up childhood got in the way and made my relationship with food and exercise a horrible mess and I started eating and being lazy/hiding out away from people as a coping mechanism. I am now officially obese, I hate it and it makes me horribly depressed and lacking in confidence most days.\n\nBut I think that’s the problem. I’m looking for others to make me feel good and valid. That’s never going to happen. No matter if it was my partner or my friends or my family. \n\nIt’s my fault I don’t like me. I’ve been falling for people who don’t love me for who I am. I’ve been desperately looking for self love eating mountains of junk food until my guts hurt. I’ve not bother counting calories for so long that I’m unaware just how much I attempt to consume in one day (spoiler: waaay too much). It’s a bandage over a broken leg. It’s not helping me.\n\nI need to love me. And loving me isn’t just giving me what I want all the time and rushing to satiate cravings and jumping head first into the takeaways because I feel sad/grumpy/hungry... I can’t just guzzle what I want and expect to be fine! That’s not how it works. Not anymore. I gotta do what I need to do for me. I gotta drink water mostly. I have to get exercise in. I have to start giving a shit and doing the painful and uncomfortable and often deeply unpleasant.\n\nThat’s why people who are beautiful are attractive really, yeah they look good but they also take care of and love themselves. And loving yourself doesn’t always looking like giving in and just eating all the time, that’s making decisions for the long term. I want that for me too.\n\nI want to love myself again. I want to lift weights and get my anger out and listen to metal while I do and not really be sure of what I’m doing. I want to feel strong and lean and beautiful and wear different clothes and surprise myself and surprise everyone else around me. I want to feel healthy and “normal” and gorgeous and happier. I want to meet other people there who care about themselves too and care about each other and have a laugh with them. I want mates who look out for one another and are interested in the world around them and doing more and going on adventures together. \n\nToday I took the first step in loving myself and getting what I want, I joined a gym. I don’t know what I’m going to do when I get there after work and I’m nervous and I’m upset that I don’t know how and I’m the ugliest fattest little thing anyone’s going to see in there today and I’m already cringing... \n\nBut I’m still going to go. Because today I start loving me.", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/j34tn6/today_i_joined_a_gym_and_stopped_pretending_like/", "title": "Today I joined a gym and stopped pretending like I’m okay with being obese and depressed.", "social_network": "reddit", "user": "B--E--A--N", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1441, "down_vote": 0, "creation": 1601541749, "permalink": "/r/DecidingToBeBetter/comments/j34tn6/today_i_joined_a_gym_and_stopped_pretending_like/", "nsfw": false, "first_save": 1635438090.5791252, "replies_charged": false}