{"id": "t5_2tand_t3_mw58a3", "request": ["40ef71ec-5f6c-4f13-92ed-4fa93e69bbbc"], "text": "I do a lot of coffee chats and meet a lot of new people. I try to virtually meet at least 2-3 new people a week.\n\n90% of the conversations come off as business-purpose driven. It’s either to learn about a subject matter area, brainstorm and discuss ideas, or provide insight on a topic. \n\n**The remaining 10% are free-flow chats — these are the conversations I love most.**\n\nObviously, the lack of purpose can make it feel futile or awkward, but with the right steer, you can have great conversations too.\n\n\\---\n\n**Here are some case studies, principles, and anecdotes behind having a great conversation:**\n\nBe present, be curious\n\n>Brandon Stanton is the author, photographer, and content creator behind [**Humans of New York**](https://www.humansofnewyork.com/) **(HONY).** He was named Time Magazine’s “30 Under 30 People Changing the World” and has taken hundreds of portraits of people in more than 20 countries across the world.\n\nI recently listened to [Tim Ferriss’s podcast, where he interviews Brandon Stanton and discusses his journey](https://tim.blog/2018/06/18/brandon-stanton-humans-of-new-york/) on the challenges and roadblocks he encountered.\n\nI’d highly encourage you listen to it if you haven’t already. It’s a great anecdote on facing adversity, battling self-doubt, and following your passion.\n\nI’ve listened to it four times. Start at **66:00** if you’re short on time.\n\nBrandon started off with a goal: **to photograph 10,000 New Yorkers on the street and create a catalog of the city’s inhabitants**. Along the way, he began to interview his subjects in addition to photographing them.\n\nIt took him 7 years to complete this project.\n\n**Today, HONY is a blog, Instagram page, published book, global brand, and much more.**\n\nWhat you’ll immediately notice, is that the stories are real tear-jerkers. These are some of the most emotional and vulnerable stories — featuring people’s deepest, darkest secrets.\n\nThe incredible thing is that Brandon typically learns these stories during his first interaction with them.\n\n**We’re all familiar with the axiom:**\n\n>Empathy rarely extends beyond our line of sight\n\nBrandon has exponentially increased our line of sight through HONY. He’s managed to create empathy, humanize tens of thousands of people across the world, and paint a more accurate picture of humanity.\n\nIt takes an incredible amount of skill and dedication to do what Brandon has accomplished, and through thousands of conversations, Brandon has effectively mastered the art of connecting with strangers. He’s developed the ability to empower people to be comfortable enough to deeply open up, in just 30 minutes.\n\nHow does he do it?\n\nIn Brandon’s own words:\n\n>“How you get to that deep place with a person is… **Absolute presence**.  \nIt’s being 100% there. You’re not thinking in the framework of an interview. You’re not looking at a list of questions. You’re not thinking about your next question. You’re not thinking about how this person fits into your idea of them and what you know about them.  \n**You’re 100% there and you’re 100% listening to them.** And your questions are based on the curiosity of what they’re telling you, and nothing else.”  \n— Brandon Stanton\n\nFor someone to deeply share with you, they have to be extremely comfortable in the presence of a stranger — somebody they’ve just met. They have to feel you’re truly interested, that you know them and care about them.\n\nHow can you apply this?\n\nNext time you’re having a conversation with someone:\n\n* Ditch a comprehensive question list and framework; have initial questions or topics, then let it flow from there.\n* Let natural curiosity drive the conversation. “How” and “Why” questions are always great for digging deeper.\n* Practice empathy. Put yourself in their shoes and **truly** visualize what it’d be like from their perspective.\n* Use [active listening techniques](https://www.verywellmind.com/what-is-active-listening-3024343) to encourage them to keep talking and sharing.\n* **Be fully present in the conversation. All that exists during the moment is: you and them. Nothing else matters.**\n\nYour goal should be to create a safe space for conversation and sharing. Be fully present, and demonstrate genuine curiosity and interest.\n\n\\---\n\nAsk insightful questions\n\nI previously mentioned that it’s **not** always about the questions and it may seem like I’m contradicting myself. To clarify: questions are a tool to begin the conversation and explore deeper conversation topics.\n\nIt’s about the quality of the questions you use to begin with. Ask **insightful questions.**\n\n**Insightful questions are questions that:**\n\n1. Prompt the person to think deeply about something\n2. Are relevant and reflective of the subject at hand\n3. Can ignite a conversation\n\nI consider Tim Ferriss the master of asking questions and I’ve mentioned Tim a couple of times in my writing. I think he deserves a proper introduction:\n\n>Tim Ferris is an author, podcast host, and entrepreneur who focuses on performance, optimization, self-development, and business.  \nHe’s the author of [4-Hour Workweek](https://fourhourworkweek.com/), [Tools of Titans](https://toolsoftitans.com/), and [Tribe of Mentors](https://tribeofmentors.com/) (all my favorite books!).\n\nThe idea behind his podcasts and books is that he interviews the world’s top performers in various disciplines — athletics, business, science, mathematics, and so forth — and picks their brains on routines, habits, and behaviors they use to optimize their life.\n\nHe’s probably interviewed most celebrities and influencers that you’ve heard of.\n\n>[Jamie Foxx talks about how Kanye blew up](https://tim.blog/2015/12/06/jamie-foxx/)  \n[Daniel Ek (Spotify CEO) discusses how to scale a company](https://tim.blog/2020/12/03/daniel-ek/)  \n[Naval Ravikant shares wisdom on general business, life, and happiness](https://tim.blog/2020/10/14/naval/)\n\n**Through hundreds of interviews, he’s mastered the art of asking good, insightful questions. Often, this is the key to extracting wisdom from experts.**\n\n1. Here is the list of 10 insightful questions he asks in interviews:\n2. What is the book (or books) you’ve given most as a gift, and why? Or what are one to three books that have greatly influenced your life?\n3. What purchase of $100 or less has most positively impacted your life in the last six months (or in recent memory)? My readers love specifics like brand and model, where you found it, etc.\n4. How has a failure, or apparent failure, set you up for later success? Do you have a “favorite failure” of yours?\n5. If you could have a gigantic billboard anywhere with anything on it — metaphorically speaking, getting a message out to millions or billions — what would it say and why? It could be a few words or a paragraph. (If helpful, it can be someone else’s quote: Are there any quotes you think of often or live your life by?)\n6. What is one of the best or most worthwhile investments you’ve ever made? (Could be an investment of money, time, energy, etc.)\n7. What is an unusual habit or an absurd thing that you love?  \nIn the last five years, what new belief, behavior, or habit has most improved your life?\n8. What advice would you give to a smart, driven college student about to enter the “real world”? What advice should they ignore?\n9. What are bad recommendations you hear in your profession or area of expertise?\n10. In the last five years, what have you become better at saying no to (distractions, invitations, etc.)? What new realizations and/or approaches helped? Any other tips?\n11. When you feel overwhelmed or unfocused, or have lost your focus temporarily, what do you do? (If helpful: What questions do you ask yourself?)\n\n**What are the common threads between these questions?**\n\n1. They all require deeper thought to answer (can you answer any of these questions immediately?)\n2. They’re all interesting questions that can spark off into a separate, deeper discussion.\n3. They all touch on the themes of growth, decision-making, and learning — which is Tim’s domain.\n\n>**Jumping back to Brandon’s technique, here are the 3 questions he uses to kick off the conversation:**  \nWhat’s your biggest struggle?  \nHow has your life turned out differently than you expected it to?  \nWhat do you feel most guilty about?\n\nBrandon uses these questions as an entry point into the conversation. Often, he’ll start with one of these questions and monitor interest signals from the person to decide which topics to dig deeper into.\n\nTim uses a similar technique. He kicks off with one of his questions, goes deeper into the idea, then brings the interviewee back out, and pivots into the next subject.\n\nHow can you apply this?\n\n1. **Create a ‘question bank’ of your favorite questions to use in different settings** (e.g. interviews, coffee chats, regular conversations) — continuously refine and vet this list.\n2. **Prioritize your questions** — if you could only ask 1 question, which would it be? Some conversations tunnel in one direction so I always ask my most important questions first.\n3. **Use ‘How’ and ‘Why’ questions to understand more deeply.** For any stories that involve change — whether it involves moving countries or changing jobs — I always try to understand the ‘Why’ — what sparked the change? And the ‘How’ — how did they do it?\n4. **Ask open-ended questions to keep it broad.** This allows the person to choose what they’d like to talk about and signals what is most important to them.\n\nTie these principles together:\n\nDo your preparation ahead of time and understand what good, insightful questions are. During the conversation, be fully present and refer to these questions as needed. Remember that pre-meditated questions just serve as a tool to kick off the conversation into something deeper.\n\n\\---\n\nThanks for reading!\n\nI write about similar topics here [https://www.andrew.today/](https://www.andrew.today/)", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/mw58a3/how_to_connect_more_deeply_with_others/", "title": "How to connect more deeply with others", "social_network": "reddit", "user": "mrjones51", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 1, "down_vote": 0, "creation": 1619099580, "permalink": "/r/DecidingToBeBetter/comments/mw58a3/how_to_connect_more_deeply_with_others/", "nsfw": false, "first_save": 1635436877.4176035, "replies_charged": false}