{"id": "t5_2tand_t3_o9w0xl", "request": ["802203c7-ca80-4c23-ad08-f571694cfc55"], "text": "It’s been approximately three years since I got my heart broken. Long story short, I met a girl, we became friends, friendship developed into attraction, I told her I liked her, she told me she liked me back, and a month later I got a text from her saying that she was no longer interested. As you can imagine, the long story is a lot more complicated. I won’t get into all of that. What I will do, however, is explain why things went wrong: \n\n**Lack of courage.** It took me about 7 months to tell her that I liked her. I did not strike while the iron was hot. The ability to be courageous and to go for what we want despite the fear that others will think of us negatively and despite the understanding that there is a possibility that we will get rejected is crucial when it comes to dating and attraction. \n\n**Lack of understanding of male-female dynamics.** This girl was feminine, and I am someone who is masculine at my core. During the 7 months when neither me nor her made a move, I sometimes asked myself “why doesn’t she make a move? Why does it have to be me?” Women will give us hints, but as men, it is our responsibility to be the ones to take the lead and to make the first move. \n\n**Being overcome by infatuation.** As my attraction for her grew stronger, so did my level of infatuation. I started dreaming about her, and I found myself constantly thinking about her. The confident, interesting, and funny guy that she fell for had turned into a nervous wreck who was no longer able to be himself around her. One of the ways to overcome infatuation is to be outcome independent.  \n\nAfter I got my heart broken, I cut all contact with her, and I pretty much haven’t spoken to her since. I understood that the only way to get over her was to grow as a person, to focus on bettering myself and to gain new experiences.  The months following the heart break were difficult; I did a lot of soul searching and spent a lot of time reading about dating and attraction. Over the last three years, I’ve learned great deal about this topic. Here are 12 dating principles for young men. \n\n**1)** **Treat dating as a skill set.** \n\nDating it not an esoteric practice, it’s a skill set. Anybody can become good at it. All it takes is practice. Successfully honing a skill requires consistency. If you want to get better at dating and if you want to gain more experience with women, put yourself in positions to succeed. Go out, join clubs, make friends, talk to people who are in your surroundings, and go on dates. Learn to consistently approach women you find interesting and attractive.  \n\n**2)** **Understand that you are enough.** \n\nA lot of men have the unfortunate mindset that some women are “above” them. This is wrong, and it leads to desperate guys putting women on pedestals. Even the hottest women are human and have problems. No woman is special. There are plenty of fish in the sea. Don’t fall into infatuation. Have some self-respect and don’t treat her differently than you treat other people. Don’t try too hard to entertain her; you are not a clown. Understand that we are all intrinsically equal. Sure, some people might be more attractive than you, but attraction is somewhat subjective. Women are not into looks as much as guys are. With that being said, working on becoming more attractive is a good goal.    \n\n**3)** **Be courageous.** \n\nBe confident and courageous. If you see a girl you find attractive, go up and strike a conversation with her. The key is to be outcome independent. Too many guys approach with the mentality \"I'm going to get her number\" or \"I'm going to ask her out on a date\". That's the wrong way to go about things. Simply go up to another human being, compliment them on something genuine like their outfit, or talk about your surroundings or something, and have a conversation. If there is a vibe, awesome. If not, that's okay too. Once you get to know someone and there is mutual attraction, strike while the iron is hot. Don’t be afraid to escalate sexually, as long as it’s done in a socially calibrated manner. \n\n**4)** **Have a life outside of dating.** \n\nWomen should never be the definite chief aim of your life. As mentioned in my article, “What Is The Meaning Of Life?”, there are far more meaningful and important things to pursue, such as building a legacy, and working on projects that you are passionate about. A lot of men chase women because they are hoping that they will fill a void. A woman should not be solution to your life problems. Self-love should always come first. As the philosopher and writer Ayn Rand once wrote, “To say ‘I love you’ one must first know how to say the ‘I’.” Self-improvement is crucial. Work on becoming more attractive and on becoming a better person. This includes things like getting a nice haircut, wearing well-fitting clothes, and building your ideal body by working out and eating healthy.\n\n**5)** **Be picky.** \n\nAt the end of the day, sex and dating are simply transfers of energy. Sexual energy is valuable, it can even be used for creative pursuits. Don’t give your energy to just anyone. Make sure that you are attracted to this person, that they are truly your type, and that you genuinely like this person. Time is your most valuable resource in life; don’t waste your time on girls who aren’t worth it and who show no promise. \n\n**6)** **Never become resentful.** \n\nNever become resentful of women, of more successful guys, and of the world. You cannot change human nature. If women don’t find you attractive, there is probably a reason. Maybe you need to work on your looks. Maybe there is something about your personality and mindset that is off-putting. Maybe you give off a bad vibe. Instead of becoming resentful, embrace rejection and work to improve yourself. Becoming resentful not only makes your situation worse, but it also serves no purpose. \n\n**7)** **Be a good person.** \n\nMake sure that your intentions are in the right place. Women are sometimes afraid of meeting new guys. Make sure that you are doing everything you can so that she is comfortable throughout every step of the process. If you are unsure about something or get the vibe that she might be uncomfortable, use your words and ask her. Be genuine and in alignment with your values and with all parts of yourself. Do not be manipulate. Furthermore, do not talk about other girls when you’re around her. Nobody likes to hear that. \n\n**8)** **Don’t get overly emotional.** \n\nAs Tyler Durden says in Fight Club, “Let the chips fall where they may.” If things are not working out and she seems to be losing interest, that’s okay; it’s life. You can’t control what happens, you can only control your response. If you get upset, withdraw until you are no longer emotional. Responding in an overly emotional manner won’t help you in any way. Instead, take a step back, clear your head, and respond logically to what life throws at you. It’s okay to be emotional and to show emotion in a healthy manner. However, allowing your emotions to rule you and to control you is unhealthy. \n\n**9)** **Never chase.** \n\nThere is nothing more unattractive than somebody who tries for force attraction. Attraction cannot be negotiated. It’s either there or it isn’t. Reciprocate her efforts and her level of affection and attraction. If it seems like she is losing interest, then take a break. You might realize that she isn’t right for you. Sometimes, distance will show someone how important you are to them. Do not plead or become needy or clingy. Outcome independence is crucial. When going on dates, don’t have expectations. Be mindful of the present moment. Remember that a woman should not be the center of your Universe. \n\n**10)** **Understand that attraction is built in person.** \n\nThere is nothing wrong with texting, but it should primarily be used as a tool to meet up with her in person. Talk about the important stuff when you see her. Experiencing things with her in person is the best way to build attraction. \n\n**11)** **Do not rush things.** \n\nA lot of people rush into different stages of dating and into relationships. Don’t do that. Take things slowly. Do not ignore red flags. Make sure that a girl is a healthy component to your life before moving things forward. Furthermore, when first meeting a girl, do not compliment her on her looks; it’s shallow and she’s probably heard the same compliment a thousand times. Instead, compliment her on the things that she’s genuinely worked hard on and that she’s proud of. \n\n**12)** **Always stay true to yourself.** \n\nI understand that an important aspect of life is to “fake it till you make it”. With that being said, even when you are doing that, you should still maintain a core part yourself. There is nothing more unattractive than somebody who creates a fake personality and acts in a disingenuous way just to attract women. Even if you do succeed, you will have done so at what cost? The cost of your integrity? The cost of your self-respect? The cost of your character? It’s manipulative and unhealthy. Do not use “tricks” to attract her. You want women to be attracted to who you truly are. \n\n**Final thoughts.** \n\nI’m not an expert when it comes to dating and attraction; not even close. This article is simply a collection of my own thoughts and observations. I’m sure that in the years to come, much of my thinking will either change or improve, as is usually the case with the passing of time. With that being said, I hope that some of you found some these ideas helpful. Best of luck!", "url": "https://www.reddit.com/r/DecidingToBeBetter/comments/o9w0xl/12_dating_principles_for_young_men/", "title": "12 Dating Principles For Young Men", "social_network": "reddit", "user": "RossWriter", "subreddit": "DecidingToBeBetter", "subreddit_path": "r/DecidingToBeBetter/", "up_vote": 18, "down_vote": 0, "creation": 1624922705, "permalink": "/r/DecidingToBeBetter/comments/o9w0xl/12_dating_principles_for_young_men/", "nsfw": false, "first_save": 1635437231.2192686, "replies_charged": false}